[
  {
    "title": "Gut bacteria provide key to identifying colorectal cancer from stool samples",
    "url": "https://www.news-medical.net/news/20250825/Gut-bacteria-provide-key-to-identifying-colorectal-cancer-from-stool-samples.aspx",
    "image": "https://www.news-medical.net/image-handler/picture/2016/3/bacteria_-_Sebastian_Kaulitzki_46826fb7971649bfaca04a9b4cef3309-620x480.jpg",
    "tag": "Arts",
    "date": "2025-08-25",
    "description": "Colorectal cancer is the second leading cause of cancer death worldwide. If detected early, it can be efficiently treated, but the cost and discomfort of colonoscopies - the main diagnostic method currently in use - often result in delayed diagnosis.",
    "body": "<div>\r\n            <p>Colorectal cancer is the second leading cause of cancer death worldwide. If detected early, it can be efficiently treated, but the cost and discomfort of colonoscopies - the main diagnostic method currently in use - often result in delayed diagnosis. Using machine learning algorithms, a team from the University of Geneva (UNIGE) identified for the first time all human gut bacteria to a level of detail that makes it possible to understand the physiological importance of the different microbial subgroups. This inventory was then used to detect the presence of colorectal cancer according to the bacteria present in simple stool samples, a non-invasive and low-cost screening tool. The potential applications are vast, ranging from the diagnosis of other cancers to a better understanding of the links between gut microbiota and health. These findings are published in <em>Cell Host &amp; Microbe</em>.</p>\n<p>Colorectal cancer is often diagnosed at an advanced stage when treatment options are limited. This underscores the need for simpler, less invasive diagnostic tools, particularly in the face of a still unexplained rise in cases among young adults. While it has long been known that gut microbiota plays a role in the development of colorectal cancer, translating these findings into clinical practice has proven challenging. This is because different strains of the same bacterial species can have opposite effects, with some promoting the disease and others having no effect.</p>\n<p>\"Instead of relying on the analysis of the various species composing the microbiota, which does not capture all meaningful differences, or of bacterial strains, which vary greatly from one individual to another, we focused on an intermediate level of the microbiota, the subspecies,\" explains Mirko Trajkovski, full professor in the Department of Cell Physiology and Metabolism and in the Diabetes Centre at the UNIGE Faculty of Medicine, who led this research. \"The subspecies resolution is specific and can capture the differences in how bacteria function and contribute to diseases including cancer, while remaining general enough to detect these changes among different groups of individuals, populations, or countries.\"</p>\n<h2>With the help of machine learning</h2>\n<p>The first step was to analyse huge amounts of data. \"As a bioinformatician, the challenge was to come up with an innovative approach for mass data analysis,\" recalls Matija Trickovic, PhD student in the laboratory of Mirko Trajkovski and first author of this study. \"We successfully developed the first comprehensive catalogue of human gut microbiota subspecies, together with a precise and efficient method to use it both for research and in the clinic.\"</p>\n<p>By combining this catalogue with existing clinical data, the scientists developed a model that can predict the presence of colorectal cancer solely based on the bacteria present in stool samples.</p>\n<blockquote>\r\n<p>Although we were confident in our strategy, the results were striking. Our method detected 90% of cancer cases, a result very close to the 94% detection rate achieved by colonoscopies and better than all current non-invasive detection methods.\"</p>\n<p>Matija Trickovic, First Author</p>\r\n</blockquote>\n<div><h3>Related Stories</h3><ul><li><a target=\"_blank\" href=\"https://www.news-medical.net/news/20250818/Advancing-cancer-treatment-with-targeted-microrobotic-swarms.aspx\">Advancing cancer treatment with targeted microrobotic swarms</a></li><li><a target=\"_blank\" href=\"https://www.news-medical.net/news/20250821/Artificial-intelligence-set-to-transform-mental-health-care-for-breast-cancer-patients.aspx\">Artificial intelligence set to transform mental health care for breast cancer patients</a></li><li><a target=\"_blank\" href=\"https://www.news-medical.net/news/20250821/Gut-bacteria-in-mothers-and-newborns-may-shape-infantse28099-risk-of-early-respiratory-infections.aspx\">Gut bacteria in mothers and newborns may shape infants’ risk of early respiratory infections</a></li></ul></div><p>By integrating more clinical data, this model could become even more precise and match the accuracy of colonoscopy. It could become a routine screening tool and facilitate the early detection of colorectal cancer, which would then be confirmed by colonoscopy but only in a selected group of patients.</p>\n<h2>A new world of applications</h2>\n<p>A first clinical trial is being set up in collaboration with the Geneva University Hospitals (HUG) to determine more precisely the cancer stages and the lesions that can be detected. However, the applications go beyond colorectal cancer. By studying the differences between subspecies from the same bacterial species, researchers can now identify the mechanisms of action by which the gut microbiota influences human health. \"The same method could soon be used to develop non-invasive diagnostic tools for a wide range of diseases, all based on a single microbiota analysis,\" concludes Mirko Trajkovski.</p>\r\n<div><p>Source:</p><p>Journal reference:</p><p>Tričković, M., <em>et al</em>. (2025). Subspecies of the human gut microbiota carry implicit information for in-depth microbiome research. <em>Cell Host &amp; Microbe</em>. <a target=\"_blank\" href=\"https://doi.org/10.1016/j.chom.2025.07.015\">doi.org/10.1016/j.chom.2025.07.015</a>.</p></div>\r\n        </div>"
  },
  {
    "title": "Pokemon Go Is Completely Overhauling Its Leveling System In October To Be More Rewarding",
    "url": "https://www.gamespot.com/articles/pokemon-go-is-completely-overhauling-its-leveling-system-in-october-to-be-more-rewarding/1100-6534230/",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1601/16018044/4555892-pokemon-go.jpg",
    "tag": "Arts",
    "date": "2025-08-25",
    "description": "In addition to the level cap being raised, players can also expect to earn rewards more frequently.",
    "body": "<p>\n    <span>GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.</span>\n  </p><article>\n              <section>\n          <div>\n                <p><a target=\"_blank\" href=\"https://www.gamespot.com/games/pokemon-go/\">Pokemon Go</a> developer Niantic has announced some big changes to the mobile game, as starting in October, progression is being completely overhauled. Not only is the level cap being raised substantially from 50 to 80, but players can also expect several other changes geared toward making progression feel more meaningful with new rewards and cosmetics.</p><p>The update will go live on October 15, and existing players will have their levels determined based on their total earned XP to date. <a href=\"http://pokemongo.com/en/post/pgo-leveling-update-announce-2025\" target=\"_blank\">Niantic says</a> no player will go down a level and there'll also be a limited-time update with XP bonuses and a Timed Research event. Here's a breakdown of all the changes:</p><ul><li>Level cap increases from 50 to 80</li><li>Tasks for Level-Up Research for levels 41 to 50 will be removed</li><li>New Level-Up Research tasks will be added to levels 71 to 80</li><li>Players at level 70 and higher will have an increased chance of becoming Lucky Friends with other players</li><li>New rewards will be added to level-up progression, like increased storage capacity for Pokemon, items, and gifts.</li><li>New avatar items can be earned starting at level 25</li></ul><p>Players who experience a jump up in level will receive rewards associated with reaching those levels at that time, and Niantic will share details on these at a later date. Before the update goes live, players can also earn new cosmetics by reaching levels 40 through 50. The items include a Level 50 Jacket and an all-new avatar pose, and these will not be available once the leveling overhaul is implemented. </p><figure><a target=\"_blank\" href=\"https://www.gamespot.com/a/uploads/original/1601/16018044/4555893-poke-go-prizes.jpg\"><img alt=\"You only have until October 14 to get these Pokemon Go prizes.\" src=\"https://www.gamespot.com/a/uploads/original/1601/16018044/4555893-poke-go-prizes.jpg\" srcset=\"https://www.gamespot.com/a/uploads/original/1601/16018044/4555893-poke-go-prizes.jpg 1280w, https://www.gamespot.com/a/uploads/scale_medium/1601/16018044/4555893-poke-go-prizes.jpg 480w\" /></a><figcaption>You only have until October 14 to get these Pokemon Go prizes.</figcaption></figure><p>From now until October 14, several bonuses will be available to help players level up more quickly in Pokemon Go. These include:</p><ul><li>2 × Catch XP from Nice, Great, and Excellent throws</li><li>+3,000 XP from winning raids</li><li>+3,000 XP from winning Max Battles</li></ul><p>Time Research quests that can net up to 7 million additional XP. Additionally, an existing level 47 Level-Up Research task will be changed so it's easier to complete; rather than exploring 25km eight times in a week, the task only asks you to do so twice.</p><p>In case you missed it, the final month of <a target=\"_blank\" href=\"https://www.gamespot.com/articles/pokemon-go-events-raid-bosses-spotlight-hours-community-day/1100-6533384/\">Pokemon Go's Delightful Days season is almost over</a>. The event has seen several debuts this month like Gigantamax Butterfree and Shadow Kyogre, and a few days remain to take part in the Dynamax Chansey raid.</p><div><p><img src=\"https://www.gamespot.com/a/uploads/screen_medium/1179/11799911/4542615-screenshot2025-08-04at9.19.36am.png\" /></p><p><img src=\"https://www.gamespot.com/a/uploads/screen_medium/1179/11799911/4542642-screenshot2025-08-04at10.04.50am.png\" /></p><p><img src=\"https://www.gamespot.com/a/uploads/screen_medium/1179/11799911/4542617-bulbasaur_fra-415x415.jpg\" /></p><p><img src=\"https://www.gamespot.com/a/uploads/screen_medium/1179/11799911/4542619-eevee_fra-415x415.jpg\" /></p><p><img src=\"https://www.gamespot.com/a/uploads/screen_petite/1179/11799911/4542620-jigglypuff_fra-415x415.jpg\" /></p><p><img src=\"https://www.gamespot.com/a/uploads/screen_petite/1179/11799911/4542621-mew_fra-415x415.jpg\" /></p><p><img src=\"https://www.gamespot.com/a/uploads/screen_petite/1179/11799911/4542622-mewtwo_fra-415x415.jpg\" /></p></div>\n                                  </div>\n  <div>\n    <p><i>Got a news tip or want to contact us directly? Email <a target=\"_blank\" href=\"mailto:news@gamespot.com?subject=Hi%20GameSpot!%20I%20have%20a%20news%20tip%20for%20you!\">news@gamespot.com</a></i></p>\n      </div>\n      </section>\n    </article>"
  },
  {
    "title": "Diabetes and back pain: Here's what you don't know about how high blood sugar silently heightens back pain risk",
    "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/diabetes-and-back-pain-heres-what-you-dont-know-about-how-high-blood-sugar-silently-heightens-back-pain-risk/articleshow/123505487.cms",
    "image": "https://static.toiimg.com/thumb/msid-123505512,width-1070,height-580,imgsize-52276,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "tag": "Arts",
    "date": "2025-08-25",
    "description": "Dr. Arun L. Naik warns that diabetes can silently harm the spine, causing microvascular damage and stiffening. High blood sugar accelerates disc degen",
    "body": "<div><div><p><img src=\"https://static.toiimg.com/thumb/msid-123505512,imgsize-52276,width-400,resizemode-4/123505512.jpg\" alt=\"Diabetes and back pain: Here's what you don't know about how high blood sugar silently heightens back pain risk\" /></p></div><p>“Do you have diabetes and back pain? It is not a coincidence,” warns Dr. Arun L. Naik, MCh (Neurosurgery), AIIMS New Delhi. In a recent Instagram post, he explained that your spine could be under a silent attack if you are living with diabetes.</p><p> While back pain is often dismissed as age-related or lifestyle-driven, growing research shows that elevated blood sugar gradually weakens spinal structures, accelerates degeneration, and makes patients more vulnerable to infections. The connection between diabetes and spinal health is far stronger than most realize.<span></span></p><p></p><h2>Microvascular damage<br /></h2><p></p><p><span></span>One of the first casualties of uncontrolled blood sugar is the body’s smallest blood vessels. </p><p>Just as diabetes damages the vessels in the eyes and kidneys, it also impairs circulation to the spine. This microvascular damage restricts the steady flow of nutrients that discs and vertebrae need to stay resilient. Over time, discs weaken and lose their natural cushioning ability, leaving the spine more fragile. <a href=\"https://www.frontiersin.org/journals/endocrinology/articles/10.3389/fendo.2023.1260566/full\" target=\"_blank\">Study</a> published in Frontiers in Endocrinology confirm that poor microcirculation in diabetic patients accelerates disc degeneration and magnifies the risk of chronic pain.</p><div><p><img alt=\"2\" src=\"https://static.toiimg.com/photo/imgsize-23456,msid-123505518,resizemode-4/2.jpg\" /></p></div><p></p><h2>When sugar stiffens the spine<br /></h2><p></p><p><span></span>Another hidden culprit lies in compounds called advanced glycation end-products (AGEs). These form when excess sugar binds to proteins, making tissues harder and less flexible. In the spine, AGEs infiltrate collagen within the discs, turning what should be supple cushions into stiff, brittle structures. Researchers have compared this effect to premature aging of the spine. According to <a href=\"https://resources.healthgrades.com/pro/type-2-diabetes-impact-vertebral-discs-cause-low-back-pain\" target=\"_blank\">report</a> in Healthgrades, discs in diabetics stiffen earlier, leading to reduced flexibility and a greater chance of injury.<span></span></p><p></p><h2>Disc degeneration and nerve inflammation<br /></h2><p></p><div><p><img alt=\"3\" src=\"https://static.toiimg.com/photo/imgsize-23456,msid-123505521,resizemode-4/3.jpg\" /></p></div><p><span></span>As these changes set in, discs begin to wear down faster than normal. For diabetics, this often means earlier disc collapse, narrowing of spaces between vertebrae, and greater pressure on nerve roots. Chronic high blood sugar also provokes inflammation, irritating nerves that run through the spine and radiate into the legs. A large Korean <a href=\"https://www.nature.com/articles/s41598-021-95626-y?\" target=\"_blank\">study</a> published in Scientific Reports showed that patients with Type 2 diabetes were significantly more likely to develop lumbar spine disorders requiring medical or even surgical intervention. </p><p>In other words, diabetes doesn’t just accelerate disc damage—it sets the stage for chronic nerve pain.<span></span></p><p></p><h2>A higher risk of infection<br /></h2><p></p><p><span></span>Diabetes also weakens the immune system, leaving patients prone to infections that can settle deep within the spine. Conditions such as discitis (infection of the spinal disc) or vertebral osteomyelitis are more common among diabetics, often presenting first as back pain that refuses to go away. Unlike ordinary strain or muscle stiffness, these infections progress silently until they become severe.<span></span></p><p></p><h2>Warning signs you shouldn’t ignore and how to prevent the damage<br /></h2><p></p><div><p><img alt=\"4\" src=\"https://static.toiimg.com/photo/imgsize-23456,msid-123505523,resizemode-4/4.jpg\" /></p></div><p><span></span>Recognizing early red flags can make all the difference. Persistent back pain that doesn’t improve with rest, numbness or burning sensations in the legs, and morning stiffness that limits mobility may all indicate spinal involvement.<span></span>A history of diabetes lasting more than five years or frequent infections is another reason to be alert. If left unchecked, what starts as an occasional ache can evolve into irreversible damage.<span></span>The good news is that proactive steps can significantly reduce risk. Keeping blood sugar under tight control (with HbA1c ideally under 6.5) slows down vascular and disc damage. Building core strength supports spinal alignment, while daily walking improves both insulin sensitivity and spinal mobility. Above all, diabetics should never ignore back pain, especially after the age of 50, and should consider routine spine evaluations.</p><p> As Dr. Naik cautions, protecting your spine is just as essential as protecting your heart, kidneys, or eyes—because once damage sets in, recovery is often difficult.<span></span></p></div>"
  },
  {
    "title": "New guideline offers effective options to help Canadians quit smoking",
    "url": "https://www.news-medical.net/news/20250825/New-guideline-offers-effective-options-to-help-Canadians-quit-smoking.aspx",
    "image": "https://www.news-medical.net/image-handler/picture/2014/7/Smoking-620x480.jpg",
    "tag": "Arts",
    "date": "2025-08-25",
    "description": "Tobacco smoking is the number one cause of preventable disease and death in Canada; it is highly addictive and hard to stop.",
    "body": "<div>\r\n            <p>Tobacco smoking is the number one cause of preventable disease and death in Canada; it is highly addictive and hard to stop. Recognizing these challenges, a new guideline from the Canadian Task Force on Preventive Health Care provides a menu of effective options to help people quit smoking, with behavioural and medication options and a natural health product that can be tailored and combined for personal choice. The guideline is published in <em>CMAJ</em> (<em>Canadian Medical Association Journal</em>) <em><a target=\"_blank\" href=\"https://www.cmaj.ca/lookup/doi/10.1503/cmaj.241584\">https://www.cmaj.ca/lookup/doi/10.1503/cmaj.241584</a></em>.</p>\n<blockquote>\n<p>Quitting smoking can be hard, and people may need to try to quit many times with a variety of options like counselling, medication or in combination. We have created a menu of options that work to address tobacco smoking and can be tailored to personal preferences to help people quit.\"</p>\n<p>Dr. Eddy Lang, task force member, emergency physician at the University of Calgary and guideline coauthor</p>\n</blockquote>\n<p>Tobacco smoking increases the risk of cancers such as lung, mouth, throat and bladder cancers; respiratory disease; cardiovascular disease; and more. Tobacco contains more than 7000 chemicals and 70 carcinogens.</p>\n<p>In 2022, 11% of Canadians aged 15 years or older smoked tobacco, and about 75% of those smoked daily. Populations at higher risk of smoking include single, separated, divorced, or widowed people; people who identify as gay or bisexual; First Nations, Inuit or Métis people; people with mental health issues or substance use disorders; and those who work in jobs that do not require specific training or education levels.</p>\n<p>Targeted at clinicians, smoking cessation practitioners, and patients, the guideline includes tools to help people decide which options are best for them, alone or in conversation with a health care provider. It is based on the latest evidence and aligns well with international guidelines.</p>\n<p><strong>What should clinicians do to help patients?</strong></p>\n<ul>\n<li><strong>Know</strong> your patients' smoking status as part of good clinical care</li>\n<li><strong>Encourage</strong> all patients who smoke tobacco to quit with one or more recommended smoking cessation options</li>\n<li><strong>Engage</strong> in shared decision-making to determine the best option(s) based on patient preferences</li>\n</ul>\n<p><strong>What interventions does the guideline recommend?</strong></p>\n<ul>\n<li><strong>Behavioral </strong>\n<ul>\n<li>Primary care advice</li>\n<li>Individual or group counselling by trained cessation counsellor (in person or telephone)</li>\n<li>Text messaging interventions</li>\n<li>Self-help materials</li>\n</ul>\n</li>\n<li><strong>Pharmacotherapy</strong>\n<ul>\n<li>Nicotine replacement therapy (patch, gum, lozenges, inhaler or spray, used alone or together)</li>\n<li>Varenicline</li>\n<li>Bupropion</li>\n<li>Cytisine (a natural health product)</li>\n</ul>\n</li>\n<li><strong>Combined behavioral and pharmacotherapy interventions</strong></li>\n</ul>\n<p>The guideline recommends against <a target=\"_blank\" href=\"https://www.news-medical.net/health/What-is-Acupuncture.aspx\">acupuncture</a>, hypnosis, laser therapy, electric current stimulation to the head, ear acupressure, St. John's Wort, or S-adenosyl-L-methionine (SAMe) for smoking cessation.</p>\n<p>The recommendations do not apply to traditional or ceremonial tobacco use by Indigenous peoples.</p>\n<div><h3>Related Stories</h3><ul><li><a target=\"_blank\" href=\"https://www.news-medical.net/news/20250813/Quitting-smoking-linked-to-better-recovery-from-drug-and-alcohol-addiction.aspx\">Quitting smoking linked to better recovery from drug and alcohol addiction</a></li><li><a target=\"_blank\" href=\"https://www.news-medical.net/news/20250730/Flavor-bans-linked-to-drop-in-e-cigarette-use-but-may-slow-decline-in-smoking.aspx\">Flavor bans linked to drop in e-cigarette use but may slow decline in smoking</a></li><li><a target=\"_blank\" href=\"https://www.news-medical.net/news/20250701/Why-exercise-is-key-for-keeping-slim-after-you-quit-smoking.aspx\">Why exercise is key for keeping slim after you quit smoking</a></li></ul></div><p>The task force engaged members of the public who smoke or had recently quit smoking to help rate potential outcomes such as success in quitting and quality of life. The guideline working group also involved 2 external content experts, a physician-scientist who treats people with tobacco addiction and another physician-scientist with expertise in implementing hospital-based smoking cessation programs. Many organizational interest holders also provided input into the guideline.</p>\n<p><strong>What about e-cigarettes?</strong></p>\n<p>The guideline recommends that most people first use behavioural and pharmacotherapy options known to be effective. Although e-cigarettes may help people quit, their use should be for those who could not quit using other ways or who express a strong preference for e-cigarettes. There are important uncertainties for people to consider, including the lack of approved products with consistent formulations and lack of long-term safety information, and e-cigarettes may not address nicotine addiction.</p>\n<p>\"Using these practical, evidence-based options will help people achieve their goal to quit smoking,\" said task force member Dr. Donna Reynolds, a family physician, specialist in public health and preventive medicine, and guideline vice-chair. \"Clinicians can use the menu of options that we've made available as a patient–clinician discussion tool for shared decision-making with patients to discuss what is best for them. Quitting smoking may be just an intervention away.\"</p>\n<p>Find an infographic, patient–clinician discussion tool, podcast and more on August 25.</p>\n<p>In a related editorial <em><a target=\"_blank\" href=\"https://www.cmaj.ca/lookup/doi/10.1503/cmaj.251171\">https://www.cmaj.ca/lookup/doi/10.1503/cmaj.251171</a></em>, Dr. Matthew Stanbrook, a respirologist at Toronto Western Hospital and deputy editor, <em>CMAJ</em>, writes \"laudably, the guideline authors make a conditional recommendation against electronic cigarettes (e-cigarettes) for smoking cessation for most patients.<em>\" </em></p>\n<p>This new guideline will be helpful in supporting patients to quit tobacco smoking.</p>\n<p>\"Although Canada has succeeded in substantially reducing the prevalence and incidence of smoking over the last half century, more work remains to help people who continue to smoke. Using this new guideline, clinicians will be better equipped to partner with their patients to enable them to free themselves from Canada's leading preventable cause of death and disease,\" concludes Dr. Stanbrook.</p><div><p>Source:</p><p>Journal reference:</p><p>Thombs, B. D., <em>et al. </em>(2025). Recommendations on interventions for tobacco smoking cessation in adults in Canada. <em>Canadian Medical Association Journal</em>. <a target=\"_blank\" href=\"https://doi.org/10.1503/cmaj.241584\">doi.org/10.1503/cmaj.241584</a>.</p></div>\r\n        </div>"
  }
]