[
  {
    "title": "Hunter S. Thompson Sets His Christmas Tree on Fire, Nearly Burning His House Down (1990)",
    "url": "https://www.openculture.com/2025/12/hunter-s-thompson-sets-his-christmas-tree-on-fire-1990.html",
    "image": "https://cdn8.openculture.com/2025/12/18200130/hunter-s.-thompson-xmas-tree-2.png",
    "tag": "Culture",
    "date": "2025-12-19T10:00:27.000Z",
    "description": "\n\tin Literature, Random |   \tDecember 19th, 2025  Leave a Comment\n\t\n\t\t\t\n\n\t\n\nIt was some­thing of a Christ­mas rit­u­al at Hunter S. Thomp­son’s Col­or",
    "body": "\n\tin Literature, Random |   \tDecember 19th, 2025  Leave a Comment\n\t\n\t\t\t\n\n\t\n\nIt was some­thing of a Christ­mas rit­u­al at Hunter S. Thomp­son’s Col­orado cab­in, Owl Farm. Every year, his sec­re­tary Deb­o­rah Fuller would take down the Christ­mas tree and leave it on the front porch rather than dis­pose of it entire­ly. That’s because Hunter, more often than not, want­ed to set it on fire. In 1990, Sam Allis, a writer for the then for­mi­da­ble TIME mag­a­zine, vis­it­ed Thomp­son’s home and watched the fiery tra­di­tion unfold. He wrote:\nI gave up on the inter­view and start­ed wor­ry­ing about my life when Hunter Thomp­son squirt­ed two cans of fire starter on the Christ­mas tree he was going to burn in his liv­ing-room fire­place, a few feet away from an unopened wood­en crate of 9‑mm bul­lets. That the tree was far too large to fit into the fire­place mat­tered not a whit to Hunter, who was sport­ing a dime-store wig at the time and resem­bled Tony Perkins in Psy­cho. Min­utes ear­li­er, he had smashed a Polaroid cam­era on the floor.\nHunter had decid­ed to video­tape the Christ­mas tree burn­ing, and we lat­er heard on the replay the ter­ri­fied voic­es of Deb­o­rah Fuller, his long­time sec­re­tary-baby sit­ter, and me off-cam­era plead­ing with him, “NO, HUNTER, NO! PLEASE, HUNTER, DON’T DO IT!” The orig­i­nal man­u­script of Hell’s Angels was on the table, and there were the bul­lets. Noth­ing doing. Thomp­son was a man pos­sessed by now, full of the Chivas Regal he had been slurp­ing straight from the bot­tle and the gin he had been mix­ing with pink lemon­ade for hours.\nThe wood­en man­tel above the fire­place appar­ent­ly still has burn marks on it today.\nNote: An ear­li­er ver­sion of this post appeared on our site in 2015.\nIf you would like to sign up for Open Culture’s free email newslet­ter, please find it here. It’s a great way to see our new posts, all bun­dled in one email, each day.\nIf you would like to sup­port the mis­sion of Open Cul­ture, con­sid­er mak­ing a dona­tion to our site. It’s hard to rely 100% on ads, and your con­tri­bu­tions will help us con­tin­ue pro­vid­ing the best free cul­tur­al and edu­ca­tion­al mate­ri­als to learn­ers every­where. You can con­tribute through Pay­Pal, Patre­on, and Ven­mo (@openculture). Thanks!\nRelat­ed Con­tent\nHunter S. Thompson’s Har­row­ing, Chem­i­cal-Filled Dai­ly Rou­tine\nFree: Read the Orig­i­nal 23,000-Word Essay That Became Hunter S. Thompson’s Fear and Loathing in Las Vegas (1971)\nHunter S. Thomp­son Chill­ing­ly Pre­dicts the Future, Telling Studs Terkel About the Com­ing Revenge of the Eco­nom­i­cal­ly & Tech­no­log­i­cal­ly “Obso­lete” (1967)\nHunter S. Thomp­son, Exis­ten­tial­ist Life Coach, Gives Tips for Find­ing Mean­ing in Life\nHunter S. Thompson’s Ball­sy & Hilar­i­ous Job Appli­ca­tion Let­ter (1958)\n\t\t\n        \t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Hunter S. Thompson Sets His Christmas Tree on Fire, Nearly Burning His House Down (1990)",
      "image": [
        "https://cdn8.openculture.com/2025/12/18200130/hunter-s.-thompson-xmas-tree-2.png"
      ],
      "datePublished": "2025-12-19T10:00:27.000Z",
      "dateModified": "2025-12-19T10:00:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Anthony Theakston Sculpts a Spirited Flock of Bronze and Ceramic Birds",
    "url": "https://www.thisiscolossal.com/2025/12/anthony-theakston-bird-sculptures-bronze/",
    "image": "https://www.thisiscolossal.com/wp-content/uploads/2025/12/theakston-6.jpg",
    "tag": "Culture",
    "date": "2025-12-19T15:19:04.000Z",
    "description": "\nAll images courtesy of Anthony Theakston, shared with permission\nDecember 19, 2025\n\n\nLincolnshire-based artist Anthony Theakston continues his explor",
    "body": "\nAll images courtesy of Anthony Theakston, shared with permission\nDecember 19, 2025\n\n\nLincolnshire-based artist Anthony Theakston continues his explorations of common birds like barn owls and herons, sculpting their likeness in sleek bronze and ceramic. Smooth wings and bodies contrast the fluffy feathers typical of fowl, as they hunch over or curl up as if taking a nap. Elegant and seemingly primed for flight, the avians perch between abstract and realistic representations.\nTheakston has several exhibitions and fairs planned for 2026, including Naarden Art Fair and Brussels Affordable Art Fair with DeKunst Salon and the Washington Winter Show and Art Palm Beach with Gladwell and Patterson. He’s also represented by Gallery Bartoux, and you can find more of his work on Instagram.\n\n\n\n\n\n\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Anthony Theakston Sculpts a Spirited Flock of Bronze and Ceramic Birds",
      "image": [
        "https://www.thisiscolossal.com/wp-content/uploads/2025/12/theakston-6.jpg"
      ],
      "datePublished": "2025-12-19T15:19:04.000Z",
      "dateModified": "2025-12-19T15:19:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Abstract Paintings Confront Andean Weaving in Miguel Arzabe's Dynamic Compositions",
    "url": "https://www.thisiscolossal.com/2025/12/miguel-arzabe-woven-paintings/",
    "image": "https://www.thisiscolossal.com/wp-content/uploads/2025/12/arzabe-7.jpg",
    "tag": "Culture",
    "date": "2025-12-19T18:29:40.000Z",
    "description": "\n\n\t\nWhen considering Miguel Arzabe’s bold, woven works, it’s unsurprising that he begins by painting two abstract pieces. Vibrant fields of acrylic sp",
    "body": "\n\n\t\nWhen considering Miguel Arzabe’s bold, woven works, it’s unsurprising that he begins by painting two abstract pieces. Vibrant fields of acrylic spread across his canvases before they’re sliced into long strips and reconfigured. Resulting are dynamic compositions that meld art historical traditions with Arzabe’s Bolivian heritage, drawing on longstanding Andean imagery and weaving practices.\nNext month at Johansson Projects, the Oakland-based artist presents a collection of new wall works and suspended sculptures in Sin Contar Cincuenta. Arzabe refers to his practice as offering a “productive confrontation” of distinct cultures, approaches, and periods, and these new compositions continue his explorations into imagining spaces where differences exist in harmony. \n“La Bahía de Niebla” (2025), woven acrylic on canvas, 48 x 60 inches\nThe artist often roots his work in place and connections to a particular environment, and several pieces evoke vast landscapes and weather. “La Bahía de Niebla,” for example, echoes the dense opacity of Bay Area fog, while the elongated form reminiscent of an atoll sprawls across “Isla del Lago.” \nSin Contar Cincuenta is on view from January 17 to March 21 in Oakland. Find more from the artist on Instagram.\n“Isla del Lago” (2025), woven acrylic on canvas, 40 x 50 inches\n“Phisqa Tunka” (2025), woven acrylic on canvas, 48 x 60 inches\n“LBI” (2025), woven acrylic on canvas, 40 x 48 inches\n“Atocsita” (2025), woven acrylic on canvas and linen, 56 x 78 inches\n“Primer Grado” (2025), woven acrylic on canvas, 60 x 48 inches\n\t\n\t\n\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Abstract Paintings Confront Andean Weaving in Miguel Arzabe's Dynamic Compositions",
      "image": [
        "https://www.thisiscolossal.com/wp-content/uploads/2025/12/arzabe-7.jpg"
      ],
      "datePublished": "2025-12-19T18:29:40.000Z",
      "dateModified": "2025-12-19T18:29:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "“Victims of Communism” Monument Altered Over Reported Nazi Ties",
    "url": "https://hyperallergic.com/victims-of-communism-monument-altered-over-reported-nazi-ties/",
    "image": "https://hyperallergic.com/content/images/size/w1200/2025/12/memorial-to-communism.jpg",
    "tag": "Culture",
    "date": "2025-12-19T20:40:30.000Z",
    "description": "\n                News\n                A memorial in Canada will no longer include the names of specific people after the government said it found poss",
    "body": "\n                News\n                A memorial in Canada will no longer include the names of specific people after the government said it found possible Nazi affiliations among the commemorated individuals.\n            \n                \n                                \n                            \n                \n            \n                \n        \n            \"Canada, a Land of Refuge\" was originally unveiled last December. (photo via Wikimedia Commons, CC0 1.0 Universal)\n    \n        \n            A controversial monument to \"victims of communism\" in downtown Ottawa will no longer include the names of specific people after the Canadian government reportedly discovered potential Nazi affiliations among the commemorated individuals. The memorial, \"Canada, a Land of Refuge,\" originally proposed under conservative former Prime Minister Stephen Harper, was inaugurated last December by the government of Canada and Tribute to Liberty, an organization formed to build a monument honoring those \"affected by communism.\" Over 500 specific names were reportedly expected to be engraved on the memorial within a year of its unveiling, though Jewish groups and historians raised concerns for years that over half of the individuals could have been Nazi collaborators in the Holocaust. The monument's unveiling was delayed amid the controversy. This week, one year after the memorial's unveiling, the Department of Canadian Heritage said that it no longer planned to etch specific names into the memorial.“The Government of Canada has emphasized that all aspects of the Memorial to the Victims of Communism must align with Canadian values of democracy and human rights,” Caroline Czajkowski, a spokesperson for the Department of Canadian Heritage, told Hyperallergic in a statement. “The Wall of Remembrance will now solely feature thematic content that conveys the broader commemorative and educational intent of the Memorial.” When Hyperallergic asked Tribute to Liberty about reports that Nazi connections were discovered among the commemorated, the organization provided a statement alleging that \"Kremlin-aligned activists and commentators in Canada have relentlessly spread disinformation targeting Central and Eastern European diaspora communities.\"The monument comprises 4,000 metal rods designed by Paul Raff Studio, a central element of the memorial called the “Arc of Memory,” and is \"intended to express the vastness of people who suffered under communist regimes,\" according to the Department of Canadian Heritage.According to government records obtained by the Ottawa Citizen under freedom of information laws, the Friends of Simon Wiesenthal Center, a local Holocaust education organization, warned the Canadian government in 2021 that one individual whose name was to be included, Ukrainian nationalist Roman Shukhevych, was connected to the killings of Jews. Some names had already been engraved on the monument, including that of Janis Niedra, who was reportedly connected to a massacre of 350 Jews in Latvia. These names had been reportedly previously removed from the monument. Hyperallergic has contacted Friends of Simon Wiesenthal Center.\n                  \n                      \n                        News\n                      \n                  \n        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "“Victims of Communism” Monument Altered Over Reported Nazi Ties",
      "image": [
        "https://hyperallergic.com/content/images/size/w1200/2025/12/memorial-to-communism.jpg"
      ],
      "datePublished": "2025-12-19T20:40:30.000Z",
      "dateModified": "2025-12-19T20:40:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump-Appointed NEA Chair Returns for Second Term",
    "url": "https://hyperallergic.com/trump-appointed-nea-chair-returns-for-second-term/",
    "image": "https://hyperallergic.com/content/images/size/w1200/2025/12/NEAchair.jpg",
    "tag": "Culture",
    "date": "2025-12-19T21:21:53.000Z",
    "description": "\n    \n                News\n                Mary Anne Carter led the National Endowment for the Arts during Trump’s first presidency.\n            \n    ",
    "body": "\n    \n                News\n                Mary Anne Carter led the National Endowment for the Arts during Trump’s first presidency.\n            \n                \n                                \n                            \n                \n            \n                \n        \n            Mary Anne Carter will serve as chair of the National Endowment for the Arts. (photo courtesy NEA)\n    \n        \n            Political consultant Mary Anne Carter, who served as the chair of the National Endowment for the Arts (NEA) during the first Trump administration, will lead the agency again following Senate approval this week. Carter's appointment comes almost a year after Maria Rosario Jackson, a former Biden-appointed chair of the agency, stepped down from the post one day after Trump was inaugurated for a second term. Jackson was the first African American and the first Mexican-American person to lead the federal arts agency. In the 11 months since Jackson stepped down, the NEA rescinded arts grants en masse, notifying awardees that their projects were cancelled as the agency refocused on promoting “skilled trade jobs,” “AI competency,” “support [for] the military and veterans.” The NEA also terminated a longstanding grant program, Challenge America, that was geared toward \"underserved communities.\" Senior officials within the NEA resigned in May amid the cuts. Trump had also threatened to eliminate the agency entirely in a budget proposal earlier this year. In September, the American Civil Liberties Union won a lawsuit it filed against the NEA for asking applicants to abstain from funding anything that could be considered to be \"gender ideology,\" as defined by the Trump administration.After Carter's first appointment in 2018, reporters pointed out that she had served on Trump's presidential inaugural committee. A public LinkedIn account also notes that she served as director for Republican Rick Scott's transition to governor in 2011, later becoming his office's chief policy advisor. Her LinkedIn also includes experiences as a radio talk show host and campaign strategist. Notably, in the 1990s, she worked for the conservative think tank the Heritage Foundation, which helped shape Trump's Project 2025 far-right policy agenda. \"The arts are essential to creating, innovating, healing, and recovery, and they provide vital economic stability to communities across the nation,\" Carter said in a press release. \"I look forward to the many celebrations that will take place in 2026 in honor of America’s 250th anniversary, as well as to the agency’s continued research into the powerful role the arts play in healing—from illness to trauma to natural disasters.” There is no indication that Carter has any specific experience working in fields related to arts and culture, aside from her previous tenure at the NEA. When Jackson was appointed in 2021, she served as a tenured professor at Arizona State University’s Herberger Institute for Design and the Arts. Carter was first nominated to lead the NEA in May, but was not officially approved by the Senate until yesterday, December 18. Her approval comes as the board of the Kennedy Center for the Arts, which is chaired by Trump, voted to rename the Washington, DC, organization the “Trump-Kennedy Center.” Trump’s name was affixed to the center’s facade this morning. \n                  \n                      \n                        News\n                      \n                      \n                        Trump Administration\n                      \n                  \n        \n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump-Appointed NEA Chair Returns for Second Term",
      "image": [
        "https://hyperallergic.com/content/images/size/w1200/2025/12/NEAchair.jpg"
      ],
      "datePublished": "2025-12-19T21:21:53.000Z",
      "dateModified": "2025-12-19T21:21:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The World's Best Art in 2025",
    "url": "https://hyperallergic.com/the-worlds-best-art-in-2025/",
    "image": "/assets/images/news/default.jpg",
    "tag": "Culture",
    "date": "2025-12-19T11:00:16.000Z",
    "description": "\n    \n                Daily Newsletter\n                Also: A majority of artists struggle with debt, LACMA workers vote overwhelmingly for a union, ",
    "body": "\n    \n                Daily Newsletter\n                Also: A majority of artists struggle with debt, LACMA workers vote overwhelmingly for a union, and a word about the hilarity of evil.\n            \n                \n                                \n                            \n                \n            \n        \n            Move over, Smithsonian. The wall labels everyone’s talking about in DC this week are at the White House, where Trump installed derisive plaques about his Democratic predecessors Joe Biden and Barack Obama. They're as grotesque as you might expect, riddled with all-caps smears and untruths. Oh man, someone should really write a book about the Hilarity of Evil™. But who's fighting against this degradation of culture? Who's out there putting themselves and careers on the line? Not many, I'm afraid. \n\n                        But you have us, and we do it together with you. To help us sustain our work as the only major art publication not owned by a billionaire or corporation, please join as a paid member. It's only a few dollars a month, but it goes a long way in keeping us strong and independent. Enjoy today's stories and have a great Friday. \n                    \n—Hakim Bishara, editor-in-chiefNoah Davis, \"Painting for My Dad\" (2011), oil on canvas (photo by Kerry McFate, courtesy the Estate of Noah Davis and David Zwirner)The Best Art Shows Around the World in 2025Nan Goldin’s fearless Berlin retrospective, a remapping of interwar Paris in Singapore, Noah Davis’s visions of Black life, and a meditation on monuments in LA were just some of our favorites around the world this year. \n\n                    \n                    \n                    \n                        Craft in America returns to PBS for a new season with “EAST” and “WEST.” The latest episodes of the docuseries explore craft across the US, beginning with stories of artists in the Eastern and Western United States.\n                        \n                            Learn more\n                        \n                    \n            \nNewsA whopping 96% of staff at the Los Angeles County Museum of Art voted in favor of a union, calling for higher pay and “increased transparency.” A survey among more than 1,000 artists, commissioned by our very own Paddy Johnson, found that 56% of participants are mired in debt. What's worse, this number climbs to 59% for those with gallery representation and museum shows under their belt.  \n\n                    \n                    \n                    \n                        \n                            LSU School of Art Offers Highest MFA Stipends in the Southern USWith assistantships funded at $23,000, full tuition waivers, and generous health insurance, Louisiana State University helps students lay the groundwork for a successful lifelong art practice.\n                        \n                        \n                            Learn more\n                        \n                    \n            \nBrian Eno on Sarah Rose Sharp's \"Annie Leibovitz Shoots Fifty Shades of Anne Hathaway\":I love these pictures - and mostly for the reasons some of you don't like them. In an age of perfect perfectibility it's interesting when somebody decides not to make all the little adjustments that would turn it into just another perfect picture. I especially like the dynamism that the asymmetry produces.\n\n                    \n                    \n                    \n                        Indigenous glass art takes center stage at the National Museum of the American Indian: Clearly Indigenous: Native Visions Reimagined in Glass celebrates culture, craft, and storytelling. Now on view in New York City.\n                        \n                            Learn more\n                        \n                    \n            \nA rendering of Tuan Andrew Nguyen's commission for the High Line Plinth, “The Light That Shines Through the Universe” (image courtesy the artist and the High Line)Art MovementsA 27-foot Buddha sculpture is coming to the High Line in New York, replacing Iván Argote’s beloved oversized pigeon. Plus, Upstate Art Weekend is expanding and other industry news.A View from the EaselJess Sossi Romano welcomes us into her home studio in Brooklyn, New York. \"I am usually in my studio by 10am with a drink, a snack, and a speaker,\" she writes. Qiurui Du boasts a neat workspace in Shanghai, China. \"Visitors are often shocked by how clean my studio is,\" he reports.   Required Reading Did you know about the Icelandic tradition of gifting books during Christmas? Also: Joan Mitchell’s love of literature, garments with passports, and behind the scenes of Vanity Fair's controversial photoshoot of Trump's inner circle.From the ArchiveChristmas Cheer from a Lean Year: The 1950 Holiday Cards of Langston HughesThe Beinecke Library at Yale University is exhibiting Hughes's typewritten 1950 Christmas postcards, along with holiday cards he received from friends.\n                  \n                      \n                        Daily Newsletter\n                      \n                      \n                        Newsletter\n                      \n                  \n        \n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The World's Best Art in 2025",
      "image": [
        "/assets/images/news/default.jpg"
      ],
      "datePublished": "2025-12-19T11:00:16.000Z",
      "dateModified": "2025-12-19T11:00:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How a Nativity Scene Sent Europe Into a Tizzy",
    "url": "https://hyperallergic.com/how-a-nativity-scene-sent-europe-into-a-tizzy/",
    "image": "https://hyperallergic.com/content/images/size/w1200/2025/12/GettyImages-2248251199.jpg",
    "tag": "Culture",
    "date": "2025-12-19T17:18:17.000Z",
    "description": "\n    \n                Features\n                A controversial Brussels nativity scene begs the question: Should explicitly Christian imagery continue",
    "body": "\n    \n                Features\n                A controversial Brussels nativity scene begs the question: Should explicitly Christian imagery continue to be a part of Europe’s civic space, and if so, who has the authority to define it?\n            \n                \n                                \n                            \n                \n            \n                \n        \n            Victoria-Maria Geyer's Christmas nativity scene with faceless characters being unveiled at the Grand-Place in Brussels on November 28 (photo by Nicolas TUCAT / AFP via Getty Images)\n    \n        \n            If you need any further proof that the world has gone topsy-turvy, look no further than the theft of an icon of the baby Jesus from a nativity scene in Grand Place in the Brussels city center in late November. The nativity scene is the work of German-born artist and designer Victoria-Maria Geyer, who constructed the figures in the scene of Christ’s birth not out of wood, as is traditionally done, but out of recycled textiles with faces consisting only of black and brown patchwork with no identifiable features. Geyer wrote in her original proposal for the installation that her aim with the design of the city-commissioned installation, entitled “Fabrics of the Nativity,” was to create a scene in which “every Catholic, regardless of their background or origins can identify themselves.” Commissioned as a replacement for the former wooden nativity that had stood in Grand Place for 25 years, the committee that selected Geyer’s work included Father Benoît Lobet, the dean of the Sts. Michael and Gudula Cathedral, the central church of Brussels. Despite the fact that one of the city’s highest-ranking Catholic clerics was involved in its selection, “Fabrics of the Nativity” drew controversy almost immediately upon its installation on November 28, largely from political and religious conservatives in Belgium and around the world. Georges Dallemagne of the conservative Christian Democrats party called it “a zombie exhibition.” Others, including Ghent University professor Wouter Duyck, suggested the faceless figures were not an artistic statement, but so-called “wokeness” once again run amok, a hamfisted attempt to appease the sensibilities of the city’s large Muslim population. In the wake of the criticism, Father Lobet defended the nativity and told CathoBel that “when there are no faces, it forces the viewer to help create the nativity scene, to be present themselves,” referencing the Holy Family as refugees and noting that the story of Christ’s birth should turn our minds to vulnerable communities around us.Father Lobet is not alone in his assessment that nativity scenes, which are nearly omnipresent in many parts of the world this time of year, provide an opportunity to reflect on our current moment. This Christmas season — defined by political division, xenophobic and draconian immigration policies, and displacement and genocides — the nativity scene has once again become an unlikely ground zero for dissent. Geyer constructed the figures in the scene of Christ’s birth not out of wood, but out of recycled textiles with faces consisting only of black and brown patchwork. (photo by Nicolas TUCAT / AFP via Getty Images)As religious scholar Emma Cieslik has noted, anti-ICE nativity scenes have spread across the United States this year. For example, at St. Susanna Parish in Dedham, Massachusetts, the nativity scene contains the traditional shepherds, wise men, and animals, but the central characters, St. Joseph, the Virgin Mary, and, of course, the baby Jesus, are missing. Instead, where the Holy Family should be rests a sign that reads, “ICE WAS HERE” in bold blue letters alongside a smaller note that reads, “The Holy Family is safe in the Sanctuary of our Church … If you see ICE please call LUCE,” a reference to an immigration justice network and the raids that have been terrorizing America’s immigrant communities for nearly a year now. At Lakeside Church in Evanston, Illinois, the Holy Family stands surrounded by centurions donning immigration vests. And in Dallas, Oak Lawn United Methodist Church displayed Mary and Joseph behind barbed wire with the lyrics to Hannah C. Brown’s 2023 hymn, “Holy is the Refugee,” on posters around the scene. Unlike the Belgian nativity, which is the work of an artist commissioned for a civic installation, American progressive nativity scenes are explicitly didactic. They deliver clear religious and political messages and, for that reason, tell us comparatively little about the societies that produce them; they simply reflect the worldview of the congregations that stage them. “Fabric of the Nativity,” by contrast, raises a different set of questions — ones the American examples never quite force. Ironically, these are the very questions prompted by the diversity, pluralism, and shifting cultural norms that anti-immigration voices fear most. At the center is a much more difficult issue: Should explicitly Christian imagery continue to be a part of Europe’s civic space, and if so, who has the authority to define what shape it takes?Figures in Geyer's nativity (image courtesy the artist)Nearly 560 miles (~900 kilometers) south of Brussels, the small French town of Béziers’s centre-right mayor, Robert Ménard, has all but gone to war with the French government over his insistence on putting a Christmas display, complete with a nativity scene, in the town hall. The installation is a clear violation of French law, which has forbidden religious displays in public buildings since 1908, part of the country’s tradition of strident secularism, known as laïcité. Ménard’s nativity is the inverse image of Brussels’s “Fabric of the Nativity”: Instead of reimagining Christian imagery in a pluralistic direction, he deploys the most traditional form of the crèche as an assertion of cultural and political identity. In both cases, the real dispute is not about the mere presence of Christian imagery, but about who has the right to define it and what version of “Christian Europe” it is meant to endorse.Christmas and nativity scenes are not the only sites of cultural controversy. A 2024 poster depicting a handsome Jesus, commissioned by the Council of Brotherhoods, a group composed of both laity and clergy that organizes the Easter week events in Seville, Spain, by celebrated Spanish artist Salustiano García, drew harsh criticism from conservatives. This time, the backlash was not, as in the case of “Fabrics of the Nativity,” that Jesus seemed too “foreign,” but rather that he was now too queer. The far-right think tank Instituto de Política Social declared the image “sexualized and effeminate.”Father Lobet defended Geyer's nativity, saying that “when there are no faces, it forces the viewer to help create the nativity scene, to be present themselves.\" (image courtesy the artist)The furor over Geyer’s work and the backlash against García’s aren’t only linked by their status as unpopular reinterpretations of sacred imagery. More importantly, both controversies share the same source: The objection arises whenever traditional religious figures are reimagined in ways that reflect the diversity of contemporary European society — or, perhaps more provocatively, when artists attempt to reclaim these normative images for people whom the far right would prefer to render invisible in Europe’s cultural life. Both works bring the margins into the very center of the Western artistic and religious tradition, and right-wing factions see the very fact that this can be done as a threat. Yet, that fact — that in the image of the Christ Child we might see the refugee newly arrived from Gaza or Sudan or Ukraine, that Christ’s broken body at Holy Week might also be that of a queer man — highlights how wrong those who predict the end of Christianity in Europe’s public spaces truly are. The debate raging is not about whether such imagery should exist, but where and how it ought to exist, and most importantly, whether Europe’s new creators of Christian imagery, inheritors of a long artistic tradition, might be allowed to push the boundaries of what Christian art can represent and to whom it might speak. These nativity scenes bring into focus two defining questions of our time: who belongs, and how far belonging can stretch.\n                  \n                      \n                        Features\n                      \n                      \n                        nativity scene\n                      \n                      \n                        Christianity\n                      \n                  \n        \n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How a Nativity Scene Sent Europe Into a Tizzy",
      "image": [
        "https://hyperallergic.com/content/images/size/w1200/2025/12/GettyImages-2248251199.jpg"
      ],
      "datePublished": "2025-12-19T17:18:17.000Z",
      "dateModified": "2025-12-19T17:18:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]