[
  {
    "title": "Miniature Picasso Painting Goes Missing in Spain ",
    "url": "https://hyperallergic.com/1050212/miniature-picasso-painting-goes-missing-in-spain/",
    "image": "https://hyperallergic-newspack.s3.amazonaws.com/uploads/2025/10/Picasso.-Naturaleza-muerta-con-guitarra.jpg",
    "tag": "Culture",
    "date": "2025-10-17T21:46:10.000Z",
    "description": "\n\t\t\t\t\n\t\t\t\n\t\t\t\t\t\t\t“Naturaleza muerta con guitarra (Still life with a guitar)” (1919) is missing, according to a museum in Spain. (image courtesy CajaGr",
    "body": "\n\t\t\t\t\n\t\t\t\n\t\t\t\t\t\t\t“Naturaleza muerta con guitarra (Still life with a guitar)” (1919) is missing, according to a museum in Spain. (image courtesy CajaGranada Fundación)\n\t\t\t\n\n\t\nA miniature gouache painting by Pablo Picasso has gone missing in Spain, according to CajaGranada Fundación, a cultural center and museum in Granada. \nIn a statement shared with Hyperallergic, the institution said that its staff discovered that Picasso’s “Naturaleza muerta con guitarra (Still life with a guitar)” (1919) was missing from a shipment of items for an upcoming exhibition. The painting, about the size of an iPhone SE at 5 by 3.9 inches (12.7 by 9.8 centimeters), had been expected by the museum from a private collection for its exhibition Bodegón: La eternidad de lo inerte (Still Life: The Eternity of the Inert), which opened on October 9.\nHowever, when unpacking a delivery of works for the exhibition originating from Madrid on October 6, just three days before the exhibition’s opening, the institution said its curator and exhibition manager discovered that the Picasso painting, reportedly worth €600,000 (~$700,500), was not among the items.\nA delivery company, the institution said, had arrived days earlier on October 3, and the packages sat over that weekend under video surveillance, which showed no disruption. The statement did not name the company.\nAt 10 am on October 3, the museum said its staff met a van carrying the works and instructed them to bring them inside in a single forklift transfer. The works were then moved from the van to a freight elevator into an area with video surveillance. According to the museum, the packages arrived improperly numbered, so a thorough check of the works was impossible without unpacking everything. Before the delivery employees left an hour and a half later, the museum said staff checked the provenance information on the packages, but did not verify the works physically before dismissing the individuals who delivered the packages.\nThe Spanish newspaper El País reported that two individuals were on board the van and stopped overnight not far from Granada. Nobody has been arrested yet, according to the El País, and police are focused on determining at what point during the journey the work disappeared. It is unclear if the painting was initially confirmed to have been on the delivery van.\nIn its statement, CajaGranada Fundación said that it filed a report with Spain’s national police and will cooperate in the investigation. Hyperallergic has not yet heard back from the Policía Nacional.\nPicasso’s work has long been targeted by thieves, including in a 2012 heist at a Dutch museum in which “Tête d’Arlequin” (1971) was swiped. In 2019, a French court found that the Spanish artist’s electrician and his wife had stolen 271 Picasso paintings and kept them hidden in their garage for 40 years. \n“We have filed a report of the disappearance with the National Police; we have made all our resources available for the investigation, fully confident that the proceedings will proceed smoothly and resolve the case,” the museum said in its statement.\n\t\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\tIsa Farfan is a staff reporter for Hyperallergic. In May 2024, she graduated from Barnard College, where she studied Political Science and English and served as the Columbia Daily Spectator's Arts &...\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\tMore by Isa Farfan\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\n\t\t\t\t\n\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Miniature Picasso Painting Goes Missing in Spain ",
      "image": [
        "https://hyperallergic-newspack.s3.amazonaws.com/uploads/2025/10/Picasso.-Naturaleza-muerta-con-guitarra.jpg"
      ],
      "datePublished": "2025-10-17T21:46:10.000Z",
      "dateModified": "2025-10-17T21:46:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "New Painting of Charli XCX Graces Vanity Fair Cover ",
    "url": "https://hyperallergic.com/1050182/new-painting-of-charli-xcx-graces-vanity-fair-cover/",
    "image": "https://hyperallergic-newspack.s3.amazonaws.com/uploads/2025/10/charli-cover.jpg",
    "tag": "Culture",
    "date": "2025-10-17T21:12:53.000Z",
    "description": "\n\t\t\t\t\n\n\t\nIssy Wood’s “Charli 2” (2025), commissioned by Vanity Fair as the cover for the upcoming art issue publishing this November. Wood’s portrait ",
    "body": "\n\t\t\t\t\n\n\t\nIssy Wood’s “Charli 2” (2025), commissioned by Vanity Fair as the cover for the upcoming art issue publishing this November. Wood’s portrait both references and complements Aidan Zamiri’s photos of Charli XCX for the singer’s October cover story with the magazine. (image courtesy Issy Wood/Vanity Fair)\n“I don’t really get to decide when [brat]’s over or not,” Charli XCX told Contributing Editor Anna Peele during an extended interview for Vanity Fair‘s cover story this month — “I think that’s up to the world.” If VF has a say, brat (2024) and the career evolution it has imposed on the singer and producer are still relevant over a year later, especially since the magazine commissioned contemporary artist Issy Wood for a portrait of the British pop star for the cover of its first art issue in 20 years publishing this November.\nThough Charli is intentionally absent from the award-winning album’s iconic, retina-singing green and blurry text cover art, Wood brings her front and center again in a simultaneously fuzzy and edgy oil portrait on equally shocking orange velvet. Depicting Charli from her cupid’s bow to the crown of her head, the painter captures the arched brows and hooded eyes of the party princess’s lethal stare piercing from beneath her buoyant waves. \nFor the portrait, the American-born British painter told VF that she drew from “the length and quality of [Charli’s] career prior to the global success of brat, the throwaway candor of her lyrics, [and] the Britishness we both share.” But not without adding her own flourishes of yellow twinkles and sweeping white lines that loop and bounce across the singer’s face, elements that walk the line between a fun Instagram face filter and doodles on the margins of one’s ruled notebook and push a surreal intimacy throughout the painting.\nWood’s portrait both references and complements Aidan Zamiri’s photos of Charli XCX for the singer’s October cover story with the magazine.\n\nIssy Wood, “Charli 2” (2025) (© Issy Wood 2025;  photo by Damian Griffiths, courtesy the artist, Carlos/Ishikawa, London, and Michael Werner Gallery)\nWood, who also produces her own music in addition to her established visual arts practice, appears to understand at its core what Charli XCX means when she pronounces that “Everything is Romantic.” Perhaps not necessarily through “bad tattoos on leather-tanned skin,” as the singer emphasizes on the track, but in other similarly quotidian yet captivating sights and scenes: canker sores and tightened braces, rippling back muscles and shiny challah bread, car interiors and shiny revolvers.\nHer paintings, some of which are currently on view through January in a solo show at Schinkel Pavilion in Berlin, flutter between alluring and unsettling as they tap into forgettable moments and sensations, buried desires or suppressed fears, and curiosity beyond one’s control.\nWood noted to the magazine that it was a challenge to capture one of the most famous faces of the 2020s compared to the nature of her own practice, but accepted any labels of the work reading as fan art because that is “one of the purest and most tender art forms we have.” \nLike Wood, Charli herself is markedly expressing interest in new artistic endeavors, from establishing herself and the fans who attended her impromptu album remix concert at Storm King Art Center last year as “fine art bitches now” to going on to star in forthcoming films.\n\t\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\tRhea Nayyar (she/her) is a New York City-based staff reporter at Hyperallergic. She received a BFA from Carnegie Mellon University and has a passion for small-scale artworks, elevating minority perspectives,...\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\tMore by Rhea Nayyar\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\n\t\t\t\t\n\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "New Painting of Charli XCX Graces Vanity Fair Cover ",
      "image": [
        "https://hyperallergic-newspack.s3.amazonaws.com/uploads/2025/10/charli-cover.jpg"
      ],
      "datePublished": "2025-10-17T21:12:53.000Z",
      "dateModified": "2025-10-17T21:12:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Arch of Trump’s Triumph and Downfall ",
    "url": "https://hyperallergic.com/1050375/the-arch-of-trump-triumph-and-downfall/",
    "image": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/10/trump-arch-models.jpg?fit=2400%2C1733&quality=90&ssl=1",
    "tag": "Culture",
    "date": "2025-10-19T19:58:00.000Z",
    "description": "\n\t\t\t\n\t\t\t\t\t\t\tDonald Trump holding models of an arch as he delivers remarks during a ballroom fundraising dinner in the East Room of the White House on ",
    "body": "\n\t\t\t\n\t\t\t\t\t\t\tDonald Trump holding models of an arch as he delivers remarks during a ballroom fundraising dinner in the East Room of the White House on October 15 (photo by Kevin Dietsch via Getty Images)\n\t\t\t\n\t\t\t\t\n\n\t\nAt a White House meeting with donors for his ballroom expansion project last Wednesday, President Trump unveiled models for a triumphal arch to be erected in Washington, DC. The proposed arch would stand across from the Lincoln Memorial and welcome visitors leaving Arlington National Cemetery, ostensibly in commemoration of the 250th anniversary of American independence next year. (The arch will reportedly be paid for using leftovers from Trump’s $250 million ballroom fund.) Although officially called the “Independence Arch,” the nickname “Arc de Trump” has taken hold, referencing a strong resemblance to the Arc de Triomphe in Paris. Trump’s proposed arch is the latest development in the history of the infamously imperialistic architectural form, which stretches back to Roman antiquity. It also continues his fascination with neoclassical architecture and material attempts to draw connections between himself and the emperors and military generals of Ancient Rome. \nNews of the proposed arch only began to emerge on October 9, when a model first appeared on Trump’s Oval Office desk. But on September 4, architect Nicolas Leo Charbonneau shared a viral tweet with the phrase “America needs a triumphal arch!” and an artistic rendering of the structure with a winged statue of the goddess Victory — later referred to by Trump as “Lady Liberty” — flanked by two eagles. Charbonneau’s design firm, Sacred Architecture Studio at Harrison Design, specializes in the use of neoclassical architecture for religious buildings. In an interview with the Catholic Herald last year, Charbonneau noted that his firm is “founded on principles that align with the teaching of the Catholic Church.”\nThough details are still murky, what is clear are the origins of the triumphal arch. Archaeologists and art historians have identified over 800 freestanding Roman arches across the former Roman Empire. The form was developed during the Roman Republic, almost 200 years before the first Roman emperor, Augustus, came to power. The most popular reason for erecting a freestanding arch was to commemorate a major military victory known as a Roman triumph, the highest military accolade for a conquering general. The word itself comes from the Latin arcus (“arch”), but when the structures emerged in the 2nd century BCE, Romans called them fornices. A general named Lucius Stertinius, who had three constructed following his campaigns in Hispania Ulterior (a region in present-day Spain), allegedly used 50,000 pounds of silver of his own money to have them built. Eventually, over 50 such arches dotted the landscape of the Eternal City by the end of Roman antiquity, often serving as symbols of Roman military supremacy and provincial subjugation. \n\nThe Arch of Titus on the Upper Via Sacra in Rome, Italy (photo by Carole Raddato, CC BY-SA 2.0, via Flickr)\nWhile not all arches commemorated the achievement of a Roman triumph, many did. Augustus had a triumphal arch voted to him by the Senate during his reign, as did several successive emperors including Septimius Severus and Constantine. Perhaps the best-known Roman arch today is the Arch of Titus at the entrance to the Forum, near the Colosseum. Then-Emperor  Domitian had the arch built beginning in 81 CE to commemorate the achievements of his deceased brother, Titus, who destroyed the Second Temple at Jerusalem. Titus enslaved thousands of Jewish people and brought them to Rome during his father’s reign, likely to help build the Colosseum. The relief of the menorah being pillaged from the Second Temple is perhaps the most famous relief on a Roman triumphal arch, and was later used as a model for the Israeli state’s emblem not long after the occupation of Palestine began. It also has an eagle carrying Titus to heaven in apotheosis at the apex of the arch, with the goddess victory on the spandrels.\nInto the 4th century CE and the creation of the Arch of Constantine in 315 CE, it was still standard protocol to receive the imprimatur of the Senate before beginning construction. Many arches bore an inscription celebrating the Senatus Populusque Romanus (“Senate and Roman People”) and noting it had been voted by the Senate to the emperor. Even many centuries later, the arch continued to represent imperialism and grant prestige to the victorious general, whether or not it was formally stated. Plans for the Arc de Triomphe at the end of the Champs-Elysées in Paris indicate that the structure was based in part on the Arch of Titus and the Arch of Constantine at Rome and created at Napoleon’s behest. Although officially dedicated to the victories of France’s Grande Armée, the first stones were laid down on the French emperor’s birthday, August 15, 1806.\n\nAlfred Bastien’s “Canadians Passing in Front of the Arc de Triomphe” (c. 1919), a painting of Canadian troops on parade under the Red Ensign at Paris’s Arc de Triomphe, part of an Allied victory parade on July 14, 1919 (image public domain via the Canadian War Museum, Toronto, Canada)\nThere are a number of iconic triumphal arches in the United States today. The most recognizable is arguably the Washington Square Arch, which serves as a symbol of Greenwich Village in New York City. The arch was built in 1892 to commemorate George Washington’s bicentennial. Across the country, arches commemorate everything from veterans to peace. But their official symbolism often contradicts their historical reality. The Millennium Gate Museum in Atlanta has a 101-foot-tall (~30.8-meter-tall) arch based on the Arch of Titus meant to celebrate peace, despite the fact that Titus killed and enslaved thousands of Jews during the Jewish-Roman War. Triumphal arches maintain their message of autocratic authority most shrewdly when tied to a single, living individual. \nOver the course of seven months, Trump has undertaken myriad actions most often associated with monarchies and dictatorships than with democratic republics. His military parade on his birthday in June looked more like a Roman triumph than an anniversary procession. His proposal to mint $1 coins with his face on it for the nation’s upcoming 250th anniversary also appears to be in conflict with the 1866 Coin Act barring a living person from appearing on US currency, securities, and notes. The act was meant to differentiate American coinage from that of governments like Britain, who place their living monarch on coinage. The proposed “Arch de Trump” is also in alignment with his use of Executive Orders to champion neoclassical architecture as a way of returning to the aesthetics of the Founding Fathers.\nTriumphal arches carry the memory of the figures they monumentalized and the autocrats who built them. Hitler envisioned one with his head architect, Albert Speer, for his vision of Welthauptstadt Germania. Trump’s plan for the creation of a neoclassical arch near the Lincoln Monument is undoubtedly an attempt to proclaim the president’s own perceived victories. The arch may be thinly cast as a monument to American independence, but one might wish to whisper in Trump’s ear what was said to triumphing Roman generals in their parade: “Memento mori.” Remember that you are a man and not a god.\n\t\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\tSarah E. Bond is an associate professor of history at the University of Iowa. She blogs on antiquity and digital humanities, and is the author of Strike: Labor, Unions, and Resistance in the Roman Empire...\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\tMore by Sarah E. Bond\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\n\t\t\t\t\n\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Arch of Trump’s Triumph and Downfall ",
      "image": [
        "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/10/trump-arch-models.jpg?fit=2400%2C1733&quality=90&ssl=1"
      ],
      "datePublished": "2025-10-19T19:58:00.000Z",
      "dateModified": "2025-10-19T19:58:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "In the Shadow of Ruth Asawa",
    "url": "https://hyperallergic.com/1050293/in-the-shadow-of-ruth-asawa-moma/",
    "image": "https://hyperallergic-newspack.s3.amazonaws.com/uploads/2025/10/IMG_2295.jpg",
    "tag": "Culture",
    "date": "2025-10-17T21:29:15.000Z",
    "description": "\n\t\t\t\n\t\t\t\t\t\t\tDetail of work by Ruth Asawa in Ruth Asawa: A Retrospective (all photos Lisa Yin Zhang/Hyperallergic)\n\t\t\t\n\t\t\t\t\n\n\t\nI’ve been thinking about",
    "body": "\n\t\t\t\n\t\t\t\t\t\t\tDetail of work by Ruth Asawa in Ruth Asawa: A Retrospective (all photos Lisa Yin Zhang/Hyperallergic)\n\t\t\t\n\t\t\t\t\n\n\t\nI’ve been thinking about Ruth Asawa’s shadows. They’re surprising, not shaped how you might expect: While one of her sinuous hanging basket sculptures might be elongated, with an oblong head and abdominal segments, for instance, its shadow might have a round belly and a shortened neck — another character entirely. Shadows aren’t an afterthought in Asawa’s work, but another dimension of it — another way in which one thing can contain or serialize into an infinity. What plenitude; what a rich, generous world. \nThe Museum of Modern Art’s edition of Ruth Asawa: A Retrospective solves the problems critic Alex Paik raised in his excellent review of the San Francisco Museum of Modern Art’s version. Whereas that show downplayed racism in her life, the main exhibition text here points to the incarceration of Japanese-Americans in camps as an uprooting injustice; it explicitly states that Asawa was denied an art teaching degree due to anti-Japanese prejudice. Whereas Paik found the SFMoMA show crowded, this one felt like an aquarium of light and space. Its floor plan is continuous — you can walk around either side of every wall, and there’s never a wrong choice, always another chance to loop back around, as if you were tracing the paths of one of her loping wires. You’ll move from a room about her experiments with nature into another dedicated to her tireless advocacy for arts education — something else Paik wanted from this exhibition — and then continue on in the first room, the experience all the richer for the detour. This is such a wonderful and well-curated show that it gifted this perpetually skeptical critic the freedom to let my thoughts and feelings and pleasure bloom and wilt, fold into one another, as if I were one of Asawa’s lovely vessels. \nIn fact, we are part of Asawa’s artistic germination from the very first room, dedicated to the time she spent in her early 20s at Black Mountain College, in the late 1940s. In an untitled oil and watercolor on paper inspired by autumn leaves, bulbous forms that anticipate the silhouette of her later sculptures overlap gently, as if nuzzling. The thin support buckles under the weight of the pigment, as if struggling to hold the full measure of Asawa’s vision. Nearby, the oil-on-masonite “Figures on Green” (c. 1947–48) contains eight rounded figures with arms held aloft in various states of elongation and compression, as if they’re leaping off the surface. A couple of years later, she found the dimension she was searching for, with paperfold works that zigzag dizzyingly on the wall. \n\nRuth Asawa, Untitled (S.691, Wall-Mounted Paperfold with Horizontal Stripes) (1951), ink on paper\nThere’s one shaped like a giant seed, the folded paper and pod alike a labyrinth of intricacy and possibility. Or should I say that it is a seed pod, for Asawa’s works aren’t metaphorical, allusive, concerned with their own cleverness. They don’t stand in for other things, they become their own versions of them. It feels, for instance, as if the real-life stripes of a watermelon and the flow of ink through paper in a 1960s work depicting one were guided by one and the same hand.\nI love that the curators took the time to carve that same pleated-paper pattern into one wall and chose to suspend a vitrine there containing patents, newspaper clippings, and magazine spreads by and about the artist. It suggested to me that all the walls of the exhibition might fold into each other, that no aspect of her work exists apart from another, nor even any facet of her life.\n\nInstallation view of Ruth Asawa: A Retrospective\nInstallation view of Ruth Asawa: A Retrospective\nAsawa’s basket sculptures seem to make that continuity between all things tangible. Figuring out how they come into being twists the mind into a Gordian knot, turning the simple task of following a plane into the experience of traversing a Möbius strip: exterior becomes interior becomes exterior again. Each work toggles between all manner of forms — anthropomorphic figures and alien creatures, deep-sea invertebrates and uteruses — at once, and yet somehow they’re always more. One has a raindrop-shaped head and tail, like a continuous chain of fluid moments suspended in time, where the beginning is also the end. Another evokes stacked witches’ hats or wormholes, child’s play and the very fabric of time-space at once. They sway or spin so slowly that they seem cosmically removed from you, like a planet that turns once in your lifetime. And yet you’re an integral part of that very system — it’s your steps, your breath, that propels them. \nLater in life, Asawa’s sculptures became fractal, exploding outward rather than tending inward, each branch end begetting ever more. Are they roots or tendrils, beginnings or ends? As always, both, and then some. I raised my arms to take a picture and, looking at my own shadow, saw myself as one of those ecstatic leaping figures from that very first gallery, as if I had been spun off the tip of one of her dandelion sculptures and sent out into the world as both messenger and message, the infinite seed of her vision contained within me. \n\nInstallation view of Ruth Asawa: A Retrospective\nInstallation view of Ruth Asawa: A Retrospective\nInstallation view of Ruth Asawa: A Retrospective\nInstallation view of Ruth Asawa: A Retrospective\nInstallation view of Ruth Asawa: A Retrospective\nRuth Asawa: A Retrospective opens at the Museum of Modern Art (11 West 53rd Street, Midtown, Manhattan) on October 19 and continues through February 7, 2026. \n\t\n\n\t\t\t\t\n\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "In the Shadow of Ruth Asawa",
      "image": [
        "https://hyperallergic-newspack.s3.amazonaws.com/uploads/2025/10/IMG_2295.jpg"
      ],
      "datePublished": "2025-10-17T21:29:15.000Z",
      "dateModified": "2025-10-17T21:29:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jane Lombard Looks Back at 30 Years of Art and Politics",
    "url": "https://hyperallergic.com/1050318/jane-lombard-looks-back-at-30-years-of-art-and-politics/",
    "image": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/10/BFA_51048_7327018.jpg?fit=2400%2C1714&quality=90&ssl=1",
    "tag": "Culture",
    "date": "2025-10-19T19:59:00.000Z",
    "description": "\n\t\t\t\n\t\t\t\t\t\t\tCrowds near works by Margarita Cabrera at the opening of 30 X 30: A Selection of Thirty Artists Over Thirty Years at Jane Lombard Gallery ",
    "body": "\n\t\t\t\n\t\t\t\t\t\t\tCrowds near works by Margarita Cabrera at the opening of 30 X 30: A Selection of Thirty Artists Over Thirty Years at Jane Lombard Gallery on September 5, 2025 (photo courtesy Kevin Czopek/BFA)\n\t\t\t\n\t\t\t\t\n\n\t\nWhen Jane Lombard started her career in the art world in the 1990s, she was part of a delegation that traveled to Poland to help Eastern European artists show their work in the United States just before the Cold War ended.\nThree decades later, Lombard sat at her desk at her gallery in New York City’s Tribeca neighborhood, discussing how she would join hundreds of thousands of Americans to protest against the nation’s creeping authoritarianism at the No Kings Day parade this coming Saturday, October 18.\n“We don’t have those issues here, but they’re coming. Look at Chicago, they’re fighting back,” she told Hyperallergic, referring to President Trump’s attempts to deploy the national guard in Illinois.\n\nJane Lombard (photo Hrag Vartanian/Hyperallergic)\nAt a time when the contemporary art world appears to be swerving away from politics, with some institutions quietly abandoning exhibitions that challenge the current administration’s views, Lombard knows that all politics are personal. Her current exhibition 30 X 30: A Selection of Thirty Artists Over Thirty Years, which opened September 5, is a reflection of the art she has enjoyed the most, reflecting an incisive, sometimes bracing, sociopolitical message.\nIt’s also a homecoming for dozens of artists whom Lombard has represented and shown in her gallery spaces in SoHo, Chelsea, and Tribeca, where she relocated to 58 White Street in 2020. They hail from more than a dozen countries, including China, Taiwan, Morocco, Turkey, Myanmar, and some from which they have fled in exile, but share several commonalities.\n“A lot of artists explore their identities and the countries they are from in their work,” said Mána Taylor, a press liaison for the gallery. “Some works delve into architectural elements and landscapes, while others look at the body in a more subtle way.”\n\nHoward Smith, “Quasigrid #15” (2009–10) (photo Aaron Short/Hyperallergic)\nThe show includes a twinkling 2023 sculpture of multi-colored crystal glass in the shape of an apostrophe by Via Lewandowsky, an artist Lombard showed at her first exhibition in 1995. He called the work “Brilliance of Omission” because the apostrophe is used as a placeholder to avoid writing the word “God” in Hebrew texts. \nNearby is Mounir Fatmi’s 2016 installation of 14 skateboards upholstered with Islamic prayer rugs, titled “Maximum Sensation.” Fatmi arranged the plush skateboards in a bell curve pattern to show what a kick-flip trick would look like in slow-motion, a commentary on the near-religious devotion of skaters and the cross-pollination of pop culture in America and the Muslim world.\n\n\n\nVia Lewandowsky, “Brilliance of Omission” (2023) and Richard Ibghy and Marilou Lemmens, “Mastermind” (2022) (photos Aaron Short/Hyperallergic)\nThe most political piece in the show may be Margarita Cabrera’s fabric sculptures of potted cacti made in the center of the room. Cabrera hosted workshops in El Paso in 2016 with recent undocumented immigrants who embroidered stars and other symbols on the leaves of fake cacti that she assembled with scraps of border patrol uniforms. Her art assistants aren’t named in the gallery’s label in order to protect their identities. Cabrera’s politics are not contained to her artworks: She and fellow artist Nicholas Galanin recently withdrew from a symposium at the Smithsonian Institution that had been made private and invitation-only, a decision that Cabrera called “quiet censorship.”\nNear the back of the gallery, Richard Ibghy and Marilou Lemmens’s 12-inch yellow ceramic sculpture that resembles an upside-down pair of jeans sits on a pedestal. The 2022 work, called “Mastermind,” depicted strategic rips and tears on the jeans that stand for Morse code, which were used by opponents of Turkish President Recep Tayyip Erdogan to communicate secret messages.\n\nMounir Fatmi, “Maximum Sensa:on Suspended” (2016) on view at Jane Lombard Gallery (photo Aaron Short/Hyperallergic)\nDownstairs, visitors will find two striking pieces by 21st-century Chinese artists who straddle the real and virtual worlds. Beijing artist Cao Fei’s digital print “RMB CITY 1” (2007) shows the skyline of a fictional Chinese city created in the online multiplayer game Second Life, surrounded by rising seas. If you look closely, you’ll see the Beijing National Stadium among the skyscrapers.\nLu Yang, who lives in Tokyo, also explores the overlap between faith and video game avatars. His 2022 light box image, “DOKU – The Matrix #2” contains several facsimiles of the artist dressed to symbolize the different Buddhist realms of existence. Jane Lombard is one of the first in the US to show his work, the gallery said.\nSome works have a unique personal connection to Lombard, too. Mark Bradford’s 2002 mixed-media work “Nasty Ass Pigeons” includes scores of heat-resistant endpapers attached to the canvas in reference to his mother’s work as a hairdresser. That year, he created an installation of a working beauty shop at Art Basel Miami Beach called “Foxyé Hair,” where he and his team would style visitors’ hair.\n“That’s where Jane had her red streak done that she still has today,” Taylor said.\n\t\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\tAaron Short is a Brooklyn-based journalist covering politics, criminal justice, real estate, the environment, and the arts. His work has appeared in New York Magazine, the New York Post, The Daily Beast,...\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\tMore by Aaron Short\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\n\t\t\t\t\n\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jane Lombard Looks Back at 30 Years of Art and Politics",
      "image": [
        "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/10/BFA_51048_7327018.jpg?fit=2400%2C1714&quality=90&ssl=1"
      ],
      "datePublished": "2025-10-19T19:59:00.000Z",
      "dateModified": "2025-10-19T19:59:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Celebrating the Science of Quilts",
    "url": "https://hyperallergic.com/1049897/celebrating-the-science-of-quilts-american-folk-art-museum/",
    "image": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/10/An-Ecology-of-Quilts-at-AFAM-17.jpg?fit=2500%2C1668&quality=90&ssl=1",
    "tag": "Culture",
    "date": "2025-10-19T20:01:00.000Z",
    "description": "\n\t\t\t\n\t\t\t\t\t\t\t“Pot of Flowers Quilt with Birds,” detail (c. 1860), cotton and wool (all photos Julie Schneider/Hyperallergic)\n\t\t\t\n\t\t\t\t\n\n\t\nThe fiber arts",
    "body": "\n\t\t\t\n\t\t\t\t\t\t\t“Pot of Flowers Quilt with Birds,” detail (c. 1860), cotton and wool (all photos Julie Schneider/Hyperallergic)\n\t\t\t\n\t\t\t\t\n\n\t\nThe fiber arts are experiencing renewed and rigorous recognition. Last year, for instance, modern and contemporary weaving loomed large in major exhibitions in the United States, which explored the craft’s ancient roots and impact on modern art, alongside high-profile shows around the world devoted to artworks made from fabric and thread. As writer-historian Glenn Adamson proclaimed, 2024 was the year that “the art world went on a high fiber diet.” \nThis year, amid a slate of shows exploring the rich possibilities of fabric, American quilts are having a moment in art museums from coast to coast. In-depth exhibitions showcase the craftsmanship and ingenuity of regional quilting communities in Routed West: Twentieth-Century African American Quilts in California at the Berkeley Art Museum and Pacific Film Archive (through November 30) and Of Salt and Spirit: Black Quilters in the American South at the Memphis Brooks Museum of Art (through January 4, 2026). Similarly, the 2024–25 exhibition Patterns in Abstraction: Black Quilts from the High’s Collection at the High Museum of Art in Atlanta spotlighted artful quilts from the institution’s permanent collection, all stitched by Black women. Unraveling the narrative potential of quilts, Fabric of a Nation: American Quilt Stories From the Museum of Fine Arts, Boston at the Frist Art Museum in Nashville recently related the country’s histories through textiles, and Indigo and the Art of Quiltmaking at the Taft Museum of Art in Cincinnati (through January 11, 2026) focuses on global dye traditions.\n\nDyestuff samples and natural dye fabric swatches on display in An Ecology of Quilts: The Natural History of American Textiles at the American Folk Art Museum \nAdding a biophilic perspective to the mix, the American Folk Art Museum opened An Ecology of Quilts: The Natural History of American Textiles in late September, marking the museum’s reopening after a summer-long closure for renovations. Featuring 30 quilts from the 18th through the 20th century, the exhibition explores the bountiful ways that nature, industry, and quilt making entangle. Rather than emphasizing the quilters’ identities, it examines the relationships between natural and human-powered systems and processes, starting at the roots of quilt making: the lifeforms (plants, animals, insects) necessary to produce fabric — and, therefore, quilts.\nAn Ecology of Quilts opens with a trio of whole-cloth quilts: one an all-white field of cotton fabric embellished with patterns of raised dots and florals (“Cornucopia and Dots Whitework Quilt,” c. 1800–1820) contrasted by two brightly colored examples. On the opposite wall, botanical illustrations and vials of common, traditional dyestuffs, including insects (cochineal) and dried plant matter, introduce the fundamentals of natural dye, used to color the two vibrant quilts that start the show. A gradient of fabric swatches highlights the brilliance of the extracted hues: indigo (deep blue), madder root (bright red), and weld (golden yellow). Through an adjoining doorway, a case displays silk cocoons and handfuls of raw wool, linen, and cotton fibers, alongside squares of material woven from each, with an invitation to “please touch.” \nLeft: “Floral Appliqué Quilt” (1856), cotton; right: Attributed to a Member of the Sinclair Family, “Adam and Eve in the Garden of Eden Quilt” (mid-19th century), cotton\nFrom here, the show shifts to a standout section that exudes the layered lushness of a flourishing botanical garden. With an abundance of vivid vining blossoms, “Pot of Flowers Quilt with Birds” (c. 1860) radiates a feeling of unbridled joy and abundance. Its neighbor, “Flower Quilt” (c. 1955–63), an album-style quilt stitched by American sociologist Raymond F. Bellamy, reflects his interest in botany, carefully cataloguing a different type of flower in each square. Highlighting the symbolic language of plants, a green and white mourning quilt from the mid-1800s (“Members of the Freewill Baptist Church Presentation Quilt for William A. Sargent”) memorializes members of a church community with handwritten messages in ink, along with appliquéd weeping willows to represent sadness.\nIn the final gallery, a grouping of geometric quilts stitched from salvaged scraps speak to a history of thrift and resourcefulness in quilt making. Among these works are the dynamic, polyester and cotton “Pinwheel Variation Quilt” (1960) by Gee’s Bend quilter Malissia Pettway and artist Tomie Nagano’s “Ajiro-Monyo” (1995), made from vintage kimonos and drawing inspiration from boro textiles and woven basketry.\n\nIndigo dyeing: Cheepa family dyers, Kala Dera, Rajasthan, India, film still\nAlthough the exhibition’s subtitle, The Natural History of American Textiles, has the air of a college course and seems to promise a definitive deep dive, it’s actually more of an introductory sampler. A smattering of interesting tidbits on a wide range of topics (e.g., global trade, slave labor, the invention of the cotton gin, 19th-century herbaria, flower symbolism) pepper the wall texts. Many of these factoids could be the seeds for spinoff shows — and, taken together, could veer the curation into a muddled mess. But, like the “Philadelphia Pavement Quilt” (c. 1930) — which looks like a tidy grid of tiny, precise squares up close, but reveals its dazzling composition anew from a distance — the exhibition comes into focus on different levels. A slow, close viewing, spent absorbing each label and examining the corresponding details of the quilts, illustrations, and swatches, uncovers a web of connections between materials and methods, technology and trade, plants and people — and, ultimately, the hive of activity wrapped up in each quilt’s physical history. The gorgeous, well-considered selection of quilts also coheres on a purely visual level, as flowers, leaf motifs, and fabric scraps pinwheel across the surfaces.\nThe eclectic threads of An Ecology of Quilts merge to tell a story that starts outdoors, with seeds sprouting, blooming, and reaching toward the sun. Whether driven by a desire to document the beauty of flowers, turn castoff fabric fragments into cozy bedcovers, or harness the colors hidden inside plants, the show invites viewers to see the myriad ways that human ingenuity has interlaced with natural forces to shape quilting as an expressive American art form.\n\nInstallation view of An Ecology of Quilts: The Natural History of American Textiles at the American Folk Art Museum \n“Philadelphia Pavement Quilt” (c. 1930), cotton\n“Philadelphia Pavement Quilt,” detail \nNicolas Regnault, from La botanique mise à la porteé de tout le monde; ou, Collection des plantes d’usage dans la médecine, dans les alimens et dans les arts (1774), hand-colored engravings\nLabel illustration: “The Nopal plant that is grown in America and produces seed,” from Reports on the History, Organization, and Status of Various Catholic Dioceses of New Spain and Peru (1620–49), watercolor on paper\nInstallation view of An Ecology of Quilts: The Natural History of American Textiles at the American Folk Art Museum \n“Log Cabin Variation Quilt,” detail (c. 1900), cotton, linen, wool, and synthetic fabrics\nAn Ecology of Quilts: The Natural History of American Textiles continues at the American Folk Art Museum (2 Lincoln Square, Lincoln Square, Upper West Side, Manhattan) through March 1, 2026. The exhibition was curated by Emelie Gevalt and Austin Losada.\n\t\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\tWhen Julie Smith Schneider isn’t writing and editing, she’s carrying on her family’s pun tradition, making custom GIFs, or scheming in her cozy art studio. Keep up with her latest projects on Instagram.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\tMore by Julie Schneider\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\n\t\t\t\t\n\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Celebrating the Science of Quilts",
      "image": [
        "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/10/An-Ecology-of-Quilts-at-AFAM-17.jpg?fit=2500%2C1668&quality=90&ssl=1"
      ],
      "datePublished": "2025-10-19T20:01:00.000Z",
      "dateModified": "2025-10-19T20:01:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How Takako Yamaguchi Subverts the Seascape",
    "url": "https://hyperallergic.com/1048480/how-takako-yamaguchi-subverts-the-seascape-moca-los-angeles/",
    "image": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/10/Yamaguchi_Stitch.jpg?fit=2400%2C2020&quality=90&ssl=1",
    "tag": "Culture",
    "date": "2025-10-19T20:00:00.000Z",
    "description": "\n\t\t\t\n\t\t\t\t\t\t\tTakako Yamaguchi, \"Stitch\" (2023), oil and metal leaf on canvas, 42 × 50 inches (106.7 × 127 cm) (all photos David S. Rubin/Hyperallergic)",
    "body": "\n\t\t\t\n\t\t\t\t\t\t\tTakako Yamaguchi, \"Stitch\" (2023), oil and metal leaf on canvas, 42 × 50 inches (106.7 × 127 cm) (all photos David S. Rubin/Hyperallergic)\n\t\t\t\n\t\t\t\t\n\n\t\nWhat makes a seascape? In this focus exhibition of 10 recent paintings at the Museum of Contemporary Art, veteran Los Angeles artist Takako Yamaguchi subverts the traditional notion. Rather than base her imagery on observations of the natural world, she takes the opposite approach and practices what she calls “abstraction in reverse.” Recognizing that early European and American Modernists derived their geometric or organic forms from nature, she instead begins by using abstract shapes to construct calm seascapes, with horizon lines bisecting each composition into two equal sections. She superimposes additional abstract imagery reflecting her love of pattern and decoration, fashion, and her concept of beauty, some loaded with symbolic associations.\nIn “Stitch” (2023), a brown rectangle suggests the presence of a beachfront, the ocean is divided into horizontal registers made up of undulating lines and interlocking zigzags, and clouds have been replaced by an expansive braid that the walls points out recalls a close-up of those feminized materials of hair or fabric. Easily perceived as separate elements, Yamaguchi’s abstract and figurative configurations do not really interact. Rather, they peacefully coexist as two worlds in one, as nature and culture.\n\nTakako Yamaguchi, “Trap” (2024), oil and metal leaf on canvas, 60 × 40 inches (152.4 × 101.6 cm)\nYamaguchi’s image lexicon also includes architectural columns, fountains, and geometric patterns derived from historical Japanese art, as in Ukiyo-e prints or folding screens. The latter influence is particularly evident in “Trap” (2024), where swirling cloud formations inhabit the sky and rhythmic waves swirl in the center like the codependent halves of a yin-yang symbol. A similar effect is at play in “Accomplice” (2025), where two Greek columns have been whimsically anthropomorphized such that they appear to be snuggling.\nIndeed, Yamaguchi is at her best when letting her imagination run rampant. This might be most clearly seen in her fantastic biomorphic creatures that seem to have risen from the ocean depths, blocking our views of distant horizons. Hybrids of architectural motifs and feminine symbols, such as flowing hair or wombs, the vibrant, energetic biomorphs in “Guide” (2023), “Pilot” (2024), and “Plenum” (2024) occupy entire foregrounds, commanding our attention like actors on a stage, the seascape behind functioning like a scenic backdrop. Delightfully surreal, these creatures evoke associations with Japanese anime and classic horror films. By contrast, the decorative structures in “Procession” and “Font” (both 2024) function more like gateways through which we can envision journeying across the waters. \nMelding abstraction with figuration through an idiosyncratic language that draws from Euroamerican Modernism and Japanese woodblock prints and pop culture alike, Yamaguchi effectively liberates herself from such distinctions, creating fresh compositions that are at once serene and animated.\n\nTakako Yamaguchi, “Guide” (2023), oil and metal leaf on canvas, 42 × 50 inches (106.7 × 127 cm)\nTakako Yamaguchi, “Font” (2024), oil and metal leaf on canvas, 60 × 40 inches (152.4 × 101.6 cm)\nTakako Yamaguchi, “Accomplice” (2025), oil and metal leaf on canvas, 50 × 42 inches (127 × 106.7 cm)\nMOCA Focus: Takako Yamaguchi continues at the Museum of Contemporary Art, Los Angeles (250 South Grand Avenue, Downtown Los Angeles) through January 4, 2026. The exhibition was curated by Anna Katz and Emilia Nicholson-Fajardo.\n\t\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\tDavid S. Rubin is a curator, writer, and artist based in Los Angeles. He has held curatorial positions at MOCA Cleveland, CAC New Orleans, Phoenix Art Museum, and other museums and art institutions. He...\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\tMore by David S. Rubin\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\n\t\t\t\t\n\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How Takako Yamaguchi Subverts the Seascape",
      "image": [
        "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/10/Yamaguchi_Stitch.jpg?fit=2400%2C2020&quality=90&ssl=1"
      ],
      "datePublished": "2025-10-19T20:00:00.000Z",
      "dateModified": "2025-10-19T20:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]