[
  {
    "title": "Mark Twain Wrote the First Book Ever Written With a Typewriter",
    "url": "https://www.openculture.com/2025/10/mark-twain-wrote-the-first-book-ever-written-with-a-typewriter.html",
    "image": "https://cdn8.openculture.com/2025/10/12215703/twain-type-fb-1024x685.png",
    "tag": "Culture",
    "date": "2025-10-13T08:00:22.000Z",
    "description": "\n\tin History, Literature |   \tOctober 13th, 2025  Leave a Comment\n\t\n\t\t\t\nMy Pen­guin Clas­sics copy of Mark Twain’s Life on the Mis­sis­sip­pi sits alo",
    "body": "\n\tin History, Literature |   \tOctober 13th, 2025  Leave a Comment\n\t\n\t\t\t\nMy Pen­guin Clas­sics copy of Mark Twain’s Life on the Mis­sis­sip­pi sits alone atop an over­full shelf. There is a book­mark on page 204, exact­ly halfway through, torn from an in-flight duty-free catalog—whiskey and fan­cy pens. It tells me “hey, you for­got to fin­ish this, you [var­i­ous obscen­i­ties].” And I shrug. What can I say? I went to grad school, where I learned to read ten books at once and nev­er fin­ish one. Good thing Mark Twain didn’t write that way, or we might not have Life on the Mis­sis­sip­pi.\nTwain was a dili­gent and con­sci­en­tious writer with a mem­o­ry like a bear trap, or at least that’s what he want­ed us to think. But some­where in his rem­i­nis­cence he may have been con­fused. Twain wrote in his 1904 auto­bi­og­ra­phy that his first nov­el writ­ten on a type­writer—the first type­writ­ten nov­el at all—was Tom Sawyer.\nWas this so? Twain pur­chased his first type­writer (which prob­a­bly looked like the Sholes and Glid­den seen here) in 1874 for $125. In 1875, he writes in a let­ter to the Rem­ing­ton com­pa­ny that he is no longer using his type­writer; it cor­rupts his morals because it makes him want to swear. He gives the infer­nal machine away, twice. It returns to him each time.\nThe year after Twain’s moral trou­ble with his Rem­ing­ton, Tom Sawyer is pub­lished from hand­writ­ten man­u­script, not typed. Then, sev­en years lat­er, Life on the Mis­sis­sip­pi (1883) comes to the pub­lish­er in type­script. Twain did not type it himself—he had pre­sum­ably renounced the act—but he dic­tat­ed the mem­oir to a typ­ist from a hand­writ­ten draft. Now, I can hear you quib­bling…  Life on the Mis­sis­sip­pi isn’t a nov­el at all! Well, okay, fair enough. Let’s just say it’s the first type­writ­ten book and call it a day, eh? Go read this excel­lent New York­er piece on the ear­ly life of the type­writer and leave me alone. I’ve got a book to fin­ish.\nNote: An ear­li­er ver­sion of this post appeared on our site in 2013.\n\nIf you would like to sign up for Open Culture’s free email newslet­ter, please find it here. It’s a great way to see our new posts, all bun­dled in one email, each day.\nIf you would like to sup­port the mis­sion of Open Cul­ture, con­sid­er mak­ing a dona­tion to our site. It’s hard to rely 100% on ads, and your con­tri­bu­tions will help us con­tin­ue pro­vid­ing the best free cul­tur­al and edu­ca­tion­al mate­ri­als to learn­ers every­where. You can con­tribute through Pay­Pal, Patre­on, and Ven­mo (@openculture). Thanks!\nRelat­ed Con­tent:\nMark Twain Makes a List of 60 Amer­i­can Com­fort Foods He Missed While Trav­el­ing Abroad (1880)\nDis­cov­er Friedrich Nietzsche’s Type­writer, the Curi­ous “Malling-Hansen Writ­ing Ball” (Cir­ca 1881)\nMark Twain & Helen Keller’s Spe­cial Friend­ship: He Treat­ed Me Not as a Freak, But as a Per­son Deal­ing with Great Dif­fi­cul­ties\nThe Only Footage of Mark Twain: The Orig­i­nal & Dig­i­tal­ly Restored Films Shot by Thomas Edi­son\nJosh Jones is a writer and musi­cian based in Durham, NC. \n\t\t\n        \t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Mark Twain Wrote the First Book Ever Written With a Typewriter",
      "image": [
        "https://cdn8.openculture.com/2025/10/12215703/twain-type-fb-1024x685.png"
      ],
      "datePublished": "2025-10-13T08:00:22.000Z",
      "dateModified": "2025-10-13T08:00:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The 1976 Synth Album That Promised to Help Your Plants Grow: Discover Mother Earth’s Plantasia",
    "url": "https://www.openculture.com/2025/10/mother-earths-plantasia.html",
    "image": "https://cdn8.openculture.com/2025/10/13000938/plant-1024x576.jpg",
    "tag": "Culture",
    "date": "2025-10-13T09:00:24.000Z",
    "description": "\n\t\t\t\n\n\t\n\nIn 1973, Peter Tomp­kins and Christo­pher Bird’s The Secret Life of Plants became a best­seller. Draw­ing from the results of sci­en­tif­ic s",
    "body": "\n\t\t\t\n\n\t\n\nIn 1973, Peter Tomp­kins and Christo­pher Bird’s The Secret Life of Plants became a best­seller. Draw­ing from the results of sci­en­tif­ic stud­ies about whose replic­a­bil­i­ty we may now feel cer­tain doubts, the book sug­gest­ed that emo­tion, and indeed sen­tience, belong not just to humans and ani­mals, but also to, say, the pot­ted fern in your liv­ing room. Many of Tomp­kins and Bird’s read­ers must have owned such a plant, and prob­a­bly a vari­ety of oth­ers besides, giv­en the nine­teen-sev­en­ties’ fad for domes­tic veg­e­ta­tion. Though ridiculed in the major media, The Secret Life of Plants proved suf­fi­cient­ly in tune with its time to inspire a fea­ture-length doc­u­men­tary film with a high-tech sound­track by none oth­er than Ste­vie Won­der.\nDid Won­der ever hear the album Moth­er Earth­’s Plan­ta­sia? Sub­ti­tled Warm Earth Music for Plants… and the Peo­ple Who Love Them, the album also fea­tures elec­tron­ic com­po­si­tions — exclu­sive­ly elec­tron­ic com­po­si­tions, in fact, per­formed entire­ly with a Moog syn­the­siz­er. Its com­pos­er Mort Gar­son had been a ver­sa­tile pro­fes­sion­al in the world of what was then called “easy lis­ten­ing,” and worked on the writ­ing, arrange­ment, or pro­duc­tion of pop­u­lar songs like Bren­da Lee’s “Dyna­mite,” Ruby & The Roman­tics’ “Our Day Will Come,” The Sand­pipers’ “Guan­tanam­era,” and Bill With­ers’ “Three Nights and a Morn­ing.” Upon meet­ing Robert Moog him­self at a con­ven­tion in 1967, Gar­son seems to have under­gone a con­ver­sion, becom­ing one of the first com­posers to ded­i­cate him­self to explor­ing the musi­cal poten­tial of the then-nov­el syn­the­siz­er tech­nol­o­gy.\n\n\n\t\n\nThe music Gar­son went on to make with his Moog reflects the zeit­geist: there was Elec­tron­ic Hair Pieces, with ver­sions of num­bers from the musi­cal Hair, a series of twelve discs based on the signs of the zodi­ac, and even the score that accom­pa­nied the Apol­lo 11 moon land­ing broad­cast. Of par­tic­u­lar inter­est to ear­ly elec­tron­ic music buffs is Black Mass, for which Gar­son took the pseu­do­nym Lucifer, and which ought to be worth adding to one’s library with Hal­loween com­ing up.\nMoth­er Earth­’s Plan­ta­sia was released in 1976, three years before the Secret Life of Plants movie, though released may not be the right word: it could only be obtained free with pur­chase of either a house­plant from a shop called Moth­er Earth on Mel­rose Avenue in Los Ange­les or a Sim­mons mat­tress from Sears. As music YouTu­ber David Hart­ley explains in his lat­est video, Gar­son was asked to cre­ate an album of music con­ducive to plant growth by Moth­er Earth­’s own­ers, Lynn and Joel Rapp.\n\n\n\t\n\nFor decades there­after, Moth­er Earth­’s Plan­ta­sia could pre­sum­ably be encoun­tered by seri­ous crate-dig­gers: the Phar­cyde, for exam­ple, sam­pled one of its tracks on “Guestlist” in 2000. But it was only in the twen­ty-tens, after the estab­lish­ment of YouTube and its obscure-music-upload­ing cul­ture, that the album found an audi­ence appre­cia­tive enough to inspire a prop­er release. (Its redis­cov­ery played out sim­i­lar­ly to that of Mariya Takeuchi’s “Plas­tic Love,” the gold­en tip of the Japan­ese city pop revival.) Its tracks even­tu­al­ly even appeared in ad cam­paigns for Tur­b­o­Tax and the French super­mar­ket chain Inter­marché. To lis­ten­ers today, they may sound uncan­ni­ly like video game music as it would take shape in the eight­ies, albeit with a soft-edged ana­log tex­ture. As far as whether it actu­al­ly helps plants grow, even Joel Rap­p’s lin­er notes can only man­age the promise that “it could­n’t pos­si­bly hurt.” But I can report that it does a decent job putting my infant twins to sleep.\nRelat­ed Con­tent:\nHow the Moog Syn­the­siz­er Changed the Sound of Music\nGraph­ic Shows the House Plants That Nat­u­ral­ly Clean the Air in Your Home, Accord­ing to a NASA Study\nMoog This!: Hear a Playlist Fea­tur­ing 36 Hours of Music Made with the Leg­endary Ana­log Syn­the­siz­er\nPlants Emit High-Pitched Sounds When They Get Cut, or Stressed by Drought, a New Study Shows\nWendy Car­los’ Switched on Bach Turns 50 This Month: Learn How the Clas­si­cal Synth Record Intro­duced the World to the Moog\nA Shaz­am for Nature: A New Free App Helps You Iden­ti­fy Plants, Ani­mals & Oth­er Denizens of the Nat­ur­al World\nBased in Seoul, Col­in Marshall writes and broad­casts on cities, lan­guage, and cul­ture. His projects include the Sub­stack newslet­ter Books on Cities and the book The State­less City: a Walk through 21st-Cen­tu­ry Los Ange­les. Fol­low him on the social net­work for­mer­ly known as Twit­ter at @colinmarshall.\n\t\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The 1976 Synth Album That Promised to Help Your Plants Grow: Discover Mother Earth’s Plantasia",
      "image": [
        "https://cdn8.openculture.com/2025/10/13000938/plant-1024x576.jpg"
      ],
      "datePublished": "2025-10-13T09:00:24.000Z",
      "dateModified": "2025-10-13T09:00:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Armed with Scraps, Lydia Ricci Builds a World of Messy Miniatures",
    "url": "https://www.thisiscolossal.com/2025/10/lydia-ricci-from-scraps-sculptures/",
    "image": "https://www.thisiscolossal.com/wp-content/uploads/2025/10/ricci-11.jpg",
    "tag": "Culture",
    "date": "2025-10-12T16:10:30.000Z",
    "description": "\n\n\t\nFor Lydia Ricci, a broken pencil, outdated forms, long-ago paid bills, and tattered bits of fabric are prime materials for her elaborate, small-sc",
    "body": "\n\n\t\nFor Lydia Ricci, a broken pencil, outdated forms, long-ago paid bills, and tattered bits of fabric are prime materials for her elaborate, small-scale worlds. The artist credits her parents’ obsession with collecting as the beginning of what’s grown into a scrap-centric process. \n“My mother was an immigrant from the Ukraine who could improvise anything when we didn’t have exactly what we needed, which was most of the time. And my Italian father hasn’t ever thrown anything away because one day it might be useful, or some day he might get around to fixing it,” she writes.\nDetail of “It’s What’s Inside” (2025), collected scrap materials, 10 x 38 x 13 centimeters\nToday, Ricci pieces together bits and baubles collected for the past 30 years that many other artists might relegate to the trash. Cardboard, candy wrappers, vintage tumblers, and so much more form uncanny miniatures that she refers to as “observations of what people anticipate, complain about, or muse over. Fleeting, unscripted exchanges—mundane yet deeply human—are a continual source of inspiration.”\nMeticulous and playful, the resulting sculptures retain a messy, raw quality that is itself a collection of the original materials. Rather than mask irregularities and signs of wear, Ricci leaves traces of chaos and disorder that capture an authentic quality of modern life.\nFind much more from the artist on Instagram.\n“It’s What’s Inside” (2025), collected scrap materials, 10 x 38 x 13 centimeters\n“That’s Everything” (2024), collected scrap materials, 30 x 35 x 16 centimeters\n“They Were Just Playing” (2024), vintage red Pizza Hut tumblers and collected scrap materials, 90 x 40 x 40 centimeters\nDetail of “They Were Just Playing” (2024), vintage red Pizza Hut tumblers and collected scrap materials, 90 x 40 x 40 centimeters\nDetail of “They Made It Look So Easy” (2024), collected scrap materials, 22 x 26 x 15 centimeters\n“We Should Have Taken Better Care of It” (2023), collected scrap materials, 8  x 8 x 10 centimeters\n“How Did You Get So Good?” (2024), Ukrainian embroidery and collected scrap materials, 8 x 8 x 21 centimeters\n“Take a Turn” (2025), collected scrap materials, 80 x 46 x 5 centimeters\nDetail of “Take a Turn” (2025), collected scrap materials, 80 x 46 x 5 centimeters\n“I Think We Got Disconnected” (2025), collected scrap materials, 22 x 32 x 20 centimeters\n\t\n\t\n\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Armed with Scraps, Lydia Ricci Builds a World of Messy Miniatures",
      "image": [
        "https://www.thisiscolossal.com/wp-content/uploads/2025/10/ricci-11.jpg"
      ],
      "datePublished": "2025-10-12T16:10:30.000Z",
      "dateModified": "2025-10-12T16:10:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "For Duane Linklater, It’s a Buffalo’s World",
    "url": "https://hyperallergic.com/1047949/for-duane-linklater-its-a-buffalos-world-dia-chelsea/",
    "image": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/10/DSC06914.jpeg?fit=1616%2C1080&quality=90&ssl=1",
    "tag": "Culture",
    "date": "2025-10-12T19:59:00.000Z",
    "description": "\n\t\t\t\n\t\t\t\t\t\t\tPerformance of “bison bison (dance_hum for dirtbath),” written and choreographed by Tanya Lukin Linklater as part of Duane Linklater: 12 +",
    "body": "\n\t\t\t\n\t\t\t\t\t\t\tPerformance of “bison bison (dance_hum for dirtbath),” written and choreographed by Tanya Lukin Linklater as part of Duane Linklater: 12 + 2 at Dia Chelsea (all photos Hrag Vartanian/Hyperallergic, unless otherwise noted)\n\t\t\t\n\t\t\t\t\n\n\t\nIn a conversation with Duane Linklater published in the brochure for his current exhibition, 12 + 2, at Dia Chelsea, filmmaker and scholar Tasha Hubbard (Peepeekisis First Nation) distills the intertwined erasures effected under colonialism in North America. Over the course of the 19th century, parallel to the systematic literal and cultural genocide of Native people, settlers killed millions of buffalo, till there remained only a few hundred; even now, when other large game populations are rebounding as part of free-ranging herds, buffalo are for the most part only allowed on private land, national parks, or reservations. “Indigenous people and buffalo are conflated in the settler mind and have been from the beginning; we are buffalo, and they are us,” she said. “And so, just like settler colonialism needs Indigenous people to be constrained and contained, it’s the same for buffalo.” \nLinklater not only lets buffalo run free in 12 + 2, conceptually at least, but in the installation, performance, and paintings on view he also reimagines the world in their terms. Given the mutual identification, coexistence, and interdependence between Native people and the species across millennia, the move is an act of imagining the Earth in and through a lens of Indigeneity. Seven of the beasts, which the artist fashioned out of wire and papier-mâché before scaling them up to two or three times their natural size, make themselves at home in two vast galleries (together they’re titled “wallowposition”). Their faceted planes and visible seams where components connect give them a slightly robot-like appearance. They are eyeless, featureless really, covered in dun-colored plaster that mimics mud. But they are also vivid, animate, and expressive — adorable, even. One kneels on its front legs, perhaps drinking water. Another has plopped itself on its side, legs flailing in the air. Yet another, an adolescent with long legs and a head smaller than the rest, seems to be caught mid-trot, while a baby sploots on the floor. \nInstallation view Duane Linklater: 12 + 2 at Dia Chelsea (© Duane Linklater, photo Bill Jacobson Studio, New York; courtesy Dia Art Foundation)\nThey are wallowing: rolling in the dirt, getting rid of critters on their coats, cooling off, smelling smells, picking up grass seeds that will fall off their bodies later, ensuring the spread of prairie grasses and brush. It is an instinctual, pleasurable behavior in which, according to curator Matilde Guidelli-Guidi, the animals do not indulge under conditions of captivity or duress. \nWhat does it take for buffalo to be at home, to be in an environment where they can not merely survive — which they’ve done despite the best efforts of American colonizers — but thrive? And by extension, what does it take for these sculpted buffalo, made by an artist who is Omasekêko Ininiwak from Moose Cree First Nation, to be at home in this art institution? \nLinklater undertakes a process of worldbuilding at Dia, a foundation that has historically supported artists (Smithson, Holt, De Maria, Heizer) who as often as not failed to register that the land they co-opted as site and material was and is homeland to Native people. The foundation, moreover, occupies an industrial space built upon layers and layers of history and topography, including Lenape tobacco fields. Linklater remaps the Chelsea space not only by turning it into a virtual prairie, marked out by the presence of buffalo, but also by extracting 12 cylindrical cores from the floor and substrate and replacing them with soil and granite discs from near his home in Northern Ontario. Two other boreholes remain empty, covered with glass so visitors can see what’s below. The 12 pieces of granite, arranged in a circle that transverses the two rooms, together with the two boreholes (the “12 + 2” of the piece’s title and that of the exhibition as a whole), mark out the pole placement of a teepee, an arrangement with cosmological significance — yet another form of mapping; one of Linklater’s cochineal-stained, charcoal-marked teepee covers, “parliament,” hangs from the rafters in the second gallery. The dug-up slag and concrete are presented in a steel trough nearby. The intervention recalls Robert Smithson’s “non-sites,” for which he brought materials like coal and rocks gathered from industrial wastelands in New Jersey and elsewhere into the gallery, connecting the white box to the outside world and to both the present and a deep geological past. But instead of merely bringing the outside in, Linklater also drills down, forcing us to deal with a very human-scaled chronology of displacement. \nPerformance of “bison bison (dance_hum for dirtbath),” written and choreographed by Tanya Lukin Linklater as part of Duane Linklater: 12 + 2 at Dia Chelsea. On the wall in the background is Duane Linklater’s “wallowwallow” \nDespite his buffaloes’ monumentality, Linklater preserves the galleries’ vast openness to accommodate the work’s crucial performance component. On Saturdays afternoons, “bison bison (dance_hum for dirtbath)” takes place, written and choreographed by the artist Tanya Lukin Linklater, Duane Linklater’s wife and frequent collaborator. Over the course of 44 minutes, dancers pace around the room, experiencing this virtual landscape the way buffalo might. At times they undertake activities meant to honor or map it, as when a performer makes charcoal rubbings of the granite plugs in the floor. Their activities drive the music, “buffalounit,” composed by eagleswitheyesclosed (a collaboration between Linklater and his son Tobias) and played by a drummer, cellist, and bass guitarist. Over seven weeks, the number of dancers and musicians will winnow away, ending with a single percussionist and a single figure in motion.\nRendered in oil stick, paint, and graphite on three panels, “kitaskînaw_kitaskînawâw (every indian I know hates that song)” — the song in the title is, I suspect, the classic anthem of westward expansion, “Home on the Range” — recalls the history of abstract painting through its gestural strokes in red, white, and blue (plus touches of browns and beige) and size (it measures around 11 by 6.5 feet). But the marks also coalesce into a duck-rabbit image of a buffalo laying on its side and a rough map of the North American continent. In the other gallery is “wallowwallow,” a circular form made of soil, hay, clay, and brown, gray, and blue pigment on steel and surrounded by a halo applied directly to the brick wall. It is meant to suggest the hollows the buffalo make as they roll around on the soil, reshaping the landscape as they go, but it also reads as the Earth seen from space. Linklater ties the well-being of his buffalo to that of the Indigenous people with whom they have long lived symbiotically — and even to that of the world itself — not in nostalgic terms but in futurist ones via robotic buffalos and titles that suggest computer file names. As a whole, 12 + 2 seems to point us to an important truth: We live in a world that buffalo create. \n\nA buffalo sculpture from the installation “wallowposition” in Duane Linklater: 12 + 2 at Dia Chelsea \nPerformance of “bison bison (dance_hum for dirtbath),” written and choreographed by Tanya Lukin Linklater as part of Duane Linklater: 12 + 2 at Dia Chelsea \nA buffalo sculpture from the installation “wallowposition” in Duane Linklater: 12 + 2 at Dia Chelsea\nInstallation view Duane Linklater: 12 + 2 at Dia Chelsea (© Duane Linklater, photo Bill Jacobson Studio, New York; courtesy Dia Art Foundation)\nA buffalo sculpture from the installation “wallowposition” in Duane Linklater: 12 + 2 at Dia Chelsea\nDuane Linklater: 12 + 2 continues at Dia Chelsea (537 West 22nd Street, Chelsea, Manhattan) through January 24, 2026. The exhibition was curated by Matilde Guidelli-Guidi.\n\t\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\tAruna D’Souza is the author of Whitewalling: Art, Race & Protest in 3 Acts and Imperfect Solidarities, editor of Linda Nochlin’s Making It Modern: Essays on the Art of the Now, and co-curator...\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\tMore by Aruna D’Souza\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\n\t\t\t\t\n\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "For Duane Linklater, It’s a Buffalo’s World",
      "image": [
        "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/10/DSC06914.jpeg?fit=1616%2C1080&quality=90&ssl=1"
      ],
      "datePublished": "2025-10-12T19:59:00.000Z",
      "dateModified": "2025-10-12T19:59:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Hispanic Society to Sell Dozens of Artworks From Its Collection",
    "url": "https://hyperallergic.com/1048856/hispanic-society-to-sell-dozens-of-artworks-from-its-collection/",
    "image": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/10/Workshop-of-El-Greco-Christies-Hispanic-Society-Oct-2025-1.jpg?fit=1940%2C1309&quality=90&ssl=1",
    "tag": "Culture",
    "date": "2025-10-12T20:00:00.000Z",
    "description": "\n\t\t\t\t\n\n\t\n “Saint Dominic in Prayer,” painted in the workshop of El Greco, is expected to sell for over $150,000 (all images courtesy Christie’s)\nThe H",
    "body": "\n\t\t\t\t\n\n\t\n “Saint Dominic in Prayer,” painted in the workshop of El Greco, is expected to sell for over $150,000 (all images courtesy Christie’s)\nThe Hispanic Society Museum and Library in Upper Manhattan is deaccessioning dozens of European Old Master works, including a painting from the workshop of El Greco, to raise money for collection care and acquisitions. \nFounded in 1904 with the intent to “advance the study of the Spanish and Portuguese languages, literature, and history,” the museum is selling 45 paintings of predominantly religious and aristocratic subjects from its collection in an online auction closing on October 17. \nThe works are being offered through Christie’s in a “special strategic deaccessioning sale” because they were found to be outside of the museum’s core mission as it attempts to “responsibly diversify” its collection, according to a press release shared with Hyperallergic. The institution did not respond to a request for comment inquiring about more specific plans for the funds from the sale. \n\nClemente Del Camino y Parladé’s “El Columpio (The Swing)\nThe museum holds a first-edition copy of Don Quixote and a world map dated 1529, and hosts events geared toward the Washington Heights neighborhood in Upper Manhattan, listed as a “Dominican Historic District” on the National Register of Historic Places. \nThe works for sale include paintings from the Spanish School of the late-16th and 17th centuries, a Hispano-Flemish rendering of Saint Sebastian, and pieces from the Central Italian School. “Saint Dominic in Prayer,” from the workshop of the Spanish Renaissance artist known widely as El Greco, is expected to fetch over $150,000, with the current highest bid at $160,000.\nThe American Alliance of Museums (AAM) has strict requirements for how accredited museums can use deaccessioning funds, but collection care is one of the organization’s approved uses. Under the organization’s guidelines, museums can sell works when objects are redundant, damaged, or of “poor quality.”\nAccording to AAM, museum deaccessioning can be an indicator that an institution “has not been adequately supported for many years.”\n\n“Portrait of Emperor Charles V in an Armchair” after the Italian painter Tiziano Vecellio, also known as Titian\nAnother highlighted work in the sale is “Portrait of Emperor Charles V in an Armchair,” a modern copy made after Titian’s work of the same title. Other lots in the sale include an undated portrait of Isabella of Portugal, by a follower of Titian, currently bidding at $9,500; a Madonna and child after Luis de Morales; and Seville 20th-century painter Clemente Del Camino y Parladé’s “El Columpio (The Swing).”\nThe works will remain on view at Christie’s headquarters in Manhattan’s Rockefeller Center until October 15.\n\t\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\tIsa Farfan is a staff reporter for Hyperallergic. In May 2024, she graduated from Barnard College, where she studied Political Science and English and served as the Columbia Daily Spectator's Arts &...\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\tMore by Isa Farfan\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\n\t\t\t\t\n\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Hispanic Society to Sell Dozens of Artworks From Its Collection",
      "image": [
        "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/10/Workshop-of-El-Greco-Christies-Hispanic-Society-Oct-2025-1.jpg?fit=1940%2C1309&quality=90&ssl=1"
      ],
      "datePublished": "2025-10-12T20:00:00.000Z",
      "dateModified": "2025-10-12T20:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This Indigenous Peoples’ Day, Let’s Support Native Art",
    "url": "https://hyperallergic.com/1048921/this-indigenous-peoples-day-lets-support-indigenous-art/",
    "image": "https://hyperallergic-newspack.s3.amazonaws.com/uploads/2025/10/IMG_6452-scaled.jpeg",
    "tag": "Culture",
    "date": "2025-10-12T19:58:00.000Z",
    "description": "\n\t\t\t\n\t\t\t\t\t\t\tJaune Quick-to-See Smith, \"Indian Map\" (1992) in the exhibition Memory Map at the Whitney Museum of American Art in 2023 (photo Hrag Varta",
    "body": "\n\t\t\t\n\t\t\t\t\t\t\tJaune Quick-to-See Smith, \"Indian Map\" (1992) in the exhibition Memory Map at the Whitney Museum of American Art in 2023 (photo Hrag Vartanian, Hyperallergic)\n\t\t\t\n\t\t\t\t\n\n\t\nThis summer, I took Diné Bizaad (Navajo language) and Diné history classes at Diné College in Tsaile, Arizona, on the Navajo Nation. My time there reminded me of Indigenous tenacity — the quiet, daily work of Native language and history professors, art teachers, staff, and students who sustain culture from within. Their commitment keeps Indigenous languages, knowledge systems, and creative practices alive for future generations. \nAs Native American people, many of our ancestors survived their own versions of erasure under colonial rule. This Indigenous Peoples’ Day, we are witnessing another chapter of that same violence unfold in Palestine — an all-too-familiar attempt at genocide, streamed to us in real time. At home, the ongoing American colonial project continues to meet resistance, a presence I felt in the classrooms of Diné College. My Diné grandparents were forced to leave their Diné Bizaad-speaking families as young children to attend Christian, English-speaking boarding schools sanctioned by the United States government. Shimásání (my grandmother) always encouraged me to learn Diné Bizaad and Diné history. Our ancestors’ strength laid the road for us, and it’s our responsibility to walk it with that same courage. \nFrom the classrooms of tribal colleges to the galleries of major museums, Indigenous perseverance continues to shape art and culture. Building on generations of resilience, contemporary Native artists are asserting their presence boldly across institutions. Jeffrey Gibson’s (Mississippi Choctaw/Cherokee) bronze animal sculptures currently line The Met’s facade, and his exhibition An Indigenous Present — co-curated with others — features works by 15 Indigenous artists spanning the past century. It’s now on view at the Institute of Contemporary Art, Boston, and will tour nationally. Before she passed earlier this year, Jaune Quick-to-See Smith (Citizen of the Confederated Salish and Kootenai Nation) curated Indigenous Identities: Here, Now & Always at Rutgers University’s Zimmerli Art Museum, featuring 97 living Indigenous artists. Andrea Carlson’s (Grand Portage Ojibwe and European settler descent) first museum survey, A Constant Sky, opened recently at the Denver Art Museum. Kent Monkman (Fisher River Cree Nation) recently opened his largest solo exhibition, History is Painted by the Victors, at the Montreal Museum of Fine Arts. Dyani White Hawk’s (Sičáŋǧu Lakota) Love Language, a major survey of her work, opens October 18 at the Walker Art Center. It’s an exhilarating moment for Native art, as Indigenous voices shape institutions and audiences on a national and international scale.\nFrom left to right: Sháńdíín Brown, Sarah Biscarra Dilley of Forge Project, Laurent Bergeron, and his partner, artist Kent Monkman (photo courtesy Sháńdíín Brown)\nThis Indigenous Peoples’ Day, I encourage readers to support Native-led, non-profit art organizations like Ma’s House, the Institute of American Indian Arts (IAIA), the Aquinnah Cultural Center, the Tomaquag Museum, Forge Project, the Native Arts + Cultures Foundation (NACF), or your local tribal cultural center, museum, or college. These organizations nurture Native artists, thinkers, and culture bearers. Indigenous art and culture are not only surviving, they’re thriving. But sustaining that future requires support. Acknowledging Indigenous Peoples’ Day and Indigenous survivance is a start, but there’s a critical need to turn recognition into tangible action. The next Jeffrey Gibson might be sitting in a classroom at IAIA right now. IAIA’s federal funding remains unstable, a consequence of budget policies initiated under the Trump administration. This instability underscores a larger truth: after generations of using education to erase Native languages, arts, and knowledge systems, today’s federal support for Indigenous-led tribal colleges — spaces now viewed as “DEI” — isn’t an act of goodwill: it’s a legal and treaty-bound obligation. With all the violence and uncertainty in the world, we need Native-led art and culture spaces. Even $10 helps — the price of an iced coffee in New York City. For readers who may not be able to donate, following these organizations on social media and advocating for their funding is another meaningful way to engage. \nAt the past Santa Fe Indian Market, I volunteered with Forge Project to supply free food and cold drinks to vendors. We handed out 1,000 burritos that day. It was a hopeful moment — one rooted in care, kinship, and action. Like the classrooms at Diné College, it reminded me that Indigenous perseverance lives in both the grand moments and smaller, collective acts of generosity. Being together, learning together, and acting together keep my hope strong. A common phrase in Diné Bizaad is “T’áá hó’ájitéégóó,” which loosely translates to “it’s up to you,” a reminder of our personal agency amid the challenges we inherit and the futures we are building.\n\t\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\tSháńdíín Brown is a curator, creative, and citizen of the Navajo Nation from Arizona. She studies multitemporal Native American art and fashion at Yale University. Previously, she was the Assistant...\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\tMore by Sháńdíín Brown\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\n\t\t\t\t\n\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This Indigenous Peoples’ Day, Let’s Support Native Art",
      "image": [
        "https://hyperallergic-newspack.s3.amazonaws.com/uploads/2025/10/IMG_6452-scaled.jpeg"
      ],
      "datePublished": "2025-10-12T19:58:00.000Z",
      "dateModified": "2025-10-12T19:58:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Artist Behind Canterbury Cathedral Installation Responds to JD Vance, Elon Musk’s Criticism: ‘Small Dick Energy’",
    "url": "https://www.artnews.com/art-news/news/canterbury-cathedral-jd-vance-elon-musk-artist-responds-1234756764/",
    "image": "https://www.artnews.com/wp-content/uploads/2025/10/GettyImages-2240418674.jpg?w=1200",
    "tag": "Culture",
    "date": "2025-10-13T14:37:47.000Z",
    "description": "\n\tAlex Vellis, the artist behind a graffiti art installation at Canterbury Cathedral, responded this week to criticism of his work fielded primarily b",
    "body": "\n\tAlex Vellis, the artist behind a graffiti art installation at Canterbury Cathedral, responded this week to criticism of his work fielded primarily by conservative commentators—including Elon Musk and US Vice President JD Vance.\n\n\tThe installation, part of a presentation at the British cathedral called “HEAR US,” features an array of questions posed in response to another query: “What would you ask God?” The work was made via workshops of “marginalized communities—including the Punjabi, black and brown diaspora, neurodivergent individuals, and the LGBTQIA+ population,” per Vellis’s collaborator, Jacqueline Creswell.\n\t\n\n\t\n\t\tRelated Articles\n\t\n\n\n\tIn a font recalling spray-painted tags, the installation includes sentences such as “What is the architecture of heaven?” and “Why are you indifferent to suffering?” These phrases do not appear to have actually been spray-painted onto the historic cathedral’s architecture, however.\n\n\t“It is weird to me that these people don’t see the irony of honoring ‘marginalized communities’ by making a beautiful historical building really ugly,” wrote Vance on X.\n\n\tAlso on X, Musk wrote, “Relentless anti-Western propaganda has made so many people in the West want to suicide their own culture. Unfortunately, propaganda works.”\n\n\tOn Monday, Vellis, a poet, responded on their Instagram Story to Vance and Musk, writing, “After a weekend of people trying to tear me apart online, all I can tell you is that @jdvance and @elonmusk both give off small dick energy.” Vellis ended the post by including #freepalestine.\n\n\tVellis also used that hashtag on another post with a screenshot of a Google search for articles about the installation. “It’s nice to get your work out there, you know?” they wrote.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Artist Behind Canterbury Cathedral Installation Responds to JD Vance, Elon Musk’s Criticism: ‘Small Dick Energy’",
      "image": [
        "https://www.artnews.com/wp-content/uploads/2025/10/GettyImages-2240418674.jpg?w=1200"
      ],
      "datePublished": "2025-10-13T14:37:47.000Z",
      "dateModified": "2025-10-13T14:37:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]