[
  {
    "title": "Langston Hughes’ Homemade Christmas Cards From 1950",
    "url": "https://www.openculture.com/2025/12/langston-hughes-homemade-christmas-cards.html",
    "image": "https://cdn8.openculture.com/2025/12/21200028/Screenshot-2025-12-21-at-8.00.31-PM-1024x600.png",
    "tag": "Culture",
    "date": "2025-12-22T09:00:01.000Z",
    "description": "\n\tin Life, Literature, Poetry |   \tDecember 22nd, 2025  Leave a Comment\n\t\n\t\t\t\nWho doesn’t trea­sure a hand­made present?\nAs the years go by, we may be",
    "body": "\n\tin Life, Literature, Poetry |   \tDecember 22nd, 2025  Leave a Comment\n\t\n\t\t\t\nWho doesn’t trea­sure a hand­made present?\nAs the years go by, we may begin to offload the ill-fit­ting sweaters, the nev­er lit sand cast can­dles, and the Sty­ro­foam ball snow­men. But a present made of words takes up very lit­tle space, and it has the Ghost of Christ­mas Past’s pow­er to instant­ly evoke the sender as they once were.\nSev­en­ty years ago, poet Langston Hugh­es, too skint to go Christ­mas shop­ping, sent every­one on his gift list sim­ple, home­made hol­i­day post­cards. Typed on white card­stock, each signed card was embell­ished with red and green pen­cils and mailed for the price of a 3¢ stamp.\n\n\nAs biog­ra­ph­er Arnold Ram­per­sad notes:\nThe last weeks of 1950 found him nev­er­the­less in a melan­choly mood, his spir­its sink­ing low­er again as he again became a tar­get of red-bait­ing.\nThe year start­ed aus­pi­cious­ly with The New York Times prais­ing his libret­to for The Bar­ri­er, an opera based on his play, Mulat­to: A Tragedy of the Deep South. But the opera was a com­mer­cial flop, and pos­i­tive reviews for his book Sim­ple Speaks His Mind failed to trans­late into the hoped-for sales.\nAlthough he had recent­ly pur­chased an East Harlem brown­stone with an old­er cou­ple who dot­ed on him as they would a son, pro­vid­ing him with a sun­ny, top floor work­space, 1950 was far from his favorite year.\nHis type­writ­ten hol­i­day cou­plets took things out on a jaun­ty note, while pay­ing light lip ser­vice to his plight.\n\nMaybe we can aspire to the same…\nHugh­es’ hand­made hol­i­day cards reside in the Langston Hugh­es Papers in Yale’s Bei­necke Rare Book and Man­u­script Library, along with hol­i­day cards spe­cif­ic to the African-Amer­i­can expe­ri­ence received from friends and asso­ciates.\nvia the Bei­necke Rare Book and Man­u­script Library at Yale Uni­ver­si­ty\nRelat­ed Con­tent: \nLangston Hugh­es Reads Langston Hugh­es\nA Sim­ple, Down-to-Earth Christ­mas Card from the Great Depres­sion (1933)\nHear Neil Gaiman Read A Christ­mas Car­ol Just as Dick­ens Read It\nHow Joni Mitchell’s Song of Heart­break, “Riv­er,” Became a Christ­mas Clas­sic\nAyun Hal­l­i­day is an author, illus­tra­tor, and the­ater mak­er in NYC.\n\t\t\n        \t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Langston Hughes’ Homemade Christmas Cards From 1950",
      "image": [
        "https://cdn8.openculture.com/2025/12/21200028/Screenshot-2025-12-21-at-8.00.31-PM-1024x600.png"
      ],
      "datePublished": "2025-12-22T09:00:01.000Z",
      "dateModified": "2025-12-22T09:00:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'Surreal Salon 18,' Curated by Swoon, to Open at Baton Rouge Gallery with 60+ Artists",
    "url": "https://www.thisiscolossal.com/2025/12/surreal-salon-18-baton-rouge-gallery-swoon/",
    "image": "https://www.thisiscolossal.com/wp-content/uploads/2025/12/Riley.jpg",
    "tag": "Culture",
    "date": "2025-12-22T11:19:00.000Z",
    "description": "\n\n\t\nSurreal Salon, the annual international exhibition celebrating the Pop-surrealism/Lowbrow movement, is returning to Baton Rouge Gallery – center f",
    "body": "\n\n\t\nSurreal Salon, the annual international exhibition celebrating the Pop-surrealism/Lowbrow movement, is returning to Baton Rouge Gallery – center for contemporary art (BRG) for its 18th year. Held in partnership with Louisiana State University (LSU)’s School of Art, the show will be open to all at no cost from January 2 to 25, 2026, in Louisiana’s capital city. \nThis year’s multimedia edition features more than 60 artists from the U.S. and abroad, with pieces hand-picked by the show’s Special Guest Juror, Swoon, from a pool of nearly 800 works via a blind jurying process. \nEvery year, Surreal Salon celebrates the ever-evolving Pop-surrealist/Lowbrow art movement by inviting artists across the globe to submit works for consideration. The resulting selection always features paintings, photography, ceramics, textiles, mixed media works, and more. \nKristin Meyers, “Silenced,” mixed media and found objects, 25 x 16 x 11 inches\nOver the years, Surreal Salon has enlisted internationally renowned artists such as Ron English, Camille Rose Garcia, Marco Mazzoni, Beth Cavener, Greg “Craola” Simkins, and many others to serve as jurors and curate engaging, dynamic collections of work for the show. That tradition was renewed in 2026 as Swoon (a.k.a. Caledonia Curry) stepped into this role.\nCurry is a Brooklyn-based street artist who, drawing on both realistic and fantastical elements, has created immersive installations, wheatpaste portraits, and community-based social justice projects for two decades. Her work has adorned the walls of institutions like New York’s Museum of Modern Art, the Institute of Contemporary Art in Boston, and Tate Modern, while also appearing on the façades of built environments around the world.\nSwoon will give a talk on Monday, January 26, hosted by LSU’s School of Art in conjunction with Surreal Salon 18. Free and open to all, the talk will touch on her career, her work, and her experience selecting the art for this show. \nBefore the exhibition’s closure, BRG will welcome hundreds of guests to channel their own pop-surrealist visions into elaborate costumes at The Surreal Salon Soiree on Saturday, January 24. The night will celebrate the show with live music from the band Bon Bon Vivant, two different DJ sets, food trucks, and several surprises. Tickets are on sale now, starting at just $40.\nTo learn more and to preview the works included in this year’s exhibition, visit batonrougegallery.org.\nPaige DeVries, “Shadow Boxer,” oil on canvas, 60 x 40 inches\nPeyton Pickenpaugh, “Medusa,” fabric, foam, pins, 57 x 46 x 18 inches\nPrimary graphic for Surreal Salon 18 created by artist Marco Mazzoni\n\n\t\n\t\n\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Surreal Salon 18,' Curated by Swoon, to Open at Baton Rouge Gallery with 60+ Artists",
      "image": [
        "https://www.thisiscolossal.com/wp-content/uploads/2025/12/Riley.jpg"
      ],
      "datePublished": "2025-12-22T11:19:00.000Z",
      "dateModified": "2025-12-22T11:19:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "A Letter to Mamdani",
    "url": "https://hyperallergic.com/a-letter-to-mamdani/",
    "image": "/assets/images/news/default.jpg",
    "tag": "Culture",
    "date": "2025-12-22T11:00:14.000Z",
    "description": "\n    \n                Daily Newsletter\n                An appeal to the mayor-elect from an art worker, a controversial nativity scene in Belgium, and",
    "body": "\n    \n                Daily Newsletter\n                An appeal to the mayor-elect from an art worker, a controversial nativity scene in Belgium, and were medieval Psalms elitist? \n            \n                \n                                \n                            \n                \n            \n        \n            In March, I remember looking around the standing-room-only crowd at Nightclub 101 in downtown Manhattan, where a relatively unknown assemblyman named Zohran Mamdani was holding a party-cum-fundraiser. I remember feeling the swell of hope and possibility, thinking — Wow. Am I crazy, or does he maybe have a shot at this thing? He most certainly did. But now comes the real work: upholding that towering vision of transformative reform in all arenas — affordability, housing, education, and the arts. As musician and educator Sami Abu Shumays writes in a moving letter to the new administration about the role of government in arts funding, the city's Department of Cultural Affairs currently gives more money each year to the Metropolitan Museum of Art than it does to every cultural institution in Queens and Staten Island combined. As this year draws to a close, here’s hoping the next one heralds a more equitable and hopeful art world. —Lisa Yin Zhang, associate editor NYC Mayor-Elect Zohran Mamdani addressing his supporters after his historic victory on November 4, 2025. (Photo by Selcuk Acar/Anadolu via Getty Images)Dear Zohran, Don’t Let Art Workers Down\"Arts and culture are the very vehicles through which we express the power to shape our destinies,\" Sami Abu Shumays writes in a missive to New York City Mayor-elect Mamdani. \"We must ensure that every member of our communities can actively participate in artistic and cultural creation and access affordable, local arts programs.\"\n                    \n                    \n                    \n                        \n                            Taxes for Humans: A Radical Reimagining of Financial EmpowermentFor artists, freelancers, and the self-employed, tax season can feel like a looming cloud. A new book by artist-turned-tax-specialist Hannah Cole offers an antidote.\n                        \n                        \n                            Learn more\n                        \n                    \n            NewsMary Anne (photo courtesy NEA)Mary Anne Carter, the Trump-appointed former chair of the National Endowment for the Arts, will return for a second term as the administration continues to gut the agency.    A controversial monument to \"victims of communism\" in Ottawa will be altered after the Canadian government reportedly discovered potential Nazi affiliations among the commemorated individuals.Must-ReadVictoria-Maria Geyer's Christmas nativity scene with faceless characters being unveiled at the Grand-Place in Brussels on November 28 (photo by Nicolas TUCAT / AFP via Getty Images)How a Nativity Scene Sent Europe Into a TizzyA nativity scene made of recycled textiles instead of wood caused a huge controversy after it was displayed in Brussels. Katherine Kelaidis reads this incident in the context of the larger question of whether explicitly Christian imagery should be part of European public spaces, and what form it should take. \n                    \n                    \n                    \n                        \n                            Launch a Community-Centered Design Career with an MDes From the University of ArkansasThe two-year, tuition-free Master of Design in Communication Design program blends studio-driven research, community engagement, and advanced design practice.\n                        \n                        \n                            Learn more\n                        \n                    \n            Lorin Duckman on Lisa Yin Zhang's \"The Trump Administration Looks Even Worse Up Close\":The images scared me, because these people who have the fate of the world in their hands, lack a love for humanity. No dignity. Just power. The photographer saw them for who they are and they saw him as a person with a camera. So goes our art. Arnold Newman (remembering his portrait of Krupp who had been pardoned and given back his industrial estate) lies smiling in his grave, his joy tempered only by the violence at Brown, Bondi Beach and the Reiner home.From Our CriticsMaster of Saint Augustine, \"Scenes from the Life of St. Augustine of Hippo\" (c. 1490), central panel of a triptych Belgium, Bruges (photo courtesy the Morgan Library & Museum)Medieval Psalms Were Not For EveryoneMedievalist Tamar Boyadjian certainly knows her stuff — in this review, she argues that the Morgan Library & Museum's exhibition Sing a New Song: The Psalms in Medieval Art and Life focuses more on the luxurious visual object than the conflict-ridden reality of medieval life for ordinary men and women. \n                            Ucross – Fall 2026 Artist ResidenciesExperience the majestic High Plains on a 20,000-acre ranch in Wyoming. Artists-in-residence enjoy uninterrupted time and space, private studios, chef-prepared meals, and a $1,500 stipend. The application fee is $40.Deadline: January 15, 2026 (11:59pm MT) | ucross.org\n                        From the ArchiveBanksy’s “Scar of Bethlehem” at the Walled Off Hotel (2019) (courtesy Bisher Qassis)Banksy Unveils a Political Interpretation of the Nativity Scene in BethlehemThe work was unveiled at the artist’s Walled Off Hotel, which overlooks Israel’s separation wall around Bethlehem.\n                  \n                      \n                        Daily Newsletter\n                      \n                      \n                        Newsletter\n                      \n                  \n        \n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "A Letter to Mamdani",
      "image": [
        "/assets/images/news/default.jpg"
      ],
      "datePublished": "2025-12-22T11:00:14.000Z",
      "dateModified": "2025-12-22T11:00:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Robert Mnuchin, Goldman Sachs Power Broker Turned Influential Art Dealer, Dies at 92",
    "url": "https://www.artnews.com/art-news/news/robert-mnuchin-art-dealer-dead-1234767708/",
    "image": "https://www.artnews.com/wp-content/uploads/2015/05/robert-mnuchin-courtesy-mnuchin-gallery-photography-c-richard-a-smith-low-res-e1430515777591.jpg?w=1000",
    "tag": "Culture",
    "date": "2025-12-20T19:15:30.000Z",
    "description": "\n\tRobert Mnuchin, the Wall Street pioneer who became one of New York’s most respected art dealers and a fixture at blue-chip auctions, died on Friday ",
    "body": "\n\tRobert Mnuchin, the Wall Street pioneer who became one of New York’s most respected art dealers and a fixture at blue-chip auctions, died on Friday at his home in Bridgewater, Connecticut. He was 92. His death, first reported by the New York Times, was confirmed by his stepdaughter, Lisa Hedley Wick. \n\n\tMnuchin was unusual in having two long and highly successful careers. At Goldman Sachs, he was a central figure in the rise of block trading in the 1960s and ’70s, helping build the firm’s institutional equities business under managing partner Gustave Levy. By 1978, the Wall Street Journal described him as “the acknowledged dean of block traders,” rivaled only by Salomon Brothers’ Michael Bloomberg. His skill on the trading floor—an encyclopedic recall of buyers and sellers, an instinct for pressure and timing—made him a legend inside the firm. He became a partner in 1967, co-headed trading and arbitrage by 1976, and joined the firm’s powerful management committee in 1980. He retired in 1990. \n\t\n\n\t\n\t\tRelated Articles\n\t\n\n\n\tThat same set of instincts—competitive, analytic, and deeply interpersonal—animated his second act. After decades on Wall Street, Mnuchin did something that surprised even close friends: he left finance to open a gallery. It was not a move financiers of his stature typically made. As he later told ARTnews, it “took a lot of courage” to step away from the Goldman machine and test whether his success came from his own abilities or the institution behind him. “I wanted to see what I could do on my own,” he recalled. And because no museum would hire someone without a formal art background, “the only alternative was to start my own gallery, which is what I did.” \n\n\tHe and his wife, Adriana, converted part of their East 78th Street townhouse into C&M Arts (partnering with James Corcoran) in 1992, later partnering, with Dominique Levy in L&M Arts. He would establish Mnuchin Gallery, on his own, in 2013. From the start, the gallery had a clear identity: rigorous, museum-quality exhibitions focusing on the pillars of postwar American art—Pollock, Rothko, Kline, de Kooning—as well as major presentations of Alexander Calder, Donald Judd, Jeff Koons, Frank Stella, Philip Guston, Sam Gilliam, Ed Clark, and David Hammons. He staged eight exhibitions devoted to Willem de Kooning alone, calling the artist “Picasso-esque” for the breadth of his distinct periods. \n\t\n\n\tMnuchin’s passion for exhibitions—and his conviction that art should be lived with—shaped both his gallery and his own collecting. “The reason to buy art is because you love it, you love it, you love it,” he told the New York Times in 2013. He disliked the term “collection,” insisting that he and his wife kept everything they bought in their home, never in storage. \n\n\tHe became equally known for his presence in the auction room. At evening sales, he was a calm but relentless bidder—sometimes shouting out prices or jumping ahead in increments to secure a work. In 2019, wearing a cream-colored jacket and armed with a flip phone, he set a record for a living artist when he placed the winning $91.1 million bid for Jeff Koons’s Rabbit (1986), acting on behalf of an anonymous client widely believed to be hedge fund manager Steven A. Cohen. His bidding style—patient, unshowy, decisive—made him a recognizable figure even for those who didn’t know his long résumé. \n\n\tThough he was the father of Steven Mnuchin, the former Treasury secretary, Robert Mnuchin largely avoided politics and was described by colleagues as modest, disciplined, and deeply devoted to art. Friends and art-world peers often noted his integrity: Amy Cappellazzo, the former Sotheby’s chairman, once called him “one of the straightest shooters in the business.” \n\t\n\n\tRobert Elliott Mnuchin was born on September 5, 1933, in Manhattan. His father, Leon A. Mnuchin, was a lawyer and longtime director at several retail companies. The family collected works by Franz Kline and Mark Rothko—and, as he liked to note, once owned a forged Matisse. He grew up on Central Park West before the family moved to Scarsdale. He attended Scarsdale High School, graduated from Yale in 1955, and served briefly in the Army before joining Goldman Sachs. \n\n\tMnuchin married Elaine Terner in 1957; they had two sons, Steven and Alan. After their divorce, he married Adriana Graber, with whom he had a daughter, Valerie. In addition to his wife, daughter, and sons, he is survived by his stepchildren Lisa Hedley Wick and Bradley Abelow. \n\n\tMnuchin worked well into his later years, even as he faced mobility challenges. He skipped Art Basel in Basel for the first time in two decades in 2019, but continued to remain at the gallery’s exhibitions and for major sales. “I love what I do,” he said in the 2021 ARTnews interview. “I’d be lost without it.” \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Robert Mnuchin, Goldman Sachs Power Broker Turned Influential Art Dealer, Dies at 92",
      "image": [
        "https://www.artnews.com/wp-content/uploads/2015/05/robert-mnuchin-courtesy-mnuchin-gallery-photography-c-richard-a-smith-low-res-e1430515777591.jpg?w=1000"
      ],
      "datePublished": "2025-12-20T19:15:30.000Z",
      "dateModified": "2025-12-20T19:15:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Arnulf Rainer, Austrian Artist Known for His ‘Overpaintings,’ Dies at 96",
    "url": "https://www.artnews.com/art-news/news/arnulf-rainer-dead-1234767718/",
    "image": "https://www.artnews.com/wp-content/uploads/2025/12/Arnulf-Rainer_2019_Copyright-Javier-Gutierrez.jpg?w=1024",
    "tag": "Culture",
    "date": "2025-12-21T17:32:31.000Z",
    "description": "\n\tArnulf Rainer, the Austrian artist whose relentless drive for experimentation made him a key figure of Europe’s postwar scene, died on December 18 a",
    "body": "\n\tArnulf Rainer, the Austrian artist whose relentless drive for experimentation made him a key figure of Europe’s postwar scene, died on December 18 at 96 at his home in Austria. His death was confirmed by his gallery Thaddaeus Ropac.\n\n\tBorn in Baden, Austria, in 1929, Rainer spent more than seven decades searching for new modes of expression, producing a body of abstract work that is most closely associated with the Art Informel movement. \n\n\tHe is best known for his Übermalungen (“overpaintings”), a technique he began in 1952 in which he layered dense strokes of pigment over existing images—at first his own images, and, from 1953 onward, those of other artists such as Italian painter Emilio Vedova. Rainer’s resulting works, seemingly at once destructive and devotional, turned painting into a site of erasure, accumulation, and spiritual immersion. \n\t\n\n\t\n\t\tRelated Articles\n\t\n\n\n\t“The organic act of creating is perhaps more essential than the completed painting,” he once said, likening the process to a contemplative ritual.\n\n\tAcross the 1950s and ’60s, Rainer turned his painterly attention to the body and self. His “blind drawings,” as well as the “Face Farces” and “Body Poses” series featured overpainted photographic self-portraits whose gestural marks complicated the artist’s presentation of his own psyche. Though not a Viennese Actionist, he exerted a catalytic influence on the movement’s early years.\n\n\tRainer’s engagement with postwar trauma also shaped his work. His 1951 photographic portfolio “Perspectives of Destruction” listed the catastrophic losses of the recent past—Hiroshima, the Holocaust, war and wreckage—and his subsequent layers of black, matte, and glossy paint became what art historian Helmut Friedel described as a “painterly skin in which history is safely stored.” Rainer later adapted this approach to enlarged photo-booth self-portraits, attacking the surface with paint applied by hand, producing hybrid images that fused representation with abstraction.\n\n\tBy the late 1960s and ’70s, major institutions had begun to recognize his importance. He received an early survey in 1968 at the Museum des 20. Jahrhunderts (now called Mumok) in Austria; participated in the 1972, 1977, and 1982 editions of Documenta in Kassel, Germany; and gained international prominence after exhibitions at Kunsthalle Bern and the Lenbachhaus Munich in 1977. \n\t\n\n\tHe represented Austria at the 1978 Venice Biennale, the same year he received the Grand Austrian State Prize. In the 1980s, he continued to have major exhibitions at the Nationalgalerie in Berlin, Centre Pompidou in Paris, Abbazia di San Gregorio in Venice, and the Guggenheim Museum in New York. He also taught at the Academy of Fine Arts in Vienna from 1981 to 1995.\n\n\tHis work is included in dozens of major museum collections in Germany, Austria, France, the Netherlands, the UK, and the US. In 2009, the Arnulf Rainer Museum opened in Baden, which celebrated his 95th birthday with a monographic exhibition in 2024.\n\n\t“An artist makes the past his own and adds something new,” art historian Rudi H. Fuchs once wrote of the artist whom he included in Documenta 7. Rainer’s dealer Thaddaeus Ropac, who worked with the artist for more than four decades, called him “a true innovator,” adding: “He never stopped pushing the boundaries of what art could be and how it could be created.”\n\n\tArt critic Donald Kuspit perhaps put it best: in Rainer’s hands, gesture regained not only its raw energy but its “significance as an indicator of inner mystery.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Arnulf Rainer, Austrian Artist Known for His ‘Overpaintings,’ Dies at 96",
      "image": [
        "https://www.artnews.com/wp-content/uploads/2025/12/Arnulf-Rainer_2019_Copyright-Javier-Gutierrez.jpg?w=1024"
      ],
      "datePublished": "2025-12-21T17:32:31.000Z",
      "dateModified": "2025-12-21T17:32:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "After A Five-Year Video Art Hiatus, Trisha Baga Is Back—with Their Best Film Yet ",
    "url": "https://www.artnews.com/art-in-america/interviews/trisha-baga-video-art-more-societe-berlin-1234767519/",
    "image": "https://www.artnews.com/wp-content/uploads/2025/12/TGood-install-SOCIETE_251106_5540.jpg?w=1250",
    "tag": "Culture",
    "date": "2025-12-22T10:00:00.000Z",
    "description": "\n\tIt happens to every artist working with technology: you develop a way of working, but it involves a tool that is eventually rendered obsolete. Argua",
    "body": "\n\tIt happens to every artist working with technology: you develop a way of working, but it involves a tool that is eventually rendered obsolete. Arguably, the situation is only amplified now, as tech companies black box their products, making them more difficult to customize; as they plan and accelerate obsolescence; and as they move toward subscription software models with automatic updates. \n\n\tTrisha Baga, an artist who came up in the art world with 3D videos that explore the surreal encroachment of technology on daily and domestic life, managed to keep an old computer with unsupported software going for five years before eventually taking a five-year break to focus on painting. Now, they’ve returned to video with their best piece yet: MORE, on view at Société in Berlin through January 17. The work collages different worlds—homes and caves, Epcot and aquariums—sometimes right on top of each other in a manner that feels cohesive and chaotic at the same time. It’s all very seductive, but simultaneously, you are made to see the seams. Recently, I visited Baga’s Ridgewood studio where we donned 3D glasses and watched the piece before chatting about the hiatus, how painting impacted their video making, and why AI is a bad dad. \n\t\n\n\t\n\t\tRelated Articles\n\t\n\n\n\tThis interview has been edited and condensed for clarity and concision.\n\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\tTrisha Baga\n\t\n\n\n\n\tArt in America: What prompted you to take a break from making video art?\n\n\tTrisha Baga: The technology I was just using to edit 3D video stopped being supported. In 2020, I was having to use a computer from like, 2011. Eventually, it just got too slow, and made the process not that fun. \n\n\tFor this piece, I had to learn new software that has a totally different logic. And now, the computer is a completely different thing. It’s so much creepier. It keeps trying to make decisions.\n\n\tDid it feel natural to come back to video?\n\n\tIt felt really natural, but also really hard with the sleep schedule of having a toddler, because my best editing hours are between like, 11pm and 4am, which is exactly when he needs me to hold his hand. I couldn’t really predict when I would get to work on it, or how long a studio session would be. But while making the work, I eventually figured out a way to think about it while I was hanging out with my kid, Homer, and to film with him. He’d get excited and be like, “It’s time to make video art! Where’s my tripod?”\n\t\n\n\tAmazing! Were there things about painting that you feel like you brought back into this part of your practice?\n\n\tI feel like every time you use a medium a lot, you start thinking through the metaphors of that medium. I know that Mollusca & the Pelvic Floor, I also have cereal getting thrown at you. I need it for some reason.\n\n\tThe cereal is serial!\n\n\tHa. Actually after painting, I started thinking of the cereal as binder, and the video content as pigment. Not just cereal but dots, like stars and dust and rotating space garbage, things that move your eye through the whole space. \n\n\tBut what really prompted me to get back into video again is that the iPhone started filming in 3D, and so I just started collecting footage. One scene shows a party with 20-year-olds dancing at Gracie Mansion that I shot right before de Blasio was getting kicked out; a friend invited me. \n\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\tView of Trisha Baga’s 2025 exhibition “MORE” at Société, Berlin.\n\t\t\t\t\t\t\t\t\tPhoto Trevor Good\n\t\n\n\n\n\tThe light in that scene is wild. Did you set it up?\n\n\tYeah, I call it the time traveling flashlight. I have this projector setup that basically has the same aspect ratio as my camera’s view when I have both devices on the same tripod. So I play a loop of white light that moves across like a scanner bar. \n\n\tI use a lot of flashlights, and I know that metaphorically they convey a lot, but also on a very practical level, they help me composite many spaces.\n\t\n\n\tBecause the dark backdrops can blend into one another when you overlay or cut between scenes. I noticed that for sure—like when your toddler is exploring an adult abdomen and you cut between that intimate scene and spelunkers in a cave. They feel like parallel worlds. \n\n\tI also think that technique really creates a video world that feels rather surreal and untethered from reality, not unlike in your paintings. When I was younger, I really thought that all serious art was video, and painting was inherently old school. Later I realized I missed out on so much by having that attitude. Was that part of your life at all?\n\n\tI have a complicated relationship to painting, because I’ve always made fun of it, but I also love it. You just make way more money as a painter than as a video artist, so I can’t not make fun of it; it’s like making fun of my rich friend. It’s healthy for it! [laughs] I do think painting helped me think of this lighting technique, which I didn’t expect; it almost made the work feel cohesive. Now, I almost think of the video as four large paintings in sequence; there are often four layers, either like intercut or overlayed into each other, and that’s a different way of thinking about a scene. It’s almost like I started from the flat, rectangular space and then edited into it, rather than thinking of sequence as being one shot, then another shot. \n\t\n\n\tIn your work, domestic life is often made weird and surreal through technology. So it’s fitting that you were able to shoot spontaneously on your iPhone around the house and as part of your everyday life. There also seems to be a parallel between you training your toddler about the world, and training AI.\n\n\tKind of. Obviously the morals are just so different, so I’m just letting those things contrast. I think about my work more through process. I sourced all this found 3D footage, and plenty of it is science fiction stuff; I started just smushing it all together until it was just about the emotion. I’m using those scenes to get at this anxiety about technology, in sci-fi’s very dramatized way. There’s also footage I found from random YouTube users… so many dads on excursions. \n\n\tThere’s a voiceover from The Martian with overlays of a breast pump churning, where I’m hoping to tell two simultaneous stories about the loss of a home. Matt Damon is gaming out how to make food on Mars, and a newborn is learning how to eat without an umbilical cord. It happens right after the scary scene in my parents’s house so it refers to a personal moment of loss for myself as well. It’s a lot about hunger and survival\n\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\tView of Trisha Baga’s 2025 exhibition “MORE” at Société, Berlin.\n\t\t\t\t\t\t\t\t\tPhoto Trevor Good\n\t\n\n\n\n\tI was struck by the questions posed in the narration, like: “What does a hug feel like? What does it feel like to sleep?” It’s almost like the questions a kid would ask—like “why is the sky blue?”—that’s impossible to explain, but these are specifically: What is it like to have a body? Information AI can’t know.\n\t\n\n\tThe first section starts out as data collection, and then it turns into therapy; in one scene, where I’m in my parents’ home in Florida, and the therapist’s voice becomes increasingly untrustworthy. Then it flips into a computer voice asking: “What is it like to taste? Is it like looking at something but with your tongue? What is it like to have parents? Will you be my friend?” And that’s when Mark Zuckerberg comes in…\n\n\tWould you describe your process as collage-like then?\n\n\tYes. I collect a lot of things, and then I play them all together, and there’s always a lot of fat to trim and bridges to build. I can’t really work from writing, because then I start thinking in language too much. Eventually, I find I am sort of building the metaphors, figuring what recurs and what things stick to each other. \n\n\tThe films evokes all these things that are hard to contain with language—like sleep or a hug, but also CAPTCHA that asks you to select a vegetable, then has curveballs, like tomatoes and avocados. \n\n\tYeah, things AI can’t understand about experience or that can’t really be conveyed or understood through a spreadsheet.\n\n\tMy plan going into this more generally was to make something about parenting, the invasiveness of technology, and infancy. I was thinking about how infancy is so much of psychotherapy, and is this experience of being dependent that shapes you. Also, I was editing with the baby monitor on. \n\t\n\n\tI realized that the overlaid, out-of-sync arcs of like dependency have something to do with technology convincing us to become dependent on it. We’re sort of becoming the baby. What are we giving up in that, and how much power are we giving it? Because it’s not a great parent.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "After A Five-Year Video Art Hiatus, Trisha Baga Is Back—with Their Best Film Yet ",
      "image": [
        "https://www.artnews.com/wp-content/uploads/2025/12/TGood-install-SOCIETE_251106_5540.jpg?w=1250"
      ],
      "datePublished": "2025-12-22T10:00:00.000Z",
      "dateModified": "2025-12-22T10:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]