[
  {
    "title": "How the Incas Performed Skull Surgery More Successfully Than U.S. Civil War Doctors",
    "url": "https://www.openculture.com/2026/01/how-the-incas-performed-skull-surgery-more-successfully-than-u-s-civil-war-doctors.html",
    "image": "https://cdn8.openculture.com/2026/01/30002124/trepanation_16x9-1024x576.jpg",
    "tag": "Culture",
    "date": "2026-01-30T08:35:48.000Z",
    "description": "\n\tin History, Technology |   \tJanuary 30th, 2026  Leave a Comment\n\t\n\t\t\t\nGrant­ed access to a time machine, few of us would pre­sum­ably opt first for ",
    "body": "\n\tin History, Technology |   \tJanuary 30th, 2026  Leave a Comment\n\t\n\t\t\t\nGrant­ed access to a time machine, few of us would pre­sum­ably opt first for the expe­ri­ence of skull surgery by the Incas. Yet our chances of sur­vival would be bet­ter than if we under­went the same pro­ce­dure 400 years lat­er, at least if it took place on a Civ­il War bat­tle­field. In both fif­teenth-cen­tu­ry Peru and the nine­teenth-cen­tu­ry Unit­ed States, sur­geons were per­form­ing a lot of trepa­na­tion, or removal of a por­tion of the skull. Since the Neolith­ic peri­od, indi­vid­u­als had been trepanned for a vari­ety of rea­sons, some of which now sound more med­ical­ly com­pelling than oth­ers, but the Incan civ­i­liza­tion took it to anoth­er lev­el of fre­quen­cy, and indeed sophis­ti­ca­tion.\nAny­one with an inter­est in the his­to­ry of tech­nol­o­gy would do well to study the Incas, who were remark­able in both what they devel­oped and what they did­n’t. Though there was no Incan alpha­bet, there was khipu, (or quipu), pre­vi­ous­ly fea­tured here on Open Cul­ture, a sys­tem of record-keep­ing that used noth­ing but knot­ted cords.\nThe Incas may not have had wheeled vehi­cles or mechan­i­cal devices as we know them today, but they did have pre­ci­sion mason­ry, an exten­sive road sys­tem, advanced water man­age­ment for agri­cul­tur­al and oth­er uses, high-qual­i­ty tex­tiles, and plant-derived anti­sep­tic — some­thing more than a lit­tle use­ful if you also hap­pen to be cut­ting a lot of holes in peo­ple’s skulls.\nStudy­ing the his­to­ry of trepa­na­tion, neu­rol­o­gist David Kush­n­er, along with bioar­chae­ol­o­gists John Ver­a­no and Anne Titel­baum, exam­ined more than 600 Peru­vian skulls dat­ing from between 400 BC and the mid-six­teenth-cen­tu­ry, which marked the end of the Incans’ 133-year-long run. As Sci­ence’s Lizzie Wade reports, the old­est evi­dence shows an unen­vi­able 40% sur­vival rate, but the sur­gi­cal tech­nique evolved over time: by the Inca era, the num­ber ris­es to between 75% and 83%, as against 46% to 56% in Civ­il War mil­i­tary hos­pi­tals. Some Incan skulls even show signs of hav­ing under­gone up to sev­en suc­cess­ful trepa­na­tions — or non-fatal ones, at any rate. Though that ven­er­a­ble form of surgery may no longer be prac­ticed, mod­ern neu­ro­sur­geons today use tech­niques based on the same prin­ci­ples. Should we find our­selves in need of their ser­vices, we’ll no doubt pre­fer to keep our dis­tance from the time machine.\nRelat­ed con­tent:\nDis­cov­er Khipu, the Ancient Incan Record & Writ­ing Sys­tem Made Entire­ly of Knots\nBehold the Medieval Wound Man: The Poor Soul Who Illus­trat­ed the Injuries a Per­son Might Receive Through War, Acci­dent or Dis­ease\nJazz Musi­cian Plays Acoustic Gui­tar While Under­go­ing Brain Surgery, Help­ing Doc­tors Mon­i­tor Their Progress\nArti­fi­cial Intel­li­gence & Drones Uncov­er 303 New Naz­ca Lines in Peru\nHow the “First Pho­to­jour­nal­ist,” Math­ew Brady, Shocked the Nation with Pho­tos from the Civ­il War\nDown­load 100,000+ Images From The His­to­ry of Med­i­cine, All Free Cour­tesy of The Well­come Library\nBased in Seoul, Col­in Marshall writes and broad­casts on cities, lan­guage, and cul­ture. He’s the author of the newslet­ter Books on Cities as well as the books 한국 요약 금지 (No Sum­ma­riz­ing Korea) and Kore­an Newtro. Fol­low him on the social net­work for­mer­ly known as Twit­ter at @colinmarshall.\n\t\t\n        \t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How the Incas Performed Skull Surgery More Successfully Than U.S. Civil War Doctors",
      "image": [
        "https://cdn8.openculture.com/2026/01/30002124/trepanation_16x9-1024x576.jpg"
      ],
      "datePublished": "2026-01-30T08:35:48.000Z",
      "dateModified": "2026-01-30T08:35:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Drawn to Synbols, Michael McGrath Conjures Uncanny Narratives",
    "url": "https://www.thisiscolossal.com/2026/01/michael-mcgrath-mixed-media-works/",
    "image": "https://www.thisiscolossal.com/wp-content/uploads/2026/01/mcgrath-4.jpg",
    "tag": "Culture",
    "date": "2026-01-29T22:48:03.000Z",
    "description": "\n\n\t\nDisembodied heads, eyes, and hands meet spindly trees, dragonflies, and vibrant blossoms in the folk-art inspired works of Michael McGrath. Based ",
    "body": "\n\n\t\nDisembodied heads, eyes, and hands meet spindly trees, dragonflies, and vibrant blossoms in the folk-art inspired works of Michael McGrath. Based in Rhinebeck, New York, McGrath melds a variety of media—most pieces contain a mixture of graphite, ink, and oil and acrylic paints—into dynamic compositions suffuse with mystery. Recurring symbols and objects lend themself to a distinctive visual language that captures both the wondrous and puzzling.\nMcGrath is preparing for solo exhibitions in Saugerties, New York, and Kent, Connecticut, later this year, along with a few group shows. Keep up with his work on Instagram.\n“Intro to ceremonial lighting cycles,” colored pencil, wax pastel and acrylic on panel, 14 x 11 inches\n“Evening float, Panther Mountain,” acrylic and oil on canvas, 40 x 30 inches\n“Evening float, Moonrise”\n“Roe gods, chain reaction,” colored pencil on panel, 14 x 11 inches\n“Future systems No. 5,” oil on linen, 16 x 20 inches\n“Late migration, No. 3,” colored pencil and graphite on panel, 10 x 8 inches\n\t\n\t\n\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Drawn to Synbols, Michael McGrath Conjures Uncanny Narratives",
      "image": [
        "https://www.thisiscolossal.com/wp-content/uploads/2026/01/mcgrath-4.jpg"
      ],
      "datePublished": "2026-01-29T22:48:03.000Z",
      "dateModified": "2026-01-29T22:48:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Onassis AiR Opens Applications for 2026–27 Residencies in Athens",
    "url": "https://hyperallergic.com/onassis-air-opens-applications-for-2026-27-residencies-in-athens/",
    "image": "https://hyperallergic.com/content/images/size/w1200/2026/01/Hyperallergic-3.48.38---PM-1.jpg",
    "tag": "Culture",
    "date": "2026-01-30T16:00:35.000Z",
    "description": "\n                Announcement\n                Participants receive an artist’s fee, a research budget, housing, round-trip travel, mentoring, and othe",
    "body": "\n                Announcement\n                Participants receive an artist’s fee, a research budget, housing, round-trip travel, mentoring, and other resources to support their work.\n            \n                \n                                \n                            \n                \n            \n                \n        \n            Artwork for Onassis AiR Open Call 2026-27 (© Onassis Creative Studio)\n    \n        \n            After six successful years supporting nearly 250 fellows from around the world, the artistic research and residency program Οnassis AiR has become a container of cross-disciplinary exchange among local and international art practitioners and researchers. Process, research, and experimentation are at the core of the residency: participants are invited to delve deeper into their practice without the pressure of presenting a final work. Serving as a point of access to the Onassis Culture ecosystem, Onassis AiR offers tailored mentoring and opportunities to explore future production, co-production, presentation possibilities, or further support for a project’s international development.This season, the program invites applications for a 10-week residency in Athens, Greece, between September 2026 and July 2027. It will award 30 residencies across all fields, including Visual Arts, Theater, Dance, Sound, Art & Advanced Technologies, Filmmaking, Applied Arts, and Curation, as well as their hybrid iterations.This year, the program: Introduces a new research and project development opportunity in collaboration with the Cavafy Archive.Continues its focus on material-based practices and the broader field of applied arts, a direction strengthened by its expansion at Onassis Ready.Continues to provide technical and production support for performing arts and digital productions through dedicated Technical Residencies.In collaboration with Onassis ONX, offers access to the platform’s new studio within Onassis Ready, providing additional curatorial, development, and technical support.Enhances the artist’s fee and budget in response to increasingly precarious working conditions for art professionals in Greece and abroad.Selected participants receive an artist’s fee, a research budget, housing, round-trip travel, access to mentoring, and audiovisual equipment, among other resources. All program participants are involved in the Onassis AiR Open Days, a series of public events centered on creative processes rather than finished outcomes.Applications are due by March 3, 2026, at 12pm (UTC+2).To learn more and apply, visit onassis.org.\n                  \n                      \n                        Announcement\n                      \n                      \n                        Sponsored\n                      \n                      \n                        Opportunities\n                      \n                      \n                        Athens\n                      \n                  \n        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Onassis AiR Opens Applications for 2026–27 Residencies in Athens",
      "image": [
        "https://hyperallergic.com/content/images/size/w1200/2026/01/Hyperallergic-3.48.38---PM-1.jpg"
      ],
      "datePublished": "2026-01-30T16:00:35.000Z",
      "dateModified": "2026-01-30T16:00:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Lisa Funderburke Tapped to Lead Newark Museum of Art",
    "url": "https://hyperallergic.com/lisa-funderburke-tapped-to-lead-newark-museum-of-art/",
    "image": "https://hyperallergic.com/content/images/size/w1200/2026/01/Lisa-Funderburke-NMOA.jpeg",
    "tag": "Culture",
    "date": "2026-01-29T21:50:25.000Z",
    "description": "\n    \n                News\n                She’ll join New Jersey's largest fine art museum after nine years at the helm of the Artist Communities All",
    "body": "\n    \n                News\n                She’ll join New Jersey's largest fine art museum after nine years at the helm of the Artist Communities Alliance.\n            \n                \n                                \n                            \n                \n            \n                \n        \n            Lisa Funderburke, the new president and chief executive of the Newark Museum of Art (photo courtesy the museum)\n    \n        \n            The Newark Museum of Art has tapped Lisa Funderburke, currently president and CEO of the Artist Communities Alliance (ACA), as its new leader.Funderburke will become the New Jersey museum’s next president and chief executive following the departure of Linda Harrison, who left the role last year after a six-year tenure. Funderburke announced her decision to step down from the ACA, an organization that provides support and resources for artists and artist residencies, earlier this month. In a January 20 email, ACA Board Chair Kibra Yohannes celebrated Funderburke's “exemplary service.” “With Lisa’s partnership, we built a board that is more reflective of our field,” Yohannes said. “We grew organizational capacity and increased support for artists. We deepened our commitment to access, moving from a transactional membership model to a values-based network.”The Newark Museum of Art is New Jersey’s largest fine art museum, with 300,000 objects spanning art, science, and natural history. Funderburke takes the helm as institutions across the country confront new challenges under the Trump administration. Before leading ACA, Funderburke served as the associate director of the McColl Center for Art + Innovation in Charlotte, North Carolina. She served on the boards of the Institute of Museum and Library Services and the National Assembly of State Arts Agencies, and is currently a board member at the Performing Arts Alliance and the Center for Cultural Innovation in Los Angeles.In addition to arts administration experience, she holds a Master’s degree in biology from Howard University, bringing a scientific background that the museum welcomed in a press release announcing her appointment. In a statement, Funderburke said she believes “museums are most vital when they are responsive, collaborative, and deeply connected to the communities they serve.”“Throughout my career, I have seen how cultural institutions function as essential civic infrastructure,” Funderburke said.“I am excited to work with the Newark community and broader networks of artists and partners to position the museum as a leader in national and global conversations about art, science, and cultural exchange, stewarding the museum as a shared public space for learning, creativity, and dialogue,” she continued. Funderburke's new appointment will be effective February 1, the Newark Museum of Art said. \n                  \n                      \n                        News\n                      \n                      \n                        Newark Museum of Art\n                      \n                      \n                        Newark\n                      \n                      \n                        New Jersey\n                      \n                  \n        \n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lisa Funderburke Tapped to Lead Newark Museum of Art",
      "image": [
        "https://hyperallergic.com/content/images/size/w1200/2026/01/Lisa-Funderburke-NMOA.jpeg"
      ],
      "datePublished": "2026-01-29T21:50:25.000Z",
      "dateModified": "2026-01-29T21:50:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Art Movements: The Brooklyn Museum's New Top Contemporary Art Curator",
    "url": "https://hyperallergic.com/art-movements-the-brooklyn-museums-new-top-contemporary-art-curator/",
    "image": "https://hyperallergic.com/content/images/size/w1200/2026/01/IMG_0823-1.jpg",
    "tag": "Culture",
    "date": "2026-01-29T22:42:45.000Z",
    "description": "\n    \n                Community\n                Plus, the Newark Museum, Grey Art Museum, and the Clark Art Institute get new directors. \n            ",
    "body": "\n    \n                Community\n                Plus, the Newark Museum, Grey Art Museum, and the Clark Art Institute get new directors. \n            \n                \n                                \n                            \n                \n            \n                \n        \n            Robert Wiesenberger (photo by Erin Johnson, courtesy the Brooklyn Museum)\n    \n        \n            Art Movements, published every Thursday afternoon, is a roundup of must-know news, appointments, awards, and other happenings in today’s chaotic art world.Brooklyn Museum Fills Its Top Contemporary Curator Spot Robert Wiesenberger was named senior curator of contemporary art at the Brooklyn Museum, a post that has been vacant since the departure of Eugenie Tsai in 2023. He comes from the Clark Art Institute in Williamstown, Massachusetts, where he was curator of contemporary projects, and was previously a curatorial fellow at the Harvard Art Museums.A New Director at the Newark Museum of ArtLisa Funderburke was named the chief executive and director of New Jersey's largest art museum, departing her post as president and chief executive of Artist Communities Alliance, an international association of artist residencies. She starts Monday!Read more on Hyperallergic.Alison Weaver is the new director of NYU's Grey Art Museum (photo by Geoff Winningham, courtesy NYU)TransitionsAlison Weaver was appointed director of the Grey Art Museum at New York University, departing from her post as executive director at the Moody Center for the Arts at Rice University in Houston. Esther Bell was appointed director of the Clark Art Institute in Williamstown, Massachusetts, following her promotion from deputy director and chief curator. Freya Douglas-Morris is now co-represented by Alexander Berggruen and Lehmann Maupin.Patrick Elliott was named curator of modern paintings at the National Gallery in London. The Estate of Peter Hujar is now represented by Ortuzar gallery in collaboration with Fraenkel Gallery, as well as the Peter Hujar Foundation.Phoebe Helander is now represented by PPOW gallery.Joe Hill was appointed director of Yorkshire Sculpture Park in England, Europe's largest sculpture park.Emil Sands is now co-represented by Victoria Miro and Olney Gleason galleries. Anuradha Vikram and Leon J. Hilton were named associate curators of High Performance: A 2-Year Conference, a multi-year initiative at the Performance Art Museum. Miami's David Castillo Gallery is now representing Studio Lenca in North America.A painting by Studio Lenca on view at David Castillo Gallery in Miami in December 2025 (photo Valentina Di Liscia/Hyperallergic)AwardsTarek Atoui was awarded the Tate Modern's 11th annual Turbine Hall commission. Sara Shamma will represent Syria at the 2026 Venice Biennale. WildcardGraham Granger, a 19-year-old undergraduate at the University of Alaska Fairbanks, was charged with criminal mischief after eating parts of another student's AI-generated artwork in protest of his use of ChatGPT. \"He was tearing them up and just shoving them in as much as he could,” a witness told Anchorage Daily News. “Like when you see people in a hot-dog-eating contest.” He's a performing arts major, as you might've guessed, and don't worry, he hasn't reported any symptoms of indigestion.Editor's note 1/30/26 12:36pm EST: A previous version of this article stated that Freya Douglas-Morris is now represented by Lehmann Maupin. She is actually co-represented by Alexander Berggruen and Lehmann Maupin.\n                  \n                      \n                        Community\n                      \n                      \n                        Art Movements\n                      \n                  \n        \n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Art Movements: The Brooklyn Museum's New Top Contemporary Art Curator",
      "image": [
        "https://hyperallergic.com/content/images/size/w1200/2026/01/IMG_0823-1.jpg"
      ],
      "datePublished": "2026-01-29T22:42:45.000Z",
      "dateModified": "2026-01-29T22:42:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Museum of Fine Arts Boston Lays Off 33 Workers",
    "url": "https://hyperallergic.com/museum-of-fine-arts-boston-lays-off-33-workers/",
    "image": "https://hyperallergic.com/content/images/size/w1200/2026/01/4096px-Museum_of_Fine_Arts-_Boston_-54954248311-.jpg",
    "tag": "Culture",
    "date": "2026-01-29T22:24:45.000Z",
    "description": "\n    \n                News\n                A union representative said the unit is “deeply concerned” about the impact of the staff cuts on affected a",
    "body": "\n    \n                News\n                A union representative said the unit is “deeply concerned” about the impact of the staff cuts on affected and remaining workers.\n            \n                \n                                \n                            \n                \n            \n                \n        \n            An exterior view of Museum of Fine Arts, Boston (image via Wikimedia Commons; CC BY 4.0)\n    \n        \n            The Museum of Fine Arts (MFA) Boston laid off 33 workers, a 6.3% staff reduction, the institution announced on Wednesday, January 28. MFA Boston Director of Communications Karen Frascona confirmed in an email to Hyperallergic that the layoffs, which will take effect on Friday, will impact 16 union members. She noted that a range of roles were affected, spanning “curatorial to operations to high-level management,” and that 23 vacancies were also eliminated.The museum “welcomes meeting with the Union and plans to schedule a preliminary bargaining session as soon as possible,” Frascona said.On behalf of the MFA Boston union, Local 2110 UAW representative Chelsea Farrell told Hyperallergic that the unit was “deeply concerned” about the effect of the layoffs on affected staff and remaining workers. “Workloads at the Museum are already high, and cutting back on the very staff members who make the MFA, Boston such a great institution is a blow both to the affected individuals and to the institution itself,” Farrell said. MFA Boston Director Pierre Terjanian, who assumed the role last July following Matthew Teitelbaum's 10-year tenure at the helm, told the Boston Globe that the layoffs were a necessary measure as the museum faces a $13 million projected deficit. Terjanian said that salaries and benefits make up 55% of the institution's annual budget, and that the staff reduction would save approximately $5.4 million overall. The Globe also reported that the museum intends to sell a sizable plot of land in Hopkinton, Massachusetts, that would have housed a center for its collection.Museum of Fine Arts Boston workers during a one-day strike to protest low wages on November 17, 2021 (photo by John Tlumacki/The Boston Globe via Getty Images)The MFA Boston union formally organized in 2020 after a mass staff reduction of over 100 employees in light of the coronavirus pandemic quarantine, and conducted a day-long strike amid stalled negotiations in 2021. The first contract with the museum was officially ratified in 2022, securing salary increases, improved transportation and retirement benefits, and workplace diversity training among other bargained concessions for over 200 employees.Now, the union is planning a meeting with the museum to discuss possible retention, and to “ensure that if there are to be layoffs of rank and file workers, that there be shared sacrifice from Museum leadership,” Farrell said. Paul McAlpine, who worked in public services and collections management in MFA Boston's libraries and archives for over 28 years, told Hyperallergic that he was among the 16 union staff laid off.“I don't know how I'm gonna survive this,” he said in a phone call, explaining that since the Coronavirus Aid, Relief, and Economic Security Act (CARES) Act in 2020, he's been consistently making penalty-free withdrawals from his retirement fund to pay monthly bills. “Now, I'm out of a full-time job, I can never retire, and as of tomorrow, I have no health benefits — I just got a medical bill,” McAlpine said.The layoffs at MFA Boston come in the wake of staff cuts at cultural institutions across the country, including the Guggenheim Museum, the Fine Art Museums of San Francisco, the San Francisco Museum of Modern Art, the Buffalo AKG Art Museum, and the Brooklyn Museum.Among those affected by the MFA Boston cuts, according to a petition circulating on social media, are Marina Tyquiengco, the museum's first curator of Native American Art, and Nadirah Mansour, its inaugural assistant curator of Islamic Art. Frascona did not immediately respond to Hyperallergic's inquiries regarding these staff members.McAlpine told Hyperallergic that “it's a sad day for the city of Boston.”“The biggest thing in operating a museum is to respect the staff who care for the collection, and respect the public to come through the door, and respect the late artists whose work is being cared for,” he said.\n                  \n                      \n                        News\n                      \n                      \n                        Boston\n                      \n                      \n                        MFA Boston\n                      \n                  \n        \n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Museum of Fine Arts Boston Lays Off 33 Workers",
      "image": [
        "https://hyperallergic.com/content/images/size/w1200/2026/01/4096px-Museum_of_Fine_Arts-_Boston_-54954248311-.jpg"
      ],
      "datePublished": "2026-01-29T22:24:45.000Z",
      "dateModified": "2026-01-29T22:24:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Michelle Segre’s Impermanent Worlds",
    "url": "https://hyperallergic.com/michelle-segres-impermanent-worlds/",
    "image": "https://hyperallergic.com/content/images/size/w1200/2026/01/MS0169SFW_back_detail-1.jpg",
    "tag": "Culture",
    "date": "2026-01-29T22:34:20.000Z",
    "description": "\n    \n                Art Review\n                By remaining open to time and its effects, Segre’s art defies the idea of permanence often associated",
    "body": "\n    \n                Art Review\n                By remaining open to time and its effects, Segre’s art defies the idea of permanence often associated with both sculpture and empire.\n            \n                \n                                \n                            \n                \n            \n                \n        \n            Michelle Segre, \"Nebula,\" detail (2025), steel, acrylic polymer, acrylic ink, pastel, concrete, yarn, wool, ceramic, cheesecloth, muslin, wire (all images courtesy the artist and Derek Eller Gallery, New York, photos Adam Reich) \n    \n        \n            Since I first reviewed Michelle Segre’s art in 2014, I have watched her interest in cosmic events, such as a nebula (a term for a diffuse astronomical object), deepen, as she's continued to work with unlikely materials including colored yarn, dried mushrooms, and rotting bread. What I didn’t recognize with enough understanding at that time was the way that her imaginative innovations undermine classic categories dividing objects from pictorial images, sculpture from painting. Collapsing the split between these categories has allowed her to define her own territory, which is as astute philosophically as it is formally.Segre’s ingenuity at the intersection of the sculptural and pictorial became more apparent to me when I saw her current exhibition, Nebula, at Derek Eller Gallery, which consists of a single, largely bright red object. We have become so used to encountering quantity that sometimes we see what is easiest without looking longer and more carefully. “Nebula” (2025) demands to be viewed and scrutinized closely, as well as from a distance and in the round. Standing alone in the middle of the gallery space, I circled it the way one does a maypole.Michelle Segre, \"Nebula\"“Nebula” is comprised of a flat form that resembles a thought balloon, an unknown continent, or a fiery plume rising into the sky, emerging from a vertical cement pedestal. Composed of reddish acrylic polymer, the shape is loosely outlined by steel wire, to which a fringe of red yarn reaching down to the floor is attached. The yarn becomes soft and fiery lines, a kind of threshold curtain separating one world from another. A thin spiraling wire is embedded in the central form with long entangled skeins of black thread sliding under the wire to create different linear clusters. We see two and three dimensions at once, an open shape rising from the cement block and a solid, fiery red surface hanging inside, surrounded by the yarn’s palpable lines, a drawing in space. The luminous hues of the amorphous polymer wafer change from orange to crimson, revealing Segre as a master colorist. One of the strengths of her work is the wild, unexpected associations that come to mind. Just as I was thinking about what this abstract shape looks like, I saw a large clump of brown sheep fleece attached to the yarn. Materially, the fleece is connected to the strands of red yarn attached to the wire frames surrounding and supporting the acrylic polymer. The red’s allusion to fire evokes destruction while the juxtaposition of fleece and yarn conveys transformation and birth. By bringing impermanent materials into her work, Segre embraces the physical world as a constantly changing site of destruction and potentiality. Her objects are open to time and its effects. They occupy the opposite end of the spectrum from the impermeable objects fabricated by Jeff Koons and his peers, and, by extension, the idea of permanence often associated with both sculpture and empire. Sensitive to ambient air currents, “Nebula” is a witness to change. Michelle Segre, \"Nebula,\" detailMichelle Segre: Nebula continues at Derek Eller Gallery (38 Walker Street, Ground Floor, Tribeca, Manhattan) through February 14. The exhibition was organized by the gallery.\n                  \n                      \n                        Art Review\n                      \n                      \n                        Reviews\n                      \n                      \n                        Michelle Segre\n                      \n                      \n                        Derek Eller Gallery\n                      \n                      \n                        New York\n                      \n                  \n        \n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Michelle Segre’s Impermanent Worlds",
      "image": [
        "https://hyperallergic.com/content/images/size/w1200/2026/01/MS0169SFW_back_detail-1.jpg"
      ],
      "datePublished": "2026-01-29T22:34:20.000Z",
      "dateModified": "2026-01-29T22:34:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]