[
  {
    "title": "Video: ‘HIM’ | Anatomy of a Scene",
    "url": "https://www.nytimes.com/video/movies/100000010408180/him-scene.html",
    "image": "https://static01.nyt.com/images/2025/09/19/multimedia/18cul-him-anatomy1/18cul-him-review-wzfp-facebookJumbo.jpg?video-overlay",
    "tag": "Culture",
    "date": "2025-09-19T08:50:00.000Z",
    "description": "new video loaded: ‘HIM’ | Anatomy of a Scenetranscriptbars0:00/2:17-2:17transcriptThe director Justin Tipping narrates a scene from “HIM,” featuring Marlon Wayans and Tyriq Withers.“Hi, My name is Justin...",
    "body": "<div><p>new video loaded: ‘HIM’ | Anatomy of a Scene</p><div><p>transcript</p><div><p><svg>bars</svg></p><div><div><p>0:00</p><p>/</p><p>2:17</p></div><div><p>-</p><p>2:17</p></div></div></div><div><div><p>transcript</p><h4>The director Justin Tipping narrates a scene from “HIM,” featuring Marlon Wayans and Tyriq Withers.</h4></div><dl><dd><p>“Hi, My name is Justin Tipping and I’m the director of “HIM.” “I’m going to need a little volunteer.” Mr. White. I got you. “My man!” This is the moment in the film where Isaiah White, played by Marlon Wayans, is going to teach Cameron Cade, played by Tyriq Withers a lesson in how to be a great quarterback. In this lesson, I did a lot of research about quarterback drills that hone in on specific skills. For example, in a pro game, you want to be able to get the ball out of your hands under two seconds. So that’s why we have two seconds on the clock and to work on that speed that’s required of decision making. That’s why he’s turned away from the actual receivers. He has his eyes closed. So that you’re forced into a panic-like situation, and you have to throw the ball as quickly as possible. So what I really wanted to communicate in this scene specifically, was that there’s going to be a big tonal shift from something’s off to something’s very wrong, and it’s the first time we’re going to introduce violence and a dynamic between the two characters that becomes much more like a narcissistic, abusive relationship than a mentor-mentee “Too slow.” But seed it and bury that under the guise of hazing and just being a rookie. And what I landed on was this idea of using this JUGS machine to be that conduit of punishment. I also didn’t want him to have time to process anything. That’s why I kind of try to get music and a rhythm going in the edit. And even the sound design is rhythmic. That vibration and metallic clanking, it escalates and grows and grows over this entire sequence. And then we have these really tight, extreme close-ups of Cameron Cade’s eyes. And that was just a creative choice I made to rely on the language of horror, where there’s a classic peekaboo.</p></dd></dl></div></div></div>"
  },
  {
    "title": "Da Vinci Code author Dan Brown on why failure is a blessing",
    "url": "https://www.bbc.com/news/videos/cqlzddl4nk6o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024xn/ichef.bbci.co.uk/images/ic/$widthxn/p0m2ynlv.jpg",
    "tag": "Culture",
    "date": "2025-09-15T13:57:46.000Z",
    "description": "Skip to contentWatch LiveBritish Broadcasting CorporationHomeNewsSportBusinessInnovationCultureArtsTravelEarthAudioVideoLiveWatch LiveListen to the full episode on BBC Sounds.15 September 2025WritingBooks",
    "body": "<div><div><p><a target=\"_blank\" href=\"https://www.bbc.com/news/videos/cqlzddl4nk6o?at_medium=RSS&at_campaign=rss#main-content\">Skip to content</a></p></div><div><div><p><a target=\"_blank\" href=\"https://www.bbc.com/watch-live-news/\"><span><span><svg width=\"32\" height=\"32\"></svg></span><span>Watch Live</span></span></a></p></div><div><p><a target=\"_blank\" href=\"https://www.bbc.com/\"><svg>British Broadcasting Corporation</svg></a></p></div></div><section><ul><li><div><p><a target=\"_blank\" href=\"https://www.bbc.com/\">Home</a></p></div></li><li><div><p><a target=\"_blank\" href=\"https://www.bbc.com/news\">News</a></p></div></li><li><div><p><a target=\"_blank\" href=\"https://www.bbc.com/sport\">Sport</a></p></div></li><li><div><p><a target=\"_blank\" href=\"https://www.bbc.com/business\">Business</a></p></div></li><li><div><p><a target=\"_blank\" href=\"https://www.bbc.com/innovation\">Innovation</a></p></div></li><li><div><p><a target=\"_blank\" href=\"https://www.bbc.com/culture\">Culture</a></p></div></li><li><div><p><a target=\"_blank\" href=\"https://www.bbc.com/arts\">Arts</a></p></div></li><li><div><p><a target=\"_blank\" href=\"https://www.bbc.com/travel\">Travel</a></p></div></li><li><div><p><a target=\"_blank\" href=\"https://www.bbc.com/future-planet\">Earth</a></p></div></li><li><div><p><a target=\"_blank\" href=\"https://www.bbc.com/audio\">Audio</a></p></div></li><li><div><p><a target=\"_blank\" href=\"https://www.bbc.com/video\">Video</a></p></div></li><li><div><p><a target=\"_blank\" href=\"https://www.bbc.com/live\">Live</a></p></div></li></ul></section><div><div><p><a target=\"_blank\" href=\"https://www.bbc.com/watch-live-news/\"><span><span><svg width=\"32\" height=\"32\"></svg></span><span>Watch Live</span></span></a></p></div></div><div><div><div><p><a target=\"_blank\" href=\"https://www.bbc.co.uk/sounds/play/m002jdpd\">Listen to the full episode on BBC Sounds.</a></p></div><p>15 September 2025</p></div><div><div><div><p><a target=\"_blank\" href=\"https://www.bbc.com/news/topics/cl16gy93jd1t\">Writing</a></p></div><div><p><a target=\"_blank\" href=\"https://www.bbc.com/news/topics/cq23pdgvyn7t\">Books</a></p></div></div></div></div><hr /></div>"
  },
  {
    "title": "Freddie Flintoff gets humbled by kids in the classroom",
    "url": "https://www.bbc.com/news/videos/c20zkk1xk56o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024xn/ichef.bbci.co.uk/images/ic/$widthxn/p0m2g2p8.jpg",
    "tag": "Culture",
    "date": "2025-09-12T12:24:09.000Z",
    "description": "Skip to contentWatch LiveBritish Broadcasting CorporationHomeNewsSportBusinessInnovationCultureArtsTravelEarthAudioVideoLiveWatch LiveWatch the full episode on BBC iPlayer.12 September 2025Reality TVAndrew...",
    "body": "<div><div><p><a target=\"_blank\" href=\"https://www.bbc.com/news/videos/c20zkk1xk56o?at_medium=RSS&at_campaign=rss#main-content\">Skip to content</a></p></div><div><div><p><a target=\"_blank\" href=\"https://www.bbc.com/watch-live-news/\"><span><span><svg width=\"32\" height=\"32\"></svg></span><span>Watch Live</span></span></a></p></div><div><p><a target=\"_blank\" href=\"https://www.bbc.com/\"><svg>British Broadcasting Corporation</svg></a></p></div></div><section><ul><li><div><p><a target=\"_blank\" href=\"https://www.bbc.com/\">Home</a></p></div></li><li><div><p><a target=\"_blank\" href=\"https://www.bbc.com/news\">News</a></p></div></li><li><div><p><a target=\"_blank\" href=\"https://www.bbc.com/sport\">Sport</a></p></div></li><li><div><p><a target=\"_blank\" href=\"https://www.bbc.com/business\">Business</a></p></div></li><li><div><p><a target=\"_blank\" href=\"https://www.bbc.com/innovation\">Innovation</a></p></div></li><li><div><p><a target=\"_blank\" href=\"https://www.bbc.com/culture\">Culture</a></p></div></li><li><div><p><a target=\"_blank\" href=\"https://www.bbc.com/arts\">Arts</a></p></div></li><li><div><p><a target=\"_blank\" href=\"https://www.bbc.com/travel\">Travel</a></p></div></li><li><div><p><a target=\"_blank\" href=\"https://www.bbc.com/future-planet\">Earth</a></p></div></li><li><div><p><a target=\"_blank\" href=\"https://www.bbc.com/audio\">Audio</a></p></div></li><li><div><p><a target=\"_blank\" href=\"https://www.bbc.com/video\">Video</a></p></div></li><li><div><p><a target=\"_blank\" href=\"https://www.bbc.com/live\">Live</a></p></div></li></ul></section><div><div><p><a target=\"_blank\" href=\"https://www.bbc.com/watch-live-news/\"><span><span><svg width=\"32\" height=\"32\"></svg></span><span>Watch Live</span></span></a></p></div></div><div><div><div><p><a target=\"_blank\" href=\"https://www.bbc.co.uk/iplayer/episode/m002j856/freddie-flintoffs-field-of-dreams-ultimate-test-episode-1\">Watch the full episode on BBC iPlayer.</a></p></div><p>12 September 2025</p></div><div><div><div><p><a target=\"_blank\" href=\"https://www.bbc.com/news/topics/cge0dgz6053t\">Reality TV</a></p></div><div><p><a target=\"_blank\" href=\"https://www.bbc.com/news/topics/cw1vn2qw2zwt\">Andrew Flintoff</a></p></div></div></div></div><hr /></div>"
  },
  {
    "title": "My Chemical Romance add Liverpool and Glasgow shows to UK tour",
    "url": "https://www.bbc.com/news/articles/clyql194w3no?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a2d1/live/7968a8b0-97cc-11f0-9dd8-57dfaa725755.jpg",
    "tag": "Culture",
    "date": "2025-09-22T16:28:43.000Z",
    "description": "2 days agoGetty ImagesMy Chemical Romance will revisit 2006 album Welcome to the Black Parade next yearMy Chemical Romance have added further shows in Liverpool and Glasgow to their UK tour next year.The...",
    "body": "<div><article><div><p>2 days ago</p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250905-110137-f27f908f49-web-2.29.1-3/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/a2d1/live/7968a8b0-97cc-11f0-9dd8-57dfaa725755.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/a2d1/live/7968a8b0-97cc-11f0-9dd8-57dfaa725755.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/a2d1/live/7968a8b0-97cc-11f0-9dd8-57dfaa725755.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/a2d1/live/7968a8b0-97cc-11f0-9dd8-57dfaa725755.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/a2d1/live/7968a8b0-97cc-11f0-9dd8-57dfaa725755.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/a2d1/live/7968a8b0-97cc-11f0-9dd8-57dfaa725755.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/a2d1/live/7968a8b0-97cc-11f0-9dd8-57dfaa725755.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/a2d1/live/7968a8b0-97cc-11f0-9dd8-57dfaa725755.jpg.webp\" alt=\"Getty Images A band performing onstage - the singer has dyed blond hairand a dark suit on. The guitarist and bassist are visible behind him, also in black, while large video screens are on the wall behind him. \" /><span>Getty Images</span></p></div><p></p><figcaption>My Chemical Romance will revisit 2006 album Welcome to the Black Parade next year</figcaption><p></p></figure><div><p>My Chemical Romance have added further shows in Liverpool and Glasgow to their UK tour next year.</p><p>The group <a target=\"_blank\" href=\"https://www.bbc.co.uk/news/articles/cjr11zlj888o\">previously announced two nights at Wembley Stadium</a> in July 2026 to mark the 20th anniversary of their third album Welcome to the Black Parade.</p><p>Now the band will headline Anfield Stadium on 30 June, marking their first Liverpool visit since 2006, before a show at Bellahouston Park in Glasgow on 4 July.</p><p>A third night at Wembley on 8 July has also been added, after the first two shows sold out.</p></div><div><p>Tickets go on sale on Friday at 12:00, while new gigs have also been announced for across North America.</p><p>Tours of South America and Asia had already been confirmed. </p><p><a target=\"_blank\" href=\"http://news.bbc.co.uk/1/hi/entertainment/6053586.stm\">Rock opera concept album The Black Parade</a> was met with both critical and commercial success, achieving multi-platinum certification in both the US and the UK after being released in 2006.</p><p>The group later broke up in 2013, before reuniting in 2019. A tour for the following year eventually took place in 2022 after being delayed due to the Covid pandemic.</p><p>A tour across North America earlier this year sold more than 450,000 tickets and was praised by critics in publications like Variety, the Hollywood Reporter and the Los Angeles Times. </p><p>Bellahouston Park regularly holds gigs in Glasgow throughout the summer. </p><p>This year's line-up of gigs - under the Summer Sessions banner - were affected by a strike involving workers on the Glasgow underground.</p><p><a target=\"_blank\" href=\"https://www.bbc.co.uk/news/articles/cgmwgpyd03eo\">Fans faced disruption</a> trying to attend shows by Sting, Simple Minds and Stereophonics.</p></div></article></div>"
  },
  {
    "title": "Graceland fraud: Woman gets more than four years for trying to defraud Elvis Presley's family",
    "url": "https://www.bbc.com/news/articles/czjvpe2pxd7o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d36d/live/dadcb7a0-98a1-11f0-b37c-21373da9ac07.jpg",
    "tag": "Culture",
    "date": "2025-09-23T17:27:32.000Z",
    "description": "A woman was sentenced to more than four years in prison for a brazen scheme to conduct a fraudulent sale of Graceland, the famed estate of Elvis Presley.Lisa Jeanine Findley of Missouri pleaded guilty to...",
    "body": "<div><p>A woman was sentenced to more than four years in prison for a brazen scheme to conduct a fraudulent sale of Graceland, the famed estate of Elvis Presley.</p><p>Lisa Jeanine Findley of Missouri pleaded guilty to felony mail fraud in February, after <a target=\"_blank\" href=\"https://www.bbc.co.uk/news/articles/cdd7enz9r0qo\">prosecutors accused</a> her of using a fake company, falsified court filings, a fabricated loan, and the forged signature of Presley's late daughter to pry the estate away from the singer's family.</p><p>The judge  called it a \"wild scheme\" and \"highly sophisticated\", as she tried to defraud the Presley family.</p><p>Graceland, the rock legend's home of 20 years before his death in 1977, is a monument to his musical career and legacy, welcoming a half million visitors each year.</p></div><div><p>The 120-acre property occupies a near-mythical place in American popular culture and bears the distinction of National Historic Landmark. Visitors can view Presley's collection of bedazzled costumes and classic cars, as well as exhibits and events celebrating his work. </p><p>After Lisa Marie Presley, the singer's daughter and only child, died in 2023, her daughter, Riley Keough, inherited Graceland. </p><p>However, in 2024, a mysterious company called Naussany Investments claimed that before her death, Ms Presley took out a $3.8m (£3m) loan using Graceland as collateral, then failed to pay.</p><p>Prosecutors say that company was actually a fabrication. </p><p>Findley, 54, used several aliases to pose as the bogus lender, and threatened to foreclose on Graceland and auction the compound – unless the Presley family settled the claim for $2.85m.</p><p>They alleged Findley went so far as to file a fake creditor's claim in California, submit false loan documents in Tennessee, and publish a foreclosure sale notice in a local newspaper.</p><p>Elvis Presley Enterprises, which runs Graceland, said at the time that no such loan existed. Ms Keough, an actress, <a target=\"_blank\" href=\"https://www.bbc.co.uk/news/articles/crgg5pne2nno\">took legal action to halt the auction.</a></p><p>A judge later stopped the sale.</p><p>According to Findley's indictment, when the case made national headlines, she falsely claimed to Ms Keough's attorneys that a Nigerian identity thief had perpetrated the scheme.</p><p>Federal authorities arrested Findley in August 2024 and later charged her with mail fraud and aggravated identify theft. Pleading guilty to mail fraud in February, she told the judge she accepted responsibility for her actions.</p></div>"
  },
  {
    "title": "Dani Dyer pulls out of Strictly with broken ankle",
    "url": "https://www.bbc.com/news/articles/c98d6z1j9neo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c869/live/cd055240-98a1-11f0-b37c-21373da9ac07.jpg",
    "tag": "Culture",
    "date": "2025-09-23T20:26:32.000Z",
    "description": "8 hours agoIan YoungsCulture reporterDani Dyer has withdrawn from this year's Strictly Come Dancing after breaking her ankle.The TV personality, 29, said she \"landed funny\" in training on Friday, and had a...",
    "body": "<div><div><p>8 hours ago</p></div><p><span><p><span>Ian Youngs</span><span>Culture reporter</span></p></span></p></div><div><p>Dani Dyer has withdrawn from this year's Strictly Come Dancing after breaking her ankle.</p><p>The TV personality, 29, said she \"landed funny\" in training on Friday, and had a fracture confirmed after a scan on Monday.</p><p>\"To say I'm heartbroken is the biggest understatement,\" she said in a statement.</p><p>Her injury came after she took part in the pre-recorded launch show, which was broadcast on Saturday, but before the first competitive week of the series.</p></div><div><p>Dyer, who first found fame on Love Island, was paired with professional dancer Nikita Kuzmin on the launch show.</p><p>She said: \"I had a fall on Friday in rehearsals and landed funny. </p><p>\"I thought I had rolled my foot but it swelled up badly over the weekend and after an MRI scan yesterday, it turns out I have fractured my ankle.</p><p>\"Apparently doing the quickstep on a fracture is not advisable (!!) and the doctors have said I am not allowed to dance so l've had to pull out of the show.\"</p><p>She added: \"I am so going to miss dancing with Nikita but will of course be watching closely and cheering all the couples on.\"</p><p>Dyer also posted a tearful video on Instagram, in which she said she was \"heartbroken\" and \"absolutely gutted\" at having to leave the show.</p><p>\"I was having the best time ever. </p><p>\"It's a very, very annoying, devastating thing that I'm going through right now,\" she said, adding that she was going to take some time off social media. </p></div><div><p>The show's executive producer Sarah James said Dani and Nikita's partnership had got off \"to the most sensational start\", and \"everyone on the show is incredibly sad that she's no longer able to compete in this year's series\".</p><p>\"We send her all our love and best wishes for a swift recovery, and we very much hope to welcome her back to the ballroom in the future.\"</p><p>Judge Shirley Ballas was among those sending well wishes on Instagram. \"I'm so so sorry. But health is most important. Get well soon Angel,\" she said.</p><p>Dancer Dianne Buswell wrote: \"I'm so sorry Dani and Nikita. We will miss you so much xx.\"</p><p>Fellow professional Johannes Radebe said: \"Gutted for you both, take care of yourself.\"</p><p>Dyer is the second celebrity to withdraw before the contest has even begun, following <a target=\"_blank\" href=\"https://www.bbc.co.uk/news/articles/c74d71j4433o\">Game of Thrones actor Kristian Nairn</a>.</p></div>"
  },
  {
    "title": "Top stars call Jimmy Kimmel suspension 'dark moment' for free speech",
    "url": "https://www.bbc.com/news/articles/c62le8q959yo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/bb6d/live/42a09a00-985c-11f0-b567-dbb771c68d85.jpg",
    "tag": "Culture",
    "date": "2025-09-22T19:08:15.000Z",
    "description": "Hundreds of celebrities signed on to a letter backing late-night TV host Jimmy Kimmel after ABC suspended his show over remarks he made about the assassination of conservative activist Charlie Kirk.Jennifer...",
    "body": "<div><p>Hundreds of celebrities signed on to a letter backing late-night TV host Jimmy Kimmel after ABC suspended his show over remarks he made about the assassination of conservative activist Charlie Kirk.</p><p>Jennifer Aniston, Meryl Streep, and Robert DeNiro are among those calling Kimmel's suspension a \"dark moment for freedom of speech in our nation\".</p><p>ABC pulled the show indefinitely last week after the chair of the US broadcast regulator threatened action over the comedian's remarks. </p><p>The fallout has prompted a debate over free speech, with critics decrying the move as censorship and assailing ABC and its parent company Disney for appearing to bow to pressure from the Trump administration. </p></div><div><p>Kimmel delivered a monologue last week in which he expressed condolences to the Kirk family but criticised President Donald Trump and Republicans for their reaction to the assasination. </p><p>\"We hit some new lows over the weekend with the MAGA gang desperately trying to characterise this kid who murdered Charlie Kirk as anything other than one of them and doing everything they can to score political points from it,\" he said.</p><p>Brendan Carr, chair of the Federal Communications Commission (FCC), said Kimmel was misleading the American public with his comments.</p><p>The motivation and politics of the man charged with killing Kirk, Tyler Robinson, 22, remain unclear, though his mother told police he had become more left-wing over the past year, according to an indictment. Utah Governor Spencer Cox also said Robinson had a \"leftist ideology\".</p><p>After Kimmel's suspension, US President Donald Trump, who appointed Carr at the beginning of his second term, praised the decison. </p><p>Trump later said broadcast TV networks do not treat him fairly and could have their licences \"taken away\".</p><p>\"Efforts by leaders to pressure artists, journalists, and companies with retaliation for their speech strike at the heart of what it means to live in a free country,\" the celebrities' letter says. \"This is the moment to defend free speech across our nation.\"</p><p>Actors Alan Cumming and Florence Pugh also signed the letter spearheaded by the American Civil Liberties Union (ACLU).</p><p>They say many others are facing \"direct attacks on their freedom of expression\", including teachers, government employees, researchers and students, and are adding their voices to defend free speech.</p><p>Kimmel's fellow late-night US hosts lashed out at his suspension last week amid Trump's escalating threats to broadcast networks. </p><p>CBS announced in July that it is cancelling The Late Show hosted by Stephen Colbert, something it called \"purely a financial decision\", though some linked the move to a looming merger involving CBS's parent company that requires US regulatory approval.</p><p>Kimmel, who is among the top talk show personalities in the US, emceed the Oscars four times and has hosted Jimmy Kimmel Live! since 2003. </p><p>ABC pulled the plug after Nexstar Media, one of the biggest owners of TV stations in the US, said its stations would not air the show \"for the foreseeable future\".</p></div>"
  }
]