[
  {
    "title": "Aldous Huxley to George Orwell: My Hellish Vision of the Future is Better Than Yours (1949)",
    "url": "https://www.openculture.com/2025/10/aldous-huxley-to-george-orwell-my-hellish-vision-of-the-future-is-better-than-yours-1949.html",
    "image": "https://cdn8.openculture.com/2025/10/26201313/Screenshot-2025-10-26-at-8.13.32-PM-1024x524.png",
    "tag": "Culture",
    "date": "2025-10-27T08:00:44.000Z",
    "description": "\n\tin Books, Literature, Sci Fi |   \tOctober 27th, 2025  Leave a Comment\n\t\n\t\t\t\nIn 1949, George Orwell received a curi­ous let­ter from his for­mer high",
    "body": "\n\tin Books, Literature, Sci Fi |   \tOctober 27th, 2025  Leave a Comment\n\t\n\t\t\t\nIn 1949, George Orwell received a curi­ous let­ter from his for­mer high school French teacher.\nOrwell had just pub­lished his ground­break­ing book Nine­teen Eighty-Four, which received glow­ing reviews from just about every cor­ner of the Eng­lish-speak­ing world. His French teacher, as it hap­pens, was none oth­er than Aldous Hux­ley, who taught at Eton for a spell before writ­ing Brave New World (1931), the oth­er great 20th-cen­tu­ry dystopi­an nov­el.\nHux­ley starts off the let­ter prais­ing the book, describ­ing it as “pro­found­ly impor­tant.” He con­tin­ues, “The phi­los­o­phy of the rul­ing minor­i­ty in Nine­teen Eighty-Four is a sadism which has been car­ried to its log­i­cal con­clu­sion by going beyond sex and deny­ing it.”\nThen Hux­ley switch­es gears and crit­i­cizes the book, writ­ing, “Whether in actu­al fact the pol­i­cy of the boot-on-the-face can go on indef­i­nite­ly seems doubt­ful. My own belief is that the rul­ing oli­garchy will find less ardu­ous and waste­ful ways of gov­ern­ing and of sat­is­fy­ing its lust for pow­er, and these ways will resem­ble those which I described in Brave New World.” (Lis­ten to him read a dra­ma­tized ver­sion of the book here.)\nBasi­cal­ly, while prais­ing Nine­teen Eighty-Four, Hux­ley argues that his ver­sion of the future was more like­ly to come to pass.\nIn Hux­ley’s seem­ing­ly dystopi­an World State, the elite amuse the mass­es into sub­mis­sion with a mind-numb­ing drug called Soma and an end­less buf­fet of casu­al sex. Orwell’s Ocea­nia, on the oth­er hand, keeps the mass­es in check with fear thanks to an end­less war and a hyper-com­pe­tent sur­veil­lance state. At first blush, they might seem like they are dia­met­ri­cal­ly opposed but, in fact, an Orwellian world and a Hux­leyan one are sim­ply two dif­fer­ent modes of oppres­sion.\nWhile we haven’t quite arrived at either dystopi­an vision, the pow­er of both books is that they tap into our fears of the state. While Hux­ley might make you look askance at The Bach­e­lor or Face­book, Orwell makes you recoil in hor­ror at the gov­ern­ment throw­ing around phras­es like “enhanced inter­ro­ga­tion” and “sur­gi­cal drone strikes.”\nYou can read Huxley’s full let­ter below.\nWright­wood. Cal.\n21 Octo­ber, 1949\nDear Mr. Orwell,\nIt was very kind of you to tell your pub­lish­ers to send me a copy of your book. It arrived as I was in the midst of a piece of work that required much read­ing and con­sult­ing of ref­er­ences; and since poor sight makes it nec­es­sary for me to ration my read­ing, I had to wait a long time before being able to embark on Nine­teen Eighty-Four.\nAgree­ing with all that the crit­ics have writ­ten of it, I need not tell you, yet once more, how fine and how pro­found­ly impor­tant the book is. May I speak instead of the thing with which the book deals — the ulti­mate rev­o­lu­tion? The first hints of a phi­los­o­phy of the ulti­mate rev­o­lu­tion — the rev­o­lu­tion which lies beyond pol­i­tics and eco­nom­ics, and which aims at total sub­ver­sion of the indi­vid­u­al’s psy­chol­o­gy and phys­i­ol­o­gy — are to be found in the Mar­quis de Sade, who regard­ed him­self as the con­tin­u­a­tor, the con­sum­ma­tor, of Robe­spierre and Babeuf. The phi­los­o­phy of the rul­ing minor­i­ty in Nine­teen Eighty-Four is a sadism which has been car­ried to its log­i­cal con­clu­sion by going beyond sex and deny­ing it. Whether in actu­al fact the pol­i­cy of the boot-on-the-face can go on indef­i­nite­ly seems doubt­ful. My own belief is that the rul­ing oli­garchy will find less ardu­ous and waste­ful ways of gov­ern­ing and of sat­is­fy­ing its lust for pow­er, and these ways will resem­ble those which I described in Brave New World. I have had occa­sion recent­ly to look into the his­to­ry of ani­mal mag­net­ism and hyp­no­tism, and have been great­ly struck by the way in which, for a hun­dred and fifty years, the world has refused to take seri­ous cog­nizance of the dis­cov­er­ies of Mes­mer, Braid, Esdaile, and the rest.\nPart­ly because of the pre­vail­ing mate­ri­al­ism and part­ly because of pre­vail­ing respectabil­i­ty, nine­teenth-cen­tu­ry philoso­phers and men of sci­ence were not will­ing to inves­ti­gate the odd­er facts of psy­chol­o­gy for prac­ti­cal men, such as politi­cians, sol­diers and police­men, to apply in the field of gov­ern­ment. Thanks to the vol­un­tary igno­rance of our fathers, the advent of the ulti­mate rev­o­lu­tion was delayed for five or six gen­er­a­tions. Anoth­er lucky acci­dent was Freud’s inabil­i­ty to hyp­no­tize suc­cess­ful­ly and his con­se­quent dis­par­age­ment of hyp­no­tism. This delayed the gen­er­al appli­ca­tion of hyp­no­tism to psy­chi­a­try for at least forty years. But now psy­cho-analy­sis is being com­bined with hyp­no­sis; and hyp­no­sis has been made easy and indef­i­nite­ly exten­si­ble through the use of bar­bi­tu­rates, which induce a hyp­noid and sug­gestible state in even the most recal­ci­trant sub­jects.\nWith­in the next gen­er­a­tion I believe that the world’s rulers will dis­cov­er that infant con­di­tion­ing and nar­co-hyp­no­sis are more effi­cient, as instru­ments of gov­ern­ment, than clubs and pris­ons, and that the lust for pow­er can be just as com­plete­ly sat­is­fied by sug­gest­ing peo­ple into lov­ing their servi­tude as by flog­ging and kick­ing them into obe­di­ence. In oth­er words, I feel that the night­mare of Nine­teen Eighty-Four is des­tined to mod­u­late into the night­mare of a world hav­ing more resem­blance to that which I imag­ined in Brave New World. The change will be brought about as a result of a felt need for increased effi­cien­cy. Mean­while, of course, there may be a large scale bio­log­i­cal and atom­ic war — in which case we shall have night­mares of oth­er and scarce­ly imag­in­able kinds.\nThank you once again for the book.\nYours sin­cere­ly,\nAldous Hux­ley\nNote: An ear­li­er ver­sion of this post appeared on our site in 2015.\nRelat­ed Con­tent:\nHear Aldous Hux­ley Nar­rate His Dystopi­an Mas­ter­piece, Brave New World\nAldous Hux­ley Tells Mike Wal­lace What Will Destroy Democ­ra­cy: Over­pop­u­la­tion, Drugs & Insid­i­ous Tech­nol­o­gy (1958)\nGeorge Orwell Iden­ti­fies the Main Ene­my of the Free Press: It’s the “Intel­lec­tu­al Cow­ardice” of the Press Itself\nGeorge Orwell Explains in a Reveal­ing 1944 Let­ter Why He’d Write 1984\nAldous Hux­ley to George Orwell: My Hell­ish Vision of the Future is Bet­ter Than Yours (1949)\nAldous Huxley’s Most Beau­ti­ful, LSD-Assist­ed Death: A Let­ter from His Wid­ow\nJonathan Crow is a writer and film­mak­er whose work has appeared in Yahoo!, The Hol­ly­wood Reporter, and oth­er pub­li­ca­tions.\n\t\t\n        \t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Aldous Huxley to George Orwell: My Hellish Vision of the Future is Better Than Yours (1949)",
      "image": [
        "https://cdn8.openculture.com/2025/10/26201313/Screenshot-2025-10-26-at-8.13.32-PM-1024x524.png"
      ],
      "datePublished": "2025-10-27T08:00:44.000Z",
      "dateModified": "2025-10-27T08:00:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Social Realism and the Surreal Converge in Bryce Wymer's Evocative Sketchbooks",
    "url": "https://www.thisiscolossal.com/2025/10/bryce-wymer-sketchbooks-drawings-illustrations/",
    "image": "https://www.thisiscolossal.com/wp-content/uploads/2025/10/wymer-8-e1761410157894.jpeg",
    "tag": "Culture",
    "date": "2025-10-26T11:17:00.000Z",
    "description": "\n\n\t\nMysterious light sources, geometric puzzles, disjointed figures, and bold hues characterize the diverse, narrative compositions of Bryce Wymer. Th",
    "body": "\n\n\t\nMysterious light sources, geometric puzzles, disjointed figures, and bold hues characterize the diverse, narrative compositions of Bryce Wymer. The Brooklyn-based artist is known for his enigmatic, emotive murals, paintings, and illustrations. Merging the analog and the digital, Wymer’s pieces often explore themes of social interactions and power dynamics, often through a lens tinged with anxiety, mystery, and solitude.\nWhether working on large-scale commissions or more intimate drawings, sketchbooks remain Wymer’s primary jumping-off points. “I’ve been keeping sketchbooks since middle school, when I filled them with graffiti tags, local DIY show flyer ideas, and zine layouts,” Wymer tells Colossal. “Over the years, they’ve evolved from casual notebooks into an essential part of my creative process. I carry one with me at all times, and without it, I feel pretty untethered.”\n\n\n\nThe artist often makes his way through three to four books each year, sometimes experimenting with compositions on grander canvases but often leaving them within their small format. “Some lose their raw energy when translated to a larger scale, which is a tension I enjoy trying to navigate,” he says. “That in-between space, where an idea first lands and where it eventually ends up, is part of what keeps the process so compelling.”\nWymer has recently been focused on figurative motifs that examine what he describes as “quiet tension and emotional complexity.” He positions the figures within minimal environments, highlighting social dynamics with undercurrents of vulnerability and perceptions of control—or lack thereof.\nFlat planes of saturated color nod to Social Realism, a movement that emerged between the World Wars and shone a light on everyday people as heroes in the face of especially government-generated adversity. For Wymer, Social Realism is indelibly linked to emotional and collective experience, which he channels through a varied and ever-evolving contemporary aesthetic. “More than anything, the sketchbook is my playground, free from expectations or fear of failure,” he says. “In any artistic practice, it’s important to have a space where very few rules exist.” \nSee more on Wymer’s website and Instagram, and watch even more timelapses on his Vimeo channel.\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Social Realism and the Surreal Converge in Bryce Wymer's Evocative Sketchbooks",
      "image": [
        "https://www.thisiscolossal.com/wp-content/uploads/2025/10/wymer-8-e1761410157894.jpeg"
      ],
      "datePublished": "2025-10-26T11:17:00.000Z",
      "dateModified": "2025-10-26T11:17:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Palais de Tokyo Says Martinique Flag Artwork Could Be “Illegal” ",
    "url": "https://hyperallergic.com/1052127/palais-de-tokyo-says-cameron-rowland-martinique-flag-artwork-could-be-illegal/",
    "image": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/10/49628474752_b85f46446b_k.jpg?fit=2118%2C1200&quality=90&ssl=1",
    "tag": "Culture",
    "date": "2025-10-26T19:59:00.000Z",
    "description": "\n\t\t\t\n\t\t\t\t\t\t\tThe Palais de Tokyo in Paris (photo by Francisco Anzola via Flickr, CC BY 2.0)\n\t\t\t\n\t\t\t\t\n\n\t\nA work by American artist Cameron Rowland was t",
    "body": "\n\t\t\t\n\t\t\t\t\t\t\tThe Palais de Tokyo in Paris (photo by Francisco Anzola via Flickr, CC BY 2.0)\n\t\t\t\n\t\t\t\t\n\n\t\nA work by American artist Cameron Rowland was taken down from the facade of the Palais de Tokyo in Paris after the museum said the piece, which involves replacing the French flag with the flag of Martinique, “could be considered illegal” under French law, Hyperallergic confirmed.\nThe contemporary art museum determined that “Replacement” (2025), which comments on the colonization of Martinique, an “overseas region” of France in the Caribbean, could violate laws governing the public display of flags. Rowland’s work was part of the exhibition ECHO DELAY REVERB: American Art, Francophone Thought, which opened at the Palais de Tokyo on Wednesday, October 22.\nA spokesperson for Palais de Tokyo told Hyperallergic that the museum had planned to include the work in the exhibition since the spring, but on September 18, they received a memorandum from the office of the French Secretary General of the Ministry of the Interior related to the public display of flags.\nThe memo reiterated the “principle of neutrality” of the Conseil d’État, France’s highest administrative court, which prohibits the display on public buildings of symbols representing the advocacy of political, religious, or philosophical opinions.”\nThe notification came as the French government cracked down on the displays of Palestinian flags that had been flown at town halls in response to President Emmanuel Macron’s recognition of Palestinian statehood.\nAfter consulting with Rowland and their gallery, Palais de Tokyo allowed the flag to hang during the exhibition’s opening day only, and moved its accompanying text inside the museum afterward with a note that the flag had been excluded due to potential violations of French law.\n“Following this note and in consideration of the principle of public service neutrality, the Palais de Tokyo sought several legal opinions regarding the presentation of the artwork,” the spokesperson said. “These opinions indicated that the artist’s original display would contravene the principle of neutrality in public service.”\n\nA post from Maxwell Graham Gallery included photos of the updated museum labels. (screenshot Hyperallergic via Instagram)\nRowland’s New York-based gallery, Maxwell Graham, first announced the decision to exclude the piece on Instagram, posting images of updated labels inside the museum. The gallery has not yet responded to Hyperallergic’s inquiries.\nMartinique, located southeast of Puerto Rico, has been a territory of France since it was colonized in 1635. It was the birthplace of Frantz Fanon, the widely influential psychiatrist and anti-colonial theorist. In 2024, France sent an anti-riot police force accused of excessive force to the island to quell protests against racial and social inequalities. \nRowland’s text recognizes the original colonization of the island and ongoing political movements. A plaque accompanying “Replacement” alludes to ongoing liberation struggles in Martinique. \n“Black Martinicans have pursued the end of French rule for 390 years,” the text reads. “As early as 1665, black rebels in Martinique wore red, black, and green as a ‘rallying sign.'”\nRowland received the MacArthur “Genius” award in 2019, a no-strings-attached $800,000 grant given to artists based on creative merit.\n\t\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\tIsa Farfan is a staff reporter for Hyperallergic. In May 2024, she graduated from Barnard College, where she studied Political Science and English and served as the Columbia Daily Spectator's Arts &...\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\tMore by Isa Farfan\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\n\t\t\t\t\n\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Palais de Tokyo Says Martinique Flag Artwork Could Be “Illegal” ",
      "image": [
        "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/10/49628474752_b85f46446b_k.jpg?fit=2118%2C1200&quality=90&ssl=1"
      ],
      "datePublished": "2025-10-26T19:59:00.000Z",
      "dateModified": "2025-10-26T19:59:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Gilbert & George Forever Together",
    "url": "https://hyperallergic.com/1052154/gilbert-george-forever-together-hayward-gallery/",
    "image": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/10/Gilbert-George-Fates-2005-medium-res.jpg?fit=2560%2C1432&quality=90&ssl=1",
    "tag": "Culture",
    "date": "2025-10-26T20:02:00.000Z",
    "description": "\n\t\t\t\n\t\t\t\t\t\t\tGilbert & George, \"Fates\" (2005) (© Gilbert & George, courtesy White Cube)\n\t\t\t\n\t\t\t\t\n\n\t\nLONDON — Who are — or, better, what is — Gilbert & ",
    "body": "\n\t\t\t\n\t\t\t\t\t\t\tGilbert & George, \"Fates\" (2005) (© Gilbert & George, courtesy White Cube)\n\t\t\t\n\t\t\t\t\n\n\t\nLONDON — Who are — or, better, what is — Gilbert & George? British-born George Passmore (the taller one) and Gilbert Prousch, the shorter Italian one from San Martin de Tor in the South Tyrol province, met at St Martins School of Art in 1967. In 1969 they donned suits tailored in an already vintage style (the tweed three-piece that became their uniform), slathered themselves in multicolored metallic paint and sang “Underneath the Arches.” This was the first iteration of themselves as artwork. Since then, the oddball duo in archaic English dress have lived and worked together in East London as perhaps one of the original, most complete, and longest running examples of performance art. They speak as one, are married, and appear together nearly all the time, but always as their own art. \nThe problem with being the artwork, one would think, is that it is financially and practically unsustainable as a career (at least without a decades-long demand for singing sculptures). Thus out of necessity they turned to visual output: large-scale photomontages composed of smaller panels, like stained glass windows, always featuring the two men. Judging from the lending institutions named in the Hayward Gallery’s 25-year survey, Gilbert & George: 21st Century Pictures, these works have proven to be collectible. The list includes, variously, the Burger Collection, Hong Kong, Tate; Museum of Fine Arts, Houston; and several private collections (curiously, several in Vienna), among many others. \nGilbert & George, “Bagrave” (2020)\nRachel Thomas, the Roden Chief Curator, along with assistant curators Suzanna Petot and Hannah Martin, seem to have placed the works according to the available wall shape, for the Hayward’s unusually sized and spaced walls are crammed. There are no captions listing name, date, and ownership, and the installation follows no chronological order. Each piece has a year, title, and the artists’ trademark signature embedded within it. A wall text explains how Gilbert & George explore “the fundamental truths at the heart of our existence: death, hope, life, fear, sex, money, race, religion.” So everything then. The curators intersperse text explaining how the artists “adapt sacred imagery to challenge religious belief systems” or “have always acknowledged mortality.” Their commentary is moot, for the images function less as means to explore these themes than to perpetuate the concept of Gilbert & George as the artwork, or even a brand. It is quite impressive how consistently they refer back to themselves as the OG.\nThey appear in every single piece, whether looming large with Mao-like enormous heads in three-quarter profile or making mock-shocked faces to the camera or facing frontally with arms outstretched in quasi-religious blessing, eyes cut out and alarmingly emphasized like so many ancient votive figurines. There is more than a whiff of idolatry in how they constantly appear as gods in their own icons. This is not to say that the images are propagandistic: they are filled with cheek, humor, provocation, and irreverence that is at times disarmingly charming. The standardized black-lined window format evokes the panels of a cartoon, with contrasting oversaturated colors to match: here, Gilbert & George are sleeping on a park bench; here, they’re adventuring through the drug-addled streets of Britain. Large scale, vivid, with just enough reference to big themes such as sex, death, and religion, they tick all the boxes a contemporary collector would want. It feels as if they have made collectible editions of themselves. \n\nGilbert & George, “Murder” (2011)\nJust enough reference, because — befitting their blaring slogans that shout “No Nazis,” “Homo Riot,” “God loves fucking! Enjoy” (all capitalized, naturally), printed in the infamous British tabloid-style font and accompanied by examples of posters used on A-boards — the works provide no more depth or analysis than the newspapers they mimic. They do not offer a stance or interpretation, or even a jumping off point, as much art attempts to do. Like the singing sculpture, the images just exist. What do Gilbert & George actually think of all these incredibly pertinent and alarming issues plaguing society? To ask that question is to miss the point, darling. \nThe cult of Gilbert & George continues in the gift shop, where merchandise has gone to town on all the key elements that form their brand: cheeky irreverence in a wooden swear box (“Pay up and f**k off”), duo bookmarks (what do you mean, they don’t both read the same book at the same time?), police-style tape emblazoned with “Homo riot,” and pins that say “free dick.” A little like Jeff Koons, who speaks of the meaning in his works like a true Pop Art salesman, with a Cheshire grin, you have to admire Gilbert & George’s total dedication to being the art: a peculiarly dry and British double act.\n\nInstallation view of Gilbert & George: 21st Century Pictures at the Hayward Gallery, London. Center: “Ages” (2001)\nGilbert & George, “Anti-Fascist Zone” (2014)\nInstallation view of “Sex Money Race Religion” (2016) in Gilbert & George: 21st Century Pictures at the Hayward Gallery, London\nGilbert & George, “White Bastards” (2004)\nGilbert & George, “Metalepsy” (2008) (© Gilbert & George, courtesy White Cube)\nGilbert & George: 21st Century Pictures continues at the Hayward Gallery, Southbank Centre (Belvedere Road, London, England) through January 11, 2026. The exhibition was curated by Rachel Thomas, Suzanna Petot, and Hannah Martin.\n\t\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\tLondon based Olivia McEwan is a trained art historian with BA and MA degrees from the Courtauld Institute, now a freelance writer focusing on the London art world; this academic background contributing...\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\tMore by Olivia McEwan\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\n\t\t\t\t\n\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Gilbert & George Forever Together",
      "image": [
        "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/10/Gilbert-George-Fates-2005-medium-res.jpg?fit=2560%2C1432&quality=90&ssl=1"
      ],
      "datePublished": "2025-10-26T20:02:00.000Z",
      "dateModified": "2025-10-26T20:02:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Memory of a Nation Finds a Home in Lviv",
    "url": "https://hyperallergic.com/1052198/the-memory-of-a-nation-finds-a-home-in-lviv-stammering-circle/",
    "image": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/10/trains-lviv.jpg?fit=2400%2C1345&quality=90&ssl=1",
    "tag": "Culture",
    "date": "2025-10-26T20:01:00.000Z",
    "description": "\nLVIV — The city of Lviv has been a hub for Ukrainians fleeing Russian assaults and brutality since 2014, serving as a home to humanitarian projects l",
    "body": "\nLVIV — The city of Lviv has been a hub for Ukrainians fleeing Russian assaults and brutality since 2014, serving as a home to humanitarian projects like Superhumans and Unbroken that provide rehabilitation, support, extensive therapy, and prosthetics for war victims. Though it has not suffered nearly the volume and intensity of Russian attacks as have regions further east, it is far from immune to the current war. The storied, cathedral-rich city dating to the 13th century is subject to aerial attacks, including a recent one that killed one civilian and injured many more on August 21, shortly after I departed. \nI was there to visit The Stammering Circle, a signature component of Faktura 10, a year-long series of exhibitions, art projects, concerts, performances, films, and symposia mostly in Ukraine (two events were in New York). Faktura 10 Chief Curator and Director Marta Kuzma, an American from a Ukrainian immigrant family, was a crucial figure in the post-independence 1990s Ukrainian art scene. Now she’s come home, so to speak. The title of the exhibition, which is on view at Jam Factory Art Center and two other venues, references the Romanian-Jewish poet, writer, translator, and Holocaust survivor Paul Celan (born in what is now Chernivtsi in Ukraine) — specifically his efforts to fashion a language and art in his mother tongue, German, with the ability to survive and flourish amid trauma and war. \n\nJulie Poly, Ukrzaliznytsia (2025), framed color photograph mounted on aluminum and color photographs\nSurprisingly, few artworks in the exhibition directly address the current war, and many were made years ago, sometimes far from Ukraine. However, all do so obliquely, while situating artmaking in a context of war, resistance, resilience, and fundamental humanity. \nIn his 2011–12 series Structures of Madness, Ukrainian photographer Boris Mikhailov captures rugged rock formations, caves, and mountainous surfaces. Geological markings hint at human, energetic, often erotic, sometimes fantastical figures, which the artist’s adjacent drawings clarify — conflations of nature and humans. Mikhailov is from Kharkiv, now attacked daily and nightly by Russia. For me, his series assumes startling new connotations during wartime, including the fierce attachment of a people to their land.\nThe silhouette and drawn figures in Mikhailov’s work connect with those in American artist R.H. Quaytman’s nearby innovative paintings from her 2021 series Modern Subjects, Chapter Zero, based in part on artworks concerning pressing social issues by 19th-century Belgian painter Antoine Wiertz. An upended, headless body; a solitary, small orphan; a suicide with a pistol — these resonate in contemporary Ukraine.\n\nYana Kononova, Incendiary Lands (2025), black-and-white print from negative (photo Gregory Volk/Hyperallergic)\nYana Kononova’s large-scale, black and white photographs, at once voluptuous and foreboding, are of mud volcanoes and rocky terrain in oil-producing Azerbaijan, formerly part of the Soviet Union. They are coupled with “Incendiary Lands” (2025), comprising reprints of archival photos in a vitrine showing derricks and infrastructure from the late 19th and early 20th centuries. Russians were central to the development of the petroleum industry in Azerbaijan. Now, oil and gas fuel the Russian economy and war machine: Oil profits equal death for Ukrainians. Many countries are looking to independent Azerbaijan as a replacement for Russian petroleum. Kononova was born on the Azerbaijani island of Pirallahi and emigrated with her family to Ukraine during the First Nagorno-Karabakh War from 1988 to ’94 (part of the nation’s ongoing attacks on Armenian communities and cultural heritage). She is now living through another war. Juxtaposing geological and human time, her primeval landscapes link fossil fuels with global warming and war. \nConceptual, visual, and material correspondences course through this sensitively curated exhibition. A single, prominent sunflower in Japanese photographer Nobuyoshi Araki’s street scene “Tokyo Fine Day” (1993/2025), one of several photographs from early in his career in the exhibition, is especially apt here: The sunflower is a symbol of Ukraine. Lebanese artist Walid Raad’s vibrant inkjet prints are geometric abstractions that also resemble flowers, including sunflowers in some cases, as in the series Appendix 153, part of The Atlas Group (1989–2004) which archived imagined stories and artifacts of the Lebanese Civil War. \n\nWalid Raad in collaboration with The Atlas Group, 1989–2004, Appendix 153 (2019), framed pigmented inkjet print\nRaad’s accompanying fictional story indicates that these prints are photographs that the apocryphal Palestinian artist Suha Traboulsi took in the late 1950s of her own work. He writes that while “many Arab art historians” perceived her paintings as forerunners of Op-Art, they were instead based on shell explosions during the ’70s in war-stricken Beirut. A small photograph of an explosion is attached to each print. Raad’s story, sly and fanciful yet vaguely plausible, is indelible. He has found a novel way of transmuting war into beauty, terror into art, without sanitizing its brutality. \nElsewhere, Ukrainian artist Julie Poly’s 2025 photographs explore the life of Ukrzaliznytsia, the highly efficient and hospitable national rail system that gives the series its name. She capture scenes of everyday life: a female soldier in fatigues curled up and asleep in a sleeper car next to her black dog, a smiling woman with several fluffy dogs and numerous trophies; a shirtless, tattooed soldier with his head bowed as if deep in thought or prayer; children with their toys, a train car transformed into a makeshift hospital, diligent conductors at work. There is such humanity in these images — joy, love, sorrow, endurance, tenderness — that contrasts so extremely with Russia’s inhumane war. A young woman lying on her back calmly gazes at the camera. She embodies the whole nation’s exhaustion and resolve. \n\nJulie Poly, Ukrzaliznytsia (2025), framed color photograph mounted on aluminum and color photographs\nWhile Vladimir Putin seeks to deny and eliminate Ukrainian identity altogether, a collaborative installation by set designer Janina Pedan and artist Anna-Mariia Kucherenko at the Dim 42 art space features uniquely Ukrainian symbols, signs, and ornaments dating back centuries. At the Jam Factory, a film by Moyra Davey focuses on four diasporic artists: Paul Celan; Peter Hujar, who was raised by his Ukrainian grandparents; Kyiv-born filmmaker Maya Deren, whose family fled to escape anti-Jewish pogroms in the 1920s; and Brazilian writer Clarice Lispector, whose family also fled Western Ukraine during the pogroms.\nUkrainian filmmaker Oleksiy Radynski, collaborating with researcher Philipp Goll, has turned recently unearthed film footage taken by a group of Ukrainian filmmakers in Siberia in the 1980s into an extraordinary single-channel video, a travelogue of sorts titled “Where Russia Ends” (2024). Narrated by filmmaker Lyuba Knorozok, it exposes the brutality, greed, and racism underpinning the subjugation and exploitation of Indigenous peoples (notably Buryats) under the Russian Empire and later the Soviet Union, accompanied by enormous environmental damage. Left implicit is that Putin’s so-called “special military operation,” which also impacts Indigenous communities at home, is more of the same; yet another Russian colonial war with devastating consequences, including ecocide.\nDavey’s entrancing video “Four [чотири]” (2025), commissioned specifically for this exhibition, combines scenes of diverse people playing, dancing, communing, and exercising in Manhattan’s Riverside Park with the recitation of an excellent text about the artists, read by Davey in English and Knorozok in Ukrainian. The New York scenes include symbols of Ukrainian culture — hair, dancing, flowers, and music among them. Near this deeply touching video hang two absurdist yet ominous 1815–17 etchings by Francisco Goya with cavorting figures, women in one, men in the other. The Spanish artist was himself steeped in war and brings historical gravity to this superlative show, whose pangs and dreams still resonate with his own two centuries later.\n\nFrancisco Goya, “Disparate femenino” (1815–17) (left) and “Modo de Volar” (1815–16) (right), etching, aquatint, and drypoint on laid paper\nInstallation view of The Stammering Circle at the Jam Factory Art Center, with Nobuyoshi Araki’s “Tokyo Fine Day” (1993/2025) in the background and Boris Mikhailov’s Series of Four (1982–83/2025), print of contact sheet, in the foreground\nThe Stammering Circle continues at multiple venues across Lviv, Ukraine, through November 2. The exhibition was curated by Marta Kuzma.\n\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Memory of a Nation Finds a Home in Lviv",
      "image": [
        "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/10/trains-lviv.jpg?fit=2400%2C1345&quality=90&ssl=1"
      ],
      "datePublished": "2025-10-26T20:01:00.000Z",
      "dateModified": "2025-10-26T20:01:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Take a Trip Through Ursula K. Le Guin’s Conjured Worlds",
    "url": "https://hyperallergic.com/1052078/take-a-trip-through-ursula-k-le-guin-conjured-worlds/",
    "image": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/10/12-The-Word-For-World-c-Elena-Andreea-Teleaga.jpeg?fit=2560%2C1707&quality=90&ssl=1",
    "tag": "Culture",
    "date": "2025-10-26T20:00:00.000Z",
    "description": "\n\t\t\t\n\t\t\t\t\t\t\tInstallation view of The Word for World: The Maps of Ursula K. Le Guin at the Architectural Association School of Architecture, London (al",
    "body": "\n\t\t\t\n\t\t\t\t\t\t\tInstallation view of The Word for World: The Maps of Ursula K. Le Guin at the Architectural Association School of Architecture, London (all images © Elena Andreea Teleaga, unless otherwise noted)\n\t\t\t\n\t\t\t\t\n\n\t\nLONDON — How does any great creative work by a novelist or poet come into being? This question never fails to fascinate. Henry James preceded his great 1916 novel The Ambassadors by writing the most intricate of plot lines, a work almost as dense as the finished novel itself. It was quite different for the poet W.B. Yeats: The first draft of the first poem of a great sequence called The Tower was so far from its final outcome that you could never have guessed at it. And yet he got there in the end.\nAnd what of Ursula K. Le Guin, the American novelist, whose many works occupied a fascinating terrain somewhere between fantasy and science fiction? How did she begin to realize her multiple fictional creations? A new exhibition at the handsomely sited Architectural Association in London — in a Georgian building that looks out onto London’s sole surviving entire 18th-century square — shows us. The Word for World is a rhythmical presentation of slender, wafty banners suspended from the ceiling, all blue cyanotypes on which are maps reproduced in white. Navigating the space is a matter of ducking and weaving.\n\nInstallation view of The Word for World: The Maps of Ursula K. Le Guin at the Architectural Association School of Architecture, London, featuring an untitled and undated sketch of Stonehenge by Le Guin.\nYes, Le Guin was a map maker. That’s how she found her way into her invented worlds. After she made her maps, she proceeded to settle on them and mentally walk around inside them. If we home in on the exhibition’s maps themselves we can begin to unlock her secrets. Take, for example, “Earthsea,” an aerial view of a great archipelago of islands, several of the larger ones in a great central cluster, others frittering out in all directions of the compass. A close look at all the hand-drawn map’s detail reveals a great deal of naming of particular locations: Havnor, Osskill Sea, the Inmost Sea, mountains, a small group of islands collectively known as The Torikles. It was her way into the imaginative world that would eventually end in a celebrated  trilogy of novels. How did it help her? How did it show her the way ahead as a conjurer of a world that had never before existed?\nThe map was reproduced in the first edition of A Wizard of Earthsea (1968). Years later she explained in an introduction to the collected Books of Earthsea:\n\nThe first thing I did was sit down and draw a map. I saw and named Earthsea and all its islands. I knew almost nothing about  them, but I knew their names. In the name is the magic.\n\nThe naming was the key — it lit the touch paper. It enabled her to “set sail with [the wizard] Ged from Gont … to Rake, and the Ninety Isles, and Osskil, and farther east even than Astowell ….”\n\nInstallation view of hand-drawn maps, watercolors, and ink drawings in The Word for World: The Maps of Ursula K. Le Guin at the Architectural Association School of Architecture, London\nUrsula K. Le Guin, “Hemispheres of Gethen, unpublished, for The Left Hand of Darkness” (1969), ink on typewriter paper (courtesy the Ursula K. Le Guin Foundation)\nInstallation view of The Word for World: The Maps of Ursula K. Le Guin at the Architectural Association School of Architecture, London \nUrsula K. Le Guin, “Central and Western Earthsea, For a Wizard of Earthsea” (c. 1967), ink on paper (courtesy University of Oregon Libraries and the Ursula K. Le Guin Foundation)\nInstallation view of The Word for World: The Maps of Ursula K. Le Guin at the Architectural Association School of Architecture, London\nUrsula K. Le Guin in 1995 (photo by Marian Wood Kolisch)\nThe Word for World: The Maps of Ursula K. Le Guin continues at the Architectural Association School of Architecture (36 Bedford Square, London, England) through December 6. The exhibition was curated by Sarah Shin and designed by Standard Deviation, with consulting curator Theo Downes-Le Guin and the Ursula K Le Guin Foundation.\n\t\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\tMichael Glover is a Sheffield-born, Cambridge-educated, London-based poet and art critic, and poetry editor of The Tablet. He has written regularly for the Independent, the Times, the Financial Times,...\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\tMore by Michael Glover\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\n\t\t\t\t\n\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Take a Trip Through Ursula K. Le Guin’s Conjured Worlds",
      "image": [
        "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/10/12-The-Word-For-World-c-Elena-Andreea-Teleaga.jpeg?fit=2560%2C1707&quality=90&ssl=1"
      ],
      "datePublished": "2025-10-26T20:00:00.000Z",
      "dateModified": "2025-10-26T20:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Two Suspects Arrested in Paris Over Louvre Heist",
    "url": "https://www.artnews.com/art-news/news/louvre-heist-suspects-arrested-1234758905/",
    "image": "https://www.artnews.com/wp-content/uploads/2025/10/GettyImages-2241882739_cf5bc3.jpg?w=1024",
    "tag": "Culture",
    "date": "2025-10-26T15:18:01.000Z",
    "description": "\n\tTwo suspects have been arrested over the theft of French crown jewels from the Louvre on October 19, French authorities said.  \n\n\tParis prosecutor L",
    "body": "\n\tTwo suspects have been arrested over the theft of French crown jewels from the Louvre on October 19, French authorities said.  \n\n\tParis prosecutor Laure Beccuau said in a statement on Sunday that authorities made the arrests on Saturday evening. One man was reportedly detained while preparing to board a flight to Algeria at Charles de Gaulle Airport. The arrest was took place around 10 p.m. local time, according to the French newspaper Le Parisien, which first reported the news. \n\n\tAuthorities described the two suspects as both in their 30s and from the Seine-Saint-Denis area of Paris. On Friday, investigators said they were focusing on a newly surfaced video allegedly showing two thieves, one clad in a yellow vest and another in all black, escaping the Louvre with $102 million worth of Napoleonic jewelry using a furniture lift.\n\t\n\n\t\n\t\tRelated Articles\n\t\n\n\n\tNine artifacts were taken from the Louvre’s Apollo Gallery, however the thieves dropped one artifact, a crown, in their haste. The remainder of the loot has yet to be recovered by authorities. President Emmanuel Macron’s government revealed last week that the eight stolen jewels were not privately insured. According to the French culture ministry, the country would not be reimbursed for any losses linked to the stolen items if they are not recovered by the police. \n\n\tThe 36-second clip captured the pair descending from a window in the museum’s Apollo Gallery before fleeing the area on scooters. The heist took place in broad daylight and during museum operating hours, all within seven minutes. \n\n\tThe heist has plunged the Louvre and the Macron administration into a publicity crisis. Though museum director Laurence des Cars said the alarms functioned properly at the time of the heist, the lack of camera footage in the gallery or eyewitnesses has led to heavy scrutiny of the Louvre’s security system. Des Cars called the theft a “terrible failure” of the security system at the Paris museum while speaking to the French Senate, adding that the staff “did not detect the arrival of the thieves soon enough.” She said that she had submitted her resignation to Culture Minister Rachida Dati, however Dati did not accept the offer.\n\n\tLouvre staff had previously accused museum leadership of postponing security upgrades amid a staff shortage, and an audit of the Louvre leaked after the heist called the security “outdated.”\n\n\n\tt\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Two Suspects Arrested in Paris Over Louvre Heist",
      "image": [
        "https://www.artnews.com/wp-content/uploads/2025/10/GettyImages-2241882739_cf5bc3.jpg?w=1024"
      ],
      "datePublished": "2025-10-26T15:18:01.000Z",
      "dateModified": "2025-10-26T15:18:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]