[
  {
    "title": "Video: ‘HIM’ | Anatomy of a Scene",
    "url": "https://www.nytimes.com/video/movies/100000010408180/him-scene.html",
    "image": "https://static01.nyt.com/images/2025/09/19/multimedia/18cul-him-anatomy1/18cul-him-review-wzfp-facebookJumbo.jpg?video-overlay",
    "tag": "Culture",
    "date": "2025-09-19T08:50:00.000Z",
    "description": "new video loaded: ‘HIM’ | Anatomy of a Scenetranscriptbars0:00/2:17-2:17transcriptThe director Justin Tipping narrates a scene from “HIM,” featuring Marlon Wayans and Tyriq Withers.“Hi, My name is Justin...",
    "body": "<div><p>new video loaded: ‘HIM’ | Anatomy of a Scene</p><div><p>transcript</p><div><p><svg>bars</svg></p><div><div><p>0:00</p><p>/</p><p>2:17</p></div><div><p>-</p><p>2:17</p></div></div></div><div><div><p>transcript</p><h4>The director Justin Tipping narrates a scene from “HIM,” featuring Marlon Wayans and Tyriq Withers.</h4></div><dl><dd><p>“Hi, My name is Justin Tipping and I’m the director of “HIM.” “I’m going to need a little volunteer.” Mr. White. I got you. “My man!” This is the moment in the film where Isaiah White, played by Marlon Wayans, is going to teach Cameron Cade, played by Tyriq Withers a lesson in how to be a great quarterback. In this lesson, I did a lot of research about quarterback drills that hone in on specific skills. For example, in a pro game, you want to be able to get the ball out of your hands under two seconds. So that’s why we have two seconds on the clock and to work on that speed that’s required of decision making. That’s why he’s turned away from the actual receivers. He has his eyes closed. So that you’re forced into a panic-like situation, and you have to throw the ball as quickly as possible. So what I really wanted to communicate in this scene specifically, was that there’s going to be a big tonal shift from something’s off to something’s very wrong, and it’s the first time we’re going to introduce violence and a dynamic between the two characters that becomes much more like a narcissistic, abusive relationship than a mentor-mentee “Too slow.” But seed it and bury that under the guise of hazing and just being a rookie. And what I landed on was this idea of using this JUGS machine to be that conduit of punishment. I also didn’t want him to have time to process anything. That’s why I kind of try to get music and a rhythm going in the edit. And even the sound design is rhythmic. That vibration and metallic clanking, it escalates and grows and grows over this entire sequence. And then we have these really tight, extreme close-ups of Cameron Cade’s eyes. And that was just a creative choice I made to rely on the language of horror, where there’s a classic peekaboo.</p></dd></dl></div></div></div>"
  },
  {
    "title": "Freddie Flintoff gets humbled by kids in the classroom",
    "url": "https://www.bbc.com/news/videos/c20zkk1xk56o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024xn/ichef.bbci.co.uk/images/ic/$widthxn/p0m2g2p8.jpg",
    "tag": "Culture",
    "date": "2025-09-12T12:24:09.000Z",
    "description": "Skip to contentWatch LiveBritish Broadcasting CorporationHomeNewsSportBusinessInnovationCultureArtsTravelEarthAudioVideoLiveWatch LiveWatch the full episode on BBC iPlayer.12 September 2025Reality TVAndrew...",
    "body": "<div><div><p><a target=\"_blank\" href=\"https://www.bbc.com/news/videos/c20zkk1xk56o?at_medium=RSS&at_campaign=rss#main-content\">Skip to content</a></p></div><div><div><p><a target=\"_blank\" href=\"https://www.bbc.com/watch-live-news/\"><span><span><svg width=\"32\" height=\"32\"></svg></span><span>Watch Live</span></span></a></p></div><div><p><a target=\"_blank\" href=\"https://www.bbc.com/\"><svg>British Broadcasting Corporation</svg></a></p></div></div><section><ul><li><div><p><a target=\"_blank\" href=\"https://www.bbc.com/\">Home</a></p></div></li><li><div><p><a target=\"_blank\" href=\"https://www.bbc.com/news\">News</a></p></div></li><li><div><p><a target=\"_blank\" href=\"https://www.bbc.com/sport\">Sport</a></p></div></li><li><div><p><a target=\"_blank\" href=\"https://www.bbc.com/business\">Business</a></p></div></li><li><div><p><a target=\"_blank\" href=\"https://www.bbc.com/innovation\">Innovation</a></p></div></li><li><div><p><a target=\"_blank\" href=\"https://www.bbc.com/culture\">Culture</a></p></div></li><li><div><p><a target=\"_blank\" href=\"https://www.bbc.com/arts\">Arts</a></p></div></li><li><div><p><a target=\"_blank\" href=\"https://www.bbc.com/travel\">Travel</a></p></div></li><li><div><p><a target=\"_blank\" href=\"https://www.bbc.com/future-planet\">Earth</a></p></div></li><li><div><p><a target=\"_blank\" href=\"https://www.bbc.com/audio\">Audio</a></p></div></li><li><div><p><a target=\"_blank\" href=\"https://www.bbc.com/video\">Video</a></p></div></li><li><div><p><a target=\"_blank\" href=\"https://www.bbc.com/live\">Live</a></p></div></li></ul></section><div><div><p><a target=\"_blank\" href=\"https://www.bbc.com/watch-live-news/\"><span><span><svg width=\"32\" height=\"32\"></svg></span><span>Watch Live</span></span></a></p></div></div><div><div><div><p><a target=\"_blank\" href=\"https://www.bbc.co.uk/iplayer/episode/m002j856/freddie-flintoffs-field-of-dreams-ultimate-test-episode-1\">Watch the full episode on BBC iPlayer.</a></p></div><p>12 September 2025</p></div><div><div><div><p><a target=\"_blank\" href=\"https://www.bbc.com/news/topics/cge0dgz6053t\">Reality TV</a></p></div><div><p><a target=\"_blank\" href=\"https://www.bbc.com/news/topics/cw1vn2qw2zwt\">Andrew Flintoff</a></p></div></div></div></div><hr /></div>"
  },
  {
    "title": "Morrissey cancels US shows after death threat in Canada",
    "url": "https://www.bbc.com/news/articles/cx2jjer23ngo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/417f/live/f83ffda0-9687-11f0-bc30-47a784fa333f.jpg",
    "tag": "Culture",
    "date": "2025-09-21T01:33:34.000Z",
    "description": "2 days agoRobin Levinson-KingGetty ImagesBritish artist Morrissey has cancelled two shows in the US after receiving a death threat ahead of a concert in Ottawa, Canada.A 26-year-old Ottawa man was released on...",
    "body": "<div><article><div><div><p>2 days ago</p></div><p><span><p><span>Robin Levinson-King</span><span></span></p></span></p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250905-110137-f27f908f49-web-2.29.1-3/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/417f/live/f83ffda0-9687-11f0-bc30-47a784fa333f.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/417f/live/f83ffda0-9687-11f0-bc30-47a784fa333f.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/417f/live/f83ffda0-9687-11f0-bc30-47a784fa333f.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/417f/live/f83ffda0-9687-11f0-bc30-47a784fa333f.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/417f/live/f83ffda0-9687-11f0-bc30-47a784fa333f.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/417f/live/f83ffda0-9687-11f0-bc30-47a784fa333f.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/417f/live/f83ffda0-9687-11f0-bc30-47a784fa333f.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/417f/live/f83ffda0-9687-11f0-bc30-47a784fa333f.jpg.webp\" alt=\"Getty Images Morrissey bends back as he sings into a microphone, wearing a black suit and tie with a white shirt.\" /><span>Getty Images</span></p></div></figure><div><p>British artist Morrissey has cancelled two shows in the US after receiving a death threat ahead of a concert in Ottawa, Canada.</p><p>A 26-year-old Ottawa man was released on bail after <a target=\"_blank\" href=\"https://ottawacitizen.com/news/morrissey-alleged-death-threat\">allegedly uttering a threat to kill the singer</a>, whose real name is Steven Morrissey, ahead of his performance at a music festival last week. </p><p>The event went on as planned, but the singer later cancelled two shows in Massachusetts and Connecticut.</p><p>Morrissey was the front man of the rock band The Smiths, but left the band in 1987 to pursue a solo career.</p></div><div><p>He is known for being outspoken on issues such as animal welfare and politics. </p><p>In 2006, he refused to tour in Canada in protest at the annual seal hunt.</p><p>After the threat against his life in Ottawa last week, he cancelled Friday's show in Connecticut and one in Boston.</p><p>\"In recent days, there has been a credible threat on Morrissey's life,\" said a statement from the Boston venue on Instagram.</p><p>\"Out of an abundance of caution for the safety of both the artist and the band, tomorrow's engagement at the MGM Music Hall at Fenway has been canceled.\"</p></div></article></div>"
  },
  {
    "title": "Dating apps, booze and clubbing - Jane Austen's Emma comes into the 21st Century",
    "url": "https://www.bbc.com/news/articles/c8rvd5lrv6po?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/09a8/live/f738b910-8f2f-11f0-b391-6936825093bd.png",
    "tag": "Culture",
    "date": "2025-09-20T23:03:39.000Z",
    "description": "2 days agoEmma SaundersCulture reporterRichard Lakos and Design by Muse CreativeAmelia Kenworthy, who starred in Amazon Prime show Lord of the Rings: The Rings of Power, is playing Emma on stageYou're in a...",
    "body": "<article><div><div><p>2 days ago</p></div><p><span><p><span>Emma Saunders</span><span>Culture reporter</span></p></span></p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250905-110137-f27f908f49-web-2.29.1-3/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/867d/live/5aa38090-97a8-11f0-a243-4f09baf27685.png.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/867d/live/5aa38090-97a8-11f0-a243-4f09baf27685.png.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/867d/live/5aa38090-97a8-11f0-a243-4f09baf27685.png.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/867d/live/5aa38090-97a8-11f0-a243-4f09baf27685.png.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/867d/live/5aa38090-97a8-11f0-a243-4f09baf27685.png.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/867d/live/5aa38090-97a8-11f0-a243-4f09baf27685.png.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/867d/live/5aa38090-97a8-11f0-a243-4f09baf27685.png.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/867d/live/5aa38090-97a8-11f0-a243-4f09baf27685.png.webp\" alt=\"Richard Lakos and Design by Muse Creative Amelia Kenworthy as Emma wearing a grey T-shirt with her blonde hair piled up in a bun.\" /><span>Richard Lakos and Design by Muse Creative</span></p></div><p></p><figcaption>Amelia Kenworthy, who starred in Amazon Prime show Lord of the Rings: The Rings of Power, is playing Emma on stage</figcaption><p></p></figure><div><p>You're in a sweaty nightclub in Essex. You're hammered. And your pushy best friend is trying to sort out your love life. It's Jane Austen's Emma, but not as you know it. </p><p>For the uninitiated, the 1815 novel follows the charmed life of our protagonist in Regency England as she busies herself interfering in her friends' relationships (or matchmaking, depending on your point of view).</p><p>In Ava Pickett's fresh adaptation, being staged at London's Rose Theatre, Emma Woodhouse still has all the trademark traits of our beloved original heroine – she's clever, quick-witted, meddling, haughty and occasionally cruel.</p><p>But instead of navigating society balls and dowries, Pickett's modern Emma is poking her nose into her friends' online dating profiles, having returned home after failing her exams at Oxford University.</p><p>Emma is the first from her family to go to university and isn't about to come clean to her proud working class dad about why she's suddenly back.</p><p>Pickett herself, who hails from Clacton in Essex, was also one of the first in her family to go to university.</p><p>Although she finished her degree, she says she \"felt like a failure\" and became \"defensive\" afterwards when she went back home and couldn't find work (having trained as an actor). That \"manifested as being quite contrary and overconfident in how everyone else should be living... and how I needed to be\", she says. \"And so I think a lot of that is at play with Emma.\"</p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250905-110137-f27f908f49-web-2.29.1-3/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/6581/live/e4446b90-8cd4-11f0-9864-595ea7031b48.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/6581/live/e4446b90-8cd4-11f0-9864-595ea7031b48.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/6581/live/e4446b90-8cd4-11f0-9864-595ea7031b48.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/6581/live/e4446b90-8cd4-11f0-9864-595ea7031b48.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/6581/live/e4446b90-8cd4-11f0-9864-595ea7031b48.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/6581/live/e4446b90-8cd4-11f0-9864-595ea7031b48.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/6581/live/e4446b90-8cd4-11f0-9864-595ea7031b48.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/6581/live/e4446b90-8cd4-11f0-9864-595ea7031b48.jpg.webp\" alt=\"Getty Images Ava Pickett head and shoulders shot; she has long brown hair and is wearing silver hooped earrings.\" /><span>Getty Images</span></p></div><p></p><figcaption>Ava Pickett trained as an actor but then tried her hand at writing</figcaption><p></p></figure><div><p>At 31, Pickett is making a name for herself as one of the UK's most prolific and talented young writers. She's penned scripts for TV dramas including Sky's Brassic and the BBC's Ten Pound Poms, had her debut play 1536 staged at London's Almeida theatre, and is writing a film about Joan of Arc with Baz Luhrmann, no less.</p><p>She tells me that though she hadn't read Emma before being approached by the Rose's Christopher Haydon, who is directing the play, she was hooked once she started it. </p><p>\"I really identified with that feeling of [being] 21. She's so young, but is on the cusp of adulthood. She believes she knows everything about everyone else's life and what they need to do in order to get to happiness. She reminded me so much of me at that age.\"</p><p>Austen is definitely having a moment (not that she's ever really been away). This year marks the 250th anniversary of her birth, and in recent years we've enjoyed BBC TV series Miss Austen, <a target=\"_blank\" href=\"https://www.bbc.co.uk/news/entertainment-arts-51458345\">a film adaptation of Emma starring Anya Taylor Joy</a>, and the West End's Clueless musical (based on the cult 90s teen film adaptation of Emma, which Pickett calls a \"masterpiece\").</p><p>There's also a new adaptation of Pride and Prejudice starring Emma Corrin coming to Netflix.</p></div><p></p><h2>Toxic dating apps</h2><p></p><div><p>Pickett says she wanted to do a contemporary adaptation of Emma, rather than a period version, after \"talking to a lot of my friends about it, how they felt about dating, and I felt like I was beginning to recognise Emmas in my life\".</p><p>This Emma (played by Amelia Kenworthy) and the other main players, including love interest George Knightley (Kit Young), are more likely to spend their spare time in the pub or local nightclub than sipping tea from the finest china or practising the piano.</p><p>And there's always a spare half hour here or there to obsess over your online dating profile and potential matches (or should we say suitors).</p><p>\"It's so brutal because I think the apps can get really addictive, so that your validation comes from how many likes you have, how many matches you get... It becomes a kind of game... so a lot of your self-worth is coming from a number on your screen,\" Pickett says. </p><p>\"This idea of ghosting someone can be really, really cruel,\" she adds. </p><p>\"In my experience, a lot of young men have found the apps toxic too... They are perpetuating a value system that doesn't value human complexity or awkwardness.\" </p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250905-110137-f27f908f49-web-2.29.1-3/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/0f71/live/2481e320-955b-11f0-b830-3f3c6ed9c9f6.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/0f71/live/2481e320-955b-11f0-b830-3f3c6ed9c9f6.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/0f71/live/2481e320-955b-11f0-b830-3f3c6ed9c9f6.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/0f71/live/2481e320-955b-11f0-b830-3f3c6ed9c9f6.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/0f71/live/2481e320-955b-11f0-b830-3f3c6ed9c9f6.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/0f71/live/2481e320-955b-11f0-b830-3f3c6ed9c9f6.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/0f71/live/2481e320-955b-11f0-b830-3f3c6ed9c9f6.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/0f71/live/2481e320-955b-11f0-b830-3f3c6ed9c9f6.jpg.webp\" alt=\"Marc Brenner Amelia Kenworthy and Kit Young star in Pickett's Emma. Kenworthy is wearing a light blue formal dress and Young is in a cream suit. They are mid-conversation.\" /><span>Marc Brenner</span></p></div><p></p><figcaption>Emma is too busy meddling with Harriet's love life to notice her burgeoning relationship with George</figcaption><p></p></figure><div><p>Young, who has starred in TV shows such as Netflix's Shadow and Bone, adds: \"This production really showcases that technology is just another lens of confusion, because someone can... get it wrong. We have much more facility for communication, but that doesn't mean that we communicate any better and... that's actually the chaos of it all.\"</p><p>His character is a steady presence in Emma's life and they are a more similar age than in the book, where George is about 17 years older.</p><p>Pickett explains: \"I wasn't really interested in her being an ingénue.\"</p><p>Young adds: \"George is very astute, very smart. He doesn't hate where he's from, and he's quite comfortable there.</p><p>\"The one person that grinds his gears is Emma. You can absolutely love someone and hate someone at the same time.\"</p><p>Kenworthy, who plays the lead, is sympathetic to her character.</p><p>\"Every choice she makes is because she's just trying to help people, and it's messy and it's complicated. But her heart's in the right place. She probably just needs to see a therapist!\"</p><p>Emma's long-suffering best friend Harriet (Sofia Oxenham) has remained in their home town while Emma has been away studying, and has a more rounded and significant role in Pickett's version than in the novel. </p><p>\"I really love writing female friendships because I think they are wonderful but brutal and difficult. No-one teaches you at school that it's work to stay friends for a long time,\" Pickett says.</p><p>One of Austen's most famous quotes comes courtesy of Emma, who says to Harriet: \"You must be the best judge of your own happiness\" (before ironically talking her into turning down a proposal from farmer Robert Martin due to her own snobbery). </p><p>\"I really wanted to dig into that a lot. It's something Emma has to learn,\" Pickett says. </p><p>The writer is hoping the universal appeal of Austen will translate to audiences more than 200 years after Emma was first published.</p><p>\"The human condition is, in lots of ways, still the same. Jealousy is jealousy. Love is love.\"</p></div><p><i>Emma is on at the Rose Theatre in Kingston, London, from 17 September until 11 October 2025.</i></p><div><p><span>More weekend picks</span></p></div></article>"
  },
  {
    "title": "Optimo DJ JD Twitch dies after being diagnosed with brain tumour",
    "url": "https://www.bbc.com/news/articles/c5yjjdv68y7o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a4d0/live/a5d90390-9623-11f0-97cc-2b4ec970e91f.jpg",
    "tag": "Culture",
    "date": "2025-09-20T13:26:13.000Z",
    "description": "2 days agoGetty ImagesKeith McIvor, also known as JD Twitch, started the Optimo Espacio club night at Sub Club in 1997Keith McIvor, one half of Glasgow club duo Optimo, has died aged 57.Known by the stage...",
    "body": "<article><div><p>2 days ago</p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250905-110137-f27f908f49-web-2.29.1-3/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/a4d0/live/a5d90390-9623-11f0-97cc-2b4ec970e91f.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/a4d0/live/a5d90390-9623-11f0-97cc-2b4ec970e91f.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/a4d0/live/a5d90390-9623-11f0-97cc-2b4ec970e91f.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/a4d0/live/a5d90390-9623-11f0-97cc-2b4ec970e91f.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/a4d0/live/a5d90390-9623-11f0-97cc-2b4ec970e91f.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/a4d0/live/a5d90390-9623-11f0-97cc-2b4ec970e91f.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/a4d0/live/a5d90390-9623-11f0-97cc-2b4ec970e91f.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/a4d0/live/a5d90390-9623-11f0-97cc-2b4ec970e91f.jpg.webp\" alt=\"Getty Images Keith McIvor on stage. He is wearing a black T-shirt with the number 1000 in grey writing. A laptop is in the foreground. His left hand is on a deck and he has headphones round his neck. He is standing in front of a green background.\" /><span>Getty Images</span></p></div><p></p><figcaption>Keith McIvor, also known as JD Twitch, started the Optimo Espacio club night at Sub Club in 1997</figcaption><p></p></figure><div><p>Keith McIvor, one half of Glasgow club duo Optimo, has died aged 57.</p><p>Known by the stage name JD Twitch, he was diagnosed with an untreatable brain tumour earlier this year.</p><p>In a statement posted on social media his fellow DJ Jonnie Wilkes, known as JG Wilkes, said his work partner had died peacefully at the Princess of Wales Hospice in Glasgow on Friday.</p><p>He wrote McIvor's \"intensity and passion for life, for music, for creativity and for positive change simply never let up\".</p></div><div><p>The duo ran Optimo Espacio, <a target=\"_blank\" href=\"https://www.bbc.co.uk/news/articles/c5y73nq041qo\">one of Glasgow's most beloved club nights</a>, at the Sub Club venue for 13 years between 1997 and 2010.</p><p>They continued to tour their popular brand of eclectic music after the club night concluded following 650 performances.</p></div><div><p>Posting on Instagram, Wilkes wrote: \"In a 28-year partnership, he changed my life immeasurably and together we took our work in directions and to places few people are lucky enough to explore.</p><p>\"I am forever grateful for everything he bestowed on me, both as a partner in music and as a friend. Keith's intensity and passion for life, for music, for creativity and for positive change simply never let up.</p><p>\"He was formidable. His belief in people and the idea that standing together, that our collective strength is powerful was unwavering. I loved him for that.\"</p></div><div><p>Wilkes also thanked fans and friends for their support, and staff at the hospice for their care.</p><p>He added: \"He will go now to travel those space-ways but I know his energy remains in every one of us who had the privilege of knowing him.</p><p>\"I love you forever Keith.\"</p><p>McIvor was originally from Edinburgh, where he established the club night Pure in the 1990s.</p><p>He moved to Glasgow, where he met Wilkes and started Optimo in 1997.</p><p>More than 500 people attended the final night at the city's Sub Club, with some travelling from as far afield as Belgium, Canada and the United States.</p><p>The final song played on Optimo's last night was Feeling Good by Nina Simone.</p><p>Writing on social media after his diagnosis, McIvor said: \"Jonnie and I have been lucky enough to play our music at countless clubs and festivals throughout the world and it has been one of the greatest honours of my life to make a career out of something I love.</p><p>\"We have connected with so many beautiful souls through our shared passion for music.\"</p></div></article>"
  },
  {
    "title": "'Sexy' idea sparked Colin Firth's Pride and Prejudice, says Andrew Davies",
    "url": "https://www.bbc.com/news/articles/cg7dn8p3r94o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e281/live/ac9c36a0-9797-11f0-84c8-99de564f0440.png",
    "tag": "Culture",
    "date": "2025-09-22T09:50:33.000Z",
    "description": "11 hours agoDanielle HerbertBBC Wales andEleri GriffithsBBC WalesGetty ImagesAndrew Davies, from Cardiff, wrote the screen adaption of Jane Austen's Pride and Prejudice for the BBC in 1995The writer of the...",
    "body": "<article><div><div><p>11 hours ago</p></div><p><span><p><span>Danielle Herbert</span><span>BBC Wales</span><span> and</span></p><p><span>Eleri Griffiths</span><span>BBC Wales</span></p></span></p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250905-110137-f27f908f49-web-2.29.1-3/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/3d12/live/cde8db80-9790-11f0-a4bc-e5c9e246a537.png.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/3d12/live/cde8db80-9790-11f0-a4bc-e5c9e246a537.png.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/3d12/live/cde8db80-9790-11f0-a4bc-e5c9e246a537.png.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/3d12/live/cde8db80-9790-11f0-a4bc-e5c9e246a537.png.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/3d12/live/cde8db80-9790-11f0-a4bc-e5c9e246a537.png.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/3d12/live/cde8db80-9790-11f0-a4bc-e5c9e246a537.png.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/3d12/live/cde8db80-9790-11f0-a4bc-e5c9e246a537.png.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/3d12/live/cde8db80-9790-11f0-a4bc-e5c9e246a537.png.webp\" alt=\"Getty Images Close up of Andrew Davies pictured at a screening of the highlights of \"Bleak House\" hosted by the Museum of Television & Radio and Produced by the BBC in WGBH Boston and Masterpiece Theatre on June 8, 2006 in West Hollywood, California. He has short white hair and is smiling looking at the camera. \" /><span>Getty Images</span></p></div><p></p><figcaption>Andrew Davies, from Cardiff, wrote the screen adaption of Jane Austen's Pride and Prejudice for the BBC in 1995</figcaption><p></p></figure><div><p>The writer of the BBC's Pride and Prejudice adaptation starring Colin Firth says the idea came from a former student who suggested he make it \"really sexy\".</p><p>Written 30 years ago by Cardiff-born Andrew Davies, the TV adaptation of Jane Austen's classic novel became a cultural phenomenon, attracting more than 11 million viewers in the UK and millions more in the US.</p><p>It won two BAFTAs and an Emmy, made Firth a star, and produced one of television's most-talked about scenes as Mr Darcy emerged from a lake in a wet shirt.</p><p>Davies said \"it took years of perseverance and persuasion to get it on our screens\" due to commissioners saying costume dramas \"had gone quite out of fashion\". </p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250905-110137-f27f908f49-web-2.29.1-3/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/694d/live/20dc3580-9791-11f0-bf5f-d374aafabd4f.png.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/694d/live/20dc3580-9791-11f0-bf5f-d374aafabd4f.png.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/694d/live/20dc3580-9791-11f0-bf5f-d374aafabd4f.png.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/694d/live/20dc3580-9791-11f0-bf5f-d374aafabd4f.png.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/694d/live/20dc3580-9791-11f0-bf5f-d374aafabd4f.png.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/694d/live/20dc3580-9791-11f0-bf5f-d374aafabd4f.png.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/694d/live/20dc3580-9791-11f0-bf5f-d374aafabd4f.png.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/694d/live/20dc3580-9791-11f0-bf5f-d374aafabd4f.png.webp\" alt=\"Getty Images Colin Firth and Jennifer Ehle pictured in costume together. Colin, on the left, wears a navy suit and a period white shirt. He has short curly brown hair. Jennifer, wears a beige, gold period dress and has brown curly hair which is tied up. She smiles whilst looking up at Colin Firth. \" /><span>Getty Images</span></p></div><p></p><figcaption>The 1995 period drama Pride and Prejudice starred Colin Firth as Mr Darcy and Jennifer Ehle as Elizabeth Bennet</figcaption><p></p></figure><div><p>Davies adapted Jane Austen's 1813 novel Pride and Prejudice into a six-episode BBC series which aired in 1995.</p><p>Set in Regency England, the story follows Elizabeth Bennet and her complex relationship with the proud Mr Darcy, exploring love, class, and social expectations among the lives of wealthy people in the English countryside in the early 19th Century.</p><p>Davies said his former student Sue Birtwistle, who is now a TV producer, said to him \"you and I should do a really sexy adaptation of Pride and Prejudice\". </p><p>\"I knew exactly what she meant, it would be an adaptation that acknowledged that the plot of the story is about sex and money when people had the idea that Jane Austen was all about politeness, witty remarks and everyone buttoned up to the neck,\" he told <a target=\"_blank\" href=\"https://www.bbc.co.uk/sounds/play/m002jpxz\">Radio Wales Breakfast.</a></p></div><div><p>Davies explained how the reviews and press coverage made it clear the show was \"causing much more of a stir than most things did\". </p><p>\"These were the days before 'binge watching' so episodes went out weekly so there was a sense of a big build up.</p><p>\"More and more people were talking about it as the weeks went on,\" he added.</p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250905-110137-f27f908f49-web-2.29.1-3/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/5b31/live/5b3887e0-9798-11f0-84a3-e314c0b97a4c.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/5b31/live/5b3887e0-9798-11f0-84a3-e314c0b97a4c.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/5b31/live/5b3887e0-9798-11f0-84a3-e314c0b97a4c.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/5b31/live/5b3887e0-9798-11f0-84a3-e314c0b97a4c.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/5b31/live/5b3887e0-9798-11f0-84a3-e314c0b97a4c.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/5b31/live/5b3887e0-9798-11f0-84a3-e314c0b97a4c.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/5b31/live/5b3887e0-9798-11f0-84a3-e314c0b97a4c.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/5b31/live/5b3887e0-9798-11f0-84a3-e314c0b97a4c.jpg.webp\" alt=\"Colin Firth as Mr Darcy in the 1995 BBC drama Pride and Prejudice. He is wearing a white shirt while standing near a pond. Trees can be seen in the backdrop.\" /></p></div><p></p><figcaption>Colin Firth's emergence from a lake in the role of Mr Darcy attracted much attention at the time</figcaption><p></p></figure><div><p>Speaking about the infamous lake scene, in which Firth as Mr Darcy emerges wet-shirted and dripping from the lake of his country estate after an impromptu swim, Davies said: \"I never meant for that to be a sexy scene.</p><p>\"My thinking was all about giving an insight into Mr Darcy as the novel is written entirely from Elizabeth's point of view.</p><p>\"I meant for him to dive in naked originally but somehow we lost that but we gained the wet shirt.</p><p>\"I thought the viewers would see the scene as sweet and comical,\" Davies added.</p></div><div><p>According to Davies, Firth never escaped the impact of the role, although initially being \"quite uncomfortable playing a leading man and a romantic hero\". </p><p>Despite this, Davies said he \"took on the role so well\" and called it an \"extraordinary performance\".</p><p>\"I'm absolutely thrilled that people are still watching it,\" he added. </p></div></article>"
  },
  {
    "title": "New Hilary Mantel prize to help emerging writers",
    "url": "https://www.bbc.com/news/articles/cly1k25xq30o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e35e/live/0e0d99a0-97c1-11f0-928c-71dbb8619e94.jpg",
    "tag": "Culture",
    "date": "2025-09-22T15:07:14.000Z",
    "description": "5 hours agoEmma RuminskiSouth West arts reporterBBCDame Hilary Mantel was former honorary president of the Devon's Budleigh Salterton Literary FestivalA new literary prize in memory of author Dame Hilary...",
    "body": "<article><div><div><p>5 hours ago</p></div><p><span><p><span>Emma Ruminski</span><span>South West arts reporter</span></p></span></p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250905-110137-f27f908f49-web-2.29.1-3/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/e35e/live/0e0d99a0-97c1-11f0-928c-71dbb8619e94.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/e35e/live/0e0d99a0-97c1-11f0-928c-71dbb8619e94.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/e35e/live/0e0d99a0-97c1-11f0-928c-71dbb8619e94.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/e35e/live/0e0d99a0-97c1-11f0-928c-71dbb8619e94.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/e35e/live/0e0d99a0-97c1-11f0-928c-71dbb8619e94.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/e35e/live/0e0d99a0-97c1-11f0-928c-71dbb8619e94.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/e35e/live/0e0d99a0-97c1-11f0-928c-71dbb8619e94.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/e35e/live/0e0d99a0-97c1-11f0-928c-71dbb8619e94.jpg.webp\" alt=\"BBC Dame Hilary Mantel is standing in front of a white background. She has a red top and red and grey scarf, and curly light-coloured shoulder-length hair. \" /><span>BBC</span></p></div><p></p><figcaption>Dame Hilary Mantel was former honorary president of the Devon's Budleigh Salterton Literary Festival</figcaption><p></p></figure><div><p>A new literary prize in memory of author Dame Hilary Mantel has been set up to champion new writers.</p><p>The Hilary Mantel Prize for Fiction is being launched on the third anniversary of her death after her private correspondence revealed she had mentored aspiring writers throughout her life.</p><p>Organisers of the new biennial prize said it was open to unpublished writers without an agent living in the UK or Ireland, and the winner would get a cash prize, mentoring from an agent and a place on an Arvon Foundation residential writing course.</p><p>Devon-based Dame Hilary herself won the prestigious Booker Prize twice and is probably best known for her book Wolf Hall that became a BBC TV series.</p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250905-110137-f27f908f49-web-2.29.1-3/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/231d/live/fb780890-97c3-11f0-858a-a904eacbef23.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/231d/live/fb780890-97c3-11f0-858a-a904eacbef23.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/231d/live/fb780890-97c3-11f0-858a-a904eacbef23.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/231d/live/fb780890-97c3-11f0-858a-a904eacbef23.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/231d/live/fb780890-97c3-11f0-858a-a904eacbef23.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/231d/live/fb780890-97c3-11f0-858a-a904eacbef23.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/231d/live/fb780890-97c3-11f0-858a-a904eacbef23.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/231d/live/fb780890-97c3-11f0-858a-a904eacbef23.jpg.webp\" alt=\"Dasha Tenditna Maggie O'Farrell sits with her hand clasped together under her chin. She has red curly hair and blue eyes.\" /><span>Dasha Tenditna</span></p></div><p></p><figcaption>Maggie O'Farrell has two cherished letters from Hilary and will be on the judging panel for the prize.</figcaption><p></p></figure><div><p>The judging panel will be chaired by bestselling author Maggie O'Farrell.</p><p>She said: \"Encouragement from a writer of Hilary Mantel's stature is nothing short of transformative. It's like winning a thousand lotteries for debut writers.\"</p><p>The two authors shared an agent and it was decided offering an award for unpublished writing was the best way to honour her memory.</p><p>O'Farrell said she had two letters from Dame Hilary when they were shortlisted for the same prize.</p><p>She said she kept the prized the correspondence folded inside her books, adding: \"Any letter from her was like everything she ever wrote - sparkling and incisive and just a joy to read.\"</p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250905-110137-f27f908f49-web-2.29.1-3/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/2a9c/live/976ba2d0-97af-11f0-a98f-a5aede2eafbc.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/2a9c/live/976ba2d0-97af-11f0-a98f-a5aede2eafbc.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/2a9c/live/976ba2d0-97af-11f0-a98f-a5aede2eafbc.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/2a9c/live/976ba2d0-97af-11f0-a98f-a5aede2eafbc.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/2a9c/live/976ba2d0-97af-11f0-a98f-a5aede2eafbc.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/2a9c/live/976ba2d0-97af-11f0-a98f-a5aede2eafbc.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/2a9c/live/976ba2d0-97af-11f0-a98f-a5aede2eafbc.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/2a9c/live/976ba2d0-97af-11f0-a98f-a5aede2eafbc.jpg.webp\" alt=\"Ali Smith Katie Ward sits in a large grey armchair looking out of frame. She is blonde and wears a black top.\" /><span>Ali Smith</span></p></div><p></p><figcaption>Author Katie Ward became friends with Hilary Mantel who mentored her for 15 years</figcaption><p></p></figure><div><p>Budleigh Salterton-based Dame Hilary was honorary president of the Budleigh Salterton Literature Festival for the last decade of her life before she died on 22 September 2020 aged 70, and was a big part of the community in the town.</p><p>Katie Ward was one author invited to speak at the festival by the author.</p><p>She has now published two books, but, when she started being mentored by Hilary Mantel in her 20s, she was struggling to get an agent for her first novel.</p><p>She said: \"I had had 44 rejections from agents... I was introduced by email and Hilary was just so supportive and encouraging.</p><p>\"She said, for example, that her first written novel wasn't her first published novel, and she had been through the same thing herself, and we stayed in touch for her last 15 years.\"</p></div><div><p>Current Budleigh Salterton Literature Festival director Kate Abbey said: \"Each year we champion the work of debut authors with the Hilary Mantel Emerging Writers' Panel.</p><p>\"Festivals and prizes like this new one play key roles in giving a platform and a voice to new talent.\"</p><p>Dame Hilary published 17 books over four decades.</p></div><div><p><span>Related stories</span></p></div><div><p><span>Links</span></p></div></article>"
  }
]