[
  {
    "title": "Léonore Chastagner Sculpts Tender Connections Between Figurative Gestures and Objects",
    "url": "https://www.thisiscolossal.com/2025/11/leonore-chastagner-figurative-clay-sculptures/",
    "image": "https://www.thisiscolossal.com/wp-content/uploads/2025/11/Chastagner-8-e1764348102573.jpg",
    "tag": "Culture",
    "date": "2025-11-29T11:09:00.000Z",
    "description": "\n\n\t\nFrom a variety of natural colors of clay, Léonore Chastagner sculpts tender representations of the human form. She details the wrinkles on one’s k",
    "body": "\n\n\t\nFrom a variety of natural colors of clay, Léonore Chastagner sculpts tender representations of the human form. She details the wrinkles on one’s knuckles, the creases in a pair of denim jeans, and the intricate layers of a loosely folded T-shirt. \n“I use clay as one uses a diary: to record the feelings of daily life and the things that surround me,” Chastagner tells Colossal. “I take interest in what’s in front of me when I’m alone: my apartment, clothes, small gestures of the body.”\nUntitled (2022), ceramic, 51 x 65 x 45 centimeters. Photo by jclett\nChastagner’s background in art history also influences her work, especially through the lens of archaeology and the often mysterious origins or uses of small figurines or personal objects. She’s particularly interested in the kinds of talismans and goods that were buried with the deceased in order to accompany the soul to the afterlife—a ritual seen in myriad ancient cultures around the globe.\nClay is itself a timeless and inherently malleable medium, which Chastagner appreciates for the range of techniques and consistencies she can work with. Because the material is soft and immediately responsive to touch, it represents a kind of freedom and openness. “I was also drawn to (clay’s) simplicity,” the artist says. “It’s a natural material that’s been used by human beings since the earliest civilisations. It has a universal quality.”\nRecently, Chastagner has been working on a series of domestic environments, such as small bedrooms and living rooms. These move beyond objects or figurative gestures to consider the spaces that encompass the body and evoke a sense of nostalgia for miniatures, like dollhouses.\nThe artist’s work will be on view in a solo presentation during Ceramic Brussels, which runs January 21 to 25, and celebrates her win of the fair’s juried Art Prize last year. Chastagner is also working toward solo exhibitions opening in April at Centrale in Brussels and in May at Galerie Anne-Sarah Bénichou in Paris. Explore more on her website and Instagram.\nUntitled (2025), ceramic, 9 x 6 x 11 centimeters\nUntitled (2022), ceramic, 40 x 50 x 15 centimeters\nUntitled (2023), ceramic, 21 x 10 x 5 centimeters. Photo by Jérémy Josselin\nUntitled (2023), ceramic, 10 x 14 centimeters\nUntitled (2023), ceramic, 14 x 5 x 7.5 centimeters. Photo by jclett\nUntitled (2021), ceramic,  10 x 8 centimeters\nInstallation view at Salon de Montrouge (2025). Photo by Louise Sauvard\nUntitled (2023), ceramic, 18 x 16 x 5 centimeters\n\t\n\t\n\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Léonore Chastagner Sculpts Tender Connections Between Figurative Gestures and Objects",
      "image": [
        "https://www.thisiscolossal.com/wp-content/uploads/2025/11/Chastagner-8-e1764348102573.jpg"
      ],
      "datePublished": "2025-11-29T11:09:00.000Z",
      "dateModified": "2025-11-29T11:09:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Pope Francis’s Camera Sells for $7.5M",
    "url": "https://hyperallergic.com/pope-franciss-camera-sells-for-7-5m/",
    "image": "https://hyperallergic.com/content/images/size/w1200/2025/11/L1016121.jpg",
    "tag": "Culture",
    "date": "2025-11-30T20:50:20.000Z",
    "description": "\n    \n                News\n                The Leica M-A owned by the late pontiff is one of the most valuable models ever sold at auction.\n          ",
    "body": "\n    \n                News\n                The Leica M-A owned by the late pontiff is one of the most valuable models ever sold at auction.\n            \n                \n                                \n                            \n                \n            \n                \n        \n            Pope Francis's Leica M-A film camera sold for more than $7M. (photo by Christoph Welkovits, all courtesy Leitz Photographica Auction)\n    \n        \n            Say formaggio!A blindingly white-and-silver Leica camera owned by the late Pope Francis sold at a European auction this weekend for about $7.5 million, nearly 100 times its estimate.It was one of the most expensive Leica models ever sold, according to Leitz Photographica Auction, which announced it would auction the Pope’s mechanical camera for charity in September. The record is still held by a 100-year-old prototype that sold for $16.7 million in 2022.The camera company presented a personalized Leica M-A film camera and its Noctilus-M 50 mm lens to his holiness last year. In a statement, the auction house said Pope Francis had decided to auction the Leica and donate the proceeds “in keeping with his commitment to charity and social causes.”The camera was gifted to the pontiff before he passed away last year.The camera kit features several unique elements that distinguish it from its base model, which retails for about $6,300 for the body and another $8,500 for the lens, before taxes. It carries a distinctive serial number of 5000000, which is valuable to collectors, and its white-painted top plate includes an engraving with Pope Francis’s motto miserando atque eligendo (which translates to “by having mercy and choosing,” drawn from a homily on the call of Saint Matthew by Saint Bede the Venerable). The flash cover is engraved with the keys of Peter. Both the body and lens caps are engraved with the Coat of Arms of the State of Vatican City, and the camera and lens include an etching that reads \"AD MMXXIV,\" the year Leica presented the Pope with the gift in Roman numerals. The white-painted top plate is engraved with Pope Francis's motto.It’s unclear whether Pope Francis got to use his camera much, but he didn’t own it very long. He passed away this spring at the age of 88, several months after receiving the gift.  Though the pontiff did not specifically express his views on photography, he was a vocal supporter of art and artists. “Architects and painters, sculptors and musicians, filmmakers and writers, photographers and poets, artists of every discipline, are called to make beauty shine,” he said during a 2016 address to the Pontifical Academies, “especially where darkness and greyness dominate everyday life.” \n                  \n                      \n                        News\n                      \n                      \n                        Auctions\n                      \n                      \n                        Pope Francis\n                      \n                  \n        \n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Pope Francis’s Camera Sells for $7.5M",
      "image": [
        "https://hyperallergic.com/content/images/size/w1200/2025/11/L1016121.jpg"
      ],
      "datePublished": "2025-11-30T20:50:20.000Z",
      "dateModified": "2025-11-30T20:50:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Louise Bourgeois’s Life Was as Monumental as Her Art",
    "url": "https://hyperallergic.com/louise-bourgeoiss-life-was-as-monumental-as-her-art/",
    "image": "https://hyperallergic.com/content/images/size/w1200/2025/11/1937-LB-at-the-Academie-de-la-Grande-Chaumiere-Paris-HR-1.jpg",
    "tag": "Culture",
    "date": "2025-11-30T20:55:41.000Z",
    "description": "\n    \n                Book Review\n                Writing the first comprehensive biography of a major artist could prove daunting, but taking on Bour",
    "body": "\n    \n                Book Review\n                Writing the first comprehensive biography of a major artist could prove daunting, but taking on Bourgeois's long life in art might be called heroic.\n            \n                \n                                \n                            \n                \n            \n                \n        \n            Louise Bourgeois at the Académie de la Grande Chaumière, Paris, 1937, photographed by Brassaï (image © Brassaï/courtesy The Easton Foundation)\n    \n        \n            Writing the first comprehensive biography of a major artist could prove daunting, but in the case of Marie-Laure Bernadac’s Knife-Woman: The Life of Louise Bourgeois, such an undertaking might be called heroic. Bourgeois lived to the age of 98, still active and furiously making art until the end. And according to Bernadac’s thorough and vivid account, the French-American artist kept nearly everything she made, read, wore, or wrote in the course of a long life. This includes Bourgeois’s massive oeuvre of sculpture, installations, prints, paintings, and drawings, along with letters dating back to her childhood, school notebooks, business transactions (hers and her parents’), and writing from at least as far back as age 11, when she first began keeping a diary. Even the hardiest biographer might buckle under the weight of so much material. Yet Bernadac, a French curator who knew Bourgeois and organized exhibitions of her work during the artist’s lifetime, is ideal to take on the task. She makes no effort to conceal her sympathetic perspective on her subject, while recognizing Bourgeois as an artist who was emotionally volatile, depressive, competitive, driven, and visionary. While there is a certain headlong bravery in writing the biography of so biographical an artist, one raised in and around Paris but who spent most of her adult life in New York, Bernadac humbly suggests that her book is just the beginning. She likens it to “a gigantic tapestry,” and writes, “I’m leaving the tapestry unfinished, so that other, more profound studies may take shape.” Crisply translated by writer Lauren Elkin (whose excellent 2023 book Art Monsters: Unruly Bodies in Feminist Art includes Bourgeois among its subjects), Knife-Woman is, if not necessarily profound, then impressively woven. And though it’s organized as a straightforward chronological account of Bourgeois’s life, Bernadac does veer from standard biographical practice by referring to her subject as Louise, a choice I appreciate for a variety of feminist and other reasons. Her use of first names extends to all the primary figures in the artist’s life, from her mother, Joséphine, and father, Louie (after whom Louise was named — he’d wanted a boy), to her husband, the esteemed American art historian Robert Goldwater.Louise Bourgeois in her studio, New York, c. 1946 (image © courtesy The Easton Foundation/Licensed by VAGA at Artists Rights Society (ARS), New York)The author deploys her metaphor deliberately, as Bourgeois was surrounded by tapestries growing up in her parents’ repair business, where her mother was responsible for the majority of the hands-on work. “The tapestry restoration workshop is the backdrop of all Bourgeois’s memories,” Bernadac writes, “the maternal material that structured and enfolded her artistic apprenticeship.” Bourgeois was employed at a young age by her mother to create replacement drawings for feet worn away when tapestries were dragged along the ground. Such a detail — repeatedly drawing feet (or other body parts) — is no doubt essential to the artist's later work. As is a passage about Bourgeois’s mother, who cut out “cupids’ genitals and other explicit parts and replaced them with flowers or fruits, because the puritanical American collectors couldn’t bear to see sexual organs on tapestries. Joséphine kept these woven bits of genitals clumped together in a box.” It’s not hard to image just such a box as a Louise Bourgeois artwork.Bernadac’s text is augmented with reproductions of her work and photographs from every era of Bourgeois’s life, from family snapshots of a proper young woman turned out in Chanel, Paul Poiret, and Sonia Delaunay, to Robert Mapplethorpe’s iconic 1982 image of a grinning Bourgeois with her penis sculpture, “Fillette,” tucked insouciantly under one arm. Louise Bourgeois with \"Sleep II,\" Pietrasanta, Italy, 1967 (image © The Easton Foundation/Licensed by VAGA at Artists Rights Society (ARS), New York/Photo: Studio Fotografico, I. Bessi, Carrara)While offering much incisive biographical information and important insights on Bourgeois’s work, Bernadac’s observations of the artist’s inner life can feel less perceptive. For example, “Louise, like a good hysteric, worried she was sterile – which is one of the things that led her to adopt a French orphan in 1939” (the oldest of her three sons, Michel, was adopted), or, “She had all the physical symptoms of hysteria: cramps, heaviness in the stomach, contractions in the diaphragm, diarrhea, insomnia.” While there’s no question that Bourgeois struggled with her mental state, spending years in therapy (and writing about it), Bernadac’s outdated and arguably sexist terminology, applied with such breezy certainty, is unconvincing.On the whole, though, Bernadac’s book is an impressive undertaking that more than confirms Bourgeois’s wish for her career. “My credo,” the artist said in a 1968 interview, “is that I hope I will live long enough to say most of the things I want to say. That’s it.” She did.Louise Bourgeois with \"La famille\" (in progress), New York, 2008 (image © The Easton Foundation/Licensed by VAGA at Artists Rights Society (ARS), New York/Photo © Alex Van Gelder)Knife-Woman: The Life of Louise Bourgeois by Marie-Laure Bernadac with a translation by Lauren Elkin (2025) is published by Yale University Press and is available online and in bookstores.\n                  \n                      \n                        Book Review\n                      \n                      \n                        Reviews\n                      \n                      \n                        Louise Bourgeois\n                      \n                  \n        \n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Louise Bourgeois’s Life Was as Monumental as Her Art",
      "image": [
        "https://hyperallergic.com/content/images/size/w1200/2025/11/1937-LB-at-the-Academie-de-la-Grande-Chaumiere-Paris-HR-1.jpg"
      ],
      "datePublished": "2025-11-30T20:55:41.000Z",
      "dateModified": "2025-11-30T20:55:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Basking in the Light of Raúl de Nieves’s Stained Glass Tarot",
    "url": "https://hyperallergic.com/basking-in-the-light-of-raul-de-nieves-stained-glass-tarot/",
    "image": "https://hyperallergic.com/content/images/size/w1200/2025/11/Nieves2.jpg",
    "tag": "Culture",
    "date": "2025-11-30T21:00:31.000Z",
    "description": "\n    \n                Art Review\n                With its spiritual and religious connotations, de Nieves's installation transforms Pioneer Works from",
    "body": "\n    \n                Art Review\n                With its spiritual and religious connotations, de Nieves's installation transforms Pioneer Works from a creative space to a contemplative one.\n            \n                \n                                \n                            \n                \n                \n                    AX Mina\n                    November 30, 2025\n                            — 3 min read\n                    \n                \n            \n                \n        \n            Installation view of Raúl de Nieves: In Light of Innocence at Pioneer Works (all photos AX Mina/Hyperallergic)\n    \n        \n            We’ve had stained glass in the Western world since the times of ancient Rome. Yet the art form reached its zenith in the later Middle Ages, with the rise of the great cathedrals. Before the broad availability of paper, designs began with the vidimus — Latin for “we have seen” — crafted with wood and chalk. By the early 16th century, according to the Victoria & Albert Museum, paper allowed for a separation — one person could illustrate the design, and these designs “could be saved, reused and handed down from glazier to glazier. This made stained glass an exceptionally collaborative art.”In Light of Innocence, a stained glass solo exhibition by Raúl de Nieves, currently on view at Pioneer Works, is also in many ways a collaboration — across tarot, Mexican folklore, and Catholicism, as de Nieves draws from these visual traditions to create a grand cathedral in the central gallery. By installing art with strongly spiritual and religious connotations, he’s transformed the space from a creative one to a contemplative one.Installation view of Raúl de Nieves: In Light of InnocenceWhen I arrived, I immediately gazed upward at the far back wall, where a calavera, or skull, occupies the top circular window. Figures signifying faith, hope, and love adorn the rectangular windows below. Just beneath them is a large installation of windows powered by a lightbox that includes depictions of flies, skeletons, steps under an archway, and the Mesoamerican deity Tlaltecuhtli. As the exhibition text notes, “Unlike traditional religious hierarchies, tarot allows for multiple perspectives and characters to hold equal power.” And unlike a traditional cathedral, the second and third floors of Pioneer Works allow visitors to view the stained glass rows directly and from above, rather than just from below. The lightbox can be seen at eye level by climbing to the top floor and looking down on the installation.This enables, for example, a closer look at a set of three panels featuring a figure that looks like a blend of the Queen of Cups and Queen of Swords, another figure that resembles the meditative King of Pentacles, and a panel that reads “And we are here to contemplate the wonders of life.”Installation view of central stained glass sequence in Raúl de Nieves: In Light of Innocence.It’s a rare experience to be able to look downward at stained glass. From below, these panels evoke judgment and command, as if the gods of tarot themselves were reminding me of my purpose in life. From above, they are all too human, as confused and bewildered about the fact of existence as I am.Flies, a surprising motif in stained glass, appear on the three adjacent panels. Back down on the ground, I got a better sense of their significance. One panel titled “The flies will lay their eggs” — an apparent reference to lyrics from Marilyn Manson’s “Tourniquet” — sits alongside another one with a figure of the Hanged Man tarot card. In New York City, flies might be associated with garbage and decay, rather than spiritual insight, but they have tremendous ecological importance as bridges between death and life. This feels, in many ways, like the very message of de Nieves’s installation. Death, life, faith, hope, love, calaveras, flies, and the royalty of tarot — their meanings all lay in how we shift our perspective.Installation view of Raúl de Nieves: In Light of Innocence featuring the stained glass sequence with the Queen of Cups, Queen of Swords, King of Pentacles, and “And we are here to contemplate the wonders of life.”Installation view of Raúl de Nieves: In Light of Innocence featuring panels with a focus on flies.Installation view of Raúl de Nieves: In Light of Innocence featuring a window with a calavera image.Raúl de Nieves: In Light of Innocence continues at Pioneer Works (159 Pioneer Street, Red Hook, Brooklyn) through December 14. The show was curated by Gabriel Florenz.\n                  \n                      \n                        Art Review\n                      \n                      \n                        Reviews\n                      \n                      \n                        Pioneer Works\n                      \n                      \n                        New York\n                      \n                      \n                        Raul de Nieves\n                      \n                  \n        \n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Basking in the Light of Raúl de Nieves’s Stained Glass Tarot",
      "image": [
        "https://hyperallergic.com/content/images/size/w1200/2025/11/Nieves2.jpg"
      ],
      "datePublished": "2025-11-30T21:00:31.000Z",
      "dateModified": "2025-11-30T21:00:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What We're Grateful For",
    "url": "https://hyperallergic.com/what-were-grateful-for/",
    "image": "https://hyperallergic.com/content/images/size/w1200/2025/11/GettyImages-2185349965-1-1.jpg",
    "tag": "Culture",
    "date": "2025-11-29T11:00:33.000Z",
    "description": "\n    \n                Weekly\n            \n                \n                                \n                            \n                \n            ",
    "body": "\n    \n                Weekly\n            \n                \n                                \n                            \n                \n            \n        \n            Last week, some $2.2 billion worth of art was sold in a string of evening auctions that grabbed headlines. The art market media declared a once-again \"healthy\" market reemerging from a protracted slump. \"The entire week becomes a choreographed attempt to convince the world that everything is fine, that the market is strong, that the system still works,\" writes artist Damien Davis in our top piece this week. \"But everything is not fine. And most of the people making the work that keeps this machine running know it.\" While Davis writes from the perspective of the 99% of artists who don't partake in this blue-chip carnival, Marc Straus writes as a veteran art dealer who's been around the auction block many times. In an eye-opening essay, he explains why the market is in a much worse shape than many realize, citing the closure of at least 60 art galleries in recent years.Meanwhile, the world keeps turning, and another Thanksgiving came upon us in the United States. This year, amid high levels of political and social unease, we decided to put together a feel-good list of all the things we're grateful for in the art world. It ranges from thoughtful rehangs and no-strings-attached grants to gallery dogs and desserts at a specific museum cafe. Enjoy it. Auctioneer Georgina Hilton sells the top lot of the evening, Jean-Michel Basquiat's \"Untitled\" for $22,950 during Christie's 21st Century Evening Sale on November 21, 2024 in New York City (photo by Selcuk Acar/Anadolu via Getty Images)Everything Is Not Fine in the Art WorldAuction headlines offer a picture of health that hides a body in crisis.| Damien DavisArt Market Reporters Are Getting It All WrongThe worst of the current market decline is not the closure of major galleries. It is the dozens of younger galleries that have gone under in the past three and a half years. | Marc J. Straus25 Things We're Grateful for in the Art WorldHere’s to celebrating what brings us joy, great and small.\nNewsAfter a long wait, the US finally names the artist who'll represent the country in the 2026 Venice Biennale. The reactions, I must say, have been tepid. Also, New York's Mayor-Elect Zohran Mamdani announces his arts and culture transition team, and the drama at the Philadelphia Art Museum refuses to die down. Read more here:Alma Allen has been selected to represent the US at the 2026 Venice Biennale.Meet the 28 members of Zohran Mamdani’s arts & culture transition committee.Former Met Museum president Daniel Weiss is set to lead the Philadelphia Art Museum. (The institution also recently accused its former director of misapropriating funds.)From our criticsThis week, John Yau writes about the painters who made Abstract Art long before it became cool, Max Blue roasts a KAWS show at SFMOMA ($45 for a ticket!), and more. Frank Stella, “Zeltweg 3x: (1982), painted aluminum (photo courtesy the William Rubin Collection)Paying Homage to the Iconoclasts of AbstractionAn exhibition traces the radical advancements in painting by Al Held, Elizabeth Murray, Judy Pfaff, and Frank Stella. | John YauKAWS Makes Art for the Tech Bro EraHis exhibition at SFMOMA could have examined the collapse of culture at the hands of commodity, but instead it nudges us toward the gift shop. | Max BlueR. Crumb Wonders What It All MeansWith his new comic book and exhibition, the artist explores his neurosis and mortality, but continues to question authority. | Tulsa KinneyWe Are History’s GhostsAn exhibition on the Lower East Side turns to collective memory and reenactment to cut through today’s political numbness. | Lisa Yin Zhang Late artist Llyn Foulkes in 2018 (photo by and courtesy Fredrik Nilsen)Our regular community columns are our pride and joy, and we've been putting more work into them. Catch up with the latest industry news (hirings, firings, awards, and more) in Art Movements, get a glimpse into artists' workspaces in A View from the Easel, read thoughtful obituaries of members of our community, and check out Associate Editor Lakshmi Amin's recommendations for this week's best reads around the internet in Required Reading.     Thanks for reading, and have a great weekend! —Hakim Bishara, editor-in-chief\n                  \n                      \n                        Weekly\n                      \n                      \n                        Newsletter\n                      \n                  \n        \n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What We're Grateful For",
      "image": [
        "https://hyperallergic.com/content/images/size/w1200/2025/11/GettyImages-2185349965-1-1.jpg"
      ],
      "datePublished": "2025-11-29T11:00:33.000Z",
      "dateModified": "2025-11-29T11:00:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "As the US Slides Into Tyranny, Europe Champions Black American Artists",
    "url": "https://hyperallergic.com/as-united-states-slide-into-tyranny-europe-champions-black-american-artists/",
    "image": "https://hyperallergic.com/content/images/size/w1200/2025/11/abney-netherlands-1.jpg",
    "tag": "Culture",
    "date": "2025-11-30T21:05:11.000Z",
    "description": "\n\t\t\n\t\t\t\t\t\t\t\tOpinion\n\t\t\t\t\t\t\t\tIt’s a striking contradiction: Four Black American artists get major shows in Europe while the American institutional capa",
    "body": "\n\t\t\n\t\t\t\t\t\t\t\tOpinion\n\t\t\t\t\t\t\t\tIt’s a striking contradiction: Four Black American artists get major shows in Europe while the American institutional capacity and constitutional protections collapse in tandem.\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\n\t  \t\t    \n        \n            Nina Chanel Abney's opening reception at Elbow Church in Amersfoort, Netherlands, in September (photo Leilani Lewis/Hyperallergic)\n    \n\t\t\n\t\t\t\t\n\t\t\t\t\t\tSomething shifted the moment I stood inside the Elbow Church art space in Amersfoort in the Netherlands this past September. As journalist Nikole Hannah-Jones delivered a sharp lecture beneath Nina Chanel Abney's monumental installations, it became clear that this Medieval city was presenting narratives of Black American life that the United States is increasingly unwilling to hold. Jacob Lawrence: African American Modernist and Nina Chanel Abney: Heaven's Hotline opened in Amersfoort on the same evening. Together, Lawrence's historical narratives and Abney's bold indictments mapped the breadth of Black American artistic vision in a way that felt both clarifying and impossible to ignore.In fact, this year, four major European museums simultaneously staged ambitious exhibitions of Black American artists: Kerry James Marshall at London's Royal Academy, Lawrence at Kunsthal KAdé in Amersfoort, Abney in Paris and Amersfoort, and Mickalene Thomas at Les Abattoirs in Toulouse and forthcoming at the Grand Palais in Paris, all shows I visited with the exception of the first. This moment feels less like a coincidence and more like a long-overdue reckoning.Visitor looking at Augusta Savage's bronze cast of \"Gwendolyn Knight\" (1935) in Jacob Lawrence: African American Modernist at Kunsthal KAdé (photo © Mike Bink; image courtesy Kunsthal KAdé)These are not demure gallery shows. They are massive institutional commitments — entire floors and, in some cases, entire museums devoted to a single artist with hundreds of works spanning decades. These shows refuse simplification as they document Black American life, histories, love, resistance, queerness, labor, death, and joy without apology or translation.At Kunsthal KAdé, Dutch audiences are encountering Jacob Lawrence in his first European overview. The museum also commissioned four new portraits of Lawrence by contemporary artist Barbara Earl Thomas, his friend and former student at the University of Washington in Seattle.It's a striking contradiction: These groundbreaking shows and unprecedented opportunities for iconic Black American artists in Europe come at the exact moment that American institutional capacity, social infrastructure, and constitutional protections are collapsing in tandem.Jacob Lawrence, Genesis series (1989), silkscreen prints, at the Kunsthal KAdé in Amersfoort, Netherlands (photo © Mike Bink; image courtesy Kunsthal KAdé)In July, Amy Sherald withdrew her exhibition American Sublime from the Smithsonian Institution’s National Portrait Gallery after it reportedly deemed her painting of a Black transgender woman as the Statue of Liberty too controversial. And according to the American Alliance of Museums, one-third of museums in the United States have lost federal funding since Trump took office, with around one in four slashing programs for underserved communities.It's within this climate of censorship, disinvestment, and erasure at home that Kerry James Marshall's exhibition at the Royal Academy in London takes on even sharper resonance. Here, Marshall mounted the largest survey of his work ever presented in Europe, filling over a thousand square meters with more than 70 artworks and insisting that Black presence belongs at the center of Western art history. His monumental paintings, such as “School of Beauty, School of Culture” (2012), assert visibility and permanence even as people vanish from American communities, some violently removed by ICE raids, others quietly deported without notice or warning, all without constitutional protection.Kerry James Marshall, \"School of Beauty, School of Culture\" (2012), acrylic on canvas (image courtesy the artist and Jack Shainman Gallery, New York)Mickalene Thomas's exhibitions in Europe are equally canon-shifting. All About Love at Les Abbatoirs in Toulouse was her first major show in France, and she will break yet another barrier in December by opening the first-ever major exhibition by an African-American artist at the Grand Palais in Paris. Her striking rhinestone portraits of Black women — like “Le Dejeuner sur l’herbe: Les trois femmes noires” (2010) and “Afro Goddess Looking Forward” (2015) — radiate glamor, intellect, and authority on a scale historically rare in major French institutions. European audiences embraced Thomas's All About Love, while over 300,000 Black women in the United States were pushed out of the workforce this year and their unemployment rate climbed to 6.7% in August as federal and corporate layoffs systematically targeted positions many had long held, including in dismantled Diversity, Equity, and Inclusion programs.Abney's Heaven's Hotline in the Elbow Church confronts religious capitalism and American Christian ideals with her monumental sculptures, even as White Christian nationalism in the United States becomes more extreme and entrenched.Across Europe, these exhibitions offer Black American stories that subvert reductive narratives. These artists speak for themselves, asserting specificity, imagination, and a refusal to be flattened or erased. Yet, these contradictions expose something larger than a funding crisis or political cycle. They reveal a nation fractured into competing narratives and a fight over whose stories prevail.Barbara Earl Thomas with her linocut \"Jacob as a Young Artist\" (2025) in Jacob Lawrence: African American Modernistat London's Royal Academy (photo © Mike Bink; image courtesy Kunsthal KAdé)Black Americans seeking and receiving better recognition in Europe is not new. James Baldwin, Barbara Chase-Riboud, Richard Wright, and many others sought reprieve there while white supremacy raged on at home. But this moment transcends individual refuge. Major European institutions are making visible, well-funded commitments to Black American narratives as the United States is seeking to neutralize, and tame what is evidenced in their power and skill.Walking through the exhibitions this fall, I felt the rupture between the full, complex realities of Black American experiences that these artists confront — erasure, exclusion, brutality, but also joy, resistance, and refusal — and the containment efforts happening at home. And I found myself wondering what European audiences make of seeing both sides of this growing chasm at once.A precedent is being set right now about which American stories are carried forward. Who steps up to witness matters. Who remembers matters. And who looks away will be remembered, too.\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tOpinion\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tNina Chanel Abney\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tJacob Lawrence\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tKerry James Marshall\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tMickalene Thomas\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\n\t\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "As the US Slides Into Tyranny, Europe Champions Black American Artists",
      "image": [
        "https://hyperallergic.com/content/images/size/w1200/2025/11/abney-netherlands-1.jpg"
      ],
      "datePublished": "2025-11-30T21:05:11.000Z",
      "dateModified": "2025-11-30T21:05:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jennifer Packer Confronts Grief Through Paintings That Cut Deep",
    "url": "https://hyperallergic.com/jennifer-packer-confronts-grief-through-paintings-that-cut-deep/",
    "image": "https://hyperallergic.com/content/images/size/w1200/2025/11/Packer1-1.jpg",
    "tag": "Culture",
    "date": "2025-11-30T21:10:38.000Z",
    "description": "\n    \n                Art Review\n                The painter mines an iconographical language of grief through delicate, translucent paintings imbued ",
    "body": "\n    \n                Art Review\n                The painter mines an iconographical language of grief through delicate, translucent paintings imbued with a sense of intimacy and intensity.\n            \n                \n                                \n                            \n                \n            \n                \n        \n            Jennifer Packer, \"Nate, Chey\" (2025), oil on canvas (all photos Aruna D'Souza/Hyperallergic)\n    \n        \n            Even before her partner, the much-adored poet April Freely, passed away in 2021, Jennifer Packer was a painter of remembrance. Her solo exhibition at the Whitney Museum, which opened months after Freely’s death, included “Blessed Are Those Who Mourn (Breonna! Breonna!),” a tribute to Breonna Taylor, the young medical worker whose murder by police, along with that of George Floyd, sparked worldwide Black Lives Matter protests in the summer of 2020. It was Packer’s ability to evoke the emotional intensity of loss without depicting Taylor directly that struck me then — in the painting, she homes in instead on a young man lying on a couch in an acid yellow interior, surrounded by seemingly insignificant objects picked out of the miasma. “The logic is that of a mind seizing on inconsequential things in the process of coming to terms with an overwhelming grief,” I wrote at the time. Likewise, her tender portraits of friends veered between inchoate mark making and stunning specificity; even if their faces were blurred and scumbled, even if they melted into their monochrome surrounds, they were represented with an exactitude that allowed them to be fully and lovingly rendered. In Dead Letter, her latest show at Sikkema Molloy Jenkins, Packer hones her painting to a delicate, razor-sharp edge, one that cuts deep into the questions of how people impress themselves onto the world and what traces they leave after they are gone. “What might generous observation, precision of language, representational urgency, and space for error produce? What is it to witness and be recognized in ways that transform quality and clarity of life?” she writes in her artist’s statement. This project is much different than one of processing the emotional fallout of a loved one’s death, or memorializing someone’s life. Rather, it feels like an investigation into how painting itself can be adequate to the complex process of seeing, feeling, and remembering.Installation view of Jennifer Packer: Dead Letter at Sikkema Malloy Jenkins. Left: \"Pacemaker\"; right: \"Warp, Weft\" (both 2025), oil on canvasIn the 21 works on view (all 2025), Packer approaches these questions with virtuous skill and a deep knowledge of the history of her medium. Take “A.D.I.P.T.A. after Jay Electronica”: at 8 by 12 feet, it is monumental, but Packer manages to imbue the scene with a sense of intimacy. Red is the overwhelming color, from the walls to the furniture to the two figures, one standing on the left, the other seated on the right, who seem to be caught in the “impossible communication” that Freely referred to in her 2014 poem “But Is It an Essay, Voyager Edition”: “This is an impossible communication, but that’s the only kind we want.” The standing figure holds her hand to her ear, as if speaking on a telephone, even though the wall-mounted phone next to her remains unused. The seated figure has a telephone receiver stuck to the side of her head, no hand holding it in place. And then there’s the title of the work, referring as it does to a tender song by the American rapper Jay Electronica, and suggesting that the frustrated desire to connect with others structures our relationships both in life and in death: “I got numbers in my phone that’ll never ring again/ ’Cause Allah done called them home, so until we sing again.”The mood here is distinctly Matissean. The most obvious reference is “The Red Studio.” But there is more besides. At the center of the Packer’s composition are two voids: the impossible communication between the two figures and a dark blue form with a distinctively curved top that reads at once as a window and the surface of a grand piano. Both of these, for me, call to mind Matisse’s \"Piano Lesson\" (1916), which, despite its musical subject matter, has a strangely silent aspect. (Pianos show up in a number of pictures on view here, including \"Warp, Weft\" and \"Anechoic Chamber.\") The longer you look at a pale blue dining chair, the more apt it is to transform under your gaze into one of Matisse’s abstracted nudes, the slope of shoulders, buttocks, head, and pubis articulated with Packer’s delicate brush. The French Fauvist is not the only allusion, direct or less so, to art history here by any means, however. A picture within a picture of ballerinas seems to evoke Lynette Yiadom-Boakye, or maybe Noah Davis (another artist who, like Feely, died too young), while elsewhere we find a radically simplified, barely recognizable version of an Italian Renaissance image of the lamentation of Christ. Just as some Catholic saints are depicted holding churches in their hands to symbolize their role in supporting Christian communities, so does Packer’s seated figure balance a miniature suburban house on her fingertips. Pleasure, desire, home, care, loss, the frisson of knowing someone as much as — but no more than — they want to be known. Devastating.Jennifer Packer, “A.D.I.P.T.A. after Jay Electronica” (2025), oil on canvasThe whole exhibition has the quality of a memento mori — a reminder of the fleeting nature of existence — not least because of the many flower paintings on view. Packer has characterized the motif as funerary bouquets, a means of both grounding herself in the studio and moving through specific losses in her life. Bodies at rest are infused with a sense of anxiety about their inevitable, eventual passing, especially in pictures like “Innocent of Vanity,” “The Pleasure of Being Ordinary,” “Melt,” and “Activity, The Pause,” which are not far removed from deathbed portraits. In paintings of people playing piano like “Warp, Weft” and “Anechoic Chamber,” standing figures place their hands on the musicians’ shoulders, a gesture of support that simultaneously recalls death’s gentle grip. Playing cards — long a symbol in art of the fragility of life, as when they are depicted arranged into a house of cards, or of chance and uncertainty, when they are shown as part of a game — flutter like translucent leaves between the hands of the young man who shuffles them in “Pacemaker.” Even as Packer mines an iconographical language of grief, what of its painterly vocabulary? In the artist’s hands, it is the delicate, febrile lines that scarcely define tender parts of a loved one’s body, like the feet that she renders with such stuttering care, as if she needs time to recall them. It is the translucency of her washes of color that allows bodies to melt into each other, so the membrane between where one ends and the other begins is impossibly thin. It is her use of a single color that knits together interior spaces, cohering the different scales, degrees of description, and paint handling (for instance, broad, abstract strokes versus visible contours), and even materials, such as the collaged elements embedded in the largest work on view, “The Edges of Longing Is an Impossible Communication (Dead Letter).” But this cohesion is so tenuous, as with a dream's imposition of waking logic onto something that doesn’t make any sense. When I went to see Dead Letter, it was the second show on a long list I intended to visit that day. I abandoned my plans and went straight home after. It felt too monumental, aesthetically and emotionally, to muddy by looking at anything else, especially at a time when loss — of people, of values, of faith, of hope — seems like all that I ever think about. Jennifer Packer, “Activity, The Pause” (2025), oil on canvasJennifer Packer, \"Untitled\" (2025), oil on canvasJennifer Packer, “The Edges of Longing Is an Impossible Communication (Dead Letter)” (2025), oil on canvas with collaged elementsJennifer Packer: Dead Letter continues at Sikkema Malloy Jenkins (530 West 22nd Street, Chelsea, New York) through December 13. The exhibition was organized by the gallery.\n                  \n                      \n                        Art Review\n                      \n                      \n                        Reviews\n                      \n                      \n                        New York\n                      \n                      \n                        Painting\n                      \n                      \n                        Sikkema Malloy Jenkins\n                      \n                      \n                        Jennifer Packer\n                      \n                  \n        \n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jennifer Packer Confronts Grief Through Paintings That Cut Deep",
      "image": [
        "https://hyperallergic.com/content/images/size/w1200/2025/11/Packer1-1.jpg"
      ],
      "datePublished": "2025-11-30T21:10:38.000Z",
      "dateModified": "2025-11-30T21:10:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]