[
  {
    "title": "Every Filmed and Televised Performance by Joy Division (1978–79)",
    "url": "https://www.openculture.com/2025/10/every-filmed-and-televised-performance-by-joy-division-1978-79.html",
    "image": "https://cdn8.openculture.com/2025/10/09195309/JoyD-1024x576.jpg",
    "tag": "Culture",
    "date": "2025-10-10T08:00:52.000Z",
    "description": "\n\tin Music, Television |   \tOctober 10th, 2025  Leave a Comment\n\t\n\t\t\t\n\n\t\n\nBri­an Eno once said of the Vel­vet Under­ground that their first album sold",
    "body": "\n\tin Music, Television |   \tOctober 10th, 2025  Leave a Comment\n\t\n\t\t\t\n\n\t\n\nBri­an Eno once said of the Vel­vet Under­ground that their first album sold only 30,000 copies, but every­one who bought one start­ed a band. Joy Divi­sion’s debut Unknown Plea­sures sold only 20,000 copies in its ini­tial peri­od of release, but the T‑shirt embla­zoned with its cov­er art — an image of radio waves ema­nat­ing from a pul­sar tak­en from an astron­o­my ency­clo­pe­dia — has long since con­sti­tut­ed a com­mer­cial-semi­otic empire unto itself. That speaks to the vast sub­cul­tur­al influ­ence of the band, despite their only hav­ing been active from 1976 to 1980. When we speak of the genre of post-punk, we speak, in large part, of Joy Divi­sion and the artists they influ­enced.\nLess than a year after the 1979 release of Unknown Plea­sures, Joy Divi­sion’s lead singer Ian Cur­tis com­mit­ted sui­cide. The band had already record­ed Clos­er, their sec­ond and last album (at least before the sub­se­quent, more suc­cess­ful ref­or­ma­tion as New Order). Scant though it may be, their stu­dio discog­ra­phy has only drawn more and more crit­i­cal acclaim over the decades.\nStill, fans who weren’t around to wit­ness the rise of Joy Divi­sion first-hand will sus­pect they’ve missed out on some­thing essen­tial. “Live, Joy Divi­sion were heavy,” remem­bers band his­to­ri­an Jon Sav­age. “Per­form­ers — and David Bowie is a good exam­ple – know exact­ly what to give and what to with­hold, but Ian Cur­tis didn’t have that stage­craft. He just came on and gave every­thing.”\n\n\n\t\n\nThat sort of inten­si­ty, Sav­age adds, is “not infi­nite­ly repro­ducible”; even at the time, it seems that those who wit­nessed Joy Divi­sion in con­cert under­stood that their pecu­liar­ly com­pelling ener­gy was dri­ving toward some kind of final com­bus­tion. You can get a taste of it in the col­lec­tion of the group’s every tele­vised per­for­mance, orig­i­nal­ly aired on BBC2 and Grana­da TV in 1978 and 1979, at the top of the post; just above, we have a 70-minute com­pi­la­tion of all their filmed live shows. Much of it con­sists of footage shot over two nights at the Apol­lo The­atre in 1979, which the uploader describes as of poor qual­i­ty — but “accord­ing to peo­ple who were there, the gig’s qual­i­ty was poor in per­son too.” As much as gen­er­a­tions of fans have done to mythol­o­gize the band’s brief exis­tence over the past 45 years, here is evi­dence that even Joy Divi­sion had an off night once in a while.\nRelat­ed con­tent:\n75 Post-Punk and Hard­core Con­certs from the 1980s Have Been Dig­i­tized & Put Online: Fugazi, GWAR, Lemon­heads, Dain Bra­m­age (with Dave Grohl) & More\nThe His­to­ry of Rock n Roll in 10 Songs: A List Cre­at­ed by Leg­endary Rock Crit­ic Greil Mar­cus\nRadio­head Cov­ers The Smiths & New Order (2007)\nHear the 50 Best Post-Punk Albums of All Time: A Nos­tal­gia-Induc­ing Playlist Curat­ed by Paste Mag­a­zine\nHear a 9‑Hour Trib­ute to John Peel: A Col­lec­tion of His Best “Peel Ses­sions”\nAn Ani­mat­ed His­to­ry of Goth\nBased in Seoul, Col­in Marshall writes and broad­casts on cities, lan­guage, and cul­ture. His projects include the Sub­stack newslet­ter Books on Cities and the book The State­less City: a Walk through 21st-Cen­tu­ry Los Ange­les. Fol­low him on the social net­work for­mer­ly known as Twit­ter at @colinmarshall.\n\t\t\n        \t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Every Filmed and Televised Performance by Joy Division (1978–79)",
      "image": [
        "https://cdn8.openculture.com/2025/10/09195309/JoyD-1024x576.jpg"
      ],
      "datePublished": "2025-10-10T08:00:52.000Z",
      "dateModified": "2025-10-10T08:00:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Blink and You'd Miss the Moments Topping This Year’s Pure Street Photography Awards",
    "url": "https://www.thisiscolossal.com/2025/10/pure-street-photography-awards-2025/",
    "image": "https://www.thisiscolossal.com/wp-content/uploads/2025/10/purestreetphoto-5.jpg",
    "tag": "Culture",
    "date": "2025-10-10T15:48:32.000Z",
    "description": "\n\n\t\nCoincidence is around every corner, and immortalizing a split second of fleeting chaos takes a special eye. Since 2020, Pure Street Photography—an",
    "body": "\n\n\t\nCoincidence is around every corner, and immortalizing a split second of fleeting chaos takes a special eye. Since 2020, Pure Street Photography—an initiative focused on connecting international photographers—has commended visual storytellers through an annual competition.\nThis year’s edition drew an impressive 1,160 submissions across 34 countries and five continents. Judged by British writer and curator David Campany alongside founder Dimpy Bhalotia, a total of 147 winning and finalist images were chosen. \nChris Yan, “Mirror”\nFrom capturing unfortunately humorous moments before disaster to documenting endearing instances of whimsy, the wide range of winning images evoke a spectrum of expressions. Together, they mirror the distinct emotions one might feel while walking down the street, embodying the authentic spirit of the medium.\nIn a large-scale exhibition at Mumbai’s Jehangir Art Gallery, each winning image will be on view in January 2026. In the meantime, check out the online gallery and Pure Street Photography’s Instagram. Find even more candid snapshots in our coverage of the initiative’s last competition.\nCazerella Tavs, “Meeting int he Middle’\nStefanie Waiblinger, “Who is Next”\nJignesh Chavda, “Thoughts take flight”\nNicola Balestrazzi, “Puebla”\nCristiano Bartoli, “Kite Attack”\n\t\n\t\n\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Blink and You'd Miss the Moments Topping This Year’s Pure Street Photography Awards",
      "image": [
        "https://www.thisiscolossal.com/wp-content/uploads/2025/10/purestreetphoto-5.jpg"
      ],
      "datePublished": "2025-10-10T15:48:32.000Z",
      "dateModified": "2025-10-10T15:48:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "In 'The Party is Over,' Murmure Confronts the Absurd Spectacle of the End Times",
    "url": "https://www.thisiscolossal.com/2025/10/murmure-the-part-is-over/",
    "image": "https://www.thisiscolossal.com/wp-content/uploads/2025/10/murmure-2.jpg",
    "tag": "Culture",
    "date": "2025-10-10T21:05:00.000Z",
    "description": "\n\n\t\nIn a world this absurd and disastrous, do we gravitate toward cynicism or levity? For the artist duo known as Murmure (previously), both are the o",
    "body": "\n\n\t\nIn a world this absurd and disastrous, do we gravitate toward cynicism or levity? For the artist duo known as Murmure (previously), both are the only option.\nThe Caen, France-based pair presents a new body of paintings and charcoal drawings in their plainly titled exhibition, La fête est finie, or The party is over. Through a unique sense of wit and irony, they transform astronauts into runway models, the moon into a nuclear power plant, and a birthday cake into a raging forest fire. \n“Moon Walk” (2025), carbon pencil on paper, 50 x 40 centimeters\nWhere there could be commonplace sights or moments of joy and frivolity, Murmure instead presents an unsettling composition. Every ill-advised choice—whether baking in front of a UV screen or watching cows graze on an ice floe—becomes a spectacular confrontation with our collective obsessions with consumerism, ecological wreckage, and self-serving gluttony.\nLa fête est finie is on view through November 22 at Galerie LJ in Paris. Find more from the artists on their website and Instagram.\n“UV #2” (2025), carbon pencil on paper, 35 x 35 centimeters\n“Nuclear Moon” (2025), carbon pencil on paper, 50 x 70 centimeters\n“A Mushroom Story” (2025), acrylic on canvas, 200 x 150 centimeters\n“Happy Birthday” (2025), carbon pencil on paper, 55 x 40 centimeters\n“UV #1” (2025), carbon pencil on paper, 180 x 130 centimeters\n“Cooler Age” (2025), acrylic on canvas, 50 x 70 centimeters\n\t\n\t\n\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "In 'The Party is Over,' Murmure Confronts the Absurd Spectacle of the End Times",
      "image": [
        "https://www.thisiscolossal.com/wp-content/uploads/2025/10/murmure-2.jpg"
      ],
      "datePublished": "2025-10-10T21:05:00.000Z",
      "dateModified": "2025-10-10T21:05:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What Do Astronomy and Jewelry Have in Common? In the Late Renaissance, Look to the Stars",
    "url": "https://www.thisiscolossal.com/2025/10/gold-armillary-rings-astronomy-history-jewelry/",
    "image": "https://www.thisiscolossal.com/wp-content/uploads/2025/10/armillary-1.jpeg",
    "tag": "Culture",
    "date": "2025-10-10T13:47:46.000Z",
    "description": "\n\n\t\nIn the famous first stanza of the 17th-century poem “Auguries of Innocence,” William Blake writes:\n\nTo see a world in a grain of sandAnd a heaven ",
    "body": "\n\n\t\nIn the famous first stanza of the 17th-century poem “Auguries of Innocence,” William Blake writes:\n\nTo see a world in a grain of sandAnd a heaven in a wild flower,Hold infinity in the palm of your handAnd eternity in an hour.\n\nPerhaps Blake didn’t intend us to literally hold infinity in our hands, but he may have been aware that there was, in a manner of speaking, a way to don the entire known universe.\nPhoto by Ulf Bruxe, Historical Museum/SHM\nCombining the elegance of gold jewelry with the meticulous craftsmanship of intricate timepieces, a unique style of ring emerged from a fashion for the cosmos during the 16th and 17th centuries. Known as armillary rings, these deceptively simple gold creations can be worn on the finger like any other band, but when removed, they open up into a sphere made of several interconnecting circular bands operated by delicate hinges.\nExamples of armillary rings in the British Museum and the Swedish National Museums of History have been traced to Germany, made during the Late Renaissance as the study of astronomy reached new heights. In 1543, Copernicus essentially launched the scientific revolution when he claimed that the Earth rotates around the Sun, not the other way around.\nA few years later, Italian polymath Galileo Galilei, known as a pioneer of observational astronomy, built a telescope powerful enough to, for the first time, observe the stars of the Milky Way, see Jupiter’s four largest satellites, and make out Saturn’s rings, among other discoveries.\nThe historic gold rings are based on ancient astronomical instruments called armillary spheres, which emerged from the long-disproven theory that everything in the cosmos revolved around Earth. The designs, which were used since at least the 2nd century, place our planet at the center. A group of rings rotates on an axis, providing reference points for locating other celestial bodies. Separate bands correlate to the equator, the Tropics of Cancer and Capricorn, and the revolution of the Sun—a ring which also represents the constellations of the Zodiac.\nPhoto by Nina Davis, Historical Museum/SHM\nPhoto by Helena Bonnevier, Historical Museum/SHM\nImage © The Trustees of the British Museum\nImage © The Trustees of the British Museum\nPhoto by Helena Bonnevier, Historical Museum/SHM\n\t\n\t\n\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What Do Astronomy and Jewelry Have in Common? In the Late Renaissance, Look to the Stars",
      "image": [
        "https://www.thisiscolossal.com/wp-content/uploads/2025/10/armillary-1.jpeg"
      ],
      "datePublished": "2025-10-10T13:47:46.000Z",
      "dateModified": "2025-10-10T13:47:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "LOOK HERE Highlights the Work of Progressive Art Studios Nationwide",
    "url": "https://hyperallergic.com/1047855/look-here-highlights-the-work-of-progressive-art-studios-nationwide/",
    "image": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/10/LOOKHERE-Photo_ConstanceMensh.jpg?fit=1600%2C1067&quality=90&ssl=1",
    "tag": "Culture",
    "date": "2025-10-10T18:00:00.000Z",
    "description": "\n\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\t\n\n\t\nThis fall, Philadelphia’s leading progressive art studio, the Center for Creative Works (CCW), has partnered with Haverford Coll",
    "body": "\n\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\t\n\n\t\nThis fall, Philadelphia’s leading progressive art studio, the Center for Creative Works (CCW), has partnered with Haverford College’s Cantor Fitzgerald Gallery to present LOOK HERE, a dynamic, multisensory exhibition illuminating the nuanced and revelatory perspectives represented in the work of neurodivergent artists. Ranging from colorful illustrations that meticulously catalogue differences in categories of food, transit, and appliances, to found object sculptures that form relics of a world understood through touch, the show invites visitors to look, listen, smell, and touch to connect with a diversity of ways of “looking” at the world.\nLOOK HERE features six artists with studio practices based out of CCW – Kelly Brown, Cindy Gosselin, Clyde Henry, Tim Quinn, Brandon Spicer-Crawley, and Allen Yu. Curated by Jennifer Gilbert alongside two CCW artists  — Mary T. Bevlock and Paige Donovan — the exhibition emphasizes art’s ability to communicate across different sensory channels.\nThe show’s design integrates many elements to enhance accessibility for a variety of audiences, including braille, videos about the artists with American Sign Language (ASL) embedded, touch panels featuring artists’ materials, sensory backpacks, an Easy Read guide, a quiet room, and tours led by neurodivergent artists.\nLOOK HERE is complemented by a series of related events, including two satellite exhibitions – one at Haverford’s VCAM gallery, LOOK THERE, featuring a single work from a larger group of 99 CCW artists, and another at Philadelphia’s Atelier Gallery through October, LOOK EVERYWHERE, which highlights works from 33 artists from 30 progressive art studios around the United States. \nThese exhibitions will coincide with the sixth annual Creating Community Symposium, happening October 20–23. Originally founded by California’s Creative Growth Art Center, the symposium brings together professionals from progressive art studios around the US to discuss best practices, advocacy, and the evolving intersection of art and disability. This is the first time the gathering will be held on the East Coast.\nLOOK HERE and LOOK THERE are open through December 13, 2025. LOOK EVERYWHERE closes on October 31.\nTo learn more, visit hav.to/lookhere.\n\t\n\n\t\t\t\t\n\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "LOOK HERE Highlights the Work of Progressive Art Studios Nationwide",
      "image": [
        "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/10/LOOKHERE-Photo_ConstanceMensh.jpg?fit=1600%2C1067&quality=90&ssl=1"
      ],
      "datePublished": "2025-10-10T18:00:00.000Z",
      "dateModified": "2025-10-10T18:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Independent Art Fair Partners With Henry Street Settlement",
    "url": "https://hyperallergic.com/1048606/independent-art-fair-partners-with-henry-street-settlement/",
    "image": "https://hyperallergic-newspack.s3.amazonaws.com/uploads/2025/09/DSC06639.jpg",
    "tag": "Culture",
    "date": "2025-10-10T19:08:02.000Z",
    "description": "\n\t\t\t\n\t\t\t\t\t\t\tVisitors at the 2025 edition of Independent 20th Century (photo Hrag Vartanian/Hyperallergic)\n\t\t\t\n\t\t\t\t\n\n\t\nThe Henry Street Settlement, the",
    "body": "\n\t\t\t\n\t\t\t\t\t\t\tVisitors at the 2025 edition of Independent 20th Century (photo Hrag Vartanian/Hyperallergic)\n\t\t\t\n\t\t\t\t\n\n\t\nThe Henry Street Settlement, the Lower Manhattan social services nonprofit, will partner with Independent Art Fair to host its annual fundraising benefit, according to an announcement yesterday, October 9. The news comes after the unforeseen discontinuation of Henry Street’s decades-long partnership with the Art Dealers Association of America (ADAA), whose annual fall Art Show served as the organization’s largest benefit since 1988.\nOver the course of 36 years, the event — which Henry Street co-founded with the ADAA — was a crucial source of unrestricted funding, raising more than $38 million for the New York organization. This year, the ADAA also cancelled its fall fair, telling Hyperallergic that it was taking a strategic “pause.”\nThe gala will take place on the opening night of Independent’s 17th edition, scheduled for May 14 through May 17 at Pier 36. According to the announcement, all proceeds from ticket sales will support Henry Street, which helps more than 50,000 New Yorkers annually through its social services, arts, health care, and housing programs. \nDavid Garza, chief executive officer of the Henry Street Settlement, told Hyperallergic that the partnership “opens doors of opportunity for the most vulnerable people among us.”\nThe news also comes on the heels of Independent’s recent announcement that it will collaborate with Sotheby’s to host its fall modern art fair in the auction house’s new uptown address, at the Marcel Breuer-designed Brutalist building on Madison Avenue.\nIndependent’s founder Elizabeth Dee told Hyperallergic that the new alliance with Henry Street “seemed like a perfect fit” with the relocation of its spring fair from Tribeca to Pier 36 on the Lower East Side, which will place the event just a few blocks from the historic nonprofit’s headquarters and art center. She also suggested that the partnership is a long-term endeavor. “Henry Street will be the fair’s main philanthropic activity going forward,” Dee said.\nSocial service nonprofits have been scrambling to recoup losses from cut federal funding and to brace for future rescissions. Garza cited the loss of funding from the US Department of Agriculture, which supported a critical New York farm-to-table program that helped provide food for low-income families in New York City and elsewhere across the state.\n“ When funding like that disappears and food disappears off people’s tables, that’s when we try to spring into action to try to find alternative or creative ways to meet that need,” Garza said. “And the  reality of the situation is that the worst is yet to come.”\n\t\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\tMaya Pontone (she/her) is a Staff News Writer at Hyperallergic. Originally from northern New Jersey, she currently resides in Brooklyn, where she covers daily news affecting the arts and culture, both...\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\tMore by Maya Pontone\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\n\t\t\t\t\n\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Independent Art Fair Partners With Henry Street Settlement",
      "image": [
        "https://hyperallergic-newspack.s3.amazonaws.com/uploads/2025/09/DSC06639.jpg"
      ],
      "datePublished": "2025-10-10T19:08:02.000Z",
      "dateModified": "2025-10-10T19:08:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "People Really Hate the Philadelphia Art Museum Rebrand",
    "url": "https://hyperallergic.com/1048843/people-really-hate-the-philadelphia-art-museum-rebrand/",
    "image": "https://hyperallergic-newspack.s3.amazonaws.com/uploads/2025/10/pma-new.jpg",
    "tag": "Culture",
    "date": "2025-10-10T21:15:12.000Z",
    "description": "\n\t\t\t\t\n\t\t\t\n\t\t\t\t\t\t\tThe Philadelphia Museum of Art is now the Philadelphia Art Museum with a new brand identity and logo. (photo by Rob Cusick, courtesy ",
    "body": "\n\t\t\t\t\n\t\t\t\n\t\t\t\t\t\t\tThe Philadelphia Museum of Art is now the Philadelphia Art Museum with a new brand identity and logo. (photo by Rob Cusick, courtesy the museum)\n\t\t\t\n\n\t\nSay goodbye to the Philadelphia Museum of Art, and hello to … hold onto your hats … the Philadelphia Art Museum! *crickets*\nOn Wednesday, October 8, the historic arts institution announced a major overhaul of its brand, including a new logo with a serif typeface and a slightly slimmer name that has some nodding in approval and others scratching their heads. It’s the latest museum rebranding to cause a public stir, following controversial campaigns by the Minneapolis Institute of Arts, the Metropolitan Museum of Art in New York, and the Brooklyn Museum over the past decade. \nFor those outside of Philly, the redesign may not seem like a significant change (after all, “Philadelphia Museum of Art” and “Philadelphia Art Museum” are both big mouthfuls). But for local residents, many of whom already knew the institution as simply “the Art Museum,” it may come as a natural step.\n“When I mention to folks who aren’t engaged in the arts and culture community and I say the PMA, they have no idea what I’m talking about,” the museum’s director and chief executive officer Sasha Suda told public radio station WHYY-FM. Under its new name, the museum now takes on the George Michael-esque acronym, “PhAM” (hold the exclamation point), which has already been incorporated into the URL of its redesigned website.\nNot everyone is as enthusiastic about the change. “The #phart museum? You gotta be kidding me!” quipped costume designer Rita Squitiere on X. “We had no problem calling it the Philadelphia Museum of Art … We’re smart people, we can handle words.”\nWhile some have welcomed the rebranding, others have voiced criticism of the new design. (screenshot Maya Pontone/Hyperallergic via @philamuseum on Instagram)\nFor the brand redesign, the museum worked with Brooklyn-based design studio Gretel, whose clients include the Museum of Modern Art in New York and the Crystal Bridges Museum of American Art in Arkansas. Its portfolio also lists the New York City Football Club as a previous customer, which will not be surprising to critics who took issue with PhAM’s new logo depicting the museum’s longstanding symbolic griffin.\n“It looks like a soccer team logo,” wrote one user above a congratulatory comment from the Institute of Contemporary Art, Philadelphia, on Instagram. The sentiment was echoed by art media outlet The Arts District in a post claiming that the logo resembled an athleisure ad campaign.\n“It feels both oppressive and bland, not like the charming treasure trove that is PMA’s collection,” commented artist and filmmaker Lex Brown on Instagram. \nSome also lambasted the museum for hiring a NYC design firm as opposed to a company rooted in Philadelphia. “For a museum filled with so much beautiful and creative art, they really approached this branding shift with the energy and thought process of a NYC design agency working with a soon-to-be-open Fishtown coffee shop,” fumed artist Rushawn Stanley on Instagram.\n\"It's been rebranded as the PMA!\"\"A Brooklyn design firm has rebranded it's logo as a lion's crest\"\"We're not your grandfather's museum\"\"We're digital-first\" pic.twitter.com/inguT0LpyS— Michael (@phillymike223) October 8, 2025\nGreg Hahn, founder of Gretel, told Hyperallergic that the company sees the public’s reactions to the museum’s redesign as “a strong response to changing things that they have grown to love.”\n“Any brand (person, place, or thing) develops an audience, and if they’re lucky, a following. When that’s the case, there will always be opinions on any changes made, sometimes founded and sometimes simply reactionary,” Hahn said.\nStill others opined that the brand’s new custom typeface, a font known as Fairmount Serif, appeared too dystopian. (Gretel noted in its announcement that the type pulls from the museum’s origins as the Pennsylvania Museum and School of Industrial Arts, as well as architectural details like its original seal and wall engravings.)\n“The logo looks like some kind of Cold War monstrosity,” said illustrator Bonnie Watts, citing the institution’s recent disputes with its staff union. In June 2023, unionized workers accused leadership of backtracking on agreed-upon provisions for longevity pay. The allegations were made not even a year after workers held a 19-day strike in demand of wage increases, paid family leave, and more affordable healthcare.\n“Do better for the people who actually make a difference at the museum,” Watts said on Instagram. “Then maybe people will actually want to visit.”\n\t\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\tMaya Pontone (she/her) is a Staff News Writer at Hyperallergic. Originally from northern New Jersey, she currently resides in Brooklyn, where she covers daily news affecting the arts and culture, both...\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\tMore by Maya Pontone\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\n\t\t\t\t\n\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "People Really Hate the Philadelphia Art Museum Rebrand",
      "image": [
        "https://hyperallergic-newspack.s3.amazonaws.com/uploads/2025/10/pma-new.jpg"
      ],
      "datePublished": "2025-10-10T21:15:12.000Z",
      "dateModified": "2025-10-10T21:15:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]