[
  {
    "title": "Onassis AiR Opens Applications for 2026–27 Residencies in Athens",
    "url": "https://hyperallergic.com/onassis-air-opens-applications-for-2026-27-residencies-in-athens/",
    "image": "https://hyperallergic.com/content/images/size/w1200/2026/01/Hyperallergic-3.48.38---PM-1.jpg",
    "tag": "Culture",
    "date": "2026-01-30T16:00:35.000Z",
    "description": "\n                Announcement\n                Participants receive an artist’s fee, a research budget, housing, round-trip travel, mentoring, and othe",
    "body": "\n                Announcement\n                Participants receive an artist’s fee, a research budget, housing, round-trip travel, mentoring, and other resources to support their work.\n            \n                \n                                \n                            \n                \n            \n                \n        \n            Artwork for Onassis AiR Open Call 2026-27 (© Onassis Creative Studio)\n    \n        \n            After six successful years supporting nearly 250 fellows from around the world, the artistic research and residency program Οnassis AiR has become a container of cross-disciplinary exchange among local and international art practitioners and researchers. Process, research, and experimentation are at the core of the residency: participants are invited to delve deeper into their practice without the pressure of presenting a final work. Serving as a point of access to the Onassis Culture ecosystem, Onassis AiR offers tailored mentoring and opportunities to explore future production, co-production, presentation possibilities, or further support for a project’s international development.This season, the program invites applications for a 10-week residency in Athens, Greece, between September 2026 and July 2027. It will award 30 residencies across all fields, including Visual Arts, Theater, Dance, Sound, Art & Advanced Technologies, Filmmaking, Applied Arts, and Curation, as well as their hybrid iterations.This year, the program: Introduces a new research and project development opportunity in collaboration with the Cavafy Archive.Continues its focus on material-based practices and the broader field of applied arts, a direction strengthened by its expansion at Onassis Ready.Continues to provide technical and production support for performing arts and digital productions through dedicated Technical Residencies.In collaboration with Onassis ONX, offers access to the platform’s new studio within Onassis Ready, providing additional curatorial, development, and technical support.Enhances the artist’s fee and budget in response to increasingly precarious working conditions for art professionals in Greece and abroad.Selected participants receive an artist’s fee, a research budget, housing, round-trip travel, access to mentoring, and audiovisual equipment, among other resources. All program participants are involved in the Onassis AiR Open Days, a series of public events centered on creative processes rather than finished outcomes.Applications are due by March 3, 2026, at 12pm (UTC+2).To learn more and apply, visit onassis.org.\n                  \n                      \n                        Announcement\n                      \n                      \n                        Sponsored\n                      \n                      \n                        Opportunities\n                      \n                      \n                        Athens\n                      \n                  \n        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Onassis AiR Opens Applications for 2026–27 Residencies in Athens",
      "image": [
        "https://hyperallergic.com/content/images/size/w1200/2026/01/Hyperallergic-3.48.38---PM-1.jpg"
      ],
      "datePublished": "2026-01-30T16:00:35.000Z",
      "dateModified": "2026-01-30T16:00:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "James Castle Was a World Unto Himself",
    "url": "https://hyperallergic.com/james-castle-was-a-world-unto-himself/",
    "image": "https://hyperallergic.com/content/images/size/w1200/2026/01/IMG_4080.jpg",
    "tag": "Culture",
    "date": "2026-01-30T17:46:19.000Z",
    "description": "\n    \n                Art Review\n                These works feel almost metaphysically transportive — like a universe bound by a different set of rul",
    "body": "\n    \n                Art Review\n                These works feel almost metaphysically transportive — like a universe bound by a different set of rules that’s a pleasure to explore. \n            \n                \n                                \n                            \n                \n            \n                \n        \n            James Castle, \"Untitled (Top Handle)\" (undated), found paper, color of unknown origin\n    \n        \n            Pull open the heavy gold door of a beige Upper East Side townhouse, step inside the claustrophobic space of “one of the slowest elevators on the planet” (as a charming printed sign confirms), and enter the one-room, dark-wood Rodder gallery to find yourself in the strange oasis of James Castle’s art. Castle — born deaf on a rural Idaho farm on the eve of the 20th century and isolated from the circuits of the art world his entire life — seemed to have arrived independently at some of the most radical tenets of mid-century abstraction. He combined pieces of scrap paper, sometimes hoarded for decades, with soot bound by saliva to create formally gorgeous works that revel in the way ink ripples across the page, or cardboard can bend like a body. Dimensions presents 14 of these, among them grayscale drawings, color images, assemblages, and text pieces. \"Untitled (Time Magazine book)\" (1933–40), soot, spit, and string on paperCheck out the medium line for “Untitled (shooting stars)” (undated): “color of unknown origin on found paper.” It’s a tiny, unevenly thick piece of paper splotched by a light wash of blue and gray ink, suggesting to me the point where sea meets earth — this, from landlocked Idaho. Indeed, we talk often about the transportive power of art, but these feel literally, almost metaphysically, so — as if we’re entering a universe bound by a different set of rules that it’s a pleasure to explore. “Untitled (Door)” (undated), rendered on what looks like balloon-dotted wrapping paper, depicts a pair of disembodied doors, set against no edifice except for the picture plane itself. Meanwhile, “Untitled (Diptych)” (undated) uses that same paper as the backdrop of a peculiar, yin yang-like work in which robed figures stand at different distances behind a chain link fence. Who is that at the door? One of my favorite pieces in this exhibition is “Untitled (Time Magazine Book)” (1933–40). In it, Castle creates a postcard of sorts, complete with hand-drawn stamps — a testament to how far the imagination can travel. \"Untitled (Small Blondie)\" (undated), found paper, flour paste, soot\"Untitled (shooting stars)\" (undated), color of unknown origin on found paper\"Untitled (Door)\" (undated), soot and found paper\"Untitled (Diptych)\" (undated), soot, saliva on paperJames Castle: Dimensions continues at Rodder gallery (22 East 80th Street, Fifth Floor, Upper East Side, Manhattan) through February 14. The exhibition was organized by the gallery. \n                  \n                      \n                        Art Review\n                      \n                      \n                        Reviews\n                      \n                      \n                        James Castle\n                      \n                      \n                        New York\n                      \n                  \n        \n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "James Castle Was a World Unto Himself",
      "image": [
        "https://hyperallergic.com/content/images/size/w1200/2026/01/IMG_4080.jpg"
      ],
      "datePublished": "2026-01-30T17:46:19.000Z",
      "dateModified": "2026-01-30T17:46:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Claude Cahun’s Survival Guide for the Ages",
    "url": "https://hyperallergic.com/claude-cahuns-survival-guide-for-the-ages/",
    "image": "https://hyperallergic.com/content/images/2026/01/claude-c1200.jpg",
    "tag": "Culture",
    "date": "2026-01-30T18:39:40.000Z",
    "description": "\n    \n                Book Review\n                A new translation of the French artist’s 1930 memoir is a kaleidoscopic collection of dialogues, ske",
    "body": "\n    \n                Book Review\n                A new translation of the French artist’s 1930 memoir is a kaleidoscopic collection of dialogues, sketches, and Blakean proverbs.\n            \n                \n                                \n                            \n                \n            \n        \n            Claude Cahun, \"I am in training, don't kiss me\" (1927) (image public domain CC0 via Wikimedia Commons)In our present age of extractions and casual exterminations, when we seem forced to endure the rancid logics of the early 20th century anew, it feels improbable that a survival kit should reach us in the form of modernism itself. Yet the last several years have seen the translation, reissue, and recirculation of an audacious clutch of work by modernist writers and artists, from Gabriel Pomerand's buoyant Lettrism to Yi Sang's homophonic poetry, from Leonora Carrington's self-liberating oneirism to Joyce Mansour's reversed flight from margin to metropole.  Taken together, these works offer a counter-arsenal of dreams.The latest of these is Claude Cahun's Cancelled Confessions (Or Disavowals) (1930), translated by Susan de Muth and republished by Siglio Press in October. To give a single biographical sketch of Claude Cahun is to offend against this artist’s refusal to be just one thing. The name itself is an invention, as is that of Cahun's partner in life and art, Marcel Moore. These alliterative noms-de-guerre suggest identity is less a fixed quality than something that can be snipped apart and re-stitched. Both members of the Paris Surrealist orbit who moved to the British Isle of Jersey in 1937, Cahun and Moore's queer life-and-art-making included works of theater, costume, photography, text, domesticity, and even anti-Nazi sabotage. Theirs were many decades of refusal, disavowal, and glittering possibility.Spread from Cancelled Confessions (or Disavowals) by Claude Cahun (Siglio, 2025), translated by Susan de Muth (image courtesy Siglio, all rights reserved)Cancelled Confessions is itself a work of refusal — a refusal to produce the linear memoir Cahun was initially invited to write by publisher Adrienne Monnier, who ultimately turned down the manuscript and left it to be taken up by a more radical publisher in 1930. This refusal birthed a work of infinite invention. As scholar Amelia Groom attests in her new afterword, even Cahun's iconic \"self-portraits\" are not what they seem; Moore collaborated in photographing Cahun in various costumes, masks, and pantomimed poses, employing tricks of light, contrast, scale, cropping and angle. While the author credit for Cancelled Confessions goes to Cahun, Moore composed the dizzying photomontages that preface the book and each of its sections. These collages insert Cahun's already fictionalized image into a galaxy of doubles, miniatures, mirror-images, avatars, a giant eye which might be Cahun's own if we were operating in a world of singular possessives — which, thanks to both artists’ collaborative interventions, we are not. Cahun's text itself is also ravishingly myriad, split into nine sections that are themselves split into tributaries of declaration (\"I want to change skin: tear the old one from me\"), dialogues, sketches, Wildean paradoxes (\"Purity is composed of all the stains, just as white is of all the colors\"), Cocteauian fables, Blakean proverbs. The work is self-described “verbal debauchery\" and self-theorizing; \"We are only ever shown the hero's point of view. But what if I take a minor player's side?\" writes Cahun.Much credit must go to de Muth for the nimbleness of this translation. Stylistically, the writing is rambunctious with puns and made singular by its instinct to drive all syntaxes toward the plural. It's also stylish, sexy, and funny, a kind of handbook of what Cahun called \"angel slang.\" The figure of Narcissus provides Cahun with an emblem of the book's instinct for paradox, singular because he embraces his double, exemplary in his notoriety: \"That beautiful child was able to extract the infinite from his reflection, while we remain vibrations away, always the same, incapable of going any further.\" Amid the book's continuous brainstorm, synaptic and replete, de Muth deploys a neat aim and a sustaining sense of fun. Cancelled Confessions arrives in a deliciously designed oxblood-red codex; such attention to the book itself as the alchemical joining of writing and art is Siglio's hallmark. In my hands, this vital object opened almost of its own volition, so as to restore my own. To recognize that this book, like those of other newly republished modernists, exists thanks to the labor both of translators and editors at independent presses such as Siglio, World Poetry Book, Wave, New York Review Books, and City Lights, is to recognize that survival will be collaborative — or it shall not be at all.Cover of Cancelled Confessions (or Disavowals) (Siglio, 2025) (image courtesy Siglio)Cancelled Confessions (or Disavowals) (2025) by Claude Cahun, translated by Susan de Muth with a preface by Pierre Mac Orlan and essay by Amelia Groom, is published by Siglio Press and available online and through independent booksellers.\n                  \n                      \n                        Book Review\n                      \n                      \n                        Reviews\n                      \n                      \n                        Claude Cahun\n                      \n                  \n        \n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Claude Cahun’s Survival Guide for the Ages",
      "image": [
        "https://hyperallergic.com/content/images/2026/01/claude-c1200.jpg"
      ],
      "datePublished": "2026-01-30T18:39:40.000Z",
      "dateModified": "2026-01-30T18:39:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "After the Strike, Will Art Galleries Be Allies?",
    "url": "https://hyperallergic.com/after-the-strike-will-art-galleries-be-allies/",
    "image": "https://hyperallergic.com/content/images/size/w1200/2026/01/GettyImages-2254675964.jpg",
    "tag": "Culture",
    "date": "2026-01-30T21:22:41.000Z",
    "description": "\n            Over the last few days, my feed has filled up with galleries posting statements about standing in solidarity with protests against Immigr",
    "body": "\n            Over the last few days, my feed has filled up with galleries posting statements about standing in solidarity with protests against Immigration and Customs Enforcement (ICE). Black text on white backgrounds. Thoughtful fonts. Promises to “hold space” and “support our communities.”As activists across the United States call for a nationwide strike against ICE today, the question facing cultural institutions is not whether to take sides rhetorically, but whether their material practices can withstand the moral pressure of the moment. I don’t doubt that many of the people writing these statements mean them. But in the art world, sincerity has a way of settling into style while the underlying terms of business remain untouched.We already have a name for one version of this pattern: performative allyship. In 2015 and 2016 it took the form of safety pins worn to signal safety and moral alignment. In 2020 it appeared as black squares posted in near unison across social media feeds. In each case, the gesture oriented itself toward being seen on the right side of history. Because its primary function was reputational, it was almost entirely frictionless. Nothing about how an institution actually operated, who it funded, or how it distributed power had to change.But not all frictionless allyship is cynical performance. Something can be heartfelt and well-intentioned and still leave the machinery perfectly smooth. A sincere caption. A beautifully designed solidarity graphic. A day off on an already quiet Friday when collectors are out of town. Meanwhile, the opening still happens, the 50% commission still applies, the art-fair invoices are paid, and artists still wait months to receive their money after a sale.All performative allyship is frictionless.Not all frictionless allyship is performative.The difference between those categories is intent. The difference that matters here is effect.Frictionless allyship is solidarity that requires no operational change. Real solidarity introduces drag. Something in the schedule, the budget, or the contract has to hesitate because the institution chose consequence over convenience.This idea of friction has deep roots in how protest makes injustice legible to people otherwise insulated from it.During the lunch counter sit-ins of the Civil Rights movement, students didn’t release statements about segregation. They sat at Whites-only counters and asked to be served. That act shut counters down, cost businesses money, and forced ordinary patrons to confront racial violence in the middle of their lunch break.The point wasn’t just to get a sandwich. It was to make the cost of injustice visible to those who benefited from not seeing it. Private harm became public inconvenience.Protests against ICE use the same grammar of interruption. Immigration enforcement is built to be administratively smooth and socially distant: a pre-dawn knock on the door, a parent taken from a workplace, a sudden transfer that makes a court date unreachable. By the time a family understands what has happened, their loved one may be hundreds of miles away in detention.Protest jams that quiet efficiency. Streets close. Traffic backs up. Daily routines detour around the fact that detention and deportation are not abstract policy, but lived rupture.Today, a nationwide strike known as \"ICE Out\" calls for “no work, no school, no shopping” in protest of recent fatal shootings and expanded federal immigration enforcement. Tens of thousands of people are participating in an economic blackout and mass demonstrations in Minnesota against ICE operations, with labor unions, community groups and local businesses closing in solidarity and pressuring for an end to ICE funding and accountability for federal agents’ actions. Restaurants, cafes and other businesses in cities including New York are closed or performing solidarity actions in support of the strike and protest, a form of collective action that involves real economic sacrifice rather than symbolic endorsement of a cause. Friction is communication, not chaos.In a consumer economy, friction can also look like refusal. Today, many Black Americans are deliberately creating that friction by refusing to spend money at Target. This is not random consumer drift but a collective decision to withdraw participation from a corporation whose image has long been burnished through cultural philanthropy.For years, Target sponsored free museum days that expanded access for families who might not otherwise afford admission. Those days mattered. But they also created a loop: Black consumer spending funded corporate philanthropy, philanthropy produced cultural legitimacy, and that legitimacy softened the corporation’s public image. Even after those programs disappeared before the pandemic, the reputational glow remained.The current refusal breaks that loop by turning absence into pressure. The disruption shows up not as a statement but as a number on a balance sheet.If the absence of Black dollars can register as leverage in a corporation’s ledger, then solidarity that never registers anywhere in a gallery’s ledger is not leverage at all.Keeping ICE at the center clarifies the stakes. This is opposition to a system that separates families and cages people in detention while relying on bureaucratic smoothness and public distance to keep that violence tolerable.If a gallery’s solidarity leaves its own openings, payment timelines, commission structures, and fair schedules exactly as before, then the solidarity is only visual. It borrows the language of disruption while protecting the conditions of comfort.Hundreds of commercial galleries posted statements ahead of today's general strike. (all screenshots via Instagram by Hyperallergic)You don’t need insider access to tell the difference. Ask a few blunt questions.Did this gesture cost the institution anything measurable?Did it move money, time, or decision-making power toward immigrant artists and communities most vulnerable to ICE’s violence?Will anything still be different after the news cycle passes and the next show opens?If deleting the post tomorrow would change nothing about how artists are paid, how commissions are split, or how resources are allocated, the allyship was frictionless, whether sincere or strategic.Friction requires observable, tangible change. That might mean paying artists on delivery rather than after collectors pay. Temporarily reducing the gallery’s commission and publicly committing to that timeline. Delaying or downsizing an art-fair booth in order to redirect those funds to immigrant legal defense. Creating emergency support for undocumented cultural workers. Hosting know-your-rights clinics in the gallery space.Not gestures that decorate the program, but decisions that reorient priorities toward people whose lives are already being interrupted.The art world is adept at metabolizing critique as aesthetics, hanging dissent on the wall while leaving the contract in the back office untouched. A solidarity post risks becoming another polished object in the feed, adjacent to installation shots and press clippings, carrying no more operational weight than an exhibition announcement.Performative allyship is about looking right.Frictionless allyship is about nothing having to move.Real solidarity is about choosing, on purpose, to let institutional comfort give way to human urgency.If institutions want to stand with people whose lives have been upended by detention and deportation, their solidarity has to show up as time, protection, and material support that outlasts the post and reaches the people who are actually at risk.\n                  \n                      \n                        Opinion\n                      \n                      \n                        ICE\n                      \n                      \n                        art galleries\n                      \n                      \n                        galleries\n                      \n                  \n        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "After the Strike, Will Art Galleries Be Allies?",
      "image": [
        "https://hyperallergic.com/content/images/size/w1200/2026/01/GettyImages-2254675964.jpg"
      ],
      "datePublished": "2026-01-30T21:22:41.000Z",
      "dateModified": "2026-01-30T21:22:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Eugène Atget, Readymade Icon",
    "url": "https://hyperallergic.com/eugene-atget-readymade-icon/",
    "image": "https://hyperallergic.com/content/images/size/w1200/2026/01/07-Atget_The-Making-of-a-Reputation-1.jpg",
    "tag": "Culture",
    "date": "2026-01-30T21:06:39.000Z",
    "description": "\n    \n                Art Review\n                An exhibition retells the story of his discovery by Berenice Abbott, leaving out the details of a lif",
    "body": "\n    \n                Art Review\n                An exhibition retells the story of his discovery by Berenice Abbott, leaving out the details of a life defined by failure. \n            \n                \n                                \n                            \n                \n            \n        \n            Eugène Atget, \"Vaux-de-Cernay\" (1908–10/1908–27) (photo courtesy the International Center of Photography; all other photos Julia Curl/Hyperallergic unless otherwise noted)It wouldn’t be wrong to say that Eugène Atget, one of photography’s major figures for almost a century now, is in danger of seeming old hat. So when the International Center of Photography promised “a new approach to the story of Atget’s career” with its exhibition Eugène Atget: The Making of a Reputation, I took the bait. (What exciting new revelations might lie in store?) Alas, that line turned out to be a bit of PR propaganda. The exhibition rehashes the now-familiar story of how Atget would have languished in obscurity if it weren’t for the photographer Berenice Abbott, who rescued his archive after his death, printing and promoting his lonesome images of Parisian streets. Indeed, the most novel feature of ICP’s approach may be the exhibition’s color scheme: dark red walls and shiny gold text — atmospheric, yes; legible, maybe — which are perhaps a nod to the grand galleries of yore.Likewise, while the exhibition is called The Making of a Reputation, Atget’s prestige is presented to the viewer as ready-made. The show doesn’t include much expository text (not necessarily a bad thing), but its walls are sprinkled from the beginning with the shining accolades of the photographer’s peers. We hear that Atget was “an artist, strong and courageous,” someone who “reached the pole of utmost mastery” and was “the most important forerunner of the whole modern photographic art.” (That the show’s glowing anecdotes are literally delivered in gold really drives the point home.) These words make it harder to imagine the Atget whose life was defined by failure, the orphan who worked as a cabin boy before struggling to make a career as an actor, the unsuccessful painter who turned to photography in his mid-30s to earn a living — how contingent and not at all foreseeable his posthumous fame was.Eugène Atget, \"Pontoise, Place du Grand Martroy\" (1902/1919–27) (photo courtesy International Center of Photography)Nevertheless, despite the show’s false pretenses, I was glad to have been lured there. Many of the prints are stunningly gorgeous, revealing depths so detailed — and inviting you to lean so far forward — that you almost want to fall into the photograph. You can count every leaf on a bush, every post on a sloping wooden fence. Peering at a seven-by-nine-inch (~18 x 23 cm) photograph like “Pontoise, Place du Grand Martroy” (1902), one gets the same sort of pleasure as when looking at a miniature diorama: that simultaneous yearning for the unreachable and delight in its tininess. (Viewers with foresight will smuggle in a magnifying glass.)Atget sought to collect the disappearing world of old Paris in his images, a city that was cluttered and a little ramshackle, almost Dickensian in its accumulation of things. He photographed at the crack of dawn, before people were out on the streets, and their absence is hauntingly present: Are they the ghosts of this world, or are we? “Trianon” (1926), shot in a moody garden, shimmers with exactly this kind of resonance; our eyes travel past the sun-dappled fountain and towards the field beyond, pulled into pastures deep enough for one’s imagination to take up residence. It’s the kind of scene that lodges itself in the back of your mind, returning in dreams or as ambient half-memories of places you might have been to, or never visited at all. That’s probably why the Surrealists loved him so much.Detail of Eugène Atget, \"Trianon\" (1926) Atget himself never thought of his photographs as art, though, nor did he seek recognition for them. Rather, he marketed and sold his careful records of old Paris as “documents for artists,” visual references for painters looking to recreate things like a wrought iron banister or an arched doorway. After meeting Atget, falling in love with his work, and later managing his estate, Berenice Abbott — who was then frequenting Surrealist circles — posthumously rebranded the photographer as an artist. (The academic debate over how to contend with this tricky move goes back to at least the ’80s.) It’s therefore particularly evocative seeing portraits of the two hanging side by side in the show: Both look pensive, a little rumpled, and piercing in their own ways. There’s a generational divide in how the photographs are composed, with Atget posing as the classic head-on subject while Abbott lies down at a modernist angle, a cat tucked snugly in the crook of her elbow.This collision of two different worlds seems present from their first encounter. Today, it’s impossible to know whether the frisson of Atget’s photographs comes from Atget himself, or from Abbott’s appropriation of his archive. Is the awe that the photographs inspire due to their odd dislocation from their original context, something akin to Marcel Duchamp hanging a shovel from the ceiling? Could someone in 2026 take the oeuvre of an early 2000s stock photographer and turn it into a contemporary masterpiece, precisely because of the alienation we feel from their world? These questions matter as images become easier to recycle and repurpose. Walking out of the show, the “newness” of ICP’s approach to Atget no longer seemed to matter; who needs an excuse to revisit such things?Installation view of Eugène Atget: The Making of a Reputation Eugène Atget, \"Vigne\" (1898–1929) (photo courtesy the International Center of Photography)Installation view of Eugène Atget: The Making of a Reputation Installation view of Eugène Atget: The Making of a Reputation Eugène Atget, \"École des Beaux-Arts, Monument Henri Regnault\" (1903) (photo courtesy the International Center of Photography)Eugène Atget: The Making of a Reputation at the International Center of Photography (84 Ludlow Street, Lower East Side, Manhattan) through May 4. The exhibition was curated by David Campany.\n                  \n                      \n                        Art Review\n                      \n                      \n                        Reviews\n                      \n                      \n                        Eugène Atget\n                      \n                      \n                        International Center of Photography\n                      \n                      \n                        New York\n                      \n                  \n        \n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Eugène Atget, Readymade Icon",
      "image": [
        "https://hyperallergic.com/content/images/size/w1200/2026/01/07-Atget_The-Making-of-a-Reputation-1.jpg"
      ],
      "datePublished": "2026-01-30T21:06:39.000Z",
      "dateModified": "2026-01-30T21:06:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Attention, Fascism Ahead",
    "url": "https://hyperallergic.com/attention-fascism-ahead/",
    "image": "/assets/images/news/default.jpg",
    "tag": "Culture",
    "date": "2026-01-31T11:00:56.000Z",
    "description": "\n            A piece by Lauren Moya Ford in this edition explores a Barcelona show about Joan Miró's fascination with the United States. “In the futur",
    "body": "\n            A piece by Lauren Moya Ford in this edition explores a Barcelona show about Joan Miró's fascination with the United States. “In the future world, America, with its energy and vitality, must play a leading role,” he once told Matisse. It makes you wonder: How would Miró feel about the US today?Not too good, I assume. In today's America, artists pay tribute to Alex Pretti, the ICU nurse slain by federal agents in Minneapolis. In Philadelphia, artist-made road signs warn of fascism ahead. Meanwhile, the country might lose its art market dominance due to Trump's brute immigration policies. On a lighter note, we have great reviews for you from Carolina A. Miranda, Lori Waxman, and Imani Wiliford, plus a special treat from John Yau, who minces no words in his review of a new Jeff Koons exhibition.Lastly, we're hiring! We have job openings for an Associate Editor, Staff Reporter, and Marketing Manager. Apply here, or send us your best and brightest. Thanks for reading, and have a great weekend.—Hakim Bishara, editor-in-chief\nJeff Koons’s Reflective Sculptures Mirror the One Percent\"When I try to picture where Koons’s sculptures belong and to and about whom they are speaking, I think about President Trump’s plan for a gaudy 90,000-square-foot ballroom for 1,000 guests,\" writes John Yau. Ouch. NewsMolly Crabapple, “Alex Pretti defends his city” (2026) (image by and courtesy the artist)Artists honor the life and work of Alex Pretti, who was killed by federal agents in Minneapolis last weekend. Among them is artist Molly Crabapple, whose ink and gouache drawing of the moments before his killing is an ode to Pretti's ability to remain calm and composed amid chaos.Nan Goldin accuses the Art Gallery of Ontario of censorship after the museum halted an acquisition of her work over her public stance on the Gaza.Scientists say they’ve discovered what may be the earliest rock art ever in a limestone cave in Indonesia.A “sprinkler emergency” at the newly reopened Studio Museum in Harlem forced the institution to temporarily close to remediate the water damage caused by the incident.The National Museum of Asian Art will repatriate three bronze sculptures to the Indian government, half a century after they were stolen from a Hindu temple in Tamil Nadu.Remember NFTs? Apparently, neither do its own platforms. Nifty Gateway, which was plagued with reports of user issues, is the latest marketplace to call it quits.OpinionTEFAF's 2025 New York fair (photo Greta Rainbow/Hyperallergic)How Trump Is Jeopardizing the US Art Market\"If entering the United States suddenly requires surrendering your digital life and your family’s private information, how long before people simply choose not to come?\" asks art advisor and former museum leader Rob Fields in his piece about the implications of Trump's anti-immigration policies for American dominance in the global art market.Gabrielle Goliath Strikes a Tuning Fork of DissentWhy would a nation that accused Israel of genocide at the International Court of Justice censor an artwork that mourns Palestinian lives? Was the culture minister merely incompetent and irrational? Scholar M. Neelika Jayawardane, who researches South African art and literature, thinks we're asking the wrong questions. She argues in an opinion today that this example, and the art piece by Gabrielle Goliath at its heart, reveals a broader framework of state censorship that artists are uniquely positioned to resist.A Closer Look Caravaggio, \"Boy with a Basket of Fruit\" (1595), oil on canvas (all photos Lisa Yin Zhang/Hyperallergic)The Moment Caravaggio Became CaravaggioEven an Old Master was young once. A Morgan Library & Museum exhibition about Caravaggio’s “Boy with a Basket of Fruit” is a portrait of an artist as a young man — ambitious, talented, and maybe a little petty. “He’s not a perfect artist yet,” curator John Marciari tells Associate Editor Lisa Yin Zhang in an interview. But this work is the first in a sequence tracing the arc of an unknown provincial painter's transformation into one of the undisputed giants of Western art history.Artist’s Street Signs in Philadelphia Warn of Fascism AheadAn artist who goes by Make it Weird has installed signs mimicking common traffic signage across Philadelphia to alert residents of ICE threats and looming authoritarianism. One of the signs reads: \"Somewhere in America, a little girl is hiding in an attic writing about ICE.\" Isabella Segalovich reports from Philadelphia.A Millennia-Long Fascination With ArmorHistorian Sarah Bond takes us through a new installation of the Worcester Art Museum’s armor collection — the second largest in the country. “As it turns out, the setting of knights’ tales doesn’t just take place in the storied landscapes of the European Middle Ages,” she writes. “They stretch across Eurasia, Africa, Japan, and beyond” — even making their way to “a galaxy far, far away.”From Our CriticsBerthe Morisot, “Eugène Manet on the Isle of Wight” (1875) (photo Bridget Quinn/Hyperallergic)Édouard Manet and Berthe Morisot Meet as EqualsAn exhibition sets out to rescue Morisot from the assumption that she was under Manet’s influence, but it's far from academic or revisionist. | Bridget QuinnIngrid Hernández Reveals Tijuana’s Hidden BeautyOften seen as too American to be Mexican, too Mexican to be American, the city is presented by the artist as it is, not as anyone assumes it might be. | Carolina A. MirandaEllen Harvey’s Elegy to Lost PlacesHer painting series is a record of those grand and mundane places lost to time or other occurrences, whose presence we continue to mourn. | Lori WaxmanThe African Diaspora Pictures ItselfA new exhibition rejects Western colonialism as a framework for understanding African aesthetic production. | Imani WilifordAtelier 17, a meeting point for European and American artists in New York (Fine Arts Museums of San Francisco, photo © Martin Harris)How Joan Miró and America Fell in Love“In the future world, America, with its energy and vitality, must play a leading role,” he told Matisse. | Lauren Moya FordFor Dyani White Hawk, Love Is an Act of ResistanceHer exhibition \"Love Language\" invites viewers into the vibrant cultural legacies of Native art, and connections to land, lineage, and community. | Sheila DickinsonMichelangelo and Titian’s Rivalry That May Never Have BeenWilliam E. Wallace openly uses what he calls “informed imagination” to explore the relationship between the two masters in his new study. | Olivia McEwanMarian Goodman in 2014 (photo by Thomas Struth, courtesy Marian Goodman Gallery)In MemoriamInfluential art dealer Marian Goodman, groundbreaking Korean modernist Chung Sang-hwa, and preservation architect John H. Beyer are among the community members we honor this week.Required ReadingAn 18-year-old painter in Gaza, Zohran’s documentarian, anti-ICE art sleds in Minnesota, the brilliance of “Heated Rivalry,” hidden reggaetón history, and more links from around the internet.Art Movements: The Brooklyn Museum's New Top Contemporary Art CuratorRobert Wiesenberger is the Brooklyn Museum’s new senior curator. Plus, the Newark Museum, Grey Art Museum, and the Clark Art Institute get new directors in our weekly roundup of industry news.A View From the EaselThis week, Sasha Lynn Roberts watches the sunrise as she paints in Pupukea, Hawaii, and Arleene Correa Valencia watches the sunset as she embroider canvas in Napa, California. Your studio could be next!\n                  \n                      \n                        Weekly Newsletter\n                      \n                      \n                        Newsletter\n                      \n                  \n        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Attention, Fascism Ahead",
      "image": [
        "/assets/images/news/default.jpg"
      ],
      "datePublished": "2026-01-31T11:00:56.000Z",
      "dateModified": "2026-01-31T11:00:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tribeca Galleries Discuss Reporting Street Vendors, Drawing Criticism",
    "url": "https://hyperallergic.com/tribeca-galleries-discuss-reporting-street-vendors-drawing-criticism/",
    "image": "https://hyperallergic.com/content/images/size/w1200/2026/01/DSC_1547.jpg",
    "tag": "Culture",
    "date": "2026-01-30T21:55:50.000Z",
    "description": "\n            Today, January 30, art galleries and cultural organizations across the country are shuttering in solidarity with immigrants amid violent ",
    "body": "\n            Today, January 30, art galleries and cultural organizations across the country are shuttering in solidarity with immigrants amid violent crackdowns. Many public gestures of support are unfolding in New York City, but two weeks ago, a group of Tribeca galleries met to discuss asking the city to address an influx of street vendors in the area, Hyperallergic learned. On January 15, months after federal agents descended on Canal Street in a targeted vendor raid, representatives for a group of galleries near Lower Manhattan’s Canal Street met at Alexander Gray Associates to discuss “safety” and “accessibility” issues associated with local street vendors on Broadway, according to communications obtained by Hyperallergic. An email sent to local galleries by a PPOW staff member tasked with taking notes for the meeting encouraged galleries to file complaints with 311 to “increase the likelihood of a response” from the city. Gallery representatives who attended, according to the email, discussed drafting a letter “asking for support” related to street vending, which would later be sent to city officials.“A few of us got together yesterday to initiate a conversation regarding the issues of safety and accessibility associated with the increased number of vendors on Broadway (and the surrounding area) and agreed that the best course of action is to address the city as a unified group,” the email said. When reached for comment, PPOW’s management told Hyperallergic that the gallery was not leading the effort, and that one of its employees attended a meeting at Alexander Gray Associates to take notes as a “courtesy.” PPOW denied calling 311 on vendors and disavowed the email’s suggestion that others do so. “An unapproved email with views that directly undermine our mandated values of the past four decades was sent out by one of our staff members to the Tribeca community,” PPOW directors Wendy Olsoff and Penny Pilkington said in a statement. “What is in line with PPOW’s values as a gallery is to acknowledge responsibility, learn from our mistakes, and collaborate with artists and community leaders to educate our staff and grow from this experience.”Olsoff and Pilkington said they plan to “bring in NYC vendor rights groups to teach us how to support migrant vendors outside our doors.”Street vendors, many of whom are recent arrivals from West Africa, sell bags, watches, and jewelry along Canal Street on December 1, 2025, in New York City. (photo by Spencer Platt/Getty Images)In the initial email circulated between the Tribeca galleries, they agreed to meet again on January 27, but a spokesperson for PPOW and Alexander Gray told Hyperallergic the meeting had been postponed. In response to a request for comment, Alexander Gray said that he had offered his namesake gallery as a meeting place “when some community members were looking for a space to meet.” “Over the past year, neighbors along lower Broadway have been discussing mobility challenges on the corridor,” Gray said in an email to Hyperallergic. “Increasingly, sidewalk congestion has made it difficult for individuals in wheelchairs, elderly residents, families with strollers, and others to navigate the area.” Gray said the gallery “oppose[s] ICE enforcement practices and any actions that harm immigrant communities.” Gray did not respond to a question about whether he had filed 311 complaints against the vendors.“The goal has been to help articulate shared concerns so that the city, which manages public sidewalks, can advise on equitable solutions that work for everyone, including vendors,” Gray said.According to a publicly available spreadsheet reviewed by Hyperallergic, 12 Tribeca galleries expressed interest in “joining the next meeting or signing the letter once it is ready.” Among those listed were Nino Mier Gallery, anonymous gallery, Marian Goodman, Andrew Edlin Gallery, Andrew Kreps Gallery, Asya Geisberg Gallery, DIMIN, Matthew Brown, Michael Lisi Contemporary Art, and Tara Downs. In response to Hyperallergic’s inquiries, representatives for Marian Goodman, anonymous, and Nino Mier galleries all said that while they listed their names to receive information about efforts, they had not taken action and did not necessarily support the suggested initiatives. After publication, Asya Geisberg told Hyperallergic that she had removed her gallery from the spreadsheet and that the gallery had not filed any complaints. Tara Downs said that “the meeting administrators added our name to the list, and we removed it,” and that “it does not reflect the gallery's outlook.”Hyperallergic has not yet heard back from the remaining galleries.Protesters marched against ICE on January 27, 2026 in Lower Manhattan. (photo Isa Farfan/Hyperallergic)According to a 2024 report from the nonprofit Immigrant Research Initiative, nearly all of New York City’s street vendors are immigrants, primarily from Mexico, Ecuador, Senegal, and Egypt. Undocumented immigrants are also more likely to sell food and general merchandise without the permits required by the city, the report said. Just a few months before gallery representatives met, ICE arrested nine immigrants from West Africa on Canal Street after a Turning Point USA influencer posted that undocumented vendors were allegedly selling counterfeit goods in the area. Since then, some migrant vendors, who rely on income from selling goods on the major thoroughfare to survive, have reported fearing future raids. At a municipal level, the New York City Police Department has also made arrests in the area following complaints of street congestion. Gray’s stated opposition to harmful enforcement practices echoes the position of the area’s City Council representative, District 1 Councilmember Christopher Marte, who has called for stricter enforcement of vending regulations on Canal Street but condemned ICE intervention. According to New York City's sanctuary city laws, police and city agencies are restricted from cooperating with federal immigration agencies. The primary agency enforcing vending regulations, the Department of Sanitation, does not collaborate with federal immigration agencies, a spokesperson told Hyperallergic. But even with sanctuary city laws in place, intervention by municipal agencies could lead to federal engagement, explained Mohamed Attia, managing director of the Street Vendor Project, which advocates for the rights of street vendors in New York City.Attia told Hyperallergic that NYPD still issues criminal tickets to vendors, placing them in danger of arrest — and possible ICE targeting — if they do not show up to their court date for any reason.“We talked to a lot of individual lawyers and confirmed that once you are arrested, you are in the system, all enforcement agencies across the nation will see your data and will have your information,” Attia said. While the NYPD hasn’t led street vendor enforcement since the beginning of the Adams administration, the agency has apparently responded to complaints about street congestion in Lower Manhattan, arresting vendors and confiscating goods. Multiple city departments, including the NYPD, can issue citations for vending violations, according to Attia. The Department of Sanitation has its own armed police force, indistinguishable in appearance from NYPD officers except for a badge, Attia noted. “It's really sad to see businesses attacking the street vendor community because the vendors are also small businesses,” Attia said in response to the news that galleries considered engaging the city to address increased vendor presence. News that galleries had met to discuss street vendors and city intervention outraged some in the arts community. Cindy Hwang, a member of the Lower Manhattan anti-gentrification group Art Against Displacement, told Hyperallergic that she wished businesses would consider alternative ways to address vendor-related issues.“There are so many ways to improve street life that don’t involve the NYPD, which actively facilitates federal immigration enforcement,” Hwang said.The artist duo Shanzhai Lyric traces the criminalization of street vendors to a 1930s crackdown led by Mayor Fiorello La Guardia. (photo Brad Farwell, courtesy Artists Alliance Inc.)Artists Ming Lin and Alex Tatarsky, co-founders of the art collective Shanzhai Lyric, are behind the conceptual project Canal Street Research Association, which explores the area’s immigrant-run street markets and interrogates ideas of property and authorship. During a panel discussion at Essex Market on Thursday, Lin and Tatarsky traced the criminalization of street vending to Mayor Fiorello LaGuardia’s “War on Pushcarts” in the 1930s, when LaGuardia declared unlicensed peddlers a risk to traffic and sanitation.“Street peddling has always been the art of those unable to own property, one of the few ways for folks with limited resources, often immigrants, to have some financial autonomy and the possibility of upward mobility without the exorbitant rent,” Tatarsky said. In a statement to Hyperallergic, Lin and Tatarsky described vendors on Canal Street as “excellent neighbors and great colleagues on the block.” “It really disgusts us that some galleries would complain of safety concerns when the vibrant, and yes, sometimes hectic, street markets are a beloved and long-standing part of the neighborhood ecosystem and character,” Lin and Tatarsky said. “This feels especially abhorrent at a moment when vendors currently face serious threats from both NYPD and ICE.”Even without city or police intervention, vendors face obstacles to obtaining permission to sell. New York City requires a general vendor license to sell certain non-food goods in public, and currently issues only 853 of these licenses to non-veterans. Despite the cap on licenses for non-veteran merchants, the Immigrant Research Initiative estimates that there are 2,400 such vendors operating throughout the city. Fines for operating without a license are steep, starting at $250 and increasing with each repeat violation. Shamier Settle, a senior policy analyst for the NYC-based Immigration Research Initiative, told Hyperallergic in an email that there is currently a long waiting list for vending licenses and that applicants must have Social Security or taxpayer identification numbers. On Thursday, City Council approved a bill to increase the vending license cap to 10,500 general vending permits by 2027, a measure previously vetoed by the Adams administration.Today, Friday, January 30, a number of galleries, including PPOW, Marian Goodman, and Pace, closed their doors in solidarity with a national anti-ICE economic shutdown. But galleries' participation in the strike, highly publicized on Instagram and elsewhere, raises questions about how arts organizations can effectively support local immigrant communities year-round.“It is a shame that so many art spaces capitalize on and claim to value the ‘gritty’ history and character of SoHo, Tribeca, and Chinatown while actively working to threaten the lives and livelihoods of the mostly immigrant vendors who make Canal Street such a special place,” Lin and Tatarsky said.Attia said he believed that if galleries voiced their concerns directly to vendors, some of their issues would be addressed. “I really hope that these galleries and these businesses reach out to the vendors, build up a relationship with them,” Attia said.Valentina Di Liscia contributed reporting.Editor's note 1/31/26 11:30am ET: This article was updated with a response from Asya Geisberg Gallery and Tara Downs.\n                  \n                      \n                        Features\n                      \n                      \n                        New York\n                      \n                      \n                        Tribeca\n                      \n                  \n        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tribeca Galleries Discuss Reporting Street Vendors, Drawing Criticism",
      "image": [
        "https://hyperallergic.com/content/images/size/w1200/2026/01/DSC_1547.jpg"
      ],
      "datePublished": "2026-01-30T21:55:50.000Z",
      "dateModified": "2026-01-30T21:55:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]