[
  {
    "title": "How to Jumpstart Your Creative Process with William S. Burroughs’ Cut-Up Technique",
    "url": "https://www.openculture.com/2025/12/jumpstart-your-creative-process-with-william-s-burroughs-cut-up-technique.html",
    "image": "https://cdn8.openculture.com/2025/12/28231548/Screenshot-2025-12-28-at-11.16.36-PM-1024x620.png",
    "tag": "Culture",
    "date": "2025-12-29T09:00:30.000Z",
    "description": "\n\t\t\t\n\n\t\n\nThe inner crit­ic cre­ates writer’s block and sti­fles adven­tur­ous writ­ing, hems it in with safe clichés and over­think­ing. Every writer ",
    "body": "\n\t\t\t\n\n\t\n\nThe inner crit­ic cre­ates writer’s block and sti­fles adven­tur­ous writ­ing, hems it in with safe clichés and over­think­ing. Every writer has to find his or her own way to get free of that sour­puss ratio­nal­ist who insists on stran­gling each thought with log­i­cal analy­sis and fit­ting each idea into an oppres­sive pre­de­ter­mined scheme or ide­ol­o­gy. William S. Bur­roughs, one of the most adven­tur­ous writ­ers to emerge from the mid-20th cen­tu­ry, famous­ly employed what he called the cut-up method.\nDevel­oped by Bur­roughs and painter Brion Gysin, this lit­er­ary take on the col­lage tech­nique used by avant-garde artists like Georges Braque orig­i­nat­ed with Sur­re­al­ist Tris­tan Tzara, who “pro­posed to cre­ate a poem on the spot by pulling words out of a hat.” The sug­ges­tion was so provoca­tive, Bur­roughs claims in his essay “The Cut-Up Method,” that cut-ups were there­after “ground­ed… on the Freudi­an couch.”\nSince Bur­roughs and Gysin’s lit­er­ary rede­ploy­ment of the method in 1959, it has proved use­ful not only for poets and nov­el­ists, but for song­writ­ers like David Bowie and Kurt Cobain. And any frus­trat­ed nov­el­ist, poet, or song­writer may use it to shake off the habit­u­al thought pat­terns that cage cre­ativ­i­ty or choke it off entire­ly. How so?\nWell, it’s best at this point to defer to the author­i­ty, Bur­roughs him­self, who explains the cut-up tech­nique thus:\nThe method is sim­ple. Here is one way to do it. Take a page. Like this page. Now cut down the mid­dle and cross the mid­dle. You have four sec­tions: 1 2 3 4 … one two three four. Now rearrange the sec­tions plac­ing sec­tion four with sec­tion one and sec­tion two with sec­tion three. And you have a new page. Some­times it says much the same thing. Some­times some­thing quite different–(cutting up polit­i­cal speech­es is an inter­est­ing exercise)–in any case you will find that it says some­thing and some­thing quite def­i­nite. Take any poet or writer you fan­cy. Here­say, or poems you have read over many times. The words have lost mean­ing and life through years of rep­e­ti­tion. Now take the poem and type out select­ed pas­sages. Fill a page with excerpts. Now cut the page. You have a new poem. As many poems as you like.\nBur­roughs gives us “one way” to do it. There may be infi­nite oth­ers, and it’s up to you to find what works. I myself have pushed through a cre­ative funk by mak­ing mon­tages from scraps of ancient poet­ry and phras­es of mod­ern pop, clichés ripped from the head­lines and eso­teric quotes from obscure reli­gious texts—pieced togeth­er more or less at ran­dom, then edit­ed to fit the form of a song, poem, or what­ev­er. Vir­tu­al cut-and-paste makes scis­sors unnec­es­sary, but the phys­i­cal act may pre­cip­i­tate epipha­nies. “Images shift sense under the scis­sors,” Bur­roughs writes; then he hints at a synes­the­sia expe­ri­ence: “smell images to sound sight to sound sound to kines­thet­ic.”\nWho is this method for? Every­one, Bur­roughs asserts. “Cuts ups are for every­one,” just as Tzara remarked that “poet­ry is for every­one.” No need to have estab­lished some exper­i­men­tal art world bona fides, or even call one­self an artist at all; the method is “exper­i­men­tal in the sense of being some­thing to do.” In the short video at the top, you can hear Bur­roughs explain the tech­nique fur­ther, adding his occult spin on things by not­ing that many cut-ups “seem to refer to future events.” On that account, we may sus­pend belief.\nAs Jen­nie Skerl notes in her essay on Bur­roughs, cut-up the­o­ry “par­al­lels avant-garde lit­er­ary the­o­ry” like Jacques Derrida’s Decon­struc­tion. “All writ­ing is in fact cut ups,” writes Bur­roughs, mean­ing not that all writ­ing is pieced togeth­er with scis­sors and glue, but that it’s all “a col­lage of words read heard over­heard.” This the­o­ry should lib­er­ate us from oner­ous notions of orig­i­nal­i­ty and authen­tic­i­ty, tied to ideas of the author as a sui gener­is, all-know­ing god and the text as an expres­sion of cos­mi­cal­ly ordered mean­ing. (Anoth­er sur­re­al­ist writ­ing method, the game of Exquis­ite Corpse, makes the point lit­er­al.) All that meta­phys­i­cal bag­gage weighs us down. Every­thing’s been done—both well and badly—before, Bur­roughs writes. Fol­low his meth­ods and his insis­tent cre­ative max­im and you can­not make a mistake—“Assume that the worst has hap­pened,” he writes, “and act accord­ing­ly.”\nNote: An ear­li­er ver­sion of this post appeared on our site in 2016.\nRelat­ed Con­tent:\nHow David Bowie, Kurt Cobain & Thom Yorke Write Songs With William Bur­roughs’ Cut-Up Tech­nique\nThe “Priest” They Called Him: A Dark Col­lab­o­ra­tion Between Kurt Cobain & William S. Bur­roughs\nHow William S. Bur­roughs Used the Cut-Up Tech­nique to Shut Down London’s First Espres­so Bar (1972)\nWhat Hap­pens When the Books in William S. Bur­roughs’ Per­son­al Library Get Artis­ti­cal­ly Arranged — with His Own “Cut-Up” Method\nHow Jim Jar­musch Gets Cre­ative Ideas from William S. Bur­roughs’ Cut-Up Method and Bri­an Eno’s Oblique Strate­gies\nJosh Jones is a writer and musi­cian based in Durham, NC. \n\t\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How to Jumpstart Your Creative Process with William S. Burroughs’ Cut-Up Technique",
      "image": [
        "https://cdn8.openculture.com/2025/12/28231548/Screenshot-2025-12-28-at-11.16.36-PM-1024x620.png"
      ],
      "datePublished": "2025-12-29T09:00:30.000Z",
      "dateModified": "2025-12-29T09:00:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How Far Back in History Can You Start to Understand English?",
    "url": "https://www.openculture.com/2025/12/how-far-back-in-history-can-you-start-to-understand-english.html",
    "image": "https://cdn8.openculture.com/2025/12/28225732/dec28-1024x683.png",
    "tag": "Culture",
    "date": "2025-12-29T10:01:47.000Z",
    "description": "\n\tin English Language, History, Language |   \tDecember 29th, 2025  3 Comments\n\t\n\t\t\t\n\n\t\n\nIt’s easy to imag­ine the myr­i­ad dif­fi­cul­ties with which ",
    "body": "\n\tin English Language, History, Language |   \tDecember 29th, 2025  3 Comments\n\t\n\t\t\t\n\n\t\n\nIt’s easy to imag­ine the myr­i­ad dif­fi­cul­ties with which you’d be faced if you were sud­den­ly trans­port­ed a mil­len­ni­um back in time. But if you’re a native (or even pro­fi­cient) Eng­lish speak­er in an Eng­lish-speak­ing part of the world, the lan­guage, at least, sure­ly would­n’t be a prob­lem. Or so you’d think, until your first encounter with utter­ances like “þat troe is daed on gaerde” or “þa rokes for­leten urne tun.” Both of those sen­tences appear in the new video above from Simon Rop­er, in which he deliv­ers a mono­logue begin­ning in the Eng­lish of the fifth cen­tu­ry and end­ing in the Eng­lish of the end of the last mil­len­ni­um.\nAn Eng­lish­man spe­cial­iz­ing in videos about lin­guis­tics and anthro­pol­o­gy, Rop­er has pulled off this sort of feat before: we pre­vi­ous­ly fea­tured him here on Open Cul­ture for his per­for­mance of a Lon­don accent as it evolved through 660 years.\nBut writ­ing and deliv­er­ing a mono­logue that works its way through a mil­len­ni­um and a half of change in the Eng­lish lan­guage is obvi­ous­ly a thornier endeav­or, not least because it involves lit­er­al thorns — the þ char­ac­ters, that is, used in the Old Eng­lish Latin alpha­bet. They’re pro­nounced like th, which you can hear when Rop­er speaks the sen­tences quot­ed ear­li­er, which trans­late to “The tree is dead in the yard” and “The rooks aban­doned our town.”\nThe word trans­late should give us pause, since we’re only talk­ing about Eng­lish. But then, Eng­lish has under­gone such a dra­mat­ic evo­lu­tion that, at far enough of a remove, we might as well be talk­ing about dif­fer­ent lan­guages. What Rop­er empha­sizes is that the changes did­n’t hap­pen sud­den­ly. Non-Scan­di­na­vian lis­ten­ers may lack even an inkling that his farmer of the year 450 is talk­ing about sheep and pigs with the words skēpu and swīnu, but his final lines, in which he speaks of pos­sess­ing “all the hot cof­fee I need” and “friends I did­n’t have in New York” in the year 2000, will pose no dif­fi­cul­ty to Anglo­phones any­where in the world. Even his list of agri­cul­tur­al wealth around the ear­ly thir­teenth cen­tu­ry — “We habben an god hus, we habben mani felds” — could make you believe that a trip 600 years in the past would be, as they said in Mid­dle Eng­lish, no trou­ble.\nRelat­ed Con­tent:\nTrac­ing Eng­lish Back to Its Old­est Known Ances­tor: An Intro­duc­tion to Pro­to-Indo-Euro­pean\nHear the Evo­lu­tion of the Lon­don Accent Over 660 Years: From 1346 to 2006\nWhat Shakespeare’s Eng­lish Sound­ed Like, and How We Know It\nWhere Did the Eng­lish Lan­guage Come From?: An Ani­mat­ed Intro­duc­tion\nA Brief Tour of British & Irish Accents: 14 Ways to Speak Eng­lish in 84 Sec­onds\nThe Entire His­to­ry of Eng­lish in 22 Min­utes\nBased in Seoul, Col­in Marshall writes and broad­casts on cities, lan­guage, and cul­ture. His projects include the Sub­stack newslet­ter Books on Cities and the book The State­less City: a Walk through 21st-Cen­tu­ry Los Ange­les. Fol­low him on the social net­work for­mer­ly known as Twit­ter at @colinmarshall.\n\t\t\n        \t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How Far Back in History Can You Start to Understand English?",
      "image": [
        "https://cdn8.openculture.com/2025/12/28225732/dec28-1024x683.png"
      ],
      "datePublished": "2025-12-29T10:01:47.000Z",
      "dateModified": "2025-12-29T10:01:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Our Favorite Stories of 2025",
    "url": "https://www.thisiscolossal.com/2025/12/our-favorite-stories-of-2025/",
    "image": "https://www.thisiscolossal.com/wp-content/uploads/2025/03/oskar-1.gif",
    "tag": "Culture",
    "date": "2025-12-29T15:52:51.000Z",
    "description": "\n\n\t\nAs we reflect on 2025, we’re taking a peek into our archive to spotlight some of the stories we’re still thinking about. It’s a joy and a privileg",
    "body": "\n\n\t\nAs we reflect on 2025, we’re taking a peek into our archive to spotlight some of the stories we’re still thinking about. It’s a joy and a privilege to share so much creativity with you each day, and we’re grateful to know you’re out there reading. \nIn case you missed it, check out our favorite art books of the year. \n—Christopher, Grace, Kate, and Jackie\n“Bosch Beast No. 14” (2025), paper, paperboard, glue, wire, and crepe paper, 33 × 19 × 14 inches\nUncanny Papier-Mâché Creatures by Roberto Benavidez Mingle in ‘Bosch Beasts’\nFor Los Angeles-based artist Roberto Benavidez, the art of the piñata is a central tenet of a practice exploring intersecting themes of race, sexuality, humor, sin, and beauty. He draws upon the paper art form’s early religious significance in Mexico, when Spanish missionaries used a seven-pointed version as a tool for converting Indigenous people to Christianity. This motif, which appears in some of Benavidez’s distinctive sculptures, nods to its past colonial use.\n© Marcel Heijnen\nMarcel Heijnen Captures Loving Portraits of Feisty, Feral Felines in ‘City Cats of Istanbul’\nIn some parts of the world, stray animals are nearly as beloved as pets. Thousands of dogs roam the streets of Cusco, Peru, for example, and cats pretty much rule the night in places like Athens, Valletta, and Japan’s “cat islands.” Residents often feed and provide shelter for these roving colonies, and for Dutch photographer Marcel Heijnen, this human-animal connection provides endless opportunities to experience urban centers.\nFrom a performance by the Bavarian Junior Ballet\nEnjoy the Brilliant Ballet that Brought Dance to the Bauhaus Movement\nGiven the emphasis on functionality and design for industrial production, the Bauhaus movement is rarely associated with disciplines like dance. But for Oskar Schlemmer (1888-1943), translating its principles into movement and performance was as compelling as a well-conceived chair or building.\nBasket stars, a type of echinoderm, are abundant on seamounts and rocky outcroppings\nAmong Newly Discovered Ocean Species, a Baby Colossal Squid Is Filmed for the First Time\nAn archipelago in the South Atlantic known as the South Sandwich Islands is home to some of the most remote landmasses in the world. Uninhabited except for occasional scientific research, their volcanic makeup highlights the geological and ecological diversity of this part of the world, and we still have much to learn. In 2025, Schmidt Ocean Institute completed a 35-day trek on the Falkor (too) to the remote island chain and discovered new hydrothermal vents, coral gardens, and what researchers suspect to be entirely new species. During this expedition, the team also confirmed the sighting of a juvenile colossal squid, capturing one on film for the first time.\nFrance Leclerc, “Head Ball”\nBlink and You’d Miss the Moments Topping This Year’s Pure Street Photography Awards\nCoincidence is around every corner, and immortalizing a split second of fleeting chaos takes a special eye. Since 2020, Pure Street Photography—an initiative focused on connecting international photographers—has commended visual storytellers through an annual competition.\nLeft: Nick Cave and Bob Faust, “Wallwork,” (2024), wall vinyl, 157 x 367 1/4 inches. Right: Nick Cave, “A·mal·gam” (2021), bronze, 122 x 94 x 85 inches\nNick Cave’s Nearly 26-Foot Bronze Stands for Resistance Amid Oppression\nWhether weaving plastic pony beads into a monumental sculpture, adorning figures with mother-of-pearl buttons, or mosaicing ceramic tile across a New York subway station, Nick Cave has continually returned to one question: how does this material help bring people into the work?\nAlice Austen, “The Darned Club, October 29, 1891” \nMore than 7,500 Prints and Negatives by Trailblazing Photographer Alice Austen Return Home\nWith its panoramic views of New York Harbor, the house that trailblazing photographer Alice Austen (1866-1952) called home for most of her life is a sprawling, two-story, elegant Victorian Gothic waterfront property known as Clear Comfort. From here, she captured thousands of incredible photographs throughout her lifetime. In 2025, the entire archive of Austen’s photos returned to Clear Comfort after being held by a local historical society, thanks to a landmark acquisition.\nStephanie H. Shih, “Nuclear Family” (2024). Photo by Robert Bredvad\nThrough Ceramics, Stephanie Shih Considers the Disillusioning Price of Domestic Bliss\nNothing says true love like arguing about who left the cap off the toothpaste, right? From a darkly comedic perspective, Stephanie Shih explores the multiple meanings of “domestic bliss” in a social landscape fraught with consumerism and clashing politics.\nInstallation view of ‘Yuji Agematsu: 2023-2024’, 101 Spring Street, Judd Foundation, New York. Photo by Timothy Doyon, © Judd Foundation\nYuji Agematsu Arranges Street Debris into Tiny Daily Sculptures\nEach day, Yuji Agematsu takes a walk for the explicit purpose of scouring the streets. The dried leaf, lost toy, and even the wad of gum discarded on a park bench are his treasures, which he retrieves and places in the clear cellophane that wraps a pack of cigarettes. Although Agematsu no longer smokes, this habit of wandering and collecting has been harder to break: he’s been committed to it since 1996.\n“The Minotaur Room”\nNear Liverpool, a One-of-a-Kind Art Environment by Ron Gittins Is Saved\nBehind the unassuming red brick facade of a gable-roofed flat in Birkenhead, England, sits a home like no other. The only clue passersby would have had, until recently, was a pair of hand-sculpted figurative columns that flanked the wooden front door. But to step inside this corner flat near Liverpool is to be transported into the imaginative world of Ron Gittins.\n© Yuge Zhou, courtesy of Times Square Arts\nAcross 92 Screens in Times Square, Yuge Zhou’s ‘Trampoline Color Exercise’ Celebrates Global Unity\nSpanning a gridded background of rectangular, pink trampolines, hundreds of gymnasts mesmerizingly flip and twist, shapeshifting as they tuck and tumble. “Trampoline Color Exercise,” a monumental digital video collage installation by Chicago-based artist Yuge Zhou, takes a bird’s-eye view of athletes at peak form while abstracting their bodies and movements into undulating ripples of color.\n\t\n\t\n\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Our Favorite Stories of 2025",
      "image": [
        "https://www.thisiscolossal.com/wp-content/uploads/2025/03/oskar-1.gif"
      ],
      "datePublished": "2025-12-29T15:52:51.000Z",
      "dateModified": "2025-12-29T15:52:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "A Year of Elevating LGBTQ+ Artists",
    "url": "https://hyperallergic.com/a-year-of-elevating-lgbtq-artists/",
    "image": "https://hyperallergic.com/content/images/size/w1200/2025/12/31411_Ed-13-50_01-ep--1-.jpg",
    "tag": "Culture",
    "date": "2025-12-29T11:00:07.000Z",
    "description": "\n\t\t\t\t\t\tThis past summer, Participant Inc., a Lower East Side art nonprofit, hosted an exhibition on Chloe Dzubilo, a trans woman who became an AIDS ac",
    "body": "\n\t\t\t\t\t\tThis past summer, Participant Inc., a Lower East Side art nonprofit, hosted an exhibition on Chloe Dzubilo, a trans woman who became an AIDS activist after contracting the disease. The show, curated by Alex Fleming and Nia Nottage, was immensely rich and important for both its historical and personal insights into the artist’s life. Through text-based works and drawings, the artist painted an intimate and sometimes painful picture of her experience living in subsidized housing for people with AIDS and discrimination at the hands of medical professionals. I reviewed the show with the hope that it would strike a nerve with readers from all walks of life who have experienced subpar healthcare, housing instability, and personal strife.It was one of a handful of New York shows this year that centered art by or about trans and gender-nonconforming people. At a moment when basic freedoms and legal protections for people who fall under the trans umbrella — even the right to be recognized — are being stripped away by the Trump administration, it’s encouraging to see some art institutions platforming artists such as Dzubilo. The art world’s support of work by or about trans and gender-nonconforming people seems to fly under the radar more than its support of many other marginalized groups. Last fall, I was able to sit in on a private conversation between two prominent artists I admire. Both identify as nonbinary and they discussed how, even in liberal circles, gender identity is often dismissed as a non-issue. Listening to them, I realized how true this often is in art and culture more broadly. I’m privileged to be in a position to help change this. This year I was grateful to raise the profile of some trans and nonbinary artists in my role as an editor and writer, and maybe to prompt some of the myriad conversations that can come out of their art.  The experiences that most stood out to me as an art critic and editor this year were those that brought attention to some of these exhibitions. In addition to my review of Dzubilo’s show, I was able to cover another historically significant show, Dueñas de la Noche: Trans Lives and Dreams in 1980s Caracas at the Institute for Studies on Latin American Art. Alexis Clements wrote about The Met’s Casa Susanna, while Emma Cieslik covered Spectrum of Desire: Love, Sex, and Gender in the Middle Ages at The Met Cloisters. Another great read is my colleague Lisa Yin Zhang’s review of Nayland Blake’s work at Matthew Marks Gallery. Through their writings, visual art, and performance, Blake has been a guiding light to LGBTQ+ artists (and others) for decades. Vaginal Davis, a pioneering LGBTQ+ artist whose work ranging from sculpture to punk music was the subject of a major survey at MoMA PS1, was covered here by Daniel Larkin.John Yau’s review of nonbinary artist Xingzi Gu’s paintings of androgynous figures illuminated the process and concepts behind the ethereal artworks. More pointed in their statements about identity but just as dreamlike was Hortensia Mi Kafchin’s recent show at PPOW Gallery, reviewed here by Cat Dawson, and Young Joon Kwak’s sparkling sculptures at the Leslie-Lohman Museum, reviewed by AX Mina.One of the year’s highlights was Tate Modern’s thorough and thoroughly compelling retrospective of Leigh Bowery, reviewed by Olivia McEwan. Bowery identified as a gay man, but his performances and handmade costumes, created amid 1980s London’s dazzling art underground, push gender-bending to new heights of complexity.Our writers covered plenty of other great shows this year, too: Aruna D’Souza’s incisive assessment of Duane Linklater at Dia Chelsea, Lori Waxman’s empathetic discussion of Chicago’s Red Line Service, a nonprofit that assists unhoused people, Carolina A. Miranda’s report on Chile’s 1980s punk underground, and Claudia Ross’s review of Burn Me at The Box in Los Angeles, which featured art and artists impacted by LA’s January fires. And I can’t sign off for the year without mentioning an exhibition that blew me away: Nathalie Djurberg and Hans Berg’s Only for the Wicked at Tanya Bonakdar Gallery was gorgeous and devastating.On a different note, make sure to read Senior Editor Valentina Di Liscia’s list of artworks that spoke truth to power in 2025. You can help raise the profile of artists facing adversity and changing the world for the better, too, by becoming a paying Hyperallergic Member. As we transition into 2026, let's look toward hope and community. Happy New Year.—Natalie Haddad, reviews editorA visitor with Amy Sherald's painting “Trans Forming Liberty\" (2024) at the Whitney Museum of American Art (photo Hrag Vartanian/Hyperallergic)10 Artworks That Spoke Truth to Power in 2025From public murals to museum walls, artists mobilized their practices to call out injustices, expose wrongdoing, and advocate for a better world.My 2025 PicksDave Swindells, \"Marc Vaultier, Leigh Bowery and Fat Tony at Jungle, August 1985,\" detail (1985) in Leigh Bowery! at Tate Modern (photo Natalie Haddad/Hyperallergic)Leigh Bowery Was His Own ArtworkIn a contemporary society made creatively bland by the homogenizing factor of social media, one yearns again for such an original artist. | Olivia McEwan Casa Susanna Is a Glimpse Into a Midcentury Refuge for Trans WomenAs exciting as it is to see snapshots of this community, it’s just a tiny taste of the vast and long-standing history of trans people around the globe. | Alexis ClementsFor Chloe Dzubilo, Art and Advocacy Were InseparableAs an HIV-positive trans woman and advocate, Dzubilo faced challenges that should have been history by the early 2000s, yet persist today. | Natalie HaddadVaginal Davis Is Queercore's Fairy GodmotherFor the gender-bending artist, size matters — just not in the way you think, suggests a new survey at MoMA PS1. | Daniel LarkinFor Duane Linklater, It’s a Buffalo’s WorldThe Omaskêko Cree artist ties the well-being of the animals to that of the Indigenous people with whom they have long lived symbiotically — not in nostalgic terms, but in futurist ones. | Aruna D'SouzaNayland Blake’s Dark Joke Is On YouThe artist has perfected a register that is laugh-out-loud funny or absurd, rigorously conceptual, and erotic, edged with simmering rage. | Lisa Yin ZhangNathalie Djurberg and Hans Berg’s Fairytales With No HeroesThe pair tell a grand drama of depravity and degradation, sometimes enacted by official powers like Church and State, other times by rogue players. | Natalie Haddad\n\t\t\t\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "A Year of Elevating LGBTQ+ Artists",
      "image": [
        "https://hyperallergic.com/content/images/size/w1200/2025/12/31411_Ed-13-50_01-ep--1-.jpg"
      ],
      "datePublished": "2025-12-29T11:00:07.000Z",
      "dateModified": "2025-12-29T11:00:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cinema Icon Brigitte Bardot Dies, Olfactory Art Shines in Germany, Controversy at Imperial War Museum, and More: Morning Links for December 29, 2026",
    "url": "https://www.artnews.com/art-news/news/cinema-icon-brigitte-bardot-dies-olfactory-art-shines-in-germany-controversy-at-imperial-war-museum-and-more-morning-links-for-december-29-2026-1234768207/",
    "image": "https://www.artnews.com/wp-content/uploads/2025/12/GettyImages-850920926.jpg?w=1024",
    "tag": "Culture",
    "date": "2025-12-29T15:53:33.000Z",
    "description": "\n\tTo receive Morning Links in your inbox every weekday, sign up for our Breakfast with ARTnews newsletter.\n\t\n\t\tThe Headlines\t\n\n\tSTITCHED UP. UK minist",
    "body": "\n\tTo receive Morning Links in your inbox every weekday, sign up for our Breakfast with ARTnews newsletter.\n\t\n\t\tThe Headlines\t\n\n\tSTITCHED UP. UK ministers will underwrite up to £800 million ($1 billion) of potential damage to the Bayeux Tapestry during its loan to the British Museum next year, making the British taxpayer the ultimate guarantor, the Financial Times reported. The indemnity values the 230-foot-long, nearly 1,000-year-old embroidery at more than twice the price paid for the most expensive artwork ever sold at auction, Leonardo da Vinci’s Salvator Mundi, which sold for $450 million in 2017. The loan was agreed during President Emmanuel Macron’s state visit to the UK earlier this year, and the show is expected to be the British Museum’s largest-ever. Government backing is required because private insurance would be prohibitively expensive, ministers said. Some conservators have criticized the decision to move the fragile tapestry from Bayeux, fearing damage during transport. The tapestry will travel by truck through the Channel Tunnel and remain in London until July 2027, while its home museum undergoes renovation. In exchange, British treasures such as the Sutton Hoo artifacts will be loaned to France.\n\t\n\n\t\n\t\tRelated Articles\n\t\n\n\n\t LGBTQ+  IN TIMES OF CONFLICT. London’s Imperial War Museum has been accused of sidelining Victoria Cross recipients in favor of highlighting transgender and wider LGBTQ+ history, the Telegraph reported. Its upper floor previously housed the world’s largest public display of Victoria Cross medals, Britain’s highest military honor, on loan from Lord Ashcroft. Earlier this year, however, the museum closed the gallery and returned the medals, prompting criticism that curators were shifting priorities. The museum has since launched a virtual, self-guided trail titled “Refracted Histories: Exploring LGBTQ+ Stories in Times of Conflict,” which examines LGBTQ+ experiences during wartime. Lord Ashcroft, who donated £5 million ($6.7 million) to open the gallery in 2010, said he was not warned of its closure and described the decision as “beyond parody.” \n\t\n\t\tThe Digest\t\n\n\tTwo exhibitions in Germany are showing olfaction’s growing presence in the art world, with Artnet News asking, “Is smell the next big thing in art?” [Artnet News]\n\t\n\n\tThe Natural History Museum, one of London’s oldest museums, is planning to open two spaces, one of which has been closed to the public since World War II. [Time Out]\n\n\tHere’s a look at the art fairs slated for 2026, with the Gulf taking center stage. [The Art Newspaper]\n\t\n\t\tThe Kicker\t\n\n\tVACATED, THEN CURATED. Ireland has reportedly turned the former Israeli embassy in Dublin into a museum for Palestine. Israel closed its embassy in Ireland in December last year due to what its foreign minister called “the extreme anti-Israel policies of the Irish government.” The closure came after Ireland announcement its support for South Africa‘s legal action against Israel in the International Court of Justice (ICJ), accusing the country of “genocide” during the ongoing war in Gaza. Palestinian American entrepreneur and art curator Faisal Saleh, who founded the Palestine Museum US in Connecticut in 2018 to showcase Palestinian art and highlight Palestinian struggles, is behind the new museum. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cinema Icon Brigitte Bardot Dies, Olfactory Art Shines in Germany, Controversy at Imperial War Museum, and More: Morning Links for December 29, 2026",
      "image": [
        "https://www.artnews.com/wp-content/uploads/2025/12/GettyImages-850920926.jpg?w=1024"
      ],
      "datePublished": "2025-12-29T15:53:33.000Z",
      "dateModified": "2025-12-29T15:53:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "British Taxpayers to Underwrite $1 Billion Loan to Cover Bayeux Tapestry in the UK",
    "url": "https://www.artnews.com/art-news/news/british-taxpayers-to-underwrite-1-billion-loan-to-cover-bayeux-tapestry-while-its-shown-in-the-uk-1234768203/",
    "image": "https://www.artnews.com/wp-content/uploads/2025/07/Bayeux-Tapestry-Bayeux-Museum-1.jpg?w=1200",
    "tag": "Culture",
    "date": "2025-12-29T12:35:28.000Z",
    "description": "\n\tFrance’s Bayeux Tapestry is set to be covered by a UK Treasury guarantee of around £800 million ($1 billion) when it goes on loan to the British Mus",
    "body": "\n\tFrance’s Bayeux Tapestry is set to be covered by a UK Treasury guarantee of around £800 million ($1 billion) when it goes on loan to the British Museum in 2026.\n\n\tThat means British taxpayers will ultimately foot the bill to protect the 230-foot-long tapestry against damage or loss during its journey from France to the UK. It’s part of the UK government’s indemnity scheme, which acts as the insurer instead of paying for commercial insurance. However, nothing will be paid upfront; the £800 million is a contingent liability, only coming into play if something goes wrong.\n\t\n\n\t\n\t\tRelated Articles\n\t\n\n\n\tThe Treasury says the scheme has already saved UK museums about £81 million and has covered loans such as Vincent van Gogh’s The Bedroom (1888) at the National Gallery in 2024-25.\n\n\tUK ministers believe the risk of damage to the tapestry is very low, thanks to strict transport and display measures. The Treasury told the Financial Times it had “received an estimated valuation” of the tapestry, which has been “provisionally approved.” Sources expect the final figure to be roughly £800 million. While the Treasury didn’t dispute that, it refused to comment on the exact valuation.\n\n\tBefore the indemnity can go ahead, it needs approval from chancellor Rachel Reeves. It’s part of a broader cultural agreement between Britain and France, announced by President Emmanuel Macron during his state visit to London in July.\n\n\tNot everyone is happy about moving the nearly 1,000-year-old wool embroidery, though; some figures in the French art world are worried it could be damaged on the way to the UK.\n\n\tA recently released six-page agreement between the British and French culture ministries lays out exactly how the tapestry will travel and be displayed. It’s described as a “fragile and degraded thousand-year-old textile” and must be transported in a specially designed crate and displayed behind a protective screen. France will also oversee a trial run of the transfer using a replica fitted with vibration-monitoring equipment. Officials expect the tapestry to travel by truck via the Channel Tunnel.\n\n\tOnce it’s in London, the British Museum will take care of it until July 2027 and will fund a condition report when it goes back to Bayeux. George Osborne, former chancellor and now British Museum chair, has called it potentially “the blockbuster show of our generation,” comparing it to the Tutankhamun exhibition of 1972.\n\t\n\n\tThe tapestry, thought to have been made in 11th-century England, possibly by nuns, tells the story of the Norman invasion of 1066 in a comic-strip style. The museum expects the exhibition to generate plenty of merchandising revenue.\n\n\tThe loan will also coincide with restoration work at Bayeux. As part of the deal, British artifacts, including the Sutton Hoo treasures, will be sent to museums in Normandy in exchange.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "British Taxpayers to Underwrite $1 Billion Loan to Cover Bayeux Tapestry in the UK",
      "image": [
        "https://www.artnews.com/wp-content/uploads/2025/07/Bayeux-Tapestry-Bayeux-Museum-1.jpg?w=1200"
      ],
      "datePublished": "2025-12-29T12:35:28.000Z",
      "dateModified": "2025-12-29T12:35:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "In 2025, Censorship and Firings Defined a Fractured Art World",
    "url": "https://www.artnews.com/art-news/news/art-world-censorship-2025-smithsonian-trump-whitney-isp-1234767305/",
    "image": "https://www.artnews.com/wp-content/uploads/2025/08/GettyImages-2208842688.jpg?w=1200",
    "tag": "Culture",
    "date": "2025-12-29T10:00:00.000Z",
    "description": "\n\tIn its 2024 Year-in-Review, ARTnews noted a widening schism in the art world, defined by a moral fault: the continued support of Israel amid the des",
    "body": "\n\tIn its 2024 Year-in-Review, ARTnews noted a widening schism in the art world, defined by a moral fault: the continued support of Israel amid the destruction of Gaza. A year later—and more than three years into what a UN commission of inquiry determined this fall to be a genocide against Palestinians in the Gaza Strip—artists, critics, museums, gallerists, and audiences remain divided over what has become the ethical litmus test of our lifetimes. This year, that divide has shaped not just discourse but practice, determining exhibits, funding, and, in turn, what stories cultural institutions choose to tell. \n\t\n\n\t\n\t\tRelated Articles\n\t\n\n\n\tThis rolling censorship crisis was further amplified in 2025 by Donald Trump’s return to the White House. His tenure so far appears like a successful second act of the marquee mission of his first presidency: The ideological overhaul of the United States’ arts and cultural landscape. Leveraging a brazen expansion of presidential power, Trump and his team have targeted museum leaders and aesthetic movements while undermining the federal government’s grant-making capabilities—leaving the local organizations that form the bedrocks of American arts floundering for funds or permanently shuttered. \n\n\tAs the year progressed, the civil struggle for America’s ideals reverberated abroad: art workers versus authoritarian intervention; institutions enforcing a controversial definition of dissidence; and an unusually politicized selection process for the forthcoming Venice Biennale. This year may go down as the dawn of a dark age for artistic expression—though artists, as ever, will insist on the light. \n\n\tBelow are several episodes of censorship and defiance that made headlines in the art world this year. \n\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\tThe Smithsonian Institution.\n\t\t\t\t\t\t\t\t\tPhoto Alex Wroblewski/AFP via Getty Images\n\t\n\n\n\t\n\t\tTrump Versus the Smithsonian\t\n\n\tIn 2025, Trump opened war on the Smithsonian Institution, the consortium of Washington, D.C. museums and archives that includes the National Museum of American History, the National Portrait Gallery, the National Museum of the American Indian, and the National Museum of African American History and Culture. After retaking office in January, Trump issued an executive order intended to combat what an accompanying fact sheet called “anti-American ideology” at the Smithsonian, whose network was already in the process of disbanding its diversity offices when the order was signed. \n\t\n\n\tThe Smithsonian is not a federal agency, and as such is not under direct White House purview, however federal funding comprises nearly two-thirds of its $1 billion annual budget. Additionally, its Board of Regents includes the Chief Justice of the United States, the Vice President, three Senators, three US Representatives, and nine citizens, making it vulnerable to government overreach. \n\n\tAnd indeed, it became obvious just how vulnerable the Smithsonian really was. In May, Trump said he fired Kim Sajet, director of the Smithsonian’s National Portrait Gallery, moving legal experts to question whether he had the power to make that call. Sajet then clarified in a public statement that she would depart the post she had held since 2013, closing the confusing and concerning chapter.\n\n\tJD Vance, the Vice President, had by this point already been deputized by Trump to ensure that “future appropriations” continue to flow from Congress to the Smithsonian, and by the summer, an internal review of the Smithsonian was opened. Under this directive, every aspect of the Smithsonian’s programming—including its didactics, the art itself, and grants awarded to artists—were judged to see if they aligned with the new values outlined by the executive order, which spoke of a “divisive, race-centered ideology” at the Smithsonian. \n\t\n\n\tIn response, Smithsonian leadership publicly reiterated the network’s nonpartisanship and independence, however critics alleged that the overhaul was already underway. The National Museum of American History, for example, was scrutinized for editing Trump’s two impeachments out of its related display. That institution subsequently put that display back on view—with altered text, echoing an earlier incident in which content on African American history was temporarily removed from government websites. \n\n\tDoubling down on its directive, the White House website published a list of artworks and shows that did not match the administration’s values, such as one exploring sculpture as a signifier of power at the Smithsonian American Art Museum. The National Museum of African American History and Culture language regarding “white dominant culture,” already denounced in the executive order, was again blasted. \n\t\n\t\tArtists Take a Stand Against Federal Overreach at the Smithsonian\t\n\n\tMounting concerns of government overreach at the Smithsonian erupted in July when Amy Sherald, the painter who skyrocketed to fame with her 2018 portrait of Michelle Obama, canceled her exhibition set to open this fall at the Smithsonian’s National Portrait Gallery, where it would’ve been the first solo presentation by a Black contemporary artist at the institution. Sherald said she made her decision after she learned that her painting of a Black transgender Statue of Liberty might be removed from the show in a bid by Smithsonian leadership to avoid President Trump’s ire. (The painting had appeared in previous versions of the show at other museums, and went on to feature on the cover of the New Yorker.)\n\t\n\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\tAmy Sherald, Trans Forming Liberty, 2024.\n\t\t\t\t\t\t\t\t\tKevin Bulluck/©Amy Sherald/Courtesy the artist and Hauser & Wirth\n\t\n\n\n\n\t“When governments police museums, they are not simply policing exhibitions,” Sherald wrote in a MSNBC op-ed. “They are policing imagination itself.” Her protest appears to have moved other artists to act similarly.\n\n\tIn September, another controversy hit the Smithsonian when artist Nicholas Galanin withdrew from a symposium related to “The Shape of Power: Stories of Race and American Sculpture,” an exhibition at the Smithsonian American Art Museum that Trump denounced for promoting “the view that race is not a biological reality but a social construct,” a view confirmed by modern science. Galanin was to speak at the Smithsonian American Art Museum on Saturday as part of a two-day symposium, an event not publicly listed on the Smithsonian’s website at the time of its occurrence. \n\n\t“The decision to make the symposium a private event with a curated guest list and request that we not record or share it on social media effectively censors those of us who would be participating,” Galanin wrote at the time. A Smithsonian American Art Museum spokesperson denied any censorship.\n\t\n\t\tThe Whitney’s Storied ISP Program Shutters Over Pro-Palestine Performance\t\n\n\tNext to the Smithsonian, no American museum weathered a greater political storm in 2025 than the Whitney Museum in New York, which canceled a pro-Palestine performance planned as part of the Whitney’s 2025 Independent Study Program in May, then went on in June to dismiss Sara Nadal-Melsió, the program’s associate director since 2024. (Artist and writer Gregg Bordowitz had already been demoted to the status of director-at-large at the ISP, though the circumstances of that shift remain unclear.) \n\t\n\n\tAccording to a statement posted to Instagram from Nadal-Melsió, the performance, titled No Aesthetic Outside My Freedom: Mourning, Militancy, and Performance and conceived by  Fadl Fakhouri, Noel Maghathe, and Fargo Tbakhi, was canceled by the Whitney Museum after its leadership viewed a recording of its initial presentation at the Poetry Project. Originally commissioned by the leftist Jewish magazine Jewish Currents, the performance was preceded by a request that attendees only remain in the audience if they “love Palestinians wholly and completely.” Viewers should leave if they “believe in Israel in any incarnation,” they were told. According to the artists, the Whitney version did not include this call to action.\n\n\tThe Whitney said in May that its decision to cancel the performance was “clear and necessary.” Many disagreed. ISP curators and artists publicly protested the cancelation, and in July, more than 100 artists and scholars, including Emily Jacir, Hans Haacke, and Michael Rakowitz, signed an open letter in support of Nadal-Melsió, whose position was eliminated. “Her dismissal is one act of patriarchal institutional violence among many, yet another symptom of the entangled violences that suffuses the present climate of suppression in the United States,” the letter reads. Its signatories also reiterated a request from the Artists at Risk Connection (ARC) for the museum to “convene an independent investigation into the termination of the ISP’s Associate Director and its implications for academic and artistic freedoms at the museum.”\n\t\n\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\tPro-Palestine demonstrators occupying the Whitney Museum lobby on May 23. \n\t\t\t\t\t\t\t\t\tTessa Solomon/ARTnews\n\t\n\n\n\n\tNadal-Melsió also spoke openly on the matter, publishing her own letter in which she said that the ISP “has always been unapologetically engaged with the politics of its times,” noting that participants were currently addressing “fascism at home and the relentless genocide being carried out in Gaza.” Now, she wrote, “we also face unprecedented censorship and a threat to our foundational independence because of our pursuit of the very dialogue that makes the ISP what it is.”\n\t\n\t\tSally Mann Warns of Censorship After Police Raid in Texas \t\n\n\tThe conservative campaign against the arts reached Texas at the start of 2025, when a selection of photographs by Sally Mann in a group exhibition at the Modern Art Museum of Fort Worth was seized by police on suspicion of child pornography. The controversy surrounded images of her rural Lexington, Virginia, home taken in the 1990s that featured her nude, underage children. The images are not sexual, however they have been characterized by conservative critics over the years as “child porn.” \n\n\tScrutiny escalated into action later in January, when Fort Worth police raided the exhibition on the basis of an investigation into the images, exacerbating tensions around freedom of artistic expression in Texas. The incident was explicitly referenced in relation to a bill proposed that April that would introduce civil penalties up to $500,000 against any museum showing “certain obscene or harmful material.” (The Texas Penal Code defines “obscene” as any kind of performance or material that depicts sexual acts without literary, artistic, political, or scientific value.)\n\t\n\n\tThe Fort Worth Police Department ultimately returned the contested photographs to Sally Mann’s gallery, Gagosian, following an investigation that cost the state nearly $7,000. Speaking later to NPR, Mann said: “We’re entering a new era of culture wars, I’m quite sure. And I think the people who are pursuing this are much more sophisticated and have many more tools at hand.” She suggested social media as one such tool.\n\t\n\t\tAustralia’s Venice Biennale Pick Is Dropped, Then Reinstated\t\n\n\tAt the world’s premier international art event, when scores of curators, collectors, and journalists descend on the lagoon city, every aspect of the artist chosen to represent a national pavilion—their identity, past accolades, and practice—becomes a proxy for the aesthetics and ideals a nation values at that moment in its history. This dynamic was illustrated with damning clarity in the case of Lebanese-born artist Khaled Sabsabi and curator Michael Dagostino, who were selected to helm Australia’s 2026 Venice Biennale pavilion, only to have the appointment abruptly rescinded by Creative Australia, the organization that makes the Australian Pavilion in Venice possible. Although the pair was ultimately reinstated, the episode spurred multiple resignations at Creative Australia, one of the largest funding bodies in the art world, and deepened fears that artists perceived as critical of Israel are subject to censorship.\n\t\n\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\tCurator Michael Dagostino and artist Khaled Sabsabi.\n\t\t\t\t\t\t\t\t\tAnna Kucera\n\t\n\n\n\n\tThe controversy began in February, just days after Creative Australia announced Sabsabi’s selection. A column in the Australian labeled the pavilion a “creative approach to racism,” singling out You, Sabsabi’s 2007 video installation that includes manipulated footage of Hezbollah leader Hassan Nasrallah addressing a crowd after the 2006 Lebanon-Israel war. The article also accused Sabsabi and Dagostino of having “favored boycotts of Israel,” a reference to Sabsabi’s 2022 Sydney Festival withdrawal over its Israeli government sponsorship. Days later, the board of Creative Australia unanimously reversed their selection, citing the risk of a “prolonged and divisive debate.”\n\n\tThe fallout was swift, with senior Creative Australia staffers Mikala Tai and Tahmina Maskinyar resigning in protest. Simon Mordant, formerly the international ambassador for the Australian Pavilion and a major cultural philanthropist, later tendered his own resignation, describing the situation as “a very dark day for Australia and the arts.” Artists and institutions also rallied behind Sabsabi, including Palestinian artist Emily Jacir, a former Golden Lion winner at the Biennale. “Shame on Creative Australia,” Jacir wrote on Instagram. The five shortlisted candidates for the pavilion issued an open letter demanding Sabsabi’s reinstatement. \n\t\n\n\tAmid this outpouring of support, Sabsabi told the Guardian that Creative Australia’s sudden reversal was “dismantling” his career. “Nobody should have to go through this torture,” he added. Then, on July 2, following an independent review and months of backlash, Creative Australia reinstated Sabsabi and Dagostino to Australia’s 2026 Venice Biennale pavilion. In a joint statement, the pair called the reversal “a sense of resolution” after “significant personal and collective hardship,” and thanked the creative community whose “unwavering support” made it possible.\n\t\n\t\tDocumenta Adopts a Controversial Definition of Antisemitism, Spurring Backlash\t\n\n\tIsrael’s war in Gaza has generated some of the most pressing political debates waged in Germany in recent history, pulling its cultural sector into a long-simmering existential crisis over antisemitism, racism, xenophobia, and the legacy of the Holocaust. Thus far, German cultural institutions have landed on what might generously be described as the side of caution—often opting out of the forum by canceling the condition for it all together. Throughout 2024 a wave of cancelations, defundings, and resignations rippled through the sector, including the departure of the entire Documenta 16 finding committee, following a scandal at the quinquennial’s 2022 iteration over an antisemitic artwork.\n\t\n\n\tDocumenta 15, the 2022 edition, has come to define this ongoing cultural reckoning, as underscored by a high-profile incident this December: the cancellation of an exhibition of work by Arte Povera artist Marisa Merz, which has been scheduled to open at the Fridericianum, Documenta’s historic anchor. (The institution mounts major surveys during the periods between editions.) Beatrice Merz, the artist’s daughter and the president of the Fondazione Merz in Turin, told Monopol magazine that she withdrew the exhibition in protest of Documenta’s adoption of the International Holocaust Remembrance Alliance (IHRA) definition of antisemitism, a framework that artists and academics in Germany have argued is politically divisive as under its guidelines, which state that criticism of Israel or Zionism may be construed as antisemitic.  The German Bundestag formally adopted the IHRA’s definition of antisemitism in 2024, despite opposition.\n\n\t“A collaboration with the Museum Fridericianum would have meant accepting the museum’s code of conduct, which uses the IHRA definition of antisemitism—a definition with which I don’t agree in every respect,” Merz said. “In my view, it would have been more appropriate to use the JDA, the Jerusalem Declaration on Antisemitism. For this reason, as president of the Fondazione Merz, I felt it was right to cancel the exhibition project. I am convinced that art should not be restricted by borders and, above all, must be free of prejudice.” \n\t\n\n\tIn response, Andreas Hoffmann, managing director of Documenta and the Fridericianum, said in a statement that the Documenta Code of Conduct is binding for the institution’s employees, not for exhibition artists or associates: “Insofar as Documenta deems artistic expressions incompatible with the principles set out in this Code of Conduct, it reserves the right to comment on its resulting position and, if necessary, to explain it in the immediate visual context of the exhibited artworks.”\n\t\n\t\tA Curator Flees Bangkok After China Censors His Art Exhibition\t\n\n\tBeijing flexed its influence over dissident artists beyond its borders. In September, the curator of a show critiquing authoritarianism in China at the Bangkok Art and Culture Center departed for London amid fears of arrest and deportation. \n\n\tThree days after “Constellation of Complicity: Visualising the Global Machine of Authoritarian Solidarity” opened in July, Chinese embassy staff, accompanied by Bangkok city authorities, “entered the exhibition and demanded its shutdown,” the show’s curator—an artist from Myanmar who goes by the name Sai—told Reuters. The exhibition featured work by exiled artists from countries including China, Russia, Iran, and Burma, and set out to illustrate how authoritarian regimes “collaborate, affirm one another, and reproduce forms of violence under the guise of sovereignty and order,” according to the museum’s website—a goal it ultimately fulfilled, though not by the intended means. \n\t\n\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\tThe entrance to the Bangkok Art and Culture Centre. \n\t\t\t\t\t\t\t\t\tPhoto by: Jeff Greenberg/Universal Images Group via Getty Images\n\t\n\n\n\n\tThe New York Times reported that the directors of the BACC told Sai in an email that the museum had received warnings from the Chinese embassy, the Thai Foreign Ministry, and Bangkok city officials that the exhibition could cause “diplomatic tensions” for Thailand with China. The show remained on view, though multiple edits were made to the display, including the redaction of names of Hong Kong, Tibetan and Uyghur artists, as well as portions of the description of their homelands. Also removed at Beijing’s behest were Tibetan and Uyghur flags, postcards featuring Chinese President Xi Jinping, and a postcard examining links between China and Israel.\n\n\tThe BACC’s directors described the locations targeted for removal as “politically sensitive places where the Chinese government has been tightening its control,” according to the Times. The museum also reportedly removed materials addressing Beijing’s treatment of ethnic minorities and Hong Kong from the show.\n\n\t“It is tragically ironic that an exhibition on authoritarian cooperation has been censored under authoritarian pressure,” said Sai, cofounder of Myanmar Peace Museum, in a statement. “Thailand has long been a refuge for dissidents. This is a chilling signal to all exiled artists and activists in the region.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "In 2025, Censorship and Firings Defined a Fractured Art World",
      "image": [
        "https://www.artnews.com/wp-content/uploads/2025/08/GettyImages-2208842688.jpg?w=1200"
      ],
      "datePublished": "2025-12-29T10:00:00.000Z",
      "dateModified": "2025-12-29T10:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]