[
  {
    "title": "The Untold Story of Bauhaus Women: The Avant-Garde Artists Who Helped Shape Modernism",
    "url": "https://www.openculture.com/2026/02/the-untold-story-of-bauhaus-women-the-avant-garde-artists-who-helped-shape-modernism.html",
    "image": "https://cdn8.openculture.com/2026/02/12225719/bauhauswomen-1024x505.png",
    "tag": "Culture",
    "date": "2026-02-13T09:00:26.000Z",
    "description": "\n\tin Art, Design, History |   \tFebruary 13th, 2026  1 Comment\n\t\n\t\t\t\n\n\t\n\nIt does­n’t take too long a look at the almost sur­re­al­is­ti­cal­ly clean-li",
    "body": "\n\tin Art, Design, History |   \tFebruary 13th, 2026  1 Comment\n\t\n\t\t\t\n\n\t\n\nIt does­n’t take too long a look at the almost sur­re­al­is­ti­cal­ly clean-lined build­ings of Wal­ter Gropius to get the impres­sion that the man want­ed to ush­er in a new world, espe­cial­ly when you con­sid­er that many of them went up before World War II. Take the Bauhaus Dessau build­ing, which, though com­plet­ed exact­ly a cen­tu­ry ago, looks like a con­crete trans­mis­sion from the future that nev­er arrived, or one that may indeed still be on the way. It once housed the Ger­man art school turned polit­i­cal and cul­tur­al engine he found­ed in 1919, whose prin­ci­ples includ­ed absolute equal­i­ty between male and female par­tic­i­pants — or they did at first, at any rate.\nSoon decid­ing that the new insti­tu­tion would­n’t be tak­en seri­ous­ly with too high a pro­por­tion of women, Gropius lim­it­ed their enroll­ment to one-third of the stu­dent body. That episode, among oth­ers that under­score the ways in which Gropius and the Bauhaus’ osten­si­ble com­mit­ment to the advance­ment of women was­n’t all it could be, fig­ures into Susanne Radel­hof’s doc­u­men­tary The Untold Sto­ry of Bauhaus Women.\nYet what­ev­er the short­com­ings in that depart­ment one might iden­ti­fy from a twen­ty-first cen­tu­ry van­tage, the fact remains that the Bauhaus made pos­si­ble — or at least encour­aged — more endur­ing and influ­en­tial work by female artists and design­ers than almost any art school in ear­ly twen­ti­eth-cen­tu­ry Europe.\nAmong the almost 500 women who stud­ied at the Bauhaus, the film pro­files fig­ures like Alma Busch­er, “who cre­at­ed pro­to­types of avant-garde fur­ni­ture and toys”; “vision­ary met­al­smith and design­er” Mar­i­anne Brandt; Gun­ta Stöl­zl, whose “weav­ing rev­o­lu­tion­ized mod­ern tex­tile design” (weav­ing even­tu­al­ly being the main pro­gram to which women were admit­ted); Friedl Dick­er, a “mul­ti­tal­ent­ed artist” ded­i­cat­ed to the Bauhaus; and Lucia Moholy, whose “excep­tion­al pho­tographs still influ­ence how we view Bauhaus design today.” The school itself may have shut down in 1933, owing to the con­flict between its aes­thet­ic and polit­i­cal ends and those of the ris­ing Nazi Par­ty, but the for­ward-look­ing nature and world­wide cul­tur­al influ­ence of the Bauhaus have ensured that we still feel the influ­ence of its alum­ni, male and female alike.\nRelat­ed Con­tent:\nThe Female Pio­neers of the Bauhaus Art Move­ment: Dis­cov­er Gertrud Arndt, Mar­i­anne Brandt, Anni Albers & Oth­er For­got­ten Inno­va­tors\nWatch Bauhaus World, a Free Doc­u­men­tary That Cel­e­brates the 100th Anniver­sary of Germany’s Leg­endary Art, Archi­tec­ture & Design School\nThe Pol­i­tics & Phi­los­o­phy of the Bauhaus Design Move­ment: A Short Intro­duc­tion\nThe Women of the Bauhaus: See Hip, Avant-Garde Pho­tographs of Female Stu­dents & Instruc­tors at the Famous Art School\nAn Oral His­to­ry of the Bauhaus: Hear Rare Inter­views (in Eng­lish) with Wal­ter Gropius, Lud­wig Mies van der Rohe & More\nThe Bauhaus Book­shelf: Down­load Orig­i­nal Bauhaus Books, Jour­nals, Man­i­festos & Ads That Still Inspire Design­ers World­wide\nBased in Seoul, Col­in Marshall writes and broad­casts on cities, lan­guage, and cul­ture. He’s the author of the newslet­ter Books on Cities as well as the books 한국 요약 금지 (No Sum­ma­riz­ing Korea) and Kore­an Newtro. Fol­low him on the social net­work for­mer­ly known as Twit­ter at @colinmarshall.\n\t\t\n        \t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Untold Story of Bauhaus Women: The Avant-Garde Artists Who Helped Shape Modernism",
      "image": [
        "https://cdn8.openculture.com/2026/02/12225719/bauhauswomen-1024x505.png"
      ],
      "datePublished": "2026-02-13T09:00:26.000Z",
      "dateModified": "2026-02-13T09:00:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Surreal Dreams Reign in Hieu Chau's Digital Illustrations",
    "url": "https://www.thisiscolossal.com/2026/02/hieu-chau-digital-illustrations/",
    "image": "https://www.thisiscolossal.com/wp-content/uploads/2026/02/chau-3.jpg",
    "tag": "Culture",
    "date": "2026-02-13T16:38:00.000Z",
    "description": "\nAll images courtesy of Hieu Chau, shared with permission\nFebruary 13, 2026\nArtIllustration\nGrace Ebert\n\nHieu Chau compares his dense, dynamic composi",
    "body": "\nAll images courtesy of Hieu Chau, shared with permission\nFebruary 13, 2026\nArtIllustration\nGrace Ebert\n\nHieu Chau compares his dense, dynamic compositions to his always active mind. Playing with scale and proportion, the Vietnamese artist renders surreal scenes in which flora and fauna converge and figures interact with the outside world as if in a dream. Chau, who was trained as a painter, now works digitally, although his pieces capture the grainy textures and gestures of a physical medium.\nThe artist recently published a book collecting his projects from the last decade, and you can find explore an archive of these pieces on Instagram.\n\n\n\n\n\n\n\t\tPrevious articleNext article\n\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Surreal Dreams Reign in Hieu Chau's Digital Illustrations",
      "image": [
        "https://www.thisiscolossal.com/wp-content/uploads/2026/02/chau-3.jpg"
      ],
      "datePublished": "2026-02-13T16:38:00.000Z",
      "dateModified": "2026-02-13T16:38:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Join Us for the Chicago Premiere of 'Paint Me a Road Out of Here'",
    "url": "https://www.thisiscolossal.com/2026/02/paint-me-a-road-chicago-screening/",
    "image": "https://www.thisiscolossal.com/wp-content/uploads/2025/02/paint-3.jpg",
    "tag": "Culture",
    "date": "2026-02-13T13:26:40.000Z",
    "description": "\n\n\t\nWe’re thrilled to invite you all to the Chicago premiere of Paint Me a Road Out of Here, the award-winning documentary from Aubin Pictures directe",
    "body": "\n\n\t\nWe’re thrilled to invite you all to the Chicago premiere of Paint Me a Road Out of Here, the award-winning documentary from Aubin Pictures directed by Catherine Gund. \nAlong with Intuit Art Museum and the Women’s and Gender Studies Department at DePaul University, Colossal is co-hosting a screening of the film followed by a conversation between film participant Leah Faria and our editorial director Grace Ebert on March 25. This event is free to attend, but seating is limited.\n\n\n\nFeaturing artists Faith Ringgold and Mary Enoch Elizabeth Baxter, Paint Me a Road Out of Here uncovers the whitewashed history of Ringgold’s masterpiece, “For the Women’s House,” following its 50-year journey from Rikers Island jail to the Brooklyn Museum. \nRead our coverage of the documentary, watch the trailer, and RSVP to save your seat.\n\n\t\n\t\n\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Join Us for the Chicago Premiere of 'Paint Me a Road Out of Here'",
      "image": [
        "https://www.thisiscolossal.com/wp-content/uploads/2025/02/paint-3.jpg"
      ],
      "datePublished": "2026-02-13T13:26:40.000Z",
      "dateModified": "2026-02-13T13:26:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "With 200+ Artworks, 'Rainbow Dreams' Revels in the Vast Creativity of the Color Spectrum",
    "url": "https://www.thisiscolossal.com/2026/02/rainbow-dreams-color-light-book/",
    "image": "https://www.thisiscolossal.com/wp-content/uploads/2026/02/rainbow-10.jpg",
    "tag": "Culture",
    "date": "2026-02-14T18:18:57.000Z",
    "description": "\n\n\t\nFrom Do Ho Suh’s ethereal architecture to Kimsooja’s irridescent mirrors to Lauren Halsey’s fringed tapestry, a new book from Monacelli celebrates",
    "body": "\n\n\t\nFrom Do Ho Suh’s ethereal architecture to Kimsooja’s irridescent mirrors to Lauren Halsey’s fringed tapestry, a new book from Monacelli celebrates a broad spectrum of light and color. Rainbow Dreams features more than 200 installations, sculptures, paintings, photographs, and more that revel in the possibilities of pigment. Bound in a smooth gradient that extends to the pages’ edges, this vivid survey is a celebratory, playful object in itself.\nRainbow Dreams features numerous artists previously featured on Colossal, from Nina Chanel Abney and Nick Cave to DRIFT and Katharina Grosse, among many others. The book is slated for release on April 2, and you can pre-order your copy in the Colossal Shop.\nKimsooja, “To Breathe – A Mirror Woman” (2022).  Photo by Jaeho Chong, © the artist, courtesy of Museo Nacional Centro de Arte Reina Sofía and Kimsooja Studio\nDo Ho Suh, installation view of ‘Do Ho Suh: Passage/s’ (2017). Photo: Thierry Bal, © Do Ho Suh, courtesy of the artist; Lehmann Maupin, New York, Seoul, and London; and Victoria Miro\nGabriel Dawe, “Plexus A1” (2015). Photo by Ron Blunt\nShoplifter, “Chromo Sapiens” (2019). Photo by Elisabet Davidsdottir\nLauren Halsey, “auntie fawn on tha 6” (2021). Photo by Allen Chen / SLH Studio, courtesy Lauren Halsey and David Kordansky Gallery, Los Angeles\nKimsooja, “To Breathe – Leeum” (2022). Photo by Seungbeom Hur, © the artist, courtesy pf Leeum Museum of Art and Kimsooja Studio\nSho Shibuya, “Sunrise from a small window” (May 2020–ongoing). Image © Sho Shibuya\nIan Davenport, “Poured Staircase” (2021). Photo by Prudence Cuming Associates\nBeatriz Milhazes, “Marilola” (2010–15).  Photo by Eduardo Ortega\n\t\n\t\n\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "With 200+ Artworks, 'Rainbow Dreams' Revels in the Vast Creativity of the Color Spectrum",
      "image": [
        "https://www.thisiscolossal.com/wp-content/uploads/2026/02/rainbow-10.jpg"
      ],
      "datePublished": "2026-02-14T18:18:57.000Z",
      "dateModified": "2026-02-14T18:18:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Queer Arab Artists on Their Own Terms",
    "url": "https://hyperallergic.com/queer-arab-artists-on-their-own-terms/",
    "image": "https://hyperallergic.com/content/images/size/w1200/2026/02/Minna_Finals10.jpg",
    "tag": "Culture",
    "date": "2026-02-13T18:36:20.000Z",
    "description": "\n    \n                Features\n                Across two galleries in Manhattan, eight artists and collectives flout the weaponization of their ident",
    "body": "\n    \n                Features\n                Across two galleries in Manhattan, eight artists and collectives flout the weaponization of their identities to justify violence, instead presenting a vision of belonging and reclaimed lineages.\n            \n                \n                                \n                            \n                \n            \n                \n        \n            Three years in the making, Alex Khalifa's “Bust” (2026) faces the display of works on the first floor of Participant Inc. gallery. (all photos by Studio Kukla, courtesy Participant Inc., unless otherwise noted)\n    \n        \n            Upon entering Participant Inc. gallery in Manhattan's Chinatown, a pitch-black embrace invites us find one another in the dark. As our eyesight adjusts, a constellation of works illuminates [minna|منا]of us, a group exhibition open through March 15 featuring queer artists of the Palestinian, Jordanian, Lebanese, Syrian, and Egyptian diasporas. Wafts of burning incense mingle with the instrumentals of a commissioned sound mix by Palestinian musician Falyakon to direct visitors through the show, which Palestinian-Jordanian-Egyptian artist Ridikkuluz curated as a space for anti-colonial futurism across tradition and geography.“The show is about giving the pen back to the writer, giving the paintbrush back to the artist, during this time of genocide,” Ridikkuluz told Hyperallergic in an interview at the gallery. “And when there's been so much censorship, these are artists that might not have been able to do this anywhere else.”Across from “Triumvirate” (2023) are three photos by Elias Rischmawi and their family members. (photo Hrag Vartanian/Hyperallergic)While [minna|منا]of us centers the narratives of queer artists with roots in the region, Ridikkuluz emphasized that those identity markers are not the exhibition's sole focus. The show comes at a time when the oppression of LGBTQ+ Arabs has been weaponized in support of Israel's genocide in Gaza, but it intentionally avoids dwelling on collective trauma. “Regarding the work that I'm showing, people are always asking me, 'Is your family okay with you being trans?' And I really hate that question in a way,” said Elias Rischmawi, a multimedia artist of Palestinian descent. “I show that I'm so connected with my family through my work. Even if we might be distant, or if we have our differences, I'm still celebrated in my community. And it's like a 'fuck you' to that.”Elias Jesús Rischmawi, “Triumvirate” (2023)In the exhibition, Rischmawi presents five archival and contemporary photographs depicting family members in Florida, Beit Sahour in the Occupied West Bank, and San Fernando in Chile. In one diptych, a black-and-white photo shows Rischmawi laying their head on their mother's knee, mirroring the adjacent print of a now-lost painting of the artist's mother and great-grandmother in a similar pose.Similarly reaching into tradition and lineage, queer identical twins André and Evan Lenox-Samour work collaboratively and meticulously with mother of pearl — a reference to intricate family heirlooms that were safeguarded during the Nakba in Palestine. Their shimmering sculptures pay homage to these precious objects and to the storied mother-of-pearl artisans of the Hazboun family in Bethlehem through motifs like arrows and eight-pointed stars, evoking themes of direction, migration, and placelessness.André and Evan Lenox-Samour, “The Sky's Assault on the Reality of Men” (2026) (photo Rhea Nayyar/Hyperallergic)André and Evan Lenox-Samour, “The Salmon’s Return (Awdat Al-Samak)” (2019–2024)The exhibition also includes a mixed-media installation by trans Palestinian artist Xaytun Ennasr, a stone bust referencing Egyptian funerary sculptures by Alex Khalifa, and a contemplative film, “Congress of Idoling Persons” (2021), by Beirut-born artist Basyma Saad. On the next floor, home to exhibition co-organizer SALMA gallery, hangs Syrian-Canadian artist Anka Kassabji's poised self-portrait. Relaxing in an icy bath, she gazes over her shoulder with authority while her legs, crossed at the ankle, jut out from the water — resembling the neck of a chilled champagne bottle.Anka Kassabji, “Syrienne Delamer” (2026)“I may be not as confident as my paintings are, but I always want to represent extremely fierce feminine energy in my work,” she told Hyperallergic. “The work has this effect of really icy weather that can be uncomfortable, but I'm still very much in control, and I wanted to celebrate what I've achieved throughout those hard times.”Across the gallery hang three vibrant paintings by Palestinian-Jordanian artist Fares Rizk that portray his better-known alter ego: Sultana, New York's first Palestinian drag queen. Blonde and buxom, Sultana day-dreams, eats knafeh, and snaps a selfie before date night with her devoted boyfriend — channeling her vivacity from the stage to the canvas.Fares Rizk (Sultana), “Date Night“ (2018)Rizk, who has lived in New York for 40 years and debuted Sultana in 1996, told Hyperallergic that his mother heavily encouraged his interests in dance, art, and makeup. Though his siblings have been less supportive, Rizk says that nothing can get between Sultana and her place under the spotlight. “When I belly-dance on stage and the people clap and the light is on me, it's healing all the anxiety,” Rizk said.Exhibition view of Xaytoun Ennasr's “I Want the Land, Not the Sky” (2026)Alex Khalifa, “Bust“ (2026)\n                  \n                      \n                        Features\n                      \n                      \n                        New York\n                      \n                  \n        \n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Queer Arab Artists on Their Own Terms",
      "image": [
        "https://hyperallergic.com/content/images/size/w1200/2026/02/Minna_Finals10.jpg"
      ],
      "datePublished": "2026-02-13T18:36:20.000Z",
      "dateModified": "2026-02-13T18:36:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "University of North Texas Shutters Exhibition of Artworks Critical of ICE",
    "url": "https://hyperallergic.com/university-of-north-texas-shutters-exhibition-of-artworks-critical-of-ice/",
    "image": "https://hyperallergic.com/content/images/size/w1200/2026/02/090225_BU_Quinonez_0163.JPG",
    "tag": "Culture",
    "date": "2026-02-13T15:40:11.000Z",
    "description": "\n            The University of North Texas (UNT) abruptly shuttered an exhibition of works by Victor “Marka27” Quiñonez, whose practice centers the li",
    "body": "\n            The University of North Texas (UNT) abruptly shuttered an exhibition of works by Victor “Marka27” Quiñonez, whose practice centers the lived experience of immigrants in the United States and their inhumane treatment by federal agencies.Ni de Aquí, Ni de Allá — Spanish for “neither from here nor from there” — opened on February 3 and was slated to run through May 1 at the College of Visual Arts and Design (CVAD) Galleries in the UNT Art Building. Initially curated by Kate Fowle for Boston University Art Galleries, where it was on view for three months last year, the show notably included several works from Quiñonez's acclaimed I.C.E. Scream series — life-sized sculptures of paletas, or ice pops, that are both tributes to Latine immigrant culture and searing critiques of the violence inflicted by Immigration and Customs Enforcement (ICE). Certain pieces feature handcuffs or revolvers suspended in the transparent resin. Other works in the exhibition, including graffiti, paintings, and installations, touched on Quiñonez's Indigenous roots and street art background. Victor “Marka27” Quiñonez with a sculpture from his I.C.E. Scream seriesQuiñonez told Hyperallergic that he learned about the show's abrupt closure through messages from students on social media. They sent him photos showing the gallery's distinctive glass windows covered with brown paper sheets, blocking the view inside. Mentions of the exhibition were scrubbed from the school's website. A few days later, on February 11, the artist received a four-line email from Stefanie Dlugosz-Acton, director of the CVAD Galleries.\"I am writing to let you know that the university has terminated the art loan agreement with Boston University Art Galleries for 'Ni de Aquí, Ni de Allá.' The university is making arrangements to return the exhibit to Boston University,\" read the email, reviewed by Hyperallergic. “Any activities associated with the exhibition are no longer necessary,” Dlugosz-Acton continued, concluding with the offer to reimburse Quiñonez for any travel expenses.The University of North Texas did not immediately reply to Hyperallergic's request for comment. The school has not issued a public statement about the exhibition closure. Via a representative, Kate Fowle, who curated the Boston iteration of the show, declined to comment.Victor “Marka27” Quiñonez with his installation \"Elevar la Cultura\" at SCOPE Art Show in Miami in December 2025 (photo Valentina Di Liscia/Hyperallergic)UNT's main campus is located in Denton, about 40 miles from East Dallas, where the Mexican-born artist grew up. In a phone call from Brooklyn, where he currently resides, Quiñonez said the show's cancellation hit him especially hard, given his own immigrant story and the surge of aggression under President Trump.“I saw my father get deported,” he said. “I've seen families and children being pulled away from each other in front of my eyes, in New York, in Texas. It's heartbreaking.”The exhibition, Quiñonez continued, was “about dual identity, about what it means to grow up in the US but also be from another country.”Ni de Aquí, Ni de Allá featured carefully rendered references to his community’s cultural footprint, from a bodega shelf lined with the tall devotional candles found in Latine and Caribbean households to a paleta cart in honor of street vendors. Since the start of Trump's second term, the administration has deported over half a million people inside the country and at the border. A record 73,000 individuals are being held in detention as of mid-January, many of them in dangerous and inhumane conditions, with reports of sexual abuse and physical torture.Quiñonez acknowledged that he was not given a reason for the exhibition's termination and could only speculate about the motive, but he suspects that it is part of an eerily familiar pattern of censorship against artists who speak out against the government. “It's been a trend in this country to suppress any kind of expression that's going against what this administration is doing to civilians and this regime that's been harming and murdering people,” Quiñonez told Hyperallergic. “They say ICE is supposed to be helping people, but detention centers are just another word for privatized prisons,” he continued. “My work speaks to the vulnerability of the communities affected by that.”A sign taped to the gallery windows on Thursday, February 12 (photo courtesy Narong Tintamusik)Parallel to its escalation in violence against immigrants and civilians, including deadly attacks by ICE and Customs and Border Protection in Minneapolis, the Trump administration has unleashed a campaign of repression in the cultural sector. Amy Sherald's withdrawal of an exhibition at the Smithsonian Institution over fears that her portrait of a trans woman would be censored is a major example, but similar incidents have unfolded at institutions across the country, including universities. Last fall, a long-running exhibition of political art at East Tennessee State University was discontinued after a wave of right-wing backlash over works critical of conservative figures.Hyperallergic spoke to Narong Tintamusik, an adjunct teacher in the Drawing and Painting department, who said he was on his way to teach his 5 pm class on Thursday when he saw a sign haphazardly taped to a gallery window. “Victor Quiñonez is being silenced,” the sign read. When Tintamusik got out of class later that evening, the sign had been taken down, he said.“Censorship wasn’t new to me,” Tintamusik noted, recalling that last year, a pro-Palestine art exhibition at a UNT student gallery was partly dismantled following complaints from Republican state representatives.“As an educator, I think this is a good reminder for students about why they’re studying art in the first, and why they’re here,” Tintamusik said.UNT faculty began circulating a letter to the university's president and leadership on Friday, calling on the school to explain why the show was cancelled and to “reaffirm its commitment to academic freedom, artistic expression, and the public trust entrusted to it.”On its website, UNT proudly boasts being “one of the nation’s most diverse universities,” with 11,000 students — about a quarter of the student body — identifying as Hispanic, and one of just 22 universities federally designated as Hispanic-Serving Institutions in the US. The decision to cancel the show, Quiñonez said, “shows that they don't think about how it affects them, and whether or not they feel supported and seen.”“What we need more than anything right now is for galleries and museums and institutions to step up and show important work that speaks to the challenges in our country,” Quiñonez said, “and to have the courage to exhibit that work and support the artists who are making it.”\n                  \n                      \n                        News\n                      \n                      \n                        Texas\n                      \n                      \n                        Immigration and Customs Enforcement (ICE)\n                      \n                      \n                        University of North Texas\n                      \n                      \n                        Victor “Marka27” Quiñonez\n                      \n                  \n        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "University of North Texas Shutters Exhibition of Artworks Critical of ICE",
      "image": [
        "https://hyperallergic.com/content/images/size/w1200/2026/02/090225_BU_Quinonez_0163.JPG"
      ],
      "datePublished": "2026-02-13T15:40:11.000Z",
      "dateModified": "2026-02-13T15:40:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "All About Love From a Black Medieval Angel",
    "url": "https://hyperallergic.com/all-about-love-from-a-black-medieval-angel/",
    "image": "https://hyperallergic.com/content/images/size/w1200/2026/02/aurora-angel.jpg",
    "tag": "Culture",
    "date": "2026-02-13T22:10:43.000Z",
    "description": "\n    \n                Opinion\n                A rare manuscript illustration casts Blackness not as a mirror of sin, but the ground from which love it",
    "body": "\n    \n                Opinion\n                A rare manuscript illustration casts Blackness not as a mirror of sin, but the ground from which love itself might take shape.\n            \n                \n                                \n                            \n                \n            \n                \n        \n            Angel in the Aurora consurgens illuminated manuscript held at Zentralbibliothek Zürich in Switzerland (image public domain CC0 via Wikimedia Commons)\n    \n        \n            What does it mean to love in a time of turmoil? It is an enduring question — and one I rarely hear asked of the medieval world. Looking to the Middle Ages for answers to the perennial puzzles of life can seem quaint, even artificial, a long reach across centuries marked by violence, hierarchy, and exclusion. And yet medieval culture offers a way of thinking about love that still speaks to the present. If love is most urgently tested in moments of strain and upheaval, then it is in those moments — where care is stressed or obscured — that its meaning comes most clearly into view.In our own moment, we are living amid forms of exhaustion that make sustained attention difficult: humanitarian emergencies reduced to statistics, social care systems hollowed out by austerity, and digital economies that reward speed over responsibility. Care is not absent so much as continually deferred, obscured by scale, distance, and a growing insistence that vulnerability should be managed rather than answered.Medieval European visual culture returns to moments of strain and trial again and again, often figuring them through blackness: through bodies marked by humility, penitence, and spiritual testing. Images of Black figures in the Western tradition are not rare, but love — in its fullest, most generous sense — is rarely what they seem to offer at first glance. In depictions of figures such as Saint Maurice, blackness often functions as a site of moral recognition, inviting viewers to identify with sanctity by confronting their own sin and insufficiency. Other familiar figures, such as Balthazar, likewise position blackness as meaningful primarily for what it signifies to the viewer — distance, universality, or the far reaches of Christendom — rather than as an interior condition. These images open space for identification and self-scrutiny, but they stop short of imagining blackness as generative: not merely a mirror of sin, but the ground from which love itself might take shape.Gerard David, \"The Adoration of the Magi\" (c. 1520), oil on wood (image public domain CC0 via the Metropolitan Museum of Art)One image, in the 15th-century alchemical manuscript Aurora consurgens (Rising Dawn), complicates this way of seeing: a late medieval angel with black skin, green wings, and a body cut open to reveal a glowing red interior. In medieval theological and devotional writing, moral goodness was conventionally imagined through the language of light and whiteness. As the 6th-century theologian Pseudo-Dionysius the Areopagite writes in The Celestial Hierarchy, divine goodness overflows with light, illuminating all things according to their capacity to receive it — a formulation that shaped centuries of Christian thought about purity, hierarchy, and visibility. White garments, lightly colored hair, and white luminous flesh became visual shorthand for innocence, obedience, and sanctity.As an angel, she is meant to embody these virtues. And yet her skin is black. Set against the warmth of the light that radiates from within, her blackness unsettles how goodness is meant to appear. What kind of love could take shape here?The Aurora consurgens is a late medieval alchemical manuscript that combines dense, allegorical prose with striking images meant to guide the reader through a process of inner transformation. Attributed to a pseudo-Aquinas, the text reimagines alchemy not as the pursuit of material gold, but as a spiritual discipline concerned with humility, self-knowledge, and the gradual reformation of the soul. In the Aurora consurgens, nigredo, rubedo, and albedo are described as distinct stages within the alchemical process of spiritual transformation — but not as a simple ascent from darkness to light. Nigredo names a condition of contrition and unmaking; rubedo intensifies and exposes this state through heat, incision, and inner transformation; and albedo appears as a fragile, receptive condition rather than a final resolution.Crucially, the text repeatedly warns that whiteness can be false or destructive if severed from what precedes it. Transformation here does not proceed by erasing blackness, but by carrying it forward, integrating it into a changed interior life capable of receiving love.Angels, planets, and bodies recur throughout the manuscript as allegories for interior conditions, making this black angel not an isolated curiosity, but part of a larger visual system devoted to becoming, rather than achieving perfection.To envision nigredo — the first stage of the transformation of the soul — as the skin and hair of the angel is to translate a spiritual condition of contrition, brokenness, and humility into the most material and inescapably human surface of the body. In the late Middle Ages, skin was understood as revelatory: it registered character, disclosed interior disposition, and marked one’s place in the world. Though affected by climate, labor, or emotion, it could not simply be shed. By locating nigredo on the skin rather than in atmosphere, shadow, or dress, the illuminator signals that this stage of the soul’s conversion is constitutive rather than peripheral, enduring rather than temporary — not a stain to be erased, but a condition one inhabits. Blackness here becomes visible on the body’s most exposed surface, rendering nigredo not as abstraction but as something shared, embodied, and recognizably human. It was this move — blackness understood as an enduring, human condition rather than a symbolic overlay — that first unsettled me and drew me to the image.In the Middle Ages, blackness did not function primarily as a marker of identity. As scholars of the Middle Ages have shown, it operated on more than one register: both as a symbolic language rich with meanings tied to repentance and salvation, and as a framework through which racial thinking gradually emerged. As Geraldine Heng has shown in her study of Black holy figures, medieval imagery often used black skin as a surface of moral recognition: a visible sign through which viewers were invited to confront sin and spiritual vulnerability. Yet even within this hermeneutical tradition, blackness is often treated as static — the mark of sin awaiting purification, the darkness meant to be washed into white.What distinguishes the Aurora consurgens is that blackness is not erased in the process of transformation. It is inscribed on the body itself, redefining transformation not as the removal of blackness but as the condition that makes the soul capable of receiving love. In the Aurora, love is not imagined as purity already achieved, nor as transcendence beyond the human condition. It appears instead as a capacity, one that becomes possible only after the self has been unmade. The black angel embodies this logic. Her black skin does not signal a condition to be overcome, but the necessary ground through which love takes shape. Stripped of mastery and self-sufficiency, the soul becomes capable of receiving rather than possessing, of recognizing rather than judging. The image does not imagine love as reward or resolution, but as a capacity that follows unmaking — one that becomes possible only once the self has been broken open. The angel does not love despite blackness, but through it.Taken seriously, this medieval image shows that the soul’s supposed “darkness” — its faltering, its confrontation with its own fragility — is not an obstacle to change but the condition that makes transformation possible. To say that we are all, in this sense, marked by blackness is not to erase racial specificity or historical difference. It is to name a shared movement through unmaking, the breakdown that precedes any genuine capacity for love. In a moment defined by turmoil and a staggering failure of empathy, the image invites us to understand love not as something reserved for the pure or the obedient, but as something that takes root precisely in vulnerability. Blackness here is not an ending, nor a condemnation. It is the space where love becomes possible in the first place.Editor's Note: This essay was based in part on a lecture delivered at the Love: A RaceB4Race Symposium organized by Arizona State University in Tempe, Arizona, on January 24.\n                  \n                      \n                        Opinion\n                      \n                  \n        \n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "All About Love From a Black Medieval Angel",
      "image": [
        "https://hyperallergic.com/content/images/size/w1200/2026/02/aurora-angel.jpg"
      ],
      "datePublished": "2026-02-13T22:10:43.000Z",
      "dateModified": "2026-02-13T22:10:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]