[
  {
    "title": "Did Tintin Creator Hergé Collaborate with the Nazis? A Historical Investigation",
    "url": "https://www.openculture.com/2025/12/did-tintin-creator-herge-collaborate-with-the-nazis-a-historical-investigation.html",
    "image": "https://cdn8.openculture.com/2025/12/04000322/Herge_Premier_plan_1962_Radio-Canada_7-1024x785.jpg",
    "tag": "Culture",
    "date": "2025-12-04T10:00:29.000Z",
    "description": "\n\tin Art, Comics/Cartoons, History |   \tDecember 4th, 2025  Leave a Comment\n\t\n\t\t\t\n\n\t\n\nThe Adven­tures of Tintin may be a chil­dren’s com­ic series fro",
    "body": "\n\tin Art, Comics/Cartoons, History |   \tDecember 4th, 2025  Leave a Comment\n\t\n\t\t\t\n\n\t\n\nThe Adven­tures of Tintin may be a chil­dren’s com­ic series from mid-twen­ti­eth-cen­tu­ry Europe, but its appeal has long since tran­scend­ed the bound­aries of form, cul­ture, and gen­er­a­tion. In fact, many if not most seri­ous­ly ded­i­cat­ed fans of Tintin are in mid­dle age and beyond, and few of them can have avoid­ed ever con­sid­er­ing the ques­tion of his cre­ator’s activ­i­ties dur­ing the Sec­ond World War. Georges Remi, known by the nom de plume Hergé, was born to a low­er-mid­dle-class fam­i­ly in a Brus­sels sub­urb in 1907: utter­ly mun­dane begin­nings, per­haps, but ones that would lead to what the apoc­ryphal ancient Chi­nese curse calls inter­est­ing times, even for a young man whose inter­ests did­n’t run far past scout­ing and draw­ing.\nAfter serv­ing in the Bel­gian army, explains his­to­ry YouTu­ber Mark Fel­ton in his new video above, Remi was hired by the con­ser­v­a­tive Catholic paper Le Vingtième Siè­cle to draw comics for its chil­dren’s sup­ple­ment Le Petit Vingtième. It was there that he became Hergé and cre­at­ed the boy reporter Tintin, whom the paper’s edi­tor asked to be sent to a fic­tion­al­ized Sovi­et Union in order to expose the evils of the Bol­she­viks. Pop­u­lar­i­ty came imme­di­ate­ly, and built up to the degree that an actor was hired to put his hair into a quiff and “return” by train to an appre­cia­tive crowd in Brus­sels upon the sto­ry’s con­clu­sion. There fol­lowed the fur­ther adven­tures of Tintin in the Con­go (at the time, a Bel­gian colony) and Tintin in Amer­i­ca, both of which have since come in for a great deal of crit­i­cism for their reliance on stereo­types.\nThough very much his own artist, Hergé at this stage let the pol­i­tics of Tintin sto­ries be dic­tat­ed by high­er-ups. Con­ceived in response to Japan’s inva­sion of Manchuria, The Blue Lotus, from 1934, did offer him an oppor­tu­ni­ty to increase the real­ism of his art, ren­der­ing the look and feel of Chi­na as accu­rate­ly as his research could make pos­si­ble; he con­tin­ued to incor­po­rate large amounts of detail from all over the world into The Bro­ken Ear, The Black Island, and King Ottokar’s Scep­tre. Though that last deals with fic­tion­al Euro­pean coun­tries, it also clear­ly sat­i­rizes the inva­sive ten­den­cies of Hitler’s Ger­many — which would come for Hergé’s home­land in 1940, shut­ting down Le Petit Vingtième, putting him out of a job, and even req­ui­si­tion­ing his home.\nEven­tu­al­ly, Hergé land­ed on his feet and joined Le Soir, Bel­gium’s largest French-lan­guage news­pa­per. Though he could pub­lish Tintin there, the Nazis had turned it into their ide­o­log­i­cal mouth­piece, a fact that did­n’t reflect well on Hergé after the Allied vic­to­ry. He found him­self black­list­ed and cat­e­go­rized with the thou­sands of Bel­gian col­lab­o­ra­tors who could receive the death penal­ty or life in prison, but an inves­ti­ga­tion into his case found him to be “a blun­der­er rather than a trai­tor” — shades of P. G. Wode­house mak­ing broad­casts about the lighter side of intern­ment for the Gestapo. His good stand­ing as a cit­i­zen and artist was even­tu­al­ly restored, though even today, his wartime activ­i­ties are occa­sion­al­ly called into ques­tion. Still, he was able to con­tin­ue Tintin’s adven­tures until he died in 1983, engag­ing in only the kind of col­lab­o­ra­tion he could do with his staff at Stu­dios Hergé.\nRelat­ed Con­tent:\nHergé Draws Tintin in Vin­tage Footage (and What Explains the Character’s Endur­ing Appeal)\nHow Andy Warhol and Tintin Cre­ator Hergé Mutu­al­ly Admired and Influ­enced One Anoth­er\nComics Inspired by Wait­ing for Godot, Fea­tur­ing Tintin, Roz Chast, and Beav­is & Butthead\nHow Dis­ney Fought Fas­cism with Pro­pa­gan­da Car­toons Dur­ing World War II & Avert­ed Finan­cial Col­lapse\nHow the Nazis Waged War on Mod­ern Art: Inside the “Degen­er­ate Art” Exhi­bi­tion of 1937\nThe Nazis’ 10 Con­trol-Freak Rules for Jazz Per­form­ers: A Strange List from World War II\nBased in Seoul, Col­in Marshall writes and broad­casts on cities, lan­guage, and cul­ture. His projects include the Sub­stack newslet­ter Books on Cities and the book The State­less City: a Walk through 21st-Cen­tu­ry Los Ange­les. Fol­low him on the social net­work for­mer­ly known as Twit­ter at @colinmarshall.\n\t\t\n        \t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Did Tintin Creator Hergé Collaborate with the Nazis? A Historical Investigation",
      "image": [
        "https://cdn8.openculture.com/2025/12/04000322/Herge_Premier_plan_1962_Radio-Canada_7-1024x785.jpg"
      ],
      "datePublished": "2025-12-04T10:00:29.000Z",
      "dateModified": "2025-12-04T10:00:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "George Orwell’s Six Rules for Writing Clear and Tight Prose",
    "url": "https://www.openculture.com/2025/12/george-orwells-six-rules-for-writing.html",
    "image": "https://cdn8.openculture.com/wp-content/uploads/2016/05/20002617/orwell-writing-rules-e1463729200424.png",
    "tag": "Culture",
    "date": "2025-12-04T11:00:43.000Z",
    "description": "\n\t\t\t\nImage via Wiki­me­dia Com­mons\nMost every­one who knows the work of George Orwell knows his 1946 essay “Pol­i­tics and the Eng­lish Lan­guage” (p",
    "body": "\n\t\t\t\nImage via Wiki­me­dia Com­mons\nMost every­one who knows the work of George Orwell knows his 1946 essay “Pol­i­tics and the Eng­lish Lan­guage” (pub­lished here), in which he rails against care­less, con­fus­ing, and unclear prose. “Our civ­i­liza­tion is deca­dent,” he argues, “and our lan­guage… must inevitably share in the gen­er­al col­lapse.” The exam­ples Orwell quotes are all guilty in var­i­ous ways of “stal­e­ness of imagery” and “lack of pre­ci­sion.”\nUlti­mate­ly, Orwell claims, bad writ­ing results from cor­rupt think­ing, and often attempts to make palat­able cor­rupt acts: “Polit­i­cal speech and writ­ing are large­ly the defense of the inde­fen­si­ble.” His exam­ples of colo­nial­ism, forced depor­ta­tions, and bomb­ing cam­paigns find ready ana­logues in our own time. Pay atten­tion to how the next arti­cle, inter­view, or book you read uses lan­guage “favor­able to polit­i­cal con­for­mi­ty” to soft­en ter­ri­ble things.\nOrwell’s analy­sis iden­ti­fies sev­er­al cul­prits that obscure mean­ing and lead to whole para­graphs of bom­bas­tic, emp­ty prose:\nDying metaphors: essen­tial­ly clichés, which “have lost all evoca­tive pow­er and are mere­ly used because they save peo­ple the trou­ble of invent­ing phras­es for them­selves.”\nOper­a­tors or ver­bal false limbs: these are the wordy, awk­ward con­struc­tions in place of a sin­gle, sim­ple word. Some exam­ples he gives include “exhib­it a ten­den­cy to,” “serve the pur­pose of,” “play a lead­ing part in,” “have the effect of.” (One par­tic­u­lar peeve of mine when I taught Eng­lish com­po­si­tion was the phrase “due to the fact that” for the far sim­pler “because.”)\nPre­ten­tious dic­tion: Orwell iden­ti­fies a num­ber of words he says “are used to dress up a sim­ple state­ment and give an air of sci­en­tif­ic impar­tial­i­ty to biased judg­ments.” He also includes in this cat­e­go­ry “jar­gon pecu­liar to Marx­ist writ­ing” (“pet­ty bour­geois,” “lack­ey,” “flunkey,” “hye­na”).\nMean­ing­less words: Abstrac­tions, such as “roman­tic,” “plas­tic,” “val­ues,” “human,” “sen­ti­men­tal,” etc. used “in the sense that they not only do not point to any dis­cov­er­able object, but are hard­ly ever expect­ed to do so by the read­er.” Orwell also damns such polit­i­cal buzz­words as “democ­ra­cy,” “social­ism,” “free­dom,” “patri­ot­ic,” “jus­tice,” and “fas­cism,” since they each have “sev­er­al dif­fer­ent mean­ings which can­not be rec­on­ciled with one anoth­er.”\nMost read­ers of Orwell’s essay inevitably point out that Orwell him­self has com­mit­ted some of the faults he finds in oth­ers, but will also, with some intro­spec­tion, find those same faults in their own writ­ing. Any­one who writes in an insti­tu­tion­al context—be it acad­e­mia, jour­nal­ism, or the cor­po­rate world—acquires all sorts of bad habits that must be bro­ken with delib­er­ate intent. “The process” of learn­ing bad writ­ing habits “is reversible” Orwell promis­es, “if one is will­ing to take the nec­es­sary trou­ble.” How should we pro­ceed? These are the rules Orwell sug­gests:\n(i) Nev­er use a metaphor, sim­i­le, or oth­er fig­ure of speech which you are used to see­ing in print.\n(ii) Nev­er use a long word where a short one will do.\n(iii) If it is pos­si­ble to cut a word out, always cut it out.\n(iv) Nev­er use the pas­sive where you can use the active.\n(v) Nev­er use a for­eign phrase, a sci­en­tif­ic word, or a jar­gon word if you can think of an every­day Eng­lish equiv­a­lent.\n(vi) Break any of these rules soon­er than say any­thing out­right bar­barous.\nWhat con­sti­tutes “out­right bar­barous” word­ing he does not say, exact­ly. As the inter­net cliché has it: Your Mileage May Vary. You may find cre­ative ways to break these rules with­out there­by being obscure or jus­ti­fy­ing mass mur­der.\nBut Orwell does pref­ace his guide­lines with some very sound advice: “Prob­a­bly it is bet­ter to put off using words as long as pos­si­ble and get one’s mean­ing as clear as one can through pic­tures and sen­sa­tions. After­ward one can choose—not sim­ply accept—the phras­es that will best cov­er the mean­ing.” Not only does this prac­tice get us clos­er to using clear, spe­cif­ic, con­crete lan­guage, but it results in writ­ing that grounds our read­ers in the sen­so­ry world we all share to some degree, rather than the airy world of abstract thought and belief that we don’t.\nThese “ele­men­tary” rules do not cov­er “the lit­er­ary use of lan­guage,” writes Orwell, “but mere­ly lan­guage as an instru­ment for express­ing and not for con­ceal­ing or pre­vent­ing thought.” In the almost eighty years since his essay, the qual­i­ty of Eng­lish prose has like­ly not improved, but our ready access to writ­ing guides of all kinds has. Those who care about clar­i­ty of thought and respon­si­ble use of rhetoric would do well to con­sult them often, and to read, or re-read, Orwell’s essay.\nNote: An ear­li­er ver­sion of this post appeared on our site in 2016.\nRelat­ed Con­tent:\n10 Writ­ing Tips from Leg­endary Writ­ing Teacher William Zinss­er\nStephen King’s 20 Rules for Writ­ers\nV.S. Naipaul Cre­ates a List of 7 Rules for Begin­ning Writ­ers\nNietzsche’s 10 Rules for Writ­ing with Style\nJosh Jones is a writer and musi­cian based in Durham, NC. \n\t\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "George Orwell’s Six Rules for Writing Clear and Tight Prose",
      "image": [
        "https://cdn8.openculture.com/wp-content/uploads/2016/05/20002617/orwell-writing-rules-e1463729200424.png"
      ],
      "datePublished": "2025-12-04T11:00:43.000Z",
      "dateModified": "2025-12-04T11:00:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "For This Prestigious Contest, Photographers Capture the Planet's Most Stunning Landscapes",
    "url": "https://www.thisiscolossal.com/2025/12/international-landscape-photographer-of-the-year-2025/",
    "image": "https://www.thisiscolossal.com/wp-content/uploads/2025/12/lpoty-4.jpg",
    "tag": "Culture",
    "date": "2025-12-04T15:11:50.000Z",
    "description": "\n\n\t\nKnown as Tse Bitai to the Diné (Navajo) people, or “winged rock,” Ship Rock in New Mexico is an otherworldly geological formation rising out of th",
    "body": "\n\n\t\nKnown as Tse Bitai to the Diné (Navajo) people, or “winged rock,” Ship Rock in New Mexico is an otherworldly geological formation rising out of the desert that can be seen for miles around. The result of a massive volcanic eruption, the unique outcrop consists of a monolithic stack and at least six radiating, serpentine ridges of long-cooled lava.\nOriginally, Ship Rock was likely a few thousand feet below the ground, but gradual erosion over tens of millions of years has revealed its jagged shape. For Karol Nienartowicz, who won second place in this year’s International Landscape Photographer of the Year contest, the natural landmark was an irresistible place to document from the air as a storm rolled through the Navajo Nation.\nLukas Trixl (Austria), “The Land Before Time,” New Plymouth, North Island, New Zealand\nOne of more than 3,600 entries from photographers around the world for the competition’s 12th edition, Nienartowicz’s image is joined by dozens more honorable mentions that highlight the astonishing diversity of our planet’s surface. Forests, deserts, mountains, lakes, canyons, plains, and many more nuanced ecological systems take center stage in the winners’ striking images.\nA panel of judges chose three winners, with the first place award of Landscape Photographer of the Year presented to J. Fritz Rumpf, followed closely by Nienartowicz and Joyce Bealer. Another category commended specific photographs, with Lukas Trixl’s ethereal capture of New Plymouth, New Zealand, taking the top spot.\nIn total, a pool of 101 photographs made the cut for publication in the competition’s annual book, a further 101 of which can be viewed in the online gallery.\nEnrico Raimondo (Italy), “From the cold age,” Capracotta, Molise, Italy\nDennis Hualong Zhang (Armenia), “Supercell,” New Mexico\nJ. Fritz Rumpf (U.S.), “Winter Meditations”\nHenrique Murta (Brazil), “Martian Sculptures,” Tassili N’Ajjer National Park, Algeria\nMax Terwindt (Netherlands), “Aurora Eruption,” Reykjanesbaer, Iceland\nMatt Payne (U.S.), “Cracked Earth,” Utah\n\nAlbert Dros (Netherlands), “Porcelain Shrooms,” Speulder forest, Veluwe Area, the Netherlands\nMartin Morávek (Czech Republic), “Morning in Dolomites,” Dolomites, Italy\nKarol Nienartowicz (Poland), “Salar de Gorbea,” Salar de Gorbea, Atacama, Andes, Chile\n\t\n\t\n\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "For This Prestigious Contest, Photographers Capture the Planet's Most Stunning Landscapes",
      "image": [
        "https://www.thisiscolossal.com/wp-content/uploads/2025/12/lpoty-4.jpg"
      ],
      "datePublished": "2025-12-04T15:11:50.000Z",
      "dateModified": "2025-12-04T15:11:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Myth, Spirituality, and Storytelling Converge in Ceramics by Chenlu Hou and Chiara No",
    "url": "https://www.thisiscolossal.com/2025/12/chiara-no-chenlu-hou-what-the-hands-remember-to-hear/",
    "image": "https://www.thisiscolossal.com/wp-content/uploads/2025/12/hou-no-3.jpg",
    "tag": "Culture",
    "date": "2025-12-03T19:14:42.000Z",
    "description": "\n\n\t\nSince time immemorial, humans have sculpted sacred symbols into stone or formed them from clay. Expressing beliefs, worldviews, and spirituality i",
    "body": "\n\n\t\nSince time immemorial, humans have sculpted sacred symbols into stone or formed them from clay. Expressing beliefs, worldviews, and spirituality in physical objects like votives and shrines is a way to imbue power and venerate deities and the natural world. For artists Chenlu Hou and Chiara No, ceramics is an enduring conduit to explore spirituality and storytelling.\nHou and No’s work will be exhibited together in a duo exhibition titled What the Hands Remember to Hear, which opens next month at The Aldrich Contemporary Art Museum. The artists showcase objects that take on a sacred quality, emphasizing ceremony and customs while considering how cultures change and merge over time.\nChiara No, “Votive of Frimoth” (2024), underglaze on stoneware, 23kt gold leaf, 24kt gold-plated rings, and waxed thread, 5 x 5.5 x 9.5 inches\nHou’s colorful sculptures draw on her Chinese heritage, “blending folklore, remembrance, and the layered experiences of diaspora and cultural hybridity,” the museum says. “Chiara No creates chiming bells that personify idols, demons, and goddesses inspired by ancient, pagan, and Christian mythologies.” No’s characterful sculptures also embody myth and allegory, influenced by terracotta figures from ancient Boeotia, a region of south-central Greece.\nPlayful—slightly cartoonish, even—Hou and No’s sculptures are contemporary gestures of time-honored beliefs and cultural traditions. Both artists incorporate painting into their works, with tiny tableaux enriching the surfaces.\nFor example, Hou’s “Tian Gou Shi Ri – The truth about solar eclipse and how to observe it using pinhole imaging principle” depicts a giant female dog biting the sun with an image of a woman holding up a large object shaped like an eye—perhaps a viewing device—on its front leg. The piece draws on the Chinese legend of tiangou, or “heavenly dog,” which is said to eat the sun or moon during an eclipse.\nNo’s figures focus on mythological beings often vilified in literature that she researched across a range of historical time periods and media, including medieval folklore, Renaissance prose, and Elizabethan grimoires. Her pieces take the form of bells, with each figure’s legs dangling like a pair of clappers—a clapper is the “tongue” inside a bell that hits the edges to produce sound—so when activated, each sculpture creates a distinctive tone.\nChenlu Hou, “Tian Gou Shi Ri – The truth about solar eclipse and how to observe it using pinhole imaging principle” (2024), terracotta, underglaze, zip-ties, and high-temp wire hooks (slab hand-built, air-brushed surface with underglaze), 20 x 6 x 25 inches\nHou and No’s works “resonate with themes of transformation and cultural inheritance through reimagined storytelling,” the museum says. “Their shared attention to material and mythology invites viewers into a space where living, ever-evolving storylines mirror our collective present.”\nWhat the Hands Remember to Hear runs from January 25 through May 25 in Ridgefield, Connecticut.\nChiara No, “Votive to Ischiron” (2024), underglaze on stoneware and waxed thread, 6 x 4 x 6 inches\nChenlu Hou, “Four long-haired people ride a pomegranate-shaped mini-spaceship into space to smell armpit odor” (2025), terracotta, underglaze, zip-ties, high-temp wire hooks, rope, and gold ink (slab hand-built, air-brushed surface with underglaze), 29 x 19 x 10 inches\nChiara No. L-R: “Idol to Kobal” (2024), underglaze on stoneware, waxed thread, and recycled glass  beads, 6 x 7 x 8 inches; “Votive to Klothod” (2024), underglaze on stoneware and waxed thread, 9.5 x 6 x 10 inches; “Votive to Gemory” (2024), underglaze on  stoneware and waxed  thread, 4.5 x 6.5 x 5.5 inches. Photo by Ethan Hickerson\nChiara No, “Votive to Mermo” (2023), underglaze on tinted porcelain, 8.5 x 4 x 8 inches\nChenlu Hou, “Birds don’t eat cicadas that are shedding” (2023), terracotta, underglaze, zip-ties, high-temp wire hooks, hand-cut polypropylene (slab hand-built, air-brushed surface with underglaze), 28 x 13.5 x 3.5 inches. Photo by Charles Benton\n\n\t\n\t\n\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Myth, Spirituality, and Storytelling Converge in Ceramics by Chenlu Hou and Chiara No",
      "image": [
        "https://www.thisiscolossal.com/wp-content/uploads/2025/12/hou-no-3.jpg"
      ],
      "datePublished": "2025-12-03T19:14:42.000Z",
      "dateModified": "2025-12-03T19:14:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Mason Pott's Bold Bouquets Take a Hyperrealist Approach to the Still Life",
    "url": "https://www.thisiscolossal.com/2025/12/mason-pott-hyperrealistic-floral-paintings/",
    "image": "https://www.thisiscolossal.com/wp-content/uploads/2025/12/pott-4.jpg",
    "tag": "Culture",
    "date": "2025-12-03T22:18:00.000Z",
    "description": "\n\n\t\nIt’s not surprising that there are two sets of lush arrangements in Mason Pott’s Chicago studio. Photographing live bouquets of bright sunflowers,",
    "body": "\n\n\t\nIt’s not surprising that there are two sets of lush arrangements in Mason Pott’s Chicago studio. Photographing live bouquets of bright sunflowers, daisies, and waxy apples or magenta orchids at their peak is the first step in the artist’s layered process. Post photoshoot, he translates these floral bunches into hyperrealistic paintings, with particular care in accurately capturing their textures and the interplay of light and shadow.\nPott is known for his impeccable attention to detail, painting large-scale works in oil that immerse the viewer in fields of foliage. He often creates moody still lifes that approach such classic, timeless subject matter through a contemporary lens. In keeping with that mode of working, his latest series moves from the canvas to custom-cut aluminum panels, which trace the organic edges of each arrangement. The depth and diversity of the source matter appear to pop from Pott’s compositions as he tenderly defines each leaf and petal.\nDetail of “Color Field [Yellow} with Sunflower”\nIf you’re in Miami, Pott’s work is on view with VSG Contemporary at NADA through December 6. Find more from the artist on Instagram.\n“Alstroemeria” (2025), oil on custom-cut aluminum panel, 18 x 22 inches\nDetail of “Color Field [Purple & Crimson} with Kale & Grapes” \n“Orchid (White & Magenta)” (2025), oil on custom-cut aluminum panel, 8 1/2 x 12 inches\n“Color Field [Yellow} with Sunflower” (2025), oil on custom cut aluminum panel, 39 x 30 inches\nDetail of “Color Field [Purple & Crimson} with Kale & Grapes” \n“Banana & Daisy” (2025), oil on custom-cut aluminum panel, 14 x 17 inches\n“Protea” (2025), oil on custom-cut aluminum panel, 18 1/2 x 17 inches\n\t\n\t\n\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Mason Pott's Bold Bouquets Take a Hyperrealist Approach to the Still Life",
      "image": [
        "https://www.thisiscolossal.com/wp-content/uploads/2025/12/pott-4.jpg"
      ],
      "datePublished": "2025-12-03T22:18:00.000Z",
      "dateModified": "2025-12-03T22:18:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "In Clay, Syd Carpenter Explores Nature, African American History, and the Land",
    "url": "https://www.thisiscolossal.com/2025/12/syd-carpenter-clay-expanded-leaf-farm-bowl-ceramics/",
    "image": "https://www.thisiscolossal.com/wp-content/uploads/2025/12/carpenter-7.jpeg",
    "tag": "Culture",
    "date": "2025-12-04T19:23:20.000Z",
    "description": "\n\n\t\nWhen we look at a leaf, we see a predominantly flat plane, intersected by a midrib and myriad veins, or perhaps dotted with ailments like fungi or",
    "body": "\n\n\t\nWhen we look at a leaf, we see a predominantly flat plane, intersected by a midrib and myriad veins, or perhaps dotted with ailments like fungi or the eggs of insects. But imagine what these bits of foliage would look like if blown up like balloons. Artist Syd Carpenter responds “to the garden as a source of form” with her Expanded Leaf series. Imagining a papery leaf if it were inflated, perhaps to the size of a cat, the resulting forms take on “the girth, weight and physicality of animals,” she says.\nCarpenter is known for her clay-based practice exploring the body, land, agriculture, and African American history. She taps into the ancient legacy of the material, merging the timeless medium with contemporary concerns. Perception and expectations are thoughtfully challenged as we encounter bulbous, creature-like beings that simultaneously seem alive and inanimate.\n“Indiana Hutson” (2021), clay, 11 x 24 x 23 inches\n\nIn her recent Farm Bowl series, Carpenter considers another enduring juxtaposition, especially in the world of craft: form and function. She transforms the ubiquitous shape of a bowl into a series of tableaux that delve into relationships between African Americans and the land. Investigating ideas of utility, labor, place, and narrative, the sculptures are encircled by farm animals, foodstuffs, modest houses, and fences.\n“The handmade bowl is a universal form with equivalent examples represented in every culture,” Carpenter says in a statement. “It is an open, round form with an inner recessed chamber rising from a smaller foot to a wider rim. Bowls can serve ritualistically or as mundane, utilitarian objects.” In their nearly universal applications and ageless form, the bowl provides a unique way of “holding” African American experiences and connections to the land.\nA major retrospective of Carpenter’s work, Planting in Space, Time, and Memory, opens in January at the Woodmere Art Museum in Philadelphia. Running concurrently, another solo show titled Home Bound in Wood, Steel, and Clay runs from January 22 to April 5 at the Berman Museum of Ursinus College in Collegeville, Pennsylvania. Her work is also included in the group exhibition Re-Union: Syd Carpenter, Martha Jackson Jarvis, Judy Moonelis, Sana Musasama, and Winnie Owens Hart at the Frances M. Maguire Art Museum of Saint Joseph’s University in Philadelphia, from January 14 to March 29.\nIf you’re in Washington, D.C., you can also see Carpenter’s ceramics in State Fairs: Growing American Craft at the Smithsonian’s Renwick Gallery, which continues through September 7. Find more on the artist’s website and Instagram.\n“Worst enemy” (2006), clay, 20 x 24 x 15 inches\n“Farm Bowl with Chicken” (2021), clay, 11 x 18 x 21 inches\n\n“Heart of the Yam” (2006), clay, 26 x 26 x 14 inches\n“Merge” (2006), clay, 26 x 24 x 15 inches\n“Sebi”\n“O’Neal Smalls” (2021), clay, 13.5 x 23 x 17 inches\n\n“Bite down” (2006), clay, 26 x 22 x 12 inches\n\n\t\n\t\n\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "In Clay, Syd Carpenter Explores Nature, African American History, and the Land",
      "image": [
        "https://www.thisiscolossal.com/wp-content/uploads/2025/12/carpenter-7.jpeg"
      ],
      "datePublished": "2025-12-04T19:23:20.000Z",
      "dateModified": "2025-12-04T19:23:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Art Movements: All's Fair in Art Fairs",
    "url": "https://hyperallergic.com/art-movements-308/",
    "image": "https://hyperallergic.com/content/images/size/w1200/2025/12/image--11-.jpg",
    "tag": "Culture",
    "date": "2025-12-04T21:57:10.000Z",
    "description": "\n                Community\n                Also: Three art-world heavyweights from Pace, Di Donna, and Sotheby’s are opening a new secondary sales gal",
    "body": "\n                Community\n                Also: Three art-world heavyweights from Pace, Di Donna, and Sotheby’s are opening a new secondary sales gallery named … “PDS.” \n            \n                \n                                \n                            \n                \n            \n                \n        \n            Tech oligarch robot pups aren't the only wildlife roaming around in Miami right now. There's a giant (virtual) panther prowling around Cartier's exhibition Into the Wild in the city's design district. We love you, Miami, we don't mean to be catty. (photo courtesy Cartier)\n    \n        \n            Art Movements, published every Thursday afternoon, is a roundup of must-know news, appointments, awards, and other happenings in today’s chaotic art world.Empire State of MindMay we introduce to you \"PDS\" — no, that's not a medical abbreviation, but a new gallery. Pace, Emmanuel Di Donna of Di Donna Galleries, and David Schrader, executive vice president and chairman at Sotheby's, are teaming up to form Pace Di Donna Schrader Galleries (PDS). It'll focus on secondary sales, and operate out of Manhattan's Upper East Side starting early next year. I say we workshop the name. Meanwhile, Stephen Friedman Gallery will close its New York location in Tribeca early next year, while the Munich-based gallery Lohaus Sominsky will open its new space in the same neighborhood next month. So it goes. The New Faces of NYC Public ArtIfeoma Ebo, Stephen Kwok, and Mauricio Higuera are the next Public Artists in Residence in New York City. Over the next year, they'll each work within specific agencies to produce a public artwork. Read our full report here. All's Fair in Art FairsThe Art Dealers Association of America (ADAA) is launching a new fair, mere months after it canceled this year's edition of its annual Art Show, benefiting the Manhattan social services nonprofit Henry Street Settlement. Read our full report here. This Week's Winners, Courtesy Andy Warhol FoundationThe Andy Warhol Foundation awarded more than $1 million in grants to 28 art writers and three translators. We love to see it! Read our full report here. What Else Happened This Week?Todd Gray is now represented by Perrotin in collaboration with Lehmann Maupin.Tony Lewis is now represented by Olney Gleason gallery.Amanda de la Garza Mata was appointed president of the International Committee for Museums and Collections of Modern Art (CIMAM). Kahlil Robert Irving is now represented by CANADA gallery.\n                  \n                      \n                        Community\n                      \n                      \n                        Art Movements\n                      \n                  \n        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Art Movements: All's Fair in Art Fairs",
      "image": [
        "https://hyperallergic.com/content/images/size/w1200/2025/12/image--11-.jpg"
      ],
      "datePublished": "2025-12-04T21:57:10.000Z",
      "dateModified": "2025-12-04T21:57:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]