[
  {
    "title": "Kinology Scores International Deals on Leila Sy’s ‘Hell in Paradise’ With Nora Arnezeder and Maria Bello (EXCLUSIVE)",
    "url": "https://variety.com/2026/film/global/kinology-leila-sy-hell-in-paradise-sales-1236634241/",
    "image": "https://variety.com/wp-content/uploads/2025/10/FotoJet-27.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-18T15:38:39.000Z",
    "description": "\n\tGregoire Melin’s Kinology has scored a raft of international sales on “Hell in Paradise,” Leila Sy’s suspense-packed survival thriller hailing from ",
    "body": "\n\tGregoire Melin’s Kinology has scored a raft of international sales on “Hell in Paradise,” Leila Sy’s suspense-packed survival thriller hailing from “Lucy” producers at EuropaCorp.\n\n\tBuyers include Dea Planeta in Spain, Dimeo Films in Poland, Falcon in the Middle East, Star in India, Blitz in Ex-Yugoslavia, and Ricochet for the airlines. Kinology is finalizing conversations in the U.K., Germany, Italy, Russia and Eastern Europe.\n\t\n\n\tProduced by Virginie Silla and inspired by a true story, the movie stars Nora Arnezeder and Maria Bello. Arnezeder plays Nina, a young French girl who leaves her native Marseille and accepts her first job as a receptionist at a luxurious hotel resort in a fictitious island named Mathara, hoping for a better life. But when a tragedy befalls the hotel, Nina is propelled in a relentless spiral of lies and manipulations. Wrongly accused and sentenced to life in prison, she will have no other choice but to run between traps and escape this paradise turned into hell. \n\n\tKarine Silla (“A Butterfly Kiss”) penned the script. The cast also includes Josephine de la Baume, Alyy Khan, Shubahm Saraf and Ranjit Krishnama. \n\n\tThe female-led thriller complements EuropaCorp’s roster of hit franchises from Luc Besson, from “Taken” to “Lucy.”\n\n\tThe film is “a story of resilience, a reminder that you should never give up, even in the darkest moments. That’s the power of cinema: experiencing powerful emotions,” said Sy, who is best known for directing “Street Flow” (“Banlieusards”), a 2016 action film she co-directed with Kery James for Netflix and topped the chart of the most watched movies on the streamer. \n\t\n\n\tSilla previously told Variety when announcing the project that she felt compelled to tell this “story of empowerment” about “this young woman who has to take control of her own destiny” after getting “caught in a web of lies, in a culture she knows nothing about, and surrounded by men who see her as easy prey.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kinology Scores International Deals on Leila Sy’s ‘Hell in Paradise’ With Nora Arnezeder and Maria Bello (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/FotoJet-27.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-18T15:38:39.000Z",
      "dateModified": "2026-01-18T15:38:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Berlinale Opening Film ‘No Good Men’ by Shahrbanoo Sadat Boarded by Sales Banner Lucky Number (EXCLUSIVE)",
    "url": "https://variety.com/2026/film/global/berlinale-opening-no-good-men-shahrbanoo-sadat-lucky-number-1236633278/",
    "image": "https://variety.com/wp-content/uploads/2026/01/FotoJet-62.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-18T15:27:51.000Z",
    "description": "\n\tAfghan filmmaker Shahrbanoo Sadat‘s “No Good Men,” which is set to open the upcoming Berlin Film Festival, has been boarded by French sales company ",
    "body": "\n\tAfghan filmmaker Shahrbanoo Sadat‘s “No Good Men,” which is set to open the upcoming Berlin Film Festival, has been boarded by French sales company Lucky Number. The Paris-based company will launch sales at next month’s European Film Market, where it will also unveil exclusive first-look images. “No Good Men” follows Sadat’s previous two movies, “Wolf and Sheep” and “The Orphanage,” which premiered at Cannes Directors’ Fortnight in 2016 and 2019, respectively.\n\n\tThe project also marks the third installment in a planned five-film cycle inspired by the autobiographical writings of author and actor Anwar Hashimi, who stars in the film alongside Sadat herself, who takes on the lead role.“No Good Men” is Sadat’s first Berlinale opening slot and continues her strong track record on the international festival circuit where she has quickly established herself as one of the most singular voices to emerge from Afghan cinema in recent years.Set in Kabul in 2021, just before the Taliban’s return to power, the film centers on Naru, the only camerawoman at Afghanistan’s main television station. Struggling to retain custody of her three-year-old son after leaving her unfaithful husband, Naru is convinced that no good men exist in her country — until a career opportunity offered by Qodrat, the station’s most influential journalist, forces her to reconsider. As the two crisscross the city covering what will become Afghanistan’s final days of freedom, a tentative romance emerges, pushing Naru to question her assumptions in a society stacked against her.\n\t\n\tBlending comedy, romance and political urgency, “No Good Men” explores the fragile pockets of freedom that women carve out for themselves within a patriarchal society. The film is believed to feature the first onscreen kiss ever depicted in an Afghan feature — a milestone that also underscores the project’s risks. For political reasons and due to the current context, it had to be shot entirely outside of Afghanistan, in Germany. However the entire cast is Afghan. ” ‘No Good Men’ addresses what I believe is the deepest and most enduring problem of Afghan society, and beyond: patriarchy,” Sadat said. “Through Naru, an independent woman living in Kabul during the ‘democracy’ era, the film reveals how deeply rooted oppression existed long before 2021.”She added that the film seeks to challenge the simplified narratives often applied to Afghanistan’s recent history, insisting that the Taliban represents not only a political force but a long-standing social mindset — while also acknowledging Afghan men who resist and reject that system.The film is produced by Germany and Denmark’s Adomeit Film (“The Square”), in co-production with France’s La Fabrica Nocturna Cinéma, Norway’s Motlys, Germany’s Amerikafilm, Afghanistan’s Wolf Pictures, and Sweden’s Film i Väst. German public funding came from MOIN Filmförderung Hamburg Schleswig-Holstein, the German Federal Film Board (FFA), the German-French Mini-Treaty, the German Federal Film Fund (DFFF), Medienboard Berlin-Brandenburg, nordmedia, and MV Filmförderung Mecklenburg-Vorpommern.Distributors are already on board in several key territories, including Denmark (Camera Film), Norway (Norsk Filmdistribusjon), France (Condor Films) and Germany (Eksystent).Lucky Number’s co-founders, Olivier Barbier, Ola Byszuk and Lenny Porte, described the film as “audacious and groundbreaking in countless ways,” praising Sadat’s resilience in bringing the project to completion “against all odds.”Lucky Number’s lineup includes Felipe Barbosa’s “Leila et La Nuit” (working title), starring Roschdy Zem and Marina Foïs, and Christophe Reveille’s documentary “Che Guevera: The Last Companions,” in time to commemorate the 60th anniversary of Che’s death. Both titles are on the company’s Unifrance Rendez-Vous With French Cinema slate.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Berlinale Opening Film ‘No Good Men’ by Shahrbanoo Sadat Boarded by Sales Banner Lucky Number (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/FotoJet-62.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-18T15:27:51.000Z",
      "dateModified": "2026-01-18T15:27:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nadia Tereszkiewicz Lines Up Eco-Thriller ‘Souveraines’ for Director Remi Allier, Films Grand Huit (EXCLUSIVE)",
    "url": "https://variety.com/2026/film/global/nadia-tereszkiewicz-souveraines-films-grand-huit-1236634108/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Nadia-Tereszkiewicz.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-18T09:38:06.000Z",
    "description": "\n\tCésar winner Nadia Tereszkiewicz (“The Crime Is Mine,” “Forever Young”) is set to star in “Souveraines,” the feature debut of acclaimed filmmaker Ré",
    "body": "\n\tCésar winner Nadia Tereszkiewicz (“The Crime Is Mine,” “Forever Young”) is set to star in “Souveraines,” the feature debut of acclaimed filmmaker Rémi Allier. \n\n\tAllier won a César for his 2017 short “Little Hands,” later shortlisted for the Oscars. His debut follows a fiercely bonded mother and daughter involved in eco-terrorism within a cell of radical, conspiracy-driven activists. After sabotaging a wind turbine, the mother is arrested and loses custody, placing the girl with her aunt, who exposes her to a different worldview. Torn between the two women, the girl remains deeply influenced by her mother’s beliefs, convinced that a vast elite conspiracy threatens society. \n\t\n\n\tProduced by Lionel Massol and Pauline Seigland of Films Grand Huit (“Ghost Trail”) with Benoît Roland of Wrong Men (“The Mysterious Gaze of the Flamingo”), “Souveraines” will shoot later this year. \n\n\n\tBrittany-based Films Grand Huit is also readying “Disorder,” the next feature from Giacomo Abruzzese, whose 2023 debut “Disco Boy” premiered in competition in Berlin, winning the Silver Bear for Outstanding Artistic Contribution. Co-produced with Dugong in Italy, the Italian-language film is set in 1990s Milan, amid the rise of private television and a new ruling class. Selected for the Marché du Film’s Investor Circle, the project has received support from Italy’s MIC and the Franco-Italian fund, with production planned for late 2026. KMBO will handle French distribution. \n\n\tAlready in the can, Grand Huit’s “Vanishing Goats” will hit French theaters in April, shortly before shooting begins on “Une de perdue, une de perdue.” \n\t\n\n\tWritten, directed by, and starring theater luminary Marie Remond, “Vanishing Goats” follows a French director trying to extricate herself from a toxic relationship just as she lands her big break. Shooting in June, Mathilde Elu’s queer romcom “Une de perdue, une de perdue” follows a bike trip along the Breton coast, turning landscapes and encounters into a journey of emotional emancipation. The cast includes standup comic Laura Felpin (“Banger”), singer-songwriter Pomme (“Spirit of Ecstasy”), Louise Chevillotte (“Benedetta”), and Harpo Guit (“Mother Schmuckers”).\n\n\tFurther down the line, Seigland and Massol are developing features like “Les Reves Tempetes” with “Ghost Trail” director Jonathan Millet, “Deepfake” from Ismaël Joffroy Chandoutis, “Ici Repose” by Moly Kane and “La disparition des dinosaures,” courtesy of Élie Girard. \n\n\tTereszkiewicz and Millet have both been named Unifrance Talents to Watch at the previous two editions of the Unifrance Rendez-Vous in Paris.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nadia Tereszkiewicz Lines Up Eco-Thriller ‘Souveraines’ for Director Remi Allier, Films Grand Huit (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Nadia-Tereszkiewicz.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-18T09:38:06.000Z",
      "dateModified": "2026-01-18T09:38:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Marty Supreme’ Becomes A24’s Highest-Grossing Film at Domestic Box Office With $80 Million",
    "url": "https://variety.com/2026/film/box-office/marty-supreme-box-office-a24-highest-grossing-film-domestic-1236634236/",
    "image": "https://variety.com/wp-content/uploads/2024/12/Marty-Supreme-Editing.jpg?crop=66px%2C83px%2C833px%2C468px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-01-18T15:07:37.000Z",
    "description": "\n\t“Marty Supreme” is officially A24’s highest-grossing movie in North America with $80 million. \n\n\tThe sports dramedy overtook the benchmark held by “",
    "body": "\n\t“Marty Supreme” is officially A24’s highest-grossing movie in North America with $80 million. \n\n\tThe sports dramedy overtook the benchmark held by “Everything Everywhere All at Once” with $77 million domestically. “Everything Everywhere,” an Oscar-winning multiversal adventure, remains A24’s highest-grossing film at the worldwide box office with $142 million. Alex Garland’s dystopian thriller “Civil War” is the studio’s second biggest release with $127 million worldwide. \n\t\n\n\t“Marty Supreme,” which has only been released in select international territories and will slowly expand its footprint over the next few weeks, has earned $17 million overseas and $97 million globally to date. \n\n\n\t“Marty Supreme” opened nationwide on Christmas Day and earned $27 million over the extended holiday frame. Now in its fifth weekend of release, the film is projected to earn $6.6 million between Friday and Martin Luther King Jr. Day on Monday, bringing the domestic tally to $80.8 million. Timothée Chalamet, who delivered a press tour for the ages, was vital in getting out the word about the original film. Yet “Marty Supreme” has remained a theatrical draw in the new year because director Josh Safdie’s movie is resonating with audiences. The frenetic, R-rated adventure follows the fictional ping-pong champ Marty Mauser, who goes through the wringer to pursue his dream of becoming a table-tennis champ.\n\n\t“Marty Supreme” is A24’s most expensive film, costing $70 million to produce, so its box office staying power is necessary to justify its budget. (That’s because theater owners are keeping about half of ticket sales.) However “Marty Supreme” has been proving its value to A24 beyond the balance sheet and through the awards circuit. Chalamet won the Golden Globe and Critics Choice for best actor and will likely find himself in the Oscar race when nominations are announced on Thursday. It’s good to be Marty. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Marty Supreme’ Becomes A24’s Highest-Grossing Film at Domestic Box Office With $80 Million",
      "image": [
        "https://variety.com/wp-content/uploads/2024/12/Marty-Supreme-Editing.jpg?crop=66px%2C83px%2C833px%2C468px&resize=1000%2C563"
      ],
      "datePublished": "2026-01-18T15:07:37.000Z",
      "dateModified": "2026-01-18T15:07:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Filmmaker Cedric Klapisch Collects French Cinema Award at Familial, Culture Ministry Ceremony",
    "url": "https://variety.com/2026/film/global/cedric-klapisch-french-cinema-unifrance-1236634059/",
    "image": "https://variety.com/wp-content/uploads/2026/01/MixCollage-17-Jan-2026-10-31-AM-8892.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-18T06:30:05.000Z",
    "description": "\n\tFlanked by his closest collaborators, director Cédric Klapisch collected this year’s French Cinema Award at a warm, familial ceremony at France’s Mi",
    "body": "\n\tFlanked by his closest collaborators, director Cédric Klapisch collected this year’s French Cinema Award at a warm, familial ceremony at France’s Ministry of Culture on Jan. 15.\n\n\tJoined by his longtime screenwriter Santiago Amigorena and his emblematic actor Zinedine Soualem — key creative partners for more than three decades — along with the cast of his latest feature, “Colors of Time,” Klapisch was celebrated for a career that has consistently looked beyond national borders.\n\t\n\n\tLaunched by Unifrance in 2016, the French Cinema Award honors a figure whose work has helped carry Gallic cinema worldwide. Past recipients include Isabelle Huppert, Juliette Binoche, Virginie Efira, and filmmakers Olivier Assayas, Rebecca Zlotowski, and Olivier Nakache and Éric Toledano. Klapisch, however, doesn’t just promote his films abroad: his work is defined by movement and global exchange, crystallized in the critically and commercially adored “Spanish Apartment” series, which across three features and an Amazon series follows an extended clan across three continents.\n\n\n\tAccepting the prize, Klapisch pointed to travel as a central artistic catalyst, noting that a promotional tour for 2002’s “Pot Luck” — the first in the series — directly inspired its follow-up, “Russian Dolls.”\n\n\t“Some journeys give birth to new films,” he said. “Travel is a fundamental part of my cinema. That’s the reason I made ‘Pot Luck’ — and why I’m standing here today.”\n\n\tRaised in Paris, Klapisch launched his career with an MFA at NYU’s Tisch School of the Arts, an experience he said left a lasting mark.\n\t\n\n\t“I began my adult life in the U.S., and today I honestly wonder whether young French people still feel the same pull to go there,” he added. “It’s less obvious now. Meanwhile, something new is happening: major American actors and directors are coming to France. That simply didn’t exist before. There’s been a reversal. Movement no longer flows in the same direction.” \n\n\tReflecting on what he called “a strange, pivotal moment” for the film business, Klapisch turned his focus closer to home. “There’s constant talk about box office numbers, admissions, and international circulation — and this is even more pronounced abroad,” he said. “But France is truly unique because of its system, and the CNC in particular. I will always defend the CNC. It must continue to exist. It supports cinematic creation. I’ve often said the CNC is a protected space where creation can happen, and I believe deeply in that model.”\n\n\tFittingly, CNC president Gaëtan Bruel was on hand to hear the praise, joining French Culture Minister Rachida Dati, Unifrance president Gilles Pélisson, and executive director Daniela Elstner in saluting Klapisch at this year’s Unifrance Rendez-Vous in Paris.\n\n\n\n\t\n\n\t\t\t\t\tDaniela Elstner, Cedric Klapisch, Rachida Dati, Gilles Pélisson \n\t\t\t\t\t\t\t\t\tChloé Leclercq / Unifrance\n\t\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Filmmaker Cedric Klapisch Collects French Cinema Award at Familial, Culture Ministry Ceremony",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/MixCollage-17-Jan-2026-10-31-AM-8892.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-18T06:30:05.000Z",
      "dateModified": "2026-01-18T06:30:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jamie-Lynn Sigler Kept Her MS Diagnosis a Secret for 25 Years Fearing She’d ‘Never Work Again’",
    "url": "https://variety.com/2026/tv/news/jamie-lynn-sigler-ms-secret-25-years-greys-anatomy-1236634077/",
    "image": "https://variety.com/wp-content/uploads/2026/01/GettyImages-2220009338.jpg?crop=0px%2C375px%2C6000px%2C3375px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-01-17T22:54:02.000Z",
    "description": "\n\tJamie-Lynn Sigler got emotional during a recent interview with ABC (via Entertainment Weekly) in which she discussed her recent guest spot on “Grey’",
    "body": "\n\tJamie-Lynn Sigler got emotional during a recent interview with ABC (via Entertainment Weekly) in which she discussed her recent guest spot on “Grey’s Anatomy” as a doctor with multiple sclerosis. She said the role was extremely personal, given that she was diagnosed with the condition 25 years ago and felt she needed to “keep it a secret” out of fear of losing work.\n\n\tShe told ABC, “To think back 25 years ago — when I was diagnosed and having to keep it a secret, thinking that if anybody knew that I had MS, that meant that I would never work again — and to now be in a position where my having MS inspired a role in a storyline on a show like ‘Grey’s Anatomy,’ I never would have believed you.”\n\t\n\n\tSigler, who was working on the legendary HBO drama “The Sopranos” at the time, was 20 years old when she was diagnosed with MS. She didn’t go public with the news until 2017, when she sat down with the National Multiple Sclerosis Society.\n\n\tOn Jan. 15, Sigler appeared on “Grey’s Anatomy” as Dr. Laura Kaplan, a urologist with MS. In her episode, she gives Dr. Richard Webber, played by James Pickens Jr., advice on how to best treat his prostate cancer.\n\n\tSigler said her goal with the part was to “show someone in their power” and give an authentic depiction of someone living and thriving with MS.\n\n\t“My very first take, where I do say the words that ‘I have MS,’ was very emotional for me,” she said.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jamie-Lynn Sigler Kept Her MS Diagnosis a Secret for 25 Years Fearing She’d ‘Never Work Again’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/GettyImages-2220009338.jpg?crop=0px%2C375px%2C6000px%2C3375px&resize=1000%2C563"
      ],
      "datePublished": "2026-01-17T22:54:02.000Z",
      "dateModified": "2026-01-17T22:54:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘The Seduction’ Star Anamaria Vartolomei Lines Up Polyglot Slate With ‘De Gaulle,’ ‘Miles & Juliette,’ Upcoming Romanian Feature",
    "url": "https://variety.com/2026/film/global/anamaria-vartolomei-miles-davis-juliette-greco-mick-jagger-1236634161/",
    "image": "https://variety.com/wp-content/uploads/2026/01/MixCollage-18-Jan-2026-09-14-AM-1813.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-18T15:10:48.000Z",
    "description": "\n\t“The Seduction” star Anamaria Vartolomei is lining up a polyglot year, with projects spanning English, French and Romanian. \n\n\tBorn in Bacău, Romani",
    "body": "\n\t“The Seduction” star Anamaria Vartolomei is lining up a polyglot year, with projects spanning English, French and Romanian. \n\n\tBorn in Bacău, Romania, and raised in Paris, Vartolomei won the César for Most Promising Actress for her breakout performance in Audrey Diwan’s Venice Golden Lion winner “Happening.” She has since maintained a steady presence in French cinema — balancing blockbusters like “The Count of Monte-Cristo” with auteur-driven projects including Bruno Dumont’s “The Empire” and last year’s Cannes Critics’ Week opener “Adam’s Sake” — all while steadily expanding her international footprint with English- and Romanian-language debuts in Bong Joon-ho’s “Mickey 17” and Teodora Mihai’s “Traffic.”\n\t\n\n\tShe’ll press ahead on all fronts this year, promoting her French-language turns in Pathé’s two-part historical epic “De Gaulle” and Fanny Liatard and Jérémy Trouilh’s arthouse fantasy “Les Yeux Verts,” before filming the U.S. period romance “Miles & Juliette.” Vartolomei is also circling an as-yet-untitled Romanian project, currently in final negotiations and eyeing a late 2026 shoot. While Vartolomei could not yet disclose the director of that project, she cited Cristian Mungiu and Emanuel Pârvu among her favorite contemporary Romanian filmmakers. \n\n\n\t(Mungiu, notably, wrote and produced Mihai’s “Traffic” and has just completed “Fjord” with Sebastian Stan — another immigrant-turned-international star remaining closely connected to Romanian cinema. Stan is next attached to a feature from Berlin Golden Bear winner Radu Jude. On the arthouse circuit, all roads lead to Romania.)\n\t\n\n\tBack in France, Vartolomei will play a fictionalized French Resistance fighter in Antonin Baudry’s two-part drama “De Gaulle” — a project she describes less as a conventional biopic than as a sprawling and “very political” war saga.\n\n\tWhat interested me most was the global scope and artistic ambition,” she says. “It’s a huge-budget, ambitious film, and I wanted French cinema to take those risks. The project has a Christopher Nolan-like visual sweep, while the theme of liberation today can resonate with young people in many countries.”\n\n\tShe also compliments the more artisanal visual aesthetic of Fanny Liatard and Jérémy Trouilh’s “Les Yeux Verts,” in which Vartolomei plays a young woman traveling through her brother’s subconscious in order to rouse him from a comatose state. “Their films mix fantasy and dreams, requiring a lot of effects and post-production work,” she says. “But those elements all complement another — making for something very abstract in their approach.”\n\n\tVartolomei will next star opposite Damson Idris and Xavier Dolan in “Miles & Juliette.” Directed by Bill Pohlad and produced by Mick Jagger, the film reimagines the 1949 romance between chanteuse Juliette Gréco and jazz legend Miles Davis, with production expected to begin later this year. \n\n\t“Their love story is very little known,” Vartolomei says. “Putting a mixed-race couple on screen is still rare, even though the story is very universal and continues to resonate today.” \n\n\t“It’s also about showing the emergence of two icons,” she continues. “Today they’re legends, but at the time they were just starting out, both in their twenties. It’s about portraying an era and making it a true romance — full of promise, something wonderful, something that makes you dream.” \n\n\tComing on the heels of “Mickey 17,” Vartolomei is looking forward to working in English again and hopes her role as Juliette Gréco will give her the chance to sing. Still, she stops short of dreaming of a Hollywood career — though she is signed with CAA, which packaged the film.\n\n\t“Doing American projects is a bonus,” she says. “When you’re foreign, it’s generally hard to land a first lead role or to avoid parts that are too clichéd. But if it’s something you want, you work toward it. And then it happens — or it doesn’t, and that’s okay. After all, the U.S. is not my home country.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘The Seduction’ Star Anamaria Vartolomei Lines Up Polyglot Slate With ‘De Gaulle,’ ‘Miles & Juliette,’ Upcoming Romanian Feature",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/MixCollage-18-Jan-2026-09-14-AM-1813.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-18T15:10:48.000Z",
      "dateModified": "2026-01-18T15:10:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Finn Wolfhard’s ‘SNL’ Monologue Crashed by ‘Stranger Things’ BFFs Caleb McLaughlin and Gaten Matarazzo; Trio Say They’re Grown and Ready for ‘Adult Films’",
    "url": "https://variety.com/2026/tv/news/finn-wolfhard-snl-gaten-matarazzo-caleb-mclaughlin-1236634110/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Finn-Wolfhard-Caleb-McLaughlin-Gaten-Matarazzo.png?crop=0px%2C0px%2C2209px%2C1242px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-01-18T05:03:52.000Z",
    "description": "\n\tFinn Wolfhard‘s “SNL” monologue was crashed by two of his best-known co-stars.\n\n\tCaleb McLaughlin and Gaten Matarazzo, who starred on “Stranger Thin",
    "body": "\n\tFinn Wolfhard‘s “SNL” monologue was crashed by two of his best-known co-stars.\n\n\tCaleb McLaughlin and Gaten Matarazzo, who starred on “Stranger Things” with Wolfhard, joined the actor in his monologue as he spoke about growing up onscreen and how he’s now an adult. \n\n\t“My voice changed on camera, my first kiss was on camera, and the first time I learned what a woman looks like down there was on there as well,” before cutting to a howling Demogorgon.\n\t\n\n\tUnfortunately, he doesn’t like the taste of alcohol, spitting up his first drink all over Marcello Hernández.\n\n\n\tThen the boys come out and talk about how strange it has been growing up onscreen, and all of the things people would say about them on Reddit. But at the end they joked that they are now ready to star in…”adult films.”\n\n\tLater in the episode, a sketch considered what might happen with some “Stranger Things” spinoffs, include “Mike in Manhattan,” a “Sex and the City”-esque series starring Wolfhard, McLaughlin and Matarazzo. The sketch also took a shot at Will’s lengthy-coming out scene, saying that it’s still going on. It also included “The Wheeler Report” news show from Nancy, and a spinoff with Steve Harrington as an inner-city teacher.\n\n\tThe sketch also included a scene from the rumored (but not real) ninth episode of “Stranger Things” that started an internet conspiracy theory. But fans probably wouldn’t have predicted Kenan Thompson taking over the role of Eleven.\n\n\tWatch Wolfhard’s monologue, as well as the “Stranger Things” sketch, below.\n\n\n\n\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Finn Wolfhard’s ‘SNL’ Monologue Crashed by ‘Stranger Things’ BFFs Caleb McLaughlin and Gaten Matarazzo; Trio Say They’re Grown and Ready for ‘Adult Films’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Finn-Wolfhard-Caleb-McLaughlin-Gaten-Matarazzo.png?crop=0px%2C0px%2C2209px%2C1242px&resize=1000%2C563"
      ],
      "datePublished": "2026-01-18T05:03:52.000Z",
      "dateModified": "2026-01-18T05:03:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘SNL’ Mocks Trump’s Nobel Prize Envy, Colin Jost’s Unhinged Pete Hegseth Promises ‘USA is Going to F—‘ Countries Around the World",
    "url": "https://variety.com/2026/tv/news/snl-trumps-nobel-prize-colin-josts-pete-hegseth-1236634114/",
    "image": "https://variety.com/wp-content/uploads/2026/01/SNL-Trump-Hegseth.png?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-18T05:12:56.000Z",
    "description": "\n\t“Saturday Night Live” mocked President Donald Trump’s egomania around the Nobel Peace Prize as well as the U.S. military action in Venezuela and Kri",
    "body": "\n\t“Saturday Night Live” mocked President Donald Trump’s egomania around the Nobel Peace Prize as well as the U.S. military action in Venezuela and Kristi Noem’s incredibly callous response to the ICE shooting in Minneapolis in the cold open for the show’s first episode of 2026.\n\n\tThere was no shortage of political material to catch up on, and “SNL” made the most of it in a faux Trump news conference and cabinet meeting. Colin Jost played an unhinged Secretary of Defense Pete Hegseth. Jeremy Culhane played Vice President JD Vance, who whined about his recent trip to Greenland in a nod to Trump’s real-life outrageous threats that the U.S. should take over the Danish territory.\n\t\n\n\t“I came here to do two things,” Culhane’s Vance said. “Kick bubble gum and chew ass. And I’m all out of bubble gum.”\n\n\n\tJames Austin Johnson’s Trump opened the segment at a podium with the Presidential seal talking about the Christmas holiday. \n\n\t“I got what I wanted — my very own someone else’s Nobel Prize,” Johnson’s Trump said, a nod to the bizarre development in which Venezuelan opposition leader María Corina Machado presented her Nobel Peace Prize to Trump, in a bid to curry favor with him amid the upheaval in her home country . \n\n\t“In my stocking I got Maduro — Nicolás Maduro. We did a reverse-Santa on him. We came down the chimney with a bag and took him away,” Johnson’s Trump said, referring to the U.S.’s highly criticized move to capture the Venezuelan strongman who is now in jail in New York facing drug trafficking charges.\n\n\tJohnson’s Trump made a reference to “Frankenstein” director Guillermo del Toro by mentioning “my little cabinet of curiousities,” referring to his cabinet members as “various monsters and nightmares from the twisted mind of Guillermo del Trump.”\n\t\n\n\n\tFor Homeland Security Secretary Noem, Ashley Padilla came out in the cowboy hat similar to the one the real-life Noem wore as she sought to defend the shooting of a woman in Minneapolis by ICE agents on Jan. 7. “I want to give a quick shout out to my hair and makeup team who absolutely hate me,” Padilla’s Noem said.\n\n\tAs for the horrendous situation in Minneapolis, Padilla’s Noem asked “Have we been perfect? Yes.” Then she gave a recruitment pitch for ICE. “Is your neck wider than your head? Are you currently wearing a Punisher T-shirt? Have you ever punched a hole in the wall because your son took a dance class? Grab a gun and saddle up, big boy.” \n\n\tJost then made a noisy entrance as Hegseth, who chugged an energy drink from an oversized mug and bragging about the military operation executed in Venezuela on Jan. 1. “We went into Venezuela — we tea-bagged their country,” Jost’s Hegseth said. \n\n\t“We’re rocking out with our C’s out all over the world,” Hegseth said while using a small weight in a sexually suggestive manner. He indicated that Iran was next in line to face the force of the U.S. force, in reference to the political protests that have left hundreds of people dead in the Middle Eastern country. “You don’t dare kill your protestors — that’s our thing,” Jost’s Hegseth warned. “We’re going to F you right back.” \n\n\tJohnson’s Trump came back to the podium to finish out the news conference. “Even I know you’re doing that wrong,” he said, pointing to Jost’s over-amped Hegseth. “The midterms are canceled,” he declared before going into the classic “Live from New York, it’s ‘Saturday Night” transition into the credits.\n\n\t In the final minutes of the show, before the cast gathered on stage for the traditional closing, the show paid tribute to Bob Weir, the founding member of the Grateful Dead, who died Jan. 10 at age 78. The legendary jam band also fronted by the late Jerry Garcia made two appearances on “SNL,” first in 1978 and then two years later.\n\n\t(Pictured: James Austin Johnson as Donald Trump and Colin Jost as Pete Hegseth in the cold open for the Jan. 17 episode of “Saturday Night Live.”)\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘SNL’ Mocks Trump’s Nobel Prize Envy, Colin Jost’s Unhinged Pete Hegseth Promises ‘USA is Going to F—‘ Countries Around the World",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/SNL-Trump-Hegseth.png?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-18T05:12:56.000Z",
      "dateModified": "2026-01-18T05:12:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Harry Potter Meets ‘Heated Rivalry’ in Racy SNL Sketch With Ron Romance, Naked Quidditch and Jason Momoa",
    "url": "https://variety.com/2026/tv/news/harry-potter-heated-rivalry-snl-naked-quidditch-1236634127/",
    "image": "https://variety.com/wp-content/uploads/2026/01/SNL-Heated-Rivalry-Harry-Potter.png?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-18T05:47:34.000Z",
    "description": "\n\tThe Wizarding World is taking on “Heated Rivalry.”\n\n\tOn this week’s “SNL,” host Finn Wolfhard starred as Harry Potter in a sketch mocking the new HB",
    "body": "\n\tThe Wizarding World is taking on “Heated Rivalry.”\n\n\tOn this week’s “SNL,” host Finn Wolfhard starred as Harry Potter in a sketch mocking the new HBO series adaptation of the fantasy novels. But in this version, thanks to being “hastily rewritten after the success of a certain other HBO show,” Harry quickly becomes enamored with Ron (Ben Marshall) and the show is renamed “Heated Wizardry.” It’s also said to be “the first series written entirely by girls who wear tails.”\n\t\n\n\tOf course, wand and broom puns and innuendo arrive quickly, as “the only thing hotter than hockey is Quidditch.” After seeing Harry and Ron’s meet cute, Harry is seen flying away from Ron on the Quidditch pitch without any bottoms and more sexy Hogwarts shenanigans take place. Of course there’s a scene with the boys getting intimate under the Cloak of Invisibility! Luckily, according to the voiceover, “they’re all 18+ in this. Hogwarts is like college now — just to make that clear.”\n\n\n\tIn the segment, James Austin Johnson plays Severus Snape, Chloe Fineman as Hermione, Jason Momoa stops by to play Hagrid, Ashley Padilla plays Professor McGonagall and Kenan Thompson takes on Alastor Moody. \n\n\tAlthough it will likely be closer to the original texts, the new HBO ‘Harry Potter” series adaptation is set to  debut in 2027 and stars Dominic McLaughlin, Alastair Stout, Arabella Stanton, John Lithgow, Janet McTeer, Paapa Essiedu and Nick Frost. “Succession” alum Mark Mylod is set to direct the series, and Hans Zimmer will be scoring it.\n\n\tWatch the sketch below.\n\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Harry Potter Meets ‘Heated Rivalry’ in Racy SNL Sketch With Ron Romance, Naked Quidditch and Jason Momoa",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/SNL-Heated-Rivalry-Harry-Potter.png?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-18T05:47:34.000Z",
      "dateModified": "2026-01-18T05:47:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Check Out These Celebs Having Fun in the Snow!!!",
    "url": "https://www.tmz.com/2026/01/18/stars-in-the-snow/",
    "image": "https://imagez.tmz.com/image/7e/16by9/2026/01/12/7ef9ced3d4d844e788fff87ca6089d73_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-18T09:00:00.000Z",
    "description": "\n    \n                    \n                          Baby, It's Cold Outside!\n                          Check Out These Celebs\n                       ",
    "body": "\n    \n                    \n                          Baby, It's Cold Outside!\n                          Check Out These Celebs\n                          Having Fun In The Snow!!!❄\n                      \n                  \n                                                                        Published \n                              January 18, 2026\n                            1:00 AM PST\n                                                                            \n      \n    \n      \n        \n              \n    \n    \n          Sure, temperatures are dropping, but there's still plenty of fun to be had outside ... because there's lots of stars out there having fun in the snow!\n      \n    \n          There's always something to do when it's icy outside ... like build snowmen, have snowball fights, or see snaps of stars like Addison Rae having a blast in the drifts -- while you're sitting somewhere warm, of course!\n      \n    \n          If you are gonna head outside, just make sure you've got some serious layers on to keep yourself comfy in the winter weather ... looks like Eva Gutowski got the memo on that one!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Addison Rae\n              \n                          \n                Celebrity News\n              \n                          \n                Photo Galleries\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Check Out These Celebs Having Fun in the Snow!!!",
      "image": [
        "https://imagez.tmz.com/image/7e/16by9/2026/01/12/7ef9ced3d4d844e788fff87ca6089d73_xl.jpg"
      ],
      "datePublished": "2026-01-18T09:00:00.000Z",
      "dateModified": "2026-01-18T09:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "At Least 6 Dead, Dozens Injured in Shopping Mall Fire in Pakistan",
    "url": "https://www.tmz.com/2026/01/18/shopping-mall-pakistan-fire-many-dead-dozens-injured/",
    "image": "https://imagez.tmz.com/image/0a/16by9/2026/01/18/0a5638d6a9ff481b87355ff557a4e8a5_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-18T15:14:27.000Z",
    "description": "\n    \n                    \n                          Pakistan Mall Fire\n                          6 Dead, Several Injured After Reported Short Circuit",
    "body": "\n    \n                    \n                          Pakistan Mall Fire\n                          6 Dead, Several Injured After Reported Short Circuit\n                      \n                  \n                                                                        Published \n                              January 18, 2026\n                            7:14 AM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          A massive fire ripped through a crowded shopping mall in Pakistan over the weekend, killing at least six people and injuring dozens more.\n      \n    \n          The blaze broke out around late Saturday night after emergency crews received calls reporting flames inside the building, according to Reuters. By the time first responders arrived, the situation had already spiraled out of control.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          \"When we arrived, the fire from the ground floor had spread to the upper floors, and almost the entire building was already engulfed in flames,\" a Rescue 122 spokesperson told Reuters.\n      \n\n          Officials say the fire eventually destroyed more than 1,200 shops. Authorities have confirmed six deaths so far. At least 22 people were injured, including several firefighters.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Investigators believe the fire was sparked by a short circuit in one of the shops, according to Sindh Inspector General, adding the mall's old construction and the flammable materials sold inside caused the fire to continue smoldering for hours.\n      \n    \n          Emergency crews responded with 22 fire brigades and 33 ambulances, and officials said the fire was about 70% contained by Sunday morning.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                RIP\n              \n                          \n                World Events\n              \n                          \n                News\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "At Least 6 Dead, Dozens Injured in Shopping Mall Fire in Pakistan",
      "image": [
        "https://imagez.tmz.com/image/0a/16by9/2026/01/18/0a5638d6a9ff481b87355ff557a4e8a5_xl.jpg"
      ],
      "datePublished": "2026-01-18T15:14:27.000Z",
      "dateModified": "2026-01-18T15:14:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jake Paul vs. Dwyane Wade Who'd You Rather?! (Athletic Bday Bros)",
    "url": "https://www.tmz.com/2026/01/17/jake-paul-dwyane-wade-birthdays/",
    "image": "https://imagez.tmz.com/image/ff/16by9/2026/01/12/ffaf0769cc964c3d96d6db16b464cb7d_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-18T00:00:44.000Z",
    "description": "\n    \n                    \n                          Jake Paul vs. Dwyane Wade\n                          Who'd You Rather?!\n                          ",
    "body": "\n    \n                    \n                          Jake Paul vs. Dwyane Wade\n                          Who'd You Rather?!\n                          Athletic Bday Bros Edtion\n                      \n                  \n                                                                        Published \n                              January 17, 2026\n                            4:00 PM PST\n                                                                            \n      \n    \n      \n        \n              \n    \n    \n          There's always some reason to party with Jake Paul and Dwyane Wade, and this weekend's no exception ... because they're both celebrating their birthdays!\n      \n    \n          The thing is, this weekend's not big enough for the two of them ... and to be honest, we're having a hard time picking out who we're going to be raising our glasses to tonight!\n      \n    \n          We've got one question for you: Who'd You Rather?!\n      \n    \n          VOTE NOW!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Jake Paul\n              \n                          \n                Dwyane Wade\n              \n                          \n                Sports\n              \n                          \n                TMZ Sports\n              \n                          \n                Who'd You Rather?\n              \n                          \n                Birthdays\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jake Paul vs. Dwyane Wade Who'd You Rather?! (Athletic Bday Bros)",
      "image": [
        "https://imagez.tmz.com/image/ff/16by9/2026/01/12/ffaf0769cc964c3d96d6db16b464cb7d_xl.jpg"
      ],
      "datePublished": "2026-01-18T00:00:44.000Z",
      "dateModified": "2026-01-18T00:00:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bodybuilder Kali Muscle Hospitalized After Fainting at Gym",
    "url": "https://www.tmz.com/2026/01/17/bodybuilder-kali-muscle-hospitalized-after-fainting-at-gym/",
    "image": "https://imagez.tmz.com/image/b1/16by9/2026/01/18/b1e02658ae844c9f9851b4a882b75f21_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-18T05:04:36.000Z",
    "description": "\n    \n                    \n                          Kali Muscle\n                          Bodybuilder Hospitalized After Fainting at Gym\n            ",
    "body": "\n    \n                    \n                          Kali Muscle\n                          Bodybuilder Hospitalized After Fainting at Gym\n                      \n                  \n                                                                        Published \n                              January 17, 2026\n                            9:04 PM PST\n                                                                      |\n                                                                Updated \n                                  January 18, 2026\n                                5:03 AM PST\n                                    \n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Kali Muscle suffered a major health scare Saturday while doing what he does best -- working out at the gym, TMZ has learned.\n      \n    \n          The popular bodybuilder and YouTuber -- whose real name is Chuck Kirkendall -- passed out cold while exercising in a fitness center in California, his ex-wife, Dvyne Dirkendall, tells TMZ.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Kali was rushed to a hospital for treatment, but Dvyne tells us she doesn't know why he fell unconscious or the status of his condition. She noted Kali previously had a heart attack and needed a stent inserted into his heart to restore blood flow.\n      \n\n          Kali has been posting on YouTube for more than 15 years and has nearly 4 million subscribers on the site, and is a fan fave on Instagram and TikTok. He's also a personal trainer and last year, began teaching social media tips and offering coaching sessions on financial stability.\n      \n    \n          He married his wife, Helena, in 2022.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Sports\n              \n                          \n                TMZ Sports\n              \n                          \n                Exclusive\n              \n                          \n                Health\n              \n                          \n                Health & Fitness\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bodybuilder Kali Muscle Hospitalized After Fainting at Gym",
      "image": [
        "https://imagez.tmz.com/image/b1/16by9/2026/01/18/b1e02658ae844c9f9851b4a882b75f21_xl.jpg"
      ],
      "datePublished": "2026-01-18T05:04:36.000Z",
      "dateModified": "2026-01-18T05:04:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Hot Stars By The Fire ... It's Lit!",
    "url": "https://www.tmz.com/2026/01/18/hot-stars-by-the-fire-its-lit/",
    "image": "https://imagez.tmz.com/image/12/16by9/2026/01/12/124065e5ea4b412d912917ffd73faf4b_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-18T08:45:54.000Z",
    "description": "\n    \n                    \n                          Hot Stars\n                          By The Fire ...\n                          It's Lit 🔥!\n      ",
    "body": "\n    \n                    \n                          Hot Stars\n                          By The Fire ...\n                          It's Lit 🔥!\n                      \n                  \n                                                                        Published \n                              January 18, 2026\n                            12:45 AM PST\n                                                                            \n      \n    \n      \n        \n              \n    \n    \n          Grab your 'mallows, 'cuz these sexy stars are serving looks by the fire -- you're bound to catch a flame! Cozy vibes, sizzling snaps ... and more than enough heat to light up your day and night, y'all ready?!\n      \n    \n          Smoldering celebs like Lisa and Chloe Veitch turned up the temps with their pretty poses in front of the fire, and Alicia Keys and Swizz Beatz looked quite dapper, dressed to the 9s by the fireplace ... \"This girl is on fire!\"\n      \n    \n          Check out the gallery ... it's straight fire!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Kourtney Kardashian\n              \n                          \n                Alicia Keys\n              \n                          \n                Swizz Beatz\n              \n                          \n                Weather\n              \n                          \n                Hotties & Bodies\n              \n                          \n                Hot Bodies\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Hot Stars By The Fire ... It's Lit!",
      "image": [
        "https://imagez.tmz.com/image/12/16by9/2026/01/12/124065e5ea4b412d912917ffd73faf4b_xl.jpg"
      ],
      "datePublished": "2026-01-18T08:45:54.000Z",
      "dateModified": "2026-01-18T08:45:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]