[
  {
    "title": "Box Office: ‘Chainsaw Man’ Wins Thursday Previews With $3.4 Million, ‘Springsteen’ Makes $850,000",
    "url": "https://variety.com/2025/film/news/box-office-chainsaw-man-springsteen-previews-1236560719/",
    "image": "https://variety.com/wp-content/uploads/2025/10/MCDCHMA_SP010.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-24T16:15:00.000Z",
    "description": "\n\tSony’s R-rated anime “Chainsaw Man” beat Disney and 20th Century Studios’ musical biopic “Springsteen: Deliver Me From Nowhere” at the box office in",
    "body": "\n\tSony’s R-rated anime “Chainsaw Man” beat Disney and 20th Century Studios’ musical biopic “Springsteen: Deliver Me From Nowhere” at the box office in Thursday previews. \n\n\t“Chainsaw Man — The Movie: Reze Arc” made $3.4 million in previews. It’s expected to lead the pack of newcomers at the box office with $11 million to $15 million, though it appears it could now surpass even that. It could beat last week’s box office champ, Universal and Blumhouse’s horror movie “The Black Phone 2,” which is looking to add $10 million to $12 million in its second week.\n\t\n\n\tSony already had huge success last month with its other anime offering, “Demon Slayer: Kimetsu no Yaiba Infinity Castle,” which opened to a stellar $70 million. Also based on an existing anime TV series and brought to the big screen, “Demon Slayer” has made $131 million domestically and $659 million worldwide. Now, “Chainsaw Man” could be Sony’s second anime success in a row.\n\n\n\t“Springsteen: Deliver Me From Nowhere” features “The Bear” Emmy winner Jeremy Allen White portraying Bruce Springsteen making his 1982 album “Nebraska.” It made $850,000 in Thursday previews. It’s estimated to make $8 million to $12 million in its opening, and it carries a $55 million budget.\n\n\tThe third newcomer this week is Paramount’s adaptation of author Colleen Hoover’s novel “Regretting You,” starring Allison Williams, McKenna Grace, Dave Franco and Mason Thames. It’s also looking to make $8 million to $10 million this weekend. The PG-13 movie about a mother and daughter grappling with a devastating accident cost just $30 million to produce.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Box Office: ‘Chainsaw Man’ Wins Thursday Previews With $3.4 Million, ‘Springsteen’ Makes $850,000",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/MCDCHMA_SP010.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-24T16:15:00.000Z",
      "dateModified": "2025-10-24T16:15:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sony Pictures Classics Acquires U.K. Indie Hit ‘I Swear’ About Tourette’s Campaigner",
    "url": "https://variety.com/2025/film/global/i-swear-sony-pictures-classicss-1236560429/",
    "image": "https://variety.com/wp-content/uploads/2025/10/I-Swear.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-24T14:30:00.000Z",
    "description": "\n\t“I Swear,” the British indie film about Tourette’s Syndrome campaigner John Davidson that has already been a hit with audiences and critics in the U",
    "body": "\n\t“I Swear,” the British indie film about Tourette’s Syndrome campaigner John Davidson that has already been a hit with audiences and critics in the U.K., has been bought by Sony Pictures Classics. \n\n\tSPC acquired all rights to the film for the United States, Latin America, most of Eastern Europe, Turkey, Southeast Asia, Portugal and South Korea. \n\n\tWritten and directed by BAFTA nominee Kirk Jones (“Waked Ned Devine,” “Nanny McPhee”), “I Swear” first premiered in Toronto to critical acclaim and earlier this month launched in U.K. and Irish cinemas, opening at third spot behind “Tron: Ares” and “One Battle After Another.” According to distributor StudioCanal, it also set a new record as the most highly rated film by cinemas audiences since records began in the U.K. —  above “Bohemian Rhapsody,” “Top Gun Maverick” and “Parasite” in Comscore PostTrak exit polls. \n\t\n\n\tAlongside Robert Aramayo (“The Lord of the Rings: The Rings of Power”) as the lead, the film’s supporting cast includes three-time BAFTA nominee Maxine Peake (“Say Nothing,” “The Theory of Everything”), BAFTA winner Shirley Henderson (“Bridget Jones: Mad About the Boy,” “Harry Potter”) and Cannes best actor Award winner and Golden Lion winner Peter Mullan (“War Horse,” “The Magdalene Sisters”).\n\n\n\tSet in 1980s Britain, “I Swear” charts Davidson’s Tourette’s diagnosis at the age of 15 years old, following him throughout his troubled teens and early adulthood exploring this little known and entirely misunderstood condition, along with his attempts to live a “normal” life against the odds. The production worked closely with the Tourette’s community, casting individuals who live with Tourette’s, and collaborated with a Tourette’s charity.\n\t\n\n\tThe film was produced by Jones, Georgia Bayliff and Piers Tempest for One Story High and Tempo Productions. Cindy Jones and John Davidson serve as executive Producers.\n\n\t“I am thrilled to partner with Sony Pictures Classics on ‘I Swear,'” said Jones. “Their history, vision, ambition and passion for what is a very special project for us, feels like a perfect fit for U.S. and additional territories.”\n\n\tAdded Tempest, “We are delighted that ‘I Swear’ is resonating so much with audiences in the United Kingdom and can’t think of better partners than Sony Pictures Classics to bring the film to U.S. audiences and beyond.”\n\n\tThe deal was negotiated between Sony Pictures Classics and Bankside Films on behalf of the filmmakers.\n\n\t“I Swear’ is one of those extraordinary, one-of-a-kind, true-to-life movies, emotionally engaging, funny and compelling,” said Sony Pictures Classics. “Many will identify as ‘I Swear’ explores conquering an entirely misunderstood condition, by a young man and the people around him. Directed to perfection by Kirk Jones with amazing performances by Robert Aramayo and stalwarts Maxine Peake, Shirley Henderson and Peter Mullan, ‘I Swear’ will be adored by audiences everywhere.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sony Pictures Classics Acquires U.K. Indie Hit ‘I Swear’ About Tourette’s Campaigner",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/I-Swear.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-24T14:30:00.000Z",
      "dateModified": "2025-10-24T14:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Fantastic Four: First Steps’ Sets Disney+ Release Date",
    "url": "https://variety.com/2025/film/news/fantastic-four-disney-release-date-streaming-how-to-watch-1236474996/",
    "image": "https://variety.com/wp-content/uploads/2025/07/The-Fantastic-Four-First-Steps.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-24T14:05:06.000Z",
    "description": "\n\t“The Fantastic Four: First Steps” will become available to stream at home on Disney+ starting Nov. 5 after grossing $521 million at the worldwide bo",
    "body": "\n\t“The Fantastic Four: First Steps” will become available to stream at home on Disney+ starting Nov. 5 after grossing $521 million at the worldwide box office over the summer.\n\n\tThe 37th film in the Marvel Cinematic Universe, “First Steps” hit theaters on July 25, opening to $117 million at the domestic box office and $218 million worldwide— Marvel’s strongest opening weekend of the year and the second strongest superhero opening of the summer after DC Studios’ “Superman.”\n\t\n\n\tDirected by Matt Shakman, “First Steps” is Hollywood’s second attempt to reboot the eponymous superhero quartet this century. Tim Story’s “Fantastic Four” and its sequel, “Fantastic Four: Rise of the Silver Surfer,” were distributed by 20th Century Fox in 2005 and 2007, respectively. Fox then rebooted the series in 2015 with Josh Trank’s “Fantastic Four” before Disney bought the studio and acquired the property in 2019.\n\n\n\t“First Steps” differs from its predecessors by taking place in a retro-futuristic world that doesn’t shy away from the source material’s 1960s campiness. A bright and optimistic superhero story, it focuses on the Fantastic Four as a family, introducing the characters at the height of their heroic notoriety rather than centering the movie around how they got their powers.\n\n\tDepicting the titular superhero family are Pedro Pascal as Reed Richards/Mr. Fantastic, Vanessa Kirby as Sue Storm/The Invisible Woman, Joseph Quinn as Johnny Storm/The Human Torch and Ebon Moss-Bachrach as Ben Grimm/The Thing. Julia Garner also stars as The Silver Surfer alongside Ralph Ineson as Galactus and Paul Walter Hauser as Harvey Elder/Mole Man.\n\t\n\n\tThe film will join other Marvel movies on Disney+ and the Fantastic Four will return to the big screen on Dec. 18, 2026 in “Avengers: Doomsday.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Fantastic Four: First Steps’ Sets Disney+ Release Date",
      "image": [
        "https://variety.com/wp-content/uploads/2025/07/The-Fantastic-Four-First-Steps.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-24T14:05:06.000Z",
      "dateModified": "2025-10-24T14:05:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Victorious’ Spinoff ‘Hollywood Arts’ With Daniella Monet Returning Ordered at Netflix",
    "url": "https://variety.com/2025/tv/news/victorious-spinoff-hollywood-arts-netflix-daniella-monet-1236560216/",
    "image": "https://variety.com/wp-content/uploads/2025/10/HART_S1_SOP_KS_1014_0262_RT-e1761257993767.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-24T15:00:00.000Z",
    "description": "\n\tThe spinoff of “Victorious” titled “Hollywood Arts” has been picked up to series at Netflix — and a few other places. \n\n\tVariety has learned that th",
    "body": "\n\tThe spinoff of “Victorious” titled “Hollywood Arts” has been picked up to series at Netflix — and a few other places. \n\n\tVariety has learned that the streamer has commissioned 26 episodes of the new series, which will debut on Netflix in 2026 followed by releases on Nickelodeon and Paramount+. \n\n\t“Victorious” star Daniella Monet will return to star and executive produce the new show, reprising the role of Trina Vega. Production is set to begin on “Hollywood Arts” in the coming weeks in Vancouver. \n\t\n\n\tThe series was first reported to be in the works earlier this year, but only at Nickelodeon. All episodes of the original series are currently available on Netflix in the US, with the streamer claiming it has racked up 45 million views since the beginning of 2024. It is also available on Paramount+.\n\n\n\t“Victorious” originally aired on Nickelodeon from 2010-2013 for four seasons. The cast included Arianna Grande, Victoria Justice, Leon Thomas III, Matt Bennett, Elizabeth Gillies, and Avan Jogia. \n\n\tAlong with Monet, new cast members for “Hollywood Arts” include Alyssa Miles (“Hanging out with Alyssa and Xavier”), Emmy Liu-Wang (“Raven’s Home,” “Slumber Party”), Peyton Jackson (“Woman in the Yard,” “Young Dylan”), Erika Swayze (“School Spirits,” “Davey & Jonesie’s Locker,” “Workin’ Moms”), and Martin Kamm (“Unsung Hero,” “Web of Spiderman”). Yvette Nicole Brown will guest star. \n\n\t“Coming back as Trina alongside such a dynamic, powerful cast of newcomers is something I feel very lucky and grateful to do,” Monet said. “‘Victorious’ was in a lot of ways life changing for all of us, our cast is forever bonded by that experience, and to think that I have an opportunity to steward anything close to that is a feeling I can’t begin to describe. As an actress, producer, and mom, I am so eager to create something we can all be proud to share with the world.”\n\t\n\n\tThe official logline states, “Struggling actress Trina Vega (Monet) returns to her former high school, Hollywood Arts, as an unqualified substitute teacher, quickly finding herself both clashing with and unexpectedly inspiring a new generation of ambitious and talented students as they learn to find their true path at Hollywood’s most elite performing arts school.”\n\n\tJake Farrow and Samantha Martin will write, executive produce, and showrun “Hollywood Arts.” Jonathan Judge will executive produce and direct the pilot episode. As mentioned, Monet will also executive the series. The series is produced by Paramount Television Studios. Production of the series is overseen by Shauna Phelan, executive vice president of live action series and film at Nickelodeon, along with Brian Banks, executive in charge of production.\n\n\tFarrow was previously a producer on the original series in addition to voicing the ventriloquist dummy Rex. \n\n\tThis will be the second spinoff of “Victorious,” following “Sam & Cat.” That series saw Grande reprise the role of Cat Valentine alongside “iCarly” star Jennette McCurdy as Sam Puckett. That show aired for one season.\n\n\tDan Schneider, the creator of “Victorious,” is not involved with “Hollywood Arts.” Schneider was previously a major driving force behind Nickelodeon shows around the time of “Victorious,” but parted ways with the network in 2018 after multiple allegations of misconduct and creating a toxic work environment surfaced. His time at Nickelodeon was documented extensively in the docuseries “Quiet on the Set.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Victorious’ Spinoff ‘Hollywood Arts’ With Daniella Monet Returning Ordered at Netflix",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/HART_S1_SOP_KS_1014_0262_RT-e1761257993767.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-24T15:00:00.000Z",
      "dateModified": "2025-10-24T15:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How Czech Filmmaker Hana Novakova Became ‘Obsessed’ With the Moose After Its ‘Unbelievable’ Return to Her Homeland",
    "url": "https://variety.com/2025/film/global/hana-novakova-amoosed-1236560707/",
    "image": "https://variety.com/wp-content/uploads/2025/10/Amoosed.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-24T15:34:17.000Z",
    "description": "\n\tHana Novakova, a documentarian and ethnozoologist, says she first became obsessed — her word — with the moose when a remarkable event transpired in ",
    "body": "\n\tHana Novakova, a documentarian and ethnozoologist, says she first became obsessed — her word — with the moose when a remarkable event transpired in the Czech Republic.\n\n\t“It all started in 2003 when I first heard the story of the unbelievable spontaneous return of the moose population to my homeland, the Czech Republic, after 500 years of them being extinct here,” she tells Variety.\n\n\n\n\n\n\tFive years later, while studying at Prague’s venerated FAMU film school, her interest hadn’t lessened a bit — leading her, after a tortuous but relentless trek, to this week’s world premiere of “Amoosed” in the Ji.hlava doc fest’s Czech Joy section.\n\t\n\n\tDetermination was indeed needed: funders were not too receptive to her pitch, Novakova says, and COVID lockdowns were on the horizon, preventing her from filming abroad.\n\n\t“And yet again, the following diplomatic crisis between the Czech Republic and Russia in 2021 plus the war Russia started a year later made further filming in Russia impossible.”\n\n\tWith moose sightings in the Czech Republic still extremely rare, Novakova had tracked down a Russian nature preserve in the Kostroma region that raised the majestic ungulates (and that had once served as an anti-rocket defense installation).\n\n\t“The first time I was able to see the moose in the wild was in Russia, in the domestication station where they let them roam freely.”\n\n\tThe Russian team had also managed to establish a way to extract milk from a moose by having them exposed to humans at birth, rather than allowing them to be raised by their mothers.\n\t\n\n\tShe visited the area in 2016 and recorded some material, later used in “Amoosed,” but the expedition was intended as more of a scouting trip, she says.\n\n\tBut with the war, her plans to return years later were off the table.\n\n\t“It forced us to use much more material from the scouting than we intended.”\n\n\tWith at least a decade invested in the film, including later trips to Nova Scotia, where indigenous people of the Mi’kmaq nation helped guide Novakova to local moose homelands, the director steadily accumulated more material – and it proved sufficient to overcome the setbacks.\n\n\t“I am not able to count the time I’ve put into it anymore,” Novakova says. “I simply try to perceive the making of this film as a part of my personal evolution as a human being, however pathetic it might have sounded.”\n\n\tNovakova’s background as a scientist helped her find the structure for her quest story, she says.\n\n\t“First, I introduce my childhood hero, the classical zoologist. With other scientists on the scene, like the Russian laser physicist, it becomes clear that to be able to fully grasp the mystery of the moose, a person needs a bigger and different mojo than just a diploma in zoology.”\n\n\tFocusing on the bigger questions was key, along with maintaining perspective, Novakova says.\n\n\t“I realized that I really need to let go and wait patiently, going where the animal tries to get me — which was Nova Scotia, Canada, and the encounter with Cheryl, the Mi’kmaq matriarch, that kind of changed my life.”\n\n\tNovakova underwent ritual cleansing with herbal smoke before being welcomed to the wild terrain to film. She was told by Cheryl that “special animal omens” had been witnessed for her project. It seemed the moose community was OK with “Amoosed.”\n\n\tThe moose also makes for a complex and mysterious central character, to be sure. Many questions about its life in the wild are still not fully answered, it seems. But much has been learned over the years, including at least two fascinating facts, Novakova says.\n\n\tFirst, sometimes one moose will migrate, while another from the same area will not – something, Novakova says, that may well just come down to an animal’s personality.\n\n\tSecondly, their diet is so diverse as they graze on a wide variety of plants that keeping them healthy in captivity, even with a nutritious diet, has proven “nearly impossible.”\n\t\n\n\t“The only enigma to me is, why do we still keep doing it? Would we do it to a human being if we knew all facts? Certainly not.”\n\n\t“The message I want to send is purely positive,” Novakova says. “I think animals can be our most amazing teachers, who can even guide us out of the crisis of being disconnected from our Mother Earth and from ourselves, if we are willing to follow them and listen to them.”\n\n\n\n\t\n\n\t\t\t\t\t“Amoosed”\n\t\t\t\t\t\t\t\t\tCourtesy of LaDamplinque\n\t\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How Czech Filmmaker Hana Novakova Became ‘Obsessed’ With the Moose After Its ‘Unbelievable’ Return to Her Homeland",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/Amoosed.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-24T15:34:17.000Z",
      "dateModified": "2025-10-24T15:34:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Wedding Crashers’ Returning to Movie Theaters for 20th Anniversary",
    "url": "https://variety.com/2025/film/news/wedding-crashers-movie-theaters-20th-anniversary-1236560542/",
    "image": "https://variety.com/wp-content/uploads/2025/10/MCDWECR_EC015.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-24T15:00:00.000Z",
    "description": "\n\tGet ready to crash the party again — “Wedding Crashers” is returning to theaters for its 20th anniversary. \n\n\tFathom Entertainment has partnered wit",
    "body": "\n\tGet ready to crash the party again — “Wedding Crashers” is returning to theaters for its 20th anniversary. \n\n\tFathom Entertainment has partnered with Warner Bros. Pictures to bring the R-rated comedy back to the big screen on Dec. 4 and 11. The 20th anniversary special release will include an additional 10 minutes of deleted scenes originally featured on the film’s 2006 home entertainment edition. \n\n\n\tDirected by David Dobkin (“Clay Pigeons,” “Shanghai Knights”), “Wedding Crashers” stars Owen Wilson and Vince Vaughn as two lifelong friends and business partners who spend their free time crashing wedding receptions. The ensemble cast also includes Christopher Walken, Rachel McAdams, Bradley Cooper, Isla Fisher and Jane Seymour.\n\t\n\n\t“Wedding Crashers,” first released in theaters in 2005, went on to gross $288 million at the worldwide box office and became one of the defining R-rated comedies of the 2000s. \n\n\t“Few movies of the past twenty years are as laugh-out-loud funny and remain as relevant as part of the pop culture conversation as ‘Wedding Crashers.’ Fathom is thrilled to partner with Warner Bros. and bring a special 20th anniversary presentation of ‘Wedding Crashers’ to the big screen, and with bonus content available for the first time in theatres,” Ray Nutt, chief executive officer at Fathom Entertainment, said in a statement. “With a diverse and incredible cast, ‘Wedding Crashers’ 20th Anniversary is a classic that legions of fans – old and new – will want to enjoy in theatres this December.” \n\n\tTickets are available now at Fathom Entertainment’s website and participating theater box offices. \n\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Wedding Crashers’ Returning to Movie Theaters for 20th Anniversary",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/MCDWECR_EC015.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-24T15:00:00.000Z",
      "dateModified": "2025-10-24T15:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Why ‘Train Dreams’ Could Be the Best Picture Sleeper of the Oscar Season",
    "url": "https://variety.com/2025/film/awards/train-dreams-best-picture-dark-horse-oscars-1236559967/",
    "image": "https://variety.com/wp-content/uploads/2025/10/Train-Dreams-Clint-BTS-1.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-24T15:15:00.000Z",
    "description": "\n\tIn an awards season crowded with spectacles, sequels and star-driven vehicles, the quiet power of “Train Dreams” may be its greatest strength.\n\n\tCli",
    "body": "\n\tIn an awards season crowded with spectacles, sequels and star-driven vehicles, the quiet power of “Train Dreams” may be its greatest strength.\n\n\tClint Bentley’s moving adaptation of Denis Johnson’s Pulitzer Prize finalist novella has steadily emerged as one of the most critically acclaimed films of the year — and a potential dark horse best picture contender. After a rousing premiere at the Sundance Film Festival in January, where it was acquired by Netflix, the film went on to make a strong showing at the New York, Mill Valley and most recently Middleburg film festivals, earning raves and deepening its resonance with every screening. In discussions with festival attendees and critics, it’s been striking how many cinephiles have shared their affection for the film.\n\t\n\n\tNow sitting at an impressive 98% on Rotten Tomatoes and backed by a steadily growing word-of-mouth campaign, “Train Dreams” could become one of those quintessential movies that sneaks into the best picture category — not necessarily with a flash, but with a feeling.\n\n\n\tSet in the early 20th-century Pacific Northwest, the film stars Joel Edgerton as Robert Grainier, a solitary railroad worker navigating profound personal loss as the American frontier expands around him.\n\n\tBentley, who directed from a script he co-wrote with his longtime collaborator Greg Kwedar, paints a portrait of grief and transformation with meditative precision and visual poetry. What begins as a modest character study becomes a sweeping reflection on death, memory and the ghosts we carry. It’s the type of movie that can resonate with industry voters.\n\t\n\n\tAdolpho Veloso’s cinematography evokes the stillness and grace of Terrence Malick, while Bryce Dessner’s original score — featuring contributions from Nick Cave on the titular song — stitches together the film’s spiritual undercurrent.\n\n\tEdgerton gives one of the most subtle and physical performances of his career, and William H. Macy, in a key supporting role, reminds viewers why he remains one of America’s most quietly compelling actors. The two have been steadily climbing the prediction charts over the past few weeks. Edgerton, who has endured several notable Oscar omissions during his career (including for “Animal Kingdom,” “Loving” and “The Gift”), makes a compelling case for the Australian multi-hyphenate to pick up his first nomination. Macy, who hasn’t been recognized since “Fargo” (1996), is the type of journeyman actor who often garners SAG Awards attention, especially given his four career wins for television.\n\n\tThe drama lingers because it doesn’t insist on its importance; it lets that significance build gradually. It doesn’t conclude so much as it echoes, like a memory you’re unsure actually happened. With the Academy’s attraction to emotionally grounded work — such as “Nomadland,” “CODA” and “Women Talking” — a gem like “Train Dreams” has a real path forward. If voters watch it — and that’s always the challenge with quieter films — it could follow in the footsteps of other slow-burning contenders that gradually gained strength throughout the season.\n\n\tIf this analysis holds, what does it mean for the rest of Netflix’s slate, which is as robust as it’s ever been? The streaming giant is backing “Frankenstein” from Oscar-winning director Guillermo del Toro; “Jay Kelly,” Noah Baumbach’s Hollywood-centric comedy that seems tailor-made for Academy voters; and “A House of Dynamite,” Kathryn Bigelow’s return to high-stakes political storytelling.\n\n\tIf “Train Dreams” is already leading the charge with critical acclaim and emotional resonance, Netflix may be poised for a multi-pronged awards campaign that spans genre, tone and prestige — a rare position of strength in today’s fragmented Oscar landscape. It’s worth remembering that in 2022, the German war drama “All Quiet on the Western Front” became the streamer’s unexpected frontrunner after higher-profile titles like “Bardo,” “Glass Onion” and “White Noise” failed to connect on the festival circuit.\n\t\n\n\tThere’s still plenty of time before Oscar nominations are announced — or before any major awards bodies weigh in. But if there’s a film waiting to slip past the noise and speak directly to voters’ hearts, it might just be “Train Dreams,” the season’s unexpected elegy.\n\n\tThis week’s updated Oscar predictions are below.\n\n\n\n\t\n\n\t\t\t\t\tTrain Dreams. (Featured) William H. Macy as Arn Peeples and Joel Edgerton as Robert Grainier in Train Dreams. Cr. BBP Train Dreams. LLC. © 2025.\n\t\t\t\t\t\t\t\t\tCourtesy of Netflix\n\t\n\n\n\n\t*** = PREDICTED WINNER(All predicted nominees below are in alphabetical order)\n\t\n\t\tOscars Predictions Tracking(Oct. 23, 2025)\t\n\n\tBest Picture“Avatar: Fire and Ash” (20th Century Studios)“Frankenstein” (Netflix)“Hamnet” (Focus Features) “It Was Just an Accident” (Neon)“Marty Supreme” (A24)“One Battle After Another” (Warner Bros.) ***“Sentimental Value” (Neon)“Sinners” (Warner Bros.)“Train Dreams” (Netflix)“Wicked: For Good” (Universal Pictures)\n\n\tDirectorPaul Thomas Anderson, “One Battle After Another” (Warner Bros.) ***Ryan Coogler, “Sinners” (Warner Bros.)Jafar Panahi, “It Was Just an Accident” (Neon)Joachim Trier, “Sentimental Value” (Neon)Chloé Zhao, “Hamnet” (Focus Features)\n\n\tActorTimothée Chalamet, “Marty Supreme” (A24) ***Leonardo DiCaprio, “One Battle After Another” (Warner Bros.)Ethan Hawke, “Blue Moon” (Sony Pictures Classics)Michael B. Jordan, “Sinners” (Warner Bros.)Wagner Moura, “The Secret Agent” (Neon) \n\n\tActressJessie Buckley, “Hamnet” (Focus Features) ***Cynthia Erivo, “Wicked: For Good” (Universal Pictures)Kate Hudson, “Song Sung Blue” (Focus Features)Renate Reinsve, “Sentimental Value” (Neon)Amanda Seyfried, “The Testament of Ann Lee” (Searchlight Pictures)\n\n\tSupporting ActorBenicio Del Toro, “One Battle After Another” (Warner Bros.)Paul Mescal, “Hamnet” (Focus Features)Sean Penn, “One Battle After Another” (Warner Bros.) ***Andrew Scott, “Blue Moon” (Sony Pictures Classics)Stellan Skarsgård, “Sentimental Value” (Neon) \n\n\tSupporting ActressElle Fanning, “Sentimental Value” (Neon)Ariana Grande, “Wicked: For Good” (Universal Pictures) ***Regina Hall, “One Battle After Another” (Warner Bros.)Amy Madigan, “Weapons” (Warner Bros.)Teyana Taylor, “One Battle After Another” (Warner Bros.)\n\n\tCasting“Frankenstein” (Netflix) — Robin D. Cook“Hamnet” (Focus Features) — Nina Gold“Marty Supreme” (A24) — Jennifer Venditti“One Battle After Another” (Warner Bros.) — Cassandra Kulukundis“Sinners” (Warner Bros.) — Francine Maisler ***\n\n\tOriginal Screenplay“It Was Just an Accident” (Neon) — Jafar Panahi“Jay Kelly” (Netflix) — Noah Baumbach, Emily Mortimer“Marty Supreme” (A24) — Ronald Bronstein and Josh Safdie“Sentimental Value” (Neon) — Joachim Trier and Eskil Vogt “Sinners” (Warner Bros.) — Ryan Coogler ***\n\n\tAdapted Screenplay“Hamnet” (Focus Features) — Chloé Zhao ***“One Battle After Another” (Warner Bros.) — Paul Thomas Anderson “Song Sung Blue” (Focus Features) — Craig Brewer“Train Dreams” (Netflix) — Clint Bentley and Greg Kwedar“Wake Up Dead Man: A Knives Out Story” (Netflix) — Rian Johnson\n\t\n\n\tAnimated Feature“Arco” (Neon)“In Your Dreams” (Netflix)“KPop Demon Hunters” (Netflix) ***“Little Amélie or the Character of Rain” (GKids)“Zootopia 2” (Walt Disney Pictures) \n\n\tProduction Design“Avatar: Fire and Ash” (20th Century Studios)“Frankenstein” (Netflix)“Hamnet” (Focus Features)“Sinners” (Warner Bros.) “Wicked: For Good” (Universal Pictures) ***\n\n\tCinematography“Bugonia” (Focus Features)“Hamnet” (Focus Features)“One Battle After Another” (Warner Bros.)“Sinners” (Warner Bros.) ***“Train Dreams” (Netflix)\n\n\tCostume Design“Blue Moon” (Sony Pictures Classics)“Frankenstein” (Netflix)“Hamnet” (Focus Features)“Sinners” (Warner Bros.) “Wicked: For Good” (Universal Pictures) ***\n\n\tFilm Editing“Hamnet” (Focus Features)“Marty Supreme” (A24)“One Battle After Another” (Warner Bros.) ***“Sinners” (Warner Bros.)“Wicked: For Good” (Universal Pictures)\n\n\tMakeup and Hairstyling“Frankenstein” (Netflix) ***“The Long Walk” (Lionsgate)“Sinners” (Warner Bros.)“The Smashing Machine” (A24) “Wicked: For Good” (Universal Pictures) \n\n\tSound“Avatar: Fire and Ash” (20th Century Studios)“F1” (Apple Original Films/Warner Bros.)“A House of Dynamite” (Netflix) “One Battle After Another” (Warner Bros.) ***“Wicked: For Good” (Universal Pictures)\n\n\tVisual Effects“Avatar: Fire and Ash” (20th Century Studios) ***“The Fantastic Four: The First Steps” (Marvel Studios)“How to Train Your Dragon” (Universal Pictures)“Superman” (Warner Bros.)“Wicked: For Good” (Universal Pictures)\n\n\tOriginal Score“Ballad of a Small Player” (Netflix) — Volker Bertelmann“Bugonia” (Focus Features) — Jerskin Fendrix“Hamnet” (Focus Features) — Max Richter“One Battle After Another” (Warner Bros.) — Jonny Greenwood“Sinners” (Warner Bros.) — Ludwig Göransson ***\n\n\tOriginal Song“Dream as One” from “Avatar: Fire and Ash” (20th Century Studios)“Golden” from “KPop Demon Hunters” (Netflix) ***“I Lied to You” from “Sinners” (Warner Bros.)“Last Time (I Seen the Sun)” from “Sinners” (Warner Bros.)“The Girl in the Bubble” from “Wicked: For Good” (Universal Pictures) \n\n\tDocumentary Feature“The Alabama Solution” (HBO Documentary Films) ***“Come See Me in the Good Light” (Apple Original Films) “The Perfect Neighbor” (Netflix) “The Tale of Silyan” (National Geographic)“2000 Meters to Andriivka” (PBS)\n\t\n\n\tInternational Feature“It Was Just an Accident” from France (Neon) “No Other Choice” from South Korea (Neon)“The Secret Agent” from Brazil (Neon)“Sentimental Value” from Norway (Neon) ***“The Voice of Hind Rajab” from Tunisia (U.S. Distributor TBD)\n\n\tTop 4 projected Oscar nomination leaders (films): “One Battle After Another” and “Sinners” (13); “Hamnet” (11); “Wicked: For Good” (10); “Sentimental Value” (7)\n\n\tTop 4 projected Oscar nomination leaders (studios): Warner Bros. (29); Netflix (16); Focus Features and Neon (15); Universal Pictures (11)\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why ‘Train Dreams’ Could Be the Best Picture Sleeper of the Oscar Season",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/Train-Dreams-Clint-BTS-1.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-24T15:15:00.000Z",
      "dateModified": "2025-10-24T15:15:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jonah Hauer-King on His ‘Frightening’ Role in ‘A House of Dynamite’ and Sharing Scenes With Idris Elba: ‘Two Arsenal Fans Making Monumental Decisions About the U.S. Military’",
    "url": "https://variety.com/2025/film/global/jonah-hauer-king-a-house-of-dynamite-idris-elba-1236558298/",
    "image": "https://variety.com/wp-content/uploads/2025/10/Hauer-King-A-House-of-Dynamite.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-24T14:20:00.000Z",
    "description": "\n\tJonah Hauer-King has a line in “A House of Dynamite” so disturbing that friends are now texting it to him as soon as they see the film. “Some don’t ",
    "body": "\n\tJonah Hauer-King has a line in “A House of Dynamite” so disturbing that friends are now texting it to him as soon as they see the film. “Some don’t write anything other than that line,” he says. \n\n\tCharting the chaos within America’s halls of power as an atomic bomb hurtles toward the U.S., Kathryn Bigelow’s thriller — landing on Netflix Friday — sees the busy actor play a clean-cut military aide tasked with shadowing the president (Idris Elba) while carrying the famed satchel of nuclear strike options and launch codes. In one late scene, with retaliation apparently the only choice and the satchel well and truly opened, he compares three scenarios of expanding apocalyptic proportions with the chilling calm as if he was reading out choices on a lunch menu.\n\t\n\n\t“We actually call them rare, medium and well done,” he tells the considerably more distressed POTUS. ‘Well done,’ presumably, would be near total planetary destruction.\n\n\n\tThe line — now regularly pinging onto Hauer-King’s phone — is made even more alarming through the fact it wasn’t a piece of fiction put in by “A House of Dynamite” writer Noah Oppenheim.\n\n\t“It’s so brutal, but it’s also true,” says Hauer-King, speaking from his home in North London. “We checked — it was an anecdotal thing. That wasn’t just made up. That’s not to say it’s the military as a whole, but at least one individual referred to it like that, and that’s, yeah, really frightening!”\n\n\tHauer-King’s lieutenant commander is one of the smaller characters in “House of Dynamite.” Alongside Idris as the president, the lead ensemble cast of increasingly frantic White House officials, security advisors and senior military figures includes the likes of Rebecca Ferguson, Greta Lee, Gabriel Basso, Jared Harris, Jason Clarke and Tracy Letts. But while it’s a relatively brief appearance (he doesn’t show up until the film’s final third), his straight-faced, emotionless and clinical demeanor — not to mention his dazzlingly pristine white army uniform — as he carries the keys to the end of the world makes him the movie’s most terrifying element.\n\t\n\n\tHe is, effectively, presented as the handsome, clean-shaven and slick-haired face of nuclear annihilation.\n\n\t“The character I play has such a strange job,” says the 30-year-old. “They’re relatively young in their military career, and they’re given this big weight of responsibility and are trained within an inch of their life. They have to always be alert and calm. And they’re just there, lurking in the background, following the president and waiting for worst possible thing to happen — but obviously the hope is that they’re never actually called into action.”\n\n\tBigelow described the character to her actor as someone who “takes their job with the utmost seriousness and who feels quite honored to do that job,” he says. “My understanding is that this is someone on the rise and it would be considered a badge of honor.”\n\n\tBut it’s a mindset that’s extremely hard to get into, Hauer-King admits, with the “well done” anecdote pointing to mental strategy that’s required to deal with it all. \n\n\t“Some people say that it’s almost necessary working in those jobs that you have a level of disconnect… but for us it’s so shocking,” he says.\n\n\tBigelow’s films — and especially the likes of “A House of Dynamite,” “Zero Dark Thirty” or “The Hurt Locker” that take a deep dive into military protocol — “live and die on their authenticity,” says Hauer-King, who claims there were more historical and military advisers on set than any other department. Such rich level of research proved to be especially useful to him, as he could only dig so far into his role. “I couldn’t exactly talk to a person who had done that job — I think would be far too classified!” he says.\n\n\tWhen Hauer-King first auditioned for “A House of Dynamite” his agent said a “potential stumbling block” was that he was not American, so they’d been touting his dual-citizenship (his mother is the California-born therapist and theater producer Debra Hauer, while his father is British restauranteur Jeremy King, who helped revive The Ivy). They needn’t have bothered. As the actor notes — and as he discovered the first day on set — most of the cast wasn’t American.\n\n\tIt didn’t go unnoticed between himself and Elba — who effectively have a decisive hand over America’s nuclear arsenal and the fate of humankind — that they’re both Londoners.\n\t\n\n\t“We did have a laugh about two Arsenal fans driving around in the presidential beast and making these monumental choices about the U.S. military,” he recalls.\n\n\t“A House of Dynamite” marks the third in a trio of recent releases starring Hauer-King, who has been steadily shifting the gears upwards over the last couple of years.\n\n\tHaving broken out on the big screen with the instant actor box-ticking role of a Disney prince, capturing Halle Bailey’s heart in “The Little Mermaid,” he entered darker waters as the lead in 2024’s devastating Holocaust TV drama “The Tattooist of Auschwitz.” But 2025 has firmly accelerated his move from rising talent to in-demand star with three films and three wildly different performances.\n\n\tEarlier this summer, he was among the main cast of — mostly — bloody victims in Jennifer Kaytin Robinson’s silly and decidedly self-aware slasher reboot-sequel hybrid “I Know What You Did Last Summer” for Columbia Pictures (a role he says he landed after a recommendation from “close friend” Maya Hawke). Then came Chad Hartigan’s rom-com “The Threesome,” playing a man for whom a one-time ménage à trois (with Zoey Deutch and Ruby Cruz) results in a somewhat complicated double set of pregnancies (and some comically awkward hospital scenes). And now he’s about to help blow the world to pieces for Bigelow.\n\n\tCoincidentally, the three films have one connecting factor — Hauer-King plays an American in each one. “It just happened like that,” he insists. “It wasn’t a choice.” But he worked hard to perfect three different accents (for “The Threesome,” he says he styled his on a then little-known singer called Benson Boone). \n\n\n\n\t\n\n\t\t\t\t\tHauer-King in ‘The Threesome’\n\t\t\t\t\t\t\t\t\tKai Caddy\n\t\n\n\n\n\tNext up, he’s playing another American — this time the real-life Mark Vonnegut, son of Kurt — in “The Eden Express,” based on his 1975 memoir about fleeing Nixon’s America to set up a commune in British Columbia. Hauer-King notes that they shot in Powell River, “where the story is actually set.” Then there’s “The Face of Horror,” the next feature from Anna Biller, best known for 2016’s cult and kooky retro horror film “The Love Witch.” “At its core it’s a horror — it’s gory and it’s a ghost story,” he says. “But it definitely has that same style where it can be funny, and also an homage aesthetically to the Technicolor films of the ’40s and ’50s.”\n\t\n\n\t“The Face of Horror” also offers a Hauer-King a rare break from the American twang. “I’m playing a medieval knight, so it’s a kind of heightened RP [received pronunciation] — it’s all very proper and over top.”\n\n\tWith a growing resume and swift climb up the call sheet as his in-demand status continues to rise, it could be easy for things to go Hauer-King’s head. But the actor says he recently received a very welcome lesson in humility and from the “A House of Dynamite” POTUS himself as they drove around in the presidential limousine.\n\n\t“It was a challenging scene. There’s a lot going on, especially for Idris, because he’s talking to me, he’s dealing with a telephone call, which had been pre-recorded, but involved a lot of lines. And we’re also on this random highway,” he recalls. “And after the first take, he looked at me and just said: ‘That was really hard.’ It was a really nice reminder that even someone like him can find this difficult. And not everyone reacts like that.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jonah Hauer-King on His ‘Frightening’ Role in ‘A House of Dynamite’ and Sharing Scenes With Idris Elba: ‘Two Arsenal Fans Making Monumental Decisions About the U.S. Military’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/Hauer-King-A-House-of-Dynamite.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-24T14:20:00.000Z",
      "dateModified": "2025-10-24T14:20:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Brandi Carlile’s ‘Returning to Myself’ Is a Moving Look at Love, Mortality and the Search for the Heart of the Matter: Album Review",
    "url": "https://variety.com/2025/music/album-reviews/brandi-carlile-returning-to-myself-ialbum-review-1236560522/",
    "image": "https://variety.com/wp-content/uploads/2025/10/Brandi-Critics-Pick.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-24T13:23:51.000Z",
    "description": "\n\tBrandi Carlile begins her new album with a verse raising the issue of mortality, and the question of what a godly design for these fleeting lives mi",
    "body": "\n\tBrandi Carlile begins her new album with a verse raising the issue of mortality, and the question of what a godly design for these fleeting lives might be, if any at all. “Is there some freewheeling watcher / Shooting marbles in the sky?” she asks as the title track starts to unfold. “Holding your years between their fingers / Watching it burn ‘til the fire dies.” No, fans don’t have to listen long to learn: The themes are not going to be especially trivial on “Returning to Myself,” her eighth and possibly most moving solo release.\n\t\n\n\tIf you had to boil the record down, you might get away with summarizing it this way: Even bigger picture, slightly smaller sound. This much is guaranteed for most any listener: You will spend a good amount of time following lyrical prompts to think about what you’re doing on the planet, in a carpe diem kind of way. You will also spend a decent amount of the album thinking about Joni Mitchell, because Carlile has picked up and set so many musical Easter eggs from her famous friend’s distinctive vocal and playing styles — and also, yes, because there is a song on the record called “Joni”! (In which every line is about Joni Mitchell!) Also, you will be lulled, to a certain extent, because “Returning to Myself” goes fairly gentle on your mind and ears, except for the outlier, “Church & State,” which rocks with more intensity than just about anything she’s done.\n\n\n\tPutting an exception like that aside, anyhow, this is a singer/songwriter record in the classic sense. “Returning to Myself” in this case involves sort of returning to the 1970s, a little bit, when you’d put on an LP by a finger-picking sage and fully expect, however foolishly, that it could change your life. Who knows — this one might, in tiny increments, one acoustic guitar lick or exhortation to live fully at a time.\n\t\n\n\tCarlile has cited Emmylou Harris’ “Wrecking Ball” as an inspiration for how she approached this album — talking about how the collaborative nature of it changed the course of Harris’ career, for starters. By inference, Andrew Watt, her principal co-producer on the project, is Daniel Lanois in this scenario. And maybe this is the first time in history those two guys have ever been compared: However versatile he might actually be, Watt is probably most famous for making big, bombastic rock records, and Lanois… is not. But there is some pleasing difference-splitting going on here, as sound goes. Watt turns out here to be good with touches that we maybe haven’t heard so much on his Ozzy or Peal Jam records, like the sound of fingers lightly brushing against strings as a hand goes up and down a guitar neck, right from the opening bars of the title song, When other instruments gradually drop in over the course of that track, they’re kept at the kind of etheareal distance that a Lanois could approve of. And then, sure, ultimately, Watt is going to go big before he goes home. Neither he nor Carlile are going to let the generally quieter nature of this album stand in the way of some of the grandly anthemic moments we’d expect from either of them.\n\n\tThere are other big-name producer/writer collaborators on the album, too, though they don’t get the same screen time that Watt does. Aaron Dessner is more limited in his contributions, but they really set the tone for “Returning to Myself” in a way that just counting up the number of tracks he worked on doesn’t fully get at. Carlile was at Dessner’s woodsy New England retreat when she wrote the poem that became the album’s first song and its title track; even though that one ended up being a Watt co-production in the studio, his spiritual impact leaves a mark, at least. And on the five out of 10 tracks that Dessner did co-produce or co-write, his stamp is present to varying degrees. Most notably, you hear it in the acoustic riffing he provided as a bed for Brandi to top-line over in “War With Time.” That one is pure “Folklore”-meets-Brandi-Carlile, and no one should complain about that.\n\n\tBut the really interesting mongrel on this album, as production styles go, is “No One Knows Us,” the penultimate track, which is a true marriage of recognizable sensibilities, starting off sounding like a piece of Dessner acoustic minimalism and winding up sounding like a Watt jam, without too much apparent stitching as it makes those changes. But you also don’t really think too much about the Frankensteinian aspects of marrying Watt and Dessner signature styles when Carlile is distractingly delivering one of her most matter-of-fact-tear-jerking lyrics ever.\n\t\n\n\tIt’s fun to go on about what the respective co-producers brought to the project — and we haven’t even gotten yet to Bon Iver’s Justin Vernon, who gets a shared producer credit on one track (and also is part of the band on three more). But in the end, even with the novelty of some notably different sonic touches, no one will consider this “a producer’s album.” Carlile has never seemed not fully in control of her music, and her sensibility-ceding is only going to go so far, even with a trio of cherished newbies aboard. She continues to have the most commanding voice in contemporary popular music, for anyone interested in the intersection of prowess and the nuances of phrasing and emotion. And the material she writes for that voice is both tricky and hooky; poetic and conversational; and — the overarching thing — searingly honest. Every great voice should have a writer this remarkable living in the same house.\n\n\t“Returning to Myself,” the song, is framed as a debate Carlile is having with herself… and not really one that’s so much about the existence of God as the opening verse would suggest. It was written at a moment when she had decided to take time off from working with Joni to spend some time alone, standing on her own two feet… but also, apparently, chafing at the idea of reflective solitude as some kind of ideal. Ultimately, she finds some value in both alone time and community — but she’s not wishy-washy about it to not finally render a judgment about which side she prefers to err on. “I love you and you and you,” she sings in her best falsetto, and I think she’s singing to her fans and friends, not the Holy Trinity (though I couldkn’t rule it out). Anyway, it’s the kind of inner dialogue, with weight given to two sides of a philosophical issue, that we don’t often see in a pop song.\n\n\t“Human,” the most clear-and-present anthem on the album, was written around the time of last year’s presidential election. It offers some still-timely advice, for those afflicted with chronic political agita: “Baby, you’re gonna have a heart attack / And they won’t thank you / They don’t make awards for that.” Carlile points out that “I don’t need to see how it ends / To know that we’ll never be here again,” in case we missed that virtal information amid the doomscrolling. Perspective is everything, when we’re all on the clock.\n\t\n\n\tBut lest anyone think she is taking a “Don’t Worry, Be Happy” attitude toward Trumpism, there is a song later on taking MAGA seriously — “Church & State,” a rocker that gets angry enough to actually include a spoken-word recitation of part of a Thomas Jefferson letter that introduced the title phrase into the lexicon. From a musical point of view, meanwhile, it quotes U2. Not quite as directly, mind you, but you will hear the Hanseroth twins going Irish on us with this one, with Tim Hanseroth turning Edge-lord and Phil Hanseroth kicking up a bass part that is Adam Clayton-level phat. (The twins are featured throughout, as always, as players and writers, although a few tracks focus more on guest session people.)\n\n\tThankfully, the album’s emphasis on the big themes of living in the moment doesn’t mean she can’t spend a few songs bearing down on the littler aspects of relationship dysfunction. “A Woman Oversees,” one of the more overtly Joni-esque numbers here, tells a peculiar story of a moment in a relationship where you realize you’re oversharing while the other person is withholding, and the unease of reckoning with that imbalance. “Anniversary” also deals with a relationship gone wrong, but as far as I can tell, it’s actually a love song, in which the positive aspects of a partnership that works finally blot out the unhappy memories that used to come up on the anniversary date for that regrettable affair of the past. Or maybe that’s not it at all — Carlile usually couldn’t be more eager to communicate with her audience, but she does have those welcome moments of leaving things a bit more mysterious.\n\n\t“Joni” may be the most talked about song on the album, for what Carlile has to say about and to her friend, and for all the musical quirks that she borrows from Mitchell for the homage. The out-of-time rhythms coming through Blake Mills’ baritone guitar parts; the Mark Isham horn solos that could be straight out of a ‘90s-era record like “Taming the Tiger”… it’s an impressive cornucopia of Mitchell-isms that couldn’t be put to better or certainly more self-conscious use. The homage is tender, but also edgy in a way that you have to imagine would impress Mitchell, with its lack of syncophantic puffery: “She doesn’t suffer fools / She won’t make cups of tea / And she doesn’t bandage bruised egos,” Carlile sings — before getting to the cool stuff that Joni Mitchell does do, like “speak in sacred language every soul could understand.” Beyond the amusing jokes, Carlile’s point seems to be that Mitchell doesn’t need to be the world’s most flagrant empath to be one of its greatest healers.\n\t\n\n\tCarlile has commented that some early listeners have taken this as a “divorce album,” which it’s decidedly not. Maybe some of the confusion comes from the song “You Without Me,” or at least its title, which is not actually about the end of a love affair but the end of childhood fealty to a mother’s influence and wishes. It’s about the joy and terror of realizing that your kids are not your Mini-Mes, in other words, and not many parents will make it through this one without feeling 150% of the feels. The double-tracking that Watt and Carlile do with her voice here is a bit distracting — like maybe they thought an effect was needed to keep her solo vocal from sounding too simple or traditional — but the overwhelming sentiment nonetheless makes this one of Carlile’s most affecting compositions to date. (If it sounds familiar, this track has been carried over, without change, from the collaborative album she had out with Elton John earlier in 2025.)\n\n\tAs good as that parent/child anthem is, it’s the last two tracks on the album that fire most powerfully on every cylinder. Over a slightly tense Dessner guitar lick, Carlile opens with the musical question: “Hey, can you get out of bed today?” And if that alone doesn’t get you, either as someone who suffers from depression or knows someoe who does, nothing else could. She’s singing most obviously about checking in on a childhood friend who may be having some issues. But in the even greater sense, it’s a beautiful song about the connections and secrets that only two people share, no matter how many other friends they may have — and the everyday tragedy of what happens when either death or mere disconnection wipes out what was built up. It’s a hopeful heartbreaker.\n\n\tThe same can be said of the finale, “A Long Goodbye,” which goes even further — as the title would indicate — in repeatedly raising the spectre of death in the service of advocating for life. Carlile includes some of her most plainly autobiographical lyrics, at the beginning and end (like her first plane trip, one state over, to Idaho, as an adult, an anecdote familiar from her bestselling memoir of a few years back). But she intersperses images of others dying by accident or suicide, to say: “Yeah, we’re all just a broken heart away / From making a promise that we’re forced to keep.” In a gorgeous coda that may be the single best minute of music she’s ever put on record, Carlile makes it personal again, quoting her beloved Indigo Girls (“It’s only life after all”), Sammy Cahn (“Let it snow…”) and Raymond Chandler (the title itself) in a death-accepting, life-affirming blast of transcendence. You might have to go back to the Beatles’ “The End” to think of an album with an ending that stirs up so much emotion with its closing sense of finality as this one.\n\t\n\n\tIs this Carlile’s best album? That’s hard to say. “By the Way, I Forgive You” is pretty hard to top, as one of the landmark singer/songwriter albums of the 21st century. That one might have been more of a tour de force, and this might be more tightly focused — musically, with its tendency toward more of an acoustic guitar core, and lyrically, with its hyperfocus on cutting through the detritus that surrounds us to get to the heart of the matter. However you want to rate it, you may come back to something she sings in “A War With Time,” a plaintive memory song with an encomium that applies here: “None of it was overrated.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Brandi Carlile’s ‘Returning to Myself’ Is a Moving Look at Love, Mortality and the Search for the Heart of the Matter: Album Review",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/Brandi-Critics-Pick.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-24T13:23:51.000Z",
      "dateModified": "2025-10-24T13:23:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The 10 Best Demi Lovato Songs of All Time",
    "url": "https://variety.com/lists/best-demi-lovato-songs/",
    "image": "https://variety.com/wp-content/uploads/2025/10/img-3-e1761261552368.jpg?crop=0px%2C0px%2C2509px%2C1411px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-10-24T14:00:00.000Z",
    "description": "\n\t\n\t\t\t\n\t\t\t\t\n\t\n\t\n\tOct 24, 2025 7:00am PT\t\n\t\n\n\t\t\t\n\n\n\t\t\t\n\t\t\t\n\t\n\n\t\t\t\t\t\t\t\t\tAlign\n\t\n\n\t\t\n\t\n\t\t\t\t\n\n\tIf anything, Demi Lovato is a creature of reinvention. From",
    "body": "\n\t\n\t\t\t\n\t\t\t\t\n\t\n\t\n\tOct 24, 2025 7:00am PT\t\n\t\n\n\t\t\t\n\n\n\t\t\t\n\t\t\t\n\t\n\n\t\t\t\t\t\t\t\t\tAlign\n\t\n\n\t\t\n\t\n\t\t\t\t\n\n\tIf anything, Demi Lovato is a creature of reinvention. From her shiny pop-rock beginnings as a “Camp Rock” starlet to her freshly released ninth album “It’s Not That Deep,” the 33-year-old has pushed the boundaries of her artistry as both a performer and an artist, trying on different sonic outfits and developing her approach as she’s become one of the singular vocalists of her time.\n\n\tOver the years, Lovato has embraced everything from tween pop and big tent EDM to R&B-brushed ballads and thrashing rock, dropping a trail of bangers in her wake. And she’s done it convincingly every time. Lovato has managed to etch a place for herself in the pantheon of homegrown Disney stars who have established a voice and, more importantly, an identity of their own, unafraid to challenge themselves and go where their artistic compass points them.\n\n\tOn “It’s Not That Deep,” she floats towards the dance floor for a rollicking ride. The album is all-night club sweat and glitter, a reminder that not all Demi music has to have deep emotional weight to have impact. In honor of the album’s release, Variety takes a look back at the singer’s 10 best songs, listed alphabetically.\n\n\n\t\t\t\n\t\t\t\n\tCool for the Summer\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: YouTube\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tThe glimmering piano keys that open “Cool for the Summer” are deceptively serene. You don’t immediately expect the gritty guitar work that follows – a satisfying nod to Demi’s early pop-rock roots – all wrapped in sleek production and an irresistibly catchy pop hook. The sound is bold and unapologetically loud, perfectly matching her signature powerhouse vocals, and it stands as one of her sexiest songs to date. It’s also one of Max Martin and Ali Payami’s finest collaborations with her, showcasing her deft balance between intensity and restraint. — Garcia\n\t\t\n\t\t\t\n\t\t\t\n\tDaddy Issues\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: YouTube\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tNot saying that toxic Demi is a good thing, but she sure makes it work for her on “Daddy Issues,” a standout on 2017’s “Tell Me You Love Me.” The splotchy synth track sees Demi acknowledging the fact that she’s going to act up in a relationship based on her bristly dynamic with her dad. But what truly sells “Daddy Issues” is how much levity there is to it, like she’s already won the race to the punchline. “You’re the man of my dreams / ‘Cause you know how to leave” isn’t just brutally honest; it’s self-awareness filtered through a comedic lens, and sometimes all you can do is laugh. — Horowitz\n\t\t\n\t\t\t\n\t\t\t\n\tDon’t Forget\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: YouTube\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tPart of the charm of Demi’s debut album “Don’t Forget” was how pure yet powerful she was in her performance, adapting the pop-rock leanings of the Jonas Brothers to her talents as she worked with the trio across six songs on the record. The resulting title track stood among their best, a tune that snaps from a whisper to a roar as Demi mourns the loss of a relationship. It’s raw, ripe and forceful in that early Hollywood Records mold, a song that’s catchy as hell even to this day. — Horowitz\n\t\t\n\t\t\t\n\t\t\t\n\tHeart Attack\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: YouTube\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\tOne of Demi’s career-defining singles, “Heart Attack” is a pop treasure: raw, emotional and fiercely dynamic. Built on a foundation of catchy hooks (“I think I’d have a heart attaaa-aaa-aaack”) made for pop radio, the focus track for her self-titled debut was meant to make a statement of unapologetic intensity.\n\n\tThe bridge delivers the song’s most electrifying moment, culminating in one of her most unforgettable belts, while the pre-chorus remains an instant adrenaline rush. It feels mandatory to highlight the rock version on “Holy Fvck,” which takes everything that made the original great and raises it to an entirely new level. — Garcia\n\n\t\t\n\t\t\t\n\t\t\t\n\tLa La Land\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: YouTube\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tLet’s get one thing straight – “La La Land” has aged incredibly and surprisingly well. The crunchy guitar riff that anchors the bridge still proves that even at 15, Demi’s spark was rooted in her unmistakable pop-rock grit. Whether it was a label move or her own instinct, leaning into that sound instead of chasing glossy pop may have set her behind her Disney peers commercially, but it paid off in the end. The result was something refreshingly unfiltered, loud and gutsy enough of an introduction to an artist already carving out her own (and durable) path. — Garcia\n\t\t\n\t\t\t\n\t\t\t\n\tMy Love Is Like a Star\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: YouTube\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tNestled deep on Demi’s 2011 third album “Unbroken” sits “My Love Is Like a Star,” one of her most underrated and under-acknowledged ballads. She had set the stage for her career by leaning into the pop-rock of the late aughts, only to tamper with the formula on “Unbroken” by exploring hip-hop and R&B tropes via collabs with Missy Elliott and Timbaland. “My Love Is Like a Star” is an R&B ballad in the purest sense, sustained by organ chords and thudding percussion and framed around an extended metaphor that reinforces the strength of a relationship despite distance. It stands as one of Demi’s purest vocal performances from her early years, a true gem in her discography. — Horowitz\n\t\t\n\t\t\t\n\t\t\t\n\tNeon Lights\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: YouTube\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tWhen “Neon Lights” arrived in 2013, it marked a clear shift for Demi, moving her sound squarely into EDM and the club-pop trends dominating the decade. Coming off the emotional weight of “Skyscraper,” and in a separate lane from her rock-imbued hits, she embraced glossy synths and dance-floor-ready beats that kept her as a mainstay on radio. A decade later, “Neon Lights” stands as an important stepping stone toward the more mature, club-ready sound she would come to fully explore on “It’s Not That Deep.” — Garcia\n\t\t\n\t\t\t\n\t\t\t\n\tRuin the Friendship\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: YouTube\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tWhen Demi enters smolder mode, she rarely misses. On “Ruin the Friendship,” she sings of giving in to the urge to leap from friends to more, history be damned, and does so while largely sticking to her lower register as horns pipe in around her. It’s an exercise in artistic restraint that contrasts the daring nature of the song itself, a nimble balance to strike, and one that she does with ease. For those keeping track of Demi lore, the rumor mill has been swirling for years that she wrote this about Nick Jonas — and while she has never addressed the chatter, it certainly gives it even more heft. — Horowitz\n\t\t\n\t\t\t\n\t\t\t\n\tSkyscraper\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: YouTube\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tThis song crystallized Demi’s artistic identity, pushing past her Disney past to reveal something bruised. It’s not sonically complex, built atop a looping piano line that steadily grows, but her vocal performance transforms the song altogether. “Skyscraper” also feels obviously distinct from her more pop-leaning anthems; it’s less about celebrating triumph than about surviving long enough to reach it. That lived-in honesty is what makes the song timeless. — Garcia\n\t\t\n\t\t\t\n\t\t\t\n\tSorry Not Sorry\n\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\n\tIt’s no secret that Demi tends to be brassy — her discography is punctuated by forceful belting straight from the gut. So when she dropped “Sorry Not Sorry,” the first single from her 2017 album “Tell Me You Love Me,” it ushered in the era with a bang, showcasing a much more confident Demi with a slapper of a song to match. Living her ultimate revenge fantasy, she looks in the mirror and bigs herself up with an even bigger-sounding chorus, exploding into taunts against the most casual of haters. It’s a song that’s lived on in pop culture (spawning one of the most iconic “Drag Race” lip-syncs), and rightfully so. — Horowitz\n\t\t\n\t\n\t\n\n\n\t\n\t\tMore from Variety\n\t\n\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\n\n\t\t\n\n\t\n\t\tMore From Our Brands\n\t\n\t\n\t\t\n\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\n\tRolling Stone\n\n\t\t\t\t\t‘Deliver Me From Nowhere’: Fact-Checking the Bruce Springsteen Biopic\t\t\n\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\n\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\n\tRobb Report\n\n\t\t\t\t\tA Comedian and an Heiress Have Put Their Vintage L.A. Mansion on the Market at $22 Million\t\t\n\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\n\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\n\tSportico\n\n\t\t\t\t\tDem Senators Urge Ted Cruz to Reject SCORE Act’s NCAA Immunity\t\t\n\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\n\t\t\n\t\n\t\n\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The 10 Best Demi Lovato Songs of All Time",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/img-3-e1761261552368.jpg?crop=0px%2C0px%2C2509px%2C1411px&resize=1000%2C563"
      ],
      "datePublished": "2025-10-24T14:00:00.000Z",
      "dateModified": "2025-10-24T14:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "LMFAO 'Memba Them?! \"Party Rock!\"",
    "url": "https://www.tmz.com/2025/10/24/lmfao-memba-them-party-rock/",
    "image": "https://imagez.tmz.com/image/08/16by9/2025/10/23/0892b2517f334ce598dfe6a7b5f8a879_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-24T07:30:39.000Z",
    "description": "\n    \n                    \n                          LMFAO\n                          'Memba Them?!\n                          \"Party Rock!\"\n           ",
    "body": "\n    \n                    \n                          LMFAO\n                          'Memba Them?!\n                          \"Party Rock!\"\n                      \n                  \n                        Published October 24, 2025 12:30 AM PDT\n                                                                            \n      \n    \n          Electric duo LMFAO -- made up of Redfoo and Sky Blu -- stormed the music charts with their hit songs \"Party Rock Anthem\" and \"Sexy And I Know It\" back in 2009.\n      \n    \n          In 2012, they went their separate ways to focus on solo careers -- and have yet to reunite for a PARTY!\n      \n    \n          \"Party rock is in the house tonight. Everybody just have a good time. And we gon' make you lose your mind. We just wanna see you, Shake that!\"\n      \n    \n          Guess what they look like now!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Memba Them\n              \n                          \n                Photo Galleries\n              \n                          \n                Music\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "LMFAO 'Memba Them?! \"Party Rock!\"",
      "image": [
        "https://imagez.tmz.com/image/08/16by9/2025/10/23/0892b2517f334ce598dfe6a7b5f8a879_xl.jpg"
      ],
      "datePublished": "2025-10-24T07:30:39.000Z",
      "dateModified": "2025-10-24T07:30:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Walk Into These Daisy Dukes -- Guess Who!",
    "url": "https://www.tmz.com/2025/10/24/walk-into-these-daisy-dukes-guess-who/",
    "image": "https://imagez.tmz.com/image/c9/16by9/2025/10/23/c91d1252a74a47d999d8c4e9db21ea50_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-24T07:01:38.000Z",
    "description": "\n    \n                    \n                          Guess Whose\n                          Daisy Dukes ...\n                          Yeehaw 🤠!\n      ",
    "body": "\n    \n                    \n                          Guess Whose\n                          Daisy Dukes ...\n                          Yeehaw 🤠!\n                      \n                  \n                        Published October 24, 2025 12:01 AM PDT\n                                                                            \n      \n    \n      \n        \n              \n    \n    \n          Grab your boots and walk right up to this sexy star flashin' her daisy dukes! Can you guess which Hollywood hottie put her rockin' bod on display in these eye-popping shots?!\n      \n    \n          She snapped the photos in Nashville, Tennessee -- she's a retired professional wrestler most known for her tenure in WWE from 2011 - 2017. She's now a model and actress.\n      \n    \n          Some call her \"Summer\", some call her \"Danielle.\" Hit the gallery and score the \"Total Diva!\"\n      \n      \n              \n          \n                          \n                Hotties & Bodies\n              \n                          \n                Hot Bodies\n              \n                          \n                Guess Who\n              \n                          \n                Photo Galleries\n              \n                          \n                WWE\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Walk Into These Daisy Dukes -- Guess Who!",
      "image": [
        "https://imagez.tmz.com/image/c9/16by9/2025/10/23/c91d1252a74a47d999d8c4e9db21ea50_xl.jpg"
      ],
      "datePublished": "2025-10-24T07:01:38.000Z",
      "dateModified": "2025-10-24T07:01:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "FBI Director Kash Patel Torches Stephen A. Smith Over Trump-NBA Comment",
    "url": "https://www.tmz.com/2025/10/24/fbi-kash-patel-stephen-smith-donald-trump-nba/",
    "image": "https://imagez.tmz.com/image/e7/16by9/2025/10/24/e77d85912a2443119e363855d4010791_xl.png",
    "tag": "Entertainment",
    "date": "2025-10-24T12:45:11.000Z",
    "description": "\n    \n                    \n                          Kash Patel To Stephen A. Smith\n                          I Directed The NBA-Mafia Arrests, Not Tr",
    "body": "\n    \n                    \n                          Kash Patel To Stephen A. Smith\n                          I Directed The NBA-Mafia Arrests, Not Trump, Dumbass!!!\n                      \n                  \n                        Published October 24, 2025 5:45 AM PDT\n                                                                      |\n                Updated October 24, 2025 7:47 AM PDT\n                                    \n      \n    \n      \n        \n                    \n                  \n      \n                    Fox News\n          \n    \n          FBI Director Kash Patel blasted ESPN sportscaster Stephen A. Smith during a Fox News interview Thursday, calling him out for saying the \"single dumbest thing I’ve ever heard out of anyone in modern history.\"\n      \n    \n          Patel launched his verbal assault on Smith after Smith gave his theory on national TV about who he thinks was really behind the federal takedown of a major gambling ring that saw the arrests of Portland Trailblazers head coach Chauncey Billups and Miami Heat guard Terry Rozier — as well as members of 4 out of the 5 New York mafia families.\n      \n    \n          According to Smith, President Trump is on a retribution tour against what he perceives as his enemies in the sports world, including the NBA, for protesting against him. And, Smith says, the WNBA might be next on Trump's hit list.\n      \n\n          Enter Patel ... During his Thursday afternoon appearance on \"The Ingraham Angle,\" Patel didn't mince words when host Laura Ingraham asked him about Smith's theory.\n      \n    \n      \n      NEW: ESPN's Stephen A. Smith says the NBA game-rigging mafia-linked scandal uncovered by the FBI is President Trump's revenge, says this is only the beginning.\"Don't be surprised that the WNBA is next on his list.\"\"Because when you've got all of these protests that have been… pic.twitter.com/MkoqBStaKi— Collin Rugg (@CollinRugg) October 23, 2025\n              @CollinRugg\n          \n  \n    \n          Patel referred to Smith's statement as \"the single dumbest thing\" he's ever heard — before giving a shot to people living in Washington D.C.\n      \n    \n          The FBI honcho also made it clear that only he directed the arrests of more than 30 people across 11 states in the sprawling federal case involving wire fraud, money laundering, extortion, robbery, and illegal gambling.\n      \n    \n          Ball's in your court, Stephen.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Stephen A. Smith\n              \n                          \n                Kash Patel\n              \n                          \n                Donald Trump\n              \n                          \n                Terry Rozier\n              \n                          \n                Chauncey Billups\n              \n                          \n                TMZ Sports\n              \n                          \n                Crime\n              \n                          \n                Politix\n              \n                          \n                Fairly Legal\n              \n                          \n                Fights & Feuds\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "FBI Director Kash Patel Torches Stephen A. Smith Over Trump-NBA Comment",
      "image": [
        "https://imagez.tmz.com/image/e7/16by9/2025/10/24/e77d85912a2443119e363855d4010791_xl.png"
      ],
      "datePublished": "2025-10-24T12:45:11.000Z",
      "dateModified": "2025-10-24T12:45:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "TikTok Star Emman Atienza Dead at 19",
    "url": "https://www.tmz.com/2025/10/24/emman-atienza-dead-tiktok-star/",
    "image": "https://imagez.tmz.com/image/14/16by9/2025/10/24/14cd767661ec40b7894925fac9f8371d_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-24T14:08:24.000Z",
    "description": "\n    \n                    \n                          TikTok Star Emman Atienza\n                          Dead At 19\n                      \n           ",
    "body": "\n    \n                    \n                          TikTok Star Emman Atienza\n                          Dead At 19\n                      \n                  \n                        Published October 24, 2025 7:08 AM PDT\n                                                                      |\n                Updated October 24, 2025 8:45 AM PDT\n                                    \n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Emman Atienza -- known for her lifestyle videos on TikTok -- died at her home in Los Angeles Wednesday ... TMZ has learned.\n      \n    \n          According to the Los Angeles County Medical Examiner, Atienza's cause of death has been listed as suicide.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Emman's heartbroken father, a Filipino TV host, and mother, an entrepreneur and fitness guru, announced the tragic loss Friday morning, in a tribute to their late daughter.\n      \n\n          In an Instagram post, the family wrote ... \"She brought so much joy, laughter, and love into our lives and into the lives of everyone who knew her. Emman had a way of making people feel seen and heard, and she wasn’t afraid to share her own journey with mental health. Her authenticity helped so many feel less alone.\"\n      \n    \n          Waiting for your permission to load TikTok Post.\n      \n    \n          Emman has more than 800,000 followers on TikTok and 225,000 on Instagram. Her latest videos are mostly about getting settled in Los Angeles, where she moved this past summer.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          She was 19.\n      \n    \n          RIP\n      \n    \n          If you or someone you know is struggling or in crisis, help is available. Call or text 988 or chat 988lifeline.org.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Social Media\n              \n                          \n                RIP\n              \n                          \n                Celebrity Death\n              \n                          \n                Viral\n              \n                          \n                Fairly Legal\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "TikTok Star Emman Atienza Dead at 19",
      "image": [
        "https://imagez.tmz.com/image/14/16by9/2025/10/24/14cd767661ec40b7894925fac9f8371d_xl.jpg"
      ],
      "datePublished": "2025-10-24T14:08:24.000Z",
      "dateModified": "2025-10-24T14:08:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sabrina Carpenter Hilariously 'Arrests' Gigi Hadid at Pittsburgh Concert",
    "url": "https://www.tmz.com/2025/10/24/gigi-hadid-sabrina-carpenter-tour-arrest/",
    "image": "https://imagez.tmz.com/image/33/16by9/2025/10/24/33dd3ad9f65f45f0af09579d5ccc7d84_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-24T14:14:45.000Z",
    "description": "\n    \n                    \n                          Sabrina Carpenter\n                          Gigi Hadid ... You're Guilty as Charged!!!\n          ",
    "body": "\n    \n                    \n                          Sabrina Carpenter\n                          Gigi Hadid ... You're Guilty as Charged!!!\n                      \n                  \n                        Published October 24, 2025 7:14 AM PDT\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Gigi Hadid got cuffed by none other than Sabrina Carpenter ... and let’s just say, the pop star was burning up over the supermodel.\n      \n    \n          Check out the clip -- Sabrina had her sights set on Gigi during her \"Short n' Sweet\" tour in Pittsburgh Thursday evening, playfully asking the model in the crowd where she's from ... and when Gigi said Bucks County, Sabrina fired back with a flirty, \"Wow, maybe we're soulmates!\"\n      \n    \n        Waiting for your permission to load the Instagram Media.\n      \n    \n          Sabrina confessed she was \"hot and flustered\" over Gigi before slapping her with some furry pink handcuffs ... bold doesn’t even cover it!\n      \n\n          Cue \"Juno\" blasting as SC hypes the crowd to get louder, because Gigi was feeling \"beautiful and nervous.\"\n      \n    \n          Sabrina’s been running this cheeky \"celebrity arrest\" bit all tour ... and she’s already bagged Millie Bobby Brown and Margaret Qualley, and the list goes on.\n      \n    \n      \n        \n              \n    \n    \n          So when a literal Victoria’s Secret Angel like Gigi shows up? Yeah, no chance she was slipping past Sabrina’s sirens!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Sabrina Carpenter\n              \n                          \n                Gigi Hadid\n              \n                          \n                Music\n              \n                          \n                Fairly Legal\n              \n                          \n                Concerts and Tours\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sabrina Carpenter Hilariously 'Arrests' Gigi Hadid at Pittsburgh Concert",
      "image": [
        "https://imagez.tmz.com/image/33/16by9/2025/10/24/33dd3ad9f65f45f0af09579d5ccc7d84_xl.jpg"
      ],
      "datePublished": "2025-10-24T14:14:45.000Z",
      "dateModified": "2025-10-24T14:14:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]