[
  {
    "title": "How to Watch WWE Crown Jewel Live Online",
    "url": "https://variety.com/2025/shopping/news/how-to-watch-wwe-crown-jewel-online-livestream-1236545502/",
    "image": "https://variety.com/wp-content/uploads/2025/10/WWE-Crown-Jewel-Featured.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-11T08:00:00.000Z",
    "description": "If you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.  \tThe WWE goes to “The Land Down Under” with WWE Crown Jewel 2025. The...",
    "body": "\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.\n\n\tThe WWE goes to “The Land Down Under” with WWE Crown Jewel 2025. The seventh annual WWE premium live event (PLE) kicks off on Saturday, Oct. 11 in Australia. This is the first WWE Crown Jewel event outside of Saudi Arabia, where it originated.\n\n\tFor the event, there’s five matchups, including two title bouts: WWE Crown Jewel Championship and WWE Women’s Crown Jewel Championship.\n\n\tIn the main event, Crown Jewel features WWE superstar Cody Rhodes set to go head-to-head against Seth Rollins for the WWE Crown Jewel Championship. In addition, Stephanie Vaquer and Tiffany Stratton battle for the WWE Women’s Crown Jewel Championship belt.\n\n\n\tWant to watch WWE Crown Jewel online? Here’s what you need to know.\n\t\n\t\tWhen Is WWE Crown Jewel 2025? Date, Time\t\n\n\tWWE Crown Jewel takes place at RAC Arena in Perth, Australia on Saturday, Oct. 11, with a start time is 8 a.m. ET/5 a.m. PT (8 p.m. AWST). Coverage starts at 7 a.m. ET/4 a.m. PT (7 p.m. AWST).\n\n\tWatch all the action by livestreaming WWE Crown Jewel online with ESPN Unlimited. Purchase the livestream feed with prices starting at $29.99/month. \n\n\tESPN Unlimited features everything that ESPN has to offer, including access to all of its networks and streaming service, such as ESPN, ESPN2, ESPN3, ESPN on ABC, ESPNU, ESPNEWS, ESPN Deportes, SEC Network, ACC Network and ESPN+. It’s the ideal streamer for sports fans who want it all.\n\n\tRight now, you can bundle ESPN Unlimited with Disney+ and Hulu for the same price $29.99/month for 12 months. This limited-time deal is nearly a 40% savings, while you’re essentially getting Disney+ and Hulu for free for an entire year. Learn more about ESPN Unlimited here.\n\n\n\tAside from WWE Crown Jewel, ESPN Unlimited features news, analysis, commentary, highlights, original programming and more, as well as live sports from NFL, NBA, MLB, WNBA and other sports leagues.\n\t\n\t\tWWE Crown Jewel 2025: Main Card\t\n\n\tCheck out the Crown Jewel main card below, and stream it on ESPN Unlimited here.\n\n\tMatch Card, 8 a.m. ET/5 a.m. PT\n\n\nCody Rhodes (SmackDown’s Undisputed WWE Champion) vs. Seth Rollins (Raw’s World Heavyweight Champion) — WWE Crown Jewel Championship\nStephanie Vaquer (Raw’s Women’s World Champion) vs. Tiffany Stratton (SmackDown’s WWE Women’s Champion) — WWE Women’s Crown Jewel Championship\nJohn Cena vs. AJ Styles\nRhea Ripley and Iyo Sky vs. The Kabuki Warriors (Asuka and Kairi Sane)\nRoman Reigns vs. Bronson Reed — Australian Street Fight\n\n\n"
  },
  {
    "title": "Whodunits and Comedies Lead Breakout Australian TV Hits",
    "url": "https://variety.com/2025/tv/global/whodunits-comedies-australian-television-1236546357/",
    "image": "https://variety.com/wp-content/uploads/2025/10/Black-Snow.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-11T09:02:18.000Z",
    "description": "The Australian TV sector is alert but not alarmed, with production falling from historic highs, exec-level shuffles slowing the content pipeline and overseas jitters finally reaching our shores. But...",
    "body": "\n\tThe Australian TV sector is alert but not alarmed, with production falling from historic highs, exec-level shuffles slowing the content pipeline and overseas jitters finally reaching our shores. But Australian stories are still resonating with international audiences and many of the recent breakout hits have a mystery at their heart or offer a laugh with a bit of bite.\n\n\tWhen trade body Screen Australia asked industry reps to describe their feelings about the local biz, there was a range of concerns. Words like “worried,” “frustrated” and “disappointed” were floated but one word stood out from the rest: “hopeful.”\n\t\n\n\tOf the 1,000 TV professionals surveyed, 70% believe that the future of diverse storytelling on screen will either remain the same or improve; there were similarly high figures when producers were asked about collaboration and staying on top of industry trends. This positivity, however, was tested on questions like job security, with only 27% believing things will get better.\n\n\n\tThis reflects a local biz that has seen some turmoil recently. Screen Australia reported that in 2023-2024, there were just 15 Australian free-toair TV and broadcast video-on-demand dramas made for general audiences, generating 275 hours of content with budgets of $126 million. This figure is down from an average of 38 titles in the 2010s and an average of 29 titles in the 2000s. There has been an almost three-decade slow decline in the number of hours of local content in Australia.\n\n\t“It has undoubtedly been a quieter year, with the global slowdown and the challenges in international sales reaching our shores,” says Carly Heaton, head of scripted, Fremantle Australia. “At the same time, we’ve seen significant shifts in the commissioning teams at our local broadcasters, which has naturally created a period of uncertainty. That said, there’s a real sense that the dust is starting to settle. We’re seeing commissioning strategies taking shape, buyers re-engaging, and conversations beginning to focus on the next wave of content rather than the constraints of the last 12 months. This reset will ultimately create opportunities for bold, distinctive projects and a stronger year ahead.”\n\t\n\n\tKate Marks, Ausfilm CEO, acknowledges a slight decline in the number of inbound TV productions from the peak of a few years ago, but over the past year, the country has welcomed a healthy pipeline that she sees as a testament to the strength of Australia not only as a producer of quality local content, but also as a production partner internationally.\n\n\t“It’s been particularly gratifying to see Australian talent in key creative roles on projects like [Peacock series] ‘All Her Fault’ and [Apple TV+’s] ‘The Dispatcher,’” Marks says. “At the same time, the breadth of work across post, digital, animation and visual effects has been impressive, with titles such as ‘Alien: Earth,’ ‘The Last of Us,’ ‘Ted’ and the upcoming ‘Stranger Things: Tales from ’85’ showcasing the capability and diversity of our screen businesses.” Marks highlights co-productions, including “Mix Tape” with Ireland and the upcoming animated series “Flower and Flour” with Canada, as examples of how well Australia collaborates internationally across television storytelling.\n\n\tLouise Gough, director of narrative content at Screen Australia, agrees that the industry is set for a rebound and points to the well over 100 Australians that are walking the halls of Mipcom this year.\n\n\tBut not only is she confident about the future of Australian TV content, she is proud of the breakout successes of the past few years.\n\n\t“Over the past five years there have been some brilliant shows that have sold very well globally,” Gough says. “ ‘The Narrow Road to the Deep North’ is some brilliant Australian IP from an Australian author; ‘Newsreader,’ ‘The Twelve,’ ‘Black Snow,’ ‘100% Wolf: Legend of Moonstone’ — these are just a few of the titles that have been getting a lot of business globally.” Gough adds that Australian talent remains in demand with series like “Heartbreak High,” “Fisk,” “Colin From Accounts” and, of course, “Bluey,” the top dog when it comes to any conversation about Australian TV success.\n\n\t“What does well is content that is identifiably Australian but with global themes,” she says. “Globally, audiences are leaning into work that has great conversations and also diasporic resonances, and there is a lot coming through the pipeline — whether that is beautiful work like ‘Top End Bub,’ which has just come out and is performing wonderfully, ‘The Chaplain,’ or ‘High Country.’”\n\t\n\n\t“High Country,” a thriller set in the picturesque Victorian alpine region, was a breakout star for U.K.’s BBC; it’s a resilient genre.\n\n\t“It always makes me laugh because everyone says ‘Oh, we have so many detective shows,’ but then they all want one,” says Rosemary Blight of Goalpost Pictures, makers of the Travis Fimmel-starring whodunit “Black Snow.” “I do think audiences are still responding very well to premium detective dramas, especially if it takes them into a world that they don’t know. Something like ‘Black Snow’ works incredibly well, having someone of the caliber of Travis Fimmel in the middle of it who has such a big reach internationally.” Blight says conversations are being had around the third outing of the series.\n\n\tThe industry body continues to find that “crime is evergreen,” says Gough. “What is so brilliant about crime and the crime works that come out of Australia, is that it has what we call the 80-20 rule,” Gough says. “It’s 80% familiar because the genre is known, but there is 20% where it is being told in a distinct story world or a distinct tone or a distinct point of view, whether it is a comedic crime or a deep, dark crime.”\n\n\tComedic whodunit “Deadloch” is more of a parody of the genre, skewering the tropes of the police and forensics procedurals. The series, written by “The Kates,” comedians Kate McCartney and Kate McLennan, is in post on Season 2. Kevin Whyte of “Deadloch” producer Guesswork says shows sell better with a clear creative viewpoint.\n\n\t“We always do better in entertainment when we focus on empowering the creatives to tell the best stories and that math has never changed,” he says. “It sometimes gets obscured by the business, but underlying all those conversations about trends, formats and platforms, the same truth keeps coming through: If you get great creators, give them space to tell surprising stories, then give them the resources to execute it properly, you will get audiences.”\n\n\tGuesswork also has a new comedy in the works, “Bad Company,” starring comedians Anne Edmonds and Kitty Flanagan (“Fisk”). This “workplace setting” genre is another one that performs well for Aussie companies, with shows like “Newsreader,” “Fisk” or even Sam Neill-starrer “The Twelve,” a legal drama for Fox Showcase, performing well.\n\t\n\n\tAustralia’s other recent international click, “Colin From Accounts,” from Easy Tiger Prods., has breathed life back into the Oz comedy sector.\n\n\tRob Gibson, Easy Tiger CEO, says comedy is always a tough sell because people are worried about whether the laughs will land. “The conventional wisdom about comedy not travelling, we have blown that open with ‘Colin,’ and we are having a lot of conversation in the U.K. and the U.S. about comedy that could be made here in Australia.”\n\n\tFremantle’s Carly Heaton says this lighter fare is a big focus for them in the future. “There’s a real appetite right now for shows with heart — lighter, funnier, more escapist stories that give audiences a break from the real world,” Heaton says. “A lot of our commissioned projects, and those in commissioned development, share that DNA. We can’t name titles yet, but you’ll see a through-line of hope and humor across our slate which we feel is very strong and exciting.”\n\n\tBlight says Goalpost is also proud of its lighter fare with the recent success of the Amazon Prime original “Top End Bub,” a TV spinoff from the Aussie feature “Top End Wedding.” Launching at Mipcom, the laffer has had a great response from audiences Down Under. “‘Top End Bub’ is about a big hectic family, the responsibilities and unconditional love.\n\n\tIt’s set in the top end of Australia. That area is green and aqua blue and a world full of crocodiles, and it’s a world that a lot of Australians haven’t seen and certainly the world hasn’t seen,” says Blight. “Overseas audiences think of Australia as red dirt outback, but they don’t know that there is a beautiful tropical world up there. We shoot on Tiwi Islands, and having Amazon on that in Australia and New Zealand allowed us to make something to scale. We are feeling really good about that.”\n\n\tIn fact, Blight says one of the most important things in the current environment is the strength of a local partner — in addition to Amazon’s excellent partnership with “Top End Bub,” streamer Stan threw its weight behind “Black Snow.”\n\n\t“When your domestic partner really gets behind the show, that success domestically ripples around the world,” she says.\n\n\tMatt Deaner, Screen Producers Australia CEO, sees key encouragement coming from national broadcaster the Australian Broadcasting Corporation. “There has been a strong signal from the ABC and the new managing director, Hugh Marks,” Deaner says. “He has said that he is doubling down on regional intellectual property because the national broadcaster has the capacity to take risks, and that is great. They are being aggressive in a way we have not seen for a while; that is great news for our industry.”\n\t\n\n\tThe ABC stand at Mipcom reps “Fisk,” as well as comedy reboot “Mother and Son” and thriller “Pine Gap.”\n\n\tGuesswork’s Whyte adds that on-air successes are one thing, but what he has been hearing on the ground is that they are the tip of the iceberg, and that there are many more development conversations going on.\n\n\t“I certainly feel, and I think others, too, feel like after a couple of years where it felt like we were walking through wet cement, the cogs are turning again, maybe they are turning at a lower volume but it certainly feels like decisions are being made and development is moving forward,” he says.\n\n\tBlight adds: “We are hitting above our weight, we have to look at those successes and be really proud of them. We are at a time now where the world doesn’t really care what language you speak, they are being educated and watching content from all over the world and we fit in very nicely into that.”\n"
  },
  {
    "title": "PCCW Media’s ‘The Season’ With ‘Crazy Rich Asians’ Producer Lands at Hulu, Sets International Sales Launch at Mipcom",
    "url": "https://variety.com/2025/tv/news/crazy-rich-asians-producer-the-season-hulu-1236546350/",
    "image": "https://variety.com/wp-content/uploads/2025/03/PCCW.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-11T08:08:50.000Z",
    "description": "Hong Kong-based PCCW Media has locked in Hulu as the U.S. home for its six-episode drama “The Season,” a collaboration with SK Global.  \tThe deal, finalized earlier this year, comes ahead of the show’s...",
    "body": "\n\tHong Kong-based PCCW Media has locked in Hulu as the U.S. home for its six-episode drama “The Season,” a collaboration with SK Global.\n\n\tThe deal, finalized earlier this year, comes ahead of the show’s international market debut at Mipcom, where Fremantle will shop the title to buyers worldwide with support from De Maio Entertainment. Viu, which commissioned the project, retains rights across its 15-market footprint and will stream the series as original programming.\n\t\n\n\tSK Global, the production company behind “Crazy Rich Asians,” “Thai Cave Rescue” and Emmy-winning “Delhi Crime,” partnered with PCCW Media to develop the series.\n\n\n\tThe drama unfolds during Hong Kong’s summer social season, centering on an affluent group whose carefully maintained facade begins to crack when an outsider enters their world. The show promises a visually lush exploration of wealth, loyalty and deception set against the city’s harbor culture.\n\n\tLeading the ensemble is Jessie Mei Li, known for Netflix’s “Shadow and Bone,” alongside Hong Kong cinema veteran Karena Lam, a three-time Golden Horse Award recipient. The supporting roster includes Chris Pang of “Interior Chinatown,” Justin Chien from “The Brothers Sun,” and Yvonne Chapman, who appeared in “Avatar: The Last Airbender.” Celina Jade and Toby Stephens round out the principal cast.\n\n\tAdditional players include Rising Star of Asia Award 2025 honoree Kōki, Lee Jae-yoon from the second season of “Physical 100,” and competition series winner Lyman Heung. Hong Kong pop idols Anson Lo of boy band Mirror and Marf Yau from girl group Collar make guest appearances.\n\t\n\n\t“We are thrilled to have ‘The Season’ stream on Hulu in the U.S. and to partner with Fremantle for international distribution, bringing this intriguing and riveting emotional ride to a global audience,” said Janice Lee, managing director of PCCW Media Group and CEO of Viu. “Developed in collaboration with our production partner SK Global, the series immerses viewers in Hong Kong’s pulsating energy through stunning visuals ensuring the show is both authentic and relatable to a global audience.”\n\n\tChloe Dan, executive VP and head of television at SK Global, added: “‘The Season’ is a story with truly universal appeal, and we are thrilled to collaborate with Hulu to bring it to U.S. audiences. As SK Global continues to expand its footprint across the world, this series represents the kind of distinctive, premium storytelling we’re proud to champion on a global stage.”\n\n\tBehind the camera, creator and executive producer Yalun Tu brings experience from Amazon Japan’s “My Undead Yokai Girlfriend,” which he co-created, along with writing credits on “NCIS: Hawaii” and “Wu Assassins.” Chilean filmmaker Marialy Rivas, whose recent work includes “The Jetty,” directs multiple episodes and executive produces.\n\n\tThe producing team includes Lee and Agatha Lo representing PCCW Media, while SK Global’s contingent consists of Dan, Matt Aragachi and Dylan Tarason.\n"
  },
  {
    "title": "‘The Vampire Lestat’ Adds Five to Cast, ‘Walking Dead: Daryl Dixon’ Drops Season 4 Behind the Scenes Teaser",
    "url": "https://variety.com/2025/tv/news/the-vampire-lestat-cast-walking-dead-daryl-dixon-season-4-1236545977/",
    "image": "https://variety.com/wp-content/uploads/2025/10/IWTV_S3_SG_0701_0085_Talk.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-11T01:15:00.000Z",
    "description": "AMC Networks has unveiled the newest cast additions to “Anne Rice’s The Vampire Lestat,” which is set to premiere in 2026.  \t“The Vampire Lestat,” which is the third season of “Interview with the Vampire,”...",
    "body": "\n\tAMC Networks has unveiled the newest cast additions to “Anne Rice’s The Vampire Lestat,” which is set to premiere in 2026.\n\n\t“The Vampire Lestat,” which is the third season of “Interview with the Vampire,” will introduce Sheila Atim (“The Woman King”) as Akasha, Noah Reid (“Schitt’s Creek”) as Larry, Ryan Kattner (“Destroy All Neighbors”) as Salamander, Seamus Patterson (“Guillermo del Toro’s Cabinet of Curiosities”) as Alex, and Sarah Swire (“The Boys”) as TC. The announcement was made during the Annie Rice’s Immortal Universe panel at New York Comic-Con.\n\t\n\n\tThe panel featured cast members Sam Reid, Jacob Anderson, Eric Bogosian, Assad Zaman,  Jennifer Ehle and executive producers Mark Johnson and Hannah Moscovitch to introduce the casting news and an exclusive first look teaser, which can be seen below. \n\n\n\tPreviously, Christopher Heyerdahl (“Under the Banner of Heaven”), Jeanine Serralles (“Apples Never Fall”), Ella Ballentine and Damien Atkins were announced as new cast members for the upcoming third season during San Diego Comic Con. \n\n\tThe conversation also included first look clips at “Anne Rice’s Talamasca: The Secret Order” ahead of the two-episode premiere on Oct. 26. That clip can also be seen below. \n\n\tIn addition to the Anne Rice shows, cast members of “The Walking Dead: Daryl Dixon” spoke about the upcoming third season finale with star and executive producer Norman Reedus, “Walking Dead” Universe Chief Content Officer Scott M. Gimple, showrunner David Zabel, and director Greg Nicotero, who also serves as an executive producer on the series. The panel also included a behind-the-scenes first look inside the production of Season 4 as well as a sneak peek at the third season finale. \n\t\n\n\t“The Walking Dead: Daryl Dixon” follows Daryl (Reedus) and Carol (Melissa McBride) as they continue their journey towards home in search of finding their loved ones.\n\n\n\n\n\n\n\n\n\n\n\n\n"
  },
  {
    "title": "‘Vicious’ Review: Dakota Fanning Screams Her Way Through a Horror Endurance Test That Wears Itself Out",
    "url": "https://variety.com/2025/film/reviews/vicious-review-dakota-fanning-paramount-plus-horror-1236545217/",
    "image": "https://variety.com/wp-content/uploads/2025/10/dakota-fanning-vicious.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-11T05:10:00.000Z",
    "description": "After launching a home-invasion franchise with the simple premise of three masked figures terrorizing a couple on the rocks, “The Strangers” creator Bryan Bertino has maintained his sensibility as a...",
    "body": "\n\tAfter launching a home-invasion franchise with the simple premise of three masked figures terrorizing a couple on the rocks, “The Strangers” creator Bryan Bertino has maintained his sensibility as a writer-director, spinning other original horror chamber pieces unmoored by sympathy. Now, the horror helmer’s latest effort shows characteristic daring in its detachment. \n\n\tGenerically titled “Vicious,” the film offers a spare setup — a depressed young woman is wracked by hallucinations — with little definition of what is afflicting her or why. The writer-director doesn’t solicit sympathy for Polly (played by Dakota Fanning) or impose meaning on her suffering. It’s a very naked approach to horror, entirely propped up on formal execution. In other words, he risks leaving the audience with nothing. And that comes to pass in “Vicious,” which trickles down to Paramount’s streaming service after being slashed from the studio’s theatrical slate.\n\t\n\n\tBertino finds an ample engine in Fanning, at least. The opening introduces her character aglow in red light, complemented by a narrated monologue, vaguely written but delivered as pure, possibly suicidal despair. It’s clear that something is eating away at her, and that impression sticks in proceeding scenes, with the holiday season shut-in Polly half-heartedly preparing for a job interview and calming down her concerned mother over the phone.\n\n\n\tThese early, somber moments cast a mood, but the film is eager to hold Polly’s feet to some fire. “Vicious” has the devoted attention for its lead that Roman Polanski’s domestic horror classics “Repulsion” and “Rosemary’s Baby” did, but Bertino has a more gung-ho gameplan. Instead of gradually boiling into insanity, the film hits fever pitch hallucinations right away and quickly exhausts itself attempting to keep pace. \n\t\n\n\tThe rubber meets the road when Polly receives a mysterious box from a bewitching, raspy old woman (Kathryn Hunter, the current go-to for that type of thing — and deservedly so). It comes with a ticking hourglass and a series of vague challenges: Give the box “something you hate, something you need, something you love.” It’s an instruction brimming with technicalities, forcing Polly to excavate her most personal traumas. It also leads to some sliced body parts and grimy-looking strangers, who tap Polly on the shoulder for a scare before disappearing.\n\n\tThat’s all disappointing, familiar horror imagery, but “Vicious” gets by on atmosphere for a good while before that. A crackling fireplace casts a dull pall over Polly’s living room, but it’s the only warmth in her stupendously cavernous home. The house appears to exist at the end of the universe, so much so that it comes as a surprise when Polly briefly dashes to a neighbor’s place seeking a lifeline. But when that stranger ends up possessed within minutes, stabbing herself in the face and sending Polly back out into the cold, it seems like no other development would’ve made more sense. There are no helping hands when the entire movie may or may not be unfolding inside someone’s head.\n\n\tThat credo reasserts itself as Polly begins to be haunted by visions of her loved ones. Bertino strictly withholds from elaborating on her personal history — a self-imposed limit that ultimately keeps the film from getting under the skin, but does serve to further emphasize Polly’s isolation. One memorable moment comes early, when another call between Polly and her mother tilts into dread as the voice on the phone morphs into a more callous, sinister being. It’s a trick that “Vicious” is smart to return to, with its scant side characters offering Polly brief warmth before revealing themselves as vessels for the demon haunting her. Fanning’s tensed, squirrelly performance comes to life in these spots, with Polly’s waning trust and fear of betrayal cluing into a wounded self-loathing that becomes the film’s best lasting impression.\n\n\tBut “Vicious” is mostly a numbing slog. Fanning flatlines when left to be a solo show as Bertino whacks her around like a pinball, hitting big, loud scares that seem to keep resetting. As Polly excavates the darkest parts of herself, the film can’t string together a build to match the depths of her soul-searching. The movie devolves into something inexact and thoughtless, without anything distinct to recenter it. It’s hardly a sin for cruelty to be the point, especially in horror. But you have to at least land your punches.\n\t\n\n\t“Vicious” is now streaming on Paramount+.\n"
  },
  {
    "title": "Megan Fox Joins ‘Five Nights at Freddy’s 2’ as Toy Chica",
    "url": "https://variety.com/2025/film/news/five-nights-at-freddys-2-megan-fox-toy-chica-1236546263/",
    "image": "https://variety.com/wp-content/uploads/2025/10/P115PV6I.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-11T01:04:58.000Z",
    "description": "Megan Fox has joined the cast of “Five Nights at Freddy’s 2” as the voice of Toy Chica.  \tThe film, a horror sequel set in the haunted Chuck E. Cheese-esque establishment known as Freddy Fazbear’s Pizza, will...",
    "body": "\n\tMegan Fox has joined the cast of “Five Nights at Freddy’s 2” as the voice of Toy Chica.\n\n\tThe film, a horror sequel set in the haunted Chuck E. Cheese-esque establishment known as Freddy Fazbear’s Pizza, will land in theaters on Dec. 5.\n\n\tAdditional newly announced cast members for the Universal and Blumhouse film include MatPat as the voice of Toy Bonnie and Kellen Goff as Toy Freddy.\n\n\n\tFor “Five Nights at Freddy’s 2,” Emma Tammi returns as director. Josh Hutcherson, star of the first film, also returns for the sequel, which includes cast members Matthew Lillard, Elizabeth Lail and Piper Rubio.\n\t\n\n\tHutcherson starred in the original as a nighttime security guard at Freddys Fazbear’s Pizza, where the animatronic mascots are prone to murder. The studio hasn’t clarified which mechanical beasts are returning for the follow-up, but it did share the new tagline: “Anyone can survive five nights. This time, there will be no second chances.”\n\n\t“Five Nights at Freddy’s,” adapted from the popular video game, made a killing at the box office in October 2023 with $297 million globally and became Blumhouse’s highest-grossing film of all time — all while streaming simultaneously on Peacock. \n\n\tThe casting news was announced during Jason Blum’s BlumFest panel at New York Comic-Con Friday night, which celebrated several upcoming Blumhouse titles, including “Black Phone 2,” the video game “Sleep Awake” and “Five Nights at Freddy’s 2.”\n\n\tFox most recently starred opposite Michele Morrone in Millennium Media’s thriller “Subservience” and appeared in Amazon’s comedy series “Overcompensating.” Her other notable recent credits include  dark comedy “Till Death,” “Night Teeth,” “Big Gold Brick” and “The Expendables 4.”\n"
  },
  {
    "title": "‘Beatles’ Biopic: Anna Sawai, Aimee Lou Wood Circling Yoko Ono, Pattie Boyd Roles",
    "url": "https://variety.com/2025/film/news/beatles-biopics-anna-sawai-aimee-lou-wood-yoko-ono-pattie-boyd-1236536255/",
    "image": "https://variety.com/wp-content/uploads/2025/10/anna-sawai-aimee-lou-wood.jpg?crop=0px%2C34px%2C2158px%2C1215px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-10-10T22:21:08.000Z",
    "description": "“Shogun” star Anna Sawai and “The White Lotus” breakout Aimee Lou Wood are circling the roles of Yoko Ono and Pattie Boyd in the upcoming four-part “Beatles” biopic by director Sam Mendes, Variety has...",
    "body": "\n\t“Shogun” star Anna Sawai and “The White Lotus” breakout Aimee Lou Wood are circling the roles of Yoko Ono and Pattie Boyd in the upcoming four-part “Beatles” biopic by director Sam Mendes, Variety has confirmed.\n\n\tOno, an artist and singer-songwriter, is the widow of John Lennon and one of his biggest creative influences. Sawai would star alongside Harrison Dickinson as Lennon, who was married to Ono from 1969 until his death in 1980. Lennon was shot and killed by a deranged fan outside of their Upper West Side apartment building, the Dakota.\n\t\n\n\tBoyd, a model, met George Harrison (who will be played by Joseph Quinn) when she was 19 on the set of the Beatles 1964 feature “A Hard Day’s Night,” and became a sensation in her own right in 1960s swinging London. They married in 1966; after the Beatles broke up in 1970, their marriage began to deteriorate, and they ultimately divorced in 1977. She was subsequently married to Eric Clapton from 1979 to 1989. On Oct. 10, she posted to social media that the prospect of Wood playing her was “big news” and she was “looking forward (hoping) to meet” the actor “at some point in the future.”\n\n\n\tThe deals for Sawai and Wood are not signed, however, and it’s not certain they will be cast. A representative of Sony Pictures had no comment.\n\n\tAs for the rest of the Fab Four, Paul Mescal is playing Paul McCartney and Barry Keoghan will star as Ringo Starr. Saoirse Ronan has been cast as McCartney’s first wife, Linda, who also performed in his post-Beatles band, Wings; Mia McKenna-Bruce is set to play Starr’s first wife, Maureen Starkey.\n\t\n\n\tMendes is making four separate movies, one from each Beatles member’s point of view. They will intersect to capture the band’s improbable journey from Liverpool to the center of global culture, leading to their 1970 breakup. The tagline, in other words, is “Each man has his own story, but together they are legendary.” All four installments will debut on the big screen in April 2028 in what Sony Pictures is dubbing the “first binge-able theatrical experience.” The exact release timeline is unclear.\n\n\tMcCartney, Starr, and the families of the late Lennon and Harrison have granted full life story and music rights for the scripted films, making these the first features sanctioned by the band.\n\n\t“I’m honored to be telling the story of the greatest rock band of all time, and excited to challenge the notion of what constitutes a trip to the movies,” Mendes said when the project was announced earlier in 2025.\n\n\tSawai, 33, rose to fame in Japan as a singer in the girl group Faky before breaking through internationally on the Apple TV+ series “Pachinko.” She scored an Emmy for the series “Shogun,” making her the first Japanese actress to win for lead actress. Sawai will also appear onscreen in director David Leitch’s heist film “How to Rob a Bank” and the Jeremy Allen White and Austin Butler-led crime drama “Enemies.” \n\n\tWood, 31, first starred in the Netflix teen dramedy “Sex Education” over four seasons from 2019 to 2023.  She’s also appeared opposite Bill Nighy in the 2022 film “Living,” and she earned her first Emmy nomination in 2025 for her role in the third season of HBO’s “The White Lotus.”\n\n\tAlex Ritman contributed to this report.\n"
  },
  {
    "title": "Men’s Wearhouse’s Most Stylish Outwear Is Deeply Discounted With This Fall Sale",
    "url": "https://variety.com/2025/shopping/news/mens-wearhouse-fall-sale-shop-online-1236546157/",
    "image": "https://variety.com/wp-content/uploads/2025/10/Screen-Shot-2025-10-10-at-3.04.39-PM.png?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-10T22:16:16.000Z",
    "description": "If you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.  \tAs the fall season hits its stride, Men’s Wearhouse is leaning into...",
    "body": "\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.\n\n\tAs the fall season hits its stride, Men’s Wearhouse is leaning into their sleekest outwear and layering staples. The retailer’s annual Fall Sale, part of their pre-holidays push, offers deep discounts across tailored suits, elevated casualwear and performance-driven basics that the retailer is best known for.\n\n\tCurrently, their sale spans select suits starting at $299.99 and sport coats priced as low as $149.99. Dress shirts are marked down to $39.99, while clearance pieces like Calvin Klein non-iron dress shirts and Joseph Abboud plaid spread-collar styles are now just $19.99. For outerwear and layering, Joseph Abboud knit sport coats and Calvin Klein wool-blend blazers have dropped to $49.99, and Haggar slim-fit stretch jackets are currently listed at $90.99. \n\t\n\n\tAmong the sale highlights are the Pronto Uomo 100% wool suits, now available at $399.99 — a timeless option for anyone looking to refine their wardrobe without overspending. For those balancing work, travel, and special occasions, the KCA ChillFlex Suits are the standout: temperature-regulating, quick-dry, and anti-microbial with UV protection, designed to stay cool and comfortable in any setting. The Joseph Abboud American Bespoke Tuxedo, made in the U.S. from premium wool stretch, delivers a breathable, half-lined construction perfect for formal events and evenings out.\n\n\tBeyond tailoring, the AWEARNESS Kenneth Cole ChillFlex performance line brings an athletic-meets-polished sensibility to everyday dressing. Joggers feature hidden zip pockets and adjustable drawstrings, tees are crafted with moisture-wicking fabrics and reflective detailing, and hoodies come finished with flatlock stitching for comfort and structure—pieces that easily transition from the office to the weekend.\n\t\n\n\tAs fall weddings, gatherings and end-of-year events fill the calendar, Men’s Wearhouse offers an edit that balances practicality with polish. From merino sweaters and versatile chinos to modern outerwear, the sale makes it easy to look put-together for every occasion, proving that smart style doesn’t have to come at a steep price.\n"
  },
  {
    "title": "‘Yellowjackets’ to End With Season 4 at Showtime, Paramount+ Premium",
    "url": "https://variety.com/2025/tv/news/yellowjackets-final-season-4-showtime-paramount-1236546225/",
    "image": "https://variety.com/wp-content/uploads/2025/03/Yellowjackets_308_KS_0918_0318_RT.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-11T00:55:02.000Z",
    "description": "“Yellowjackets” will conclude with its upcoming fourth season, Variety has learned. The Showtime/Paramount+ Premium series, produced by Lionsgate TV, originally debuted in 2021, with the third season...",
    "body": "\n\t“Yellowjackets” will conclude with its upcoming fourth season, Variety has learned. \n\n\tThe Showtime/Paramount+ Premium series, produced by Lionsgate TV, originally debuted in 2021, with the third season airing between February and April 2025. The fourth season will premiere in 2026, with an exact release date to be revealed at a later time. The writers’ room for Season 4 is now open.\n\n\t“After three incredible seasons, and great consideration, we’re excited to announce that we will be bringing the story of Yellowjackets to its twisted conclusion in this fourth and final season,” said series creators and co-showrunners Ashley Lyle and Bart Nickerson. “We’ve always known there would come a point when the story would tell us it wants to end, and it’s our belief that our job — our responsibility — is to listen. Telling this emotional, wild, and deeply human story has been a profoundly meaningful experience and a true honor for us, and we’re so very grateful to the brilliant cast, crew and writers who have bravely gone on the journey with us to bring it to life. Most of all, we want to thank the fans who have stuck with us through every moment, mystery and meal — the Hive is nothing without you! We can’t wait to share the final chapter with you and hope you find it…delicious. All the best, A & B.” \n\t\n\n\tAccording to an individual with knowledge of the situation, conversations are underway for Lyle and Nickerson to continue their relationship with Paramount beyond the ending of the series. \n\n\n\tThis is the latest Showtime series to announce its ending in the wake of the Paramount-Skydance merger. Most recently, it was reported that “The Chi” would be ending after eight seasons, while Variety exclusively reported that the prequel series “Dexter: Original Sin” had been canceled. Thus, the only two remaining Showtime originals at present are “The Agency,” which is prepping its second season, and “Dexter: Resurrection,” which recently announced its Season 2 renewal. \n\t\n\n\tSeason 3 of “Yellowjackets” starred Melanie Lynskey, Christina Ricci, Tawny Cypress, Lauren Ambrose, Sophie Nélisse, Jasmin Savoy Brown, Sophie Thatcher, Samantha Hanratty, Courtney Eaton, Liv Hewson, Steven Krueger, Warren Kole, Kevin Alves, Sarah Desjardins and Simone Kessell. Elijah Wood appeared in a recurring role, while Hilary Swank, Joel McHale, and Ashley Sutton appeared in guest star roles.\n\n\tLyle, Nickerson and fellow showrunner Jonathan Lisco are all executive producers on the series. Drew Comins of Creative Engine also serves as executive producer along with Jeff W. Byrd, Sarah L. Thompson, Ameni Rozsa and Brad Van Arragon. The series is produced for Showtime by Lionsgate Television and distributed by Paramount Global Content Distribution.\n\n\t“Yellowjackets” has proven popular with both critics and audiences. Per Paramount, Season 3 was the most-watched season of the show to date, with the finale marking the most-watched episode in series history. The show has received 10 Emmy nominations in total, including consecutive nods for best drama and best actress in a drama (Lynskey).\n\n"
  },
  {
    "title": "‘Is This Thing On?’ Review: In Bradley Cooper’s Feel-Good Divorce Comedy, Will Arnett Is an Estranged Husband Who Does Stand-Up…as Therapy",
    "url": "https://variety.com/2025/film/reviews/is-this-thing-on-review-will-arnett-bradley-cooper-1236545242/",
    "image": "https://variety.com/wp-content/uploads/2025/10/Is-This-Thing-On-NYFF63.avif?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-10T22:30:06.000Z",
    "description": "The first two movies directed by Bradley Cooper revealed a couple of key things about him. The most essential is that he’s a born filmmaker — not just a good one but a great one. The other thing they revealed...",
    "body": "\n\tThe first two movies directed by Bradley Cooper revealed a couple of key things about him. The most essential is that he’s a born filmmaker — not just a good one but a great one. The other thing they revealed is that Bradley Cooper, for all his searching intelligence and humanity, is a consummate creature of showbiz. His entrancing 2018 remake of “A Star Is Born” was steeped in the entertainment industry (arena rock, dance-pop videos, the Grammys), and part of the film’s power lay in the granular authenticity with which it portrayed those worlds. As for “Maestro,” Cooper’s haunting Leonard Bernstein biopic, it told the story of a classical musician who was baptized in the limelight; that he had to keep his private life offstage only threw the luminous sheen of his celebrity into higher relief.\n\t\n\n\tAfter those two visions of the high-maintenance inner lives of artist/entertainers, “Is This Thing On?,” Cooper’s third outing as a director (it premieres tonight at the New York Film Festival), comes off as a deliberately shaggy and casual change of pace. It’s a tale of marital separation and impending divorce, shot in an easy-flow voyeuristic hand-held style, and it’s about two people who are supposed to be ordinary enough to represent the lot of us.\n\n\n\tAlex and Tess Novak (Will Arnett and Laura Dern) have been married for 20 years. They live in a handsome old house in the New York suburbs, where they have two sons who are both 10 (they’re “Irish twins,” as Alex explains). Alex works “in finance,” which is as detailed a description of his job as we ever hear; we never once see him at work (which is strange for a character who’s in finance, given that work is pretty much all they do, but never mind). Tess is a stay-at-home mom, though with a high-powered past that looms large.\n\t\n\n\tThe film opens with the two of them trying to find the right moment to tell their boys that they’re separating. There is no right moment, and the early scenes are about fumbling steps and the tentativeness of awkward new roles. Alex moves into an apartment in the West Village — a sterile place that he barely gets around to furnishing, though as divorce crash pads go it doesn’t exactly look cheap. To mark his new life, Alex buys a blue-and-white VW van, shuttling back and forth between the city and the burbs; he also has his kids over to stay with him. The co-parenting seems to go reasonably smoothly, with a minimum of rancor.\n\n\tBut there’s a showbiz wild card at play. On his first night alone in the city, Alex is wandering around the Village and tries to get a drink at the Olive Tree Café, the fabled spot on MacDougal Street that’s attached to the Comedy Cellar (which is the floor below). There’s a $15 cover charge, which Alex doesn’t have the cash for, so to get in for free he agrees to do an open-mic comedy set. We in the audience roll with this in a way that goes down easy, though maybe a little too easy. Will Arnett, after all, is a comedian, and when Alex first gets up there, staring into the black void of an audience, we don’t really have the feeling that this is a “finance guy” who has suddenly stepped into the existential spotlight of stand-up. Looking confident and relaxed, he starts talking about his divorce predicament, and despite a silent stretch or two he gets off a few good lines about it. He glides into the stand-up zone without much fuss.\n\n\tThen again, the movie provides a context for that. At the club, Alex is surrounded by other stand-up comics, as he of course would be, but it’s not just “Oh, here’s what happens at a comedy club.” The other acts we see are all personal and confessional comics (played by real comedians like Jordan Jensen, Chloe Radcliffe, Reggie Conquest, and Dave Attell), who draw jokes out of spilling their lives out onstage. That this  has become the new normal in comedy is the legacy of many great stand-up artists, from Richard Pryor to Sarah Silverman, but it also says something about our therapeutic culture of too much information. Just as the rise of “American Idol” marked the transition into a world where everyone, it seemed (or, at least, a hell of a lot more people than there used to be), knew how to sing, “Is This Thing On?” unfolds in a society where the democratization of stand-up has spread the comedy impulse far and wide.\n\t\n\n\tIt’s now what people do. They get up in front of a crowd to make light of themselves, attack their exes and enemies, and turn their most intimate stories into laughter. And maybe that’s why “Is This Thing On?” doesn’t feel all that “inside” in its presentation of the stand-up-comedy world. It’s not nearly as incisive a view of what goes down in comedy clubs as the one conjured by Mike Birbiglia’s brilliant “Don’t Think Twice” (2016). Then again, Alex isn’t trying to “make it” as a stand-up. He’s using open-mic night for therapy, and he’s not bad at it — he’s just okay enough to generate some chuckles of recognition and avoid embarrassing himself.\n\n\tWe can certainly buy all this. Cooper, who wrote the script with Arnett and Mark Chappell, based the movie on the life of a British pharmaceutical rep named John Bishop whose marital-separation fling with stand-up was a story Will Arnett had heard about. But even though it doesn’t necessarily strain credibility, the stand-up-comedy plot of “Is This Thing On?” does turn a marriage story into a real-life showbiz fairy tale. Alex, his marriage having disintegrated, feels like he’s lost everything, and stand-up offers him a lifeline — a way to save himself, and maybe to save other things too.\n\n\tIt’s an observant, bittersweet, and highly watchable movie, yet there’s an inner softness to it, a slightly pandering quality. Will Arnett, who has the look and demeanor of a less energized Michael Keaton, is a likable enough actor in a rather mopey way, but he has done a lot of sitcom work, and it shows. In “Is This Thing On?,” Arnett seems, in essence, to be playing Alex as a sitcom dad — sharp-tongued yet benign, lost in his daze of self-interest, with an essential quality of harmlessness that’s the opposite of movie-star danger.\n\n\tLaura Dern, so brilliant as a divorce lawyer in “Marriage Story,” here invests Tess with a sharpness that never veers too far from sadness. We pick up on the idea that the separation has been driven by her, but Tess’s sense of regret hangs over the movie, especially when her backstory gets filled in: She was a member of the U.S. Olympic volleyball team (a star athlete — there’s that hint of showbiz rearing its head again), and she is now bent on getting back to her athletic roots by becoming a coach. She gets together with Laird (Peyton Manning), who can connect her to that world, and in one of those we-know-it’s-only-a-movie-but-come-on! coincidences, their drink, which morphs into a date, results in their heading over to a nearby comedy club…where Alex just happens to be performing! She hears his unfiltered portrait of their marital spats, and their sex life, compacted into one five-minute monologue. But that’s okay! It’s essentially the film’s version of couples therapy.\n\t\n\n\tCooper has unerring showbiz instincts. He surrounds Alex and Tess with friends and relatives — like Alex’s goofy second-rate stage-actor brother, Balls (played by Cooper with a cheesy grin under a variety of facial hair), and his wife, Christine (Andra Day), who expresses a great deal of righteous hostility toward men so that Tess doesn’t have to, along with some friends, played by the likes of Sean Hayes and Scott Icenogle, nattering in the background. As Alex’s parents, Christine Ebersole and Ciarán Hinds are the film’s crowd-pleasing billboard for what even a happy marriage is: affection and empathy, sure, but also two people who have agreed to tolerate more about each other than they don’t.\n\n\tThere are far worse things that a gifted filmmaker could offer an audience these days than a feel-good divorce comedy. Yet “Is This Thing On?” is a minor movie that cushions the agony of a marital split in ways that can feel like it’s cutting corners. Alex and Tess are well-off enough to have a very posh separation, their disconnect hinges more on misunderstanding than anger, and while Alex is supposed to be moonlighting as a comic, the truth is he hardly seems to do anything but stand-up comedy. In a funny way, the film treats even marriage as a form of showbiz. It says that once the demons have been acknowledged, the show must go on.\n"
  },
  {
    "title": "Sombr Says He Lost His Mind When Taylor Swift Shouted Out His Music",
    "url": "https://www.tmz.com/2025/10/10/sombr-reacts-taylor-swift-shoutout/",
    "image": "https://imagez.tmz.com/image/64/16by9/2025/10/10/64861410f1de4be4b81a24d550e5ecec_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-11T01:00:03.000Z",
    "description": "Sombr                          On Taylor Shoutout ...                          Mama I Made It!!!                                                                Published October 10, 2025 6:00 PM...",
    "body": "\n    \n                    \n                          Sombr\n                          On Taylor Shoutout ...\n                          Mama I Made It!!!\n                      \n                  \n                        Published October 10, 2025 6:00 PM PDT\n                                                                            \n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          Sombr says he's officially made it in Hollywood ... because his music got a stamp of approval from the person he sees as the greatest living artist ... Taylor Swift.\n      \n    \n          We got Sombr at Nine Orchard in New York City on Friday and our photog asked him about the emotions of getting a shoutout from Taylor herself.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          In a recent interview, Taylor revealed that she had been listening to Sombr's music.\n      \n\n          Sombr says he lost his mind when he heard Taylor was a fan of his ... and he tells us it's definitely a \"Mama, I made it\" moment.\n      \n    \n          Sounds like Taylor hasn't reached out to Sombr beyond highlighting his work in the media ... but he's got a message for her and her fiance, NFL star Travis Kelce, here ... and it seems he's got no problem playing third wheel.\n      \n    \n          Taylor's opinion carries tons of weight in the biz and Sombr's hoping he gets some collabs out of this whole situation ... and he tells us a bunch of other celebs are congratulating him too.\n      \n    \n          Pretty cool moment for Sombr, who says he's always been a Swiftie.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Taylor Swift\n              \n                          \n                Music\n              \n                      \n        \n          \n          "
  },
  {
    "title": "Kyle Richards' Fall Fashion Staples Under $75",
    "url": "https://www.tmz.com/2025/10/10/kyle-richards-fall-fashion-deals/",
    "image": "https://imagez.tmz.com/image/ee/16by9/2025/10/08/eecdf4f5e321496fbdf6ae67302fdaed_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-10T07:01:43.000Z",
    "description": "TMZ may collect a share of sales or other compensation from links on this page.                    Everyone's favorite Beverly Hills Housewives is here with the realest deals on Amazon this...",
    "body": "\n    \n                    \n                          \n                                  \n      \n        \n    \n          TMZ may collect a share of sales or other compensation from links on this page.\n      \n    \n          Everyone's favorite Beverly Hills Housewives is here with the realest deals on Amazon this fall.\n      \n    \n          Kyle Richards hosted a livestream this week with some of her favorite fashion pieces for the season -- and they're not only incredibly cute, but wallet-friendly.\n      \n    \n          Everything on this list will cost you less that $75 -- so get shopping!\n      \n    \n              \n      Cropped Jacket With Pockets\n      \n        \n    \n                    \n                          \n                                  \n      \n        \n    \n          This Cropped Jacket With Pockets serves chic as temps start to drop -- keeping you warm while also keeping it classy.\n      \n\n          It also comes in any color you like -- like including green, light blue, navy blue, black, white, brown, khaki, grey, and red! This one will be a staple of your fall wardrobe ... just like Richards' herself has been a staple of RHOBH for 15 years.\n      \n    \n              \n      Womens Cropped Jacket\n      \n        \n    \n                    \n                          \n                                  \n      \n        \n    \n          Another jacket option is this Women's Cropped Jacket, which is a lightweight bomber with a button drawstring zip-up.\n      \n    \n          It comes in green, blue, khaki, red, black, and navy. And no matter which color you pick, it'll finish off any look for a cool and casual night out with the girls. Just beware those flying wine glasses!\n      \n    \n              \n      PRETTYGARDEN Women's Oversized Fall Sweaters\n      \n        \n    \n                    \n                          \n                                  \n      \n        \n    \n          You may have seen this PRETTYGARDEN Women's Oversized Fall Sweaters a million times, especially in this time of year, but that just might mean it's time to get your own!\n      \n    \n          Bolster your autumnal wardrobe with yet another winning pick from Kyle, as the cozy and sophisticated embrace of this beautifully crafted cable knit sweater will keep you warm and comfy all season long. Red not your color? Don't worry, it also comes in a ton of other colorways!\n      \n    \n              \n      Fisoew Womens Wide Leg Pants\n      \n        \n    \n                    \n                          \n                                  \n      \n        \n    \n          Keep the comfort coming with these Fisoew Womens Wide Leg Pants.\n      \n    \n          These high-waisted pants come in khaki, blue, black, grey, red, and brown, ready to suit your style -- whether you're wearing them on your way to the gym, a movie night or whatever dinner party from hell life may throw your way!\n      \n    \n              \n      Wide Brim Western Cowboy Hats\n      \n        \n    \n                    \n                          \n                                  \n      \n        \n    \n          We all know Kyle loves herself a cowboy hat -- and this Wide Brim Western Cowboy Hat from Lanzom will certainly cost you a helluva lot less than one from Kemo Sabe.\n      \n    \n          If you too are a Beverly Hills resident -- where the sun always shines -- you know that this hat could come in use all year round. It could also double as a great head-topper for your upcoming Halloween parties!\n      \n    \n              \n      Suede Bags for Women\n      \n        \n    \n                    \n                          \n                                  \n      \n        \n    \n          Last, but not least, throw all your diamonds into this Suede Bag for Women!\n      \n    \n          It's the perfect size to store all your personal items, plus, simple, sweet, classy and trendy -- just like Kyle herself, right?\n      \n    \n          Sign up for Amazon Prime to get the best deals.\n      \n      "
  },
  {
    "title": "What's The Big Frigin' Difference?!",
    "url": "https://www.tmz.com/2025/10/11/whats-the-big-frigin-difference/",
    "image": "https://imagez.tmz.com/image/8a/16by9/2025/10/09/8a408998631a44cd9601fc7d83a92af8_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-11T07:01:01.000Z",
    "description": "Luann de Lesseps --                          What's The Big                          Frigin' Difference?1                                                                Published October 11, 2025 12:01...",
    "body": "\n    \n                    \n                          Luann de Lesseps --\n                          What's The Big\n                          Frigin' Difference?1\n                      \n                  \n                        Published October 11, 2025 12:01 AM PDT\n                                                                            \n      \n    \n          Drop your 'Housewives' apples and pick up this pumpkin pic of reality TV star Luann de Lesseps. Take a slit out of these two spicy snaps and see if you've got what it takes to score the mishaps!\n      \n    \n          Hittin' the streets of New York City and giving 60 a whole new look, Luanne leaped into fall with a pumpkin in-tow ... rockin' her bougiest of boots earlier this week!\n      \n    \n          Use your imagination and branch out to score the minor changes!\n      \n    \n          HINT: There are THREE differences in the above Luann de Lesseps photos!*\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Luann de Lesseps\n              \n                          \n                Real Housewives\n              \n                          \n                Photo Galleries\n              \n                          \n                What's The Big Frigin' Difference\n              \n                      \n        \n          \n          "
  },
  {
    "title": "Kristin Cavallari Shares Sexy Workout Video",
    "url": "https://www.tmz.com/2025/10/10/kristin-cavallari-sexy-workout-video/",
    "image": "https://imagez.tmz.com/image/ad/16by9/2025/10/10/ad3385d85b4140b2b262fa2682681c7f_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-11T00:20:03.000Z",
    "description": "Kristin Cavallari                          Watch my Sexy Workout Video                                                                Published October 10, 2025 5:20 PM...",
    "body": "\n    \n                    \n                          Kristin Cavallari\n                          Watch my Sexy Workout Video\n                      \n                  \n                        Published October 10, 2025 5:20 PM PDT\n                                                                            \n      \n    \n      \n        \n                    \n                  \n      \n                    Instagram / @stefarmstead\n          \n    \n          Kristin Cavallari is still at the top of her game, in no small part due to going hard in the gym ... and her workout routine looks just as sexy as she does.\n      \n    \n          Check out this video Kristin just shared of her hitting the gym ... she's in dripped out in ALO yoga gear and she's got her boobs out as she works out.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Kristin is sculpting her lower body here with trainer Stef Armstead ... and it looks like she got a workout in before heading out to Laguna Beach with some girlfriends.\n      \n\n      \n        \n              \n    \n    \n          The 'Laguna Beach' alum is reuniting with her former MTV castmates for a special reunion show in 2026, and it looks like she will be looking her best when she reunites with Lauren Conrad and co.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Kristin Cavallari\n              \n                          \n                Hot Bodies\n              \n                          \n                Reality TV\n              \n                          \n                TMZ Sports\n              \n                          \n                Fitness & Exercise\n              \n                      \n        \n          \n          "
  },
  {
    "title": "Eddie Hearn Says Boots Ennis Is The Boxer Capable Of Beating Bud Crawford",
    "url": "https://www.tmz.com/2025/10/11/eddie-hearn-jaron-boots-ennis-terence-crawford-boxing/",
    "image": "https://imagez.tmz.com/image/a4/16by9/2025/10/08/a4f646b347ef4fd4b59d480427ca5e74_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-11T07:50:39.000Z",
    "description": "Eddie Hearn, Promoter                          If Anyone Can Beat Bud Crawford ...                          It's Jaron 'Boots' Ennis!!!                                                               ...",
    "body": "\n                    \n                          Eddie Hearn, Promoter\n                          If Anyone Can Beat Bud Crawford ...\n                          It's Jaron 'Boots' Ennis!!!\n                      \n                  \n                        Published October 11, 2025 12:50 AM PDT\n                                                                            \n              \n    \n      \n        \n                    \n                  \n      \n                    TMZSports.com\n          \n    \n          Terence Crawford cemented himself as the best pound-for-pound boxer in the world in his superfight with Canelo Alvarez ... but promoter Eddie Hearn believes there's someone out there with the ability to beat Bud -- Jaron \"Boots\" Ennis!\n      \n    \n          TMZ Sports talked to the legendary Matchroom Boxing promoter just days before Eddie's 28-year-old, undefeated fighter takes on Uisma Lima Saturday night in front of his hometown fans in Philadelphia.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          While Saturday's bout is significant for several reasons -- including because Boots, 34-0 (with 30 KOs), is stepping up in weight to 154 lbs. for the first time -- Eddie's also keeping an eye on a bunch of big potential future matchups.\n      \n\n          \"Obviously, my job is to champion my fighters, but I believe in Boots, we have the pound for pound number one of the sport over the next four, five, six years. He's still a young man. I mean, he's 10 years younger than Terence Crawford, but this is a guy who's unified the 147-pound division and this Saturday, he moves up to fight for the interim world title at 154,\" Hearn told Babcock.\n      \n    \n          \"We get this one. We want Virgil Ortiz. We want [Sebastian Fundora]. We want [Bakhram Murtazaliev]. Anybody at [154]. And I think this is a guy that's going to move from [147] to [154] to [160] to [168]. He has the ability to do all of that.\"\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Crawford fought Alvarez at 168 lbs. ... and with fans salivating over a Bud-Boots fight for years, we asked Hearn if it was on their radar.\n      \n    \n          \"For a long time, people have talked about Ennis against Crawford, right? What we can't do is diminish or disrespect what Terence has done. I mean, a true generational great of the sport. But if anyone's going to beat him, I believe we've got the guy to beat him,\" Eddie said.\n      \n    \n          Of course, Bud secured the bag of all bags last month ... so Eddie understands they \"need to build Ennis into a fighter that financially makes Crawford take the fight.\"\n      \n    \n          If they can get the money to make sense, Hearn clearly believes it's the fight to make.\n      \n    \n          \"You tell me, once we win on Saturday, once we beat an Ortiz or a Fundora, you tell me the fights that you want to see Terence Crawford in more than Jaron \"Boots\" Ennis. Yeah, I'll wait because that could be one of the greatest fights of all time.\n      \n    \n          \"And I believe we've got the guy to beat the man. And he is the man right now. And we respect that. And if he wants a real challenge, get ready because Boots is coming!\"\n      \n      "
  }
]