[
  {
    "title": "Holiday Horror ‘Unholy Night’ Lands at Blue Finch Films (EXCLUSIVE)",
    "url": "https://variety.com/2026/film/news/holiday-horror-unholy-night-blue-finch-films-1236651624/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Unholy-night.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-04T08:00:00.000Z",
    "description": "\n\tU.K.-based sales and distribution company Blue Finch Films has picked up worldwide sales rights to “Unholy Night,” a holiday horror feature marking ",
    "body": "\n\tU.K.-based sales and distribution company Blue Finch Films has picked up worldwide sales rights to “Unholy Night,” a holiday horror feature marking the directorial debut of Michael Gabriele.\n\n\tThe film recently completed production in Charlottetown, Prince Edward Island, and Blue Finch will launch sales at Berlin’s European Film Market.\n\n\tThe festive horror centers on Gino, whose traditional Italian family Christmas Eve celebration descends into chaos when his deceased grandmother returns from the dead and embarks on a killing spree. As more dead relatives begin appearing throughout the neighborhood, Gino must find a way to eliminate the holiday revenants and make it through the family gathering alive.\n\t\n\n\tGabriele, whose award-winning short films include “Get Away,” wrote the screenplay and produced the project with Jenna MacMillan of Club Red Productions (“The Snake,” “Who’s Yer Father?”) and Jason Levangie and Marc Tetreault of Shut Up & Colour Pictures (“Sharp Corner,” “Kids vs Aliens”). Executive producers are Tina Carbone, Jef Burnham, Mike Chapman and Fatima Hayward.\n\n\n\tThe cast is led by Marc Bendavid (“Dark Matter,” “Reacher”) and Shailene Garnett (“Fire Country,” “Diggstown”), with supporting performances from Al Sapienza (“The Sopranos,” “House of Cards”), Ron Lea (“The Recruit,” “Orphan Black”), Ton Ellwand (“Mafia Inc.”), Cristina Rosato (“Mother!,” “Assassin’s Creed”), Jaqueline Robbins (“The Monkey”) and Joe Pingue (“Station Eleven,” “Star Trek: Section 31”).\n\n\t“We all know holiday family gatherings can feel like a survival horror, but Unholy Night takes that relatable tension to an extreme,” Gabriele said. “Growing up in my Italian family, Christmas Eve was always a huge event that was loud and full of love, but also incredibly intense. I wanted to take those real pressures we all feel with family and combine them into a visceral, festive nightmare. Audiences can expect a violent ride that is hilarious, heartfelt, and frightening – as it explores the burden of family traditions and overcoming regret – amidst total chaos.”\n\t\n\n\tMike Chapman of Blue Finch Films added: “‘Unholy Night’ is an impressive debut from Michael, taking the idea of unwanted family guests for Christmas to a whole new level. Mixing bold horror, dark humour, and heart, he has created a seasonal slam dunk.”\n\n\tBlue Finch’s current international slate includes Rotterdam-selected horror “Bowels Of Hell,” SXSW-selected sci-fi thriller “Imposters” and “Dolly,” which premiered at Fantastic Fest and will be released by IFC and Shudder this year.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Holiday Horror ‘Unholy Night’ Lands at Blue Finch Films (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Unholy-night.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-04T08:00:00.000Z",
      "dateModified": "2026-02-04T08:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Crunchyroll Rolls Out Thai-Language Interface, Expands Localized Content Library (EXCLUSIVE)",
    "url": "https://variety.com/2026/tv/news/crunchyroll-thai-interface-local-content-library-1236650549/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Crunchyroll-Thailand.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-04T03:00:00.000Z",
    "description": "\n\tCrunchyroll is deepening its investment in Thailand with the launch of a Thai-language user interface and a significant expansion of localized anime",
    "body": "\n\tCrunchyroll is deepening its investment in Thailand with the launch of a Thai-language user interface and a significant expansion of localized anime content.\n\n\tThe anime platform is now making more than 500 titles available to Thai subscribers, including over 70 with Thai dubbing and 300 with Thai subtitles. The rollout adds 70-plus new titles to the service – comprising 26 additional Thai dubs and 44 Thai-subtitled offerings – as the company aims to strengthen its position in one of Southeast Asia’s most robust anime markets.\n\t\n\n\tThe service is available starting at THB99 per month ($3.15) or THB799 ($25.50) annually for the Fan tier, with the Mega Fan plan priced at THB119 ($3.80) monthly or THB999 ($31.80) per year.\n\n\n\tCrunchyroll is currently streaming more than 40 winter season simulcasts with Thai localization, including “Jujutsu Kaisen” Season 3, “Frieren: Beyond Journey’s End” Season 2, “Fire Force” Season 3, “Sentenced to Be a Hero,” “The Demon King’s Daughter is Too Kind!!” and “An Adventurer’s Daily Grind at Age 29.”\n\n\tThe expansion comes as Crunchyroll reports a 50% year-over-year increase in viewership from Thailand, which ranks fourth globally for anime engagement. The market’s appetite for anime theatrical releases was demonstrated last year when “Demon Slayer: Kimetsu no Yaiba Infinity Castle” became the highest-grossing anime film of all time in the country.\n\n\tThe streamer plans to continue expanding its Thai offerings throughout 2026, with 147 additional subtitled and dubbed titles planned, along with 19 more catalog titles set for Thai dubbing. By July, Crunchyroll expects to offer approximately 772 anime titles in Thailand, including 228 with Thai dubs — representing roughly 50% growth in the overall content library.\n\t\n\n\tTo support the launch, Crunchyroll is introducing its “Choose Unordinary” brand campaign in Thailand, featuring original character Hime in hand-drawn creative executions.\n\n\t“Thailand is one of the most passionate and fastest-growing anime markets in Southeast Asia,” said Rahul Purini, president of Crunchyroll. “With our Thai-language interface, a major increase in Thai-dubbed and subtitled content, and faster access to simulcasts and localised dubs, we’re making it easier for fans to experience anime in their own language week after week.”\n\n\tThe company will also participate in Animonium 2026, a Bangkok anime and Japanese pop culture festival running Feb. 6-8 at Siam Paragon Hall, where it will serve as official sponsor of the event’s live music concerts.\n\n\tCrunchyroll is an independently operated joint venture between Sony Pictures Entertainment and Aniplex, a subsidiary of Sony Music Entertainment (Japan).\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Crunchyroll Rolls Out Thai-Language Interface, Expands Localized Content Library (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Crunchyroll-Thailand.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-04T03:00:00.000Z",
      "dateModified": "2026-02-04T03:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Barbara Forever’ Review: Filmmaker Brydie O’Connor Channels the Radical Queer Spirit of Barbara Hammer",
    "url": "https://variety.com/2026/film/reviews/barbara-forever-review-1236644009/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Barbara-Forever.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-04T03:11:09.000Z",
    "description": "\n\tFilmmaker Brydie O’Connor gives herself a rather difficult task with “Barbara Forever.” She sets out to document the life and career of iconic lesbi",
    "body": "\n\tFilmmaker Brydie O’Connor gives herself a rather difficult task with “Barbara Forever.” She sets out to document the life and career of iconic lesbian filmmaker Barbara Hammer in the same medium the prolific artist was known for. To heighten the challenge, Hammer has already documented much of that herself in many experimental films about living as a queer woman. O’Connor proves herself up to the task by eschewing the traditional cradle-to-grave narrative, peppered with interviews with those who knew the protagonist. Instead, she delivers an avant-garde film in the manner of Hammer’s work, educating people about the iconic artist while also making them experience the sort of film Hammer was known for.\n\t\n\n\tO’Connor’s knowledge of Hammer’s work and understanding of her style become apparent from the very first frames of “Barbara Forever.” The audience hears Hammer in voiceover describing herself as a lesbian filmmaker as they see her happily posing naked — two things she has constantly done within her many films. “I’m creating a lesbian history in a world in which we are invisible,” says Hammer as images of her flash through. O’Connor takes that as both a mantra and springboard for what’s to come. \n\n\n\tO’Connor wisely chooses to start the narrative at the time when Barbara came out as queer in 1970, as Hammer liked to say that she was only born when she became a lesbian. From then on, she provides a whirlwind overview of Hammer’s early experiences with women, making films and being a vocal advocate of second-wave feminism. The survey covers many love affairs — most documented in her work and some seen here — until she meets her soulmate Florrie Burke in her late 40s, and continues through to her final battle with cancer. All the footage used is from Hammer’s own films, while her voice fills the soundtrack with her thoughts and beliefs as she tells them funny, sexy and poignant stories of her life. \n\t\n\n\tThough the film is not chronological, by the end, it allows us to understand Hammer well and know most of her life milestones, from the Bay Area to New York, from a fringe artist not understood by the establishment to a recognized pioneer of experimental film whose work is shown at museums and studied in academia. O’Connor interviews Burke, who seems reluctant to appear before Hammer’s lens, but is mellower and more comfortable delivering on her promise to discuss her late partner so that the work might live forever. \n\n\t“Barbara Forever” pleads the case for Hammer’s relevance for contemporary queer artists. The film shows her collaboration with Joey Carducci, a trans artist from a younger generation. Though Hammer always identified as a lesbian, she was also about solidarity with all queer people. Through this special working relationship and friendship with Carducci, O’Connor frames Hammer as someone who would comfortable and admired in today’s queer art spaces.\n\n\tHaving immersed herself in Hammer’s work for a decade, O’Connor proves herself to be an ideal fit for this documentary. She met Hammer before she died and formed a good relationship with Burke. She even made a short film a few years ago about their love story. O’Connor is also a savvy archivist, which ultimately distinguishes this film. A few of Hammer’s many credits are identified by title and time of production, though O’Connor more often immerses her audience in clips of Hammer’s films presented out of context or chronological order. Somehow, these all flow as one feature-length film, as if all were shot at the same time and from a single script. \n\n\tHammer herself wanted the work to live beyond her own life. With this film, O’Connor becomes a new catalyst for that longevity. “Barbara Forever” stands as a confident feature documentary for its filmmaker, yet also as a singular artistic statement after Hammer that should add new admirers for her work.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Barbara Forever’ Review: Filmmaker Brydie O’Connor Channels the Radical Queer Spirit of Barbara Hammer",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Barbara-Forever.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-04T03:11:09.000Z",
      "dateModified": "2026-02-04T03:11:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Wuthering Heights’ First Reactions: Margot Robbie and Jacob Elordi’s Chemistry Is a ‘Whole Other Level of Hot’ in a ‘Bodice-Ripping Crowd-Pleaser’",
    "url": "https://variety.com/2026/film/news/wuthering-heights-reactions-margot-robbie-jacob-elrodi-1236644150/",
    "image": "https://variety.com/wp-content/uploads/2026/01/rev-1-WHE-T2-0039_High_Res_JPEG.jpeg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-04T03:56:10.000Z",
    "description": "\n\tEmerald Fennell’s “Wuthering Heights” has been unveiled to members of the film press ahead of its Feb. 13 release, and first reactions are calling t",
    "body": "\n\tEmerald Fennell’s “Wuthering Heights” has been unveiled to members of the film press ahead of its Feb. 13 release, and first reactions are calling the steamy literary romance a “bodice-ripping crowd-pleaser” that is “destined to be a massive hit for Warner Bros.”\n\n\tCritic Courtney Howard posted a glowing review on X, calling Fennell’s latest “a god-tier new classic.”\n\n\t“Intoxicating, transcendent, tantalizing, bewitching, lust worthy, hypnotic,” Howard wrote. “Expertly captures the breathtaking ache & essence of desire. [Linus] Sandgren’s cinematography, spellbinding. [Suzie] Davies’ production design, sublime.”\n\t\n\n\tVariety senior artisans editor Jazz Tangacy also praised the film on X. She called “Wuthering Heights” a “scorching hot twisted tale” and lauded the chemistry between stars Margot Robbie and Jacob Elordi as “a whole other level of HOT!”\n\n\n\t“Only Emerald could take a classic, turn it on its head, make you fall completely in lust, and then utterly destroy your soul,” she wrote. “An exquisite spectacle of craftsmanship that left me salivating over the costumes, cinematography and production design. Obsessively in love with it.”\n\n\tEntertainment writer Scott Menzel smelled box office success for “Wuthering Heights.” He wrote on X that the erotic drama is “destined to be a massive hit for Warner Bros.” and will establish director Fennell as “one of the most in-demand filmmakers working today.”\n\n\t“A breathtaking visual work of art, the film feels like it will be a major awards contender, particularly in cinematography, costume design, production design, and score,” Menzel wrote. “And if you already thought Jacob Elordi was the next big thing after ‘Euphoria,’ ‘Saltburn,’ and ‘Frankenstein,’ just wait until you see him here. The sexual tension and chemistry between Margot Robbie and Elordi is so intense you can practically cut it with a knife.”\n\t\n\n\tIndieWire editor at large Anne Thompson also predicted commercial glory for “Wuthering Heights.” She wrote on X, “‘Wuthering Heights’ will open well and soar at the box office. It’s a rip-roaring, bodice-ripping crowd-pleaser. Both Jacob Elordi and Margot Robbie will come out ahead. Audiences will fall for Emerald Fennell’s garish visuals and unrestrained direction. Everything is BIG.”\n\n\tBased on the 1847 novel by Emily Brontë, the film follows the deliciously forbidden romance between Robbie’s Cathy, a wealthy 19th-century patrician, and Elordi’s Heathcliff, a hunky high-society pariah who, after Cathy swears her heart to another, returns to Wuthering Heights to fight for her love. Alongside Robbie and Elordi, the film stars Hong Chau, Alison Oliver, Shazad Latif, Martin Clunes and Ewan Mitchell. The film also features original music from pop superstar Charli xcx.\n\n\t“Wuthering Heights” was first, and most famously, adapted to film by master director William Wyler in 1939, with Merle Oberon and Laurence Olivier in the starring roles. In 2011, “Fish Tank” director Andrea Arnold helmed another version starring Kaya Scodelario and James Howson. There was also a 1970 rendition starring Anna Calder-Marshall and Timothy Dalton, a 1992 adaptation with Juliette Binoche and Ralph Fiennes and an ITV mini-series with Charlotte Riley and Tom Hardy.\n\n\tFennell is a self-proclaimed superfan of the source material, telling a panel at the Brontë Women’s Writing Festival in England in September that she’d “be furious” if she wasn’t the director to bring “Wuthering Heights” into the modern age. She added that she wants her version to make audiences feel how she felt reading “Wuthering Heights” for the first time.\n\n\t“I wanted to make something that made me feel like I felt when I first read it, which means that it’s an emotional response to something,” Fennell said. “It’s, like, primal, sexual.”\n\n\tCheck out the trailer for “Wuthering Heights” below.\n\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Wuthering Heights’ First Reactions: Margot Robbie and Jacob Elordi’s Chemistry Is a ‘Whole Other Level of Hot’ in a ‘Bodice-Ripping Crowd-Pleaser’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/rev-1-WHE-T2-0039_High_Res_JPEG.jpeg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-04T03:56:10.000Z",
      "dateModified": "2026-02-04T03:56:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tracy Zamot, Veteran Publicist for Atlantic, Virgin and Motown Records and Pandora, Dies at 55",
    "url": "https://variety.com/2026/music/news/tracy-zamot-dead-publicist-atlantic-virgin-motown-records-1236651461/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Untitled_36640f-e1770163863541.jpg?w=894&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-04T00:48:29.000Z",
    "description": "\n\tTracy Zamot, a veteran publicist who worked for Atlantic, Virgin and Motown Records, Pandora Radio and others, has died after a long illness, her fa",
    "body": "\n\tTracy Zamot, a veteran publicist who worked for Atlantic, Virgin and Motown Records, Pandora Radio and others, has died after a long illness, her family has confirmed. No specific cause of death was announced; she was 55.\n\n\tA graduate of the State University of New York at Albany, Zamot joined Atlantic Records as a tour publicist in 1992 and rose to vice president over the course of her decade with the company, which saw her working closely with such artists as Matchbox 20 and Rob Thomas, Genesis and Phil Collins, Jimmy Page and Robert Plant of Led Zeppelin, and many others.\n\t\n\n\tShe left Atlantic in late 2001 to join Virgin Records, which at the time was run by her former Atlantic colleague Jason Flom. There, she worked closely with such acts as Lenny Kravitz, Gorillaz, Iggy Pop and others. A two year stint with Universal Motown Records followed next.\n\n\n\tShe returned to high-profile roles in 2015 when she joined Pandora Radio, serving there for nearly three years before a brief stint at SiriusXM. She worked independently for the next several years before joining the Brooklyn Conservatory of Music in 2022.\n\n\tZamot was a friend, co-worker, associate and even a neighbor of this writer for more than 30 years. She was a funny and intelligent person and a no-nonsense publicist whose good cheer and uproarious laughter will be sorely missed.\n\n\tHer husband and companion of 26 years, John Loscalzo, who had worked at CBS Radio, MTV and other companies, passed away in 2015 at the age of just 52. The two leave behind a teenaged daughter.\n\n\tDetails on memorial service and a fund for their daughter will be announced in the coming weeks.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tracy Zamot, Veteran Publicist for Atlantic, Virgin and Motown Records and Pandora, Dies at 55",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Untitled_36640f-e1770163863541.jpg?w=894&h=563&crop=1"
      ],
      "datePublished": "2026-02-04T00:48:29.000Z",
      "dateModified": "2026-02-04T00:48:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘See You When I See You’ Review: Cooper Raiff Deals With His Sister’s Death in a Too-Familiar Traumedy From Director Jay Duplass",
    "url": "https://variety.com/2026/film/reviews/see-you-when-i-see-you-review-1236640732/",
    "image": "https://variety.com/wp-content/uploads/2026/01/See-You-When-I-See-You.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-04T02:00:00.000Z",
    "description": "\n\tIn 2017, “The Big Sick” was the big sale of the Sundance Film Festival (beaten one week later by “Mudbound”). Those were the days when streamers wer",
    "body": "\n\tIn 2017, “The Big Sick” was the big sale of the Sundance Film Festival (beaten one week later by “Mudbound”). Those were the days when streamers were spending big to acquire quality independent movies. The bottom has since fallen out of that market. Now we get cautious nibbles in place of all-night bidding wars. Sadly, audiences aren’t showing up for such movies like they once did, which means that a film like “See You When I See You” — an earnest, emotional indie from director Jay Duplass and the team behind “The Big Sick” — might be more aptly called “Will Anyone Ever See You?”\n\t\n\n\tNeither is quite as snappy as screenwriter Adam Cayton-Holland’s original title, “Tragedy Plus Time,” a reference to the Steve Allen/Carol Burnett/Woody Allen-attributed equation for comedy, but also a pithy way to describe Cayton-Holland’s “memoir of loss and the funniest person I ever knew” (the book’s subtitle). Like “Ordinary People” as viewed through the eyes of a sad clown, the book describes how the death by suicide of Cayton-Holland’s younger sister shook the stand-up comedian and his family.\n\n\n\tIn the movie, the main character is named Aaron (whom Cooper Raiff plays as a tricky mix of abrasive and endearing), so preoccupied with his own guilt and grief that he takes for granted the feelings of his surviving sister Emily (Lucy Boynton) and parents Robert (David Duchovy) and Page (Hope Davis), who might have breast cancer, but is keeping it to herself. Aaron spends most of the movie either drinking, moping or stalking his ex-girlfriend Camila (Ariela Barer), a social worker who turns out to be incredibly patient and sympathetic when he finally explains his reason for ghosting her.\n\t\n\n\tIt’s the latest example of Sundance’s new favorite genre, the “traumedy,” in which something devastating has already happened to the main characters, and laughter serves as a kind of healing tool — or a way to make the pain of excavating that core wound more palatable for audiences. We’re a long way from the carefree laughs of “Little Miss Sunshine” and “Napoleon Dynamite” here, though not quite as insufferable as the genre’s more serious-minded alternative, to which I might advise: Trauma is not drama. It’s better off as subtext, the way such damage works in reality, complicating matters as we try to deal with all the other challenges life throws at us.\n\n\tOne-third of the Grawlix comedy troupe, Cayton-Holland is naturally funny, and his instinct is to apply humor to even the toughest subjects (which, audiences may recall, was Kumail Nanjiani’s recipe for dealing with his wife Emily V. Gordon’s mysterious illness in “The Big Sick”). In the film, Aaron manages a comedy site called Kumquat, though his pitches turn super dark in the wake of his sister’s death. So does he, treating every little setback as a personal attack by the universe. “Is that poop?!” he bellows when a bird does what a bird does on his head (another comedy-equals-tragedy-plus-time example most people find difficult to appreciate in the moment).\n\n\tRaiff, the director and star of such indie comedies as “Shithouse” and “Cha Cha Real Smooth,” could be the generation-younger equivalent of Duplass, who played a similarly complicated sibling/son in Amazon’s “Transparent” series. “See You When I See You” benefits from Duplass’ own emotional maturity. The improv-driven films he made with younger brother Mark (among the most successful examples of the early-2000s mumblecore movement) succeed because his characters are so in touch with their feelings.\n\n\tAaron still has a lot to work through about his sister’s death. He remembers Leah (Kaitlyn Dever) as the wild and spontaneous one in the family, as demonstrated by a childhood memory in which she acts unpredictably during a lakeside photo. There’s something off about the way this opening scene looks: It’s too gauzy, and also weirdly oversaturated. But that flat, cheap, made-for-television vibe doesn’t go away when the film catches up to the present. DP Jim Frohna, whose only other feature was shooting for “The Big Sick” director Michael Showalter, has worked mostly in TV. But DIY-inclined Duplass was never much of a visual stylist, eschewing such distractions for whatever reads as the most honest and true.\n\t\n\n\tThat’s a problem here, since he’s working from a more traditional script — one in which flashbacks to the night Leah died keep intruding, along with ghostly fantasies in which Leah appears to Aaraon, only to be sucked up into the sky via underfunded visual effects. Cayton-Holland’s writing can be quite eloquent and insightful , but the movie lacks the spontaneity that made Duplass’ past work seem so alive (from those early collaborations with his brother to last year’s solo directing debut “The Baltimorons”).\n\n\tIt feels a bit too much like going to therapy, right down to the scenes where Aaron goes to therapy, which he stubbornly resists. He doesn’t want a funeral or any other kind of ceremony, going so far as to steal the urn from his parents’ house. “You’re just nervous your eulogy’s not going to be the best thing ever written,” Emily analyzes. Audiences can sense where everything is headed: toward self-forgiveness and a full-family group hug.\n\n\tThat’s the problem with traumedies. They peddle the fantasy that if we can just name or face the root cause, then all will be well with the world. “See You When I See You” may be a bit simplistic, but it is sincere. On his own journey toward a solo directing career, Duplass has made a movie with audiences in mind — a relatable story for anyone who’s ever lost someone or just felt lost yourself.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘See You When I See You’ Review: Cooper Raiff Deals With His Sister’s Death in a Too-Familiar Traumedy From Director Jay Duplass",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/See-You-When-I-See-You.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-04T02:00:00.000Z",
      "dateModified": "2026-02-04T02:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Cape Fear’ First Look Shows Javier Bardem as Vengeful Max Cady as Apple TV Series Sets Premiere Date",
    "url": "https://variety.com/2026/tv/news/cape-fear-first-look-javier-bardem-release-date-1236650510/",
    "image": "https://variety.com/wp-content/uploads/2026/02/MixCollage-03-Feb-2026-12-20-AM-6672.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-04T00:00:00.000Z",
    "description": "\n\tApple TV‘s upcoming “Cape Fear” series starring Javier Bardem, Amy Adams and Patrick Wilson will premiere with two episodes on June 5. The images we",
    "body": "\n\tApple TV‘s upcoming “Cape Fear” series starring Javier Bardem, Amy Adams and Patrick Wilson will premiere with two episodes on June 5. The images were unveiled at Apple TV’s 2026 Press Day on Feb. 3, as well as a teaser that played only in the room. Creator and showrunner Nick Antosca moderated a panel with Wilson and Wilson.\n\n\tThe 10-episode drama series is based on John D. MacDonald’s 1957 novel “The Executioners” as well as Martin Scorsese’s 1991 film “Cape Fear,” which was a remake of Gregory Peck’s 1962 adaptation of the novel. Scorsese is an executive producer on the new series, as is Steven Spielberg, who executive produced Scorsese’s adaptation.\n\t\n\n\tAntosca introduced the panel by talking about how much Scorsese’s movie scared him — which Wilson and Adams agreed with — saying, “there’s a kind of feverish energy to it,” and “it’s Southern, it’s swampy — it looks like a nightmare.” Antosca said that he didn’t want to spoil any twists, but that the original story has been “reimagined.”\n\n\n\tIn this version of the story, which examines “America’s obsession with true crime in the 21st century” according to an official description, “a storm is coming for happily married attorneys Anna (Adams) and Tom Bowden (Wilson) when Max Cady (Bardem), the notorious killer they are responsible for putting behind bars, is let out of prison — and he wants vengeance.” The ensemble cast also includes CCH Pounder, Joe Anders, Lily Collias, Jamie Hector, Malia Pyles, Anna Baryshnikov, Ron Perlman, Ted Levine and Margarita Levieva.\n\n\tAntosca asked Adams and Wilson about how they captured the story’s “elemental terror,” and they talked about being parents trying to protect their children at all costs — “full stop,” Adams said.\n\t\n\n\tAdams said that Bardem brought his “natural charisma” to the role of Max Cady, made iconic in the films by Robert Mitchum and Robert DeNiro. But Bardem put a twist on the villain role, Adams said: “He also brings a lot of vulnerability, and there’s so much devastation in this betrayal. I look forward to you guys getting to see it.”\n\n\tAntosca considers the Scorsese film to be firmly in the horror genre, a tone that inspired the series as well. “The first moment the show, to me, is about ambient dread,” Antosca said. “And it reflects the atmosphere of being alive in 2026, with its uncertainties and ambiguities and paranoia.”\n\n\tAlong with Scorsese and Spielberg, executive producers include Antosca and Alex Hedlund via Eat the Cat; Darryl Frank and Justin Falvey for Spielberg’s Amblin Television banner; Bardem; Adams; and Morten Tyldum, who also served as director on the pilot. The series was developed and produced through Universal Studio Group’s Universal Content Productions, where Antosca has been under an overall deal since 2017.\n\n\tApple TV also debuted a first look at Bardem, Adams and Wilson in character. See the photos below.\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tCourtesy of Apple\n\t\n\n\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tCourtesy of Apple\n\t\n\n\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tCourtesy of Apple\n\t\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Cape Fear’ First Look Shows Javier Bardem as Vengeful Max Cady as Apple TV Series Sets Premiere Date",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/MixCollage-03-Feb-2026-12-20-AM-6672.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-04T00:00:00.000Z",
      "dateModified": "2026-02-04T00:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tom Llamas Will Tackle Trump Interview Slated to Appear in Super Bowl Pre-Game for NBC News",
    "url": "https://variety.com/2026/tv/news/tom-llamas-super-bowl-trump-pre-game-interview-nbc-news-1236651367/",
    "image": "https://variety.com/wp-content/uploads/2026/02/tom-llamas-nbc-news-2-061825-5eca8a263fb04f4db36ecff25e096039.webp?w=750&h=500&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-03T23:38:00.000Z",
    "description": "\n\tNow it’s Tom Llamas‘ turn to try his hand at a Super Bowl tradition: the pre-game interview with the President of the United States.\n\n\tLlamas, the a",
    "body": "\n\tNow it’s Tom Llamas‘ turn to try his hand at a Super Bowl tradition: the pre-game interview with the President of the United States.\n\n\tLlamas, the anchor of “NBC Nightly News,”  will sit down with President Donald Trump for an exclusive  interview at the White House on Wednesday, February 4. A portion of the exchange will air on “NBC Nightly News”  at 6:30 p.m. eastern that day, with an extended version streaming on “Top Story with Tom Llamas,” the live-streamed programs shown on NBC News Now, at 7 p.m. \n\t\n\n\tA separate segment of the interview will air during NBC’s Super Bowl pre-game show on Sunday, February 8. \n\n\n\tNBC’s handling of the “get” spotlights how much the business of news has changed. In most years, the Super Bowl pre-game interview got the most emphasis, with other segments following across other shows backed by the news outlet that snared the access. But in an era when news doesn’t hold for very long, NBC News may feel obligated to share what it has as soon as its able. \n\n\tOne reason for the different order in distribution? The interview, which became a more formal part of the Super Bowl ritual during the Obama administration, has become less of a guarantee in recent years. President Trump avoided one with NBC News in 2018, and President Joe Biden didn’t take part in one with Fox in 2023 or CBS News in 2024 — in hindsight, that decision may have been tied to what were perceived to be some declines in his public-speaking abilities.\n\n\tTrump sat down with Fox News’ Bret Baier for a pre-taped exchange that aired ahead of Fox’s telecast of Super Bowl LIX in 2025. President Joe Biden spoke to NBC’s Lester Holt in 2022. \n\t\n\n\tA bevy of TV journalists have described the Super Bowl interview as one of the toughest assignments in TV news. Over the years, notable anchors including Gayle King, Scott Pelley and Matt Lauer have interviewed the president, all of them live. “I would say it’s the most important interview of my life,” Bill O’Reilly told Variety in 2017 in the hours leading up to his interview with Trump before Fox’s broadcast of Super Bowl LI. NBC News’ Savannah Guthrie interviewed President Obama in 2015, and told Variety the process was “really tricky.“\n\n\tBut it has become less so during Trump’s time in office. The interviews in recent years have almost all been taped beforehand, giving news organizations the chance to edit remarks and decide how best to feed different programs and various platforms that range from streaming services to traditional TV shows.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tom Llamas Will Tackle Trump Interview Slated to Appear in Super Bowl Pre-Game for NBC News",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/tom-llamas-nbc-news-2-061825-5eca8a263fb04f4db36ecff25e096039.webp?w=750&h=500&crop=1"
      ],
      "datePublished": "2026-02-03T23:38:00.000Z",
      "dateModified": "2026-02-03T23:38:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Apple Unveils 2026 Film Slate: Ryan Reynolds Fights a New War, Jonah Hill Gives Keanu Reeves the ‘Jay Kelly’ Treatment and ‘Matchbox’ Revs Up",
    "url": "https://variety.com/2026/film/news/apple-original-movies-ryan-reynolds-matchbox-warrior-kid-1236651475/",
    "image": "https://variety.com/wp-content/uploads/2026/02/MixCollage-03-Feb-2026-04-46-PM-4589.jpg?crop=12px%2C41px%2C1166px%2C655px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-02-04T01:18:09.000Z",
    "description": "\n\tThough Apple is still on an award season run with “F1,” the tech monolith popped the hood on numerous new movies it will release in 2026.\n\n\tAt a blo",
    "body": "\n\tThough Apple is still on an award season run with “F1,” the tech monolith popped the hood on numerous new movies it will release in 2026.\n\n\tAt a blowout media event in Los Angeles on Tuesday, Apple Studios took over Santa Monica’s Barker Hangar to unveil footage and conversations from its forthcoming slate. Cameron Diaz, Keanu Reeves, Chris Pratt, Amy Adams, Colin Farrell and more showed to create buzz with global press and influencers.\n\t\n\n\tWhile heavy on series, five feature titles were introduced, starting with Jonah Hill’s “Outcome.” The film will mark Hill’s third directorial effort, after 2018’s “Mid90s” and the 2022 therapy documentary “Stutz.”\n\n\n\tLed by Reeves, Diaz and Matt Bomer, “Outcome” tells a story of sobriety and redemption through a Hollywood lens. Reeves plays Reef Hawk, a movie star who spends five years off the grid recovering from heroin addiction. As Hawk’s handlers, Bomer and Diaz learn that a mysterious and incriminating video featuring the actor may come to light. The team struggles to find out what could be on the tape, sparking an amends spree for the leading man that helps him confront old ghosts and ask for forgiveness.\n\n\tIt’s interesting to see Hill explore themes of isolation and public exposure. The actor-director himself has kept a low profile since 2023, when his ex-girlfriend and pro surfer Sarah Brady published private text messages that many viewed as controlling and abusive on Hill’s part.\n\n\t“Outcome,” which Hill co-wrote with Ezra Woods, asks what an apology really means and who it serves. An early trailer was played for the crowd, the highlight of which was a cameo from soap queen Susan Lucci (she plays Reeves’ expletive-spewing mother). It has a “Jay Kelly” vibe, left bleaching in the Malibu sun (where much of the movie seems to be set). The film hits Apple TV globally on April 10.\n\t\n\n\tNext came the briefest of looks at “The Dink,” a pickleball comedy starring Jake Johnson, Mary Steenburgen and Ed Harris. Johnson, of the beloved “New Girl” ensemble, plays a tennis prodigy cut short after a run-in with Andy Roddick. To the chagrin of his dad (Harris), Johnson’s character takes up pickleball with Steenburgen as a partner. He finds a new passion and confronts old demons while enjoying, presumably, very low-impact cardio. Josh Greenbaum (“Barb and Star Go to Vista Del Mar”) directs, and the film hits the platform on July 24.\n\n\n\n\t\n\n\t\t\t\t\tArturo Castro, left, Jessica Beil, John Cena, Teyonah Parris and Sam Richardson in “Matchbox The Movie.” \n\t\t\t\t\t\t\t\t\tCourtesy of Apple\n\t\n\n\n\n\tThird up was “Matchbox The Movie,” what will be Mattel Films’ second significant outing since the unit relaunched in 2023 with box office phenomenon “Barbie.”  A trailer played for the room showed off what seems to be a squeaky-clean take on “Fast and Furious.” The cutesy ensemble includes John Cena and Jessica Biel (who have surprising chemistry, and it’s so nice to see Biel back on a movie screen), Sam Richardson (“Veep”), Teyonah Parris (“The Marvels”) and Arturo Castro (“Broad City”). Skydance co-produced the project, which hits Oct. 9.\n\n\tChris Pratt touched down to reveal “The Way of the Warrior Kid,” an adaptation of Navy SEAL Jocko Willink’s nonfiction work that teaches kids about valor. Pratt plays uncle to the oft-bullied Marc (“Belfast” star Jude Hill) and helps train him in the ways of self-defense and integrity. Linda Cardellini co-stars, and McG (“Charlie’s Angels”) directs for a Nov. 20 release.\n\n\tThe day wrapped with a virtual message from Ryan Reynolds and Kenneth Branagh, speaking from the set of Apple and Skydance’s “Mayday.”  \n\n\tThis Cold War-era action comedy is a first for Reynolds, who is probably happy to be fighting a different kind of battle. The actor said he finally “gets to play the character in need of saving” in the pre-recorded greeting. As a Navy pilot who crashes on Russian territory, Reynolds relies on Branagh’s ex-KGB agent to help him survive and protect American interests. That hits Apple TV+ on Sept. 4.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Apple Unveils 2026 Film Slate: Ryan Reynolds Fights a New War, Jonah Hill Gives Keanu Reeves the ‘Jay Kelly’ Treatment and ‘Matchbox’ Revs Up",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/MixCollage-03-Feb-2026-04-46-PM-4589.jpg?crop=12px%2C41px%2C1166px%2C655px&resize=1000%2C563"
      ],
      "datePublished": "2026-02-04T01:18:09.000Z",
      "dateModified": "2026-02-04T01:18:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Lisa Rinna Says ‘Karma Is Coming’ for Rob on ‘The Traitors,’ Addresses Controversial Colton Underwood Comment: ‘He Wanted a Housewife, So I Gave Him a Housewife’",
    "url": "https://variety.com/2026/tv/news/the-traitors-lisa-rinna-colton-underwood-rob-betrayal-1236651460/",
    "image": "https://variety.com/wp-content/uploads/2026/02/NUP_207888_01278.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-04T00:55:44.000Z",
    "description": "\n\tSPOILER ALERT: This story contains spoilers from the seventh episode of “The Traitors” Season 4, now streaming on Peacock.\n\n\tLisa Rinna made it seve",
    "body": "\n\tSPOILER ALERT: This story contains spoilers from the seventh episode of “The Traitors” Season 4, now streaming on Peacock.\n\n\tLisa Rinna made it seven episodes as a Traitor on Season 4 of “The Traitors” — long enough to wear the dress she wanted to to the Black Banquet and rack up an impressive body count. During her time in the game, the Traitors successfully murdered “Big Brother” star Ian Terry, “Survivor” legend Rob Cesternino, “Real Housewives of Dubai” star Caroline Stanbury, “RuPaul’s Drag Race” winner Monét X Change and “Survivor” winner Yam Yam Arocho.\n\t\n\n\tFor fans accustomed to Rinna’s chaotic, scene-stealing antics on “The Real Housewives of Beverly Hills,” “The Traitors” revealed a different side of her — a calculated, strategic and surprisingly stealthy one. She kept off the Faithfuls’ radar for weeks until Yam Yam, whom she had just murdered at the Black Banquet, screamed her name as he was escorted out and sealed the deal.\n\n\n\t“I literally kill him, and then as he’s being taken out, he screams my name,” she tells Variety. “That’s good TV… like, he just sunk you.”\n\n\tThe “RHOBH” alum was selected as one of the original Traitors alongside Candiace Dillard Bassett and Rob Rausch. In Episode 7, Rob led the charge to banish her, voting against her and convincing the house to eliminate her despite her efforts to redirect suspicion toward “Survivor” star Natalie Anderson. Lisa admitted she had no idea her Traitor ally was orchestrating her downfall until after the episodes aired.\n\n\tThe intensity of the experience required recovery time, but she has no regrets — and plenty of opinions about the Faithful players’ detective skills. “The Faithfuls are so bad,” she says. “They really are; they’re terrible.”\n\t\n\n\tBelow, she spoke to Variety about Rob’s betrayal, that infamous Yam Yam moment, her dynamic with Colton Underwood and why she “loved murdering people.”\n\t\n\t\t‘The Traitors’ seems very stressful to be a part of. Your daughter mentioned to Variety that you needed time to “heal” after filming. What was that process like?\t\n\n\tIt did take me a minute to kind of recalibrate. It’s an intense experience, and so I needed a little time. And now I’m great. My husband and I were watching the show, and he was watching the roundtable with Michael [Rapaport] and Colton, and he goes, “OK, now I understand what you went through. There’s a lot of psychosis going around this table.” Finally, you understand what I went through.\n\t\n\t\tRob voted against you, and kind of led the charge to get you banished —\t\n\n\tKind of? Kind of? Hello!\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tEuan Cherry/PEACOCK\n\t\n\n\n\t\n\t\tYes, it was him. When did you realize he was willing to sacrifice you?\t\n\n\tI never knew. I mean, he voted for me the night before, so my spidey senses were already up. But I had no idea that he was leading the charge the next day. That’s surprising, but that’s the game. He’s smarter than I am, because everyone thought it was going to be me going against the Traitors, and it wasn’t. I can’t fault him for it. It was sad, because I love my little Traitor group, my little Traitor family. It’s great to kiki and have fun, but at the end of the day, it’s called “Traitors.” This always happens — Traitor-on-Traitor crime. I happen to be the Traitor-on-Traitor crime. I’m kind of glad it wasn’t me doing it. He’s getting a lot of shit for it, and I think he deserves every bit of it.\n\t\n\t\tLet’s talk about the Black Banquet and Yam Yam screaming your name. Did you actually kiss him differently than anyone else?\t\n\n\tI air-kissed everyone. If you look at the tape, he comes in to kiss me first. It’s not me. And I don’t kiss people — I air kiss people. He also has a beard. You’re not going to go in and kiss a beard. It was frustrating that it was all about the kiss because we know it was about the amulet. But you can’t say that… The minute he screamed my name, I was like, “Oh, Rinna, you’re sunk. You’re sunk. That’s it.” No matter what, his conviction was so strong that I can see why Rob was like, “All right, well, she’s a sinking ship. I might as well just literally sink her.” He’s going to have a little karma for that, but that’s OK. He’s young. He’ll figure it out.\n\t\n\t\n\t\tSo what was your first reaction when Yam Yam yelled your name?\t\n\n\tMy first reaction was, “Did he just say your name?” And then I was like, “Oh my God, he just said my name.” Inside, I’m laughing because you can’t write that. I literally kill him, and then as he’s being taken out, he screams my name? That’s good TV. The producer kind of thing in my head is going, “Wow, that’s really good.” I was sunk the minute he screamed my name with such conviction. No matter what, I was just like, someone should just give me a cigarette and I’ll just go.\n\t\n\t\tYou and Candiace almost flipped the vote onto Natalie. Do you think you could have survived another round if it weren’t for Rob coming after you at the round table?\t\n\n\tI do — I think that I could have gone one more episode. It was already going toward Natalie, but Rob must have wanted to keep Natalie. I’m not sure what his gameplay is, but there’s a reason why he went after me, and I’ll ask him that at the reunion. “What made you finally make that decision?” Because I’m curious. \n\t\n\t\tColton had it out for you for much of the game, and he’s received a lot of negative attention online since the show premiered. You made a joke about him being a “stalker,” seemingly referring to his past, but you later apologized. What’s your relationship with him now?\t\n\n\tI didn’t know anything about his past. I will say, in my defense, he wanted a Housewife, so I gave him a Housewife moment in my sassy response to a thread message. Then it was like putting gas on a fire, and I didn’t want to do that. It’s not what I’m out to do. Listen, he was a great nemesis for me. I can see that, and I thanked him for it while we were in the game. I saw it for that. It makes me sad that anybody gets hate online, because I’ve been through it, and I certainly don’t want to be a part of somebody else’s hate online. So I didn’t like that.\n\t\n\t\tDid you enjoy being a Traitor?\t\n\n\tI loved murdering people. It was so much fun. I loved being a Traitor. I loved every second of it. I wouldn’t change anything. I had the best time of my life.\n\n\tThis interview has been edited and condensed.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lisa Rinna Says ‘Karma Is Coming’ for Rob on ‘The Traitors,’ Addresses Controversial Colton Underwood Comment: ‘He Wanted a Housewife, So I Gave Him a Housewife’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/NUP_207888_01278.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-04T00:55:44.000Z",
      "dateModified": "2026-02-04T00:55:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Stock Up On These Hannah Stocking Hot Shots ... Happy 34th!",
    "url": "https://www.tmz.com/2026/02/04/stock-up-on-these-hannah-stocking-hot-shots-happy-34th/",
    "image": "https://imagez.tmz.com/image/b1/16by9/2025/02/03/b13998a663c34ff488a35d5ec89dbe0a_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-04T08:01:12.000Z",
    "description": "\n    \n                    \n                          Hannah Stocking\n                          Stock Up On Hot Shots For Her 34th Bday\n               ",
    "body": "\n    \n                    \n                          Hannah Stocking\n                          Stock Up On Hot Shots For Her 34th Bday\n                      \n                  \n                                                                        Published \n                              February 4, 2026\n                            12:01 AM PST\n                                                                            \n      \n    \n      \n        \n              \n    \n    \n          Hannah Stocking is celebrating another trip around the sun ... and we're marking the occasion by taking a look at some of her sexiest snaps.\n      \n    \n          The influencer and actress turns 34 today and she's supplying the cake ... look no further than her bikini photos.\n      \n    \n          Hannah was spotted at dinner recently with Los Angeles Rams star wide receiver Puka Nacua ... and it's easy to see why Puka is interested.\n      \n    \n          Click through the gallery for Hannah's greatest hits ... she's checking all the boxes and hitting all the angles.\n      \n    \n          Oh, and happy birthday Hannah ... hope you got some gifts ... or stocking stuffers.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Puka Nacua\n              \n                          \n                Hotties & Bodies\n              \n                          \n                Hot Bodies\n              \n                          \n                Birthdays\n              \n                          \n                Photo Galleries\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Stock Up On These Hannah Stocking Hot Shots ... Happy 34th!",
      "image": [
        "https://imagez.tmz.com/image/b1/16by9/2025/02/03/b13998a663c34ff488a35d5ec89dbe0a_xl.jpg"
      ],
      "datePublished": "2026-02-04T08:01:12.000Z",
      "dateModified": "2026-02-04T08:01:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Mitch McConnell Hospitalized With Flu-Like Symptoms",
    "url": "https://www.tmz.com/2026/02/03/mitch-mcconnell-hospitalized/",
    "image": "https://imagez.tmz.com/image/f2/16by9/2026/02/04/f200e9aa52894c3b85a5aae9fe15a7a1_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-04T00:59:58.000Z",
    "description": "\n    \n                    \n                          Mitch McConnell\n                          Hospitalized\n                      \n                  \n",
    "body": "\n    \n                    \n                          Mitch McConnell\n                          Hospitalized\n                      \n                  \n                                                                        Published \n                              February 3, 2026\n                            4:59 PM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Mitch McConnell is under medical care after a health scare.\n      \n    \n          The 83-year-old Kentucky Republican was hospitalized Monday night after experiencing flu-like symptoms over the weekend, his office said. According to a spokesperson, McConnell checked himself into a local hospital out of \"an abundance of caution\" to be evaluated by doctors.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          The good news here is his camp says his prognosis is positive. \"He is grateful for the excellent care he is receiving,\" the statement read, adding that McConnell has remained in regular contact with his staff and is already looking forward to getting back to work in the Senate.\n      \n\n          No further details were provided about how long McConnell is expected to remain hospitalized.\n      \n    \n          In October, the lawmaker tumbled to the ground in the halls of the U.S. Capitol while being asked about ICE by activists. He was helped to his feet by aides and continued on to cast votes after the incident.\n      \n    \n      \n        \n                    \n                  \n      \n                    X/@ErikRosalesNews\n          \n    \n          Earlier this year, he said he would not seek reelection in 2026, planning to serve out the rest of his current term through January 2027.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Mitch McConnell\n              \n                          \n                Politics\n              \n                          \n                Health\n              \n                          \n                News\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Mitch McConnell Hospitalized With Flu-Like Symptoms",
      "image": [
        "https://imagez.tmz.com/image/f2/16by9/2026/02/04/f200e9aa52894c3b85a5aae9fe15a7a1_xl.jpg"
      ],
      "datePublished": "2026-02-04T00:59:58.000Z",
      "dateModified": "2026-02-04T00:59:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Valentine's Day Gifts Under $100",
    "url": "https://www.tmz.com/2026/02/04/valentines-day-gifts-under-100/",
    "image": "https://imagez.tmz.com/image/6b/16by9/2026/01/20/6b04e5bebea94f119754213c968e913c_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-04T08:05:50.000Z",
    "description": "\n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          TMZ may colle",
    "body": "\n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          TMZ may collect a share of sales or other compensation from links on this page.\n      \n    \n          Valentine’s Day is right around the corner … but don’t panic because there's still enough time to pick out something your date will truly love.\n      \n    \n          Whether you completely forgot or were waiting for payday to make your purchase, we've got you covered with great gifts that won't break the bank.  \n      \n    \n          From fine jewelry to accessories and even self care gadgets, it's all under $100 AND will show up on your door step in record time. Don't worry, we won't tell anyone that you waited until the last minute! \n      \n    \n          TMZ CHEAT SHEET: VALENTINE’S GIFTS UNDER $100\n  \n    \n          IMOLOVE Lab Grown Diamond Ring -- $89The Pearl Source Freshwater Pearl Pendant Necklace -- $80kate spade new york Mini Zip Card Case -- $78The Ridge Wallet and Card Holder -- $95Manscaped The Lawn Mower 4.0 Pro -- $90ChainsPro Miami Cuban Link Chain -- $21\n      \n    \n              FOR HER\n        \n    \n              \n      IMOLOVE Lab Grown Diamond Ring\n      \n        \n    \n                    \n                          \n                                  \n      \n        \n    \n          If you want to look like you splurged (but actually saved big bucks), the IMOLOVE Lab Grown Diamond Ring is the perfect gift.\n      \n    \n          This stunning ring features 18 sparkling gemstones, crafted with lab grown diamonds which gives them the same composition and brilliance as a natural jewel.\n      \n    \n          Using a micro-pavé setting, you’ll get a smooth, secure fit that won’t snag or scratch … ensuring this ring is everlasting, just like your romance.\n      \n    \n              \n      The Pearl Source Freshwater Pearl Pendant Necklace\n      \n        \n    \n                    \n                          \n                                  \n      \n        \n    \n          Sometimes simple and chic is the way to go! This timeless The Pearl Source Freshwater Pearl Pendant Necklace features a hand-selected, real cultured freshwater pearl set on a sterling silver chain.\n      \n    \n          If she’s not into diamonds or brightly colored gemstones, this necklace is the ideal addition to her collection.\n      \n    \n          It’ll add a touch of glamour to any occasion, whether your Valentine is wearing it to the office or for a night out on the town.\n      \n    \n              \n      kate spade new york Mini Zip Card Case\n      \n        \n    \n                    \n                          \n                                  \n      \n        \n    \n          She’ll love this kate spade new york Mini Zip Card Case. This handy little wallet is perfect for all of her essentials and thanks to its miniature size, it can fit in any sized purse, both big and small.\n      \n    \n          With convenient slots for credit cards and identification, it also features a zip pouch for change…and maybe even a few beauty items! Plus, it’s also got an attached key ring for keeping everything close. \n      \n    \n              FOR HIM\n        \n    \n              \n      The Ridge Wallet and Card Holder\n      \n        \n    \n                    \n                          \n                                  \n      \n        \n    \n          If he’s so over carrying around a bulky leather wallet, then The Ridge Wallet and Card Holder is an absolute must-have. It can expand to hold up to 12 cards and other essentials like cash … all without stretching and becoming hard to manage.\n      \n    \n          And on top of that, its aluminum build includes RFID-blocking technology, meaning he’ll be safe from wireless theft and digital skimming too. \n      \n    \n              \n      Manscaped The Lawn Mower 4.0 Pro\n      \n        \n    \n                    \n                          \n                                  \n      \n        \n    \n          There’s nothing wrong with a little manscaping! Give him the gift of his smoothest shave yet with the Manscaped The Lawn Mower 4.0 Pro.\n      \n    \n          This waterproof groin and body hair trimmer was designed for below-the-waist grooming but works for every curve and corner of the body.\n      \n    \n          And it comes equipped with a SkinSafe ceramic blade that’s rounded for comfort with a built-in guard designed to help reduce nicks and cuts.\n      \n    \n              \n      ChainsPro Miami Cuban Link Chain\n      \n        \n    \n                    \n                          \n                                  \n      \n        \n    \n          If you’re balling on a budget, this ChainsPro Miami Cuban Link Chain will make it look like you spent big money on his gift. This chain is made from sturdy stainless steel with a smooth and glossy gold-plated finish.\n      \n    \n          It’s the perfect choice if he’s trying out jewelry for the first time and isn’t ready to invest in an expensive piece. Plus, it comes in a variety of lengths and styles, so there’s plenty of options even if gold isn’t his color.  \n      \n    \n          Sign up for Amazon Prime to get the best deals!\n      \n    \n          All prices subject to change.\n      \n      ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Valentine's Day Gifts Under $100",
      "image": [
        "https://imagez.tmz.com/image/6b/16by9/2026/01/20/6b04e5bebea94f119754213c968e913c_xl.jpg"
      ],
      "datePublished": "2026-02-04T08:05:50.000Z",
      "dateModified": "2026-02-04T08:05:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Video Shows Blood Outside Home of 'TODAY' Anchor Savannah Guthrie's Missing Mom",
    "url": "https://www.tmz.com/2026/02/03/nancy-guthrie-blood-outside-home-video/",
    "image": "https://imagez.tmz.com/image/7d/16by9/2026/02/03/7d25256598f3453c8c09dafb2a018100_xl.png",
    "tag": "Entertainment",
    "date": "2026-02-03T22:14:32.000Z",
    "description": "\n    \n                    \n                          Nancy Guthrie's Kidnapping\n                          New Video Shows Blood Trail Outside Front Do",
    "body": "\n    \n                    \n                          Nancy Guthrie's Kidnapping\n                          New Video Shows Blood Trail Outside Front Door\n                      \n                  \n                                                                        Published \n                              \n                February 3, 2026\n                \n                            2:14 PM PST\n                                                                      |\n                                                                Updated \n                                  February 3, 2026\n                                3:10 PM PST\n                                    \n      \n    \n      \n        \n                    \n                  \n      \n                    NewsNation\n          \n    \n          There's a trail of blood leading away from the front door of the Arizona home of 'TODAY' anchor Savannah Guthrie's kidnapped mom ... and it's all on video.\n      \n    \n          New footage captured by NewsNation Senior National Correspondent Brian Entin shows blood drops and splatter on Nancy Guthrie's front porch.\n      \n    \n          Nancy was reported missing Sunday -- cops say she was snatched from her bed in the middle of the night -- and it looks like there's an unopened Amazon package on the porch too.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Blood was reportedly found inside the home, alongside signs of forced entry ... and the Pima County Sheriff's Department says DNA samples collected at the Tucson-area home are confirmed to belong to Nancy.\n      \n\n          It's unclear if the blood we're seeing outside the home belongs to Nancy ... but we know homicide detectives are investigating the case.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          TMZ has received an alleged ransom note demanding payment for Nancy's release ... and there's a deadline and a demand for millions' worth of Bitcoin. We've forwarded the note to law enforcement.\n      \n    \n          Savannah's been absent from 'TODAY' amid her mom's abduction ... though she did thank fans for their thoughts and prayers.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Savannah Guthrie\n              \n                          \n                Nancy Guthrie\n              \n                          \n                Celebrity News\n              \n                          \n                Today Show\n              \n                          \n                True Crime\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Video Shows Blood Outside Home of 'TODAY' Anchor Savannah Guthrie's Missing Mom",
      "image": [
        "https://imagez.tmz.com/image/7d/16by9/2026/02/03/7d25256598f3453c8c09dafb2a018100_xl.png"
      ],
      "datePublished": "2026-02-03T22:14:32.000Z",
      "dateModified": "2026-02-03T22:14:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Quinton Aaron's Family Says His Wife Isn't Legit, She Claims Spiritual Marriage",
    "url": "https://www.tmz.com/2026/02/03/quinton-aaron-margarita-marriage-spiritual/",
    "image": "https://imagez.tmz.com/image/d6/16by9/2026/01/30/d6b25f33d93345fbb13e224dfcd326e0_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-03T23:36:15.000Z",
    "description": "\n                    \n                          Quinton Aaron\n                          Family Says 'Wife' Is Married to Another Man ...\n             ",
    "body": "\n                    \n                          Quinton Aaron\n                          Family Says 'Wife' Is Married to Another Man ...\n                          She Calls It 'Spiritual' Marriage\n                      \n              \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Quinton Aaron's recovering in the hospital from a spinal stroke, but his family says the woman who is by his side and making medical decisions for him is fibbing about being his wife ... though she begs to differ.\n      \n    \n          The actor's brother, Jarred Aaron, tells TMZ ... the woman claiming to be his wife, Margarita Aaron, is actually married to another man. His immediate worry is she's misrepresenting herself as his legal wife to the medical staff at the hospital and is helping to make \"crucial and life-saving medical decisions.\"\n      \n    \n          Margarita tells us ... she and Aaron \"got spiritually married.\"\n      \n\n          She adds ... she does NOT have power of attorney, and has never made medical decisions on Quinton's behalf.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Jarred isn't buying that, saying ... \"I genuinely fear for my brother's life.\"\n      \n    \n          Margarita says, \"If he's saying I'm such a bad person, why does he live with me and Quinton?\" In response, Jarred says he didn't know they weren't legally married when they all lived under the same roof.\n      \n    \n          Quinton, by all accounts, has not been confronted with these claims ... his brother says he's not telling Quinton yet, and is going to wait until he makes a full recovery from the spinal stroke his family says he suffered.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Still, Jarred says ... \"I have all this crucial information that Quinton doesn't know about and now it feels like I've gotten it too late.\"\n      \n    \n          Quinton's family tells us in a new statement ... \"Since the health crisis of our beloved family member Quinton Aaron, we have raised some suspicions about the legitimacy of Quinton & Margarita’s 'marriage' to each other as well as her legitimacy as a registered nurse.\"\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          The family adds ... \"We have found some alarming details. We as a family believe Margarita isn't who she claimed to be to us. This has caused us to want to investigate her further.\"\n      \n    \n          Margarita's own family members are also backing up the Aaron family's suspicions ... with her daughter and niece telling us Margarita is indeed married to another man.\n      \n      ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Quinton Aaron's Family Says His Wife Isn't Legit, She Claims Spiritual Marriage",
      "image": [
        "https://imagez.tmz.com/image/d6/16by9/2026/01/30/d6b25f33d93345fbb13e224dfcd326e0_xl.jpg"
      ],
      "datePublished": "2026-02-03T23:36:15.000Z",
      "dateModified": "2026-02-03T23:36:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]