[
  {
    "title": "Fantasy Live-Action Adventure ‘The Elf and the Christmas Wonder’ Debuts Trailer, First Distribution Partners Revealed (EXCLUSIVE)",
    "url": "https://variety.com/2025/film/global/the-elf-and-the-christmas-wonder-trailer-1236554412/",
    "image": "https://variety.com/wp-content/uploads/2025/10/The-Elf-and-the-Christmas-Wonder.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-16T15:38:14.000Z",
    "description": "\n\tFilmmakers Joonas Berghäll and Hannes Vartiainen have unveiled the first trailer for their upcoming fantasy live-action family adventure, “The Elf a",
    "body": "\n\tFilmmakers Joonas Berghäll and Hannes Vartiainen have unveiled the first trailer for their upcoming fantasy live-action family adventure, “The Elf and the Christmas Wonder,” which is described as a “heartwarming holiday tale of courage, magic and sisterly love set against the enchanting backdrop of Lapland.”\n\n\n\n\n\tGlobal Constellation is handling international sales and has announced the first slate of distribution partners. Scanbox Entertainment is set to release the film theatrically across Scandinavia in November 2025, while Wild Bunch will oversee distribution in German-speaking territories. Additional deals have been secured with World Pictures for the CIS region, Karantajina for the former Yugoslavia, and Front Row for Middle East and North Africa.\n\t\n\n\t“The Elf and the Christmas Wonder” follows Lumi and her soul sister Talvi, who have been inseparable since birth, until Talvi is adopted, leaving Lumi behind in their snowy orphanage. Determined to reunite with her, Lumi sets off into the frozen wilderness, only to stumble upon a secret world hidden beneath the snow: a bustling Christmas factory run by elves. With the help of Pyry, a rule-breaking elf with a big heart, Lumi sets out on a Christmas Eve mission aboard Santa’s sleigh.\n\n\n\tThe film was produced by Joonas Berghäll, Santeri Salminen and Hannes Vartiainen for Oktober Oy. It stars Soma Zimmatore (“Winnie-the-Pooh: Blood and Honey 2”), Thea Achiella (“Blitz,” “A Christmas Carol”), and Marco Stylianou, and was written by Veera Tyhtilä, Joonas Berghäll, Hannes Vartiainen and Mette Sø.\n\t\n\n\t“The Elf and the Christmas Wonder” is the latest family adventure title on the Global Constellation slate, joining CG-animated features “Charlie the Wonderdog,” directed by Shea Wageman and featuring the voice of Owen Wilson, and Reza Memari’s “The Last Whale Singer.” Both films are now ready for delivery and are gearing up for theatrical releases early next year.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Fantasy Live-Action Adventure ‘The Elf and the Christmas Wonder’ Debuts Trailer, First Distribution Partners Revealed (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/The-Elf-and-the-Christmas-Wonder.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-16T15:38:14.000Z",
      "dateModified": "2025-10-16T15:38:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘The Idea of You’ Author Robinne Lee Sets Second Novel ‘Crash Into Me’ for Summer 2026 (EXCLUSIVE)",
    "url": "https://variety.com/2025/film/news/the-idea-of-you-author-robinne-lee-new-book-crash-into-me-1236554089/",
    "image": "https://variety.com/wp-content/uploads/2025/10/Robinne-Lee-e1760567405509.jpg?crop=0px%2C26px%2C770px%2C433px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-10-16T15:15:00.000Z",
    "description": "\n\tRobinne Lee, author of the bestselling romance novel “The Idea of You,” will publish her second book, “Crash Into Me,” next summer. \n\n\tLee’s debut, ",
    "body": "\n\tRobinne Lee, author of the bestselling romance novel “The Idea of You,” will publish her second book, “Crash Into Me,” next summer. \n\n\tLee’s debut, 2017’s “The Idea of You” — about a woman on the precipice of turning 40 who embarks on a whirlwind romance with the lead singer of a boy band — sold nearly a million copies worldwide. The film adaptation, starring Oscar winner Anne Hathaway alongside Nicholas Galitzine, became a global sensation, drawing over 50 million viewers on Amazon’s Prime Video and becoming the streamer’s No. 1 romantic comedy debut of all time.\n\t\n\n\t“Women feel like I see them and see their worth and their value; how they want the world to see them as — and how they’re afraid that the world no longer sees them,” Lee told Variety about “The Idea of You’s” breakthrough success. “I’ve given them permission to live that reality more fully, and to step outside of the box that society’s placed them in.”\n\n\n\tLikewise, “Crash Into Me” is described as a “bold and fresh novel of love, lust and self-discovery.” The novel follows Cecilia Chen, a wife and mother who reluctantly relocates from Paris to Los Angeles for her husband’s work with their two children in tow. As the title suggests, the story’s inciting incident is a car crash, and the other driver is Anouk Ferrand, a swan-necked beauty from Cecilia’s past.\n\n\t“It’s been 20 years since she last encountered the enigmatic model, on a photo shoot in Mexico,” the book’s synopsis details. (The year was 1996. Cecilia was a photographer’s assistant; Anouk was an unknown model, and this was the shoot that made her name.) “And it’s this chance meeting that will upend Cecilia’s life.”\n\t\n\n\tThe synopsis continues: “Sexy and spellbinding, at ‘Crash Into Me’s’ core are familiar and complex challenges for many women: how to express creativity, how to be frankly sexual and emotionally vibrant in and out of a marriage, how to be an authentic friend and a good mother. In Cecilia, Lee creates a character straddling cultures: she’s an artist of Jamaican descent from the East Coast married to a Frenchman whose career has catapulted beyond her own.”\n\n\tThe intensity of the women’s physical and emotional entanglement is the driving force of the narrative, which also aims to hook readers by exploring the dynamics of Cecilia’s conflicted marriage and her worries about raising her multiracial children amid L.A.’s climate of privilege and power. “Will what happened between them two decades ago sever the fragile bonds of the present? Will their addictive relationship destroy everything Cecilia has built? Will she find her way home?” the story posits.\n\n\tIn a statement previewing the book, Lee teased: “I wanted to seduce my readers with a privileged, glamorous backdrop and an uncertain future. To lead them on an unexpected journey. Show them the world through a different lens. And give them something to think about long after the last page.”\n\n\tSt. Martin’s Press has acquired the North American rights to the novel, which will be published on July 7, 2026. Elizabeth Beier, St. Martin’s executive editor, acquired the rights in a deal brokered by Richard Pine of InkWell Management. Penguin Michael Joseph (PMJ) will publish the novel in the U.K. on July 9.\n\n\tBorn and raised in New York, Lee is a graduate of Yale University and Columbia Law School. She’s a writer, producer and actress, most recently seen in Netflix’s limited series “Kaleidoscope” opposite Giancarlo Esposito. She also appeared in “Hitch,” “Seven Pounds,” “Hotel for Dogs,” “13 Going on 30,” “Being Mary Jane” and the “Fifty Shades” franchise.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘The Idea of You’ Author Robinne Lee Sets Second Novel ‘Crash Into Me’ for Summer 2026 (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/Robinne-Lee-e1760567405509.jpg?crop=0px%2C26px%2C770px%2C433px&resize=1000%2C563"
      ],
      "datePublished": "2025-10-16T15:15:00.000Z",
      "dateModified": "2025-10-16T15:15:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Wicked’: How ‘For Good’s Story of Friendship Resonates With Jon M. Chu, Alice Brooks and Myron Kerstein in Real Life",
    "url": "https://variety.com/2025/artisans/festivals/wicked-for-good-story-of-friendship-with-jon-m-chu-1236547131/",
    "image": "https://variety.com/wp-content/uploads/2025/10/Wicked_-For-Good.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-16T16:10:04.000Z",
    "description": "\n\tIt seems fitting that this year’s Creative Collaborator award recipients, Jon M. Chu, cinematographer Alice Brooks and editor Myron Kerstein, are pa",
    "body": "\n\tIt seems fitting that this year’s Creative Collaborator award recipients, Jon M. Chu, cinematographer Alice Brooks and editor Myron Kerstein, are part of the team who brought “Wicked” and its sequel, “Wicked: For Good,” to the big screen. The film is a story about friendship and Chu, who has known Brooks since their days as film students at USC, says, “It is really even more full-circle to be making a movie like this and explore friendship with my friends.”\n\t\n\n\t“Wicked” is the story of the witches of Oz before “The Wizard of Oz.” Next month, “Wicked: For Good” brings the story to a close as the friendship of Glinda (Ariana Grande) and Elphaba (Cynthia Erivo) is put to the test.\n\n\tThe Creative Collaborators Award will be presented at the Middleburg Film Festival on Oct. 17. The festival runs from Oct. 16–19.\n\n\n\tVariety talked to the honorees about working together on several films, including “Wicked: For Good.”\n\n\n\n\t\n\n\t\t\t\t\t‘Crazy Rich Asians’\n\t\t\t\t\t\t\t\t\tCourtesy of Warner Bros.\n\t\n\n\n\t\n\t\tWhat was your first impression of Jon when you met him back in film school?\t\n\n\tAlice Brooks: Jon was a production designer that I did at school. I wanted Jon to turn this apartment into this disastrous New York slum. So he took the newspaper and put it on the wall with glue. It looked beautiful and then he didn’t ever clean it up. He just left.\n\n\tJon M. Chn: I had a partner who said they were going to do it. That’s my explanation.\n\n\tI remember Alice because she was a superstar, so I knew her before that. She wrote something that got chosen, and she was the DP on it. I remember watching that story and being shocked because it was shot in a subway, and when it went dark, it was all black light. It was shocking to me. So I always wanted to work with Alice.\n\t\n\n\tMyron, how did you get involved with Jon on “Crazy Rich Asians”?\n\n\tKerstein: I heard that I was on the list of potential editors that Warner Bros. was considering to present to Jon for this film called “Crazy Rich Asians,” and I quickly became intrigued because I was a fan of Jon’s films already. I ended up using every resource I could to get in the room. That room happened to be Skype, and Jon was in Malaysia. I just had to go guns blazing and say, “I’ll put 300% into this thing. I know you don’t know who I am, but I love this script already.” And he hired me.\n\n\tChu: He moved to Malaysia, and we were there eating chicken and rice and had a great time. We found that movie together, like, we really did. I’m changing diapers for the first time while we’re editing in the room next door, and I’m bringing the baby in with headphones so she can’t hear anything while we’re blasting Coldplay. It was a really beautiful experience. And then I was like, “I’m never, never letting you go. You made my life so much better, and you’re making our movies better.”\n\t\n\t\tMoving all these years forward, you’re collaborating on “Wicked” and “Wicked: For Good.” How would you describe this friendship and your shorthand?\t\n\n\tBrooks: We’ve been on this for four and a half years. Jon called first called while Myron was cutting “In the Heights,” and I don’t think a day has gone by that not one of us has at least spoken to each other. I talk to Myron all the time. I just spent all week with Jon.\n\n\tWhen I’m not talking with them, they’re talking with one another. It’s a bittersweet ending to the movie because it’s been all three of us walking down the yellow brick road together for the last four and a half years.\n\n\tKerstein: To be each other’s cheerleader, but also to express your worries without having to worry about hurting somebody’s feelings. It’s just an amazing journey. I’ve been able to grow more since I’ve met Jon and Alice than I had in the 15 or so years before. That trust and love is so unique in this industry.\n\n\tChu: I think trust and love is right. I think trust is No. 1. We all came at a time in our lives where we had something to prove. We have all been underestimated in our work. I love working with people who love their work more than anything and who have pride in the work. That’s not always the case, especially if people have been around for a while. I think we fight for what we believe in, and we are looking for something bigger in our storytelling. We came in [as] underdogs, especially in “Wicked” where everyone around us — the studio and everyone was like, “Can these people do it?” And we’re like, we already know we can. We’ve done it on different scales. So I think that camaraderie is really beautiful. So we’re protecting each other in every moment. But I think now we’ve done it enough times that we trust our creative process that we can riff and find, and that’s where the magic is for us.\n\t\n\t\n\t\tWhat can we expect this time around with “Wicked: For Good?”\t\n\n\tBrooks: This movie is so much bigger and expansive than the first movie. It is just this epic conclusion to our story. It’s beautiful, wonderful and a huge, emotional journey. The first movie is effervescent and about choices, and the second movie is about consequences, and you can feel that weight and density throughout the movie. Half of the first movie takes place during the day, and the second movie takes place during the night, and there’s there. So both movies together feel cohesive.\n\t\n\t\tMyron, you’ve mentioned cutting the first film, you cried during the Ozdust ballroom sequence, is there a scene that made you cry this time around?\t\n\n\tKerstein: It’s probably not a big spoiler to say that “For Good” is a major emotional moment in this movie, and I’m excited for the audience to experience Jon, Cynthia and Ari’s interpretation of it. I’ll just say that I’ve watched that particular number probably over 100 times. Even yesterday, when we’re finishing the mix, it didn’t fail to make me cry.\n\n\tChu: There are so many moments. What I love about movie two is that we have lived with this whole story for four and a half. We have lived with this arc, and the world only knows the first half. The magic trick was to make the first half feel like a complete story, but we left a lot dangling. But the fact that people have accepted that and love it, wait until you see what the girls do in “For Good.” If you thought they were great actors, then this is where the meat is. This is the reason for “Wicked” to even exist. You see Cynthia do “No Good Deed.” I have never watched it with just two people who haven’t applauded at the end of that number, it thrusts it out of you. I’m not sure there’s a bigger number ever of a singular person singing a singular song that is more epic. It is a classic waiting to happen, and so I can’t wait for people to feel that.\n\n\tPeople don’t even know what’s about to happen there. Ari singing “Couldn’t Be Happier.” Oh, my God, that’s one of the hardest ones to crack. And when you have Jonathan Bailey and Cynthia singing.\n\n\tThese kids who watch the first film, they’re going to grow up in movie two. It’s real emotions. This is where we can really expand in the cinematic scope and not just look visual, but I’m talking emotional ways, so I love what Myron said, we get to just advance the movie, making part of it as well, because the girls have advanced in it.\n\t\n\n\tBy the way, we’re shooting this one day after the other so it’s not like they had to jump constantly. It’s all crafts people really making sure it works.\n\t\n\t\tWell, we can’t wait to see “Wicked: For Good.”\t\n\n\tChu: To connect it all that for a movie that’s all about friendship, the hardships of friendship and the beauty of friendships, it’s hard to say goodbye, but at the same time, it’s just as beautiful to have that be made by friends who have gone through the ups and downs, who fight regularly, but love each other in the end.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Wicked’: How ‘For Good’s Story of Friendship Resonates With Jon M. Chu, Alice Brooks and Myron Kerstein in Real Life",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/Wicked_-For-Good.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-16T16:10:04.000Z",
      "dateModified": "2025-10-16T16:10:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Dwayne Johnson and Benny Safdie’s ‘Lizard Music’ Lands at Amazon MGM Studios’ United Artists",
    "url": "https://variety.com/2025/film/news/dwayne-johnson-benny-safdie-lizard-music-united-artists-1236554193/",
    "image": "https://variety.com/wp-content/uploads/2025/10/2239856627-e1760573019791.jpg?crop=0px%2C56px%2C1905px%2C1073px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-10-16T16:15:00.000Z",
    "description": "\n\tDwayne Johnson and Benny Safdie‘s next collaboration, a movie titled “Lizard Music” — which sees Johnson as a 70-year-old called “Chicken Man” with ",
    "body": "\n\tDwayne Johnson and Benny Safdie‘s next collaboration, a movie titled “Lizard Music” — which sees Johnson as a 70-year-old called “Chicken Man” with a 111-year-old chicken named Claudia as his closest companion — has landed at Amazon MGM Studios’ United Artists.\n\n\tSafdie is directing and wrote the script, based on the Daniel Pinkwater novel of the same name. UA and Scott Stuber landed the hot project in a competitive situation.\n\n\n\t“We are so thrilled to partner once again with extraordinarily talented Dwayne Johnson, as well as work for the first time with the amazing creator, writer and director Benny Safdie, on ‘Lizard Music,'” stated Courtenay Valenti, head of film, streaming and theatrical for Amazon MGM. “Everyone at Amazon MGM and UA is deeply inspired by their previous collaboration on the critically acclaimed ‘The Smashing Machine.’ We are so excited to now collaborate with them on this imaginative, entertaining and cinematic story; ‘Lizard Music’ is a tale that feels both timeless and unique. We are very fortunate that they have trusted us to be their studio partners.”\n\t\n\n\tThe film will follow a boy opens a “hidden door to the extraordinary” when he “stumbles upon a secret late-night broadcast of lizards playing otherworldly music,” an early synopsis explains. “His search for answers leads him to the eccentric and whimsical septuagenarian Chicken Man, and his beloved companion, a 111-year-old chicken named Claudia — two kindred spirits who found each other at just the right time. United by this shared vision, they set off on an adventure that begins as a hunt for a hidden society but blossoms into something far greater: a voyage through invisible worlds, unexpected harmonies and the unbreakable bond between lost souls who discover magic not only in what they find, but in each other.”\n\t\n\n\tIn his statement, Safdie shared that he’d read Pinkwater’s “Lizard Music” to his two sons. “We were riveted by its imagination and wonder,” the filmmaker said. “I love Daniel Pinkwater as a person and an author; the idea of making a movie where everyone can join the conversation is both thrilling and beautiful. To go on this adventure with Dwayne and to be able to watch him transform and become the Chicken Man is just beyond… I can’t wait!”\n\n\tStuber will produce the film alongside UA’s Nick Nesbitt, Safdie (for his Out for the Count Productions), Johnson (for his Seven Bucks Productions) and Magnetic Fields Entertainment’s David Koplan.\n\n\t“I’ve been lucky enough to work with Dwayne and Benny on multiple projects and have seen firsthand their incredible talents and connection as artists,” Stuber said. “The world they’ve created together for ‘Lizard Music’ is unlike anything either has done before, and we couldn’t be more excited to bring this wonderfully imaginative story to life.”\n\n\tNews of the forthcoming project broke amid Johnson and Safie’s press tour for “The Smashing Machine,” as the wrestler-turned-actor appeared noticeably thinner on the red carpet. (He’d packed on 30 lbs to play MMA fighter Mark Kerr for that film and delivered a performance which is garnering Oscar buzz.) In interviews, including with Variety’s Marc Malkin, Johnson explained that his fluctuating appearance was preparation for his next movie.\n\n\t“I’ve been dieting,” Johnson said at the film’s Los Angeles premiere. “Happy to not be carrying all the weight. I’m able to tuck in my shirt now…I don’t look pregnant so it’s all good.” About the character’s final look, he added: “Think Clint Eastwood at 75. Sinewy muscles, he’s lean.”\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Dwayne Johnson and Benny Safdie’s ‘Lizard Music’ Lands at Amazon MGM Studios’ United Artists",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/2239856627-e1760573019791.jpg?crop=0px%2C56px%2C1905px%2C1073px&resize=1000%2C563"
      ],
      "datePublished": "2025-10-16T16:15:00.000Z",
      "dateModified": "2025-10-16T16:15:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Big Thief on ‘Double Infinity,’ the Band ‘Breakup’ and Rejecting ‘Icky’ Opportunities: ‘What People Want Is the Very Thing They Ask You to Sacrifice’",
    "url": "https://variety.com/2025/music/news/big-thief-double-infinity-rejecting-brand-partnerships-1236551791/",
    "image": "https://variety.com/wp-content/uploads/2025/10/bigthief.png?crop=91px%2C53px%2C739px%2C415px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-10-16T16:15:00.000Z",
    "description": "\n\tIt’s often said that Big Thief functions like a four-headed organism.\n\n\tGathered at a picnic table in a Brooklyn park, the members of the folk-rock ",
    "body": "\n\tIt’s often said that Big Thief functions like a four-headed organism.\n\n\tGathered at a picnic table in a Brooklyn park, the members of the folk-rock outfit cross limbs and finish each other’s sentences, weaving their thoughts into a long-winded quilt. At one point, singer Adrianne Lenker looks across the table at guitarist Alexander “Buck” Meek and says, “Alexander,” communicating in one word that she wants him to remove his blue-tinted biker glasses so she can see his eyes. Message received.\n\t\n\n\tSo last year, when the band “broke up” with bassist Max Oleartchik, chopping off one of those heads, Big Thief didn’t wallow in his absence but rather expanded, becoming something else entirely. For their sixth album, “Double Infinity,” the band invited 10 additional musicians into the studio, including percussionists, vocalists, jazz players and New Age artist Laraaji. The album preserves Big Thief ’s earthy, country-tinged sound but injects it with tapestried rhythms and an exotic flair.\n\n\n\t“We wanted to push into the change and not hold on to something that isn’t there,” says drummer James Krivchenia, clad in a torn-up blue hoodie and Lennon-esque sunglasses. The result is a strange and sometimes fascinating album, where Lenker’s delicate warble floats above drones, tape loops and Laraaji’s wordless chanting. On “Words,” Meek breaks into a frenetic solo, warping his instrument into a sped-up, distorted sitar. And replacing Oleartchik as Big Thief ’s touring bassist is Joshua Crumbly, whose hypnotizing groove anchors “No Fear.”\n\t\n\n\tBut is Oleartchik’s departure a permanent one, or might he return at some point?\n\n\t“I don’t know,” Lenker says, covering her eyes with Meek’s sunglasses.\n\n\tAfter a brief pause, her two bandmates chime in: “It feels pretty permanent.”\n\n\t“I mean, it feels permanent,” she agrees. “It’s just weird to say.”\n\n\tBig Thief recorded “Double Infinity” in the winter, reveling in daily bike rides from Brooklyn to a Hell’s Kitchen studio in the icy cold. It was important to them to tape “Double Infinity” in New York, the city where, more than a decade ago, Lenker met Meek, fell in love and formed a band that has outlasted their marriage. (The song “Los Angeles” traces their larger-than-labels relationship over the years.)\n\n\tIn the early days, the duo slept on a concrete floor in a “slumlord artist house” in Bushwick. Lenker had a job on the Upper West Side polishing silverware, and Meek worked as a bike courier. They saved up $3,500 to buy a van they named Bonnie and routed tours across the East Coast, performing in dive bars and backyards. Lenker says they lost money on most of those shows, “but I always felt so rich.”\n\n\t“It didn’t matter if we were playing in a basement and the microphones broke, or we didn’t have a guitar because our instruments broke, or our van broke,” Lenker recalls. “We, come hell or high water, would play music. It’s something that can’t be destroyed.”\n\n\t“Connecting with the infinite,” she adds, “nobody can take that away.”\n\n\tAfter years of critically beloved albums, nonstop touring and a couple surprise indie hits, Big Thief is now on their biggest tour yet, having just performed at the Hollywood Bowl and looking ahead to Forest Hills Stadium. But as bands become popular, they also become businesses. Lenker says it’s their job to “protect the heart at the center of our music.” That means three-hour meetings every Monday in which the band discuss potential opportunities, shooting down the ones that feel “icky.” Imitating a ninja with an invisible sword, she says it feels like “slicing energies” away.\n\n\tBig Thief has weathered algorithmic forces and avoided the “commodification” of their music. They’ve turned down licensing offers — like a Levi’s commercial — as well as brand partnerships. Meek says Harley Davidson once offered to follow the band with a film crew as they rode motorcycles from California to South by Southwest. “Driving through the desert, wind in our hair, it sounded fun,” Meek says. “But hell no.”\n\t\n\n\t“What people want is the very thing they ask you to sacrifice,” Lenker says. “The thing that draws people to you in the first place, you’re given every opportunity to give that thing up.”\n\n\t“I’ve seen a lot of people lose touch,” Meek adds. “We want to be making records and playing shows together for the rest of our lives. We put a lot of thought into protecting that.”\n\n\tHe stops, looks across the table and playfully snatches his sunglasses back from Lenker.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Big Thief on ‘Double Infinity,’ the Band ‘Breakup’ and Rejecting ‘Icky’ Opportunities: ‘What People Want Is the Very Thing They Ask You to Sacrifice’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/bigthief.png?crop=91px%2C53px%2C739px%2C415px&resize=1000%2C563"
      ],
      "datePublished": "2025-10-16T16:15:00.000Z",
      "dateModified": "2025-10-16T16:15:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "OnlyFans Documentary ‘Virtual Girlfriends’ to Open Ji.hlava Film Festival",
    "url": "https://variety.com/2025/film/global/onlyfans-documentary-virtual-girlfriends-jihlava-1236554326/",
    "image": "https://variety.com/wp-content/uploads/2025/10/Virtual-Girlfriends.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-16T15:22:23.000Z",
    "description": "\n\tThe Ji.hlava Intl. Documentary Film Festival will open on Oct. 24 with Czech director Barbora Chalupová’s “Virtual Girlfriends,” which reflects on t",
    "body": "\n\tThe Ji.hlava Intl. Documentary Film Festival will open on Oct. 24 with Czech director Barbora Chalupová’s “Virtual Girlfriends,” which reflects on the OnlyFans internet platform.\n\n\tThrough the stories of three women, the film follows the process of content creation, conversations with subscribers, and the everyday dynamics of their romantic and work relationships. Where is the line between work and intimacy, and who is actually the victim in all this?\n\t\n\n\t” ‘Virtual Girlfriend’ is not a sensationalist look at eroticism, but an attempt to understand how intimacy, relationships, and our ideas about closeness are changing in the digital world,” Chalupová said. “The audience in Ji.hlava is curious and sensitive. They perceive current phenomena without prejudice and seek out films that open up space for dialogue. I am glad that our film can open this year’s edition of this festival, which gives space to ethically sensitive and courageous documentaries.”\n\n\n\tJi.hlava director Marek Hovorka said, “The film does not dwell on the surface and does not rely on sensationalism, but approaches the more general theme of loneliness in the digital world. The OnlyFans website thus becomes just one of many social networks, and the protagonists of the film are not so different from ordinary users of other social networks as it might seem at first glance.”\n\n\tThe film will be screened in both Opus Bonum and Czech Joy sections.\n\n\tThe festival will offer 305 films, including 76 world premieres, 28 international premieres, and 15 European premieres.\n\n\tThe Opus Bonum competition section will feature 15 films. “Open” by Slovak director Diana Fabiánová explores open marriage through the eyes of the director herself, who turns the camera on herself and her partner, revealing the ethical and emotional layers of intimacy.\n\t\n\n\tMaximilien Dejoie’s tragicomic film “Everything Works Out (In the End)” follows former sex worker Katelyn, whose journey for faith, meaning and redemption turns into a parable about U.S. society.\n\n\tThe seven-hour film diary “While the Green Grass Grows: A Diary in Seven Parts” by Swiss-Canadian director Peter Mettler offers a meditation on human existence, time, and the places we inhabit. From canyons and deserts to forests and caves, it reveals the universal experiences of life and death and connects spectacular landscape images with intimate details of everyday life.\n\n\tThe documentary “Music in a Village Named 1PB” by Indian director Surabhi Sharma transports viewers to the Thar Desert in western Rajasthan, where a Muslim community of musicians preserves poetry and music that transcends the boundaries of religion and nation. The film sensitively shows the connection between people and the landscape, culture, and environment that shapes their identity.\n\n\tLandscape is also an important element in the documentary “Bürglkopf,” about a “return center,” by Austrian director Lisa Polster. The film contrasts the picturesque Alpine scenery of Tyrol with the hopelessness and isolation of the people who live in this landscape involuntarily – rejected asylum seekers placed on top of the Bürglkopf mountain. Panoramic shots of mountains and pastures create an illusion of peace and freedom, which is immediately shattered by the awareness of the existence of a strictly guarded center.\n\n\tAll films in the Opus Bonum section can be found here.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "OnlyFans Documentary ‘Virtual Girlfriends’ to Open Ji.hlava Film Festival",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/Virtual-Girlfriends.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-16T15:22:23.000Z",
      "dateModified": "2025-10-16T15:22:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NBCU, Apple Team on Apple TV-Peacock Bundles Priced at Discount of up to 37%",
    "url": "https://variety.com/2025/tv/news/apple-tv-peacock-bundle-pricing-discounts-1236554494/",
    "image": "https://variety.com/wp-content/uploads/2025/10/Apple-TV-Peacock-Bundle.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-16T16:00:00.000Z",
    "description": "\n\tNBCUniversal and Apple are joining forces on the streaming front — betting they can win new subscribers by offering price-discounted bundles of Peac",
    "body": "\n\tNBCUniversal and Apple are joining forces on the streaming front — betting they can win new subscribers by offering price-discounted bundles of Peacock and Apple TV. The partnership also includes a cross-sampling component, letting standalone Apple TV and Peacock subs watch a selection of the other service’s shows for no extra cost.\n\n\tThe new Apple TV-Peacock bundles will be available beginning Oct. 20 to new customers in the U.S. The package will bring together Apple originals including “Ted Lasso,” “Severance” and “The Morning Show” with Peacock’s “The Paper,” “The Office,” “The Traitors,” “Love Island USA” and more — including the NBA (which launches Oct. 21 on Peacock with pro basketball returning to NBCU after more than two decades).\n\t\n\n\tCustomers in the U.S. can save 37% by subscribing to the Apple TV and Peacock Premium (with ads) bundle for $14.99 per month, or 33% with the Apple TV-Peacock Premium Plus (limited ads) bundle for $19.99 per month. The deals are available through both services’ apps and websites.\n\n\n\tOn a standalone basis, Apple TV — which the tech giant is rebranding to scrub the plus sign from “Apple TV+” — now costs $12.99 per month in the U.S. after a price hike this summer. After their own recent price increases, Peacock Premium (which includes ads) is $10.99/month and Premium Plus (which has limited ads in live programming) is $16.99 per month.\n\n\tIn addition, Apple One subscribers on the Family and Premier plans can subscribe to Peacock Premium Plus and receive a 35% discount. That’s the first benefit of its kind for Apple’s all-in-one subscription bundle, according to the companies.\n\t\n\n\tAs part of the partnership, Apple TV app users and Peacock subscribers will be able to sample a selection of the partner service’s shows in each respective app. At launch, Peacock subscribers will have access to up to three episodes of “Stick,” “Slow Horses,” “Silo,” “The Buccaneers,” “Foundation,” “Palm Royale” and “Prehistoric Planet” from Apple TV for no additional cost. Conversely, Apple TV app users will be able to watch up to three episodes of “Law & Order,” “Bel-Air,” “Twisted Metal,” “Love Island Games,” “Happy’s Place,” “The Hunting Party” and “Real Housewives of Miami” from Peacock.\n\n\tSeparately, Comcast — NBCU’s parent company — offers the StreamSaver bundle, priced at $15 per month for Xfinity customers, which provides Peacock, Apple TV and Netflix. The Apple TV-Peacock bundle is different: It’s available nationwide, and Apple also will be partnering with Peacock to market it.\n\n\tFor NBCU, the deal to bundle Apple TV with Peacock is part of a broader strategy to pursue more bundling and channels deals, aimed at driving growth for Peacock and exposure to even more audiences. For example, in August, NBCU announced a pact with Amazon to let Prime Video customers subscribe to Peacock. This month, NBCU secured a long-term distribution agreement with Google for carriage of its channels on YouTube TV, including the upcoming launch of Peacock as a subscription through YouTube Primetime Channels.\n\n\tUntil recently, NBCU had not looked to forge many channel and bundle deals as it focused on growing the Peacock subscriber base directly. Now, company execs believe Peacock has reached critical mass in terms of its portfolio of sports rights, originals, next-day NBC and Bravo content, and movies including titles from Universal.\n\n\t“There is no more perfect combination of entertainment than the Apple TV and Peacock Bundle, with our complementary content portfolios featuring the best shows, movies, sports and live events,” said Matt Strauss, chairman of NBCUniversal Media Group. “With this first-of-its-kind initiative with Apple, we’re redefining what the customer journey should be for a streaming bundle with rich sampling and a smooth sign-up process, and we’re broadening the reach of Peacock to even more audiences.”\n\n\tOliver Schusser, Apple’s VP of Apple TV, Apple Music, Sports and Beats, said in a statement: “We’re thrilled to introduce this all-inclusive bundle of incredible programming and to bring Apple TV’s beloved shows and movies to more viewers in more places. From acclaimed originals to can’t-miss live sports, the Apple TV and Peacock Bundle unites the best of entertainment in a simple and seamless experience.”\n\t\n\n\tHere’s a promo video for the Apple TV-Peacock bundle:\n\n\n\n\n\tPictured top: Reese Witherspoon and Jennifer Aniston in Apple TV’s “The Morning Show,” Steve Carrell in “The Office”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NBCU, Apple Team on Apple TV-Peacock Bundles Priced at Discount of up to 37%",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/Apple-TV-Peacock-Bundle.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-16T16:00:00.000Z",
      "dateModified": "2025-10-16T16:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "When Co-Stars Become Competitors: Inside Oscar’s Toughest Supporting Actress Race Ever",
    "url": "https://variety.com/2025/film/awards/co-stars-supporting-actress-oscars-one-battle-marty-supreme-1236553762/",
    "image": "https://variety.com/wp-content/uploads/2025/10/Supporting-Actress-Oscars.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-16T15:45:00.000Z",
    "description": "\n\tLet me tell you a story. It’s not about kings or dragons or battles in a galaxy far, far away — it’s about Oscar contenders, given a golden pathway,",
    "body": "\n\tLet me tell you a story. It’s not about kings or dragons or battles in a galaxy far, far away — it’s about Oscar contenders, given a golden pathway, only to find too many people crowding the road, making it nearly impossible to reach the end of the yellow brick trail.\n\n\tThere’s a particular kind of Oscar-season tragedy that has nothing to do with surprise snubs. It unfolds quietly, almost mathematically — like a game of musical chairs where the music never stops, but the seats still somehow vanish. In this season’s best supporting actress race, we’re watching that story unfold in real time.\n\t\n\n\tThis awards season has brought a glut of riches. Several presumed best picture contenders arrive not with one, but multiple standout supporting performances. It’s a filmmaker’s dream — and an actor’s dilemma. When too many brilliant performances share the same ballot line, excellence becomes its own worst enemy. That’s particularly true this year with top-tier contenders such as “One Battle After Another,” “Sentimental Value” and “Marty Supreme,” with others hovering just behind them.\n\n\n\tPaul Thomas Anderson’s “One Battle After Another” has turned both Regina Hall and Teyana Taylor into critical sensations — Hall with her seasoned restraint and sublimated grief, and Taylor with raw, electric volatility. Either could mount a serious Oscar campaign. Neither may survive having to split the vote.\n\n\tJoachim Trier’s “Sentimental Value” faces the same predicament. Elle Fanning, long overdue for Academy recognition, delivers what many consider her finest work yet — measured, devastating, revelatory. But Norwegian actress Inga Ibsdotter Lilleaas, in a quieter register, commands equal attention from international critics. Trier has coaxed career-defining performances from both his stars. Ironically, that achievement may be his undoing.\n\t\n\n\tJosh Safdie’s “Marty Supreme” pits Odessa A’zion’s breakout ferocity against Gwyneth Paltrow’s scene-stealing “comeback turn” — exactly the kind of narrative Oscar voters have historically devoured. But which one gets enough momentum to carry through?\n\n\tHere’s the truth. We’ve seen this before.\n\n\n\n\t\n\n\t\t\t\t\tElijah Wood, left, Andy Serkis and Sean Astin in “The Lord of the Rings: The Return of the King”\n\t\t\t\t\t\t\t\t\t©New Line Cinema/Courtesy Everett Collection\n\t\n\n\n\n\tIn the 2003 Oscar season, before the eventual best picture nominees were locked in, a deep bench of standout supporting performances emerged — and most were left out.\n\n\tIn the eventual best picture winner “The Lord of the Rings: The Return of the King,” Sean Astin was the mainstream favorite, riding a wave of emotion and goodwill for his portrayal of Samwise Gamgee. But speculation also swirled around Ian McKellen, previously nominated for “The Fellowship of the Ring,” and Viggo Mortensen, whose portrayal of Aragorn had become one of the trilogy’s most beloved elements. (Let’s not forget those banging the drum for Andy Serkis’ motion-capture brilliance as Gollum.) In the end, none of them were nominated — despite the film sweeping 11 Oscars.\n\n\tA similar story unfolded with Clint Eastwood’s “Mystic River,” widely believed to be the runner-up in best picture. Tim Robbins won best supporting actor, but many assumed co-star Kevin Bacon would finally land his first nomination. Only one made it onto the ballot.\n\n\t“Seabiscuit,” meanwhile, entered the race with a sprawling, critically respected ensemble. William H. Macy scored a Golden Globe nomination, Chris Cooper was recognized by SAG, and Jeff Bridges was seen as a potential spoiler on nomination morning. None were named on the day.\n\n\tThe pattern is clear — when multiple contenders come from the same film, votes split. A little support for everyone often results in not enough support for anyone.\n\n\tConsider the 1994 film year, when both supporting acting categories flirted with the possibility of double-dipping.\n\n\t“Forrest Gump” co-stars Sally Field and Robin Wright were thought to be locks for supporting actress recognition, especially with the film dominating the box office and major precursor awards. Neither made the cut. Instead, Jennifer Tilly earned a surprise nod for “Bullets Over Broadway,” joining eventual winner Dianne Wiest — from a film that didn’t even receive a best picture nomination.\n\t\n\n\tThe supporting actor race that same year was similarly chaotic. Pundits predicted double nominees from “Pulp Fiction” — Samuel L. Jackson and possibly Indie Spirit nominee Eric Stoltz — or from “Quiz Show,” with John Turturro (a Golden Globe and SAG nominee) and Paul Scofield. Jackson landed his deserved nomination; Turturro was famously left out in favor of Scofield in what became an infamous “cast member switcharoo.”\n\n\tMore recently, many believed that both “The Banshees of Inisherin” and “The Fabelmans” would dominate the 2023 supporting actor race. Brendan Gleeson and Barry Keoghan ultimately made it in for “Banshees.” Paul Dano and Judd Hirsch, despite significant recognition, couldn’t both find room. Only one film went two for two — and it wasn’t “The Fabelmans.”\n\n\tIt’s a quirk of the Academy’s voting system. In supporting categories, passion matters more than consensus. A No. 1 vote on a nominator’s ballot carries significantly more weight than being everyone’s second or third choice. When votes split between co-stars — especially in a deep field like this year’s — it opens the door for a single breakout performer from another film to sweep in and claim a nomination (or even the win).\n\n\tSo where does that leave us today? And how do the campaigns keep their supporting ladies afloat?\n\n\tThere’s no surefire blueprint, and it’s not always tied to what wins best picture. \n\n\n\n\t\n\n\t\t\t\t\tCeleste Holm, left, Loretta Young and Elsa Lanchester in “Come to the Stable”\n\t\t\t\t\t\t\t\t\t©20thCentFox/Courtesy Everett Collection\n\t\n\n\n\n\tThere has been only one instance in Oscar history when two films each claimed two nominations in the same acting category: 1949’s “Come to the Stable” (Celeste Holm and Elsa Lanchester) and “Pinky” (Ethel Barrymore and Ethel Waters). All four lost to Mercedes McCambridge from best picture winner “All the King’s Men.”\n\n\tFun fact: Holm holds the record for being nominated alongside a co-star in three separate films — “Gentleman’s Agreement,” “Come to the Stable” and “All About Eve.” She’s followed by Anne Revere (“The Song of Bernadette,” “Gentleman’s Agreement”), Amy Adams (“Doubt,” “The Fighter”) and Teresa Wright (“The Little Foxes,” “Mrs. Miniver”) with two co-nominations apiece.\n\t\n\n\tAccording to Variety’s most recent predictions, “One Battle After Another” could attempt something audacious: placing two actors in two supporting categories. Benicio Del Toro and Sean Penn in supporting actor; Regina Hall and Teyana Taylor in supporting actress. If that happens, it’ll join extremely rare company.\n\n\tOnly four films in history have double-dipped in two acting categories:\n\n\n“All About Eve” (1950): Anne Baxter and Bette Davis in best actress; Celeste Holm and Thelma Ritter in supporting actress.\n“Peyton Place” (1957): Arthur Kennedy and Russ Tamblyn in supporting actor; Hope Lange and Diane Varsi in supporting actress.\n“The Last Picture Show” (1971): Jeff Bridges and winner Ben Johnson in supporting actor; Ellen Burstyn and winner Cloris Leachman in supporting actress.\n“Terms of Endearment” (1983): Winner Shirley MacLaine and Debra Winger in actress; John Lithgow and winner Jack Nicholson in supporting actor.\n\n\n\n\tWith “Sentimental Value,” you have two actors from a non-English language film — Fanning and Lilleaas (though Fanning primarily speaks English in the role). Representing Norway in the international feature race, the film could make history. No international feature film has ever landed two supporting actress nominations in the same year. Also notable: Only one supporting actor or actress from an international feature has ever won — Zoë Saldaña, just last year, in “Emilia Pérez.”\n\n\tThen there’s the buzzy late-season player, “Marty Supreme.” Oscar winner Paltrow seeks her second career nomination, 27 years after “Shakespeare in Love” (1998), and newcomer A’zion has emerged as one of the film’s most vibrant and memorable highlights. While no major precedent is at stake, it will be fascinating to see how this high-octane sports dramedy fares — especially with Timothée Chalamet now a frontrunner in best actor after the surprise NYFF screening and acclaim out of L.A..\n\n\tWe should mention the handful of dark horses with some semblance of multiple buzzy supporting actress turns in the mix such as “Sinners” (Hailee Steinfeld and Wunmi Mosaku), “Wake Up Dead Man” (Glenn Close and Kerry Washington), “Wicked: For Good” (Ariana Grande and Michelle Yeoh) and “Train Dreams” (Kerry Condon and Felicity Jones).\n\n\tOne last thing I noticed in this latest round of prediction updates: only nine films are currently represented across the four acting categories — which would be the lowest tally since 1968. The lowest of all time is eight films in 1981. The record for the most movies ever represented was in 2007 with a staggering 18 films (“Michael Clayton” was the only movie that scored more than one acting nom).\n\t\n\n\tSo, either some of our current predictions are way off (which is surely the case when assessing the race in October) — with under-the-radar contenders still waiting to emerge — or we’re headed for an unexpectedly “small” year, with some of the fewest individual films represented across the acting categories (and perhaps the artisans as well). That would track with current projections, which have four movies expected to crack double digits in total nominations on Oscar morning.\n\n\tThis week’s updated Oscar predictions are below.\n\n\n\n\t\n\n\t\t\t\t\t“Wicked: For Good” \n\t\t\t\t\t\t\t\t\t©Universal/Courtesy Everett Collection\n\t\n\n\n\n\t*** = PREDICTED WINNER(All predicted nominees below are in alphabetical order)\n\t\n\t\tOscars Predictions Tracking(Oct. 16, 2025)\t\n\n\tBest Picture“Avatar: Fire and Ash” (20th Century Studios)“Bugonia” (Focus Features)“Hamnet” (Focus Features) “A House of Dynamite” (Netflix)“Jay Kelly” (Netflix)“Marty Supreme” (A24)“One Battle After Another” (Warner Bros.) ***“Sentimental Value” (Neon)“Sinners” (Warner Bros.)“Wicked: For Good” (Universal Pictures)\n\n\tDirectorPaul Thomas Anderson, “One Battle After Another” (Warner Bros.) ***Ryan Coogler, “Sinners” (Warner Bros.)Josh Safdie, “Marty Supreme” (A24)Joachim Trier, “Sentimental Value” (Neon)Chloé Zhao, “Hamnet” (Focus Features)\n\n\tActorTimothée Chalamet, “Marty Supreme” (A24) ***Leonardo DiCaprio, “One Battle After Another” (Warner Bros.)Ethan Hawke, “Blue Moon” (Sony Pictures Classics)Michael B. Jordan, “Sinners” (Warner Bros.)Wagner Moura, “The Secret Agent” (Neon) \n\n\tActressJessie Buckley, “Hamnet” (Focus Features) ***Cynthia Erivo, “Wicked: For Good” (Universal Pictures)Chase Infiniti, “One Battle After Another” (Warner Bros.)Kate Hudson, “Song Sung Blue” (Focus Features)Renate Reinsve, “Sentimental Value” (Neon)\n\n\tSupporting ActorBenicio Del Toro, “One Battle After Another” (Warner Bros.)Paul Mescal, “Hamnet” (Focus Features)Sean Penn, “One Battle After Another” (Warner Bros.) ***Andrew Scott, “Blue Moon” (Sony Pictures Classics)Stellan Skarsgård, “Sentimental Value” (Neon) \n\n\tSupporting ActressElle Fanning, “Sentimental Value” (Neon)Ariana Grande, “Wicked: For Good” (Universal Pictures) Regina Hall, “One Battle After Another” (Warner Bros.)Gwyneth Paltrow, “Marty Supreme” (A24)Teyana Taylor, “One Battle After Another” (Warner Bros.)\n\n\tOriginal Screenplay“Is This Thing On?” (Searchlight Pictures) — Will Arnett, Mark Chappell, Bradley Cooper“Marty Supreme” (A24) — Ronald Bronstein and Josh Safdie“The Secret Agent” (Neon) — Kleber Mendonça Filho“Sentimental Value” (Neon) — Joachim Trier and Eskil Vogt ***“Sinners” (Warner Bros.) — Ryan Coogler\n\n\tAdapted Screenplay“Bugonia” (Focus Features) — Will Tracy“Hamnet” (Focus Features) — Chloé Zhao ***“One Battle After Another” (Warner Bros.) — Paul Thomas Anderson “Song Sung Blue” (Focus Features) — Craig Brewer“Train Dreams” (Netflix) — Clint Bentley and Greg Kwedar\n\t\n\n\tCasting“Hamnet” (Focus Features) — Nina Gold“A House of Dynamite” (Netflix) — Susanne Scheel“Marty Supreme” (A24) — Jennifer Venditti“One Battle After Another” (Warner Bros.) — Cassandra Kulukundis“Sinners” (Warner Bros.) — Francine Maisler ***\n\n\tAnimated Feature“Arco” (Neon)“In Your Dreams” (Netflix)“KPop Demon Hunters” (Netflix) ***“Little Amélie or the Character of Rain” (GKids)“Zootopia 2” (Walt Disney Pictures) \n\n\tProduction Design“Avatar: Fire and Ash” (20th Century Studios)“Frankenstein” (Netflix)“Marty Supreme” (A24)“Sinners” (Warner Bros.) “Wicked: For Good” (Universal Pictures) ***\n\n\tCinematography“Bugonia” (Focus Features)“Hamnet” (Focus Features)“One Battle After Another” (Warner Bros.)“Sinners” (Warner Bros.) ***“Train Dreams” (Netflix)\n\n\tCostume Design“Frankenstein” (Netflix)“Hamnet” (Focus Features)“Sinners” (Warner Bros.) “The Testament of Ann Lee” (Searchlight Pictures)“Wicked: For Good” (Universal Pictures) ***\n\n\tFilm Editing“Hamnet” (Focus Features)“A House of Dynamite” (Netflix) “Marty Supreme” (A24)“One Battle After Another” (Warner Bros.) ***“Sinners” (Warner Bros.)\n\n\tMakeup and Hairstyling“Bugonia” (Focus Features)“Frankenstein” (Netflix) “Sinners” (Warner Bros.)“The Smashing Machine” (A24) “Wicked: For Good” (Universal Pictures) ***\n\n\tSound“Avatar: Fire and Ash” (20th Century Studios)“F1” (Apple Original Films/Warner Bros.)“A House of Dynamite” (Netflix) ***“One Battle After Another” (Warner Bros.) “Wicked: For Good” (Universal Pictures)\n\n\tVisual Effects“Avatar: Fire and Ash” (20th Century Studios) ***“Frankenstein” (Netflix)“Mission: Impossible – The Final Reckoning” (Paramount Pictures)“Superman” (Warner Bros.)“Wicked: For Good” (Universal Pictures)\n\n\tOriginal Score“Hamnet” (Focus Features) — Max Richter“A House of Dynamite” (Netflix) — Volker Bertelmann“One Battle After Another” (Warner Bros.) — Jonny Greenwood“Sinners” (Warner Bros.) — Ludwig Göransson ***“Wicked: For Good” (Universal Pictures) — John Powell and Stephen Schwartz\n\t\n\n\tOriginal Song“Golden” from “KPop Demon Hunters” (Netflix) ***“I Lied to You” from “Sinners” (Warner Bros.)“Train Dreams” from “Train Dreams” (Netflix)“The Girl in the Bubble” from “Wicked: For Good” (Universal Pictures) “Zoo” from “Zootopia 2” (Walt Disney Pictures)\n\n\tDocumentary Feature“The Alabama Solution” (HBO Documentary Films)“Come See Me in the Good Light” (Apple Original Films) “The Perfect Neighbor” (Netflix) ***“The Tale of Silyan” (National Geographic)“2000 Meters to Andriivka” (PBS)\n\n\tInternational Feature“It Was Just an Accident” from France (Neon) “No Other Choice” from South Korea (Neon)“The Secret Agent” from Brazil (Neon)“Sentimental Value” from Norway (Neon) ***“The Voice of Hind Rajab” from Tunisia (U.S. Distributor TBD)\n\n\tTop 5 projected Oscar nomination leaders (films): “One Battle After Another” (14); “Sinners” (12); “Hamnet” and “Wicked: For Good” (10); “Marty Supreme” (8); “Sentimental Value” (7)\n\n\tTop 5 projected Oscar nomination leaders (studios): Warner Bros. (28); Netflix (17); Focus Features (16); Neon (13); Universal Pictures (10); A24 (9)\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "When Co-Stars Become Competitors: Inside Oscar’s Toughest Supporting Actress Race Ever",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/Supporting-Actress-Oscars.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-16T15:45:00.000Z",
      "dateModified": "2025-10-16T15:45:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Mipcom 2025: Sunny But Sobering, Galvanised by the Rise of YouTube and the Creator Economy as the TV Industry Shifts Focus Once More ",
    "url": "https://variety.com/2025/tv/global/youtube-creator-economy-banijay-fremantle-sony-mediawan-1236554534/",
    "image": "https://variety.com/wp-content/uploads/2025/08/Half-Man-1.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-16T15:18:06.000Z",
    "description": "\n\tCANNES, FRANCE — Mipcom 2025 played out in glorious sunshine, proving, however, in many ways a sobering affair. Since 2022-23 when Netflix first ann",
    "body": "\n\tCANNES, FRANCE — Mipcom 2025 played out in glorious sunshine, proving, however, in many ways a sobering affair. Since 2022-23 when Netflix first announced a subs decline and then Hollywood’s double strikes, the only certainty has been fear: That a sales-production sector’s chasing a contracted market is not a blip, but the new norm. With attendance just up on 2024’s event, the story of Mipcom 2025 is how the TV industry is reacting to this traction, especially by way of its exploration of possible partnership with YouTube and the creative economy revolution. These and other takeaways from this year’s Mipcom, which ran Oct. 13-17.\n\t\n\n\tThe Crunch\n\n\n\tThough attendance at Mipcom this year, edged up on 2024 – plays – the party looks well and truly over. “Almost 18 months after we first identified the trend, we are still at ’75% Peak TV,” Ampere Analysis’ Guy Bisson said Wednesday at Mipcom. In other words, the market has contracted to 75% of its Peak TV Size. Compared to the first half of 2024, first-run scripted TV orders were 6% up in North America but down in Central and South America (-7%), Western Europe (-10%), Asia Pacific (-11%) and Central and Eastern Europe (-15%). Some countries – Spain, France and Italy – have held in commissions. But they are exceptions. Much of the downturn is driven by streamer pull back down over 100% on early 2024, Bisson said. The new reality, moreover, is here to stay, he added.\n\n\tAnd the Good News? \n\n\tThe biggest draw at this edition of Mipcom was the presence of creator economy players. YouTube, which celebrates its 20-year anniversary, made its first official presence at the Cannes-set confab with a crowded session that brought together BBC Studios digital SVP Jasmine Dawson and YouTube’s EMEA boss Pedro Pina discussing their win-win partnership. It was one of the several examples of successful alliances between traditional media and the creator economy talked about at Mipcom — where Banijay unveiled the launch its YouTube-backed Entertainment Creators Lab in France, and announced its acquisition of the Dutch label Werktitel. A decade after hosting the Mip Digital Upfront, a one-off initiative, Mipcom also revisited the topic with a fully-fledged Digital Upfronts that welcomed on stage talents and executives from creator-led production companies, After Party Studios and Dhar Mann Studios, as well the AVOD platform Tubi. \n\t\n\n\tFinding a Business Model\n\n\tThe big question, of course is: What is the business model?Traditional broadcasters cannot hope to make up the slack from declining advertising and lower audiences in a digital sphere where Costs Per Mille (CPMs) are radically lower, said Ampere’s Bisson. The maths will never add up. Yet they can leverage YouTube and other low CPM players in other ways. Banijay is now doing exactly with animation series “Ava & Digger,” produced by Banijay Kids & Family and digital giant TheSoul Publishing, which has 3 billion – that’s a “b” followers. The series will launch on YouTube later this year, honing and building IP. With data in hand – reach, demos, gender splits –  the partners will then pitch streaming services.    \n\n\tMicrodramas Dazzle….\n\n\tWhat is the most watched form of TV in Colombia,– linear TV, powered by telenovelas, or global streaming services, led by Netflix? Neither, Spanish analyst Geca announced at Iberseries & Platino Industria two weeks ago. In viewing figures, both have been overtaken by microdramas. Hailed by Virginia Mouseler as one of the most watched TV shows of recent times, what title opened The Wit’s Fresh TV Fiction at Cannes on Oct. 15? ReelShorts’ 90-part, 90-second U.S. romantic melodrama “Breaking the Ice,” a vertical made for iPhone which notched up 340 million views in the U.S.\n\n\t….And Are a Growth Phenom in International\n\n\tExplosively growing, microdramas will reach $11 billion in global revenues by 2025: double the size of FAST channels, María Rua Aguete, at Omdia, announced Monday. Microdramas “combine the immediacy of social media with the emotional depth of television drama. They are short, snackable, and utterly addictive.” So lucrative: Available on subscription/ transactional bases, average user revenue can reach $80 per month. “This is not just a trend – it’s the next wave of content evolution,” Rua Aguete affirmed. Also, they’re taking off most everywhere. At Mipcom, Lebanon’s Scene and Arab World giant Rotana Media announced they would co-produce microdramas, introduced for the first time in the Arab world, they said. Both partners looked very chuffed.\n\n\tBuzz Titles\n\n\tOne, leading the pack, is Richard Gadd’s “Half Man.” The latest from the creator of “Baby Reindeer,” a Netflix smash hit, looks like one of the most talked-about series at this year’s confab. Banijay has now sold it to Canadian (Crave) and Australian (Stan) pay TV networks. As Mipcom unspooled, English-language “Hotel Costiera, starring Jesse Williams and located at a luxury hotel on Italy’s dazzling Positano coast,” hit No. 1 on Prime Video U.S. amid fulsome sales. “The appetite for this kind of bold, sky-blue drama is clear,” Fremantle’s Jens Richter told Variety. Globo’s “Perfect Days” made both Variety’s Must-See TV and The Wit’s Fresh TV Fiction. Sally Wainright’s “Riot Women,”sold by Mediawan Rights, proved one of the most popular titles in the The Wit’s showcase. \n\t\n\n\t‘Out of the Box’ Toy Brand Films and Series\n\n\tToy brands like Hasbro, Lego and Mattel continue to develop their IP in the audiovisual space, but the movies and shows still need to stand on their own feet. Robbie Brenner, president of Mattel Studios and chief content officer, spoke about her plans for film and TV versions of IP like Masters of the Universe and Matchbox. The intention was “to find ways to tell those stories that feel authentic, and that they have integrity, and actually celebrate brands but to do it in a way that feels interesting and out of the box and unexpected,” she said.\n\n\tOne Mantra: Flexibility in Rights Dealing\n\n\tExclusivity is less of a priority when it comes to rights, and there’s a greater willingness to collaborate. “We want to find the audience wherever we can,” Ben Samek, CEO of Banijay Americas. “The more flexibility there is in the market, the more value there’ll be for lots of players.” Kate Phillips, BBC’s chief content officer, underscored the value of partners, such as Amazon on “The Night Manager.” “They can just increase the ambition and increase the impact. In a crowded global market, trying to get drama that breaks through is getting harder and harder so the more partnerships we have, the better.”\n\n\tWhat Territories Are Popping?\n\n\tBrazil. Or, rather, at least TV giant Globo. On the eve of Mipcom, at a Carlton Hotel Showcase, Globo walked an industry audience through its latest production deals with the BBC (an Amazon two-part doc), Fox (an Xmas feature) and Ron Leshem’s Crossing Oceans and Janeiro Studios (a Rio de Janeiro new X-Gen focused series). Drilled down on by Globoplay’s Alex Medeiros at Cannes, Globo now has deals with Disney (four movies), Turkey’s Ay Yapim (Turkish remakes of Globo novelas, such as “Leyla,” sold to 20+ territories), Gaumont (“Deluxe”), Beta Film, Fremantle (“Crime Inc.) and Telemundo (a first title TBA). Globo is entering the global mainstream.         \n\n\tAnd, Yes, Flanders \n\n\tThe northern part of Belgium, speaking a form of Dutch. Malin-Malin-Sarah Gozin’s hilarious, melancholic and eco-conscious “Dead End,” where a sleuth has to nibble a part of corpse to get a really good idea as to how it died, was reckoned by many as the most notable drama at April’s Canneseries. At The Wit’s Fresh TV Fiction, Flanders had five shows selected: Fun crime series “The Big Fuck Up,” sisters’ reckoning road movie “How To Kill Your Sister,” interior design world-set drama “Eyecatchers,” daily drama “Florentina” and microdrama “Red Flag.” That’s a large presence at Fresh TV Fiction than any other territory in the world, including Europe’s streaming leaders,  U.K. and Spain, which both had four a piece.  \n\t\n\n\tThe Deals\n\n\tA score and more of the biggest: \n\n\t*The biggest deal announced during Mipcom: Warner Bros. Discovery and CJ ENM have formed a strategic partnership. WBD wants CJ’s possibly enormous viewing numbers; CJ wants WBD’s reach. \n\n\t*Sony Pictures Television sold to Sky “The Miniature Wife,” s relationship comedy-drama starring Elizabeth Banks,  Matthew Macfadyen, Mipcom’s exclusive opening night preview screening. SPT also added “Trainer Games” to its Mipcom slate.\n\n\t*Mia Wasikowska is set to direct legal drama “The Great White” for “Slow Horses” producer See-Saw Films, owned by Mediawan which, in further news,\n\n\t*Banijay Entertainment has picked up “Werewolves,” the buzzed-about strategic reality format that’s based on a cult board game, for multiple territories, from Studiocanal and Dreamspark. \n\n\t*Banijay landed sales for a modernised “Maigret” in Australia (ABC) and Japan (Wowow) among major territories.\n\n\t*Fremantle confirmed it had acquired worldwide distribution rights to feature documentary “Luca: Seeing Red” about the flamboyant life of businessman and former chairperson of Ferrari Luca Cordero di Montezemolo. At Mipcom, Montezemolo chatted to Variety.\n\n\t*Globo signed landmark co-production deals with the BBC (an Amazon doc), Fox (an English-language Xmas feature) and Janeiro Studios and Crossing Oceans for a new show from Ron Leshem, creator of the original Euphoria, made in Portuguese and set in Rio de Janeiro, and depicting the new Gen Z.  \n\n\t*In a behemoth alliance, Banijay Kids & Family, part of Banijay Entertainment, and social media giant TheSoul Publishing  unveiled Banijay Kids & Family’s first self-funded digital-first original series “Ava & Digger.”\n\n\t*BAFTA nominee John Hannah (“The Last of Us,”) is set to lead “Death in Benidorm,” a new detective drama series launching on the Paramount Skydance-owned U.K. network Channel 5 and Germany’s ZDF Studios.\n\n\t*Beta Film added marital caper “A Lovely Mess – Rob the Rich” and then two William Levy vehicles, “Under a Volcano” and “Road to Arcadia,” with Spain’s Secuoya Studios and Mexico’s ViX, plus a franchise refreshening “Rex – Vienna Calling,” about Europe’s sharpest-witted canine law enforcer. \n\t\n\n\t*Conan O’Brien’s Emmy-Winning TBS late-night chat show series has landed at Radial Entertainment, for U.S. distribution. \n\n\t*Warner Bros. Discovery has picked up medical reality series “Dr. Pimple Popper: Breaking Out” and “The 6000lb Diaries” for its European linear networks. \n\n\t*Studiocanal brought to the market ‘Spinners 2,” the second season of the South African-set extreme motor sports thriller and coming-of-age tale, from Canal+ and Showmax. \n\n\t*Mediawan Rights has boarded Icelandic crime series “Elma,” produced by Glassriver with Belgium’s Lunanime.\n\n\t*ITV Studios has acquired production rights to “Solitary,” the controversial reality game show created by Lincoln Hiatt and Andrew Golder that was No. 1 on Fox Reality Channel, while inking a major overall deal with seasoned reality TV creators Karsten Bartholin and Kenneth Kristensen\n\n\t*“La Favorita 1922,” from Spain’s Mediterráneo and Bambú Producciones sold to HBO Max Latin America, reaches 70 territories licensed worldwide \n\n\t*In further unveils, Fremantle launched Greek myth inspired entertainment format “Pandora’s Box” at Mipcom.\n\n\t*Australian actress Abbie Cornish (“Limitless”) and Scottish actor Dougray Scott (“Enigma” )are set to star in Southern African action thriller series “The Invisible,” for M-Net, ITV Studios, Scene23 and Berkeley Media Group.\n\n\t*Atresmedia Sales has struck an AXN Japan deal for crime series “Una Vida Menos en Canarias,” as high-rating daily drama “Sueños de Libertad” bows on HBO Max cars Latin America and Angela hit Netflix’s global Top 10 of most watched non-English language shows. \n\n\t*Wedotv and ZDF Studios are launching a “Legacy” FAST Channel, offering ease of access to the opulent South African smash hit series.\n\n\t*Titan OS and Tubi announced a ‘milestone’ partnership to ‘unlock exclusive AVOD advertising opportunities’ in the U.K.\n\n\t*Cineflix has closed multiple new deals on BBC One primetime crime thriller “Virdee,” with SVT (Sweden), Filmin (Spain), Britbox for its platforms across Norway, Finland and Denmark, and BBC Studios for Asia. Later in the Mipcom market, it revealed further international licensing accords on “Vanished History,” “Commando Missions” and “Cape Carnage: Killer Catch.” \n\t\n\n\t*L.A. and Stockholm-based Dynamic Television has picked up global distribution rights to premium Swedish drama thriller “Till Death Do Us Part” from writer Veronica Zacco (“Top Dog,” “Quicksand”) and director Julia Lindström (“Young Royals”).\n\n\t*Banijay Mexico & U.S. Hispanic, part of Banijay Americas, is gearing up for the 2026 FIFA World Cup with a new travel docu series, “Tres hinchapelotas,” led by three Latino household names – Jaime Camil (“Jane the Virgin”), Marcelo Tinelli (“Videomatch”) and Jorge Enrique Abello (“Ugly Betty“).\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Mipcom 2025: Sunny But Sobering, Galvanised by the Rise of YouTube and the Creator Economy as the TV Industry Shifts Focus Once More ",
      "image": [
        "https://variety.com/wp-content/uploads/2025/08/Half-Man-1.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-16T15:18:06.000Z",
      "dateModified": "2025-10-16T15:18:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Keanu Reeves’ Manager Told Him to Change His Name at 20 Years Old. They Considered ‘Chuck Spadina’ Before Using ‘KC Reeves’: ‘And Then I Couldn’t Do It’",
    "url": "https://variety.com/2025/film/news/keanu-reeves-change-name-chuck-spadina-1236554526/",
    "image": "https://variety.com/wp-content/uploads/2025/10/P102KIRG.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-16T15:33:52.000Z",
    "description": "\n\tKeanu Reeves revealed on the “New Heights” podcast that his manager was adamant about changing the actor’s name when he first arrived in Hollywood a",
    "body": "\n\tKeanu Reeves revealed on the “New Heights” podcast that his manager was adamant about changing the actor’s name when he first arrived in Hollywood as a teenager. \n\n\t“I got paid when I was like 16, so I was a professional actor around 16, 17 [years old],” Reeves said. “I was in Toronto, Canada, and then I got a manager who lived in Los Angeles…. At 20 years old, I drove in my car to Los Angeles. Got out of my car and my manager said, ‘We want to change your name.’ So that’s like, a welcome to Hollywood [moment]. I remember I was walking on the beach and I was just like, ‘My name? What if I change my name? What?’”\n\t\n\n\tHis manager’s request sent Reeves into an existential spiral. Then Reeves started brainstorming what he could possibly change his name to if he wanted to be a Hollywood performer.\n\n\n\t“My middle name is Charles, so I was like, ‘…Chuck?’ And I grew up on a street called Spadina, [therefore] Chuck Spadina,” Reeves said. “And then I was something Templeton. So then I became KC Reeves. I was credited as KC Reeves…  And then I couldn’t do it. So then I would be in auditions and they would go, ‘KC Reeves.’ And I wouldn’t even answer. Six months later, I was like, ‘I’m not doing this.’ That’s a Hollywood moment.”\n\n\tReeves actually was credited as “KC Reeves” in one of his first films, a made-for-TV movie in 1986 for the Magical World of Disney. The actor told Jimmy Fallon in 2017 (via EW) that the “Templeton” name that was considered for him was “Templeton Paige Taylor.” Fortunately by the time Reeves started landing more high profile work in projects like “Dangerous Liaisons” and “Bill & Ted’s Excellent Adventure,” he was being credited by his real name “Keanu Reeves.”\n\t\n\n\tReeves is back on the promotional trail for his new comedy, “Good Fortune.” Directed by Aziz Ansari and co-starring Seth Rogen and Keke Palmer, the movie casts Reeves as a guardian angel who loses his wings while trying to teach a human that money doesn’t solve one’s problems. The comedy opens in theaters Oct. 17 from Lionsgate.\n\n\tName changes are a common practice in Hollywood. Leonardo DiCaprio revealed in his own “New Heights” interview last month that an ex-agent told him to ditch “DiCaprio” as a young actor because it sounded “too ethnic.”\n\n\t“I finally got an agent. They said, ‘Your name is too ethnic,’” DiCaprio recalled. “I go, ‘What do you mean? It’s Leonardo DiCaprio?’ They go, ‘No, too ethnic. They’re never going to hire you. Your new name is Lenny Williams.’ I said, ‘What is Lenny?’ I was 12, 13. I said, ‘What is Lenny Williams? We took your middle name and we made it. Now you’re Lenny.’”\n\n\tWatch Reeves’ full interview on the “New Heights” podcast in the video below.\n\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Keanu Reeves’ Manager Told Him to Change His Name at 20 Years Old. They Considered ‘Chuck Spadina’ Before Using ‘KC Reeves’: ‘And Then I Couldn’t Do It’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/P102KIRG.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-16T15:33:52.000Z",
      "dateModified": "2025-10-16T15:33:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Amanda Buckman In 'Addams Family Values' 'Memba Her?!",
    "url": "https://www.tmz.com/2025/10/16/amanda-buckman-in-addams-family-values-memba-her/",
    "image": "https://imagez.tmz.com/image/3f/16by9/2025/10/14/3fba4e3a22b94be1a2041e67e8430245_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-16T07:10:00.000Z",
    "description": "\n    \n      \n        \n        \n          Launch Gallery\n        \n                  Paramount Pictures\n              \n    \n    \n          Canadian actr",
    "body": "\n    \n      \n        \n        \n          Launch Gallery\n        \n                  Paramount Pictures\n              \n    \n    \n          Canadian actress Mercedes McNab was only 13 years old when she played Amanda Buckman -- the privileged pilgrim camper -- opposite Christina Ricci as Wednesday Addams -- in the funny 1993 family film \"Addams Family Values.\"\n      \n    \n          Guess what she looks like now in her mid-40s!\n      \n      ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Amanda Buckman In 'Addams Family Values' 'Memba Her?!",
      "image": [
        "https://imagez.tmz.com/image/3f/16by9/2025/10/14/3fba4e3a22b94be1a2041e67e8430245_xl.jpg"
      ],
      "datePublished": "2025-10-16T07:10:00.000Z",
      "dateModified": "2025-10-16T07:10:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Italian Model Stabbed 24 Times, Ex-Boyfriend Arrested in Apartment",
    "url": "https://www.tmz.com/2025/10/16/italian-model-dead-on-balcony/",
    "image": "https://imagez.tmz.com/image/ae/16by9/2025/10/16/aea4c4a7a60b413dbb112a6136881036_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-16T15:30:47.000Z",
    "description": "\n    \n                    \n                          Italian Model\n                          Stabbed to Death on Balcony …\n                          E",
    "body": "\n    \n                    \n                          Italian Model\n                          Stabbed to Death on Balcony …\n                          Ex-BF Arrested at Scene\n                      \n                  \n                        Published October 16, 2025 8:30 AM PDT\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          An Italian model was found dead on her balcony in Milan after her ex allegedly stabbed her more than 20 times ... according to local reports.\n      \n    \n          Pamela Genini was killed Tuesday, local newspaper il Fatto Quotidiano reports ... though neighbors apparently tried to break into the apartment when they heard screaming from inside to help Genini.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          The outlet reports Genini was stabbed 24 times in the neck, back, upper limbs, and hands ... and, when police arrived, they allegedly found 52-year-old Gianluca Soncin standing over her.\n      \n\n          Soncin then allegedly stabbed himself twice in the neck as officers tried to subdue him ... but he survived and is recovering in a local hospital. He's reportedly exercised his right to remain silent.\n      \n    \n          Genini was reportedly on the phone with another ex-boyfriend when she walked into her apartment and allegedly found Soncin there ... which is why police rushed over to her apartment so quickly. Prosecutors are accusing Soncin of obtaining a \"copy of the house keys\" in order to gain access to the apartment.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Pamela was born in Bergamo ... and, she and Soncin reportedly dated for a few months -- though the two were in a \"period of crisis,\" according to the newspaper.\n      \n    \n          Prosecutors are reportedly alleging aggravating circumstances of premeditation and stalking in legal documents asking for Soncin to be remanded into custody.\n      \n    \n          Genini was 29.\n      \n    \n          RIP\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                RIP\n              \n                          \n                Crime\n              \n                          \n                Models\n              \n                          \n                Fairly Legal\n              \n                          \n                News\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Italian Model Stabbed 24 Times, Ex-Boyfriend Arrested in Apartment",
      "image": [
        "https://imagez.tmz.com/image/ae/16by9/2025/10/16/aea4c4a7a60b413dbb112a6136881036_xl.jpg"
      ],
      "datePublished": "2025-10-16T15:30:47.000Z",
      "dateModified": "2025-10-16T15:30:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Shirtless Priest Reportedly Caught Hiding Parishioner's Fiancée in His Bathroom",
    "url": "https://www.tmz.com/2025/10/16/priest-caught-hiding-parishioner-fiancee-brazil/",
    "image": "https://imagez.tmz.com/image/df/16by9/2025/10/16/df7a173e9d9d4ebc9885e4371849b2a2_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-16T13:17:13.000Z",
    "description": "\n    \n                    \n                          Naughty Brazilian Priest\n                          Caught Hiding Parishioner's Fiancée?!?\n       ",
    "body": "\n    \n                    \n                          Naughty Brazilian Priest\n                          Caught Hiding Parishioner's Fiancée?!?\n                      \n                  \n                        Published October 16, 2025 6:17 AM PDT\n                                                                      |\n                Updated October 16, 2025 7:21 AM PDT\n                                    \n      \n    \n        \n                    \n                  \n      \n    \n          Talk about unholy -- a Brazilian priest was reportedly caught hiding the fiancée of one of his parishioners in his home!\n      \n    \n          Check out the video ... shirtless priest Rev. Luciano Braga Simplicio was confronted by some PO'd men at the parish house of Our Lady of Aparecida Parish earlier this week.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          One of the angry men busted down a bathroom door to find the woman balled up and hiding under the priest's sink. Someone dragged her out ... and she lay there, seemingly too stunned to speak.\n      \n\n                  \n          \n                          \n                \n                                  \n      \n    \n          Simplicio reportedly snuck her in early that morning when the woman's husband-to-be was out of town last week, per the blog Pelo Bem de São José.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          But that's not what the priest says happened -- he reportedly tried claiming he offered up the bathroom for the woman to shower after work out of the kindness of his heart.\n      \n    \n          It's unclear how long the woman was at the home ... but it appears it was longer than she'd need to freshen up!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Religion/ Spirituality\n              \n                          \n                Viral\n              \n                          \n                Fairly Legal\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Shirtless Priest Reportedly Caught Hiding Parishioner's Fiancée in His Bathroom",
      "image": [
        "https://imagez.tmz.com/image/df/16by9/2025/10/16/df7a173e9d9d4ebc9885e4371849b2a2_xl.jpg"
      ],
      "datePublished": "2025-10-16T13:17:13.000Z",
      "dateModified": "2025-10-16T13:17:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Simone Biles Confirms Boob Job In Return To Tumbling",
    "url": "https://www.tmz.com/2025/10/16/simone-biles-boob-job/",
    "image": "https://imagez.tmz.com/image/6c/16by9/2025/10/16/6c7d4e9b6d7a46da9c01340ca5730b21_xl.png",
    "tag": "Entertainment",
    "date": "2025-10-16T14:09:48.000Z",
    "description": "\n    \n                    \n                          Simone Biles\n                          Flippin' Out Over New Boobs\n                      \n       ",
    "body": "\n    \n                    \n                          Simone Biles\n                          Flippin' Out Over New Boobs\n                      \n                  \n                        Published October 16, 2025 7:09 AM PDT\n                                                                      |\n                Updated October 16, 2025 8:58 AM PDT\n                                    \n      \n    \n        \n                    \n                  \n      \n    \n          Simone Biles is putting all the rumors to rest -- confirming she did, in fact, get a boob job recently ... and she's quite literally head over heels because of it!!\n      \n    \n          The Team USA gymnastics hero revealed the procedure on Wednesday ... alongside a video of her doing a flip in her backyard.\n      \n    \n          Biles said the stunt was monumental on several levels -- she hadn't tumbled in a year, she was breaking in the trampoline at her new house ... and it was her first flip with the new boobs (well, she used a cherry emoji ... which is often used for breasts).\n      \n\n          The GOAT sparked rumors when she put her beach body on display while on vacation with her husband, Chicago Bears player Jonathan Owens ... but this is her first time coming out and stating the obvious.\n      \n    \n      \n        \n              \n    \n    \n          As for her future, Biles has yet to officially throw her hat in the ring for competing at the 2028 Olympics in Los Angeles ... but she said she'll be there regardless.\n      \n    \n          In the meantime, she's been Owens and the Bears' biggest fan ... even freaking out when Chicago completed its comeback against the Washington Commanders on \"Monday Night Football.\"\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Seems like things are going well for Biles across the board!!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Simone Biles\n              \n                          \n                Jonathan Owens\n              \n                          \n                Olympics\n              \n                          \n                Plastic Surgery\n              \n                          \n                TMZ Sports\n              \n                          \n                Fairly Legal\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Simone Biles Confirms Boob Job In Return To Tumbling",
      "image": [
        "https://imagez.tmz.com/image/6c/16by9/2025/10/16/6c7d4e9b6d7a46da9c01340ca5730b21_xl.png"
      ],
      "datePublished": "2025-10-16T14:09:48.000Z",
      "dateModified": "2025-10-16T14:09:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Surfer Jamie Mitchell Suffers Gruesome Cuts in Freak Wipeout",
    "url": "https://www.tmz.com/2025/10/16/surfer-jamie-mitchell-injuries-cuts-accident-video-photos/",
    "image": "https://imagez.tmz.com/image/c8/16by9/2025/10/16/c83adf12fe984f369cb1a8670dcd5305_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-16T15:44:14.000Z",
    "description": "\n    \n                    \n                          Surfer Jamie Mitchell\n                          Injured In Freak Accident\n                       ",
    "body": "\n    \n                    \n                          Surfer Jamie Mitchell\n                          Injured In Freak Accident\n                          Cuts To Face, Throat, Head\n                      \n                  \n                        Published October 16, 2025 8:44 AM PDT\n                                                                            \n      \n    \n      \n        \n                    \n                  \n      \n                    Instagram/@jamie_mitcho\n          \n    \n          Surfer Jamie Mitchell -- widely regarded as one of the best all-around athletes in the sport -- had a freak accident riding waves in Hawaii this week ... suffering brutal gashes to his face, throat and head.\n      \n    \n          Mitchell, 48, described what happened in an Instagram video ... stating he was hit by the fins of his big-wave board while surfing one of his favorite waves on Tuesday.\n      \n    \n          The Australian surfer shared evidence of his bloody injuries before he got bandaged up ... and they're pretty gnarly. You can take a look at the rest of 'em on your own terms.\n      \n\n          \"I got pretty, pretty banged up,\" Mitchell said.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          \"Something like 18 staples in the back of my head. Got 15 stitches down in my throat, five in my cheekbone, and another couple somewhere here, but I'm going to be okay.\"\n      \n    \n          Mitchell -- a 10-time Molokai 2 Oahu Paddleboard World Champion -- thanked bystanders who helped him get to shore ... as well as the Kahuku Emergency crew for the medical care.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Mitchell posted an update video on Thursday ... telling his fans he's healing up and there are no signs of infection.\n      \n    \n          \"I'm very lucky.\"\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                TMZ Sports\n              \n                          \n                Nurse!\n              \n                          \n                Fairly Legal\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Surfer Jamie Mitchell Suffers Gruesome Cuts in Freak Wipeout",
      "image": [
        "https://imagez.tmz.com/image/c8/16by9/2025/10/16/c83adf12fe984f369cb1a8670dcd5305_xl.jpg"
      ],
      "datePublished": "2025-10-16T15:44:14.000Z",
      "dateModified": "2025-10-16T15:44:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]