[
  {
    "title": "GDC Festival of Gaming Returns to San Francisco in 2026 (Gaming News Roundup)",
    "url": "https://variety.com/2025/gaming/news/gdc-festival-gaming-returns-san-francisco-1236559207/",
    "image": "https://variety.com/wp-content/uploads/2025/10/54393390262_93f50830db_o.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-23T20:09:37.000Z",
    "description": "\n\tGDC Festival of Gaming welcomes the global B2B gaming industry back to San Francisco from March 9 to March 13, 2026.\n\n\tThe event will bring together",
    "body": "\n\tGDC Festival of Gaming welcomes the global B2B gaming industry back to San Francisco from March 9 to March 13, 2026.\n\n\tThe event will bring together game makers, publishers, investors, founders, technologists, toolmakers, marketers, educators and press for a full week of learning, networking and activities. Built on the legacy of the original Game Developers Conference, the debut of GDC Festival of Gaming coincides with the event’s 40th edition.\n\t\n\n\t“In a time of great change, we can build walls or build bridges and the game industry has always thrived by coming together,” Mark DeLoura, GDC’s Executive Director of Innovation and Growth, said in a statement. “The GDC Festival of Gaming strengthens those connections, celebrating creativity and supporting everyone who brings games to life, from napkin sketch to global launch.”\n\n\n\tThe five-day festival will also feature nightly activities and offerings for everyone from all aspects of the industry. \n\n\tSpeed networking events, workshops, content programming, individual sessions with executives and innovators, speaker series, social mixers, concerts, gaming award ceremonies and more will be included in the week long festival.\n\n\tRegistration is currently open at gdconf.com.\n\t\n\t\tGAME CANCELLATIONS/STUDIO CLOSURES\t\n\n\tElectronic Arts will shut down “The Sims Mobile” next January, seven years and more than 50 updates after the game launched.\n\n\t“First, we want to say thank you,” the “Sims Mobile” team said in a blog posted to the EA website Sunday. “The Sims Mobile and The Sims community as a whole are full of creativity, kindness, and imagination. You’ve amazed us with your stories, builds, and Sims. We’re proud to have shared this journey with you, and as a token of our appreciation, we’ve prepared a few surprises as we head into TSM’s final chapter.”\n\t\n\n\tBefore the game is sunset on Jan. 20, EA is rolling out one final update for “The Sims Mobile” in the coming months. The first part of the update launched Monday. However, “The Sims Mobile” was delisted from the Apple App Store and Google Play Store on Tuesday, so it is no longer available for new downloads, only for users who already have “The Sims Mobile” installed or have previously downloaded it.\n\n\t“The Sims Mobile” shutdown comes on the heels of EA announcing it will be going from a publicly traded company to a privately held. The buyout deal, valued at $55 billion, is with several investors, including private-equity firms Silver Lake, Saudi Arabia’s Public Investment Fund and Jared Kushner’s Affinity Partners. \n\n\t“The Sims” franchise as a whole is still alive and well at EA, with a new update for “The Sims 4” released in September and ongoing plans for a new “Sims” game that will explore online multiplayer features.\n\n\tSee more gaming news from this week in the roundup below.\n\t\n\t\tNEW RELEASES\t\n\n\t“Jurassic World Evolution 3” launched Tuesday from Frontier Developments in collaboration with Universal Products & Experiences across PC, PlayStation 5 and Xbox Series X and S. \n\n\tPer the official description for the title, “players can delve into a game franchise first that brings adorable juvenile dinosaurs and a comprehensive breeding system, take on an epic global campaign that spans multiple stunning locations around the world, and shape their parks like never before with powerful creative tools.”\n\n\n\n\n\t*\n\n\tThe Sandbox has unveiled “San Junipero,” a new simulated experience based off of Netflix’s “Black Mirror” episode of the same name. The experience will be released on Oct. 22 to play on PC and Mac. \n\n\tPlayers will immerse themselves through a first-person, interactive journey where unforgettable locations, mind-bending themes of simulated reality and emotional twists await. Players will also be given the opportunity to meet key characters Kelly and Yorkie, interact with them across timelines and decide whether they are ready to become a permanent resident of the digital afterlife.\n\t\n\t\tEVENTS\t\n\n\tiam8bit will celebrate its 20th anniversary with an art exhibit open to the public on Saturday, Nov. 8, and Sunday, Nov. 9, located at Studio 8, 614 E 12th St. in Los Angeles.\n\t\n\n\tPer the gaming and media company, “In the last two decades, iam8bit has become a tastemaker at the intersection of games, art, and music, marking three original games published, 300+ albums and millions of records pressed. To commemorate this milestone, iam8bit is reopening the doors to its artistic roots with a gallery exhibition that celebrates both its origin story and its ongoing influence on the art and games landscape.”\n\t\n\t\tPARTNERSHIPS\t\n\n\tSports Interactive has teamed with National Women’s Soccer League (NWSL) and NWSL Players’ Association (NWSLPA) to incorporate the leagues into “Football Manager 26.” “FM26” is set to launch on Nov. 4. \n\n\t“We are delighted to have the NWSL and NWSLPA onboard as headline licensing partners for the debut of Women’s Football in FM26,” said Miles Jacobson, Studio Director at Sports Interactive. “Throughout our multi-year project to introduce Women’s Football, we’ve maintained that we want to do it properly. This meant having the biggest world licences on board and the NWSL alongside the athletes who bring it to life is undoubtedly one of them. “I can’t wait to see the stories our fans write as they get to test their skills in the NWSL for the first time.”\n\n\tKatie Eaton, Vice President of Consumer Products at National Women’s Soccer League, added: “Partnering with Football Manager 26 is an exciting moment for the NWSL and our fans. Bringing our clubs and players into FM is the latest innovative way that our league is meeting soccer fans where they are and bringing the NWSL to new audiences.”\n\n\t“FM” fans will have the chance to take charge of elite teams, uncover new talent and compete at the highest level. This deal will include with official player photos, clubs logos and kits. \n\t\n\t\tEXECUTIVE SHUFFLES\t\n\n\tTero Virtala has stepped down as CEO of game development company Remedy. He served in the role since 2016 and will continue to work for the company for an “agreed upon transition period,” per Remedy, as they search for a new leader.\n\n\tIn the meantime, Remedy co-founder and chief product officer Markus Mäki will serve as interim CEO.\n\n\tThese changes are effective immediately as of Oct. 22. \n\n\t*\n\n\tKatelynn Heil joins Voldex in the newly created position as the head of franchise management, reporting to CEO and founder Alex Singer.\n\t\n\n\tHeil will focus on building and scaling the Brookhaven IP in entertainment, live experiences, brand collaborations and consumer products. She will spearhead Voldex’s franchise development strategy by collaborating with the Brookhaven game team to develop ownable elements, drive narrative and video content strategies and establish a global licensing program.\n\n\tAdditionally, Heil will shape Voldex’s broader franchise development roadmap by identifying and cultivating future franchise opportunities across the company’s portfolio. \n\n\tBefore joining Voldex, Heil previously served as head of brand marketing and franchise strategy at Moonbug Entertainment.\n\t\n\t\tTRAILERS\t\n\n\tSEGA has unveiled the teaser trailer for the multiplayer arcade royale game “Sonic Rumble,” launching globally on Nov. 5. \n\n\tIn “Sonic Rumble,” up to 32 players compete against each other in a mix of high-octane obstacle races, survival challenges, cooperative team battles and ring-collecting showdowns inside Dr. Eggman’s Egg Toy Land. Additionally, players can select fan-favorite characters, customizable cosmetics and strategic skill options.\n\n\t“Sonic Rumble” will become available on iOS, Android, and Google Play Games on PC and Steam.\n\n\tCheck out the teaser trailer for “Sonic Rumble” below.\n\n\n\n\n\t*\n\t\n\t\tNEW PLATFORM RELEASES\t\n\n\t“Assassin’s Creed Shadows” will launch on Nintendo Switch 2 on Dec. 2 and will include all content updates introduced since the game’s release.\n\n\tThe Nintendo Switch 2 version will allow players to enjoy the game from any location and also features touch screen support. Its expansion pack, “Claws of Awaji,” is set to arrive next year. \n\n\tIn the game, players embark on a journey through Japan, taking on the dual roles of Naoe, a stealthy shinobi Assassin, and Yasuke, a powerful samurai warrior. They can switch between the two as they master their complementary playstyles, uncover their shared destiny and usher in a new era for Japan.\n\n\tThe Standard Edition of the game can be purchased for $59.99 on launch day either in a physical edition with a Nintendo Switch 2 game-key card or downloaded from the Nintendo eShop. The Premium Edition, which is digital only, is $99.99.\n\t\n\n\tThe Nintendo Switch 2 version of “Assassin’s Creed Shadows” will support cross-progression across all platforms through Ubisoft Connect, ensuring players can continue their journey across platforms.\n\n\t“Assassin’s Creed Shadows” is currently available on Ubisoft+, Xbox Series X|S, PlayStation®5, PlayStation 5 Pro, Amazon Luna, Macs with Apple silicon via the Mac App Store, as well as Windows PC through the Ubisoft Store, Steam and the Epic Games Store.\n\t\n\t\tTECH\t\n\n\tStarting on Oct. 23, a new reimagined and redesigned Amazon Luna is live. Luna will bring more than 50 games to Prime members at no additional cost and will include GameNight and a collection of more than 25 local multiplayer games. \n\n\t“We know that 95% of Prime households include someone who loves games, but there’s not always a straightforward path for many of them to play,” said Jeff Gattis, general manager of Amazon Luna in a statement. “Luna is purpose-built to remove the historical barriers to gaming. There’s no need to purchase costly, dedicated PC or console hardware. No downloads or installations required. And best of all, access is included within the same Prime membership enjoyed by more than 200 million paid members today.”\n\n\tIncluded with Prime are game titles such as “Hogwarts Legacy,” “Indiana Jones and the Great Circle,” and “TopSpin 2K25,” alongside a catalog of recent-release blockbusters, classics, indie games, and more. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "GDC Festival of Gaming Returns to San Francisco in 2026 (Gaming News Roundup)",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/54393390262_93f50830db_o.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-23T20:09:37.000Z",
      "dateModified": "2025-10-23T20:09:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Outer Banks’ Co-Creator Jonas Pate Accused of Grabbing, Shaking and Yelling at Female Production Assistant; Stars Chase Stokes and Madelyn Cline Intervened",
    "url": "https://variety.com/2025/tv/news/outer-banks-director-jonas-pate-grabbed-shook-female-pa-1236558902/",
    "image": "https://variety.com/wp-content/uploads/2025/10/GettyImages-2231568535.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-23T19:43:50.000Z",
    "description": "\n\t“Outer Banks” co-creator and director Jonas Pate has been accused of putting his hands on a young woman who works on the Netflix series as a product",
    "body": "\n\t“Outer Banks” co-creator and director Jonas Pate has been accused of putting his hands on a young woman who works on the Netflix series as a production assistant. Allegedly, he grabbed and shook her while shouting in her face.\n\n\tA source tells Variety that “Outer Banks” star Chase Stokes witnessed Pate demonstrating physical and verbal aggression and immediately stepped in to protect the PA. After he separated the two, fellow actor Madelyn Cline also intervened to help de-escalate the confrontation.\n\t\n\n\tThe Netflix series is currently in production on its fifth and final season in Dubrovnik, Croatia. Representatives for Netflix did not respond to Variety‘s request for comment.\n\n\n\t“Outer Banks” follows a group of teenagers living in a coastal town in North Carolina as they navigate love, friendship and social divides while investigating why the ringleader of the group’s father went missing. The series debuted on Netflix in 2020 and was renewed for a fifth and final season in November 2024. Along with Stokes and Cline, the cast includes Madison Bailey, Jonathan Daviss, Drew Starkey, Carlacia Grant, Austin North, Fiona Palomo, J. Anthony Crane and Cullen Moss.\n\n\tPate co-created “Outer Banks” with his twin brother, Josh Pate, and Shannon Burke. He also created the Amazon Prime Video musical teen drama “The Runarounds,” which he co-produced with his brother and Burke. Pate launched his career by writing and directing the 1996 thriller “The Grave,” before he and Josh created the supernatural dramedy “G vs E” (later renamed “Good vs Evil”). His other credits include “Surface,” “Friday Night Lights,” “Aquarius,” “Iron Fist” and “New Amsterdam.”\n\t\n\n\tTMZ first reported the news.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Outer Banks’ Co-Creator Jonas Pate Accused of Grabbing, Shaking and Yelling at Female Production Assistant; Stars Chase Stokes and Madelyn Cline Intervened",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/GettyImages-2231568535.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-23T19:43:50.000Z",
      "dateModified": "2025-10-23T19:43:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Fallout 76’ Game Sets Launch Date for Major Crossover With Amazon’s ‘Fallout’ TV Series",
    "url": "https://variety.com/2025/gaming/news/fallout-day-burning-springs-map-expansion-release-date-1236559108/",
    "image": "https://variety.com/wp-content/uploads/2025/10/Fallout-76-The-Ghoul.png?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-23T18:00:00.000Z",
    "description": "\n\tIn celebration of Fallout Day, Bethesda Game Studios has unveiled the launch date for “Burning Springs,” the latest update coming to “Fallout 76,” w",
    "body": "\n\tIn celebration of Fallout Day, Bethesda Game Studios has unveiled the launch date for “Burning Springs,” the latest update coming to “Fallout 76,” which will be a direct tie-in with Amazon’s “Fallout” TV series.\n\n\tThe game update will debut Dec. 2, just ahead of the “Fallout” Season 2 premiere Dec. 17 on Prime Video. \n\n\tAs previously announced, the “Burning Springs” map expansion will introduce a new arid region Ohio, where players will encounter the Rust King, battle desert Deathclaws, and team up with friends in two new public events. \n\t\n\n\tA new bounty hunting system will also be added to “Fallout 76,” led by Walton Goggins reprising his role as The Ghoul from Prime Video’s “Fallout” series for the in-game update. The bounty system will allow players to hunt down criminals across the new region. \n\n\n\t“Fallout 76: Burning Springs” will be available on Steam, PC, Xbox Series X and S, Xbox One, and PlayStation 5 and 4, as well as Xbox Game Pass and PlayStation Plus Extra starting Dec. 2.\n\n\tBethesda Game Studios has also revealed that “Fallout 4 Anniversary Editions” will be available to purchase beginning on Nov. 10. The latest edition will contain six official add-ons with over 150 pieces of Creation Club content. \n\n\tThe “Fallout 4 Anniversary Edition” will feature a brand-new in-game Creations menu to help you easily discover and download content on PC and console.\n\n\tAdditional announcements include “Fallout: New Vegas,” celebrating its 15th anniversary, where an exclusive bundle will be available to pre-order on Oct. 23. via the Bethesda Gear Store.  \n\t\n\n\tThe “Fallout: New Vegas” 15th Anniversary Bundle will comes with a “Fallout: New Vegas” Ultimate Edition PC Code, an exclusive Victor statue, Doc Mitchell’s evaluation cards, a Vault Boy enamel pin, a Mojave Express patch, a NCR Recon Patch, and a Collector’s big Box created exclusively for the anniversary. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Fallout 76’ Game Sets Launch Date for Major Crossover With Amazon’s ‘Fallout’ TV Series",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/Fallout-76-The-Ghoul.png?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-23T18:00:00.000Z",
      "dateModified": "2025-10-23T18:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Janus Films Acquires U.S. Rights to ‘Blue Heron’ (EXCLUSIVE)",
    "url": "https://variety.com/2025/film/news/janus-films-acquires-blue-heron-sophy-romvari-1236559921/",
    "image": "https://variety.com/wp-content/uploads/2025/10/Blue-Heron_1.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-23T18:11:28.000Z",
    "description": "\n\tJanus Films has acquired the U.S. rights to Sophy Romvari’s “Blue Heron,” starring Eylul Guven and Edik Beddoes. The film is set for a 2026 release.",
    "body": "\n\tJanus Films has acquired the U.S. rights to Sophy Romvari’s “Blue Heron,” starring Eylul Guven and Edik Beddoes. The film is set for a 2026 release.\n\n\t“Blue Heron” follows Sasha (Guven), the eight-year-old daughter of a Hungarian immigrant family that relocates to Vancouver Island during the late 1990s. As the family starts to get settled in their new environment, their oldest son, Jeremy (Beddoes) begins to show increasingly antisocial and dangerous behavioral issues in their new home. \n\t\n\n\tAdditional cast members include Iringó Réti, Ádám Tompa, Amy Zimmer, Liam Serg, and Preston Drabble.\n\n\n\t“It is without exaggeration to say that Janus Films has brought the majority of the greatest films of all time to audiences,” said Romvari in a statement. “For my debut feature to be brought into this legacy, by a team so dedicated to celebrating cinema and protecting the theatrical experience, is far beyond a dream come true.”\n\n\tThe film had its world premiere in competition at the 2025 Locarno Film Festival, winning the Swatch First Feature Award and the Junior Jury Award. In September, “Blue Heron” held its North American premiere at the Toronto International Film Festival, where it won the Best Canadian Discovery award. \n\n\t“Blue Heron” was produced by Nine Behind Productions (Canada) and Boddah (Hungary) in association with Memory, Simbelle Productions, Tinygiant, and Ursa Major with funding from Telefilm Canada and the National Film Institute Hungary. MoreThan Films will represent international sales.\n\n\tProducers for “Blue Heron” include Romvari, Ryan Bobkin, Sara Wylie and Gábor Osváth. Executive Producers are Riel Roch-Decter, Lauren Melinda, Neil Champagne, Veronica Diaferia, Sara Eolin, Jasmin Karibzhanova, Sam Sutcliffe, and Leah CL.\n\t\n\n\tThe deal was negotiated by Janus Films and the filmmakers. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Janus Films Acquires U.S. Rights to ‘Blue Heron’ (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/Blue-Heron_1.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-23T18:11:28.000Z",
      "dateModified": "2025-10-23T18:11:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Fox Entertainment Acquires Stake in B.J. Novak’s Food Experience Company, Chain",
    "url": "https://variety.com/2025/tv/news/fox-entertainment-invests-bj-novak-food-company-chain-1236559876/",
    "image": "https://variety.com/wp-content/uploads/2025/10/GettyImages-2173602546-e1761242182291.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-23T19:00:00.000Z",
    "description": "\n\tFox Entertainment has acquired an equity stake in B.J. Novak‘s food experience company, Chain, a Los Angeles-based venture that eventizes nostalgic ",
    "body": "\n\tFox Entertainment has acquired an equity stake in B.J. Novak‘s food experience company, Chain, a Los Angeles-based venture that eventizes nostalgic dining. The deal includes Fox IP integrations and a first-look development deal with Chain Media.\n\n\tChain is best known for ChainFest, a ticketed event in L.A. that features Michelin-starred chef remixes of fast food favorites, pop-up restaurants and exclusive menu offerings. Its collaborations include Taco Bell, Pizza Hut, Jack in the Box and Panda Express, as well as entertainment partners like Paramount and Disney.\n\t\n\n\tFox will partner Chain’s food pop-ups, fan festivals and other events with Gordon Ramsay’s Studio Ramsay Global banner, which is also under the Fox umbrella. (Ramsay, one of the most famous culinary personalities of all time, has produced hosted Fox series from “Hell’s Kitchen,” “Masterchef” and this year’s “Secret Service.” The network plans to integrate Chain into Ramsay’s growing list of television programming. The goal is for Chain to grow its event portfolio and develop live experiences tied to Fox’s culinary properties.\n\n\n\t“Food continues to define culture — it’s how we celebrate, how we remember, how we connect. No one understands how to turn culinary storytelling into cultural obsession like Fox Entertainment and Studio Ramsay Global. We’re excited to work together to bring Chain experiences to more people,” said Novak. \n\n\t“As Fox continues to expand its dominance across the food space, investing in Chain furthers our digital storytelling and content creation strategy with this deep partnership in a winning business model, where viral events advance creative possibilities,” added Rob Wade, CEO of Fox Entertainment. “Studio Ramsay Global’s far-reaching, growing culinary empire and unmatched digital footprint, together with Chain’s remarkable, proven impact, will strengthen, scale and deepen our connection to food fans everywhere.”  \n\t\n\n\tChain was founded by Novak, producers and entrepreneurs Jack Davis, Abe Burns and Byron Ashley; Michelin-starred chef Timothy Hollingsworth; and chief creative officer Nicholas Kraft.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Fox Entertainment Acquires Stake in B.J. Novak’s Food Experience Company, Chain",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/GettyImages-2173602546-e1761242182291.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-23T19:00:00.000Z",
      "dateModified": "2025-10-23T19:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Michael B. Jordan in Talks to Star in Joseph Kosinski’s ‘Miami Vice’ as Ricardo Tubbs",
    "url": "https://variety.com/2025/film/news/michael-b-jordan-joseph-kosinski-miami-vice-1236533593/",
    "image": "https://variety.com/wp-content/uploads/2025/05/2210271009-e1747760803263.jpg?crop=0px%2C160px%2C6556px%2C3681px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-10-23T18:18:44.000Z",
    "description": "\n\tMichael B. Jordan is in early talks to star as Ricardo “Rico” Tubbs in Joseph Kosinski‘s big-screen reboot of “Miami Vice.”\n\n\tJordan, one of Hollywo",
    "body": "\n\tMichael B. Jordan is in early talks to star as Ricardo “Rico” Tubbs in Joseph Kosinski‘s big-screen reboot of “Miami Vice.”\n\n\tJordan, one of Hollywood’s most beloved leading men, is a fitting choice for a blockbuster auteur like Kosinski, whose filmography includes big-screen spectacles like “Top Gun: Maverick” and “F1: The Movie.” Like Kosinski, Jordan has a knack for infusing popcorn fare with authentic human stories, such as in the “Creed” franchise, which he also directs. \n\t\n\n\tJordan has been a Hollywood staple for over a decade, breaking out with films like “Fruitvale Station,” “Just Mercy,” the “Black Panther” movies and most recently headlined the box office blockbuster, “Sinners.” Jordan pulled double duty on Ryan Coogler’s horror epic, playing twin brothers Smoke and Stack. Released on April 18 to critical acclaim, “Sinners” became the highest-grossing original horror movie of all time, earning $366 million worldwide. Jordan is currently directing, producing (via his Outlier Society banner) and starring in “The Thomas Crown Affair” for Amazon MGM Studios.\n\n\n\tKosinski and Universal Pictures’ “Miami Vice” was first revealed in April, and with a release date set for Aug. 6, 2027. The movie is based on the 1980s TV series, starring Don Johnson and Philip Michael Thomas, as undercover detectives in South Florida. According to an official logline, the reboot “explores the glamour and corruption of mid-80’s Miami” and is “inspired by the pilot episode and first season of the landmark television series that influenced culture and set the style of everything from fashion to filmmaking.”\n\t\n\n\tDylan Clark and Kosinski serve as producers, while Eric Warren Singer and Dan Gilroy penned the script. Production is expected to begin next year, and the movie will be filmed for Imax. \n\n\tUniversal Pictures had no comment. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Michael B. Jordan in Talks to Star in Joseph Kosinski’s ‘Miami Vice’ as Ricardo Tubbs",
      "image": [
        "https://variety.com/wp-content/uploads/2025/05/2210271009-e1747760803263.jpg?crop=0px%2C160px%2C6556px%2C3681px&resize=1000%2C563"
      ],
      "datePublished": "2025-10-23T18:18:44.000Z",
      "dateModified": "2025-10-23T18:18:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Walmart+ Membership Benefits Span Free Same-Day Delivery to Choice of Video Streaming Services",
    "url": "https://variety.com/2025/shopping/news/walmart-plus-membership-benefits-pricing-sign-up-online-1236560027/",
    "image": "https://variety.com/wp-content/uploads/2025/10/Screen-Shot-2025-10-23-at-3.32.02-PM.png?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-23T19:31:18.000Z",
    "description": "\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.\n\n\tWalmart i",
    "body": "\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.\n\n\tWalmart is betting big on its membership program. Nearly five years into its Walmart+ program, the retail giant has quietly built one of the most wide-ranging membership packages in the market — keeping the price flat at $98 a year (or $12.95/month) while stacking on benefits that extend well beyond grocery aisles.\n\n\tThe headline draw remains free delivery from local stores on orders over $351, a service that has become a lifeline for shoppers looking to cut down on errands. In addition to fresh produce, members can get same-day drop-offs2 on everything from kitchen gadgets to vitamins and electronics, with no delivery fee attached. Walmart+ also touts free shipping on Walmart.com purchases, with no order minimums and two-day or next-day arrival on thousands of items.3\n\t\n\n\tBut what sets the membership apart in today’s streaming-heavy, perk-laden economy is how far the benefits now reach outside of retail. As part of their membership, members can choose between Peacock Premium or Paramount+ Essential at no added cost.4 And at the pump, Walmart+ unlocks 10¢-per-gallon savings at Exxon, Mobil, Walmart and Murphy stations, along with member pricing at Sam’s Club.5 Even Burger King® is part of the mix, with exclusive savings built into the app for members on the go.6\n\n\tThe growing roster of add-ons positions Walmart+ as more than a shopping tool; it’s a lifestyle subscription designed to compete with broad, all-in-one memberships as well as niche, sector-specific ones. By tying together grocery delivery, streaming, fuel savings and dining benefits, Walmart is betting that convenience across categories can deepen loyalty and drive frequency.\n\t\n\n\tFor consumers, the appeal lies in how the savings stack up. A choice of streaming subscriptions along with regular fuel purchases and free delivery easily justifies the $98 annual fee. As other platforms raise prices, Walmart’s pitch is that it hasn’t — instead, the company has quietly padded the offering without tacking on extra cost.\n$35 order min. Restrictions apply. ↩︎$35 order min. Subject to availability. T&C apply.  ↩︎Excludes most marketplace items. Freight & location surcharges may apply.  ↩︎One service (w/ ads) every 90 days: Peacock Premium or Paramount+ Essential. Add’l registration req’d. T&Cs apply.  ↩︎5¢ savings in AL & OK only. Subject to change.  ↩︎Valid at part. U.S. BK’s, in the BK App or BK.com for members only. Terms apply. ↩︎\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Walmart+ Membership Benefits Span Free Same-Day Delivery to Choice of Video Streaming Services",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/Screen-Shot-2025-10-23-at-3.32.02-PM.png?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-23T19:31:18.000Z",
      "dateModified": "2025-10-23T19:31:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "CNN Sets Louvre Jewel Heist Documentary",
    "url": "https://variety.com/2025/tv/news/cnn-louvre-jewel-heist-documentary-1236559988/",
    "image": "https://variety.com/wp-content/uploads/2025/10/GettyImages-2242024115.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-23T18:49:41.000Z",
    "description": "\n\tCNN will air a TV documentary about the Louvre jewel heist that shook Paris on Sunday, Oct. 26, at 8 p.m.\n\n\t“The Heist: The Louvre’s Stolen Crown Je",
    "body": "\n\tCNN will air a TV documentary about the Louvre jewel heist that shook Paris on Sunday, Oct. 26, at 8 p.m.\n\n\t“The Heist: The Louvre’s Stolen Crown Jewels” will also be available to stream via the cabler’s All Access subscription beginning Oct. 28.\n\n\tThe special, which is part of CNN’s “FlashDocs” unit, will feature analysis from journalists, art-crime investigators and experts on all things relating to the French museum and cultural institution. On Oct. 19, thieves dressed up as construction workers entered the Louvre during operating hours via an industrial ladder and stole eight pieces of the French Crown Jewels worth more than $100 million. CNN sets out to explore how a seven-minute heist in broad daylight turned the most important museum in the world into a crime scene.\n\t\n\n\t“Blending frontline reporting, cinematic visuals, and the pulse of a global mystery unfolding in real time, ‘The Heist’ is a gripping, up-to-the-minute account of a crime that museum insiders saw coming for years, only to have their warnings ignored,” per the logline.\n\n\n\tThe documentary will also delve into the cultural fallout of the jewel heist, examining the ways in which France has been forced to “confront how myth, wealth, and vulnerability coexist inside its most celebrated institution.” It will also raise a discussion about how Hollywood has led people to romanticize jewel heists as “victimless crimes.”\n\n\t“The Heist” is executive produced by Eric Johnson. Amy Entelis and Katie Hinman are executive producers for CNN FlashDocs, which is the unit behind quick-turnaround documentaries like “Blindsided” (about the football player Michael Oher) and “Taking on Taylor Swift” (which examined the copyright lawsuit surrounding “Shake It Off”). \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "CNN Sets Louvre Jewel Heist Documentary",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/GettyImages-2242024115.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-23T18:49:41.000Z",
      "dateModified": "2025-10-23T18:49:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Stellan Skarsgård Says 13-Year-Old Son Gets Labeled a ‘Nepo Baby’ by ‘Cruel and Ignorant’ Kids: ‘He Doesn’t Have Any Friends at School’",
    "url": "https://variety.com/2025/film/news/stellan-skarsgard-son-bullied-nepo-baby-1236559764/",
    "image": "https://variety.com/wp-content/uploads/2025/10/P115VHWP.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-23T20:06:47.000Z",
    "description": "\n\tStellan Skarsgård said in an interview with Vulture that his 13-year-old son gets picked on at school because his father is an actor. “Cruel kids” c",
    "body": "\n\tStellan Skarsgård said in an interview with Vulture that his 13-year-old son gets picked on at school because his father is an actor. “Cruel kids” call his child a “nepo baby,” which has become the ubiquitous term to describe children with famous parents.\n\n\t“My 13-year-old, Kolbjörn, the youngest, suffers from that,” Skarsgård said. “When his pals at school call him nepo baby, he gets so sad. He doesn’t have any friends at school. He gets isolated. Cruel kids — or cruel and ignorant. But it is such a bullshit thing. Because nobody would hire you, at least not for anything good, if you’re not good enough.”\n\t\n\n\tWhile the internet has mostly rallied against nepo babies, industry figures have refuted the idea that having a famous parent results in career longevity. Jennifer Aniston recently said on the “Armchair Expert” podcast that it’s only natural for kids to want to follow in the path of their parents, a trend that far exceeds the entertainment industry. Aniston’s father is the late John Aniston, who starred on the soap opera “Days of our Lives” for nearly four decades.\n\n\n\t“I mean, look at all the law firms. Blanky Blank Blanky and Blanky Blank. I mean, all right, isn’t that a version of it’s all in the family? It’s all in the family,” Aniston said. “So, maybe you got into a door because you’re so-and-so’s kid, but if you suck, guess what? You’re not going to continue to do it.”\n\n\tKate Hudson, the daughter of actors Goldie Hawn and Bill Hudson, told The Independent in 2022 that she shrugs off any nepo baby backlash that comes her way, explaining: “I look at my kids and we’re a storytelling family. It’s definitely in our blood. People can call it whatever they want, but it’s not going to change it.”\n\t\n\n\t“I actually think there are other industries where it’s [more common],” Hudson continued. “Maybe modeling? I see it in business way more than I see it in Hollywood. Sometimes I’ve been in business meetings where I’m like, ‘Wait, whose child is this? Like, this person knows nothing!’ I don’t care where you come from, or what your relationship to the business is – if you work hard and you kill it, it doesn’t matter.”\n\n\tJamie Lee Curtis, the daughter of actors Tony Curtis and Janet Leigh, posted on Instagram around the same time that the discourse around the topic is designed to hurt.\n\n\t“I have been a professional actress since I was 19 years old so that makes me an OG Nepo Baby,” Curtis wrote. “I’ve never understood, nor will I, what qualities got me hired that day, but since my first two lines on Quincy as a contract player at Universal Studios to this last spectacular creative year some 44 years later, there’s not a day in my professional life that goes by without my being reminded that I am the daughter of movie stars. The current conversation about nepo babies is just designed to try to diminish and denigrate and hurt.”\n\n\tSkarsgård has been hitting the press trail for his new movie, “Sentimental Value,” since its premiere at the Cannes Film Festival in May. The drama, directed by “The Worst Person in the World” filmmaker Joachim Trier, tackles the subject of nepo babies dead on, as Skarsgård plays a legendary director at odds with his actress daughter.\n\n\tRead Skarsgård’s full interview with Vulture here. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Stellan Skarsgård Says 13-Year-Old Son Gets Labeled a ‘Nepo Baby’ by ‘Cruel and Ignorant’ Kids: ‘He Doesn’t Have Any Friends at School’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/P115VHWP.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-23T20:06:47.000Z",
      "dateModified": "2025-10-23T20:06:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Best Couples Costumes to Wear This Halloween: From ‘Severance’ to Oasis",
    "url": "https://variety.com/feature/best-halloween-costumes-couples-1235045763/",
    "image": "https://variety.com/wp-content/uploads/2025/07/Severance-Adam-Scott-Britt-Lower-Featured.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-23T20:06:43.000Z",
    "description": "\n\tTired of your Fred and Wilma costumes? Your Daenerys Targaryen and Jon Snow cosplays feeling too tired?\n\n\tThe perfect couples costumes — ones that a",
    "body": "\n\tTired of your Fred and Wilma costumes? Your Daenerys Targaryen and Jon Snow cosplays feeling too tired?\n\n\tThe perfect couples costumes — ones that are timely but not overused — can be hard to come by. But thankfully, the past year of shows, movies and viral pop-culture moments have gifted us all with more than enough iconic duos to pull inspiration from this Halloween. From Liam and Noel Gallagher to Taylor and Travis, here are the best couples costumes to shop this Halloween:\n\n\n\t\n\t\tTaylor and Travis \t\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tGetty Images\n\t\n\n\n\n\tYou didn’t think you could get through this list without the queen of pop herself, did you? No matter what era you’re in, Halloween is time to be fearless-ust like Taylor and her real-life love story.\n\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\n\t\n\t\tOasis\t\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tGetty Images\n\t\n\n\n\n\tDon’t say “Trick or Treat,” say “C’mon you know.” If you weren’t able to snag a ticket to the Oasis tour, which the recently reunited brothers will embark on next year, the next best thing (sorta?) is to celebrate the beloved rock band for Halloween. \n\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\n\t\n\t\tStack and Smoke in ‘Sinners’\t\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\t©Warner Bros/Courtesy Everett Collection\n\t\n\n\n\n\tGrab a houndstooth wool blazer and red and blue newsboy cap to embody the dapper twins played by Michael B. Jordan in “Sinners.” \n\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\t\n\t\tMark and Helly in ‘Severance’\t\n\n\n\n\t\n\n\t\n\n\n\n\tCosplay the soulless, corporate style of Lumon Industries in this adorable couples costume inspired by everyone’s favorite TV couple: Mark and Helly.\n\n\n\t\n\n\t\n\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\t\n\t\tThe Ratliffs in ‘The White Lotus’\t\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tStefano Delia/HBO\n\t\n\n\n\n\tAll you need is a Duke tee, pill bottles and the furrowed brow of a billionaire in trouble for this simple duo costume.\n\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\n\t\n\t\tRFK Jr. and His Brain Worm\t\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tGetty Images\n\t\n\n\n\n\tIn many ways, the parasitic worm that RFK Jr. claims ate away at his brain before dying in 2010, was one of the main characters of the 2024 election season.\n\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\n\t\n\t\tBeetlejuice and Lydia Deetz \t\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\t©Warner Bros/Courtesy Everett Collection\n\t\n\n\n\n\tTill death do you part—or maybe not even then, if you ask Beetlejuice’s Barbara and Adam. Shop their eye-catching (and face-stretching) costumes for a classic throwback.\n\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\n\t\n\t\tGlinda and Elphaba\t\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tUniversal\n\t\n\n\n\n\t“Because I knew you, I have been changed for good.” That’s what you and your partner can sing to each other all night while having a wickedly good time dressing as the Wicked Witch of the West and Glinda the Good.\n\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\n\t\n\t\tCharli XCX and Benny Blanco\t\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tPenske Media via Getty Images\n\t\n\n\n\n\tThe best friend pair at the helm of the indie sleaze revival, Benny and Charli. \n\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\n\t\n\t\tElisabeth Sparkle and Her Younger Self\t\n\n\n\n\t\n\n\t\n\n\n\n\tYou don’t need a non-FDA-approved injectable to become a younger version of Elisabeth Sparkle this Halloween. This couples costume, inspired by the Demi Moore-led body horror film, is probably best for mom-daughter duos. \n\n\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\n\t\n\t\tDeadpool & Wolverine\t\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\t©Walt Disney Co./Courtesy Everett Collection\n\t\n\n\n\n\tThere’s never been a more apt time to dress up as the Marvel superheroes, played by Hugh Jackman and Ryan Reynolds in this summer’s R-rated sequel. \n\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\n\t\n\t\tBarbie and Ken\t\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tPhoto by MEGA/GC Images\n\t\n\n\n\n\tBarbie was the go-to costume last year but if you have a newfound partner to couple up with this Oct. 31, then you don’t want to miss your chance to dress up as a retro, rollerskating Barbie and Ken from Greta Gerwig’s bubblegum-hued blockbuster.\n\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\n\t\n\t\tThe Targaryens from ‘House of the Dragon’\t\n\n\n\n\t\n\n\t\t\t\t\tHBO\n\t\n\n\n\n\tAmazon’s “Game of Thrones” prequel series is still the talk of the town a year later. Even more intriguing is the wide array of costumes you can glean from the large cast of characters.\n\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\n\t\n\t\tMorticia and Gomez Addams\t\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tParamount/Courtesy Everett Col\n\t\n\n\n\n\tThe Addams are a timeless Halloween couples costume.\n\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\n\t\n\t\tRick and Morty…and Pickle Rick\t\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tAdult Swim\n\t\n\n\n\n\tA good ‘ole Rick and Morty costume feels long overdue. Don an electrified wig and go as the reckless and alcoholic scientist Rick, or wear a wide-eyed mask to go as his constantly bewildered grandson Morty. Or, simply put on an inflatable pickle costume to go as Rick’s alter ego, Pickle Rick.\n\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Best Couples Costumes to Wear This Halloween: From ‘Severance’ to Oasis",
      "image": [
        "https://variety.com/wp-content/uploads/2025/07/Severance-Adam-Scott-Britt-Lower-Featured.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-23T20:06:43.000Z",
      "dateModified": "2025-10-23T20:06:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'9-1-1: Nashville' Rising Star Isabelle Tate Dead at 23",
    "url": "https://www.tmz.com/2025/10/23/isabelle-tate-dead/",
    "image": "https://imagez.tmz.com/image/b8/16by9/2025/10/23/b83fa1b0d2b447f8b3ed09b25ad6fff1_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-23T17:22:41.000Z",
    "description": "\n    \n                    \n                          '9-1-1: Nashville'\n                          Isabelle Tate Dead at 23\n                      \n    ",
    "body": "\n    \n                    \n                          '9-1-1: Nashville'\n                          Isabelle Tate Dead at 23\n                      \n                  \n                        Published October 23, 2025 10:22 AM PDT\n                                                                      |\n                Updated October 23, 2025 12:25 PM PDT\n                                    \n      \n    \n      \n        \n              \n    \n    \n          Update\n  \n    \n          11:32 AM PT -- We spoke to Isabelle Tate's agent, who tells us Tate passed away peacefully in her sleep.\n      \n    \n          We're told Isabelle suffered from Charcot-Marie-Tooth, a rare progressive neuromuscular disease which confined her to a wheelchair. Her agent says the disease affects the legs but can also affect internal organs such as the lungs and heart. Because of the disease, Tate had basically given up on her dream of acting ... until she got the 9-1-1 role -- her first big booking which was just perfect for her.\n      \n    \n          Tate's funeral will take place Friday.\n      \n    \n          Tragedy has rocked the \"9-1-1: Nashville\" ... one of the show's young actresses, Isabelle Tate, died shortly after filming an episode.\n      \n    \n          According to her obituary, the rising star died Sunday at age 23. Her agency, McCray Agency, confirmed the heartbreaking news ... though her cause of death has not been disclosed.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Isabelle played Julie in the pilot of ABC’s newest \"9-1-1\" spinoff, starring LeAnn Rimes, Chris O’Donnell, and more. Before breaking into acting, she graduated from Middle Tennessee State University.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Friends and family are remembering her online as \"full of fire,\" \"a fighter,\" and \"the most caring, loving person.\"\n      \n    \n          She was 23.\n      \n    \n          RIP\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Isabelle Tate\n              \n                          \n                RIP\n              \n                          \n                Celebrity Death\n              \n                          \n                Fairly Legal\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'9-1-1: Nashville' Rising Star Isabelle Tate Dead at 23",
      "image": [
        "https://imagez.tmz.com/image/b8/16by9/2025/10/23/b83fa1b0d2b447f8b3ed09b25ad6fff1_xl.jpg"
      ],
      "datePublished": "2025-10-23T17:22:41.000Z",
      "dateModified": "2025-10-23T17:22:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'Poltergeist' Star Will Hand Out Candy on Halloween at Infamous House",
    "url": "https://www.tmz.com/2025/10/23/poltergeist-oliver-robbins-giving-candy-to-trick-or-treaters-at-movie-house/",
    "image": "https://imagez.tmz.com/image/e6/16by9/2025/10/23/e626a47f89ea45dd90a74f0362af29f3_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-23T19:00:42.000Z",
    "description": "\n    \n                    \n                          'Poltergeist' House\n                          They're Here!!!\n                          Film Star",
    "body": "\n    \n                    \n                          'Poltergeist' House\n                          They're Here!!!\n                          Film Star to Return for Halloween Trick-or-Treaters\n                      \n                  \n                        Published October 23, 2025 12:00 PM PDT\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Trick-or-treaters visiting the iconic \"Poltergeist\" house on Halloween are going to get an additional thrill ... 'cause one of the stars from the 1982 classic will be handing out candy!\n      \n    \n          Oliver Robins tells TMZ ... he's going to drop by the infamous crib next week ... deciding he couldn't pass up an invitation from current homeowner Rachel Powers.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          We broke the news ... Powers dropped some serious cash to turn the home into a scream-worthy Airbnb straight out of the horror classic.\n      \n    \n          As fans know ... Oliver played Robbie Freeling, son of the family terrorized by the haunted house ... the killer clown doll moment being his most famous scene.\n      \n    \n          Rachel tells us having Oliver there means an epic night is in store ... and they were already expecting to get rocked by trick-or-treaters even before he joined the fun.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          We also hear Rachel is decorating the outside of the house with a nod to the final scene of the movie ... so expect a lot of skeletons and chaos.\n      \n    \n          Hopefully, by sunup ... the house will be clear.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Movies\n              \n                          \n                Fairly Legal\n              \n                          \n                Celebrity Homes\n              \n                          \n                Halloween\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Poltergeist' Star Will Hand Out Candy on Halloween at Infamous House",
      "image": [
        "https://imagez.tmz.com/image/e6/16by9/2025/10/23/e626a47f89ea45dd90a74f0362af29f3_xl.jpg"
      ],
      "datePublished": "2025-10-23T19:00:42.000Z",
      "dateModified": "2025-10-23T19:00:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Paige VanZant Models Sexy Halloween Costume Options for Her Followers",
    "url": "https://www.tmz.com/2025/10/23/paige-vanzant-sexy-halloween-costume/",
    "image": "https://imagez.tmz.com/image/40/16by9/2025/10/23/40e21279956649bc8461309811ab8baa_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-23T19:29:34.000Z",
    "description": "\n    \n                    \n                          Paige VanZant ...\n                          'Help Me Choose\n                          My Hallowee",
    "body": "\n    \n                    \n                          Paige VanZant ...\n                          'Help Me Choose\n                          My Halloween Costume!'\n                      \n                  \n                        Published October 23, 2025 12:29 PM PDT\n                                                                            \n      \n    \n          American mixed martial artist Paige VanZant is leaning on her millions ... she optioned three sexy Halloween costumes, and we're taking it one step further and asking for YOUR input ...\n      \n    \n          Check it -- the 31-year-old flexed on the 'gram with the caption, \"Help me pick a Halloween costume….. comment: 1, 2, Or 3 💀👻\"\n      \n    \n          Now it's on you ... Which is your fave look?!\n      \n    \n          VOTE NOW!\n      \n    \n          Help Paige pick her 2025 costume by hitting up the gallery and casting your vote!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Paige VanZant\n              \n                          \n                Hotties & Bodies\n              \n                          \n                Hot Bodies\n              \n                          \n                TMZ Sports\n              \n                          \n                Photo Galleries\n              \n                          \n                Halloween\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Paige VanZant Models Sexy Halloween Costume Options for Her Followers",
      "image": [
        "https://imagez.tmz.com/image/40/16by9/2025/10/23/40e21279956649bc8461309811ab8baa_xl.jpg"
      ],
      "datePublished": "2025-10-23T19:29:34.000Z",
      "dateModified": "2025-10-23T19:29:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Renée Zellweger's Character Bridget Jones to Receive Statue in London",
    "url": "https://www.tmz.com/2025/10/23/renee-zellweger-bridget-jones-statue-london/",
    "image": "https://imagez.tmz.com/image/42/16by9/2025/10/23/42c5dce3631d49a9bc36dfc37dc5f46e_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-23T19:07:19.000Z",
    "description": "\n    \n                    \n                          Renée Zellweger\n                          Bridget Jones Gets Stoned In England!!!\n               ",
    "body": "\n    \n                    \n                          Renée Zellweger\n                          Bridget Jones Gets Stoned In England!!!\n                      \n                  \n                        Published October 23, 2025 12:07 PM PDT\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Renée Zellweger has a new accomplishment to journal about ... her iconic character Bridget Jones will be immortalized in Central London with a statue!\n      \n    \n          A bronze cast of the romcom heroine is set to debut in November in London's Leicester Square on the Scenes in the Square movie statue trail ... an ode to London's film industry with statues of some iconic cinema characters.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          The statue's new home is located very close to where the fourth 'Bridget Jones' movie -- \"Bridget Jones: Mad About the Boy\" -- premiered earlier this year ... so, it's a familiar stomping ground for Zellweger, who will attend the unveiling ceremony next month.\n      \n\n          The OG 'Bridget Jones' flick came out in 2001 ... landing Zellweger her first of four Academy Award nods -- she didn't win the award for that movie, but she's won two since -- and launching a four-movie franchise. The 'Bridget Jones' series has grossed nearly $1 billion worldwide.\n      \n    \n          BTW ... Renée has made it clear she'd jump right back into the character if Helen Fielding -- the woman who created Bridget Jones -- writes another script. So perhaps this statue's just the impetus needed to get 'Bridget Jones 5' off the ground!\n      \n    \n          Bridget Jones will join Mary Poppins, Batman, Bugs Bunny, Mr. Bean, Harry Potter, Paddington Bear, Chris Washington -- Daniel Kaluuya's character from the movie \"Get Out\" -- and many more iconic characters on the trail in Leicester Square.\n      \n    \n          But, we gotta know ... does Bridget Jones meet the bar for a permanent fixture in London Town -- or do you feel like scribbling your frustrations down in a diary? Cast your vote above!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Renee Zellweger\n              \n                          \n                Movies\n              \n                          \n                Fairly Legal\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Renée Zellweger's Character Bridget Jones to Receive Statue in London",
      "image": [
        "https://imagez.tmz.com/image/42/16by9/2025/10/23/42c5dce3631d49a9bc36dfc37dc5f46e_xl.jpg"
      ],
      "datePublished": "2025-10-23T19:07:19.000Z",
      "dateModified": "2025-10-23T19:07:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Pics Show House Interior Where Man Was Allegedly Held by Stepmother for Decades",
    "url": "https://www.tmz.com/2025/10/23/connecticut-house-stepmother-imprisoned-stepson-photos/",
    "image": "https://imagez.tmz.com/image/ab/16by9/2025/10/23/ab2aea35cc7a417381dd919ad69fbe6a_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-23T18:32:55.000Z",
    "description": "\n    \n                    \n                          Connecticut Horror House\n                          See Inside Home Where Woman Allegedly\n        ",
    "body": "\n    \n                    \n                          Connecticut Horror House\n                          See Inside Home Where Woman Allegedly\n                          Imprisoned Stepson for 20+ Years\n                      \n                  \n                        Published October 23, 2025 11:32 AM PDT\n                                                                            \n      \n    \n          A woman allegedly held her stepson captive for more than two decades in Connecticut ... and creepy new photos capture the inside of the badly burned residence.\n      \n    \n          Kimberly Sullivan's house -- where prosecutors allege she kept her 32-year-old stepson, identified only as \"S,\" captive for years -- is a blackened mess after \"S\" allegedly burned the place down in order to escape.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          A half-melted Marilyn Monroe poster sits on a table in one room ... while bare beams are completely exposed ... all the drywall and wallpaper burned away.\n      \n\n          One room appears somewhat untouched ... a hot-pink sitting area on the first floor with an unsettling doll hanging from strings in the corner, surveying the area. Painted on one wall are two smoky eyes and seductive pink lips\n      \n    \n          A pair of lacy angel wings are nailed to the wall in what looks like an attic ... the room where \"S\" allegedly spent years. A trunk with unknown items in it sits in the corner of a dark room.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Firefighters found \"S\" earlier this year ... weighing just 68 pounds and covered in filth after authorities say he lit the home on fire.\n      \n    \n          He's alleged his stepmother kept him captive in an 8-by-9 foot storage space ... claiming Kimberly took him out of school when he was just a child and gave him only scraps of food and water. Sullivan was arrested several weeks after \"S\" set the fire.\n      \n    \n          Sullivan has denied all the claims against her ... and her lawyer has said it was actually her late husband -- the father of \"S\" -- who kept him locked up until he passed away last year.\n      \n    \n          According to the New York Post, Kimberly Sullivan is expected back in court on Halloween.\n      \n    \n                  \n                          \n                  \n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Crime & Arrests\n              \n                          \n                Photo Galleries\n              \n                          \n                Fairly Legal\n              \n                          \n                News\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Pics Show House Interior Where Man Was Allegedly Held by Stepmother for Decades",
      "image": [
        "https://imagez.tmz.com/image/ab/16by9/2025/10/23/ab2aea35cc7a417381dd919ad69fbe6a_xl.jpg"
      ],
      "datePublished": "2025-10-23T18:32:55.000Z",
      "dateModified": "2025-10-23T18:32:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]