[
  {
    "title": "‘Hamnet’ and ‘Rental Family’ Tie for Middleburg Film Festival Audience Award",
    "url": "https://variety.com/2025/film/news/hamnet-rental-family-middleburg-audience-award-2025-1236557302/",
    "image": "https://variety.com/wp-content/uploads/2025/10/Hamnet-Rental-Family.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-20T19:14:37.000Z",
    "description": "\n\tFor the second consecutive year, two films have shared the top prize at the Middleburg Film Festival — and both come from women directors.\n\n\tChloé Z",
    "body": "\n\tFor the second consecutive year, two films have shared the top prize at the Middleburg Film Festival — and both come from women directors.\n\n\tChloé Zhao’s emotional drama “Hamnet” and Hikari’s moving crowd-pleaser “Rental Family” won the audience award at the Virginia-based festival, which marked its 13th edition this weekend. Orlando von Einsiedel’s “The Cycle of Love,” about the romantic journey of a Delhi street artist, took home the best documentary prize, while Kaouther Ben Hania’s emotionally charged “The Voice of Hind Rajab” won for international feature.\n\t\n\n\t“Hamnet,” which screened Saturday night as the festival’s Centerpiece selection, continues to be a crowd favorite following its audience prizes at the Toronto and Mill Valley film festivals. “Rental Family” closed out Middleburg, with writer-director Hikari in attendance for the screening.\n\n\n\tThe Middleburg Film Festival has earned a reputation as a bellwether for awards season. With the exception of the 2022 audience winner “Devotion,” every recipient of the festival’s top prize has gone on to receive at least one Academy Award nomination. Past honorees include “Conclave” and “September 5” (2023), “American Fiction” (2023), “Belfast” (2021), “Minari” (2020) and “Green Book” (2018).\n\n\tAcross the four-day weekend, the festival presented several tributes and special honors. Casting director Nina Gold received the inaugural Ensemble and Casting Award for her work on “Jay Kelly,” as well as “Hamnet,” which also earned Zhao the Visionary Director Award. Colin Farrell was honored with the Spotlight Actor Award following a screening of Edward Berger’s thriller “Ballad of a Small Player,” while Rose Byrne received the Agnès Varda Trailblazing Film Artist Award for her performance in Mary Bronstein’s A24 release “If I Had Legs, I’d Kick You.”\n\t\n\n\tFilmmaker Jon M. Chu and his longtime collaborators, cinematographer Alice Brooks and editor Myron Kerstein, were also honored with the fourth annual Variety Creative Collaborators award.\n\n\t“This year’s festival has been one of our most inspiring yet,” said MFF founder and board chair Sheila Johnson. “We’re deeply appreciative of the filmmakers and studios who shared their extraordinary work with us, and to our audiences, sponsors and volunteers whose enthusiasm and support continue to make Middleburg such a special community for cinema.”\n\n\tFollowing each screening, festivalgoers cast ballots for their favorite films. This year’s lineup featured 48 titles, spanning awards-season contenders, thought-provoking documentaries and acclaimed international features.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Hamnet’ and ‘Rental Family’ Tie for Middleburg Film Festival Audience Award",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/Hamnet-Rental-Family.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-20T19:14:37.000Z",
      "dateModified": "2025-10-20T19:14:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘The Voice’ Sets Joe Walsh, Zac Brown as Season 28 Mega Mentors",
    "url": "https://variety.com/2025/tv/news/the-voice-joe-walsh-zac-brown-season-28-mega-mentors-1236557312/",
    "image": "https://variety.com/wp-content/uploads/2025/10/Joe-Walsh-Zac-Brown-The-Voice.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-20T20:00:00.000Z",
    "description": "\n\t“The Voice” Season 28 has brought on Rock & Roll Hall of Famer Joe Walsh and Grammy winner Zac Brown as the new mega mentors for the esason. \n\n\tBrow",
    "body": "\n\t“The Voice” Season 28 has brought on Rock & Roll Hall of Famer Joe Walsh and Grammy winner Zac Brown as the new mega mentors for the esason. \n\n\tBrown, the leader of the Zac Brown Band, will make his “Voice” debut alongside coaches Michael Bublé and Snoop Dogg. Walsh will team with coaches Niall Horan and Reba McEntire. Both enter the season as the remaining artists prepare for the Knockouts, which begin on Oct. 27. \n\n\n\tWalsh is known for his time as a member of The Eagles, as well as for hits like “Life’s Been Good,” “Rocky Mountain Way,” “Life in the Fast Lane,” and “Funk #49.” During his time with The Eagles, Walsh won five Grammy Awards. \n\t\n\n\tBrown is a three-time Grammy winner, while the Zac Brown Band has had six consecutive albums reach the Billboard Top 10. The band has also had five consecutive albums debut at number one on the Billboard Country Albums chart. They have sold 10.8 million albums to date. \n\n\tEach coach is entering the Knockouts with eight artists, with no saves or steals in this round of the competition. Coaches alone choose the winner from their team to advance to the Playoffs, the last round before the Live Shows.  This season’s knockouts also feature the first-ever “Mic Drop” button, given to each coach to use on an artist from their respective teams whose performance they deem worthy. Viewers at home will have the opportunity to vote for the “Mic Drop” winner among the four. The artist with the most votes is awarded a performance at The Rose Parade live on Jan. 1, 2026.  \n\n\t“The Voice” airs Mondays at 8 p.m. ET/PT on NBC and streams the next day on Peacock. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘The Voice’ Sets Joe Walsh, Zac Brown as Season 28 Mega Mentors",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/Joe-Walsh-Zac-Brown-The-Voice.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-20T20:00:00.000Z",
      "dateModified": "2025-10-20T20:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘The Simpsons: Treehouse of Horror XXXVI’ Score Was Inspired by ‘Jaws,’ John Williams and ‘Late Night With the Devil’",
    "url": "https://variety.com/2025/artisans/news/the-simpsons-treehouse-of-horrors-inspired-by-jaws-1236557308/",
    "image": "https://variety.com/wp-content/uploads/2025/10/3615_2060_CCs65-1.png?crop=240px%2C43px%2C1406px%2C791px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-10-20T19:31:10.000Z",
    "description": "\n\tYes, that was a “Jaws” reference in the latest “The Simpsons: Treehouse of Horror” episode, and it very much riffs off John Williams’ iconic score. ",
    "body": "\n\tYes, that was a “Jaws” reference in the latest “The Simpsons: Treehouse of Horror” episode, and it very much riffs off John Williams’ iconic score. \n\n\tComposer Kara Talve confirms “Jaws” was the main reference. Talve is no stranger to scoring “Treehouse of Horror,” the annual horror-themed episode of “The Simpsons,” which is now in its 37th season. She is part of Bleeding Fingers Music, a collective founded over a decade ago by Hans Zimmer. Talve is on her sixth go-round with fellow composer Russell Emanuel.\n\t\n\n\n\n\t\n\n\t\n\n\n\n\tIn the episode, Springfield is “menaced by a mysterious murdering monster from out of the sewers, Krusty has a demonic special guest on his live Halloween special, and we are transported a thousand years into the town’s poseable plastic post-apocalyptic future.” \n\n\n\tThe episode is split into three segments, the first titled “The Last Days of Crisco.” Fatberg is the monster who draws fat from his victims and parodies “Jaws.” Emanuel explains, “The music to Fatberg had to be delightfully distasteful and disgusting. So we had to score disgusting.”\n\n\tTalve adds, “‘Jaws’ was the biggest reference for Fatberg. So we got to go really John Williams, with heavy orchestral music, and we used big, over-the-top brass.” The duo moved around notes to create a sound that was dissonant, amplifying the disgusting effect.\n\n\n\n\t\n\n\t\n\n\n\n\t“Clown Night with the Devil” sees Krusty the Clown’s show go haywire when the Devil (voiced by Idris Elba) shows up and causes chaos. Unlike the previous segment, the music veered away from orchestral sounds and leaned into synth-heavy tones. Talve points out, “It references ‘Late Night With the Devil.’” She went back to revisit the 2023 horror film by Cameron Cairnes and Colin Cairnes. Talve says, “We watched it because, on the spotting call, Mike Price, the showrunner, kept referencing this demonic hum that he wanted to come out of the characters possessed by the devil.” When watching the film, she finally understood the rumble Price was referring to. “He really wanted the music to feel like it was coming internally from the characters, rather than it being scored.”\n\t\n\n\t“Plastic World” leans away from horror and more into a dystopian depiction of Springfield, imagining a world covered in Buzz Cola bottles. For that segment, renowned woodwind player Pedro Eustache was brought in with his extensive arsenal of woodwinds. Talve says, “He used the Wilding Horn,” and, in addition to that, Eustache — who is known for making many of his own instruments — brought in a pipe.\n\n\tEmanuel says, “He had made this giant thing out of PVC pipe, and he was a key part of the sound of ‘Plastic World.’”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘The Simpsons: Treehouse of Horror XXXVI’ Score Was Inspired by ‘Jaws,’ John Williams and ‘Late Night With the Devil’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/3615_2060_CCs65-1.png?crop=240px%2C43px%2C1406px%2C791px&resize=1000%2C563"
      ],
      "datePublished": "2025-10-20T19:31:10.000Z",
      "dateModified": "2025-10-20T19:31:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "AI News Anchor Debuts on U.K.’s Channel 4 in Stunt Proving Dangers of Artificial Intelligence",
    "url": "https://variety.com/2025/tv/news/ai-news-anchor-channel-4-1236557295/",
    "image": "https://variety.com/wp-content/uploads/2025/10/AI-Presenter.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-20T20:00:00.000Z",
    "description": "\n\tA news special on Britain’s Channel 4 titled “Will AI Take My Job?” investigated how automation is reshaping the workplace and pitting humans agains",
    "body": "\n\tA news special on Britain’s Channel 4 titled “Will AI Take My Job?” investigated how automation is reshaping the workplace and pitting humans against machines. At the end of the hour-long program, a major twist was revealed: the anchor, who narrates and appears throughout the telecast reporting from different locations, was entirely AI-generated.\n\n\tIn the final moments of the special, the host says: “AI is going to touch everybody’s lives in the next few years. And for some, it will take their jobs. Call center workers? Customer service agents? Maybe even TV presenters like me. Because I’m not real. In a British TV first, I’m an AI presenter. Some of you might have guessed: I don’t exist, I wasn’t on location reporting this story. My image and voice were generated using AI.”\n\t\n\n\tThe hour aired Monday at 8 p.m. as part of the “Dispatches” documentary program, which Channel 4 says is now the first British television show to feature an AI presenter. The “anchor” was produced by AI fashion brand Seraphinne Vallora for Kalel Productions and was guided by prompts to create a realistic on-camera performance.\n\n\t“The use of an AI presenter is not something we will be making a habit of at Channel 4 — instead our focus in news and current affairs is on premium, fact checked, duly impartial and trusted journalism — something AI is not capable of doing,” said Louisa Compton, Channel 4’s head of news and current affairs. “But this stunt does serve as a useful reminder of just how disruptive AI has the potential to be — and how easy it is to hoodwink audiences with content they have no way of verifying.”\n\t\n\n\tAccording to the state-owned network, the stunt complies with Channel 4’s editorial guidelines governing the ethical use of AI, as the reveal at the end is meant to make the viewer reflect on questions relating to trust and authenticity in the digital age.\n\n\t“Will AI Take My Job?” explores the findings of a Channel 4 survey of 1,000 business leaders in the U.K. According to the survey, 76% of bosses have already adopted AI for tasks previously carried out by humans, and 66% say they are “excited” about the technology’s use in the workplace. 41% said AI adoption has already led to reduced recruitment at their companies, and nearly half said they expect further staff reductions in the next five years.\n\n\tChannel 4’s stunt follows the media firestorm surrounding Tilly Norwood, an AI-generated “actress” that sparked backlash from actors, agencies and Hollywood unions.\n\n\t“To be clear, ‘Tilly Norwood’ is not an actor, it’s a character generated by a computer program that was trained on the work of countless professional performers — without permission or compensation,” SAG-AFTRA wrote in a statement. “It has no life experience to draw from, no emotion and, from what we’ve seen, audiences aren’t interested in watching computer-generated content untethered from the human experience. It doesn’t solve any ‘problem’ — it creates the problem of using stolen performances to put actors out of work, jeopardizing performer livelihoods and devaluing human artistry.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "AI News Anchor Debuts on U.K.’s Channel 4 in Stunt Proving Dangers of Artificial Intelligence",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/AI-Presenter.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-20T20:00:00.000Z",
      "dateModified": "2025-10-20T20:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Eric Dane to Play Firefighter Diagnosed With ALS in ‘Brilliant Minds’ Season 2",
    "url": "https://variety.com/2025/tv/news/eric-dane-als-patient-brilliant-minds-1236557223/",
    "image": "https://variety.com/wp-content/uploads/2025/10/GettyImages-2220841201-e1760979546189.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-20T18:00:00.000Z",
    "description": "\n\tEric Dane has joined the NBC medical drama “Brilliant Minds” as a guest star. The “Euphoria” and “Grey’s Anatomy” alum will appear in Season 2, Epis",
    "body": "\n\tEric Dane has joined the NBC medical drama “Brilliant Minds” as a guest star. The “Euphoria” and “Grey’s Anatomy” alum will appear in Season 2, Episode 9 as Matthew, a heroic firefighter who struggles to share his ALS diagnosis with his family.\n\n\tThe role is particularly noteworthy considering Dane announced earlier this year that he was diagnosed with ALS, a neurodegenerative disease that gradually paralyzes the body by destroying the nerve cells that control muscle movement. Also known as Lou Gehrig’s disease, ALS causes patients to slowly lose their ability to speak, walk and breathe on their own. Dane has recently started using a wheelchair and was forced to skip out on this year’s “Grey’s Anatomy” reunion at the Emmys due to a fall that left him hospitalized.\n\t\n\n\t“Brilliant Minds” follows neurologist Oliver Wolf (Zachary Quinto), who leads a team of doctors at Bronx General delving into medical mysteries of the mind. The series premiered in 2024, and Season 2 kicked off on Sept. 22. The cast includes Tamberla Perry, Ashleigh LaThrop, Alex MacNicoll, Aury Krebs, Spence Moore II, Teddy Sears, Donna Murphy, John Clarence Stewart, Brian Altemus and Al Calderon. \n\n\n\tThe series is inspired by author and physician Oliver Sacks and is written by Michael Grassi, who executive produces alongside Greg Berlanti, Sarah Schechter, Leigh London Redman, Lee Toland Krieger, DeMane Davis, Jasmine Russ, Henrik Bastin, Jonathan Cavendish, Andy Serkis and Shefali Malhoutra. Berlanti Productions, Fabel Entertainment, The Imaginarium, Grassi Productions and Tavala produce in association with Warner Bros. Television and Universal Television, a division of Universal Studio Group.\n\t\n\n\tDane is best known for playing Dr. Mark Sloan across 139 episodes of “Grey’s Anatomy,” as well as his role as Cal Jacobs in HBO’s “Euphoria.” He also starred opposite Jensen Ackles in the Amazon thriller “Countdown,” and his credits also include “Bad Boys: Ride or Die,” “Burlesque,” “Valentine’s Day” and “Marley and Me.”\n\n\tDane is represented by CAA, Entertainment 360 and Goodman, Genow, Schenkman.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Eric Dane to Play Firefighter Diagnosed With ALS in ‘Brilliant Minds’ Season 2",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/GettyImages-2220841201-e1760979546189.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-20T18:00:00.000Z",
      "dateModified": "2025-10-20T18:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Prison Break’ Reboot From Elgin James Ordered to Series at Hulu",
    "url": "https://variety.com/2025/tv/news/prison-break-reboot-ordered-series-hulu-1236554744/",
    "image": "https://variety.com/wp-content/uploads/2023/11/TCDPRBR_FE018-e1698945682531.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-20T18:30:00.000Z",
    "description": "\n\tHulu has greenlit a reboot of “Prison Break,” Variety has learned. \n\n\tThe project was first reported to be in the works at Hulu in December 2024 wit",
    "body": "\n\tHulu has greenlit a reboot of “Prison Break,” Variety has learned. \n\n\tThe project was first reported to be in the works at Hulu in December 2024 with a pilot order. The cast includes Emily Browning as Cassidy, Drake Rodger as Tommy, Lukas Gage as Jackson, Clayton Cardenas  as Michael a.k.a “Ghost,” JR Bourne as Junior, Georgie Flores as Andrea, and Myles Bullock as Darius a.k.a “Red.”\n\n\n\tAs previously reported, the new show is set in the same world as the original series but will feature different characters and a new storyline. The official logline states, “An ex-soldier turned corrections officer (Browning) takes a job at one of the deadliest prisons in America to prove just how far she’ll go for someone she loves.”\n\t\n\n\tElgin James serves as the writer, showrunner, and executive producer on the series in addition to directing the pilot. Dawn Olmstead executive produces along with “Prison Break” creator Paul Scheuring, Marty Adelstein and Neal Moritz. Olmstead, Adelstein, and Moritz were all executive producers on the original series. 20th Television, which produced the original show, is the studio. \n\n\n\n\t\n\n\t\t\t\t\tElgin James and Dawn Olmstead\n\t\n\n\n\n\t“Prison Break” ran for five seasons on Fox and prove to be a hit for the network. The original cast included Dominic Purcell, Wentworth Miller, Amaury Nolasco, Robert Knepper, Sarah Wayne Callies, and Rockmund Dunbar. The show also spawned a TV movie, “The Final Break,” and a low-budget spinoff, “Prison Break: Proof of Innocence,” which was exclusively available on mobile phones. The series also inspired a video game, online webisodes, a magazine and a novel.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Prison Break’ Reboot From Elgin James Ordered to Series at Hulu",
      "image": [
        "https://variety.com/wp-content/uploads/2023/11/TCDPRBR_FE018-e1698945682531.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-20T18:30:00.000Z",
      "dateModified": "2025-10-20T18:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rosalía Confirms New Album ‘Lux’ Will Release in November",
    "url": "https://variety.com/2025/music/news/rosalia-lux-album-november-release-date-1236554550/",
    "image": "https://variety.com/wp-content/uploads/2025/10/GettyImages-2174253919-e1760980951426.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-20T20:04:57.000Z",
    "description": "\n\tThe wait is over for Rosalía fans. On Monday, the Spanish singer, songwriter and producer confirmed that “Lux” — the follow-up to 2022’s “Motomami” ",
    "body": "\n\tThe wait is over for Rosalía fans. On Monday, the Spanish singer, songwriter and producer confirmed that “Lux” — the follow-up to 2022’s “Motomami” — will arrive on Nov. 7 via Columbia Records.\n\n\tThe Grammy-winning artist appeared at Madrid’s Gran Vía to reveal the official album artwork, a photograph of her in nuns attire against a baby-blue backdrop. The journey to Gran Vía was captured on both TikTok and Instagram livestreams. (Rosalía was driving and smoking a cigarette on the TikTok stream — which is against the platform’s policies. It is possible that is the reason why the live stream there was cut short.) \n\t\n\n\t“Been waiting so long for this day, this moment, and finally, this moment has arrived,” Rosalía said on live. Vinyl and CD editions of “Lux” are already available for sale on her website, including a package with a limited-edition signed postcard going for $34.99. \n\n\tPrior to the reveal, Rosalía had spent weeks dropping “Lux”-related clues across social media. This past month, she tweeted, “LUX = LOVE.” She later posted a black-and-white shot of a Spotify billboard in Callao, Peru that featured a sketch of her face with music notes floating above it.\n\n\tEarlier today, a billboard appeared in Times Square showing that “Lux” had a supposed November release date. More recently, she shared a clip of herself listening to a symphony orchestra with a rosary between her teeth.\n\n\tRosalía also revealed in a conversation with Highsnobiety that she’s experienced personal growth during the album-making process.\n\n\t“I’ve changed a lot, but at the same time, I’m still wrapping my head around the same things,” she said. “It’s like I still have the same questions and the same desire to answer them. I still have the same love for the past and the same curiosity for the future.”\n\t\n\n\tRosalía’s “Motomami” was released in March 2022, and won album of the year at the 23rd Annual Latin Grammy Awards. The feat made her the first woman to win album of the year twice, following her win for “El Mal Querer” in 2019. A concept album, “Motomami” was produced by Rosalía alongside Noah Goldstein, Michael Uzowuru, Dylan Wiggins and Pharrell Williams.\n\n\tFollowing the success of “Motomami,” Rosalía released features alongside Bjork, Lisa from Blackpink, and Ralphie Choo. She also released a three-song collaborative EP called “RR” in 2023 with Rauw Alejandro. The set included popular tracks like “Beso,” “Vampiros,” and “Promesa.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rosalía Confirms New Album ‘Lux’ Will Release in November",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/GettyImages-2174253919-e1760980951426.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-20T20:04:57.000Z",
      "dateModified": "2025-10-20T20:04:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘I Play Rocky’ First Look: Anthony Ippolito Is Sylvester Stallone in Movie About the Making of ‘Rocky’",
    "url": "https://variety.com/2025/film/news/i-play-rocky-first-look-anthony-ippolito-sylvester-stallone-1236557237/",
    "image": "https://variety.com/wp-content/uploads/2025/10/I-play-Rocky-Anthony-Ippolito.jpg?crop=0px%2C26px%2C1200px%2C675px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-10-20T17:38:58.000Z",
    "description": "\n\tRocky Balboa is (kind of) returning to the big screen. \n\n\tAmazon MGM has revealed the first look at “The Offer” actor Anthony Ippolito as a young Sy",
    "body": "\n\tRocky Balboa is (kind of) returning to the big screen. \n\n\tAmazon MGM has revealed the first look at “The Offer” actor Anthony Ippolito as a young Sylvester Stallone in “I Play Rocky,” a true story about the tumultuous making of the 1976 boxing classic “Rocky.” \n\n\t“The film tells the true story of Sylvester Stallone and his unshakable belief that he wasn’t just meant to write Rocky, he was meant to be Rocky Balboa,” reads the caption on Instagram.\n\t\n\n\n\tLong before he became an onscreen action hero, a 29-year-old Stallone was a struggling actor with a partially paralyzed face and a speech impediment. He wrote the script to “Rocky” but refused to sell the rights unless he got to play the lead. After turning down six-figure deals, he got the movie made for under $1 million. An ultimate underdog story, “Rocky” became that year’s biggest box office hit and eventual Oscar best picture winner. After cementing its place in Hollywood history, the original “Rocky” spawned several sequels as well as the “Creed” spinoff series.\n\n\n\t“Green Book” filmmaker Peter Farrelly is directing “I Play Rocky,” which is currently in production. Ippolito will star alongside Stephan James as Carl Weathers, who portrayed Rocky’s fierce rival Apollo Creed, as well as AnnaSophia Robb, Matt Dillon, P.J. Byrne, Tracy Letts and Jay Duplass.\n\n\t“I Play Rocky” will be produced by Farrelly, former Warner Bros. film chief Toby Emmerich and Christian Baha. Peter Gamble (“Office Uprising”) is writing the screenplay. \n\n\tWhen the film was announced in 2024, Baha described the story of “I Play Rocky” as “unique as Sylvester Stallone himself, a seeming Everyman with an undeniable gift who needs to share it with the world and refuses to take ‘no’ for an answer.” \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘I Play Rocky’ First Look: Anthony Ippolito Is Sylvester Stallone in Movie About the Making of ‘Rocky’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/I-play-Rocky-Anthony-Ippolito.jpg?crop=0px%2C26px%2C1200px%2C675px&resize=1000%2C563"
      ],
      "datePublished": "2025-10-20T17:38:58.000Z",
      "dateModified": "2025-10-20T17:38:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Task’ Dialect Coach on Getting the Cast to Make Those Very Specific Pennsylvania Sounds: ‘It’s Such a Strange Accent’",
    "url": "https://variety.com/2025/tv/news/task-dialect-susanne-sulby-teaching-delco-accent-1236554246/",
    "image": "https://variety.com/wp-content/uploads/2025/09/Tom-Pelphrey-Task.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-20T17:30:36.000Z",
    "description": "\n\tThroughout “Task,” the seven-episode crime thriller that concluded on HBO on Oct. 19, viewers were re-introduced to the specific Delaware County, Pa",
    "body": "\n\tThroughout “Task,” the seven-episode crime thriller that concluded on HBO on Oct. 19, viewers were re-introduced to the specific Delaware County, Pa. accent that they’d perhaps first heard in HBO’s 2021 hit “Mare of Easttown,” from creator Brad Ingelsby. On “Mare,” southeastern Pennsylvanians were generally pleased with the way that Kate Winslet, Jean Smart and especially Evan Peters bravely tackled the sounds of the region. Ingelsby, who is from the area, returned to Delaware County (or Delco, as it’s known to locals) with “Task,” and a new set of actors mastered the peculiar pronunciations.\n\t\n\n\tSusanne Sulby is the hero here. She’s an actor and dialect coach from Doylestown, Pa., (that’s Bucks County, still a Philly suburb but a slightly different accent than the “Task” crew), and studied acting at the University of the Arts in Philadelphia. She splits her time between Yardley, Pa., and Marina del Rey, and here, spoke with Variety about being the “Task” master.\n\n\t\n\t\tHow did you get into being a dialect coach?\t\n\n\tI ended up teaching when I was at the University of the Arts, and I was very good at speech. I have a good ear. I’m not a linguist, but in acting school, you’re taught a rudimentary understanding of how language works, and how you can switch one sound to another, or how in one accent, the sound lands in a certain part of your mouth. So you begin to distinguish. And then at that time, it was not as sophisticated as it is now, and luckily, I had the time to grow and learn. So basically, I taught myself as, I think many, many dialect coaches do — they start off either in acting or in linguistics, and if you’re going to be a dialect coach, you do have to learn a fair amount about the sounds that we make.\n\t\n\t\n\t\tThere are some very specific words that people from that region use and may sound strange to outsiders, like “water ice,” which is a delicious frozen treat that most people around the country may know as “Italian ice.”\t\n\n\tThe first time I coached somebody with this, was Jacki Weaver in “Silver Linings Playbook,” and she was like, “Really?” And then, when I was coaching on “Mare of Easttown,” I met with Evan Peters, and he was like, “This is insane.” And I was like, “Just go for it!”\n\n\tOn “Task,” we don’t even go hard. I mean, if you’re from here and you have spent time here; if you’ve ever gone to an Eagles game or a Phillies game, the fans go hard. Come on, it can get really crazy out there.\n\t\n\t\tBut still, the region’s accents are nuanced.\t\n\n\tIt’s such a strange accent. It’s the sounds that come from the north, like “coffee” and “talk” and “call,” and then the sounds that sort of come up from the south, like the really strong Rs, like “car” and “hard,” and then it merges. Then there’s also immigration that influences the accent — like, South Philly’s a little different because there are more Italians there. If you notice, Grasso’s accent is a little different than everybody else’s, and it’s because he is from South Philly. I am collecting samples from people from South Philly — I recorded them for Fabien Frankel. And then I have another lovely woman who has helped me over the years. Her name is Eileen Dolly, and she is from Delco, which is even more specific and maybe stronger.\n\t\n\t\tWhat special sounds did you have to teach the “Task” actors?\t\n\n\tThere’s two different things. There are sounds, and then there are words or phrases that are particular. So the sounds, there’s “o,” like “hoagie” or “home” or “don’t,” or “phone.” And then there’s sounds like in “pike” or “night.” That’s a very specific sound. The other sound that I feel is very specific to the area is the short “o,” like “coffee,” “hot dog,” “come on.” [Sulby pronounces these words in a thick Delaware County accent.] I made a little sticker that had all kinds of Delco and Philly phrases on it, like “come on” and “home” and “hoagie,” those kinds of things. The other sound that’s very specific, is the “s” sound, and it’s hard for people to get because it feels too sharp.\n\t\n\t\n\t\tWhat about the socio-economic differences between the characters that impact the way they talk?\t\n\n\tCoaching is first about doing research. I’m learning from the writer, the showrunner, from the director, and from the actors about the character they want to create, and I’m also hopefully gathering some information for them about the area that can help them make decisions.\n\n\tSo across the board, the more touches you have outside of your block, the chances are that your accent is going to be changed. Delco is particularly interesting because people people love Delco. If they’re from Delco, it’s Delco green. Delco strong — a very big deal. So Tom Pelphrey’s character Robbie has a very strong accent. He utilized me, and then he found that one of the women on the crew — we had a lot of local crew — had a brother who had a really strong accent, so Tom would talk football with that guy for hours on end to perfect it, to just listen to the cadences and stuff like that.\n\n\tMark Ruffalo was a totally different thing, because his character went to seminary, he was in the FBI. He had to do public speaking. So he’s a pretty worldly guy. He had just little pieces of the accent in his speech.\n\n\tThen it ran the gamut. I mean, we had bikers — the samples that I had for them, they could choose different samples from all over the city, because North Philly sounds a little different than Delco or South Philly. There were different people that I had gathered recordings of. And Sam Keeley [Jayson Wilkes] had a really strong accent. He’s Irish. I don’t know if you know this, but there were probably eight different people who were from Ireland, England and South Africa in the cast.\n\t\n\t\tWho were some of the most enthusiastic accept adopters?\t\n\n\tLet’s talk about Emilia Jones for a second. She was so game. She’s such a talented actress, and she came early so that she could sort of soak up the environment. And that’s something that I love. We went to South Philly, which is not the actual accent that she took on, but you get to hear a lot of it in the area. You get to the feel of the blue collarness, right? And we went out to a couple of places in Delco, and drove around. I would send her clips; I’d send her podcasts. She was just eating it up. And she just loved Delco so much. At wrap, I actually bought her a pendant that said “Delco,” which she wears all the time. Sam Keeley, he really wanted to just dive into it. He kept his Philly accent the entire time. People did not know on set that he was Irish.\n\t\n\n\tDialect coaching is about finding out what the actors want then helping them craft the person they’re creating.\n\n\tThis interview has been edited and condensed.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Task’ Dialect Coach on Getting the Cast to Make Those Very Specific Pennsylvania Sounds: ‘It’s Such a Strange Accent’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/09/Tom-Pelphrey-Task.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-20T17:30:36.000Z",
      "dateModified": "2025-10-20T17:30:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bryan Cranston, SAG-AFTRA and Agents Applaud Fixes to Open AI’s Sora 2 After Outcry",
    "url": "https://variety.com/2025/film/news/bryan-cranston-sag-aftra-open-ai-sora-2-fix-1236557234/",
    "image": "https://variety.com/wp-content/uploads/2023/07/GettyImages-1499073422-e1690301842696.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-20T17:45:51.000Z",
    "description": "\n\tOpenAI appears to have calmed fears around Sora 2, winning over SAG-AFTRA, CAA, UTA and actor Bryan Cranston with new guardrails on the platform to ",
    "body": "\n\tOpenAI appears to have calmed fears around Sora 2, winning over SAG-AFTRA, CAA, UTA and actor Bryan Cranston with new guardrails on the platform to protect actors’ voices and likenesses.\n\n\tCranston was among those who raised concerns when the initial launch of the AI video platform allowed users to create his image without his permission. In a statement issued by the actors’ union on Monday, Cranston thanked OpenAI for updating Sora 2 to add new protections.\n\t\n\n\t“I was deeply concerned not just for myself, but for all performers whose work and identity can be misused in this way,” Cranston said. “I am grateful to OpenAI for its policy and for improving its guardrails, and hope that they and all of the companies involved in this work, respect our personal and professional right to manage replication of our voice and likeness.”\n\n\n\tShortly after Sora 2 debuted, a video circulated online that appeared to show Michael Jackson, the late pop star, interacting with Walter White, Cranston’s character from “Breaking Bad.” Cranston’s reps at UTA flagged the video to him and to Sony Pictures Television, the producer of the show.\n\n\tWME, CAA and UTA were out front in raising alarms about Sora 2 creating AI video clips using copyrighted characters. Since then, OpenAI has been in damage control mode and has worked with industry stakeholders to try to fix the situation.\n\n\tSAG-AFTRA and the agencies noted that the company has engaged in “productive collaboration” to protect actors’ rights. In a statement, Sean Astin, the new president of the union, noted that actors face a risk of “massive misappropriation” from AI.\n\t\n\n\t“Bryan did the right thing by communicating with his union and his professional representatives to have the matter addressed,” Astin said. “This particular case has a positive resolution. I’m glad that OpenAI has committed to using an opt-in protocol, where all artists have the ability to choose whether they wish to participate in the exploitation of their voice and likeness using A.I.”\n\n\tOpenAI previously endorsed the No Fakes Act, a federal law that would ban non-consensual digital replicas. SAG-AFTRA has made passage of that law one of its highest legislative priorities. Under current law, actors have voice and likeness protections in California and other states, but not on the federal level.\n\n\t“OpenAI is deeply committed to protecting performers from the misappropriation of their voice and likeness,” Sam Altman, the CEO, said in the joint statement on Monday. “We were an early supporter of the NO FAKES Act when it was introduced last year, and will always stand behind the rights of performers.”\n\n\tSora 2 allows performers to “opt in” to having their likenesses used on the platform. But the initial release allowed users to manipulate the images of actors who had not opted in — raising fears that the system was functionally an “opt out.” Altman later said that OpenAI was tweaking the platform to give copyright holders and performers greater control over how their images are used.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bryan Cranston, SAG-AFTRA and Agents Applaud Fixes to Open AI’s Sora 2 After Outcry",
      "image": [
        "https://variety.com/wp-content/uploads/2023/07/GettyImages-1499073422-e1690301842696.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-20T17:45:51.000Z",
      "dateModified": "2025-10-20T17:45:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'Shahs of Sunset' Star Mercedes Javid Files to Divorce Husband Tommy Feight",
    "url": "https://www.tmz.com/2025/10/20/mercedes-javid-files-to-divorce-husband-tommy-feight/",
    "image": "https://imagez.tmz.com/image/25/16by9/2025/10/20/2511b0abcf5a448eb828e10822a464dc_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-20T19:01:01.000Z",
    "description": "\n    \n                    \n                          'Shahs of Sunset'\n                          Mercedes Javid Files For Divorce After 7 Years ...\n  ",
    "body": "\n    \n                    \n                          'Shahs of Sunset'\n                          Mercedes Javid Files For Divorce After 7 Years ...\n                          Wants Primary Custody of 6-Year-Old\n                      \n                  \n                        Published October 20, 2025 12:01 PM PDT\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Mercedes \"MJ\" Javid says the sun has gone down on her union to Tommy Feight ... 'cause the \"Shahs of Sunset\" star has filed for divorce after more than seven years of marriage.\n      \n    \n          The reality star filed the documents in Los Angeles Friday night ... and, she lists the date of separation as last Friday, October 17 -- so, it seems she didn't wait long to head over to the courthouse after the split.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          She's citing the boilerplate irreconcilable differences as the reason for the split ... and, she's asking to block the court's ability to award spousal support to herself or her estranged husband.\n      \n\n          Mercedes and Tommy married on April 21, 2018, and they share a 6-year-old child together named Shams, and MJ is asking for sole physical and legal custody ... but is open to a visitation schedule for Tommy.\n      \n    \n          A hearing in the divorce has been scheduled for December 18.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Mercedes starred in all nine seasons of \"Shahs of Sunset\" ... appearing on the show from 2012 until it ended in 2021. Tommy also appeared on the show throughout the years, and the two had some well-documented ups and downs, as any couple does.\n      \n    \n          We've reached out to Tommy for comment ... so far, no word back.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Mercedes MJ Javid\n              \n                          \n                Shahs of Sunset\n              \n                          \n                Reality TV\n              \n                          \n                Celebrity Divorce\n              \n                          \n                Fairly Legal\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Shahs of Sunset' Star Mercedes Javid Files to Divorce Husband Tommy Feight",
      "image": [
        "https://imagez.tmz.com/image/25/16by9/2025/10/20/2511b0abcf5a448eb828e10822a464dc_xl.jpg"
      ],
      "datePublished": "2025-10-20T19:01:01.000Z",
      "dateModified": "2025-10-20T19:01:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Candice Swanepoel Hot Shots To Celebrate Her 37th Birthday!",
    "url": "https://www.tmz.com/2025/10/20/candice-swanepoel-hot-shots-to-celebrate-her-37th-birthday/",
    "image": "https://imagez.tmz.com/image/22/16by9/2025/10/20/22aaa7ce740a47a1bde2de4cdc9cea6f_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-20T15:45:21.000Z",
    "description": "\n    \n                    \n                          Candice Swanepoel\n                          Tropic of Bday ...\n                          Hottest ",
    "body": "\n    \n                    \n                          Candice Swanepoel\n                          Tropic of Bday ...\n                          Hottest Shots For 37th!!!\n                      \n                  \n                        Published October 20, 2025 8:45 AM PDT\n                                                                      |\n                Updated October 20, 2025 10:26 AM PDT\n                                    \n      \n    \n          Candice Swanepoel's celebrating another year around the sun ... and, she's just as hot as that star in this gallery we've put together to honor her 37th!\n      \n    \n          The model and Tropic of C founder is used to catching her fair share of rays ... consistently stripping down to just a bikini and tanning on beaches all over the world.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Just check out this pic of Swanepoel in a tiny blue swimsuit ... sipping on a bright pink drink in her infinity pool. What a view -- and, we don't just mean the ocean in the background!\n      \n\n                  \n          \n                          \n                \n                                  \n      \n    \n          Or check out this pic of Candice on the sandy white beaches bundled up in a sweater ... well, sorta bundled up -- she's still wearing a pair of barely-there bikini bottoms in this snap.\n      \n    \n          BTW ... Swanepoel's getting a ton of love online from her celebrity friends -- reposting many of their tributes to her own Instagram story for her birthday. Head over to her IG to check them out before they're gone!\n      \n    \n          Happy birthday, Candice ... you're still living up to the \"Angel\" part of \"Victoria's Secret Angel!!!\"\n      \n      \n              \n          \n                          \n                Candice Swanepoel\n              \n                          \n                Hotties & Bodies\n              \n                          \n                Hot Bodies\n              \n                          \n                Birthdays\n              \n                          \n                Photo Galleries\n              \n                          \n                Models\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Candice Swanepoel Hot Shots To Celebrate Her 37th Birthday!",
      "image": [
        "https://imagez.tmz.com/image/22/16by9/2025/10/20/22aaa7ce740a47a1bde2de4cdc9cea6f_xl.jpg"
      ],
      "datePublished": "2025-10-20T15:45:21.000Z",
      "dateModified": "2025-10-20T15:45:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Harvey Levin Launches Political Movement 'OWTA' to Hold Congress Accountable",
    "url": "https://www.tmz.com/2025/10/20/harvey-levin-owta-political-movement/",
    "image": "https://imagez.tmz.com/image/3c/16by9/2025/10/20/3c3e8c856b3846a0a505cbad08fa48a8_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-20T17:50:55.000Z",
    "description": "\n    \n                    \n                          Harvey Levin\n                          Tell Congress to End Shutdown or It's Out With Their Asses",
    "body": "\n    \n                    \n                          Harvey Levin\n                          Tell Congress to End Shutdown or It's Out With Their Asses!!!\n                      \n                  \n                        Published October 20, 2025 10:50 AM PDT\n                                                                            \n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          Harvey Levin, like millions of Americans, is sick of the government shutdown, and, he wants help issuing an ultimatum to EVERY member of Congress -- end the shutdown this week or face primary challenges in next year's midterm elections.\n      \n    \n          The founder and executive producer of TMZ called for our whole office's attention during Monday's TMZ Livestream to announce a new movement called \"OWTA\" -- which stands for \"Out With Their Asses.\"\n      \n    \n          HL says he's done with gridlock in Washington, especially because of the ongoing government shutdown ... and, he wants to hold politicians to account. Basically, calling on voters to support non-incumbents in next year's election cycle to force pols on both sides to the table.\n      \n\n          To be clear, Harvey isn't blaming Dems or the GOP for the shutdown ... he's blaming everyone, and he wants to unite voters from all across the political spectrum to demand better from their leaders. Levin's even set a deadline -- fix the shutdown by Friday or else!\n      \n    \n          We've gotta be honest ... 'OWTA' didn't take off in our office, it was a bit early for organized group chanting -- but, we wanna know what you think. Are you ready to change Washington forever, or are you happy with the way you're being represented on Capitol Hill? Vote below!\n      \n      \n              \n          \n                          \n                Politix\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Harvey Levin Launches Political Movement 'OWTA' to Hold Congress Accountable",
      "image": [
        "https://imagez.tmz.com/image/3c/16by9/2025/10/20/3c3e8c856b3846a0a505cbad08fa48a8_xl.jpg"
      ],
      "datePublished": "2025-10-20T17:50:55.000Z",
      "dateModified": "2025-10-20T17:50:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Aussie Food Influencer Stacey Hatfield Dies After Home Birth Goes Wrong",
    "url": "https://www.tmz.com/2025/10/20/stacey-hatfield-dead/",
    "image": "https://imagez.tmz.com/image/af/16by9/2025/10/20/af194da9de154038baecf0c0df0a5bc7_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-20T14:19:26.000Z",
    "description": "\n    \n                    \n                          Aussie food influencer\n                          Stacey Hatfield Dies After Home Birth Goes Terri",
    "body": "\n    \n                    \n                          Aussie food influencer\n                          Stacey Hatfield Dies After Home Birth Goes Terribly Wrong\n                      \n                  \n                        Published October 20, 2025 7:19 AM PDT\n                                                                      |\n                Updated October 20, 2025 11:34 AM PDT\n                                    \n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Aussie food influencer Stacey Hatfield’s home birth turned tragic -- she lost her life after a rare, devastating complication.\n      \n    \n          Stacey's husband, Nathan Warnecke, broke the heartbreaking news on IG Sunday -- revealing she passed on Sept. 29 while giving birth to their first child, Axel ... who thankfully made it.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Nathan said Stacey was rushed to the hospital, and while the staff did everything they could, she sadly passed.\n      \n\n          He went on with a long tribute, calling her his \"soulmate\" and \"best friend.\" He also shared how much she dreamed of being a mom ... saying it was her biggest goal in life, and she got to do it her way.\n      \n    \n          The Melbourne-based wellness influencer and nutritionist founded the healthy recipe site Natural Spoonfuls after dealing with her own health struggles.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          She was just 30.\n      \n    \n          RIP\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Social Media\n              \n                          \n                RIP\n              \n                          \n                Viral\n              \n                          \n                Fairly Legal\n              \n                          \n                Influencers\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Aussie Food Influencer Stacey Hatfield Dies After Home Birth Goes Wrong",
      "image": [
        "https://imagez.tmz.com/image/af/16by9/2025/10/20/af194da9de154038baecf0c0df0a5bc7_xl.jpg"
      ],
      "datePublished": "2025-10-20T14:19:26.000Z",
      "dateModified": "2025-10-20T14:19:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "TMZ Streaming Live, Come Into Our Newsroom and Watch Things Happen!",
    "url": "https://www.tmz.com/2025/10/20/watch-tmz-live-today/",
    "image": "https://imagez.tmz.com/image/b3/16by9/2025/10/20/b3810bce78764c9d99072e881b44a256_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-20T16:32:46.000Z",
    "description": "\n    \n                    \n                          TMZ Live Stream\n                          Come Into Our Office and Watch News Happen!!!\n         ",
    "body": "\n    \n                    \n                          TMZ Live Stream\n                          Come Into Our Office and Watch News Happen!!!\n                      \n                  \n                        Published October 20, 2025 9:32 AM PDT\n                                                                      |\n                Updated October 20, 2025 12:05 PM PDT\n                                    \n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          We want you to be a part of TMZ, so every weekday, between 9:30 AM and 11:30 AM PT, we take you inside our newsroom via live stream.\n      \n    \n          You never know what you're gonna get ... a big story that breaks, an argument erupts in the room, or someone's just joking around.\n      \n    \n          Your comments are a big part of the stream, and the staff spends a lot of time speaking directly to you. Every day is different!\n      \n    \n          We also use our live stream to produce our \"TMZ Live\" TV show.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Live Stream\n              \n                          \n                TMZ Live\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "TMZ Streaming Live, Come Into Our Newsroom and Watch Things Happen!",
      "image": [
        "https://imagez.tmz.com/image/b3/16by9/2025/10/20/b3810bce78764c9d99072e881b44a256_xl.jpg"
      ],
      "datePublished": "2025-10-20T16:32:46.000Z",
      "dateModified": "2025-10-20T16:32:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]