[
  {
    "title": "‘Black Mirror’ Renewed for Season 8 at Netflix",
    "url": "https://variety.com/2026/tv/global/black-mirror-renewed-season-8-netflix-1236627181/",
    "image": "https://variety.com/wp-content/uploads/2025/08/BM7_USSCallister_Unit_02331_RT3-1.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-09T16:00:00.000Z",
    "description": "\n\t“Black Mirror” — the mind-bending Netflix anthology series that has worryingly predicted many of the technological developments currently plaguing m",
    "body": "\n\t“Black Mirror” — the mind-bending Netflix anthology series that has worryingly predicted many of the technological developments currently plaguing mankind — is coming back for more.\n\n\tCreator Charlie Brooker revealed in an interview with Netflix’s Tudum on Friday that the hit show is set to return for an eighth season on the streamer.\n\n\t“’Black Mirror’ will return, and hopefully it’ll be more ‘Black Mirror’ than ever,” he said. “Luckily it does have a future, so I can confirm that ‘Black Mirror’ will return, just in time for reality to catch up with it. So, that’s exciting. That chunk of my brain has already been activated and is whirring away.”\n\t\n\n\tThe reveal comes going into this weekend’s Golden Globes, where the show has its first nominations. Season 7 landed noms for best television limited series and anthology series or motion picture made for television, and Rashida Jones and Paul Giamatti both picked up nods for their performances in the episodes “Common People” and “Eulogy,” respectively. \n\n\n\tAsked about the process of putting the new season together, Brooker didn’t go into detail, but likened it to making an album. \n\n\t“It’s a useful thought experiment when approaching a new story,” he said. “I’ll often think of, ‘Well, what haven’t we done yet, and what tone am I looking for? … Where does this track come on the album, and what musical direction are we going to go into?’ We’ll find out. Very unlikely you’ll ever see a ‘Black Mirror’ hoedown.”\n\n\tSeason 7 of “Black Mirror,” released in April 2025, was praised for returning to its tech-focused and dystopian themes after the mixed reception of Season 6. Variety‘s review particularly raised the “USS Callister” sequel “Into Infinity” for pushing beyond the original premise of its predecessor.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Black Mirror’ Renewed for Season 8 at Netflix",
      "image": [
        "https://variety.com/wp-content/uploads/2025/08/BM7_USSCallister_Unit_02331_RT3-1.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-09T16:00:00.000Z",
      "dateModified": "2026-01-09T16:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ousted ‘The Traitors’ Contestant on Learning He’s ‘Not the Best Judge of Character’ and Watching Michael Rapaport Become the ‘Center of Attention’ (EXCLUSIVE)",
    "url": "https://variety.com/2026/tv/news/the-traitors-premiere-rob-cesternino-murder-michael-rapaport-1236626763/",
    "image": "https://variety.com/wp-content/uploads/2026/01/NUP_207869_-00828.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-09T16:00:00.000Z",
    "description": "\n\tSPOILER ALERT: This post contains spoilers from the first three episodes of “The Traitors” Season 4, now streaming on Peacock.\n\n\tIt’s been more than",
    "body": "\n\tSPOILER ALERT: This post contains spoilers from the first three episodes of “The Traitors” Season 4, now streaming on Peacock.\n\n\tIt’s been more than 20 years since Rob Cesternino played mind games on television, but on Thursday night, the “Survivor” star returned to competition on Season 4 of “The Traitors.” Unfortunately, his TV debut didn’t last long, since the Traitors decided to murder him second, after “Big Brother” favorite Ian Terry.\n\t\n\n\tThis season introduced a new twist to the game; Alan Cumming revealed to one player during the premiere that they would be a secret Traitor. Each night, that person would get to give the other Traitors a shortlist with options of who they could kill. During the second episode, Traitors Lisa Rinna, Candiace Dillard and Rob Rauches were given a chance to find out the secret Traitor’s identity. To do so, they had to successfully commit a murder in plain sight; the Traitors had to obtain a stack of tarot cards from the kitchen, with each card representing a player. They must then choose who to murder and burn that card.\n\n\n\tCandiace chose to start a conga line to distract the rest of the cast while Rob R. snuck in and grabbed the cards, sharing them with Rinna. Together, they chose Rob C. and burned the card, without telling Candiace. She was thrilled, however, when she found out, because shortly after the conga line ended, Rob C. told her that he had a feeling the Traitors were doing a killing in plain sight. The Traitors didn’t have the chance to come face to face with the secret Traitor, because it was instead revealed during the banishing that night: Donna Kelce was the secret Traitor — and the house called her on it, sending her home.\n\t\n\n\tRob C. has been part of the reality world for quite some time; he first appeared on “Survivor: The Amazon” in 2003, coming in third place. He returned the following year for “Survivor: All Stars,” but was voted out third. While he’s never won the game, he’s known as one of the best gamers ever to play — and has since made a lucrative career out of his adoration of reality television.\n\n\tIn 2010, Cesternino launched “Rob Has a Podcast,” also known as RHAP, a platform that recaps and analyzes reality TV — specifically, “Survivor,” “Big Brother” and “The Amazing Race.” The network began as recaps, but grew to also begin featuring commentary, interviews and community events for all sorts of reality TV loyalists. Later this year, he’ll release a book about “Survivor,” titled “The Tribe Has Spoken,” which he delves into below.\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tEuan Cherry/PEACOCK\n\t\n\n\n\n\tHere, Cesternino talks about his surprise over being murdered, not banished; what he learned from his “Traitors” experience — and whether this means more reality TV appearances are in his future.\n\t\n\t\tYou’re known for being a great gamer. Did you worry you’d have a target on you from the start?\t\n\n\tI was very concerned that I was going to be banished. I was really worried after Boston Rob came and played such a great game in Season 3. I felt like people would look at me and my background from “Survivor” and from podcasting, and say, “I don’t trust him,” and they would want to banish me right out of the gate. I really was very worried about that. I guess I was pleasantly surprised that people did not seem to be too suspicious of me… except for the Traitors. Everyone else, I think, liked me!\n\t\n\t\tWhen did you find out who the Traitors were, and how did you react?\t\n\n\tAfter you’re out of the game, you are told by the producers who the Traitors are, and maybe they’ll show that at some point. I was surprised who the Traitors were. I definitely thought it was a Housewife, but I thought it was Dorinda Medley. It made so much sense for her to come back and make her a Traitor, and she was so calm. Dorinda is super Zen now! Since when? She was so different than last season, so I really thought she was so calm and collected now because she is a Traitor.\n\t\n\t\tI was going to say, you shouldn’t have said there was a murder happening in plain sight in front of Candiace. But ultimately, it didn’t even matter because she didn’t even get to tell her fellow Traitors. They murdered you anyway!\t\n\n\tI am glad that I did say it to Candiace, so at least I could put a little fear in her — that she would know what it was like to be on the receiving end of being under threat. But yeah, that was a big surprise to me. I had a good relationship with Candiace, and I felt like, “Here’s one of my friends, I’ve gotta warn my friends about what’s going on.”\n\t\n\t\n\t\tDid you make many alliances while there?\t\n\n\tI felt very close to Tiffany Mitchell from “Big Brother,” and I felt like she was another smart, social player that I really could have worked with. I also felt very close to Monét X Change, who was in my car to start with. Monét was another person I really had a lot of trust in. I felt like Monét was definitely a Faithful.\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tEuan Cherry/Peacock\n\t\n\n\n\t\n\t\tTalking about the cast, I was shocked that Michael Rapaport was cast, and he may be the most annoying person to play the game. How was it in the house with him?\t\n\n\tListen, does Michael Rapaport know how to get screen time, though?\n\t\n\t\tI mean, I guess that’s true.\t\n\n\tTo me, I thought that Michael Rapaport was such an interesting obstacle. Everything else aside, he was such a center of attention. I felt instantly that there’s no way Michael Rapaport is a Traitor. No Traitor would ever act like this. And I had separate conversations with Lisa, Candiace and even Rob. I said to Lisa, “You know him. He’s around all the Bravo stuff. Is he like this?” And she said, “He’s a very good actor.” I said, “Is he a 24/7, method actor, Lisa?!” I think the Traitors were really trying to push very hard that Michael Rapaport is a Traitor, and I think it ultimately didn’t help me that I was very vocal, saying Michael Rapaport is not a Traitor, but I said he needed to go because I felt that he was a big problem in terms of helping the Faithful. He was always going to be a distraction.\n\t\n\t\tCompletely. I was shocked he was still there three episodes in.\t\n\n\tBut the Traitors like having that kind of distraction!\n\t\n\t\tWhat did you learn during your time on “The Traitors”?\t\n\n\tI learned so much about myself throughout this whole process. I think that what I learned is that I am not necessarily the best judge of character, but I am a good judge of people’s actions. I should pay a little bit more attention to what people are doing, because unfortunately and fortunately, I like almost everybody that I meet. I really am a very trusting person, and I think I just need to be a little bit more perceptive about some of the people that I meet.\n\t\n\t\tWho do you think is playing the best game so far?\t\n\n\tI was really impressed with all of the Traitors on our season. A lot of times, they have a Traitor who’s a real wild card; you’ll see the other two Traitors asking how they’re going to deal with that person. I don’t know if they thought maybe Lisa or Candiace or Rob was going to be a wild card, but I’ve been really proud of them in terms of just how well they’ve worked together. They’ve been playing really, really smart, and I’m waiting to see if the Faithful can counterpunch.\n\t\n\t\n\t\tSo true! So, you’ve done two seasons of “Survivor” but also have an encyclopedia of knowledge in gaming. How did this game compare to “Survivor”?\t\n\n\tThis was so fun. I’ve spent my entire career talking about “Survivor,” and that is its own animal, but “The Traitors” is just such a phenomenon. I was just so appreciative that I got the chance to go and participate in this wild murder mystery that is so exciting to watch, and I get to be a part of that world too, and now actually have a little bit more of a sense of how it all works to podcast about it. So it was just such a treat for me.\n\n\tI think “Survivor” is harder in terms of just the physicality. However, it’s a real mind F-, “The Traitors.” So ultimately, I did not get to experience where “Traitors” gets really hard, and there are real betrayals that go on in every season of the show.\n\t\n\t\tI have to ask about your upcoming book, “The Tribe Has Spoken,” about “Survivor.” Why did you want to dive into this now? \t\n\n\tSo, 25 years of “Survivor,” it felt like the right time. I’ve had this really interesting ride with the show where I was a huge super fan, and then I was a player, and then I became this podcaster who has really been there for like 60% of the show’s history now at this point. I don’t think anybody has ever told the story of “Survivor” as it has gone through its own evolution, from where we started in Borneo in the year 2000 to where we are in the new era and what they’re doing in “Survivor” 50. And I just thought that it was going to be super fun for a “Survivor” fan to go back with me through that journey, from where it started, from where I started, cataloging all of the great historical moments and all of the iconic players that are almost sort of like Greek gods, in terms of the mythology of “Survivor.” It’s just a real treasure trove of all the “Survivor” information that I have, and I wanted to put it on paper for people.\n\t\n\t\tSo, as someone who has watched from the beginning, we’ll get to celebrate the show?\t\n\n\tThis is a love letter to “Survivor,” and it’s really a show that changed my life in so many ways — to go from  an unemployed college student who discovered this thing in 2000 and really every good thing to come into my life, including “The Traitors,” was part of “Survivor” taking me in. I’ve always just been so in love with all of these shows and these formats, and I’m always very excited to talk about how passionate I am about these things.\n\t\n\t\n\t\tHow do you feel about “Survivor” 50 coming up?\t\n\n\tHow could you not be excited about “Survivor” 50 and all of the spectacle that’s going to be around? And they took some big swings, they took some wild swings, and we’ll see how they’re going to turn out. Most of the “Survivor” fans that I’ve talked to are very excited about the legends that are coming back and the chance to see some of these old-school players come back onto their screens. It’s been so long since we’ve had returning players back on “Survivor,” so almost all the fans that I talked to are very excited, and if anything, they’re just nervous that they might screw it up.\n\t\n\t\tDo you want to dive into other shows — via podcasting about them or competing on them?\t\n\n\t“Big Brother” was where I started my journey; I applied to be on “Big Brother 3,” and did not get selected, and that’s how I got into the “Survivor” casting cycle. I think “Big Brother” is fun, but it’s so long. It’s a very long commitment. I’ll listen if the phone rings.\n\n\tThis interview has been edited and condensed.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ousted ‘The Traitors’ Contestant on Learning He’s ‘Not the Best Judge of Character’ and Watching Michael Rapaport Become the ‘Center of Attention’ (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/NUP_207869_-00828.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-09T16:00:00.000Z",
      "dateModified": "2026-01-09T16:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Britney Spears Says She ‘Will Never Perform in the U.S. Again’ Due to ‘Extremely Sensitive Reasons’",
    "url": "https://variety.com/2026/music/news/britney-spears-never-perform-in-us-again-1236627180/",
    "image": "https://variety.com/wp-content/uploads/2026/01/GettyImages-597561960-1.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-09T15:15:54.000Z",
    "description": "\n\tBritney Spears wrote in a lengthy Instagram post on Thursday night that she “will never perform in the U.S. again” for “extremely sensitive reasons.",
    "body": "\n\tBritney Spears wrote in a lengthy Instagram post on Thursday night that she “will never perform in the U.S. again” for “extremely sensitive reasons.” \n\n\tThe singer shared a throwback photo of herself sitting beside a white Yamaha piano, writing in the caption, “Sending this piano to my son this year!!! Interestingly enough, I dance on IG to heal things in my body that people have no idea about. Yup and it’s embarrassing sometimes… but I walked through the fire to save my life.” \n\t\n\n\tAlthough Spears ruled out any future performances in the U.S., she teased the possibility of performing in the U.K. and Australia, writing, “I will never perform in the U.S. again because of extremely sensitive reasons but I hope to be sitting on a stool with a red rose in my hair, in a bun, performing with my son… in the UK and AUSTRALIA very soon,” \n\n\n\tSpears continued, “He’s a huge star and I’m so humbled to be in his presence!!! God speed, little man!!!”\n\n\tSpears did not specify which son she was referring to in the post. She shares two children, Sean Preston and Jayden, with her ex-husband, Kevin Federline.\n\n\tSpears last performed live in the U.S. in October 2018, closing out her “Piece of Me” tour with a final show at the Formula One Grand Prix in Austin, Texas. She had been scheduled to return to Las Vegas in 2019 for a second residency, “Domination,” following the success of her first residency, “Britney Spears: Piece of Me,” which concluded in 2017. However, she ultimately postponed the “Domination” show and stepped away from performing indefinitely due to family matters.\n\t\n\n\t“I don’t even know where to start with this, because this is so tough for me to say. I will not be performing my new show Domination. I’ve been looking forward to this show and seeing all of you this year, so doing this breaks my heart,” she wrote on Instagram at the time. “However, it’s important to always put your family first… and that’s the decision I had to make.” \n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Britney Spears Says She ‘Will Never Perform in the U.S. Again’ Due to ‘Extremely Sensitive Reasons’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/GettyImages-597561960-1.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-09T15:15:54.000Z",
      "dateModified": "2026-01-09T15:15:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ariana Grande Champions Cynthia Erivo After ‘Wicked: For Good’ Awards Snubs: Her Elphaba ‘Will Be Adored for Generations. That Can’t Be Taken Away’",
    "url": "https://variety.com/2026/film/awards/ariana-grande-defends-cynthia-erivo-wicked-for-good-awards-snubs-1236626867/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Ariana-Grande-Variety-CNN-Actors-on-Actors_06003d.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-09T16:06:24.000Z",
    "description": "\n\tIf music is confession, then acting is reconciliation for Ariana Grande.\n\n\t“I really love the work,” Grande tells Variety. “I love getting to know t",
    "body": "\n\tIf music is confession, then acting is reconciliation for Ariana Grande.\n\n\t“I really love the work,” Grande tells Variety. “I love getting to know the little mental map of a person — what makes them tick, what triggers them. Even the things that never make it into the film.”\n\n\tSpeaking via Zoom from a sunlit room, the window light framing her like a natural spotlight, Grande radiates an ease that belies the gravity of what she is describing. She smiles often, her gratitude genuine and unguarded, even as she navigates questions about the skepticism she has often faced and the struggle to prove herself worthy of a space she has occupied since childhood. Now, she’s an Academy Award nominee for her revelatory work as Glinda in “Wicked” (2024) — and is once again in the awards hunt for its sequel, “Wicked: For Good.”\n\t\n\n\tThe demands of the role arrived at a moment when Grande was already accustomed to being watched — and judged — from every angle. But acting, she insists, offers a fundamentally different kind of exposure than music. “Music is very self-focused. It’s confession,” she says. “Acting is confession through a character. You’re still using your heart and soul, but you’re honoring someone else’s story. There’s a layer of protection there.”\n\n\n\tIn “Wicked: For Good,” that interior labor is everything. Grande’s Glinda is bright and buoyant on the surface, but threaded with an underlying doubt and insecurity about her overhyped magical abilities. It is a performance that demands agility — emotional, musical and psychic — often within the same breath. “Every single day was a big day,” she says. “A lot of days, we were shooting two movies in one.”\n\t\n\n\tThe distinction between her two artistic lives matters profoundly to Grande. Music, she explains, is intimate and self-directed, inseparable from her own lived experience. Acting, by contrast, requires surrender. “It’s an amazing experience to be able to jump into somebody else and tell someone else’s story,” she says. “To take yourself out of it, to be part of an ensemble — a small piece of a massive puzzle with hundreds and thousands of creative hands — that’s a beautiful thing.”\n\n\n\n\t\n\n\t\t\t\t\tAriana Granda is Glinda in WICKED FOR GOOD, directed by Jon M. Chu.\n\t\t\t\t\t\t\t\t\tUniversal Pictures\n\t\n\n\n\n\tFrom the moment her casting was announced, Grande faced a familiar chorus of dismissal — the suggestion that celebrity precluded seriousness, that success in one medium somehow disqualified legitimacy in another. It is a narrative she has learned to keep at arm’s length, constructing a protective distance between her work and the noise surrounding it.\n\n\t“I learned very quickly that I was going to have to shut it out,” she says. “There was a lot of noise saying I couldn’t handle it, or that I wasn’t the right choice. But I had a job to do — a really big one. I had earned it, and I needed to give it my entire life and my being.”\n\n\tShe did. The shoot was relentless, with emotional scenes filmed out of sequence, often back-to-back. “Those days we would go home feeling like husks,” Grande recalls. “You rehearse, you prepare, you live with these characters. But when the camera’s rolling, you can’t expect anything. It has to hurt the same every time.”\n\n\tWhat sustained her were the quiet hours — late-night car rides through London, calling her mother, replaying the day’s work in the dark. “Those moments felt sacred,” she says. “Just being proud of myself in the quiet.”\n\n\tThat pride is not performative. It is private, hard-earned and fiercely protected. “It can be very hurtful when people question your commitment,” Grande admits. “So I focus on what’s real. The love I feel. The people I meet. Gratitude is the only thing that reframes it all.”\n\n\tNow, as “Wicked: For Good” carries her deeper into the awards conversation — most recently with her second consecutive nomination at the Actor Awards — Grande finds herself falling further in love with acting. She is clear-eyed about what comes next. Music will return — eventually. Acting, however, is no longer something she’ll visit between albums.\n\t\n\n\t“I love actors,” she says. “I love talking about acting. I love learning how my process changes. I’ll never take that for granted.”\n\n\tAnd yes, she adds with a smile, there is another role ahead — one she is “very excited about.”\n\n\t“More very soon,” she promises.\n\n\n\n\t\n\n\t\t\t\t\tAriana Grande sings ‘The Girl in the Bubble’ in ‘Wicked: For Good’\n\t\t\t\t\t\t\t\t\tUniversal Pictures\n\t\n\n\n\n\tRead excerpts from her interview below, which has been edited and condensed for clarity.\n\t\n\t\tYou’ve said repeatedly that acting feels like coming home. What is it about acting that feeds you in a way nothing else does?\t\n\n\tI think it’s an amazing experience to be able to step into somebody else and tell someone else’s story. With music, it’s very self-focused and deeply personal — it’s your own experiences, your own pain and joy. Acting is different. The work is about serving another story, taking yourself out of it and being part of an ensemble. You’re a small piece of a much larger puzzle, with hundreds or thousands of creative hands working together. That’s a beautiful thing. I really missed that.\n\t\n\t\tWhat part of the acting process do you love most? Is it the preparation, the rehearsal, or just being on set?\t\n\n\tI really love being on set, but I also love the rehearsal process just as much. I think I love and find both to be just as enjoyable, because I love doing the work. I love the phase of the early days of getting to know the character and figure out who they are and what makes them tick and what triggers them, finding little pieces of information that matter to you as the actor that you can use and experience on set that don’t even matter for the film, but that you can pull on and draw from for your own experience. I really love getting to know the little mental map of the person — that’s really fun. But also being on set, I’m present and I enjoy all parts. I do. \n\t\n\t\tWhat surprised you most about yourself once you found yourself really committed to acting again?\t\n\n\tEvery time something goes well — even if you’ve prepared for it for years — there’s always that rush of relief and gratitude afterward. You think, “Oh my goodness, OK, we did it.” You call your acting coach or your mom and say, “We did it.”\n\n\tWith “Wicked,” that feeling happened constantly. Cynthia and I joke about it, but it’s true — every single day was a big day. We started with “Popular” and “What Is This Feeling?” and then jumped straight into “Defying Gravity.” Before lunch, I’d be in the attic at the beginning of the number, and after lunch I’d be singing the finale alone. It was nonstop mental hurdles. There was no time to process what had happened the day before — or even earlier that day — because we had such quick turnarounds. It was very much blinders on, just staying in it. But whenever something landed, there was that overwhelming sense of relief.\n\t\n\t\n\t\tThe “For Good” number, particularly the “split door” frame is easily the single best acting work of your career. How did you get into that mindset, especially with such a fractured shooting schedule?\t\n\n\tThat’s why Glinda is such a gift to an actor. She requires everything. Even in the lighter, comedic moments, there’s someone deeply insecure underneath the surface. Across both films, there’s so much happening in her head at all times. Even when she’s using comedy to cover the fact that she’s breaking — especially in front of Elphaba — both things are always present. It’s a lot, but that’s why I love her. It was such a privilege to play her.\n\n\tOn days like that, you just have to be present. Cynthia and I have very different processes, and we’re very different as people and as actors. That day was about finding a balance — giving each other space when needed and then coming together at the end with a hug, holding hands. Those days were emotionally exhausting. You’re doing the scene all day, across different angles, different sizes, different coverage, and it all has to connect.\n\n\tThe hardest but most rewarding part is resetting every time. Even though you rehearse and live with these characters, you can’t anticipate the moment. It has to hurt the same way every time and feel just as real. We would go home feeling like husks.\n\t\n\t\tDo you get frustrated by the perception that you’re not fully committed to acting, especially after giving so much to scenes like that?\t\n\n\tI try really hard to maintain distance from that so I don’t get hurt anymore. I learned quickly that I had to do that from the moment I was cast. There was a lot of noise saying I couldn’t handle it or wasn’t the right choice. But I had a job to do — a really big one — and I needed to shut everything else out and focus on what was real. I had earned the role, and I needed to give it my entire being.\n\n\tI’m proud knowing that’s what I did. I’m a very committed artist, and it can be hurtful when that’s questioned. So I protect myself by focusing on the love and support that’s louder and more real. I have real interactions with people — moments that make me cry, stories that stay with me. I don’t take that for granted. I’m proud of the work I do and the artist I am. But yes — sometimes it’s hard.\n\t\n\t\n\t\tDo you feel less judged when you’re inhabiting a role or when you’re being yourself?\t\n\n\tIt’s present either way. It feels pretty consistent no matter what.\n\t\n\t\tIf music is confession for you, then what is acting?\t\n\n\tIt’s confession through a character. You’re still accessing parts of yourself, but you’re using someone else as the vessel. There’s a layer of protection — a kind of coding that says, “This isn’t my story.” But it is you doing the work. You’re still crying the tears, feeling the feelings, laughing the laughs. It’s still your heart and soul at play — just in service of someone else’s story. And in doing that, you learn so much about yourself.\n\t\n\t\tDo you feel like you’ve given yourself permission to be taken seriously as an actor?\t\n\n\tThat idea of permission is really interesting. I’m so grateful to have earned the role, and I think that was the beginning of it. My early lessons with Nancy Banks — when she believed in me and told me I was doing beautiful work — mattered so much. Sometimes it’s easier to hear that from someone you respect deeply, like her or John Chu. It takes time to sink in, but I do feel like I’ve given myself permission. As for the rest of the world, I try to focus on the work.\n\t\n\t\tYou’re now an Academy Award nominee Ariana Grande. A moniker that can never be taken away from you. What does that recognition mean to you?\t\n\n\tIt’s incredibly surreal. It still doesn’t feel real. It feels like the warmest welcome into a community I truly love. I love acting. I love actors. I love talking about acting and learning about other people’s processes — and my own. It’s life-changing, and I’ll never take it for granted.\n\t\n\t\tCynthia Erivo wasn’t nominated by SAG, and Jon Chu wasn’t nominated by the DGA. What are your thoughts on those omissions?\t\n\n\tThere aren’t enough flowers on this earth for Jon M. Chu. He’s an extraordinary human being and director. This film will be watched for decades to come. He set out to move people, to challenge them, to make them better allies and better humans — and he succeeded.\n\n\tThe impact of his work and Cynthia’s Elphaba is undeniable. Cynthia’s performance is the most truthful, vulnerable and fierce Elphaba we’ve seen, and it will be referenced and adored for generations. That can’t be taken away.\n\t\n\n\tThat’s why I say every good thing that happens to me belongs to them, too. None of this exists in isolation. We informed each other every single day. Of course, it’s hard — they deserve all the flowers this world can grow.\n\t\n\t\tWhat do you hope audiences say about you five years from now?\t\n\n\tI want to challenge myself and take on roles that exercise different muscles and ask something new of me. I try to stay present rather than thinking too far ahead, but I hope we’ve had many more conversations like this — about projects that are unique, surprising and meaningful. I’m drawn to things that feel different.\n\t\n\t\tI’m contractually obligated by the “Arianators” to ask about your upcoming music tour. Should fans expect new music before then?\t\n\n\tNo — definitely not. Nothing is coming before May. I love them so much, but sometimes I want to ask, “Do you think there’s another version of me out there who had time to write an album?” Not yet — but soon enough.\n\t\n\t\tYou have “American Horror Story” and “Meet the Fockers” coming. Is there anything else you can tease?\t\n\n\tThere is something else I’m very excited about down the line. I can’t say much yet, but it’s something that inspires me deeply. It contains multitudes. I promise I’ll DM you the day it’s announced.\n\t\n\t\tWhat has been the hardest but most meaningful moment of being an actor so far?\t\n\n\tMy mind immediately goes to being on set — the days that required the most challenging work of my career, all of which were on these films. Going home in a quiet car through pitch-black London, knowing I’d be back before sunrise — those moments were sacred. Just sitting with the work, feeling proud, calling my mom to tell her how it went. I’ll never forget those rides home. Being there and doing the work meant everything to me.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ariana Grande Champions Cynthia Erivo After ‘Wicked: For Good’ Awards Snubs: Her Elphaba ‘Will Be Adored for Generations. That Can’t Be Taken Away’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Ariana-Grande-Variety-CNN-Actors-on-Actors_06003d.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-09T16:06:24.000Z",
      "dateModified": "2026-01-09T16:06:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Polymarket Pacts With Golden Globes for Predictions",
    "url": "https://variety.com/2026/film/news/polymarket-golden-globes-prediction-market-partner-1236627204/",
    "image": "https://variety.com/wp-content/uploads/2021/05/Golden-Globes-Placeholder-6.jpg?w=1000&h=562&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-09T16:00:00.000Z",
    "description": "\n\tPolymarket, the world’s largest prediction market, has set an innovative partnership with the Golden Globes to become the exclusive prediction marke",
    "body": "\n\tPolymarket, the world’s largest prediction market, has set an innovative partnership with the Golden Globes to become the exclusive prediction market partner of the annual awards show. \n\n\tThe pact promises to up the ante on the Globes outcomes for users of Polymarket, which has skyrocketed since its launch in 2020 and become a key source of tapping into public sentiment on topics ranging from politics and elections to sports to pop culture trends. The partnership with the Globes will bring real-time insights into awards outcomes across the Golden Globes’ live events, based on the sentiments of millions of users around the world.\n\t\n\n\t“The Golden Globes have long been a place where audiences debate and predict what will happen next,” said Shayne Coplan, founder and CEO of Polymarket. “Polymarket reflects those expectations through markets spanning entertainment and culture, and this partnership brings that perspective directly into one of awards season’s biggest moments. By pairing cultural debate with market-based probabilities, we’re giving fans a new, more interactive way to follow the show as it unfolds.”\n\n\n\tAs part of the partnership, Polymarket will provide integrated branding and real-time stats and percentage-based predictions on the Globes competition at the official 2026 Golden Globes viewing party. The pact also calls for digital integration of Polymarket modules during the span of the Globes into key brands across PMC, which is the parent company of the Globes and of Variety.\n\n\t“Our partnership with Polymarket unlocks a groundbreaking new frontier, redefining how audiences engage with and connect to the content they love,” said Craig Perreault, President, Penske Media Corporation. “Deepening the connection between fans and their favorite films, shows, and actors strengthens the entertainment industry and highlights the award-winning content celebrated at the Golden Globes.”\n\t\n\n\tPolymarket operates similar to fantasy sports services in allowing users to make predictions and win cash prizes on an odds basis if their predictions are correct. Polymarket blends blockchain technology with fan communities in a format that has drawn users around the world and made the company an influence player in business, politics and pop culture.\n\n\tThe 2026 Golden Globes will air live on Sunday from 8-11 p.m. ET on CBS and stream on Paramount+ in the U.S., now with Polymarket insights featured across the broader Golden Globes ecosystem. Nikki Glaser returns to host for the second year in a row.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Polymarket Pacts With Golden Globes for Predictions",
      "image": [
        "https://variety.com/wp-content/uploads/2021/05/Golden-Globes-Placeholder-6.jpg?w=1000&h=562&crop=1"
      ],
      "datePublished": "2026-01-09T16:00:00.000Z",
      "dateModified": "2026-01-09T16:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Primate’ Review: A Pet Chimp Goes Ape in the First Simian-Next-Door Slasher Movie. It Gets Two-and-a-Half Bananas",
    "url": "https://variety.com/2026/film/reviews/primate-review-a-pet-chimp-goes-ape-1236626805/",
    "image": "https://variety.com/wp-content/uploads/2026/01/PRIMATE_02736R2.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-09T15:18:14.000Z",
    "description": "\n\t“Primate,” which is your basic, everyday chimp-goes-ape slasher movie, opens with a solemn title informing us that the first recorded case of “hydro",
    "body": "\n\t“Primate,” which is your basic, everyday chimp-goes-ape slasher movie, opens with a solemn title informing us that the first recorded case of “hydrophobia” (“fear of water”) was in 2300 BC. It then drops the bomb that hydrophobia is now referred to as rabies. All very ominous, though this little science lesson is largely piffle, since it comes close to suggesting that rabies is a psychological malady. (Rabies victims do have hydrophobia, but it’s not as if that’s what rabies is. It’s a viral disease.) At this point, you may be poised to giggle, and that’s a good place to start as you watch “Primate,” since the movie is funny as only a bloody disgusting formulaic-but-halfway-clever slasher film can be. In this case, we’re chortling at the sheer damage a chimpanzee that has given in to its inner beast can cause.\n\t\n\n\tIt’s a trash premise, but the film’s director, Johannes Roberts (“47 Meters Down”), does something shrewd. He makes the chimp “real” rather than just another over-the-top fantasy-thriller monster. “Primate” is set almost entirely in a palatial cliffside home in Hawaii that’s perched at the secluded edge of a woods. Lucy (Johnny Sequoyah), who’s in college, is the main character (in essence, the final girl), who returns home to visit her teenage sister, Erin (Gia Hunter), and their celebrated crime-fiction author dad, Adam, who is deaf (he’s played by Troy Kotsur, the magnetic actor from “Coda”). The girls’ mother has recently died of cancer, but it’s a mostly warm and happy reunion, the other member of the family being Ben, their pet chimp, who was brought home by mom as part of a linguistics experiment.\n\t\n\n\tFor a while, Ben wanders around in a red shirt, clutching a teddy bear, cutely communicating with words he punches into a vocal digital keypad (“Lucy back. Ben missed”). It turns out, though, that he’s been bitten by a mongoose with the rabies virus, and it doesn’t take long for him to devolve into a murderous simian. (The movie should have taken a bit more time with it, actually.) He traps Lucy and Erin and two friends in the swimming pool at the bottom of the house. They’re safe in the water, but they can’t get out. Ben moves too fast, and as soon as he takes a major chomp out of Erin’s leg, the movie is off and running.\n\n\tIs “Primate” a slickly executed piece of slaughterhouse shlock? Very much so. Yet Ben, as a slasher, represents a minor triumph of practical effects (he’s played by Miguel Torres Umba in an ape suit). His chimp grin that turns into a gnashing leer makes him as effective a figure of fear as most masked killers. And part of the grisly semi-comedy of it all is that he’s not evil, no more so than the shark in “Jaws” or the rabid St. Bernard in “Cujo” (which Roberts has cited as his key inspiration). What we want from this movie, and what “Primate” delivers, is mayhem staged with a creative appreciation for what a chimp who’s been stripped down to his id can do.\n\n\tThe entire movie might be a riff on the TV-chimp-goes-wild chapter of Jordan Peele’s “Nope,” a film that left most of that horror to the imagination. “Primate” leaves nothing to the imagination, as Ben bites, mauls, scratches, tears someone’s face off, and, in the film’s pièce de résistance, gives one of the entitled bros Lucy met on the plane just what’s coming to him, tearing off his jaw with terrifying alacrity. Maybe because the chimpanzee is our closest and most highly developed animal relative, it’s a kick to be reminded of how strong they are — not because they’re made of muscle, but because those ape fingers are wired with the will of the jungle. Early on, Lucy and the others look like they might be characters of interest (there are a few playful scenes between Kotsur’s Adam and his daughters), but “Primate” ends up reducing its humans to meat in bathing suits. It’s part of the exploitation wink of it all, as is Ben’s way of poking out of the shadows, which he always does at just the right moment to make a monkey out of us.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Primate’ Review: A Pet Chimp Goes Ape in the First Simian-Next-Door Slasher Movie. It Gets Two-and-a-Half Bananas",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/PRIMATE_02736R2.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-09T15:18:14.000Z",
      "dateModified": "2026-01-09T15:18:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jafar Panahi on Why Trump’s Intervention Is Not Needed in Iran and Wanting to Return Despite Upcoming Trial: ‘It Doesn’t Matter What Will Happen to Me … I Have to Go Back’",
    "url": "https://variety.com/2026/film/global/jafar-panahi-iran-doesnt-need-trump-upcoming-trial-1236627046/",
    "image": "https://variety.com/wp-content/uploads/2025/12/GettyImages-2242610505-e1764854456566.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-09T15:03:18.000Z",
    "description": "\n\tJafar Panahi thinks the new wave of protests challenging Iran‘s authoritarian regime might bring “something different” this time.\n\n\tThough the dissi",
    "body": "\n\tJafar Panahi thinks the new wave of protests challenging Iran‘s authoritarian regime might bring “something different” this time.\n\n\tThough the dissident director is currently in the U.S. to promote his Palme d’Or-winning film “It Was Just an Accident,” which is representing France in the Oscars international feature race, he’s watching the protests closely. Since beginning in late December, they have escalated across major cities in all of Iran’s 31 provinces and have resulted in the deaths of 28 protesters and bystanders between Dec. 31 and Jan. 3, according to Amnesty International.\n\t\n\n\tPanahi, who has frequently been arrested by Iranian authorities — most recently in July 2022 after signing an appeal against police violence that caused him to spend several months behind bars — is now even more confident that the regime in Iran will collapse. “No one can really predict how long it will take. It could be a year, a month, a week. But eventually they will fall,” he tells Variety over Zoom.\n\n\n\tThe outspoken auteur, considered one of Iranian cinema’s greatest living masters, is still in the crosshairs of the government known as the Islamic Republic of Iran. He was just sentenced in absentia to a one-year prison term and a two-year travel ban, accused of “propaganda activities” related to his politically-charged work.\n\n\t“It Was Just an Accident,” which marked his first film since his release from jail in Iran two years ago, follows a group of former prisoners who encounter a man they think could be the guard who tortured them. With the man held captive, they must decide whether or not to enact revenge. Though “It Was Just an Accident” marks Panahi’s biggest breakthrough so far on the global stage, he’s long been acclaimed for films that were surreptitiously shot after he was banned from making movies in 2010, including “The Circle,” “Offside,” “This Is Not a Film,” “Taxi” and “No Bears.”\n\t\n\n\tOn Wednesday, Panahi posted an appeal on his Instagram account with 184 signatories stating: “We will defend with all our strength the right to freedom of expression, we will condemn the repression and killing of protesting people and we will stand with the Iranian people.”\n\n\t“This isn’t just something that we decided last night,” he says, noting that the appeal had been gathering support for a week. “It’s a statement signed by 184 people in film circles. But it’s not just film people, it’s also athletes and prominent names in other guilds in Iran who believe that there should be a change.”\n\n\tBelow, Panahi speaks to Variety about why he thinks Iran is now truly on the brink of change and why his country does not need U.S. President Donald Trump to help usher in a new day.\n\t\n\t\tWhere are you? Will you be attending the Golden Globes?\t\n\n\tWe arrived in L.A. from Palm Springs last night, and before that we were in New York. Of course, because we are in L.A., we will be going. [Laughs] I guess I have to go to the Golden Globes.\n\t\n\t\tHow long have you been in the U.S. and how has this experience been for you?\t\n\n\tIt’s a new experience for me, because [in the past] the Academy rules did not allow for my films to be selected, since the rule was that you had to have your film shown in your home country [which Iran would never allow]. So if it weren’t for France selecting my film, this campaign may not have existed. Almost all the screenings that I’ve attended, the rooms were packed. And people stayed for the Q&As. This gave me great pleasure. Also in the U.S. — with the exception of Los Angeles, where there is a large Iranian population — in the other cities we went to, the audience was predominantly non-Iranian. This included New York, Chicago, Boston, Seattle and San Francisco.\n\t\n\t\tMeanwhile, a new wave of protests in Iran is once again challenging the country’s theocracy. You have posted on Instagram supporting the protests with statements such as: “When there is nothing left to lose, fear falls away. Voices unite. The silence is broken. There is no way back.” What is your state of mind, being away from your country while this is happening in Iran? \t\n\n\tThe last time there were mass protests I was in Iran, but I was also incarcerated. Back then I was in prison, and I did not have access to the news freely. It was very difficult for us to know what was going on. If anyone was able to receive a phone call from outside prison, then they would come and quickly give us an update. But other than that, I wasn’t witnessing things. Fate has it that again, this time, I am kind of away from what’s happening. But from the second day of these mass protests, I had a sense that it might be different this time. I also posted on my Instagram account on the fourth day that I think this is going to be something different.\n\t\n\n\tEven in the interviews that I gave at Cannes, I have said that, as far as I’m concerned, the regime is shattered. It has fallen already: politically, ideologically, economically and environmentally. From any aspect you can imagine, it’s fallen. It’s only a shell that is in existence. And only because it is using force. \n\t\n\t\tDo you think that now Iran is really on the brink of what Americans call “regime change”?\t\n\n\tWhen regimes such as Iran get to this point, no one can really predict how long it will take. It could be a year, a month, a week. But eventually they will fall. This is not something that I’m just sensing now. It’s something that’s also in my film: is the cycle of violence going to continue, or is it going to end? And are we, at some point, going to bring an end to it?\n\n\n\n\t\n\n\t\t\t\t\tPanahi behind the scenes of “It Was Just an Accident.”\n\t\t\t\t\t\t\t\t\tCourtesy Of Pelleas\n\t\n\n\n\t\n\t\tWhat is your reaction to Donald Trump saying, “I pray and hope that 2026 will be the year that we make Iran great again” and his pledge to strike Iran if protesters are killed, which they have been? Do you fear U.S. intervention in Iran?\t\n\n\tThis regime has fallen already. And, as I have said before, the people who are carrying out the protests in the streets, they want to make that happen. Of course, international support can make a difference. But until people themselves decide to do something or not, nothing is going to happen. Nothing is going to make any difference. It has to come within, from within the country, by the will of people. \n\t\n\t\tSo you do not feel the need for U.S. intervention in Iran. Correct?\t\n\n\tYou do not seem to understand. Let me say it again: Until people have the will to change something from within, nothing will be able to make that change. It has to be by the will of the people from within.\n\t\n\t\tDuring your trip to the U.S., you have been sentenced in absentia to a one-year prison term and a two-year travel ban for propaganda activities against the system. An appeal hearing was set for Jan. 4. Can you give me an update on how the trial is proceeding? \t\n\n\tI spoke with my lawyer yesterday. The court did meet and the lawyer said he must return to the court in a few days to ask for the results. So I don’t know yet what has been decided.\n\t\n\t\tDo you have any hope this trial could wind up with you actually not being condemned?\t\n\n\tThere is an expression among the prisoners in Iran regarding the word for appeal. The [Iranian] word for appeal means to review a decision. So prisoners, instead of saying “review the decision” they say “confirm the decision.” This is what “appeal” means in the Iranian judicial system. They usually confirm what they have ruled. \n\t\n\n\tThe Iranian judiciary is not independent. So when courts rule in political cases, it is never what the judge decides or finds relevant. It is instead what the judge has been dictated to do and what the interrogator says should be done. So now it only depends on which direction the state wants to take in the next round [of my trial] based on the unrest that’s happening now. If they want to work a bit more gently with the people, then they might change the sentence that way. If they want to make the situation worse, it might become harsher.\n\t\n\t\tYou have repeatedly stated your desire and resolution to return to Iran as soon as your activities related to the promotion of this film allow you to do that. But given the escalating violence against protesters and dissidents in your country, and also given the fact that you have been given a prison sentence, are you having second thoughts?\t\n\n\tThese developments make absolutely no difference in my decision. As I also said during my interviews in Cannes, it doesn’t matter what will happen to me as a result of this film: I have to go back to Iran. And I did go back to Iran [after Cannes]. I am the kind of person who needs to be in his country. I need to breathe there and work there. And even if they want to go ahead with that prison sentence, they can go ahead. Nothing will change my mind about going back.\n\n\tThe real question is: why wouldn’t we want to stay in Iran? Why should it be us, the people, leaving?Whereas it is the regime and its representatives that seem entitled to stay there. We are entitled to our own country. It’s the regime that has to leave and go. Because it has fallen.\n\n\tThis interview has been edited and condensed for clarity.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jafar Panahi on Why Trump’s Intervention Is Not Needed in Iran and Wanting to Return Despite Upcoming Trial: ‘It Doesn’t Matter What Will Happen to Me … I Have to Go Back’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/GettyImages-2242610505-e1764854456566.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-09T15:03:18.000Z",
      "dateModified": "2026-01-09T15:03:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘CBS Saturday Morning’ Taps Adriana Diaz, Kelly O’Grady as Co-Hosts",
    "url": "https://variety.com/2026/tv/news/adriana-diaz-kelly-ogrady-hosts-cbs-saturday-morning-1236627211/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Adriana-Diaz-Kelly-OGrady-CBS-Saturday-Morning.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-09T15:22:13.000Z",
    "description": "\n\tCBS News has picked its new two-person anchor team for “CBS Saturday Morning”: Adriana Diaz and Kelly O’Grady.\n\n\tOn Saturday, Jan. 10, Diaz and O’Gr",
    "body": "\n\tCBS News has picked its new two-person anchor team for “CBS Saturday Morning”: Adriana Diaz and Kelly O’Grady.\n\n\tOn Saturday, Jan. 10, Diaz and O’Grady will debut as co-hosts of “CBS Saturday Morning,” live from Studio 57 in the CBS Broadcast Center in New York City. The two-hour program airs from 7 to 9 a.m. ET on Saturdays. The two previous hosts of “CBS Saturday Morning” — Michelle Miler and Dana Jacobson — left CBS last year, prior to Bari Weiss’ arrival at CBS News.\n\t\n\n\tIn addition, Diaz and O’Grady will alternate weekday co-hosting duties on the CBS News 24/7 free streaming service’s “Mornings” (9-11 a.m. ET), alongside “CBS Mornings” featured host Vladimir Duthiers. Diaz will continue her role as a reporter across CBS News platforms, and O’Grady will continue covering business, technology and the economy.\n\n\n\t“CBS Saturday Morning,” produced by senior broadcast producer Tony Dipolvere, provides original reporting and a look at the week’s top stories. The show also is known for its signature segments The Dish and Saturday Sessions, offers conversations with top artists, authors, chefs and musicians.\n\n\t“We want our audience to walk away with a better understanding of the stories that are shaping their lives and the world around them,” said Shawna Thomas, executive producer of “CBS Mornings.” “Adriana and Kelly’s unique blend of experience will make that possible. We are excited for our viewers to start their weekends with them.”\n\n\tDiaz said, “SATMO’ is a true family that has always welcomed and given me incredible opportunities to tell in-depth stories. The show has a long history of phenomenal journalists who have led it, and I hope to honor that legacy alongside Kelly, who is a wonderful partner. I look forward to spending Saturday mornings together with our viewers!”\n\t\n\n\tO’Grady commented: “Helping people start their weekend in a thoughtful and uplifting way is a responsibility I deeply value – I’m thrilled to undertake that with Adriana. And at a time when economic issues are shaping people’s everyday decisions, I’m proud to continue my business reporting to help provide clarity and context when it matters most.”\n\n\tDiaz joined CBS News in 2012 and previously served as co-host of “CBS Mornings Plus,” anchor of the Saturday edition of the “CBS Weekend News,” CBS News’ Asia correspondent based in China and a Chicago-based correspondent. Diaz has interviewed newsmakers including former NFL star Colin Kaepernick, former Secretary of State Condoleezza Rice and Tom Hanks. Diaz speaks Spanish and advanced French and Mandarin. She studied public and international affairs at Princeton University and earned a dual master’s degree in public affairs and public administration from Columbia University and France’s Institut d’Etudes Politiques de Paris.\n\n\tO’Grady joined CBS News in 2024 as a MoneyWatch correspondent reporting on the latest financial news and economic trends. Previously, she was a correspondent and fill-in anchor at Fox Business Network, where she focused on business, markets and technology, leading coverage of major stories like Elon Musk’s Twitter takeover and the Sam Bankman-Fried crypto fraud trial. She started her career in the financial industry and earned both her MBA and undergraduate degrees from Harvard University.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘CBS Saturday Morning’ Taps Adriana Diaz, Kelly O’Grady as Co-Hosts",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Adriana-Diaz-Kelly-OGrady-CBS-Saturday-Morning.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-09T15:22:13.000Z",
      "dateModified": "2026-01-09T15:22:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Marion Cotillard, Jean Dujardin, Valerie Donzelli Lead Feature Slate for Auteur Comedy Outfit Ateliers de Production (EXCLUSIVE)",
    "url": "https://variety.com/2026/film/global/marion-cotillard-jean-dujardin-ateliers-de-production-1236627121/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Ateliers-de-Production.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-09T14:43:49.000Z",
    "description": "\n\tScreen icons Jean Dujardin and Valérie Donzelli are set to headline new features from Atelier de Production, the auteur-comedy-oriented outfit behin",
    "body": "\n\tScreen icons Jean Dujardin and Valérie Donzelli are set to headline new features from Atelier de Production, the auteur-comedy-oriented outfit behind this year’s Unifrance Rendezvous in Paris opener “Comédie Française,” and Bertrand Mandico’s upcoming “Roma Elastica,” starring Marion Cotillard and Noémie Merlant.\n\n\tDujardin will star opposite Julia Piaton in “Montagne Russe” (“Rollercoaster”), a mental health-inflected love story following a bipolar man learning to master his condition as he strives to move forward both emotionally and professionally. Primed to shoot in April, the film marks the third feature from director Cyril Gelblat and is co-written by Gelblat, Sarah Kaminsky, and Laetitia Colombani.\n\t\n\n\tDonzelli, meanwhile, will appear alongside André Dussollier (“Everything Went Fine”) and Kyan Khojandi (“Hot Ones”) in “Claude,” a family-reconciliation comedy about two middle-aged siblings forced to share custody of their newly single father. Written and directed by Clément Michel (“Haute Saison”), the film will shoot next month, with UGC Distribution handling French release and international sales. \n\n\n\tAtelier de Production chiefs Mathieu and Thomas Verhaeghe are also eyeing a major festival launch for Mandico’s “Roma Elastica,” a 1980s-set homage to Italian cinema following an actress — played by Cotillard — who travels to Rome to shoot her final film. The producers are positioning the project as a potential breakthrough for the cult director.\n\n\t“We deeply admire Bertrand’s work, but until now his films have reached critics more than audiences,” said producer Thomas Verhaeghe. “With ‘Roma Elastica,’ the idea was to move toward a more narrative-driven film that could speak to a wider public without sacrificing his style. The film is more accessible, yet fully retains his visual identity and cinematic language.”\n\t\n\n\tNow in post-production, the film promises a more expansive big-screen look, embracing 35mm in place of Mandico’s usual 16mm and favoring real locations over studio sets, including Cinecittà’s storied backlots and natural settings in Rome, Nice, Occitanie, and southern France. “The rushes are beautiful, and the actresses truly flourished on set,” Verhaeghe added. “So we’re very hopeful.”\n\n\n\n\t\n\n\t\t\t\t\t“Comedie Francaise” \n\t\n\n\n\n\tIndeed, 2026 is shaping up as a banner year for the Paris-based outfit, long known for nurturing offbeat auteurs such as Quentin Dupieux. \n\n\tAtelier de Production will premiere three striking titles in competition at this month’s Alpe d’Huez Film Festival — Europe’s largest event devoted exclusively to screen laughs — including the Unifrance Rendezvous opener “Comédie Française” (directed by Bertrand Usclat and Martin Darondeau), Patrick Cassir’s quirky parental-care rom-com “It’s All Good,” and the suburban farce “The Better Me,” which follows a bald man pushed to the brink by the arrival of a new neighbor — his doppelgänger, identical in every way except for a luxuriant head of hair. Laurent Lafitte pulls double duty opposite Blanche Gardin and Olga Kurylenko.\n\n\t“These aren’t ultra-mainstream studio comedies,” says Mathieu Verhaeghe. “Each has a twist — an original premise and a sensibility rooted in independent cinema. Even though we also make more mainstream films, this kind of auteur-driven comedy is really where our signature lies.” \n\n\tAt the same time, the producers have made notable inroads into the arthouse mainstream since partnering with Juliette Schrameck to launch the production outfit Lumen in 2024. Since then, the Verhaeghes have been involved in projects such as Caroline Poggi and Jonathan Vinel’s “Eat the Night,” László Nemes’ “Orphan,” and Joachim Trier’s “Sentimental Value” — all of which premiered in Venice or Cannes. Up next are Lukas Dhont’s Great War drama “Coward” and Laïla Marrakchi’s Atlas Workshop–acclaimed “La Mas Dulce,” both aiming for high-profile festival launches later this year.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Marion Cotillard, Jean Dujardin, Valerie Donzelli Lead Feature Slate for Auteur Comedy Outfit Ateliers de Production (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Ateliers-de-Production.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-09T14:43:49.000Z",
      "dateModified": "2026-01-09T14:43:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘The Night Manager’ Season 2 Director Georgi Banks-Davies on Bringing Tom Hiddleston Spy Thriller Into a ‘Post-Truth World’ and John le Carré Giving His ‘Blessing’ to Go Beyond Books",
    "url": "https://variety.com/2026/tv/global/night-manager-season-2-director-tom-hiddleston-le-carre-1236624943/",
    "image": "https://variety.com/wp-content/uploads/2026/01/DSCF1731b-copy.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-09T14:30:00.000Z",
    "description": "\n\tTen years ago, an espionage thriller series became the talk of the town for a good few weeks, especially in the U.K. \n\n\t“The Night Manager,” a BBC/A",
    "body": "\n\tTen years ago, an espionage thriller series became the talk of the town for a good few weeks, especially in the U.K. \n\n\t“The Night Manager,” a BBC/AMC co-production and adapted from John le Carré’s novel, starred Tom Hiddleston as Jonathan Pine, a hotel employee and ex-soldier hired to infiltrate the inner circle of Hugh Laurie’s dastardly arms dealer, Richard Roper.\n\n\tIt was — at the time — unlike anything usually produced in the U.K., an expensive, high-octane and extremely glitzy globe-trotting showcase of major set pieces and exotic locations (and in one sex scene, much to the enjoyment of the British press, Hiddleston’s bum — controversially cut from the U.S. broadcast). Several execs joked at the time that the intro alone probably cost more than the average budget of a U.K. TV series. Thankfully, “The Night Manager” was hugely well received — winning a major haul of awards, including two Emmys (one for Suzanne Bier, who directed the whole series) and three Golden Globes (for Hiddleston, Lawrie and Olivia Colman, marking her very first major honor in the U.S.). Naturally, having successfully flexed his suave spy muscles on TV screens, Hiddleston immediately became the bookies’ top choice to take over as James Bond, not that they were looking back in 2016.\n\t\n\n\tMuch has changed in the last decade. \n\n\n\tBig-budget TV in the U.K. is no longer a rarity, with studios and streamers having since flocked across the Atlantic to set up major local bases (“The Night Manager” actually launched eight months before Netflix’s game-changer “The Crown”). Colman is also now an Oscar winner, while who will become the next 007 is expected to be announced very soon (although the bookmakers’ current favorite is Callum Turner). And le Carré sadly passed away in late 2020 at the age of 89.\n\t\n\n\tBut “The Night Manager” is finally back for a second outing, this time on the BBC and Amazon Prime, where it launches Jan. 11. 10 years on, Hiddleston’s Pine is still in the secret service, but now under a different alias and running a surveillance unit in London (Colman also returns too). Naturally, things quickly go awry and he’s soon attempting to infiltrate a Colombian arms cartel, but now under orders from a post-Brexit U.K. where there are questions of national identity and who’s working for who.\n\n\tIn the directors seat for the full six-part return — shot in the U.K., Colombia, Spain and France — is Georgi Banks-Davies, best known for directing “I Hate Suzie” for Sky Atlantic and Netflix’s “Kaos.”\n\n\tSpeaking to Variety, Banks-Davies discusses picking up a series 10 years on, taking over from the “incredible” Bier, and how season two of “The Night Manager” marks the first time that le Carré’s spy world has been expanded beyond his novels — a move he fully gave his blessing.  \n\t\n\t\tHow did you get involved in this — it seems very different from your previous work?\t\n\n\tIt was actually two years ago today. I got an out of the blue phone call from my agent saying, ‘Guess what, they want to see you for The Night Manager.’ And honestly, my first reaction was, ‘Oh my God, incredible.’ I’m a huge le Carré fan, a huge espionage fan and a huge fan of thrillers. I’ve always wanted to make action but my career had not necessarily pointed in that direction. So to be kind of given that opportunity, it felt out of the blue. Then I went on to meet the producers at The Ink Factory — le Carré’s kids — and the writer David Farr. We talked about the big thematics of the show, what’s it’s politically saying on a bigger platform. But what struck me were the characters he’d formed. For me, the characters have to come first. And then I met Tom (Hiddleston) and were excavating the character ¬— what does Jonathan Pine look like 10 years later? Finally they said, “Do you want to direct it and direct all of it.”\n\n\tI think this is the closest thing to cinema you can do as a TV director. Right from the start, I was basically told: This is a six-hour movie. So it’s shot all at the same time, it’s edited all at the same time — it’s made like a six-hour movie. There’s a lot of pressure, but also so much freedom creatively. And I still cannot believe I got to make it.\n\t\n\t\n\t\tSeason 1 of “The Night Manager” was adapted from le Carré’s novel, but is this the first time they’ve expanded on one of his books?\t\n\n\tYeah, it is. And there’s a lot of question marks around that. But they’ve been very conscious about how they’ve done it. And le Carré was aware of it before he passed away.\n\t\n\t\tSo he gave it his blessing?\t\n\n\tYeah, he’d given it his blessing — he wanted them to do it. And we had the same writer [as Season 1] in David Farr, who’s an aficionado of le Carré and understands how to inhabit that world. For me, it’s like you have to trust that there is a DNA in the project, which is literally le Carré’s family. There will be nothing that would harm that or harm what their father would have intended. I never got to meet him, but I had to kind of make that assumption that it all comes with good blessing. But I’m pretty sure I read somewhere that le Carré said that a film adaptation is an adaptation of the film, not the book. And by that, he meant when he was working on stuff he really gave creative freedom to the writers and the directors. So if you look at the first book and you look at the TV show, it changed the time period, setting and some of the characters. He was always very empowering of that in the adaptation.\n\t\n\t\tIt seems rare to get a sequel to a series that came out 10 years ago. I don’t want to remotely suggest that 2016 was a more innocent and carefree time, but a lot has happened since then. Do you think this story reflects how the world has changed in the last decade?\t\n\n\tYeah, 100%. We live in a post-truth world now. We’ve been through a huge, seismic political shift. And I think the show was always to me about an identity crisis. The characters are so often grappling with who they are. And I think in this moment that we live in, who we are and all the things that make us who we are, whether that is our race, religion, gender, where we were born, where we want to live — everything about us feels so much more prevalent and so much more judged. In one moment, it can make us safe, and in the other it can make us entirely unsafe. I feel every day it’s on a knife edge. The things that you take for granted — like as a woman, as a queer person — they can be taken away from me. The fundamental human rights that I would assume are human rights are currently so in the balance, are currently so for the taking. And the show goes on to kind of really examine the idea of who we are based on where we come from and the ideals that we hold.\n\t\n\t\n\t\tWhen the first season came out it was a huge deal. It came before the rush of very expensive high-end drama here in the U.K., before the streamers set up huge bases here. I remember at the time people noting how glitzy it looked in comparison to most U.K. productions. Given that so much has changed in the U.K. and it’s now an epicenter for global TV did it feel a little a little daunting to take that on?\t\n\n\tI’d be lying if I say it wasn’t daunting, but equally, that feeling had to be pushed straight away. You can’t ignore what’s come before and you can’t ignore the fan base, and you can’t ignore success like that. But if you try to replicate it, or if you let it infiltrate you, you will fail. For me as a filmmaker, I then have to ask, ‘Why am I doing this?’ I’m doing this purely because I’m responding to the material. You’ve just got to trust the material and believe in it, and also believe that instinct that made you want to tell this story and want to do it in a unique way. The other thing I was quite surprised with was the amount of autonomy I was given to do that. I was told: You don’t need to repeat anything that’s come before, there is no house style, there is no way in which it has to be shot. There is no way in which it has to sound. There is no way in which the story has to be told. It’s like: we like your instincts.\n\t\n\t\tYou’re following in some illustrious footsteps, with Suzanne Bier having directed the first season — and winning an Emmy for it. Did you speak to her at all?\t\n\n\tI’m a massive admirer of her, of her work, she’s brilliant. And in this industry, as a woman, you can’t ignore how incredible Suzanne is and how much she’s paved the way for so many women directors. But then you’ve got to go: Ok, thanks. So we did speak, but not before we shot — we talked afterwards. And I actually loved that, because it’s like we’d been two soldiers who’d gone to different battles, and then we exchanged the war stories.\n\t\n\t\tIf I remember correctly, Olivia Colman was pregnant with her third child when she shot the first season. So they must be double digits now.\t\n\n\tI know! Isn’t it excellent? What an amazing mascot of the show.\n\t\n\t\tFollowing the first season, as is always the case whenever a British actor of a certain age picks up a gun, there was a lot of noise about Tom Hiddleston being the next James Bond. At the time, they obviously weren’t looking for a new 007. But 10 years on — they very much are. Do you think this might reignite calls for Tom to become Bond?\t\n\n\tI have no idea! That is a question for Tom. But what I would actually say is that people might start thinking, if they were to do a “Night Manager” prequel, who gets to play Jonathan Pine. I’d like that to be the conversation — who’s going to lead the early years Pine.\n\t\n\t\n\t\tHas there been any talk of continuing into a third season?\t\n\n\tThere was a third season that was always in the offing. David is writing it now — he’s at the coalface and in the early stage. But yeah, when the the second season came the plan was to go to three. So when you see our whole series, you’ll see it can sit entirely alone but can also sit very much as the second book in the trilogy.\n\t\n\t\tWhat next for you? Where do you go after directing Tom Hiddleston in a 6-hour espionage film?\t\n\n\tThere are a few things, but right now my focus is actually on film projects. One is an adaptation of a book about a young woman and one is a sports movie, a period race car move, which is my great passion, and about a woman in the driving seat. So they’re the focus at the moment and hopefully one will be moving forward soon.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘The Night Manager’ Season 2 Director Georgi Banks-Davies on Bringing Tom Hiddleston Spy Thriller Into a ‘Post-Truth World’ and John le Carré Giving His ‘Blessing’ to Go Beyond Books",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/DSCF1731b-copy.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-09T14:30:00.000Z",
      "dateModified": "2026-01-09T14:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Guess The Hot Housewife In Her Yellow Bikini!",
    "url": "https://www.tmz.com/2026/01/09/guess-hot-housewife-yellow-bikini/",
    "image": "https://imagez.tmz.com/image/95/16by9/2026/01/08/9524a529b3ac4288899803df954a374a_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-09T08:45:59.000Z",
    "description": "\n    \n                    \n                          Guess The\n                          Hot Housewife In Her\n                          Yellow Bikini!",
    "body": "\n    \n                    \n                          Guess The\n                          Hot Housewife In Her\n                          Yellow Bikini!\n                      \n                  \n                                                                        Published \n                              January 9, 2026\n                            12:45 AM PST\n                                                                            \n      \n    \n      \n        \n              \n    \n    \n          At last, Friday is here, and we've got a hot housewife to kick off the sex appeal for the weekend! Can you guess who she is?! Oh, and keep on scrollin' to see if you can solve the Housewives' puzzle!\n      \n    \n          Money can't buy her class, but it can buy her a house in the Hamptons. Don't be uncool, just hit the gallery and see who owns these long sexy stems!\n      \n    \n          Once you've solved the mystery housewife, can you slide these puzzle pieces into their respective places?!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Hotties & Bodies\n              \n                          \n                Hot Bodies\n              \n                          \n                Guess Who\n              \n                          \n                Real Housewives\n              \n                          \n                Photo Galleries\n              \n                          \n                Real Housewives of New York\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Guess The Hot Housewife In Her Yellow Bikini!",
      "image": [
        "https://imagez.tmz.com/image/95/16by9/2026/01/08/9524a529b3ac4288899803df954a374a_xl.jpg"
      ],
      "datePublished": "2026-01-09T08:45:59.000Z",
      "dateModified": "2026-01-09T08:45:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Guess Who This Girly In Bangs Turned Into!",
    "url": "https://www.tmz.com/2026/01/09/guess-who-bangs-girly-turned-into/",
    "image": "https://imagez.tmz.com/image/bf/16by9/2026/01/08/bfb703633c2d4510931740b457f99eac_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-09T08:01:10.000Z",
    "description": "\n    \n                    \n                          Guess Who This\n                          Girly With Bangs\n                          Turned Into!\n",
    "body": "\n    \n                    \n                          Guess Who This\n                          Girly With Bangs\n                          Turned Into!\n                      \n                  \n                                                                        Published \n                              January 9, 2026\n                            12:01 AM PST\n                                                                            \n      \n    \n      \n        \n              \n    \n    \n          Before this girl turned into a popular actress, she was just growing up in Ireland with her three siblings and dreaming of becoming a star!\n      \n    \n          Her big breakthrough role was starring on the show \"Derry Girls,\" but you may also recognize her as the daughter of a rich family on \"Bridgerton.\"\n      \n    \n          Can you guess who she is?\n      \n      \n      \n          \n            \n              \n                \n                Share on Facebook\n              \n            \n            \n              \n                \n                Share on X\n              \n            \n                          \n                \n                  \n                \n              \n                      \n        \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Guess Who\n              \n                          \n                Kids\n              \n                          \n                celebrity kids\n              \n                          \n                Photo Galleries\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Guess Who This Girly In Bangs Turned Into!",
      "image": [
        "https://imagez.tmz.com/image/bf/16by9/2026/01/08/bfb703633c2d4510931740b457f99eac_xl.jpg"
      ],
      "datePublished": "2026-01-09T08:01:10.000Z",
      "dateModified": "2026-01-09T08:01:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kelsea Ballerini Reveals Her Dog Dibs Died, Shares Emotional IG Tribute",
    "url": "https://www.tmz.com/2026/01/09/kelsea-ballerini-dib-dog-dead-tribute/",
    "image": "https://imagez.tmz.com/image/58/16by9/2026/01/09/58f1874e08b14c029ebe4156df288d90_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-09T15:44:16.000Z",
    "description": "\n    \n                    \n                          Kelsea Ballerini\n                          It's Goodbye To My 'Soul Dog'💔\n                      ",
    "body": "\n    \n                    \n                          Kelsea Ballerini\n                          It's Goodbye To My 'Soul Dog'💔\n                      \n                  \n                                                                        Published \n                              January 9, 2026\n                            7:44 AM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Kelsea Ballerini is grieving a major loss -- saying goodbye to her \"soul dog,\" Dibs -- and marking the moment with a gut-wrenching IG tribute filled with sweet, happy memories of the pup she adored.\n      \n    \n          The country singer shared the post Thursday, revealing Dibs died the day before -- adding she wouldn’t have survived the last decade of her life without him by her side, and that she truly believes they’ll find each other again in every lifetime.\n      \n    \n        Waiting for your permission to load the Instagram Media.\n      \n    \n          Kelsea shared even more heartbreaking details ... saying Dibs, who was diagnosed with cancer in August '24, spent his final days soaking up the sunshine in his backyard, surrounded by and visited by his forever people.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          She closed by saying she feels like the luckiest girl in the world to have been his dog mom, calling it \"the greatest gift of my life.\"\n      \n    \n          RIP Dibs 💔\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Kelsea Ballerini\n              \n                          \n                Pets\n              \n                          \n                RIP\n              \n                          \n                Animals\n              \n                          \n                Music\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kelsea Ballerini Reveals Her Dog Dibs Died, Shares Emotional IG Tribute",
      "image": [
        "https://imagez.tmz.com/image/58/16by9/2026/01/09/58f1874e08b14c029ebe4156df288d90_xl.jpg"
      ],
      "datePublished": "2026-01-09T15:44:16.000Z",
      "dateModified": "2026-01-09T15:44:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Woman Killed in Shark Attack in U.S. Virgin Islands",
    "url": "https://www.tmz.com/2026/01/09/shark-attack-virgin-islands-minnesota-woman-killed/",
    "image": "https://imagez.tmz.com/image/d8/16by9/2026/01/09/d8aeca594a344cad8697d228318464a7_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-09T15:29:41.000Z",
    "description": "\n    \n                    \n                          U.S. Virgin Islands\n                          Woman Killed in Suspected Shark Attack\n            ",
    "body": "\n    \n                    \n                          U.S. Virgin Islands\n                          Woman Killed in Suspected Shark Attack\n                      \n                  \n                                                                        Published \n                              January 9, 2026\n                            7:29 AM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          A Minnesota woman died after her arm was ripped clean off in a suspected shark attack off the coast of St. Croix in the Caribbean Sea.\n      \n    \n          According to the Virgin Islands Police Department, officers responded to a call about a woman who had presumably been bitten by a shark around 4:30 PM Thursday near Dorsch Beach on St. Croix.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Fire, marine units and EMS arrived on scene ...where they found the woman, already missing an arm. They searched for an additional reported victim but found no one.\n      \n\n          The woman later died from her injuries ... and her next of kin identified her as Arlene Lillis, a woman from Minnesota.\n      \n    \n          Christopher Carroll -- a vacationer with a background in nursing and as a lifeguard -- told The Virgin Island Consortium he heard Lillis' screams from his hotel room and rushed to help her ... pulling her from the water with the help of other bystanders.\n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          Carroll told the outlet Lillis was missing her left arm to the elbow ... and all the flesh from elbow to shoulder had been stripped away -- revealing the humerus bone underneath.\n      \n    \n          Lillis was 56.\n      \n    \n          RIP\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                RIP\n              \n                          \n                Animals\n              \n                          \n                Travel\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Woman Killed in Shark Attack in U.S. Virgin Islands",
      "image": [
        "https://imagez.tmz.com/image/d8/16by9/2026/01/09/d8aeca594a344cad8697d228318464a7_xl.jpg"
      ],
      "datePublished": "2026-01-09T15:29:41.000Z",
      "dateModified": "2026-01-09T15:29:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nick Reiner Believes He's the Victim of a Conspiracy After Parents' Murder",
    "url": "https://www.tmz.com/2026/01/09/nick-reiner-doc-victim-of-conspiracy-belief/",
    "image": "https://imagez.tmz.com/image/e4/16by9/2026/01/09/e4b31fc1450c441eb74a8bc60033263d_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-09T09:00:01.000Z",
    "description": "\n    \n                    \n                          Nick Reiner\n                          He Believes He's the Victim of a Conspiracy\n               ",
    "body": "\n    \n                    \n                          Nick Reiner\n                          He Believes He's the Victim of a Conspiracy\n                      \n                  \n                                                                        Published \n                              January 9, 2026\n                            1:00 AM PST\n                                                                      |\n                                                                Updated \n                                  January 9, 2026\n                                7:18 AM PST\n                                    \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Nick Reiner knows he killed his parents, Rob and Michele Reiner, but he doesn't understand why he's in jail ... sources with direct knowledge tell TMZ.\n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ Studios\n          \n    \n          TMZ has a documentary -- \"TMZ Investigates The Reiner Murders: What Really Happened\" -- airing tonight on FOX and dropping Saturday on Hulu. Our sources say Nick is delusional and believes the people who put him behind bars are engaged in a \"conspiracy\" against him.\n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ Studios\n          \n    \n          Our sources say Nick's fatal mental spiral occurred about a month before the murders, when doctors changed the meds he was taking for schizoaffective disorder -- a severe mental illness that causes delusions, hallucinations, and mania. The meds made him increasingly dangerous and erratic. We're told the meds are still not working properly.\n      \n\n          We know Nick's team was proceeding down a path of pleading him not guilty by reason of insanity. Fact is ... that plea does not require proof that a defendant like Nick didn't know the difference between right and wrong. The key is whether he understood the \"character and quality\" of his actions. Even if the murders were premeditated, it's possible for a jury to reach a verdict of not guilty by reason of insanity.\n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          \"TMZ Investigates The Reiner Murders: What Really Happened\" airs Friday night on FOX at 8 PM/7 Central and drops Saturday on Hulu.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Nick Reiner\n              \n                          \n                Michele Reiner\n              \n                          \n                Rob Reiner\n              \n                          \n                Celebrity News\n              \n                          \n                TMZ Investigates\n              \n                          \n                Drugs & Alcohol\n              \n                          \n                Exclusive\n              \n                          \n                True Crime\n              \n                          \n                Rob Reiner Death\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nick Reiner Believes He's the Victim of a Conspiracy After Parents' Murder",
      "image": [
        "https://imagez.tmz.com/image/e4/16by9/2026/01/09/e4b31fc1450c441eb74a8bc60033263d_xl.jpg"
      ],
      "datePublished": "2026-01-09T09:00:01.000Z",
      "dateModified": "2026-01-09T09:00:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]