[
  {
    "title": "More Acts Cancel Kennedy Center Performances After Trump Name Change",
    "url": "https://variety.com/2025/music/news/acts-cancel-kennedy-center-performances-trump-name-change-1236620075/",
    "image": "https://variety.com/wp-content/uploads/2025/12/Trump-Kennedy-Center.jpg?crop=0px%2C197px%2C4700px%2C2644px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-12-30T04:31:55.000Z",
    "description": "\n\tTwo more acts have canceled their upcoming performances at the John F. Kennedy Center for the Performing Arts in the wake of Donald Trump adding his",
    "body": "\n\tTwo more acts have canceled their upcoming performances at the John F. Kennedy Center for the Performing Arts in the wake of Donald Trump adding his name to the historic forum, according to the New York Times.\n\n\tA veteran jazz septet known as The Cookers canceled two New Year’s Eve performances. They announced the move in a statement on Monday, writing, “Jazz was born from struggle and from a relentless insistence on freedom: freedom of thought, of expression, and of the full human voice.”\n\t\n\n\tThe group’s drummer, Billy Hart, told the Times that Trump’s name change “evidently” influenced The Cookers’ decision to bow out.\n\n\n\tNew York dance troupe Doug Varone and Dancers also canceled two of its performances slated for April. The shows were to coincide with the company’s 40th anniversary. Varone told the Times that they were losing $40,000 by dropping out. He wrote of the decision in an email, “It is financially devastating but morally exhilarating.”\n\n\t“The artists who are now canceling shows were booked by the previous far left leadership,” said the center’s president ambassador, Richard Grenell, in response to the recent cancellations. “Their actions prove that the previous team was more concerned about booking far left political activists rather than artists willing to perform for everyone regardless of their political beliefs. Boycotting the Arts to show you support the Arts is a form of derangement syndrome.”\n\n\tA rep for the Kennedy Center said the organization will not tolerate discrimination and book talent that appeals to all backgrounds and beliefs. \n\t\n\n\tThe Cookers and Doug Varone and Dancers are only the latest acts to pull their performances from the Kennedy Center calendar. Jazz musician Chuck Redd abruptly canceled his Christmas Eve concert in protest of Trump’s name change. Grenell said the organization would seek $1 million in damages.\n\n\tIn a Dec. 26 letter to Redd, Grenell wrote, “Your decision to withdraw at the last moment — explicitly in response to the Center’s recent renaming, which honors President Trump’s extraordinary efforts to save this national treasure — is classic intolerance and very costly to a non-profit Arts institution.”\n\n\tTrump’s name was added to the center on Dec. 19 after the White House announced that the Kennedy Center board of trustees unanimously decided to rename the venue “The Donald J. Trump and The John F. Kennedy Memorial Center for the Performing Arts.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "More Acts Cancel Kennedy Center Performances After Trump Name Change",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/Trump-Kennedy-Center.jpg?crop=0px%2C197px%2C4700px%2C2644px&resize=1000%2C563"
      ],
      "datePublished": "2025-12-30T04:31:55.000Z",
      "dateModified": "2025-12-30T04:31:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘The Princess Bride’ Star Cary Elwes Shares Tribute to Rob Reiner: ‘From That Very First Meeting I Fell In Love With Him’",
    "url": "https://variety.com/2025/film/news/cary-elwes-tribute-rob-reiner-the-princess-bride-star-1236620010/",
    "image": "https://variety.com/wp-content/uploads/2025/12/GettyImages-665869692.jpg?crop=0px%2C85px%2C5146px%2C2895px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-12-30T02:23:53.000Z",
    "description": "\n\tCary Elwes, who starred in Rob Reiner’s 1987 fantasy classic “The Princess Bride,” released a statement on Instagram Monday night in remembrance of ",
    "body": "\n\tCary Elwes, who starred in Rob Reiner’s 1987 fantasy classic “The Princess Bride,” released a statement on Instagram Monday night in remembrance of the director and his wife, Michelle Singer, who were found dead in their Brentwood home on Dec. 14.\n\n\t“Enough time has passed that I can finally put my grief into words,” Elwes wrote in the caption of his post. “I was 24 when I first met Rob Reiner on ‘The Princess Bride.’ And from that very first meeting I fell in love with him. I was already a fan of his work so meeting him in person was a dream come true. As we began spending more time together I knew this was someone I wanted in my life.”\n\t\n\n\n\tElwes recalled that the first thing he noticed about Reiner was that he “wore his heart on his sleeve,” and “always tried to find the best in people.” He added that Reiner “loved making movies,” but more than that, he loved “the experience itself” of creating a film.\n\n\t“He used to say, ‘Once the movie is released it belongs to other people. But while you are making it, that’s your time on the planet, so you wanna make it good,’” Elwes remembered. “And boy was my time with him on ‘The Princess Bride’ beyond great. I can’t remember a single day without laughter. The movie is about love, loyalty and sacrifice. Things that Rob held dear. Which is among the many reasons he was the perfect person to direct it.”\n\n\tElwes closed his statement by thanking Reiner and Singer for sharing their life with him and the world at large.\n\t\n\n\tHe concluded, “Because my heart still aches every time I think of you, I know the grief of losing you too soon will likely never go away. Sure, death cannot stop true love but life is pain without you.”\n\n\tReiner and Singer’s cause of death was “multiple sharp force injuries,” according to records from the Los Angeles County Medical Examiner. Hours after they were found dead, their son, Nick Reiner, was arrested and booked on suspicion of murder on Monday morning. He was charged with two counts of murder in the death of his parents on Tuesday afternoon.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘The Princess Bride’ Star Cary Elwes Shares Tribute to Rob Reiner: ‘From That Very First Meeting I Fell In Love With Him’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/GettyImages-665869692.jpg?crop=0px%2C85px%2C5146px%2C2895px&resize=1000%2C563"
      ],
      "datePublished": "2025-12-30T02:23:53.000Z",
      "dateModified": "2025-12-30T02:23:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Stranger Things 5’ Finale Has 1.1 Million RSVPs in Movie Theaters, Says Ross Duffer: ‘3,500 Showtimes Are Completely Full’",
    "url": "https://variety.com/2025/tv/news/stranger-things-5-finale-rsvp-movie-theaters-1236619699/",
    "image": "https://variety.com/wp-content/uploads/2025/12/StrangerThings_S5_0630_R.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-29T23:19:48.000Z",
    "description": "\n\tThe “Stranger Things” series finale is shaping up to be a major theatrical event.\n\n\t1.1 million people have RSVP’d to watch the final episode of the",
    "body": "\n\tThe “Stranger Things” series finale is shaping up to be a major theatrical event.\n\n\t1.1 million people have RSVP’d to watch the final episode of the Netflix sci-fi series in theaters on New Year’s Eve, according to an Instagram post from co-creator Ross Duffer, who also said that 3,500 showtimes across more than 620 theaters are completely sold out.\n\n\tDuffer teased that he and his brother Matt Duffer, his co-creator, would be attending a screening or two. “What a way to close out a ten-year journey—together,” Duffer wrote. “Maybe we’ll see some of you in LA.”\n\t\n\n\tVolume 1 of Season 5 premiered with four episodes on Thanksgiving Day, and Volume 2 followed with three more episodes on Christmas Day. Along with the theatrical release, the series finale will be concurrently released on Netflix on Dec. 31.\n\n\tThe finale will bring to a close what has been one of Netflix’s most important ventures ever. As exclusively reported by Variety, “Stranger Things” recently crossed 1.2 billion views, and has contributed more than $1.4 billion to the U.S. GDP. Season 4, which was released in 2023, still stands as Netflix’s No. 2 most popular English-language TV title of all time. Given that Season 5 achieved Netflix’s biggest opening week ever for an English-language TV series after Volume 1 debuted, it’s expected that the season will enter the most popular list soon after its eligibility window opens in January.\n\n\t“Stranger Things” is executive produced by the Duffers via their Upside Down Pictures banner alongside Shawn Levy of 21 Laps Entertainment and Dan Cohen.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Stranger Things 5’ Finale Has 1.1 Million RSVPs in Movie Theaters, Says Ross Duffer: ‘3,500 Showtimes Are Completely Full’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/StrangerThings_S5_0630_R.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-29T23:19:48.000Z",
      "dateModified": "2025-12-29T23:19:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Joe Rogan Says Donald Trump Attacking Rob Reiner After His Death Is ‘So Disappointing’ and ‘Not Funny’: ‘There’s No Justification For What He Did’",
    "url": "https://variety.com/2025/film/news/joe-rogan-slams-donald-trump-rob-reiner-attack-1236619511/",
    "image": "https://variety.com/wp-content/uploads/2025/12/rogan-trump-reiner.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-29T23:15:56.000Z",
    "description": "\n\tJoe Rogan is the latest industry heavyweight speaking out against Donald Trump‘s repeated attacks against Rob Reiner after the director’s tragic dea",
    "body": "\n\tJoe Rogan is the latest industry heavyweight speaking out against Donald Trump‘s repeated attacks against Rob Reiner after the director’s tragic death. Trump alleged that Reiner’s death was “due to the anger he caused others” from being outspokenly anti-Trump. Reiner’s son, Nick, has been arrested in connection to his parents’ deaths.\n\n\t“The Rob Reiner thing is not funny,” Rogan said on a recent podcast featuring comedian Shane Gillis (via Entertainment Weekly). “When you see it with no empathy, that’s when it’s hard to like. Listen, there’s no justification for what he did that makes any sense in a compassionate society. It’s no different than people that were celebrating when Charlie Kirk got shot. It’s the same kind of thing.”\n\t\n\n\t “Imagine if Obama tweeted something about someone after they died in this way. That this person was a deranged person that hated Obama.” Rogan continued. “It just shows you how crazy it is, the way Trump thinks and talks. It’s just like, the guy got sliced up by his kid, you know? Anybody that doesn’t see that and go, ‘Fuck, man.’”\n\n\n\tRogan said someone should’ve taken Trump’s “fucking phone” away from when he decided to weigh in on Reiner’s death and added that he was  “so disappointed” by Trump’s comments: “It’s so disappointing. It’s like why… if you say that privately that’s one thing, which is also crazy, but it’s so disappointing.” \n\n\tTrump made his statement on Reiner in a Truth Social post that read: “A very sad thing happened last night in Hollywood. Rob Reiner, a tortured and struggling, but once very talented movie director and comedy star, has passed away, together with his wife, Michele, reportedly due to the anger he caused others through his massive, unyielding, and incurable affliction with a mind crippling disease known as TRUMP DERANGEMENT SYNDROME, sometimes referred to as TDS. He was known to have driven people CRAZY by his raging obsession of President Donald J. Trump, with his obvious paranoia reaching new heights as the Trump Administration surpassed all goals and expectations of greatness, and with the Golden Age of America upon us, perhaps like never before. May Rob and Michele rest in peace!”\n\t\n\n\tTrump doubled down on his criticism of Reiner hours later when asked during a press conference about Republicans condemning his original statement. He responded: “Well, I wasn’t a fan of his at all. He was a deranged person as far as Trump is concerned… I thought he was very bad for our country.”\n\n\tThe U.S. president was widely condemned by Hollywood for his statements on Reiner. Josh Gad posted on Threads: “There is no low that is too low for this fucking psychopath. Rob Reiner was 1000 times the man you are and unlike you, he actually cared about the American people. Go paint your hand on your gold fucking toilet and destroy things like the White House. That’s what you do best.”\n\n\tJimmy Kimmel bashed Trump as “hateful and vile” for going after Reiner after such a tragic death. The late night host added: “What we need at a time like this, besides common sense when it comes to guns and mental health care, is compassion and leadership. We did not get that from our president, because he has none of it to give. Instead, we got a fool rambling about nonsense.”\n\n\tWhoopi Goldberg on “The View” condemned Trump and also every Republican staying silent on the matter by saying: “There’s no justification for him to have written what he wrote. There’s no way to justify it and all those Republicans who are quiet, damn you all. Damn you all.”\n\n\tListen to Rogan and Gillis’ full conversation on “”The Joe Rogan Experience” in the video below.\n\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Joe Rogan Says Donald Trump Attacking Rob Reiner After His Death Is ‘So Disappointing’ and ‘Not Funny’: ‘There’s No Justification For What He Did’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/rogan-trump-reiner.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-29T23:15:56.000Z",
      "dateModified": "2025-12-29T23:15:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘The Last of Us’ to Recast Danny Ramirez’s Manny for Season 3",
    "url": "https://variety.com/2025/tv/news/the-last-of-us-season-3-recast-danny-ramirez-1236619442/",
    "image": "https://variety.com/wp-content/uploads/2025/12/danny-ramirez.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-29T21:11:55.000Z",
    "description": "\n\tDanny Ramirez‘s role in “The Last of Us” will be recast for Season 3 due to scheduling conflicts.\n\n\tRamirez joined the cast of the HBO apocalypse dr",
    "body": "\n\tDanny Ramirez‘s role in “The Last of Us” will be recast for Season 3 due to scheduling conflicts.\n\n\tRamirez joined the cast of the HBO apocalypse drama in Season 2. He played Manny, who was described as “a loyal soldier whose sunny outlook belies the pain of old wounds and a fear that he will fail his friends when they need him most” when his casting was announced in 2024. Manny is a former member of the Fireflies, a rebel militia, who is friends with Abby (Kaitlyn Dever) and helps her seek revenge on Joel (Pedro Pascal) for the massacre he carried out on the Firefly hospital to save Ellie (Bella Ramsay).\n\t\n\n\tRamirez is best known for playing Joaquin Torres/Falcon in the Marvel Cinematic Universe, including the 2021 series “The Falcon and the Winter Soldier,” the 2025 film “Captain America: Brave New World” and the upcoming film “Avengers: Doomsday.” He will also appear in the upcoming Jean-Michel Basquiat biopic “Samo Lives.”\n\n\n\tPer the official logline, “The Last of Us” begins “20 years after modern civilization has been destroyed. Joel, a hardened survivor, is hired to smuggle Ellie, a 14-year-old girl, out of an oppressive quarantine zone. What starts as a small job soon becomes a brutal, heartbreaking journey, as they both must traverse the U.S. and depend on each other for survival.” Season 2 took place five years later, as “Joel and Ellie are drawn into conflict with each other and a world even more dangerous and unpredictable than the one they left behind.”\n\n\tThe series is based on the video game of the same name by Neil Druckmann, who co-created the TV series with Craig Mazin. Both served as writers and directors on Season 2, though Druckman exited his creative roles ahead of Season 3 to focus on other projects. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘The Last of Us’ to Recast Danny Ramirez’s Manny for Season 3",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/danny-ramirez.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-29T21:11:55.000Z",
      "dateModified": "2025-12-29T21:11:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Why ‘Heated Rivalry’ Can’t Compete at the Emmys — and Likely Won’t Be Able to for Season 2, Either",
    "url": "https://variety.com/2025/tv/news/heated-rivalry-emmys-eligibility-season-2-1236619236/",
    "image": "https://variety.com/wp-content/uploads/2025/12/heated-rivalry-shane-ilya-episode-4-1420x798-1.jpg?crop=0px%2C0px%2C1194px%2C672px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-12-29T21:39:55.000Z",
    "description": "\n\tAs “Heated Rivalry” continues to… heat up and become a massive hit for HBO Max, conversations have begun regarding the upcoming Emmy season. While r",
    "body": "\n\tAs “Heated Rivalry” continues to… heat up and become a massive hit for HBO Max, conversations have begun regarding the upcoming Emmy season. While romance series have broken through at the award show recently — see “Nobody Wants This,” which broke through with three nods for its first season — this adaptation will not get the same treatement.\n\n\t“Heated Rivalry” is fully funded by Canadian company Bell Media, Crave’s parent company. The 2024-25 Emmy rules state that a “foreign television production is ineligible unless it is the result of a co-production (both financially and creatively) betwen U.S. and foreign partners, which precedes the start of production, and with a purpose to be shown on U.S. television.” While the Television Academy hasn’t yet released the 2025-26 rulebook, it’s unlikely any changes to this rule will be made.\n\t\n\n\t“Heated Rivalry” was originally set for 2026, but was then moved up by Crave with a hope to get more viewers over the holidays. It worked. But HBO Max didn’t come on until after Season 1 was finished, far too late to become a co-financier or producer — which meant it had no creative say. Instead, HBO Max serves solely as the U.S. distributor.\n\n\n\tAnd that will remain for Season 2, according to HBO content chairman and CEO Casey Bloys.\n\n\t“We’re not going to be involved,” Bloys recently told Variety. “I think the last thing the show needs is people meddling in what works. So, I don’t feel any need to weigh in. Clearly, they’ve got a good sense of the show and what works. I will be excited to receive my episodes, and highlight them on HBO Max.”\n\t\n\n\tIf submitted, the show will be eligible at the International Emmys.\n\n\tBloys was introduced to the show by Jason Butler, an HBO exec who acquired the show for HBO Max in Australia. Butler called Bloys in early November, and asked if he’d want it for U.S. He sent over the episodes and three days later, they began negotiating.\n\n\t“It was an easy and very quick ‘yes.’ Obviously, I’m a gay man, so I had a sense that it might make some waves,” he said. “I thought it was very well done. To tell you the truth, I was surprised that it was even available, because this was about three weeks before it aired.”\n\n\tBloys added that he was “very impressed” by the afforadability of the acquisition. “I don’t know their budgets, but I’m very impressed with what they did based on the acquisition cost. This isn’t a huge tentpole budget that we’re looking at.”\n\n\tTierney added that he was thrilled HBO became the U.S. streaming home since HBO content is is licensed to Crave in Canada.\n\n\t“We were always like, ‘We’re trying to make premium smut here,’ and so we’re now premium smut on HBO!” said Tierney. “That would be the dream. But we’ve been doing this long enough to know that nothing guarantees you an audience anymore. There’s so much good TV out there, that to break through the noise feels like such a gift.”\n\n\tThe series, which tells the love story between two NHL star players — who are also enemies on the ice — became a massive hit for Crave and HBO Max following its November debut. It is now the top-rated non-animated acquired series on HBO Max since its 2020 launch. It is in the top five among all scripted debuts on HBO Max this year. In Canada, it’s Crave’s most watched original.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why ‘Heated Rivalry’ Can’t Compete at the Emmys — and Likely Won’t Be Able to for Season 2, Either",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/heated-rivalry-shane-ilya-episode-4-1420x798-1.jpg?crop=0px%2C0px%2C1194px%2C672px&resize=1000%2C563"
      ],
      "datePublished": "2025-12-29T21:39:55.000Z",
      "dateModified": "2025-12-29T21:39:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Straight Circle’ Review: A Border Satire That Transcends Its Flaws Through Abstraction",
    "url": "https://variety.com/2025/film/reviews/straight-circle-review-oscar-hudson-1236619340/",
    "image": "https://variety.com/wp-content/uploads/2025/12/sic2025-straight-circle-01-1.jpeg?crop=0px%2C238px%2C1920px%2C1080px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-12-29T21:55:44.000Z",
    "description": "\n\tRight from its title, Oscar Hudson’s droll debut “Straight Circle” evokes paradoxical oddities, which the writer-director layers atop his deadpan sa",
    "body": "\n\tRight from its title, Oscar Hudson’s droll debut “Straight Circle” evokes paradoxical oddities, which the writer-director layers atop his deadpan satire on nationalism and geographical boundaries. A tale of two enemy soldiers patrolling a militarized border from inside a common outpost, the movie’s fictitious premise gradually transforms, and eventually transcends the shortcomings of its broad political scope the more it leans into abstraction.\n\t\n\n\tThe film arrives with a bang, introducing the fragile ceasefire between its warring (though unnamed) desert nations via a smart split-screen prologue during its first five minutes. Amid pomp and circumstance, leaders on either side of a rickety fence stand on ceremony, inadvertently interrupting one another through microphone feedback, as the dueling images — each with their own jittery, handheld camera movements and unique color timing, one warm and one cool — swap places and subjects. This tongue-in-cheek flourish aestheticizes the point Hudson hammers home ad nauseam across 109 minutes, to vary degrees of success: these nations, despite their differing military garbs and traditions, may as well be one and the same.\n\n\n\tAlthough consistently amusing, “Straight Circle” is at its strongest when literalizing the blurred line between borders through this two-pronged visual approach, though it only takes this form for a few more minutes near the end. However, in the meantime, Hudson still plays alluring tricks, beginning with his casting. The story’s focus is, for the most part, a pair of soldiers with opposing allegiances, viewpoints, and ideologies. One of them, a bald, bespectacled man filled with jingoistic fervor, dons a large black beret and a white uniform, and enacts a showy, gestural salute that earns his countrymen the epithet of “slap heads.” The other, a raggedy, bearded civilian from his country’s military reserve, is less enthused, and often strips off his service greens and his Ottoman-style fez to smoke cigarettes and lounge in the sun. However, what viewers may not realize at first is that these characters are played by real-life twin brothers Elliott and Luke Tittensor (of “House of the Dragon” fame) respectively, imbuing the film’s sardonic goings on with an uncanny quality.\n\t\n\n\tThe made-up countries in question don’t seem to matter, which makes for a double-edged sword. On one hand, it allows the film’s distinctly English characters to immediately make clear Hudson’s all-encompassing point about how, beyond our most outward and boisterous details, people are all the same, and we should just get along. Politically, “Straight Circle” has a tendency to play like a “Coexist” bumper sticker with all specificities stripped away, until real-world comparisons begin to hurt it. A tale such as this is bound to bring to mind existing equivalents,whether India and Pakistan’s ceremonial Wagah border, or the DMZ between North and South Korea, or numerous ongoing border disputes across the world, which stem from not only social and geopolitical specifics, but a history of western imperialism — and, in some cases, specifically British imperialism. The film’s British production, and its British filmmaker, can’t help but occupy a large section of the movie’s negative space, inviting questions about who and what exactly is being satirized (or perhaps patronized) in this tale of warring desert nations.\n\n\tHowever, despite the movie’s gaze verging on orientalist, “Straight Circle” slowly but surely disengages from all forms of reality, and becomes a far more absurd and anthropological study when an incoming dust storm disorients the characters and viewers alike. Beyond a point, both sides of the border become identical, just as the physical and psychological lines between both patrolmen begin to blur, resulting in surprisingly touching drama through personal anecdotes, sprinkled with surrealism, and performed with emotional gusto by its sibling leads, as they dig into what haunts and drives each character. The film is made even more inviting by composer Maxwell Sterling’s rapturous horns, and cinematographer Christopher Ripley’s vivid textures of the parched environment, rooting even the movie’s zaniest happenings in a visceral reality.\n\n\tThe less realistic the movie feels — in a geopolitical sense — the more human it becomes. This is perhaps Hudson’s greatest sleight of hand, and it transforms the initial weaknesses of “Straight Circle” into its most entertaining strengths. No one watching the film is likely to come away with a deeper understanding of military conflict, but there is, eventually, a wonderful psychology to the story, expressed through fleeting flourishes that are sorely missed once they’re cast aside. Perhaps it should’ve been stranger than it already is, but it’s a bold swing to begin with, and marks a fitting first chapter for Hudson, in what is sure to be an interesting career.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Straight Circle’ Review: A Border Satire That Transcends Its Flaws Through Abstraction",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/sic2025-straight-circle-01-1.jpeg?crop=0px%2C238px%2C1920px%2C1080px&resize=1000%2C563"
      ],
      "datePublished": "2025-12-29T21:55:44.000Z",
      "dateModified": "2025-12-29T21:55:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chevy Chase Had ‘Meltdown’ on ‘Community’ Set After N-Word Incident Went Public and Said ‘My Career Is Ruined,’ Claims Director; Crew Chanted ‘F— You, Chevy!’ at Wrap Party",
    "url": "https://variety.com/2025/tv/news/chevy-chase-meltdown-community-set-n-word-1236619348/",
    "image": "https://variety.com/wp-content/uploads/2025/12/TCDCOMM_EC167.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-29T22:31:54.000Z",
    "description": "\n\t“Community” director Jay Chandrasekhar is interviewed in the upcoming CNN documentary “I’m Chevy Chase and You’re Not” and recalls that he “was ther",
    "body": "\n\t“Community” director Jay Chandrasekhar is interviewed in the upcoming CNN documentary “I’m Chevy Chase and You’re Not” and recalls that he “was there, directing, the night that Chevy Chase got fired” from the NBC sitcom (via People). Chandrasekhar, who is best known for his work with the Broken Lizard comedy group, said the actor had a “meltdown” on set after an incident in which he used the N-word on set leaked to the press.\n\n\tThe alleged incident occurred between Chase and co-star Yvette Nicole Brown, with Chandrasekhar explaining: “I know that there was a history between [Chevy and Yvette] around race, and she got up and stormed out of there. Chevy storms off, so the producer is like, ‘We need Yvette in the scene, right?’ I’m like, ‘Yeah, she’s in the next scene.’ And he goes, ‘Well, she won’t come out unless Chevy apologizes to her.’”\n\t\n\n\tChandrasekhar said Chevy eventually returned to the set but claimed he “didn’t say anything” to upset Brown, adding: “[Chevy] goes, ‘You know, me and Richard Pryor, I used to call Richard Pryor the N-word, and he used to call me The Honky, and we loved each other.’ And I’m like, ‘I know, man, I love that bit.’ I said, ‘You know, can we just have a little apology?’ He goes, ‘For what?’” \n\n\tWhatever was said by Chase on the “Community” set happened during a “blackface” hand puppet bit written for the comedian’s character, Pierce Hawthorne, Chandrasekhar said. The incident was later reported on by The Hollywood Reporter, who claimed Chase was “frustrated” with his character arc and used the N-word “when questioning the dialogue.” The report stressed that Chase did not use the racial slur directly at his Black co-stars Brown and Donald Glover, although both actors were reportedly on set at the time.\n\t\n\n\tChandrasekhar said that when production resumed after the THR story broke, Chase arrived on set and had a “full meltdown” as he came “storming onto the set, and he goes, ‘Who fucked me over?’ … My career is ruined! I’m ruined!’ Like, it’s a full meltdown. ‘Fuck all of you!’ And I’m like, ‘Alright, let’s shoot the scene.’ He never ended up coming back after that.” \n\n\tVariety has reached out to Chase’s representative for further comment.\n\n\tGlover told The New Yorker in 2018 that Chase repeatedly made racist jokes on the “Community” set. According to the profile, Chase “often tried to disrupt” his scenes with Glover by making “racial cracks between takes,” one of which was the following: “People think you’re funnier because you’re Black.”\n\n\t“Chevy was the first to realize how immensely gifted Donald was, and the way he expressed his jealousy was to try to throw Donald off,” “Community” creator Dan Harmon said at the time. “I remember apologizing to Donald after a particularly rough night of Chevy’s non-P.C. verbiage, and Donald said, ‘I don’t even worry about it.’”\n\n\tGlover interpreted Chase’s racist cracks as the comedian “thrashing in the water,” adding, “I just saw Chevy as fighting time—a true artist has to be ok with his reign being over. I can’t help him if he’s thrashing in the water. But I know there’s a human in there somewhere—he’s almost too human.”Chase told CBS Sunday Morning in 2022 that he “doesn’t give a crap” about headlines and former co-stars painting him as problematic on set, adding at the time: “I don’t give a crap. I am who I am. And I like who I am. I don’t care. And it’s part of me that I don’t care. And I’ve thought about that a lot. And I don’t know what to tell you, man. I just don’t care.”\n\n\tChase exited “Community” after Season 4 following the N-word incident and a public spat with Harmon over creative differences. Chandrasekhar says in the CNN documentary that “it was out in the open that Chevy Chase was a little difficult on ‘Community,’ and I’m being nice. People were talking about it, enough that Dan did that thing at the wrap party,” referring to when Harmon got party guests to chant “Fuck you, Chevy!” \n\n\t“My dad was super excited to bring me and my mom to the wrap party,” Chevy’s daughter Caley says in the documentary. “We walk in, Dan, he had had some drinks. He had gotten the whole cast and crew to yell, ‘Fuck you, Chevy!’ ‘Fuck you, Chevy!’ I’m there, he’s showing his daughter, like, ‘This is the show I did,’ and we walk in to ‘Fuck you, Chevy!’ That’s rough and mean.”\n\t\n\n\t“I’m Chevy Chase and You’re Not” director Marina Zenovich told Variety that she tried to get more of Chase’s “Community” cast members and crew members to participate in the documentary but “every single person said no” because “there are things people don’t want to talk about.”\n\n\t“I ran into Dan Harmon at a screening of ‘Deaf President Now!’ and I got his number,” she added. “I was so excited. I thought it was going to happen, but then he declined. I was so lucky to get Jay Chandrasekhar. He has such an amazing delivery and he was willing to go there. If Jay had said no, I would have been screwed.”\n\n\t“I’m Chevy Chase, and You’re Not” airs Jan. 1 on CNN.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chevy Chase Had ‘Meltdown’ on ‘Community’ Set After N-Word Incident Went Public and Said ‘My Career Is Ruined,’ Claims Director; Crew Chanted ‘F— You, Chevy!’ at Wrap Party",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/TCDCOMM_EC167.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-29T22:31:54.000Z",
      "dateModified": "2025-12-29T22:31:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Stranger Things 5’ Gets Review Bombed as Will’s Coming Out Becomes Worst-Rated Episode on IMDb",
    "url": "https://variety.com/2025/tv/news/stranger-things-5-review-bombed-will-coming-out-episode-1236619341/",
    "image": "https://variety.com/wp-content/uploads/2025/12/StrangerThings_S5_0509_R.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-29T20:30:10.000Z",
    "description": "\n\t“Stranger Things” has been review bombed after the Dec. 25 release of Season 5 Vol. 2.\n\n\tThe recent episodes have dragged the season’s fan-driven Ro",
    "body": "\n\t“Stranger Things” has been review bombed after the Dec. 25 release of Season 5 Vol. 2.\n\n\tThe recent episodes have dragged the season’s fan-driven Rotten Tomatoes score from the 70s down to 56%, a stark decline from the show’s previous seasons. (For reference, the Season 4 Popcornmeter sits at 89%, Season 3 at 86%, Season 2 at 90% and Season 1 at 96%.)\n\n\tA backlash campaign seemed to ignite after the Netflix series’ penultimate episode, “The Bridge,” which features a scene in which Will Byers (Noah Schnapp) comes out as gay to his friends. The lengthy monologue came as the Hawkins gang geared up to face Vecna, the big bad from the Upside Down. “The Bridge” is now the lowest-rated episode of “Stranger Things” on IMDb, with a score of 5.4 out of 10. (It’s the only episode below a 7.8, with most ranging between 8.6 and 9.2.) More than 96,000 users reviewed “The Bridge” on IMDb, while most other episodes this season have been rated by fewer than 50,000 people.\n\t\n\n\tElon Musk, who often gripes about movies and TV shows going “woke,” said “the culture is changing” in response to a post on X claiming that fans were “criticizing a character for coming out as homosexual.” \n\n\n\t“It’s completely unnecessary and forced on audiences who just want to enjoy some basic sci-fi,” Musk wrote.\n\n\tReview bombing from so-called “toxic fandom” is nothing new. Actors in big franchises — from “Star Wars” to “Lord of the Rings: The Rings of Power” to “Bridgerton” — have long had to battle torrents of racism, sexism and homophobia on social media. Hollywood studios have even launched specialized focus group testing and begun training their actors in a social media boot camp to get ahead of it.\n\t\n\n\tStill, many “Stranger Things” viewers clarified that they took no issue with Will’s sexuality, which has been alluded to since the first season. Rather, they criticized the show’s clunky exposition, slow-moving plot and half-baked writing. \n\n\tVariety chief TV critic Alison Herman, for one, argued that the show declined to “enrich its characters as they age” and “remains primarily pastiche, so indebted to inherited archetypes (mad scientist, reformed bully) and references (The Clash, Peanut Butter Boppers) that its main cultural impact comes from extratextual elements like casting and the ascendance of Netflix.”\n\n\tDaniel D’Addario, Variety‘s chief correspondent, wrote that Will’s speech “strikes an emotional chord,” as it reflects actor Schnapp’s own coming out process. From his column: “This, a pivotal character opening up about being queer on a show as massive as ‘Stranger Things,’ feels seismic — and, oddly, like the culmination of a very long journey.”\n\n\tIn an interview about the episode, Schnapp told Variety he was “in tears” when he first read the scene, which he filmed over the span of nearly 24 hours. “The cast was so gracious. I’ll never forget how supportive they were on that day and how respectful and giving they were to me,” he said.\n\n\tThe final episode of “Stranger Things” debuts on Netflix and in theaters on Dec. 31.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Stranger Things 5’ Gets Review Bombed as Will’s Coming Out Becomes Worst-Rated Episode on IMDb",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/StrangerThings_S5_0509_R.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-29T20:30:10.000Z",
      "dateModified": "2025-12-29T20:30:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ryan Coogler Details Original ‘Black Panther 2’ Script Before Chadwick Boseman’s Death: T’Challa, His 8-Year-Old Son and a ‘180-Page Draft’ That ‘I Loved’",
    "url": "https://variety.com/2025/film/news/ryan-coogler-black-panther-2-script-chadwick-boseman-death-1236619293/",
    "image": "https://variety.com/wp-content/uploads/2025/12/MCDBLPA_EC085.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-29T21:02:53.000Z",
    "description": "\n\tRyan Coogler appeared on the “Happy Sad Confused” podcast amid his ongoing awards season press tour for “Sinners” and revealed the original story pl",
    "body": "\n\tRyan Coogler appeared on the “Happy Sad Confused” podcast amid his ongoing awards season press tour for “Sinners” and revealed the original story plans for “Black Panther 2.” The director was well into development on the sequel to his Oscar-winning 2018 blockbuster when lead actor Chadwick Boseman died in August 2020 from colon cancer. Boseman’s tragic passing forced Coogler to completely overhaul the sequel into what would become 2022’s “Black Panther: Wakanda Forever.”\n\t\n\n\tMarvel fans wondering what Coogler originally planned for Boseman’s return finally have an answer as Coogler told “Happy Sad Confused” podcast host Josh Horowitz that his original “Black Panther 2” script focused on an adventure between Boseman’s T’Challa and the character’s 8-year-old son. Namor, played by Tenoch Huerta in “Wakanda Forever,” was still the main villain.\n\n\t“The big thing with the script was a thing called the Ritual of 8 where a prince is 8 years old, he must spend 8 days in the bush with his father,” Coogler said. “The rule is for those 8 days the prince can ask the father any question and the father must answer. In the course of those 8 days, Namor launches an attack… he had to deal with someone who’s insanely dangerous but because of this ritual, his son had to be joined at his hip the whole time or else they’d violate this ritual that had never been broken. It was insane. Chadwick was going to kill it, but life goes as it goes.”\n\n\n\tCoogler confirmed that he finished this version of the “Black Panther 2” script and reached out to Boseman to read it, but “he was too sick” to do so.\n\t\n\n\t“He was at a place where it wasn’t going to happen,” the director added. “Our relationship was very interesting. He meant a lot of me but I found out after his passing from his family and his friends about how much I meant to him. That fucked me up pretty good. I wonder if he knew how much he meant to me. I did wonder… But I loved that script. I put so much into that version of the movie because I felt like I had gotten to know Chadwick as a performer. I threw a lot at him in the first ‘Panther’ but I realized I was just scratching the surface. It was a 180-page draft.”\n\n\tCoogler also revealed that he originally wanted to use Kraven the Hunter in the first “Black Panther” movie, but he was blocked from doing so, as the character is owned by Sony and not Disney.\n\n\t“[I] wanted to base it on the Christopher Priest run of ‘Panther,’ and his run starts with Panther and Kraven in the kitchen,” Coogler said. “That’s the first thing. It’s Ross, Panther and Kraven fighting in the kitchen.”\n\n\t“I’m a big Spider-Man fan, especially ‘Spider-Man: The Animated Series.’ Kraven is in that. He’s also great in the books,” Coogler continued. “I was like, ‘Yo, can I have Kraven in the movie?’ They were like, ‘We don’t think so, but let us check.’ So, they hit Sony, and Sony was like, ‘Absolutely not.’ They came back to me like, ‘Yo, we can’t do it.’ So, I was like, ‘Okay.’”\n\n\tSony would ultimately end up making its own “Kraven the Hunter” movie with director J.C. Chandor and actor Aaron Taylor-Johnson in the title role, although it was a box office dud with $62 million worldwide in December 2024.\n\n\tFollowing the critical and commercial success of “Sinners,” Coogler is now in development on a third “Black Panther” movie at Marvel Studios. \n\n\tWatch his full interview on the “Happy Sad Confused” podcast in the video below.\n\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ryan Coogler Details Original ‘Black Panther 2’ Script Before Chadwick Boseman’s Death: T’Challa, His 8-Year-Old Son and a ‘180-Page Draft’ That ‘I Loved’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/MCDBLPA_EC085.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-29T21:02:53.000Z",
      "dateModified": "2025-12-29T21:02:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NASCAR Driver Denny Hamlin's Dad Dead Following North Carolina House Fire",
    "url": "https://www.tmz.com/2025/12/29/nascar-star-denny-hamlins-dad-dead-following-north-carolina-house-fire/",
    "image": "https://imagez.tmz.com/image/e3/16by9/2025/12/29/e3d987855c7d46adbae4788697b73097_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-12-30T02:09:30.000Z",
    "description": "\n    \n                    \n                          NASCAR's Denny Hamlin\n                          Dad Dead, Mom Critically Injured in House Fire\n  ",
    "body": "\n    \n                    \n                          NASCAR's Denny Hamlin\n                          Dad Dead, Mom Critically Injured in House Fire\n                      \n                  \n                                                                        Published \n                              December 29, 2025\n                            6:09 PM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Tragedy has struck NASCAR driver Denny Hamlin ... his dad has died following a devastating house fire in North Carolina that also left his mother critically injured.\n      \n    \n          On Monday evening, Gaston County EMS confirmed 75 year old Dennis Hamlin died from injuries suffered in the blaze. Hamlin's 69 year old mom, Mary Lou Hamlin was injured in the fire and remains in critical condition.\n      \n\n          Officials say both victims managed to escape the burning home but suffered catastrophic injuries. Dennis was transported to the hospital, where he later died from his injuries.\n      \n    \n          The fire destroyed the home. Firefighters were forced to truck in water due to a lack of hydrants, slowing efforts to control the blaze. It took about two hours to bring the fire under control.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Despite the extensive damage, firefighters were able to save some racing memorabilia and collectibles from inside the home.\n      \n    \n          The cause of the fire remains under investigation. Denny has not yet commented publicly on the tragedy.\n      \n      \n              \n          \n                          \n                TMZ Sports\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NASCAR Driver Denny Hamlin's Dad Dead Following North Carolina House Fire",
      "image": [
        "https://imagez.tmz.com/image/e3/16by9/2025/12/29/e3d987855c7d46adbae4788697b73097_xl.jpg"
      ],
      "datePublished": "2025-12-30T02:09:30.000Z",
      "dateModified": "2025-12-30T02:09:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Guess Who This Kid With Presents Turned Into!",
    "url": "https://www.tmz.com/2025/12/30/guess-who-kid-presents/",
    "image": "https://imagez.tmz.com/image/ed/16by9/2025/12/15/ed594c40ee17492780d193321bb8fa67_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-12-30T08:10:28.000Z",
    "description": "\n    \n                    \n                          Guess Who This\n                          Kid With Presents\n                          Turned Into!",
    "body": "\n    \n                    \n                          Guess Who This\n                          Kid With Presents\n                          Turned Into!\n                      \n                  \n                                                                        Published \n                              December 30, 2025\n                            12:10 AM PST\n                                                                            \n      \n    \n          Before this kiddo with Christmas presents turned into a musician, he was just growing up in the cold, posting covers on Vine, and started playing guitar at 13 years old.\n      \n    \n          He can definitely hold his own, but he's collaborated with music's biggest stars like Justin Bieber and Camila Cabello. When he's not in the studio, catch him hiking with his shirt off!\n      \n    \n          \"I love it when you call me Señorita!\"\n      \n    \n          Do you 'wonder' who this singer from Canada is? \n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Guess Who\n              \n                          \n                Kids\n              \n                          \n                celebrity kids\n              \n                          \n                Photo Galleries\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Guess Who This Kid With Presents Turned Into!",
      "image": [
        "https://imagez.tmz.com/image/ed/16by9/2025/12/15/ed594c40ee17492780d193321bb8fa67_xl.jpg"
      ],
      "datePublished": "2025-12-30T08:10:28.000Z",
      "dateModified": "2025-12-30T08:10:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tyler Perry Accuser Defends Friendly Texts Amid Lawsuit",
    "url": "https://www.tmz.com/2025/12/29/tyler-perry-accuser-responds-to-leaked-text-thread/",
    "image": "https://imagez.tmz.com/image/78/16by9/2025/12/26/78d3586ea9a64623a030b1c574dcff0d_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-12-30T01:50:36.000Z",
    "description": "\n    \n                    \n                          Tyler Perry\n                          Accuser Doubles Down on Sexual Assault Claims\n             ",
    "body": "\n    \n                    \n                          Tyler Perry\n                          Accuser Doubles Down on Sexual Assault Claims\n                          ... Despite Friendly Texts\n                      \n                  \n                                                                        Published \n                              December 29, 2025\n                            5:50 PM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Mario Rodriguez -- the man who accused Tyler Perry of sexual battery last week -- says friendly text messages the two allegedly exchanged don’t undermine his claims and are actually consistent with his account.\n      \n    \n          The model and actor told PEOPLE ... “I want to briefly respond to what’s being said about me right now. People are pointing to messages where I was polite, grateful, or vulnerable — and trying to use that to discredit me.”\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          He continues, “When someone has influence over your career, your income, your future, you don’t feel free. Survivors often stay cordial. They often ask for help when they feel desperate.”\n      \n    \n          Rodriguez adds that the messages don’t negate his allegations. “That does not mean abuse didn’t happen. Those text messages were sent at a time when I was especially vulnerable, as can be seen from the context. Continued financial support and access are not inconsistent with abuse — they are often part of the power dynamics that follow it.”\n      \n\n          We broke the story ... the texts allegedly show Rodriguez asking Perry for financial help to address a dental health issue. The messages also appear to show Rodriguez thanking Perry repeatedly for his support and friendship.\n      \n    \n          The texts were allegedly sent before Rodriguez filed a sexual assault and sexual battery lawsuit against Perry on Christmas, accusing the movie mogul of making unwanted advances and, in one instance, allegedly grabbing his penis.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Perry’s attorney, Alex Spiro, strongly denies the claims, telling TMZ ... “This is nothing but a $77 million money grab scam.”\n      \n    \n          Tyler denies all allegations against him.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Mario Rodriguez\n              \n                          \n                Tyler Perry\n              \n                          \n                Celebrity News\n              \n                          \n                TV\n              \n                          \n                Movies\n              \n                          \n                Comedy\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tyler Perry Accuser Defends Friendly Texts Amid Lawsuit",
      "image": [
        "https://imagez.tmz.com/image/78/16by9/2025/12/26/78d3586ea9a64623a030b1c574dcff0d_xl.jpg"
      ],
      "datePublished": "2025-12-30T01:50:36.000Z",
      "dateModified": "2025-12-30T01:50:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Taylor Swift Fan Frames Portion of $600 Tip From Chiefs Game",
    "url": "https://www.tmz.com/2025/12/29/taylor-swift-fan-frames-tip-from-chiefs-game/",
    "image": "https://imagez.tmz.com/image/f1/16by9/2025/12/29/f192406c236c4d6f92035fe098978111_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-12-29T23:10:48.000Z",
    "description": "\n    \n                    \n                          Taylor Swift\n                          Tip of the Arrowhead ....\n                          Fan Fr",
    "body": "\n    \n                    \n                          Taylor Swift\n                          Tip of the Arrowhead ....\n                          Fan Frames Giant Gratuity From Chiefs Game\n                      \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          A worker at Arrowhead Stadium on Christmas got the shock of her lifetime when Taylor Swift dropped a massive tip ... a gesture so shocking, the suite staffer had to frame one of the six fresh Benjamins.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          TMZ has learned a viral Facebook post from a stadium employee named Robyn Gentry talking about the superstar's Xmas generosity is legit ... TS indeed tipped $600 to the unsuspecting worker.\n      \n    \n          As Robyn tells it ... TS was at the Christmas game to watch fiancé Travis Kelce play maybe his last NFL game ... and superstar was so appreciative of staff working on the holiday, she was handing out her own gifts ... that being cold hard cash.\n      \n\n                  \n          \n                          \n                \n                                  \n      \n    \n          Robyn explained the money was her “whole paycheck for two weeks\" and she was so touched, she had to frame one of the bills. Although as of her Sunday post ... she still had not spent any of the $600.\n      \n    \n          Needless to say ... it didn't take long for Swifties to see the post -- and make it go viral with shares and comments.\n      \n    \n          We reached for a rep for TS for comment ... so far, no word back.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Taylor Swift\n              \n                          \n                Travis Kelce\n              \n                          \n                Celebrity News\n              \n                          \n                Money\n              \n                          \n                Kansas City Chiefs\n              \n                          \n                TMZ Sports\n              \n                          \n                Music\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Taylor Swift Fan Frames Portion of $600 Tip From Chiefs Game",
      "image": [
        "https://imagez.tmz.com/image/f1/16by9/2025/12/29/f192406c236c4d6f92035fe098978111_xl.jpg"
      ],
      "datePublished": "2025-12-29T23:10:48.000Z",
      "dateModified": "2025-12-29T23:10:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Dakota Johnson and Role Model Seen Getting Cozy Together at Dinner in L.A.",
    "url": "https://www.tmz.com/2025/12/29/dakota-johnson-role-model-together-dinner-photos/",
    "image": "https://imagez.tmz.com/image/89/16by9/2025/12/29/89fbb4eef966464db9d18c0d6a802e01_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-12-29T23:16:31.000Z",
    "description": "\n    \n                    \n                          Dakota Johnson\n                          I Need A Role Model In My Life!!!\n                      ",
    "body": "\n    \n                    \n                          Dakota Johnson\n                          I Need A Role Model In My Life!!!\n                      \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Dakota Johnson reportedly split from Chris Martin earlier this year ... and now she's been spotted out with another singer -- Role Model.\n      \n    \n          A new photo shows Dakota and RM -- whose real name is Tucker Pillsbury -- huddled over a candlelit dinner over the holiday with friends, and we're told they got very close.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Sources tell us Dakota was lying on him all cuddled up at the cozy dinner.\n      \n    \n          Dakota was snapped taking a sip from her glass as they both leaned forward, engulfed in conversation with another dinner guest.\n      \n\n                  \n          \n                          \n                \n                                  \n      \n    \n          The two stars have found themselves single this cuffing season ... as Dakota is coming off of an 8-year relationship with Coldplay's lead singer and RM split from influencer Emma Chamberlain in 2023.\n      \n    \n          Dakota began her on-again, off-again relationship with Chris in 2017, and even got engaged before reportedly breaking things off for good in June.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Role Model and Emma broke up after 3 years, reportedly providing the inspiration for his album, \"Kansas Anymore.\"\n      \n    \n          There's no word on whether the two are officially an item, but they sure do look cute together!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Dakota Johnson\n              \n                          \n                Chris Martin\n              \n                          \n                Celebrity News\n              \n                          \n                Relationships\n              \n                          \n                Movies\n              \n                          \n                Couples\n              \n                          \n                Exclusive\n              \n                          \n                Music\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Dakota Johnson and Role Model Seen Getting Cozy Together at Dinner in L.A.",
      "image": [
        "https://imagez.tmz.com/image/89/16by9/2025/12/29/89fbb4eef966464db9d18c0d6a802e01_xl.jpg"
      ],
      "datePublished": "2025-12-29T23:16:31.000Z",
      "dateModified": "2025-12-29T23:16:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]