[
  {
    "title": "Gwyneth Paltrow Says She Was ‘Fired’ From a Movie After Divorce With Chris Martin: Distributor Thought She Was ‘Too Hot to Touch’",
    "url": "https://variety.com/2026/film/news/gwyneth-paltrow-fired-film-divorce-chris-martin-1236624847/",
    "image": "https://variety.com/wp-content/uploads/2025/10/P102FN2H.jpg?crop=0px%2C33px%2C2000px%2C1125px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-01-07T02:54:17.000Z",
    "description": "\n\tGwyneth Paltrow recently told Amy Poehler on her “Good Hang” podcast that she was “fired off” a film shortly after her divorce from Coldplay lead si",
    "body": "\n\tGwyneth Paltrow recently told Amy Poehler on her “Good Hang” podcast that she was “fired off” a film shortly after her divorce from Coldplay lead singer Chris Martin. The “Marty Supreme” star speculated that the distributor thought she was “too hot to touch” at the time of the widely covered split.\n\n\t“I was supposed to do a movie at one point, and it was like right after the conscious uncoupling thing with Chris, and there was a lot of harsh stuff in the press,” Paltrow recalled. “I think the distributor was like, ‘This might be too hot to touch.’”\n\t\n\n\tShe added, “So that was great because I was getting a divorce and then I got fired off. So it was so awesome.”\n\n\n\tIn 2014, Paltrow unveiled in a lengthy blog post that she and Martin decided to “consciously uncouple.” The phrase went viral at the time, with some thinking it was a pretentious way to describe a sometimes traumatic experience. Paltrow said she now understands why there was such a fixation on her divorce announcement.\n\n\t“Say you had had a really nasty divorce, or your parents had had a really nasty divorce,” Paltrow said. “And then you hear this idea that like, it doesn’t have to be done this way. I think the implicit learning is like, ‘Oh, fuck. Like, they’re saying I did something wrong.’”\n\n\tShe continued, “That makes sense to me, like, ‘Oh no, is the inference that I mess someone up.’ Like, that’s not a nice thing to contemplate. So I do understand why it was so personal for people.”\n\n\tPaltrow was on “Good Hang” to promote her new film “Marty Supreme.” From A24, Paltrow stars in the sports drama alongside Timothée Chalamet, Odessa A’zion and Kevin O’Leary. The Oscar winner said of the film, “I don’t know if people will like it or not, but it’s a real swing and everyone’s great at their job. And so I was like, ‘Wow, I think I miss this, you know?’”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Gwyneth Paltrow Says She Was ‘Fired’ From a Movie After Divorce With Chris Martin: Distributor Thought She Was ‘Too Hot to Touch’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/P102FN2H.jpg?crop=0px%2C33px%2C2000px%2C1125px&resize=1000%2C563"
      ],
      "datePublished": "2026-01-07T02:54:17.000Z",
      "dateModified": "2026-01-07T02:54:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Under the Flags, the Sun’ Review: Chilling Archive-Driven Doc Tracks the Rise and Fall of South America’s Longest Dictatorship",
    "url": "https://variety.com/2026/film/reviews/under-the-flags-the-sun-review-1236620188/",
    "image": "https://variety.com/wp-content/uploads/2025/12/Under-the-Flags-the-Sun-FLO.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-07T03:00:00.000Z",
    "description": "\n\tNestled — or hidden — in between Brazil and Argentina, the country of Paraguay is mostly absent from the global consciousness. An enigma of a nation",
    "body": "\n\tNestled — or hidden — in between Brazil and Argentina, the country of Paraguay is mostly absent from the global consciousness. An enigma of a nation for most, it bears a turbulent history not forged in isolation but as a consequence of and in conversation with global changes.\n\n\tIn the incisively constructed, archive-footage documentary “Under the Flag, the Sun,” filmmaker Juanjo Pereira positions his small South American homeland as a part of a larger geopolitical context by dissecting the regime of Gen. Alfredo Stroessner. One of the world’s longest-running dictatorships, Stroessner’s rule, under the right-wing Colorado party, began in 1954 after a military coup and only ended in 1989. His promises of progress for the masses eventually turned into a thin veil for violence and human rights violations.\n\t\n\n\tA large percentage of all the material in “Under the Flag” comes from foreign news outlets — some of it from French reporters, a segment from Brazilian television, a few passages in English, plus others likely shot by anonymous cameramen inside the country, likely at great risk. Pereira scoured archives around the world to construct the nonfiction project, but rather than just assembling it, he and editor Manuel Embalse processed the footage for ominous effect, at times playing it in reverse, adding glitches or modifying the color palette. These stylistic flourishes add to the already effective juxtaposition of sound and image that highlight the incongruences between what Stroessner preached and what his government carried out. Solemn declarations about freedom underscore shots of brutalized students.\n\t\n\n\tSome U.S. viewers may still find it surprising to learn of their government’s involvement in perpetuating the suffering of people abroad. Like other autocrats in South America and elsewhere during the second half of the 20th century, Stroessner ruled with the White House’s support — not because his policies ensured the advent of democracy for the Paraguayan people, but because he served U.S. goals of abolishing communism from the Americas. Known as Operation Condor by intelligence agencies, the U.S. meddling in South American politics also affected Chile, Argentina, Bolivia, Brazil and Uruguay.\n\n\tAs if in a parade of horrors, the dictators in some of those neighboring countries have cameos in “Under the Flag,” either on screen or mentioned in the narration from the time, further cementing Pereira’s aim to portray the situation in Paraguay as part of a regional affliction. Over more than three decades, Stroessner visited dignitaries beyond the Americas, including those in Japan and France. The trips, whether tacitly or explicitly, legitimized his regime on the world stage even as thousands of Paraguayans were forced into exile or tortured and disappeared at home. The atrociousness went deeper, however.\n\n\tIf Stroessner doesn’t sound to you as a last name typical of a person from a former Spanish colony in Latin American, that’s because the dictator, in no ambiguous terms a Nazi sympathizer, was the son of a German immigrant father. Pereira spends a substantial portion of the doc on Stroessner’s support of Josef Mengele, the Nazi doctor behind numerous deaths at Auschwitz, as well as abhorrent experiments. Mengele found refuge in Paraguay among other exiled Nazis and a powerful ally in Stroessner, who granted him Paraguayan citizenship to prevent extradition. Questions about the disturbing connection went unanswered since Stroessner controlled local media and refused to oblige inquiries from foreign journalists when confronted.\n\n\tPropaganda songs in Guaraní, an Indigenous language still widely spoken in Paraguay, revere Stroessner as a hero. And yet, his government was accused of exploiting and segregating Indigenous communities. That Guaraní has endured as a tongue taught in schools, still present in all aspects of Paraguay, is a fascinating rarity in Latin America. Missing from Pereira’s examination is a more direct engagement with how the language played a role in shaping the country’s identity during the Stroessner years. Though the absence may reflect the limitations of archival material, near the end, a speech by a Guaraní-speaking partyman attests to the façade of false inclusivity that Stroessner procured.\n\t\n\n\tAn unsettling and informative introduction to Paraguay’s recent past, “Under the Flag, the Sun” attests to the notion of humanity’s interconnectivity even before the age of the internet. The chain reactions of international affairs reach even the places and people the Global North dismisses — often to their detriment. In preserving the history of Paraguay, Pereira is preserving a communal memory. Proof of the cyclical and mirroring nature of history is the image of a toppled statue of Stroessner that closes the film, an event that has now become synonymous with a fallen tyrant, no matter the latitude.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Under the Flags, the Sun’ Review: Chilling Archive-Driven Doc Tracks the Rise and Fall of South America’s Longest Dictatorship",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/Under-the-Flags-the-Sun-FLO.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-07T03:00:00.000Z",
      "dateModified": "2026-01-07T03:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "DreamWorks Remote Team, Netflix and ‘Ted’ Show Production Workers Vote to Unionize with The Animation Guild",
    "url": "https://variety.com/2026/artisans/news/dreamworks-netflix-ted-show-unionize-animation-guild-1236624786/",
    "image": "https://variety.com/wp-content/uploads/2025/06/10E61_TP_00010.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-07T00:56:59.000Z",
    "description": "\n\tDreamWorks Animation (DWA) remote workers across the United States, feature production workers at Netflix Animation Studios and production workers o",
    "body": "\n\tDreamWorks Animation (DWA) remote workers across the United States, feature production workers at Netflix Animation Studios and production workers on the show “Ted” have officially voted to unionize with the Animation Guild (IATSE Local 839) and the Editors Guild (IATSE Local 700), in an effort to ensure fair pay and treatment for all animation workers.\n\n\tThe National Labor Relations Board (NLRB) ballot count for DWA remote workers resulted in a majority “yes” vote in favor of union representation with the Animation Guild. DreamWorks Animation studio will formally recognize the remote bargaining unit under TAG and begin the process of negotiating a contract.\n\t\n\n\tThe newly-recognized unit represents remote workers living throughout the U.S. who contribute to LA–based DWA animation projects across both feature and television. These workers perform work already covered under TAG’s Master Agreement when done onsite on campus in LA County, and include roles such as story artists, animators, character effects artists, technical directors, lighters, visual development artists, modelers and production coordinators, among others.\n\n\n\tRemote workers organized to address longstanding inequities between remote and on-campusemployees. Union recognition establishes a path forward for collective bargaining aimed at securingequal treatment and sustainable working conditions for remote employees.\n\n\tTAG’s business representative, Steve Kaplan, said, “These units overwhelmingly voted in favor ofTAG representation after facing the degrading process of being forced into an NLRB election and theunnecessary delay of the government shutdown.” He added, “We are continuing to expand our jurisdiction both inside and outside the scope of our Master Agreement as we continue to look forward toprotecting the rights of all animation workers regardless of zip code.”\n\t\n\n\tAnthony Holden, a remote story artist and organizing committee member based in Washington State, said: “I’ve valued the opportunity to help unite our voices in seeking equality with our on-campus counterparts in terms of workers’ rights, fair pay, access to healthcare and retirement benefits, among other issues. We look forward to negotiating with the company to secure a fair agreement that will foster a workplace environment which is equitable to remote employees and will contribute to DreamWorks’ commercial and artistic success.”\n\n\tFeature production workers at Netflix Animation Studios and production workers on the “Ted” show are also celebrating their own NLRB victories to unionize with TAG and the Editors Guild. The elections took place on Dec. 23rd and Dec. 30th, respectively.\n\n\t“During my five years at NAS, my amazing production colleagues have shown up each day with diligence, passion and a breadth of skills and experience, both creative and strategic,” said production coordinator Erin Sullivan. “As a part of TAG, I’m excited for the opportunity we now have to represent ourselves as a unit, and I’m encouraged by the other production management teams in our industry who have set the bar.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "DreamWorks Remote Team, Netflix and ‘Ted’ Show Production Workers Vote to Unionize with The Animation Guild",
      "image": [
        "https://variety.com/wp-content/uploads/2025/06/10E61_TP_00010.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-07T00:56:59.000Z",
      "dateModified": "2026-01-07T00:56:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "David Harbour Exits Tony Gilroy’s Searchlight Drama ‘Behemoth!’",
    "url": "https://variety.com/2026/film/news/david-harbour-exits-behemoth-tony-gilroy-searchlight-1236624860/",
    "image": "https://variety.com/wp-content/uploads/2026/01/GettyImages-2212504898.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-07T04:05:13.000Z",
    "description": "\n\tDavid Harbour has dropped out of “Behemoth!,” an upcoming drama film from “Michael Clayton” director Tony Gilroy and Searchlight Pictures. \n\n\tA repr",
    "body": "\n\tDavid Harbour has dropped out of “Behemoth!,” an upcoming drama film from “Michael Clayton” director Tony Gilroy and Searchlight Pictures. \n\n\tA representative for Searchlight Pictures confirmed to Variety that Harbour stepped back from his role.\n\n\tHarbour was set to star alongside Pedro Pascal and Olivia Wilde in the film. Multiple insiders familiar with the project said Harbour was overwhelmed by the series wrap of “Stranger Things” — a monthslong episodic rollout and global water cooler moment with intense press scrutiny — and stepped away from the project to rest. The role has been recast, two sources said, though Harbour’s replacement was not immediately known. \n\t\n\n\tReps for Harbour did not immediately return requests for comment. While plot details remain scarce, an official logline for “Behemoth!” briefly states the film follows “a musician from a family of musicians who returns to Los Angeles,” serving as “a love letter to the music of the movies and the people who make it.” Gilroy penned the script and directs. He also serves as producer with Sanne Wohlenberg.\n\n\n\tThroughout his career, Harbour has remained very open about his journey with mental health. He was diagnosed with bipolar disorder at 26 years old after an intense episode. He told Variety in a 2022 interview that, although there are more conversations today about “wanting an open dialogue about mental illness,” the focus is often solely on the “tragedy.”\n\n\t“The colors of that dialogue need to be much broader in the sense of everything,” he added. “We pathologize this idea of normal and in truth, everybody has a lot of different experiences we should try to appreciate.”\n\t\n\n\tHarbour is best known for playing Jim Hopper on Netflix’s “Stranger Things.” First premiering on the streamer in 2016, the sci-fi drama series just capped off its fifth and final season with a two-hour finale. His other recent credits include films like “Thunderbolts*,” “A Working Man” and “Gran Turismo,” and TV shows like “Marvel Zombies” and “Creature Commandos.”\n\n\tThe story was first reported by Hollywood-centric social media gossip account Deuxmoi. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "David Harbour Exits Tony Gilroy’s Searchlight Drama ‘Behemoth!’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/GettyImages-2212504898.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-07T04:05:13.000Z",
      "dateModified": "2026-01-07T04:05:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Elle Fanning Says Colin Firth ‘Rushed to My Side’ When She Fainted at Cannes in 2019 Because ‘My Dress Was Too Tight’: ‘It Was the Talk of the Festival’",
    "url": "https://variety.com/2026/film/news/elle-fanning-colin-firth-fainted-cannes-1236624710/",
    "image": "https://variety.com/wp-content/uploads/2026/01/MixCollage-06-Jan-2026-02-33-PM-132.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-06T22:46:18.000Z",
    "description": "\n\tElle Fanning recently spoke to W Magazine for the publication’s Great Performances issue and remembered her infamous fainting incident at the 2019 C",
    "body": "\n\tElle Fanning recently spoke to W Magazine for the publication’s Great Performances issue and remembered her infamous fainting incident at the 2019 Cannes Film Festival, where the actor was in attendance as a member of the competition jury. Fanning collapsed while seated at the Chopard Trophee dinner and said Colin Firth immediately came to her aid.\n\n\t“Yes, my dress was too tight,” Fanning said. “My sister was sitting at another table, and she saw my chair just completely fall back. It’s kind of hilarious—very dramatic. Colin Firth was there, and he rushed to my side. It was the talk of the festival. But I’m known to faint. In school, I would faint a lot. I grew, like, seven inches in one year, and I guess my body was growing so much that I got altitude sickness.”\n\t\n\n\tVariety was on the scene in 2019 when Fanning fainted. Festival director Thierry Fremaux had just introduced actor Francois Civil onstage when Fanning collapsed and fell off her chair while seated at a dinner table. She was seated at a table next to her sister Dakota Fanning, who helped the actress to her feet before security whisked them away. Fanning later posted about the incident on her Instagram, saying she was “all good” and that her dress was simply “too tight.”\n\n\tFanning served on the Cannes competition jury in 2019 alongside directors such as Yorgos Lanthimos, Kelly Reichardt, Paweł Pawlikowski and Alice Rohrwacher, among others. “Birdman” and “The Revenant” director Alejandro González Iñárritu served as jury president. The group made history by awarding the Palme d’Or to Bong Joon Ho’s “Parasite,” which became the first South Korean film to take Cannes’ top prize. “Parasite” went on to win the Oscar for best picture. Other notable Cannes winners included Antonio Banderas, who won best actor for “Pain and Glory.”\n\t\n\n\tCannes has screened several Fanning-starring films over the years. Just last year, Fanning was in attendance with Joachim Trier’s Grand Prix-winning “Sentimental Value.” She also starred in Sofia Coppola’s “The Beguiled,” which won best director honors at the 2017 festival. Coppola was the second woman to win best director in Cannes’ history. Fanning was also the star of Nicolas Winding Refn’s “The Neon Demon,” which was one of the most divisive entries at the 2016 Cannes Film Festival and prompted both cheers and walkouts during its premiere.\n\n\tFanning has been on the awards circuit this season with “Sentimental Value,” which immediately launched to Oscar buzz in Cannes. The film is Norway’s submission for the international feature Oscar. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Elle Fanning Says Colin Firth ‘Rushed to My Side’ When She Fainted at Cannes in 2019 Because ‘My Dress Was Too Tight’: ‘It Was the Talk of the Festival’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/MixCollage-06-Jan-2026-02-33-PM-132.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-06T22:46:18.000Z",
      "dateModified": "2026-01-06T22:46:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Béla Fleck Withdraws From Kennedy Center Concerts After Trump Name Change: ‘Performing There Has Become Charged and Political’",
    "url": "https://variety.com/2026/music/news/bela-fleck-withdraws-kennedy-center-after-trump-name-change-1236624777/",
    "image": "https://variety.com/wp-content/uploads/2026/01/GettyImages-2197298920-e1767745877183.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-07T00:36:31.000Z",
    "description": "\n\tBéla Fleck is the latest to join the growing list of artists who have withdrawn from performing at the John F. Kennedy Center for the Performing Art",
    "body": "\n\tBéla Fleck is the latest to join the growing list of artists who have withdrawn from performing at the John F. Kennedy Center for the Performing Arts in the wake of Donald Trump adding his name to the venue.\n\n\tThe banjo player was set to perform with the National Symphony Orchestra on February 19, 21 and 22 for the world premiere of “American Mosaic,” described on the Center’s website as “a true celebration of American music.” But Fleck took to social media on Tuesday to explain that the political implications of appearing at the venue have taken precedence over the music itself.\n\t\n\n\t“I have withdrawn from my upcoming performance with the NSO at The Kennedy Center,” wrote Fleck. “Performing there has become charged and political, at an institution where the focus should be on the music. I look forward to playing with the NSO another time in the future when we can together share and celebrate art.”\n\n\n\n\tThe Center updated the listing for the concerts with a note acknowledging Fleck’s decision not to perform. “Due to personal issues Béla Fleck regrettably has to withdraw from his performances with the National Symphony Orchestra,” reads the note, which adds that “American Mosaic” will now feature NSO Principal Clarinet Ling Ma performing Aaron Copland’s Clarinet Concerto.\n\n\tFleck is one of many artists who have recently canceled their appearance at the Center, including some who withdrew after Trump’s name was added alongside John F. Kennedy’s at the venue. Last week, songwriter Stephen Schwartz said he would not take part in a program spotlighting him at the Center, stating, “It no longer represents the apolitical place for free artistic expression it was founded to be” and that “there’s no way I would set foot in it now.” At the end of 2025, two more acts — veteran jazz septet the Cookers and dance troupe Dog Varone and Dancers — canceled their performances.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Béla Fleck Withdraws From Kennedy Center Concerts After Trump Name Change: ‘Performing There Has Become Charged and Political’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/GettyImages-2197298920-e1767745877183.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-07T00:36:31.000Z",
      "dateModified": "2026-01-07T00:36:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chloé Zhao, Amanda Seyfried and Mona Fastvold on  Spotlighting Female Perspectives on Film",
    "url": "https://variety.com/2026/film/news/chloe-zhao-amanda-seyfried-mona-fastvold-kering-palm-springs-1236624499/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Chloe-Zhao-Amanda-Seyfried-Mona-Fastvold.jpg?crop=0px%2C19px%2C2160px%2C1215px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-01-06T23:00:00.000Z",
    "description": "\n\t“Hamnet” and “The Testament of Ann Lee” screened during this year’s Palm Springs International Film Festival, and following each of the films, direc",
    "body": "\n\t“Hamnet” and “The Testament of Ann Lee” screened during this year’s Palm Springs International Film Festival, and following each of the films, directors Chloé Zhao and Mona Fastvold, as well as “Ann Lee” star Amanda Seyfried, discussed the feminine energy that fueled their work on-screen and behind the scenes.\n\n\tOnstage, Zhao confirmed rumors that when she first received the call from producer Steven Spielberg’s Amblin Entertainment to adapt Maggie O’Farrell’s emotional novel about William and Agnes Shakespeare, she initially replied, “I’m not sure.”\n\t\n\n\tZhao partially credits her reticence to the hectic nature of the call, which came through during her spottily serviced drive to the Telluride Film Festival a few years ago. Once she arrived at the festival, though, she was asked to meet with actor Paul Mescal. It was a moment of kismet.\n\n\t“Just looking at him, I saw a young Shakespeare. He had an earring,” Zhao told Variety’s Angelique Jackson, who moderated both conversations. “I just said to him, ‘Have you ever thought about playing young William Shakespeare?’ and he said, ‘Well, if you’re talking about “Hamnet…” Because I love the book. You have to read the book. It is perfect for you. It’s not what you think it is.’”\n\n\tZhao took Mescal’s advice and read O’Farrell’s 2020 novel, which tells a mostly fictional story about how the death of William and Agnes’ son Hamnet inspired the Bard to write “Hamlet.” When Zhao read it, she immediately thought of Jesse Buckley for Agnes. “All I saw was Jesse,” the filmmaker recalled. “It was very tunnel vision.”\n\t\n\n\tCasting Buckley proved fruitful not just for her committed performance but for her contributions to the production as a whole. Zhao explained that the actress helped her and O’Farrell rewrite the ending. While the novel ends with the emphatic line “Remember me,” and the initial script concluded with Hamlet dying on stage during the play’s debut performance at the Globe Theatre, the film added an emotional final scene of Agnes and the Globe’s crowd reaching out towards the actor in a moment of collective grief and empathy.\n\n\t“Jesse sent me Max Richter’s ‘This Bitter Earth,’ which is a lyrics version of ‘On the Nature of Daylight,’” Zhao recalled. “I was listening to the song in the car, and I started to cry. I felt tightness in my heart, but also opening. And then I started reaching out to the window. I was trying to touch the rain outside.” Zhao was going through a personal loss at the time, she explained. “But this gesture, I realized, I was trying to reach for something bigger that I could be a part of, so that I would have the strength to let go. And then I realized that’s what Hamlet needed.”\n\n\n\n\t\n\n\t\t\t\t\t“Hamnet” filmmaker Chloé Zhao poses with Kering Americas president Ewa Abrams at the 37th annual Palm Springs International Film Festival.\n\t\t\t\t\t\t\t\t\tVivien Killilea/Getty Images for Palm Springs International Film Society\n\t\n\n\n\n\tThat collaborative spirit and emotional intuition are indicative of why Amblin wanted Zhao to direct “Hamnet” in the first place. Zhao jokes that empathy has always been a part of her nature, and that she can now prove to her parents that the “oversensitive child had a purpose.”\n\n\tMore sincerely, though, she said, “Sometimes we’re made to be ashamed of the part of ourselves that seeks connection and relatedness and love as if it’s less important, not productive or weak, but that is the life force. That is the force that binds. That is the creative energy that crosses everything together, that sustains and fosters growth and enhances everything in life. So as vulnerable as it feels, I would try to create from that place and seek that connection.”\n\n\tMona Fastvold is no stranger to leading from a feminine lens, either. As a director, her filmography consists of “The Sleepwalker,” “The World to Come” and now, “The Testament of Ann Lee” — all of which focus on powerful female characters. Only recently, however, has she come to embrace the label of a “female director.”\n\t\n\n\tShe associates some of that empathetic approach to “female leadership,” which she suggests, “doesn’t just mean women. It means the feminine consciousness in all people is drawing strength from interdependence, not dominance. It’s drawing strengths from intuition, relationships, community and interdependence.” \n\n\tRegarding being just one of nine women out of 111 directors who helmed 2025’s 100 top-grossing films, Zhao says the data indicates that a more feminine approach “doesn’t fit into the current model that we exist in, the container we exist in. It’s difficult to come through, and I feel very lucky that I had people in power that trusted that this way of leading is needed for this story.”\n\n\t“I used to resent being called that, and now I love it,” Fastvold told Variety, seated next to the film’s star, Amanda Seyfried. “I will take it. I will be a ‘female director,’ and tell feminist stories about women. I’m very proud of it.”\n\n\tSeyfried plays the titular heroine, a real-world figure who lived in the 18th century and founded the Shakers, a religious movement that championed gender equality and communal living, and whose followers expressed faith through dance. As chronicled through the film, Lee’s followers began to see her as a female messiah while others marked her for persecution. \n\n\t“The Shakers worship through ecstatic song and dance,” Fastvold explained. “There was something about this idea of expressing faith through movement and song in such a free and intense and guttural way that was very exciting to me and scary.”\n\n\tAccordingly, the film is a historical musical. Fastvold initially expressed trepidation towards directing her first musical, but saw the genre as unavoidable given the subject matter. \n\n\t“Making a musical is scary, even though it’s a different kind of musical,” the director reflected. “I’d never made a musical before. My background is in dance, but I knew that I had to approach it in a different way and that I couldn’t really look to other projects as inspiration for this. So it was kind of terrifying. But the short answer is it had to be a musical because that’s how they worshipped. They kind of lived their life in that way.”\n\n\tThe director cast Seyfried partially because of her singing and dancing capabilities, as showcased in her roles in “Mamma Mia” and “Les Misérables.” Even so, embodying Lee and choreographing her intense movements proved to be demanding for the seasoned actress. \n\t\n\n\t“As challenging as it was for me to memorize those moves, once I got there, I felt closer to Ann Lee and once we were all moving in unison, it just takes you to another place,” Seyfried said. “You just had to feel like it was part of you. It was an extension of your body, and then it becomes real for that moment in time.”\n\n\tPart of the challenge came from the fact that the Shakers’ choreographies are buried in history. Seyfried worked with choreographer Celia Rowlson-Hall to create and execute dances that were “based on these paintings and drawings and descriptions” of events that took place over two centuries ago.\n\n\n\n\t\n\n\t\t\t\t\t“The Testament of Ann Lee” star Amanda Seyfried and director Mona Fastvold in conversation with Variety’s Angelique Jackson at the 37th annual Palm Springs International Film Festival.\n\t\t\t\t\t\t\t\t\tPresley Ann/Getty Images for Palm Springs International Film Society\n\t\n\n\n\n\tSeyfried credits the artisans and practitioners across all departments for their thorough research in recreating Lee’s story and the Shaker movement, and she expresses profound esteem for Fastvold, whom the production affectionately referred to as “Mother Mona” on set.\n\n\t“She is very nurturing,” Seyfried said of Fastvold. “Her job as the director is mothering. The leadership comes from this beautiful, nurturing, female, empowered artist. The nurturing quality of her really impacts how we felt on set and I think it went a long way.”\n\n\tSimilarly, Fastvold shared how the opportunity to tell a story about a woman whose historical impact had been unsung fueled her sense of purpose while making the film. \n\n\t“There are so many wonderful, exciting, important female historical figures that are overlooked,” she said. “I feel very lucky that I found Ann Lee.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chloé Zhao, Amanda Seyfried and Mona Fastvold on  Spotlighting Female Perspectives on Film",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Chloe-Zhao-Amanda-Seyfried-Mona-Fastvold.jpg?crop=0px%2C19px%2C2160px%2C1215px&resize=1000%2C563"
      ],
      "datePublished": "2026-01-06T23:00:00.000Z",
      "dateModified": "2026-01-06T23:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "DGA, PGA and BAFTA Predictions: ‘Frankenstein’ Eyes Longlist Dominance, Josh Safdie on Director Bubble and ‘Sinners’ Faces Key International Test",
    "url": "https://variety.com/2026/film/awards/dga-pga-bafta-longlist-predictions-2026-1236624759/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Frankenstein-Marty-Supreme-Sinners.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-07T01:01:39.000Z",
    "description": "\n\tBefore Sunday’s Golden Globes ceremony, Hollywood will officially enter the “playoff” stage — or wildcard — stage of Oscar season. By Friday afterno",
    "body": "\n\tBefore Sunday’s Golden Globes ceremony, Hollywood will officially enter the “playoff” stage — or wildcard — stage of Oscar season. By Friday afternoon, the Directors Guild of America, Producers Guild of America, American Society of Cinematographers and BAFTA will roll out nominations and longlists that will dramatically narrow the field for more than two dozen films vying for Academy Awards attention (Variety’s SAG predictions for Wednesday are here).\n\t\n\n\tHistorically, this stretch becomes one of the highest-pressure tests for campaigns. With Oscar nomination voting starting on Monday, Jan. 12, it doesn’t leave a lot of room for pivots and campaign strategy changes. Momentum hardens, vulnerabilities are exposed and the gap between contenders and pretenders is out in the open.\n\n\n\tAt the DGA, the best director race is expected to align closely with the top contenders for best picture. The likeliest nominees include Paul Thomas Anderson (“One Battle After Another“), Ryan Coogler (“Sinners“) and Chloé Zhao (“Hamnet”). Anderson and Coogler currently lead in director wins for the season.\n\n\tThe two remaining spots represent a competitive dash between beloved veteran Guillermo Del Toro (“Frankenstein“) and American mainstay Josh Safdie (“Marty Supreme”), alongside four internationally known and acclaimed figures: Joachim Trier (“Sentimental Value”), Jafar Panahi (“It Was Just an Accident”), Kleber Mendonça Filho (“The Secret Agent”) and Yorgos Lanthimos (“Bugonia”).\n\n\tThe DGA’s first-time feature category will be one to watch. The category honoring first-time narrative filmmakers puts Eva Victor (“Sorry, Baby”) and Harry Lighton (“Pillion”) at the forefront, with room for actors-turned-directors like Kristen Stewart (“The Chronology of Water”) and Embeth Davidtz (“Don’t Let’s Go to the Dogs Tonight”) in the running.\n\t\n\n\tAt the PGA nominations, which drops on Friday, the guild is coming off overlapping eight of 10 with the Oscars’ best picture category last year, and the year prior achieving a historic 10-for-10 match. That feat isn’t expected to repeat this year given the landscape.\n\n\tThe predicted PGA lineup features Anderson’s “One Battle After Another,” Coogler’s “Sinners” and Zhao’s “Hamnet” as likely locks, joined by Del Toro’s “Frankenstein,” Safdie’s “Marty Supreme” and Trier’s “Sentimental Value.” Also expected to contend are Clint Bentley’s indie drama “Train Dreams,” along with populist favorites such as Joseph Kosinski’s “F1” and Jon M. Chu’s “Wicked: For Good.” We could see James Cameron’s billion-dollar earner “Avatar: Fire and Ash” also pop up.\n\n\tThe ASC race will likely shake things up in the race for cinematography. Autumn Durald Arkapaw (“Sinners”) is likely to join a short list of four women who have been nominated by the guild: Rachel Morrison for “Mudbound” (2017), Ari Wegner for “The Power of the Dog” (2021) and the only winner, Mandy Walker, for “Elvis” (2022). Alice Brooks earned a nom for “Wicked” (2024) last year and is in the conversation again with the sequel, “Wicked: For Good,” which made the cinematography Oscar shortlist.\n\n\tAlso in contention are Adolpho Veloso (“Train Dreams”), Michael Bauman (“One Battle After Another”), Łukasz Żal (“Hamnet”) and Dan Laustsen (“Frankenstein”) along with former ASC nominees Claudio Miranda (“F1”), Darius Khondji (“Marty Supreme”) and Robbie Ryan (“Bugonia”).\n\n\n\n\t\n\n\t\t\t\t\t4238_D033_00469_R\nDirector of photography Lukasz Zal, director Chloé Zhao and actors Jessie Buckley and Paul Mescal on the set of their film HAMNET, a Focus Features release.\nCredit: Agata Grzybowska / © 2025 FOCUS FEATURES LLC\n\t\t\t\t\t\t\t\t\tAgata Grzybowska\n\t\n\n\n\n\tAnd then there’s the BAFTA longlist.\n\n\tAlso announcing on Friday, the organization from across the pond are expected to highlight both American studio films and international cinema. Unlike nominations, which will be announced after Oscar nomination voting has closed, these longlists will mostly feature 10 titles in most categories and 15 in Outstanding British Film (all categories are listed alphabetically below).\n\n\tDel Toro’s “Frankenstein” is projected to lead the longlists with 12 mentions including best film and two acting mentions for its stars Oscar Isaac and Jacob Elordi. We’re expecting that Zhao’s “Hamnet,” Anderson’s “One Battle After Another” and Coogler’s “Sinners” to follow closely with 10 each.\n\t\n\n\tThis will be a key test for the genre film “Sinners,” as it remains unclear how international voters will respond. Given BAFTA’s long and well-documented struggles to recognize Black performers — Denzel Washington has still never received an acting nomination from the group — the hope is that the longlists will at least include Michael B. Jordan and Wunmi Mosaku, both of whom are among the film’s 10 projected mentions.\n\n\tThere are a few healthy tallies for other movies such as “Marty Supreme” (nine), “Bugonia” and “Sentimental Value” (eight), “Wicked: For Good” (seven) and “F1,” “Nuremberg,” “The Secret Agent” and “Train Dreams” with six each.\n\n\tIn the best film category, these 10 films are determined by all BAFTA voters using ranked voting, with points applied based on preference order. We’re expecting some of the usual suspects already mentioned but are looking out for the film or two that gets on the list as a “red herring” in the group (i.e., “All of Us Strangers” and “The Mauritanian” in previous years which all failed to garner a single Oscar nom).\n\n\tThe director longlist could feature up to 11 filmmakers under BAFTA’s gender parity intervention, which ensures equal representation of women and men directors. The Directing chapter votes for their top 10, with the system designed to balance the longlist. With non-binary multi-hyphenate Eva Victor heavily in the discussion, we’re likely to see the full 11 executed this year. Predictions include Anderson, Kathryn Bigelow (“A House of Dynamite”), Mary Bronstein (“If I Had Legs I’d Kick You”), Coogler, Del Toro, Kaouther Ben Hania (“The Voice of Hind Rajab”), Panahi, Lynne Ramsay (“Die My Love”), Trier, Victor and Zhao.\n\n\tIn the performance categories, BAFTA’s unique longlisting process has the Acting chapter vote determine the first seven places, while a jury selects the final three from those ranked eight through 13 in the chapter vote. When published, no distinction is made between chapter-selected and jury-selected performances.\n\n\tOne important eligibility reminder as BAFTA longlists are unveiled: despite its strong visibility in the animated feature conversation, Netflix’s “KPop Demon Hunters” is ineligible for BAFTA consideration. \n\n\tBy the end of the week, the awards-season map will look far less abstract. The next few days will determine whether they are still in the race — or should pack it up.\n\t\n\n\tThe full list of predictions are below.\n\n\n\n\t\n\n\t\t\t\t\t(L to r) DELROY LINDO, MICHAEL B. JORDAN and director RYAN COOGLER\n\t\t\t\t\t\t\t\t\tEli Ade\n\t\n\n\n\t\n\t\tDirectors Guild of America (DGA)\t\n\n\tDirectorial Achievement in Theatrical Feature Film Paul Thomas Anderson, “One Battle After Another” Ryan Coogler, “Sinners” Guillermo Del Toro, “Frankenstein”  Josh Safdie, “Marty Supreme” Chloé Zhao, “Hamnet” Alternate: Joachim Trier, “Sentimental Value”  First-Time Theatrical Feature Film Hasan Hadi, “The President’s Cake” Harry Lighton, “Pillion” Kristen Stewart, “The Chronology of Water”  Charlie Polinger, “The Plague” Eva Victor, “Sorry, Baby” Alternate: Diego Céspedes, “The Mysterious Gaze of the Flamingo” \n\n\n\n\t\n\n\t\t\t\t\tF1: THE MOVIE, (aka F1), Brad Pitt, 2025. © Warner Bros. /Courtesy Everett Collection\n\t\t\t\t\t\t\t\t\t©Warner Bros/Courtesy Everett Collection\n\t\n\n\n\t\n\t\tProducers Guild of America (PGA)\t\n\n\tOutstanding Producer of Documentary Theatrical Motion Pictures“Bugonia” (Ed Guiney, Yorgos Lanthimos, Andrew Lowe, Emma Stone)“F1” (Jerry Bruckheimer, Dede Gardner, Lewis Hamilton, Joseph Kosinski, Jeremy Kleiner, Chad Oman, Brad Pitt)“Frankenstein” (J. Miles Dale, Guillermo Del Toro, Scott Stuber, Gary Ungar)“Hamnet” (Nicolas Gonda, Pippa Harris, Liza Marshall, Sam Mendes, Steven Spielberg)“Marty Supreme” (Ronald Bronstein, Eli Bush, Timothée Chalamet, Anthony Katagas, Josh Safdie) “One Battle After Another” (Paul Thomas Anderson, Sara Murphy, Adam Somner, JoAnne Sellar)“Sentimental Value” (Andrew Berenstsen Ottmar, Maria Ekerhovd)“Sinners” (Ryan Coogler, Zinzi Coogler, Sev Ohanian)“Train Dreams” (Michael Heimler, Will Janowitz, Marissa McMahon, Teddy Schwarzman, Ashley Schlaifer) “Wicked: For Good” (Marc Platt) Alternate: “It Was Just an Accident” \n\n\n\n\t\n\n\t\t\t\t\tTRAIN DREAMS – (L-R) Felicity Jones as Gladys and  Joel Edgerton as Robert Grainier. Cr: Netflix © 2025\n\t\t\t\t\t\t\t\t\tCourtesy of Netflix\n\t\n\n\n\t\n\t\tAmerican Society of Cinematographers (ASC)\t\n\n\tAchievement in Cinematography in Theatrical Releases “Frankenstein” — Dan Laustsen “Hamnet” — Łukasz Żal “One Battle After Another” — Michael Bauman “Sinners” — Autumn Durald Arkapaw “Train Dreams” — Adolpho Veloso Alternate: “F1” — Claudio Miranda \n\t\n\t\tBAFTA Longlists\t\n\n\tBest Film “Bugonia” “Frankenstein” “Hamnet” “It Was Just an Accident” “Marty Supreme” “Nuremberg” “One Battle After Another” “The Secret Agent” “Sentimental Value” “Sinners” \n\n\tDirector Paul Thomas Anderson, “One Battle After Another” Kathryn Bigelow, “A House of Dynamite” Mary Bronstein, “If I Had Legs I’d Kick You” Ryan Coogler, “Sinners” Guillermo Del Toro, “Frankenstein” Kaouther Ben Hania, “The Voice of Hind Rajab” Jafar Panahi, “It Was Just an Accident” Lynne Ramsay, “Die My Love” Joachim Trier, “Sentimental Value” Eva Victor, “Sorry, Baby” Chloé Zhao, “Nomadland” \n\t\n\n\tLeading Actress Jessie Buckley, “Hamnet” Rose Byrne, “If I Had Legs I’d Kick You” Cynthia Erivo, “Wicked: For Good” Kate Hudson, “Song Sung Blue” Chase Infiniti, “One Battle After Another” Renate Reinsve, “Sentimental Value” Amanda Seyfried, “The Testament of Ann Lee” Emma Stone, “Bugonia” Tessa Thompson, “Hedda” Eva Victor, “Sorry, Baby” \n\n\tLeading Actor Lee Byung-hun, “No Other Choice” Timothée Chalamet, “Marty Supreme” Leonardo DiCaprio, “One Battle After Another” Joel Edgerton, “Train Dreams” Ethan Hawke, “Blue Moon” Oscar Isaac, “Frankenstein” Michael B. Jordan, “Sinners” Wagner Moura, “The Secret Agent” Jesse Plemons, “Bugonia” Jeremy Allen White, “Springsteen: Deliver Me From Nowhere” \n\n\tSupporting Actress Emily Blunt, “The Smashing Machine” Zoey Deutch, “Nouvelle Vague” Elle Fanning, “Sentimental Value” Ariana Grande, “Wicked: For Good” Inga Ibsdotter Lilleaas, “Sentimental Value” Amy Madigan, “Weapons” Wunmi Mosaku, “Sinners” Gwyneth Paltrow, “Marty Supreme” Teyana Taylor, “One Battle After Another” Emily Watson, “Hamnet” \n\n\tSupporting Actor Benicio Del Toro, “One Battle After Another” Jacob Elordi, “Frankenstein” Damson Idris, “F1” Paul Mescal, “Hamnet” Sean Penn, “One Battle After Another” Adam Sandler, “Jay Kelly” Andrew Scott, “Blue Moon” Alexander Skarsgård, “Pillion” Jeremy Strong, “Springsteen: Deliver Me From Nowhere” Stellan Skarsgård, “Sentimental Value” \n\n\tOriginal Screenplay “Blue Moon” “It Was Just an Accident” “Jay Kelly” “Marty Supreme” “Nouvelle Vague” “The Secret Agent” “Sentimental Value” “Sinners” “Sorry, Baby” “Urchin”  \n\n\tAdapted Screenplay “Bugonia” “Frankenstein” “Hamnet” “The History of Sound” “No Other Choice” “Nuremberg” “One Battle After Another” “Pillion” “Train Dreams” “Wake Up Dead Man: A Knives Out Mystery” \n\t\n\n\tCasting “Bugonia” “F1” “Frankenstein” “Hamnet” “Marty Supreme” “One Battle After Another” “The Secret Agent” “Sentimental Value” “Sinners” “Sirât” \n\n\tAnimated Film “Arco” “Demon Slayer: Kimetsu no Yaiba Infinity Castle” “Elio” “In Your Dreams” “Little Amélie or the Character of Rain” “Zootopia 2” \n\n\tProduction Design “Bugonia” “F1” “Frankenstein” “Hamnet” “Hedda” “Marty Supreme” “Nuremberg” “One Battle After Another” “Sinners” “Wicked: For Good” \n\n\tCinematography “Ballad of a Small Player” “F1” “Frankenstein” “Hamnet” “Marty Supreme” “No Other Choice” “Nouvelle Vague” “One Battle After Another” “Sinners” “Train Dreams” \n\n\tCostume Design “Downton Abbey: The Grand Finale” “Frankenstein” “Hamnet” “Marty Supreme” “Nouvelle Vague” “Nuremberg” “Sinners” “The Testament of Ann Lee” “Train Dreams” “Wicked: For Good” \n\n\tEditing “Bugonia” “F1” “Frankenstein” “Hamnet” “Marty Supreme” “No Other Choice” “One Battle After Another” “Sentimental Value” “Sinners” “Springsteen: Deliver Me From Nowhere” \n\n\tMake Up and Hair “Blue Moon” “Downton Abbey: The Grand Finale” “Frankenstein” “Mr. Burton” “Nuremberg” “One Battle After Another” “Sinners” “The Smashing Machine” “The Testament of Ann Lee” “Wicked: For Good” \n\n\tSound “Avatar: Fire and Ash” “Bugonia” “F1” “Frankenstein” “A House of Dynamite” “One Battle After Another” “Sinners” “Sirât” “Springsteen: Deliver Me From Nowhere” “Wicked: For Good”\n\n\tSpecial Visual Effects “Avatar: Fire and Ash” “F1” “Frankenstein” “How to Train Your Dragon” “Mickey 17” “Mission: Impossible – The Final Reckoning” “The Running Man” “Sinners” “Superman” “Wicked: For Good” \n\t\n\n\tOriginal Score “Ballad of a Small Player” “Bugonia” “F1” “Frankenstein” “Hamnet” “One Battle After Another” “Sinners” “Sirât” “The Testament of Ann Lee” “Train Dreams” \n\n\tDocumentary “2000 Meters to Andriivka” “Below the Clouds” “Cutting Through Rocks” “The Librarians” “Love + War” “Mr. Nobody Against Putin” “Orwell 2+2=5” “The Perfect Neighbor” “Riefenstahl” “The Tale of Silyan” \n\n\tFilm Not in the English Language “It Was Just an Accident” “No Other Choice” “Nouvelle Vague” “A Private Life” “Resurrection” “The Secret Agent” “Sentimental Value” “Sirât” “Sound of Falling” “The Voice of Hind Rajab” \n\n\tOutstanding British Film “28 Years Later” “Ballad of a Small Player” “The Ballad of Wallis Island” “The Choral” “Die My Love” “Downton Abbey: The Grand Finale” “Hamnet” “My Father’s Shadow” “Ocean with David Attenborough” “Pillion” “Rabbit Trap” “The Six Billion Dollar Man” “Steve” “Urchin” “Warfare”  \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "DGA, PGA and BAFTA Predictions: ‘Frankenstein’ Eyes Longlist Dominance, Josh Safdie on Director Bubble and ‘Sinners’ Faces Key International Test",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Frankenstein-Marty-Supreme-Sinners.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-07T01:01:39.000Z",
      "dateModified": "2026-01-07T01:01:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jerry Bruckheimer and Sir Richard Taylor to be Honored at Visual Effects Society Awards – Film News in Brief",
    "url": "https://variety.com/2026/film/news/film-news-roundup-week-of-january-5-1236622495/",
    "image": "https://variety.com/wp-content/uploads/2026/01/film-news-split.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-06T23:30:00.000Z",
    "description": "\n\tFilmmaker Jerry Bruckheimer and Wētā Workshop Co-Founder and Chief Creative Officer Richard Taylor will be honored at the 24th annual Visual Effects",
    "body": "\n\tFilmmaker Jerry Bruckheimer and Wētā Workshop Co-Founder and Chief Creative Officer Richard Taylor will be honored at the 24th annual Visual Effects Society Awards. Bruckheimer will receive the Lifetime Achievement Award and Taylor will receive the Visionary Award. Dedicated to recognizing exceptional contributions to the visual effects industry, the annual gala will take place on Feb. 25 at The Beverly Hilton with actor-comedians Randy and Jason Sklar set to host. \n\t\n\n\tBruckheimer was selected for the Lifetime Achievement honor as a result of his blockbuster producing career and direct influence on both films and television series that use VFX; his credits include “Pirates of the Caribbean” franchise, “F1: The Movie,” “Top Gun,” “Flashdance,” “Beverly Hills Cop,” “Remember the Titans,” the “CSI: Crime Scene Investigation” franchise, the “Amazing Race” franchise and “Top Gun: Maverick.” \n\n\tWith the VES Visionary Award, Taylor will be recognized for his impact on the VFX industry as co-founder of the Wētā companies, which have provided the design and physical effects for films including “The Lord of the Rings,” “The Hobbit” and “Avatar” trilogies, the “Chronicles of Narnia” franchise, “King Kong,” “District 9,” the “Thor” series, “Black Panther” and “Alien: Romulus.”  The Visionary award seeks to highlight individuals who have consistently employed the art and science of VFX. \n\n\n\t“The VES Awards are our marquee event, honoring exceptional creative achievement and recognized as one of the entertainment industry’s most prestigious celebrations. We’re immensely appreciative of the respective and sustained industry contributions of Jerry Bruckheimer and Sir Richard Taylor and look forward to celebrating their remarkable achievements at this year’s awards ceremony,” said VES Board Chair Kim Davidson in a statement. “We’re also thrilled to welcome back the Sklar Brothers, who bring a healthy dose of levity while honoring the talent and craft of visual effects.”\n\t\n\n\tNominees for the 24th Annual VES Awards will be announced on Jan. 13.\n\t\n\t\tTuesday, January 6\t\n\t\n\t\tBruce Campbell Premieres Rom-Com “Ernie & Emma” in Oregon\t\n\n\tCult actor icon Bruce Campbell (“Evil Dead,” “Bubba Ho-Tep,” “Burn Notice”) will world premiere his latest film “Ernie & Emma” on Feb. 14 at the Holly Theatre in Medford, Ore. The event will benefit the Ashland Independent Film Festival. Following the premiere, Campbell will tour the country to screen the film. Information is available at the film’s website.\n\n\tThe romantic comedy “Ernie & Emma” follows Ernie Tyler, “a small-town pear salesman who sets off across Pear Valley, Oregon, after the passing of his beloved wife, Emma. Guided by the meticulous list of instructions she leaves behind, Ernie’s journey becomes a bittersweet and transformative road trip that challenges him to confront loss, rediscover purpose, and honor the life he shared with Emma,” the synopsis reads.\n\n\t“Ernie & Emma’ represents a return to truly independent filmmaking,” said Bruce Campbell, who wrote, directed, produced, and stars in the film. “I refer to it as crawling back into the womb, because this is the first time since the original ‘Evil Dead’ where I’ve made a movie entirely outside the studio system.”\n\n\tLeonardo DiCaprio, Sean Penn and Benicio Del Toro to Receive Hammond Cinema Vanguard Award at Santa Barbara International Film Festival \n\n\tLeonardo DiCaprio, Sean Penn and Benicio Del Toro will receive the Hammond Cinema Vanguard Award at the 41st annual Santa Barbara International Film Festival for their ensemble performance in “One Battle After Another.”\n\n\tSBIFF Executive Director Roger Durling calls it “by far the most exciting tribute in SBIFF history. These three artists individually have regaled us with exemplary and unforgettable performances, and together, they have made one of the best films, ‘One Battle After Another.’ Let’s rejoice.”\n\n\tWarner Brothers released “One Battle After Another” on Sept. 26, 2025. DiCaprio plays protagonist Bob Ferguson; Penn plays antagonist Colonel Steven J. Lockjaw; Del Toro plays ally Sergio St. Carlos. Written and directed by Paul Thomas Anderson, the film also stars Regina Hall, Teyana Taylor and Chase Infiniti. It is this year’s most nominated Golden Globes contender with nine nominations, including individual nominations for DiCaprio, Penn and Del Toro.\n\t\n\n\tThe actors will receive the Vanguard Award on Feb. 9 during the SBIFF. The full festival runs Feb. 4-Feb. 14.  \n\t\n\t\tMonday, January 5\t\n\n\tNational Popcorn Day Returns to Participating Movie Theaters \n\n\tBig news for popcorn enthusiasts: In celebration of National Popcorn Day on Monday, Jan. 19, participating movie theaters nationwide will feature one-day-only promotions, discounts and offers on the famed movie theater snack in an initiative with Cinema United and The Cinema Foundation. Fandango has joined the campaign as its presenting sponsor.\n\n\t“National Popcorn Day is one of those moments that reminds us why people love going to the movies,” said Michael O’Leary, President and CEO of Cinema United, in a statement. “It’s about sharing a big screen experience and enjoying the amazing combination of movies and popcorn together that you simply can’t replicate anywhere else.”\n\n\tConcessions are a core part of the moviegoing experience, according to a Fandango study of more than 6,000 moviegoers: 96% of general ticket buyers said they purchased concessions during their trip to the movies and 61% of participants said they like to order a variety of concessions. Of the many refreshments offered in theaters, popcorn remains one of the most popular picks. \n\n\t“We’re excited to once again partner with The Cinema Foundation to celebrate National Popcorn Day in theaters nationwide on January 19,” said Jerramy Hainline, EVP of Fandango, in a statement. “The theatrical experience is truly unmatched and concessions like Popcorn play a big role in making every theater visit memorable to fans, whether they are watching the latest blockbuster, a beloved re-release, or even a live event. We’re proud to support exhibitors by helping fans enjoy their favorite theater snacks at a great value.”\n\n\tTo find participating theaters and their offers, visit your local movie theater’s website or app, AtTheMovies.co, or Fandango.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jerry Bruckheimer and Sir Richard Taylor to be Honored at Visual Effects Society Awards – Film News in Brief",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/film-news-split.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-06T23:30:00.000Z",
      "dateModified": "2026-01-06T23:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Be Afraid Media Launches with Acquisition of Digital Horror News Outlet Dread Central",
    "url": "https://variety.com/2026/film/news/be-afraid-media-launches-acquisition-dread-central-1236624749/",
    "image": "https://variety.com/wp-content/uploads/2026/01/MixCollage-06-Jan-2026-03-40-PM-4918.jpg?crop=0px%2C0px%2C1200px%2C675px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-01-06T23:51:21.000Z",
    "description": "\n\tBe Afraid Media, an indie horror banner, launched on Tuesday with its acquisition of genre news outlet Dread Central.\n\n\tDread Central is a digital m",
    "body": "\n\tBe Afraid Media, an indie horror banner, launched on Tuesday with its acquisition of genre news outlet Dread Central.\n\n\tDread Central is a digital media outlet that has covered horror film, televison and fandom since 2006. The acquisition by Be Afraid comes as Dread Central approaches its 20th anniversary.\n\n\tBe Afraid is led by Brad Miska, the founder of horror production house Bloody Disgusting and producer of “Terrifier 3” and the “V/H/S” franchise. He runs the company along with his siblings, Heather and Peter Luttrell, who previously worked in digital media and advertising and co-founded IndieClick.\n\t\n\n\t“Dread Central has been a trusted voice in horror for nearly two decades,” said Miska. “Our goal is to expand its reach and accessibility while preserving the integrity and independence that its audience values.”\n\n\n\t“There is no team better suited to take the helm of Dread Central,” said Jon Condit, co-founder of Dread Central. “They understand the genre, they respect the audience and they have the experience to guide Dread into its next era. I’m excited to see what the future holds under their leadership.”\n\n\tAs part of the acquisition, Be Afraid also obtained DreadTV, a horror film FAST channel, and inked a multi-year streaming distribution agreement with Epic Pictures.\n\n\t“Horror has always thrived on independence and authenticity,” said Heather Luttrell, CEO of Be Afraid. “We’re building a platform that honors the genre’s legacy, while creating a sustainable future that puts fans and creators first.”\n\n\tLegal counsel to Epic Pictures was provided by Michael Best & Friedrich LLP. Legal counsel to Be Afraid was provided by Pierce Atwood LLP. M&A advisory for Be Afraid was provided by Guud LLC.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Be Afraid Media Launches with Acquisition of Digital Horror News Outlet Dread Central",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/MixCollage-06-Jan-2026-03-40-PM-4918.jpg?crop=0px%2C0px%2C1200px%2C675px&resize=1000%2C563"
      ],
      "datePublished": "2026-01-06T23:51:21.000Z",
      "dateModified": "2026-01-06T23:51:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Guess the Cheeky Model in an Animal-Print Bikini Catching Rays",
    "url": "https://www.tmz.com/2026/01/06/sexy-animal-print-swimwear-guess-who/",
    "image": "https://imagez.tmz.com/image/90/16by9/2026/01/06/904e98c728174ad9b416143a96ac8b5c_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-06T22:03:22.000Z",
    "description": "\n    \n                    \n                          Guess This\n                          Cheeky Ray of Sunshine in a\n                          Teeny ",
    "body": "\n    \n                    \n                          Guess This\n                          Cheeky Ray of Sunshine in a\n                          Teeny Bikini!\n                      \n      \n    \n      \n        \n              \n    \n    \n          This gorgeous model and DJ dropped a thirst trap video of her splashing around in the ocean ... barely covered by a tiny animal-print bikini.\n      \n    \n          Beyond being smokin' hot ... this Ray of sunshine is known for her social media presence and love of music -- both spinning and production.\n      \n    \n          Still unsure? Hit up the gallery for the cheeky reveal!\n      \n      \n      \n          \n            \n              \n                \n                Share on Facebook\n              \n            \n            \n              \n                \n                Share on X\n              \n            \n                          \n                \n                  \n                \n              \n                      \n        \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Hotties & Bodies\n              \n                          \n                Hot Bodies\n              \n                          \n                Guess Who\n              \n                          \n                Photo Galleries\n              \n                      \n        \n          \n  ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Guess the Cheeky Model in an Animal-Print Bikini Catching Rays",
      "image": [
        "https://imagez.tmz.com/image/90/16by9/2026/01/06/904e98c728174ad9b416143a96ac8b5c_xl.jpg"
      ],
      "datePublished": "2026-01-06T22:03:22.000Z",
      "dateModified": "2026-01-06T22:03:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "TMZ Sports Streaming Live From Newsroom, Join The Conversation!",
    "url": "https://www.tmz.com/2026/01/06/tmz-sports-live-stream/",
    "image": "https://imagez.tmz.com/image/85/16by9/2026/01/06/85bff40cc1b74245a528c70513d7658a_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-06T20:56:53.000Z",
    "description": "\n    \n                    \n                          TMZ Sports Live Stream\n                          Join The Conversation!!!\n                      \n",
    "body": "\n    \n                    \n                          TMZ Sports Live Stream\n                          Join The Conversation!!!\n                      \n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          TMZ Sports is going live from the newsroom to discuss the day's biggest stories ... but we don't just want folks to watch and enjoy the conversation, we want y'all to get involved!!\n      \n    \n          Hit the comment section as Babcock, Lucas, Mojo, Luca, and the whole crew break down the most important topics of the day ... and we'll be interacting with viewers throughout the program between 1 and 2 PM PT.\n      \n    \n          YouTube, X, TikTok ... we're everywhere.\n      \n    \n          So tune in, make fun of us, share your two cents, sound off about your favorite team ... nothing is out of bounds.\n      \n    \n          Tuesday's show will talk about Snoop Dogg's NBA commentary gig, Tyson Fury's reason for returning to boxing, an NFLer's offer to Cristiano Ronaldo, and much more!!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Live Stream\n              \n                          \n                Streaming\n              \n                          \n                TMZ Sports\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "TMZ Sports Streaming Live From Newsroom, Join The Conversation!",
      "image": [
        "https://imagez.tmz.com/image/85/16by9/2026/01/06/85bff40cc1b74245a528c70513d7658a_xl.jpg"
      ],
      "datePublished": "2026-01-06T20:56:53.000Z",
      "dateModified": "2026-01-06T20:56:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Alabama Barker Poses In Sexy Lingerie",
    "url": "https://www.tmz.com/2026/01/06/alabama-barker-poses-lingerie/",
    "image": "https://imagez.tmz.com/image/e3/16by9/2026/01/07/e3831b6de7034a10bd0b7b5ac371cc4a_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-07T01:48:31.000Z",
    "description": "\n    \n                    \n                          Alabama Barker\n                          Thirsty?!? Drink It All In!!!\n                      \n   ",
    "body": "\n    \n                    \n                          Alabama Barker\n                          Thirsty?!? Drink It All In!!!\n                      \n                  \n                                                                        Published \n                              January 6, 2026\n                            5:48 PM PST\n                                                                            \n      \n    \n      \n        \n              \n    \n    \n          Alabama Barker is starting off her year with a new thirst trap ... posing in some sexy black lingerie and flaunting her assets on the 'gram.\n      \n    \n          Check out these new photos Alabama just posted on Instagram ... she's looking super seductive in a studded cross set that shows off her boobs and her booty.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Alabama's leaving little to the imagination here, and she's all dolled up in full hair and makeup ... strutting her stuff around in some heels and a two-bun ponytail.\n      \n\n          Travis Barker and Shanna Moakler's daughter posed next to some walls and some modern art ... but let's be honest, all eyes are on her here.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          AB captioned the post, hashtag \"IMSOMOVINGON.\"\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Alabama Barker\n              \n                          \n                Celebrity News\n              \n                          \n                Beauty\n              \n                          \n                Instagram\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Alabama Barker Poses In Sexy Lingerie",
      "image": [
        "https://imagez.tmz.com/image/e3/16by9/2026/01/07/e3831b6de7034a10bd0b7b5ac371cc4a_xl.jpg"
      ],
      "datePublished": "2026-01-07T01:48:31.000Z",
      "dateModified": "2026-01-07T01:48:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ronald Reagan's Son Michael Reagan Dead at 80",
    "url": "https://www.tmz.com/2026/01/06/ronald-reagan-son-michael-reagan-dead-at-80/",
    "image": "https://imagez.tmz.com/image/c3/16by9/2026/01/06/c34fd3f61d45412d849eb68c872b0b67_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-06T22:59:56.000Z",
    "description": "\n    \n                    \n                          Ronald Reagan's Son\n                          Michael Reagan Dead at 80\n                      \n  ",
    "body": "\n    \n                    \n                          Ronald Reagan's Son\n                          Michael Reagan Dead at 80\n                      \n      \n    \n          One of the sons of former actor and President of the United States Ronald Reagan, Michael Reagan, has died at the age of 80 ... the Ronald Reagan Presidential Foundation and Institute confirms to TMZ.\n      \n    \n          Michael died on Sunday, January 4, Newsmax reports … his cause of death was not released.\n      \n    \n          Michael Reagan, who was adopted, was Ronald's oldest son … his mother was actress Jane Wyman -- Ronald's first wife.\n      \n    \n          Michael was an author of multiple books -- including \"Lessons My Father Taught Me\" and \"Twice Adopted\" -- a radio host and a lecture speaker on conservative politics.\n      \n    \n          Michael is survived by his wife, two adult daughters, and two half-siblings, Patti and Ron Jr., from Ronald's second marriage to Nancy Reagan.\n      \n    \n          RIP\n      \n      \n              \n          \n                          \n                Ronald Reagan\n              \n                          \n                Nancy Reagan\n              \n                          \n                RIP\n              \n                          \n                Celebrity Death\n              \n                          \n                Politix\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ronald Reagan's Son Michael Reagan Dead at 80",
      "image": [
        "https://imagez.tmz.com/image/c3/16by9/2026/01/06/c34fd3f61d45412d849eb68c872b0b67_xl.jpg"
      ],
      "datePublished": "2026-01-06T22:59:56.000Z",
      "dateModified": "2026-01-06T22:59:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Former Disney CEO Bob Chapek Lists L.A. Estate for $15 Million",
    "url": "https://www.tmz.com/2026/01/06/bob-chapek-lists-los-angeles-home/",
    "image": "https://imagez.tmz.com/image/be/16by9/2026/01/06/be43671762fb4c6b88d93914e1ab6298_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-06T21:30:30.000Z",
    "description": "\n    \n                    \n                          Former Disney CEO Bob Chapek\n                          Buy My Stunning Estate for $15 Mil!!!\n    ",
    "body": "\n    \n                    \n                          Former Disney CEO Bob Chapek\n                          Buy My Stunning Estate for $15 Mil!!!\n                      \n      \n    \n          Bob Chapek is ready to part with some serious magic ... 'cause TMZ has learned the former Disney CEO has officially put his ultra-luxurious Southern California estate on the market.\n      \n    \n          Real estate sources tell TMZ ... the estate -- which spans 10,000 square feet across more than 6 acres and features 6 bedrooms and 7 bathrooms -- officially hit the market Tuesday for a whopping $14,995,000.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          The sprawling property, which Bob purchased in April 2021 for $12.5 million, sits privately inside a guard-gated community, perched on a prime hilltop knoll with extraordinary, unobstructed views and next-level privacy. There's also a separate 2-bedroom guest house for visitors.\n      \n\n                  \n          \n                          \n                \n                  \n      \n    \n          Inside, the home is stacked with luxury upgrades ... custom burl and walnut wood finishes, automated pocket doors, dramatic wine walls, and a full home theater fit for blockbuster screenings.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Outside is pure resort living, complete with a pool and spa, outdoor kitchen, and a covered outdoor living room with a fireplace, which is perfect for entertaining year-round. There's also a 5-car garage.\n      \n    \n          Jordan Cohen of RE/MAX holds the listing.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Money\n              \n                          \n                Exclusive\n              \n                          \n                Disney\n              \n                          \n                Celebrity Homes\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Former Disney CEO Bob Chapek Lists L.A. Estate for $15 Million",
      "image": [
        "https://imagez.tmz.com/image/be/16by9/2026/01/06/be43671762fb4c6b88d93914e1ab6298_xl.jpg"
      ],
      "datePublished": "2026-01-06T21:30:30.000Z",
      "dateModified": "2026-01-06T21:30:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]