[
  {
    "title": "Amazon’s Bestselling Kids Tablet Is 43% Off Right Now",
    "url": "https://variety.com/2025/shopping/news/amazon-fire-kids-tablet-deals-shop-online-1236594845/",
    "image": "https://variety.com/wp-content/uploads/2025/11/71uNK2212vL._AC_SL1500_.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-28T17:54:19.000Z",
    "description": "\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.\n\n\tIt can be",
    "body": "\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.\n\n\tIt can be easy to fatigue from the countless Black Friday deals overrunning the internet today but there are genuinely good deals you don’t want to miss out on. Case in point: the Amazon Fire HD 8 Kids Tablet, currently on sale for $102 — a 43% discount, and the lowest price we’ve seen for it all year.\n\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\n\tWhen it launched, the Fire HD 8 Kids was pitched as a “tablet for kids, not a toy,” and that remains very much the pitch today. It pairs an 8-inch HD screen (1280 × 800) with 32 GB storage (expandable), a chunky kid-proof bumper case, and a two-year “worry-free” guarantee that lets parents breathe easy when little hands inevitably drop it. \n\n\n\tUnder the hood, it runs the same six-core MediaTek CPU and 2–3 GB of RAM found in other Fire tablets (enough for streaming, games, educational apps, light browsing). Performance is modest (don’t expect it to rival an iPad) but for YouTube, reading, simple games and Amazon Kids+ content the tablet is just fine. Battery life is solid for its class: about 10–13 hours on a charge. \n\n\tWhat really differentiates the kids’ edition: built-in, easy-to-manage parental controls via Amazon Kids. Parents can restrict screen time, filter content, block or approve access to apps and websites, and even manage requests through a parental dashboard on their own device. \n\n\tSo if you’re looking for a holiday gift that won’t break the bank (or your nerves), shop this limited-time deal today. But don’t worry, there are plenty of tech deals for adults to shop this weekend too. The Fire Tablet 10 is 50% off for Black Friday, bringing it down to $69.99. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Amazon’s Bestselling Kids Tablet Is 43% Off Right Now",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/71uNK2212vL._AC_SL1500_.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-28T17:54:19.000Z",
      "dateModified": "2025-11-28T17:54:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Warner Bros. Business Affairs Chief Steve Spira Stepping Down",
    "url": "https://variety.com/2025/film/news/warner-bros-pictures-steve-spria-stepping-down-1236594879/",
    "image": "https://variety.com/wp-content/uploads/2018/11/warner-bros.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-28T19:30:00.000Z",
    "description": "\n\tSteve Spira is resigning his post as business affairs chief at Warner Bros.’ motion picture group.\n\n\tThis was the second tour of duty for the 40-yea",
    "body": "\n\tSteve Spira is resigning his post as business affairs chief at Warner Bros.’ motion picture group.\n\n\tThis was the second tour of duty for the 40-year veteran of the studio, who first came to the Burbank lot in 1985. Spira will finish out the end of the year before moving on, Variety has learned.\n\n\tSpira left for the first time in the fraught era of AT&T’s stewardship of the legendary studio. He was brought back in 2022 by David Zaslav, when the Discovery CEO set new creative leadership in Mike De Luca and Pam Abdy. Leadership will take a beat before considering his replacement, though one studio insider said it’s likely the post will go to someone from Spira’s existing team.\n\t\n\n\tWhile not triggered by the current deal conversations surrounding Warner Bros. Discovery, Spira’s exit comes as the company is considering multiple buyers for both its studios and linear networks operations. David Ellison’s Paramount, Netflix and Comcast are top suitors in a process expected to escalate next week after renewed bids come through on Dec. 1. The company said it will consider proposals in which the Warner Bros. business (HBO Max and studios) is sold separately from Discovery Global, the TV-centric label, which aligns with Warner Bros. Discovery’s ongoing plan to split into two companies by April 2026.\n\n\n\tSpira is regarded as a key holder of institutional memory at Warner Bros., which made him a trusted early advisor to Zaslav following a few turbulent years under his predecessor Jason Kilar.  Spira was adept at corralling and motivating talent and staff alike – a valuable skill set for a man known for his nearly 20 grandchildren. His notable deals included long engagements with Christopher Nolan and Clint Eastwood.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Warner Bros. Business Affairs Chief Steve Spira Stepping Down",
      "image": [
        "https://variety.com/wp-content/uploads/2018/11/warner-bros.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-28T19:30:00.000Z",
      "dateModified": "2025-11-28T19:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Cinema Jazireh’ Director Gozde Kural Sets Almodovar-Inspired Sexual Awakening Drama ‘G-Spot of My Soul,’ Soccer Doc Series (EXCLUSIVE)",
    "url": "https://variety.com/2025/film/festivals/cinema-jazireh-gozde-kural-torino-soccer-galatasaray-1236594867/",
    "image": "https://variety.com/wp-content/uploads/2025/11/MixCollage-28-Nov-2025-07-27-PM-9254.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-28T19:26:56.000Z",
    "description": "\n\tFollowing her Afghanistan-set features “Dust” and “Cinema Jazireh,” Turkish auteur Gözde Kural is poised to return home with “G-Spot of My Soul,” an",
    "body": "\n\tFollowing her Afghanistan-set features “Dust” and “Cinema Jazireh,” Turkish auteur Gözde Kural is poised to return home with “G-Spot of My Soul,” an Almodóvar-esque literary adaptation tracking a small-town woman’s late-in-life sexual awakening. \n\n\tKural will write and direct, expanding a short story from “Divan Witch,” a collection of character portraits by award-winning screenwriter and showrunner Özlem Yılmaz (“Kuzgun”). She will also produce through her Toz Film banner, reuniting with her “Cinema Jazireh” partners Koskos Film and Seven Springs Pictures. \n\t\n\n\tThe new film will shoot in Turkey, though support from the conservative Ministry of Culture and Tourism appears unlikely, following the state’s withdrawal of funding from “Cinema Jazireh,” which explored gender fluidity through Afghan characters who present as the opposite sex.\n\n\n\tVariety spoke with Kural at the Torino Film Festival, where “Cinema Jazireh” is playing in competition.\n\n\n\n\t\n\n\t\t\t\t\t‘Cinema Jazireh’\n\t\n\n\n\n\t“I don’t care about chasing after the Ministry anymore,” Kural says. “I don’t care about being an approved director. Filmmakers from my generation spend all their time chasing money and forget the stories. I’m done with that. This will be my third film, and I’ve found my voice. If I prove myself as a storyteller, the funding will come. I’ll find a way — I always do.” \n\n\tKural is also working on an untitled doc series tracing the global, sociological impact of soccer (or football, to those outside the U.S.). \n\n\t“Football is more than a sport,” she says. “For many, it has become almost like a religion, especially in largely secular countries such as Spain and the Netherlands. From the beginning, the game held great power — Ottoman rulers even banned it, though Galatasaray players kept it alive. Later, authorities recognized its influence on young people and began using it for political and ideological purposes. Today, football clubs represent distinct identities and values, and the team you support often reflects who you are and how you see the world.” \n\t\n\n\tWhile negotiating with several platforms, Kural is also using her ongoing festival tour for research. “The first thing I do when I arrive in a new city is head straight to the local football store,” she laughs.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Cinema Jazireh’ Director Gozde Kural Sets Almodovar-Inspired Sexual Awakening Drama ‘G-Spot of My Soul,’ Soccer Doc Series (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/MixCollage-28-Nov-2025-07-27-PM-9254.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-28T19:26:56.000Z",
      "dateModified": "2025-11-28T19:26:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "J. Crew’s Black Friday Sale Has the Best Clothing Deals on the Internet Today",
    "url": "https://variety.com/2025/shopping/news/j-crew-black-friday-deals-shop-online-1236594858/",
    "image": "https://variety.com/wp-content/uploads/2025/11/j-crew-black-friday-deal.png?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-28T19:05:14.000Z",
    "description": "\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.\n\n\tBlack Fri",
    "body": "\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.\n\n\tBlack Friday has officially kicked off at J.Crew, and the heritage retailer is rolling out one of its most aggressive sitewide promotions in years — just in time for a winter wardrobe overhaul.\n\n\tThis year’s Black Friday event, which takes 50% off your purchase, has allowed the retailer to cut through the noise. The discounts span menswear, womenswear and accessories, including many of the brand’s newest seasonal offerings.\n\n\n\tThe site is already pushing some of its buzziest fall bestsellers into the sale section, including the wide-leg stretch corduroy trousers that have become a cold-weather staple and the super-stretch ribbed cardigan, a perfect minimalist layer under oversized coats. Outerwear is a major highlight too: the Signature Puffer Jacket with PrimaLoft — J.Crew’s cult-favorite, down-alternative coat — is marked down in multiple colors, alongside tailored picks like the Alexandra stretch linen-blend blazer.\n\n\tOn the men’s side, relaxed silhouettes continue to dominate, with the double-pleated chino pant and classic pleated wool trousers both included in the sale. Denim is discounted as well, most notably the slim-wide jean.\n\n\tJ.Crew’s Black Friday push caps off a year-long cultural resurgence for the brand, which has quietly reentered the fashion conversation after a decade marked by leadership changes and shifting retail trends. Most recently, the brand launched its “New Rollneck Generation” campaign, which resurrected the brand’s 1988-born Rollneck sweater with stars such as Benito Skinner and Molly Gordon fronting the campaign.\n\n\n\tShop through J. Crew‘s entire Black Friday sale here, and a few standout items below:\n\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\t\t\n\n\t\t\t\t\t\t\t\t\t\tBESTSELLER\t\t\t\t\t\t\n\n\t\t\t\t\tBrushed Cashmere Beanie\t\t\n\n\t\t\n\t\n\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\t\t\n\t\t\n\n\t\t\t\t\tZip-Up Faux Fur Jacket\t\t\n\n\t\t\t\n\t\t\t\t\t\t\t\n\t$174\n\n\n\t$348\n\n\n\t50% off\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\n\t\n\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\n\t\t\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\t\t\n\n\t\t\t\t\t\t\t\t\t\tBESTSELLER\t\t\t\t\t\t\n\n\t\t\t\t\tSeabord Soft-Knit Shirt\t\t\n\n\t\t\n\t\n\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "J. Crew’s Black Friday Sale Has the Best Clothing Deals on the Internet Today",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/j-crew-black-friday-deal.png?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-28T19:05:14.000Z",
      "dateModified": "2025-11-28T19:05:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How Dried Scabs and Menstrual Blood Informed the Red Tones in Jessie Buckley’s ‘Hamnet’ Costumes",
    "url": "https://variety.com/2025/artisans/news/jessie-buckley-hamnet-costume-red-dress-1236593398/",
    "image": "https://variety.com/wp-content/uploads/2025/11/HAMNET_FP_00179_rgb.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-28T17:30:00.000Z",
    "description": "\n\t“The first image in my head was a giant beating heart muscle, throbbing and pulsing with blood,” says “Hamnet” costume designer Malgosia Turzanska.\n",
    "body": "\n\t“The first image in my head was a giant beating heart muscle, throbbing and pulsing with blood,” says “Hamnet” costume designer Malgosia Turzanska.\n\n\tRed becomes the main color palette for Jessie Buckley’s Agnes.\n\n\tBased on Maggie O’Farrell’s 2020 novel, “Hamnet,” now playing in theaters, tells the story of William Shakespeare (Paul Mescal) and his wife, Agnes (Jessie Buckley) as they grieve the loss of their 11-year-old son, Hamnet. The film follows the couple as they attempt to reconcile the loss of their child, and how William Shakespeare began to write his play “Hamlet.” Directed by Chloe Zhao, it is a story of love and loss.\n\t\n\n\tTurzanska says when she first met Zhao, there was no script. The two were working off the book. “We talked about blood, menstrual blood, pumping blood, drying blood and so the different colors of blood are definitely in her.”\n\n\n\tThe first time audiences meet Agnes, she’s young in red bark cloth in the woods. When she settles down with William Shakespeare and has children, the red becomes more muted. “She’s less herself and more about her kids,” she explains.\n\n\tThe turning point comes when Hamnet dies from the plague. Agnes’ clothes get darker, and when her husband returns, the couple grieves their loss. But he soon has to return to London and leaves her. When he tells her he’s going back to London, Turzanska wanted to show how far apart the two are sartorially. She’s in a brown smock, with a gray bodice. In contrast, he’s in layers and leathers.\n\n\tWhen Agnes gets up from the table, it looks like the character isn’t wearing a skirt. “The idea was that the character had started to get dressed. She still has something to live for. She has these other kids, and she started putting herself together, and forgot to put the skirt on.”\n\t\n\n\tTurzanska, who used the varying colors of blood to reflect Agnes’ journey, says, “It’s a heartbreaking moment,” because at that point, she’s grieving the loss of her son, and the silhouette is no longer voluminous.\n\n\tAt one point, she’s in a prune-colored skirt, which Turzanska describes as a dried scab.\n\n\tAt the end of the film, when she travels to London and sees her husband’s play at the Globe Theater, the character has regained some life. “She actually puts on the same dress as we saw in the scene where she’s very pregnant. It’s the same dress, but closed up.” Turzanska adds, “She’s going back to herself and trying to reconnect. So she does end on a red, but it’s no longer that youthful.”\n\n\n\n\t\n\n\t\t\t\t\tCostume sketch for Agnes by costume designer Malgosia Turzanska \n\t\t\t\t\t\t\t\t\tMalgosia Turzanska\n\t\n\n\n\n\tFor Shakespeare, Turzanska broke away from the traditional images the world has of the Bard. “The images that we have in our heads were painted years after his death. So knowing that freed me from trying to stay true to any of that,” she says. He has Tudor details in his clothing. The pinking and slashing of textiles were used as an emotional tool to express his state of mind.\n\n\tHowever, his layers were simple. The first doublet he wears when he meets Agnes is quilted. In that outfit, the slashes are small, but after Hamnet’s death, they have gotten bigger.\n\n\tFor his ghost costume, Turzanska looked at how other artists had interpreted “Hamlet” over the centuries, and she stumbled on a sculpture made of cracked clay. As she showed Zhao other costumes, the director was drawn to the photo. “That’s how we got to the clay. But, I also was searching for the origin of a ghost as a sheet, and where it comes from. And, of course, it is because bodies were wrapped in sheets when they were being buried. And so that’s, you know, it’s not a bed sheet.”\n\n\tIn the end, Shakespeare is covered in dried clay that cracks and disintegrates. Turzanska says, “It is revealing him to be raw and open.”\n\n\n\n\t\n\n\t\t\t\t\tCostume sketch for William Shakespeare by costume designer Malgosia Turzanska\n\t\t\t\t\t\t\t\t\tMalgosia Turzanska\n\t\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How Dried Scabs and Menstrual Blood Informed the Red Tones in Jessie Buckley’s ‘Hamnet’ Costumes",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/HAMNET_FP_00179_rgb.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-28T17:30:00.000Z",
      "dateModified": "2025-11-28T17:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Oscar Race Wide Open for Non-U.S. Directors Like Jafar Panahi and Joachim Trier to Shine",
    "url": "https://variety.com/2025/film/focus/oscar-race-open-directors-jafar-panahi-joachim-trier-1236592398/",
    "image": "https://variety.com/wp-content/uploads/2025/11/It-Was-Just-an-Accident.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-28T17:30:00.000Z",
    "description": "\n\tAs the Academy of Motion Picture Arts and Sciences continues to diversify its voting membership, with 55% of 2025’s invitees hailing from outside th",
    "body": "\n\tAs the Academy of Motion Picture Arts and Sciences continues to diversify its voting membership, with 55% of 2025’s invitees hailing from outside the U.S., these efforts have not only resulted in more international films like “Drive My Car” and “Emilia Pérez” earning nominations and even trophies across the board, but have also opened the gates for the director category to become more global.\n\n\tAmong this year’s strong international contenders for the director Oscar: Joachim Trier (“Sentimental Value”), Jafar Panahi (“It Was Just an Accident”), Park Chan-wook (“No Other Choice”), Kleber Mendonça Filho (“The Secret Agent”), Kaouther Ben Hania (“The Voice of Hind Rajab”), Oliver Laxe (“Sirāt”) and Annemarie Jacir (“Palestine 36”). While some of these filmmakers have had their films shortlisted or Oscar nominated before, with this year’s wide-open race, they’ll be campaigning to receive their first best director nod.\n\t\n\n\t“There’s a humanism in that we can all look at specific stories from different places and really identify with each other,” Trier says. “And without sounding too cheesy, I think that is a wonderful thing that I grew up enjoying, and I am allowed to contribute now that my films are traveling around the world.”Cannes winners “Anatomy of a Fall” and “The Substance” saw their filmmakers get recognized at the Oscars in the director category alongside household U.S. names. It’s a notable trend that has made Cannes a crucial launching pad for international directors who want to plant themselves as formidable contenders early on, especially as powerhouse distributors like Neon now regularly return to the festival to scoop up Oscar hopefuls.\n\t\n\n\t“Cannes is a fantastic loudspeaker that speaks cinema. It takes in all these different types of films,” Trier says. “I think more and more so, we are aware that it’s a really great platform to start a film, to get the conversations going around them.” His previous Oscar nominee “The Worst Person in the World” premiered there, as did his acclaimed family drama (and Oscar hopeful) “Sentimental Value,” which took home this year’s Grand Prix award.\n\n\tWhile on the award circuit promoting his Palme d’Or-winning thriller, Panahi has been vocal about the issues affecting the best international feature category, with countries run by authoritative regimes like Iran not wanting to put forth films like “It Was Just an Accident” as their official submission (the film was ultimately selected by France since the project was a co-production).\n\n\t“There has to be a new solution to resolve this problem and take it out of the hands of the states,” Panahi says.\n\n\tAs international directors continue to break into the conversation, bolder, more genre-bending films are being considered — case in point, Park and his darkly hilarious class satire “No Other Choice.” The auteur recognizes the boom that Korean cinema has enjoyed in the years since 2019’s “Parasite,” for which director Bong Joon Ho won a directing Oscar, an original screenplay Oscar and the film won best picture. “But ever since the pandemic, the [Korean] audience hasn’t returned to the theater, so things are going in a more different and darker direction,” Park says. “I think the situation is more serious in Korea compared to other countries.”\n\n\tWith former president Yoon Suk Yeol cutting crucial government funds for film and the arts, Korean filmmakers have struggled since 2022. “Our new government has promised to provide more funding for filmmakers, but we will have to wait and see how practically helpful those decisions will actually be. We’re all trying to still stay hopeful,” Park says.\n\n\tCountries like Brazil have also seen fluctuating support from their government depending on the administration, but under current president Luiz Inácio Lula da Silva, public funding has returned. “Brazil has always been very supportive because we have the public funding system. And public funding for the arts is actually part of the Brazilian constitution,” says Filho.\n\t\n\n\tFilho’s profile was raised by his best director prize at Cannes earlier this year, and he can also thank the high profile of Brazilian cinema that Walter Salles’ Oscar-winning “I’m Still Here” built during awards season last year. (That film was also nominated in the lead acting categories, itself rather rare.)\n\n\tPalestinian filmmakers often turn to co-productions for financial support. Director Jacir’s sweeping historical epic “Palestine 36,” which premiered at the Toronto International Film Festival, was a co-production that included France and the U.K.\n\n\t“Sometimes they could be really unusual combinations, but it’s how we manage to make our films that way. The second [route] is the financiers who want to see these stories. And mostly it’s from the Palestinian community that feels these stories are missing,” says Jacir, who has had two films represent Palestine at the Oscars before.\n\n\tSeasoned filmmakers like Jacir have also backed film funds and hired local crews with the hopes of supporting new generations of Palestinian directors: “I want people who are working from the heart. That’s more important to me than the experience, because it’s not easy to make films here. And so you have to think about what you are doing. You have to really believe in it.”\n\n\t“The Voice of Hind Rajab,” which tells the harrowing true story of a young Palestinian girl’s death, was one of just a few strong international contenders to premiere at the Venice Film Festival, where it reportedly received the longest standing ovation in the festival’s history. For director Hania, a previous Oscar nominee for “Four Daughters,” that provided a huge platform during fall festival season: “It was the movie of Venice [that] everybody was talking about it, so the beginning was beyond my expectation.”She continues: “The voices from Palestine and from the Arab region in general have been silenced for a long time, and until now, it’s not easy to get distributed, and we have to fight twice [as hard] to show our movies. Movies from Palestine exist, they have quite a long history, but they don’t reach the U.S.”\n\n\tAdditionally, regional festivals have played a part in international directors receiving more recognition, as distributors like Neon make it a priority to include them on press tours. Of those festivals, the Middleburg Film Festival in Virginia has become a pivotal stop. Middleburg’s executive director Susan Koch says: “It always adds so much to have the director there and to be able to interact with the audience, and for people to hear directly from the people involved with the film. We’ve made that a real priority.”\n\t\n\n\tPanahi attended Middleburg to accept this year’s Impact Award. “The distributors told me that we are going to these little towns, to these little festivals, and I listened. I went anywhere and everywhere that they wanted me to go,” Panahi says. “Sometimes we fly to places and we’re not even there for 24 hours. It’s extremely grueling, but I know that if I show any signs of exhaustion, it’s going to affect others.”\n\n\tWith this year’s competitive best director race potentially featuring both new and returning Oscar nominees, many contenders are themselves Academy voters who have been invited in recent years. That means they’ve seen the global changes first-hand.\n\n\t“I do feel that the human landscape of Academy members has changed, and I think it makes complete sense,” Filho says. “I’m well received in the U.S., my films get recognition and good coverage in the press and U.S. distribution. And I still have to remember that, as much as I’m part of this, it’s still a system that was set up, originally, to recognize U.S. films. So, in one way, I feel foreign, but in another way I feel very much welcome into the mix.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Oscar Race Wide Open for Non-U.S. Directors Like Jafar Panahi and Joachim Trier to Shine",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/It-Was-Just-an-Accident.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-28T17:30:00.000Z",
      "dateModified": "2025-11-28T17:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Stranger Things 5’: Natalia Dyer on Nancy’s ‘Failure’ in Season 5 Premiere, Fans’ Obsession With Jonathan vs. Steve",
    "url": "https://variety.com/2025/tv/news/natalia-dyer-stranger-things-5-vecna-attack-nancy-and-jonathan-1236592198/",
    "image": "https://variety.com/wp-content/uploads/2025/11/Stranger-Things-Nancy-2.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-28T19:30:00.000Z",
    "description": "\n\tSPOILER ALERT: This story contains spoilers from Season 5, Volume 1 of “Stranger Things.”\n\n\tThe ever-calculating, always-planning, consistently conf",
    "body": "\n\tSPOILER ALERT: This story contains spoilers from Season 5, Volume 1 of “Stranger Things.”\n\n\tThe ever-calculating, always-planning, consistently confident Vecna Crawl team leader Nancy Wheeler (Natalia Dyer) made a mistake in the fifth and final season premiere of “Stranger Things”: not telling her parents and little sister that monsters were real.\n\n\tNow, that error might cost Nancy and Mike’s (Finn Wolfhard) mom Karen (Cara Buono), dad Ted (Joe Chrest) and little sister Holly (Nell Fisher) their lives, as Vecna has unleashed the Upside Down on the entire Wheeler family in order to get to Holly and use her in his overall plan for world domination.\n\t\n\n\tIn a place as twisted as Hawkins, where giant rifts into the Upside Down opened up in the ground at the end of Season 4, what was the reasoning Nancy and Mike used for not informing the other Wheelers about the threat of Vecna?\n\n\n\n\t\n\n\t\t\t\t\tNatalia Dyer\n\t\t\t\t\t\t\t\t\tCOURTESY OF NETFLIX © 2025\n\t\n\n\n\n\t“This actually was a conversation with the Duffers,” Dyer told Variety. “In that discovery of what’s happened since, what have we said to people? What have we explained? You have this military presence all around, and I think there’s this sense of — especially within Nancy — there’s this wanting to protect. I think in this scenario, especially like with her family, sometimes you feel like not telling is protecting.”\n\n\tThat turned out not to be the case, and now Karen and Ted are in the hospital in critical condition — and Holly has been taken by Vecna.\n\n\t“With the whole situation now, there is a lot of guilt,” Dyer said. “She’s obviously lost people in her life before in this, and I think it does feel to her like a failure. It’s really, really hard. You’re trying to do what you think is the right thing in that moment, and things still don’t work. But I think that’s also a bonding moment for the Wheelers. I think it’s a galvanizing moment for what they have to do ahead of them. It was a really impactful way for Nancy, I think, to start the seaso — to have that moment of like, you think you have it together, and then you do not have it together. You do not have a handle on the situation.”\n\t\n\n\n\n\t\n\n\t\t\t\t\tNatalia Dyer \n\t\t\t\t\t\t\t\t\tCourtesy of Netflix\n\t\n\n\n\n\tAmid the war with Vecna and the imminent danger to her family, Nancy is dealing with a much less serious dilemma, but one of great importance to “Stranger Things” fans: Her relationship with boyfriend Jonathan Byers (Charlie Heaton) and if she will ultimately end up with him, or old flame Steve Harrington (Joe Keery).\n\n\t“This is a pressure-cooker situation,” Dyer said of Nancy and Jonathan’s lack of intimacy and romance in the first few episodes of Season 5. “Obviously, in the last season, they were apart for a long time, and then when they come back to each other — I mean, there’s so much pressure and stress. It gets put in perspective, I think: what matters, what you care about, where you can spend your energy, what demands it of you. And I think in a situation where you’ve been faced with death, with monsters, with these elements, there’s growing.\n\n\t“She’s definitely in a place where she’s running on a survival level, but still figuring herself out and figuring her life out, and even what a life looks and will there be a life?” Dyer said. “There’s definitely friction going on, but I think her focus right now is fighting Vecna, running these crawls, doing that planning work.”\n\n\tUltimately, does Dyer care whether Nancy — if she makes it to the end of “Stranger Things” — ends up with Jonathan, Steve, someone else, or no one? She does.\n\n\t“Nancy’s future does matter to me,” Dyer said. “After 10 years, you can’t help but really feel invested in these characters and their story. You want them to end up in a way that feels right. Not just the idealistic, most perfect, beautiful version — but when you’ve lived through this, you want them to come out with something that feels earned or deserved or that makes sense. \n\n\t“And I think that was always my focus,” she continued. “It has to feel right with everything.”\n\n\t\n\t\tInside the Upside Down\t\n\n\t• The Duffer Brothers Answer Volume 1 Burning Questions• Noah Schnapp on Will’s Game-Changing Discovery• Nell Fisher on Playing Holly Wheeler and Working With Sadie Sink• Cara Buono on Karen Finally Joining the Action• Sadie Sink on the Max and Venca Plot in Season 5• The Cast of ‘Stranger Things’ on the Show’s Final Days\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Stranger Things 5’: Natalia Dyer on Nancy’s ‘Failure’ in Season 5 Premiere, Fans’ Obsession With Jonathan vs. Steve",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/Stranger-Things-Nancy-2.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-28T19:30:00.000Z",
      "dateModified": "2025-11-28T19:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Michael B. Jordan on Why ‘Sinners’ Was the ‘Second Hardest Thing’ He’s Ever Done and Teasing ‘Thomas Crown Affair’ and ‘Creed 4’",
    "url": "https://variety.com/2025/film/awards/michael-b-jordan-sinners-thomas-crown-affair-creed-4-1236591214/",
    "image": "https://variety.com/wp-content/uploads/2025/11/P1032VJ5.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-28T20:00:00.000Z",
    "description": "\n\tAfter a year away from American soil, directing “The Thomas Crown Affair” in London, Michael B. Jordan is back — and he’s getting back into the swin",
    "body": "\n\tAfter a year away from American soil, directing “The Thomas Crown Affair” in London, Michael B. Jordan is back — and he’s getting back into the swing of things.\n\n\tIn Ryan Coogler’s “Sinners,” set in 1930s Jim Crow-era Mississippi, Jordan plays twin brothers navigating a world where survival and ambition collide with supernatural forces. It’s a role that demanded everything from the actor and showcased depths we haven’t seen before.\n\n\n\t“I think his level of detail and personalization and specificity that he tends to create, along with the empathy that goes into his work and his art, I think is what is food for the soul,” Jordan says of his longtime collaborator. The two have built one of modern cinema’s most consistent actor-director partnerships, from “Fruitvale Station” to “Black Panther” to the “Creed” franchise. But “Sinners” represents something different. It’s a creative swing that asked Jordan to stretch in ways he never has before.\n\t\n\n\tThe project came to him through Coogler’s personal connection to the material, rooted in the director’s relationship with his Uncle James and blues music. What struck Jordan immediately was how this felt like Coogler doing something purely for himself after years of franchise filmmaking. “I felt like he wanted to do something for him fully, and I felt that passion, and it made me excited about it,” Jordan recalls.\n\n\tPlaying twins wasn’t just a technical challenge — it was an opportunity to explore two fully developed men, not boys becoming men, but characters who knew exactly who they were. “These guys identify themselves as who they are. They’re not changing,” Jordan explains. “So I was really excited at getting that opportunity to be like, some feel really adult, feel very grown.”\n\t\n\n\tThe shoot in Louisiana proved to be Jordan’s most demanding work yet. Fresh off directing “Creed III,” he had to silence the producer and director voices in his head. Coogler made that directive clear from the start. “One of the main things that Ryan told me upon pitching it was like, Yo, bro, I don’t want you to think about nothing else but the performance,” Jordan shares. “Turn off the producer side, turn off the director side, turn off all that. I want you to give me everything on this.”\n\n\tJordan describes it as “the second hardest thing I’ve ever had to do in my life,” and says he had to find comfort in discomfort. The period setting, the Southern dialect, the fantastical elements, and above all, the duality of embodying two distinct brothers — all of it pushed Jordan to discover where his limits lie.\n\n\tThe cast surrounding him rose to the occasion as well. Miles Caton, making his film debut, learned guitar in just months for the role. “There’s no way you can sit there and tell me this is his first movie,” Jordan says with evident admiration. Delroy Lindo, Hailee Steinfeld and the ensemble created what Jordan describes as a family atmosphere — the kind of environment Coogler is known for fostering on set.\n\n\tFor Jordan, the promotional push for “Sinners” isn’t just about his own performance. “I want everybody who took the time away from their family to come down here to make a movie with us. I want them to get all the love and the respect and the props they deserve,” he says. But he’s particularly focused on ensuring Coogler gets his flowers. “I think it’s really important for him to get his flowers, man. It’s up to us to lift him, and he’ll lift us up the same way.”\n\n\tThe film represents a significant moment for Black cinema and for the horror genre at the Academy Awards, where such work has historically been overlooked. As Jordan navigates the awards conversation, he’s candid about wanting the best for his collaborator. “I want the world for Ryan Coogler. I think he’s one of the realest humans I know, unapologetically who he is — a man of his word, an amazing husband, amazing father, amazing friend and collaborator.”\n\n\tOn this episode of the Variety Awards Circuit Podcast, Jordan talks about working with his longtime collaborator, challenging himself with “Sinners,” and what his next ventures will be, including “Miami Vice” and “The Thomas Crown Affair.” \n\t\n\n\tAlso on this episode, “Sentimental Value” star Renate Reinsve discusses her creative partnership with Joachim Trier. Plus, the Awards Circuit Roundtable dives into Thanksgiving plans, previews the Gotham Awards and looks ahead to the early precursors that kick off Oscar season. Listen below!\n\n\n\n\t\n\n\t\t\t\t\tMichael B. Jordan, “Sinners.” (Warner Bros. / Courtesy Everett Collection)\n\t\t\t\t\t\t\t\t\t©Warner Bros/Courtesy Everett Collection\n\t\n\n\n\n\tRead excerpts from her interview below, which has been edited and condensed for clarity.\n\t\n\t\tYou’ve been gone for a year working on “The Thomas Crown Affair.” What was it like coming back?\t\n\n\tI’ve been gone for a year — pre-production, development, and shooting “The Thomas Crown Affair.” I got back 48 hours ago. It’s the second hardest thing I’ve ever had to do outside of “Sinners.” Directing, producing, writing, acting. It was a lot.\n\n\tLiving in London, I missed being ten toes down in North America. I didn’t really get to feel what people here have been going through. Since I got back, it’s been nonstop — interviews, mics, questions. Last night was the first time I got to relax with my niece and nephew. Uncle Mike could just show up, play Pokémon, talk colors, buy some Legos.\n\t\n\t\tWhat struck you about “Sinners,” and what did Ryan Coogler want from you that was new?\t\n\n\tBefore I even read it, what struck me was Ryan’s personal connection — his Uncle James, blues music, and how that transformed into this story set in 1930s Jim Crow Mississippi. It felt like a new muscle for him. After 10 years of franchise work, this was something personal. That passion made me excited.\n\n\tThe script was a fast, emotional read—laugh, cry, get upset, inspired. The twin element — playing two characters — gave me the most anxiety, but also the most excitement. Ryan wanted me outside my comfort zone. These are the most grown characters I’ve played. No coming-of-age arc — just fully developed men.\n\t\n\t\tDid you feel like you were showing different sides of yourself?\t\n\n\tI can’t list my attributes like a checklist, but this gave me space to stretch — period piece, Southern accent, fantastical elements, playing brothers. I wanted to see where my limits lie. I like to stay uncomfortable enough to grow.\n\n\tIt was my first film after directing, and I could feel the gear shift—working with Ryan again, with new dynamics on set. One of the first things Ryan said was: “Yo, bro, I don’t want you to think about anything else but the performance. Turn off the producer side, turn off the director side.” That was the challenge — and I was like, OK, let’s go.\n\t\n\n\tThat’s what was needed to happen for me to give these characters a fair shot at being something that not just works, but could bring his vision completely to life, which was a swing, a creative swing as a film.\n\t\n\t\tThe cast is incredible. How did you find Miles Caton, and what was it like working with the ensemble?\t\n\n\tFrancine Maisler — our casting director — helped us discover hidden gems. Miles — ain’t no way you’d know this was his first movie. He’s toured with H.E.R., so he brought that professionalism, artistry and discipline. Learned guitar in a couple of months.\n\n\tHe has a voice that doesn’t match. Just incredible. Hailee, Delroy, Wunmi, Lily, Jamie, Jack — everyone showed up. We became a family. That’s what happens when Ryan makes films. We create that environment. We want to create a space for people to come in and be the best versions of themselves and do the best work they can. We want to create a space so that you can take those chances and those swings the right way.\n\t\n\t\tWhat do you think about Ryan Coogler possibly making history with this film?\t\n\n\tI want the world for Ryan Coogler. He’s one of the realest humans I know — amazing husband, father, collaborator. His specificity and empathy — it’s food for the soul. His stories inspire more voices, more humanity, more diversity.\n\n\tHe doesn’t love compliments and prefers to stay in the background. But I’ll make sure he gets his flowers. He lifts us up, so we lift him. That’s why I’m pushing hard — for him, the cast, and everyone who poured themselves into this film. It’s leaving our industry in a better place. The more movies that he makes, the more stories he tells, the more talent seems to be inspired by him to double down on the things that they care about and the stories that they want to tell. That ultimately makes things more diverse and feels more human.\n\t\n\t\tWhat can you tell us about “The Thomas Crown Affair?”\t\n\n\tI loved the 1999 version as a kid — Pierce Brosnan, the slickness, the art. I didn’t grow up going to museums, so that film showed me a different side of New York. My mom’s an artist — so I was raised around paints and leather dyeing. It shaped my taste more than I realized.\n\n\tLater, I saw the 1968 Steve McQueen version — the split screens, the style. After “Creed,” MGM asked what I wanted to do next. I said, “‘Thomas Crown Affair.’ I need that.”\n\t\n\n\tIt didn’t have too much baggage. It was just enough time and a gap between generations that I felt like it was almost an original story without its IP, but it’s not James Bond with crazy expectations, where no matter what I do, people are going to criticize it.\n\n\tI didn’t want a reboot. I wanted a reimagination. The first two films were about rich white guys stealing for fun. That doesn’t land today. Ours is more personal. The stakes are higher. Still got the fashion, romance. Ruth Negga is the queen. We’ve got an incredible cast — Aubrey Plaza, Kenneth Branagh, Paapa Essiedu.\n\t\n\t\tAnd “Creed IV” — is that still coming?\t\n\n\tEventually, definitely. It’s a franchise that’s been really kind to me in a big way. I love MGM and Irwin Winkler and everything they’ve got going on. I think there’s a bit more story to be mined through that. Do I want to be in the ring boxing for the next 15 years? Not so much. But I think there are clever ways and interesting characters we’ve established that we might want to see where that goes, along with some introductions to new ones I have in mind. I still might be able to get a couple of really good swings at the franchise a bit more.\n\n\tWe’re spinning off doing Adonis’s daughter, Amara’s story, the television show that’s picked up at Amazon. So you’ll be seeing different parts of the Creed-verse, I like to call it. These little IPs are going to keep the universe alive without it being completely reliant on just me to push it through the finish line every time as a boxer. I’ll be adjacent.\n\t\n\t\tRapid fire: What’s your favorite Denzel Washington performance?\t\n\n\t“Malcolm X” is the one that he should have got everything for. It just blew my mind.\n\t\n\t\tFavorite Angela Bassett performance?\t\n\n\tI’m going to say “Waiting to Exhale.”\n\t\n\t\tWho’s the person you haven’t worked with yet but are dying to work with?\t\n\n\tLeonardo DiCaprio. Really want to work with Leo.\n\t\n\t\tWho would you resurrect to work with from classic cinema?\t\n\n\tGive me Sidney Poitier or Dorothy Dandridge. \n\n\tVariety’s “Awards Circuit” podcast, hosted by Clayton Davis, Jazz Tangcay, Emily Longeretta, Jenelle Riley and Michael Schneider, who also produces, is your one-stop source for lively conversations about the best in film and television. Each episode, “Awards Circuit” features interviews with top film and TV talent and creatives, discussions and debates about awards races and industry headlines, and much more. Subscribe via Apple Podcasts, Stitcher, Spotify or anywhere you download podcasts.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Michael B. Jordan on Why ‘Sinners’ Was the ‘Second Hardest Thing’ He’s Ever Done and Teasing ‘Thomas Crown Affair’ and ‘Creed 4’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/P1032VJ5.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-28T20:00:00.000Z",
      "dateModified": "2025-11-28T20:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "James Franco on Being ‘Obsessive’ and His Oscar-Nominated Turn in ‘127 Hours’: ‘Everyone Said It Would Be a Disaster’",
    "url": "https://variety.com/2025/awards/global/james-franco-oscar-nominated-127-hours-danny-boyle-1236594889/",
    "image": "https://variety.com/wp-content/uploads/2025/11/MixCollage-28-Nov-2025-08-25-PM-2494.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-28T19:57:08.000Z",
    "description": "\n\tJames Franco admitted nobody believed in “127 Hours.” The film, directed by Danny Boyle, is a biographical drama about Aron Ralston, who became trap",
    "body": "\n\tJames Franco admitted nobody believed in “127 Hours.” The film, directed by Danny Boyle, is a biographical drama about Aron Ralston, who became trapped by a boulder in a Utah canyon. \n\n\t“Danny wanted to make it but nobody else on his team did. Everyone said it would be a disaster,” he said at Italy’s Torino Film Festival where he also received the Stella della Mole award. \n\n\n\t“Then they realized the real guy had his own video camera with him – he was talking to it. That opened up another way of telling the story. He wasn’t just sitting there quietly. He could externalize his inner thoughts.”\n\t\n\n\tDesperate to escape, Ralston ultimately made the shocking decision to amputate his own arm. \n\n\n\t“Just to state the obvious, but normally, when you’re making a movie, you have multiple characters. But here, because he’s trapped in a canyon, there’s no one to interact with. It was different to anything else I’ve ever done as an actor.” \n\n\tIt was a first for everyone, Franco noted. \n\n\t“Danny Boyle has never done anything like it and neither has [cinematographer] Anthony Dod Mantle. Nobody’s made a movie like that! But despite it being about just one guy, all alone, it’s still very dynamic. It feels like an action film,” he added. \n\n\t“The interplay is now between the character and the environment, the character and himself, the character and death, and, on a technical level, the actor and the camera. It was there [in front of my face] the whole time. It was a whole different dance.”\n\n\tHis first meeting with Boyle didn’t go that well – “Maybe he thought I wasn’t as excited as I should have been” – but his stint on the soap opera “General Hospital,” which he has since described as a piece of performance art, proved useful. \n\t\n\n\t“There’s not much dialogue in [‘127 Hours’] but there’s one big speech. I’m basically saying goodbye to my family. Before that, on ‘General Hospital,’ we would shoot 80-90 pages in one day. I became very good at memorizing my lines, fast. We did it and Danny said: ‘You’re the guy.’ And he gave me a hug.” \n\n\tOnce filming had begun, Boyle wanted him to recreate Ralston’s horrific predicament. \n\n\t“He said: ‘Look, you’ve just been trapped. Your natural reaction would be to force your way out, so I want you to do everything you can to try to get out. Don’t stop.’ So I kept going and going, and going. When he finally said ‘cut!’ I think it has been 25 minutes. I was really tired and sweaty. It became very realistic, because we did everything that Aron would have done – except for cutting my arm off.” \n\n\tFranco ended up scoring his only Academy Award nomination for his committed performance, an event he described as “so impactful.” “At that time, it was almost too much to take in.” \n\n\tThe star, who has been mired in controversy over the last few years, still has a multitude of projects coming up, including Vincent Gallo’s “Golden State Killer.” He has also completed “The Long Home” as a director. However, he is trying to improve his workload management.\n\n\t“Let’s just say I was a little crazy for a while,” he said. \n\n\t“I love movies so much and there were so many stories I wanted to tell. I went back to film school to learn how to direct [and realized]: ‘I’m no longer the person who has to wait for them to call me to be in their movie. I can make my own films!’ This started a whole other chapter.”\n\n\tHe added: “I still have that: that obsession. Let’s call it that, because I’m the kind of person who can become really obsessive. But I’ve also learnt it’s good to have balance. I had to learn its importance.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "James Franco on Being ‘Obsessive’ and His Oscar-Nominated Turn in ‘127 Hours’: ‘Everyone Said It Would Be a Disaster’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/MixCollage-28-Nov-2025-08-25-PM-2494.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-28T19:57:08.000Z",
      "dateModified": "2025-11-28T19:57:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Qatar Forges Hollywood Ties as Country That Hosted 2022 World Cup Unveils Film Industry Ambitions",
    "url": "https://variety.com/2025/film/global/qatar-hollywood-ties-2022-world-cup-film-industry-ambitions-1236594646/",
    "image": "https://variety.com/wp-content/uploads/2025/11/Doha.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-28T17:55:09.000Z",
    "description": "\n\tAfter Al Jazeera and the 2022 FIFA World Cup soccer tournament put Qatar on the global map, the tiny Arab state rich in oil and gas is now turning t",
    "body": "\n\tAfter Al Jazeera and the 2022 FIFA World Cup soccer tournament put Qatar on the global map, the tiny Arab state rich in oil and gas is now turning to film and TV. And Hollywood is an integral part of that plan.\n\n\tThe Industry Days component of the just concluded Doha Film Festival was attended by top executives from Sony Pictures and U.S. indie studios Neon, A-24, Department M and Miramax – which is jointly owned by Qatar’s beIN Media Group and Paramount Global – as well as by former James Bond producer Barbara Broccoli. Broccoli and actor/director David Oyelowo announced a Doha-set contemporary adaptation of William Shakespeare’s “Othello” that Oyelowo will direct and star in alongside Rachel Brosnahan and Cynthia Erivo.\n\t\n\n\tThe U.S. studios tht attended the Doha confab are now all doing business with Qatar through co-development, co-production and co-financing deals that were announced earlier this week meant to spawn still unspecified mostly Arab-language projects. Also on hand was Hollywood veteran Steven Paul, who is an advisor on movie matters to President Donald Trump and was looking to strike a co-production deal.  \n\n\n\t“We are building the foundations of a world class [film and TV] ecosystem with new infrastructure, production facilities and post-production capabilities supported by vast technology, and data analytics,” said Hassan Al Thawadi, the Qatari lawyer who oversaw the 2022 World Cup. He is now leading The Qatar Film Committee, an official body that is part of the Media City Qatar hub tasked with driving growth of the country’s entertainment industry.\n\t\n\n\tBut Al Thawadi made it clear that Hollywood should not be expecting any handouts from Qatar. \n\n\t“This agreement is about more than financing films,” he said, after announcing the relatively modest pact with Neon that involves six to 10 feature films and shorts over a four-year period that Neon will co-finance and distribute. “It’s about creating a new platform for Arabic and regional storytelling, ensuring that stories from Qatar and the wider Arab world are seen, celebrated, and shared globally.”\n\n\t“We are here to champion Arab cinema, nurture regional talent and deepen collaboration across the Arab world,” Al Thawadi went on to point out. “And our goal is to see this region – as well as the wider global South – recognized as a driving force in global creativity with Arab storytelling at its heart.”\n\n\t“By expanding cooperation opportunities and attracting investment and forging international partnerships, we aim to build an ecosystem that is self-sustaining, globally connected, and fearlessly proud of its roots,” Al Thawadi went on to point out.\n\n\tAccording to Los Angeles-based producer Stuart Ford, who heads AGC Studios and has being doing business in the Middle East for years, the flurry of deals between Qatar and Hollywood companies announced in Doha is “part of a well-thought-out strategy.” The Industry Days were “something of a launchpad for Qatar to become another prominent regional player in the entertainment sector,” he added.\n\n\t“There is clearly a strategy at play, and that overall strategy may well be different to that of the experienced and sophisticated UAE or the more populous KSA [Kingdom of Saudi Arabia],” Ford noted, pointing out that “clearly the priority is on excellence rather than volume.”\n\n\tThe cornerstone of Qatar’s nascent film and TV industry is its freshly announced rebate called Qatar Screen Production Incentive that offers an up to 50% in cash on qualifying Qatari production spend, combining a 40% base rebate with an additional uplift of up to 10% for productions that meet defined criteria such as hiring Qatari talent, investing in local training, promoting Qatari culture, and other aspects of industry development.\n\n\tThe new Qatari rebate is “untethered and not connected to production,” said Stefan Sonnenfeld, head of post-production and VFX giant Company 3, which handles post-production on a large portion of Hollywood series and films – including, most recently, “Wicked: For Good,” and “Stranger Things” Season 5 – just as Sonnenfeld announced a deal to set up a post-production and VFX studio in Doha.\n\t\n\n\t“So basically, anybody can work here and participate in it,” added Sonnenfeld, who also acted as a consultant on the Qatari rebate, which he called “one of the best in the world right now.”\n\n\tFor Doha-based filmmaker and producer Ahmed Al Baker, who is CEO of Katara Studios, which at the festival launched what is being billed as first Qatari feature film – a psychological thriller titled “Sa3ood Wainah?” – the invitation to tap into Qatar’s new rebate besides being aimed at Hollywood will also be for Arab production companies “that are next door because we are a couple of hours away by airplane,” he said.\n\n\t“The Middle East is our turf, O.K.? The Middle East is our industry,” Al Baker noted. “What The Film Committee is going to be pushing is for the Qatar incentive to bring in projects from the region. And hopefully the beneficiaries of that will be everyone who surrounds us.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Qatar Forges Hollywood Ties as Country That Hosted 2022 World Cup Unveils Film Industry Ambitions",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/Doha.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-28T17:55:09.000Z",
      "dateModified": "2025-11-28T17:55:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "KISS Legend Ace Frehley's Final Resting Spot Revealed In NYC, See Picture",
    "url": "https://www.tmz.com/2025/11/28/ace-frehley-gravestone-new-york/",
    "image": "https://imagez.tmz.com/image/52/16by9/2025/11/28/52c721bcdcf143dab62a3bae64654c76_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-28T20:12:14.000Z",
    "description": "\n    \n                    \n                          Ace Frehley\n                          Final Resting Spot Revealed\n                      \n        ",
    "body": "\n    \n                    \n                          Ace Frehley\n                          Final Resting Spot Revealed\n                      \n                  \n                        Published November 28, 2025 12:12 PM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Ace Frehley’s final resting spot has been revealed -- and TMZ’s got the first look at the rock legend’s gravestone marker inside a NYC cemetery.\n      \n    \n          As you can see, the polished stone crypt is etched with \"PAUL 'ACE' FREHLEY, 1951–2025,\" sitting inside a Bronx cemetery -- with fresh flowers at the base and a single red rose tucked into the slate\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          A simple, striking tribute to the KISS legend -- and we’re told the engraving was just recently completed and put in place.\n      \n    \n          The legendary guitarist passed away at 74 on Thursday, Oct. 16 -- the result of blunt trauma to the head from a fall that caused a brain bleed. His family ultimately made the difficult decision to remove him from life support.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Ace was a founding member of KISS ... teaming up with Gene Simmons, Paul Stanley and Peter Criss -- all reuniting to attend his private funeral.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Ace Frehley\n              \n                          \n                Paul Stanley\n              \n                          \n                Peter Criss\n              \n                          \n                Gene Simmons\n              \n                          \n                RIP\n              \n                          \n                Celebrity Death\n              \n                          \n                Exclusive\n              \n                          \n                Music\n              \n                          \n                Fairly Legal\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "KISS Legend Ace Frehley's Final Resting Spot Revealed In NYC, See Picture",
      "image": [
        "https://imagez.tmz.com/image/52/16by9/2025/11/28/52c721bcdcf143dab62a3bae64654c76_xl.jpg"
      ],
      "datePublished": "2025-11-28T20:12:14.000Z",
      "dateModified": "2025-11-28T20:12:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Donald Trump Confirms One National Guard Member Is Dead After D.C. Shooting",
    "url": "https://www.tmz.com/2025/11/27/national-guard-dead-sarah-beckstrom-rahmanullah-lakanwal-donald-trump/",
    "image": "https://imagez.tmz.com/image/27/16by9/2025/11/27/2759fbd4800a49969b5ab75be8c78431_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-28T00:27:53.000Z",
    "description": "\n    \n                    \n                          Washington, D.C. Shooting\n                          One National Guard Member Dead\n              ",
    "body": "\n    \n                    \n                          Washington, D.C. Shooting\n                          One National Guard Member Dead\n                      \n                  \n                        Published November 27, 2025 4:27 PM PST\n                                                                      |\n                Updated November 28, 2025 7:43 AM PST\n                                    \n      \n    \n          Tragic news out of D.C. -- one of the two National Guard members shot by Rahmanullah Lakanwal near the White House on Wednesday has died, President Trump confirmed Thursday.\n      \n    \n          Trump, in his first live remarks since the shooting, said, \"Sarah Beckstrom of West Virginia, highly respected, young, magnificent person... she’s just passed away. She’s no longer with us.\" Beckstrom was only 20 years old.\n      \n    \n      \n        \n                    \n                  \n      \n                    White House\n          \n\n          The second Guard member, Staff Sgt. Andrew Wolfe, 24, is still in critical condition and fighting for his life, according to Trump.\n      \n    \n          The FBI, U.S. Attorney's office, and the National Guard ID’d the shooter as 29-year-old Afghan national Lakanwal.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Social media footage showed the gunman being taken into custody on a D.C. street… with the two wounded National Guard members lying on the ground nearby.\n      \n    \n      \n      Video captures the moments immediately after the National Guard shooting in DC, including the alleged suspect being apprehended. pic.twitter.com/Hsj5aCDUfd\n              @Breaking911\n          \n  \n    \n          No word yet on a motive -- authorities still aren’t saying what triggered the attack.\n      \n    \n          With one Guard member now succumbing to her injuries, Lakanwal will face first-degree murder charges.\n      \n      \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Donald Trump Confirms One National Guard Member Is Dead After D.C. Shooting",
      "image": [
        "https://imagez.tmz.com/image/27/16by9/2025/11/27/2759fbd4800a49969b5ab75be8c78431_xl.jpg"
      ],
      "datePublished": "2025-11-28T00:27:53.000Z",
      "dateModified": "2025-11-28T00:27:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sexy Stars In Black Bikinis ... Shop 'Til You Drop!",
    "url": "https://www.tmz.com/2025/11/28/sexy-celebrities-black-bikinis/",
    "image": "https://imagez.tmz.com/image/c9/16by9/2025/11/17/c938aa2195004280b5af72fc1f46fafb_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-28T08:30:46.000Z",
    "description": "\n    \n                    \n                          Sexy Stars In\n                          Black Bikinis ...\n                          Shop 'Til You",
    "body": "\n    \n                    \n                          Sexy Stars In\n                          Black Bikinis ...\n                          Shop 'Til You Drop!\n                      \n                  \n                        Published November 28, 2025 12:30 AM PST\n                                                                            \n      \n    \n      \n        \n              \n    \n    \n          FORGET THE SALES, these black bikini babes are the real headline! Why wait in long lines when we've got the best of the best in town?!\n      \n    \n          Hailey Bieber was back in black -- showin' off her cheeky derriere on socials, you better add Emily Ratajkowski's hot shot to your cart before it sells out ... and swipe your card through Chelsea Lazkani's stringy black bikini!\n      \n    \n          The sales may be low, but the confidence on these sexy stars are through the roof ... check out the gallery!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Emily Ratajkowski\n              \n                          \n                Hailey Bieber\n              \n                          \n                Hot Bodies\n              \n                          \n                Photo Galleries\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sexy Stars In Black Bikinis ... Shop 'Til You Drop!",
      "image": [
        "https://imagez.tmz.com/image/c9/16by9/2025/11/17/c938aa2195004280b5af72fc1f46fafb_xl.jpg"
      ],
      "datePublished": "2025-11-28T08:30:46.000Z",
      "dateModified": "2025-11-28T08:30:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Alicia In 'The Clique' 'Memba Her?!",
    "url": "https://www.tmz.com/2025/11/28/alicia-in-the-clique-memba-her/",
    "image": "https://imagez.tmz.com/image/c2/16by9/2025/11/11/c2003e6d0a0a4d74b69e73df28e50408_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-28T08:01:07.000Z",
    "description": "\n    \n                    \n                          Alicia In\n                          'The Clique'\n                          'Memba Her?!\n         ",
    "body": "\n    \n                    \n                          Alicia In\n                          'The Clique'\n                          'Memba Her?!\n                      \n                  \n                        Published November 28, 2025 12:01 AM PST\n                                                                            \n      \n    \n          American actress Samantha Boscarino was just a teen when she played Alicia -- one of the popular girls at middle school -- in the family/comedy film \"The Clique\" back in 2008.\n      \n    \n          Other noteworthy cast mates included Bridgit Mendler, Vanessa Marano, and Dylan Minnette.\n      \n    \n          Guess what she likes now in her 30s!\n      \n      \n      \n          \n            \n              \n                \n                Share on Facebook\n              \n            \n            \n              \n                \n                Share on X\n              \n            \n                          \n                \n                  \n                \n              \n                      \n        \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Movies\n              \n                          \n                Memba Them\n              \n                          \n                Photo Galleries\n              \n                      \n        \n          \n  ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Alicia In 'The Clique' 'Memba Her?!",
      "image": [
        "https://imagez.tmz.com/image/c2/16by9/2025/11/11/c2003e6d0a0a4d74b69e73df28e50408_xl.jpg"
      ],
      "datePublished": "2025-11-28T08:01:07.000Z",
      "dateModified": "2025-11-28T08:01:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Netflix, Nickelodeon Actor Tony Germano Dead at 55 After Falling from Roof",
    "url": "https://www.tmz.com/2025/11/28/tony-germano-dead-fall-from-roof-nick-netflix-actor/",
    "image": "https://imagez.tmz.com/image/8b/16by9/2025/11/28/8bd938156ce642d096d986ffe68820e6_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-28T17:07:34.000Z",
    "description": "\n    \n                    \n                          Tony Germano\n                          Actor Dead at 55 After Rooftop Fall\n                      ",
    "body": "\n    \n                    \n                          Tony Germano\n                          Actor Dead at 55 After Rooftop Fall\n                      \n                  \n                        Published November 28, 2025 9:07 AM PST\n                                                                            \n      \n    \n          Tony Germano, a veteran voice and stage actor, is dead after a tragic rooftop accident at his home in Brazil.\n      \n    \n          Tony was in the middle of renovations on his house in Sao Paulo, and according to his rep, when he lost his balance and fell from the roof Wednesday ... and did not survive his severe injuries.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          His rep also says, \"This has been a very painful moment for everyone who worked with him and cared for him, and we’re still processing the loss.\"\n      \n\n        Waiting for your permission to load the Instagram Media.\n      \n    \n          The Brazilian native performed Portuguese voiceovers for Nickelodeon's \"Nicky, Ricky, Dicky & Dawn\" ... and for the Netflix series, \"Go, Dog, Go!\"\n      \n    \n          Tony also had roles on Disney's 2017 live-action version of \"Beauty and the Beast,\" as well as stage productions of \"The Phantom of the Opera,\" \"Jekyll & Hyde,\" and \"Miss Saigon.\"\n      \n    \n          He also loved to record covers of popular theater songs, such as \"All I Care About\" from \"Chicago.\"\n      \n    \n          Tony was 55.\n      \n    \n          RIP\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                RIP\n              \n                          \n                TV\n              \n                          \n                Movies\n              \n                          \n                Celebrity Death\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Netflix, Nickelodeon Actor Tony Germano Dead at 55 After Falling from Roof",
      "image": [
        "https://imagez.tmz.com/image/8b/16by9/2025/11/28/8bd938156ce642d096d986ffe68820e6_xl.jpg"
      ],
      "datePublished": "2025-11-28T17:07:34.000Z",
      "dateModified": "2025-11-28T17:07:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]