[
  {
    "title": "Whoopi Goldberg Fights Tears While Calling Out Kristi Noem and More Over ICE, Alex Pretti’s Murder: ‘You All Have Blood on Your Hands’",
    "url": "https://variety.com/2026/tv/news/whoopi-goldberg-slams-ice-krisi-noem-alex-pretti-murder-1236641341/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Whoopi-Goldberg-The-View.png?w=1000&h=551&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-26T19:24:31.000Z",
    "description": "\n\t“The View” took on ICE and the government on Monday, January 26, following Saturday’s shoot of ICU nurse Alex Pretti by Border Patrol agents in Minn",
    "body": "\n\t“The View” took on ICE and the government on Monday, January 26, following Saturday’s shoot of ICU nurse Alex Pretti by Border Patrol agents in Minneapolis, Minnesota.\n\n\t“They murdered a man. He is standing, he has his phone and he has a bottle of water. And they shot him ten times. What the —,” Whoopi Goldberg said during the episode, cutting herself off and getting visibly emotional. “I don’t know what you’re investigating, if you’re not investigating the straight up murder — the straight up murder. This is the second one, the second murder of an American citizen.”\n\t\n\n\tShe continued, “If you don’t see it, it’s willful. It’s because you’re not looking. You can’t sit by this.”\n\n\n\tGoldberg then called out the secretary of homeland security and the Border Patrol Commander.\n\n\t“Kristi Noem, you can’t justify this. Mr. Bovino, you can’t justify this,” she said. “You can’t justify either one, and we all see it and we see you for what you are. You all have blood on your hands.”\n\n\tPretti, the VA nurse who was killed on Saturday, came weeks after 37-year-old mother Renee Nicole Good was shot and killed by an ICE agent while driving away from a protest.\n\n\tAna Navarro said that Pretti was “brandishing a camera” before he was shot. “This government does something that I am not used to saying about a U.S. government,” she said. “It lies to the citizens, it lies to the people. So, for them, a camera is just as dangerous as a gun. What they don’t want is for people to see the truth.”\n\n\tSara Haines also commented on the murders during Monday’s episode, calling out both ICE and the current administration.\n\t\n\n\t“The people that seem to be bringing the violence are the ICE agents themselves. I know there are good ICE agents. The problem is they’re currently recruiting people using imagery from single-shooter games, giving them this vibe that they’re coming to get rid of vermin, and they’re also telling them they have immunity,” Haines said. “They’re not even getting investigated properly. The administration has spoken and set the tone for this. That’s what we’re seeing right now. That’s why people are being killed completely unjustly.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Whoopi Goldberg Fights Tears While Calling Out Kristi Noem and More Over ICE, Alex Pretti’s Murder: ‘You All Have Blood on Your Hands’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Whoopi-Goldberg-The-View.png?w=1000&h=551&crop=1"
      ],
      "datePublished": "2026-01-26T19:24:31.000Z",
      "dateModified": "2026-01-26T19:24:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Adrien Brody on Making his Broadway Debut in ‘Fear of 13,’ Talking to Timothée Chalamet After Their Oscars Race and Making Fun of Himself in TurboTax's Super Bowl Ad",
    "url": "https://variety.com/2026/theater/news/adrien-brody-turbo-tax-super-bowl-ad-1236641331/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Screen-Shot-2026-01-26-at-12.27.07-PM.png?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-26T20:03:19.000Z",
    "description": "\n\tAdrien Brody may be known for his intense, emotionally heavy performances, but he’s eager to show he doesn’t take himself too seriously.\n\n\tThe Oscar",
    "body": "\n\tAdrien Brody may be known for his intense, emotionally heavy performances, but he’s eager to show he doesn’t take himself too seriously.\n\n\tThe Oscar-winning actor —  who most recently portrayed the tortured architect László Tóth in “The Brutalist” — pokes fun at his reputation for brooding roles in a new Super Bowl spot for TurboTax. In the 45-second ad, which will air during the Big Game next month, he plays a tax expert as a satirized version of himself, practicing his lines in a trailer (“I can handle that for you!”) with dramatic gravitas.\n\t\n\n\t“I loved the idea of making fun of myself as this very serious dramatic actor, and to play on this concept of me,” Brody tells Variety. While he jumped on the chance for this comedic role, however, he’s quick to add that “he loves doing dramatic work and has no intention of not doing it.”\n\n\n\n\n\n\tHis next dramatic role comes in the fall when he makes his Broadway debut in “Fear of 13,” alongside Tessa Thompson. The play, which he originally starred in on the West End, tells the true story of Nick Yarris (Brody), a Pennsylvania native who spends more than two decades on death row for a rape and murder he insists he didn’t commit. Through a series of prison visits with a volunteer named Jackie (Thompson), Nick shares the impulses and consequences that shaped his life. \n\n\tAhead of “Fear of 13” and his Super Bowl ad, Variety caught up with Brody to talk about making his Broadway debut, working with Thompson and what he and Timothée Chalamet talked about during their heated Oscars race last year:\n\t\n\t\n\t\tIt’s been 15 years since your last Super Bowl ad appearance. How did you get involved with TurboTax for this spot?\t\n\n\tWhen TurboTax presented this concept to me, I literally laughed out loud. There’s just so many great bits and the idea of making fun of myself as this very serious dramatic actor who takes on the responsibility of playing a character as a TurboTax expert and assuming that there’s a ton of drama and anguish, but really the gag is that there’s no drama with TurboTax, and it’s just really fun. I love doing dramatic work and have no intention of not doing it but I like to do funny, comedic work as well.\n\t\n\t\tWhat are your plans for Game Day plans?\t\n\n\tI can’t wait to see it and I hope to be in the room with friends when it surprises them. I haven’t told anybody really within my group that I got this spot coming because really want them to get a kick out of it just popping up. But hopefully they’re paying attention and not eating a slice of pizza or something.\n\t\n\t\tIn the spot, the director tells you to be less serious. Have you ever gotten a note like that on a real set? \t\n\n\tNo, but I don’t usually take roles where less intense is really the direction. Sometimes it’s even, ‘Can you go further in the intensity?’ It’s really important to be able to laugh, not only at your own qualities but life is full of complexity and you got to find humor in that. \n\t\n\t\tYou haven’t signed on to your next film project since ‘The Brutalist’  Are we going to see you in a comedy next? \t\n\n\tWell, definitely not. I live up to my reputation. As you probably know I signed on to do ‘The Fear of 13’ on Broadway. I had been waiting to find something that felt deeply challenging and meaningful. \n\t\n\t\tWhat was the process like talking to Nick Yarris in preparing for your role in ‘Fear of 13’? \t\n\n\tI performed a rendition of this on the West End about a year and a half ago. I spent a lot of time with Nick. He’s had a very challenging life, it’s a story of his enduring more than two decades on death row. But also it speaks to pervasive injustice, and even when we have systems in place that are there to protect us all, there’s great tragedy and misuse of it. I find being able to represent characters that have experienced those hardships, and hopefully help shed some light on that, is really important. \n\t\n\t\n\t\tIt is both your and Tessa Thompson’s Broadway debut. What was it like working with her? \t\n\n\tI love Tessa’s work, and she’s just gonna be great. And I can’t wait. We both can’t wait. \n\t\n\t\tWe’re in the midst of another awards season. Last year, you beat Timothée Chalamet for best actor – which was particularly ironic since he would have broken your record for the youngest winner if he had won. Did you talk to Timothée at all during that race or after your win? \t\n\n\tYeah, we all interacted quite a bit. I mean it was a beautiful time and we were all very immersed in our work. We all had responsibilities to support our films. And it was exciting. It was a very exciting time. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Adrien Brody on Making his Broadway Debut in ‘Fear of 13,’ Talking to Timothée Chalamet After Their Oscars Race and Making Fun of Himself in TurboTax's Super Bowl Ad",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Screen-Shot-2026-01-26-at-12.27.07-PM.png?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-26T20:03:19.000Z",
      "dateModified": "2026-01-26T20:03:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Fox Entertainment Inks Deal With Dhar Mann Studios for Slate of 40 Scripted Vertical-Video Shows to Premiere on Holywater App",
    "url": "https://variety.com/2026/tv/news/fox-entertainment-dhar-mann-studios-vertical-shows-holywater-1236639672/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Dhar-Mann.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-26T19:00:00.000Z",
    "description": "\n\tFox Entertainment is placing another big bet on microdramas: The company signed a multiyear deal with Dhar Mann Studios — the digital studio founded",
    "body": "\n\tFox Entertainment is placing another big bet on microdramas: The company signed a multiyear deal with Dhar Mann Studios — the digital studio founded by mega-popular creator Dhar Mann — for a series of original scripted vertical-video shows. \n\n\tUnder the pact, Dhar Mann Studios will create and produce an initial slate of 40 “narrative-driven” titles designed for Holywater, the microdrama video platform in which Fox Entertainment took an equity stake last year. Following their exclusive debut on Holywater’s My Drama app, the Dhar Mann Studios shows will have worldwide distribution windows managed by Fox Entertainment Global. The first shows under the deal are expected to roll out this spring.\n\t\n\n\tFounded in 2018, Dhar Mann Studios has built a multigenerational audience of more than 163 million followers for its short-form scripted content across platforms including YouTube. The company’s mission is to create “inspirational narrative content” that makes a “positive impact on people across the world.” Through his partnership with Fox and Holywater, Mann will retain ownership and creative independence over his original content.\n\n\n\t“Dhar Mann’s inspiring, undeniable storytelling excellence and passionate audience have made him one of the most powerful and consequential voices in entertainment today,” Fox Entertainment CEO Rob Wade said. “As leading partners to creators exploring this growing ecosystem, we’re primed to expand Dhar Mann Studios’ reach by super-serving his new and existing fans everywhere with this all-new, original vertical content.”\n\n\tTo date, according to Dhar Mann Studios, its content has generated some 20 billion views across platforms. The company operates a 125,000-square-foot, three-stage production facility in Burbank, California.\n\t\n\n\tThe deal with Fox Entertainment is Dhar Mann Studios’ first official partnership in the fast-growing vertical space. To lead production, the studio recently appointed producer, showrunner and development executive Erin McFarlane as its head of vertical content. Previously, McFarlane led creative programming development and production for vertical video platform SaltyTV.\n\n\tDhar Mann Studios CEO Sean Atkins, a former MTV and Discovery exec, said in a joint statement with McFarlane: “As we introduce Dhar’s creative vision to this new format and era of entertainment, it became clear that Fox Entertainment and Holywater are partners that truly understand what this scope of ambition requires. Rob and his team are both embracing innovation and investing in it, affording us an unprecedented level of creative autonomy and resources needed to build something that has never been done before at this scale. That combination allows us to reach new and existing audiences in powerful ways while staying true to Dhar’s positive and resonant storytelling.”\n\n\tBogdan Nesvit and Anatolii Kasianov, Holywater’s co-founders and co-CEOs, added, “We’re pleased to partner with Dhar and Fox to bring this creative vision to our audiences worldwide. This represents the first step in our broader strategy to attract global creators and top-tier talent to vertical storytelling at scale.”\n\n\tEarlier this month, Ukraine-based Holywater announced its largest financing round to date, banking $22 million. In addition to its investment in Holywater, Fox Entertainment Studios is in active production on a slate of 200 original microdramas and vertical series for the platform. Fox also is collaborating with other Hollywood studios, talent and creators to develop projects for Holywater.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Fox Entertainment Inks Deal With Dhar Mann Studios for Slate of 40 Scripted Vertical-Video Shows to Premiere on Holywater App",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Dhar-Mann.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-26T19:00:00.000Z",
      "dateModified": "2026-01-26T19:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jordan Belfort Docuseries ‘The Real Wolf of Wall Street’ Set at Paramount+ (EXCLUSIVE)",
    "url": "https://variety.com/2026/tv/news/jordan-belfort-docuseries-real-wolf-of-wall-street-1236641049/",
    "image": "https://variety.com/wp-content/uploads/2026/01/GettyImages-457508113-e1769442155624.jpg?crop=0px%2C18px%2C2040px%2C1147px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-01-26T19:00:00.000Z",
    "description": "\n\tLeonardo DiCaprio immortalized Jordan Belfort in Martin Scorsese’s 2013 epic “The Wolf of Wall Street,” portraying the former stockbroker and convic",
    "body": "\n\tLeonardo DiCaprio immortalized Jordan Belfort in Martin Scorsese’s 2013 epic “The Wolf of Wall Street,” portraying the former stockbroker and convict’s rise and fall with coke-addled intensity.\n\n\tBut an upcoming Paramount+ docuseries, “The Real Wolf of Wall Street,” promises to unveil the true story of Belfort and his boiler room brokers at Stratton Oakmont, which is “even darker and more debauched than previously known.” \n\n\n\tThe three-part doc is currently in production from Maxine Productions (“Quiet on Set,” “The Fall of Diddy”) and See It Now Studios (the division behind recent true-crime docs “Don’t Date Brandon” and “Thirst Trap”), and it will premiere later this year.\n\t\n\n\t“The Real Wolf of Wall Street” features exclusive interviews with insiders who have never previously spoken out about Belfort, plus new footage and 15,000 previously unreleased government documents. It will show how Belfort became the face of 1990s excess before his fraudulent brokerage firm imploded and he was sent to prison. (As of now, Belfort is not involved in the project.)\n\n\tAs the head of Stratton Oakmont, Belfort led a stock market scheme that defrauded investors with “pump and dump” penny stock sales. Before it all came crashing down, he was famous for his extreme party lifestyle, which involved copious amounts of drugs, women and yachts. In 1999, after securities regulators had closed in on Stratton Oakmont, Befort pled guilty to securities fraud and money laundering charges. He served 22 months in federal prison and became an FBI informant, giving testimony against several of his co-conspirators. In 2007, he published the memoir “The Wolf of Wall Street,” which Scorsese adapted into his Oscar-nominated film of the same name.\n\t\n\n\t“The Real Wolf of Wall Street” is produced by Maxine Productions (a part of Sony Pictures Television’s nonfiction arm) and Bloomberg. Executive Producers are Mary Robertson, Anneka Jones and Jesse Sweet for Maxine Productions; Jason Leopold for Bloomberg; Cassie Thornton, Amy Palmer and Michael Bloom. For See It Now Studios Susan Zirinsky and Terence Wrong are executive producers, and Aysu Saliba and Cara Tortora are supervising producers. Sweet also serves as the showrunner.  \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jordan Belfort Docuseries ‘The Real Wolf of Wall Street’ Set at Paramount+ (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/GettyImages-457508113-e1769442155624.jpg?crop=0px%2C18px%2C2040px%2C1147px&resize=1000%2C563"
      ],
      "datePublished": "2026-01-26T19:00:00.000Z",
      "dateModified": "2026-01-26T19:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sly Dunbar, Half of Sly and Robbie, Legendary Reggae Rhythm Section, Dies at 73",
    "url": "https://variety.com/2026/music/news/sly-dunbar-dead-sly-and-robbie-reggae-drummer-1236641264/",
    "image": "https://variety.com/wp-content/uploads/2026/01/GettyImages-1357962662.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-26T18:13:51.000Z",
    "description": "\n\tLowell Fillmore “Sly” Dunbar, the drumming half of the legendary reggae rhythm section Sly and Robbie, has died, according to the Guardian and a sta",
    "body": "\n\tLowell Fillmore “Sly” Dunbar, the drumming half of the legendary reggae rhythm section Sly and Robbie, has died, according to the Guardian and a statement from his daughter to TMZ. Dunbar’s wife, Thelma, told Jamaican publication the Gleaner that she found him unresponsive on Monday morning. No cause of death was given; he was 73.\n\n\tSly and Robbie anchored recordings by countless musicians, ranging from reggae icons like Lee Perry, Junior Murvin and Jimmy Cliff and tracks by Bob Marley, to Bob Dylan, the Rolling Stones and Grace Jones. Over the years he also performed extensively with such reggae artists as Black Uhuru, Peter Tosh, Bunny Wailer and Chaka Demus & Pliers, and guested with more mainstream artists like No Doubt, Serge Gainsbourg and Mick Jagger’s solo work. He won two Grammy Awards amid 13 nominations. \n\t\n\n\tBorn Lowell Fillmore Dunbar in Kingston, Jamaica in 1952, Dunbar began drumming as a child and connected with bassist Robbie Shakespeare – who died in 2021 – as a teen. The pair formed the rhythm section of the group the Revolutionaries (which also performed as the Aggrovators) and rapidly became the most in-demand rhythm section of the reggae genre, as well as releasing multiple albums of their own.\n\n\tReggae is a genre that sounds simple but is not, and countless dilettante musicians have embarrassed themselves by performing it badly. Yet Sly and Robbie were undisputed masters of the art, bringing a nuanced, unhurried and rock-solid rhythmic approach — Dunbar’s first recorded appearance, on Dave and Ansell Collins’ classic “Double Barrel,” reached No. 1 in the U.K. in 1971.\n\t\n\n\tThe pair were in heavy demand throughout the decades, yet their peak may have been the early 1980s, when they remained active as session musicians and as a solo act; formed their own label, Taxi Records; and anchored not only Grace Jones’ three classic albums — “Warm Leatherette,” “Nightclubbing” and “Living My Life” – four albums by Serge Gainsbourg, and two for Bob Dylan, including the strong 1983 outing “Infidels” (which also saw them united with Dire Straits frontman Mark Knopfler and former Rolling Stones guitarist Mick Taylor).\n\n\tSly and Robbie released more than 30 albums as a duo, the most recent being 2019’s “Sly & Robbie vs. Roots Radics: The Final Battle.” Dunbar also released three solo albums across the late ’70s and early ’80s. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sly Dunbar, Half of Sly and Robbie, Legendary Reggae Rhythm Section, Dies at 73",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/GettyImages-1357962662.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-26T18:13:51.000Z",
      "dateModified": "2026-01-26T18:13:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "USC Scripter Awards Winners: ‘One Battle After Another’ Wins for Film, ‘Death by Lightning’ Takes Home TV Prize",
    "url": "https://variety.com/2026/awards/awards/2026-usc-scripter-awards-winners-list-1236641228/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Scripter-winner.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-26T18:55:43.000Z",
    "description": "\n\tPaul Thomas Anderson‘s “One Battle After Another” won outstanding film adaptation and “Death by Lightning” took the episodic series prize at the 202",
    "body": "\n\tPaul Thomas Anderson‘s “One Battle After Another” won outstanding film adaptation and “Death by Lightning” took the episodic series prize at the 2026 USC Libraries Scripter Awards.\n\n\tAnderson accepted his award virtually for adapting Thomas Pynchon’s novel “Vineland,” sharing the honor with the notoriously reclusive author. “I’m sorry that I can’t be there. I have a terrific excuse that I think everyone will understand is that I am working and writing, which is the only thing that would keep me away,” Anderson said. “I hope you understand, very honored to have this award, and extremely honored to share it with Thomas Pynchon, which is a great sentence to say.”\n\t\n\n\tThe win continues a strong awards season run for Anderson’s adaptation, which previously won best adapted screenplay at both the Golden Globes and Critics Choice Awards.\n\n\n\tMike Makowsky won in the episodic series category for adapting Candice Millard’s nonfiction book “Destiny of the Republic: A Tale of Madness, Medicine and the Murder of a President” into the Netflix limited series “Death by Lightning.”\n\n\tIn his acceptance speech, Makowsky recalled discovering Millard’s book about President James Garfield’s assassination eight years ago at a Barnes & Noble buy-two-get-one-free table. “I picked up this book, destiny of the Republic, by Candice Millard, about the assassination of our 20th president, James Garfield, who I want to say I knew had been assassinated,” he said. “But I knew very little color or really anything about the man.”\n\n\tAfter reading the book in one sitting, Makowsky immediately wanted to adapt it but faced skepticism from Hollywood. “I called up my agent. I was like, I want to write a limited series about our 20th president, James Garfield. I’m no longer repped at CAA,” he joked. “The amount of looks that I got from not only my own reps, but pretty much every executive in town when I told them that I wanted to write this thing, like, good luck buddy and no thanks.”\n\t\n\n\tThe writer credited Netflix and his producers, including David Benioff and D.B. Weiss, for believing in the project. “There was only one universe, one select weird group of people who could have ever gotten this thing made,” he said.\n\n\tThis year’s film nominations also included Guillermo del Toro’s “Frankenstein,” Chloe Zhao and Maggie O’Farrell’s “Hamnet,” Ira Sachs’ “Peter Hujar’s Day” and Clint Bentley and Greg Kwedar’s “Train Dreams.” On the TV side, fellow nominees were “Dark Winds,” “Department Q,” “Slow Horses” and “Wolf Hall: The Mirror and the Light.”\n\n\tThe ceremony, held at USC’s Town and Gown, also honored crime novelist Michael Connelly with the Scripter Literary Achievement Award. Actor Titus Welliver, who has portrayed Connelly’s iconic detective Harry Bosch since 2014, presented the award.\n\n\tThe evening opened with an unexpected moment of acknowledgment from USC trustee and Scripter co-founder Glenn Sonnenberg, who recognized the death of 37-year-old nurse Alex Jeffrey Pretti. “It would be wrong to start today, with all that we’ve been reading in the news and where our minds and hearts are, without acknowledging [his death],” Sonnenberg said. “I say this not as a political statement, but to recognize that film lifts us and yet art also reminds us of the world in which we live and the challenging times within which we live.”\n\n\tOutgoing Scripter selection committee chair Howard Rodman, who has led the jury for more than a decade, delivered his final remarks at the ceremony. “We’re here tonight to celebrate the art of adaptation. How can you turn a book into a movie, a show, a series? Short answer you can’t. Longer answer you can’t,” he said. “Turning a book into a series is devilish. It’s tricky.”\n\n\tConsidered a strong indicator for the best adapted screenplay category at the Oscars, past Scripter winners that went on to win at the Academy Awards include “12 Years a Slave” (2013), “The Imitation Game” (2014), “The Big Short” (2015), “Moonlight” (2016), “Call Me by Your Name” (2017), “Nomadland” (2020), “Women Talking” (2022) and “American Fiction” (2023).\n\n\tThe USC Scripter Awards, founded in 1988, bring together the worlds of filmmaking and publishing in an academic setting to celebrate the best scripts of the year. The ceremony serves as the USC Libraries’ premier fundraising event, with proceeds supporting student resources and library modernization efforts.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "USC Scripter Awards Winners: ‘One Battle After Another’ Wins for Film, ‘Death by Lightning’ Takes Home TV Prize",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Scripter-winner.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-26T18:55:43.000Z",
      "dateModified": "2026-01-26T18:55:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Hacks’ Star Meg Stalter Deletes TikTok After Claiming New U.S. Ownership Is Blocking Videos About ICE; Platform Says Disruption Is Due to Power Outage",
    "url": "https://variety.com/2026/digital/news/hacks-meg-stalter-deletes-tiktok-claims-censoring-ice-videos-1236641121/",
    "image": "https://variety.com/wp-content/uploads/2026/01/meg.jpg?crop=0px%2C18px%2C1000px%2C562px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-01-26T18:22:59.000Z",
    "description": "\n\t“Hacks” breakout Meg Stalter has deleted her TikTok account after claiming that the app’s new ownership is censoring videos criticizing ICE. However",
    "body": "\n\t“Hacks” breakout Meg Stalter has deleted her TikTok account after claiming that the app’s new ownership is censoring videos criticizing ICE. However, the platform has pointed to a power outage at a U.S. data center that has delayed the posting of new content.\n\n\tThe comedian, who had over 278,000 followers on the app, posted on Instagram Sunday night that she would be deleting her account because TikTok “is under new ownership and we are being completely censored and monitored.” Stalter claimed that she is “unable to upload anything” about the U.S. Immigration and Customs Enforcement, which she signified with an ice cube emoji, “even after I tried to trick the page by making it look like a comedy video.”\n\t\n\n\n\tLast week, TikTok owner Bytedance closed a deal to form TikTok U.S., a joint venture majority-owned by American investors which brings TikTok into compliance with the U.S.’s divest-or-ban law. This prohibits distribution in the U.S. of any app that is more than 20% owned by a “foreign adversary” (in this case, China), due to fears that the Chinese government could use the app to spy on Americans or spread propaganda. TikTok U.S.’s three managing investors include Silver Lake, Oracle and Abu Dhabi’s state-owned investment firm MGX, each holding 15%. \n\n\n\tIn a statement posted to its new X account on Monday, the TikTok USDS Joint Venture wrote: “Since yesterday we’ve been working to restore our services following a power outage at a U.S. data center impacting TikTok and other apps we operate. We’re working with our data center partner to stabilize our service. We’re sorry for this disruption and hope to resolve it soon.” When the keyword “ICE” is searched on the platform, content that is critical of the agency does still appear.\n\t\n\n\tOutrage over the Trump administration’s deportation initiative using ICE reached fever pitch over the weekend when federal agents in Minneapolis shot and killed Alex Pretti, a 37-year-old ICU nurse, during protests in the city over the death of Renee Good, who was also shot and killed by ICE. Both were U.S. citizens. The Department of Homeland Security has claimed that Pretti and Good were shot in self-defense.\n\n\tMany celebrities have taken to social media to voice their anger, including Finneas, who claimed on Instagram that his video speaking about ICE had also been “shadowbanned” on TikTok and reposted Stalter. Stars like Olivia Wilde and Natalie Portman also wore “ICE out” pins over the weekend at Sundance Film Festival. Speaking to Variety on the red carpet for her latest directorial effort “The Invite,” Wilde said she was “appalled and sickened” by the situation.\n\n\t“We can’t go another day just sort of accepting this as our new norm. It’s outrageous,” she said. “People are being murdered. And, I don’t want to normalize seeing people being murdered on the internet. On film. It’s hideous. And so if we can do anything out here to support the movement to cast ICE out, to delegitimize this unbelievably criminal organization, then that’s what we should be doing.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Hacks’ Star Meg Stalter Deletes TikTok After Claiming New U.S. Ownership Is Blocking Videos About ICE; Platform Says Disruption Is Due to Power Outage",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/meg.jpg?crop=0px%2C18px%2C1000px%2C562px&resize=1000%2C563"
      ],
      "datePublished": "2026-01-26T18:22:59.000Z",
      "dateModified": "2026-01-26T18:22:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Soul Patrol’ Filmmakers on Their Sundance Doc and Why Black Stories Are More Important Than Ever: ‘They Were Going to Erase Us From History’",
    "url": "https://variety.com/2026/film/news/sundance-doc-soul-patrol-black-stories-history-1236639660/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Soul-Patrol-Cover-Still_2025-1118.tif_1.1.1-1.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-26T18:42:26.000Z",
    "description": "\n\tEd Emmanuel is on a mission.\n\n\tThe former Vietnam veteran and filmmaker told some of his story in his 2003 memoir “Soul Patrol: The Riveting True St",
    "body": "\n\tEd Emmanuel is on a mission.\n\n\tThe former Vietnam veteran and filmmaker told some of his story in his 2003 memoir “Soul Patrol: The Riveting True Story of the First African American LRRP Team in Vietnam.” Ever since then he tried to film the documentary, but it never got told. Until filmmaker Jason “JM” Harper stepped in, and their film “Soul Patrol premiered Sunday night at the Sundance Film Festival.\n\n\n\t“I was left alive in Vietnam and able to come home and tell this story,” Emmanuel says. “My whole existence in Vietnam was me getting back home to tell the story about these brave Black men.”\n\t\n\n\tThrough Super 8 film, archival footage and talking heads, “Soul Patrol” doesn’t just reunite some of the Vietnam War’s first Black special operations team as they tell their story; it examines what it was like for these “soul brothers” to be fighting one of the most important wars in history. The documentary also looks at how even through this reunion, the trauma of war still exists for Emmanuel and his team.\n\n\tAhead of the film’s premiere, Variety sat down with Emmanuel and Harper along with journalist Jesse Lewis who talks about the erasure of Black soldiers.\n\t\n\t\tJason, where did the story of “Soul Patrol” begin for you?\t\n\n\tJason Harper: I picked up a book called “Nam, the Vietnam Experience.” I saw it on a bookshelf in Barnes and Noble when I was about 14 years old, and from that moment, I just became obsessed with that war. I saw teenagers who looked exactly like me. They were Black, they they were carrying machine guns, they had bandoliers of ammo, they were walking through the jungle, and on their helmets they had Black Power symbols, Black Panther symbols, or peace symbols. I began to sense that there was, there was a conflict between what they were doing and what they were saying on their helmets. So I just I read everything and I watched everything I could. Years later that I picked up “Soul Patrol” and I read Ed’s story, and that changed my life.\n\t\n\t\n\t\tEd, you’ve been trying to get this documentary made for years, what does it mean to have it out now, especially at this pivotal time in American history?\t\n\n\tEd Emmanuel: I had been working on the film for years, flying back and forth to the East Coast, getting interviews and finding everyone. Our group met in Washington D.C. and so that’s when I first start filming the documentary. I let Jason know where we were and in the progress of getting the documentary filmed and, Jason told me that he was born to do this story. That struck me. You can’t make those kind of statements and not have some validity to back it up. The more that I met with Jason, the more I was convinced I had to take them under my wing and and give them the full and complete story about Soul Patrol.\n\t\n\t\tAnd Jesse, what does this story mean for you?\t\n\n\tJesse Lewis: It was very humbling for me. But it also says a lot about state of American journalism at the time. I was hired at the Washington Post in 1962 as a copy boy. When I was interviewed, I was asked, “What are your career hopes?” I said, “Well, I’d like to be a foreign correspondent.” I was told by the person who hired me “That’s just never going to happen… If we hire you, we want you to cover, what was then becoming, the Civil Rights Movement.” Well, lo and behold, the war in Vietnam got into full swing. Blacks were fighting, dying and being wounded at a higher rate.\n\n\tI focused on the Black GI, and that drew the resentment of my white colleagues. No one had written about the Black GI as a phenomenon. So I continued to do that and continue to earn the the disdain of my white colleagues guys from the New York Times and Associated Press. I was the only Black correspondent there.\n\n\t I was there for four or five months, and I wrote a story at the end of my time there. The story ran in 1967 all on the front page, and they scrambled to reproduce like hell it. The New York Times sent out a Black reporter, Tom Johnson. Time Magazine sent out Wallace Terry, and they did great jobs, but they were playing catch up. I earned the trust of the American military having been in the military myself. I didn’t write any opinion pieces. I wrote about what was happening on the ground. So I was translating into words, very pungent words, very descriptive words, the blood and guts that I saw on the battlefield.\n\t\n\t\n\t\tJason, in your collaboration, with Ed, what were some important touch points for you to get across?\t\n\n\tHarper: Ed had gone around doing interviews for some years with the guys who he had fought with, many of whom had passed by the time I started. So he had this massive archive of sit down interviews with other veterans from the Company F, 51st Infantry Regiment. When I put together the reunion to bring together the Soul Patrol team, we knew it was so timely. Mackey had bought his tuxedo. He was ready to come to the interview. He was so excited. Then he passed two weeks before the reunion happened. It was extremely timely in that way, but I was able to use some of the material that I had shot of Mackey. At the reunion, we sat everyone down in a roundtable so we have this communal storytelling, and the guys remembering things from each other as they are telling the story of that year long tour. On top of that, one of the gentlemen who came to the reunion, Willie Brown, he asked us if we’d be interested in this Super 8 film reels that he had shot while they were on tour.\n\n\tThese guys were using Super 8 cameras. As I was editing it, that that stood out to me, that they were just recording themselves in between the battles, at the base, and you just saw them as teenagers, and that that was incredible because you don’t get to see that side of their lives from that time. It was remarkable to have that archive at our fingertips.\n\t\n\t\tBetween the archival footage and roundtable and interviews, how did you get on with the editing process of telling all these stories?\t\n\n\tHarper: Niles Howard was able to help create that visual language. How do you travel back and forth in time in a kind of seamless way? It was just this monumental challenge, and I knew the edit had to be virtuosic to be able to travel back and forth through time and not get lost, because it’s a journey that traverses 50 years. \n\t\n\t\tThere’s a quote at the end that we need to look at where we come from and where we’re headed. What does it mean to be releasing this story in today’s America as we’re seeing people trying to erase history? \t\n\n\tHarper: When you have the Department of the Interior literally erasing evidence of any Black historical impact when you have these massive characters in our life, people like Martin Luther King and to have some of our leading Black voices erased from our National Parks and cemeteries, it infuriates me. I feel an incredible weight and responsibility to speak up and to tell Black stories at a time where the administration has a deliberate and considered effort to stamp those voices out in the name of whatever. Black stories are important, now more than ever because it’s an existential crisis, in my opinion. I see that not just in the telling of this story, but in the way that documentaries are financed.  You can see in real time the chilling effect that is being institutionalized right now. While we were filming, we lost two of the guys, and they won’t be able to speak for themselves from the grave, and so it’s incredibly important to get a record of what happened so that we can carry that message forward.\n\t\n\n\tEmmanuel: That’s exactly why I wrote the book. I knew that they were going to erase us from history. I had to get this book out. My whole existence in Vietnam was me getting back home to tell the story about these brave Black men out here who will never get ink on what they did in Vietnam. \n\n\tThis interview has been edited and condensed.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Soul Patrol’ Filmmakers on Their Sundance Doc and Why Black Stories Are More Important Than Ever: ‘They Were Going to Erase Us From History’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Soul-Patrol-Cover-Still_2025-1118.tif_1.1.1-1.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-26T18:42:26.000Z",
      "dateModified": "2026-01-26T18:42:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "EJAE, Jack Fisk, Alexandre Desplat and More to Receive Variety Artisans Awards at Santa Barbara Film Festival",
    "url": "https://variety.com/2026/artisans/news/variety-artisans-awards-2026-santa-barbara-film-festival-1236641014/",
    "image": "https://variety.com/wp-content/uploads/2026/01/ejae-fisk-desplat.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-26T19:00:00.000Z",
    "description": "\n\tOscar-nominated artisans  EJAE (”KPop Demon Hunters),” Jack Fisk (”Marty Supreme”) and Alexandre Desplat (”Frankenstein”) and are among the recipien",
    "body": "\n\tOscar-nominated artisans  EJAE (”KPop Demon Hunters),” Jack Fisk (”Marty Supreme”) and Alexandre Desplat (”Frankenstein”) and are among the recipients being honored at Variety’s Artisans Awards.\n\n\tVariety’s 12th annual Artisans Awards is set to take place on Feb. 7 at the Arlington Theater during the Santa Barbara Film Festival.\n\n\tThe Artisans Awards at Santa Barbara honor the craftspeople behind this year’s biggest films. The evening comprises one-to-one conversations followed by a panel discussion moderated by Variety’s senior artisans editor Jazz Tangcay.\n\t\n\n\tVariety continues to elevate artisans in its coverage and the evening will celebrate artisans across fields including cinematography, costume design, editing, makeup, production design, sound editing and mixing and visual effects.\n\n\n\t“This evening is a celebration of what makes filmmaking so powerful. It is, above all, a collective art form shaped by many artists with a shared vision. The remarkable artists we honor on this night represent the very best of cinema this year and we’re proud of our continued partnership with Variety that makes this special evening possible,” said Roger Durling, director of the film festival.\n\n\tThis is an extraordinary year for cinema, movie-goers and film lovers.” She went on to say, “I’m grateful to Roger for this collaboration in putting together this group of extraordinary craftspeople. We are looking forward to once again shining a light on their incredible artistry in Santa Barbara, and hearing their conversations,” said Tangcay.\n\n\tThe Variety Artisans Awards honorees for 2026 are below:\n\t\n\n\tOriginal Score – Alexandre Desplat – “Frankenstein”Original Song – EJAE – “Golden” – “KPOP Demon Hunters”Production Design – Jack Fisk – “Marty Supreme”Costume Design – Kate Hawley – “Frankenstein”Makeup – Mike Hill – “Frankenstein”Editing – Andy Jurgensen – “One Battle After Another”Sound Editing – Al Nelson – “F1” (Supervising Sound Editor)Cinematography – Adolpho Veloso – “Train Dreams’Visual Effects – Eric Saindon – “Avatar: Fire and Ash”Sound Mixing – Chris Welcker – “Sinners” – (Production Sound Mixing)\n\n\tPrevious Artisan Award recipients include Kris Bowers for “The Wild Robot,” Billie Eilish and Finneas for “Barbie,” Ludwig Goransson for “Oppenheimer,” Mark Bridges for “Phantom Thread,” Trent Reznor and Atticus Ross for “Mank,” Mia Neal for “Ma Rainey’s Black Bottom,” Ruth Carter for “Black Panther” and Sandy Powell for “The Irishman.”\n\n\tThe Santa Barbara International Film Festival takes place from Feb. 4-14.\n\n\tTickets for the Artisans Awards can be purchased here.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "EJAE, Jack Fisk, Alexandre Desplat and More to Receive Variety Artisans Awards at Santa Barbara Film Festival",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/ejae-fisk-desplat.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-26T19:00:00.000Z",
      "dateModified": "2026-01-26T19:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Billie Eilish Concert Doc Release Pushed to May; James Cameron Says ‘We’re Dialing in Cool, New 3D Tech’",
    "url": "https://variety.com/2026/film/news/billie-eilish-james-cameron-concert-doc-release-may-1236641205/",
    "image": "https://variety.com/wp-content/uploads/2025/11/GettyImages-2240205299.jpg?crop=0px%2C132px%2C5000px%2C2812px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-01-26T18:10:20.000Z",
    "description": "\n\tJames Cameron revealed on Monday that the release of the Billie Eilish 3D concert documentary “Billie Eilish: Hit Me Hard and Soft,” which he co-dir",
    "body": "\n\tJames Cameron revealed on Monday that the release of the Billie Eilish 3D concert documentary “Billie Eilish: Hit Me Hard and Soft,” which he co-directed with Eilish, has been pushed two more months to May 8 via Paramount.\n\n\t“We’re refining the cut; dialing in cool, new 3D tech; adding some special behind-the-scenes we know you’ll love. @hitmehardandsoftmovie will now release Friday, May 8th. Worth the wait!” Cameron wrote on Threads and Instagram.\n\t\n\n\tOn the last night of the tour in November, Eilish said, ”This is one of my favorite tours everrrrrr and being able to capture it and co-direct this film with [James Cameron] has truly been a dream come true,” she wrote. “Can’t wait for you all to see it.” The release had been set for March 20.\n\n\n\tMade in partnership with Darkroom Records, Interscope Films and Lightstorm Earth, the documentary was shot at concerts including Manchester, England last July. Eilish said at the time, “Basically, I can’t say much about it but what I can say is that I’m working on something very, very special with somebody named James Cameron and it’s going to be in 3D. So, take that as you will and these four shows here in Manchester, you and me are part of a thing that I am making with him. He’s in this audience somewhere, just saying. So don’t mind that, and also I’ll probably be wearing this exact outfit for like four days in a row,” she explained to the audience.\n\n\n\tCameron’s “Avatar: Fire and Ash” has been No. 1 on the domestic box office charts for the first three weekends of January, ending up in second place with $7 million over this past weekend. “Fire and Ash” has earned $378 million in North America and $1.378 billion globally over six weeks.\n\t\n\n\tHe has also acquired the rights to the Charles Pellegrino novel “Ghosts of Hiroshima” with an intention to direct the adaptation.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Billie Eilish Concert Doc Release Pushed to May; James Cameron Says ‘We’re Dialing in Cool, New 3D Tech’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/GettyImages-2240205299.jpg?crop=0px%2C132px%2C5000px%2C2812px&resize=1000%2C563"
      ],
      "datePublished": "2026-01-26T18:10:20.000Z",
      "dateModified": "2026-01-26T18:10:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "TMZ Streaming Live, Come Into Our Newsroom and Watch Things Happen!",
    "url": "https://www.tmz.com/2026/01/26/watch-tmz-live-today/",
    "image": "https://imagez.tmz.com/image/25/16by9/2026/01/26/25a2883083254fe59134cc441b3f89fa_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-26T18:41:21.000Z",
    "description": "\n    \n                    \n                          TMZ Live Stream\n                          Come Into Our Office and Watch News Happen!!!\n         ",
    "body": "\n    \n                    \n                          TMZ Live Stream\n                          Come Into Our Office and Watch News Happen!!!\n                      \n                  \n                                                                        Published \n                              January 26, 2026\n                            10:41 AM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          We want you to be a part of TMZ, so every weekday, between 9:30 AM and 11:30 AM PT, we take you inside our newsroom via live stream.\n      \n    \n          You never know what you're gonna get ... a big story that breaks, an argument erupts in the room, or someone's just joking around.\n      \n    \n          Your comments are a big part of the stream, and the staff spends a lot of time speaking directly to you. Every day is different!\n      \n    \n          We also use our live stream to produce our \"TMZ Live\" TV show.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Celebrity News\n              \n                          \n                Live Stream\n              \n                          \n                Viral\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "TMZ Streaming Live, Come Into Our Newsroom and Watch Things Happen!",
      "image": [
        "https://imagez.tmz.com/image/25/16by9/2026/01/26/25a2883083254fe59134cc441b3f89fa_xl.jpg"
      ],
      "datePublished": "2026-01-26T18:41:21.000Z",
      "dateModified": "2026-01-26T18:41:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Margot Robbie & Jacob Elordi Look Great Together in Traffic in New Pics",
    "url": "https://www.tmz.com/2026/01/26/margot-robbie-jacob-elordi-los-angeles-traffic/",
    "image": "https://imagez.tmz.com/image/69/16by9/2026/01/26/6973c895da484eacb56b32f5ecdef32d_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-26T19:46:24.000Z",
    "description": "\n    \n                    \n                          Margot Robbie & Jacob Elordi\n                          Revving Up The Heat-Cliffe!!!\n            ",
    "body": "\n    \n                    \n                          Margot Robbie & Jacob Elordi\n                          Revving Up The Heat-Cliffe!!!\n                      \n                  \n                                                                        Published \n                              January 26, 2026\n                            11:46 AM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Margot Robbie is cruising full-speed on her \"Wuthering Heights\" promo tour with Jacob Elordi ... and if their interview rounds don't already scream chemistry, these TMZ pics definitely do!\n      \n    \n          Peep these B&Ws snapped by street photographer Rene Mascarenas, who just happened to be stuck in traffic with them on L.A.’s famed Sunset Boulevard -- he asked for a pic, and they happily obliged ... 'cause LBR, when you look that good together, you never pass up free proof.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          The pair looked every inch the movie stars -- Jacob behind the wheel, his fellow Aussie riding shotgun, both in a great mood ... especially after Rene told Jacob he crushed it in \"Frankenstein\" and tossed Margot a compliment for good measure.\n      \n\n          As you can see, the chemistry is off the charts -- something the raunchy \"Wuthering Heights\" trailer already hinted at, and, ahem, those very eyebrow-raising interview rounds have only made louder ... especially since these two have respective others.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          In one instance, Margot spoke about being codependent with Jacob -- admitting she’d look around set for him because she felt lost without him -- while the hunky actor's said he was was completely enamored with her on set.\n      \n    \n          Yeah, talk about love on the wuthering edge ...🤔\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Jacob Elordi\n              \n                          \n                Margot Robbie\n              \n                          \n                Celebrity News\n              \n                          \n                TV\n              \n                          \n                Relationships\n              \n                          \n                Movies\n              \n                          \n                Exclusive\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Margot Robbie & Jacob Elordi Look Great Together in Traffic in New Pics",
      "image": [
        "https://imagez.tmz.com/image/69/16by9/2026/01/26/6973c895da484eacb56b32f5ecdef32d_xl.jpg"
      ],
      "datePublished": "2026-01-26T19:46:24.000Z",
      "dateModified": "2026-01-26T19:46:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Garcelle Beauvais' Los Angeles Home Targeted in 'Swatting' Call",
    "url": "https://www.tmz.com/2026/01/26/garcelle-beauvais-los-angeles-home-targeted-swatting-call/",
    "image": "https://imagez.tmz.com/image/69/16by9/2026/01/26/69a1b2b26c614cbeac87f1cf65b46573_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-26T19:23:13.000Z",
    "description": "\n    \n                    \n                          'RHOBH' Garcelle Beauvais\n                          Terrified as Cops Respond to 'Swatting' Call\n",
    "body": "\n    \n                    \n                          'RHOBH' Garcelle Beauvais\n                          Terrified as Cops Respond to 'Swatting' Call\n                      \n                  \n                                                                        Published \n                              January 26, 2026\n                            11:23 AM PST\n                                                                      |\n                                                                Updated \n                                  January 26, 2026\n                                12:08 PM PST\n                                    \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Garcelle Beauvais had a terrifying situation blow up at her Los Angeles home over the weekend ... after someone made a bogus 911 call claiming there was a man with a weapon at the actress' Los Angeles home.\n      \n    \n          Law enforcement sources tell TMZ ... on Sunday night, police received a call for a possible assault with a deadly weapon and shots fired. We're told the caller claimed he was Garcelle's ex-boyfriend, and said he was armed with a sawed-off shotgun.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          When officers arrived at the scene, the caller refused to meet with them. After searching the property, police found no evidence of a crime and determined the incident was a \"swatting.\"\n      \n\n          What makes the situation even more frightening ... sources connected to the 'Real Housewives of Beverly Hills' star tell us she was home alone when cops arrived. With no context of what was going on, she found the entire ordeal extremely scary.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          As you know ... a \"swatting\" incident is where callers report bogus crimes to trigger a large  law enforcement response.\n      \n    \n          We're told this is the second time Garcelle has been swatted at her L.A. home -- the first occurred last summer -- and she finds this deeply concerning. Our sources say she is now with family and working towards next steps on how to prevent this from happening again.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Garcelle Beauvais-Nilon\n              \n                          \n                Celebrity News\n              \n                          \n                Reality TV\n              \n                          \n                Real Housewives\n              \n                          \n                Exclusive\n              \n                          \n                Police\n              \n                          \n                Celebrity Homes\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Garcelle Beauvais' Los Angeles Home Targeted in 'Swatting' Call",
      "image": [
        "https://imagez.tmz.com/image/69/16by9/2026/01/26/69a1b2b26c614cbeac87f1cf65b46573_xl.jpg"
      ],
      "datePublished": "2026-01-26T19:23:13.000Z",
      "dateModified": "2026-01-26T19:23:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Alex Pretti's GoFundMe Surpasses $1.2 Million, Bill Ackman Gives $10K",
    "url": "https://www.tmz.com/2026/01/26/alex-pretti-gofundme-passes-million-dollar-mark/",
    "image": "https://imagez.tmz.com/image/50/16by9/2026/01/26/5019f92d543142e6be622031aa001d2c_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-26T19:36:49.000Z",
    "description": "\n    \n                    \n                          Alex Pretti\n                          GoFundMe Exceeds $1 Million\n                      \n        ",
    "body": "\n    \n                    \n                          Alex Pretti\n                          GoFundMe Exceeds $1 Million\n                      \n                  \n                                                                        Published \n                              January 26, 2026\n                            11:36 AM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          A GoFundMe campaign launched to help the family of Alex Pretti has blown past the $20,000 goal ... currently at an astonishing $1.2 million as of Monday morning -- and climbing.\n      \n    \n          As you know ... Alex was shot and killed by a Border Patrol agent Saturday morning while protesting the agency's presence in Minnesota. His slaying has sparked massive backlash, with many saying that he was killed in cold blood. The Trump Administration disagrees.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Titled \"Alex Pretti is an American Hero,\" the GoFundMe was started by independent journalist Keith Edwards ... and he says Alex’s father, Michael, is the beneficiary and already has access to funds.\n      \n\n          Atop the nearly 32K donations is one for $10,000 ... shockingly given by Trump-supporting hedge-fund billionaire Bill Ackman. He dropped the $10K after being challenged to donate by Shannon Watts, the founder of Moms Demand Action for Gun Sense in America. Ackman wrote in a reply to SW ... \"Done. That said, I don't agree with the GoFundMe that he is an American hero, but his loss is tragic for him and his family.\"\n      \n    \n      \n        \n                    \n                  \n      \n                    Drop Site News\n          \n    \n          Keith says of Alex on the GoFundMe post ... \"This fundraiser is intended to support the loved ones he leaves behind with immediate and ongoing needs ... Thank you to everyone who has been so generous either donating or sharing the fundraiser -- you are what America can look like at our best.\"\n      \n    \n          We've reached out to Alex's family for comment on the funds ... so far, no word back.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Alex Pretti\n              \n                          \n                Donald Trump\n              \n                          \n                ICE\n              \n                          \n                Money\n              \n                          \n                Politics\n              \n                          \n                Shootings\n              \n                          \n                News\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Alex Pretti's GoFundMe Surpasses $1.2 Million, Bill Ackman Gives $10K",
      "image": [
        "https://imagez.tmz.com/image/50/16by9/2026/01/26/5019f92d543142e6be622031aa001d2c_xl.jpg"
      ],
      "datePublished": "2026-01-26T19:36:49.000Z",
      "dateModified": "2026-01-26T19:36:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Winter Skin Care",
    "url": "https://www.tmz.com/2026/01/26/winter-skin-care/",
    "image": "https://imagez.tmz.com/image/fb/16by9/2026/01/15/fb5173e1b1ec43538474cc95d25255fb_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-26T08:05:26.000Z",
    "description": "\n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          TMZ may colle",
    "body": "\n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          TMZ may collect a share of sales or other compensation from links on this page.\n      \n    \n          Winter has officially declared war on our skin … but don't let the freezing temps win.\n      \n    \n          If the weather has got your face feeling tight and flaky, it’s time to fight back with heavy-hitting moisturizers and ultra-hydrating face masks that can actually do something.\n      \n    \n          We've rounded up our fav winter skincare essentials that will soothe, hydrate and lock in moisture all season long.\n      \n    \n          TMZ CHEAT SHEET: WINTER SKIN FIXES\n  \n    \n          CeraVe Hydrating Facial Cleanser -- $16 Neutrogena Hydro Boost Hyaluronic Acid Gel Cream -- $22LANEIGE Lip Sleeping Mask -- $24EltaMD UV Clear Broad-Spectrum SPF 46 -- $45Biodance Bio-Collagen Real Deep Mask -- $19\n      \n    \n              \n      CeraVe Hydrating Facial Cleanser\n      \n        \n    \n                    \n                          \n                                  \n      \n        \n    \n          Hydrate your skin from the very start. This CeraVe Hydrating Facial Cleanser is the first step to moisturized skin, washing away makeup, dirt and other impurities … without stripping moisture.\n      \n    \n          Formulated for dry skin with hyaluronic acid, ceramides and glycerin, this gentle, non-foaming cleanser has a lotion-like consistency and provides 24-hour moisturizing. You’ll be left with hydrated, non-greasy skin, even before you put on your actual moisturizer. \n      \n    \n              \n      Neutrogena Hydro Boost Hyaluronic Acid Gel Cream\n      \n        \n    \n                    \n                          \n                                  \n      \n        \n    \n          Say goodbye to parched skin and hello to Neutrogena Hydro Boost Hyaluronic Acid Gel Cream. This lightweight water-like gel cream is formulated with hyaluronic acid and delivers instant hydration for nourished, dewy skin.\n      \n    \n          With famous fans like Kerry Washington and it-girl Tate McRae, this product pulls double duty, attracting water and hydrating skin to help restore its moisture balance. Winter will be no match for the strength of your skin’s moisture barrier.\n      \n    \n              \n      LANEIGE Lip Sleeping Mask\n      \n        \n    \n                    \n                          \n                                  \n      \n        \n    \n          Bella Hadid \"can't live without\" the LANEIGE Lip Sleeping Mask … and it’s about to become a must-have in your winter skincare routine.\n      \n    \n          A favorite of other celebs like Kendall Jenner and Sydney Sweeney, this overnight lip mask nourishes and hydrates while you catch some z’s, leaving you with smooth and supple looking lips.\n      \n    \n          Powered by antioxidant rich berry fruit complex, murumuru seed, coconut oil, vitamin c and shea butter. You’ll wake up in the AM feeling refreshed and with visibly smoother, baby-soft lips.\n      \n    \n              \n      EltaMD UV Clear Broad-Spectrum SPF 46\n      \n        \n    \n                    \n                          \n                                  \n      \n        \n    \n          You obviously can’t skip sunscreen in your skincare routine so you might as well make it moisturizing too.\n      \n    \n          The EltaMD UV Clear Broad-Spectrum SPF 46 oil free sunscreen is silky and lightweight, formulated with zinc oxide.\n      \n    \n          It’s perfect for sensitive skin, soothing and protecting skin types prone to acne, rosacea, and hyperpigmentation. Ideal for daily use, this broad spectrum sunscreen protects from UVA and UVB rays … and is fragrance-free, paraben-free and non-comedogenic. \n      \n    \n              \n      Biodance Bio-Collagen Real Deep Mask\n      \n        \n    \n                    \n                          \n                                  \n      \n        \n    \n          There’s nothing that the Biodance Bio-Collagen Real Deep Mask can’t do … and skincare lovers all agree.\n      \n    \n          Lala Kent says this sheet mask is like a trip to the spa, balancing effective skincare ingredients that lead to long-lasting results.\n      \n    \n          The hydrogel mask provides deep hydration thanks to oligo-hyaluronic acid while ultra-low molecular collagen maximizes skin penetration and absorption. Plus, it contains three different kinds of probiotics to strengthen the skin’s barrier and keep you hydrated all winter. \n      \n    \n          Sign up for Amazon Prime to get the best deals!\n      \n    \n          All prices subject to change.\n      \n      ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Winter Skin Care",
      "image": [
        "https://imagez.tmz.com/image/fb/16by9/2026/01/15/fb5173e1b1ec43538474cc95d25255fb_xl.jpg"
      ],
      "datePublished": "2026-01-26T08:05:26.000Z",
      "dateModified": "2026-01-26T08:05:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]