[
  {
    "title": "‘The Pitt’ Season 2 Casts Luke Tennie, Travis Van Winkle, Meta Golding and Christopher Thornton",
    "url": "https://variety.com/2025/tv/news/the-pitt-season-2-luke-tennie-travis-van-winkle-meta-golding-1236609400/",
    "image": "https://variety.com/wp-content/uploads/2025/12/MixCollage-15-Dec-2025-05-40-PM-4893.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-15T22:50:45.000Z",
    "description": "\n\tLuke Tennie, Travis Van Winkle, Meta Golding and Christopher Thornton have joined the cast of “The Pitt” Season 2.\n\n\tTennie (“Shrinking,” “Abbott El",
    "body": "\n\tLuke Tennie, Travis Van Winkle, Meta Golding and Christopher Thornton have joined the cast of “The Pitt” Season 2.\n\n\tTennie (“Shrinking,” “Abbott Elementary”) will play Dr. Crus Henderson, a fourth-year resident who works the night shift at the Pittsburgh Trauma Medical Center. \n\n\tVan Winkle (“You,” “Fubar”) will play Curtis Larson, an aggressive patient of the ER.\n\n\n\tGolding (“Rabbit Hole,” “Ransom Canyon”) will play Noelle Hastings, a nurse.\n\t\n\n\tThornton (“Magnum P.I.,” “The Lincoln Lawyer”) will play Dr. Caleb Jefferson, a psychiatric attending physician at the Pitt. \n\n\t“The Pitt” follows a group of healthcare workers through an intense shift at the Pittsburgh Trauma Medical Center. Season 1 took place on the day of a music festival, and Season 2, which premieres on Jan. 8 will be set during Independence Day Weekend. Noah Wyle stars alongside returning cast members Patrick Ball, Katherine LaNasa, Supriya Ganesh, Fiona Dourif, Taylor Dearden, Isa Briones, Gerran Howell, Shabana Azeez and Shawn Hatosy. Alongside Tennie, Winkle, Golding and Thornton, new cast members joining Season 2 include Sepideh Moafi, Laëtitia Hollard, Lucas Iverson, Lawrence Robinson, Zack Morris, Brittany Allen, Bonita Friedericy, Taylor Handley and Jeff Kober.\n\n\tThe series was created R. Scott Gemmill, who executive produces alongside John Wells, Wyle, Michael Hissrich, John Wells Production’s Erin Jontow and Simran Baidwan. Season 1 was a hit among critics and viewers, and went on five Emmys: drama series, lead drama actor (Wyle), supporting drama actress (LaNasa), guest actor (Hatosy) and drama casting.\n\t\n\n\tDeadline was first to report Tennie, Winkle, Golding and Thornton’s casting.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘The Pitt’ Season 2 Casts Luke Tennie, Travis Van Winkle, Meta Golding and Christopher Thornton",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/MixCollage-15-Dec-2025-05-40-PM-4893.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-15T22:50:45.000Z",
      "dateModified": "2025-12-15T22:50:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Hacks’ and ‘Morning Show’ Casting Directors on How New Faces Were ‘Integrated Seamlessly’ Into Established Casts",
    "url": "https://variety.com/2025/tv/news/hacks-morning-show-casting-new-characters-1236609154/",
    "image": "https://variety.com/wp-content/uploads/2025/12/The_Morning_Show_Photo_041009.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-15T23:33:53.000Z",
    "description": "\n\tWhether drama or comedy, bringing someone new into a beloved show isn’t an easy task. With a camaraderie between the actors, the pressure is on for ",
    "body": "\n\tWhether drama or comedy, bringing someone new into a beloved show isn’t an easy task. With a camaraderie between the actors, the pressure is on for casting directors to find someone who will mesh well, both in front of and behind the camera.\n\n\tInfluencer Jake Shane was presented to the “Hacks” team ahead of Season 4. Known for his comedic TikTok videos, he first auditioned for one of the late-night writer roles and was championed by his team. Ultimately, it didn’t work.\n\t\n\n\t“The producers knew him, appreciated his performance and soon after brought him on as Social Media Girlie. The role had originally been written for a woman, but we cast Jake and kept the name. It was too funny not to,” says Linda Lowy, the casting director behind the Emmy-winning HBO series.\n\n\n\tSince Shane is a “social media personality in real life,” it really just clicked, she explains. “His online presence, paired with his natural talent for acting, made him a perfect fit for the role of Social Media Girlie. I believe this may have been among his first acting roles, and possibly his television debut.”\n\n\tBut they didn’t just want the casting to be a stunt — it was important it made sense in every aspect of the show.\n\n\n\n\t\n\n\t\n\n\n\n\t“If it’s a recurring character, one needs to ensure they can be integrated seamlessly into the show both in tone and in performance,” says Lowy. “If it’s a guest star, they should not only naturally support but also complement the main cast with comparable skill and gravitas.”\n\n\tOn the drama front, “The Morning Show” is used to bringing in new people — often huge stars like Jon Hamm — into the show. In Season 4 of the Apple TV drama, Jeremy Irons joined the cast as Martin Levy, the estranged father of Alex (Jennifer Aniston). The character gave audiences a new peek into how Alex grew up and became the workaholic she is today.\n\t\n\n\tTo cast Irons, who has won an Oscar, a Tony and three Emmys, Aniston wrote a personal letter. “When you get a love letter from Jennifer Aniston, you at least open it,” says executive producer Kristin Hahn. “I don’t know that that hurtour chances!”\n\n\tDirector Mimi Leder added that she was “very surprised” when she spoke to Irons and learned he was a fan of the show. But casting director Victoria Thomas was not surprised: “This cast of actors and great writing — just as a casting director — it makes it really easy to get people to be on the show.”\n\n\tAniston’s Alex also got a new love interest this season in Bro, a Joe Rogan-type podcaster played by Boyd Holbrook. He had previously starred in “Narcos” and “The Sandman,” but had an interesting task with this role — both to woo and to disgust Alex Levy at the same time.\n\n\t“He had a certain masculinity that I think we wanted that fits a different energy for the show,” says Thomas. “He also wasn’t a caricature. We didn’t want to make him out to be some person we could make fun of and make a joke of.”\n\n\tThey were also looking for “an on-air persona who could give Alex a run for her money,” says Hahn. “Game meets game, on terms of on-air charisma, talent and the ability to be relatable.” \n\n\tFor a new show, things are a bit different — especially when one star is the anchor.\n\n\tIn HBO’s drama “Task,” Mark Ruffalo was set to lead as FBI agent Tom Brandis, and he needed someone to chase down. So, casting director Avy Kaufman began by “putting a list of actors together who could work well opposite Mark” to play Robbie Prendergrast — a criminal, but also a family man who’s easy to love.\n\n\n\n\t\n\n\t\t\t\t\tKennedy Moyer, Oliver Eisenson and Tom Pelphrey on “Task”\n\t\t\t\t\t\t\t\t\tPeter Kramer/HBO\n\t\n\n\n\n\t“Robbie needed to have strength along with a fatherly quality as this character was put in an unexpected situation in his life,” she says. “I looked for an actor who could portray a dreamer who has been knocked around, up and down, someone we will ultimately care about and understand.”\n\n\tShe was extremely selective while searching for Robbie, handpicking actors to read for the part. She had previously cast Tom Pelphrey “in a series he did not audition for” — but knew the team at “Task” needed to see him. \n\t\n\n\t“I was outspoken with all good reasons to cast Tom,” Kaufman says. “Tom’s reading showed all that he understood this character in a very smart, sensitive and determined way.”\n\n\tHis self-tape also blew away creator Brad Ingelsby.\n\n\t“You need a guy that can go into a house and be believable as a thief. You also need a guy that can go home and have a sense of humor. He’s able to lie in bed with his kids and tell them a story. I think that’s a tough thing to do,” he says. “He knows this world and these people in a way that other actors probably don’t. This is a part he felt ownership of from the jump — he came from this part of the world. Tom felt really confident about his understanding of the character, and I let him run with it.”\n\n\tPlus, post-pandemic Pelphrey had a long beard and straggly hair, something the producers begged him to keep upon seeing him on FaceTime. Ingelsby recalls, “We were like, ‘Oh, my God — that is exactly who Robbie is.’ Tom had a very clear sense of what this character would look like.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Hacks’ and ‘Morning Show’ Casting Directors on How New Faces Were ‘Integrated Seamlessly’ Into Established Casts",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/The_Morning_Show_Photo_041009.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-15T23:33:53.000Z",
      "dateModified": "2025-12-15T23:33:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jim Carrey ‘Freaked Out’ and ‘Called Cut’ When ‘Grinch’ Stunt Almost Hurt Child Co-Star Taylor Momsen: ‘I Always Felt Really Safe With Jim’",
    "url": "https://variety.com/2025/film/news/jim-carrey-freaked-out-grinch-set-stunt-hurt-taylor-momsen-1236607628/",
    "image": "https://variety.com/wp-content/uploads/2025/12/MSDDRSE_UV005.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-15T23:50:16.000Z",
    "description": "\n\tTaylor Momsen revealed in Vulture’s oral history on “How the Grinch Saved Christmas” that Jim Carrey once stopped production in the middle of filmin",
    "body": "\n\tTaylor Momsen revealed in Vulture’s oral history on “How the Grinch Saved Christmas” that Jim Carrey once stopped production in the middle of filming when a stunt involving his child co-star nearly harmed her. Momsen was 7 years old when she filmed “Grinch,” which marked her feature film debut in a major Hollywood studio movie. \n\n\t“I remember when we were shooting the scene coming down the mountain on the sled. It was this real sled that was up on a giant spring that was being controlled and moving from side to side, very aggressively,” Momsen told Vulture. “Jim is leaning over and being extravagant Jim. There was a moment where I almost fell out of the sled, and he freaked out. He called cut and started checking in on me. I was having a great time. I was laughing; I wasn’t thinking about the fact that I just almost fell very high off the ground.\n\t\n\n\t“I always felt really safe with Jim,” Momsen continued. “I liked being around him. At such a young age, to watch an artist who is that serious at what they’re doing even while playing this very over-the-top character, it was clear to me how much he was putting into it and how much of an artist he was.”\n\n\n\tCarrey told Vulture that he could tell instantly that Momsen was “an incredibly precocious child” and “smart beyond her years” when they first met before filming on the “Grinch” movie started, adding: “Her comedy timing was impeccable. A total pro. I don’t think she ever went up on a line or missed a cue or anything like that.”\n\n\tMomsen “never knew what Jim looked like” in real life, as she only ever saw him in full Grinch makeup when they were filming scenes together. The first time she actually met the real Jim Carrey was at the film’s premiere. The two recently made headlines after they reunited in November at the Rock and Roll Hall of Fame Induction Ceremony and posed together for photos. It was the first time Momsen and Carrey saw each other in 25 years.\n\t\n\n\t“I turned around in the hallway, and she was standing there,” Carrey told Vulture about the unexpected reunion. “I don’t know if she had heels or not, but she’s towering. I’m going, ‘What?’ She has a really powerful manner. I was so glad she’s done so well for herself. She’s been through some challenges in her life and come out the other side. It was very exciting to see her again. And she brought me a Crunchie, which is my favorite chocolate bar. That was awesome.”\n\n\tHead over to Vulture’s website to read the full “How the Grinch Stole Christmas” oral history.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jim Carrey ‘Freaked Out’ and ‘Called Cut’ When ‘Grinch’ Stunt Almost Hurt Child Co-Star Taylor Momsen: ‘I Always Felt Really Safe With Jim’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/MSDDRSE_UV005.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-15T23:50:16.000Z",
      "dateModified": "2025-12-15T23:50:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "James Cameron Is a Billionaire, Forbes Reports Days Before ‘Avatar: Fire and Ash’ Release",
    "url": "https://variety.com/2025/film/news/james-cameron-billionaire-forbes-avatar-fire-and-ash-1236609233/",
    "image": "https://variety.com/wp-content/uploads/2025/12/P103C9A0-e1765830009810.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-15T22:13:20.000Z",
    "description": "\n\tJames Cameron is officially a billionaire, Forbes reports just a few days ahead of the theatrical release of “Avatar: Fire and Ash.” The sequel is t",
    "body": "\n\tJames Cameron is officially a billionaire, Forbes reports just a few days ahead of the theatrical release of “Avatar: Fire and Ash.” The sequel is the third film in Cameron’s blockbuster “Avatar” film franchise, which includes 2009’s “Avatar” (the highest-grossing movie of all time with $2.9 billion) and 2022’s “Avatar: The Way of Water” (the third highest-grossing movie of all time with $2.3 billion).\n\n\tAs reported by Forbes: “Beginning in the 1980s with ‘The Terminator’ and ‘Aliens’ and extending through ‘Titanic’ and the first two ‘Avatar’ movies,. Cameron’s movies have collectively earned nearly $9 billion at the global box office, and his share of those earnings form the bulk of a personal net worth Forbes now estimates to be $1.1 billion. That puts Cameron on the extremely short list of filmmakers who have reached billionaire status, including George Lucas, Steven Spielberg, Peter Jackson and Tyler Perry.”\n\t\n\n\tThe publication adds: “Forbes estimates that Cameron stands to make at least $200 million (before taxes and fees) on ‘Avatar: Fire and Ash,’ assuming the movie lives up to its lofty box office expectations.”\n\n\tCameron often cites the money when it comes to defending or advocating for the “Avatar” franchise. When he pitched the studio on adding another sequel to his franchise plans, thus bringing the total number of “Avatar” films to five, he asked them if they were interested in more opportunities to make $2 billion grossers.\n\n\t“We were working on three scripts and then it turned into four. Two got split into two and three,” Cameron recently told Discussing Film. “I actually got a fair bit of pushback from the studio,” Cameron said. “My counterargument was, ‘Wait a minute. What part of you getting another chance to make $2 billion is in question here?’”\n\t\n\n\tWhen Discussing Film also asked Cameron why he continues to use 3D and high-frame rate to shoot the “Avatar” movies despite audience’s divisiveness to HFR, the director responded: “I think $2.3 billion says you might be wrong on that. Well, that’s the argument from authority. But the argument from artistic is: I happen to like it, and it’s my movie.”\n\n\t“Avatar: Fire and Ash” opens in theaters Dec. 19 from 20th Century Studios and Disney.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "James Cameron Is a Billionaire, Forbes Reports Days Before ‘Avatar: Fire and Ash’ Release",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/P103C9A0-e1765830009810.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-15T22:13:20.000Z",
      "dateModified": "2025-12-15T22:13:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How Hilton Cancun Takes the Stress Out of Trip Planning",
    "url": "https://variety.com/2025/shopping/travel/hilton-cancun-all-inclusive-resort-review-book-online-1236607885/",
    "image": "https://variety.com/wp-content/uploads/2025/12/HILTON_CANCUN_POOL_.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-15T23:53:38.000Z",
    "description": "\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.\n\n\tCancun, M",
    "body": "\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.\n\n\tCancun, Mexico, is famous for turquoise waters and white-sand beaches, but even the most picturesque destinations can be stressful to navigate. For families juggling kids, couples looking for a romantic escape, or business travelers trying to mix work with leisure, planning every detail of a getaway can quickly become overwhelming. Hilton Cancun, an All-Inclusive Resort, is solving that problem with its curated itineraries, which map out a seamless experience without feeling rigid — making it easy to enjoy the resort’s variety of dining options and amenities without overthinking each day.\n\n\n\tWhether you’re parents enjoying quiet moments while the kids explore the Kids and Teens Club, couples finding time for private beachfront dinners, or professionals blending meetings with downtime, the itineraries act as a blueprint for stress-free travel. The resort’s all-inclusive model means meals, drinks, entertainment, and amenities are covered, leaving guests to focus on what really matters: relaxing, connecting, and making the most of their vacation or work-cation.\n\n\tBy taking the guesswork out of planning, Hilton Cancun, an All-Inclusive Resort, positions itself as more than a resort — it’s a thoughtfully-designed escape where families, couples, and business travelers can all experience Cancun effortlessly. From sunrise yoga to evening entertainment, the resort’s curated itinerary approach ensures every traveler can make the most of their stay without sacrificing comfort or flexibility.\n\n\tHere’s what to know about the Hilton property and what to expect from your experience there.\n\n\t\n\t\tOn-Site Amenities for Every Type of Traveler\t\n\n\tHilton Cancun, an All-Inclusive Resort, is built around convenience. Parents can drop kids at the Kids & Teens Clubs, where daily programming ranges from hands-on crafts, to games and themed activities. Couples can carve out private moments in the resort’s lounges or at the pool, participate in oceanfront yoga, or enjoy nightly entertainment as a family.\n\n\tAround the resort, the four distinct pools give every group its own spot: a splash pool for younger kids, a family pool for all-ages hangouts, and quieter corners for adults who just want a moment.\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tHilton\n\t\n\n\n\n\tDining is just as versatile. Breakfast, lunch, and dinner options range from casual tacos at Maxal Taqueria to Mediterranean-inspired cuisine at La Luce, along with poolside bites at Seasalt. With the resort’s all-inclusive model, meals, drinks, and entertainment are handled, so guests can focus on enjoying their stay rather than planning logistics.\n\t\n\t\tOn-Site Add-Ons That Elevate Your Stay\t\n\n\tWhen you want something a little extra, the Hilton Cancun, an All-Inclusive Resort, offers add-ons for every type of traveler. Families can spend an afternoon at the indoor activity park, perfect for burning energy or escaping the heat. Those craving a reset can book a treatment at the Waldorf Astoria Spa, while culinary explorers can join a tequila tasting without ever leaving the property.\n\n\tThe resort also offers curated, pay-as-you-go packages that fit seamlessly into the week. Families can choose the Intrépoli Adventure Pass, giving kids a full afternoon of hands-on games like Go-Karts and laser tag. Adults can retreat to the Amai Beach Club, a kid-free tropical haven for lounging, cocktails, and beachfront downtime. For guests celebrating milestones—or just in the mood to indulge—the Special Moments Package, which pairs wine, treats and other romantic touches, or dive into a spa package for multi-hour treatments designed to reset both body and mind. Each add-on is optional, making it easy to tailor the trip without overplanning.\n\t\n\t\tOff-Resort Add-On Excursions for Adventure and Exploration\t\n\n\tFor those who want to venture beyond the resort, Hilton Cancun, an All-Inclusive Resort, makes it simple to book stress-free excursions. Families can wander through the Mayan ruins at Chichén Itzá or hop on a catamaran to Isla Mujeres for snorkeling and a day in the sun. Couples can slip into a Yucatán nature escape or enjoy a nearby dinner-and-acrobatics show, blending adventure with a touch of romance. Groups and business travelers can fit in a round of golf at El Tinto Golf Course or a tennis session at the Casa Club of Cancun Country Club, making it easy to balance recreation with work or social time.\n\n\n\tThese add-ons are fully optional, allowing guests to customize their experience without complicating the stay. With transportation and details handled, guests can focus on the experience itself, moving seamlessly between discovery and downtime without worrying about the logistics.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How Hilton Cancun Takes the Stress Out of Trip Planning",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/HILTON_CANCUN_POOL_.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-15T23:53:38.000Z",
      "dateModified": "2025-12-15T23:53:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How the ‘Deliver Me From Nowhere’ Sound Team  Created an Authentic Aural Experience for the Bruce Springsteen Drama",
    "url": "https://variety.com/2025/film/focus/deliver-me-from-nowhere-sound-team-bruce-springsteen-1236609410/",
    "image": "https://variety.com/wp-content/uploads/2025/12/DFN-06566_R.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-15T23:35:00.000Z",
    "description": "\n\tSound is imperative to the story of “Springsteen: Deliver Me From Nowhere.”\n\n\tThe Scott Cooper film, based on Warren Zanes’ book about the making of",
    "body": "\n\tSound is imperative to the story of “Springsteen: Deliver Me From Nowhere.”\n\n\tThe Scott Cooper film, based on Warren Zanes’ book about the making of Bruce Springsteen’s “Nebraska” and “Born in the USA,” revolves around the sound of those records, and if he can break through to his family, to himself, to be heard.\n\n\tWe see Jeremy Allen White, as Springsteen, writing and recording “Nebraska” on a four-track cassette recorder in the bedroom of a rented New Jersey lake house in 1981-82. Authenticity to the period was key for the sound team.\n\t\n\n\t“Jeremy did a ton of work with vocals and guitar,” says Jason Ruder, supervising music editor and a “huge fan of ‘Nebraska.’” He notes that Springsteen, who was on set almost every day, opened his recording vault to the production. “We had all the vocals Jeremy had done. We had all the tracks I was given by Bruce from the original four tracks. So from that, we were able to go into the editing process of the film, which took about eight months.”\n\n\n\tRuder notes that they sourced four-track recorders, and the Echoplex, the tape delay box “that was kind of an iconic sound of that album.”\n\n\t“It was kind of a dream job, to be honest,” says Ruder as he talks with fond nostalgia about the four-track recorder used in the film, the TEAC Tascam Portastudio 144. “It was actually the first tape recorder I had in high school. I had my first band at 13. I had one of those boxes, so I had a history with it.”\n\n\tA lot of research was put into Springsteen’s process, as well as “everything from the microphones that were used to the guitars that were played to studying a little bit of the acoustics in a house like that at Colt’s Neck [where Springsteen was holed up].” It was all those details that went into the music and sound concepts for the film.\n\t\n\n\t“I always use vintage equipment,” says production sound mixer Tod Maitland. “I will always double and triple microphone everything. So I’ll always have a vintage microphone going. … But for all that performance stuff that’s in the house, that’s all on those vintage microphones.”\n\n\tMaitland also admits that “I even went to the point of getting another one of those TEAC four-track cassette decks and actually recorded everything on that also.”\n\n\tThe lake house had good acoustics, according to Maitland, and the songs were soft, so there’s less sound bouncing off the walls. “So when we’re recording ‘Nebraska,’ he had the microphones on camera in front of him: one for guitar and for vocals.”\n\n\tWhen the film shifted to scenes at the Power Station recording studio in New York City, Maitland was delighted. “You know, the great thing about working in recording studios is that they’re recording studios, and they’re actually set up for people like me to record the best that you can possibly record,” he says. “And then they have all the vintage microphones there, because Springsteen recorded there back in the day.”\n\n\tThe sound and music teams were incredibly motivated to get the details correct.\n\n\t“Even when we get to the scene where Bruce is frustrated” that he can’t match the distortion he created on his “Nebraska” bedroom recording at the Power Station, says Ruder, “we were able to manufacture that distortion in a way that that seemed real, and it was great because Bruce would watch cuts, and he was able to give feedback and weigh in on things. So it was just sort of always setting the bar for what was authentic to each moment.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How the ‘Deliver Me From Nowhere’ Sound Team  Created an Authentic Aural Experience for the Bruce Springsteen Drama",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/DFN-06566_R.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-15T23:35:00.000Z",
      "dateModified": "2025-12-15T23:35:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump Sues BBC Demanding at Least $10 Billion in Damages Over Edited Jan. 6 Documentary",
    "url": "https://variety.com/2025/tv/news/trump-sues-bbc-10-billion-damages-edited-jan-6-panorama-documentary-1236609532/",
    "image": "https://variety.com/wp-content/uploads/2025/11/trump-copy.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-16T00:52:44.000Z",
    "description": "\n\tPresident Donald Trump has followed through on his threat to sue the BBC over the U.K. broadcaster’s documentary that edited his comments during the",
    "body": "\n\tPresident Donald Trump has followed through on his threat to sue the BBC over the U.K. broadcaster’s documentary that edited his comments during the rally leading up to the Jan. 6, 2021, attack on the U.S. Capitol.\n\n\tThe lawsuit was filed Monday by Trump’s lawyers in the U.S. District Court for the Southern District of Florida in Miami, alleging defamation and violation of Florida’s Deceptive and Unfair Trade Practices Act. Trump’s lawsuit demands no less than $5 billion in damages for each of the two counts, amounting to more than $10 billion total.\n\t\n\n\t“This action concerns a false, defamatory, deceptive, disparaging, inflammatory, and malicious depiction of President Trump, which was published in a BBC Panorama documentary, that was fabricated and aired by the Defendants one week before the 2024 Presidential Election in a brazen attempt to interfere in and influence the Election’s outcome to President Trump’s detriment,” the complaint reads. (A copy is available at this link.)\n\n\n\tThe BBC did not immediately respond to a request for comment.\n\n\tThe BBC chair Samir Shah last month told staff in an email that the broadcaster is “determined to fight” a potential lawsuit from Trump. “There is a lot being written, said and speculated upon about the possibility of legal action, including potential costs or settlements,” Shah said in the email, as reported by Sky News. Shah wrote that, “I want to be very clear with you — our position has not changed. There is no basis for a defamation case and we are determined to fight this.”\n\n\tThe “Panorama” scandal resulted in the resignation of BBC director general Tim Davie and CEO of news Deborah Turness after a leaked memo published by The Telegraph accused the broadcaster of editing a Trump speech in an episode to make it sound like he encouraged the Jan. 6 riots. \n\t\n\n\tA letter from Trump’s lawyers to the BBC demanded a full retraction of the documentary, an apology and payment to “appropriately compensate President Trump for the harm caused.” Last month, the BBC issued an apology to Trump but refused to offer compensation. The BBC said it has no plans to rebroadcast the documentary “Trump: A Second Chance?” on any BBC platforms. “While the BBC sincerely regrets the manner in which the video clip was edited, we strongly disagree there is a basis for a defamation claim,” the BBC said in a Nov. 13 statement.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump Sues BBC Demanding at Least $10 Billion in Damages Over Edited Jan. 6 Documentary",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/trump-copy.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-16T00:52:44.000Z",
      "dateModified": "2025-12-16T00:52:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kevin Bacon Fights Tears as He Remembers ‘A Few Good Men’ Director Rob Reiner: ‘Everybody Is Hurting Today’",
    "url": "https://variety.com/2025/film/news/kevin-bacon-fights-tears-a-few-good-men-rob-reiner-1236609516/",
    "image": "https://variety.com/wp-content/uploads/2025/12/FotoJet-70-1.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-16T00:39:14.000Z",
    "description": "\n\tKevin Bacon was on the verge of tears as he posted an emotional video tribute on Instagram to Rob Reiner, who directed him in the 1992 legal drama “",
    "body": "\n\tKevin Bacon was on the verge of tears as he posted an emotional video tribute on Instagram to Rob Reiner, who directed him in the 1992 legal drama “A Few Good Men.” It was nominated for four Oscars.\n\n\tReiner and his wife Michele were found dead in their Los Angeles home Sunday, and their son Nick is being held on suspicion of murder. \n\n\tBacon co-starred as a young Marine captain in the film, which starred Jack Nicholson and Tom Cruise. “I’m not sure how to do this,” Bacon starts out in the video, sounding emotional. “But Rob Reiner gave me a job in ‘A Few Good Men.’ Sometime in the ’90s, I guess it was. I was over the moon to get that job — people may or may not know but ‘This Is Spinal Tap’ is my all-time favorite movie and when he called me, I was just so thrilled.\n\t\n\n\t“The making of that movie was one of the best experiences I’ve ever had on a set,” Bacon continued. “He was so fun. It really comes down from the top, you know? You can set a tone where people feel like we are working hard but also working hard in a safe and pleasant and fun situation. You know, we had lunch together every day. I’ve never done that with a director before or since, I’d never gone to have lunch. And Michele would be there, and the two of them were so great together. Kyra would come by, she was pregnant, and bring Travis. It was a magical time.\n\n\t“So I’m just sending love to everybody that knew him because I know that everyone’s hurting today,” Bacon concludes.\n\n\n\tBacon’s co-star Demi Moore also had some heartfelt thoughts about her “A Few Good Men” director. \n\t\n\n\t“There are no words to truly express the unfathomable devastation of losing Rob and Michelle Reiner,” Moore wrote on Instagram. “Our kids grew up together, we worked together, and as our lives intertwined personally and professionally I will always cherish the moments and memories of what we shared.\n\n\t“They were amazing people and wonderful parents who gave of themselves to make the world a better place. My heart, thoughts, and prayers are with their family, friends, and all that are affected by this tragedy.”\n\n\n\tKiefer Sutherland, whose first film with Reiner was “Stand By Me” before he went on to play a second lieutenant in “A Few Good Men,” said in a statement, “Like so many, my heart was broken today when I heard the news about Rob Reiner and his wonderful wife, Michele. Rob was one of the kindest gentleman I’ve ever had the pleasure of working with, when I was very young he gave me an opportunity that changed my life, and I will forever be grateful.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kevin Bacon Fights Tears as He Remembers ‘A Few Good Men’ Director Rob Reiner: ‘Everybody Is Hurting Today’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/FotoJet-70-1.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-16T00:39:14.000Z",
      "dateModified": "2025-12-16T00:39:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Awards HQ: Viola Davis and Austin Butler Rally for ‘Sinners,’ Neon Parties With Kristen Stewart and Elle Fanning, and a Tribute to Rob Reiner",
    "url": "https://variety.com/2025/film/awards/sinners-viola-davis-austin-butler-neon-kristen-stewart-1236609458/",
    "image": "https://variety.com/wp-content/uploads/2025/12/4-Split-3x2-Layout-2-5.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-15T23:35:27.000Z",
    "description": "\n\n\n\t\n\n\t\n\n\n\n\tWelcome to Variety Awards HQ — your weekly command center for the Oscars race.\n\n\n\tIt’s Dec. 15, 2025, and this edition is dedicated to the",
    "body": "\n\n\n\t\n\n\t\n\n\n\n\tWelcome to Variety Awards HQ — your weekly command center for the Oscars race.\n\n\n\tIt’s Dec. 15, 2025, and this edition is dedicated to the magnificent Rob Reiner.\n\n\tThe news out of Los Angeles is devastating. Rob Reiner and his wife, Michele Singer, are no longer with us, and the shock of that loss still hasn’t settled in. In moments like this, language feels inadequate. I won’t focus on the tragedy. Instead, all we can do is look back — at the work, at the moments, at the stories — and say thank you.\n\n\n\tThe first Rob Reiner film I ever saw was “A Few Good Men.” I was too young to understand the mechanics of military law or the intricacies of courtroom procedure, but I understood the electricity of conviction. The thrill of watching ideas collide. The power of words when they felt sharp as a blade.\n\t\n\n\t“You can’t handle the truth!”\n\n\tJack Nicholson roared onto the screen, and even then, it felt like a cultural moment being born in real time. Reiner received his sole Academy Award nomination as a producer on “A Few Good Men” (1992), a fitting recognition for a film that crackles with intelligence and moral urgency. Nominated for best picture, it didn’t win the top prize, but it didn’t need to. The film entered the bloodstream of American cinema and never left.\n\n\tFrom that moment on, I was hooked.\n\n\tReiner’s career is one of the most quietly astonishing in modern Hollywood history. Not because he chased prestige — on the contrary, he chased truth across genres that rarely get that kind of respect.\n\n\t“Stand by Me” (1986) remains one of the purest coming-of-age films ever made. It understands childhood not as nostalgia, but as a fragile, fleeting state of grace. “I never had any friends later on like the ones I had when I was twelve,” the film tells us. Neither did we.\n\n\n\n\t\n\n\t\t\t\t\tSTAND BY ME, Director Rob Reiner on set, 1986.\n\t\t\t\t\t\t\t\t\t©Columbia Pictures/Courtesy Everett Collection\n\t\n\n\n\n\tThe train bridge. The leeches. The way he captured River Phoenix, one of my all-time favorite actors — it’s all encapsulated in a film that meets you where you are and stays with you long after.\n\t\n\n\t“The Princess Bride” (1987) created joy without irony. Romance without embarrassment. Humor without cruelty.\n\n\t“Hello. My name is Inigo Montoya.”\n\n\tWhat once struggled at the box office became a generational heirloom, passed down like a favorite bedtime story, reminding us that sincerity is not something to outgrow.\n\n\t“When Harry Met Sally…” (1989) changed romantic comedies forever, proving they could be adult, literate and honest. Nora Ephron’s dialogue sings, and Reiner’s direction let it breathe. The fake orgasm at Katz’s Deli. The way the film builds to Harry’s New Year’s Eve confession. It showed the entire genre what was possible.\n\n\tReiner carried that belief into “The American President” (1995), offering a vision of leadership rooted in decency, eloquence and moral clarity. It was romantic, yes, but also aspirational, planting the seeds for what would later grow into “The West Wing.” It reminded us what politics could sound like when it aimed higher.\n\n\tReiner could terrify us too. “Misery” (1990) turned psychological horror into something intimate and unbearable, and Kathy Bates’ Oscar-winning performance remains one of the most indelible in Academy history.\n\n\tAnd then there was “This Is Spinal Tap” (1984), a film so inventive it essentially created the mockumentary, forever changing the language of comedy. It goes to eleven, and it always will.\n\n\tBefore directing, Reiner became part of television history as Michael “Meathead” Stivic on “All in the Family,” earning two Emmy Awards and helping redefine what a sitcom could confront and contain. Later, he co-founded Castle Rock Entertainment, the company behind “The Shawshank Redemption,” “Seinfeld” and so many other landmarks of film and television.\n\n\tWhat made Reiner special was never the trophies. It was his belief that comedy could carry heartbreak, that drama could still be funny, and that genre was not a limitation — it was an invitation. He trusted viewers to be smart, curious and open. He trusted all of us. Not many filmmakers do that.\n\n\tSo thank you for “A Few Good Men,” the film that started it all for me. Thank you for “Stand by Me,” “The Princess Bride,” “When Harry Met Sally…” and “The American President.” Thank you for teaching us that love can be earnest, friendship can be eternal, and truth, no matter how uncomfortable, is worth fighting for.\n\t\n\n\tYour light lives on in every rewatch, every line read aloud, every perfect moment you gave us. That is immortality. And that is what lasts.\n\n\tRest peacefully, Rob Reiner. We’ll love you forever.\n\n\tPlease read my colleague Peter Debruge’s beautiful tribute on Variety as well.\n\t\n\t\t‘Sinners’ Turns the Town Red With SAG and Academy Power Plays\t\n\n\n\n\t\n\n\t\n\n\n\n\t“Sinners” continued its high-profile awards-season rollout with back-to-back industry events targeting key voting bodies.\n\n\tOn Sunday, Dec. 14, Viola Davis moderated a SAG-AFTRA Foundation Q&A at the Meryl Streep Center for the Performing Arts, joined by actors Michael B. Jordan and Wunmi Mosaku, along with casting director Francine Maisler. The event drew a packed house of SAG-AFTRA members, underscoring the film’s strong appeal with actors as guild voting intensifies.\n\n\tEarlier in the week, Austin Butler hosted a tastemaker screening at Soho House on Monday, Dec. 8, co-hosted by WME. The evening featured a Q&A moderated by Chris Columbus with director-writer-producer Ryan Coogler, Jordan and Maisler, with producer Zinzi Coogler also in attendance.\n\n\tThe room was filled exclusively with Academy of Motion Picture Arts and Sciences members, signaling a targeted push as phase one Oscar voting heats up.\n\n\n\n\t\n\n\t\n\n\n\n\t\n\t\tBaz Luhrmann, Michael Keaton and Edward Norton Host Star-Driven ‘Train Dreams’ Events\t\n\n\n\n\t\n\n\t\t\t\t\tLOS ANGELES, CALIFORNIA – DECEMBER 09: (L-R) Baz Luhrmann, Joel Edgerton, and Clint Bentley attend Netflix’s “Train Dreams” Baz Luhrmann Hosted Cocktail Reception at Chateau Marmont on December 09, 2025 in Los Angeles, California. (Photo by Presley Ann/Getty Images for Netflix)\n\t\t\t\t\t\t\t\t\tGetty Images for Netflix\n\t\n\n\n\n\tJoel Edgerton’s awards-season presence continues to build with two high-profile industry gatherings aimed squarely at guild and Academy voters.\n\n\tOn Tuesday, Nov. 9, Baz Luhrmann hosted an intimate reception in honor of Edgerton, whom he directed in “The Great Gatsby” (2012). The event drew a notable crowd that included Oscar nominees Edward Norton and Steven Yeun, in addition to Tobey Maguire, Phoebe Dynevor and Christina Hendricks.\n\n\tMomentum carried through Thursday, Nov. 11, when Oscar nominee Michael Keaton (“Birdman”) hosted a screening and Q&A at CAA with Edgerton and the film’s director and co-writer Clint Bentley.\n\n\tThe event attracted a full room of AMPAS, along with major guild voters of WGA, DGA and PGA.\n\n\n\n\t\n\n\t\n\n\n\n\t\n\t\tPeacock Celebrates ‘All Her Fault’ With Decision-Free Dinner at Chateau Marmont\t\n\n\n\n\t\n\n\t\t\t\t\tALL HER FAULT — Decision-Free Dinner — Pictured: (l-r) Shelley Zalis, Eve Rodsky, Dakota Fanning at the Chateau Marmont on December 10, 2025 — (Photo by: Todd Williamson/Peacock)\n\t\t\t\t\t\t\t\t\tTodd Williamson/Peacock\n\t\n\n\n\n\tPeacock and The Female Quotient marked the awards-season momentum of breakout TV hit “All Her Fault” with an intimate dinner on Wednesday, Dec. 10, at the Chateau Marmont.\n\n\tThe “decision-free” evening celebrated the series — Peacock’s biggest original launch to date — as it begins its early Emmy run for next year amid Golden Globe and Critics Choice nominations.\n\n\tHosted by pop culture critic and “Shut Up Evan” creator Evan Ross Katz, with Dakota Fanning serving as the night’s special guest, the gathering was designed as a rare pause for women accustomed to carrying the mental and emotional load of daily life. Every detail was handled, allowing guests to simply arrive, unwind and engage in discussion centered on the show’s themes of female resilience, empowerment and self-preservation.\n\t\n\n\tThe dinner brought together a cross-section of influential voices spanning advocacy, entertainment and pop culture, including Shelley Zalis, Eve Rodsky, Gabrielle Stone, Haley Melikian, Blakely Thornton, Hannah Pistoia, Anna Konkle, Cheri Oteri, Megan Stalter, Parvati Shallow and Renata Ribeiro.\n\n\n\n\n\t\n\n\t\t\t\t\tPark Chan-wook and Paul Feig at the Los Angeles premiere of “No Other Choice,” with director Park Chan-wook \n\t\t\t\t\t\t\t\t\tJay L. Clendenin/for Neon\n\t\n\n\n\t\n\t\tNeon Lights Up December With ‘No Other Choice’ L.A. Premiere With Park Chan-wook\t\n\n\tNeon closed out Dec. 9 with a trio of high-profile events for its international slate.\n\n\tThe day began in Los Angeles with the red-carpet premiere of Park Chan-wook’s “No Other Choice” at the Academy Museum’s David Geffen Theater, continued with an intimate tastemaker screening for Joachim Trier’s “Sentimental Value,” and culminated with Neon’s annual holiday party in New York, drawing one of the season’s most eclectic guest lists.\n\n\tAt the Academy Museum, “No Other Choice” rolled out in full awards-season form, featuring a red carpet, screening, filmmaker Q&A and after-party. Director Park Chan-wook and star Lee Byung Hun led the evening, participating in a post-screening conversation that highlighted the film’s creative ambitions.\n\n\tThe premiere drew an impressive cross-section of industry figures, including director Paul Feig (pictured) with his wife Laurie Feig, Julie Delpy, Tatiana Maslany, Dan Stevens, Hideo Kojima, Omar Benson Miller, Janicza Bravo, Mimi Rogers and Daniel Scheinert.\n\n\tAcross town, Coach hosted an intimate screening and dinner celebrating global ambassador Elle Fanning and her latest film, “Sentimental Value,” at San Vicente Bungalows.\n\n\tThe celebrations extended to the East Coast with Neon’s holiday party at San Vicente West Village in New York, where filmmakers and talent from across the company’s slate gathered under one roof.\n\n\tAttendees included Park Chan-wook, Lee Byung Hun, Elle Fanning and Kristen Stewart (pictured below), Joachim Trier, Stellan Skarsgard, Renate Reinsve, Alexander Skarsgard, Kristen Stewart, Wagner Moura, Oliver Laxe, Kleber Mendonça Filho, Clark Gregg, among others.\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tJade Greene\n\t\n\n\n\n\t\n\t\tDwayne Johnson Set for ‘The Smashing Machine’ Conversation at SAG-AFTRA Foundation\t\n\n\n\n\t\n\n\t\n\n\n\n\tDwayne Johnson will headline an upcoming SAG-AFTRA Foundation screening and conversation for “The Smashing Machine” on Wednesday, Dec. 17, at the Meryl Streep Center for the Performing Arts.\n\n\tThe event will begin with a morning screening, followed by a moderated discussion by Clayton Davis, with Johnson exploring his performance and the film’s creative journey.\n\t\n\n\tHosted at the SAG-AFTRA Foundation’s flagship venue, the gathering is expected to draw a huge crowd from guild members as Johnson continues to expand his dramatic footprint and angle for Oscar recognition for his towering performance in Benny Safdie’s emotional drama.\n\n\t\n\t\tSpotlight on the Sound of ‘Sirāt’ with Composer Kangding Ray and Sound Designer Laia Casanovas\t\n\n\n\n\t\n\n\t\n\n\n\n\tAs awards-season attention turns toward below-the-line artistry, a newly released clip highlighting the sound design of “Sirât” puts a spotlight on the film’s immersive sonic craftsmanship.\n\n\tThe showcase shows the collaborative work of composer Kangding Ray and sound designer Laia Casanovas, whose contributions have been central to the film’s sensory impact.\n\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Awards HQ: Viola Davis and Austin Butler Rally for ‘Sinners,’ Neon Parties With Kristen Stewart and Elle Fanning, and a Tribute to Rob Reiner",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/4-Split-3x2-Layout-2-5.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-15T23:35:27.000Z",
      "dateModified": "2025-12-15T23:35:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Frankenstein’ Production Designer Tamara Deverell Build Epic Lab and Ship Sets for Guillermo del Toro’s Gothic Tale",
    "url": "https://variety.com/2025/artisans/news/frankenstein-production-design-ship-lab-sets-del-toro-1236608972/",
    "image": "https://variety.com/wp-content/uploads/2025/12/PF_20240419_16915_R.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-15T22:15:00.000Z",
    "description": "\n\tWhen Guillermo del Toro called on production designer Tamara Deverell to work on “Frankenstein,” one thing was clear: there would be no green screen",
    "body": "\n\tWhen Guillermo del Toro called on production designer Tamara Deverell to work on “Frankenstein,” one thing was clear: there would be no green screen. Everything would be handmade from scratch. “We had 20 sculptors at any given moment working,” Deverell says.\n\n\tDel Toro’s “Frankenstein” traces young Victor Frankenstein (Oscar Isaac) as he comes to terms with his mother’s death. In doing so, he decides he’s going to find the answer to eternal life and spends his years building what becomes the Creature (Jacob Elordi).\n\t\n\n\n\n\t\n\n\t\t\t\t\tFRANKENSTEIN. Production Designer Tamara Deverell with crew members on the set of Frankenstein. Cr. Ken Woroner/Netflix © 2025.\n\t\t\t\t\t\t\t\t\tKen Woroner/Netflix\n\t\n\n\n\n\tDeverell’s sets included building a ship — the Horisont — as well as Victor’s lab, where he creates the Creature.\n\n\n\tLocation scouting took Deverell around the world, including to Canada, Croatia and the Czech Republic, but she ultimately found Scotland to be the perfect home for the sets. “We were looking at a lot of places in Scotland,” Deverell says. “We were at Stirling Castle, and we were at the Wallace Tower.”\n\n\tThe latter served as the inspiration for the lab.\n\n\tThe “Sphinx feet” on the exterior tower was a detail that del Toro wanted and so was added to the stonework. The tower was built, and later the practical miniature was destroyed in camera.\n\n\tThe lab undergoes various iterations as it evolves onscreen. “We really mapped it out. Ata certain point, I did plans for each look that I would run by Guillermo over and over again, until I think he didn’t want to look over anymore,” she says.\n\t\n\n\tA visit to the Hunterian Museum in London provided valuable research. There, she took over 3,000 photos of all the props of the period, the medical implements, instruments and dioramas.\n\n\tDuring that same visit, she saw the real set of Evelyn anatomical tables from the 1600s that held preserved human tissue and which were used as a teaching tool. A replica table was made for the film based on that museum piece.\n\n\n\n\t\n\n\t\n\n\n\n\tdel Toro’s circular motif features heavily in the film. Deverell — who has worked with delToro on “Mimic,” “The Strain,” “Guillermo del Toro’s Cabinet of Curiosities” and “Nightmare Alley” — is no stranger to the filmmaker’s motifs.\n\n\tIt represents the circle of life, and in this film, the circular narrative of the beginning and the end. She embedded circles in the ship’s windows and the lab. The most prominent circle was the giant Medusa’s head in Frankenstein’s lab. For del Toro, it reflected the mythological scale of the movie and the misunderstood monster that is Medusa. del Toro wanted to remind audiences of how Medusa is used in waterways and water towers and cisterns in the Middle East. \n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tKen Woroner/Netflix\n\t\n\n\n\n\tThe lab’s battery towers were also constructed. \n\n\tConcept artist Guy Davis came up with design ideas back in 2022, and those stuck — they were carried through to the final film. Deverell’s team built all four of the glass towers to full size: each stood at 15 feet and had a green hue. When Victor powers them up with electricity, they turn red.\n\n\tThe massive scale of the sets didn’t just extend to the lab; the ship was another big set build for Deverell. “There was no studio space, giant factory space or anything that we could find that would give Guillermo all the angles he wanted because when he was shooting wide, he was actually in front of the ship,” she says.\n\n\tThat aspect of the project was a dream come true for the production designer, who says she had always wanted to build a ship. “I did a lot of research on ships,” she says. That research took her to the Cutty Sark in London as well as the Maritime Museum — “any ship that I could get close to, I was all over.”\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tKen Woroner/Netflix\n\t\n\n\n\n\tIn the end, Deverell and her team built the ship using old wood that they had to jet wash to age.\n\t\n\n\tFurthermore, Arctic historian and archeologist Matthew Betts also advised her. “He was giving us information like, could we do iron plates on the ship, because that’s what they had for the ice, andit was such a Frankenstein thing to do these iron plates that we could then age and ice.”\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tKen Woroner/Netflix\n\t\n\n\n\n\tOnce the entire ship had been completed, it was mounted on a gimbal so the Creature could rock it. “We had many conversations with Guillermo. ‘How do you want it to move?’ The first thing we had to build was this giant gimbal that our special effects team built to have the whole ship rotate,” Deverell says.\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tJohn Wilson/Netflix\n\t\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Frankenstein’ Production Designer Tamara Deverell Build Epic Lab and Ship Sets for Guillermo del Toro’s Gothic Tale",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/PF_20240419_16915_R.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-15T22:15:00.000Z",
      "dateModified": "2025-12-15T22:15:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "TMZ Sports Streaming Live From Newsroom, Join The Conversation!",
    "url": "https://www.tmz.com/2025/12/15/tmz-sports-live-stream/",
    "image": "https://imagez.tmz.com/image/b2/16by9/2025/12/15/b2d2761e661f4cb5b27d968abc1e701a_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-12-15T20:56:25.000Z",
    "description": "\n    \n                    \n                          TMZ Sports Live Stream\n                          Join The Conversation!!!\n                      \n",
    "body": "\n    \n                    \n                          TMZ Sports Live Stream\n                          Join The Conversation!!!\n                      \n                  \n                                                                        Published \n                              \n                December 15, 2025\n                \n                            12:56 PM PST\n                                                                      |\n                                                                Updated \n                                  December 15, 2025\n                                1:36 PM PST\n                                    \n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          TMZ Sports is going live from the newsroom to discuss the day's biggest stories ... but we don't just want folks to watch and enjoy the conversation, we want y'all to get involved!!\n      \n    \n          Hit the comment section as Babcock, Lucas, Mojo, Luca and the whole crew break down the most important topics of the day ... and we'll be interacting with viewers throughout the program between 1 and 2 PM PT.\n      \n    \n          YouTube, X, TikTok ... we're everywhere.\n      \n    \n          So tune in, make fun of us, share your two cents, sound off about your favorite team ... nothing is out of bounds.\n      \n    \n          Monday's show includes Patrick Mahomes' injury, LeBron James' beef, John Cena's farewell to WWE and much more!!\n      \n      \n              \n          \n                          \n                TMZ Sports\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "TMZ Sports Streaming Live From Newsroom, Join The Conversation!",
      "image": [
        "https://imagez.tmz.com/image/b2/16by9/2025/12/15/b2d2761e661f4cb5b27d968abc1e701a_xl.jpg"
      ],
      "datePublished": "2025-12-15T20:56:25.000Z",
      "dateModified": "2025-12-15T20:56:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nicole Brown's Sister Calls Rob Reiner's Brentwood Stabbing 'Triggering'",
    "url": "https://www.tmz.com/2025/12/15/nicole-brown-simpson-sister-says-rob-reiner-murders-triggering/",
    "image": "https://imagez.tmz.com/image/63/16by9/2025/12/15/63c7447760054738a09a1916d05cb561_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-12-15T22:57:01.000Z",
    "description": "\n    \n                    \n                          Nicole Brown's Sister\n                          Draws Parallels Between Rob Reiner's Murder and t",
    "body": "\n    \n                    \n                          Nicole Brown's Sister\n                          Draws Parallels Between Rob Reiner's Murder and the O.J. Case\n                      \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Tanya Brown -- whose sister, Nicole Brown, was slain in 1994 -- opened up to TMZ about the eerie similarities between Rob and Michele Reiner's killings and the brutal murder of her sister, which sparked the infamous O.J. Simpson murder trial.\n      \n    \n          Tanya tells TMZ ... she saw the words \"murder in Brentwood\" posted on social media Sunday night, which understandably conjured up old, terrible memories.\n      \n    \n          As we reported ... Rob and his wife were found Sunday with their throats slit inside their Brentwood, California home.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Tanya said, \"The story is very triggering -- beyond triggering. I’ve shed a lot of tears ... it’s very personal to me.\"\n      \n\n          Remember ... Nicole also lived in Brentwood and was viciously stabbed to death outside her home 29 years ago in a double homicide that included restaurant server Ron Goldman.\n      \n    \n          She continued ... \"When I heard it was a stabbing, it brought me back to that time of O.J. killing my sister and Ron.\"\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          While no one was ever criminally convicted in Nicole and Ron's murders, Tanya says she hopes the Reiner family gets justice and \"the person responsible doesn't get away with it.\"\n      \n    \n          \"But I hope the person also gets rehabilitated while incarcerated,\" she said. \"It makes me sad for the family, I feel for them. This didn’t need to happen.\"\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Rob and Michele's 32-year-old son Nick is currently in police custody, being held without bail on suspicion of murdering them.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                RIP\n              \n                          \n                Arrests\n              \n                          \n                Celebrity Death\n              \n                          \n                TMZ Sports\n              \n                          \n                Crime\n              \n                          \n                Exclusive\n              \n                          \n                Rob Reiner Death\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nicole Brown's Sister Calls Rob Reiner's Brentwood Stabbing 'Triggering'",
      "image": [
        "https://imagez.tmz.com/image/63/16by9/2025/12/15/63c7447760054738a09a1916d05cb561_xl.jpg"
      ],
      "datePublished": "2025-12-15T22:57:01.000Z",
      "dateModified": "2025-12-15T22:57:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nick Reiner Held on Suicide Watch After Arrest on Suspicion of Killing Parents",
    "url": "https://www.tmz.com/2025/12/15/nick-reiner-suicide-watch-after-arrest/",
    "image": "https://imagez.tmz.com/image/96/16by9/2025/12/15/96ba980942394c0cb679c5963f43bc6f_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-12-15T23:12:19.000Z",
    "description": "\n    \n                    \n                          Rob & Michele Reiner\n                          Son On Suicide Watch ...\n                         ",
    "body": "\n    \n                    \n                          Rob & Michele Reiner\n                          Son On Suicide Watch ...\n                          After Arrest in Parents' Murder Case\n                      \n                  \n                                                                        Published \n                              \n                December 15, 2025\n                \n                            3:12 PM PST\n                                                                      |\n                                                                Updated \n                                  December 15, 2025\n                                4:27 PM PST\n                                    \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Nick Reiner is on suicide watch after being arrested on suspicion of murdering his parents, Rob and Michele Reiner ... TMZ has learned.\n      \n    \n          Law enforcement sources tell TMZ ... Nick is on suicide watch and in administrative segregation at Twin Towers Correctional Facility in L.A. ... while he's being held without bail.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          As we reported ... prior to Rob and Michele's stabbing, Nick got into a \"very loud argument\" with his father at Conan O'Brien's Christmas party Saturday night. We're told the shouting match was loud enough for many others to hear, and that Rob and Michele then left the party. We do not know if Nick left with them.\n      \n\n          A source told us Nick looked out of place at the party, mostly keeping to himself.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Our family sources told us … Michele had been anguishing to friends over the last few months that she and Rob were at their wits' end over Nick's mental illness and alleged substance abuse issues, and did not know what to do with their son Nick ... saying, \"We've tried everything.\"\n      \n    \n          As you know ... the legendary actor-director and his wife were found in their L.A.-area house Sunday with their throats slit. Nick was arrested Monday morning and booked for murder.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Michele Reiner\n              \n                          \n                Nick Reiner\n              \n                          \n                Rob Reiner\n              \n                          \n                Celebrity News\n              \n                          \n                Exclusive\n              \n                          \n                Health\n              \n                          \n                Police\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nick Reiner Held on Suicide Watch After Arrest on Suspicion of Killing Parents",
      "image": [
        "https://imagez.tmz.com/image/96/16by9/2025/12/15/96ba980942394c0cb679c5963f43bc6f_xl.jpg"
      ],
      "datePublished": "2025-12-15T23:12:19.000Z",
      "dateModified": "2025-12-15T23:12:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Billy Crystal Saw Rob and Michele Reiner's Slain Bodies",
    "url": "https://www.tmz.com/2025/12/15/billy-crystal-wife-saw-reiner-bodies-after-daughter-called-them/",
    "image": "https://imagez.tmz.com/image/19/16by9/2025/12/15/1954ad570a0e46878fbcd6be5593e654_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-12-15T23:37:13.000Z",
    "description": "\n    \n                    \n                          Rob & Michele Reiner Murders\n                          Billy Crystal Saw Dead Bodies\n            ",
    "body": "\n    \n                    \n                          Rob & Michele Reiner Murders\n                          Billy Crystal Saw Dead Bodies\n                      \n                  \n                                                                        Published \n                              \n                December 15, 2025\n                \n                            3:37 PM PST\n                                                                      |\n                                                                Updated \n                                  December 15, 2025\n                                4:27 PM PST\n                                    \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Billy Crystal and his wife Janice saw the slain bodies of Rob Reiner and his wife Michele ... because TMZ has learned they arrived at the scene in a flash after a family member called them about the horrific discovery.\n      \n    \n          Sources with direct knowledge tell TMZ ... Rob and Michele's daughter Romy called Crystal and his wife not long after she called police to report finding her parents brutally murdered inside their Brentwood home Sunday.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Sources with direct knowledge tell us Billy and his wife raced over to the house -- and were there so quickly, one source tells us -- the couple actually saw their slain friends ... and wanted to say their goodbyes.\n      \n\n          As you know, Rob and Michele were found Sunday afternoon … their son Nick was located and arrested on suspicion of murder about six hours later … he's currently being held without bail on suicide watch.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Michele Reiner\n              \n                          \n                Billy Crystal\n              \n                          \n                Rob Reiner\n              \n                          \n                Celebrity News\n              \n                          \n                RIP\n              \n                          \n                Movies\n              \n                          \n                Exclusive\n              \n                          \n                Rob Reiner Death\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Billy Crystal Saw Rob and Michele Reiner's Slain Bodies",
      "image": [
        "https://imagez.tmz.com/image/19/16by9/2025/12/15/1954ad570a0e46878fbcd6be5593e654_xl.jpg"
      ],
      "datePublished": "2025-12-15T23:37:13.000Z",
      "dateModified": "2025-12-15T23:37:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'General Hospital' Star Anthony Geary Dead at 78",
    "url": "https://www.tmz.com/2025/12/15/general-hospital-anthony-geary-dead/",
    "image": "https://imagez.tmz.com/image/97/16by9/2025/12/15/970920f26d604c298f116603bdeca807_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-12-15T17:38:16.000Z",
    "description": "\n    \n                    \n                          'General Hospital' Anthony Geary\n                          Dead at 78\n                      \n    ",
    "body": "\n    \n                    \n                          'General Hospital' Anthony Geary\n                          Dead at 78\n                      \n                  \n                                                                        Published \n                              \n                December 15, 2025\n                \n                            9:38 AM PST\n                                                                      |\n                                                                Updated \n                                  December 15, 2025\n                                1:19 PM PST\n                                    \n      \n    \n          Anthony Geary, who famously played Luke Spencer on \"General Hospital,\" is dead ... TMZ has confirmed.\n      \n    \n          The soap opera star died Sunday in Amsterdam ... according to a family member.\n      \n    \n          Anthony's official cause of death is unclear, but there are reports he died as a result of complications from a planned surgery in Amsterdam.\n      \n\n                  \n          \n                          \n                \n                  \n      \n    \n          Anthony won eight Daytime Emmy Awards and is mostly known for his role on \"General Hospital\" ... though he also made appearances on \"The Partridge Family,\" \"The Mod Squad,\" \"All in the Family\" and \"The Young and the Restless.\"\n      \n    \n          On \"General Hospital,\" Anthony and Genie Francis became the signature couple among soap operas ... and when their characters got married in 1981, a whopping 30 million people tuned in for the TV nuptials, with Hollywood icon Elizabeth Taylor -- a huge 'GH' fan -- making a cameo.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Anthony was born in Utah and raised by Mormon parents. He earned a theater scholarship to the University of Utah and got his career started as a stage actor before moving to Los Angeles in the 1970s and getting into Hollywood.\n      \n    \n          Anthony was 78.\n      \n    \n          RIP\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Celebrity News\n              \n                          \n                RIP\n              \n                          \n                TV\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'General Hospital' Star Anthony Geary Dead at 78",
      "image": [
        "https://imagez.tmz.com/image/97/16by9/2025/12/15/970920f26d604c298f116603bdeca807_xl.jpg"
      ],
      "datePublished": "2025-12-15T17:38:16.000Z",
      "dateModified": "2025-12-15T17:38:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]