[
  {
    "title": "‘Sherri’ Daytime Talk Show Canceled After Four Seasons",
    "url": "https://variety.com/2026/tv/news/sherri-daytime-talk-show-canceled-four-seasons-1236650355/",
    "image": "https://variety.com/wp-content/uploads/2022/06/Sherri-Shepherd-header.jpg?w=1000&h=562&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-03T00:51:14.000Z",
    "description": "\n\tComedian Sherri Shepherd’s talk show “Sherri” is ending its run after four seasons, Variety has learned. News comes just as another daytime yakker, ",
    "body": "\n\tComedian Sherri Shepherd’s talk show “Sherri” is ending its run after four seasons, Variety has learned. News comes just as another daytime yakker, “The Kelly Clarkson Show,” also announced that it would wrap up at the end of 2026 after seven seasons. \n\n\tLionsgate’s producer/distributor shingle Debmar-Mercury confirmed the news Monday. “Sherri” had most recently been cleared through the 2025-2026 TV season on station groups like the Fox TV Stations, Nexstar, Hearst, Sinclair, Gray, Tegna and Sunbeam. \n\t\n\n\t“This decision is driven by the evolving daytime television landscape and does not reflect on the strength of the show, its production – which has found strong creative momentum this season – or the incredibly talented Sherri Shepherd,” Debmar-Mercury co-presidents Ira Bernstein and Mort Marcus said in a joint statement. “We believe in this show and in Sherri and intend to explore alternatives for it on other platforms.”\n\n\n\tLast season upon its pickup, Fox TV Stations exec vice president of programming Frank Cicha called the show “a linchpin of our daytime lineup.” \n\n\t“Sherri” tapes at New York’s Chelsea Studios and is both produced and distributed by Debmar-Mercury. \n\n\t“I don’t take it for granted that people welcome me into their homes daily,” Shepherd said last year when the show was renewed for a Season 4. “I work so hard to bring escapism to viewers’ lives through joy, laughter and inspiration, and I’m grateful that the audience has embraced what we do. I look forward to raising the bar and turning up the volume as we plan for our season four return.”\n\t\n\n\tThe former cohost of “The View,” actress, comedian and Emmy winner Shepherd first launched her own talk show in fall 2022. “Sherri” originally took over the time slots on the Fox stations that were previously occupied by “The Wendy Williams Show,” which Debmar-Mercury produced and distributed for 13 seasons.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Sherri’ Daytime Talk Show Canceled After Four Seasons",
      "image": [
        "https://variety.com/wp-content/uploads/2022/06/Sherri-Shepherd-header.jpg?w=1000&h=562&crop=1"
      ],
      "datePublished": "2026-02-03T00:51:14.000Z",
      "dateModified": "2026-02-03T00:51:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "BTS Announces Livestream Concert and Feature-Length Documentary to Air on Netflix",
    "url": "https://variety.com/2026/music/news/bts-announces-livestream-concert-documentary-netflix-1236650340/",
    "image": "https://variety.com/wp-content/uploads/2025/12/GettyImages-1202149664.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-03T00:25:50.000Z",
    "description": "\n\tBTS is mounting a big comeback with the announcement of both a livestreamed performance and a feature-length documentary, both airing on Netflix in ",
    "body": "\n\tBTS is mounting a big comeback with the announcement of both a livestreamed performance and a feature-length documentary, both airing on Netflix in partnership with Hybe.\n\n\tThe live performance, titled “BTS the Comeback Live | Arirang,” will stream on Netflix on March 21 at 4 a.m. PT / 7 a.m. ET. The concert will take place in Gwanghwamun in Seoul, just after the release of their new album “Arirang” on March 20. Hamish Hamilton, known for directing the majority of Super Bowl Halftime shows since 2010, is slated to direct the performance, which will be the first-ever live event broadcast from Korea to be livestreamed globally.\n\t\n\n\tThen, just a week later, the documentary “BTS: The Return” will debut on Netflix on March 27. The film, directed by Bao Nguyen (“The Greatest Night in Pop”), will chronicle the return of the group — consisting of RM, Jin, Suga, J-Hope, V and Jung Kook — as they reunite in Los Angeles to make music following their hiatus. According to a press release, the film will portray them as they “create new music that reflects who they are now — culminating in what will become a landmark album of its time.”\n\n\n\t“Arirang” marks BTS’ first new album since 2022’s “Proof,” which was followed by the hiatus. The gap saw the individual members fulfilling mandatory military service in South Korea and recording a multitude of solo projects.\n\n\tJust last month, BTS announced its global tour for 2026 and 2027, with 79 performances slated for 34 markets. The tour will launch with three hometown concerts in Goyang, South Korea on April 9 and April 11-12, followed by extensive dates in Tokyo before heading over to North America.\n\n\n\n\t\n\n\t\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "BTS Announces Livestream Concert and Feature-Length Documentary to Air on Netflix",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/GettyImages-1202149664.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-03T00:25:50.000Z",
      "dateModified": "2026-02-03T00:25:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "CBS News Contributor Peter Attia Apologizes for Correspondence with Jeffrey Epstein: ‘I Was Not Involved in Any Criminal Activity’",
    "url": "https://variety.com/2026/tv/news/peter-attia-apology-jeffrey-epstein-cbs-news-1236650350/",
    "image": "https://variety.com/wp-content/uploads/2026/02/GettyImages-2213961401.jpg?crop=0px%2C104px%2C5071px%2C2852px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-02-03T00:46:41.000Z",
    "description": "\n\tDr. Peter Attia, who was recently named as a contributor to CBS News, put out a lengthy statement on X Monday morning saying he is “ashamed” of his ",
    "body": "\n\tDr. Peter Attia, who was recently named as a contributor to CBS News, put out a lengthy statement on X Monday morning saying he is “ashamed” of his relationship with convicted sex offender Jeffrey Epstein. Attia and Epstein’s apparent friendship was revealed through emails included in the Department of Justice’s latest Epstein files release.\n\n\t“The purpose of the DOJ releasing these documents is clear: to identify individuals who participated in criminal activity, enabled it, or witnessed it. I am not in any of those categories, and there is no evidence to the contrary,” he wrote. “1. I was not involved in any criminal activity. 2. My interactions with Epstein had nothing to do with his sexual abuse or exploitation of anyone. 3. I was never on his plane, never on his island, and never present at any sex parties.”\n\t\n\n\tAttia went on to apologize for his correspondence with Epstein. He called the emails “embarrassing, tasteless and indefensible.”\n\n\n\tAttia, a high-profile author, health influencer and celebrity doctor, was mentioned more than 1,700 times in the latest batch of files, which revealed a back-and-forth with Epstein that lasted long after the disgraced New York financier was hit with sex trafficking and prostitution charges. In a 2016 email to Lesley Groff, a former assistant to Epstein, Attia wrote, “I go into JE withdrawal when I don’t see him.”\n\n\tCBS News named Attia as one of 19 new contributors on Jan. 27. The move is part of editor-in-chief Bari Weiss’ mission to reshape the program for the modern era of media and newsmaking. Attia’s relationship with Epstein has ignited significant online blowback for CBS News. CBS has not yet confirmed whether Attia will remain a contributor.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "CBS News Contributor Peter Attia Apologizes for Correspondence with Jeffrey Epstein: ‘I Was Not Involved in Any Criminal Activity’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/GettyImages-2213961401.jpg?crop=0px%2C104px%2C5071px%2C2852px&resize=1000%2C563"
      ],
      "datePublished": "2026-02-03T00:46:41.000Z",
      "dateModified": "2026-02-03T00:46:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Stephen Fry to Star in Fox Drama Series ‘Interrogator’",
    "url": "https://variety.com/2026/tv/news/stephen-fry-fox-series-interrogator-1236650333/",
    "image": "https://variety.com/wp-content/uploads/2026/02/GettyImages-2246419089.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-03T00:15:16.000Z",
    "description": "\n\tFox has given a straight to series order to the drama “The Interrogator” with Stephen Fry attached in a lead role. \n\n\tThe logline for the show state",
    "body": "\n\tFox has given a straight to series order to the drama “The Interrogator” with Stephen Fry attached in a lead role. \n\n\tThe logline for the show states it is “centered on Conrad Henry (Fry), former MI6 agent, and his elite team. When conventional methods have failed, Henry’s quirky charm, superior intellect, and mind-bending behavioral maneuvers make him the only man able to lockpick the minds of the world’s most dangerous criminals.”\n\t\n\n\tFox has ordered 12 episodes of the show. Fry wrote the pilot, with revisions by Bill Harper and Matt Pyken. All three are executive producers along with Anonymous Content, Neil Burger and Paul McGuigan. McGuigan will also direct. Likely Story’s Anthony Bregman and Miriam Mintz also serve as executive producers. Lionsgate Television and Fox Entertainment Studios produce. \n\n\n\tFry previously appeared on the hit Fox procedural “Bones” in the role of Dr. Gordon Wyatt. A highly-acclaimed actor and comedian, Fry is known for his work in shows like “Blackadder” and “A Bit of Fry & Laurie,” as well as films like “Wilde,” “Gosford Park,” “V for Vendetta,” and “Love & Friendship.” \n\n\tHe is repped by CAA and Hamilton Hodell.  \n\n\tThis is the latest series pickup for Fox looking toward the 2026-2027 broadcast season. The network has also greenlit a reboot of “Baywatch,” which has had a long road to the screen but was formally ordered back in September. \n\n\tFox has few scripted dramas on its slate at present. The network’s current drama lineup consists only of medical drama “Doc,” the well-received “Doc Martin” adaptation “Best Medicine” starring Josh Charles, and the recently-launched “Memory of a Killer” starring Patrick Dempsey. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Stephen Fry to Star in Fox Drama Series ‘Interrogator’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/GettyImages-2246419089.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-03T00:15:16.000Z",
      "dateModified": "2026-02-03T00:15:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Happy’s Place,’ ‘St. Denis Medical’ Renewed at NBC",
    "url": "https://variety.com/2026/tv/news/happys-place-st-denis-medical-renewed-nbc-1236650138/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Happys-Place-St-Denis-Medical.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-02T21:15:00.000Z",
    "description": "\n\tBoth “Happy’s Place” and “St. Denis Medical” have been renewed for third seasons at NBC, Variety has learned. \n\n\t“Both ‘St. Denis Medical’ and ‘Happ",
    "body": "\n\tBoth “Happy’s Place” and “St. Denis Medical” have been renewed for third seasons at NBC, Variety has learned. \n\n\t“Both ‘St. Denis Medical’ and ‘Happy’s Place’ have delivered comedic brilliance over their first two seasons, truly connecting with our audience with hilarious characters, and remain hugely important and successful programs to our primetime and Peacock lineup,” said Lisa Katz, president of scripted content for NBC & Peacock. “A huge thank you to the producers, casts and crews of both shows who have brought these wonderful stories to life and will now continue to tell their laugh-out-loud stories.”\n\t\n\n\tNBC currently has just four comedies in its primetime lineup. In addition to “Happy’s Place” and “St. Denis Medical,” the broadcaster also airs the single-cam sitcom “The Fall and Rise of Reggie Dinkins” and the sports mockumentary “Stumble,” both of which are currently airing their first seasons. All four shows are produced by Universal Television. \n\n\n\tMulti-cam “Happy’s Place” stars Reba McEntire, Belissa Escobedo, Melissa Peterman, Pablo Castelblanco, Tokala Black Elk and Rex Linn. McEntire plays Bobbie, who inherits her father’s bar only to discover that she has a half-sister, played by Escobedo. \n\n\tKevin Abbott and Julie Abbott created “Happy’s Place.” Kevin executive produces along with McEntire, Michael Hanel, Mindy Schultheis, Matt Berry and Pamela Fryman.\n\n\t“St. Denis Medical” follows the staff and patients of a fictional Oregon hospital as they do their best to navigate the medical system as well as their own lives. The ensemble cast includes Wendi McLendon-Covey, David Alan Grier, Allison Tolman, Josh Lawson, Kahyun Kim, Mekki Leeper and Kaliko Kauahi. \n\t\n\n\tEric Ledgin serves as showrunner and executive producer. Justin Spitzer, Simon Heuer, Ruben Fleischer, Bridget Kyle and Vicky Luu also executive produce.\n\n\tAt the time of this publishing, NBC has three comedy pilots on deck this year. Those are: an LA private eye show from Dan Goor and Luke Del Tredici; a comedy about two therapists led by Jane Lynch and Katey Sagal; and the rom-com “Newlyweds” that boats Jamie Lee Curtis among its executive producers. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Happy’s Place,’ ‘St. Denis Medical’ Renewed at NBC",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Happys-Place-St-Denis-Medical.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-02T21:15:00.000Z",
      "dateModified": "2026-02-02T21:15:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘The Kelly Clarkson Show’ to End After Seven Seasons: This ‘Will Allow Me to Prioritize My Kids’",
    "url": "https://variety.com/2026/tv/news/kelly-clarkson-show-ending-seven-seasons-1236650297/",
    "image": "https://variety.com/wp-content/uploads/2026/02/image-1.png?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-02T23:30:00.000Z",
    "description": "\n\t“The Kelly Clarkson Show” is coming to an end after its currently airing seventh season.\n\n\tThe show’s conclusion was Clarkson’s decision. In a state",
    "body": "\n\t“The Kelly Clarkson Show” is coming to an end after its currently airing seventh season.\n\n\tThe show’s conclusion was Clarkson’s decision. In a statement thanking her crew and fans, she said, “Stepping away from the daily schedule will allow me to prioritize my kids, which feels necessary and right for this next chapter of our lives.”\n\n\tThe news comes after the 2025 death of Brandon Blackstock, who was her ex-husband and former manager as well as the father of her two children. Blackstock, who battled cancer for three years, was 48.\n\t\n\n\tProduction on Season 7 of “The Kelly Clarkson Show” will continue as previously planned, with the series airing its final episodes this fall. The season will also feature special guest hosts to be announced at a later date.\n\n\n\tClarkson’s full statement reads, “I have been extremely fortunate to work with such an outstanding group of people at ‘The Kelly Clarkson Show,’ both in Los Angeles and New York. There have been so many amazing moments and shows over these seven seasons. I am forever grateful and honored to have worked alongside the greatest band and crew you could hope for, all the talent and inspiring people who have shared their time and lives with us, all the fans who have supported our show and to NBC for always being such a supportive and incredible partner. Because of all of that, this was not an easy decision, but this season will be my last hosting ‘The Kelly Clarkson Show.’ Stepping away from the daily schedule will allow me to prioritize my kids, which feels necessary and right for this next chapter of our lives. This isn’t goodbye. I’ll still be making music, playing shows here and there and you may catch me on ‘The Voice’ from time to time … you never know where I might show up next. But for now, I want to thank y’all so much for allowing our show to be a part of your lives, and for believing in us and hanging with us for seven incredible years.”\n\t\n\n\t“The Kelly Clarkson Show” premiered in 2019. The series features Clarkson as she interviews celebrities as well as non-celebrities with inspiring stories. Each episode opens with a “Kellyoke” segment, in which Clarkson and her band perform covers of other artists’ songs. The show’s occasional “Songs & Stories” episodes see Clarkson do deep dives on the work of artists such as Alanis Morissette, Babyface, Miranda Lambert and Pink, with NBC later airing a primetime spinoff in which she interviewed the Jonas Brothers, Gloria Estefan, Teddy Swims and Lizzo.\n\n\tThroughout its run, “The Kelly Clarkson Show” has won 24 Daytime Emmys, including four consecutive wins for both outstanding daytime talk series and talk show host. \n\n\t“The Kelly Clarkson Show” is produced by Universal Television and distributed by NBCUniversal Syndication Studios, airing in over 200 markets nationwide. Alex Duda serves as showrunner and executive producer.\n\n\t“‘The Kelly Clarkson Show’ has been an extraordinary collaboration,” said Tracie Wilson, executive vice president of NBCUniversal Syndication Studios. “I’m grateful to Kelly for bringing her talent and energy to this. Her warmth, quick sense of humor and connection with people created a show that made fans feel seen, heard and a little bit better about their day. We couldn’t have achieved the show’s success without our exceptional showrunner/EP Alex Duda, whose vision, leadership and unwavering commitment across all seven seasons have guided us through unprecedented times and a cross-country move. Together with producers, staff and crew, they created a legacy to be proud of.”\n\n\t“‘The Kelly Clarkson Show’ has been a valued part of our NBC-owned stations’ lineup for seven seasons, always delivering an entertaining and engaging show for our daytime audiences,” said Valari Staab, chairman of NBCUniversal Local. “We thank Kelly and the production team for the wonderful, high-quality show they’ve produced consistently since 2019, and look forward to the remainder of this season as they complete their successful run.” \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘The Kelly Clarkson Show’ to End After Seven Seasons: This ‘Will Allow Me to Prioritize My Kids’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/image-1.png?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-02T23:30:00.000Z",
      "dateModified": "2026-02-02T23:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "E! Glambot Producer Axed From Grammys Carpet After Controversies With Jennifer Lopez, Private Wedding Booking",
    "url": "https://variety.com/2026/film/news/e-glambot-grammys-red-carpet-cole-walliser-controversy-1236649898/",
    "image": "https://variety.com/wp-content/uploads/2026/02/GettyImages-1199754143.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-02T21:24:16.000Z",
    "description": "\n\tA ubiquitous red carpet producer was benched from Sunday’s Grammy awards following a string of online controversies, Variety has learned.\n\n\tDuring a",
    "body": "\n\tA ubiquitous red carpet producer was benched from Sunday’s Grammy awards following a string of online controversies, Variety has learned.\n\n\tDuring arrivals for music’s biggest night, social media users and style watchers noticed the absence of Cole Walliser – the field operator that manages the Glambot, a high-speed mechanical camera that captures glamourous looks for the E! network.\n\n\n\tWalliser and his recognizable mane of curls were nowhere to be found as the Glambot went up – coinciding with weeks of bad headlines dating back to this year’s Golden Globe awards. Network insiders told Variety that Walliser was indeed not hired for Sunday’s show, and that the company is rethinking its strategy around future telecasts.\n\t\n\n\tAt the Jan. 11 Golden Globes ceremony, Jennifer Lopez popped by the Glambot to show off an archival Jean-Louis Scherrer gown. A carpet livestream showed a stoic Lopez barely acknowledge Walliser as he tried to help her through the motions of the camera, leading many to accuse her of being rude. Walliser quickly came to Lopez’s defense, calling her a pro at working the press line.\n\n\n\tThe tides turned, however, when the Lopez headlines led to the leak of an old email exchange between Walliser and a private citizen hoping to book the Glambot for her wedding. After numerous blunt exchanges questioning the bride’s ability to afford the experience, she informed Walliser she could cover the cost.\n\n\t“I don’t see how you could be since I didn’t say how much it was and could be between $10,000 and $1,000,000,” he wrote, according to widely disseminated screengrabs. “If you wanted to know how much it costs you just needed to ask, you don’t need to pretend you are going to book it,” he concluded.The subsequent backlash led to an apology from Walliser last week.\n\t\n\n\t“The tone in these emails was dismissive and curt and that is not OK. In 2019, I didn’t have a team around me. It was just myself. I edited every single video. I answered every single email and I was overwhelmed,” he said in an Instagram post. “But that is not an excuse. Everything lands on me.”\n\n\tIt didn’t land great with E! A production source said the channel, now under the control of Versant following a split from NBCUniversal, is committed to maintaining a respectful and professional environment and does not condone behavior that is inconsistent with its standards. \n\n\tA representative for E! declined to comment on the matter. A representative for Walliser did not respond to a request for comment. The Glambot was invented in 2016 by prolific music video and film director Joseph Kahn.\n\n\tAnd the tech overlords tell us robots will make life easier for humans.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "E! Glambot Producer Axed From Grammys Carpet After Controversies With Jennifer Lopez, Private Wedding Booking",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/GettyImages-1199754143.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-02T21:24:16.000Z",
      "dateModified": "2026-02-02T21:24:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Love & Basketball’ 25th Anniversary Reunites Sanaa Lathan and Gina Prince-Bythewood for NBA All-Star Week Panel – Film News in Brief",
    "url": "https://variety.com/2026/film/news/film-news-in-brief-feb-2-2026-1236649806/",
    "image": "https://variety.com/wp-content/uploads/2022/08/love-basketball.png?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-02T22:45:00.000Z",
    "description": "\n\tIn celebration of its 25th anniversay, Gina Prince-Bythewood’s “Love & Basketball” is set to launch the HBCU First LOOK Film Festival.\n\n\tThe event t",
    "body": "\n\tIn celebration of its 25th anniversay, Gina Prince-Bythewood’s “Love & Basketball” is set to launch the HBCU First LOOK Film Festival.\n\n\tThe event takes place Feb. 12, from 1 p.m. to 4 p.m. PT at the Maybourne Beverly Hills, featuring a reception and panel discussion exploring the film’s cultural impact on women’s sports.\n\n\tCNN anchor Laura Coates will moderate the conversation titled “25 Years of Love & Basketball: A Celebration of Women in Sports,” joined by director Prince-Bythewood, star Sanaa Lathan, sports journalist Cari Champion and broadcasting pioneer Jayne Kennedy, the first Black woman sportscaster on national network television.\n\t\n\n\tThe film will kick off NBA week.\n\n\n\tThe panel will examine how the 2000 film’s legacy connects to today’s rising visibility of women’s athletics across the WNBA, college sports and media coverage. Prince-Bythewood’s film was added to the National Film Registry in 2023. Lathan’s portrayal of Monica Wright remains one of cinema’s most influential depictions of Black female athletes.\n\n\tOWN will extend the celebration with a Valentine’s Day airing of “Love & Basketball” on Feb. 14 as part of its weekend programming.\n\n\tPresenting sponsors include CNN, TNT Sports, Black Girl Vitamins, OWN and Visit East Point. The HBCU First LOOK Film Festival returns to Howard University Nov. 5-7.\n\t\n\t\tMonday, February 2\t\n\n\tSony Pictures Shifts Release Date for ‘The Breadwinner’ to May 29\n\n\tSony Pictures has announced a release date change for the family comedy “The Breadwinner,” moving the TriStar Pictures release from March 13 to May 29.\n\t\n\n\tThe film marks the feature debut of comedian Nate Bargatze, who stars as Nate Wilcox, a lifelong breadwinner thrust into stay-at-home dad duty when his wife Katie (Mandy Moore) lands a major business deal on Shark Tank. Left to manage three young daughters with little childcare experience, Nate discovers that running a household may be his toughest challenge yet.\n\n\tThe ensemble cast includes Colin Jost, Zach Cherry, Martin Herlihy, Kate Berlant, Kumail Nanjiani and Will Forte.\n\n\tEric Appel directs from a screenplay by Bargatze and Dan Lagana. Jeremy Latcham, Nate Bargatze and Dan Lagana produce, with JoAnn Perritano, Michael Musgrave and Tyler Zacharia serving as executive producers.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Love & Basketball’ 25th Anniversary Reunites Sanaa Lathan and Gina Prince-Bythewood for NBA All-Star Week Panel – Film News in Brief",
      "image": [
        "https://variety.com/wp-content/uploads/2022/08/love-basketball.png?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-02T22:45:00.000Z",
      "dateModified": "2026-02-02T22:45:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jacob Elordi Joked About Going Method to Get ‘Wuthering Heights’ Scars, Then Had a Freak Accident and Was Hospitalized With Second-Degree Burns",
    "url": "https://variety.com/2026/film/news/jacob-elord-wuthering-heights-accident-skin-burns-1236650010/",
    "image": "https://variety.com/wp-content/uploads/2026/02/jaocb.png?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-02T21:38:17.000Z",
    "description": "\n\tJacob Elordi joked about partly going Method to play Heathcliff in “Wuthering Heights,” only to fall victim to a freak accident that forced him phys",
    "body": "\n\tJacob Elordi joked about partly going Method to play Heathcliff in “Wuthering Heights,” only to fall victim to a freak accident that forced him physically to get into character. As he recounted to Esquire magazine, the film’s makeup artist Siân Miller “was designing the scars from the whips for Heathcliff’s back” and sarcastically challenged Elordi to go Method by saying: “If Daniel Day-Lewis was playing Heathcliff, he would have come in with scars.”\n\t\n\n\t“I said, ‘Well I’m going to go away and maim myself on the weekend to prove to you that I’m Heathcliff!'” Elordi quipped back. “That night I went home, and the house I was staying in had a steam shower: a brass knob that steam came from out of the wall.”Elordi explained, “The full story is that, when I was doing ‘Frankenstein,’ I had so much make-up in my fingers and in my feet all the time, and I left it on for the whole shoot because I couldn’t be bothered washing it all off. As Heathcliff, I was covered in mange and dirt, and I thought, ‘I’m not going to do that again, I’m going to clean my feet properly every night and come in to work fresh the next day.’ So I went to clean my feet, and I leant back and my back seared into the steam knob and I stood up screaming; it tore up my back. When I went to work on Monday I had a second-degree burn.”\n\n\n\t“Wuthering Heights” director Emerald Fennell remembered receiving a text message “in the first week of shooting” that “Jacob’s in the hospital.”\n\n\t“Obviously I thought, ‘Oh my god, he’s had a car accident,’ and then he was like, ‘He’s burnt his back in the shower,’” the filmmaker said, noting that she eventually asked Elordi if the injury was in “the spirit of Daniel Day-Lewis.”\n\n\t“It was actual Daniel Day-Lewis. In the shower,” Elordi joked.\n\t\n\n\tDay-Lewis has become infamously synonymous with Method acting over the course of his career, much to his recent annoyance. While promoting “Anemone” last year, the three-time Oscar winner said that criticism surrounding Method acting often comes from those who simply don’t understand it.\n\n\t“All the recent commentary in the last few years about Method acting is invariably from people who have little or no understanding of what it actually involves. It’s almost as if it’s some specious science that we’re involved in, or a cult,” Day-Lewis said. “But it’s just a way of freeing yourself so that the spontaneity, when you are working with your colleagues in front of the camera, that you are free to respond in any way that you’ll move to in that moment.”\n\n\tDay-Lewis went on to explain that going Method doesn’t mean “you’re sealed off from experiencing” your own real life, but rather that “you’re in a self-contained experience of your own.” He continued: “But really, if you’ve done your work, you should be free to accept whatever passes through you.”\n\n\t“Wuthering Heights” opens in theaters Feb. 13 from Warner Bros. Head over to Esquire’s website to read Elordi’s interview in its entirety.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jacob Elordi Joked About Going Method to Get ‘Wuthering Heights’ Scars, Then Had a Freak Accident and Was Hospitalized With Second-Degree Burns",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/jaocb.png?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-02T21:38:17.000Z",
      "dateModified": "2026-02-02T21:38:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Halle Berry Won an Oscar and Says ‘I Was Still Black the Next Morning’ With Directors Refusing to Cast Her; She Later Advised Cynthia Erivo That Oscar Wins ‘Cannot Be Validation’",
    "url": "https://variety.com/2026/film/news/halle-berry-cynthia-erivo-oscars-dont-change-careers-1236649945/",
    "image": "https://variety.com/wp-content/uploads/2026/02/P1015CMH.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-02T22:19:05.000Z",
    "description": "\n\tHalle Berry recently sat down with The Cut for a profile ahead of the release of her new thriller “Crime 101” and revealed that she once advised Cyn",
    "body": "\n\tHalle Berry recently sat down with The Cut for a profile ahead of the release of her new thriller “Crime 101” and revealed that she once advised Cynthia Erivo not to place any real weight on winning an Oscar. Erivo has been nominated twice for best actress (“Harriet” and “Wicked”), while Berry made history as the first Black woman to win the Oscar for best actress with her performance in “Monster’s Ball.” She remains the only Black winner in the category to this day.\n\t\n\n\t“That Oscar didn’t necessarily change the course of my career,” Berry told the publication. “After I won it, I thought there was going to be, like, a script truck showing up outside my front door. While I was wildly proud of it, I was still Black that next morning. Directors were still saying, ‘If we put a Black woman in this role, what does this mean for the whole story? Do I have to cast a Black man? Then it’s a Black movie. Black movies don’t sell overseas.’” \n\n\n\tAs Erivo’s acting career took off years later with its own Oscar nominations, Berry told her fellow performer: “You goddamn deserve it, but I don’t know that it’s going to change your life. It cannot be the validation for what you do, right?”\n\n\tBerry has often spoken out in disappointment over how her historic Oscar win lacked impact for both her own career and the industry at large. She told Marie Claire in 2024 that she’s “eternally miffed that no Black woman has come behind me for that best actress Oscar. I’m continually saddened by that year after year. And it’s certainly not because there has been nobody deserving.” In fact, Michelle Yeoh for “Everything Everywhere All at Once” is the only other woman of color to win the best actress Oscar.\n\t\n\n\tSpeaking to Variety in 2020, Berry cited Erivo in “Harriet” and Ruth Negga in “Loving” as Oscar-worthy performances by Black women. She later added Andra Day in “The United States vs. Billie Holiday” and Viola Davis in “Ma Rainey’s Black Bottom” to the list. \n\n\t“I thought there were women that rightfully, arguably, could have, should have. I hoped they would have, but why it hasn’t gone that way, I don’t have the answer,” Berry told Variety at the time, noting her win remained “one of my biggest heartbreaks” as it never opened up a door for more Black women at the Oscars.\n\n\t“The morning after, I thought, ‘Wow, I was chosen to open a door.’ And then, to have no one … I question, ‘Was that an important moment, or was it just an important moment for me?’” Berry said. “I wanted to believe it was so much bigger than me. It felt so much bigger than me, mainly because I knew others should have been there before me and they weren’t…just because I won an award doesn’t mean that, magically, the next day, there was a place for me. I was just continuing to forge a way out of no way.”\n\n\tHead over to The Cut’s website to read Berry’s latest profile in its entirety. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Halle Berry Won an Oscar and Says ‘I Was Still Black the Next Morning’ With Directors Refusing to Cast Her; She Later Advised Cynthia Erivo That Oscar Wins ‘Cannot Be Validation’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/P1015CMH.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-02T22:19:05.000Z",
      "dateModified": "2026-02-02T22:19:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bad Bunny Not Engaged, Despite Ring Buzz at Grammys",
    "url": "https://www.tmz.com/2026/02/02/bad-bunny-not-engaged-rumors-grammys-ring/",
    "image": "https://imagez.tmz.com/image/da/16by9/2026/02/02/da7f45f45f764023bd7da99ee3b41bcd_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-02T22:33:18.000Z",
    "description": "\n    \n                    \n                          Bad Bunny\n                          Single As a Pringle ... Despite Sus Ring at Grammys\n         ",
    "body": "\n    \n                    \n                          Bad Bunny\n                          Single As a Pringle ... Despite Sus Ring at Grammys\n                      \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Bad Bunny sent fans into a frenzy with one flashy \"engagement\" ring at the Grammys this weekend ... but the only lucky thing he took home last night was his album trophy ... TMZ has learned.\n      \n    \n          A source familiar with the situation tells TMZ the global superstar is not engaged ... despite fans going into full detective mode after spotting a ring on that finger during the awards show.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          The ring sparked speculation almost immediately online, with fans questioning whether BB had quietly proposed to a mystery lover after flashing the jewelry throughout the night. But according to our source, there’s no romantic milestone behind it.\n      \n\n          We’re told the ring was actually a gift from Cartier -- not an engagement ring, not a family heirloom, and not tied to any secret relationship. Bad Bunny simply chose to wear it to the Grammys -- where he won Album of the Year -- because ... well, it’s Bad Bunny, and statement jewelry is kind of his thing.\n      \n    \n      \n        \n                    \n                  \n      \n                    CBS\n          \n    \n          And as for who he would be engaged to if it were true ... there isn’t anyone currently on the singer's roster. Our source says Bad Bunny isn’t dating anyone at the moment, making the engagement speculation completely out of nowhere.\n      \n    \n          Bottom line ... no wedding bells are currently ringing for BB as he heads to the headlines for the Super Bowl LX Halftime Show this weekend.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Bad Bunny\n              \n                          \n                Celebrity News\n              \n                          \n                Relationships\n              \n                          \n                Exclusive\n              \n                          \n                Grammy Awards\n              \n                          \n                Music\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bad Bunny Not Engaged, Despite Ring Buzz at Grammys",
      "image": [
        "https://imagez.tmz.com/image/da/16by9/2026/02/02/da7f45f45f764023bd7da99ee3b41bcd_xl.jpg"
      ],
      "datePublished": "2026-02-02T22:33:18.000Z",
      "dateModified": "2026-02-02T22:33:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jarrell Miller Says His DMs Are Flooded W/ Companies Offering Hair Help",
    "url": "https://www.tmz.com/2026/02/02/jarrell-miller-reacts-losing-toupee-during-fight-hair-wig/",
    "image": "https://imagez.tmz.com/image/1f/16by9/2026/02/02/1f595658b0704da482c5b8c2312458e0_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-02T23:49:44.000Z",
    "description": "\n                    \n                          Jarrell Miller\n                          Businesses Are Blowing Up My DM's\n                          .",
    "body": "\n                    \n                          Jarrell Miller\n                          Businesses Are Blowing Up My DM's\n                          ... After The Toupee Incident\n                      \n              \n    \n      \n        \n                    \n                  \n      \n                    TMZSports.com\n          \n    \n          Jarrell Miller went viral after an uppercut knocked the toupee off his head in the middle of his boxing match at Madison Square Garden, but the incident might not be the worst thing ... 'cause he tells TMZ Sports his DMs have been flooded with companies hoping to work with him!\n      \n    \n          Babcock chopped it up with Miller after his win over Kingsley Ibeh Saturday night at the World's Most Famous Arena and -- of course -- asked about what happened with his hair.\n      \n    \n      \n      — Ring Magazine (@ringmagazine) February 1, 2026\n              @ringmagazine\n          \n  \n    \n          \"I felt a cold breeze in my scalp, and I said I know I ain't got no AC up there,\" Miller said.\n      \n\n          When the bell rang and the ring ended, he said his normally confident coach started stuttering in the corner, and it started to click -- his toupee might have fallen off. One glance at the jumbotron, and Jarrell realized ... \"I'm fried, I'm cooked.\"\n      \n    \n          The 37-year-old believes ripping it off \"put an extra battery in my back\" -- crediting it as a turning point in the bout.\n      \n    \n          So, what's next for Big Baby? Miller says he's going to attempt to grow his hair back, saying a product dried it out and brought it to its current state.\n      \n    \n          But that doesn't mean he hasn't had a gang of businesses reaching out.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          \"There's a lot of hair companies from Turkey reached out,\" Miller said. \"A couple of man-weaving companies reached out. So like my DMs are crazy, man. I haven't even gone through even a quarter of them yet.\"\n      \n    \n          He's taking it all in stride, though, saying trials and tribulations are \"part of being a man.\"\n      \n    \n          \"Sometimes some of us men give up in life and cut our lives short,\" Miller said. \"But I pray to God and ask God to give me confidence, strength and courage to keep pushing forward. I got two young boys -- a 15-year-old, a four-year-old and I got a one-year-old daughter -- so I gotta be here for them and show them listen, Daddy made some mistakes, but I ain't no quitter.\"\n      \n      ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jarrell Miller Says His DMs Are Flooded W/ Companies Offering Hair Help",
      "image": [
        "https://imagez.tmz.com/image/1f/16by9/2026/02/02/1f595658b0704da482c5b8c2312458e0_xl.jpg"
      ],
      "datePublished": "2026-02-02T23:49:44.000Z",
      "dateModified": "2026-02-02T23:49:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "David Del Rio Wants Results of New 'Matlock' Investigation",
    "url": "https://www.tmz.com/2026/02/02/david-del-rio-matlock-cbs-investigation-results/",
    "image": "https://imagez.tmz.com/image/8d/16by9/2025/10/15/8d58114f90474eb09b1c2e26c50c2354_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-02T20:50:02.000Z",
    "description": "\n    \n                    \n                          'Matlock's David Del Rio\n                          CBS Needs to Share New Investigation Findings!",
    "body": "\n    \n                    \n                          'Matlock's David Del Rio\n                          CBS Needs to Share New Investigation Findings!!!\n                      \n                  \n                                                                        Published \n                              \n                February 2, 2026\n                \n                            12:50 PM PST\n                                                                      |\n                                                                Updated \n                                  February 2, 2026\n                                2:29 PM PST\n                                    \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          CBS has concluded its reopened \"Matlock\" investigation into the sexual assault report that got David Del Rio canned from the series ... and the actor is eager to know the outcome.\n      \n    \n          TMZ broke the news ... Del Rio was booted from the hit show last October, after the star had been accused of sexually assaulting actress Leah Lewis on Paramount property days earlier. Del Rio vehemently denied the allegations, hiring high-powered attorney Shawn Holley ... and CBS reopened its investigation in November and more parties were interviewed -- including David himself alongside Holley.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Sources with direct knowledge tell TMZ ... the investigation has concluded -- again -- but Del Rio feels the powers that be are dragging their feet after he claims to have submitted evidence that would clear his name. We hear he's instructed his team to request that CBS give them their findings, which we're told are expected by the end of this week.\n      \n\n          Our sources say that Del Rio's frustration stems from the fact his termination was basically instant ... and the reopened investigation has taken 72 days. It's worth noting, our Del Rio sources tell us both investigations were handled in-house by CBS Studios, not an independent third party.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          In the fall, Del Rio was escorted off the Paramount lot and canned the same day the complaint was lodged ... CBS Studios confirmed at the time his character -- a lead in the series -- would be written off. \"Matlock\" was recently renewed for a third season.\n      \n    \n          CBS Studios declined to comment. We reached out to Del Rio ... so far no word back.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Leah Lewis\n              \n                          \n                David Del Rio\n              \n                          \n                Shawn Holley\n              \n                          \n                TV\n              \n                          \n                Rape and Sexual Assault\n              \n                          \n                TV Stars\n              \n                          \n                Exclusive\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "David Del Rio Wants Results of New 'Matlock' Investigation",
      "image": [
        "https://imagez.tmz.com/image/8d/16by9/2025/10/15/8d58114f90474eb09b1c2e26c50c2354_xl.jpg"
      ],
      "datePublished": "2026-02-02T20:50:02.000Z",
      "dateModified": "2026-02-02T20:50:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'TODAY' Anchor Savannah Guthrie's Mom Abducted, Cops Looking At Sex Offenders",
    "url": "https://www.tmz.com/2026/02/02/savannah-guthrie-mom-investigation-possible-abduction/",
    "image": "https://imagez.tmz.com/image/e6/16by9/2026/02/02/e6bddfe92a4b4acc891f989abc4101ad_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-02T22:58:49.000Z",
    "description": "\n    \n                    \n                          Savannah Guthrie's Missing Mom\n                          Cops Say She Was Abducted Overnight\n    ",
    "body": "\n    \n                    \n                          Savannah Guthrie's Missing Mom\n                          Cops Say She Was Abducted Overnight\n                      \n                  \n                                                                        Published \n                              \n                February 2, 2026\n                \n                            2:58 PM PST\n                                                                      |\n                                                                Updated \n                                  February 2, 2026\n                                4:55 PM PST\n                                    \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Another bombshell in the case of Savannah Guthrie's missing mother ... police tell TMZ Nancy Guthrie was taken by force from her Arizona home in the middle of the night.\n      \n    \n          A rep for the Pima County Sheriff's Office says Guthrie is believed to have been abducted from her home in the ritzy neighborhood of Catalina Foothills. The rep said investigators are looking at registered sex offenders in the area while combing through videos from cameras at Guthrie's home, neighbors' residences, local businesses and traffic lights.\n      \n    \n          Police declined to say whether blood was found inside the home, if the home was in disarray from a struggle or if there was forced entry.  But, the sheriff's department said they're talking with the Federal Bureau of Investigation, which has a long history working kidnapping and missing persons cases.\n      \n\n                  \n          \n                          \n                \n                                  \n      \n    \n          The sheriff's spokesperson tells us ... Customs and Border Protection are also involved in the case because the agency's specially trained K-9 dogs were used to help search for Guthrie. Police have not identified a suspect.\n      \n    \n          As we reported ... 84-year-old Nancy was reported missing Sunday afternoon, and was last seen Saturday night at her Tucson house. Authorities previously announced homicide detectives were investigating the case.\n      \n    \n          In a statement Sunday, Savannah said ... \"On behalf of our family, I want to thank everyone for the thoughts, prayers and messages of support. Right now, our focus remains on the safe return of our dear mom.\"\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Savannah Guthrie\n              \n                          \n                Nancy Guthrie\n              \n                          \n                Celebrity News\n              \n                          \n                Family\n              \n                          \n                Today Show\n              \n                          \n                Police\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'TODAY' Anchor Savannah Guthrie's Mom Abducted, Cops Looking At Sex Offenders",
      "image": [
        "https://imagez.tmz.com/image/e6/16by9/2026/02/02/e6bddfe92a4b4acc891f989abc4101ad_xl.jpg"
      ],
      "datePublished": "2026-02-02T22:58:49.000Z",
      "dateModified": "2026-02-02T22:58:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Francesca Farago vs. Meredith Duxbury Who'd You Rather?! (Hotties In Faux Fur)",
    "url": "https://www.tmz.com/2026/02/02/francesca-farago-meredith-duxbury-whod-you-rather/",
    "image": "https://imagez.tmz.com/image/7c/16by9/2026/02/02/7c8dfa2f68714ff8bfd51c20b715c0b4_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-02T22:11:34.000Z",
    "description": "\n    \n                    \n                          Francesca Farago vs. Meredith Duxbury\n                          Who'd You Rather?!\n              ",
    "body": "\n    \n                    \n                          Francesca Farago vs. Meredith Duxbury\n                          Who'd You Rather?!\n                          Hotties In Faux Fur Edition\n                      \n      \n    \n          It's a tad bit nippy outside, but no need to fret 'cuz Francesca Farago and Meredith Duxbury are showin' off their faux fur pride!\n      \n    \n          The key question is: Who'd You Rather?!\n      \n    \n          VOTE NOW!\n      \n    \n          While you're here, have some more fun with a game of matching furs!\n      \n      \n      \n          \n            \n              \n                \n                Share on Facebook\n              \n            \n            \n              \n                \n                Share on X\n              \n            \n                          \n                \n                  \n                \n              \n                      \n        \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Hotties & Bodies\n              \n                          \n                Hot Bodies\n              \n                          \n                Who'd You Rather?\n              \n                          \n                Photo Galleries\n              \n                      \n        \n          \n  ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Francesca Farago vs. Meredith Duxbury Who'd You Rather?! (Hotties In Faux Fur)",
      "image": [
        "https://imagez.tmz.com/image/7c/16by9/2026/02/02/7c8dfa2f68714ff8bfd51c20b715c0b4_xl.jpg"
      ],
      "datePublished": "2026-02-02T22:11:34.000Z",
      "dateModified": "2026-02-02T22:11:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]