[
  {
    "title": "Hillary Clinton and Kevin Spacey Attend Cinema for Peace Gala in Berlin as Kaouther Ben Hania Awarded Prize for ‘The Voice of Hind Rajab’: ‘I Feel Responsibility More Than Gratitude’",
    "url": "https://variety.com/2026/film/global/voice-of-hind-rajab-cinema-for-peace-gala-1236665261/",
    "image": "https://variety.com/wp-content/uploads/2025/08/The-Voice-of-Hind-Rajab-1.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-17T11:44:57.000Z",
    "description": "\n\tKaouther Ben Hania‘s Oscar and BAFTA nominated feature “The Voice of Hind Rajab” was awarded “most valuable film” at the Cinema for Peace Gala in Be",
    "body": "\n\tKaouther Ben Hania‘s Oscar and BAFTA nominated feature “The Voice of Hind Rajab” was awarded “most valuable film” at the Cinema for Peace Gala in Berlin on Monday night. \n\n\tThe annual event, attended by Hillary Clinton and Kevin Spacey and hosted by Bob Geldof, also honored Noam Tibon, a former Israeli general and subject of the Canadian documentary “The Road Between Us” about the rescue of his family from Hamas after the Oct. 7, 2023 attacks. \n\t\n\n\tIn her acceptance speech at the Adlon Hotel, Ben Hania — whose film chronicles the Red Crescent’s  efforts to save Hind Rajab, a 5-year-old Palestinian girl who was killed by IDF forces during the Israeli invasion of Gaza in 2024 — said “I feel responsibility more than gratitude” and took aim at those she said had helped create a “system” that made the killing of Rajab possible.\n\n\n\t“What happened to Hind is not an exception. It’s a part of a genocide. And tonight, in Berlin, there are people who gave political cover to that genocide by reframing the mass civilian killing as self-defense. As complex circumstances. By denigrating those who protest,” she said.\n\n\t“But as you may know, peace is not a perfume sprayed over violence so power can feel refined, and can feel comfortable. And cinema is not image-laundering.”\n\n\tThe director also spoke about the need to talk about justice as well as peace, and asserted that she wouldn’t be taking home the Cinema for Peace Award.  \n\n\t“Justice means accountability. Without accountability, there is no peace. The Israeli army killed Hind Rajab; killed her family; killed the two paramedics who came to save her, with the complicity of the world’s most powerful governments and institutions,” she said.\n\t\n\n\t“I refuse to let their deaths become a backdrop for a polite speech about peace. Not while the structures that enabled them remain untouched. So tonight, I will not take this award home. I leave it here as a reminder. And when peace is pursued as a legal and moral obligation, rooted in accountability for genocide, then I will come back and accept it with joy.”\n\n\tGeldof, meanwhile, attacked President Donald Trump over his dismissal of climate change.\n\n\t“He’s a fucking idiot and he should shut up,” he said.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Hillary Clinton and Kevin Spacey Attend Cinema for Peace Gala in Berlin as Kaouther Ben Hania Awarded Prize for ‘The Voice of Hind Rajab’: ‘I Feel Responsibility More Than Gratitude’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/08/The-Voice-of-Hind-Rajab-1.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-17T11:44:57.000Z",
      "dateModified": "2026-02-17T11:44:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Japan Night at Berlinale Spotlights Projects From Emerging Directors, Producers",
    "url": "https://variety.com/2026/film/markets-festivals/japan-night-berlin-new-projects-emerging-helmers-producers-1236665175/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Japan-Night-Berlin.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-17T11:21:24.000Z",
    "description": "\n\tJapan arrived at this year’s Berlinale with nine films in selection and the wind at its back — “Demon Slayer” and “Chainsaw Man” still fresh in the ",
    "body": "\n\tJapan arrived at this year’s Berlinale with nine films in selection and the wind at its back — “Demon Slayer” and “Chainsaw Man” still fresh in the box office record books, Cannes honors on the horizon. But at Monday’s Japan Night, the conversation wasn’t about past successes or established auteurs. It was about who and what comes next.\n\n\tHosted by the Embassy of Japan in Germany with the cooperation of the Agency for Cultural Affairs and operational cooperation from Unijapan and VIPO, Japan’s film industry gathered to celebrate the Japanese films in this year’s Berlinale selection and hear from four emerging directors and three emerging producers from Japan, who each announced their new and upcoming projects.\n\t\n\n\tEmma Kawawada joined Bunbuku in 2014, where she served as assistant director on films by Kore-eda Hirokazu. Her commercial feature film debut, “My Small Land,” was invited to the Berlinale in 2022. Kawawada’s new feature, “Life is Yours,” is selected for the Berlinale Co-Production Market. The film explores the interplay between people and nature. Toei and Loaded Films produce.\n\n\n\tHasei Kohki made his feature debut in 2015 with street kid story “Blanka,” which won the Magic Lantern award at Venice. His upcoming feature “Kutheran” explores the lives of children with mixed heritage in Okinawa. Described as a film with a magical realist streak, it features non-professional and professional actors. A Japan-U.K. co-production between IN.2 and Bunbuku, the film will shoot this fall.\n\n\tNakanishi Mai has built a portfolio of female-driven, genre-defying short films shot across Taiwan, Korea, and Japan. Her debut feature “Child, Uninvited” is in early development and charts the abrasive relationship between a soon-to-be mother and an abandoned child that she befriends.\n\t\n\n\tDocumentarian Ota Shingo’s most recent feature, the queer-focused “Numakage Public Pool,” won the First Cut+ Works in Progress Award at Karlovy Vary in 2024. Following its world premiere at Doc Edge and its Asian premiere at Busan, it is now scheduled for a theatrical release in Japan this year. Ota’s next film is “The Chimney Sweeper.” Dubbed “a creative documentary,” it follows an 85-year-old who sweeps chimneys and maintains five public bathhouses. The film is a Japan-France co-production between Hydroblast and SaNoSi Productions.\n\n\tThe featured producers are participants of this year’s Berlinale Co-Production Market and VIPO Visitors Program. Multihyphenate Iwase Akiko was first invited to the Berlinale in 2020 as an actor, starring alongside Johnny Depp, Bill Nighy, and Sanada Hiroyuki in “Minamata.” As a producer, she has two projects in development: “Rainbow on the Moon,” which explores the topic of assisted dying from the perspectives of two sisters with culturally opposing views on mortality; and historical biopic “Where Compassion Lives.”\n\n\tProducer Kamiura Yuna left behind her prolific career in late-night drama series at MBS to join K2 Pictures last year, where she promises to develop a diverse array of LGBTQ-focused stories and champion female directors. Kamiura has multiple projects in development, including “The Book of Human Insects,” an adaptation of Tezuka Osamu’s manga to celebrate the 100th anniversary of his birth — Ninomiya Ken (“Chiwawa”) directs, Takaishi Akari (“Baby Assassins”) stars; “Inside Her,” a lesbian body horror film; and “Moon Palace,” a coming-of-age ensemble drama directed by Okita Shuichi (“The Story of Yonosuke”).\n\n\tProducer Sato Keiichiro has brought his experience working in line production and international units to recent genre feature “Higuma!!: The Killer Bear,” and upcoming feature “June 2000,” a project concerned with the human impact of systemic collapse.\n\n\tOther figures in attendance are equally eager to nurture new talent. Veteran producer Moriya Takeshi (“Midnight Swan”) is at EFM to lay the groundwork for Atmovie Global Track, a new festival market-based development and pitching initiative designed to support emerging Japanese creators and producers who have their sights set on the global stage. Watanabe Kazutaka, producer of the 2025 Venice Horizons Jury Prize-winning “Lost Land,” is one of this year’s Berlinale Talents, and has utilized that platform to connect with further international artists who might benefit from fresh co-production possibilities and an outstretched palm.\n\t\n\n\tAn air of optimism and anticipation was widespread at the event. This year’s Cannes Film Market will host Japan as its Country of Honor, and there is good reason to expect a presence at the festival from Japan’s most high-profile auteurs — new films from Kore-eda (“Sheep in the Box,” “Look Back”), Hamaguchi Ryusuke (“All of a Sudden”) and Kurosawa Kiyoshi (“Kokurojo: The Samurai and the Prisoner”) are coming up. The Japan Night of the Berlinale is evidence that the future is equally bright for the country’s emerging creatives.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Japan Night at Berlinale Spotlights Projects From Emerging Directors, Producers",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Japan-Night-Berlin.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-17T11:21:24.000Z",
      "dateModified": "2026-02-17T11:21:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Suicide Squad’ Meets ‘E.R.’ in Globoplay’s ‘Emergency 53,’ a New Series by Famed ‘Under Pressure’ Creative Team",
    "url": "https://variety.com/2026/film/global/globoplay-emergency-53-under-pressure-berlinale-1236658341/",
    "image": "https://variety.com/wp-content/uploads/2026/02/VARIETY-SIZING-47.png?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-17T11:32:00.000Z",
    "description": "\n\tFour years after wrapping Globoplay’s immensely successful medical series “Under Pressure,” Andrucha Waddington and Cláudio Torres have reunited for",
    "body": "\n\tFour years after wrapping Globoplay’s immensely successful medical series “Under Pressure,” Andrucha Waddington and Cláudio Torres have reunited for another procedural commissioned by the major Brazilian streamer. “Emergency 53,” making its first bow at the prestigious Berlinale Series Market, follows a series of doctors, nurses and drivers of a special mobile service unit as they navigate personal and professional dramas while burdened by the responsibility to prevent others from dying. The series is produced by Torres and Waddington’s leading Conspiração banner. \n\t\n\n\tSpeaking with Variety ahead of the world premiere, Torres says “Emergency 53” was born from a desire from Conspiração CEO Renata Brandão. “Renata wanted another medical procedural series, but this time with multiple protagonists,” he adds.\n\n\n\t“Renata made a great observation: every single country has a medical procedural and yet, there wasn’t one made within the context of Rio de Janeiro. Rio is crazy because it mixes war and a very well-organized society. It’s a city in a state of war. Doctors come to do their internship in the public hospital, and they see war-like wounds.”\n\n\tWaddington adds that one of the most interesting things about the show is that it is not a spin-off of “Under Pressure,” nor does it try to mimic the formula that led to its success. “In ‘Under Pressure,’ we dealt with a couple who were doctors dealing with long arcs as well as episodic arcs dictated by the patients they were seeing. With ‘Emergency 53,’ we have a much more pop-leaning tone, with a mostly young cast that is not contained in a location.”\n\t\n\n\t“We actively subverted everything about ‘Under Pressure,’” he adds. “We have multiple protagonists, we are not inside a hospital, and we’re seeing professionals working in a sector of Brazilian public health that actually works.”\n\n\tAnother key proposition of “Under Pressure” is its pop language, with a fast-paced rhythm, big action numbers and a young ensemble who modernizes discussions around class inequality. \n\n\t“We kept thinking of this veteran who, after years of dealing with bureaucrats from behind a desk, wants to get back on the streets and enlists a group of renegades for her special unit,” says Torres. “It’s a little like ‘Seven Samurai’ or ‘Suicide Squad.’ Our first episode is very much like ‘Suicide Squad.’ Our visual language is also inspired by Marvel and DC Comics. We have a garage that looks straight out of ‘Batman.’”\n\n\tTorres emphasizes how the creative team “doubled down on the concept of the anti-hero” often seen in the comic book world. “You know a Marvel story is good when they have a good anti-hero. And we realized we could do that from the moment we saw our characters wearing uniforms. It felt like a comic book in a way, and then the ambulances became out batmobiles.” \n\n\n\n\t\n\n\t\t\t\t\t“Emergency 53,” courtesy of Laura Campanella\n\t\n\n\n\n\tBut a pop-leaning, comic book-inspired project does not work without a very strong visual language. Given that “Emergency 53” had multiple episode directors, including showrunners Waddington and Torres, finding consistency was key. \n\n\t“We had a large team between creators, directors, producers and cinematographers, so it was very tricky to find a visual standard,” says Waddington. “We decided that Claudio and me would co-direct the first episode, but truly co-direct it. We had the other directors and creatives on set, and we felt as if we were inventing a language. It helped that we had a very daring, dynamic script for the first episode, which allowed us to try many different things.”\n\n\tThe director highlights how the creative team did not feel constrained by the often rigid structure of a procedural, leaning towards experimentation instead of a tested and tried format. “The series is very diverse and dynamic. We have an episode with flashbacks, another one entirely at the garage, another one at a lavish party… We wanted to avoid a formula.”\n\t\n\n\t“Globoplay really trusted us when we pitched the project,” adds Andrucha. “We were a bit unsure at first but, today, watching all ten episodes, we firmly believe the format. Audiences liked to be prodded and we shouldn’t underestimate viewers. With ‘Emergency 53,’ we are broaching major societal issues without repeating ourselves with every episode.”\n\n\tTorres echoes his praise of the major Brazilian streamer: “Globoplay is a streamer that believes in artistic input. It doesn’t try to control artists, which is really rare. Their notes are smart, their comments are constructive. I think the series found a perfect home.” \n\n\tThe first season of “Emergency 53” might not even be out yet, but Waddington and Torres have already begun writing episodes for a possible second season. “We don’t know what is going to happen, but we feel we still have a lot to say and a lot of places to go with this one,” wraps Waddington. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Suicide Squad’ Meets ‘E.R.’ in Globoplay’s ‘Emergency 53,’ a New Series by Famed ‘Under Pressure’ Creative Team",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/VARIETY-SIZING-47.png?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-17T11:32:00.000Z",
      "dateModified": "2026-02-17T11:32:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "True Crime Book ‘Innocents,’ About Man Wrongly Convicted of a Child’s Murder, Set to Get Drama Adaptation (EXCLUSIVE)",
    "url": "https://variety.com/2026/tv/global/true-crime-innocents-lesley-molseed-drama-adaptation-1236664728/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Innocents.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-17T11:16:53.000Z",
    "description": "\n\tTrue crime book “Innocents,” written by Jonathan Rose with Steve Panter and Trevor Wilkinson, has been optioned for screen.\n\n\tCuriosity Rights and U",
    "body": "\n\tTrue crime book “Innocents,” written by Jonathan Rose with Steve Panter and Trevor Wilkinson, has been optioned for screen.\n\n\tCuriosity Rights and United Heroes are set to adapt the book, about the murder of 11-year-old Lesley Molseed and the subsequent wrongful conviction of Stefan Kiszko, for television.\n\n\tThe story follows the trial and wrongful conviction of Kiszko, an intellectually disabled man of Ukrainian heritage who served 16 years in prison before new evidence came to light that exonerated him. Another man was convicted for Molseed’s murder in 2007 following advances in forensic science.\n\t\n\n\tKiszko’s mother, Charlotte Kiszko, spent more than a decade campaigning for her son, who died twenty-two months after his release from prison. Charlotte died not long after. An MP described the episode as one of the “worst miscarriage of justice of all time.”\n\n\n\tTerry Clark is overseeing early-stage development. J.D. Zacharias (“Orphan,” “Freud’s Last Session”) will produce for Curiosity Rights alongside Egor Olesov (“Mr. Jones,” “Battle for Sevastopol”) for United Heroes.\n\n\t“Today, a single voice can mobilize millions,” said Zacharias. “But that wasn’t always the case. The McKinnon story shows what visibility can achieve. ‘Innocents’ is about the families who never had that chance — who were invisible to the system. Stefan’s mother did everything she could, but the world wasn’t listening yet. That tragedy is what makes this story essential.”\n\n\tOlesov added: “This story isn’t just about a legal failure — this is a true underdog story about what happens when ordinary people face a system that won’t listen. For families far from home, justice can feel out of reach — especially when they have no visibility or leverage. We also explore the lives and sacrifices of the everyday people who joined Charlotte in her fight to free Stefan and then went on to find the real killer of Lesley Molseed. ‘Innocents’ is deeply human, deeply painful, and profoundly relevant.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "True Crime Book ‘Innocents,’ About Man Wrongly Convicted of a Child’s Murder, Set to Get Drama Adaptation (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Innocents.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-17T11:16:53.000Z",
      "dateModified": "2026-02-17T11:16:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Universal International Studios to Shutter Australia’s Matchbox Pictures After Almost Two Decades Citing ‘Broader Production Landscape’",
    "url": "https://variety.com/2026/tv/global/matchbox-pictures-australia-shuts-down-1236665218/",
    "image": "https://variety.com/wp-content/uploads/2024/03/House-of-Gods-S1-Maia-Abbas-Batul-and-Priscilla-Doueihy-Jamila-Ep2-2023-Matchbox-Productions.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-17T10:40:26.000Z",
    "description": "\n\tAustralian production company Matchbox Pictures is set to close after almost two decades.\n\n\tThe studio was founded by Tony Ayres, Penny Chapman, Hel",
    "body": "\n\tAustralian production company Matchbox Pictures is set to close after almost two decades.\n\n\tThe studio was founded by Tony Ayres, Penny Chapman, Helen Bowden, Michael McMahon and Helen Pankhurst in 2008 and is known for fare including “House of Gods,” which won a best actor for Kamel El Basha at Series Mania in 2024, “Dog Park” and “The Survivors.”\n\n\tUniversal International Studios (then known as NBCU) took a majority stake in Matchbox in 2011 before acquiring it fully in 2014.\n\t\n\n\tIn a statement, the parent company said: “Following an extensive evaluation of the business and the broader production landscape, Matchbox will be closing after eighteen years (12 years since its NBCU acquisition). Universal International Studios maintains its commitment to Australia, but as strategic priorities shift the studio is evolving its operating model in the region. Moving forward the company will evaluate production opportunities and engage with local producers and talent on a case-by-case basis as new projects emerge.”\n\n\n\tVariety understands that Ayres’ standalone prod-co Tony Ayres Productions will also close. Ayres launched the company in 2018 backed by Universal.\n\n\tIn a statement, CEO of industry body Screen Producers Australia paid tribute to the company, saying: “The closure of Matchbox Pictures marks the end of a remarkable chapter in the modern Australian screen industry. Over nearly two decades, Matchbox helped redefine what Australian television and film could be – ambitious, internationally confident and unapologetically local in voice.”\n\t\n\n\t“Many writers, producers and craftspeople built careers through its productions, and its legacy will continue through the people and projects it nurtured. Matchbox helped demonstrate that Australian stories could resonate far beyond our borders, and that contribution will endure across the industry.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Universal International Studios to Shutter Australia’s Matchbox Pictures After Almost Two Decades Citing ‘Broader Production Landscape’",
      "image": [
        "https://variety.com/wp-content/uploads/2024/03/House-of-Gods-S1-Maia-Abbas-Batul-and-Priscilla-Doueihy-Jamila-Ep2-2023-Matchbox-Productions.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-17T10:40:26.000Z",
      "dateModified": "2026-02-17T10:40:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Estonian Cinema Comes Out of Its Shell Led by New Wave of Directors: ‘You Can’t Fake a Heart and We Have It’ ",
    "url": "https://variety.com/2026/film/global/estonian-cinema-new-wave-of-directors-1236656752/",
    "image": "https://variety.com/wp-content/uploads/2026/02/MixCollage-08-Feb-2026-10-26-PM-3255.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-17T10:50:49.000Z",
    "description": "\n\t“The ball is in your court, Estonia,” said Conan O’Brien during the Oscars after Latvia won its own statuette for “Flow”. Now, a new wave of Estonia",
    "body": "\n\t“The ball is in your court, Estonia,” said Conan O’Brien during the Oscars after Latvia won its own statuette for “Flow”. Now, a new wave of Estonian directors is coming to stake their claim. \n\n\t“With many debut features set to premiere in 2026, it feels like a generational shift,” says Sigrid Saag of the Estonian Film Institute. “Their stories focus more on youth, which the previous generations used to ignore, I think.”\n\t\n\n\tThat includes “Morten” by Ivan Pavljutškov, following an introverted 15-year-old who lives with his unemployed uncle while his mother works abroad. \n\n\n\t“The new generation of Estonian directors is marked by a more radical and self-assured cinematic vision. Many are eager to take risks, experiment with form and genre and move beyond conventional storytelling,” notes Pavljutškov.\n\n\t“There will be more stories engaging with contemporary Estonian realities, approached with a fresh perspective and a distinctly modern sensibility. I’m especially glad there’s a growing openness to stories reflecting the experiences of Russian-Estonians and other perspectives that have been underrepresented in national cinema.”\n\n\tAt the same time, upcoming filmmakers are “strongly committed” to artistic integrity, seeking “alternative production paths when traditional funding structures do not fully support their ideas.” \n\n\tIvar Murd also focuses on younger protagonists in “Mommy’s Boy” [previously “Sissy”] about a child of an alcoholic single mother.\n\n\t“Estonian authors have really started to find their voice. It used to be more usual for Estonian mainstream films to imitate Hollywood in terms of both look and feel, but our new films are really unique,” he observes. \n\t\n\n\t“Auteur cinema has really started to blossom. There’s a great blend in our storytelling that reflects where we are, both geographically and historically. We’re coming out of our shell.”\n\n\tMurd argues that such newfound confidence is evident in Anna Hint’s Sundance hit “Smoke Sauna Sisterhood”– “a great feminist picture able to compress something very Estonian and use it to introduce us to the wider world” – or Rainer Sarnet’s “The Invisible Fight” combining kung-fu and Eastern Orthodox monks.\n\n\t“These are stylish films that understand if something is important to the author, it has a real chance of being important to the audience, both at home and abroad. You can’t fake a heart, and we have it.” \n\n\tAs previously reported by Variety, Hints is already working on body horror musical “Black Hairy Beast” described as “A love story. With claws.”\n\n\t“Our biggest challenge is achieving financial stability and securing social benefits like health insurance. Protecting authors’ rights and safeguarding author-driven cinema remains essential, so that we can continue to talk about Estonian cinema in future. Estonia is small, but it holds an extraordinary amount of talent. The key question is how to nurture and protect that talent over time,” she emphasizes.\n\n\tOskar Lehemaa, behind “The Old Man Movie,” is developing “Birth”: a body horror in which a couple travels deep into the Estonian forest to attend a fertility retreat, which turns into an occult nightmare. \n\n\t“The film explores the fear of parenthood, bodily autonomy, and the power balance within intimate relationships. I’m also looking forward to creating the gnarliest pregnancy horror scenes ever,” he teases. \n\n\tNew filmmakers reflect “the concerns of the current zeitgeist in a way previous generations just couldn’t,” says Lehemaa. Examples include Tõnis Pill’s youth drama “Fränk,” taking a look at the early 2000s, and Meel Paliale’s “Rolling Papers” about twentysomethings in Tallinn. It was Estonia’s Oscar submission. \n\n\t“We’ll see more of these personal reflections on both the past and present, alongside a growing interest in genre fusion combining elements of musicals, horror, martial arts films and more,” he adds. \n\t\n\n\tHis producer, Evelin Penttilä, argues: “I see much more playfulness with genre in the films we are currently working on. What excites me is that each of these films is very distinct in tone and ambition. Combined with strong personal voices, it’s something international audiences can increasingly expect from Estonia: films that are bold, surprising, and confident in finding their own audience.”\n\n\t“I think we all want to avoid being boring or mediocre.” \n\n\tAccording to Tõnis Pill, filmmakers – and audiences – are growing weary of psychological realism and looking for new approaches. And for more hope. \n\n\t“Our young directors generally avoid stories with darker themes and ending movies on a hopeless note. I’m not saying we should only make happy-go-lucky films, but the current worldwide political situation demands some form of tension relief from authors.”\n\n\tShorts are also leading the way: at Berlinale, Joonas Taul will present animated short “A Serious Thought,” produced by the legendary Nukufilm Studio. \n\n\t“In the age of TikTok and attention spans measured in minutes, audiences are searching for stories that can immediately capture their focus and emotional engagement. Today’s trends are set by youth, and our youth watches short formats,” says Edith Sepp, CEO of the Estonian Film Foundation.\n\n\tJanno Jürgens’ psychological thriller “No Me Without You” highlights how new filmmakers are “boldly exploring fresh angles and storytelling methods,” notes producer Marju Lepp.\n\n\t“There is no single, unified direction or overarching trend – and that’s precisely what makes the current moment so exciting. This diversity is a strength and genuinely enriches the Estonian film landscape.”\n\n\tJürgens wonders: “I have the sense that there is more courage to simply be ourselves: to focus on our own stories, our own way of being and our uniqueness. At least, I hope that is the case.” \n\n\t“Estonian indie cinema is on the rise, with arthouse films made without public taxpayer funding, and filmmakers pushing back against restrictions on creative freedom and rigid rules to ensure a diverse and distinctive cinematic landscape.”\n\n\tLaura Raud, producing Elizabeth Kužovnik’s “Bicycle Thief” for Nafta Films, agrees that the visual language and storytelling have become “more eclectic and less uniform.” The growing diversity among new directors entering the Estonian film landscape is also evident. \n\t\n\n\t“Films are being developed and produced by people who don’t fit the traditional or stereotypical image of a ‘director.’ This shift has also been supported by welcome changes in funding practices, which have created more space for emerging voices.”\n\n\t“Bicycle Thief” follows Sigrit, a 10-year-old girl living in a small town. She receives a new bicycle for her birthday, only for it to be stolen the next day.\n\n\tRaud notes: “For a long time, certain audiences – especially women, children, and young adults – were underrepresented as central points of address in Estonian cinema, despite making up a large part of the filmmaking community and audience. This has begun to change in a meaningful way.”\n\n\tWith German Golub’s debut “Our Erika,” Liina Triškina-Vanhatalo’s “The First Love” and Jaanika Arum’s “Beyond the Visible Flowers” also looming on the horizon, “much can be expected from the new generation of Estonian filmmakers in the coming years,” says Maria Ulfsak, Feature Film Commissioner at the Estonian Film Institute.\n\n\t“And there will be blood: Mikk Mägi’s debut historical epic, ‘Godkiller,’ will hopefully entertain audiences both at home and abroad.”\n\n\tThe ball is in your court, Estonia.\n\n\n\n\t\n\n\t\t\t\t\tJoonas Taul’s ‘A Serious Thought’ \n\t\t\t\t\t\t\t\t\t© Ragnar Neljandi\n\t\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Estonian Cinema Comes Out of Its Shell Led by New Wave of Directors: ‘You Can’t Fake a Heart and We Have It’ ",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/MixCollage-08-Feb-2026-10-26-PM-3255.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-17T10:50:49.000Z",
      "dateModified": "2026-02-17T10:50:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Stephen Colbert Says CBS Blocked James Talarico Interview Over FCC ‘Equal Time’ Fears",
    "url": "https://variety.com/2026/tv/news/stephen-colbert-cbs-blocked-james-talarico-interview-fcc-equal-time-1236665220/",
    "image": "https://variety.com/wp-content/uploads/2025/11/colbert_b8b85b.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-17T10:40:05.000Z",
    "description": "\n\tStephen Colbert went public Monday night with a striking accusation against his own network: that CBS lawyers had barred him from airing an intervie",
    "body": "\n\tStephen Colbert went public Monday night with a striking accusation against his own network: that CBS lawyers had barred him from airing an interview with Texas state Rep. James Talarico, who is running for U.S. Senate, in a preemptive bow to FCC pressure over the agency’s push to apply its “equal time” rule to late-night talk shows.\n\n\tColbert revealed that the network’s legal team had called “The Late Show” staff directly and told them “in no uncertain terms” the interview could not be broadcast. He had additionally been instructed not to raise the matter on air. He then proceeded to do precisely the opposite.\n\t\n\n\tWalking his audience through the FCC’s “equal time” rule – which requires broadcast networks to provide opposing political candidates equivalent airtime – Colbert noted that talk shows had long benefited from an exemption to that requirement. “There’s long been an exception for this rule, an exception for news interviews and talk show interviews with politicians,” he said. “That’s crucial. How else were voters supposed to know back in ’92 that Bill Clinton sucked at saxophone?”\n\n\n\tThe host reserved particular scorn for FCC chair Brendan Carr, whom he described as a “smug bowling pin,” over a Jan. 21 letter in which Carr suggested the exemption should no longer apply to programs he characterized as being “motivated by partisan purposes.” Colbert addressed the Trump-appointed regulator directly: “FCC you… because I think you are motivated by partisan purposes yourself, sir. Hey, you smelt it ’cause you dealt it. You are Dutch-ovening America’s airwaves.”\n\t\n\n\tColbert also pointed out what he characterized as a glaring inconsistency in Carr’s approach – noting that while the FCC chair was targeting late-night talk shows, he had made clear that right-wing talk radio would not be subject to the equal time notice. “I get this part,” Colbert said. “You can’t get rid of talk radio. What else would your angriest uncle do in traffic? Talk to your saddest aunt?”\n\n\tCrucially, Colbert noted that Carr had not yet formally eliminated the exemption – making CBS’s decision to act as though he had a unilateral one. “He hasn’t done away with it yet, but my network is unilaterally enforcing it as if he had,” he said. As the studio audience booed, Colbert offered a sardonic explanation for the network’s posture – saying the decision was made “for purely financial reasons,” a wry echo of the rationale CBS cited when it canceled “The Late Show.”\n\n\tColbert placed the FCC’s moves within a broader pattern of political pressure. “Let’s just call this what it is. Donald Trump’s administration wants to silence anyone who says anything bad about Trump on TV, because all Trump does is watch TV. He’s like a toddler with too much screen time. He gets cranky and then drops a load in his diapers. So it’s no surprise that two of the people most affected by this threat are me and my friend Jimmy Kimmel.” Kimmel has also publicly pushed back against the proposed rule change.\n\n\tWhen Carr suggested that hosts unwilling to comply could migrate to “a cable channel or podcast or a streaming service,” Colbert was withering: “Great idea. A man whose job is to regulate broadcast TV suggests everyone just leave broadcast TV. It’s like when Arby’s changed their slogan to ‘Arby’s, would it kill you to eat a salad?'”\n\n\tHe then announced he would conduct the Talarico interview anyway – just not on the CBS broadcast. The conversation would instead air on “The Late Show” YouTube channel after the show, though Colbert noted the network would not permit him to share a URL or QR code directing viewers there.\n\n\tThe restrictions went further than just barring the interview itself. Colbert revealed he was also prohibited from showing any image of Talarico – including photographs or even drawings – under FCC rules forbidding any candidate appearance “by voice or picture.” He proceeded to display a stock photo the show had found by Googling “not James Talarico,” and then held up a drawing he claimed, for legal reasons, he could not confirm was or was not a likeness of the candidate – which turned out to resemble Snoopy.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Stephen Colbert Says CBS Blocked James Talarico Interview Over FCC ‘Equal Time’ Fears",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/colbert_b8b85b.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-17T10:40:05.000Z",
      "dateModified": "2026-02-17T10:40:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Džana Pinjo, Snežana Bogićević, Maja Izetbegović to Star in ‘Hedgehogs in the Haze,’ From Oscar Winner Danis Tanović (EXCLUSIVE)",
    "url": "https://variety.com/2026/film/global/dzana-pinjo-hedgehogs-in-the-haze-1236664992/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Hedgehogs-in-the-Haze-still-1.png?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-17T10:33:54.000Z",
    "description": "\n\tDžana Pinjo, who starred in Angelina Jolie’s 2011 “In the Land of Blood and Honey,” Snežana Bogićević (Bosnian hit sitcom “Crazy, Confused, Normal”)",
    "body": "\n\tDžana Pinjo, who starred in Angelina Jolie’s 2011 “In the Land of Blood and Honey,” Snežana Bogićević (Bosnian hit sitcom “Crazy, Confused, Normal”) and Maja Izetbegović (“Regained Memory,” 2026 Karlovy Vary World Premiere) are toplining the series “Hedgehogs in the Haze” (“Ježevi u magli”), a project from Danis Tanović whose “No Man’s Land” won an Oscar in the then called Foreign Language Film category in 2002.\n\t\n\n\tParticipating in the Berlinale’s Co-Pro Series pitching and networking event, it revolves around three best friends as they deal with myriad issues, including dodgy finances, overbearing partners and an unexpected tryst with the criminal underworld. \n\n\n\tDunja, an unemployed teacher and single mom, is trying to reconstruct her life while coping with her abusive ex-husband Kemo, who’s in prison. Ira is broke, debt-ridden and also dealing with an ex-husband while Belma is stuck in an oppressive marriage and secretly wishes to have an affair.\n\n\tWhen a fortune in drugs falls into their hands, the trio decide to use it to take down Kemo’s operation. Their failed attempts to sell it drag them into deeper trouble, testing their loyalty. Despite betrayal and loss, they forgive one another and choose a fresh start.\n\n\t“I gathered a group of actors from Sarajevo — people I know, people I trust — and we started working together, exploring stories, searching for something real. ‘Hedgehogs in the Haze’ was born out of that process: their experiences, their humor, their lives,” said Danis Tanović who co-directs the series alongside Nermin Hamzagić.\n\t\n\n\t“It’s a thriller about three women who find a box that could destroy or liberate them, but at its core, it’s a darkly funny, unpredictable story about friendship — the kind only Sarajevo could produce.,” he added.\n\n\tThe rest of the cast includes Ermin Bravo, Alban Ukaj and Boris Ler.\n\n\tCreated by Pinjo and Bravo, who also starred in “In the Land of Blood and Honey,” it is produced by RealStage (Bosnia & Herzegovina), Agitprop (Bulgaria), Para Film & Theatre (Norway), Brand Vision (Serbia) and BH Telecom (Bosnia & Herzegovina).\n\n\tSaid RealStage’s Lara Grozdanić who produces the series with Ishak Jalimam: “The overall state of financing for drama series remains challenging and has not significantly improved in recent years. While certain European frameworks such as Creative Europe MEDIA and Eurimages have expanded their focus to include series, this largely represents soft financing, rather than an increase in market-driven investment.”\n\n\t“From a broader international perspective, the situation is even more complex. The global drama series market is currently marked by a noticeable contraction of market money: commercial investment, broadcaster commitments, and platform financing are substantially lower than they were five years ago. Risk-taking has decreased, commissioning has slowed and financiers are far more cautious, prioritizing proven formats and territories with strong incentive systems,” she noted, adding: “In this context, co-production opportunities increasingly rely on layered financing structures and public support mechanisms, while international markets and co-production forums such as Berlinale Co-Pro Series, Cinelink, and Seriesly function less as deal-closing spaces and more as strategic platforms for long-term partnerships and financing alignment.”\n\n\tThe series received support from Creative Europe MEDIA funding – EU CoDevelopment. “For countries with very limited domestic support systems, such as Bosnia and Herzegovina, access to these international mechanisms remains essential, but the overall landscape reflects a tighter, more competitive and risk-averse market than in previous years,” she observed.\n\n\tA civil society organization and multidisciplinary production house founded in 2015, RealStage operates as an independent non-profit association engaged in theatre, film, and interdisciplinary arts. Among its standout productions are: “The Sky Above Zenica” by Nanna Frank Møller and Zlatko Pranjic; “The Pavillion” by Dino Mustafić and “The Otter” by Srđan Vuletić.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Džana Pinjo, Snežana Bogićević, Maja Izetbegović to Star in ‘Hedgehogs in the Haze,’ From Oscar Winner Danis Tanović (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Hedgehogs-in-the-Haze-still-1.png?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-17T10:33:54.000Z",
      "dateModified": "2026-02-17T10:33:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘So Long, Marianne’ Producers Tanweer Productions and Former Buccaneer Media Exec Richard Tulk-Hart Reunite for Dramedy Series ‘Antiparos’ (EXCLUSIVE)",
    "url": "https://variety.com/2026/film/global/tanweer-richard-tulk-hart-antiparos-1236664825/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Antiparos_Master-Thumbnail-Comp_No-Logos.jpeg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-17T10:37:35.000Z",
    "description": "\n\tTanweer Productions has partnered with former co-CEO of Buccaneer Media, Richard Tulk-Hart and his recently launched Volteo Media on the development",
    "body": "\n\tTanweer Productions has partnered with former co-CEO of Buccaneer Media, Richard Tulk-Hart and his recently launched Volteo Media on the development of Tanweer’s darkly comic crime series “Antiparos.” \n\n\tCreated by Alexandros Tsilifonis and George O’Neill Zafeiropoulos, the 6 x 45’ series turns on a harried Greek police investigator who goes home to his island of Antiparos for some much-needed R & R. As soon as he arrives, he is met by an over-zealous British policewoman who drags him into investigating a billionaire’s disappearance and into solving the most complex murder cases of his career.\n\t\n\n\tTanweer previously collaborated with Tulk-Hart on the Leonard Cohen dramatic mini-series “So Long, Marianne” (2024), starring Alex Wolff, produced by NRK and Crave, with Cineflix Rights handling global distribution.\n\n\n\tAccording to Tanweer, this new alliance marks the next stage for “Antiparos,” developed in English, as it moves toward production. The series is mostly financed and now finalizing outstanding international partnerships. “Antiparos” participated in the Series Mania Forum Co-Pro Pitching Sessions last year.\n\n\t“’Antiparos’ looks beyond the postcard version of the Greek islands and digs into the strange, funny and unsettling reality underneath. Set during Greek Orthodox Easter, it is a crime story where dark humor lives next to moral compromise and where a small community becomes a mirror of much larger social failures,” said Tsilifonis, who also directs.\n\n\t“The series stands apart by placing a noir mystery in bright, familiar terrain and slowly draining the color from it, until questions of duty, family loyalty and justice collide. It is ultimately about what we owe the place that raised us and how far we are willing to go to protect it,” he added.\n\t\n\n\tPondering the current state of affairs in the international TV industry, Tulk-Hart said: “We have been through a couple of tough years, but 2026 is starting to show some really positive signs for those connected to the international landscape and willing to enter into co-productions. \n\n\tBroadcasters are now realizing the necessity for this and as long as producers budget sensibly and partner with the right people there is a lot of potential in the near- and long-term future. ‘Antiparos’ is a great example of this, with Tanweer and Volteo each bringing unique strengths to the table.” \n\n\t“Financing is coming from a multitude of sources so it’s about thinking creatively at all levels, planning ahead and feeding the audience what they want, not what you want to make. In short, we are off the bottom,” he added.\n\n\tFounded in 2018 by Joseph Samaan and led by Dionyssis Samiotis, Tanweer Prods., part of Tanweer Media Group, produced the award-winning film “Murderess” (2023), which represented Greece at the Oscars. It is also behind feature biopic “Stelios” (2024), the biggest Greek box-office hit of the past decade. \n\n\tTV credits include “17 Threads” (2024) and “Rififi” (2025) by Sotiris Tsafoulias for leading Greek Pay TV platform Cosmote TV and “So Long Marianne” (2024), a mini-series about Leonard Cohen, starring Alex Wolff and a four country co-production between NRK (Norway) and Crave (Canada), with Cineflix Rights handling global distribution, which premiered at Series Mania.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘So Long, Marianne’ Producers Tanweer Productions and Former Buccaneer Media Exec Richard Tulk-Hart Reunite for Dramedy Series ‘Antiparos’ (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Antiparos_Master-Thumbnail-Comp_No-Logos.jpeg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-17T10:37:35.000Z",
      "dateModified": "2026-02-17T10:37:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Warner Bros. Discovery Agrees to Engage With Paramount in Sales Talks, but for Now Still Backs Netflix Deal as It Sets March 20 Shareholder Vote",
    "url": "https://variety.com/2026/film/news/warner-bros-discovery-paramount-talks-netflix-shareholder-vote-1236665083/",
    "image": "https://variety.com/wp-content/uploads/2025/12/GettyImages-2250244696.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-17T12:02:32.000Z",
    "description": "\n\tWarner Bros. Discovery has a number of questions for David Ellison, but the crucial one is this: Will his Paramount Skydance hoist its bid for WBD t",
    "body": "\n\tWarner Bros. Discovery has a number of questions for David Ellison, but the crucial one is this: Will his Paramount Skydance hoist its bid for WBD to over $31 per share?\n\n\tThe M&A jousting over Warner Bros. is entering its final rounds. On Tuesday, Warner Bros. Discovery said its board — after rebuffing multiple overtures from Paramount Skydance — will engage in discussions with the Ellison-led company to “seek clarity” on Paramount’s “best and final offer” in its hostile takeover attempt.\n\t\n\n\tWarner Bros. Discovery also announced March 20, 2026, as the date for the special meeting of shareholders to vote on the proposed $83 billion deal with Netflix, which would acquire WB’s studios and HBO Max. And even as it opens the door to negotiations with Paramount, WBD’s board of directors “continues to unanimously recommend in favor of the Netflix merger,” the company said — and the board also unanimously recommends that shareholders reject Paramount Skydance’s most recent offer.\n\n\n\tNetflix has granted WBD a limited waiver under the terms of their merger agreement to permit WBD to engage in discussions with Paramount Skydance for a seven-day period ending on Feb. 23, 2026. During that negotiating window, “WBD will engage with [Paramount Skydance] to discuss the deficiencies that remain unresolved and clarify certain terms of PSKY’s proposed merger agreement,” Warner Bros. Discovery said.\n\n\tOn Feb. 10, Paramount upgraded its hostile $30/share offer for all of WBD to include a promise to pay Warner Bros. Discovery 25 cents per share — roughly $650 million in cash each quarter — for every quarter in the event Paramount’s proposed acquisition of WBD is not closed beyond Dec. 31, 2026. Among other new pledges, Paramount also said it would pay the $2.8 billion termination fee due to Netflix if WBD shareholders accept Paramount’s offer.\n\t\n\n\tWarner Bros. Discovery said that, after Paramount submitted its latest amended offer, a “senior representative for PSKY” informed a WBD board member that if the WBD board authorized M&A talks, Paramount “would agree to pay $31 per share and that the offer was not PSKY’s ‘best and final’ proposal.” (WBD did not identify the Paramount representative or the Warner Bros. Discovery director.) \n\n\tThe $31/share price, along with “several other matters” that Paramount said it would address in its Feb. 10 letter, “are not reflected in the latest merger agreement that PSKY proposed,” according to WBD. To provide “specific clarity in this regard,” WBD on Tuesday sent the Paramount Skydance board a letter spelling out key issues yet to be addressed along with drafts of full transaction agreements for Paramount to confirm the terms of its offer.\n\n\tWBD wants Paramount Skydance “to clarify your proposal, which we understand will include a WBD per share price higher than $31,” Warner Bros. Discovery CEO David Zaslav and board chairman Samuel Di Piazza Jr. wrote in the letter. “We seek your best and final proposal. To be clear, our Board has not determined that your proposal is reasonably likely to result in a transaction that is superior to the Netflix merger.” (Read the letter below.)\n\n\tAccording to Warner Bros. Discovery, “There can be no assurance that a definitive transaction will result from WBD’s discussions with Paramount Skydance. The WBD Board and management team remain resolute in their commitment to maximizing value for shareholders and continue to recommend shareholders vote FOR the merger with Netflix.”\n\n\tNetflix retains its matching rights as specified by the merger agreement, which means the streamer could come back with a higher offer for the WB assets to counter Paramount.\n\n\t“While we are confident that our transaction provides superior value and certainty, we recognize the ongoing distraction for WBD stockholders and the broader entertainment industry caused by PSKY’s antics,” Netflix said in a statement Tuesday. “Accordingly, we granted WBD a narrow seven-day waiver of certain obligations under our merger agreement to allow them to engage with PSKY to fully and finally resolve this matter.”\n\n\tNetflix added, “This does not change the fact that we have the only signed, board-recommended agreement with WBD, and ours is the only certain path to delivering value to WBD’s stockholders.” Regarding the significant cost-cutting Paramount has outlined for a merged WBD-Paramount, Netflix said: “A business plan that is dependent upon $16 billion in cost savings should be an unmistakable red flag for regulators, policymakers, union leaders and creatives.”\n\t\n\n\tWBD’s Zaslav said in a statement: “Throughout the entire process, our sole focus has been on maximizing value and certainty for WBD shareholders. Every step of the way, we have provided PSKY with clear direction on the deficiencies in their offers and opportunities to address them. We are engaging with PSKY now to determine whether they can deliver an actionable, binding proposal that provides superior value and certainty for WBD shareholders through their best and final offer.”\n\n\tDi Piazza, WBD’s chairman, added, “As announced today, we continue to believe the Netflix merger is in the best interests of WBD shareholders due to the tremendous value it provides, our clear path to achieve regulatory approval and the transaction’s protections for shareholders against downside risk. With Netflix, we will create a brighter future for the entertainment industry – providing consumers with more choice, creating and protecting jobs and expanding U.S. production capacity while increasing investments to drive the long-term growth of our industry.”\n\n\tNetflix announced its $27.75/share cash-and-stock agreement to acquire Warner Bros.’s film and TV studios, HBO and HBO Max, and WBD’s games division in early December. Amid pressure from Paramount’s hostile takeover campaign, Netflix last month changed that to an all-cash offer. Warner Bros. Discovery has said it expects to spin off Discovery Global, which will comprise CNN, TNT, TBS, Food Network, HGTV and other cable nets as well as other assets including Discovery+, in the third quarter of 2026, prior to the Netflix deal close.\n\n\tParamount said its Feb. 10 amended offer, with an enterprise value of about $108 billion, is “fully financed” by $43.6 billion of equity commitments from Larry Ellison (the mega-billionaire tech mogul who is David’s father) and RedBird Capital Partners, alongside $54 billion of committed debt financing from Bank of America, Citigroup and Apollo Global Management. Other backers of Paramount’s WBD bid include the sovereign wealth funds of Saudi Arabia, Qatar and Abu Dhabi.\n\n\tWBD’s March 20 special shareholders meeting to vote on the Netflix pact is scheduled to begin at 8 a.m. Eastern. WBD shareholders of record as of 5 p.m. Eastern on Feb. 4, 2026, will be entitled to vote at the special meeting; more info is at VoteWBDNetflix.com. \n\t\n\n\tHere’s the text of the letter Warner Bros. Discovery sent to Paramount Skydance’s board:\n\n\tDear Members of the PSKY Board:\n\n\tThe Board of Directors of Warner Bros. Discovery (WBD) is fully committed to delivering a superior transaction to our shareholders. Since our decision last year to separate our Streaming & Studios businesses from our Global Linear Networks business, we have actively explored a wide range of alternatives, including through a publicly-announced strategic review process in which Paramount Skydance (PSKY) participated, having initially approached WBD in September 2025. Our agreed transaction with Netflix offers superior value for our shareholders, allows us to achieve our strategic goal to separate WBD’s businesses, offers a high degree of certainty with minimal risk to the businesses in the interim and has essentially no financing risk. The WBD Board continues to unanimously recommend that our shareholders approve the Netflix transaction, as reflected in the definitive proxy statement we have filed with the SEC today.\n\n\tOn February 10, PSKY amended its tender offer for WBD common stock. While this amendment addresses some of the concerns that WBD had identified several months ago, it still contains many of the unfavorable terms and conditions that were in the draft agreements submitted by PSKY on December 4, 2025 and December 22, 2025 and twice unanimously rejected by our Board. PSKY indicated in its February 10 letter to the WBD Board a willingness to address some of those concerns, but does not do so in its proposed merger agreement, leaving WBD with vague assurances of intention. Other important issues raised several times with PSKY are unchanged from your prior submissions. On February 11th, a senior representative of your financial advisor communicated orally to a member of our Board that PSKY would agree to pay $31 per WBD share if we engage with you, and that $31 is not PSKY’s best and final proposal.\n\n\tWe are writing to inform you that Netflix has agreed to provide WBD a waiver of certain terms of the Netflix merger agreement to permit us, through February 23, to engage with PSKY to clarify your proposal, which we understand will include a WBD per share price higher than $31. We seek your best and final proposal. To be clear, our Board has not determined that your proposal is reasonably likely to result in a transaction that is superior to the Netflix merger. We continue to recommend and remain fully committed to our transaction with Netflix and have scheduled a special meeting of our shareholders on March 20, 2026 to vote on the Netflix merger agreement.\n\t\n\n\tAs you know, it is typical and expected for a would-be overbidder to accept the substantive terms of the merger agreement that the target company has already agreed with its existing merger party. To provide you with specific clarity in this regard, we have prepared, and our legal counsel will deliver to you today, copies of transaction agreements that conform to this approach, address key issues for the WBD Board in prior PSKY offers and incorporate the terms and assurances reflected in your February 10 letter, as well as certain other changes to reflect matters unique to your proposal. Attached at the end of this letter is a business summary of these changes. As part of your binding proposal, the WBD Board needs confirmation that you are prepared to sign our proposed agreements. We encourage you to be direct and transparent with your best and final value and other terms in that binding proposal.\n\n\tDuring this seven-day period – as we consistently did during the strategic review process last year – we welcome the opportunity to engage with you and expeditiously determine whether PSKY can deliver an actionable, binding proposal that provides superior value, transaction certainty and interim protection for WBD’s businesses to Warner Bros. Discovery shareholders.\n\n\tOn behalf of the WBD Board of Directors,\n\n\tSamuel A. DiPiazza, Jr.Board Chair\n\n\tDavid ZaslavPresident and Chief Executive Officer\n\n\tSummary of Changes to Transaction Agreements\n\n\tBelow is a summary of the principal business changes reflected in the transaction agreements provided by WBD today, as compared to the draft agreements provided by PSKY in its tender offer. Many of these reflect terms proposed by PSKY in its public statements but not reflected in its merger agreement; others align the draft agreement with the terms of the Netflix merger agreement.\n\n\nRefinancing and Junior Lien Notes: PSKY to bear expenses in connection with any junior notes liability management exercise when incurred, or pay the $1.5 billion financing fee to WBD at the time it would be due (December 30, 2026). The Netflix merger agreement does not require WBD to bear any cost in this regard.\nBridge Refinancing: PSKY’s consent will not be required for WBD’s bridge refinancing, which will consist of dollar and euro term loan debt and bonds on market terms available at the time of the refinancing. The bond component will have a tenor of no more than 7 years, and will be non-callable for no more than 3 years, and the loan component will be non-callable for no more than 1 year. This provision is substantially more favorable to PSKY than the terms of the Netflix Merger Agreement, which permit WBD full refinancing flexibility.\nMaterial Adverse Effect: Consistent with the statement in PSKY’s Feb. 10 letter that it is “prepared to address any concerns WBD has regarding the impact of Discovery Global’s performance on closing certainty,” the “Company Material Adverse Effect” definition excludes effects attributable to the performance of WBD’s Global Linear Networks business (consistent with the Netflix Merger Agreement).\nEquity Cure to Support Debt: The significant debt financing and resulting pro forma leverage in the PSKY offer create material closing uncertainty, particularly when compared to Netflix’s investment grade credit rating and large positive free cash flow. PSKY has repeatedly stated that these concerns are not serious, noting the personal wealth of your lead equity sponsor and the credibility of your lending banks. To reflect your assurances, the draft agreements provide that in the event the transaction would not close due to the debt financing being unavailable, additional equity will be funded to enable closing to occur.\nInterim Operating Covenants: The interim operating covenants should not require consent from PSKY in order for WBD to operate its business in the ordinary course between signing and closing. The additional covenants you have proposed are not part of our agreement with Netflix, and are not accepted, as they further risk the certainty of closing.\nEquity Financing Certainty: Our changes to the PSKY equity documents reflect the need for absolute clarity as to funding obligations and certainty of funding at closing, or to pay damages if due.\nEquity Syndication: WBD will receive notice and full information regarding any equity syndication, and its consent will be required for any direct or indirect syndication that would require regulatory approvals or delay closing.\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Warner Bros. Discovery Agrees to Engage With Paramount in Sales Talks, but for Now Still Backs Netflix Deal as It Sets March 20 Shareholder Vote",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/GettyImages-2250244696.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-17T12:02:32.000Z",
      "dateModified": "2026-02-17T12:02:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Guess Which Olympic Gold Medalist This Snowboarder Turned Into!",
    "url": "https://www.tmz.com/2026/02/17/guess-which-olympic-gold-medalist-this-snowboarder-turned-into/",
    "image": "https://imagez.tmz.com/image/40/16by9/2026/02/10/406e56b64bde412bacc7d7e18fa36f63_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-17T08:01:43.000Z",
    "description": "\n    \n                    \n                          Guess Which Olympic\n                          Gold Medalist This\n                          Snowbo",
    "body": "\n    \n                    \n                          Guess Which Olympic\n                          Gold Medalist This\n                          Snowboarder Turned Into!\n                      \n                  \n                                                                        Published \n                              February 17, 2026\n                            12:01 AM PST\n                                                                            \n      \n    \n          Before this golden girl with her snow goggles was owning the slopes, she was just snowboarding at 4 years old with Olympic gold on her mind ...\n      \n    \n          At the 2018 Olympics, she made history as the youngest woman to win an Olympic snowboarding medal in the women's snowboard halfpipe.\n      \n    \n          Catch her in Milan!\n      \n    \n          Can you guess who she is?\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Olympics\n              \n                          \n                Guess Who\n              \n                          \n                TMZ Sports\n              \n                          \n                Kids\n              \n                          \n                celebrity kids\n              \n                          \n                Photo Galleries\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Guess Which Olympic Gold Medalist This Snowboarder Turned Into!",
      "image": [
        "https://imagez.tmz.com/image/40/16by9/2026/02/10/406e56b64bde412bacc7d7e18fa36f63_xl.jpg"
      ],
      "datePublished": "2026-02-17T08:01:43.000Z",
      "dateModified": "2026-02-17T08:01:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nicole Curtis Faces Backlash at Her Kid's School After N-Word Controversy",
    "url": "https://www.tmz.com/2026/02/17/nicole-curtis-faces-backlash-at-childs-school/",
    "image": "https://imagez.tmz.com/image/f7/16by9/2026/02/16/f7b33023c3c9419694d2ba20d4ddc116_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-17T09:00:38.000Z",
    "description": "\n    \n                    \n                          Nicole Curtis' Slur Controversy\n                          Parents at Kid's School Unglued About H",
    "body": "\n    \n                    \n                          Nicole Curtis' Slur Controversy\n                          Parents at Kid's School Unglued About Her Volunteering\n                      \n                  \n                                                                        Published \n                              February 17, 2026\n                            1:00 AM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Some parents at a SoCal school where Nicole Curtis volunteers as a room parent to her son's class have serious concerns on the heels of her N-word controversy... and at least one has gone to leadership demanding answers, TMZ has learned.\n      \n    \n          Here's the deal ... the HGTV star has been in hot water since a 2022 video leaked of her using the N-word while filming her popular show, \"Rehab Addicts.\" She's was fired -- and has issued an apology.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          But TMZ has heard from multiple concerned parents at her kid's school ... who tell us they're super uncomfortable with her working in the classroom as a volunteer -- and they think the school should at the very least address the situation with parents.\n      \n\n          One parent pointed out there are children of color who attend the school ... and they're shocked leadership has been mum on what happened -- and the headline-making fallout.\n      \n    \n          Another parent told us they, along with others, voiced their concerns to the school administration ... who allegedly told them it was not a \"school-wide issue,\" so there's not much to be done.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Nicole has been at the school since the 2022 leak ... and one parent told us it would be wise for her to read the room -- and take some time off to let emotions cool.\n      \n    \n          Nicole declined to comment.\n      \n    \n          We've reached out to the administration for comment ... so far, no word back.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Nicole Curtis\n              \n                          \n                N-Word\n              \n                          \n                TV\n              \n                          \n                Reality TV\n              \n                          \n                Exclusive\n              \n                          \n                Controversial S#!T\n              \n                          \n                News\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nicole Curtis Faces Backlash at Her Kid's School After N-Word Controversy",
      "image": [
        "https://imagez.tmz.com/image/f7/16by9/2026/02/16/f7b33023c3c9419694d2ba20d4ddc116_xl.jpg"
      ],
      "datePublished": "2026-02-17T09:00:38.000Z",
      "dateModified": "2026-02-17T09:00:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jeffrey Epstein's Infamous Zorro Ranch Never Visited by Police, New Owner Says",
    "url": "https://www.tmz.com/2026/02/17/jeffrey-epstein-zorro-ranch-never-visited-police-says-don-huffines/",
    "image": "https://imagez.tmz.com/image/22/16by9/2025/02/27/22986d77c4d04e66868725ac4a59661d_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-17T11:46:45.000Z",
    "description": "\n    \n                    \n                          Jeffrey Epstein's Zorro Ranch\n                          Police Turned Blind Eye to Pedophilia ...",
    "body": "\n    \n                    \n                          Jeffrey Epstein's Zorro Ranch\n                          Police Turned Blind Eye to Pedophilia ...\n                          New Owner Says\n                      \n                  \n                                                                        Published \n                              February 17, 2026\n                            3:46 AM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          The new owner of Jeffrey Epstein's notorious Zorro Ranch in New Mexico is speaking out, claiming the property was never visited by police despite numerous allegations women and girls were sex trafficked there for years.\n      \n    \n          Don Huffines — a wealthy Texas businessman and former Republican state senator with ties to MAGA — posted a message on X Monday night, saying he and his family purchased the ranch in 2024 and \"maintained an open line of communication with local authorities.\"\n      \n    \n      \n      In 2023, four years after Epstein’s death, San Rafael Ranch had been listed on the open market for years and was scheduled for public auction.At the time of the sale, it was marketed that the proceeds would go to the victims. It has since been confirmed by the estate’s…\n              @DonHuffines\n  \n    \n          However, law enforcement never requested access to the Santa Fe property even though Epstein was accused of sex trafficking and sexually assaulting women and girls there when he was alive, according to Huffines. There was also talk about bodies being buried on the property ... but that was never proven.\n      \n\n          In his X post, Huffines noted he always made it clear he would allow police to have full access to the property with his total cooperation, yet the authorities never took him up on his offer.\n      \n    \n      \n        \n              \n    \n    \n          Now, Huffines is doing some good with the property by renaming it San Rafael Ranch -- after the saint associated with healing -- and turning it into a Christian retreat. He and his family purchased the ranch 4 years after Epstein's death at a public auction.\n      \n    \n          In 2019, Epstein died by suicide in his cell at the Metropolitan Correctional Center in Manhattan while awaiting trial on federal sex trafficking charges.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Jeffrey Epstein\n              \n                          \n                Social Media\n              \n                          \n                Crime\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jeffrey Epstein's Infamous Zorro Ranch Never Visited by Police, New Owner Says",
      "image": [
        "https://imagez.tmz.com/image/22/16by9/2025/02/27/22986d77c4d04e66868725ac4a59661d_xl.jpg"
      ],
      "datePublished": "2026-02-17T11:46:45.000Z",
      "dateModified": "2026-02-17T11:46:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Reverend Jesse Jackson Dead at 84",
    "url": "https://www.tmz.com/2026/02/17/reverend-jesse-jackson-dead/",
    "image": "https://imagez.tmz.com/image/90/16by9/2021/11/02/90f28bc7586646d49ab6ff6aabf4458e_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-17T10:11:00.000Z",
    "description": "\n                    \n                          Reverend Jesse Jackson\n                          Dead At 84\n                      \n                  \n",
    "body": "\n                    \n                          Reverend Jesse Jackson\n                          Dead At 84\n                      \n                  \n                                                                        Published \n                              February 17, 2026\n                            2:11 AM PST\n                                                                      |\n                                                                Updated \n                                  February 17, 2026\n                                4:09 AM PST\n                                    \n              \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Reverend Jesse Jackson, the civil rights pioneer and Baptist minister who twice ran for U.S. president, has died, according to his family.\n      \n    \n          Jesse's family issued a statement Tuesday morning, celebrating the icon ... \"Our father was a servant leader — not only to our family, but to the oppressed, the voiceless, and the overlooked around the world.”\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          They went on ... “We shared him with the world, and in return, the world became part of our extended family. His unwavering belief in justice, equality, and love uplifted millions, and we ask you to honor his memory by continuing the fight for the values he lived by.”\n      \n    \n          Jackson died peacefully with his loved ones at his side ... his official cause of death has not yet been released.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          In November, Jesse was hospitalized after living for over a decade with progressive supranuclear palsy (PSP), according to his Rainbow PUSH Coalition. The disease impacts patients’ ability to walk and swallow and has dangerous complications. Jesse was also diagnosed with Parkinson's in 2017.\n      \n    \n          Born in Greenville, South Carolina, Jackson quickly rose to prominence as an activist during the civil rights era. He became close with Dr. Martin Luther King and marched alongside him during demonstrations ... Jesse's advocacy for Blacks and the poor stretched over several decades.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Jackson also dove into national politics, running for the presidency in 1984 and 1988, but he lost both times.\n      \n    \n          During his 1984 campaign for the democratic nomination, Jesse famously called New York City \"Hymietown,\" using the term \"Hymie\" to refer to NYC's large Jewish population.  Republican candidate Ronald Reagan won the 1984 election in a landslide.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          That same year, Jackson launched his National Rainbow Coalition, which blasted Reagan's policies and championed social programs, voting rights and affirmative action. Jesse's PUSH organization and National Rainbow Coalition merged in 1996, continuing his never-ending fight for African Americans and the poor.\n      \n    \n          In 1999, Jackson helped negotiate the release of 3 U.S. servicemen held in Yugoslavia. Then-President Bill Clinton gave Jackson the Presidential Medal of Freedom for assisting in brokering the deal.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Jesse had similar successes cutting deals with foreign adversaries to bring home our captive military personnel in Syria, Cuba, Iraq and Gambia. He was also elected in 1991 to be a \"shadow senator\" to lobby for Washington D.C. statehood, serving one term in the role.\n      \n    \n          Jackson was 84.\n      \n    \n          RIP\n      \n      ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Reverend Jesse Jackson Dead at 84",
      "image": [
        "https://imagez.tmz.com/image/90/16by9/2021/11/02/90f28bc7586646d49ab6ff6aabf4458e_xl.jpg"
      ],
      "datePublished": "2026-02-17T10:11:00.000Z",
      "dateModified": "2026-02-17T10:11:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cheer Mom Who Allegedly Killed Daughter in Murder-Suicide Had Past Custody Issues",
    "url": "https://www.tmz.com/2026/02/16/cheer-mom-custody-issues-before-daughter-murder/",
    "image": "https://imagez.tmz.com/image/7b/16by9/2026/02/16/7bee4d02f03c4cfab3452a1d3af79bf8_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-17T00:00:37.000Z",
    "description": "\n    \n                    \n                          Cheer Mom\n                          History of Custody Issues Preceded Apparent Murder-Suicide\n  ",
    "body": "\n    \n                    \n                          Cheer Mom\n                          History of Custody Issues Preceded Apparent Murder-Suicide\n                      \n                  \n                                                                        Published \n                              February 16, 2026\n                            4:00 PM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Tawnia McGeehan -- the mom who allegedly killed her teen daughter Addi Smith and then herself in a Las Vegas hotel room over the weekend -- had a custody battle for her daughter, which lasted 9 years ... according to court documents obtained by TMZ.\n      \n    \n          The papers show multiple instances where Tawnia was accused of custodial interference, but the charges were later dismissed.\n      \n    \n          In the original temporary orders from 2015, Tawnia and her ex, Bradley Smith, agreed that Addi would live with Tawnia as her primary residence, but that Bradley was to be granted parent time and joint custody.\n      \n\n                  \n          \n                          \n                \n                  \n      \n    \n          But in 2020, there was a temporary order in which Tawnia was accused of subjecting Addi to \"behavior on the spectrum of parental alienation.\" The papers also allege Tawnia committed domestic abuse in front of the child.\n      \n    \n          This 2020 order determined Bradley would have temporary sole custody of Addi, having \"demonstrated a better understanding of the child's needs.\"\n      \n    \n          Then in 2021, Tawnia filed a temporary restraining order and alleged she was being recorded by Addi's stepmom during their parent-time exchanges.\n      \n    \n        Waiting for your permission to load the Instagram Media.\n      \n    \n          In the end, Tawnia and Bradley were awarded joint legal and physical custody of Addi with one week on and one week off in 2024.\n      \n    \n          As we reported ... Tawnia and Addi traveled from Utah to Las Vegas for a cheer competition they never showed up for. Police believe Tawnia shot Addi late Saturday at the Rio Hotel & Casino before turning the gun on herself.\n      \n    \n          If you or someone you know is struggling or in crisis, help is available. Call or text 988 or chat 988lifeline.org.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Exclusive Details\n              \n                          \n                TMZ Sports\n              \n                          \n                Crime\n              \n                          \n                Health\n              \n                          \n                News\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cheer Mom Who Allegedly Killed Daughter in Murder-Suicide Had Past Custody Issues",
      "image": [
        "https://imagez.tmz.com/image/7b/16by9/2026/02/16/7bee4d02f03c4cfab3452a1d3af79bf8_xl.jpg"
      ],
      "datePublished": "2026-02-17T00:00:37.000Z",
      "dateModified": "2026-02-17T00:00:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]