[
  {
    "title": "Siddhant Chaturvedi, Mrunal Thakur’s ‘Do Deewane Seher Mein,’ Produced by Sanjay Leela Bhansali and Zee Studios, Unveils Teaser (EXCLUSIVE)",
    "url": "https://variety.com/2026/film/news/siddhant-chaturvedi-do-deewane-seher-mein-teaser-1236634159/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Do-Deewane-Seher-Mein.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-19T06:20:00.000Z",
    "description": "\n\tZee Studios and Bhansali Productions have unveiled a teaser for Bollywood romantic drama “Do Deewane Seher Mein.” \n\n\tThe film stars Siddhant Chaturv",
    "body": "\n\tZee Studios and Bhansali Productions have unveiled a teaser for Bollywood romantic drama “Do Deewane Seher Mein.” \n\n\tThe film stars Siddhant Chaturvedi and Mrunal Thakur in what is billed as a “perfect love story between two imperfect people” and as a “modern romance that feels like a memory you didn’t even know you were holding on to.” Ravi Udyawar directs the project.\n\n\tThe teaser for the largely Mumbai-set film features the all-time classic song “Do Deewane Seher Mein,” from “Gharaonda” (1977), sung by Bhupinder Singh and Runa Laila, composed by Jaidev, with lyrics by Gulzar. \n\t\n\n\tChaturvedi’s breakthrough role was in “Gully Boy,” which played at the Berlin Film Festival. His recent credits include “Dhadak 2,” “Kho Gaye Hum Kahan” and “Gehraiyaan.” Thakur’s credits include “Son of Sardaar 2,” “Sita Ramam,” “Jersey” and Netflix series “Lust Stories 2.”\n\n\n\tUdyawar previously directed the thriller “Mom,” starring Sridevi in her final film role, and “Yudhra,” with Chaturvedi in the lead. \n\n\tSanjay Leela Bhansali produces alongside Prerna Singh, Umesh Kumar Bansal and Bharat Kumar Ranga in association with Ravi Udyawar Films. Bhansali’s recent directorial work includes “Gangubai Kathiawadi” and the Netflix series “Heeramandi: The Diamond Bazaar,” while his production company has backed titles including “Tuesdays and Fridays” and “Malaal.”\n\n\tZee Studios’ dialogue-free film “Gandhi Talks,” starring Vijay Sethupathi, Aditi Rao Hydari, Arvind Swamy, and Siddharth Jadhav, is due a Jan. 30 release. The company’s recent credits include “Aga Aga Sunbai Kay Mhantay Sasubai,” “Pennu Case,” “Rubaab,” “Rahu Ketu” and “Champion.” \n\t\n\n\t“Do Deewane Seher Mein” is due to release theatrically on Feb. 20.\n\n\tWatch the teaser here: \n\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Siddhant Chaturvedi, Mrunal Thakur’s ‘Do Deewane Seher Mein,’ Produced by Sanjay Leela Bhansali and Zee Studios, Unveils Teaser (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Do-Deewane-Seher-Mein.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-19T06:20:00.000Z",
      "dateModified": "2026-01-19T06:20:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Renowned Brazilian Telenovela Writer Aguinaldo Silva Bets on Melodrama in Return to Primetime With Hit Globo Teenage Pregnancy Drama ‘Three Graces’",
    "url": "https://variety.com/2026/tv/global/aguinaldo-silva-three-graces-globo-content-americas-1236634523/",
    "image": "https://variety.com/wp-content/uploads/2026/01/VARIETY-SIZING-37.png?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-19T10:29:01.000Z",
    "description": "\n\tOne of the most lauded authors in the history of the Brazilian telenovela, Aguinaldo Silva is responsible for iconic works such as “Tieta,” “Everyth",
    "body": "\n\tOne of the most lauded authors in the history of the Brazilian telenovela, Aguinaldo Silva is responsible for iconic works such as “Tieta,” “Everything Goes” and “Her Own Destiny,” having penned some of the most infamous villains in the catalogue of Brazil’s media giant Globo. Silva has recently returned to the broadcaster’s prestigious primetime slot with “Three Graces,” seven years after retirement rumors swirled following “O Sétimo Guardião.”\n\t\n\n\tGlobo is launching “Three Graces” internationally at Content Americas this week, cleverly rolling off the great momentum the novela is having in its home country. Starring a roster of Brazil’s most popular names, including Sophie Charlotte (“All the Flowers”), Murillo Benício (“Brazil Avenue”) and Grazi Massafera (“Hidden Truths”), “Three Graces” tells the story of Charlotte’s blue-collar heroine Gerluce, a woman who tried her hardest to stop her teenage daughter Joélly (Alana Cabral) from repeating a pattern followed by generations of the Das Graças family: teenage pregnancy succeeded by single motherhood. \n\n\t“Three Graces” was sold in Brazil as Globo’s return to the “novelão,” “big novela” in literal translation. The concept doubles down on what is arguably the greatest strength of the genre: its undisputed penchant for melodrama. Who better to spearhead such a campaign than Silva, who, more than once, stopped the entire country to watch a villain’s unabashedly camp reckoning?  \n\n\n\tSpeaking with Variety ahead of Content Americas, Silva emphasizes how the novela possesses “an unchangeable language.” “It’s a genre that relies less on action than emotion, and emotion is something that happens within characters. It’s been the same since Charles Dickens wrote his novels in England and distributed them one by one. It’s the narrative of a hero towards knowledge. ‘Three Graces’ is purposefully structured as a dose of melodrama shot straight into the vein.” \n\t\n\n\tWith a career spanning four decades, Silva has seen many changes in the industry. Today, he highlights the difficulties of capturing the attention of increasingly sparse audiences accustomed to the speed of the digital world. “How can we tell a story that unravels across 170 45-minute episodes at a time when audiences are used to watching everything they want in under three minutes? The novela has its own time and, increasingly, audiences have theirs. The only option is to double down on the essence of melodrama and the emotion that moves the story forward.” \n\n\tThe inspiration for “Three Graces” came from a visit Silva paid to a maternity ward during research for “Duas Caras.” “Pregnant women were lined up in a long queue,” he recalls. “Most of them were teenagers. That touched me, even more so because the majority were either alone or accompanied by other women. Those were girls who were becoming single mothers. That image stayed with me for years.”\n\n\n\n\t\n\n\t\t\t\t\tAguinaldo Silva, courtesy of Globo\n\t\n\n\n\n\tThe author credits his return to the 9 PM slot to “a terrible vice.” “I couldn’t see myself as retired. I continued to invent stories that I would only tell myself. Then, one day, I thought: why not return to action? Working is when I have the most fun.” \n\n\tDespite the “fun” of writing a telenovela, the nature of the open work is challenging to any author. Brazilian telenovelas are written concurrently with exhibition, with the audience’s reaction often directly influencing the future of the characters. Silva jokingly credits his “lack of danger awareness” for his attraction to an open work. “Writing a novela is like throwing yourself from the trapeze while knowing there is no one there to catch you when you fall. When it comes to a 9 p.m. novela in Brazil, there are more than 60 million people watching every week. For an author, it is pure magic when they can win the hearts and minds of all these people.” \n\n\t18-year-old Alana Cabral is experiencing this magic firsthand. The newcomer recognizes the weight of playing the lead role in a primetime Aguinaldo Silva novela so early in her career, stating that it has made her “grow” immensely in a short period. “I was already very familiar with [Silva’s] work and always admired the strength of his female characters. To be center stage in one of his stories so early in my career demands a lot of artistic and emotional maturity. I couldn’t be happier.” \n\t\n\n\tVeteran Dira Paes (“Pantanal”), who plays Joélly’s grandmother Lígia, echoes that sense of responsibility, saying that novelas are in “direct conversation” with Brazil. Paes calls “Three Graces” a gift from Silva, praising how the story touches upon themes of generational trauma that speak to universal pains. “It allows the audience to become your accomplices because everyone has a similar story in their lives.” \n\n\tPaes reiterates she is in “a great moment” in her renowned four-decade career. On top of “Three Graces,” the actor has also recently starred in Marianna Brennand’s Sean Penn-backed “Manas,” which premiered at the Venice Film Festival in 2024 and kept a strong momentum that even challenged Kleber Mendonça Filho’s chances at the International Film Oscar with “The Secret Agent.” “Brazilian cinema deserves this recognition,” says Paes. “We have a cinema that goes beyond borders despite being spoken in Portuguese. It’s a global phenomenon.”\n\n\t“I come from cinema, and I am immensely proud of Brazilian cinema and Brazilian filmmakers,” the “Divine Love” actor adds. “It’s a work of great artistry that manages to cross borders with the strength of its identity and cultural roots. We are living in a truly special moment for the consolidation of Brazilian cinema internationally. I feel inspired, and I think it’s time to go beyond our language and start working on international co-productions. I feel this is the next step.”\n\n\tSilva is also “immensely” proud of Brazilian cinema, but reiterates that “we can’t forget that Brazilian novelas have also earned the world’s attention.” “Within the audiovisual sector, Brazilian cinema and television have their own rhythms, but they walk together.” \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Renowned Brazilian Telenovela Writer Aguinaldo Silva Bets on Melodrama in Return to Primetime With Hit Globo Teenage Pregnancy Drama ‘Three Graces’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/VARIETY-SIZING-37.png?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-19T10:29:01.000Z",
      "dateModified": "2026-01-19T10:29:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "China Box Office: ‘Zootopia 2’ Leads Again as Market Cools Further Ahead of Lunar New Year",
    "url": "https://variety.com/2026/film/box-office/china-box-office-zootopia-2-lunar-new-year-1236634521/",
    "image": "https://variety.com/wp-content/uploads/2025/11/zootopia-2-1.jpg?w=1000&h=562&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-19T07:39:21.000Z",
    "description": "\n\tDisney’s “Zootopia 2” remained the top film in China for the Jan. 16–18 weekend, as the market continued to soften ahead of the Lunar New Year corri",
    "body": "\n\tDisney’s “Zootopia 2” remained the top film in China for the Jan. 16–18 weekend, as the market continued to soften ahead of the Lunar New Year corridor.\n\n\tThe animated sequel added RMB36.2 million ($5.1 million), according to Artisan Gateway, pushing its cumulative gross to RMB4.37 billion ($615.2 million). While weekly takings dipped, the film continues to post the strongest holds in the market nearly eight weeks into release.\n\t\n\n\tMaoyan Movie’s crime thriller “The Fire Raven” stayed in second place with $5 million, lifting its total to $51.3 million. Directed and written by Sam Quah, the film stars Peng Yuchang, Alan Aruna and Chang Ning and follows the reopening of a long-dormant murder case that exposes a wider network of corruption and revenge.\n\n\n\tJames Cameron’s “Avatar: Fire and Ash” ranked third, earning $4.3 million. The 20th Century Studios release has now grossed $153.4 million in China. \n\n\tDebuting in fourth was Maoyan Movie’s “Take Off,” which opened with $2.8 million from its first weekend, starting its run with a $2.9 million cumulative. Directed by Song Peng Fei and based on Shuang Xuetao’s novella “The Aeronaut,” the drama stars Jiang Qiming and Li Xueqin and centers on a factory worker in Northeast China who becomes consumed by his dream of building a homemade flying machine. \n\n\tRounding out the top five was Huace Film & TV’s “Back to the Past,” which earned $2.2 million, pushing its total to $38 million. The feature film adaptation of Hong Kong broadcaster TVB’s 2001 historical sci-fi series “A Step Into the Past” is produced by Louis Koo‘s One Cool Film Production, with Koo serving as producer. The project reunites the principal cast from the original television series 24 years after it first aired. Koo stars alongside Raymond Lam, Jessica Hsuan, Sonija Kwok, Joyce Tang and Michelle Saram, all reprising their original roles. New cast members include Bai Baihe, Michael Miu and Louis Cheung. The film marks the final screen appearance of the late Dick Liu Kai-chi.\n\t\n\n\tThe weekend’s combined box office reached $24.4 million, while China’s 2026 year-to-date gross stands at $201.8 million, tracking 0.1% ahead of the same period last year.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "China Box Office: ‘Zootopia 2’ Leads Again as Market Cools Further Ahead of Lunar New Year",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/zootopia-2-1.jpg?w=1000&h=562&crop=1"
      ],
      "datePublished": "2026-01-19T07:39:21.000Z",
      "dateModified": "2026-01-19T07:39:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Beta Reveals Sales Deals for Spanish Drama Series ‘Pubertat,’ ‘Perfect Life,’ ‘Shades,’ ‘Velvet’ (EXCLUSIVE)",
    "url": "https://variety.com/2026/tv/global/beta-film-sales-deals-spanish-drama-series-1236634539/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Pubertat-Secrets-Lies-and-Human-Castles.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-19T09:16:24.000Z",
    "description": "\n\tBeta Film has secured several key deals across Europe for its slate of premium Spanish drama series.\n\n\tGerman-French public service broadcaster ARTE",
    "body": "\n\tBeta Film has secured several key deals across Europe for its slate of premium Spanish drama series.\n\n\tGerman-French public service broadcaster ARTE and German public broadcaster SWR have acquired two Beta drama series by writer/director/actress Leticia Dolera: drama “Pubertat – Secrets, Lies, and Human Castles” and the comedy drama “Perfect Life.”\n\n\tONE, the free-to-air channel of German public broadcaster ARD, has secured the rights to the long-running Spanish hit series “Velvet” as well as its spin-off “The Velvet Collection,” while AXN White has acquired the Spanish thriller series “Shades” for Germany, Austria and Switzerland.\n\t\n\n\tDolera’s “Pubertat – Secret, Lies and Human Castles” will air on ARTE early this year, and SWR later this year. The series was presented at last year’s San Sebastian Film Festival and recently took the Spanish Ondas Award for best fiction series.\n\n\n\tIn the show, which comprises six one-hour episodes, Dolera takes a warm-hearted look at lost love between parents and their teenage children and how it might be rediscovered, set against the backdrop of the Catalan tradition of “human towers.”\n\n\tThe series is produced by Distinto Films, Corte y Confección de Películas, Uri Films, Altres Films and AT-Prod in co-production with 3Cat and the participation of HBO Max Spain.\n\n\tARTE has also acquired Dolera’s dramedy “Perfect Life,” comprised of 14 30-minute episodes, produced by Movistar Plus+ and Corte y Confección de Pelíuculas. The show is a witty and fun take on adult relationships. It centers on María, Cristina and Esther, three very different women in their 30s and 40s: Just when they think their adult lives are pretty much set, they discover how wrong they are as each finds herself at an unexpected turning point.\n\t\n\n\tThe suspenseful crime thriller series “Shades,” comprising six one-hour episodes, was praised by Focus magazine as “cinematic [and] first-rate.” It follows six troubled patients attending a remote therapy retreat in a picturesque vineyard – only to find themselves entangled in a murder investigation when their renowned psychiatrist is found dead.\n\n\tFeaturing a stellar cast, including Elsa Pataky (“Fast & Furious,” “Furiosa – A Mad Max Saga”), Enrique Arce (“Money Heist”) and Maxi Iglesias (“Valeria”), among others, “Shades” is produced by Secuoya Studios and Stellarmedia for SkyShowtime.\n\n\tSet in late 1950s Madrid, “Velvet” (91 one-hour episodes) dives into the romance between haute couture dressmaker Ana and Alberto, heir to the Galerías Velvet fashion house. A long-running success, the series is produced by Bambú Producciones for Atresmedia Televisión. Its popular spin-off, “The Velvet Collection” (20 one-hour episodes), is produced by Movistar Plus+ with Bambú Producciones in association with Beta Film, and continues the saga into 1960s New York, expanding the world of fashion, ambition, and passionate relationships.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Beta Reveals Sales Deals for Spanish Drama Series ‘Pubertat,’ ‘Perfect Life,’ ‘Shades,’ ‘Velvet’ (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Pubertat-Secrets-Lies-and-Human-Castles.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-19T09:16:24.000Z",
      "dateModified": "2026-01-19T09:16:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Korea Box Office: ‘Once We Were Us’ Holds Top Spot as ‘Avatar: Fire and Ash’ Crosses $50 Million Milestone",
    "url": "https://variety.com/2026/film/box-office/korea-box-office-once-we-were-us-avatar-fire-and-ash-50-million-1236634519/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Once-We-Were-Us.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-19T09:13:29.000Z",
    "description": "\n\tLocal romance “Once We Were Us” maintained its position at the summit of the South Korean box office for a second consecutive weekend, according to ",
    "body": "\n\tLocal romance “Once We Were Us” maintained its position at the summit of the South Korean box office for a second consecutive weekend, according to data from KOBIS, the tracking service operated by the Korean Film Council. While the local hit continued to draw the largest crowds, James Cameron’s “Avatar: Fire and Ash” reached a significant financial milestone in the territory.\n\n\t“Once We Were Us” earned $2.1 million from 316,411 admissions over the weekend. Directed by Kim Do-young and starring Koo Kyo-hwan and Moon Ga-young, the film is a Korean remake of the 2018 Chinese melodrama “Us and Them.” The story follows two people who first met as students and fell in love, only to be separated by the harsh realities of city life. They unexpectedly reunite a decade later, forcing them to confront their shared past and the dreams they once held. The film has now reached a cumulative gross of $10.4 million from 1.5 million admissions.\n\t\n\n\tIn second place, “Avatar: Fire and Ash” added $1.5 million to its total, allowing the threequel to surpass the $50 million mark in South Korea. Since its mid-December debut, the film has amassed a total of $50.4 million from 6.3 million admissions. Despite the rise of local titles, the tentpole continues to hold a strong revenue share of 20.9%. \n\n\n\t“Choir of God” climbed to third place in its third weekend of release, earning $779,915 from 114,841 admissions. Directed by Kim Hyeong-hyeop, the musical drama marks the big-screen return of actor Park Si-hoo. The film follows efforts to bypass international sanctions by seeking assistance from a Hungarian NGO to construct churches in Pyongyang. Its total gross has now reached $2.8 million.\n\t\n\n\tTwo new local entries made their debut in the top five. The animated feature “Shinbi’s Haunted House: One More Summon” opened in fourth place, grossing $696,114 over the weekend. Based on the popular “Shinbi Apartment” television franchise, the film follows siblings Hari and Doori and their goblin friend Shinbi as they investigate a new supernatural threat involving mysterious hypnotizing water. Since its opening on Jan. 14, it has earned a total of $973,020.\n\n\tClose behind in fifth was the romantic comedy “Heartman: Rock and Love,” which earned $684,213. Directed by Choi Won-sub, who previously directed the action-comedy “Hitman: Agent Jun,” the film stars Kwon Sang-woo and Moon Chae-won. The plot follows a former musician living a quiet, orderly life whose world is turned upside down when he reunites with his first love. As he attempts to win her back while hiding a major secret, comedic chaos ensues. The film has earned $1 million since its Jan. 14 release.\n\n\tDisney’s “Zootopia 2” moved to sixth place, adding $486,780 to its massive $55.1 million cumulative total. \n\n\tThe local romance “Even If This Love Disappears from the World Tonight,” starring Choo Young-woo and Shin Sia, fell to seventh, earning $187,767 for a total of $5.4 million. Based on the novel by Ichijo Misaki, the film stars Choo Young-woo and Shin Sia. Directed by Kim Hye-young, the film is a bittersweet high-school romance centered on a girl with anterograde amnesia whose memories reset each morning. \n\n\tThe top 10 was rounded out by the local animation “Gogo Dino Movie: Insect World Adventure,” which debuted with $98,447. Directed by Lee Sun-myung, the Moggozi-produced adventure follows the titular robot dinosaurs as they navigate a giant-sized insect kingdom. It was followed by “Crayon Shinchan the movie: Super Hot! The Spicy Kasukabe Dancers” with $61,638 and a one-week only revival of Japanese anime hit “The First Slam Dunk” with $71,287.\n\n\tThe overall market collective gross for the weekend was $7.2 million, down from last week’s $7.9 million.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Korea Box Office: ‘Once We Were Us’ Holds Top Spot as ‘Avatar: Fire and Ash’ Crosses $50 Million Milestone",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Once-We-Were-Us.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-19T09:13:29.000Z",
      "dateModified": "2026-01-19T09:13:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Leesa Gazi to Direct Tagore Adaptation ‘Shasti’ Starring Pori Moni, Chanchal Chowdhury (EXCLUSIVE)",
    "url": "https://variety.com/2026/film/news/leesa-gazi-tagore-shasti-pori-moni-chanchal-chowdhury-1236634527/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Leesa-Gazi.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-19T09:58:00.000Z",
    "description": "\n\tBangladeshi filmmaker Leesa Gazi is set to helm “Shasti” (Punishment), a contemporary adaptation of Nobel Prize winner Rabindranath Tagore‘s 1893 sh",
    "body": "\n\tBangladeshi filmmaker Leesa Gazi is set to helm “Shasti” (Punishment), a contemporary adaptation of Nobel Prize winner Rabindranath Tagore‘s 1893 short story, with an international production lineup backing the project.\n\n\tThe psychological drama stars Pori Moni, Chanchal Chowdhury, Aanon Siddiqua and Arka Das in lead roles, with Kazi Ruma and Kamrunnahar Munni in supporting roles. Production is slated to begin in Dhaka this October and November.\n\t\n\n\tDrawing from Tagore’s source material, the film follows the mysterious death of influencer Lucky, allegedly at the hands of her sister-in-law Meera, which triggers a media frenzy. As a rigged trial unfolds, the narrative explores themes of family secrets, betrayal and manipulation within a city hungry for punishment.\n\n\n\tThe project marks Gazi’s second fiction feature following “A House Named Shahana,” which made history as Bangladesh’s first woman-directed submission for the Academy Awards’ best international feature category at the 98th edition.\n\n\tKomola Collective, Sanat Initiative, Awedacious Originals, Goopy Bagha Productions, Screenxcope Australia and Black & White Workshop Inc. are producing. Gazi produces alongside Abid Aziz Merchant, Apoorva Bakshi and Arifur Rahman. Sakib Iftekhar and Rainbow Fong serve as co-producers, with Faisal Gazi and Tulip Kabir as executive producers and Abbas Nokhasteh and Kazi Ruma as co-executive producers.\n\n\tThe creative team features Gazi and Siddiqua on the original story, with screenplay by Gazi, Siddiqua and Sadia Khalid Reeti. Alex Unai serves as cinematographer, Tania Rahman as casting director and line producer, Nahid Masud on on-location sound, Rasheed Sharif Shoaib handling background score and sound design, Sharmin Doza as script supervisor and Raza Sumit Rahman as Maizbhandari song music director. \n\t\n\n\t“I have been trying to understand the time we are living in, and this film emerged from that urgency and restlessness,” Gazi said. “It lives in contrast: between timelines, between perception and reality on actual and virtual life, between what’s seen and what’s kept hidden. It reflects on truth, justice, and the continuous battles fought in silence by many. Making this film is both a reckoning and a search for hope.”\n\n\tMerchant added: “‘Shasti’ (Punishment), a modern-day interpretation of Tagore’s short story, will not only leave a lasting impact on the audience but will inspire change through its powerful narrative.”\n\n\tBakshi said: “Working with Leesa Gazi on this adaptation of Tagore’s ‘Shasti’ has been creatively exhilarating. She has an instinctive understanding of character, silence, and moral tension; qualities essential to translating Tagore’s world into cinema. This script is shaping into something truly special, one that honors the emotional complexity of the original while boldly reimagining it for our times.”\n\n\tRahman added: “I always choose the filmmaker before the film. Leesa Gazi is a powerful filmmaker who challenges society through her empathetic storytelling. I can bet on her – this is our second journey together. ‘Shasti’ will be one of the most intense psychological dramas of our time, and I’m incredibly excited to be on board.”\n\n\tA previous adaptation of the story, directed by Chashi Nazrul Islam, was released in Bangladesh in 2004.\n\n\tIftekhar said: “‘Shasti’ offers an unflinching examination of how power, gender and mental health collide with public judgement in contemporary society without offering false resolution. While the film draws inspiration from Tagore, it’s firmly rooted in the visceral reality of present-day Dhaka and speaks to a global landscape shaped by surveillance, social media volatility and institutional silence.”\n\n\tFong added: “‘Shasti’ is a rare gem, an emotional plunge that combines captivating cinematic elements with true values. I am positive that the film will resonate with the audience at large and generate support from film festivals worldwide. As one of the co-producers of ‘Shasti’, I am thrilled with the script and how the tale is told. I am eager to see how Leesa Gazi is taking this classic fable in its modernity to the next level.”\n\n\n\n\t\n\n\t\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Leesa Gazi to Direct Tagore Adaptation ‘Shasti’ Starring Pori Moni, Chanchal Chowdhury (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Leesa-Gazi.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-19T09:58:00.000Z",
      "dateModified": "2026-01-19T09:58:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jessica Rothe SXSW Sci-Fi Thriller ‘Imposters’ Acquired by Blue Finch Films (EXCLUSIVE)",
    "url": "https://variety.com/2026/film/news/jessica-rothe-sxsw-sci-fi-thriller-imposters-blue-finch-1236634187/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Imposters.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-19T10:00:00.000Z",
    "description": "\n\tU.K.-based sales and distribution company Blue Finch Films has acquired worldwide rights to “Imposters,” a sci-fi thriller marking the feature direc",
    "body": "\n\tU.K.-based sales and distribution company Blue Finch Films has acquired worldwide rights to “Imposters,” a sci-fi thriller marking the feature directorial debut of Caleb Phillips. \n\n\tThe film is set to world premiere in the Midnighter section at SXSW 2026. It centers on a couple whose infant son is abducted. When the distraught mother discovers a method to retrieve him, her husband grows increasingly suspicious that the child she’s brought home may not actually be their son.\n\t\n\n\tJessica Rothe (“Happy Death Day”), Charlie Barnett (“Russian Doll”) and Yul Vazquez (“Severance”) star in the project. Phillips, who also wrote the screenplay, previously helmed the short “Other Side Of The Box,” which earned awards at SXSW and BiFan.\n\n\n\tThomas Bond and Sara Seligman are producing through their company Broken Pig Productions, with “Imposters” serving as their first feature. Joe Bandelli of Marylous’ Boys, known for his work on the “Hell House LLC” franchise, is also producing.\n\n\t“‘Imposters’ is a mystery thriller inspired by my parents,” Phillips said. “It explores how much damage two people can do to themselves and the world around them when they refuse to change. I am very happy to be returning to SXSW, I can’t think of a better festival to be premiering my debut feature.”\n\n\tBlue Finch Films’ Mike Chapman called the film “an inventive and thrilling debut from Caleb Phillips, which secures him as an audacious new voice in genre.”\n\n\tThe company’s international slate also includes Rotterdam-selected horror “Bowels Of Hell” and “Dolly,” which premiered at Fantastic Fest.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jessica Rothe SXSW Sci-Fi Thriller ‘Imposters’ Acquired by Blue Finch Films (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Imposters.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-19T10:00:00.000Z",
      "dateModified": "2026-01-19T10:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Prince Harry Arrives at London Court as Privacy Case Against Daily Mail Publisher Kicks Off",
    "url": "https://variety.com/2026/global/news/prince-harry-court-daily-mail-publisher-privacy-case-1236634563/",
    "image": "https://variety.com/wp-content/uploads/2026/01/prince-harry.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-19T10:35:18.000Z",
    "description": "\n\tPrince Harry is set to appear in London’s High Court on Monday as his privacy case against the publisher of U.K. tabloid Daily Mail kicks off.\n\n\tThe",
    "body": "\n\tPrince Harry is set to appear in London’s High Court on Monday as his privacy case against the publisher of U.K. tabloid Daily Mail kicks off.\n\n\tThe Duke of Sussex is one of several big names — including Elton John and his husband David Furnish, Elizabeth Hurley and Sadie Frost — that are taking on Associated Newspapers Limited, alleging that the company engaged in illegal activities like phone-hacking and hiring private investigators to place listening devices inside cars. Associated Newspapers has denied the allegations, according to BBC News, calling them “preposterous.” \n\t\n\n\tHarry is expected to deliver his evidence in court on Thursday, and the trial could last up to nine weeks. It’s his third time taking a major newspaper group to court, having previously sued The Sun owner News Group Newspapers, which settled before trial, as well as The Mirror Group, a case in which he won £140,600 in damages. Harry’s testimony during his 2023 trial against The Mirror Group made history, as he became the first royal in 130 years to testify in court.\n\n\n\tDavid Sherborne is the lawyer representing the seven claimants, while Antony White is defending Associated Newspapers. As it is a civil trial, there is no jury and judge Mr Justice Nicklin will solely determine the outcome of the case. The winner will be awarded financial damages.\n\n\tIn his opening statement, according to BBC News, Sherborne said he will strive to prove that “there was clear, systematic and sustained use of unlawful information gathering at both the Daily Mail and the Mail on Sunday.” He alleged that there is “no way” some of the details reported by the publications — including phone numbers and flight information — could have been obtained lawfully, and that the company allegedly destroyed “masses upon masses” of emails and documents pre-dating 2004. “Journalists and executives across the Mail titles engaged in or were complicit in the culture of unlawful information gathering that wrecked the lives of so many,” the statement alleged.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Prince Harry Arrives at London Court as Privacy Case Against Daily Mail Publisher Kicks Off",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/prince-harry.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-19T10:35:18.000Z",
      "dateModified": "2026-01-19T10:35:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Stanley Kwan, Anthony Chen Among Producers for Hong Kong HAF’s First Lineup of 17 In-Development Projects",
    "url": "https://variety.com/2026/film/markets-festivals/stanley-kwan-anthony-chen-hong-kong-market-projects-1236634171/",
    "image": "https://variety.com/wp-content/uploads/2026/01/HKIFF-Industry-Project-Market.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-19T07:01:00.000Z",
    "description": "\n\tThe Hong Kong International Film Festival Society (HKIFF) has unveiled the initial slate of 17 in-development projects selected for the 24th edition",
    "body": "\n\tThe Hong Kong International Film Festival Society (HKIFF) has unveiled the initial slate of 17 in-development projects selected for the 24th edition of the Hong Kong-Asia Film Financing Forum (HAF), set to take place March 17-19 at the Hong Kong Convention and Exhibition Centre.\n\n\tThe projects, currently in scriptwriting and financing stages, will be presented as part of the HKIFF Industry Project Market, running concurrent with the 30th Hong Kong International Film & TV Market. Additional selections focusing on genre, animation and work-in-progress projects will be announced in coming weeks.\n\t\n\n\tHKIFFS drew from 414 submissions spanning 38 countries and regions for this year’s forum, with Asian entries comprising 82% of the total. Submissions originated from Bangladesh, Cambodia, Hong Kong, India, Indonesia, Japan, Kazakhstan, Macau, Mainland China, Malaysia, Mongolia, Nepal, Pakistan, the Philippines, Singapore, South Korea, Taiwan, Thailand and Vietnam.\n\n\n\tThe lineup showcases emerging talent alongside established industry figures serving as producers. New directors including Sasha Chuk, Story Chen Jianying and Emma Kawawada are featured, while veteran filmmakers Stanley Kwan, Anthony Chen and Shiina Yasushi take on producing roles.\n\n\tAmong the Hong Kong-flavored projects, Chuk and Kwan reunite for “131” following their collaboration on “Fly Me to the Moon,” which played at Tokyo International Film Festival in 2023. The drama follows two masseuses and a construction worker navigating their futures between Shenzhen and Hong Kong.\n\n\tVincci Cheuk, whose “Vital Signs” closed the 2023 HKIFF, teams with Japanese producer Koga Shunsuke on “38.83,” an intergenerational comedy tracking a 38-year-old woman’s unexpected bond with her 83-year-old grandmother during an unavoidable journey. Koga produced “Small, Slow but Steady,” which played at the 2022 Berlinale.\n\t\n\n\tTV series writer-turned-director Cheung Wai-yu collaborates with Peter Yam, producer of Golden Horse Awards winner “Sunny Side of the Street,” on comedy-drama “Mama Mia Let Me Go!” The project centers on a young woman organizing a meeting between her mother and a young beau to escape her restrictive home environment.\n\n\tChan Hing-kai produces Guo Yu-tian’s “Forgetting She is She,” a narrative exploring conflicted identities as a writer mistakes her stalker for her lost sibling, confronting a past involving a long-buried murder.\n\n\tFantasy and absurdist entries include Sanju Surendran’s Malayalam parable “Fishers of Men,” produced by Pramod Sankar, Rajeev Ravi and Kiran Kesav. The project follows an Indian vegetarian banker whose transcendent transformation begins with an inexplicable obsession with fish. Surendran’s “If on a Winter’s Night” screened at Busan in 2025.\n\n\tXu Jianming, whose short “Crow” won Best Live-Action Short Film at Shanghai 2025, presents “Have a Good Trip,” produced by Bi Guangming. The project weaves seven strange tales through eerie small-town characters including a doctor confined to his clinic for decades and a man claiming ants inhabit his ears.\n\n\tSet in Xinjiang, Emetjan Memet’s “The Flower Seller,” produced by Wang Hongwei and Derek Zhang, explores a depressed man’s inner world as whimsical encounters with a flower seller reignite his will to live.\n\n\tProjects examining love and bereavement include “A Drop in the Sea,” produced by Khir-Din Grid and Zhang Fan for Paris-based director Xiao Baer. Zhang produced “Living the Land,” which won the Silver Bear at the 2025 Berlinale. The narrative follows an entrepreneurial Chinese woman traveling to Algeria for her brother’s Muslim funeral, discovering previously unknown aspects of his life.\n\n\tLiza Diño and Ice Seguerra’s feature debut “Funeral Flowers,” produced by Krisma Fajardo, unfolds entirely during a political patriarch’s wake, where his daughter confronts estranged siblings and mistresses amid public spectacle.\n\n\tTakahashi Naoya of Toei Company and Eiko Mizuno-Gray produce Emma Kawawada’s “Life is Yours,” a revenge story featuring an elderly cleaner planning to reclaim her stolen land at a Niseko ski resort. Kawawada’s “My Small Land” played at the 2022 Berlinale.\n\t\n\n\tStory Chen Jianying, whose short “The Water Murmurs” won the Palme d’Or for shorts at Cannes 2022, directs “My Phantom,” produced by Li Xiaoyuan. The project takes its characters on a dreamlike journey through Kyoto as a Chinese writer encounters a man resembling her late fiancé, lost on their wedding day.\n\n\tTIFFCOM chief Shiina Yasushi, alongside Aiken Zou, Zou Lin and Fujita Kanako, produces Fujita Naoya’s “The Funeral March,” highlighting a reclusive woman who steals her mother’s corpse and ventures into Hokkaido’s snowy landscape to fulfill a burial promise. Fujita’s “Confetti” opened the 2023 Skip City International D-Cinema Festival.\n\n\tBorder-themed projects include Yuan Yuan’s debut feature “Heading South,” produced by Wang Jing, introducing a 13-year-old Mongolian girl torn between traditional roots and K-pop dance culture. Wang produced “Are You Lonesome Tonight?,” which screened at Cannes 2021.\n\n\tAnthony Chen, who won the Cannes Camera d’Or for “Ilo Ilo,” produces Tan Ce Ding’s “Somewhere in the South” alongside Edward Lim and Yap Khai Soon. The project centers on an aimless young man caught up in a political campaign during a Malaysian town’s by-election.\n\n\tDastan Zhapar Ryskeldi’s “Stuck Like Babies,” produced by Veronica Rhyme, Fernanda Renno and Florence Stern, follows a hardened Kyrgyz commander forming an unlikely bond with a compassionate Tajik doctor after discovering a baby of unknown nationality at a tense border. Ryskeldi’s “Deal at the Border” screened at Busan 2024.\n\n\tUchiyama Takuya, whose “Numb” won the Special Jury Prize at Tokyo Filmex 2025, adapts Ryohei Machiya’s novel “The Blue Breaks,” produced by Satoh Naomi. The project portrays a Japanese drifter born through sperm donation who gradually reconnects with his surroundings through encounters with strangers and an old lover.\n\n\tJiang Xiaoxuan’s “Vulnerable Observer,” produced by Zhao Ziyang, follows an anthropologist traveling to the Mongolian region for research breakthroughs, only to question her local guide’s initially friendly motives. Jiang won the HKIFF Firebird Award in 2024 for “To Kill a Mongolian Horse.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Stanley Kwan, Anthony Chen Among Producers for Hong Kong HAF’s First Lineup of 17 In-Development Projects",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/HKIFF-Industry-Project-Market.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-19T07:01:00.000Z",
      "dateModified": "2026-01-19T07:01:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "BAFTA to Honor Clare Binns, Creative Director of Picturehouse Cinemas",
    "url": "https://variety.com/2026/film/global/bafta-clare-binns-picturehouse-1236634548/",
    "image": "https://variety.com/wp-content/uploads/2025/05/bafta-award-placeholder.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-19T09:48:10.000Z",
    "description": "\n\tClare Binns, the creative director of film exhibition company Picturehouse Cinemas and its distribution arm Picturehouse Entertainment, will be pres",
    "body": "\n\tClare Binns, the creative director of film exhibition company Picturehouse Cinemas and its distribution arm Picturehouse Entertainment, will be presented with BAFTA’s Outstanding British Contribution to Cinema Award at the BAFTA Film Awards next month.\n\n\tThe award is presented to an individual or organization that has “made a significant and inspiring contribution to film through a particular project or work.”\n\n\n\tBAFTA said, “Over the last four decades and counting, Clare has built an exceptional reputation amongst the British film industry for championing diverse and fiercely independent work on big screens around the U.K.”\n\t\n\n\tIt added, “Clare has spearheaded countless initiatives to bring new audiences into cinemas and put them at the heart of their local communities, such as programming relaxed, parent and baby, over sixties, and dog-friendly screenings.\n\n\t“She has also overseen an increase in Picturehouse’s outreach, including collaborations with Brixton Soup Kitchen and Poetic Unity at The Ritzy CInema. Additionally, under her leadership, Refuge, the U.K.’s leading charity for victims of domestic violence, became Picturehouse’s charity partner, regularly holding fundraisers and raising awareness of their work.”\n\n\tEmily Stillman, BAFTA chair of the Film Committee, said: “Clare Binns’ impact on the British film industry is profound – she is a hugely talented and beloved visionary. Clare’s unwavering commitment to bring a diverse range of storytelling to the big screen, her belief in the power of cinema, and her ongoing work championing emerging independent filmmakers, is inspirational.”\n\t\n\n\tBinns said: “I was totally blown away when I heard that I was getting this award. I’m so thrilled not just for myself but for everyone who has worked with me throughout my career and for those who continue to support the mission to welcome audiences into local cinemas across the U.K., who are just getting on with the job of giving film the home it deserves.”\n\n\tBinns’ career in film began as a movie theater usher in the early 1980s. Working her way up to projectionist and then manager at the Ritzy Cinema in London, she went on to operate a network of U.K. movie theaters under Zoo Cinemas before joining Picturehouse in 2003.\n\n\tThroughout her leadership roles at Picturehouse, she has “deftly balanced a passion for film culture and commercial interests – showcasing blockbusters alongside arthouse films whilst boldly steering one of the U.K.’s leading cinema and distribution companies through an ever-changing industry landscape,” BAFTA said.\n\n\tShe has also been “a driving force in bolstering the U.K. film festival circuit,” forging a partnership with Sundance in London before establishing its successor Picturehouse Create. Outside of London, she has supported establishing several Picturehouse cinemas as key venues within local and international film festivals.\n\n\tThe BAFTA Film Awards ceremony will be hosted by Alan Cumming on Feb. 22.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "BAFTA to Honor Clare Binns, Creative Director of Picturehouse Cinemas",
      "image": [
        "https://variety.com/wp-content/uploads/2025/05/bafta-award-placeholder.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-19T09:48:10.000Z",
      "dateModified": "2026-01-19T09:48:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Guess Who This Bronx Boy Turned Into!",
    "url": "https://www.tmz.com/2026/01/19/guess-who-bronx-boy-turned-into/",
    "image": "https://imagez.tmz.com/image/1c/16by9/2026/01/14/1cc926dda84e4ef09482f5fa857ca44b_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-19T08:01:19.000Z",
    "description": "\n    \n                    \n                          Guess Who This\n                          Bronx Boy\n                          Turned Into!\n       ",
    "body": "\n    \n                    \n                          Guess Who This\n                          Bronx Boy\n                          Turned Into!\n                      \n                  \n                                                                        Published \n                              January 19, 2026\n                            12:01 AM PST\n                                                                            \n      \n    \n          Before this fun kid from The Bronx turned into a comedian, he was just playing basketball and singing in the chorus!\n      \n    \n          He's best known for his role on \"Parks and Recreation\" ... as well as \"House of Lies.\" He's the voice behind Dewey Duck! Oh, and don't forget about \"Sonic the Hedgehog!\"\n      \n    \n          Can you guess who he is?\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                TV\n              \n                          \n                Movies\n              \n                          \n                Guess Who\n              \n                          \n                Kids\n              \n                          \n                celebrity kids\n              \n                          \n                Photo Galleries\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Guess Who This Bronx Boy Turned Into!",
      "image": [
        "https://imagez.tmz.com/image/1c/16by9/2026/01/14/1cc926dda84e4ef09482f5fa857ca44b_xl.jpg"
      ],
      "datePublished": "2026-01-19T08:01:19.000Z",
      "dateModified": "2026-01-19T08:01:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Emmie Bunni Offers $10.2M For Logan Paul's Rare Pokémon Card",
    "url": "https://www.tmz.com/2026/01/18/emmi-bunnie-offers-10-2m-for-logan-pauls-pokemon-card/",
    "image": "https://imagez.tmz.com/image/ea/16by9/2026/01/18/eaf6034093ba4d44a9d632e7b241098c_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-19T02:41:09.000Z",
    "description": "\n    \n                    \n                          Gotta Bid 'Em All!!!\n                          Emmie Bunni Offers Logan Paul $10.2M For Pokémon C",
    "body": "\n    \n                    \n                          Gotta Bid 'Em All!!!\n                          Emmie Bunni Offers Logan Paul $10.2M For Pokémon Card\n                      \n                  \n                                                                        Published \n                              January 18, 2026\n                            6:41 PM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          OnlyFans star Emmie Bunni apparently made Logan Paul an offer he COULD refuse ... the influencer-turned-pro-wrestler has so far neglected to accept $10.2 million from Emmie for his rare Pokémon card.\n      \n    \n          It might sound crazy, but LP bought the PSA 10 Pikachu Illustrator card in 2022 for more than $5 million, and he apparently believes he can get more than Emmie's generous offer.\n      \n    \n      \n        \n              \n    \n    \n          But he's not wrong ... bidding for the card at Goldin Auctions has already climbed past $6 million and he has weeks before the auction officially closes.\n      \n\n          In a press release, EB explained, \"I offered Logan two times what it is being bid at auction for right now, $10.2 is a LOT for a Pokémon card, but it has true meaning to me, I think it took Logan a minute, but ultimately he did not want to pull from auction.\"\n      \n    \n          She added ... \"The max I will bid is 10.2M, not a penny more.\"\n      \n    \n          Well... good to know she has a strict budget!\n      \n    \n      \n        \n              \n    \n    \n          \"It’s only six months of OnlyFans,\" Emmie said. \"But this card is history. You don’t hesitate when something like this comes up.\"\n      \n    \n          According to Emmie, if she was the lucky winner, she'd give the card to her dad, who got into collecting Pokémon cards in the first place.\n      \n    \n          The card -- graded GEM MT 10 -- is widely considered the rarest and most valuable Pokémon card in existence.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Logan Paul\n              \n                          \n                TV\n              \n                          \n                Reality TV\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Emmie Bunni Offers $10.2M For Logan Paul's Rare Pokémon Card",
      "image": [
        "https://imagez.tmz.com/image/ea/16by9/2026/01/18/eaf6034093ba4d44a9d632e7b241098c_xl.jpg"
      ],
      "datePublished": "2026-01-19T02:41:09.000Z",
      "dateModified": "2026-01-19T02:41:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Karley Scott Collins Slams Rumors She's Dating, Moved In With Keith Urban",
    "url": "https://www.tmz.com/2026/01/18/karley-scott-collins-shoots-down-keith-urban-rumors/",
    "image": "https://imagez.tmz.com/image/04/16by9/2026/01/18/04c65a8b71d44d4fb3ff22e2546f9554_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-19T01:10:42.000Z",
    "description": "\n    \n                    \n                          Karley Scott Collins\n                          Y'all... I Am Not Dating Keith Urban!!!\n          ",
    "body": "\n    \n                    \n                          Karley Scott Collins\n                          Y'all... I Am Not Dating Keith Urban!!!\n                      \n                  \n                                                                        Published \n                              January 18, 2026\n                            5:10 PM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Karley Scott Collins has had it up to here with the gossip! The rising country singer took to Instagram Sunday to shoot down rumors she's dating Keith Urban.\n      \n    \n          Karley responded to an article speculating whether KU moved in with her, writing ... \"Yall, this is absolutely RIDICULOUS and untrue.\"\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Rumors of a blossoming relationship between them started circulating just weeks after Keith's divorce from Nicole Kidman was finalized.\n      \n\n          The estranged couple was married for 19 years before calling it quits.\n      \n    \n          Since the split, KU has also been linked to his guitarist Maggie Baugh ... but those rumors were shot down as well.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Maggie's friend, singer Alexandra Kay, told the \"Taste Of Country\" podcast the rumors were \"absolutely not true.\"\n      \n    \n          She insisted, \"I've met her boyfriend. She's very happy and she has nothing to do with that whole relationship.\"\n      \n    \n          TMZ broke the news ... Nicole and Keith's split was something they'd been discussing privately for months before she pulled the trigger on divorce.\n      \n    \n          They separated in June, and we were told she wanted to save the marriage, although by all accounts, Keith did not.\n      \n    \n          The couple married back in 2006 and share 2 kids, ages 17 and 15.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Keith Urban\n              \n                          \n                Nicole Kidman\n              \n                          \n                Celebrity Divorce\n              \n                          \n                Music\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Karley Scott Collins Slams Rumors She's Dating, Moved In With Keith Urban",
      "image": [
        "https://imagez.tmz.com/image/04/16by9/2026/01/18/04c65a8b71d44d4fb3ff22e2546f9554_xl.jpg"
      ],
      "datePublished": "2026-01-19T01:10:42.000Z",
      "dateModified": "2026-01-19T01:10:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Guess Who This Former Pro Wrestler Is!",
    "url": "https://www.tmz.com/2026/01/18/guess-who-former-pro-wrestler/",
    "image": "https://imagez.tmz.com/image/cd/16by9/2026/01/12/cd262c4e14c846a3b4dde30577e5c2f9_xl.png",
    "tag": "Entertainment",
    "date": "2026-01-18T20:00:29.000Z",
    "description": "\n    \n                    \n                          Guess Who\n                          This Former Professional Wrestler Is!\n                      \n",
    "body": "\n    \n                    \n                          Guess Who\n                          This Former Professional Wrestler Is!\n                      \n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          Some guys have plenty of confidence in their old friends ... can you guess who this former professional wrestler is?\n      \n    \n          We ran into this dude while he was signing autographs and asked him if he had any advice for his old pal John Cena as he prepared to leave the ring behind ... but he was confident his buddy had a pretty bright future outside of wrestling.\n      \n    \n          And don't worry about him, because he's staying busy, too ... sharing the screen with Jason Momoa doesn't sound like an easy feat, though!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Wrestling\n              \n                          \n                Movies\n              \n                          \n                Guess Who\n              \n                          \n                MMA\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Guess Who This Former Pro Wrestler Is!",
      "image": [
        "https://imagez.tmz.com/image/cd/16by9/2026/01/12/cd262c4e14c846a3b4dde30577e5c2f9_xl.png"
      ],
      "datePublished": "2026-01-18T20:00:29.000Z",
      "dateModified": "2026-01-18T20:00:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Guess Who This Strong-and-Silent-Type Star Is!",
    "url": "https://www.tmz.com/2026/01/18/guess-who-strong-silent-type-star/",
    "image": "https://imagez.tmz.com/image/ae/16by9/2026/01/13/ae67b527570248abb36ff0234f13f7ef_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-19T00:00:40.000Z",
    "description": "\n    \n                    \n                          Guess Who\n                          This Strong-And-Silent-Type Star Is!\n                      \n ",
    "body": "\n    \n                    \n                          Guess Who\n                          This Strong-And-Silent-Type Star Is!\n                      \n                  \n                                                                        Published \n                              January 18, 2026\n                            4:00 PM PST\n                                                                            \n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          Some stars out there are just too cool for school ... can you guess who this strong-and-silent-type celeb is?\n      \n    \n          We caught up with this actor back in 2017 and peppered him with a few jovial questions, but he just smiled and kept on cruising ... he must've had somewhere important to be.\n      \n    \n          Granted, we did make him laugh a couple of times ... so the guy's not all work and no play!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Movies\n              \n                          \n                Guess Who\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Guess Who This Strong-and-Silent-Type Star Is!",
      "image": [
        "https://imagez.tmz.com/image/ae/16by9/2026/01/13/ae67b527570248abb36ff0234f13f7ef_xl.jpg"
      ],
      "datePublished": "2026-01-19T00:00:40.000Z",
      "dateModified": "2026-01-19T00:00:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]