[
  {
    "title": "Gretchen Rossi Not Returning for ‘The Real Housewives of Orange County’ Season 20 — Everyone Else Back Except Katie Ginella (Yes, Including Tamra Judge!)",
    "url": "https://variety.com/2026/tv/news/gretchen-rossi-not-returning-rhoc-season-20-tamra-judge-will-1236627879/",
    "image": "https://variety.com/wp-content/uploads/2026/01/GretchenRossi.REUNION.jpg?w=594&h=419&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-28T03:36:15.000Z",
    "description": "\n\tWith “The Real Housewives of Orange County” gearing up to begin production on its history-making 20th season — a landmark for the Bravo franchise th",
    "body": "\n\tWith “The Real Housewives of Orange County” gearing up to begin production on its history-making 20th season — a landmark for the Bravo franchise that changed popular culture as we know it — its cast is taking shape, and Gretchen Rossi will not be in the ensemble, Variety has learned.\n\n\tSeason 20 is set to begin filming soon, and minus Rossi, the rest of the 19th season’s cast is expected to remain intact, minus one other: On Jan. 9, Katie Ginella posted on Instagram to say that she’d been fired, writing, “After two seasons as a cast member on RHOC, the network has decided to move forward with Season 20 without me.” Ginella’s ouster was not unexpected, after a disastrous season in which she was caught in a number of lies — about having made an illicit recording of fellow castmate Shannon Beador the previous season, and appearing to have spread information about the show and the cast to Bravo content creators. After failing a lie detector test on camera, Ginella more or less stopped filming, seemingly at the producers’ insistence. Ginella was the first Asian American woman to be cast on “The Real Housewives of Orange County.”\n\t\n\n\tRossi had returned to “The Real Housewives of Orange County” with some fanfare, as a “friend” of the cast, seemingly being brought in as a foil to her arch-nemesis Tamra Judge. Rossi was a full-time cast member from Seasons 4-8, and had always clashed with Judge: a situation that had grown worse in Rossi’s years off the show as the two of them continued to feud off-camera. Their enmity did continue to play out throughout Season 19, but Judge — who had a horrendous season for personal reasons, and quit the show several times while being filmed — gained the upper hand in the finale when her vessel Gina Kirschenheiter brought up an infamous Twitter thread from 2023 that catalogued screenshots of Rossi’s transphobic, anti-abortion and anti-vaccine posts on social media. Rossi’s reaction to the sudden introduction of this topic at the cast’s final dinner in Amsterdam was bizarre, and she gave the impression she was in a fugue state — and sort of denied liking the posts, but not really. During the show’s reunion episodes, she put up more of a fight, and tried to turn the tables on Judge by saying she’d hired a cyber analyst who tied something on social media (it wasn’t clear) to Judge, but she didn’t produce any receipts either during the reunion or later on Instagram, and her allegations didn’t stick.\n\t\n\n\tAnd Judge will return for Season 20, despite her behavior as the previous season filmed: She’s been saved because of the storyline potential that comes from reuniting the now-splintered “tres amigas,” which consisted of Judge, Beador and Vicki Gunvalson. “Real Housewives” executive producer Andy Cohen offered Gunvalson, the “OG of the OC,” an orange on stage at BravoCon in November, fittingly making her the first cast member of Season 20. It seems that the trio of former besties — who exist in various states of conflict, always — must be allowed to enact their psychodramas on camera.\n\n\tAs for the rest of the cast, despite speculation in the Bravosphere about a more major overhaul, the remaining Season 19 group will be back, with (a newly engaged) Kirschenheiter, Emily Simpson, Heather Dubrow and Jennifer Pedranti alll returning for Bravo’s milestone 20th season.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Gretchen Rossi Not Returning for ‘The Real Housewives of Orange County’ Season 20 — Everyone Else Back Except Katie Ginella (Yes, Including Tamra Judge!)",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/GretchenRossi.REUNION.jpg?w=594&h=419&crop=1"
      ],
      "datePublished": "2026-01-28T03:36:15.000Z",
      "dateModified": "2026-01-28T03:36:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘I Play Rocky’ Lands Thanksgiving Release Date, Timed to ‘Rocky’ 50th Anniversary",
    "url": "https://variety.com/2026/film/news/i-play-rocky-release-date-anthony-ippolito-amazon-mgm-1236642871/",
    "image": "https://variety.com/wp-content/uploads/2025/10/I-play-Rocky-Anthony-Ippolito.jpg?crop=0px%2C41px%2C1200px%2C675px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-01-28T02:07:16.000Z",
    "description": "\n\tAmazon MGM has scheduled “I Play Rocky” for a splashy Nov. 20 release following a limited debut on Nov. 13, Variety has confirmed. The premiere come",
    "body": "\n\tAmazon MGM has scheduled “I Play Rocky” for a splashy Nov. 20 release following a limited debut on Nov. 13, Variety has confirmed. The premiere comes just in time for the Thanksgiving holiday, one of the busiest times for moviegoing. The 50th anniversary of the original Oscar-winning boxing drama is on Nov. 21.\n\n\tThe film is a retelling of the creation of “Rocky” that doubles as a Sylvester Stallone biopic. Anthony Ippolito headlines as a young Stallone, starring alongside Stephan James as Carl Weathers, who played Rocky’s arch rival Apollo Creed, as well as AnnaSophia Robb, Matt Dillon, P.J. Byrne, Tracy Letts and Jay Duplass.\n\t\n\n\tBefore the release of “Rocky,” Stallone was far from the stonefaced blockbuster machine he eventually bulked into. At 29, Stallone was a struggling actor with a partially paralyzed face and a speech impediment. The “Rocky” script, which he authored, was his ticket to the big time, and he refused to sell the rights unless he was cast in the lead. He turned down six-figure deals for the film and eventually funded production for less than $1 million. The film became an underdog phenomenon following its 1976 release, grossing over $200 million at the worldwide box office and winning best picture at the 1977 Academy Awards.\n\n\n\t“Green Book” director Peter Farrelly helms “I Play Rocky” from a screenplay by Peter Gamble. Farrelly also serves as producer alongside former Warner Bros. film chief Toby Emmerich and Christian Baha. FilmNation Entertainment handled production services and international sales.\n\n\t“When I first read Peter Gamble’s energetic and poignant script, I knew it captured something very special,” Baha said upon the film’s 2024 reveal. “The story of ‘I Play Rocky’ is as unique as Sylvester Stallone himself, a seeming Everyman with an undeniable gift who needs to share it with the world and refuses to take ‘no’ for an answer.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘I Play Rocky’ Lands Thanksgiving Release Date, Timed to ‘Rocky’ 50th Anniversary",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/I-play-Rocky-Anthony-Ippolito.jpg?crop=0px%2C41px%2C1200px%2C675px&resize=1000%2C563"
      ],
      "datePublished": "2026-01-28T02:07:16.000Z",
      "dateModified": "2026-01-28T02:07:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Alex Cooper Sets Surprise Podcast Special With K-Pop Star Rosé Ahead of the Grammys",
    "url": "https://variety.com/2026/digital/news/alex-cooper-podcast-special-rose-grammys-1236642713/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Alex-Cooper-x-Rose.png?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-28T00:00:00.000Z",
    "description": "\n\tAlex Cooper, host of “Call Her Daddy,” is launching a two-hour podcast special featuring global music superstar Rosé.\n\n\t“Alex Cooper Presents: A Gra",
    "body": "\n\tAlex Cooper, host of “Call Her Daddy,” is launching a two-hour podcast special featuring global music superstar Rosé.\n\n\t“Alex Cooper Presents: A Grammys Special (ft. Rosé)” will premiere across podcast platforms including YouTube, Spotify, Apple Podcasts and SiriusXM on Wednesday, Jan. 28, at 5 a.m. ET/2 a.m. PT. \n\n\tIn the special, Cooper interviews Rosé in various locations across Asia — including a cafe in Seoul; at a traditional pocha lunch; in Rosé’s recording studio (reinvented as a “Call Her Daddy” set); at a karaoke stall; and in a lounge in Tokyo. Rosé, a member of Korean girl group Blackpink, was named Variety’s Global Hitmaker of the Year in 2025.\n\t\n\n\tRosé received three Grammy nominations for the 68th Annual Grammy Awards for her hit song “APT.” with Bruno Mars: record of the year, song of the year and pop duo/group performance. In addition, “F1 The Album,” featuring her song “Messy,” received a nomination for compilation soundtrack for visual media. The 2026 Grammy Awards are slated to air on CBS and Paramount+ on Sunday, Feb. 1, starting at 8 p.m. ET/5 p.m. PT, live from L.A.’s Crypto.com Arena.\n\n\n\tCooper’s special with Rosé is the latest “Call Her Daddy” special programming event. In November, the show produced a special episode in partnership with ABC in which Mark Ballas and Whitney Leavitt of “Dancing With the Stars” performed their final freestyle. In September, also in partnership with ABC, Taylor Frankie Paul was announced as the next star of “The Bachelorette” during an exclusive reveal on “Call Her Daddy.”\n\n\t“Call Her Daddy,” touted as the most-listened-to podcast by women, is produced by Cooper under her company’s Unwell Network banner. In 2024, she inked a three-year distribution and advertising deal with SiriusXM worth at least $100 million, replacing her previous pact with Spotify.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Alex Cooper Sets Surprise Podcast Special With K-Pop Star Rosé Ahead of the Grammys",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Alex-Cooper-x-Rose.png?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-28T00:00:00.000Z",
      "dateModified": "2026-01-28T00:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘The Only Living Pickpocket in New York’ Review: John Turturro Will Steal Your Heart in Noah Segan’s Elegantly Tender Character Study",
    "url": "https://variety.com/2026/film/reviews/the-only-living-pickpocket-in-new-york-review-1236642486/",
    "image": "https://variety.com/wp-content/uploads/2026/01/The-Only-Living-Pickpocket-in-New-York-Critics-Pick.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-28T03:00:00.000Z",
    "description": "\n\tA melancholic affection for New York City permeates writer-director Noah Segan’s nostalgia-powered “The Only Living Pickpocket in New York,” a minor",
    "body": "\n\tA melancholic affection for New York City permeates writer-director Noah Segan’s nostalgia-powered “The Only Living Pickpocket in New York,” a minor-key character study that quietly mourns a bygone era, when life was analog, and so were its criminals. Bookended by two pitch-perfect needle drops that signify every New Yorker’s complex emotions about their city (LCD Soundsystem’s “New York, I Love You but You’re Bringing Me Down” and the Bobby Short version of “I Happen to Like New York”), longtime actor Segan’s sophomore feature feels like a warm embrace in defiance of an increasingly cold world that has lost its manners, along with the tactile elements worth holding onto.\n\t\n\n\tOften accompanied by a groovy, ’70s-style score of the Lalo Schifrin jazz-funk variety, the 60-something Bronx man Harry is certainly trying his darndest to maintain some semblance of that past. Played by John Turturro in a mesmerizingly tender performance, Harry lovingly cares for his disabled, nonverbal wife Rosie (Karina Arroyave) and wrestles his way through the stuffed subway cars of the Big Apple in search of cash and valuables to lift as a pickpocket with old-school skills, while being increasingly confronted by harsh contemporary realities where an average person no longer carries cash or wears heirloom timepieces.\n\n\n\tThe most Harry can swipe these days is a slim wallet here or an iPhone there — a traceable nuisance that isn’t all that lucrative to sell to his longtime partner-in-crime and good friend Ben (Steve Buscemi, in his wonderfully acerbic mode), a pawn shop owner as perplexed by the techy gluten-free kids of today as his pal. He makes an exception for his savvy daughter Eve (Victoria Moroles), one of the good ones, who helps out her dad and treats Harry like family.\n\t\n\n\tIn an ingenious prologue, “Pickpocket” starts with the daily grind of New York, following a white-collar man through his morning routine and workday, until he can’t locate his wallet to pay for a business meal. That’s because he’s just been one of the countless New Yorkers who had the misfortune of standing right next to Harry in a subway car earlier, an instance we only briefly witness with Harry being just another face amid the rush hour.\n\n\tExcept, it’s hard not to notice Harry if we’re being honest, not when he’s wrapped in an instantly iconic cashmere overcoat that matches his salt-and-pepper hair and feels as essential and character-based a choice of outerwear as Alain Delon’s “Le Samouraï” trench. The coat looks expensive (and is expensive, having been made by Ermenegildo Zegna as eagle-eyed viewers will notice), but far from unrealistic an item for the otherwise modest Harry, who doesn’t even have a mobile device to own. \n\n\tThat’s because Harry believes in things that last — as such, the coat invites us to imagine that he’s owned and cared for it for some time. Plus, investing in good clothes isn’t a bad idea for a street thief like Harry, who should want to evade suspicion. He hasn’t always been successful at dodging trouble — that much we pick up from his close relationship with Detective Allan Warren (Giancarlo Esposito, in a gently pensive register).\n\n\tSoon enough, Harry messes with the wrong sort, stealing from a wealthy and well-connected Gen-Z kid from a shady crime family — not that he realizes it at the time. He is the flashy Dylan (an impressive Will Price), comically dressed in an overpriced and oversized tracksuit, versus Harry’s old-world elegance. It doesn’t take long for him to figure out Harry’s whereabouts, once Harry and Ben naively plug in the USB card Harry finds in Dylan’s wallet. (Harry is so clueless about these technological advancements that he can’t even spell USB properly, the kind of comedic flourish Segan’s script leans into.) Once cornered, Harry has no choice but to retrieve the card — he might not be able to save his own life, but he can save his wife’s.\n\n\tHarry’s trek across all five boroughs of New York City gives us a unique taste of the sprawling town that’s been a playground for many legendary films and filmmakers. In that, the New York of “Pickpocket” isn’t the picturesque Central Park, charming brownstone blocks or imposing highrises. Not unlike Sean Baker’s “Anora,” this film navigates and caresses the overlooked corners of arguably the most popular movie town in cinema history, while lamenting an old way of being in urban spaces. \n\t\n\n\tThat means asking for directions instead of using GPS, relying on the generosity of strangers and looking up and around instead of touchscreen scrolling. Along the way, Harry’s race against the clock gradually shifts into a journey of reconciliation, even self-discovery, especially when he takes a detour to visit his estranged daughter Kelly (a scene-stealing Tatiana Maslany) in Queens. The scene plays like a thoughtful aside, giving us just enough (but not too much) backstory, like the rest of the well-calibrated script that leaves some room for audience imagination.\n\n\tThere are some frisky reveals throughout the last act of “Pickpocket,” bouncily assembled by editor Hilda Rasula, as well as a quietly playful cameo by an A-lister as the formidable matriarch of Dylan’s family. But across all of its humor-filled touches, “Pickpocket” mostly preserves its bittersweet, gloomy tone across its economic runtime, a temperament matched by Sam Levy’s beautifully elegiac cinematography. It’s the kind of unapologetically local love letter to the Big Apple and its less-illustrious denizens that New York deserves.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘The Only Living Pickpocket in New York’ Review: John Turturro Will Steal Your Heart in Noah Segan’s Elegantly Tender Character Study",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/The-Only-Living-Pickpocket-in-New-York-Critics-Pick.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-28T03:00:00.000Z",
      "dateModified": "2026-01-28T03:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘When a Witness Recants’ Review: A Powerful Documentary Uses Animation and New Interviews to Redraw a Decades-Old Injustice",
    "url": "https://variety.com/2026/film/news/when-a-witness-recants-review-1236639259/",
    "image": "https://variety.com/wp-content/uploads/2026/01/When-a-Witness-Recants.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-28T02:45:00.000Z",
    "description": "\n\tIn Dawn Porter’s powerful documentary “When A Witness Recants,” Ta-Nehisi Coates presents — both as an executive producer and occasional subject — a",
    "body": "\n\tIn Dawn Porter’s powerful documentary “When A Witness Recants,” Ta-Nehisi Coates presents — both as an executive producer and occasional subject — a stirring tale of American injustice, which he remembers from his high school days. The story of three Black teenage boys falsely convicted of murdering their classmate (and subsequently sentenced to life), the movie spans several decades, functioning as both an archival portrait of Baltimore in the 1980s and a retroactive true-crime investigation. However, its conclusions are entirely unexpected, and entirely devastating.\n\t\n\n\tThe film is based on Jennifer Gonnerman’s 2021 New Yorker article of the same name, which opens with the harrowing details of a shooting in the hallways of Harlem Park Junior High, in which 14-year-old DeWitt Duckett was killed in a robbery gone wrong. Porter, on the other hand, expands her view of the case by having Coates set the cultural stage from the top down, through his memories of growing up in Maryland and his recollections of community. This also serves as an introduction to several of the movie’s key players, including the aggrieved trio of wrongful suspects — Alfred Chestnut, Andrew Stewart and Ransom Watkins — now men in their 50s, finally out from behind bars. \n\n\n\tThe movie doesn’t play coy about this outcome, nor does it allow Coates to overstay his welcome as a distant observer to their case. Instead, Coates and Porter hand the trio the reins of the story. They’re allowed to finally take control of their own narratives through the movie’s skillfully cross-cut interviews (one of which begins with the stirring image of an empty seat; Duckett’s absence looms large over all their lives).\n\t\n\n\tIn the meantime, legal depositions from 2022, both with Black witnesses to the crime and its white key investigator, function as secondary interview sources and also allow those involved to either confess their roles in this miscarriage of justice or deny it outright. Eventually, this bifurcated structure, focused on the recent present, gives way to a story of time and place, rendered with moods both wistful and agonizing, as news footage and archival videos from 1983 gradually become the film’s new lingua franca. For every bit of story that isn’t readily available, Porter employs (en lieu of live-action reenactments) the talents of Philadelphia comic book artist Dawud Anyabwile, whose stark black-and-white motion comics depict the accused trio — and the teens manipulated to testify against them — as young boys placed in impossible predicaments, their respective futures hanging in the balance.\n\n\tAs one might gauge from these descriptions, Porter takes a multitude of visual approaches, but they each end up justified, given the sheer temporal and emotional expanse the movie has to cover. One recollection at a time, “When a Witness Recants” reverse-engineers its subjects’ present predicaments by revisiting enraging details of the case and the way Chestnut, Stewart and Watkins first came under the police’s microscope (which is to say: all but randomly). There’s barely any mystery to all the wrongdoings and witness tampering, and no factual gray area in which the movie can dabble. It isn’t interested in relitigating a case that has already been reopened and closed, albeit several decades too late.\n\n\tInstead, Porter’s interests lie in the enormous emotional toll of these events, both on the trio themselves — dubbed the “Harlem Park Three,” like the similarly wrongfully convicted “Central Park Five” — and on one of the witnesses forced to testify falsely against them at the time, their classmate Ron Bishop. These ripple effects are captured with dramatic rigor, from the anguish of their families in the aftermath, to their own survival mechanisms in the years that followed (both in prison and outside its walls). However, just as intriguing as what each man readily shares is that which they hold close to the chest, and the many visual details that go unremarked upon by the film and its narrations.\n\t\n\n\tWe as viewers are left to draw our own conclusions from the trio’s matching “HP3” necklaces (are they bonded, in some manner, by their shared trauma, perhaps in ways they may not recognize?) and from the fleeting courtroom sketches from their trials, which depict them as hulking, dangerous adults, despite being 16 years of age, and meek of stature. The framing and trying of young Black boys as adults in the United States is a continued iniquity and may have even contributed to their conviction at the time. No one in the film comes right out and says it, but Anyabwile’s sketches practically work to rehumanize them in the face of a society and systems that once robbed them of everything from their youth to the benefit of doubt to the promise of their respective futures.\n\n\tWhat is perhaps the movie’s narrative masterstroke is that even once it approaches the temporary catharsis of the men’s case being overturned, it doesn’t stop there. Instead, its extended final act follows not only their lives in the aftermath of decades behind bars, but the shattering lack of closure over what was done to them, in the form of a filmed confrontation that allows them much-needed release. To contextualize this story as justice delayed, or finally delivered, would be a betrayal of what the trio was forced to endure. Even the most joyful moments of “When a Witness Recants” are framed within its larger tale of justice denied, making it a thorough and affecting work of nonfiction cinema.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘When a Witness Recants’ Review: A Powerful Documentary Uses Animation and New Interviews to Redraw a Decades-Old Injustice",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/When-a-Witness-Recants.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-28T02:45:00.000Z",
      "dateModified": "2026-01-28T02:45:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Give Me the Ball!’ Review: Ferociously Entertaining Portrait of Billie Jean King as Athletic Superstar and Culture Hero",
    "url": "https://variety.com/2026/film/reviews/give-me-the-ball-review-billie-jean-king-1236642520/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Billie-Jean-King.jpg.webp?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-28T02:27:57.000Z",
    "description": "\n\t“Give Me the Ball!,” the title of Liz Garbus and Elizabeth Wolff’s ferociously inspirational and entertaining documentary about Billie Jean King, re",
    "body": "\n\t“Give Me the Ball!,” the title of Liz Garbus and Elizabeth Wolff’s ferociously inspirational and entertaining documentary about Billie Jean King, refers to something that the fabled tennis superstar would say repeatedly when she was growing up. King, born in Long Beach, California, in 1943, was raised in a 1950s world where girls weren’t supposed to want to play sports. But King was such a natural-born athlete that she wanted to play all of them. Football, baseball — whatever the game, she’d say, “Give me the ball!” When a friend of hers told her that she should try tennis, King had never even heard of it. She asked what the sport involved, and when the answer was running, jumping, and hitting a ball, her response was: I’m in.\n\t\n\n\tNone of this may sound like a big deal. But what it captures is that from the very beginning, Billie Jean King’s relationship to sports was primal. She wanted — needed — the ball, to throw it and hit it, to throw her whole body into the action (even as her mother was telling her that that’s not what a “lady” does). And that’s the kind of tennis player she became. She was all over the court, charging at the ball from every corner, but fundamentally she was a power hitter who would come up close to the net, smashing the ball, then doing it again, wearing her opponent down with the relentlessness of her attack. In the ’60s and early ’70s, when King wasn’t just playing tennis but blazing trails (athletic, financial, cultural), she was thought of as a woman who played tennis “like a man.” Her aggression was in every way a game-changer.\n\t\n\n\tWhat “Give Me the Ball!” shows you is that Billie Jean King turned what she wanted into a mission. That’s how she became so much more than a tennis superstar; she became a culture hero as important as Muhammad Ali. Almost singlehandedly, she planted the idea on the map that women, like men, should be paid for playing tennis (when she started, they were not), and also — radical notion! — that they should make the same amount of money that men did. The world has changed so much since then that it’s hard to describe how heretical that idea seemed at the time. King fought for it not because she set out to be an “activist,” but because it simply made no sense to her that star female athletes wouldn’t be compensated for doing the same thing that star male athletes did. This wasn’t about box office. (In tennis, the women were sometimes bigger draws than the men.) It was about second-class citizenship. And her attack on that system played out the same way that her game did on the court: She was relentless. She smashed the opposition. She was going to win the fight — and did — because she was hard-wired to win it.\n\n\tThe movie is built around a freewheeling interview with King today, who unfurls the saga of her life. She’s 82 now, and the filmmakers frame her in a single head-on shot. She’s wearing fuchsia horn-rims and a teal athletic jacket, and what gives the documentary its unique pulse is that King has the energized articulation of a woman decades younger than her years. She’s warm and laceratingly honest, with a ripe sense of humor, and she speaks in rich percussive sound bites, which the filmmakers employ in a nearly musical way, cutting back and forth, often rapidly, between King’s words and clips of the story she’s telling. We feel like we’re inside her head, and the footage itself is extraordinary.\n\n\t“Give Me the Ball!” tells King’s whole story, opening with a kaleidoscopic blast ahead to 1973, when she was at the height of her powers but everything in her existence — her athletic genius, her war for equal pay, her messy personal life — was coming to a head. The footage of her in action on the court looks more astonishing than ever. The sheer force of her playing was embodied in moves of extraordinary elegance; she was like a dancer. And that quality of hers was abetted by something that most tennis champions don’t have: a charisma on the level of a movie star. She was beautiful, like Diane Keaton’s jock sister, and that thick shag haircut of hers was singular — it made her look as iconic and electrifying as David Bowie in his “Aladdin Sane” days.\n\t\n\n\tGarbus and Wolff take us through her life in a way that’s both propulsive and reflective, mirroring King’s energy on the court. The drama never lets up, from her days as a girl named Billie Jean Moffitt who couldn’t afford tennis lessons but attended the free youth clinics available in Long Beach, even as she was competing with the rich kids who populated the sport; to the way that she declared early on — she simply decided — that she was going to be the number-one female tennis player in the world; to her rise in the ’60s, when she became a champion yet still couldn’t make a living at it; to her heroic, exhausting, no-holds-barred fight for the establishment of prize money, which meant going out and finding sponsors; to her voluminous tournament wins; to her marriage to a man named Larry King, who became her loving supporter and business partner, even as they fell apart when she began to discover her sexual identity; to the quiet turmoil of her closeted existence, which ultimately led to a serious eating disorder and to a nasty court fight with her first female partner, Marilyn Barnett, a battle that wound up outing her sexually; and to the way that cataclysm proved to be both agonizing and liberating.\n\n\tIt all comes to a climax in the legendary “Battle of the Sexes” exhibition match that she fought against Bobby Riggs on Sept. 20, 1973, the two facing off in the Houston Astrodome before a live television audience of 90 million. King was 29. Riggs, a former tennis champion, was a 55-year-old carny-barker hustler who truly believed that women should stay “in their place.” As we see from footage of the time, he was hardly alone. This tennis match was a symbolic feminist civil war. It was publicized like one of those only-in-the-’70s freak media events, but it had as large on impact on gender politics as Jesse Owens’ triumph at the 1936 Olympic Games in Berlin had on racial politics.\n\n\tThe filmmakers devote a lot of time to the match, letting it play out as King narrates her inner state, and the result is one of the most thrilling sequences I’ve seen in a documentary in years. The strategy that King decided on at the last minute was to hang back, lobbing softballs to create long volleys that would tire Riggs out. (It was almost a tennis version of the rope-a-dope.) Yet it took her a while to get her bearings. The pressure King felt was unreal. She believed that if she lost to this joker in front of the entire world, in a contest he had set up to be a measure of women’s “inferiority,” it would set the women’s movement back years. But then she calms herself and settles into playing in the moment, and the spectacle of her doing that is intensely moving.\n\t\n\n\t“Give Me the Ball!” captures how the victories of Billie Jean King did nothing less than help change the trajectories of women’s lives. For too long, though, she couldn’t be who she was. The film shows us how her close friendship with Elton John, who wrote “Philadelphia Freedom” for her, was rooted in that shared predicament (though he says it was harder for her, because many in the entertainment industry knew he was gay). Yet even as we glimpse the torment behind her cool façade, we also see that she handles it the same way she did everything else: with a quality that can only be called grace. She still has that (in a feisty way). Maybe that’s why the ball stayed in her court.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Give Me the Ball!’ Review: Ferociously Entertaining Portrait of Billie Jean King as Athletic Superstar and Culture Hero",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Billie-Jean-King.jpg.webp?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-28T02:27:57.000Z",
      "dateModified": "2026-01-28T02:27:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Hot Water’ Review: The American Road Movie Tradition Gets a Cross-Cultural Twist",
    "url": "https://variety.com/2026/film/reviews/hot-water-review-ramzi-bashour-1236642157/",
    "image": "https://variety.com/wp-content/uploads/2026/01/ze0yt2j12Hot_Water-Still_1.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-28T00:38:46.000Z",
    "description": "\n\tLayal (Lubna Azabal) seems to be on the brink of a nervous breakdown. A college professor of Arabic who just quit smoking, she has no patience, her ",
    "body": "\n\tLayal (Lubna Azabal) seems to be on the brink of a nervous breakdown. A college professor of Arabic who just quit smoking, she has no patience, her students’ incompetence infuriates her, she tries to relax while listening to meditation programs in her car, her mother in Beirut has fallen and become bedridden. As if this wasn’t enough, her teenage son gets expelled from school for hitting another boy with a hockey stick during a match. And thus “Hot Water,” Ramzi Bashour’s sincere and offbeat comedy, sets its premise. What follows is a road movie as mother and son fight and bond and, unsurprisingly, manage to find their way back to loving and accepting each other. \n\t\n\n\tWith this film, Bashour modernizes that traditional American genre: the road movie. When Layal’s ex (Gabe Fazio) offers to house their son Daniel (Daniel Zolghadri) in Santa Cruz so that he can graduate high school, the mother and son duo gets that chance at hitting the road. And off they go from Indiana to California. While Bashour treads familiar territory, his characters are different from those who usually inhabit these kinds of movies. Besides being of different generations, Layal is a Lebanese transplant, her son is American. That culture clash is mined by “Hot Water” for both comedy and pathos. Layal and Daniel grew up in different environments and with a different set of rules and societal obligations, but that’s also what ultimately makes them understand each other. \n\n\n\tBashour is interested in small moments of interaction that may not always carry much meaning in of themselves, but cumulatively they might just lead to catharsis. Layla is wound up and always worried, Daniel is more relaxed and seems unbothered. But Layal is also sharply funny, calling Las Vegas “Like Dubai, bullshit in the middle of the desert.” Daniel shows softer sides of himself as the angry teenage facade he hides under is removed, and a warm, sensible young person is revealed. \n\t\n\n\tThe film relies on a few quirky characters that Layal and Daniel meet along the way. Sundance regular Dale Dickey appears as an earthy woman who likes to give long hugs, and soak naked in Colorado’s springs — the hot water of the title. The character is written as an eccentric but powerful bearer of wisdom. In a lesser actor’s hands it would have been just a screenplay convenience, but Dickey infuses it with enough warmth and composure to make it realistic. They also meet a drifter who needs a ride. What ensues is funny and results in him yelling at them “You are not good people.” Bashour seems to want to get to the opposite of that statement by the end of the movie. The trip is bumpy but he does arrive at a satisfying answer. \n\n\tBesides this hitchhiker, the road Layal and Daniel travel on is rather empty. There’s nary even another car on these roads other than their Subaru, as if the America they traverse has very few inhabitants. What resonates is Layal’s connection with her mother and sister back in Lebanon. Heard only as voices on the phone, they add context to the lead character that makes the audience understand her motivations and hopes for the future. The voices on the phone soothe and worry her in equal measure. The longing for her past life and the pining for a place to call home give Azabal a multitude of different emotional states to play. Coupled with her incisive humor, “Hot Water” becomes a showcase for this veteran Canadian actor who most audiences might remember from leading Denis Villeneuve’s Oscar nominated 2010 film, “Incendies.” Zolghadri’s mellower performance also resonates, even if his character is not given as much context as Azabal’s.\n\n\t“Hot Water” is carried through by Alfonso Herrera Salcedo’s command of the light and atmosphere. His camera shows not just the enormity and beauty of the American terrain, but the confused feelings Layla and Daniel are trying to hide. The film’s rhythm is languid, its emotions mostly quiet. The few outbursts from both leads only emphasize the serenity of the rest of the movie. Bashour builds the narrative little piece by little piece. He’s asking the audience to trust that this story is going somewhere special. Not all of these moments land with an emotional punch, but enough do. There are instances when the audience might get impatient or question the confessions of Layal and Daniel as contrivances. However, those who stick with this mother-son team till the end will be rewarded with emotional beats nearing catharsis.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Hot Water’ Review: The American Road Movie Tradition Gets a Cross-Cultural Twist",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/ze0yt2j12Hot_Water-Still_1.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-28T00:38:46.000Z",
      "dateModified": "2026-01-28T00:38:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Olivia Wilde’s ‘The Invite’ Sells to A24 Following Sundance Premiere",
    "url": "https://variety.com/2026/film/news/olivia-wilde-the-invite-sells-to-a24-sundance-1236642300/",
    "image": "https://variety.com/wp-content/uploads/2026/01/The_Invite-Still_1.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-28T04:25:30.000Z",
    "description": "\n\tAfter an old-fashion, multi-day bidding war, Olivia Wilde‘s Sundance darling “The Invite” has sold to A24.\n\n\tA24 and Focus Features were locked in a",
    "body": "\n\tAfter an old-fashion, multi-day bidding war, Olivia Wilde‘s Sundance darling “The Invite” has sold to A24.\n\n\tA24 and Focus Features were locked in a tense fight for rights to the relationship comedy after other interested buyers, like Neon, Netflix, Apple, Searchlight and new distributor Black Bear, backed out of negotiations. The sale is north of $12 million, according to sources familiar with the terms of the deal. \n\n\n\tWilde reteamed with Megan Ellison’s Annapurna on the project, the studio that made her directorial debut, “Booksmart.” UTA Independent Film Group and FilmNation co-repped the sale.\n\t\n\n\tWilde pushed for a traditional theatrical release for “The Invite,” which she directed and co-stars in with Seth Rogen, Penelope Cruz and Edward Norton. The hilarious ensemble comedy plays out during a dinner party between a couple who are going through a rough patch and their upstairs neighbors, who turn out to be swingers. Rashida Jones and Will McCormack wrote the screenplay, a remake of the Spanish film “The People Upstairs.” CAA reps Wilde and Cruz. UTA reps Rogen, Norton and McCormack and Jones. \n\n\tSo far, it’s been a slow sales market out of the festival’s final hurrah in Park City. (Sundance heads to Boulder in 2027). Neon is closing a sale for the conversion therapy thriller “Leviticus” for a price tag that’s reportedly in the seven-figure range. “Wicker,” a fantasy comedy with Olivia Colman, Peter Dinklage and Alexander Skarsgard, as well as the harrowing drama “Josephine” starring Channing Tatum and Gemma Chan, have also been drawing interest from buyers.\n\t\n\n\t“The Invite” is Wilde’s third directorial effort — she also helmed 2019’s “Booksmart” and 2023’s “Don’t Worry Darling” — and her second film at this year’s festival. She was also at Sundance with director Gregg Araki’s “I Want Your Sex,” an erotic thriller in which she co-stars with Cooper Hoffman.\n\n\tVariety’s chief film critic Owen Gleiberman praised “The Invite” as a “bravura dinner-party dramedy” that “keeps you laughing and never stops surprising.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Olivia Wilde’s ‘The Invite’ Sells to A24 Following Sundance Premiere",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/The_Invite-Still_1.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-28T04:25:30.000Z",
      "dateModified": "2026-01-28T04:25:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Real Housewives of Salt Lake City’ Star Meredith Marks on Being ‘Sick Of’ Britani Bateman, Forgiving Lisa Barlow and Where She Stands With Jen Shah",
    "url": "https://variety.com/2026/tv/news/rhoslc-reunion-meredith-marks-britani-feud-lisa-barlow-friendship-1236642668/",
    "image": "https://variety.com/wp-content/uploads/2026/01/MeredithandMary.reunion.1.jpg?w=725&h=370&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-28T02:15:00.000Z",
    "description": "\n\tMeredith Marks was in the hot seat during the three-part reunion of Season 6 of “The Real Housewives of Salt Lake City,” which concluded on Tuesday.",
    "body": "\n\tMeredith Marks was in the hot seat during the three-part reunion of Season 6 of “The Real Housewives of Salt Lake City,” which concluded on Tuesday. Bravo’s reunion host (and the franchise’s executive producer) Andy Cohen pressed Marks throughout — about that infamous airplane ride, her relationship with alcohol and her accusation that cast member Britani Bateman “had supported a bigot.”\n\n\n\n\t\n\n\t\t\t\t\tLeft to right: Britani Bateman, Meredith Marks, Lisa Barlow \n\t\t\t\t\t\t\t\t\tCourtesy of Fred Hayes/Bravo\n\t\n\n\n\n\n\tOn that last subject, during the reunion’s second episode, after being asked by Cohen whether she’d had a drink before getting on the plane, Marks tried to explain her enmity toward Bateman by bringing up a controversy that viewers hadn’t seen addressed during the season. To summarize the conflagration, which happened before filming Season 6 began, Marks, who is Jewish, had told Bateman to delete a positive review she’d left for a local nail technician who’d been revealed to be an antisemite in an incident that had been covered by the news and was, Marks said, “all over social media.” According to Marks, Bateman had left the review up for a long time — saying “I only saw the one thing, was there more?” — until she finally deleted it, and it caused Marks to be wary of Bateman. At the end of Part 2, Bateman left the stage in tears, saying, “Fuck this!” (For a complete Reddit rundown of this feud, here’s a Megathread.)Over the weekend at the Sundance Film Festival, Variety caught up with Marks, who hosted various events at her store on Main Street in Park City. Before a party celebrating GLAAD, Marks discussed the fallout from the plane incident, where she stands with certain members of the cast, her alcohol intake and her beef with producers. Based on the first two episodes of the reunion, it doesn’t seem like you regret what happened between you and Britani on the plane. Is that accurate?\n\n\tI vented to Lisa. It was the wrong place and the wrong time. Everything I said, I had said to Britani’s face, so I don’t regret saying it. It wasn’t like I was gossiping behind somebody’s back. So, I’m not going be sorry for that. I am not going to apologize for physical actions, because they didn’t happen. There is no video for one reason: Those things did not happen.\n\n\tIt should have been in a different setting. It was wrong, and I apologize for that. I did apologize that Britani’s feelings were hurt by that, because I don’t want to hurt somebody’s feelings. That’s not my intention.\n\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tCourtesy of Jocelyn Prescod/Bravo\n\t\n\n\n\n\n\tWhy didn’t you do what you do best and “disengage”? Why did that TikTok she brought up on the yacht get under your skin?\n\n\tIt was the intention of it all. It was a very obscure TikTok. I couldn’t find it. I had to have it sent to me by someone from production, and it was like a gossip session. It was very obscure. When the episode aired, it had 25 likes. What bothered me was we don’t usually follow little TikTok storylines. So why suddenly are we following that? Why was that OK? That’s why I was so bugged.\n\n\tBritani wants to project her miserable relationship onto me. I’m sick of it. My marriage has come under fire. Yes, we went through a horrible time. I talked about it, but when I am saying things are good now you don’t want to believe me You want to say I’m this crazy liar.What did the TikTok say? That Seth was cheating on you?\n\n\n\tSomething about him being with a woman in an Uber. First of all, let me be very clear, he has never taken an Uber in Ohio. When he was living there part-time, he had a car, and he wasn’t even in Ohio anymore when this Uber thing supposedly happened. Seth has been living and traveling with me over the last year. He’s been working completely remote. That’s what we should have been talking about. That’s the real story here. For the first time in our marriage, we are fully together 24/7.\n\t\n\n\tDuring the reunion, it got heated between you and Heather Gay. She said that your friendship is over. Where do you stand with her now?\n\n\tI say, “You have been screeching at me for the last two months…” and it’s like, you are not my friend ever again. OK. Well then, I guess we weren’t ever friends. That’s what that tells me. I thought we were, so it’s just sad to me. You showed me who you are.\n\t\n\n\n\n\t\n\n\t\t\t\t\tMeredith Marks and Charli xcx \n\t\t\t\t\t\t\t\t\tIndieWire via Getty Images\n\t\n\n\n\n\tWhere do things stand with you and Bronwyn Newport and Mary Cosby?In terms of Bronwyn, it’s problematic for me because she claims that I didn’t support her marriage when it came up on the boat. I said, “I don’t know what you guys are talking about, but I support you, and I wouldn’t make yourself vulnerable to this right now.” I don’t know what else I was supposed to do. Am I supposed to end my friendship with Lisa because Bronwyn didn’t like what Lisa said about her marriage? Am I supposed to end my friendship with everyone else because they didn’t stand up for me and talked about my marriage, and quite honestly, spread lies about my marriage all season? Bronwyn knew she was lying about that dinner Seth had in New York City. I have text messages from Todd that very clearly say there were four businessmen at that dinner with Seth in New York, and it is abundantly clear that it was a business dinner and nothing else. She needs to own up to it. Apologize. Admit she is a liar. We already knew it with a necklace, and a multitude of other things. This is another big one. You clearly have a problem with the truth. Come clean.\n\n\tAnd Mary?Mary and I seem to be in a good place. I’m just a little confused by her because she always tells me she loves me, and then I got a little bit blindsided by some of the comments she made. But since the reunion, we have been good. I think a lot of the problems that I had with Mary this season were because she has so much going on in her life. Seeing stuff going on with your kid really takes a toll on you, and I’m sure that was her focus. She had all these people in her ear saying, blah, blah, blah, blah, blah. They are all telling her all this stuff. So, I feel like they kind of just got in her ear, and quite frankly, she was the only one who appeared to come to me out of concern rather than out trying to hurt me and take me down and defame me. Mary had a genuine concern because people were telling her these things.\nMary brought up Lisa’s hot mic moment from Season 2 when she called you a “whore” who has “fucked half of New York.” How did you move on from those remarks, which were made on camera and can never be erased?It took a while. In Season 3, we were not getting along at all. During Season 4, we started to get along a little bit, but the women were in her ear. Season 4 was another attempt to take me down, completely decimate me and destroy my character. The women were telling Lisa false narratives about me. When you have all these people saying this stuff to you about your friend, at some point, you start believing it. But the thing is, now Lisa and I are onto it, and we’ve agreed that we are not going to let anyone say anything about either of us to the other without talking to each other first. If someone comes to me and says, “Lisa, blah, blah, blah, blah,” my answer is, “I really hope that’s not true. I’ll talk to Lisa.” It’s been an ongoing thing. There are a large number of women who either don’t like me or don’t like Lisa, and are jealous or whatever. I don’t know. I’m not in their head. But for whatever reason, they are looking to isolate us and basically either get us booted off or destroyed.\nRecently on SiriusXM’s Jeff Lewis Live, you told Jeff that you “think it would be great to have a little bit of a cast shakeup. I don’t know what that means for who or what, but I do think it would be positive.” Who would you like to see go?It’s really hard, especially in the second episode of the reunion, where we see the whole other side of the couch voicing their opinions on Britani’s side. But there were people who agreed with my side of the [Britani] story, and we didn’t see that. For me, that is very problematic. It makes me really second-guess what I’m doing here, because these are not small issues. This is not, you bought your jewelry off Alibaba — like, come on. These are big, big issues, and you don’t always get the full story. As much as I have issues with a lot of the women, I hope they all thrive and do well in whatever they’re doing. I don’t feel like I need to knock someone else down to look better. I’ll look good or bad on my very own. I make mistakes all the time and I take accountability for my mistakes. I apologize. What I don’t do is take accountability for things that other people accuse me of that aren’t true, and that happens a lot.\nWould you ever consider being a “friend” of the cast so you don’t have to put your full life on display?No. I wouldn’t be willing [to do] that, and let other people win this argument. Things need to be fair, and we will see how it goes moving forward. I’m really optimistic that things will be more fair next season.\n\n\tYou recently liked Monica Garcia’s post about someone from the cast being taken to the hospital to get their stomach pumped allegedly for alcohol poisoning. Why did you like the post?\n\n\tI don’t do drugs. I’ll have a gummy here and there to sleep. But it’s not my thing. I am not a heavy drinker. Do I have fun here and there? Absolutely. But I’m looking at a woman at the Bronwyn event seven glasses of wine in at 11 in the morning, which was Whitney. She poured seven glasses, and eventually took the bottle back to her chair so that it’s close enough to keep pouring it. I am stone cold sober drinking tea, because it is 11 in the morning. Then Whitney calls me an alcoholic. So, you are going to defame me this way, and we have someone else taken off in an ambulance for alcohol poisoning or whatever?\n\n\tWas that about Heather?\n\n\tI’m not spreading new tea on it. But I liked the post, because Monica’s point was how can we talk about Meredith being an alcoholic? [Monica] has been on the cast; she knows I’m not a heavy drinker. But there are people who are heavy drinkers on this cast. I don’t know what else they do, it’s not my concern. But don’t put your finger at me when I’m one of the light drinkers on the cast.\n\n\tYou told Jeff Lewis you recently spoke to Jen Shah. Are you friendly with her now?\n\n\tI don’t know where Jen and I are at. We had a very tumultuous relationship. I do believe in second chances. Whether I ever have any relationship with her or not, I hope she is turning things around. She’s obviously served her time. I hope that she pays her restitution. I am pretty sure she started on down that path. I think Sharif was doing that while she was in prison. They are trying to right her wrongs. I hope she contributes something positive to society. Just because you made a mistake, no matter how big it is, it doesn’t mean you can’t turn things around. And I hope she does. I don’t know what that means between her and I. Obviously, if she doesn’t turn things around, there’s nowhere to go, but I’m rooting for her to do well in her life. Whether that means I have a part of it or not, I have no idea.\n\n\tAndy Cohen has said that she would never be on the show again.\n\n\tNot to ever speak for Andy because I’m not in his head at all, but I would guess that if she did actually pay all her restitution back and there was a positive ending to this story, he would be a little more interested. I don’t know though. I’m not Andy.\n\t\n\n\tIn the third episode of the reunion it is revealed that you and production had problems this season. Why?\n\n\tThat’s what I mean by the TikTok. [The cast] is repeatedly told that we don’t follow social media stories: It’s ruining the show. But when it comes to me, we are following it. Why are we following a story of false accusations of substance abuse, but not following the truth? That was my real issue. I told my producers that I will take a drug test every single day. You are going to do damage to me, and there’s no way to prove it wrong. But they aired it.\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tCourtesy of Natalie Cass/Bravo\n\t\n\n\n\n\tBoth Whitney and Bronwyn were very open during the season about how they might want marriages that are less typical than the usual monogamous ones that we see. You and Seth have been clear that you lived separate lives for a while. Do you still not have a typical marriage?\n\n\tWe never had an open marriage. We separated, and we weren’t together. But then we got back together. I know a lot of people who live in an open marriage and are very, very happy. It’s just not for me. I’m not knocking it. But it would not work for me. That would make me crazy.\n\n\tDo you think that Britani is antisemitic?\n\t\n\n\tI have no idea. All I can say is she supported one, and she did not take that [post] down immediately. It was up for a while. I have messages and voice memos that somebody sent to her that she should probably take it down, but she had to talk to Bravo to see what the right thing to do is. It wasn’t about the fact that she wrote the Google review, because even though it was on the news, obviously it’s possible she didn’t see it. The problem was how she handled it once it was brought to her attention, and she answered with, “Maybe I’ll take it down, I have to talk to Bravo.” That’s where I ran into a problem, and I was like, “Whoa.” So, do I think she’s an antisemite? I have no idea. I know she supported an antisemite.\n\n\tAnd what’s your response to Heather saying you lied about her mocking Bronwyn for kissing a girl?\n\n\tI didn’t lie. That’s what Bronwyn told me. I wasn’t there.\n\n\tHow was meeting Charli xcx at Sundance?\n\n\tOh my gosh, she’s amazing! She was so cool. I was just mad I didn’t have my Meredith Marks Caviar to give her, because I play her song during my DJ set.\n\n\tHow’s the DJing going?\n\t\n\n\tSo fun. It’s been, like, the best thing I’ve ever done in my life.\n\n\tThis interview has been edited and condensed.\n\n\n\n\t\n\n\t\t\t\t\t“Welcome to BravoCon DJ Set with Meredith Marks” — Andy Cohen, Meredith Marks at Caesars Forum in Las Vegas\n\t\t\t\t\t\t\t\t\tCourtesy of Griffin Nagel/Bravo via Getty Images\n\t\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Real Housewives of Salt Lake City’ Star Meredith Marks on Being ‘Sick Of’ Britani Bateman, Forgiving Lisa Barlow and Where She Stands With Jen Shah",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/MeredithandMary.reunion.1.jpg?w=725&h=370&crop=1"
      ],
      "datePublished": "2026-01-28T02:15:00.000Z",
      "dateModified": "2026-01-28T02:15:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Music Industry Moves: Range Sports Acquires Bonnaroo Founders Superfly; Olivia Dean Producer Zach Nahome Signs With Universal Publishing and NWS",
    "url": "https://variety.com/2026/music/news/nmpa-promotes-danielle-aguirre-charlotte-sellmyer-1236641627/",
    "image": "https://variety.com/wp-content/uploads/2024/02/RANGE_SPORTS_LOGO_COLOR-176.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-28T00:08:00.000Z",
    "description": "\n\tRange Sports has announced that it has acquired Superfly, creators of the Bonnaroo, Outside Lands and other festivals, bringing the company, along w",
    "body": "\n\tRange Sports has announced that it has acquired Superfly, creators of the Bonnaroo, Outside Lands and other festivals, bringing the company, along with founders Rick Farman, Rich Goodstone and Kerry Black, its leadership team and staff into the company. The newly rebranded Superfly, A Range Company, will drive live events and experiential opportunities across sports, entertainment, music, and beyond, according to the announcement. Additionally, Superfly’s founders will also launch and lead a new owned & operated experiential IP creation offering across the entire Range ecosystem\n\t\n\n\tThe acquisition does not include Superfly’s ownership interest in Outside Lands. Superfly will continue in its longstanding role producing the festival in partnership with Another Planet Entertainment, with no changes to the existing operating structure or creative leadership of the event. \n\n\n\t“We’ve methodically built our Brand Consulting practice with an ultra-high touch approach, providing bespoke advisory with the agility and bold perspective of a start-up, while benefitting from the expertise and connectivity of industry powerhouse executives,” stated Jeff Filiberto, Chief Strategy Officer of Range Sports. He continued, “We are thrilled to add Superfly’s exceptionally talented staff, best-in-class experiential expertise and prestigious clients to Range Sports.”\n\n\t“Superfly has always been driven by the belief that experiences should matter—culturally, emotionally, and commercially,” said Rick Farman, Co-Founder of Superfly. “We’ve earned the trust of some of the world’s most influential brands by consistently delivering at the highest level, and through our enduring live IP, we’ve demonstrated the power of experiences that connect fans to what they love. Joining Range marks an exciting next chapter, allowing us to bring that approach to a much broader ecosystem.” \n\t\n\n\t+ Universal Music Publishing Group and NWS Music Group, an independent record label and publishing company based in London, today announced the signing of songwriter, producer and multi-instrumentalist Zach Nahome to an exclusive worldwide music publishing agreement.\n\n\tHe is the executive producer of Olivia Dean’s chart-topping and critically acclaimed sophomore album “The Art of Loving,” having produced, written, or co-written the majority of the album’s tracks, and also has worked with Pink Pantheress, Loyle Carner, Justin Bieber, Maverick Sabre, Slowthai, Teezo Touchdown, Bakar, Celeste, Biig Piig and new artist Tendai.\n\n\tUMPG’s U.K. head of A&R Pete Simmons says , “Zach is an endangered species. Songwriters with taste and execution at his level don’t come around very often, and getting to know him and his process the past few months has been a joy. It’s a pleasure to be on his team alongside his manager, Laura Singer, and our friends at NWS.”\n\n\tNWS co-founder Ben Bodie added, “Nick [Raphael], Christian [Tattersfield], I, and everyone at NWS are delighted to be working with UMPG on the next chapter of Zach’s already illustrious career. Our combined efforts and enthusiasm will no doubt propel Zach even further into the songwriting stratosphere.”\n\n\t+ Swedish music service Hyph has announced that Hartwig Masuch, the founder of Bertelsmann’s music company, BMG, has been appointed Chairman of the company, effective April 2026.\n\n\tHyph, led by CEO and hit songwriter Andreas Carlsson, is “focused on creating new interactive value-added services designed to maintain music industry growth as the subscription streaming market matures,” according to the announcement. He has joined Hyph in an advisory capacity with immediate effect and will transition to Chairman in April 2026.\n\n\tMasuch grew BMG from a start-up team of three in 2009 to a highly profitable global company with revenues of over $900 million by the time he left in 2023.\n\n\tCarlsson says, “Hartwig Masuch is one of the most accomplished global music executives of the past two decades. We are delighted that he is joining us in our mission to create the first genuine leap forward for music since the advent of subscription streaming.\n\n\t“Since I became CEO of this company 18 months ago, my mission, drawing on all my experiences as a songwriter and my deep understanding of rights, has been to create an ecosystem that allows musicians to prosper while using technology to give non‑musicians the ability to play with music in a way they have never had before. The addition of Hartwig to our team brings that vision one step closer.”\n\t\n\n\t+ BMI has named Pam Schoenfeld as SVP, Chief Legal Officer. Schoenfeld reports directly to CEO Mike O’Neill and is based in the company’s New York office. She succeeds Stuart Rosen, who will continue in a consulting capacity as SVP, Senior Legal Advisor, until his previously announced retirement on June 30, 2026.\n\n\tPrior to joining BMI, she was General Counsel at TouchTunes Music Company, a leading in-venue interactive music and entertainment platform.  Schoenfeld also served as Chief Legal Officer at Radancy, and held senior roles at DoubleClick/Google and the law firms Davis Polk and Paul, Weiss.\n\n\t“Pam’s extensive legal expertise and industry insight make her an incredible asset to BMI and our music creators,” said O’Neill. “Her leadership will help strengthen BMI’s mission to protect and champion our songwriters, composers and publishers, and the advocacy work we do on their behalf.”\n\n\t+ Entertainment marketing agency the Syndicate has announced the appointment of Chip Herter as SVP, Music Supervision & Licensing. In this newly created role, Chip will build a division focused on creative music supervision, licensing, and end-to-end music support for the Syndicate’s clients and partners.\n\n\tHerter brings more than 15 years of experience helping brands authentically enter and shape the cultural conversation through music. Most recently, he served as Music Director at Deutsch, where he was a key creative force behind the sonic identity of campaigns for marquee brands including Taco Bell, Dr Pepper, Lowe’s, Nintendo, and Walmart. Herter worked on the return of Taco Bell’s Mexican Pizza, created in partnership with multi-award-winning artist Doja Cat. The campaign earned multiple Clio, Clio Music, and AMP Awards and marked Taco Bell’s return to the Super Bowl after a five-year hiatus\n\n\t“As music has moved to the forefront of modern advertising, Chip has played a defining role in shaping how brands show up culturally,” said Jon Landman, Partner and Chief Business Development Officer at The Syndicate. “We’ve seen it first hand on our collective work with Feed The Beat and Taco Bell. His creative instincts, strategic leadership, and deep relationships make him an exceptional addition to The Syndicate, and we’re excited to build this new division under his guidance.”\n\t\n\n\tMonday, Jan. 26\n\n\tThe National Music Publishers’ Association has announced the elevation of Danielle Aguirre and Charlotte Sellmyer to “new titles that reflect how their roles have expanded within the organization.”\n\n\tAguirre has been named Chief Legal Officer (CLO) and Chief Operating Officer (COO). She will continue to oversee legal and business affairs as well as NMPA operations. Sellmyer has been promoted to Executive Vice President, External Affairs. She will continue to oversee songwriter advocacy, public relations, events, the Gold & Platinum Program, and external activities of NMPA.\n\n\tNMPA President & CEO David Israelite said, “These promotions reflect the outstanding contributions Danielle and Charlotte have made to the industry. NMPA has one mission – to protect and increase the value of songs.  Danielle and Charlotte are key players in that mission, and their contributions are invaluable.”\n\n\tIn her 15-year tenure at NMPA, Aguirre has become a leading voice in music industry legal issues, producing landmark agreements with major music platforms and litigating numerous successful rate proceedings before the Copyright Royalty Board (CRB). She has been integral to crafting copyright legislation including the Music Modernization Act.\n\n\tIn her 11-year tenure, Sellmyer has elevated the voice and profile of music publishers and their songwriter partners, and has expanded NMPA’s impact to host major events across the country. She has led campaigns to pass major reforms including the Music Modernization Act, the designation and launch of the MLC, and multiple successful CRB litigations and settlements. She continues to lead communications efforts to compel the licensing of major digital platforms from streaming to social media and AI.\n\n\t+ BMG has announced the promotion of Celine Joshua to Executive Vice President, Global Marketing & Streaming, expanding her leadership across the company’s worldwide marketing and DSP platforms.\n\n\tIn her newly elevated role, Joshua oversees the strategic alignment of BMG’s global marketing and streaming efforts across 18 international offices in 13 key markets. Additionally, she will continue to lead the company’s marketing operations, content and creative, and audience insights and analytics teams, unifying theses strategic operations, according to the announcement. Joshua’s mandate includes advancing BMG’s global digital ecosystem, enhancing fan-engagement models, and accelerating the company’s work in emerging AI technologies and commercial formats.\n\t\n\n\tThomas Coesfeld, BMG CEO, said: “Celine’s elevation reflects both her achievements and BMG’s commitment to accelerating growth through technological innovation, artist-centric strategy, and our global where possible, local where needed paradigm. Her considered approach, coupled with her deep understanding of how artists and fans connect across platforms and how AI can amplify music experience, makes her uniquely equipped to drive BMG’s next chapter forward.”\n\n\tPrior to joining BMG in 2024, Joshua served as Executive Vice President of Commercial Innovation & Artist Strategy at Universal Music Group, where she worked across the company’s global recorded music business to develop artist experiences, brand extensions, and new commercial pathways.\n\n\t+ Primary Wave Music, in conjunction with South American partner Nas Nuvens Music Group, has announced a partnership with the legendary Brazilian composer, singer and guitarist Gilberto Gil.\n\n\tTerms of the deal will see Primary Wave and Nas Nuvens work alongside Gil on his celebrated catalog of music. This partnership is one of the most significant to emerge from South America, combining one of Brazil’s largest music transactions one of the country’s most influential cultural figures. The partnership will focus on the preserving Gil’s legacy while expanding the reach of his catalog and to new generations and territories.\n\n\t+ Concord Music Publishing has announced the signing of artist, songwriter, and producer Aksel Arvid in his first publishing deal. This deal is a joint venture with Norwegian producer Peder Losnegård, better known as Lido. \n\n\tAt the age of just 23, Arvid executive-produced PinkPantheress’ critically revered “Fancy That” album, which landed him two 2026 Grammy nominations. He has also worked extensively with Jack Harlow and others.\n\n\t“Aksel is a special young talent with a creative vision that feels like it blends the spirit of the old school with the techniques of the new. We couldn’t be more excited to partner with Concord to help foster his vision,” says Jonathan Tanners, Manager at Blood Company.\n\n\tJeremy Yohai, SVP A&R at Concord Music Publishing added, “Aksel is an amazing talent that possesses an extraordinary work ethic and distinct point of view. We are thrilled to be working with him alongside Lido.”\n\t\n\n\t+ Capitol Music Group has announced the promotion of Walter Thomas to Executive Vice President, Motown Gospel / Tamla. In his expanded role, Thomas will oversee the creative, marketing, and strategic direction for Motown Gospel and Tamla, strengthening partnerships and continuing to champion world-class talent across Gospel, Christian, R&B, and positive music, according to the announcement.\n\n\t“Walter is an exceptional leader with a strong work ethic and clear vision. Working alongside him over the past few years, I’ve seen firsthand his passion for artist development and the role faith plays in his leadership. Motown Gospel and TAMLA are entering a new era of growth and impact under his leadership,” said Brad O’Donnell, president of Capitol Christian Music Group.\n\n\t+ Pulse Music Group has announced the promotion of Saul Fitton to senior VP/ head of creative, U.K. His responsibilities will include signing, developing, and implementing creative strategy for the company’s roster of songwriters and producers. He will be based in London and will report to co-CEOs Scott Cutler and Ashley Calhoun.\n\n\tFitton previously held A&R roles at Sony Music Publishing and Warner Chappell Music, and began his career in management and A&R with Fraser T. Smith. \n\n\tScott Cutler, Josh Abraham, and Ashley Calhoun commented: “Saul has a proven track record of discovering, signing, and developing internationally successful songwriting, production, and artistic talent. What truly sets him apart is his ability to create innovative opportunities and to stand up for the commercial and artistic needs of his writers. We know that our writers will benefit from his exceptional dedication to their careers.”\n\n\t+ Secretly Distribution has announced a worldwide distribution deal with Ipecac Recordings, “the independent record label that has been making people sick since 1999,” as the announcement puts it. Founded by musician Mike Patton — vocalist with Mr. Bungle, Faith No More, Fantômas, Tomahawk and more — and artist/label manager Greg Werckman (of Alternative Tentacles and Mercury Records and Pick-A-Winner Management), Ipecac has released music across rock, country, hip-hop, electronic, comedy, classical, soundtracks and more.\n\n\t“One needs to evaluate constantly with the ever-shifting music industry landscape. Where do we fit? Who understands us? Who are our people? Partnering with Secretly at this time makes perfect sense,” says Werckman. “From the people that work at Secretly to the eclectic collection of labels and artists they work with, it feels like joining a commune of like-minded, fairly well groomed, independent music lovers. We are honored to be asked to join the ‘club’ and look forward to much more shared mayhem.”\n\t\n\n\t“Take a look at the Ipecac roster and you’ll see a rundown of artists who have consistently pushed at boundaries, challenged preconceptions, thrown curveballs and made us all wince, gasp, laugh and, frankly, rock in various measures,” adds Tom Davies, Director of Global Marketing & Campaigns at Secretly Distribution. “It’s been a pleasure to listen to their output for 25 years, and everyone at Secretly Distribution is beyond excited to get to work with a label whose commitment to supporting groundbreaking music matches our own. We are thrilled to collaborate with Greg, Marc and Mike to support their amazing catalog and new releases.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Music Industry Moves: Range Sports Acquires Bonnaroo Founders Superfly; Olivia Dean Producer Zach Nahome Signs With Universal Publishing and NWS",
      "image": [
        "https://variety.com/wp-content/uploads/2024/02/RANGE_SPORTS_LOGO_COLOR-176.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-28T00:08:00.000Z",
      "dateModified": "2026-01-28T00:08:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bill Belichick, 6x Super Bowl Winning Head Coach, Not Elected To Hall Of Fame",
    "url": "https://www.tmz.com/2026/01/27/bill-belichick-snub-hall-of-fame-first-ballot-patriots-nfl/",
    "image": "https://imagez.tmz.com/image/84/16by9/2026/01/27/8470d25c30914e119c708089dde544d3_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-27T23:19:52.000Z",
    "description": "\n    \n                    \n                          Bill Belichick\n                          6x SB Winning HC Not Elected To HOF\n                    ",
    "body": "\n    \n                    \n                          Bill Belichick\n                          6x SB Winning HC Not Elected To HOF\n                          ... Seriously!!!!!\n                      \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Bill Belichick -- arguably the greatest football coach of all-time -- has inexplicably come up short his first time on the Hall of Fame ballot ... meaning the man with 8 rings will NOT be going into Canton this year!\n      \n    \n          As you'd expect, upon hearing the ludicrous news, everyone around the sport was left questioning ... how?\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Belichick's resume is unmatched. He is a 6x Super Bowl-winning head coach, and he won two more as an assistant for the New York Giants. Bill was named the AP NFL Coach of the Year three times, and he won 333 games as an HC, including the playoffs.\n      \n\n          The snub sent some of the best players in the world into a frenzy, with J.J. Watt reacting on X.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          \"I can’t be reading this right. This has to be some knock-off Hall of Fame or something, it can’t be the actual NFL Hall of Fame. There is not a single world whatsoever in which Bill Belichick should not be a First-Ballot Hall of Famer,\" the former NFL Defensive Player of the Year said.\n      \n    \n          Patrick Mahomes also weighed in, writing, \"Insane… don’t even understand how this could be possible.\"\n      \n    \n          Fans, too, with one summing up the feelings of many around football. \"I’m not a fan of BB…. But this is criminal!\"\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Former Steelers' DB turned analyst Ryan Clark also chimed in ... \"Bill Belichick not being a first ballot Hall of Famer means that no coach should ever be. It means that the voters have decided there isn’t a coaching resume that warrants First Ballot consideration!\"\n      \n    \n          \"He is the GREATEST, most ACCOMPLISHED coach of all time! This is egregious!\"\n      \n    \n          ESPN reported that Belichick was \"disappointed\" after finding out he didn't make the cut.\n      \n    \n          FWIW, several coaches have made it on the first ballot ... Don Shula, Chuck Noll, and Tom Landry.\n      \n    \n          What a joke.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Bill Belichick\n              \n                          \n                Patrick Mahomes\n              \n                          \n                New England Patriots\n              \n                          \n                TMZ Sports\n              \n                          \n                Super Bowl\n              \n                          \n                Football\n              \n                          \n                NFL\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bill Belichick, 6x Super Bowl Winning Head Coach, Not Elected To Hall Of Fame",
      "image": [
        "https://imagez.tmz.com/image/84/16by9/2026/01/27/8470d25c30914e119c708089dde544d3_xl.jpg"
      ],
      "datePublished": "2026-01-27T23:19:52.000Z",
      "dateModified": "2026-01-27T23:19:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Red-Hot Rapper -- Guess the Star Busting Out of Her Dress",
    "url": "https://www.tmz.com/2026/01/27/red-hot-rapper-guess-the-star/",
    "image": "https://imagez.tmz.com/image/08/16by9/2026/01/27/08d372019a924ac4883e8dcf17ce23d0_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-28T00:13:43.000Z",
    "description": "\n    \n                    \n                          Red-Hot Rapper\n                          Guess The Scorching Scarlet Star!!!\n                    ",
    "body": "\n    \n                    \n                          Red-Hot Rapper\n                          Guess The Scorching Scarlet Star!!!\n                      \n                  \n                                                                        Published \n                              January 27, 2026\n                            4:13 PM PST\n                                                                            \n      \n    \n        \n                    \n                  \n      \n    \n          The only thing hotter than this rapper's busty dress is her razor-sharp flow ... can you guess who the red-hot rapper is???\n      \n    \n          Check out this celeb in the low-cut red dress rapping for the camera ... silky hair parted in the middle and falling in a straight wave down her body.\n      \n    \n          She's definitely not THE DRAMA in this clip -- instead she's the entertainment -- spitting some of her rhymes while sitting on her BONGOS.\n      \n\n          Check out our gallery to see which star is basically letting it all hang out!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Beauty\n              \n                          \n                Hip Hop\n              \n                          \n                Guess Who\n              \n                          \n                Music\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Red-Hot Rapper -- Guess the Star Busting Out of Her Dress",
      "image": [
        "https://imagez.tmz.com/image/08/16by9/2026/01/27/08d372019a924ac4883e8dcf17ce23d0_xl.jpg"
      ],
      "datePublished": "2026-01-28T00:13:43.000Z",
      "dateModified": "2026-01-28T00:13:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Teyana Taylor vs. Sydney Sweeney Who'd You Rather?! Ladies In Lace",
    "url": "https://www.tmz.com/2026/01/27/teyana-taylor-sydney-sweeney-whod-you-rather/",
    "image": "https://imagez.tmz.com/image/d6/16by9/2026/01/27/d6241af43a0a434cb117fa34cd5f2610_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-27T23:08:28.000Z",
    "description": "\n    \n      \n        \n        \n          Launch Gallery\n        \n                  Shutterstock Premier/SYRN\n              \n    \n    \n          It's o",
    "body": "\n    \n      \n        \n        \n          Launch Gallery\n        \n                  Shutterstock Premier/SYRN\n              \n    \n    \n          It's only Tuesday and the feeds are flooded with sexy stars in lingerie ... two of the biggest names in Hollywood, Teyana Taylor and Sydney Sweeney, both dropped these two luscious lingerie looks, so that begs the question:\n      \n    \n          Who'd You Rather!\n      \n    \n          VOTE NOW!\n      \n      ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Teyana Taylor vs. Sydney Sweeney Who'd You Rather?! Ladies In Lace",
      "image": [
        "https://imagez.tmz.com/image/d6/16by9/2026/01/27/d6241af43a0a434cb117fa34cd5f2610_xl.jpg"
      ],
      "datePublished": "2026-01-27T23:08:28.000Z",
      "dateModified": "2026-01-27T23:08:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Denise Richards Wants Judge To Deny Ex Aaron Phypers' Slice of Her OnlyFans Money",
    "url": "https://www.tmz.com/2026/01/27/denise-richards-wants-aaron-phypers-away-from-onlyfans-money/",
    "image": "https://imagez.tmz.com/image/de/16by9/2026/01/28/debfc64afad8477da6d8d3fb7ba43550_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-28T01:19:42.000Z",
    "description": "\n    \n                    \n                          Denise Richards To Judge\n                          Keep My Ex's Paws Off My OnlyFans $$$\n        ",
    "body": "\n    \n                    \n                          Denise Richards To Judge\n                          Keep My Ex's Paws Off My OnlyFans $$$\n                      \n                  \n                                                                        Published \n                              January 27, 2026\n                            5:19 PM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Denise Richards wants a judge to stop ex-husband Aaron Phypers from getting half of her hard-earned OnlyFans money ... and she says he missed an important deadline that could blow up in his face.\n      \n    \n          According to new legal docs, obtained by TMZ, Denise is begging a judge to deny Aaron's request for half of the $200,000-$300,000 he says she makes every month on OF.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Denise says Aaron's request should be denied because he failed to file an updated income and expense declaration with the court. She says Aaron missed a Friday deadline and hasn't filed anything as of Tuesday.\n      \n\n          As you know ... Denise and Aaron are going through a nasty divorce and have been fighting over money ... with Aaron making his financial struggles well known.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          The judge has yet to rule on Denise's request.\n      \n    \n          Stay tuned ...\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Denise Richards\n              \n                          \n                Aaron Phypers\n              \n                          \n                Money\n              \n                          \n                Relationships\n              \n                          \n                Movies\n              \n                          \n                Celebrity Divorce\n              \n                          \n                Models\n              \n                          \n                Fairly Legal\n              \n                          \n                OnlyFans\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Denise Richards Wants Judge To Deny Ex Aaron Phypers' Slice of Her OnlyFans Money",
      "image": [
        "https://imagez.tmz.com/image/de/16by9/2026/01/28/debfc64afad8477da6d8d3fb7ba43550_xl.jpg"
      ],
      "datePublished": "2026-01-28T01:19:42.000Z",
      "dateModified": "2026-01-28T01:19:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ilhan Omar Attacked By Liquid-Spraying Man At Minnesota Town Hall",
    "url": "https://www.tmz.com/2026/01/27/ilhan-omar-attacked-liquid-spraying-man-minnesota-town-hall/",
    "image": "https://imagez.tmz.com/image/84/16by9/2026/01/28/84a5605c96de41b39e6f71b46d43bc0f_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-28T02:09:56.000Z",
    "description": "\n    \n                    \n                          Ilhan Omar\n                          Attacked By Liquid-Spraying Man At Town Hall\n               ",
    "body": "\n    \n                    \n                          Ilhan Omar\n                          Attacked By Liquid-Spraying Man At Town Hall\n                      \n                  \n                                                                        Published \n                              January 27, 2026\n                            6:09 PM PST\n                                                                            \n      \n    \n        \n                    \n                  \n      \n    \n          Chaos at a Minnesota town hall where Rep. Ilhan Omar was speaking ... a man rushed up to the podium and squirted her with an unknown substance ... and it's all on video.\n      \n    \n          The Congresswoman was meeting in her Minneapolis district Tuesday for her first town hall since Border Patrol agents shot and killed Alex Pretti when she was approached by the liquid-spraying maniac.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Omar had just called on Department of Homeland Security Secretary Kristi Noem to resign when the man leapt out of his seat and charged at her ... squirting her top with an unknown, liquid substance.\n      \n\n          The guy was quickly grabbed by security as Omar's shocked supporters looked on in horror.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Unclear what Omar got sprayed with here, but she kept on speaking after things calmed down.\n      \n    \n          Story developing ...\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Ilhan Omar\n              \n                          \n                Alex Pretti\n              \n                          \n                Kristi Noem\n              \n                          \n                ICE\n              \n                          \n                Fights\n              \n                          \n                Politics\n              \n                          \n                News\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ilhan Omar Attacked By Liquid-Spraying Man At Minnesota Town Hall",
      "image": [
        "https://imagez.tmz.com/image/84/16by9/2026/01/28/84a5605c96de41b39e6f71b46d43bc0f_xl.jpg"
      ],
      "datePublished": "2026-01-28T02:09:56.000Z",
      "dateModified": "2026-01-28T02:09:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]