[
  {
    "title": "California Approves Redistricting Measure in Big Win for Gavin Newsom",
    "url": "https://variety.com/2025/politics/news/california-gavin-newsom-redistricting-prop-50-1236568949/",
    "image": "https://variety.com/wp-content/uploads/2025/11/Gavin-Newsom-election-rigging-response-act.jpg?crop=0px%2C0px%2C1500px%2C844px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-11-05T04:06:40.000Z",
    "description": "\n\tCalifornia voters have approved a ballot measure to redraw the state’s congressional map, potentially giving Democrats five more seats in the 2026 m",
    "body": "\n\tCalifornia voters have approved a ballot measure to redraw the state’s congressional map, potentially giving Democrats five more seats in the 2026 midterms.\n\n\tThe Associated Press called the race at 8 p.m., just as polls closed.\n\n\tThe vote comes in response to a similar move from Texas, where Republican leaders redrew their maps this summer to eliminate up to five Democratic seats.\n\n\n\tGov. Gavin Newsom billed the measure as a way to “fight fire with fire” by stopping Republicans from rigging the 2026 midterms. The vote marks a significant win for Newsom, who sold the measure to voters as a way to stop President Trump’s agenda.\n\t\n\n\t“We are done being treated like this,” Newsom said at a rally over the weekend. “What this is all about is Democrats getting back on our toes — not on our heels. Getting our mojo back.”\n\n\tRepublicans currently hold a six-vote majority in Congress. In California’s 52 seats, Democrats hold a 43-9 advantage — but that could grow to 48-4 under the new maps, possibly helping Democrats win control of Congress.\n\n\tSuccess was not a foreordained when Newsom proposed the new maps this summer, which, unlike in Texas, required voter approval to change the California constitution.\n\n\tCalifornia voters had previously created an independent redistricting commission to draw lines in a non-partisan fashion — a key element of Gov. Arnold Schwarzenegger’s legacy in office. In polls before the campaign, voters were generally supportive of the commission.\n\n\tBut an ad campaign, along with big endorsements from Barack Obama and Kamala Harris, sent a message to Democratic voters that the proposition would offer a golden opportunity to fight back against Trump.\n\t\n\n\tThe successful campaign burnishes Newsom’s credentials as a fighter as he is expected to launch a campaign for president in 2028.\n\n\tThe redistricting battle may not be over yet. Other states have considered countering California’s move, including Indiana, Ohio and Florida.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "California Approves Redistricting Measure in Big Win for Gavin Newsom",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/Gavin-Newsom-election-rigging-response-act.jpg?crop=0px%2C0px%2C1500px%2C844px&resize=1000%2C563"
      ],
      "datePublished": "2025-11-05T04:06:40.000Z",
      "dateModified": "2025-11-05T04:06:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘The Lowdown’ Creator Sterlin Harjo on the Bittersweet Finale, What America Could Learn from Tulsa and How Ethan Hawke Can ‘Break Your Heart While Making You Laugh’",
    "url": "https://variety.com/2025/tv/news/the-lowdown-season-finale-interview-sterlin-harjo-1236569561/",
    "image": "https://variety.com/wp-content/uploads/2025/11/IMG_2198.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-05T03:17:00.000Z",
    "description": "\n\n\tSPOILER ALERT: The following article contains plot details from “The Sensitive Kind,” the Season 1 finale of “The Lowdown,” now streaming on Hulu.\n",
    "body": "\n\n\tSPOILER ALERT: The following article contains plot details from “The Sensitive Kind,” the Season 1 finale of “The Lowdown,” now streaming on Hulu.\n\n\tJournalist and bookstore owner Lee Raybon (Ethan Hawke), the crusading hero of “The Lowdown,” likes to call himself a “truthstorian,” a made-up title that nonetheless speaks to how Lee views unearthing the buried secrets of Tulsa, Oklahoma as a higher calling. In “The Sensitive Kind,” the Nov. 4 finale of the FX series’ eight-episode first season, Lee does dig up some serious dirt, finding proof that a white supremacist church has used a land deal as cover to bribe gubernatorial candidate Donald Washburg (Kyle Maclachlan). Donald’s late brother Dale (Tim Blake Nelson), a closeted eccentric who died in a suspicious “suicide,” tried to leave the land to his Native friend Arthur (Graham Greene, in one of the actor’s final performances before his death in September) — so Donald’s associate Frank (Tracy Letts), unbeknownst to him, hired goons to intimidate Dale with fatal results before killing Arthur himself.\n\n\tIt’s juicy stuff, but Lee opts not to put any of it in print in his final piece on the wealthy, storied Washburg family for a local magazine. Instead, he leverages a grieving, guilt-stricken Donald into giving the land to the Osage Nation, using his knowledge to achieve tangible results. The piece Lee publishes isn’t a Pulitzer-winning takedown, but a posthumous profile of the reclusive, kind-hearted Dale, a man who shares Dale’s love of crime writers like Jim Thompson and instinctive empathy for underdogs. The resolution isn’t exactly a dramatic payoff, but it is an emotional one after Lee’s previous attempts at muckraking led to lots of collateral damage — like Donald’s head of security Marty (Keith David) getting shot in the leg.\n\n\t“For me, it was the most beautiful way to end the season,” says “The Lowdown” creator Sterlin Harjo, who previously led three seasons of the coming-of-age series “Reservation Dogs.” “Because it’s not perfect. It’s not all tied in a bow. It’s the more realistic version of how to end the show.”\n\n\tHarjo first met Hawke on the earlier series, on which he cast the actor as the absentee father of Devery Jacobs’ perceptive Elora Danan. In moving from the rural reservation to the relatively dense Tulsa, where Harjo himself lives, “The Lowdown” became a love letter to many things: a city with a rich and painful history that’s recently gotten more attention; the power of journalism, an embattled industry that could use the shine; and its own leading man, for whom Harjo wanted to write a part reflecting the full breadth of his talents. The affection is palpable throughout, and contagious. “The Lowdown” has not yet been renewed for a Season 2, and I find myself evangelizing for one with all of Lee’s frantic enthusiasm. \n\n\tEarlier this week, Harjo spoke with Variety from Tulsa to break down Hawke’s appeal, the season as a whole and his mixed feelings about his adopted hometown’s recent turn in the spotlight.\n\n\n\n\t\n\n\t\t\t\t\tCourtesy of FX\n\t\n\n\n\n\t\n\t\tThe season ends with Lee Raybon discovering the truth of what happened to Dale Washburn — but rather than publish a searing exposé revealing all, he writes a heartfelt tribute to Dale. What does that choice reflect to you about Lee’s journey through the season?\t\n\n\tThe conflict in the end sort of goes directly against what [Lee]’s been saying this whole time, which is: I’m a truthstorian. He’s faced with this dilemma and trying to figure out, how does he make this wrong right? And in the end, a dead man’s wishes that are kind of pure, like the most pure — for Lee, that beats telling the exact truth, which is something that he’s willing to risk his life for, and also bring danger upon those that love him. He’s put everything at risk for the truth. And at the end, it’s like, well, can you put your morals, can you put your ego aside for the truth? That’s what he does in the end, to right this wrong and to fulfill this dead man’s wish. He pivots.\n\n\tI think he does get to the truth, because this person that was misunderstood by everyone — through his own investigations, he found out this man was and why he was important. For me, it was the most beautiful way to end the season. Because it’s not perfect. It’s not all tied in a bow. It’s the more realistic version of how to end the show. The rules of this show and the way that I write it — it falls more in line with that than any other example that I can think of. \n\n\t\n\t\tIt almost feels like a conflict between Lee as a journalist and Lee as a storyteller — those two impulses and how they interact with one another.\t\n\n\tOne of the things that [Dale’s widow] Betty Jo says early in the show is, “He was a good man. He was a good man.” She’s repeating that in the mirror, and in the end, that’s what Lee writes about who that man was. But also, when she’s saying that, we cut to Lee in the van, and she says it again: “He was a good man.” So we’re also talking about Lee.\n\t\n\n\tWhen she’s saying that, it’s also like, “Can your ego, can your journalistic endeavors, can everything take a back seat to being good?” In the end, that’s what he’s faced with. Like, are you going to do the right thing, or are you going to do the right thing? Because both of them are right. But one is more for himself. One is, I think, feeding his ego. He wants to be known as a truthstorian. And he won’t be known as that now, or this article is not the article that you were going to write that was going to cement your reputation as a truthstorian. You don’t get to write it now, and there’s just a lot of heavy things that I think he has to decide right at the end.\n\t\n\t\n\t\tLee’s conversation with Francis at the wedding felt like an echo of Ethan Hawke’s appearance in “Reservation Dogs” as Elora’s estranged dad. He’s so great at playing that kind of flawed earnestness. What was it like working with an established star in this series, compared to a cast of relative unknowns in “Reservation Dogs”?\t\n\n\tIt’s a strange thing. I’ve always thought I was going to work with Ethan Hawke. Maybe it’s because I just grew up watching his performances and movies. But once we met, everything kind of just fell into place and made sense. It was like we were old friends.  I’ve been watching his movies for so long, I also kind of had ideas for writing for him: things that I know that he’s good at, or things that I haven’t seen him do that I wanted to see him do. \n\n\tThe thing is, he walks the line of being — people have said “insufferable,” I’ve heard that used a few times — and really charismatic and lovely to watch. You want to be around him, and you believe him.  I think that sometimes being a parent, you’re also walking that line. Like, I was a kid once, and now I have to grow up, and I may have made some wrong decisions along the way. As a parent, you’re always trying to get back to being a good parent, but you’re sort of wrestling with the child that you used to be. Ethan portrays that so well. He’s also a person that can be likable, so likable, even when he’s doing something that might not be the most positive: smoking a joint, talking to his daughter about why he never reached out to her in “Reservation Dogs.” That’s not the right thing to do. You should have fought for your daughter, and you know you should have been there for her. But she believes him, and he’s approaching her with honesty, and he is likable. Ethan just can thread that needle. And I think that that’s a hard thing to do, and he does it. He does it in “The Lowdown” as well.\n\t\n\t\tWhat were some of the things that you hadn’t seen him do before that you wanted to throw his way?\t\n\n\tEthan’s an artist, you know? Not that he hasn’t played artists, but he is a sort of literary beast. He’s a writer, and he is concerned with the truth. Ethan’s also a bit of a cowboy, and all of those things come together to form Lee Raybon. I also just think that Ethan’s funny. I wanted to write him a part where he could be heartbreaking and also funny at the same time. That’s sort of, I guess, the tone that I’m getting known for. Ethan’s the perfect actor for that tone. He can break your heart while making you laugh and putting himself into physical pain. He can do all of that. I’d seen him do everything, but I hadn’t seen him do everything in one character. I have love for him as a performer and as a person. I wanted to try to put that into a character.\n\n\n\n\t\n\n\t\t\t\t\tCourtesy of FX\n\t\n\n\n\t\n\t\tI have to confess that, as a writer myself, I felt almost pandered to by how much the show really loves the act of writing, the act of journalism, and specifically for local print media in a place like Tulsa.\t\n\n\tIsn’t that crazy, though? That you have a slight feeling of being pandered to? Because it should be way more common. It’s amazing that we are starved for soldiers-of-journalism stories. We’re starved for that right now, because it feels so desperate and bleak. But I don’t think that that’s necessarily the truth. Whether it’s media, the internet, certain administrations — whether it’s any or all of those things that make us feel that way. \n\n\tAs much as I’m trying to tell a story about a person, I’m also trying to tell a story about what I love. I love books. I love movies. I love crime stories. I love the written word. I love being able to be tough and also literate. I love being around people who will fight to the last breath for what they believe in, but they also love poetry. Those things should not be separated from each other. Those things should be intertwined. I grew up in a period in the world when art did that. Art could be dangerous. Art could change things. We believed in it in a way that, I hope, we can still believe in it to this day. But I think that the show has a bit of nostalgia in it, because those ideas haven’t been celebrated a lot as of late. And I hope that that changes.\n\t\n\t\n\t\tIn addition to “The Lowdown,” there have been a few shows and films in recent years about Tulsa and its history, like “Watchmen” and “Killers of the Flower Moon.” As someone who’s actually from the area, what’s it been like to see these stories given that platform?\t\n\n\tI was really happy about “Watchmen,” because it helped a lot of the work that people in the city were doing to get the word out about what happened at Greenwood, the race massacre. It helped propel that into the national dialogue. I was really happy about that. I also wished it was shot in Tulsa. \n\n\tI have two sides of me. As much as I care about the story, I also care about the crew and the people that work here, and I care passionately about building a film community here. I’ve always done that here. I’m also a founder of the Tulsa Film Collective, which models itself off of the Austin Film Society. It’s about nurturing the local sort of film community. I’m a person that I left home, and I have such a big family and a big community that I build community wherever I go. It’s just what I do naturally. So Tulsa became my community. Like anything, I saw things that need to be improved on, and also things to celebrate — things that made us unique. \n\n\tI love it here, and it’s been an interesting thing to watch all the —  it actually hasn’t surprised me. I’ve been banging the drum for many years now. So to see other projects happening here, it’s almost, for me, been like, “What took you so long?” We have a unique history. You can stand in Tulsa, and you can see three different tribal territories. You can walk to three of them: Osage, Cherokee and Muskogee Creek. Just the other day, I woke up and I went down to a park, to an old tree that we have called the Council Oak Tree. The band of Muskogee people that founded Tulsa on the banks of the Arkansas River used that tree to hold Council under and have meetings. And the city of Tulsa just gave it back to the Muskogee Creek Nation. That isn’t happening everywhere. \n\n\tWe are a place that is very diverse, culturally. There’s a lot of darkness that formed this place. We’ve also fought through that darkness, and are in a period, I think, where healing is happening and a place where reconciliation is happening. That also needs to happen throughout America. But for Oklahoma, so much happened in such a short amount of time, so many different cultures were moved here at once, that for me, it became this microcosm, this model for the whole country, right in the middle of America. I have a lot of pride in this place, and I have a lot of pride in projects that are being made here. \n\t\n\n\tA good friend of mine just happens to be making a film in Tulsa right now. I went to the Sundance Director’s Lab with this guy. He was my roommate, Dito Montiel. He texted me today and I’m gonna go get lunch with him. That would be unheard of 10 years ago, and so. And then, Ryan Armstrong, who’s in the show, who plays Francis, I got a text from her and her dad a week ago saying, “Let’s get together. We’re shooting a film in Tulsa.” I was like, “Oh, is it, my friend Dito’s film?” And they’re like, “No, it’s a different film.” So there’s two films shooting right now, and then there’s short films being made. A friend of mine, Lauren Waters, just made a short film. It’s this beautiful explosion of art that I’m just really happy that I’m a part of. And it’s what I always wanted to see happen here.\n\t\n\t\tI know this show was originally pitched with the title “The Sensitive Kind,” and of course, it ends with a cover of the JJ Cale song. I wanted to ask why that song is significant to you, and why you felt it was resonant with the story you wanted to tell here.\t\n\n\tWell, I love JJ Cale. He represents Tulsa. I love his music and the Tulsa sound in general. They were about taking rock and roll, country music, R&B, all of the influences that happen in Tulsa. Even Native influences, [like] Jesse Ed Davis. You know, Leon Russell claimed that the drum beat of the Tulsa sound came from Native songs. The influence of culture — JJ Cale’s music represents that. \n\n\t“The Sensitive Kind,” you can take it a few ways. There’s top secret sensitive information that only someone that’s really looking hard can find, seeking the truth. But also what we’re talking about, the celebration of art, the celebration of people that care about literature and writing and journalism. A certain part of you, as an artist, you have to be sensitive. You also have to be tough, because it’s hard, but you have to be sensitive to the world around you to create and represent the world around you. I think that sometimes we forget who our most special people are, because they are sensitive and sometimes they don’t speak up, or sometimes they turn to alcohol and drugs because they don’t have the tools to handle how hard the world can be. All of that, for me, is cooked into that phrase and that title.\n\t\n\t\n\t\tHow detailed of a sense do you have of what a Season 2 might look like? \t\n\n\tI have ideas for everything. I mean, I’ve got multiple seasons of shows I haven’t made in my head. So of course, there’s things kicking around in my head with this show. I think it depends if, do your readers want to see a Season 2? Do you want to see a Season 2?\n\t\n\t\tI’m trying to do my part here!\t\n\n\tI hope that it will happen one way or the other. This show or another show, I’m gonna keep making stuff. Sorry to be so coy.\n\t\n\t\tI understand. It’s just the show is so modeled after these detective serials, so I could totally picture it in my head as a recurring thing. \t\n\n\tOh, I can too, of course. Look, “The Rockford Files” did it every episode. I think we could handle every season. \n\n\tThis interview has been edited and condensed for clarity.\n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘The Lowdown’ Creator Sterlin Harjo on the Bittersweet Finale, What America Could Learn from Tulsa and How Ethan Hawke Can ‘Break Your Heart While Making You Laugh’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/IMG_2198.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-05T03:17:00.000Z",
      "dateModified": "2025-11-05T03:17:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "TAICCA Sets Partnerships With Japan’s K2 Pictures, Taiwan’s Lunta Ventures at Creative Content Fest",
    "url": "https://variety.com/2025/film/markets-festivals/taicca-partnerships-k2-pictures-lunta-ventures-tccf-1236570099/",
    "image": "https://variety.com/wp-content/uploads/2025/11/TAICCA-MoU-Signing.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-05T04:01:02.000Z",
    "description": "\n\tTaiwan Creative Content Agency (TAICCA) rolled out two major industry partnerships at the Taiwan Creative Content Fest (TCCF), marking a renewed pus",
    "body": "\n\tTaiwan Creative Content Agency (TAICCA) rolled out two major industry partnerships at the Taiwan Creative Content Fest (TCCF), marking a renewed push to expand Taiwan’s presence across film, television and digital entertainment. \n\n\tThe agency sealed a co-production memorandum of understanding with Japan’s K2 Pictures Inc. and unveiled the Digital Games Fund with Taiwan’s Lunta Ventures, reflecting a strategy that pairs global collaboration with targeted investment to accelerate the globalization of Taiwanese content.\n\t\n\n\tThe pact with K2 Pictures outlines frameworks for co-investment, co-production and content financing aimed at enhancing the global visibility of Taiwanese screen projects. The agreement was signed by TAICCA deputy CEO Hu Ting-li and K2 Pictures Founder and chair Kii Muneyuki.\n\n\n\tKii said the partnership reflects K2’s growing commitment to Taiwan as a creative ally. “We plan to shoot in Taiwan and collaborate with Taiwanese talent. Our goal is to bring the strength of Asian cinema to audiences worldwide,”he said, adding that the alliance is expected to deepen long-term ties between the two sides.\n\n\tFilmmakers on K2’s slate, which was launched at Cannes last year, include Japanese icons Kore-eda Hirokazu, Iwai Shunji and Miike Takashi. \n\n\tTing emphasized the increasing momentum behind Taiwan–Japan creative exchanges. “Taiwan’s film and TV productions continue to draw global attention. We believe this partnership will open new pathways for internationally competitive Taiwan–Japan co-productions. TAICCA will keep connecting domestic talent with global resources so Taiwan’s stories can resonate worldwide.”\n\t\n\n\tIn the gaming sector, TAICCA and Lunta Ventures jointly launched the Digital Games Fund, a new vehicle designed to support original Taiwanese game IP from early development through commercialization. At the signing ceremony, Lunta Ventures chair Hsieh Meng-kung, highlighted the fund’s mission: “Through this collaboration with TAICCA, we hope to elevate Taiwan’s gaming industry to greater heights. We want Taiwan to be seen globally and guide the industry toward new opportunities ahead.”\n\n\tBy advancing partnerships spanning both film and digital games, TAICCA continues positioning Taiwan as an emerging hub for Asian creative collaboration. At TCCF, TAICCA is further expanding its international slate with two additional MOUs – one with Japan’s TOHAN and another with Korea’s CLB – to drive Taiwanese comics onto the global stage.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "TAICCA Sets Partnerships With Japan’s K2 Pictures, Taiwan’s Lunta Ventures at Creative Content Fest",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/TAICCA-MoU-Signing.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-05T04:01:02.000Z",
      "dateModified": "2025-11-05T04:01:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Jimmy Kimmel Live’ Holds Food Drive As Trump Administration Threatens to Halt SNAP Benefits for Millions of Americans",
    "url": "https://variety.com/2025/tv/news/jimmy-kimmel-food-drive-trump-snap-benefits-1236570003/",
    "image": "https://variety.com/wp-content/uploads/2025/11/179847_0880-e1762300819350.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-05T01:22:22.000Z",
    "description": "\n\tWith the Trump Administration threatening to withhold SNAP benefits to Americans in need, “Jimmy Kimmel Live!” has launched a food drive to support ",
    "body": "\n\tWith the Trump Administration threatening to withhold SNAP benefits to Americans in need, “Jimmy Kimmel Live!” has launched a food drive to support the Los Angeles Food Bank and the St. Joseph Center. The LA Food Bank’s mission is to “mobilize resources to fight hunger in our community,” while the St. Joseph Center helps “working-poor families and people experiencing homelessness to achieve stability and self-sufficiency.”\n\n\tAs the Trump Administration’s government shutdown is about to hit 36 days — marking a new record — there’s still uncertainty over whether the 42 million Americans who rely on food stamp payments will receive any of those benefits moving forward. \n\t\n\n\tWrote the show on its Instagram account: “Cutting SNAP benefits creates uncertainty for American children, seniors and families. To support our community members in need, we’re starting a donation center in our Hollywood backlot to benefit the @LAFoodBank & @StJosephCtr. Details below. If you are in LA, please come by to donate food and if you are not, please consider supporting your local food banks.”\n\n\n\tDubbed “The Jimmy Kimmel Live Big, Beautiful Food Bank,” the donation hours are from 9 a.m. to 5 p.m.. at 6901 Hawthorn Ave., Los Angeles, CA 90028.\n\n\tAccording to the show, the most needed foods are low-sodium soups/chili/stews, tuna/chicken/salmon (cans or pouches), nut butters, low-sugar cereals, protein bars, whole grain pasta and rice.\n\n\tAlso requested are crackers, trail mix, fruit snacks, 100% juice boxes, dried fruit, UHT milk, cereal boxes, wipes, diapers, facial cleanser, deodorant, soap, lotions, oral hygiene items and feminine products.\n\t\n\n\n\n\t\n\n\t\n\n\n\n\tIn January, “Jimmy Kimmel Live” also turned the parking lot behind the show’s studio — where normally live outdoor music performances are staged — to serve as a donation point to help Angelenos impacted by the L.A. fires.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Jimmy Kimmel Live’ Holds Food Drive As Trump Administration Threatens to Halt SNAP Benefits for Millions of Americans",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/179847_0880-e1762300819350.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-05T01:22:22.000Z",
      "dateModified": "2025-11-05T01:22:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Zohran Mamdani Elected New York City Mayor",
    "url": "https://variety.com/2025/politics/news/zohran-mamdani-new-york-city-mayor-1236570072/",
    "image": "https://variety.com/wp-content/uploads/2025/11/GettyImages-2244031537.jpg?crop=0px%2C0px%2C4000px%2C2250px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-11-05T02:45:10.000Z",
    "description": "\n\tZohran Mamdani has been elected mayor of New York City, defeating former Gov. Andrew Cuomo, who ran as an independent, and Republican nominee Curtis",
    "body": "\n\tZohran Mamdani has been elected mayor of New York City, defeating former Gov. Andrew Cuomo, who ran as an independent, and Republican nominee Curtis Sliwa.\n\n\tThe Associated Press called Mamdani the winner less than an hour after polls closed on Tuesday night. According to the New York Times, with 75% of the votes counted, Mamdani leads with 860,327 votes (50.4%), Cuomo trails with 704,866 votes (41.3%) and Sliwa is in a distant third with 128,400 votes (7.5%). \n\t\n\n\tMamdani established himself as an early favorite after a shocking victory against the perceived front-runner, Cuomo, in June’s Democratic Primary. Early voting polls on Sunday showed the 34-year-old leading with 40% of the vote, while Cuomo and Sliwa earned 34% and 24% respectively.\n\n\n\tMamdani forged his victory with a platform built for the working-class New Yorker, promising rent stability, free public transportation, no-cost child care and city-owned grocery stores. Cuomo, his closest competitor, attempted to leverage his experience as governor while pushing issues like public safety, city maintenance and education. \n\n\tMamdani is the son of filmmaker Mira Nair and academic Mahmood Mamdani. He was born in Uganda and his family moved to New York when he was 7 years old. He graduated from Bowdoin College and was elected to the New York State Assembly in 2020, 2022 and 2024. \n\n\tAlthough Mamdani has earned the trust of New York City, some of his fellow Democrats were hesitant to back his platform, which some critics deem as outwardly socialist. Progressives like New York Representative Alexandria Ocasio-Cortez and Senator Bernie Sanders of Vermont have both endorsed Mamdani. However, Democrats like Senate Minority Leader Chuck Schumer have remained silent. House Minority Leader Hakeem Jeffries of New York also dodged supporting Mamdani until Oct. 24.\n\t\n\n\tRepublicans have widely rejected Mamdani. They wrote of the mayoral election in a memo on Oct. 28, “This isn’t about one race in New York. It’s a national story of a party bending the knee to socialism and the far left.”\n\n\tDonald Trump is among Mamdani’s harshest critics. He wrote on Truth Social Monday evening, “If Communist Candidate Zohran Mamdani wins the Election for Mayor of New York City, it is highly unlikely that I will be contributing Federal Funds, other than the very minimum as required, to my beloved first home, because of the fact that, as a Communist, this once great City has ZERO chance of success, or even survival! It can only get worse with a Communist at the helm, and I don’t want to send, as President, good money after bad. It is my obligation to run the Nation, and it is my strong conviction that New York City will be a Complete and Total Economic and Social Disaster should Mamdani win.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Zohran Mamdani Elected New York City Mayor",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/GettyImages-2244031537.jpg?crop=0px%2C0px%2C4000px%2C2250px&resize=1000%2C563"
      ],
      "datePublished": "2025-11-05T02:45:10.000Z",
      "dateModified": "2025-11-05T02:45:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Violent Ends’ Review: A Family Cartel Self-Destructs in All the Expected Ways",
    "url": "https://variety.com/2025/film/reviews/violent-ends-review-1236566461/",
    "image": "https://variety.com/wp-content/uploads/2025/10/violent-ends-review.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-05T00:00:00.000Z",
    "description": "\n\tGenerations of mob rule are undone by a standard-issue revenge tale in “Violent Ends,” a sparing but basically styleless thriller that chronicles a ",
    "body": "\n\tGenerations of mob rule are undone by a standard-issue revenge tale in “Violent Ends,” a sparing but basically styleless thriller that chronicles a crime family’s unremarkable infighting in the boondocks of Arkansas’ Ozarks. For his long-in-the-works sophomore feature, writer-director John-Michael Powell maintains a likably low-key interest in the local flavor of his home state, but it’s small potatoes in terms of personality. His self-serious approach proves a terminal match for his crime yarn’s familiar, simplistic plotting.\n\t\n\n\tAs suggested by its title, lifted from Shakespeare’s “Romeo and Juliet,” “Violent Ends” begins with a pair of naive, star-crossed lovers, caught up in a turf war between two households both alike in dignity. Gruff country boy Lucas Frost (Billy Magnussen) has fallen for the buttoned-up bank teller Emma Darling (Alexandra Shipp), a rather inexplicable pairing that the two leads visibly exert their charms to make plausible. They’ve got marriage on the horizon and kids on the brain, but being a Frost comes with some heavy baggage. The bloodline has split into two parallel cartel businesses, and there’s a long family tradition of big-manning and power grabs. \n\n\n\t“Violent Ends” lays its scene with opening title cards that recall “Fargo” in their dubious suggestion of a true story, but more function like the “Star Wars” opening crawl, dropping audiences in the midst of a long-waged battle. There’s more exposition to come — more than the powder keg setup really needs. But the fuse is lit when Lucas’ swaggering, sociopathic cousin Sid (the always good James Badge Dale) leaves prison, practically licking his lips as he makes plans to take over the family business.\n\t\n\n\tHis power play comes crashing into Emma’s day-to-day in a standout sequence — one that’s very tense, but also seems unaware of the loaded imagery of a Black woman having a gun pulled on her. The way this standoff ends, which effectively transforms “Violent Ends” into a revenge tale, reeks of convenience. It’s a stink the film never recovers from.\n\n\tIt’s not that Powell’s subsequent approach is immature or distastefully bloodthirsty. The violent ends of “Violent Ends” weren’t engineered for spectacle, but instead unfold as matter-of-fact encounters with few flourishes. But the film is similarly spare in its tilt into tragedy, rummaging for dramatic weight in some paper-thin flashbacks and stilted, moral-measuring arguments. They’re dull foundations that end up trivializing the story’s grim conclusions, wasting the patience the film shows in arriving at them.\n\n\tIt’s most acutely felt in Lucas’ central arc about re-entering the family business. Magnussen has proven a great on-screen presence, with memorable turns in the indie “Ingrid Goes West” and the blockbuster “No Time to Die.” But here, the actor seems less adept at fleshing out the inner turmoil of a man acquiescing to violence, not that Powell puts many words to the character’s pain on the page. A pivotal sequence, in which Lucas fully commits to bloodshed, loses its edge by unlocking the character’s inner poet for some reason, climaxing with a corny monologue about rattlesnakes. Pitched as a slow burn, “Violent Ends” mostly moves in a series of lurches, hitting one writerly standoff after another and leaving its actors to try to fill in the psychological gaps in between.\n\n\tPowell had a decent idea in casting a bunch of huffing, puffing bosses and bumbling goons to fill out the Frost family — enough to make Lucas’ pretty boy seem intimidating by comparison. Moreover, the canny ensemble casting suggests the Frost dynasty’s precarious state better than the film’s dialogue does. If these hotheads are in charge and lugs are doing the dirty work, things really have gotten too sloppy to last.\n\n\tBut “Violent Ends” doesn’t make much of an impression outside of such small pockets, even with its emphasis on its setting. Powell, along with DP Elijah Guess, shoot Arkansas civilization like a wasteland: a derelict region of dusty homes and cavernous warehouses. There are some memorable locations — a dirt track with a bumping nightlife, a greasy spoon that looks hundreds of years old — but more often, the film’s world seems generic and, worse, unpopulated. Who is even buying all the Frost family’s drugs? A lot of bodies pile up in “Violent Ends,” but the film doesn’t convey enough life to earn much mourning.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Violent Ends’ Review: A Family Cartel Self-Destructs in All the Expected Ways",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/violent-ends-review.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-05T00:00:00.000Z",
      "dateModified": "2025-11-05T00:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Aerobics-Fueled Time Travel Rom-Com ‘Goodbye My Love’ Lands at Taiwan Creative Content Fest",
    "url": "https://variety.com/2025/film/markets-festivals/aerobics-time-travel-rom-com-goodbye-my-love-tccf-1236570018/",
    "image": "https://variety.com/wp-content/uploads/2025/11/Goodbye-My-Love-art.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-05T00:20:08.000Z",
    "description": "\n\tA new romantic comedy from Taiwan has landed at the Taiwan Creative Content Fest (TCCF). “Goodbye My Love,” helmed by director Yin Chen-hao, reimagi",
    "body": "\n\tA new romantic comedy from Taiwan has landed at the Taiwan Creative Content Fest (TCCF). “Goodbye My Love,” helmed by director Yin Chen-hao, reimagines the Korean series “Do It One More Time” (alternatively titled “Go Back”) for Taiwanese audiences. Producer Jin Pai-lunn is leveraging the festival platform to court international collaborators and distributors.\n\n\tThe film centers on an exhausted homemaker whose life takes an unexpected turn when an unusual accident catapults her back in time to her younger years. In this second chance at life, she transforms from a factory worker into a celebrated aerobics champion, forming an unlikely partnership with a woman who was once her competitor. However, destiny has one more surprise in store.\n\t\n\n\tYin received a best new director nod at the 2021 Golden Horse Awards for his first feature, “Man in Love,” and most recently saw his series “GG Precinct” debut on Netflix in 2024.\n\n\n\t“What intrigued me most was the female lead’s courage to re-experience her life,” Yin says. “Through the story’s unique ‘dual time-travel’ concept, we explore themes of love and self-discovery in a way that feels lighthearted yet thought-provoking. In our adaptation, we added a vibrant 1990s aerobics world to highlight the diversity and romance of female empowerment.”\n\n\tThe director emphasizes the film’s underlying message of hope. “Life is a continuous journey of choices, and there’s no turning back, and regrets are inevitable,” he explains. “Through this film, I hope to inspire a sense of hope and remind audiences that it’s never too late to change. Every small step we take can become a giant leap toward a new life.”\n\t\n\n\tCalendar Studios, established by Jin in 2020, serves as the production banner. The company has built a portfolio that includes television series such as “GG Precinct” and “The Pond,” alongside theatrical releases “Man in Love” and “Marry My Dead Body.” Jin’s expertise lies in developing narratives and coordinating film and television resources.\n\n\tThe writing team pairs Ryan Tu with SzHui Liu. Tu, who launched his screenwriting career in 2001, counts among his television work “Light the Night,” “Living,” “Holiday,” and “At the Moment,” while also making his feature directorial bow with “My Best Friend’s Breakfast.” Liu transitioned from advertising copywriting to screen storytelling, drawing on her academic background in Chinese literature and design. Her previous credits include “At the Moment” and “Holiday.”\n\n\tAccording to Jin, the project is currently in the scene outline stage. The team aims to complete the screenplay and begin casting discussions next year, with production preparations expected to start in the latter half of the year.\n\n\t“In recent years, we’ve seen an increasing diversity in romantic storytelling,” Jin says. “Beyond the classic campus and urban romances, the market has shown growing interest in second-chance or remarriage themes, which reflect modern lifestyles. I hope this relatable story can resonate widely and attract attention from international partners and distributors during TCCF, helping us lay a strong market foundation for the project early on.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Aerobics-Fueled Time Travel Rom-Com ‘Goodbye My Love’ Lands at Taiwan Creative Content Fest",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/Goodbye-My-Love-art.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-05T00:20:08.000Z",
      "dateModified": "2025-11-05T00:20:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kristen Stewart Slams Hollywood’s Treatment of Women Filmmakers After ‘Brief Moment of Progress’ Post-MeToo: ‘It Is Devastating’",
    "url": "https://variety.com/2025/film/columns/kristen-stewart-slams-hollywoods-treatment-of-women-filmmakers-post-metoo-1236569984/",
    "image": "https://variety.com/wp-content/uploads/2025/11/GettyImages-2244538505.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-05T00:48:10.000Z",
    "description": "\n\tKristen Stewart delivered rousing remarks Tuesday afternoon during the keynote address at the Academy and Chanel’s Women’s Luncheon in Los Angeles.\n",
    "body": "\n\tKristen Stewart delivered rousing remarks Tuesday afternoon during the keynote address at the Academy and Chanel’s Women’s Luncheon in Los Angeles.\n\n\tThe actress and director – her feature film directorial debut, “The Chronology of Water,” is in theaters next month — slammed Hollywood for failing to live up to its post-MeToo goals and efforts.\n\n\t“In a post-MeToo moment, it seemed possible that stories made by and for women were finally getting their due, that we might be allowed or even encouraged to express ourselves and our shared experiences, all of our experiences without filter,” she said after being introduced by Academy president Lynette Howell Taylor. “But I can now attest to the bare-knuckle brawling that it takes every step of the way when the content is too dark, too taboo, when the frankness with which it serves up observations about experiences routinely experienced by women, frequently provokes disgust and rejection.”\n\t\n\n\tShe argued that these experiences are true and deserve to be told with authenticity.\n\n\tIn a moment that earned laughs and applause, Stewart shared, “I am in a severe state of PMS today…But I relish being able to say that my nerves are close to the surface of my skin, and it is a great day for that.”\n\n\tShe went on to say, “We can discuss wage gaps and taxes on tampons and measure [inequality] in lots of quantifiable ways, but the violence of silencing, it’s like we’re not even supposed to be angry. But I can eat this podium with a fork and fucking knife. I’m so angry.”\n\n\tLooking out at the luncheon guests – including Tessa Thompson, Sarah Paulson, Julia Louis Dreyfuss, Patty Jenkins, Alicia Silverstone, Riley Keough, Zoe Deutch, Joey King, Claire Foy, Odessa A’zion, Ruth E, Carter, Kate Hudson, Indya Moore, Embeth Davidtz, Diane Warren, Katy O’Brian and Tig Notaro, among many others – gathered on the Academy Museum of Motion Pictures’ Dolby Family Terrace, Stewart said, “The backsliding from a brief moment of progress is statistically devastating. It is devastating. Such a pitiful number of films from the past year have been made by women. We obviously need many more women’s luncheons in our lives. We need to become ladies who lunch all the fucking time.”\n\t\n\n\tShe continued, “There are too few of us. We’re all here together now, and it seems like there’s a lot, Jesus Christ, there’s not. It’s not our fault. Sure, our business is in a state of emergency, man, and you know the last thing that I wanna do here is lose the celebration under a pile of pissed off rubble. We are allowed to be proud of ourselves and maybe to allow each other to reclaim the gratitude we’ve all become talented at performing and really taste it from the inside out.”\n\n\tStewart received several rounds of applause over the course of her seven-minute speech.\n\n\t“I am thankful to you,” she said. “I am not grateful to a boys’ club business model that pretends to want to hang out with us while siphoning our resources and belittling our true perspectives. Let’s try and not be tokenized. Let’s start printing our own currency.”\n\n\tOn the red carpet, Kate Hudson shared with me the moment she saw and was inspired by a woman in power in Hollywood. “For me, it was Ann-Margaret in ‘Bye Bye Birdie,’” the “Song Sung Blue” star said. “I was obsessed with ‘Bye Bye Birdie.’ There’s this dance that she does and her hair’s going and I was like, ‘Oh, my God, I have to do that.’”\n\n\t“Train Dreams” star Felicity Jones recalled speaking up for herself when she was just 12 years old and quitting a television series show called “The Worst Witch” after just one season. “I just didn’t want to come back and do the second [season],” she said. “Even at that age, I remember being very clear that one [season] was enough and I didn’t want to return for any more. Now I look back and think, ‘Wow, I was obviously very decisive and knew what I wanted at that age.’”\n\n\tThe afternoon also included Oscar-winning costume designer Ruth E. Carter presenting year’s Gold Fellowship for Women recipients Alina Simone and Marlén Viñayo.\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kristen Stewart Slams Hollywood’s Treatment of Women Filmmakers After ‘Brief Moment of Progress’ Post-MeToo: ‘It Is Devastating’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/GettyImages-2244538505.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-05T00:48:10.000Z",
      "dateModified": "2025-11-05T00:48:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Real Housewives of Beverly Hills’ Season 15 Trailer: Rachel Zoe Makes Her Debut, Denise Richards Returns and a Potential New Villain Arrives (TV News Roundup)",
    "url": "https://variety.com/2025/tv/news/tv-news-roundup-week-of-november-3-1236567612/",
    "image": "https://variety.com/wp-content/uploads/2025/11/3.-RHOBH_S15_Vertical_Clean.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-05T00:33:32.000Z",
    "description": "\n\tThe ladies of “The Real Housewives of Beverly Hills” are back with a new trailer for the upcoming season.\n\n\tFull-time Housewives Erika Jayne, Dorit ",
    "body": "\n\tThe ladies of “The Real Housewives of Beverly Hills” are back with a new trailer for the upcoming season.\n\n\tFull-time Housewives Erika Jayne, Dorit Kemsley, Kyle Richards, Bozoma St. John and Sutton Stracke are back for Season 15, which premieres on Dec. 4 on Bravo. Episodes will be available to stream the next day on Peacock. They are joined by Kathy Hilton, Jennifer Tilly and newbie Natalie Swanston Fuller as “friends” of the cast.\n\t\n\n\tIn addition to the returning cast, fashion designer Rachel Zoe’s returns to Bravo after more than a decade as a new housewife. Also joining the group is newcomer Amanda Frances, a businesswoman who is friends with Richard and lives in her former family home.\n\n\n\tNotably missing from the group is their former castmate Garcelle Beauvais. In March, she announced her departure from the show in an Instagram video, leading up to the broadcast of the Season 14 reunion in April. The final reunion episode ended with Beauvais declining to take a cast photo, choosing to walk off the set instead.\n\n\tAccording to the official synopsis for Season 15, “the ladies of Beverly Hills jet set across the globe, from the surf lodges of the Hamptons to the rocks of Sedona, and the sun-drenched villas of Florence. They strengthen their bonds and indulge along the way, but the highs prove temporary. Beneath the gloss and glamour, old wounds reopen as shifting alliances take shape and the women find that loyalty is never guaranteed in the picturesque 90210.”\n\n\tCheck out the dramatic trailer below:\n\n\n\n\t\n\t\tDEALS\t\n\n\tIn The Black Network, the PVOD streamer dedicated to telling Black stories and amplifying Black voices, is partnering with entertainment investment platform Rainmaker Films & Holdings to expand its original content, distribution network and investment impact. \n\t\n\n\tRainmaker will guide ITBN through its growth initiatives, handling business strategy, content development and capital partnerships.\n\n\tITBN Founder and CEO James DuBose states, “Partnering with Rainmaker Films & Holdings marks a pivotal step in scaling In The Black Network into a global platform for diverse creators. Their deep experience in financing and growing media companies complements our mission to build a sustainable, creator-centered ecosystem that drives both cultural and commercial impact.”\n\n\tThe deal was closed on Oct. 31.\n\t\n\t\tGREENLIGHTS\t\n\n\tMGM+ has greenlit “The Hillside Strangler,” a four-part true-crime docuseries that explores the infamous murders that gripped Los Angeles in the late 1970s and the investigation that followed. The docuseries will premiere on Jan. 18. \n\n\tThe series will follow the investigation of the Hillside Strangler, who struck without warning, abducting, raping, and murdering a dozen women and girls and leaving their bodies displayed on the hillsides. The crimes sparked the largest manhunt in LA’s history, led by a relentless homicide detective. \n\n\t“’The Hillside Strangler’ is a compelling deep dive into an infamous serial killing that terrorized Southern California in the late 1970s,” said Michael Wright, head of MGM+. “This docuseries delivers a riveting experience with unprecedented access to one of the most notorious cases in American criminal history, offering MGM+ viewers the premium, thought-provoking storytelling they’ve come to expect from our brand.”\n\n\tPeter LoGreco serves as the docuseries’ showrunner and director, with Eli Holzman and Aaron Saidman executive producing for The Intellectual Property, a part of Sony Pictures Television and Tim Walsh.\n\t\n\t\tPARTNERSHIPS\t\n\n\tAMC+, MGM+ and STARZ have launched a new triple bundle exclusively on Prime Video in the U.S. for $19.99 a month – a 31% savings over buying the streaming services independently.\n\n\t“The Walking Dead: Daryl Dixon” and the third series of “Anne Rice’s Talamasca: The Secret Order” on AMC+, “From” and “The Institute” on MGM+ are featured on the streaming services. Additionally, the romantic adventure “Robin Hood” on “MGM+ alongside the final season of “Power Book IV: Force” and “Outlander: Blood of My Blood” on STARZ are also included within the bundle.\n\t\n\t\n\t\tINITIATIVES\t\n\n\tKristen Bell, Kyle MacLachlan and Eric Adjepong teamed up with Save the Children to spotlight the impact of Head Start and early childhood education during Head Start Awareness Month in October.\n\n\tFor the launch, a video was posted on Instagram that featured the trio reading and interacting with children in Save the Children-supported Head Start and early programs in the U.S. Additionally, they shared messages on why early learning matters, acknowledging how Head Start helps kids build strong foundations for lifelong success.\n\n\tCheck out the video below: \n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Real Housewives of Beverly Hills’ Season 15 Trailer: Rachel Zoe Makes Her Debut, Denise Richards Returns and a Potential New Villain Arrives (TV News Roundup)",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/3.-RHOBH_S15_Vertical_Clean.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-05T00:33:32.000Z",
      "dateModified": "2025-11-05T00:33:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Harry Potter’ Audible Books Cast Guide: All the Hollywood Stars Voicing Hogwarts Characters",
    "url": "https://variety.com/lists/harry-potter-audible-cast-characters-audio-books/",
    "image": "https://variety.com/wp-content/uploads/2025/10/feat-image.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-05T00:00:00.000Z",
    "description": "\n\t\n\t\t\t\n\t\t\t\t\n\t\n\n\t\n\tNov 4, 2025 4:00pm PT\t\n\t\n\n\t\n\t\t‘Harry Potter’ Audible Books Cast Guide: All the Hollywood Stars Voicing Hogwarts Characters\n\t\n\t\n\t\t\t\n\n",
    "body": "\n\t\n\t\t\t\n\t\t\t\t\n\t\n\n\t\n\tNov 4, 2025 4:00pm PT\t\n\t\n\n\t\n\t\t‘Harry Potter’ Audible Books Cast Guide: All the Hollywood Stars Voicing Hogwarts Characters\n\t\n\t\n\t\t\t\n\n\n\t\t\t\n\t\t\t\n\t\n\n\t\t\t\t\t\t\t\t\tWarner Bros. / Getty\n\t\n\n\t\t\n\t\n\t\t\t\t\n\n\t“Harry Potter” is coming to life in two major ways: HBO’s upcoming TV series and Audible’s narrated audiobooks of all seven of J.K. Rowling’s novels.\n\n\tThe HBO series is still more than a year away, but Audible’s version of “Harry Potter and the Sorcerer’s Stone” will be released on Nov. 4. Each subsequent book will be released a month apart, culminating with “Deathly Hallows” on May 12. \n\n\tWhile HBO’s and Audible’s casts are both star-studded (and share one key actor), Audible could focus on the voice of each performer rather than find someone who looked like Rowling’s characters from the books. Audible also split up some of the Hogwarts students to give them a young voice for “Sorcerer’s Stone,” “Chamber of Secrets” and “Prisoner of Azkaban,” then replace them with an older actor for “Goblet of Fire,” “Order of the Phoenix,” “Half Blood Prince” and “Deathly Hallows.”\n\n\tFrankie Treadaway, Max Lester and Arabella Stanton star as Harry, Ron and Hermione in the first three books, with Jaxon Knopf, Rhys Mulligan and Nina Barker-Francis taking over for the final four. Notably, Stanton was also cast as Hermione in HBO’s series, giving listers of the Audible books a sneak peek at what her performance will be like in live-action.\n\n\tAudible’s Hogwarts is filled with more than 200 actors and many big-name Hollywood stars. Hugh Laurie plays Dumbledore, Matthew Macfadyen is Voldemort, Riz Ahmed is Snape, Kit Harington is Gilderoy Lockhart, Keira Knightley is Dolores Umbridge and James McAvoy is Mad-Eye Moody.\n\n\tSee all of the cast members in Audible’s “Harry Potter” series below.\n\n\n\t\t\t\n\t\t\t\n\tHarry Potter (Frankie Treadaway)\n\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\n\tFrankie Treadaway will star as young Harry Potter in books 1-3. Treadaway is a theater actor with stage credits in “Matilda the Musical, “Peter Pan,” “Mary Poppins,” “Elf” and “Mrs. Doubtfire.” Daniel Radcliffe first brought Harry to life in the films and Dominic McLaughlin will take charge in the HBO series.\n\t\t\n\t\t\t\n\t\t\t\n\tRon Weasley (Max Lester)\n\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\n\tMax Lester will assume the role of Harry’s partner in crime, Ron Weasley, in books 1-3. The redhead wizard is Harry’s best friend at Hogwarts and a member of Gryffindor House at Hogwarts. The young actor possesses a diverse portfolio with an acting role in “The Fantastic Four: First Steps” to stage credits in “Les Misérables” and “Leopoldstadt.” He has also lent his voice to animations such as “Best Birthday Ever” and “Barbapapa,” as well as the BBC Radio 4 comedy series “Hennikay.” Alastair Stout is set to play Ron on the HBO series.\n\t\t\n\t\t\t\n\t\t\t\n\tHermione Granger (Arabella Stanton)\n\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\n\tYoung Hermione Granger in books 1-3 will be voiced by Arabella Stanton, who will also play the main character in the upcoming HBO show. Considered to be one of the smartest witches in Hogwarts, Hermione is also a close friend to Harry and Ron. Stanton debuted as Matilda in “Matilda the Musical” and went on to perform in “Starlight Express” before joining the fantasy franchise.\n\t\t\n\t\t\t\n\t\t\t\n\tHarry Potter (Jaxon Knopf)\n\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\n\tAs Harry grows older in books 4-7, the torch will be passed to Jaxon Knopf to voice the titular character. Knopf previously starred in plays “Big Fish, The Musical” and “Joseph and the Amazing Technicolor Dreamcoat” as well as film roles in “Moishe.” He also voiced Ricky Zoom in the animation series of the same name.\n\t\t\n\t\t\t\n\t\t\t\n\tRon Weasley (Rhys Mulligan)\n\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\n\tRhys Mulligan will voice an older version of Ron Weasley in books 4-7. Mulligan has a dynamic performance background in theatre, on screen and voice acting. He has recently starred in “Matilda the Musical,” “Goodnight Mr. Tom,” “The Musicians,” “A Christmas Carol” and “Mr. Duncan.”\n\t\t\n\t\t\t\n\t\t\t\n\tHermione Granger (Nina Barker-Francis)\n\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\n\tAs Hermione comes of age, Nina Barker-Francis will step in as the teenage witch in books 4-7. She previously voiced the secondary lead role of Whitley in the animated series “Wolf King.” Her other TV credits include the sci-fi thriller “Moonhaven,” “The Jetty,” “House of the Dragon,” “The Power” and “Flack.”\n\t\t\n\t\t\t\n\t\t\t\n\tAlbus Dumbledore (Hugh Laurie)\n\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\n\n\tHugh Laurie will bring to life Dumbledore, the Headmaster of Hogwarts School of Witchcraft and Wizardry. As a central figure in the series, Dumbledore plays a crucial role in mentoring Harry to learn magic and defeat Lord Voldemort. Laurie is an award-winning actor, producer, writer, musician and director who is best known for starring in the drama series. “House.” He has also appeared in films including “Tomorrowland,” “Flight of the Phoenix,” “Mr. Pip,” among other projects. Dumbledore was first played by Richard Harris, who died before the third movie filmed and was recast with Michael Gambon. John Lithgow is set to portray Dumbledore in the forthcoming “Harry Potter” series. \n\n\t\t\n\t\t\t\n\t\t\t\n\tLord Voldemort (Matthew Macfadyen)\n\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\n\tLord Voldemort is a powerful dark wizard whose ultimate goal is to achieve immortality and take over the wizarding world. After failing to kill Harry as an infant, his body was destroyed but later resurrected with a snake-like face. Matthew Macfadyen will lend his voice to the main antagonist. Macfayden is an award-winning actor with credits in “Succession,” “Pride and Prejudice,” “Any Human Heart,” Criminal Justice” and more. Ralph Fiennes memorably played Voldemort in the movies.\n\t\t\n\t\t\t\n\t\t\t\n\tSeverus Snape (Riz Ahmed)\n\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\n\tSeverus Snape is the head of the Slytherin House and known for his hostility towards Harry and his friends. Snape begins as the potions instructor at Hogwarts, but it’s no secret he has his eye on the Defense Against the Dark Arts class. Riz Ahmed most recently starred in Wes Anderson’s latest feature, “The Phoenician Scheme.” He has also acted in “Relay,” “Sound of Metal” and more. Alan Rickman famously played Snape in the movies, and Paapa Essiedu will portray Snape in the HBO series.\n\t\t\n\t\t\t\n\t\t\t\n\tDraco Malfoy (Jude Farrant)\n\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\n\tHarry’s nemesis, Draco Malfoy, comes from a long lineage of pure-blooded wizards, finding himself sorted into the Slytherin house. Throughout the books, Draco and Harry often go head-to-head at Hogwarts, and where Malfoy will do whatever it takes to get what he wants. Tom Felton played the role in the original movies.\n\t\t\n\t\t\t\n\t\t\t\n\tDraco Malfoy (Maximus Evans) \n\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\n\tMaximus Evans will voice teenage Draco in books 4-7. Evans has TV credits in “Coronation Street,” “The Bay” and “Creeped Out.” Lox Pratt will portray Harry’s arch nemesis in the HBO series. \n\t\t\n\t\t\t\n\t\t\t\n\tNeville Longbottom (Jake Sigsworth)\n\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\n\tNeville Longbottom, portrayed by Jake Sigsworth in books 1-3, is in Gryffindor and a member of the one of the last remaining pure-blood families in the wizarding world. Audible’s adaptation of the “Harry Potter” books will be the first major role for Sigsworth, who doesn’t have any prior acting credits. Rory Wilmot will play Neville in the HBO series. Matthew Lewis originated the role in the movies.\n\t\t\n\t\t\t\n\t\t\t\n\tNeville Longbottom (Archie Mountain)\n\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\n\tArchie Mountain is set to voice an older Neville in books 4-7. Known for his clumsiness, Neville is initially underestimated but becomes a hero after helping Harry in several of his biggest magical fights. This will be Mountain’s first major role.\n\t\t\n\t\t\t\n\t\t\t\n\tRubeus Hagrid (Mark Addy)\n\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\n\tMark Addy’s greatest contribution to the fantasy genre may be playing the brutish King Robert Baratheon in “Game of Thrones,” but he will showcase a gentler touch in the “Harry Potter” audiobooks, voicing Hogwart’s warmhearted Keeper of Keys, Rubeus Hagrid. A fan-favorite character, Hagrid is a tender and gregarious confidant of Harry and his friends throughout all seven books. Robbie Coltrane first brought the character to life in the films and Nick Frost will take up the mantle in the HBO series.\n\t\t\n\t\t\t\n\t\t\t\n\tMinerva McGonagall (Michelle Gomez)\n\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\n\tScottish actress Michelle Gomez, best known for her parts in “Doctor Who,” “The Chilling Adventures of Sabrina” and “The Flight Attendant,” will voice Hogwarts transfiguration professor and Head of Gryffindor House, Minerva McGonagall. A stern, yet steady presence in the school, McGonagall often appears as second in command behind Dumbledore. Maggie Smith portrayed her in the “Potter” films and Janet McTeer will play her in the series.\n\t\t\n\t\t\t\n\t\t\t\n\tProfessor Lockhart (Kit Harrington)\n\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\n\tProfessor Gilderoy Lockhart is a celebrity and author of books detailing his journey and adventures with dark creatures. He becomes the Professor of Defense Against the Dark Arts at the Hogwarts School of Witchcraft and Wizardry, where Harry and other Hogwarts students found him to be obnoxious and full of himself. Harington previously starred as Jon Snow in HBO’s “Game of Thrones” and also appeared in Marvel’s “Eternals.” Kenneth Branagh played Lockhart in the movies.\n\t\t\n\t\t\t\n\t\t\t\n\tProfessor Umbridge (Keira Knightley)\n\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\n\tThe colorful Dolores Umbridge served as the Senior Undersecretary to the Ministry of Magic, later becoming installed as the Defense Against The Dark Arts Professor at Hogwarts. During her time at Hogwarts, Umbridge is abusive and cruel to the students, especially to Harry, Ron and Hermione. Knightley is known for her work in films like “Pirates of the Caribbean,” “Atonement,” “Pride and Prejudice,” and Netflix’s “Black Doves” series. Imelda Staunton played Umbridge in the movies.\n\t\t\n\t\t\t\n\t\t\t\n\tLucius Malfoy (Alex Hassell)\n\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\n\tThe patriarch of the Malfoy family, Lucius Malfoy is a princely and sneering figure introduced in the second “Potter” book. His character only grows viler as the saga progresses. Jason Isaacs played Lucious in the films and Johnny Flynn will play him on HBO. Alex Hassell will voice the character in the audiobooks. Hassel has previously appeared in “The Boys,” “Cowboy Bebop,” “His Dark Materials” and “Rivals,” and has preformed copiously on stage as a founding member of the Factory Theatre Company.\n\t\t\n\t\t\t\n\t\t\t\n\tProfessor Lupin (Iwan Rheon)\n\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\n\tProfessor Remus Lupin is the Defense Against The Dark Arts professor and is highly regarded as one of the best professors at Hogwarts during his time. Lupin is one of Harry’s favorite teacher, and he helps the young wizard on conjuring a Patronus during his younger years. Secretly, Lupin is a werewolf and hides his powers from his students. Iwan Rheon previously starred as Ramsay Bolton in HBO’s “Game of Thrones,” BBC’s “Vicious,” and “Those About To Die.” David Thewlis played Lupin in the movies.\n\t\t\n\t\t\t\n\t\t\t\n\tSirius Black (Ṣọpẹ́ Dìrísù)\n\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\n\tṢọpẹ́ Dìrísù of “Slow Horses,” “Gangs of London” and “Black Rabbit” will voice fan-favorite character Sirius Black. Harry’s godfather, Sirius is first believed to be a traitor to Harry’s parents and a murderous Deatheater in “Prisoner of Azkaban.” However, by the end of the book, he is revealed to be innocent and becomes the closest thing to Harry has to a father figure. Dìrísù’s “Slow Horses” co-star Gary Oldman played Sirius in the movies.\n\t\t\n\t\t\t\n\t\t\t\n\tMad-Eye Moody (James McAvoy)\n\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\n\tConsidered to be one of the most famous aurors, Mad-Eye Moody was another one of the Defense Against the Dark Arts professors at Hogwarts. James McAvoy previously played Charles Xavier in “X-Men: First Class,” with other roles in films like “Atonement,” “Split,” and “Speak No Evil.” Brendan Gleeson first played Mad-Eye in the movies.\n\t\t\n\t\t\t\n\t\t\t\n\tArthur Weasley (Simon Pegg)\n\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\n\tThe head of the Weasley family, Arthur is the head of Office for the Detection and Confiscation of Counterfeit Defensive Spells and Protective Objects. Simon Pegg has starred in films such as “Shaun of The Dead,” “Hot Fuzz,” and the “Mission: Impossible” franchise. Mark Williams first played Bill in the movies.\n\t\t\n\t\t\t\n\t\t\t\n\tBill Weasley (Leo Woodall)\n\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\n\tBill is the oldest child of the Weasley family, who later comes back home after working for Gringotts Wizarding Bank as a curse-breaker. Woodall previously starred as Dexter Mayhew in Netflix’s “One Day,” and also appeared as Jack in Season 2 of HBO’s “The White Lotus.” Domhnall Gleeson first played Bill in the movies.\n\t\t\n\t\t\t\n\t\t\t\n\tNymphadora Tonks (Ambika Mod)\n\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\n\tNymphadora Tonks is an auror at the Ministry of Magic and a Metamorphmagus, meaning she can transform her appearance. Ambika Mod is known for her role as Emma Morley in the Netflix adaptation of “One Day,” and played Shruti Acharya in “This Is Going To Hurt.” Natalia Tena first played the character in the movies.\n\t\t\n\t\t\t\n\t\t\t\n\tBellatrix Lestrange (Ruth Wilson)\n\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\n\tThe evil Bellatrix Lestrange is one of Voldemort’s most trusted Death Eaters. Ruth Wilson has starred in projects such as “His Dark Materials,” “The Affair,” and “Ms. Wilson.” Helena Bonham Carter played Bellatrix in the movies.\n\t\t\n\t\t\t\n\t\t\t\n\tDobby (Daniel Mays)\n\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\n\tDobby the House Elf is a fierce admirer of Harry Potter’s, sometimes to Harry’s own chagrin. He gets Harry into lots of trouble trying to save him. The wide-eyed, bat-eared, falsetto-voiced diminutive creature makes his first appearance in “Harry Potter and the Chamber of Secrets” as a slave to the Malfoy family. He then appears sporadically throughout the successive books. Dobby was created as a CGI puppet in the films and voiced by Toby Jones. In the new audiobooks, Daniel Mays from “Mrs. Biggs,” “The Thursday Murder Club” and “EastEnders” will lend his voice to the unique character.\n\t\t\n\t\t\t\n\t\t\t\n\tLuna Lovegood (Millie Gubby)\n\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\n\tA member of the Ravenclaw house, Luna Lovegood becomes one of Harry’s friends and key supporters in “Order of the Phoenix.” She’s a quirky and odd student, who takes a liking to magical creatures. This will be Millie Gubby’s first major role, and Evanna Lynch first played the character in the movies.\n\t\t\n\t\t\t\n\t\t\t\n\tProfessor Trelawney (Saoirse-Monica Jackson)\n\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\n\tIrish actress Saoirse-Monica Jackson of “Derry Girls” and “This City Is Ours” will voice Hogwarts Divination teacher, Professor Sybill Trelawney. A woman of uncertain abilities, Professor Trelawney spends more time talking about her magical premonitions that actually experiencing them. However, she does showcase real powers on a few key occasions. Emma Thompson played Professor Trelawney in the films. \n\t\t\n\t\t\t\n\t\t\t\n\tRita Skeeter (Anna Maxwell Martin)\n\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\n\tAnna Maxwell Martin will voice Daily Prophet gossip columnist Rita Skeeter. Skeeter makes her first appearance in “Harry Potter and the Goblet of Fire,” publishing salacious articles about Harry as he competes in the Triwizard Tournament. Martin previously appeared in the BBC adaptations of “Bleak House” and “Poppy Shakespeare” as well as “Line of Duty,” “Code 404” and “Motherland.” She’s previously contributed to the fantasy genre on stage, playing Lyra Belacqua in a National Theater adaptation of “His Dark Materials.” Skeeter was played by Miranda Richardson in the “Potter” films.\n\t\t\n\t\t\t\n\t\t\t\n\tParvati Patil (Avni Deshmukh)\n\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\n\tOne of the Patil twins, Parvati is a Gryffindor in the same year as Harry. Her biggest part in the “Potter” saga comes in “Harry Potter and the Goblet of Fire,” when she attends the Yule Ball with Harry. Sitara Shah first brought Parvati to the screen in the third Potter movie before Shefali Chowdhury took over the role in subsequent films. Newcomer Alessia Leoni will play Parvati in the HBO series and internet personality Avni Deshmukh of digital duo “Sara and Avni” will voice her in the audiobook.\n\t\t\n\t\t\t\n\t\t\t\n\tPadma Patil (Sara Deshmukh)\n\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\n\tParvati’s identical twin sister, Padma Patil is a Ravenclaw in Harry’s year at Hogwarts. She attends the Yule Ball with Ron in “The Goblet of Fire,” and ends up rightfully slighted by Ron’s petty attitude throughout the night. In “The Order of the Phoenix,” she is appointed as a Ravenclaw prefect and trains alongside Harry, Ron, Hermione and her sister in Dumbledore’s Army. Sharon Sandhu played Padma in “The Prisoner of Azkaban” movie before Afshan Azad took over the role in “Goblet of Fire” and beyond. Sara Deshmukh — Avni Deshmukh’s sister and the other half of their digital brand, ‘Sara and Avni”— will voice Padma in the audiobook.\n\t\t\n\t\t\t\n\t\t\t\n\tProfessor Slughorn (Bill Nighy)\n\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\n\tA unique character who emerges late in the series, Horace Slughorn takes up the mantle as Hogwarts’ Potions Professor after Snape starts teaching Defense Against the Dark Arts in the sixth book. An extremely tenured professor with regretful ties to Voldemort’s past, Slughorn plays a crucial role in the saga’s final act. Bill Nighy will voice the character, marking the actor’s return to the Wizarding World, as he played Minister of Magic Rufus Scrimgeour on screen in “Harry Potter and the Deathly Hallows Part 1.” Jim Broadbent played Slughorn in the films.\n\t\t\n\t\t\t\n\t\t\t\n\tStan Shunpike (David Holmes)\n\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\n\tDavid Holmes will voice Stan Shunpike, the driver of the Night Bus who first appears in “Harry Potter and the Prisoner of Azkaban.” Lee Ingleby previously played the character in the films. The audiobooks will not be Holmes’ first foray into the Wizarding World, as he served as Daniel Radcliffe’s stunt double in the first six films. An accident on the set of the seventh film left him partially paralyzed, though he still received credit as a stunt performer. He has since launched the podcast “Cunning Stunts” and was the subject of the 2023 HBO documentary, “David Holmes: The Boy Who Lived,” which Radcliffe executive produced. \n\t\t\n\t\t\t\n\t\t\t\n\tKreacher (Mackenzie Crook)\n\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\n\tA house-elf who is loyal to Sirius Black’s family, Kreacher serves Harry later in the book series. Mackenzie Crook is most known for his role as Gareth Keenan in “The Office,” Orell in HBO’s “Game of Thrones,” and Ragetti in the “Pirates of the Caribbean” film series.\n\t\t\n\t\t\t\n\t\t\t\n\tNearly Headless Nick (Stephen Mangan)\n\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\n\tSir Nicholas de Mimsy-Porpington, or known as Nearly Headless Nick, was a wizard of the royal court before being executed after a mishap. After being almost completely decapitated, Nick haunts Gryffindor Tower at Hogwarts and can pull his head off as a prank. Stephen Mangan has had previous roles in “Watership Down,” “Green Wing,” and as Dan Moody in “I’m Alan Partridge.”\n\t\t\n\t\t\t\n\t\t\t\n\tProfessor Sprout (Gemma Whelan)\n\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\n\tGemma Whelan, the actress best known for playing Yara Greyjoy in “Game of Thrones” and appearing in “Upstart Crow,” “The End of the F***ing World” and “Killing Eve,” will voice Hogwarts herbology professor, Pomona Sprout. The plant-loving teacher was previously portrayed by Miriam Margolyes in the “Potter” films and will be played by Sirine Saba in the upcoming series.\n\t\t\n\t\t\t\n\t\t\t\n\tMadam Hooch (Tracy-Ann Oberman)\n\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\n\tThe flying instructor and Quidditch referee at Hogwarts, Madam Hooch teaches students like Harry how to ride on broomsticks, overseeing Quidditch players, and making sure students are following rules at the school. Tracy-Ann Oberman previously played Chrissie Watts on BBC’s “Eastenders” and Valerie Lewis in Channel 4’s “Friday Night Dinner.”\n\t\t\n\t\t\t\n\t\t\t\n\tSir Cadogan (Matt Berry)\n\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\n\tSir Cadogan is a knight from the days of King Arthur. Though he died centuries ago, he is immortalized as one of the talking paintings at Hogwarts, still showcasing his excessive fearlessness from the canvas. Though Cadogan can only be caught as a fleeting background figure in the “Potter” movies, he has ample dialogue in the books. Comedian Matt Berry from “What We Do in the Shadows,” “The IT Crowd” and “A Minecraft Movie” lends his voice to the hilariously overzealous character.\n\t\t\n\t\t\t\n\t\t\t\n\tNarrator (Cush Jumbo)\n\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\n\tAmong the “Harry Potter” audiobooks’ all-star cast, Cush Jumbo will have the most prominent voice the throughout the series. Voicing the narrator, the British writer and actress best known for playing Lucca Quinn on CBS’s “The Good Wife” will be heard on every page of the seven volumes. Jumbo will be the new voice of the Wizarding World, just as Stephen Fry and Jim Dale respectively narrated the original British and American versions of the audiobooks as they released in the early aughts.\n\t\t\n\t\n\t\n\n\n\t\n\t\tMore from Variety\n\t\n\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\n\n\t\t\n\n\t\n\t\tMore From Our Brands\n\t\n\t\n\t\t\n\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\n\tRolling Stone\n\n\t\t\t\t\tZohran Mamdani Is the Mayor-Elect of New York City\t\t\n\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\n\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\n\tRobb Report\n\n\t\t\t\t\tMaurizio Cattelan’s New Solid-Gold Toilet Could Fetch $10 Million at Auction\t\t\n\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\n\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\n\tSportico\n\n\t\t\t\t\tTexas All-Star Cheer Gym Declares Bankruptcy Before Sex Abuse Trial\t\t\n\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\n\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\n\tWWD\n\n\t\t\t\t\tZohran Mamdani’s Wife Rama Duwaji Makes Art in Many Forms\t\t\n\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\n\t\t\n\t\n\t\n\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Harry Potter’ Audible Books Cast Guide: All the Hollywood Stars Voicing Hogwarts Characters",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/feat-image.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-05T00:00:00.000Z",
      "dateModified": "2025-11-05T00:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Streamer SypherPK and Wife Daniela Split, Business Partnership Remains",
    "url": "https://www.tmz.com/2025/11/04/sypherpk-wife-break-up/",
    "image": "https://imagez.tmz.com/image/68/16by9/2025/11/04/6880b2cd6fa34ab5a9df22f8fa996beb_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-04T22:09:16.000Z",
    "description": "\n    \n                    \n                          Streamer SypherPK & Wife Daniela\n                          We're Splitting Up\n                   ",
    "body": "\n    \n                    \n                          Streamer SypherPK & Wife Daniela\n                          We're Splitting Up\n                          ... But Business Remains Intact\n                      \n                  \n                        Published November 4, 2025 2:09 PM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          They say you can either be lucky in love or in business, and it seems like the latter for streamer SypherPK and his wife Daniela Ali ... they've announced they're separating.\n      \n    \n          While their personal relationship has crumbled, their business relationship is still intact ... according to statements from their respective social accounts.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Daniela wrote, \"After almost a decade of partnership in both life and business, Ali and I are moving forward on separate paths ... We remain co-owners of our shared ventures for the time being, and we'll continue to run them with care as we navigate this transition ...\"\n      \n\n                  \n          \n                          \n                \n                                  \n      \n    \n          SypherPK said just as much in his post, writing, \"We will continue working together on our shared ventures with respect and care ...\"\n      \n    \n          It's unclear when the couple married, but according to their statements, they enjoyed 10 years of partnership.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          They founded their company Oni Studios together in 2020, which quickly became a content creation powerhouse. According to its LinkedIn, the company helps creators develop their brands.\n      \n    \n          According to the website, its clients have included Paramount, Fortnite, Nvidia and Twitch.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Social Media\n              \n                          \n                Twitch\n              \n                          \n                Breakups\n              \n                          \n                Viral\n              \n                          \n                Fairly Legal\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Streamer SypherPK and Wife Daniela Split, Business Partnership Remains",
      "image": [
        "https://imagez.tmz.com/image/68/16by9/2025/11/04/6880b2cd6fa34ab5a9df22f8fa996beb_xl.jpg"
      ],
      "datePublished": "2025-11-04T22:09:16.000Z",
      "dateModified": "2025-11-04T22:09:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bass Pro Shops Brawl Allegedly Sparked by Man Taking Too Long in Restroom",
    "url": "https://www.tmz.com/2025/11/04/bass-pro-shops-fight-started-by-long-bathroom-trip/",
    "image": "https://imagez.tmz.com/image/28/16by9/2025/11/04/284d3c7c23684c3697f63bfb3b2fc61e_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-04T22:20:56.000Z",
    "description": "\n    \n                    \n                          BASS PRO SHOPS\n                          PISSED-OFF CUSTOMERS BRAWL OVER BATHROOM HOLD UP\n       ",
    "body": "\n    \n                    \n                          BASS PRO SHOPS\n                          PISSED-OFF CUSTOMERS BRAWL OVER BATHROOM HOLD UP\n                      \n                  \n                        Published November 4, 2025 2:20 PM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Bass Pro Shops brawlers got into a stink over a guy allegedly taking too long in the bathroom ... leading to the the s*** hitting the fan!\n      \n    \n          The rumble went down this past Saturday in Odessa, Texas ... and according to the police report -- obtained by TMZ -- the clash was caused by one guy accusing another guy of hogging the restroom.\n      \n    \n      \n      — Facts About Texas (@FactsAboutTexas) November 2, 2025\n              @FactsAboutTexas\n          \n  \n    \n          The man told cops his wife and child were waiting to use the bathroom ... and when the guy finally came out, he told him he'd been taking too long and there were people waiting.\n      \n\n          Cops say one of the men told them the tiff escalated ... with others getting involved, and the group eventually went outside -- but then came back into the store to throw down.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Fortunately, it looks like no one got wiped out -- but it did get messy ... with cops saying they observed one person with a bloody nose and another with a red mark on their chest.\n      \n    \n          In the end, cops say the men they talked to declined to press any charges and no arrests were made.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Insane Videos\n              \n                          \n                Fights\n              \n                          \n                Viral\n              \n                          \n                Exclusive\n              \n                          \n                Fairly Legal\n              \n                          \n                News\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bass Pro Shops Brawl Allegedly Sparked by Man Taking Too Long in Restroom",
      "image": [
        "https://imagez.tmz.com/image/28/16by9/2025/11/04/284d3c7c23684c3697f63bfb3b2fc61e_xl.jpg"
      ],
      "datePublished": "2025-11-04T22:20:56.000Z",
      "dateModified": "2025-11-04T22:20:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Celebrity Dog Tika the Iggy Dead at 14",
    "url": "https://www.tmz.com/2025/11/04/tika-the-iggy-dog-dead-dies/",
    "image": "https://imagez.tmz.com/image/e8/16by9/2025/11/05/e817032f85c441619a0539fbd786065f_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-05T00:54:27.000Z",
    "description": "\n    \n                    \n                          Internet Celeb Dog\n                          Tika The Iggy Dead at 14\n                      \n    ",
    "body": "\n    \n                    \n                          Internet Celeb Dog\n                          Tika The Iggy Dead at 14\n                      \n                  \n                        Published November 4, 2025 4:54 PM PST\n                                                                            \n      \n    \n      \n        \n              \n    \n    \n          Tika the Iggy, an Italian greyhound with a fashion sense and a huge internet following, is dead.\n      \n    \n          Tika's owner, Thomas Shapiro, announced her death Tuesday in a heartbreaking social media post.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Shapiro says Tika had two tumors in her liver and they had surgery to remove them -- on the advice of veterinarians -- and things seemed like they were going well.\n      \n\n          The surgery was a success, Shapiro says, and Tika was discharged from a clinic without complications ... and on her first night home, she had her favorite food, chicken, and everything appeared on the up and up.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          But Shapiro says Tika was totally different on the second day after surgery ... looking tired and not quite herself, but peaceful. He says vets believed it was just a side effect from pain killers, but he says they soon found out her body was \"slowly giving up.\"\n      \n    \n          Shapiro says Tika spent her final moments at home with her humans.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Tika had over 1.6 million Instagram followers and she was famous for showing off her fashionable outfits ... being hailed by some as \"a new fashion it girl\" and \"the Anna Wintour of dogs.\"\n      \n    \n          Tika was 14.\n      \n    \n          RIP\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Pets\n              \n                          \n                Animals\n              \n                          \n                Fashion\n              \n                          \n                Instagram\n              \n                          \n                Influencers\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Celebrity Dog Tika the Iggy Dead at 14",
      "image": [
        "https://imagez.tmz.com/image/e8/16by9/2025/11/05/e817032f85c441619a0539fbd786065f_xl.jpg"
      ],
      "datePublished": "2025-11-05T00:54:27.000Z",
      "dateModified": "2025-11-05T00:54:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "At Least 7 Dead, 11 Injured After UPS Plane Crashes Near Louisville Airport",
    "url": "https://www.tmz.com/2025/11/04/ups-plane-crashes-near-airport/",
    "image": "https://imagez.tmz.com/image/97/16by9/2025/11/04/97bf0b18ccf749e1b09381e658692a70_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-04T23:32:12.000Z",
    "description": "\n    \n                    \n                          UPS Plane Crash\n                          Huge Explosion Rocks Kentucky Airport ...\n             ",
    "body": "\n    \n                    \n                          UPS Plane Crash\n                          Huge Explosion Rocks Kentucky Airport ...\n                          7 Dead, 11 Hurt\n                      \n                  \n                        Published November 4, 2025 3:32 PM PST\n                                                                      |\n                Updated November 4, 2025 7:35 PM PST\n                                    \n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          UPDATE\n  \n    \n          7:34 PM PT -- Officials now confirm 7 people are dead from the crash.\n      \n    \n          5:02 PM PT -- Authorities now say at least three people are dead and 11 were injured in the UPS plane crash.\n      \n    \n          Kentucky Governor Andy Beshear called it a \"catastrophic\" scene and warned the death toll is expected to rise, adding many of the victims suffered \"very significant\" injuries.\n      \n    \n          A UPS plane has crashed at the airport in Louisville, Kentucky ... and the massive explosion created a huge fire in the area.\n      \n    \n      \n      VIDEO: Moment UPS cargo plane crashes in Louisville pic.twitter.com/AiRflrD9dx— Breaking911 (@Breaking911) November 4, 2025\n              @Breaking911\n          \n  \n    \n          According to authorities ... the plane crashed at about 5:15 PM local time shortly after taking off for Honolulu.\n      \n    \n          There is currently a shelter in place for the area within five miles of the airport ... as police assess how many people are injured. It's unclear if there were any casualties.\n      \n\n          UPS said three crewmembers were on board, WLKY-TV reports.\n      \n    \n      \n      LMPD and multiple other agencies are responding to reports of a plan crash near Fern Valley and Grade Lane. Grade lane will be closed indefinitely between Stooges and Crittenden. Injuries reported. pic.twitter.com/QB7YaWscat— LMPD (@LMPD) November 4, 2025\n              @LMPD\n          \n  \n    \n          The plane, identified as a McDonnell Douglas MD-11F, is a freight transport aircraft, according to CNN.\n      \n    \n          Louisville Muhammad Ali International Airport is home to UPS's worldwide air hub ... with over two million packages a day passing through.\n      \n    \n          It's unclear what caused the crash ... but the National Transportation Safety Board and the FAA will handle the investigation.\n      \n    \n          Story developing ...\n      \n      \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "At Least 7 Dead, 11 Injured After UPS Plane Crashes Near Louisville Airport",
      "image": [
        "https://imagez.tmz.com/image/97/16by9/2025/11/04/97bf0b18ccf749e1b09381e658692a70_xl.jpg"
      ],
      "datePublished": "2025-11-04T23:32:12.000Z",
      "dateModified": "2025-11-04T23:32:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bethenny Frankel Hot Shots to Celebrate Her 55th Birthday!",
    "url": "https://www.tmz.com/2025/11/04/bethenny-frankel-hot-shots-to-celebrate-her-55th-birthday/",
    "image": "https://imagez.tmz.com/image/18/16by9/2025/11/04/184ae96a9e12432880f8d2044382d3d7_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-04T23:35:55.000Z",
    "description": "\n    \n                    \n                          Bethenny Frankel Hot Shots\n                          I'm 55 And I\n                          Slay ",
    "body": "\n    \n                    \n                          Bethenny Frankel Hot Shots\n                          I'm 55 And I\n                          Slay All Day 🍹!\n                      \n                  \n                        Published November 4, 2025 3:35 PM PST\n                                                                            \n      \n    \n      \n        \n              \n    \n    \n          Bethenny Frankel is in her \"Skinny Girl\" era, and to showcase the birthday babe, we've rounded up her sexiest shots for her 55th trip around the sun!\n      \n    \n          The entrepreneur first hit the spotlight back in '08 with \"The Real Housewives of New York City\" ... She may have hung up her apple, but she's still shining bright and sweet as can be seen in these rockin' bikini shots!\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Frankel headed south and relocated to Miami earlier this year ... and her hot mom bod is translating superbly!\n      \n\n                  \n          \n                          \n                \n                                  \n      \n    \n          Aging like a fine wine, float into poolside selfies and raise your glass to Ms. Frankel!\n      \n    \n          Check out the gallery for all her hot shots!\n      \n    \n          Happy Birthday, Bethenny!\n      \n      \n              \n          \n                          \n                Bethenny Frankel\n              \n                          \n                Hotties & Bodies\n              \n                          \n                Hot Bodies\n              \n                          \n                Birthdays\n              \n                          \n                Real Housewives\n              \n                          \n                Photo Galleries\n              \n                          \n                Music\n              \n                          \n                Real Housewives of New York\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bethenny Frankel Hot Shots to Celebrate Her 55th Birthday!",
      "image": [
        "https://imagez.tmz.com/image/18/16by9/2025/11/04/184ae96a9e12432880f8d2044382d3d7_xl.jpg"
      ],
      "datePublished": "2025-11-04T23:35:55.000Z",
      "dateModified": "2025-11-04T23:35:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]