[
  {
    "title": "Korea Box Office: Historical Drama ‘The King’s Warden’ Debuts at No. 1",
    "url": "https://variety.com/2026/film/box-office/korea-box-office-historical-drama-the-kings-warden-no-1-1236656681/",
    "image": "https://variety.com/wp-content/uploads/2026/02/The-Kings-Warden.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-09T08:15:14.000Z",
    "description": "\n\tThe historical drama “The King’s Warden” stormed to the top of the South Korean box office in its opening weekend, according to data from KOBIS, the",
    "body": "\n\tThe historical drama “The King’s Warden” stormed to the top of the South Korean box office in its opening weekend, according to data from KOBIS, the tracking service operated by the Korean Film Council. \n\n\t“The King’s Warden” earned $4.9 million from 761,832 admissions between Friday and Sunday, capturing 58.1% of the total revenue share. Directed by Jang Hang-jun and starring Yoo Hae-jin, Park Ji-hoon, and Yoo Ji-tae, the film is set in 1457 during the Joseon Dynasty. It tells the story of Eom Heung-do (Yoo), a village chief who welcomes the deposed teenage King Danjong (Park) into his remote mountain valley, unaware of the political turmoil and danger that follows. Since its Feb. 4 release, the film has reached a cumulative total of $6.4 million from over 1 million admissions.\n\t\n\n\tIn second place, the musical drama “Choir of God” continued its steady run, earning $678,101 from 103,792 admissions. Starring Park Si-hoo and Jeong Jin-woon, the film has now reached a total gross of $7.2 million.\n\n\n\tLast week’s leader, “Once We Were Us,” moved to third place. The romance, starring Koo Kyo-hwan and Moon Ga-young, earned $577,252 over the weekend. After more than a month in the top three, the film has amassed a cumulative total of $16.6 million from nearly 2.5 million admissions.\n\n\tA documentary titled “December 3, 2024: The Orchestrated Insurrection, the Hidden Truth” debuted in fourth place. The film, which examines the political events of late 2024, earned $557,264 from 80,616 admissions, bringing its total to $827,567.\n\n\tHollywood sci-fi thriller “Mercy” opened in fifth place, grossing $249,351 from 35,998 admissions. Since its mid-week debut, it has earned $409,315.\n\t\n\n\t“Avatar: Fire and Ash” moved to sixth place, adding $208,987 to its total. The James Cameron threquel has now earned $53.8 million in South Korea.\n\n\tJapanese animation “Butt Detective the Movie: Star and Moon” opened in seventh place, earning $107,659 from 20,204 admissions. The film follows the titular detective as he infiltrates an idol contest on Stardust Island to uncover a criminal conspiracy.\n\n\tRounding out the top ten were the local animated feature “Shinbi’s Haunted House: One More Summon” in eighth with $110,603 (total $1.9 million), “Zootopia 2” in ninth with $85,210 (total $56.6 million), and a preview of the upcoming spy thriller “Humint” in tenth. “Humint,” directed by Ryoo Seung-wan and starring Zo In-sung and Park Jeong-min, earned $94,107 from limited pre-release screenings ahead of its official launch on Feb. 11.\n\n\tThe overall market collective gross for the weekend was $8.6 million, a healthy uptick from last week’s $4.9 million. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Korea Box Office: Historical Drama ‘The King’s Warden’ Debuts at No. 1",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/The-Kings-Warden.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-09T08:15:14.000Z",
      "dateModified": "2026-02-09T08:15:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Master’ Review: Gripping Bangladeshi Drama Tells a Universal Story of Political Machinery Corrupting Socialist Aims",
    "url": "https://variety.com/2026/film/news/master-review-2-1236655742/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Master1.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-09T08:15:04.000Z",
    "description": "\n\tThere are, presumably, some well-meaning civilians who have entered politics and found the experience nothing but societally beneficial and personal",
    "body": "\n\tThere are, presumably, some well-meaning civilians who have entered politics and found the experience nothing but societally beneficial and personally character-improving — but few to none of them are to be found in the movies. That balance doesn’t change with “Master,” a story about the corrupting effects of power on a small-time Bangladeshi politico, and one with relatively few surprises in the telling. Rezwan Shahriar Sumit‘s film is kept interesting, however, both by regional particularities and universal parallels: It’s an eye-opening look at institutional structures in a country that rarely gets much screen time internationally, and a timeworn tale designed to rouse rage against the machine in local and global audiences alike.\n\t\n\n\tTo that end, “Master’s” victory over some glossier, bigger-name competition in Rotterdam’s Big Screen competition — a section dedicated to more audience-oriented world cinema — bodes well for its future distribution and streaming prospects, while plentiful further festival bookings are assured. Less intimate and more expansive than Sumit’s gentle, promising 2020 debut “The Salt in Our Waters,” it confirms the writer-director as a filmmaker of robust formal assurance and beyond-borders ambition.\n\n\n\tNasir Uddin Khan gives a performance of sturdy, man-of-the-people authority, gradually slipping into nervy self-doubt, as Jahir, a high school history teacher popular with both his students and the general community in the small rural town of Mohoganj. Introduced giving an impassioned lesson on the corrupting effects of British colonial rule — put a pin in this for later — to a gender-segregated classroom, he’s disrupted by a kerfuffle of reporters eager to see him in action. For it turns out he’s also running for Chairman (a mayoral position of sorts, as explained in opening title cards that lay out the Bangladeshi political hierarchy) of his district, with an unusually liberal campaign stressing women’s rights and improved education facilities.\n\t\n\n\tJahir’s socialist ideals prove popular in this deprived part of the country, where residents feel both geographically distant and far from the minds of government bigwigs in the capital city of Dhaka. Buoyed by a relatable family-man image, with the support of his patient wife Jharna (Zakia Bari Mamo) and their young son, he secures an easy victory — ending his teaching career, though he hopes to bring his nurturing values as an educator to local government. It isn’t long before he realizes his naïveté. \n\n\tIf Jahir is unprepared for the heat his new position immediately brings him from local criminals and charlatans threatened by his clean approach, he also has little idea what sharks await him inside the political sphere. Chief among the latter is his region’s unnamed UNO (Upazila Nirbahi Officer), a wily mid-level bureaucrat who presents herself as Jahir’s direct line to the big guns, and persistently pulls rank on him with a disarming megawatt smile. \n\n\tSuperbly played by Azmeri Haque Badhon (the compelling star of Bangladeshi Cannes entry “Rehana” a few years back) she’s the film’s most magnetic and richly drawn character — not a full-scale villain, but a woman who’s learned the moral compromises required to gain authority in a patriarchal society. Meanwhile, as Jahir’s marriage and home life crumble under the pressures of his new job, “Master” stands out for its examination of a male politician primarily through his relationships with women, which mostly undercut the feminist pledges of his early campaigning.\n\n\tSuch nuances give “Master” texture and tension in the first half, though the script — by the director with Sabbir Hossain Shovon — gets less subtle as it goes, and as Jahir’s disillusionment and corruption is hastened, though the bright pastels of Tuhin Tamijul’s lensing do little to betray his darkening soul. When the UNO presses for his allyship in proposing the building of a luxury hotel on the town’s forested fringes, necessitating the razing of a current shanty settlement for the homeless, his principles finally run aground. “You’re a history teacher, but you’ve learned so little from the past,” scolds Jharna — an irony the film could probably afford to leave unspoken.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Master’ Review: Gripping Bangladeshi Drama Tells a Universal Story of Political Machinery Corrupting Socialist Aims",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Master1.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-09T08:15:04.000Z",
      "dateModified": "2026-02-09T08:15:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "China Box Office: ‘Zootopia 2’ Remains on Top in Pre–Lunar New Year Lull",
    "url": "https://variety.com/2026/film/box-office/china-box-office-zootopia-2-prelunar-new-year-lull-1236656671/",
    "image": "https://variety.com/wp-content/uploads/2024/12/Zootopia-2-Zoo.jpg?w=900&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-09T07:10:43.000Z",
    "description": "\n\tDisney’s “Zootopia 2” again led the China box office for the Feb. 6–8 weekend, taking RMB25.9 million ($3.6 million) and lifting its cumulative tota",
    "body": "\n\tDisney’s “Zootopia 2” again led the China box office for the Feb. 6–8 weekend, taking RMB25.9 million ($3.6 million) and lifting its cumulative total to RMB4.5 billion ($634.1 million), according to Artisan Gateway.\n\n\tThe market continued to soften in the days immediately ahead of the Lunar New Year holiday frame, with holdovers accounting for all of the top five titles and no major new releases entering the chart.\n\n\n\t“Busted Water Pipes” held second place, earning $2.5 million in its third weekend and pushing its running total to $14 million. The Taopiaopiao release centers on an underperforming local police unit that fabricates minor cases to pad its record, only to uncover a genuine criminal conspiracy after a burst water main exposes a gang of tomb raiders posing as repair workers.\n\t\n\n\tIn third, crime thriller “The Fire Raven” added $2.1 million, bringing its cumulative gross to $65.5 million. Directed and written by Sam Quah, the film stars Peng Yuchang, Alan Aruna and Chang Ning and revolves around a long-dormant murder case that reopens amid systemic corruption.\n\n\tJames Cameron’s “Avatar: Fire and Ash” ranked fourth with $1.8 million, taking its China cume to $164.8 million, while “Return to Silent Hill” rounded out the top five on $1.3 million for a $17.3 million total.\n\n\tOverall, China’s box office generated $17.6 million for the weekend. Year-to-date revenue now stands at $318 million, down 84.4% from the same period last year, as exhibitors await the start of the Lunar New Year holiday corridor later in February.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "China Box Office: ‘Zootopia 2’ Remains on Top in Pre–Lunar New Year Lull",
      "image": [
        "https://variety.com/wp-content/uploads/2024/12/Zootopia-2-Zoo.jpg?w=900&h=563&crop=1"
      ],
      "datePublished": "2026-02-09T07:10:43.000Z",
      "dateModified": "2026-02-09T07:10:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "General Motors Takes Cadillac F1 Debut to Super Bowl",
    "url": "https://variety.com/2026/tv/news/general-motors-cadillac-f1-debut-super-bowl-1236656254/",
    "image": "https://variety.com/wp-content/uploads/2026/02/CF1_COUNTDOWN_4022.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-09T02:37:39.000Z",
    "description": "\n\tGeneral Motors hopes to turn a fourth-quarter Super Bowl commercial into the equivalent of a moon launch for the automaker’s debut in Formula 1 raci",
    "body": "\n\tGeneral Motors hopes to turn a fourth-quarter Super Bowl commercial into the equivalent of a moon launch for the automaker’s debut in Formula 1 racing.\n\n\tA 30-second ad offers a first look at the livery, or vehicle body, that stands at the center of the new auto entry from Cadillac Formula 1. But it also endows the reveal with a sense of history, utilizing President John F. Kennedy’s famous 1962 speech about sending a spacecraft to the moon: “We choose to go to the Moon in this decade and do the other things, not because they are easy, but because they are hard.” Viewers will also hear actual dialogue between Mission Control and astronauts from the Apollo mission.\n\t\n\n\t“We want to plant the flag that we are America’s new home team to root for,” says Ahmed Iqbal, chief marketing officer, Cadillac F1, during a recent interview. The spot is meant to offer “a value proposition you can provide the fan, whether you’re a core F1 fan for the last 70 years, or if you’re a brand-new fan that just watched the “F1” movie, and you’re still trying to figure out if you like it or not,” he says. “You get to go on the journey with us and figure out exactly what it takes to build a team.”\n\n\n\n\n\n\tCadillac Formula 1 is backed by General Motors and TWG Motorsports and is the first new team to join the sport since 2016. The F1 spot was created with Translation, the independent marketing agency led by entrepreneur Steven Stoute.\n\n\tExecutives believe the spot will stand apart from the pack, even in a fourth quarter that, if it follows recent Super Bowl dynamics, could feature a down-to-the-wire match between the Seattle Seahawks and New England Patriots. Viewers “can relate to ambition, can relate to taking on a challenge and doing it with no promise of success,” says  Mina Mikhael, an executive creative director at Translation., The Super Bowl features “lots of cool celebrity spots, lots of fun spots, lots of very heartfelt spots. You have to stand out from that.”\n\t\n\n\tThe ad shows the new Cadillac Formula 1 vehicle being formed out of parts, all of which can be seen individually over a desert landscape. The spot was indeed filmed in Death Valley National Park and “we hung car parts on wires” and used special effects to show the livery being assembled, says Steve Horn, an executive creative director at Translation. Such a scene was critical, he says, “especially when the hero of our spot is the machine.”\n\n\tGM worked over the weekend to build anticipation for the commercial, with a display in Times Square. The new car was concealed in a  glass box with frosted windows that allowed passers-by to see the silhouette of mechanics assembling the car throughout the weekend.\n\n\tBut the ad will serve as the true test of interest in Cadillac’s new track. GM will no doubt be looking to see who decides to cheer the new Formula 1 team on as it revs promotional engines.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "General Motors Takes Cadillac F1 Debut to Super Bowl",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/CF1_COUNTDOWN_4022.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-09T02:37:39.000Z",
      "dateModified": "2026-02-09T02:37:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Anna Chlumsky Joins Leslie Bibb in Cold War Crime Series ‘Top of the Rock’ (EXCLUSIVE)",
    "url": "https://variety.com/2026/tv/global/anna-chlumsky-leslie-bibb-top-of-the-rock-1236656311/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Anna-Chlumsky-Leslie-Bibb.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-09T08:00:00.000Z",
    "description": "\n\tAnna Chlumsky, nominated for the Emmy Awards six times for “Veep,” has signed on opposite Leslie Bibb, Actor Award nominated for “The White Lotus,” ",
    "body": "\n\tAnna Chlumsky, nominated for the Emmy Awards six times for “Veep,” has signed on opposite Leslie Bibb, Actor Award nominated for “The White Lotus,” in the Cold War crime series “Top of the Rock” from Iceland’s leading production company, Truenorth, alongside Mystery Productions and Vertu.\n\n\tSet in 1983, amid escalating Cold War paranoia, the series follows Captain Diane Goodman (Bibb), a U.S. military police investigator, and MP Sarah Ellis (Chlumsky), both stationed at the NATO base in Keflavík, when an American soldier is found dead under suspicious circumstances outside the base. Forced to work closely with the Icelandic police, Goodman and Ellis uncover a web of espionage, betrayal and political deceit — trapped between duty and diplomacy, the two women must navigate a dangerous network of secrets before more lives are lost.\n\t\n\n\tCreated by Davíð Óskar Ólafsson (“The Valhalla Murders,” “Trom”) and Jón Atli Jónasson (“Arctic Circle,” “The Deep”), and co-created by Ragnar Jónsson (“Black Sands”), the six-part drama will be directed by Ólafsson and written by Jónasson and Óttar M. Norðfjörð (“The Darkness,” “The Valhalla Murders,” “Reykjavík 112”).\n\n\n\t“Early on we knew the role of Sarah Ellis would need to be someone with a formidable screen presence,” Ólafsson said. “Anna Chlumsky’s ability to switch between genres is like no other, and she absolutely embodies every character she’s played across her phenomenal career. We’re beyond ecstatic to round out the leads in ‘Top of the Rock’ with two of the most brilliant actors.”\n\n\t“Top of the Rock” is produced by Kristinn Thordarson, Ólafsson and Ágúst Freyr Ingason, with Truenorth’s CEO and founder Leifur B. Dagfinnsson serving as executive producer.\n\t\n\n\tThe production is developed and financed by Truenorth, Mystery Productions and Vertu, with Baradal/Frédéric Pittoors d’Haveskercke and Lumière as key partners. Casting is led by Emmy Award-winning casting director Alexa L. Fogel (“True Detective,” “Ozark,” “Smoke,” “Black Rabbit”), who also serves as an executive producer on the series.\n\n\tTruenorth is one of Northern Europe’s leading production companies, with over two decades of experience working on studio-backed titles such as “True Detective” Season 4, “Mission: Impossible – The Final Reckoning” and “The Northman.” “Top of the Rock” and previously announced “Fury” are the next productions in Truenorth’s expanding slate of original, internationally minded projects.\n\n\tChlumsky is represented by Liebman Entertainment, CAA and Schreck Rose Dapello.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Anna Chlumsky Joins Leslie Bibb in Cold War Crime Series ‘Top of the Rock’ (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Anna-Chlumsky-Leslie-Bibb.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-09T08:00:00.000Z",
      "dateModified": "2026-02-09T08:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ben Platt to Star in U.K. Premiere of ‘Midnight at the Never Get,’ Musical From ‘KPop Demon Hunters’ Songwriter Mark Sonnenblick",
    "url": "https://variety.com/2026/theater/global/ben-platt-midnight-at-the-never-get-musical-london-1236654500/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Ben-Platt-Midnight-at-the-Never-Get-pre-production-image-photographer-Matt-Crockett.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-09T08:00:00.000Z",
    "description": "\n\tTony winner Ben Platt is set to take the London stage in the U.K. premiere of “Midnight at the Never Get,” a musical from “KPop Demon Hunters” songw",
    "body": "\n\tTony winner Ben Platt is set to take the London stage in the U.K. premiere of “Midnight at the Never Get,” a musical from “KPop Demon Hunters” songwriter Mark Sonnenblick.\n\n\tThe production will take place at the Menier Chocolate Factory and is set to be directed by Drama Desk and Tony winner David Cromer (“The Band’s Visit”). Previews begin on July 11, with opening night on July 20 and closing set for Sept. 12. \n\n\n\tWith book, music and lyrics by Sonnenblick — who co-wrote many songs from Netflix smash “KPop Demon Hunters” and just won a Grammy for “Golden” — “Midnight at the Never Get” is set in 1960s New York City, where Trevor Copeland and Arthur Brightman’s romance is against the law.\n\t\n\n\t“In their secret nightclub act, ‘Midnight,’ they perform love songs in an act of defiance of a world that demands they stay hidden,” the show’s synopsis reads. “As tensions rise at the start of a historic movement, Trevor and Arthur are torn between their own surreptitious affair and the oncoming storm of social revolution.”\n\n\tThe production, which first premiered off-Broadway in 2018 and was conceived by Sonnenblick, Sam Bolen and Max Friedman, has been re-worked for its U.K. debut. Full casting will be announced shortly.\n\n\t“I’m thrilled to be undertaking my first full run on the London stage at the Menier as it transforms into the nightclub setting of ‘The Never Get,'” Platt said in a statement. “It’s truly wonderful to work with Mark, who is not only a genius songwriter, but who has also become a true friend. It’s a very special piece, my first wholly original musical since ‘Dear Evan Hansen,’ and we look forward to working with the generationally talented David Cromer to create this singular experience.”\n\t\n\n\tSonnenblick added: “This show means a tremendous amount to me and it’s a gift to collaborate with Ben again — he’s a once-in-a-generation performer. I can’t wait for audiences to experience his performance in the beautifully intimate theatre at the Menier. It’s also a huge privilege to work with the brilliant David Cromer as we realize the piece afresh for its U.K. premiere.”\n\n\tBooking for “Midnight at the Never Get” opens March 2 for Menier Chocolate Factory supporters, and regular priority booking begins March 11. \n\n\tWatch a first clip of Platt singing “Mercy of Love” from the show below.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ben Platt to Star in U.K. Premiere of ‘Midnight at the Never Get,’ Musical From ‘KPop Demon Hunters’ Songwriter Mark Sonnenblick",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Ben-Platt-Midnight-at-the-Never-Get-pre-production-image-photographer-Matt-Crockett.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-09T08:00:00.000Z",
      "dateModified": "2026-02-09T08:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Donald Trump Slams Bad Bunny’s Super Bowl Halftime Show as a ‘Slap in the Face to Our Country’: ‘Nobody Understands a Word This Guy Is Saying’",
    "url": "https://variety.com/2026/music/news/donald-trump-bad-bunny-super-bowl-halftime-show-1236656328/",
    "image": "https://variety.com/wp-content/uploads/2026/02/MixCollage-08-Feb-2026-09-29-PM-8720.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-09T02:31:05.000Z",
    "description": "\n\tDonald Trump took to social media during the Super Bowl to criticize Bad Bunny’s halftime show. \n\n\t“The Super Bowl Halftime Show is absolutely terri",
    "body": "\n\tDonald Trump took to social media during the Super Bowl to criticize Bad Bunny’s halftime show. \n\n\t“The Super Bowl Halftime Show is absolutely terrible, one of the worst, EVER!” Trump posted on Truth Social. “It makes no sense, is an affront to the Greatness of America, and doesn’t represent our standards of Success, Creativity, or Excellence. Nobody understands a word this guy is saying, and the dancing is disgusting, especially for young children that are watching from throughout the U.S.A., and all over the World. This ‘Show’ is just a ‘slap in the face’ to our Country, which is setting new standards and records every single day — including the Best Stock Market and 401(k)s in History!”\n\t\n\n\tTrump continued, “There is nothing inspirational about this mess of a Halftime Show and watch, it will get great reviews from the Fake News Media, because they haven’t got a clue of what is going on in the REAL WORLD — And, by the way, the NFL should immediately replace its ridiculous new Kickoff Rule. MAKE AMERICA GREAT AGAIN! President DONALD J. TRUMP\n\n\n\tAs the Super Bowl was beginning, Trump was on a happier note as he posted: “Enjoy the Super Bowl, America! Our Country is stronger, bigger, and better than ever before and, THE BEST IS YET TO COME!”\n\n\tWhen the NFL and Apple Music announced Bad Bunny as the 2026 Super Bowl performer last September, the news immediately sparked MAGA outrage. Trump’s former campaign manager Corey Lewandowski was quick to condemn Bad Bunny and was the first to threaten that ICE agents would be present at the Super Bowl.\n\n\t“It’s so shameful they’ve decided to pick somebody who seems to hate America so much to represent them at the Halftime Show,” Lewandowski said at the time. “We should be trying to be inclusive, not exclusive. There are plenty of great bands and entertainment people who could be playing at that show that would be bringing people together and not separating them.”\n\t\n\n\tBad Bunny’s selection was especially notable as the Super Bowl marks the Grammy winner’s only U.S. concert appearance that’s set for this year, as his Debí Tirar Más Fotos World Tour is not stopping in the States. Bad Bunny told I-D magazine that his fear of ICE raids was part of the reason why he skipped touring in the U.S.\n\n\tTrump told NewsMax’s “Greg Kelly Reports” soon after it’s “absolutely ridiculous” that Bad Bunny is performing at the Super Bowl Halftime Show, although the president claimed not to know the artist.\n\n\t“I’ve never heard of him,” Trump said. “I don’t know who he is… I don’t know why they’re doing it. It’s crazy. And then they blame it on some promoter they hired to pick up entertainment — I think it’s absolutely ridiculous.”\n\n\tWhen Bad Bunny hosed “SNL” last October, he said that playing the Super Bowl Halftime Show was notable for “all of the Latinos and Latinas in the world here in the United States who have worked to open doors. It’s more than a win for myself, it’s a win for all of us. Our footprints and our contribution in this country, no one will ever be able to take that away or erase it.”\n\n\n\n\t\n\n\t\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Donald Trump Slams Bad Bunny’s Super Bowl Halftime Show as a ‘Slap in the Face to Our Country’: ‘Nobody Understands a Word This Guy Is Saying’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/MixCollage-08-Feb-2026-09-29-PM-8720.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-09T02:31:05.000Z",
      "dateModified": "2026-02-09T02:31:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bad Bunny’s Super Bowl Halftime Show Was an All-American Triumph. Turning Point USA’s Was a Boring MAGA Grift With Kid Rock",
    "url": "https://variety.com/2026/music/columns/bad-bunny-kid-rock-turning-point-super-bowl-1236656506/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Kid-Rock.png?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-09T03:27:47.000Z",
    "description": "\n\t“Wear the mission. Text merch to 71776 for official TPUSA merch.”\n\n\tThose were the first words greeting thousands of viewers as they joined Turning ",
    "body": "\n\t“Wear the mission. Text merch to 71776 for official TPUSA merch.”\n\n\tThose were the first words greeting thousands of viewers as they joined Turning Point’s YouTube channel for the 15-minute countdown before their alternate All-American Halftime Show, as a chyron ran nonstop at the bottom of the screen, hawking merchandise and begging for text signups .\n\n\tIt was a fitting start for a slapdash night of music that seemed half-hearted from the start. The whole event was predicated on outrage from the MAGA faithful over Bad Bunny, a proud Puerto Rican who performs in Spanish, being selected to perform the Super Bowl halftime show. Because those angry about Bad Bunny couldn’t say the quiet part out loud — outside of Turning Point conspicuously surveying fans about what kinds of music they would want, and one of the choices was “Anything in English” — vague language was instead used to invoke patriotism.\n\t\n\n\tUnfortunately, the All-American Halftime Show was unable to evoke much more than a shrug, with halfhearted pop-country performances that showed the limitations of booking a big show with minimal talent. \n\n\n\tAs the YouTube live viewer count approached 5.5 million viewers, Brantley Gilbert’s guitarist kicked things off with a solo electric guitar rendition of “The Star-Spangled Banner” that would struggle to elicit more than polite applause from Jimi Hendrix. Drenched in red lighting, Gilbert’s set was inoffensive twang that felt like the emotional resonance was sucked out by a rock-and-roll vampire.\n\n\tThe only ear-demolishing moment came during Gilbert’s hip-hop verse in “Dirt Road Anthem,” with his fauxhawk looking less like a style choice and more like his hair hoping to escape ridicule. Ultimately, it was a reminder that while Gilbert said he took the gig because he “imagined my kids watching their daddy perform at halftime during the biggest game in American Football,” he hasn’t actually done that. The move here is carving out a niche MAGA audience and some appreciative Fox News hits, so just be honest.\n\t\n\n\tThe open-mic night trudged along, as bunny emojis menacingly flooded the live chat and broke up the RNC-lite staging of the musical acts. Lee Brice’s three-song set was accurately described by his closer, “Hard to Love,” and Gabby Barrett’s two-song blip proved these two artists still aren’t ready for prime time. Their gambit to align themselves with the MAGA crowd might be their only hope in elevating their careers.\n\n\tThe highlight was undoubtedly headliner Kid Rock, whose stage presence has elevated his career for decades. Starting energetically with bright lights, a big flag and a huge fur coat, it was fun for a moment to root for the guy taking a shot at the nearly-30-year-old rap-rock anthem “Bawitdaba.” Breaking it down with a big fedora and jean shorts, Kid Rock resembled someone’s fun-loving uncle four drinks deep in a Tampa karaoke bar. But it quickly became clear that the self-described “American Bad Ass” decided that lip syncing to the backing track was too square, so he just kinda…stopped. It was the night’s only truly unexpected moment.\n\n\tA classical duo then played a lengthy string interlude, and Kid Rock was reintroduced with his very serious government name, Robert James Ritchie, to play a very serious song, a cover of Cody Johnson’s “Til You Can’t.” It was a somber moment that likely sent audiences scrambling to pop open another beer.\n\n\tIt’s jarring to remember that, prior to MAGA, Kid Rock’s biggest political affiliation was stumping for Mitt Romney’s milquetoast 2012 presidential campaign. Yet in 2016 — the year after his singles last hit the Billboard Hot 100 — he rode hard for the loud-mouthed Trump. Since then, he’s been riding that wave of partisan relevancy, popping up at random functions to rap at puzzled congressmen and sing mawkish ballads to wealthy donors. Hey, the Trump family is making money off of this MAGA thing — why can’t other grifters with merch stores full of American flag gear jump on the train?\n\n\tMeanwhile, while the Turning Point show screamed about patriotism, Bad Bunny’s official show was filled with highlight after highlight of things that are exciting about America: A nation full of people who came here with talent and differences worth embracing. Even if you don’t speak Spanish, the visual storytelling evoked so many people living the American dream, from the workers in the opening segment, to elderly folks, female friendships, dancing, drinks and unabashed jubilation and unity.\n\t\n\n\tIgnore the blink-and-you’ll-miss-it shot of a few guys grinding on each other, and there was even plenty that the MAGA crowd would enjoy if they bothered to watch it: A real-life wedding! Beautiful women dancing! A great, big declaration of “God Bless America”!\n\n\tBut there was never going to be a good-faith effort to meet Bad Bunny’s show halfway. Like clockwork, Trump sent out a long message on Truth Social minutes after it ended, slamming it as quickly as possible. (Note to Trump: “Nobody understands a word this guy is saying” … he sings in Spanish, dude! Better take that cognitive test again.)\n\n\tIn the end, the final words shown during Bad Bunny’s performance were seen on a massive video screen: “The only thing more powerful than hate is love.” \n\n\tThe final words on the Turning Point broadcast? “Get involved,” next to a QR code begging for more money.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bad Bunny’s Super Bowl Halftime Show Was an All-American Triumph. Turning Point USA’s Was a Boring MAGA Grift With Kid Rock",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Kid-Rock.png?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-09T03:27:47.000Z",
      "dateModified": "2026-02-09T03:27:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kid Rock’s ‘All-American Halftime Show’ Goes Light on Politics, Feeling More Like an Old CMT Special Than Super Bowl Protest Event",
    "url": "https://variety.com/2026/music/news/kid-rock-all-american-halftime-show-recap-1236656460/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Screenshot-2026-02-08-at-6.41.47%E2%80%AFPM-e1770601988121.png?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-09T02:35:15.000Z",
    "description": "\n\tTurning Point USA clearly saw Bad Bunny‘s Super Bowl halftime booking as an affront to the nation that needed to be met by an alternative event for ",
    "body": "\n\tTurning Point USA clearly saw Bad Bunny‘s Super Bowl halftime booking as an affront to the nation that needed to be met by an alternative event for conservative viewers, but the “All-American Halftime Show” opted not to offer much in the way of provocation in return. Rather than come off as a protest event, the 35-minute program offered a set of mild, largely non-political performances that could have been mistaken for a vintage CMT or Nashville Network special — even from Kid Rock, who was on his very best behavior during a quick two-song appearance.\n\t\n\n\tBad Bunny? Never mentioned, or even alluded to… which was the case for anything else that might have raised much of an eyebrow or a stir, in a show that could have aired at just about any time in the 21st century, aside from the closing montage of Charlie Kirk imagery.\n\n\n\tWithout an announcer to offer context, there was no indication of where the performances were being broadcast from, or if they were taking place in real time. According to sources, the show was pre-taped in Atlanta.\n\n\tBrantley Gilbert was up first, followed by fellow country artists Gabby Barrett and Lee Brice, before Kid Rock closed things out in an enclosed setting where a crowd of what looked to be about a hundred fans stood cheering on either side of a huge thrust ramp that extended across the studio floor.\n\n\tPolitics were limited to Brice singing “Real American,” which extols a place where “everything’s made in the USA,” and Brice premiering a brand new song, “Country Nowadays,” in which he complains about seeing “a picture of a flag up in flames while people cheer,” along with making the statement, “little boys ain’t little girls.” \n\t\n\n\tBrice said, “Charlie gave people mics so they could say what’s on their mind. This is what’s on mine.” The chorus of his new song: “Say I’m some right-wing devil ’cause I was down-south-Jesus-raised / It ain’t easy being country in this country nowadays.”\n\n\tFour Black men stood on stage to introduce the main attraction — “Ladies and gentlemen, please welcome our brother, Robert Ritchie” — in a fleeting show of people of color. \n\n\tKid Rock started with some literal firepower, at least in the pyro department, as he sang an inoffensive version of his venerable rap hit “Bawitaba.” Much of the performance appeared to be pre-recorded, as he only raised the mic to his mouth for about half of the lyrics, if that, as widely noted on social media. But he seemed to be fully on-mic as he sang the closing ballad, “Till You Can’t,” a cover of a sentimental country hit from a few years back by Cody Johnson.\n\n\tIn his only spoken remarks, Kid Rock introduced “Till You Can’t” by saying that he was awakened one night with the Johnson song in his head and felt there was “a verse that still needed to be written for this song.” He then sang his self-penned addition, which was effectively an evangelical altar call: “There’s a book sitting in your house somewhere that could use some dusting off / There’s a man who died for all our sins hanging from the cross / You can give your life to Jesus and he’ll give you a second chance / Till you can’t.” \n\n\tAt song’s end, the camera moved over to big-screen photos of the late Charlie Kirk and his widow, Erika Kirk, who is now in charge of TPUSA, followed by a fade to darkness and closing credit that still did not offer many hints where the performance was taking place.\n\n\tThe show began with Gilbert’s guitarists offering “The Star Spangled Banner” in the tradition of Jimi Hendrix, before the singer himself emerged and led the band in a style closer to hard rock than classic country, as has been his custom. Barrett stuck closer to a Carrie Underwood style of country, starting with her breakout hit “I Hope” and following it with “One of the Good Ones.” Brice sang his hit “Drinking Class,” which includes the chorus “If you gotta label me, then label me proud / ‘Cause I belong to the drinking class,” a hit that conflates patriotic self-esteem with “rowdy” bar behavior and alcohol consumption.\n\t\n\n\tA snafu arose when TPUSA announced on its X feed that the show would not be broadcast there, and viewers should turn their attention to the org’s YouTube channel. There, viewership was shown as peaking at just over 5 million when Kid Rock came on at 9:35 p.m. ET. With the third quarter of the Super Bowl having already begun after Bad Bunny’s shorter halftime performance and while Kid Rock was still on, YouTube viewers for the “All-American Halftime Show” dipped slightly to 4.4 million by the time the headliner finished.\n\n\tThe show was also available on other platforms and networks, like OAN, which was late to jump into the feed amid its nightly news program. There was no immediate estimate of overall viewership.\n\n\tAlthough references to the big show in California and its lead performer were nil, Kid Rock had earlier described what he saw as the intent for the program. “We plan to play great songs for folks who love America. We’re approaching this show like David and Goliath. Competing with the pro football machine and a global pop superstar is almost impossible…or is it?” He continued, referencing Bad Bunny: “He’s said he’s having a dance party, wearing a dress, and singing in Spanish? Cool. We plan to play great songs for folks who love America.” \n\n\tDetractors have noted the alternative halftime show’s inability to draw any current country hitmakers — the country performers on hand all had their runs of hits in the 2010s, except Barrett, who had her smash in 2020 — with some wondering where Jason Aldean, the most popular musician friend of President Trump, was. Aldean did at least come up for a mention, as Gilbert noted that his life was changed when Aldean recorded a song he co-wrote, the pioneering country-rap hybrid “Red Dirt Anthem,” which he then sang and rapped.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kid Rock’s ‘All-American Halftime Show’ Goes Light on Politics, Feeling More Like an Old CMT Special Than Super Bowl Protest Event",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Screenshot-2026-02-08-at-6.41.47%E2%80%AFPM-e1770601988121.png?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-09T02:35:15.000Z",
      "dateModified": "2026-02-09T02:35:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Super Bowl Ad Review: Even A.I. Companies Aim for Fun Over Frowns in ‘Joyful’ Commercial Scramble",
    "url": "https://variety.com/2026/tv/news/super-bowl-ad-review-commercials-fun-over-frowns-joyful-1236656545/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Benson-Ben.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-09T02:48:26.000Z",
    "description": "\n\tMadison Avenue tapped the brakes on most somber Super Bowl commercials Sunday night, with many trying to do something Big Game ads haven’t always do",
    "body": "\n\tMadison Avenue tapped the brakes on most somber Super Bowl commercials Sunday night, with many trying to do something Big Game ads haven’t always done — make people feel good.\n\n\tA dizzying array of spots featured famous faces in frantic, frenetic scenarios, including Ben Stiller and Benson Boone trying to out-flip each other for delivery-service Instacart while dressed in throwback musicians costumes. Andy Samberg cavorted on behalf of Hellmann’s mayonnaise, dressed as some sort of off-kilter Neil Diamond wanna-be. And a bevy of “SNL” cast members past and present appeared throughout the night — Ana Gasteyer and Kenan Thompson for Wegovy; Colin Jost and Michael Che for DraftKings; Heidi Gardner for Homes.com and Apartments.com. Meanwhile, Bowen Yang joined up with frequent “SNL” guests Scarlett Johansson and Jon Hamm for Ritz Crackers.\n\t\n\n\n\n\n\t“The feeling is pretty damn joyful,” says Ellie Bamford, chief strategy officer of North America for the large ad agency VML. She felt the commercials struck the right note, moving away from sad stories and playing up fun and nostalgia.  In past Super Bowls, “brands have gone with things that felt too heavy, too divisive,” she says. This year, she says advertisers “swung away” from moralizing and “telling people what to think.”\n\n\n\t“We can’t ignore the absurdity in the ads this year,” says Erin Sarro, a creative director at Two Tango Collaborative, an advertising consortium based in Richmond. The Instacart ad, she says, “offered a fever dream” with Stiller and Boone looking like “an Italian mustache new wave duo.”\n\t\n\n\tOther commercials played up the surreal. Liquid I.V., a hydration mix for water, unveiled a commercial filled with toilets and commodes singing a cover of an old Phil Collins song. Budweiser struck a chord Sunday night with a spot that told the tale of one of its Clydesdale horses growing up alongside an American bald eagle — all to the strains of Lynyrd Skynyrd’s classic “Free Bird.” Ben Affleck returned for his fourth Super Bowl effort for Dunkin’, this time luring Jennifer Aniston, Tom Brady, Jason Alexander, Jasmine Guy, Tom Brady and Jaleel White for a spot that evoked 1990s sitcoms.\n\n\n\n\n\tThe Instacart executive behind the company’s offbeat Super Bowl entry says consumers always appreciate “levity and joy” as well as “a moment of escapism.”\n\n\tTo be sure, several spots tried to make people ponder bigger issues. A commercial from Rocket Mortgage and Redfin showed viewers the story of two families — one white, one Latino — who viewed each other skeptically until the Latino family’s daughter finds the white family’s lost dog. Advertising agency executives praised the intent, and the decision to commission Lady Gaga to sing the “Won’t You Be My Neighbor” theme from “Mr. Rogers’ Neighborhood.” But they also suggested the spot skated past some difficult issues tied to race and class.\n\n\n\n\n\tThe sheer glut of happy ads may drown out some of the more serious or innovative creative choices. “We know what works in the Super Bowl,” says Omid Amidi, co-chief creative officer of McKinney, an agency based in Durham, NC. “It’s mostly celebrities, a music cover, animals and puppies. It just feels like we are really playing the hits, without taking any swings.”\n\n\tViewers were inundated with messages from a swell of A.I. companies. Amazon aimed for humor, with Chris Hemsworth expressing fear of what his new Alexa assistant might do to him. Anthropic threw a sharp elbow at rival Open AI with a spot that made fun of a decision to incorporate commercials into a tier of ChatGPT. For its part, Open AI tried to make people forget their worries about the technology.\n\n\t“They are showing up as any industry that is so young would, and starting to figure out all the different places they might take,” says Daniel Lobatón chief creative officer, North America, for David, a Miami agency. “Some are more serious and earnest.”\n\t\n\n\tGetting a Super Bowl ad to hit all the high notes is tough, says Rob Reilly, glolbal chief creative officer of WPP. “It’s hard to make these things. It is really difficult. There are a lot of people who are involvled in decision making, and a lot of cooks in the kitchen.”\n\n\tSome executives wondered if the Dunkin’ ad, for all its celebrities, missed the mark. “It really didn’t quite pay off,” says Bamford. In past efforts, the company spent more time making sure its doughnuts and coffee got more screen time. \n\n\tBalancing celebrities and marketing messages can be a difficult assignment notes Diane Sayler, a senior director at Mars Snacking who oversees marketing for the company’s salty snacks, during a recent interview. “In my opinion, one of the worst possible things that can happen to a Super Bowl marketer is they remember your celebrity or your song or your ad concept, but not your brand.” Mars’ Pringles tapped Sabrina Carpenter for its Super Bowl commercial, but played up attributes of the snack. In most scenes of the ad, the singer or other around her were seen eating one chip after another — a nod to a revived slogan, “Once you pop, the pop don’t stop.”\n\n\tAn unorthodox ad from Coinbase also spurred debate. The spot used very little in the way of glitzy production, instead giving viewers what looked like a karaoke screen in a bar, and spurred them to sing along to a Backstreet Boys song. In 2022, the cryptocurrency company ran a similar effort, putting a floating QR code on screen — and nothing else. “It’s their schtick,” says Bamford.\n\n\n\n\n\t“Have we gotten to a point where we are over-celebriti-ed? I don’t know,” says Reilly. “It seems to be the thing people enjoy.” \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Super Bowl Ad Review: Even A.I. Companies Aim for Fun Over Frowns in ‘Joyful’ Commercial Scramble",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Benson-Ben.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-09T02:48:26.000Z",
      "dateModified": "2026-02-09T02:48:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Olympic Champion Picabo Street 'Memba Her?!",
    "url": "https://www.tmz.com/2026/02/09/olympic-champion-picabo-street-memba-her/",
    "image": "https://imagez.tmz.com/image/77/16by9/2026/02/05/776a300882894189a57b253166f5c235_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-09T08:01:14.000Z",
    "description": "\n    \n                    \n                          Olympic Champion\n                          Picabo Street\n                          'Memba Her?!\n ",
    "body": "\n    \n                    \n                          Olympic Champion\n                          Picabo Street\n                          'Memba Her?!\n                      \n                  \n                                                                        Published \n                              February 9, 2026\n                            12:01 AM PST\n                                                                            \n      \n    \n          Alpine Ski Racer Picabo Street was in her early 20s when she scored her first Olympic metal at the Lillehammer Olympics back in 1994 -- taking home the silver in the women's downhill.\n      \n    \n          At the 1998 Winter Olympics in Nagano, Japan, she won the gold medal in the women’s Super-G (super-giant slalom) event -- by the slimmest margin in Olympic alpine history, just 0.01 seconds.\n      \n    \n          Guess what she looks like now!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Picabo Street\n              \n                          \n                Olympics\n              \n                          \n                TMZ Sports\n              \n                          \n                Memba Them\n              \n                          \n                Photo Galleries\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Olympic Champion Picabo Street 'Memba Her?!",
      "image": [
        "https://imagez.tmz.com/image/77/16by9/2026/02/05/776a300882894189a57b253166f5c235_xl.jpg"
      ],
      "datePublished": "2026-02-09T08:01:14.000Z",
      "dateModified": "2026-02-09T08:01:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Wendy Williams' Dad Dead at 94",
    "url": "https://www.tmz.com/2026/02/08/wendy-williams-dad-dead-at-94/",
    "image": "https://imagez.tmz.com/image/bc/16by9/2026/02/09/bc983d6e1e6d43b88cfa431d88d56933_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-09T01:48:03.000Z",
    "description": "\n    \n                    \n                          Wendy Williams\n                          Dad Dead at 94\n                      \n                  ",
    "body": "\n    \n                    \n                          Wendy Williams\n                          Dad Dead at 94\n                      \n                  \n                                                                        Published \n                              February 8, 2026\n                            5:48 PM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Wendy Williams’ father, Thomas Williams Sr., has died … a deeply emotional loss that comes as Wendy continues her ongoing legal fight over her court ordered guardianship.\n      \n    \n          Wendy’s niece, Alex Finnie confirmed Thomas’ passing Sunday on social media, sharing a tribute honoring his life and legacy. He died just days before his 95th birthday.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          No cause of death has been released.\n      \n\n          Thomas was a longtime educator and author and was often seen as a steady, grounding presence in Wendy’s life. He appeared alongside his daughter during happier public moments, including family celebrations in recent years.\n      \n    \n          The timing of his death is especially painful. As we reported, Wendy’s repeatedly spoken out about feeling isolated under her guardianship, claiming she needed permission to travel and see family including her dad.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Earlier this year, Wendy publicly questioned whether she would even be allowed to attend her dad’s birthday, raising concern among fans about how much access she had to loved ones during his final months.\n      \n    \n          Wendy has not publicly commented on her father’s death.\n      \n    \n          Thomas Williams Sr.’s passing marks another heartbreaking chapter in Wendy’s very public personal and legal struggles.\n      \n    \n          He was 94.\n      \n    \n          RIP\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Wendy Williams\n              \n                          \n                Celebrity News\n              \n                          \n                TV\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Wendy Williams' Dad Dead at 94",
      "image": [
        "https://imagez.tmz.com/image/bc/16by9/2026/02/09/bc983d6e1e6d43b88cfa431d88d56933_xl.jpg"
      ],
      "datePublished": "2026-02-09T01:48:03.000Z",
      "dateModified": "2026-02-09T01:48:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Guess Who This Fan-Favorite NBA Star Is!",
    "url": "https://www.tmz.com/2026/02/08/guess-who-nba-star/",
    "image": "https://imagez.tmz.com/image/ea/16by9/2026/02/03/ea74fe2523154e4eb6deb478adcf572a_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-09T00:00:13.000Z",
    "description": "\n    \n                    \n                          Guess Who\n                          This Fan-Favorite NBA Star Is!\n                      \n       ",
    "body": "\n    \n                    \n                          Guess Who\n                          This Fan-Favorite NBA Star Is!\n                      \n                  \n                                                                        Published \n                              February 8, 2026\n                            4:00 PM PST\n                                                                            \n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          We all know basketball players have some of the most recognizable faces out there ... can you guess who this fan-favorite NBA star is?\n      \n    \n          We caught up with this pro baller all the way back in 2018 when he was leaving a hotel in NYC ... and he got right to signing autographs for his adoring fans.\n      \n    \n          He didn't really say much while giving his fans his John Hancock -- but they were stoked regardless!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Guess Who\n              \n                          \n                TMZ Sports\n              \n                          \n                NBA\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Guess Who This Fan-Favorite NBA Star Is!",
      "image": [
        "https://imagez.tmz.com/image/ea/16by9/2026/02/03/ea74fe2523154e4eb6deb478adcf572a_xl.jpg"
      ],
      "datePublished": "2026-02-09T00:00:13.000Z",
      "dateModified": "2026-02-09T00:00:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Seattle Seahawks Win Super Bowl LX, Easily Handle New England Patriots",
    "url": "https://www.tmz.com/2026/02/08/super-bowl-patriots-seahawks/",
    "image": "https://imagez.tmz.com/image/78/16by9/2026/02/06/782badd9f80540e8a8efdf58aabe3a2d_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-09T03:48:23.000Z",
    "description": "\n    \n                    \n                          Super Bowl LX\n                          Seahawks Win!!!\n                      \n                  ",
    "body": "\n    \n                    \n                          Super Bowl LX\n                          Seahawks Win!!!\n                      \n                  \n                                                                        Published \n                              February 8, 2026\n                            7:48 PM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Revenge 11 years in the making -- the Seattle Seahawks just beat the New England Patriots in Super Bowl LX ... easily running away with the 29-13 victory!!\n      \n    \n          The game was a rematch of an epic showdown in 2015 ... which the Pats won in dramatic fashion.\n      \n    \n      \n      All the emotions for Sam Darnold 🥹 pic.twitter.com/nyW62XrRA5— NFL (@NFL) February 9, 2026\n              @NFL\n          \n  \n    \n          But it was all Seahawks this time around ... with the Seattle defense having its way against Drake Maye and co.\n      \n\n          It's an amazing redemption story for Sam Darnold -- the former third-overall pick bounced around the NFL before joining the Seahawks this past offseason ... and now he's a Super Bowl-winning quarterback.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Darnold went 19-38 for 202 yards -- one touchdown and no interceptions.\n      \n    \n          Kenneth Walker helped out big time, too -- rushing 27 times for 135 yards en route to MVP honors.\n      \n    \n          Jaxon Smith-Njigba -- who was checked out for a possible concussion in the second half -- only caught four balls for 27 yards, with the Pats defense largely keeping the Offensive Player of the Year under wraps.\n      \n    \n          Just like the rest of the playoffs, Maye struggled a bit against the Seattle D -- turning the ball over three times ... two interceptions and a lost fumble.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Now, the Seahawks are two-time Super Bowl champions.\n      \n      \n              \n          \n                          \n                TMZ Sports\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Seattle Seahawks Win Super Bowl LX, Easily Handle New England Patriots",
      "image": [
        "https://imagez.tmz.com/image/78/16by9/2026/02/06/782badd9f80540e8a8efdf58aabe3a2d_xl.jpg"
      ],
      "datePublished": "2026-02-09T03:48:23.000Z",
      "dateModified": "2026-02-09T03:48:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Celebrate Jennifer Aniston's Birthday With These Products on Amazon",
    "url": "https://www.tmz.com/2026/02/09/jennifer-aniston-birthday-celebrate-finds-amazon/",
    "image": "https://imagez.tmz.com/image/aa/16by9/2026/02/02/aa07b7e768084b15b0ca33ff734792ba_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-09T08:05:44.000Z",
    "description": "\n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          TMZ may colle",
    "body": "\n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          TMZ may collect a share of sales or other compensation from links on this page.\n      \n    \n          Jennifer Aniston is just ageless ... seriously.\n      \n    \n          The only thing that's changed is the number of candles on her birthday cake -- a milestone that happens to be today. While we may not have access to her fountain of youth, we've gathered some of her fav products that keep her looking (and smelling) flawless.\n      \n    \n          From her award-winning haircare line, LolaVie, to her signature scent, Solstice Bloom, we've got what you need to get inspired in honor of Jen's 57th bday. \n      \n    \n          TMZ CHEAT SHEET: Celebrate Jen's Bday With These Beauty Finds\n  \n\n          LolaVie Restorative Shampoo & Conditioner Set -- $64LolaVie Glossing Detangler -- $29LolaVie Perfecting Leave-In -- $33LolaVie Restorative Conditioner -- $32Solstice Bloom Eau de Parfum -- $22Solstice Bloom Fragrance Mist -- $10Friends Classic Logo T-Shirt -- $20Friends Tote -- $13Central Perk Mug -- $11\n      \n    \n              \n      LolaVie Restorative Shampoo & Conditioner Set\n      \n        \n    \n                    \n                          \n                                  \n      \n        \n    \n          Jennifer is known for her iconic hair (remember the Rachel?) so it only makes sense that she's sharing her haircare secrets.\n      \n    \n          This LolaVie Restorative Shampoo & Conditioner Set is all about nourishing your locks and bond-building to help repair the look of damage while protecting against breakage. With a formulation that gently cleanses, you’ll have softer, smoother and more manageable hair. \n      \n    \n              \n      LolaVie Glossing Detangler\n      \n        \n    \n                    \n                          \n                                  \n      \n        \n    \n          The award-winning LolaVie Glossing Detangler is the multitasking product you need in your routine. It’s a detangler, heat protectant, frizz fighter, shine enhancer, and hydrator … all in one.\n      \n    \n          Just spray onto wet or towel-dried hair and comb through. Then style as usual for a smooth, polished finish.\n      \n    \n              \n      LolaVie Perfecting Leave-In\n      \n        \n    \n                    \n                          \n                                  \n      \n        \n    \n          Jennifer always has the perfect blowout and that’s in part due to the LolaVie Perfecting Leave-In.\n      \n    \n          This do-it-all leave-in conditioner is powered by Rose of Jericho, a superfruit complex and LolaVie’s signature B-Pro3 bond technology to transform strands for dramatically smoother, stronger, effortlessly perfect hair.\n      \n    \n              \n      LolaVie Restorative Conditioner\n      \n        \n    \n                    \n                          \n                                  \n      \n        \n    \n          The LolaVie Restorative Conditioner is here to give your hair the moisture it craves, according to Jennifer herself.\n      \n    \n          It leaves her locks \"soft, shiny and full of life\" and isn’t that the vibe we’re all going for? Formulated with super grains, pea peptides, a superfruit complex and LolaVie’s signature B-Pro3 bond technology, it’s everything your hair deserves and more. \n      \n    \n              \n      Solstice Bloom Eau de Parfum\n      \n        \n    \n                    \n                          \n                                  \n      \n        \n    \n          You may not know what Jennifer actually smells like … but it's probably a lot like her Solstice Bloom Eau de Parfum. This intimate and invigorating scent is perfect for both day and night.\n      \n    \n          For those that love woody floral scents, this perfume brings warmth with its notes of gardenia and jasmine petals as well as golden sand accord and sheer white musk. Plus, its sleek and simple bottle will look perfect no matter where you display it. \n      \n    \n              \n      Solstice Bloom Fragrance Mist\n      \n        \n    \n                    \n                          \n                                  \n      \n        \n    \n          If you already love Jennifer’s signature scent, then expand your collection with the Solstice Bloom Fragrance Mist.\n      \n    \n          This gentle mist can be sprayed all-over for full body coverage and is ideal for those wanting a fresh and subtle fragrance. Plus, it’s packaged in a convenient size for easy application at home or on the go.\n      \n    \n              \n      Friends Classic Logo T-Shirt\n      \n        \n    \n                    \n                          \n                                  \n      \n        \n    \n          This Friends Classic Logo T-Shirt is an absolute necessity for any fan. Featuring the show’s iconic logo, you can wear your fandom loud and proud.\n      \n    \n          And what better way to celebrate Jennifer’s birthday? Available in a variety of colors and sizes, there’s sure to be a combo that’ll fit right in with your wardrobe. \n      \n    \n              \n      Friends Tote\n      \n        \n    \n                    \n                          \n                                  \n      \n        \n    \n          Could this Friends Tote be any cuter?? Featuring iconic images from the show’s ten seasons, including Rachel’s memorable peephole frame, you’ll be reminded of all your favorite episodes.\n      \n    \n          Plus, it’s spacious enough for all of your belongings, including your laptop, headphones, water bottle … and everything else you need on the go! \n      \n    \n              \n      Central Perk Mug\n      \n        \n    \n                    \n                          \n                                  \n      \n        \n    \n          Go back to where it all began with this Central Perk Mug. While you may not actually be sipping lattes with the whole gang, you can certainly feel like you are!\n      \n    \n          Emblazoned with the coffee shop's recognizable logo, this subtle nod to your favorite series is a fun way to pay tribute to Jennifer on her bday. \n      \n    \n          Sign up for Amazon Prime to get the best deals!\n      \n    \n          All prices subject to change.\n      \n      ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Celebrate Jennifer Aniston's Birthday With These Products on Amazon",
      "image": [
        "https://imagez.tmz.com/image/aa/16by9/2026/02/02/aa07b7e768084b15b0ca33ff734792ba_xl.jpg"
      ],
      "datePublished": "2026-02-09T08:05:44.000Z",
      "dateModified": "2026-02-09T08:05:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]