[
  {
    "title": "Bring Me the Horizon Immersive Concert Film ‘L.I.V.E. in São Paulo’ Unveils Trailer, Tickets Now on Sale",
    "url": "https://variety.com/2026/music/global/bring-me-the-horizon-concert-film-live-sao-paulo-trailer-1236661992/",
    "image": "https://variety.com/wp-content/uploads/2026/02/OLI-37-copy.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-13T10:44:47.000Z",
    "description": "\n\tBritish rockers Bring Me the Horizon have revealed the trailer for immersive concert film “L.I.V.E. in São Paulo,” and tickets for the cinematic eve",
    "body": "\n\tBritish rockers Bring Me the Horizon have revealed the trailer for immersive concert film “L.I.V.E. in São Paulo,” and tickets for the cinematic event are on sale now. \n\n\tWith “L.I.V.E.” standing for “Live Immersive Virtual Experiment,” the film brings the band’s biggest headline show ever in São Paulo, Brazil to theaters for two nights only on March 25 and 28. The sold-out performance, played to 50,000 fans at Allianz Parque Stadium, saw the Brit Award-winning and Grammy-nominated band reach new heights and has been hailed by the band as their best show yet.\n\t\n\n\t“L.I.V.E. in São Paulo” expands the visual universe of the band’s “Post Human” album series, “blending cinematic production with raw fan perspectives and striking character cameos including E.V.E, Selene and M8,” a press release states. “Co-directed by CiRCUS HEaD, the film features multi-camera coverage, sweeping drone footage and fan-submitted content, delivering a dynamic, multi-angle journey that mirrors the scale and intensity of the night itself.” Tracks from across Bring Me the Horizon’s discography are represented on the setlist, including from “Sempiternal,” “That’s the Spirit” and “Amo.”\n\n\n\tTickets are now on sale in over 35 countries around the world, including the U.S., U.K., Germany, France, Italy, Australia and Brazil. “L.I.V.E. in São Paulo” is presented by Trafalgar Releasing alongside Sony Music Vision and RCA. \n\n\tA live album of the same name will also follows the release of “L.I.V.E. in São Paulo,” available on streaming services April 10 as well as on vinyl and CD. \n\n\tWatch the trailer for “L.I.V.E. in São Paulo” below.\n\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bring Me the Horizon Immersive Concert Film ‘L.I.V.E. in São Paulo’ Unveils Trailer, Tickets Now on Sale",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/OLI-37-copy.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-13T10:44:47.000Z",
      "dateModified": "2026-02-13T10:44:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Film Factory Picks Up International Sales on Lucía Puenzo’s ‘Pepita the Gunslinger’ (EXCLUSIVE)",
    "url": "https://variety.com/2026/film/global/film-factory-lucia-puenzo-pepita-the-gunslinger-berlin-efm-1236662004/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Pepita.jpeg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-13T10:36:38.000Z",
    "description": "\n\tFilm Factory Entertainment has picked up international sales rights to Lucía Puenzo’s crime thriller“Pepita the Gunslinger” (“Pepita La Pistolera”),",
    "body": "\n\tFilm Factory Entertainment has picked up international sales rights to Lucía Puenzo’s crime thriller“Pepita the Gunslinger” (“Pepita La Pistolera”), led by Argentine star Luisana Lopilato.\n\n\tThe outfit is taking the project to the European Film Market (EFM) in Berlin, where it is showing an exclusive first promo to buyers.\n\n\tDirected by Puenzo, the Cannes Critics’ Week Grand Prize winner for “XXY,” “Pepita the Gunslinger” is billed as a visceral neo-noir thriller based on the true story of Margarita Di Tullio, a notorious figure in Argentina’s 1980s criminal underworld. \n\t\n\n\tDi Tullio became a media legend after killing three men in a violent act of self-defence to protect her family — a case that sparked a national media storm and earned her the nickname “Pepita, the Gunslinger.”\n\n\n\tThe film’s hook is the gap between the public narrative and the woman behind it. A press release describes Pepita as far from an “innocent, vulnerable” figure: instead, she is portrayed as a professional thief and the most glamorous madam in Mar del Plata, who decides to take on a corrupt system.\n\n\tSet in Mar del Plata during the brutal winter of 1985, the story follows Margarita as she uses her pregnancy as a shield while building a clandestine nightlife empire around the cabaret Neisis, positioned as a refuge and a site of autonomy for women in a world dominated by men. \n\n\tAs a wave of murders attributed to the “Loco de la Ruta” (“The Highway Madman”) spreads fear, Margarita discovers that the true monster is a web of collusion between the police and the judiciary.\n\t\n\n\tThe film is described as a visceral neo-noir thriller that explores themes of fierce motherhood, systemic corruption, and revolution from the margins.\n\n\tThe production is a high-profile collaboration between Zeppelin Studio, Historias Cinematográficas, Pampa Films, Life Is One and The Remake. \n\n\tThe supporting cast includes Alberto Ajaka, Claudio Tolcachir, Charo López, Marcelo Subiotto and Esteban Bigliardi.\n\n\t“‘Pepita the Gunslinger’ combines an exceptional cinematic pulse with a fascinating real story,” Film Factory CEO Vicente Canales said, adding that Puenzo’s take on the character’s “moral ambiguity” and Lopilato’s performance “guarantee a product of high interest for the global market.”\n\n\tProducers said the film aims to address themes that run through Puenzo’s work, including political bodies, historical memory and female solidarity. Film Factory is positioning “Pepita the Gunslinger” as a key Latin American title for 2026.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Film Factory Picks Up International Sales on Lucía Puenzo’s ‘Pepita the Gunslinger’ (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Pepita.jpeg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-13T10:36:38.000Z",
      "dateModified": "2026-02-13T10:36:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Period Thriller ’Sorority’ Brought to Market by France TV Distribution (EXCLUSIVE) ",
    "url": "https://variety.com/2026/tv/global/sorority-lula-cotton-frapier-france-tv-distribution-1236661930/",
    "image": "https://variety.com/wp-content/uploads/2026/02/SORORITY-working-title.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-13T10:10:52.000Z",
    "description": "\n\tFrance TV Distribution, the commercial arm of the French public broadcaster France Télévisions, is bringing to market at the London TV Screenings th",
    "body": "\n\tFrance TV Distribution, the commercial arm of the French public broadcaster France Télévisions, is bringing to market at the London TV Screenings the costume drama-thriller “Sorority,” a tale of three women – a wet-nurse, a midwife and a grieving mother – pitched against a male-dominated world in a Paris of 1889. \n\n\tStarring Lula Cotton-Frapier, seen in Dominik Moll’s “The Night of the 12th” which swept France’s 2023 César Awards,  “Sorority” is written by Alexandra Echkenazi, a co-creator of the well-received TV series “Simon Coleman,” and a co-scribe on period romance “Rosalie,” selected for Cannes Festival’s Un Certain Regard section in 2023. \n\t\n\n\tThe six-part period series – a genre in which France Télévisions can excel, drawing on the craft category excellence of its domestic industry, one of the biggest in Europe – “Sorority” is directed by Savina Dellicour and Vania Leturcq, co-helmers of Belgian crime drama “Pandore” (2022-24). \n\n\n\tDellicour also directed two episodes of breakout Netflix 2023 hit “Who Is Erin Carter?” while Leturcq helmed “Next Year,” a Montreal World Film Festival Silver Zenith winner.\n\n\tDistributed worldwide by France TV Distribution, “Sorority” turns on Rose who leaves her rural home to become a wet nurse for a bourgeois family in Paris. There, she meets Odette, a midwife, who warns her that she won’t be allowed to keep her own child with her. Rose finds a solution, however risky: passing off her baby as that of Hélène de Gersande, a mother grieving the sudden loss of her infant.\n\t\n\n\t“Rose, Odette and Hélène – three women from very different backgrounds – will have to join forces to carve out a place for themselves in a male-dominated world, and claim their freedom,” the synopsis runs. \n\n\t“Sorority “ stars a large cast led by Cotton-Frapier, Barbara Probst, Jonathan Zaccaï, David Kammenos, Cécile Rebboah, Olivia Côte. It also takes in Alexia Giordano, Lauréna Thellier, David Talbot, Ralph Amoussou, Baptiste Carrion-Weiss, Younès Boucif, Anne Coesens.\n\n\tIt is produced by Lincoln TV for France TV. France Télévisions, La Compagnie Cinématographique and Panache Productions co-produce. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Period Thriller ’Sorority’ Brought to Market by France TV Distribution (EXCLUSIVE) ",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/SORORITY-working-title.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-13T10:10:52.000Z",
      "dateModified": "2026-02-13T10:10:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "London Sales Company MSC Labels Films ‘No AI Used’ at EFM, Calls for Global Standard (EXCLUSIVE)",
    "url": "https://variety.com/2026/film/news/london-sales-company-msc-films-no-ai-used-efm-1236661976/",
    "image": "https://variety.com/wp-content/uploads/2026/02/EFM-No-AI.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-13T10:17:53.000Z",
    "description": "\n\tThe Mise En Scene Company has debuted a “No AI Used” certification for its entire EFM slate, publicly verifying that its films contain no artificial",
    "body": "\n\tThe Mise En Scene Company has debuted a “No AI Used” certification for its entire EFM slate, publicly verifying that its films contain no artificial intelligence.\n\n\tThe London-based outfit launched the initiative with high visibility at this year’s European Film Market in Berlin: a pair of billboards at Potsdamer Platz promoting MSC’s key titles “Forelock,” starring David Krumholtz, and “Billy Knight,” starring Al Pacino and Charlie Heaton. The new certification appears prominently on both.\n\t\n\n\tMSC CEO Paul Yates positioned the effort as a defense of human creativity amid the surge of machine-generated material entering the entertainment sector, rather than a rejection of technological tools.\n\n\n\t“We’re entering a tectonic shift,” Yates said. “Human artistry is about to become more valuable and more vulnerable than ever. If we don’t define it, label it, and protect it, it will simply disappear into the noise.”\n\n\tThe company drew inspiration from U.K. filmmaker and digital rights advocate Beeban Kidron, along with the Human Artistry “Stealing Isn’t Innovation” campaign. Both have challenged governmental policies on copyright and AI training. The initiative expands upon A24’s labeling strategy for its horror film “Heretic.”\n\n\tMSC is urging the industry, festivals and policymakers to establish a unified global verification framework for works created entirely by humans, drawing parallels to consumer labels like organic or fair-trade designations that would help viewers distinguish content made without generative AI tools.\n\n\t“The dominant AI narrative is about speed and cost, half the time, half the price,” Yates said. “That logic turns art into churn. Film has to define itself as the opposite of that, or it loses its soul and its economic power.”\n\t\n\n\tThe CEO stressed the company’s position doesn’t constitute opposition to artificial intelligence. “We support AI as a tool,” Yates said. “But we believe it’s essential to clearly distinguish AI-generated material from human expression. Without clear labelling and standards, we risk being overwhelmed by a flood of synthetic culture. A24 was right to add it into the credits but we believe we need to take this idea further.”\n\n\tAlessandro Spano, a legal expert in cyber law, AI and innovation at King’s College London and CityUHK, added: “The relationship between human intelligence and artifical intelligence in the creative industries reminds of Schrödinger’s cat story. It is a paradox. Is the cat dead or alive? It is both. It is a measurement problem. Is human intelligence in the creative sector dead or alive? It is both. It is another paradox. It is another measurement problem. With the ‘No AI Used’ initiative, Paul Yates’ The Mise en Scène Company is pioneering this debate.”\n\n\tMSC has opened conversations with partners internationally about bringing the certification beyond cinema into sectors including publishing, music and visual art.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "London Sales Company MSC Labels Films ‘No AI Used’ at EFM, Calls for Global Standard (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/EFM-No-AI.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-13T10:17:53.000Z",
      "dateModified": "2026-02-13T10:17:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Black Mandala, Red Owl Set Eight Genre Titles for EFM (EXCLUSIVE)",
    "url": "https://variety.com/2026/film/markets-festivals/black-mandala-red-owl-genre-titles-efm-1236661918/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Fish-Girl.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-13T08:55:58.000Z",
    "description": "\n\tBlack Mandala Films and Red Owl Films are loading up for Berlin’s European Film Market with eight genre titles spanning Lovecraftian horror, queer m",
    "body": "\n\tBlack Mandala Films and Red Owl Films are loading up for Berlin’s European Film Market with eight genre titles spanning Lovecraftian horror, queer mockumentary and an award-winning Ecuadorian fantasy.\n\n\tThe slate includes several market premieres alongside recent acquisitions and festival selections.\n\n\tBlack Mandala’s lineup includes “The Behemoth,” a supernatural horror film from director Kai E. Bogatzki that draws on Lovecraftian mythology and employs practical effects. The film builds tension before transforming into what the company describes as an unhinged, blood-soaked cosmic nightmare.\n\t\n\n\t“Blood Covenant” is a horror anthology featuring Maika Monroe (“It Follows”), Aria Bedmar (“Hermana Muerte”) and Joe Keery (“Stranger Things”). Framed by a meta-narrative exploring the price of artistic creation, the film unfolds through multiple standalone stories linked by a demonic pact.\n\n\n\t“Lily’s Ritual,” directed by Manu Herrera, follows four young women who retreat to a remote forest setting. The film stars Maggie García, Patricia Peñalver, Eve Ryan and Elena Gallardo, blending occult mythology with psychological tension.\n\n\t“Tabula Rasa” is a psychological thriller led by Spanish actor Macarena Gómez, known for her award-nominated role in “Musarañas.” The film merges family drama with atmospheric suspense.\n\n\tUnder the Red Owl Films banner, “Ex” from director Nicanor Loreti merges cosmic horror with relationship-driven drama, unfolding across one surreal night. “No Blood in My Hands” is a psychological thriller set within Berlin’s underground art scene, following a hallucinatory descent into paranoia.\n\t\n\n\t“Fishgirl,” written, directed, shot and edited by Javier Cutrona, was filmed entirely in Ecuador and won a prize at the Tallinn Black Nights Film Festival. The surreal fantasy drama explores themes of identity, memory and psychological transformation.\n\n\t“The Rebrand,” directed by Montreal-based filmmaker Kaye Adelaide, is a queer horror mockumentary featuring an all-queer cast and crew. The found-footage style film has received multiple festival awards.\n\n\tAuckland-based Black Mandala, founded by Michael Kraetzer and Nicolas Onetti in 2017, handles more than 150 titles and specializes in independent horror and genre distribution.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Black Mandala, Red Owl Set Eight Genre Titles for EFM (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Fish-Girl.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-13T08:55:58.000Z",
      "dateModified": "2026-02-13T08:55:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jessie Ware Joins ‘KPop Demon Hunters’ Singers on Lineup of BAFTA Film Awards Performers",
    "url": "https://variety.com/2026/film/global/jessie-ware-perform-bafta-film-awards-1236661941/",
    "image": "https://variety.com/wp-content/uploads/2026/02/20251204_JessieWare_08_359_V2.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-13T10:00:47.000Z",
    "description": "\n\tJessie Ware has joined the BAFTA party. \n\n\tThe award-winning singer-songwriter will take to the stage during the BAFTA Film Awards ceremony later th",
    "body": "\n\tJessie Ware has joined the BAFTA party. \n\n\tThe award-winning singer-songwriter will take to the stage during the BAFTA Film Awards ceremony later this month to perform a special tribute during the In Memoriam section. \n\n\t“It is a great honour to be performing at the BAFTAs in such an important and special moment to remember people and legends that have passed this year,” said Ware. “I’m singing a song from one of my favourite movies by one of my favourite artists and really cannot wait to be on stage in amongst a room of such talented individuals.”\n\t\n\n\tWare joins the already announced singers from Netflix smash hit “KPop Demon Hunters” — EJAE, Audrey Nuna and Rei Ami (better known as the singing voices for Rumi, Mira and Zoey) — who will perform the film’s record-breaking anthem “Golden.”\n\n\n\t“We are honoured to welcome Jesse Ware and her extraordinary talent to the EE BAFTA Film Awards next weekend,” said Emma Baehr, BAFTA’s executive director of awards and content. “Her beautiful, moving performance will offer a special moment for audiences both in the room and at home, as we pay tribute to those in the industry we have sadly lost.”\n\n\tWare’s performance will precede the release of her latest album “Superbloom” on 10th April, featuring her recent single “I Could Get Used to This.” Her last album, “That! Feels Good!,” debuted in third place on the Official U.K. Albums Chart and market her highest-ever entry on the U.S. Top Album Sales chart. \n\n\tThe BAFTA Film Awards ceremony takes place on Feb. 22 and will be hosted by Alan Cumming.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jessie Ware Joins ‘KPop Demon Hunters’ Singers on Lineup of BAFTA Film Awards Performers",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/20251204_JessieWare_08_359_V2.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-13T10:00:47.000Z",
      "dateModified": "2026-02-13T10:00:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Michelle Yeoh Avoids Question About U.S. Politics in Berlin and Shifts Focus to Cinema: ‘Best Not to Talk About Something I Don’t Know About’",
    "url": "https://variety.com/2026/film/festivals/michelle-yeoh-avoids-us-politics-question-berlin-focus-cinema-1236661925/",
    "image": "https://variety.com/wp-content/uploads/2026/02/michelle.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-13T09:59:36.000Z",
    "description": "\n\tMichelle Yeoh declined to speak about U.S. politics during a press conference at Berlin Film Festival, saying it’s “best not to talk about something",
    "body": "\n\tMichelle Yeoh declined to speak about U.S. politics during a press conference at Berlin Film Festival, saying it’s “best not to talk about something I don’t know about.” \n\n\tWhen asked by a reporter if she had any comment as an international actress on the current state of the U.S. — likely meaning Trump’s ongoing ICE raids, though that was not specified — Yeoh said: “I don’t think I am in the position to really talk about the political situation in the U.S., and also I cannot presume to say I understand how it is. So, best not to talk about something I don’t know about.” Yeoh, who is Malaysian and primarily lives in Switzerland, added that she wanted to “concentrate on what is important for us, which is cinema.”\n\t\n\n\t“We hear, ‘Oh, cinema is not going to survive because there’s so many other things happening, the attention span is getting shorter.’ But I truly don’t believe that,” she said. “Because I believe when we go to the cinema, that is time for you. You know, you switch off your phones and you’ve chosen to watch something that you want. And that is the time when you can open your heart and free your mind and have time to yourself. Cinema is a place where we all come together and laugh and cry, we celebrate, but it’s always important to keep that tradition alive. And I hope that is what we are here to do.”\n\n\n\tElsewhere in the conference, Yeoh said she would love to work with more European directors and is “dying” to make a movie with Mexican auteur Guillermo del Toro. “I think it’s finding the balance and hoping that the European directors will take notice of me and say, ‘Maybe we should have her in our film,'” she said. “So please put it out there! I would love to be back here and working with the true greats of European cinema.”\n\t\n\n\tYeoh was also asked about Asian representation in Hollywood, saying that it “continues to be a struggle” and recalling the industry challenges that came with making films like “Crazy Rich Asians” and “Everything Everywhere All at Once.”\n\n\t“At the time when he presented the movie, everyone was going, ‘Oh my God, he ticked all the wrong boxes — all-Asian cast, rom-com — it’s going to fall flat.’ But fortunately, I think it hit a nerve,” Yeoh said of “Crazy Rich Asians.” But, she added, “you could see that there was changes, otherwise I would not have been able to make ‘Everything Everywhere All at Once.'”\n\n\t“It was courageous to do that though, because once again, we ticked all the wrong boxes,” she said of the Oscar best picture winner. “But we prevailed, and I think that’s what it is. I think today, I sit here with a Golden Bear not because of just one movie, but the perseverance, the resilience, the stubbornness to ay, ‘I won’t just go away. I will stay until the right changes are made.'” \n\n\tLast night, Yeoh was presented the festival’s honorary Golden Bear for lifetime achievement from “Anora” director Sean Baker. The two collaborated on a short film, “Sandiwara,” which is premiering at the festival on Friday. \n\n\tIn his speech, Baker called Yeoh a “once-in a-generation screen presence, the kind who doesn’t just appear in movies, but the kind that redefines the temperature of the room.” Accepting the award, Yeoh moved the audience with an emotional speech reflecting on her career.\n\n\t“A part of me is still that young girl who simply wanted to make her parents proud,” she said. “My father is no longer here to see this moment. But I carry him with me, his discipline, his steadiness, his belief that if something is worth doing, it is worth doing well. And if he could see me here tonight, holding this Golden Bear, I know he would smile.”\n\n\tIn an interview with Variety on Thursday, Yeoh talked more about her decades in show business and ageism in Hollywood. “Let’s not let them define us as women or put us in a box and say, ‘Oh, well, because now you’re this age, you should only play a grandmother,’” she said. “I’m like, ‘Hell, no. I will kick ass because I want to, and I still can.’”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Michelle Yeoh Avoids Question About U.S. Politics in Berlin and Shifts Focus to Cinema: ‘Best Not to Talk About Something I Don’t Know About’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/michelle.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-13T09:59:36.000Z",
      "dateModified": "2026-02-13T09:59:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Yellow Letters’ Director İlker Çatak on Political Repression of Artists: ‘You Have It in the U.S. Too. Look at What Happened to Jimmy Kimmel!’",
    "url": "https://variety.com/2026/film/global/yellow-letters-ilker-catak-political-artists-jimmy-kimmel-1236659210/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Yellow-Letters.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-13T08:36:26.000Z",
    "description": "\n\tİlker Çatak, who was born in Berlin to Turkish parents, is back at the Berlinale with “Yellow Letters,” which unlike his last film — the Oscar-nomin",
    "body": "\n\tİlker Çatak, who was born in Berlin to Turkish parents, is back at the Berlinale with “Yellow Letters,” which unlike his last film — the Oscar-nominated Germany-set “The Teachers’ Lounge” — takes place entirely amid political repression in Turkey, even though it was shot in Germany.\n\n\tThe timely political drama stars Turkish actors Özgü Namal (Derya) and Tansu Biçer (Aziz) as an artists’ couple whose marriage implodes after they lose their jobs due to their political views.\n\t\n\n\tÇatak speaks to Variety about how political repression in the arts is not just a Turkish problem these days.\n\n\n\tWhat drew you to this story in which authoritarian political pressure disrupts a marriage?\n\n\tI’ve always wanted to make a film about marriage. I’m living in a marriage with a painter — who happens also to be my co writer on this film — and we were always fascinated by films such as “Marriage Story” [by Noah Baumbach] where you have this sort of tension between lovers that is, on the one hand, very tender and very loving. And on the other hand, absolutely harsh. Then there were the political aspects to this film. In 2019 I was in Istanbul where I had heard about the mass [political] layoffs happening prior to to then. But that day, I was sitting with with a few actor friends in a cafe, and one of the actors says: “I got this letter, and they laid me off because I smoked a cigarette backstage.” And I said: “What?” And he said: “Yes, that’s what the letter said.” I talked about this with my wife, and we started reading about these layoffs and what they did to families. Almost everyone is brought to a point where you are faced with selling off your ideals. And we thought: this is a perfect backdrop to tell a marriage story.\n\t\n\n\tIt’s interesting that Derya, the actress, sells out by working on a Turkish soap opera. Was that a comment on Turkish TV networks?\n\n\tIt’s not just a Turkish issue. You have it in the U.S. too. Look at what happened to Jimmy Kimmel! Look at what happened to the diversity announcement that Amazon put out a couple years ago, and then Trump came back, and all of a sudden: poof! As if it never happened. I would be hesitant to get into business with these types of networks that are good friends with administrations. Because I would be part of their agenda, right? As an artist, I don’t think it matters if you’re in the U.S. or in Turkey, or wherever. You have to ask yourself: “Who am I going to bed with here?” “Who is this person or his institution? And who are they tied to?” So that is something I think we as artists have to ask ourselves. And this question is getting louder and louder.\n\n\tIt almost seems as though you are taking Aziz’s side. On the one hand you have Aziz, the earnest artist with a big ego. On the other Derya, who is more pragmatic. Is that how you see it?\n\n\tTo be honest, I don’t take sides. I think I was hoping that Derya’s struggle and her decision would become clear. That’s my job, first and foremost. Not to judge, but to make things comprehensible. Of course, I would love to be on Aziz’s side. But I also see that it’s a very restricted point of view that is a bit, outdated. Maybe call it dreamy. It’s not how you provide for a family. And, first and foremost, you have to provide for a family. The big thing about this film is that I don’t want to judge anyone who works for, you know, Fox Networks, or whatever. I’m sure they have their reasons. But I want to question this behaviour because you need to have a spine. You need to know where you stand. I think that’s important as an artist. \n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tCourtesy Berlinale\n\t\n\n\n\n\tThis interview has been edited and condensed for clarity.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Yellow Letters’ Director İlker Çatak on Political Repression of Artists: ‘You Have It in the U.S. Too. Look at What Happened to Jimmy Kimmel!’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Yellow-Letters.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-13T08:36:26.000Z",
      "dateModified": "2026-02-13T08:36:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Berlin Title ‘Our Secret’ Launches Trailer, as Director Grace Passô Talks Desire to ‘Introduce New Dimension of Black Brazilian Lives on Screen’ (EXCLUSIVE) ",
    "url": "https://variety.com/2026/film/global/our-secret-trailer-grace-passo-berlin-festival-1236658281/",
    "image": "https://variety.com/wp-content/uploads/2026/02/VARIETY-SIZING-44.png?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-13T09:25:15.000Z",
    "description": "\n\tGrace Passô is a creative fueled by exploring the malleability of form. The actor, director and playwright adapted her own play into her feature deb",
    "body": "\n\tGrace Passô is a creative fueled by exploring the malleability of form. The actor, director and playwright adapted her own play into her feature debut “Our Secret,” premiering in Berlin seven years after her medium-length film “Dazed Flesh” — also adapted from the stage — played at the same festival. \n\n\t“Our Secret” is set in the Brazilian city of Belo Horizonte and follows a Black family struggling to regain their footing following the loss of their patriarch. While the adults bury themselves deeper in a pained silence, the youngest member of the family understands the powerful secret that lies in their household — a secret he yearns to share with his loved ones. When the truth finally comes out, this intimate drama melts into a captivating experiment in genre to explore complex themes of grief and ancestral memory. Watch an exclusive trailer below.\n\t\n\n\n\n\tSpeaking with Variety ahead of the film’s world premiere, Passô says the family’s story is one that has “followed her for years.” When the time came to direct her first feature film, she knew she wanted to return to the first play she ever wrote and continue to “follow a pattern in my career, where I revisit the work I’ve done on stage on the screen.” \n\n\n\t“The story blends intimacy with recurring themes in my career as well,” she goes on. “It mixes realism with surrealism and happens inside the intimate world of a family. This film was born out of a longtime desire to direct a feature and also out of my partnership with my producer, Ricardo [Alves Jr.]. We worked very hard together to find the resources to make it happen and we were both deeply invested in the film and the story we wanted to tell.”\n\t\n\n\tAs for the differences between broaching this tale of grief on stage versus the screen, the creative says “the artform you choose to tell a story tells a lot about what you want to say.”\n\n\t“A song is different from a book, which is different from a play,” she adds. “Experiencing the idea of love through these different formats brings different emotions within you. What I am interested in is understanding how to engage an audience’s sensibility through different formats. I’ve always been drawn to the creative aspects of directing.” \n\n\tDespite not necessarily being a large ensemble piece and taking place mostly within the family house, casting was a lengthy and essential process to make “Our Secret” happen, particularly because Passô felt the film heavily relied on the audience believing the intimacy of the family we see on screen. The toughest piece of the puzzle, says the director, was finding the child who plays Tutu. The role ultimately went to newcomer Efraim Santos. \n\n\t“Originally, I wrote the role for a girl around age seven, and had a whole auditioning process around that description,” she says. “It’s very common in auditions to be surprised by the children you encounter because most of them are acting for the very first time and what they do is often unexpected. It’s very special to be there to witness a child meeting the idea of cinema for the first time. Efraim didn’t match the characteristics I originally wanted for the role, but he was so interesting and I fell in love with his audition.” \n\n\tThe recent international success of films like Kleber Mendonça Filho’s “The Secret Agent” and Gabriel Mascaro’s Silver Bear-winning “The Blue Trail” reflects a strong moment of decentralization for Brazilian cinema. Despite the country’s Northeast having a great filmmaking legacy coming from the days of Cinema Novo, over the last two decades, most major Brazilian production companies have been based in Rio and São Paulo, with the country’s audiovisual output often reflecting this geographical imbalance. “Our Secret” is entirely shot in the Minas Gerais capital of Belo Horizonte, where Passô is from.\n\n\n\n\t\n\n\t\t\t\t\t“Our Secret,” courtesy of © entrefilms / Wilssa Esser\n\t\n\n\n\n\t“The struggle of every culture is to overcome its own stereotypes,” observes the director when reflecting on this moment. “Obviously, Brazil is seen through several stereotypes abroad, but our country is continental. Our culture is very diverse. It is hugely important that Brazil is seen in its real size and dimension on screen, not only so we can create a more honest portrayal of our country abroad, but also to further strengthen our national industry. Brazil is much bigger than Rio and São Paulo.”\n\t\n\n\tStill on the subject of breaking stereotypes, Passô emphasizes how interested she is in perceiving “Our Secret” as part of “stories that introduce a new dimension to Black Brazilian lives on screen.”\n\n\t“We know very well that one of the greatest feats of Black cinema internationally is how it has overcome certain stereotypes around Blackness,” she adds. “There is this tradition of Black stories being associated with tragedy, or seeing Black people as these mythical, all-knowing beings that are there to teach the world how to destroy racism. I did not want to associate this family with either tragedy or teaching. I am not interested in teaching people undergoing a journey of racial literacy how not to be racist. And having the freedom to do that is one of the greatest contributions of Black cinema in recent times.”\n\n\tWith her film, Passô wanted to “rescue Black memories generally and within me.” Every moment of human grief has that point where you don’t know how to express the dimension of what is happening, of what death represents in our lives. Having a family undergo that together and wrestle with this silence that lingered between them was an attempt at humanizing this story and allowing me to portray Black characters not as teachers guiding the audience through the stages of grief, nor people directly tied to suffering and punished by it. I wanted to make our experiences plural.” \n\n\t“Our Secret” is produced by Entrefilmes in co-production with Desvia, Globo Filmes, Quarta-Feira Filmes, Foi Bonita a Festa and Producões Grãos da Imagem. The Open Reel handles world sales.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Berlin Title ‘Our Secret’ Launches Trailer, as Director Grace Passô Talks Desire to ‘Introduce New Dimension of Black Brazilian Lives on Screen’ (EXCLUSIVE) ",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/VARIETY-SIZING-44.png?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-13T09:25:15.000Z",
      "dateModified": "2026-02-13T09:25:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Hasbro Entertainment and Animaj Launch Lumee to Rethink How Kids’ Content Makes Money Online",
    "url": "https://variety.com/2026/tv/global/hasbro-entertainment-animaj-lumee-kids-content-digital-sales-1236623149/",
    "image": "https://variety.com/wp-content/uploads/2026/02/LUMEE_LOGO_V2.png?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-13T10:25:00.000Z",
    "description": "\n\tHasbro Entertainment and Animaj have launched Lumee, a joint venture aimed at spearheading digital advertising sales and striking brand partnership ",
    "body": "\n\tHasbro Entertainment and Animaj have launched Lumee, a joint venture aimed at spearheading digital advertising sales and striking brand partnership in the kids’ content space.\n\n\tLumee will bring together Hasbro’s and Animaj’s portfolios of flagship brands, ranging from “Peppa Pig” to “Transformers,” “Pocoyo” and “Maya the Bee.” \n\n\tThrough the new banner, Animaj – which is a next-generation kids media company backed by strategic investor HarbourView Equity Partners — will handle these IP’s across film, television, animation and digital, through YouTube, connected TV and AVOD/FAST platforms. The joint venture is now operational and in talks with major advertisers. Together, Hasbro and Animaj say their digital networks generate more than 50 billion views per year on YouTube alone. “Kids attention and curiosity continue to evolve faster than ever,” said Sixte de Vauplane, co-Founder and CEO of Animaj. “With Lumee, we are building a bridge between advertisers and anew generation of digital-native kids.”\n\t\n\n\tGregory Dray, co-founder of Animaj and chairman of Lumee, said “Kids’ and family content is currently the most undervalued real estate in the digital world.” A former Google and YouTube’s senior executive, Dray added, “The industry doesn’t have an audience problem; it has a business model problem.”\n\n\tDray pointed out Kids’ and family programming represents more than 15% of total viewing on YouTube, yet monetization has weakened significantly since 2020, when regulatory changes eliminated personalized advertising on “Made for Kids” content. While those rules strengthened child privacy protections, he argued that they also removed the primary mechanism platforms used to target advertising in the kids’ space.\n\n\tOur joint venture with Animaj is a strategic move to maximize the value of our kids brands for advertisers,” said Yannick Ferrero, SVP of digital and distribution at Hasbro Entertainment. “While ensuring digital interactions remain safe and appropriate for families.”\n\t\n\n\tLumee will also support original and branded content developed around existing characters. This work will draw on Animaj’s AI-enhanced production pipeline, which the company says can reduce creative development timelines by up to 60% compared with traditional animation workflows.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Hasbro Entertainment and Animaj Launch Lumee to Rethink How Kids’ Content Makes Money Online",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/LUMEE_LOGO_V2.png?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-13T10:25:00.000Z",
      "dateModified": "2026-02-13T10:25:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Guess the Babe Acting a Little Strange in a Skimpy Tennis Outfit",
    "url": "https://www.tmz.com/2026/02/12/guess-who-tennis-babe/",
    "image": "https://imagez.tmz.com/image/8e/16by9/2026/02/12/8e6228a69ee34d90beef4737004ead86_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-12T23:16:33.000Z",
    "description": "\n    \n                    \n                          Guess the\n                          Tennis Babe Who's No Stranger to Dropping Jaws!\n             ",
    "body": "\n    \n                    \n                          Guess the\n                          Tennis Babe Who's No Stranger to Dropping Jaws!\n                      \n                  \n                                                                        Published \n                              \n                February 12, 2026\n                \n                            3:16 PM PST\n                                                                      |\n                                                                Updated \n                                  February 12, 2026\n                                5:52 PM PST\n                                    \n      \n    \n      \n        \n              \n    \n    \n          This sexy actress took a minute on the tennis court to drop a few thirst traps ... showing off her toned body, while she acted a little goofy ... or what some might even call, \"strange.\"\n      \n    \n          The hottie has become a household name thanks to her work on several popular TV series and films ... and has no issue showing off that she's a perfect 10 ... maybe even an 11.\n      \n    \n          Still unsure? Hit up the gallery for the reveal!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                TV\n              \n                          \n                Hotties & Bodies\n              \n                          \n                Hot Bodies\n              \n                          \n                Guess Who\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Guess the Babe Acting a Little Strange in a Skimpy Tennis Outfit",
      "image": [
        "https://imagez.tmz.com/image/8e/16by9/2026/02/12/8e6228a69ee34d90beef4737004ead86_xl.jpg"
      ],
      "datePublished": "2026-02-12T23:16:33.000Z",
      "dateModified": "2026-02-12T23:16:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Guess Which Iconic Figure Skater This Kiddo Turned Into!",
    "url": "https://www.tmz.com/2026/02/12/guess-which-iconic-figure-skater-this-kiddo-turned-into/",
    "image": "https://imagez.tmz.com/image/b4/16by9/2026/02/09/b4281b51429a4d3bb7b5fe435d1fd220_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-12T23:56:43.000Z",
    "description": "\n    \n                    \n                          Guess Which\n                          Iconic Figure This\n                          Kiddo Turned I",
    "body": "\n    \n                    \n                          Guess Which\n                          Iconic Figure This\n                          Kiddo Turned Into!\n                      \n                  \n                                                                        Published \n                              \n                February 12, 2026\n                \n                            3:56 PM PST\n                                                                      |\n                                                                Updated \n                                  February 12, 2026\n                                5:53 PM PST\n                                    \n      \n    \n          Before this curly-cutie was gliding down the ice and winning Olympic medals, he was just rockin' his Robin costume and posing for the cameras ... and owning the ice like Batman!\n      \n    \n          Can you find the hidden word below? It's Bubble Pop time!\n      \n    \n          After scoring a bronze at the 2018 Olympics, he took his moves to the ballroom -- pairing up with Jenna Johnson on \"Dancing With The Stars.\"\n      \n    \n          Can you guess who he is?\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Olympics\n              \n                          \n                Guess Who\n              \n                          \n                TMZ Sports\n              \n                          \n                Kids\n              \n                          \n                celebrity kids\n              \n                          \n                Photo Galleries\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Guess Which Iconic Figure Skater This Kiddo Turned Into!",
      "image": [
        "https://imagez.tmz.com/image/b4/16by9/2026/02/09/b4281b51429a4d3bb7b5fe435d1fd220_xl.jpg"
      ],
      "datePublished": "2026-02-12T23:56:43.000Z",
      "dateModified": "2026-02-12T23:56:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rep. Jake Auchincloss Tells Fellow Members of Congress to 'Touch Grass'",
    "url": "https://www.tmz.com/2026/02/13/jake-auchincloss-gives-congress-advice-devices/",
    "image": "https://imagez.tmz.com/image/2f/16by9/2026/02/12/2f311a1433aa462b9bb44f1fd49f1196_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-13T09:00:37.000Z",
    "description": "\n                            \n                          Rep. Jake Auchincloss\n                          Politicians Are Chronically Online\n           ",
    "body": "\n                            \n                          Rep. Jake Auchincloss\n                          Politicians Are Chronically Online\n                          Go Outside, Touch Grass!!!\n                      \n                  \n                                                                        Published \n                              February 13, 2026\n                            1:00 AM PST\n                                                                            \n              \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          Representative Jake Auchincloss says politicians need to ditch their phones and get in touch with nature ... telling us most are nice IRL -- but they can get real nasty online.\n      \n    \n          We caught up with the the Democratic Congressman from Massachusetts on Capitol Hill earlier this week ... and we asked him about the differences between politicians' in-person and online personas.\n      \n\n          Auchincloss tells us he got a device over Christmas that \"bricks\" his phone -- basically making it a glorified paperweight -- and, he thinks his fellows in the House and Senate should get similar tech to brick their own phones and go \"touch grass.\"\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Rep. Auchincloss acknowledges social media is a useful mass communication tool -- like newspapers and TV -- but he still thinks face-to-face encounters lead to more understanding across political divides.\n      \n    \n          The congressman also defends most of his colleagues ... claiming a vast majority are trying to govern correctly -- but a small minority is ruining it for everyone.\n      \n    \n          Mr. Speaker, can we have Congress outside today?\n      \n      ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rep. Jake Auchincloss Tells Fellow Members of Congress to 'Touch Grass'",
      "image": [
        "https://imagez.tmz.com/image/2f/16by9/2026/02/12/2f311a1433aa462b9bb44f1fd49f1196_xl.jpg"
      ],
      "datePublished": "2026-02-13T09:00:37.000Z",
      "dateModified": "2026-02-13T09:00:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Lou Young Urges Men Not to Blow Their Rent on Pricey Valentine's Day Gifts",
    "url": "https://www.tmz.com/2026/02/12/lou-young-valentines-day-gifts-advice/",
    "image": "https://imagez.tmz.com/image/85/16by9/2026/02/12/85ac1aceb1c14a1fb326bd971c7cea47_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-13T02:00:15.000Z",
    "description": "\n    \n                    \n                          Lou Young\n                          Fellas, Don't Blow the Rent on Valentine's Day!!!\n           ",
    "body": "\n    \n                    \n                          Lou Young\n                          Fellas, Don't Blow the Rent on Valentine's Day!!!\n                      \n                  \n                                                                        Published \n                              February 12, 2026\n                            6:00 PM PST\n                                                                            \n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          Valentine’s Day is creeping up ... and while couples are busy emptying their wallets, Lou Young is waving a financial red flag.\n      \n    \n          We caught up with Lou at Druski’s \"Coulda Been Love\" Season 2 event Wednesday, and he told TMZ straight up -- fellas need to chill before they blow the rent money trying to impress. Why? Because March 1 is looming ... and rent waits for no one.\n      \n\n      \n        \n              \n    \n    \n          Catch the full clip ... 'cause Lou elaborates on his message -- spend what you can afford.\n      \n    \n          We also hit him with the ultimate IG question -- is it a red flag if a guy won’t post his girl? His answer might raise some eyebrows!\n      \n    \n          Hit the clip ... Lou breaks down relationships, money moves, and what’s next on his professional plate.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Druski\n              \n                          \n                Social Media\n              \n                          \n                Celebrity News\n              \n                          \n                TV\n              \n                          \n                Money\n              \n                          \n                Sundance\n              \n                          \n                Relationships\n              \n                          \n                TMZ Sports\n              \n                          \n                Comedy\n              \n                          \n                YouTube\n              \n                          \n                Instagram\n              \n                          \n                Exclusive\n              \n                          \n                Carolina Panthers\n              \n                          \n                Holidays\n              \n                          \n                Football\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lou Young Urges Men Not to Blow Their Rent on Pricey Valentine's Day Gifts",
      "image": [
        "https://imagez.tmz.com/image/85/16by9/2026/02/12/85ac1aceb1c14a1fb326bd971c7cea47_xl.jpg"
      ],
      "datePublished": "2026-02-13T02:00:15.000Z",
      "dateModified": "2026-02-13T02:00:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Allison Holker Engaged To Adam Edmunds Three Years After Husband tWitch Boss’ Death",
    "url": "https://www.tmz.com/2026/02/12/allison-holker-engaged-three-years-after-twitch-boss-passing/",
    "image": "https://imagez.tmz.com/image/79/16by9/2026/02/13/798e8779d84b48329cd78c7271f8808c_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-13T01:26:13.000Z",
    "description": "\n    \n                    \n                          Allison Holker\n                          I'm Off The Market!!!\n                      \n           ",
    "body": "\n    \n                    \n                          Allison Holker\n                          I'm Off The Market!!!\n                      \n                  \n                                                                        Published \n                              February 12, 2026\n                            5:26 PM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Allison Holker is sharing a major life update ... announcing her engagement to Adam Edmunds.\n      \n    \n          The 'DWTS' alum took to social media Thursday to announce Adam had popped the question less than two years into their relationship.\n      \n    \n        Waiting for your permission to load the Instagram Media.\n      \n    \n          Allison posted a bunch of photos from the surprise proposal ... and she says Adam got down on bended knee during a surprise birthday party.\n      \n\n          The engagement comes about 38 months after Allison's late husband, Stephen \"tWitch\" Boss, died. In December 2022, tWitch tragically committed suicide.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Allison and Adam went public in September 2024, after Allison's initial soft launch of the relationship on social media.\n      \n    \n          The dancer says Adam's proposal was \"the most romantic night of my life\" ... and she says her fiancé \"helped me find me again and showed me how to love.\"\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Allison adds, \"I am so in love with you Adam. Baby, I am forever grateful for you and the impact you have had in my life and my kids lives. I am a better person because of you.\"\n      \n    \n          Congrats!!!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Celebrity News\n              \n                          \n                TV\n              \n                          \n                Relationships\n              \n                          \n                So You Think You Can Dance\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Allison Holker Engaged To Adam Edmunds Three Years After Husband tWitch Boss’ Death",
      "image": [
        "https://imagez.tmz.com/image/79/16by9/2026/02/13/798e8779d84b48329cd78c7271f8808c_xl.jpg"
      ],
      "datePublished": "2026-02-13T01:26:13.000Z",
      "dateModified": "2026-02-13T01:26:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]