[
  {
    "title": "Royal Shakespeare Company’s ‘Cyrano de Bergerac’ With Adrian Lester Sets West End Transfer",
    "url": "https://variety.com/2026/theater/news/royal-shakespeare-company-cyrano-de-bergerac-west-end-1236645476/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Adrian-Lester-Cyrano.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-30T10:00:00.000Z",
    "description": "\n\tThe Royal Shakespeare Company‘s production of “Cyrano de Bergerac” is heading to London’s West End, with Adrian Lester returning in the title role f",
    "body": "\n\tThe Royal Shakespeare Company‘s production of “Cyrano de Bergerac” is heading to London’s West End, with Adrian Lester returning in the title role for a limited summer engagement.\n\n\tThe show will play the Noël Coward Theatre from June 13 through Sept. 5. The transfer follows the production’s well-received run at the RSC’s Stratford-upon-Avon home last year.\n\n\tSimon Evans, who helms the production, has created a fresh adaptation of Edmond Rostand’s classic alongside co-writer Debris Stevenson. Susannah Fielding will reprise her performance as Roxane opposite Lester’s Cyrano, with additional casting still to come.\n\t\n\n\tThe mounting is a collaboration between Wessex Grove, Gavin Kalin Productions and the RSC at the Delfont Mackintosh-operated venue.\n\n\n\t“Simon Evans and I have been working on this project for years, well before the brilliant and incredibly supportive RSC collaborated with us to make it happen,” Lester said. “I am so happy to be stepping back into the role of Cyrano in order to bring this playful and poignant production to more audiences in the West End.”\n\n\tThe Olivier Award-winning actor praised the adaptation’s approach, calling it “hilariously funny and desperately moving in equal parts.”\n\n\tEvans and Stevenson described their version as exploring “the courage it takes to say what you mean, plainly and bravely.”\n\n\t“At the heart of it all is Adrian Lester, whose extraordinary combination of gentleness, playfulness, and ferocity is utterly captivating,” they said. “We’re incredibly proud to bring this production to the West End, and to share it with new audiences.”\n\t\n\n\tThe creative ensemble includes Grace Smart handling set and costume design, Joshie Harriette on lighting, Alex Baranowski composing music, and Donato Wharton designing sound. Sarita Piotrowski serves as movement director, with Bethan Clark choreographing fights and intimacy. Rebecca Latham is dramaturg for the RSC, and Matthew Dewsbury CDG handles casting.\n\n\tLester’s extensive stage credits include “Henry V” and “Othello” at the National Theatre, “Company” at the Donmar Warehouse and West End, and “The Lehman Trilogy” on Broadway. Fielding previously appeared in RSC’s “The Merchant of Venice” and won the Ian Charleson Award in 2014.\n\n\tEvans’ directing work includes the RTS award-winning BBC series “Staged,” which he also wrote and starred in. Stevenson is a playwright and Grime-poet whose works include “Poet in Da Corner” at the Royal Court.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Royal Shakespeare Company’s ‘Cyrano de Bergerac’ With Adrian Lester Sets West End Transfer",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Adrian-Lester-Cyrano.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-30T10:00:00.000Z",
      "dateModified": "2026-01-30T10:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "BayView Entertainment Takes North American Rights to FlareFlow Microdramas (EXCLUSIVE)",
    "url": "https://variety.com/2026/tv/news/bayview-north-american-rights-flareflow-microdramas-1236645480/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Married-But-Available1.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-30T08:09:04.000Z",
    "description": "\n\tBayView Entertainment has secured North American distribution rights to a catalog of vertical video titles from FlareFlow, the microdrama platform o",
    "body": "\n\tBayView Entertainment has secured North American distribution rights to a catalog of vertical video titles from FlareFlow, the microdrama platform operated by COL Group International, marking the first time the mobile-first content will be available beyond its native app.\n\n\tThe Los Angeles and Vancouver-based distributor plans to roll out the titles across VOD and TVOD platforms during the second quarter of 2026 using its DotstudioPRO distribution technology. BayView president Peter Castro and FlareFlow CEO James Wang unveiled the deal.\n\t\n\n\tTitles in the slate include “Who’s the Real Bride?,” “My Christmas Lover,” “My Werewolf Husband,” “Mistress With a Secret,” “The Blind Heiress Strikes Back” and “Naked Truth at Crazy Beach.”\n\n\n\tFlareFlow, which debuted in April 2025 on iOS and Android, has emerged as a major player in the expanding microdrama sector. The platform specializes in short-form serialized narratives produced specifically for vertical viewing, reporting more than 25 million subscribers worldwide. Parent company COL Group International has operated as a category leader in microdrama storytelling for several years.\n\n\tThe acquisition represents BayView’s first significant move into vertical-format scripted programming. The distributor has spent two decades building a catalog of more than 3,500 titles spanning multiple genres, including award-winning films that have premiered at Sundance, SXSW, Tribeca and the Toronto Film Festival.\n\n\tFlareFlow’s content delivers narrative stories in episodes running under 90 seconds, with cliffhanger endings designed to keep viewers advancing through episodes. The productions are professionally shot specifically for vertical screens rather than repurposed from traditional formats.\n\t\n\n\t“Traditional TV made you wait a week. Streaming makes you click through credits. FlareFlow’s hook is immediate, the payoff is instant, and before you know it, you’ve watched an entire series during your commute – essentially binge-watching for people who don’t have time to binge-watch,” Wang said. “We’re introducing North American audiences to rapid-fire storytelling that’s refreshingly different. And thanks to our strategic new partnership with BayView Entertainment, we’re looking forward to building our international audience as they discover this new genre beyond the mobile app ecosystem.”\n\n\tCastro said the deal fits into broader industry trends around short-form scripted content. “Vertical, short-form scripted content continues to gain traction globally,” he said. “FlareFlow has built a substantial audience around the world eager for short-form entertainment, and this deal, bolstering our already successful offerings, allows us to test that demand across traditional digital retail and VOD platforms.”\n\n\tBayView merged with DotstudioPRO in summer 2025, combining the latter’s content management system, API tools and metadata automation capabilities with BayView’s distribution operations. The combined entity now maintains a library of more than 7,500 titles.\n\n\tCOL Group International operates across more than 170 territories and continues expanding partnerships with writers, studios and distributors for its microdrama platforms.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "BayView Entertainment Takes North American Rights to FlareFlow Microdramas (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Married-But-Available1.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-30T08:09:04.000Z",
      "dateModified": "2026-01-30T08:09:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Charades Boards Family Thriller ‘Bloodsuckers’ From ‘Midsommar’ Producer (EXCLUSIVE)",
    "url": "https://variety.com/2026/film/global/charades-bloodsuckers-family-thriller-efm-1236645491/",
    "image": "https://variety.com/wp-content/uploads/2026/01/02d19687-808b-467a-bee6-fa1e9b1b7c97.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-30T10:13:41.000Z",
    "description": "\n\tParis‑based sales company Charades (“Urchin”) has boarded “Bloodsuckers,” a family thriller that marks the sophomore feature of Elin Grönblom (“Ella",
    "body": "\n\tParis‑based sales company Charades (“Urchin”) has boarded “Bloodsuckers,” a family thriller that marks the sophomore feature of Elin Grönblom (“Ella and Friends”).\n\n\tCurrently in post-production, the film is being showcased today at Göteborg Film Festival’s Works in Progress and will be officially launched by Charades at the EFM where a promo reel will be presented to buyers. \n\n\t“Bloodsuckers” is produced by Mylla Films, an ambitious genre film and TV label launched by Patrik Andersson, whose credits include Ari Aster’s “Midsommar” and Jakob Abrahamsson, who previously worked at NonStop Entertainment.\n\t\n\n\tThe story follows Johanna (38), who heads off on a well-deserved vacation with her family. “A visit to the deep Scandinavian forest leaves her drawn to a mesmerizing dark bog, where relentless mosquitoes seem to awaken something within her. As their bites take hold, her self-preserving instincts emerge, transforming her into a mother driven to extremes to finally find some peace and quiet,” reads the synopsis. \n\n\n\tGrönblom is a promising Scandinavian filmmaker who graduated with a MFA in Filmmaking from The New York Film Academy and made her debut feature, “Ella and Friends,” after having directed several acclaimed short films, including “My Dad’s an Alien!” and “Goldfish Love.” \n\n\tAndersson and Abrahamsson, who are producing via their four-year old vehicle Mylla Films, said, “We are thrilled to be in the hands of Charades and to see the film launched onto the international market with the strongest possible partner for a feature like this, their love for bold, director-driven cinema makes it the perfect home for the film.” \n\t\n\n\t“‘Bloodsuckers’ stands out through its singular blend of psychological thriller, dark humour and an unsettling portrait of family life, exquisitely crafted and executed by Elin Grönblom and Josefin Sonck it’s coming along both deeply Scandinavian and strikingly universal. It’s a film that will hit close to home – wherever home is – and we’re thrilled to be presenting it to the international market at EFM”\n\n\tCharades’ co-founder Carole Baraton said, “We wanted to be a part of  as soon as we heard its pitch, the film blends everything we love in Scandi cinema — (very) dark-humour, sharp social critique and close character study — and refreshingly takes on the sacro-saint institution of the family.” “We can not wait to bring Elin’s radical yet playful voice to audiences,” Baraton added. \n\n\tMylla films’ development pipeline includes Michael Marcimain’s “Devastation (“Förhärjelsen”), and Måns Mårlind’s “Before They Were Gods” with Nick Cave and Joakim Thåström.\n\n\tThe project is backed by Film i Väst, Sveriges Television, Good Hand Production and Nonstop Winning Formula, with the support from the Swedish Film Institute (commissioner Hanna Sohlberg), Finnish Film Foundation, Nordisk Film & TV Fond, Svenska Kulturfonden and Amos Andersons Fond; in association with YLE, Cinemanse, Nonstop Entertainment, MAEQ Studios and Peter Harrysson Media Invest. “Bloodsuckers” was produced as part of an initiative from the Swedish Film Institute and Sveriges Television called Moving Sweden.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Charades Boards Family Thriller ‘Bloodsuckers’ From ‘Midsommar’ Producer (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/02d19687-808b-467a-bee6-fa1e9b1b7c97.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-30T10:13:41.000Z",
      "dateModified": "2026-01-30T10:13:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Hyun Bin’s ‘Made In Korea’ Tops Disney+ Asia Pacific Charts",
    "url": "https://variety.com/2026/tv/news/hyun-bin-made-in-korea-disney-asia-pacific-charts-1236645446/",
    "image": "https://variety.com/wp-content/uploads/2025/11/Made-in-Korea.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-30T07:08:05.000Z",
    "description": "\n\tDisney+ has confirmed that “Made In Korea” has become the streamer’s most-viewed Korean original premiere of 2025 across Asia-Pacific markets, based",
    "body": "\n\tDisney+ has confirmed that “Made In Korea” has become the streamer’s most-viewed Korean original premiere of 2025 across Asia-Pacific markets, based on viewership figures recorded 28 days after its Dec. 24 debut.\n\n\tThe crime noir series, set in 1970s Korea, stars Hyun Bin as Baek Kitae, a Korean Central Intelligence Agency operative leading a double existence as both government agent and smuggler. The character leverages his illicit operations to advance within the agency while generating substantial funds and protecting his brother. His ascent faces opposition from an incorruptible prosecutor, portrayed by Jung Woosung, setting up a high-stakes confrontation between the two men.\n\t\n\n\tThe series also features Woo Dohwan as Kitae’s brother Baek Kihyun. Park Eunkyo and Park Joonseok wrote the series, with Woo Minho directing. Hive Media Corp serves as production company.\n\n\n\tDisney+ has already greenlit and begun production on a second season. The renewal was first confirmed at Disney+’s originals preview event at Hong Kong Disneyland in 2025.\n\n\tThe success of “Made In Korea” caps a strong year for Disney+ in the region, which saw the platform release more than a dozen APAC series including “Hyper Knife,” “Tempest,” “The Manipulated,” “Nine Puzzles” and “Gannibal” Season 2.\n\n\tHyun Bin previously starred in “Crash Landing On You” and “Confidential Assignment,” while Jung Woosung’s credits include “12.12: The Day” and “Hunt.” Woo Dohwan appeared in “Bloodhounds” and “Mr. Plankton.”\n\n\tDirector Woo Minho’s previous work includes “The Man Standing Next” and “Inside Men,” while Hive Media Corp produced both those films along with “12.12: The Day.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Hyun Bin’s ‘Made In Korea’ Tops Disney+ Asia Pacific Charts",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/Made-in-Korea.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-30T07:08:05.000Z",
      "dateModified": "2026-01-30T07:08:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tadanobu Asano, Yukino Kishii Starrer ‘All the Lovers in the Night’ Boarded by Bitters End for International Sales Ahead of Berlin EFM (EXCLUSIVE)",
    "url": "https://variety.com/2026/film/news/tadanobu-asano-all-the-lovers-in-the-night-bitters-end-1236645440/",
    "image": "https://variety.com/wp-content/uploads/2026/01/All-the-Lovers-in-the-Night.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-30T06:54:34.000Z",
    "description": "\n\tJapanese sales and distribution company Bitters End has acquired international rights to “All the Lovers in the Night,” Yukiko Sode’s feature adapta",
    "body": "\n\tJapanese sales and distribution company Bitters End has acquired international rights to “All the Lovers in the Night,” Yukiko Sode’s feature adaptation of Mieko Kawakami’s celebrated novel starring Golden Globe winner Tadanobu Asano (“Shōgun”) in a key supporting role.\n\n\tJapan Academy Prize winner Yukino Kishii (“Small, Slow But Steady,” Berlinale 2022) leads the cast in the project, which marks the first full-length film adaptation of a work by Kawakami. The author’s novel gained international recognition as the first Japanese title shortlisted for the U.S. National Book Critics Circle Award.\n\t\n\n\tThe literary sensation tells a love story centered on Fuyuko, a freelance proofreader living in solitude whose carefully ordered life begins to transform after meeting Mitsutsuka, a quiet high school physics teacher.\n\n\n\tThe film is currently in post-production with a Japanese theatrical release scheduled for later this year.\n\n\tSode’s sophomore feature “Aristocrats” (2021) bowed at the International Film Festival Rotterdam before achieving substantial commercial success in France, drawing over 71,000 admissions and cementing the director’s appeal to international audiences.\n\n\tBitters End will present the title at Berlin’s European Film Market alongside Riju Go’s screwball romance “Rhapsody, Rhapsody,” starring Issey Takahashi, and Ryusuke Hamaguchi’s upcoming feature “All of a Sudden,” which the company is co-repping with Cinefrance International for the Asian market.\n\n\tThe Tokyo-based company has operated for more than three decades as a major independent player in theatrical distribution, production, and international partnerships. Its distribution portfolio includes titles from Hamaguchi, Bong Joon Ho, the Dardenne brothers, Jia Zhangke, Roy Andersson, and Gianfranco Rosi, with recent releases including “Anora,” “Young Mothers,” “Sex/Love/Dreams,” and “Caught by the Tide.”\n\t\n\n\tOn the production side, Bitters End’s credits include the Oscar-winning “Drive My Car” and Sho Miyake’s “Two Seasons, Two Strangers,” which took the Golden Leopard at Locarno.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tadanobu Asano, Yukino Kishii Starrer ‘All the Lovers in the Night’ Boarded by Bitters End for International Sales Ahead of Berlin EFM (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/All-the-Lovers-in-the-Night.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-30T06:54:34.000Z",
      "dateModified": "2026-01-30T06:54:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Hilary Duff Hints at Upcoming World Tour at Sold-Out Los Angeles Concert",
    "url": "https://variety.com/2026/music/news/hilary-duff-world-tour-concert-los-angeles-1236645447/",
    "image": "https://variety.com/wp-content/uploads/2026/01/HilaryDuff00031.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-30T07:23:21.000Z",
    "description": "\n\tIt’s a pun that never gets old: Hilary Duff‘s mini-tour is what dreams are made of. The singer performed the final set of her four-stop “Small Rooms",
    "body": "\n\tIt’s a pun that never gets old: Hilary Duff‘s mini-tour is what dreams are made of. The singer performed the final set of her four-stop “Small Rooms, Big Nerves” mini-tour — her first headlining show in over a decade — on Thursday night, but announced that much more is on the way.\n\n\tDuring “With Love,” Duff continued a tradition, bringing fans onstage to reenact the viral dance that she once did on “The Today Show.” Mitchell Gerrard Johnson was one of the three fans pulled on stage at The Wiltern in Los Angeles, all of whom were gifted t-shirts after the dance. They then turned around, revealing that the t-shirts read, “WORLD TOUR LOADING…”\n\t\n\n\n\tWhile no announcement has been made just yet, the night wrapped with an encore of “What Dreams Are Made Of,” and attendees were given a flyer featuring the message “more to come” and a link to her website.\n\n\n\tThe sold-out concert blended fan favorites, including “So Yesterday,” “Wake Up,” “Someone’s Watching Over Me,” and “Come Clean,” and new material like “Mature” and “Roommates,” as well as unreleased songs from her album “luck… or something,” which will be released February 20.\n\n\tDuring the event, which was also attended by Mandy Moore, Olivia Holt and Duff’s family, the singer got emotional, thanking the fans.\n\n\t“I want to say that there’s been an overarching happiness and sunshine that you all have brought to these shows,” she said. “The world is super hard to process right now and so bleak. I want you all to know that each and every one of you here, I love you and love that we can take a pause.”\n\t\n\n\tNext, Duff will perform six shows in Las Vegas — three in February and three in May, all of which are sold out.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Hilary Duff Hints at Upcoming World Tour at Sold-Out Los Angeles Concert",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/HilaryDuff00031.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-30T07:23:21.000Z",
      "dateModified": "2026-01-30T07:23:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "S.S. Rajamouli’s ‘Varanasi’ Producer Unpacks Theatrical Release Strategy (EXCLUSIVE)",
    "url": "https://variety.com/2026/film/news/ss-rajamouli-varanasi-producer-theatrical-release-strategy-1236645454/",
    "image": "https://variety.com/wp-content/uploads/2025/11/Priyanka-Chopra-Jonas-mandakini.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-30T07:35:14.000Z",
    "description": "\n\tThe producers of S.S. Rajamouli‘s action-adventure epic “Varanasi” have revealed the strategic thinking behind the film’s April 7, 2027 release date",
    "body": "\n\tThe producers of S.S. Rajamouli‘s action-adventure epic “Varanasi” have revealed the strategic thinking behind the film’s April 7, 2027 release date and its marketing campaign, which began with a cryptic installation in the titular Indian city.\n\n\tThe project is being produced under the banner of Sri Durga Arts and Showing Business. Producers include K.L. Narayana and S.S. Karthikeya. \n\n\n\t“Varanasi lies at the heart of this film, so beginning the release conversation from the city itself felt instinctive,” producer Karthikeya tells Variety. “The cryptic on-ground installation was intended to spark curiosity, and audiences connected the dots organically.”\n\t\n\n\tThe release date was carefully selected to maximize the film’s theatrical window by aligning with major Indian festivals and holidays.\n\n\t“April 7, 2027, sits within the festive period of Ugadi and Gudi Padwa, flows into the weekend, and is followed by Ambedkar Jayanti and Rama Navami, creating a strong extended theatrical window,” Karthikeya says. “It’s a date that perfectly aligns with us and all our stakeholders.”\n\n\tThe film’s story spans thousands of years and traverses multiple continents, with locations ranging from Antarctica to Africa to the titular Indian city. One of the key sequences in the film is inspired by a chapter from Indian epic “Ramayana,” the protagonist of which is Hindu God Rama. The Rama Navami festival celebrates his birth. \n\n\tTelugu-language cinema superstar cinema Mahesh Babu leads the cast of “Varanasi” alongside Priyanka Chopra Jonas and Prithviraj Sukumaran.\n\n\tRajamouli’s “RRR” became a global phenomenon following its 2022 release, earning widespread critical acclaim and audience enthusiasm that extended well beyond traditional Indian cinema markets, with the film’s Academy Awards success marking a milestone for Indian cinema on the international stage. It is the fifth-highest grossing film in the history of Indian cinema. \n\t\n\n\t“Varanasi” reunites the “RRR” helmer with Oscar-winning composer MM Keeravani, who took home the Academy Award for best original song for “Naatu Naatu” from “RRR.” \n\n\n\n\t\n\n\t\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "S.S. Rajamouli’s ‘Varanasi’ Producer Unpacks Theatrical Release Strategy (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/Priyanka-Chopra-Jonas-mandakini.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-30T07:35:14.000Z",
      "dateModified": "2026-01-30T07:35:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Alia Bhatt’s Eternal Sunshine Productions Teams With Prime Video on Coming-of-Age Rom-Com ‘Don’t Be Shy’ (EXCLUSIVE)",
    "url": "https://variety.com/2026/tv/news/alia-bhatt-prime-video-rom-com-dont-be-shy-1236642135/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Alia-Bhatt-Nikhil-Madhok.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-30T04:27:00.000Z",
    "description": "\n\tPrime Video has greenlit “Don’t Be Shy,” an original romantic comedy produced by Alia Bhatt and Shaheen Bhatt through their Eternal Sunshine Product",
    "body": "\n\tPrime Video has greenlit “Don’t Be Shy,” an original romantic comedy produced by Alia Bhatt and Shaheen Bhatt through their Eternal Sunshine Productions banner, with Grishma Shah and Vikesh Bhutani serving as co-producers.\n\n\tWritten and directed by Sreeti Mukerji, the coming-of-age film centers on Shyamili “Shy” Das, a 20-year-old whose meticulously organized life begins to unravel when an unexpected turn of events sends things spiraling beyond her control. Mukerji previously worked on the direction teams of Bollywood hits “Yeh Jawaani Hai Deewani,” “Ae Dil Hai Mushkil” and “Brahmastra Part One: Shiva.” \n\t\n\n\t“We’re thrilled to collaborate with Alia Bhatt and Shaheen Bhatt on this extremely fun yet warm romantic comedy, with a remarkable character like Shy Das at its heart,” said Nikhil Madhok, director and head of originals at Prime Video India. “Alia’s innate instinct for stories that are emotionally rich, deeply relatable, and immensely entertaining shines through in this young adult story about friendship, love, and growing up.”\n\n\n\tMadhok highlighted the project’s female-forward narrative, describing the writing as fresh, relatable and humorous with earnest characters. The film features an original score by composer Ram Sampath.\n\n\t“At Eternal Sunshine, we’ve always wanted to back stories that feel honest and voices that feel their own,” said Alia Bhatt, co-founder of Eternal Sunshine Productions. “This film immediately spoke to us because of its sincerity and coming-of-age lens and Sreeti’s passion and energy naturally fed into the spirit of the story.”\n\t\n\n\tBhatt described the project as particularly meaningful for both herself and Eternal Sunshine Productions, praising Prime Video as a partner that consistently takes bold creative calls and supports distinctive storytelling.\n\n\tEternal Sunshine Productions was founded in 2021 by Bhatt, one of India’s most prominent actors, and her sister Shaheen Bhatt, author of the bestselling mental health memoir “I’ve Never Been (Un)Happier.” The production house’s debut feature, “Darlings,” co-produced with Red Chillies, premiered on Netflix in 2022 and marked director Jasmeet K. Reen’s first film. The company subsequently produced the Prime Video series “Poacher,” directed by Emmy winner Richie Mehta, and “Jigra,” an action-adventure helmed by Vasan Bala and co-produced with Dharma Productions.\n\n\tPrime Video’s Indian original content includes series “Paatal Lok,” “Mirzapur,” “The Family Man,” “Panchayat,” “Made in Heaven” and “Citadel: Honey Bunny,” along with original films such as “Shershaah,” “Sardar Udham” and “Maja Ma.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Alia Bhatt’s Eternal Sunshine Productions Teams With Prime Video on Coming-of-Age Rom-Com ‘Don’t Be Shy’ (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Alia-Bhatt-Nikhil-Madhok.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-30T04:27:00.000Z",
      "dateModified": "2026-01-30T04:27:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "American Cinematheque, Vidiots Among Theaters Offering Free Admission During Nationwide Shutdown on Friday",
    "url": "https://variety.com/2026/film/news/american-cinematheque-vidiots-free-nationwide-shutdown-1236645414/",
    "image": "https://variety.com/wp-content/uploads/2023/04/Vidiots1.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-30T04:53:18.000Z",
    "description": "\n\tIn the wake of the ICE shooting of Alex Pretti in Minneapolis on Jan. 24, non-profit organizations and small businesses across the country are parti",
    "body": "\n\tIn the wake of the ICE shooting of Alex Pretti in Minneapolis on Jan. 24, non-profit organizations and small businesses across the country are participating in a nationwide shutdown and general strike to show solidarity with the people of Minnesota and activism against ICE. In Los Angeles, many restaurants and shops are shutting down entirely, others are staying open to foster community and continue paying their employees, some while making donations to social justice organizations. \n\t\n\n\tVidiots in the Los Angeles neighborhood of Eagle Rock announced it would make all screenings free of charge on Friday. “What’s Love Got to Do With It” and “UHF” are among films showing in the evening.\n\n\n\n\tThe American Cinematheque will offer free admission to “Something Wild” at the Aero in Santa Monica and “Horse Feathers” and “The Killing of a Chinese Bookie” at the Los Feliz 3. Free popcorn and soda will be included at the Aero.\n\n\tBraindead Studios and the Museum of Neon Art are among other cultural shutdowns on Friday. \n\n\tAmong the organizations supporting the effort are IATSE Local 800 (Art Director’s Guild) and the WGA West, which will have a presence at the National Day of Action rally at L.A. City Hall at 1 p.m. Friday. \n\n\tRestaurants closing down for the day include Joan’s on Third, Wilde’s, Bar Siesta, Canyon Coffee, Courage Bagels, Tomat, Bacetti Trattoria and Proof Bakery.\n\n\tRestaurants and other shops that will be open for business but supporting the shutdown through donations to CHIRLA and other efforts include Kismet, Maru Coffee, Homestate, Bub and Grandma’s, Belle’s Bagels, Donna’s, Little Dom’s, Bar Sinizki and Valerie Confections. \n\t\n\n\tSee more information on local businesses and organizations supporting the shutdown at LATaco.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "American Cinematheque, Vidiots Among Theaters Offering Free Admission During Nationwide Shutdown on Friday",
      "image": [
        "https://variety.com/wp-content/uploads/2023/04/Vidiots1.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-30T04:53:18.000Z",
      "dateModified": "2026-01-30T04:53:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Only Two Original Song Nominees to Perform Live at Oscars, Academy Producers Tell Nominees (EXCLUSIVE)",
    "url": "https://variety.com/2026/film/news/oscars-performing-two-songs-kpop-sinners-1236645430/",
    "image": "https://variety.com/wp-content/uploads/2024/12/Kpop-Demon-Hunters.jpg?w=900&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-30T07:05:38.000Z",
    "description": "\n\tThe Oscars only have time for two songs.\n\n\tThe Academy of Motion Picture Arts and Sciences has confirmed that only two of this year’s best original ",
    "body": "\n\tThe Oscars only have time for two songs.\n\n\tThe Academy of Motion Picture Arts and Sciences has confirmed that only two of this year’s best original song nominees will be performed live during the 98th Academy Awards on March 15, citing time constraints and broader structural changes to the telecast.\n\n\tIn a letter sent to all music nominees and obtained exclusively by Variety, the Academy emphasized that the best original song category will remain fully integrated into the broadcast, even as live performances are limited to “Golden” from the animated musical “KPop Demon Hunters” and “I Lied to You” from the vampire drama “Sinners.”\n\t\n\n\tThe remaining nominees in the category will not have their honored songs performed live. Those include 17-time nominee Diane Warren’s “Dear Me” from her documentary “Diane Warren: Relentless,” Nick Cave and Bryce Dessner’s title song from “Train Dreams” and “Sweet Dreams of Joy” by Nicholas Pike from “Viva Verdi!”\n\n\n\tThe letter was signed by executive producers Raj Kapoor and Katy Mullan, along with producer Taryn Hurd. \n\n\tThe Academy declined to comment.\n\n\t“This year, the best original song nominees are being treated with the same care, storytelling focus and intention as the other awards categories — all of which will be included on the show,” the letter reads.\n\n\tAccording to the Academy, each nominated song will be introduced through a custom-produced segment built from footage of the film it was written for, with the goal of grounding each song in its cinematic context. Where appropriate, those packages may also incorporate behind-the-scenes material offering insight into the songwriting process and creative intent.\n\t\n\n\tThe producing team also noted that nominees will receive additional promotional support across its official social media platforms, pointing to recent Spotify collaborations and the nominations announcement as examples of that outreach.\n\n\tAccording to sources familiar with the planning, staging live performances for all five best original song nominees would add approximately 25 minutes to the telecast — a significant chunk of time for a show that is contractually set to run three hours and 30 minutes. With 24 competitive categories to present, including the newly added casting Oscar, mounting five full musical numbers would inevitably come at the expense of other major moments already planned for the broadcast. This kind of runtime constraint will be eased once the Oscars transition off broadcast television and on YouTube beginning in 2029.\n\n\t“Given the limited time within the broadcast, the addition of our casting Oscar and a desire to create a fast-paced, entertaining and cohesive show, the live performance focus will be concentrated on two musical moments this year, ‘Sinners’ and ‘KPop Demon Hunters,'” the letter states.\n\n\tThe performances will be framed as segments designed to honor how music helped those stories resonate worldwide. The remaining nominees will be recognized through the bespoke film-based packages rather than live musical numbers.\n\n\tThe letter closes by underscoring the Academy’s intent to honor all nominees on the broadcast. “Your work is an integral part of our cinematic ecosystem, and we so look forward to honoring it on the show.”\n\n\n\n\t\n\n\t\t\t\t\tSinners\n\t\t\t\t\t\t\t\t\tWarner Bros.\n\t\n\n\n\n\tThe 98th Academy Awards will air live March 15 and will be hosted by Conan O’Brien.\n\n\tA copy of the letter is below.\n\n\tThis year, the Best Original Song nominees are being treated with the same care, storytelling focus and intention as the other awards categories — all of which will be included on the show.\n\n\tEach nominated song will be introduced through a bespoke package built from footage of the film it was written for, grounding the song firmly in its cinematic purpose. Where appropriate, these packages may also include select behind-the-scenes elements that offer insight into the songwriting process and creative intent.\n\n\tWe will be in touch with you soon to discuss how we would like to work with you on this. In addition, we will be promoting your nomination on our social channels — as we recently did with our Spotify post and our nominations announcement.The show will also feature musical moments that celebrate two films whose songs played a defining role in their global cultural impact and audience connection this year. Given the limited time within the broadcast, the addition of our Casting Oscar, and a desire to create a fast-paced, entertaining and cohesive show, the live performance focus will be concentrated on two musical moments this year, Sinners and KPop Demon Hunters, with segments designed to honor how music helped these stories resonate worldwide.\n\t\n\n\tYour work is an integral part of our cinematic ecosystem, and we look forward to honoring it on the show. This year’s Oscars is going to be incredible, and we are thrilled that you are a key part of it. These are complex decisions, so please feel free to call with any questions.\n\n\tBest regards,\n\n\tRaj Kapoor Executive Producer\n\n\tKaty Mullan Executive Producer\n\n\tTaryn Hurd Producer\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Only Two Original Song Nominees to Perform Live at Oscars, Academy Producers Tell Nominees (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2024/12/Kpop-Demon-Hunters.jpg?w=900&h=563&crop=1"
      ],
      "datePublished": "2026-01-30T07:05:38.000Z",
      "dateModified": "2026-01-30T07:05:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Grammy Winner Kool Moe Dee 'Memba Him?!",
    "url": "https://www.tmz.com/2026/01/30/kool-moe-dee-memba-him/",
    "image": "https://imagez.tmz.com/image/39/16by9/2026/01/15/39b074954eea43f7be5c16364d66cbf0_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-30T08:45:06.000Z",
    "description": "\n    \n                    \n                          Grammy Winner\n                          Kool Moe Dee\n                          'Memba Him?!\n     ",
    "body": "\n    \n                    \n                          Grammy Winner\n                          Kool Moe Dee\n                          'Memba Him?!\n                      \n                  \n                                                                        Published \n                              January 30, 2026\n                            12:45 AM PST\n                                                                            \n      \n    \n          American rapper and songwriter Kool Moe Dee (real name Mohandas Dewese) shot to fame in the '80s with hip-hop hits like \"I Go To Work,\" \"Wild Wild West,\" and \"How Ya Like Me Now\" -- even scoring a Grammy win in 1991.\n      \n    \n          Guess what he looks like now!\n      \n    \n          It's Grammys weekend indeed -- test your Grammys trivia:\n      \n      \n      \n          \n            \n              \n                \n                Share on Facebook\n              \n            \n            \n              \n                \n                Share on X\n              \n            \n                          \n                \n                  \n                \n              \n                      \n        \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Hip Hop\n              \n                          \n                Photo Galleries\n              \n                          \n                Grammy Awards\n              \n                          \n                Music\n              \n                      \n        \n          \n  ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Grammy Winner Kool Moe Dee 'Memba Him?!",
      "image": [
        "https://imagez.tmz.com/image/39/16by9/2026/01/15/39b074954eea43f7be5c16364d66cbf0_xl.jpg"
      ],
      "datePublished": "2026-01-30T08:45:06.000Z",
      "dateModified": "2026-01-30T08:45:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Man With Pizza Cutter Allegedly Tries to Break Luigi Mangione Out Of Jail",
    "url": "https://www.tmz.com/2026/01/29/police-arrest-man-try-break-luigi-mangione-out-jail/",
    "image": "https://imagez.tmz.com/image/37/16by9/2026/01/29/3715a593bf524e04839249beb1f73302_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-29T21:37:52.000Z",
    "description": "\n    \n                    \n                          Luigi Mangione\n                          Feds Arrest Fan For Trying To Free Luigi!!!\n            ",
    "body": "\n    \n                    \n                          Luigi Mangione\n                          Feds Arrest Fan For Trying To Free Luigi!!!\n                      \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Luigi Mangione has a ton of fans rooting for his release ... and at least one of them who allegedly tried to take matters into his own hands by busting him out!\n      \n    \n          Mark Anderson -- a 35-year-old Minnesota man -- was arrested at MDC Brooklyn in New York, the notorious prison that houses Mangione and other high-profile inmates such as former Venezuelan dictator Nicolas Maduro, late Wednesday night.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          According to a criminal complaint -- cited by NBC News -- Anderson was arrested after prison workers asked for his credentials ... and he only handed over an MN driver's license.\n      \n\n          Anderson allegedly claimed he was an FBI agent and was \"in possession of paperwork 'signed by a judge' authorizing the release of a specific inmate.\" We've confirmed Luigi is that specific inmate.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          The Federal Bureau of Prisons found a barbecue fork and an object that resembled a pizza cutter in his backpack. Anderson reportedly went to New York City for a job that fell through and was working at a pizzeria. On Thursday, Anderson was charged with impersonating an FBI agent.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Mangione's still sitting in prison awaiting both his federal and state trials for allegedly killing UnitedHealthcare CEO Brian Thompson in December of 2024 ... and we think it'll take a lot more than a fork and knife to get him out!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Luigi Mangione\n              \n                          \n                Nicolás Maduro\n              \n                          \n                Crime & Arrests\n              \n                          \n                Arrest\n              \n                          \n                Fairly Legal\n              \n                          \n                Shootings\n              \n                          \n                News\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Man With Pizza Cutter Allegedly Tries to Break Luigi Mangione Out Of Jail",
      "image": [
        "https://imagez.tmz.com/image/37/16by9/2026/01/29/3715a593bf524e04839249beb1f73302_xl.jpg"
      ],
      "datePublished": "2026-01-29T21:37:52.000Z",
      "dateModified": "2026-01-29T21:37:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Heidi Klum Shirtless Under Fur Coat Teasing New Song With Diplo",
    "url": "https://www.tmz.com/2026/01/29/heidi-klum-shirtless-fur-coat-diplo/",
    "image": "https://imagez.tmz.com/image/2e/16by9/2026/01/29/2e2c11386c3a471a9d0414bc8a68f77f_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-29T22:31:41.000Z",
    "description": "\n    \n                    \n                          Heidi Klum\n                          Bare Hugging My Fur Coat!!!\n                      \n      \n  ",
    "body": "\n    \n                    \n                          Heidi Klum\n                          Bare Hugging My Fur Coat!!!\n                      \n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Heidi Klum never met a top she didn't want to immediately take off ... and she's using her love for the nude to push a new musical venture.\n      \n    \n          The supermodel is promoting her new song with Diplo by, you guessed it, going topless ... which is her signature move.\n      \n    \n        Waiting for your permission to load the Instagram Media.\n      \n    \n          In a social media post teasing the upcoming track, Heidi is letting the girls breathe under a white furry coat ... and she's wearing some sexy lingerie bottoms, along with some knee-high boots.\n      \n\n          The song is called \"Red Eye\" but Heidi isn't on a plane here ... instead, she's got boots on the ground ... in the middle of some train tracks. Makes sense.\n      \n    \n      \n        \n              \n    \n    \n          Heidi says the new song is for the 21st season of \"Germany's Next Topmodel\" ... and it's available to stream February 13 ... the day before Valentine's Day.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Diplo\n              \n                          \n                Heidi Klum\n              \n                          \n                Social Media\n              \n                          \n                Hot Bodies\n              \n                          \n                Fashion\n              \n                          \n                Models\n              \n                          \n                Music\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Heidi Klum Shirtless Under Fur Coat Teasing New Song With Diplo",
      "image": [
        "https://imagez.tmz.com/image/2e/16by9/2026/01/29/2e2c11386c3a471a9d0414bc8a68f77f_xl.jpg"
      ],
      "datePublished": "2026-01-29T22:31:41.000Z",
      "dateModified": "2026-01-29T22:31:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Grammys -- Beyoncé, Kendrick Win Big In 2025 But Who Could Take It in 2026?!",
    "url": "https://www.tmz.com/2026/01/30/grammys-flashbacks-and-predictions/",
    "image": "https://imagez.tmz.com/image/82/16by9/2026/01/26/826c843309004fbfa226921b85ed3731_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-30T08:01:45.000Z",
    "description": "\n    \n                    \n                          2025 Grammy's Flashback: Kendrick,\n                          Beyoncé Win Big ...\n                ",
    "body": "\n    \n                    \n                          2025 Grammy's Flashback: Kendrick,\n                          Beyoncé Win Big ...\n                          & Cast Your Votes For 2026!\n                      \n                  \n                                                                        Published \n                              January 30, 2026\n                            12:01 AM PST\n                                                                            \n      \n    \n          Heading into Grammys weekend never felt better, and we're asking you straight up, \"who should win?!\"\n      \n    \n          As a refresher, last year's Grammys came in HOT -- with Beyoncé's \"Cowboy Carter\" ruling Album of the Year, Best Country Album and Best Country Duo/Group Performance ... and Kendrick Lamar swept the 2025 Grammys with five wins for \"Not Like Us,\" including Record and Song of the Year.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          This year, Kendrick is back at it with 9 nominations for \"GNX\" ... Lady Gaga's \"MAYHEM\" is up for 7 noms, and Sabrina Carpenter's \"Man’s Best Friend\" is also favored for a Grammy or two.\n      \n    \n          Make sure you're refreshing your TMZ feeds all weekend long ... We've got you covered on music's hottest stars ... \"They Not Like Us!\"\n      \n    \n          Hit the gallery and cast your votes! ...\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Kendrick Lamar\n              \n                          \n                Lady Gaga\n              \n                          \n                Beyonce Knowles\n              \n                          \n                Sabrina Carpenter\n              \n                          \n                Who'd You Rather?\n              \n                          \n                Photo Galleries\n              \n                          \n                Grammy Awards\n              \n                          \n                Award Shows\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Grammys -- Beyoncé, Kendrick Win Big In 2025 But Who Could Take It in 2026?!",
      "image": [
        "https://imagez.tmz.com/image/82/16by9/2026/01/26/826c843309004fbfa226921b85ed3731_xl.jpg"
      ],
      "datePublished": "2026-01-30T08:01:45.000Z",
      "dateModified": "2026-01-30T08:01:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sexy Ab Cracks -- Can You Guess The Fit Physique?!",
    "url": "https://www.tmz.com/2026/01/29/sexy-ab-cracks-guess-who/",
    "image": "https://imagez.tmz.com/image/54/16by9/2026/01/28/54462c4a446a44da9260bcce8f2719c8_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-29T23:19:29.000Z",
    "description": "\n    \n                    \n                          Sexy Ab Cracks\n                          Guess The Fit Physique ...\n                          Alo",
    "body": "\n    \n                    \n                          Sexy Ab Cracks\n                          Guess The Fit Physique ...\n                          Alo-Ha 💦!\n                      \n      \n    \n          Can you guess which famous model put her toned tummy on full display in this eye-popping shot?!\n      \n    \n          Here she is rockin' some ALO athleisure -- which definitely has us sayin, \"ALO-ha!\" When she's not on the catwalk, catch her hangin' with her famous rents in Beverly Hills!\n      \n    \n          Strut into the gallery for the big reveal, and then put your Beverly Hills skills to the test in this trivia quiz ...\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Hotties & Bodies\n              \n                          \n                Hot Bodies\n              \n                          \n                Guess Who\n              \n                          \n                Photo Galleries\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sexy Ab Cracks -- Can You Guess The Fit Physique?!",
      "image": [
        "https://imagez.tmz.com/image/54/16by9/2026/01/28/54462c4a446a44da9260bcce8f2719c8_xl.jpg"
      ],
      "datePublished": "2026-01-29T23:19:29.000Z",
      "dateModified": "2026-01-29T23:19:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]