[
  {
    "title": "MLS Cup Final 2025: How To Watch Final Match Online Free, Livestream",
    "url": "https://variety.com/2025/shopping/news/how-to-watch-mls-cup-final-online-livestream-free-1236236846/",
    "image": "https://variety.com/wp-content/uploads/2024/12/MLS-Inter-Miami-vs.-Vancouver-Whitecaps-Getty-VR-Featured.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-06T14:40:06.000Z",
    "description": "\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.\n\n\tAfter a m",
    "body": "\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.\n\n\tAfter a month-and-a-half long MLS Cup Playoffs, the post-season tournament is coming to a close with the MLS Cup Final. Two of the best teams in Major League Soccer go for victory to hoist the MLS Cup trophy at the end of the season.\n\n\tOn Saturday, Dec. 6, Inter Miami CF vs. Vancouver Whitecaps FC at Chase Stadium in Fort Lauderdale, Florida. Here’s how to find a live stream to watch the MLS Cup Final.\n\n\t\n\t\tWhen Is the 2025 MLS Cup Final?\t\n\n\tThe MLS Cup Final: Inter Miami vs. Vancouver Whitecaps happens on Saturday, Dec. 6, with kickoff at 2:30 p.m. ET/11:30 a.m. PT.\n\n\n\tTickets to matches are still available on TicketNetwork, VividSeats.com and StubHub. In fact, you can save $150 off when you spend $500 with promo code VARIETY150, or $300 off when you spend $1,000 with promo code VARIETY300 at TicketNetwork.com.\n\n\tAdditionally, you can use Variety’s exclusive promo code VAR30 for $20 off at Vivid Seats.\n\n\tRight now, you can livestream the MLS Cup Final online with Apple TV for free. \n\n\tFor the 2025 MLS season, you can sign up for MLS Season Pass included with a subscription to Apple TV, which starts at $9.99/month. The service is an add-on for MLS matches, which goes for $79/season for Apple TV subscribers, or $99/season for non-subscribers. Learn more about MLS Season Pass here.\n\n\tMeanwhile, you can sign up for a seven-day free trial to watch hit Apple TV originals, including “Pluribus,” “Presumed Innocent,” “Time Bandits” “Messi Meets America,” “The New Look,” “The Morning Show,” “Ted Lasso,” “For All Mankind,” “Severance,” “Long Way Home” and much more. Afterwards, you can either cancel, or keep watching for the monthly subscription price.\n\n\n\tWant to just stream the MLS Cup Final? You can watch the championship match for free, but next season, you can sign up starting at just $12.99/mo. and use it to watch matches live. You can continue on with your MLS Season Pass subscription or cancel anytime.\n\n\tOn Saturday, Dec. 6 with a start time of 2:30 p.m. ET/11:30 a.m. PT, the MLS Cup Final 2025: Inter Miami vs. Vancouver Whitecaps is available to stream on Apple TV for free. Learn more about the MLS Cup Final here.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "MLS Cup Final 2025: How To Watch Final Match Online Free, Livestream",
      "image": [
        "https://variety.com/wp-content/uploads/2024/12/MLS-Inter-Miami-vs.-Vancouver-Whitecaps-Getty-VR-Featured.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-06T14:40:06.000Z",
      "dateModified": "2025-12-06T14:40:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Red Sea Film Festival: Juliette Binoche Says She Swapped Numbers With Jury Head Sean Baker and Shouted ‘I Want to Work With You!’",
    "url": "https://variety.com/2025/film/global/red-sea-film-festival-juliette-binoche-sean-baker-1236601983/",
    "image": "https://variety.com/wp-content/uploads/2025/12/GettyImages-2250309617.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-06T12:59:22.000Z",
    "description": "\n\tAt the opening night of the Red Sea Film Festival in Jeddah on Thursday, Juliette Binoche was among the top honorees. But alongside being presented ",
    "body": "\n\tAt the opening night of the Red Sea Film Festival in Jeddah on Thursday, Juliette Binoche was among the top honorees. But alongside being presented with an award from the festival for her contributions to cinema, the French screen icon also received an unexpected tribute from jury head Sean Baker. \n\n\tWhile speaking on stage during the ceremony, the filmmaker behind last year’s multi-award winning hit “Anora” revealed that he wasn’t simply a huge fan of Binoche’s work, but he also had a framed poster of her 1991 romantic drama “Lovers on the Bridge” hanging on his wall. \n\t\n\n\tThankfully, both Oscar-winning actress and Oscar-winning director have managed to connect at the Saudi Arabian festival since then, with Binoche revealing that they had “exchanged numbers.” \n\n\n\tSpeaking at the Variety Lounge presented by Red Sea Film Festival on Saturday, Binoche also said that she’d even pitched to be in one of his films.\n\n\t“I shouted at him: I want to work with you!” \n\n\tBaker, she said, told her that he planned to move away from his previous style of filmmaking and “wants to do action movies.”\n\n\tWhile Baker may have won the Palme d’Or for “Anora” in 2024, the decision for this year’s top Cannes prize actually fell largely on Binoche’s shoulders, with her serving as jury head. Several of the films in the official selection — including “Sirat” and “The Mastermind” — are screening in Jeddah, something she noted with pride. \n\n\t“We were really happy as a jury to find those films,” she said. “We had a good year!”\n\n\tThe overall winner in Cannes was, of course, Jafar Panahi’s “It Was Just an Accident,” a film that is now representing France at the next Academy Awards. It’s also a film that has seen Panahi recently sentenced in absentia to one year in prison by the Islamic Revolutionary Court over charges of “propaganda activities” against the Iranian system.\n\t\n\n\tBinoche acknowledged the latest actions against Panahi, but also recalled the 2010 Cannes Film Festival,  where the Iranian filmmaker was set to serve as a jury member but couldn’t attend as he was being imprisoned in Tehran. It was also a year where Binoche won the best actress Palme for “Certified Copy.”\n\n\t“They put his name on an empty chair to make the absence of his presence seen, and when I got my prize for best actress, I grabbed his name and put it in front of the camera and talked about Jafar,” she said. “And they liberated him three days days after. So I think the combination of having Cannes put him in the jury and, probably, I participated in a way. So giving him the prize 15 years after was so meaningful.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Red Sea Film Festival: Juliette Binoche Says She Swapped Numbers With Jury Head Sean Baker and Shouted ‘I Want to Work With You!’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/GettyImages-2250309617.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-06T12:59:22.000Z",
      "dateModified": "2025-12-06T12:59:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sydney Sweeney Says ‘I’m Against Hate’ and Reconsiders Staying Quiet on American Eagle Jeans Controversy: ‘My Silence Has Only Widened the Divide’",
    "url": "https://variety.com/2025/tv/news/sydney-sweeney-against-hate-american-eagle-backlash-1236602028/",
    "image": "https://variety.com/wp-content/uploads/2025/12/P103DZNU.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-06T14:47:47.000Z",
    "description": "\n\tSydney Sweeney recently told People magazine that “I’m against hate” while looking back at the controversy that erupted over her American Eagle jean",
    "body": "\n\tSydney Sweeney recently told People magazine that “I’m against hate” while looking back at the controversy that erupted over her American Eagle jeans ad earlier this year. The campaign was centered on the tagline “Sydney Sweeney Has Great Jeans.” The pun around “great genes” ignited outrage online, with many on social media alleging the company was glorifying the actor’s white heritage and thin physique. Some even compared the ads to “Nazi propaganda.”\n\t\n\n\t“I was honestly surprised by the reaction,” Sweeney told People. “I did it because I love the jeans and love the brand. I don’t support the views some people chose to connect to the campaign. Many have assigned motives and labels to me that just aren’t true.”\n\n\n\t“Anyone who knows me knows that I’m always trying to bring people together. I’m against hate and divisiveness,” Sweeney added. “In the past my stance has been to never respond to negative or positive press but recently I have come to realize that my silence regarding this issue has only widened the divide, not closed it. So I hope this new year brings more focus on what connects us instead of what divides us.”\n\n\tSweeney stayed silent on the controversy for months before talking about it for the first time in an interview with GQ magazine last month. The Emmy nominee said she was never tempted to put together a formal statement explaining or defending the ads during the height of backlash because “I’ve always believed that I’m not here to tell people what to think.”\n\n\t“I know who I am. I know what I value. I know that I’m a kind person,” Sweeney said. “I know that I love a lot, and I know that I’m just excited to see what happens next. And so I don’t really let other people define who I am… I knew at the end of the day what that ad was for, and it was great jeans, it didn’t affect me one way or the other.”\n\t\n\n\tAs the controversy became national headlines, White House communications manager Steven Cheung weighed in by calling the backlash a prime example of “cancel culture run amok.” Vice President JD Vance then mocked liberals for creating a hysteria around campaign. The controversy worked itself all the way up to Donald Trump, who got asked about the ads amid reports that Sweeney was also a registered Republican and responded: “She’s a registered Republican? Oh, now I love her ad! You’d be surprised at how many people are Republicans… If Sydney Sweeney is a registered Republican, I think her ad is fantastic!”\n\n\tSweeney told GQ magazine that “it was surreal” to have Trump and Vance weighing in on the ads, but she did not pay attention to the controversy at large.\n\n\t“I kind of just put my phone away,” the actor said. “I was filming every day. I’m filming ‘Euphoria,’ so I’m working 16-hour days and I don’t really bring my phone on set, so I work and then I go home and I go to sleep. So I didn’t really see a lot of it.”\n\n\tSweeney next stars in “The Housemaid,” in theaters Dec. 19. Head over to People magazine’s website to read her latest interview in its entirety. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sydney Sweeney Says ‘I’m Against Hate’ and Reconsiders Staying Quiet on American Eagle Jeans Controversy: ‘My Silence Has Only Widened the Divide’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/P103DZNU.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-06T14:47:47.000Z",
      "dateModified": "2025-12-06T14:47:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Julia Roberts and Sean Penn Bond Over Paul Thomas Anderson, Luca Guadagnino and ‘Cancel Culture’: ‘Shame Is Underrated These Days’",
    "url": "https://variety.com/2025/film/news/julia-roberts-sean-penn-cancel-culture-one-battle-after-another-1236598845/",
    "image": "https://variety.com/wp-content/uploads/2025/12/Julia-Roberts-and-Sean-Penn-Variety-CNN-Actors-on-Actors.jpg?crop=127px%2C228px%2C1041px%2C585px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-12-06T14:00:00.000Z",
    "description": "\n\tThis year, Julia Roberts and Sean Penn both deliver star turns as complicated, volatile characters amid volatile political environments. In Luca Gua",
    "body": "\n\tThis year, Julia Roberts and Sean Penn both deliver star turns as complicated, volatile characters amid volatile political environments. In Luca Guadagnino’s “After the Hunt,” Roberts plays Alma Imhoff, a Yale professor of philosophy who is forced to confront her own flaws and biases when a student accuses her colleague of assault. And in Paul Thomas Anderson’s “One Battle After Another,” Penn’s Col. Steven J. Lockjaw plunges the lives of a father and daughter into chaos as he undertakes a mission of revenge against political dissidents. The actors, longtime friends and neighbors, debrief about their work and careers before heading to dinner, where the conversation surely continues.\n\t\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tAlexi Lubomirski for Variety\n\t\n\n\n\n\tJulia Roberts: How many years do you think we’ve known each other? I think I know the answer.\n\n\n\tSean Penn: I’m thinking back to New York — the Mayflower Hotel during the shooting of “The Pope of Greenwich Village.”\n\n\tRoberts: So this is over 40 years.\n\n\tPenn: You were Eric’s little sister.\n\n\tRoberts: Yes. I still am.\n\n\tPenn: I’d heard about you. But you must’ve been a teenager.\n\n\tRoberts: Sixteen, I think.\n\n\tPenn: So it’s been a while.\n\n\tRoberts: Here we are.\n\n\tPenn: Neighbors, buds.\n\n\tRoberts: All right. We do have to check a few boxes, and I am legitimately curious to know a few things about “One Battle After Another.”\n\n\tPenn: OK, let’s get that stuff over with.\n\n\tRoberts: Let’s not get it over with! Let’s get it started! I have never met Paul Thomas Anderson. How did you meet him? This is your second movie with him.\n\t\n\n\tPenn: It’s funny because my brother Michael scored his first two movies. So I knew he was working on this movie “Hard Eight.” I had just directed a movie, and Michael thought I might have some advice for Paul. I don’t think I offered advice except a go-to quote I had at the time, which was “Always consider the possibility that everyone else is wrong.”\n\n\tI’ve known him since then — he was working on “There Will Be Blood” and I was on “Into the Wild,” both at Skywalker Ranch. So we started spending time up there together and became friends, and talked about working together a time or two. This last couple of them jelled.\n\n\tRoberts: What kind of environment does he create for actors on a set? Is it happy and jovial, or is it quiet?\n\n\tPenn: There’s nothing at all performative about him as a director. There’s no letting everyone know who’s the director, or the boss, or any of that. In fact, he doesn’t want that from anybody. There’s no big trailers. Leo and I shared a double banger. And there’s nobody to say, “Hey, could you grab me a coffee?” You get your own coffee. Everything was focused on the movie.\n\n\tRoberts: Does he do a lot of takes?\n\n\tPenn: Sometimes we did. He’s constantly exploring, and he has a great confidence in his writing. At the same time, when there would be a change, it would be him thinking, “We don’t need this.” He was throwing away gems every day.\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tAlexi Lubomirski for Variety\n\t\n\n\n\n\tRoberts: Wow. Knowing you — and, more interestingly, my children knowing you — so well, and seeing this movie and being so knocked out … Where did you start building the character?\n\n\tPenn: My experience of it was all in the script. I didn’t struggle on this one at all. It was so clear to me. I had such a great experience reading that script that I didn’t want to get in the audience’s way.\n\n\tRoberts: You’ve been a director for a long time now. When you’re acting in something that you’re not directing, is it hard to put director thoughts away?\n\n\tPenn: Not when you’re with a real director. I never questioned where the camera was. I knew I was in great hands the whole time.\n\n\tLet’s transition to “After the Hunt.” I have a lot of thoughts about this movie. I love the subject. I struggle to watch it because I get angry, and I have positions on different characters. I’ve been admiring [Luca Guadagnino’s] other films — what was the experience like?\n\t\n\n\tRoberts: I, too, have admired him, and I am so intrigued by all his movies, and they’re all so different. You just kind of think: Who is this guy? When this movie came to me and I was reading it and pondering things, and I get the call: Maybe Luca Guadagnino is interested in this. And every cell inside of me perked up, because I thought, I want to know. That’s a movie I am interested in seeing, his interpretation of this.\n\n\tI can speak for my castmates: We had such a joyful experience. I remember Luca saying to me one day, “This is the first time I’ve ever been happy on a set.” I said, “I find that impossible to believe,” because he’s so joyful. He has so much happiness. And my experience with him was complete. I’ve probably talked to him every week since this movie finished. I can’t say that about any director — and I am friends with directors that I’ve worked with more than once. The only person I ever had a really continuous conversation with was Mike Nichols.\n\n\tPenn: It’s interesting — the subject being what it is, there had to have been philosophical debates, generational and gender differences. And yet that played out with a joyous set.\n\n\tRoberts: Luca and Andrew [Garfield] and Ayo [Edebiri] and Chloë [Sevigny] came to our house and sat for days and days at our kitchen table, and we had all these conversations. Really bright people do not jockey for their position. They share their ideas and their feelings and then they listen intently. It’s the listening that I feel we’ve gotten the farthest from in culture, because conversations get so intense so quickly, and you’re just waiting for that break so that you can say, “OK, but this is why I’m right. This is why what I believe is better.”\n\n\tIt was so nice to have the time and to be with truly bright people, and hearing what everybody had to say. We didn’t necessarily tell all our characters’ secrets. But it was just a great playground of thought.\n\n\tPenn: “Not everything is supposed to make you comfortable” — I just wanted to go, “Thank God somebody’s saying this.” We’re in this time of a lot of talk therapy, a lot of what I’d call the trauma industry. I think shame is underrated these days. It’s got a bad name this decade. Why shouldn’t people be ashamed of things? Hold on to it for a while and reenter with some more humility.\n\t\n\n\tRoberts: Real humility.\n\n\tPenn: It is a provocative movie, and I know that it got some provocative reactions. I thought it was so refreshing, especially for this auteur filmmaker. When you met him, did you suggest that you would be interested in working together at some point?\n\n\tRoberts: So when we first had a conversation about doing “After the Hunt” together, we were both going to be in Los Angeles. We were trying to see each other, and it wasn’t working out. As fate would have it, we ended up at the same party. When I got off work, Danny [Moder] and I went to a party, and he came to the same party, and we hugged and sat down and spent the next hour and a half talking with our faces practically pressed together, with this bustling party going on around us. It’s the fastest I have ever boarded a train that left the station without a destination.\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tAlexi Lubomirski for Variety\n\t\n\n\n\n\tPenn: With Paul’s movie, by the time he sent me the script he already had Leo [DiCaprio] on board. Leo, I’d wanted to work with him — I’d known him since he was 15, and we’d almost done several movies together over the years. I think I was on page 15, and I just called him and said …\n\n\tRoberts: “Let’s go.”\n\n\tPenn: “Wherever this goes, I’m in.” It was killing me.\n\n\tRoberts: Isn’t it nice to feel that way? It’s so rare. I would imagine every script has your fingerprints on it.\n\n\tPenn: The scripts that do have my fingerprints, I either [wrote] them, or you won’t find fingerprints after page 10.\n\n\tRoberts: Really?\n\n\tPenn: If I sense artifice or it hits a pet peeve — which happens more often than not — then I don’t keep reading.\n\n\tRoberts: I have to finish.\n\n\tPenn: Well, you’re more diligent than I am.\n\n\tRoberts: I’m not. I just think something might happen. You don’t have to say — of course you wouldn’t say — but has there ever been a movie you passed on that then you saw it and thought, “Maybe I made a mistake”?\n\n\tPenn: I don’t think so. I don’t think I’ve ever regretted, no. I would have to have had the experience of making it and having it be miserable before I could regret it that way.\n\n\tRoberts: I love the way your brain works. I just love your train of thought.\n\n\tPenn: I have regretted doing movies, but I’ve never regretted not doing them. And, with any luck, I’m better at those selections now than in the past.\n\t\n\n\tRoberts: Do you have any idea how many movies you’ve been in?\n\n\tPenn: Do you?\n\n\tRoberts: I could ballpark it, because someone told me not that long ago, and I was so surprised. Based on when that was, I could probably ballpark it at a very surprising number.\n\n\tPenn: What would that number be?\n\n\tRoberts: Fifty-five, maybe.\n\n\tPenn: If we include where we did a small thing in something, everything, all-in, I think it’s about 100.\n\n\tRoberts: It’s a lot of fucking movies.\n\n\tPenn: Too many.\n\n\tRoberts: Not enough for me. It’s impressive. You’re impressive. You just have to take it — you have to accept this right now. You are impressive.\n\n\tPenn: I might be the last of a generation that doesn’t go to bed at 10 or put skin cream on before bed. And I know that’s a dermatology problem for some. But impressive is when somebody can handle their own poetic inspirations, as you do your gifts. [You have] the capacity not only as an actress, but in terms of sharing joy. There were two years when your calls saying, “What time should the cake be ready?” were the only things that reminded me it was my mother’s birthday. Raising these kids that are so extraordinarily well rounded, in a job that traditionally relies on people living in their own head — congratulations on that.\n\n\tRoberts: Well, let me just congratulate you on taking the conversation from being about you …\n\n\tPenn: … and going right back to a social experiment with people complimenting each other for money. We’re not getting paid. Are we getting paid?\n\n\tRoberts: I’m not getting paid.\n\n\tPenn: I think you’re phenomenal. My mom always used to light up when you would come around, and then you’ve got this great husband who’s my favorite cinematographer.\n\n\tRoberts: Mine too. I go, “Where do I share the most understanding? Where do I feel the most seen and understood and felt by Sean Penn?” It’s my love of Danny Moder.\n\n\tPenn: I remember him telling me you were doing a movie and Danny was handholding a camera. He’s focused on his work and getting in a corner, followed by the description: “That was the sexiest thing on earth.” And I thought, “OK …”\n\n\tRoberts: Back to when you met Paul! Oh my God, I’m all flummoxed now. I do have some questions for you, but now I’m afraid to ask them. Who is the first big-time-actor type that you met that just knocked your socks off?\n\t\n\n\tPenn: When I was in high school, the actor Anthony Zerbe came and did a career-day talk. I knew of him. He was an acclaimed figure in my household. My parents were fans of his work. He did movies, but he also did a lot of television in the ’70s. I knew his face very well; I knew my father had worked with him. I’d never thought about being an actor until my senior year of high school — and really only as a way into directing movies. I wanted to do that, but I saw acting as a way to stow away on the plane to get in there.\n\n\tRoberts: Do you remember the first movie that you saw that you just thought, “Yep …”\n\n\tPenn: It was probably “Lenny.” I knew it was the same director that had done “Cabaret” — Bob Fosse — and I got a real sense of what separates people like that.\n\n\tRoberts: How somebody could tell such complete stories? Wow. What a person to land on.\n\n\tPenn: But that predates me identifying that I wanted to work in film. So then probably it was “Badlands,” in terms of when I said, “I want to direct movies.”\n\n\tRoberts: And then you worked with Terrence Malick.\n\n\tPenn: It’s why I asked you about Luca. Because I’ve done that a couple of times over the years, where I’ve met a director that I admired a lot and said, “Give me a dollar and tell me where I’ve got to go.” And that was Terry Malick and Alejandro González Iñárritu. Oh, and Paolo Sorrentino. Three times.\n\n\tRoberts: I met Terrence Malick once, and I was so in awe and smitten, and we had the sweetest conversation. He seemed like somebody that you might have walked into a diner and sat down at a counter, and that was the man sitting next to you, and you had a conversation while he drank black coffee and you ate a cheeseburger. He’s so unassuming.\n\n\tPenn: I’ve made two movies with him. He’s such a kind person, and there’s genius in him, and a very strong, increasingly spiritual pursuit, which I didn’t always know how to track as it related to storytelling. What about [Steven] Soderbergh?\n\n\tRoberts: Steven Soderbergh. The way that he directs perfectly aligns with the way that I act. It’s really intentional, and there’s a momentum that is really meaningful to him. Once he has what he wants, then we go do something else. He has it all in his head to start with. Once he sees it, he goes, “That’s great. That’s what I wanted. I’m ready to go.”\n\t\n\n\tI’ve made four movies with Steven. I just think he’s the greatest. The last movie he hired me for [“2002’s Full Frontal”], he said, “Oh yeah, I’ve got this script. I’m going to send it to you.” And I go, “I’m in.” He goes, “No, I want you to read it first.” I go, “I’ll read it, but I know I’m going to do it.” And it was the craziest fucking thing I’ve ever read, but there I was, loving every minute of it.”\n\n\tPenn: We need more of those directors. Let’s go get ’em.\n\n\tRoberts: Goodbye, Sean. You’re the all time!\n\n\tPenn: Goodbye, Julia. I’ll see you at dinner in 10 minutes.\n\n\tThis is a conversation from Variety and CNN’s Actors on Actors. To watch the full video, go to CNN’s streaming platform now. Or check out Variety’s YouTube page at 3 p.m. ET today.\n\n\t\n\t\tProduction: Emily Ullrich; Agency: Nevermind Agency\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Julia Roberts and Sean Penn Bond Over Paul Thomas Anderson, Luca Guadagnino and ‘Cancel Culture’: ‘Shame Is Underrated These Days’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/Julia-Roberts-and-Sean-Penn-Variety-CNN-Actors-on-Actors.jpg?crop=127px%2C228px%2C1041px%2C585px&resize=1000%2C563"
      ],
      "datePublished": "2025-12-06T14:00:00.000Z",
      "dateModified": "2025-12-06T14:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Hitmakers Repeat Offenders: How Smash Singles From Sabrina Carpenter, Shaboozey and Benson Boone Came Together",
    "url": "https://variety.com/2025/music/news/hitmakers-repeat-offenders-sabrina-carpenter-shaboozey-1236601773/",
    "image": "https://variety.com/wp-content/uploads/2025/12/Benson-Boone-Sabrina-Carpenter-Shaboozey.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-06T16:00:00.000Z",
    "description": "\n\tSabrina Carpenter, Benson Boone, Shaboozey, Teddy Swims and Billie Eilish have one thing in common: they each had the same songs appear on Variety‘s",
    "body": "\n\tSabrina Carpenter, Benson Boone, Shaboozey, Teddy Swims and Billie Eilish have one thing in common: they each had the same songs appear on Variety‘s Hitmakers 2024 and 2025 lists. From “Espresso” to “Beautiful Things,” these tracks maintained momentum far past their release dates to dominate the airwaves and playlists throughout this year. Variety takes a look back on the repeat offenders from 2024 and how those hits were assembled.\n\n\tTeddy Swims, “Lose Control” (No. 6)\n\t\n\n\tIn April, Teddy Swims made history when his single “Lose Control” broke the record for longest-running song in the Top 10 of the Billboard Hot 100; it bested the Weeknd’s 57-week stronghold with “Blinding Lights.”\n\n\n\tBut it didn’t stop there. In July, the ballad became the first song in the history of the Hot 100 to secure 100 weeks on the chart. “‘Lose Control’ is the first time I really hit the mark,” Swims says about crafting the tune. “I used to think that it wasn’t enough to have a good song anymore. Now I disagree with that.”\n\n\t“Lose Control” has had a steady rise to the top since Swims came up with the song during a four-day writing camp in Palm Springs. Swims (aka Jaten Dimsdale) teamed with Julian Bunetta, Ammo, Infamous and Mikky Ekko to create a song he wanted “catchy enough for everyone to want to sing, but not everyone can.”\n\n\t“He’s singing from his chest,” Ekko says. “He had so much going on in his life that it really all came down to personal experience.”\n\n\tTheir session yielded what became the signature track off 2023’s “I’ve Tried Everything but Therapy (Part 1),” which Swims followed with a sequel at the top of this year. The success of “Lose Control” helped land Swims a nomination for best new artist at the Grammys in February, plus nominations at the American Music Awards and the Brit Awards.\n\t\n\n\t“‘Lose Control’ has given me a taste of what’s possible,” says Swims, “and now I’m so hungry for more. I want the whole pie.”\n\n\tSongwriters Julian Bunetta, Mikky Ekko, Marco “Infamous” Rodriguez, Teddy Swims Producers Ammo, Julian Bunetta (co-producer: Infamous)Label Swims Int./Warner RecordsHitmakers Ammo, songwriter; Julian Bunetta, songwriter and producer; Luke Conway, manager; Mikky Ekko, songwriter; Sean Stevens, VP, A&R, Warner Records\n\n\tShaboozey, “A Bar Song (Tipsy)” (No. 7)\n\n\tIf 2024 was the night when everybody at the club was getting tipsy, then this year saw the party raging into the entire next day. Shaboozey’s breakthrough hit “A Bar Song (Tipsy)” managed to continue its hot streak through 2025 after spending 19 weeks atop the Billboard Hot 100 and persisted as a streaming giant, surpassing 1.4 billion Spotify listens in the summer.\n\n\tFor the country star, it all began during a songwriting session with producers Nevin Sastry and Sean Cook. Shaboozey was interested in sampling an old hip-hop hit and landed on J-Kwon’s 2004 single “Tipsy.” “I wanted to revisit my formative years, when you’re learning who your favorite artists are,” he previously told Variety.\n\n\tAfter getting a stamp of approval from J-Kwon himself, Shaboozey debuted the tune at a showcase in January 2024, where he performed “A Bar Song (Tipsy)” for an audience that included one of Beyoncé’s A&Rs and led to two features on her Grammy-winning “Cowboy Carter.”\n\n\tThen marketing came into play. “We scheduled the song to come out two weeks after the Beyoncé album,” his co-manager Jared Cotter says. Not long after, “A Bar Song (Tipsy)” made chart history by reaching No. 1 at four radio formats and helped earn Shaboozey five Grammy nominations, including song of the year and best new artist.\n\n\tMore recently, Shaboozey expanded his chart presence with “Good News,” which became his second Top 10 after “A Bar Song (Tipsy)” on Billboard’s Country Airplay tally. “Hopefully, this sets me up for life and gives me that freedom to have fun in the studio,” he says. “But there’s still more hits on the way.”\n\n\tSongwriters Sean Cook, J-Kwon, Joe “Capo” Kent, Nevin Sastry, Shaboozey, Mark Williams Producers Sean Cook, Nevin SastryLabel American Dogwood/EmpireHitmakers Sean Cook, producer and songwriter; Jared Cotter, manager director, Range Media; Ghazi, CEO, Empire; Abas Pauti, manager, American Dogwood; Nevin Sastry, producer and songwriter\n\t\n\n\tBenson Boone, “Beautiful Things” (No. 10)\n\n\tSince releasing his smash “Beautiful Things” in January 2024, Benson Boone has kept the backflips coming. In April, he shared the stage with Queen’s Brian May at Coachella. In June, he dropped his sophomore album, “American Heart.” And a few months later, he embarked on a sold-out headlining arena tour.\n\n\tBut Boone can’t handspring away from the continued success of “Beautiful Things.” “I have so much trouble processing it all right now,” he says, “because I’m trying to stay on top of it and make this moment bigger than just ‘Beautiful Things.’ But when I look at what’s happening, it truly blows my mind.”\n\n\tAnd to think, the massive “Beautiful Things” can be traced back to a few sleepless nights at his then-new home in L.A. After toiling with the verse and chorus at his grandmother’s piano, Boone brought the two ideas into a session with his regular collaborators, Jack LaFrantz and Evan Blair, who helped sew them together. Once released, it caught fire on TikTok, where it has since been used in 4.5 million videos, and became a chart mainstay, logging 89 weeks on the Hot 100 and topping the Adult Contemporary chart.\n\n\tAll of this has become background noise for Boone, who launched several more hits —“Sorry I’m Here for Someone Else” and “Mystical Magical” — from “American Heart,” on top of the ongoing success of his biggest track yet. “I’ve been doing a better job at focusing on what I have to offer and doing my best on what I can do for this song,” he says, “and letting the rest be other people’s choice.”\n\n\tSongwriters Benson Boone, Evan Blair, Jack LaFrantzProducer Evan BlairLabel Night Street/Warner RecordsHitmakers Evan Blair, producer and songwriter; Jackson LaFrantz, songwriter; Jeff Burns,manager; Jon Chen, Warner Chappell Music; Jennifer Fierman, Selector Songs; TJ Landig, SVP, Marketing Operations and Strategy, Warner Records; Jeff Sosnow, EVP, A&R, Warner Records\n\n\tBillie Eilish, “Birds of a Feather” (No. 12)\n\n\t“Birds of a Feather” arrived like the rest of the singer’s third album, “Hit Me Hard and Soft” — as part of a full body of work without any pre-release singles. But “Birds” quickly poked its beak out when it landed in May 2024, swiftly becoming one of her biggest hits thus far.\n\t\n\n\tThis year, “Birds” stretched its wings even wider as it maintained its stronghold on the charts, with a peak at No. 2 on the Billboard Hot 100. After the track became the most streamed Spotify song of 2024 and earned Eilish her first leader on the Billboard Global charts, she picked up song of the year and favorite pop song for “Birds” at the American Music Awards in May. She also made her way around the globe on her “Hit Me Hard and Soft” tour from September 2024 through November of this year.\n\n\tAs with the rest of her catalog, Eilish collaborated with her brother, Finneas, to craft “Birds,” a gentle tune that didn’t exactly have “hit” written all over it. “The truth was, it’s an outlier,” Finneas says. “So the fact that it has gone on to have this insane life is such a thrill. We loved making it, but it’s extra validating to have something blow up like that without pushing it as a single.”\n\n\tEilish is closing the year with another career milestone: The track passed 3 billion Spotify listens. “What a rewarding experience,” adds Finneas. “It means we get to keep making music the way we want to.”\n\n\tSongwriters Billie Eilish, FinneasProducer FinneasLabel Darkroom/Interscope Geffen A&M RecordsHitmakers Chelsea Dodson, VP, pop/rock visual creative, Interscope Records; Hannah Gold, VP, marketing, Interscope Records; Justin Lubliner, founder, Darkroom Records\n\n\tSabrina Carpenter, “Espresso” (No. 25)\n\n\tEven though Sabrina Carpenter is already on to her next album, “Man’s Best Friend,” the buzz hasn’t yet worn off “Espresso.” The snappy tune, which released in April 2024 and reached No. 3 on the Billboard Hot 100, steamed its way through the following year on the back of a Grammy win for best pop solo performance and another for its parent record “Short n’ Sweet,” which took home best pop vocal album.\n\n\tBut it all could have gone a different way. “I was completely alone in wanting to release ‘Espresso,’” Carpenter previously told Variety. “Not from my immediate team. But when it came to ‘the powers above,’ [they questioned] whether it made sense. But they trusted me in the end, and I was happy I believed in myself at that moment.”\n\n\tCarpenter developed the idea for “Espresso” while on a break from opening for Taylor Swift’s “The Eras Tour,” collaborating with Julian Bunetta and Amy Allen at a studio in France. Bunetta notes that it was the perfect time for Carpenter to release the song, fresh off her fifth album, “Emails I Can’t Send.” “From ‘Nonsense’ into ‘Feather’ becoming a No. 1 song, there was a lot of momentum,” he says. “You felt that the next song that was released was going to get high playlisting on the DSPs, and there’s a lot of eyeballs that watched all the ‘Nonsense’ stuff and saw her on Taylor’s tour. Everyone was in the rhythm of working together.”\n\t\n\n\tSo much so that “Espresso” is still Carpenter’s best-performing single, with more than 2.6 billion Spotify streams. And with the second leg of her “Short n’ Sweet” tour wrapped, it keeps getting sweeter for the pop star.\n\n\tSongwriters Amy Allen, Julian Bunetta, Sabrina Carpenter, Steph JonesProducer Julian BunettaLabel Island RecordsHitmakers Amy Allen, songwriter; Julian Bunetta, producer and songwriter; Steph Jones, songwriter; Island Records; Volara Management\n\n\tADDITIONAL REPORTING BY JEM ASWAD, THANIA GARCIA, MIKE WASS AND CHRIS WILLMAN\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Hitmakers Repeat Offenders: How Smash Singles From Sabrina Carpenter, Shaboozey and Benson Boone Came Together",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/Benson-Boone-Sabrina-Carpenter-Shaboozey.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-06T16:00:00.000Z",
      "dateModified": "2025-12-06T16:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Amid Industry Earthquakes, James Cameron Salutes France’s Moviegoing Culture at ‘Avatar: Fire and Ash’ Premiere in Paris, Pays Tribute to Jon Landau and Slams Generative AI: ‘We’re Not Replacing Actors’",
    "url": "https://variety.com/2025/film/global/james-cameron-france-avatar-fire-and-ash-premiere-ai-1236602014/",
    "image": "https://variety.com/wp-content/uploads/2025/12/GettyImages-2249489447.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-06T13:16:05.000Z",
    "description": "\n\tJust a few hours after news broke of Netflix’s takeover of Warner Bros., James Cameron turned the European premiere of Disney’s “Avatar: Fire and As",
    "body": "\n\tJust a few hours after news broke of Netflix’s takeover of Warner Bros., James Cameron turned the European premiere of Disney’s “Avatar: Fire and Ash” in Paris into a cinematic rallying cry. “I requested this from Disney,” he told the crowd (equipped with 3D glasses) at La Scene Musicale venue, explaining why he chose France to launch the movie in Europe. \n\n\t“We need to honor the nation that has more cinephiles per capita than any other country in the world; The thing that I love about France is that in this country, it is a moral obligation to support the arts,” Cameron said on stage, standing alongside Zoe Saldana, Sigourney Weaver, Bailey Bass and Trinity Jo-Li Bliss, Sam Worthington. \n\t\n\n\tCameron also took the opportunity to highlight the fact that “Avatar” uses performance capture rather than generative AI. “You’re going to see the pinnacle of the most advanced imaging technology in the world,” he said. “We don’t use generative AI… We don’t know what that’s going to mean for our industry, but I know one thing — we’re not replacing actors,” he continued, drawing a vibrant applause. In fact, Cameron said it took 18 months to capture the performances of the actors for “Avatar: The Way of Water” (which came out in 2022) and “Avatar: Fire and Ash.”  \n\n\n\tCameron also paid homage to his close friend and late producer Jon Landau, who died last year and whose partnership shaped the DNA of the “Avatar” universe. He said Landau’s spirit and heart “infused of all three ‘Avatar movies’ and Titanic before that.” “We forced ourselves to go above and beyond to finish this film in a way he would have been proud of.”\n\t\n\n\tOn the red carpet, Sam Worthington explained how his work as an actor has remained authentic since the first “Avatar” movie 16 years ago even though technological tools have evolved greatly. “My job in the performance capture, the acting part, that’s been the same. It’s just pure acting with another person,” he said. What’s changed is everything around it. “The digital makeup is way more nuanced now. Every thought, every movement my body does when I’m truthful has been protected.”\n\n\t“That was a promise Jim made me in the first movie — and he’s delivered on it. It’s incredible to watch because it is me, 100%,” Worthington said. \n\n\tSigourney Weaver, who started playing a brilliant xenobotanist Dr. Grace Augustine in the first “Avatar” film, and now plays 14-year-old Kiri in “Avatar: The Way of Water” and Avatar: Fire and Ash,” connected the film’s themes to her real-life environmental activism. “I’m very involved with the oceans and the High Seas Treaty,” she said. “The movie shows even more graphically what corporations and humans are willing to do to their fellow creatures. It’s so sad —  but it educates you. These creatures are equal citizens of our world. You need to wake up… respect other species. This is not your world. You can’t just do whatever you want with it.”\n\n\tWeaver also confirmed what she said last October at a New York Comic Con “Alien” reunion panel. She told Variety that was enthused by Walter Hill’s 50-page treatment for a potential “Alien” return. “We’re taking it one step at a time,” she said. “I hope we do it because I think it will be wonderful. I think the fans will enjoy it. It’s very early days.”\n\n\t“Avatar: Fire and Ash” is coming out in French theaters in Dec. 17. Local exhibitors have placed their hopes in the movie to bolster the box office which has dropped significantly in 2025. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Amid Industry Earthquakes, James Cameron Salutes France’s Moviegoing Culture at ‘Avatar: Fire and Ash’ Premiere in Paris, Pays Tribute to Jon Landau and Slams Generative AI: ‘We’re Not Replacing Actors’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/GettyImages-2249489447.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-06T13:16:05.000Z",
      "dateModified": "2025-12-06T13:16:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Adrien Brody Says ‘Nothing Can Replace Emotion’ When Talking AI, Discusses ‘Self-Preservation’ in Shoots like ‘The Brutalist’: ‘I Have No Personal Life When I’m Filming’",
    "url": "https://variety.com/2025/film/festivals/adrien-brody-self-preservation-in-the-brutalist-1236601967/",
    "image": "https://variety.com/wp-content/uploads/2025/12/VARIETY-SIZING-49.png?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-06T15:34:55.000Z",
    "description": "\n\tAmerican actor Adrien Brody spoke about how he deals with the toll of “difficult” shoots like Brady Corbet’s “The Brutalist,” which won him his seco",
    "body": "\n\tAmerican actor Adrien Brody spoke about how he deals with the toll of “difficult” shoots like Brady Corbet’s “The Brutalist,” which won him his second Best Actor Oscar earlier in the year, just over two decades after his first win for “The Pianist.” Speaking at the Red Sea Film Festival, which he is attending for the second time following a brief stint in Jeddah in 2023, the actor said that the 23-day shoot for Corbet’s epic meant the whole cast and crew were “very depleted.”\n\t\n\n\tStill, even when working under stressful conditions, the actor said he never “holds back” when performing. “But there is no way to say, ‘I’m going to hold back today,’” he said. “The way I hold back is, I have no personal life when I’m filming. Inasmuch as I love the people I work with, I don’t hang out with my actors or crew when I have heavy lifting or emotional work.”\n\n\n\t“I have my own techniques to have the space to give it when needed,” he added. “You have to hope you’re able to. It’s not a science, you’re not a machine. Some days you’re not gonna be the best, and you have to find ways of being able to snap yourself out of whatever the personal distractions are, whatever the complexity is on the set that day. Whatever you are, you have to deliver work. That is the responsibility of the actor.”\n\n\tAsked about how he feels about having two Oscars, Brody said that “receiving an accolade like that is the pinnacle in an actor’s career,” calling it “incredibly rewarding.” “Especially to share it with your parents who’ve been supportive of you and understood the hardships and decades of work leading to that triumphant moment.”\n\t\n\n\tStill, reaching that level of recognition has not dimmed Brody’s hunger for more. Bringing up fellow multiple-Oscar-winner Meryl Streep as an example, the actor said: “I’m sure she’s quite moved by the level of appreciation and acknowledgment she’s gotten, but she still yearns for more exploration in the work. That does not go away.” \n\n\t“There are different pressures and criteria,” he added of his career following his award wins. “There are new doors that are open, which is wonderful, but the journey continues. I love acting more than ever. I yearn to act more than ever. I yearn to be a storyteller more than ever, in that I have a lifetime working with the finest directors ever, wonderful producers, amazing actors, and I know how to interact and give actors the space so that they can shine and feel most comfortable. And I know a great deal about narrative storytelling, so there’s a degree of evolution that I hope to add value to.”\n\n\tStill on “The Brutalist,” Brady mentioned “the parallels” between Corbet’s acclaimed drama and filmmaking itself. The actor said his journey in the film is “primarily about the struggle for driven artistic people to persevere and have their vision endure despite the wants and needs of the benefactor.”\n\n\t“There are a lot of parallels that obviously Brady Corbet felt in his journey, aspiring to make the caliber of work that he wants,” he added. “If you’re going to do any big work, if you’re an aarchitect or a filmmaker, you require the means to make that work. You need a whole machine to build together. Sometimes you are blessed with the support of your financiers and benefactors who believe in your vision, and sometimes you’re not and they have their own vision that differs. The film really delves deeply into the oppressiveness.”\n\n\tBriefly speaking about the growth of AI and new technologies within filmmaking, Brody said, “We are living at a time where there are immense shifts in every field.” “There are also shifts in the way we view content and what our children are exposed to as content.”\n\n\t“There are new tools that are now available that will definitely enhance all our abilities to do great work, but there is nothing to replace emotion,” he emphasized. “Even if you can fabricate it or whatever, we really should always cherish and support the creative process and the beauty of filmmaking, but that’s not to say that an evolution of that which is inevitable is bad. We have choices in what we choose as individuals to agree to ingest.”\n\t\n\n\tThe actor said audiences nowadays have a “lot of options at content,” which makes it harder to find “gems” that “do not have marketing support.” “If you have an appetite for that, you have to discover that and push for that and, as a producer, make those films.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Adrien Brody Says ‘Nothing Can Replace Emotion’ When Talking AI, Discusses ‘Self-Preservation’ in Shoots like ‘The Brutalist’: ‘I Have No Personal Life When I’m Filming’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/VARIETY-SIZING-49.png?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-06T15:34:55.000Z",
      "dateModified": "2025-12-06T15:34:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bong Joon Ho on Netflix-Warner Bros. Fears: ‘I Don’t Think the Cinematic Experience Will Disappear So Easily’",
    "url": "https://variety.com/2025/film/news/bong-joon-ho-netflix-warner-bros-movie-theaters-1236602013/",
    "image": "https://variety.com/wp-content/uploads/2025/12/Conversation_Bong_Joon_Ho_MeydenA.Zemmama_FIFM2025-87-e1765025655745.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-06T13:50:01.000Z",
    "description": "\n\tBong Joon Ho gave a nearly two-hour interview on Saturday at the Marrakech Film Festival, where he serves as this year’s jury president. In between ",
    "body": "\n\tBong Joon Ho gave a nearly two-hour interview on Saturday at the Marrakech Film Festival, where he serves as this year’s jury president. In between showing clips of his filmography, which includes “Memories of Murder,” “The Host” and best picture winner “Parasite,” Bong discussed his upbringing in South Korea and watching censored horror movies on TV, breaking genre conventions and the role of social commentary in cinema.\n\n\tBut a question from the audience at the end of the event finally addressed the Hollywood-sized elephant in the room.\n\t\n\n\t“It’s in the news that Netflix is going to buy Warner Bros. Many people, not only journalists, are worried that the theater experience might disappear,” the audience member said, noting that Bong has previously worked with both studios. (Netflix released his 2017 sci-fi adventure film “Okja,” and Warner Bros. distributed this year’s Robert Pattinson-starring “Mickey 17.”) The question continued, “What do you think about this acquisition, and what do you think about your films being screened on TV — even large TVs — and in cinemas with an audience? How do you see the future of cinema.”\n\n\n\t“To be honest, I don’t know what’s going on there in L.A. I’m just a South Korean guy staying at home,” Bong said, causing the audience to laugh adoringly. (It should be noted that Bong switched speaking between Korean and English, and his answers were reiterated by a live translator in French, which was then translated again for the audience through headsets in English, Arabic and other languages.)\n\n\tBong added that over 10 days at the Marrakech Film Festival, he and the jury members “really enjoyed” watching two movies per day “in the big theater, with the big screen.”\n\t\n\n\t“Streaming is also a good way to watch and enjoy movies,” Bong said. “But I don’t think the cinematic experience will disappear so easily.”\n\n\tOn Friday, Netflix announced its plans to acquire Warner Bros. and HBO Max in a $82.7 billion deal. Given Netflix CEO Ted Sarandos’ antipathy toward movie theaters — naturally, his business aims to keep people on the couch — many in the Hollywood community are worried about what the acquisition means for cinemas. Sarandos said Netflix “expects” to release Warner Bros. films theatrically and will keep HBO “operating largely as it is.” But he admitted that the theatrical windows of the films will “evolve,” or, in other words, be shortened, to be “more consumer friendly.” The CEO noted that Netflix put 30 films in theaters in 2025, but those releases are extremely limited (and a requirement for awards contention).\n\n\tIn April, Sarandos said at the Time100 Summit that watching movies in theaters is “an outdated concept.” He argued that the struggling global box office signals that the consumer would “like to watch movies at home.” \n\n\t“The studios and the theaters are duking it out over trying to preserve this 45-day window that is completely out of step with the consumer experience of just loving a movie,” he said. Still, he added that Netflix “saved” couple of historic movie theaters, including Los Angeles’ Bay Theater and New York’s Paris Theater. “We didn’t save it to save the theater business,” he said. “We saved it to save the theater experience.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bong Joon Ho on Netflix-Warner Bros. Fears: ‘I Don’t Think the Cinematic Experience Will Disappear So Easily’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/Conversation_Bong_Joon_Ho_MeydenA.Zemmama_FIFM2025-87-e1765025655745.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-06T13:50:01.000Z",
      "dateModified": "2025-12-06T13:50:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Brazilian Drama ‘Low Light’ Sparks Momentum at Ventana Sur Copia Final With Trio of Awards, Eyes Major Festival Launch (EXCLUSIVE) ",
    "url": "https://variety.com/2025/film/global/low-light-sandra-corveloni-manjericao-filmes-ventana-sur-1236601997/",
    "image": "https://variety.com/wp-content/uploads/2025/11/LOWLIGHTAlda-e-Vera-carro-de-policia.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-06T12:10:39.000Z",
    "description": "\n\tBel Bechara and Sandro Serpa’s Brazilian drama “Low Light” (“Lusco-Fusco”), a Rafaella Costa production at Manjericão Filmes, emerged as one of the ",
    "body": "\n\tBel Bechara and Sandro Serpa’s Brazilian drama “Low Light” (“Lusco-Fusco”), a Rafaella Costa production at Manjericão Filmes, emerged as one of the standout titles at Ventana Sur’s Copia Final sidebar, scooping the Cine+ OCS Award, the Estúdio Silver Award and the Send Files Award.\n\n\tThe prizes have given fresh momentum to a project that tackles domestic abuse and structural violence against women through a story of intergenerational solidarity.\n\t\n\n\tSet largely around a public elementary school, the film follows Vera, a young teacher trapped in an abusive relationship; Alda, the school’s cleaner who has grown old without learning to read or write; and Joana, Alda’s eight-year-old granddaughter and Vera’s pupil, who becomes the link between the two women. \n\n\n\tAs Vera and Alda find refuge in their friendship – a small, fiercely defended space where they can share pain, desire and fragile plans for the future – Joana absorbs, almost in real time, what it means to be a woman in Brazil in the mid-2020s.\n\n\tConceived during the pandemic, when femicides and assaults against women surged, “Low Light” springs from what its filmmakers describe as the need to show that confronting gender violence is not an individual crusade but a collective process. \n\n\tAlso penned by Bechara and Serpa, the script is built around three generations – child, young adult and older woman – and insists on finding hope in the everyday gestures of protection and alliance among women rather than in a single cathartic act.\n\n\tLongtime collaborators, the duo has built a distinctive body of work across seven 35mm shorts and three feature-length documentaries: “Música Serve pra Isso” (2013), “Histórias de Marabaixo” (2016) and “Hoje é o Primeiro Dia do Resto da Sua Vida” (2024). They also directed the 2018 fiction feature “Onde Quer Que Você Esteja” and continue to straddle fiction and non-fiction.\n\t\n\n\tOn the production side, Rafaella Costa’s Manjericão Filmes anchors the project. Founded in 2007, the São Paulo-based company has carved out a profile as a go-to partner for politically engaged, women-driven work with international reach. \n\n\tManjericão produced Lillah Halla’s “Power Alley” (“Levante”), which premiered at Cannes’ Critics Week in 2023, sold well, and won the Fipresci prize for best first feature across the parallel sections, and Caru Alves de Souza’s “My Name Is Baghdad,” Crystal Bear winner for best film at Berlin’s Generation 14plus in 2020.\n\n\tProduced in association with Macondo Filmes, “Low Light” won financing support via Brazil’s Paulo Gustavo Law. Before Ventana Sur, it already made noise in work-in-progress showcases such as Brasil Cinemundi and CineLatino’s Cinéma en Construction at the Audiovisual Hub. \n\n\tVariety spoke with Bechara, Serpa and Costa about the film’s origins, its visual language and their ambitions for its international career.\n\n\tWhat was the initial spark for “Low Light,” and when did you realise the intersecting stories of Vera, Alda and Joana could sustain a feature?\n\n\tBel Bechara and Sandro Serpa: During the pandemic in Brazil, we watched the numbers of femicides, rapes and other forms of violence against women rise sharply. We were living under a far-right government that openly encouraged gun ownership and treated women as inferior, even defending lower salaries for women because they could get pregnant. That misogynistic environment, combined with lockdown and people stuck together in very small spaces, created an explosion of domestic violence.\n\n\tFrom there, we sketched the first outline of “Lusco-Fusco,” understanding that confronting structural violence against women wouldn’t be an individual journey but a collective one – women helping and learning from other women. That’s why we built the film around three generations: an eight-year-old girl, a 28-year-old woman and a 54-year-old woman. \n\n\tJoana learns from her grandmother and her teacher what it means to be a woman in Brazil in 2025 and, at the same time, she is the one who brings hope, the one who leads the other two not to give up in their darkest moment.\n\n\tWe wanted to make a film about a very harsh subject without losing hope, believing in the power of friendship and protection among women.\n\t\n\n\tHow did you approach depicting domestic abuse and illiteracy while preserving Vera and Alda’s agency and dignity on screen?\n\n\tAlda and Vera face different forms of abuse and violence. Alda had to abandon herself and her education to fit the role expected of women: to care – for men, for the family. Today she works as a cleaner at the school and is also responsible for caring for Joana, her granddaughter, while the father, who lives with them, takes no responsibility at all.\n\n\tVera is trapped in an abusive relationship that follows the familiar “cycle of violence”: the man assaults her, disappears, returns remorseful and kind for a while, and then everything starts again. When this cycle isn’t broken, it can end in femicide.\n\n\tFrom the very first draft, we decided there would be no graphic violence on screen. The camera pulls back; we cut to the outside of the house; we focus only on the women in the most tense moments. Illiteracy is presented as a consequence of structural violence: once Alda gets closer to Vera and is encouraged to study, she can shift the power dynamics at home and move forward at work.\n\n\tTo preserve their dignity and agency, we worked through the script and very closely with our actresses. Sandra Corveloni a Palme d’Or best actress winner for Walter Salles and Daniela Thomas’ “Linha de Passe,” portrays an Alda who never pities herself. Amandyra’s Vera understands, when she sees the violence reach her friend, that it is impossible to accept this and she reacts.\n\n\tBut we did not seek personal catharsis or individual redemption, which would empty the discussion. The problem is structural, collective and persistent. They have their individual struggles, but they can still be lynched simply for being women. We point toward hope through sisterhood, mutual support and, ultimately, political organization.\n\n\tHow do you use light, space and texture to turn the title “Low Light” into a visual and emotional concept in the film?\n\n\tThe exact translation of “Lusco-Fusco” would be “Twilight,” but that title is already taken from a very famous vampire film. We chose “Low Light” thinking about this moment between darkness and light – dawn or dusk.\n\n\tWe worked on the characters’ emotional states in parallel with this idea. Vera hides in the dark when she isn’t well, and Alda quickly recognizes that code and steps in to help. In a key scene, Vera is drawn to the light of a concert by punk singer Karina Buhr and pushed to make a decision about her future. In the film’s low point, Alda and Vera are on the verge of giving up, surrendered to darkness, with no strength to react, and little Joana brings light – literally and metaphorically – into the scene.\n\t\n\n\tThere are also contrasts with brighter, more cheerful spaces, like the school during the day, which later appears lifeless and without light in early nighttime scenes. As Vera and Alda grow closer, it gradually regains color and vitality. The male characters always bring oppression and darkness; in the most tense moments of the “cycle of violence,” everything becomes heavier, and later things seem to improve. That dynamic is reflected in the environments and the lighting, following the logic of the cycle.\n\n\tWhat kind of visibility and concrete partnerships are you hoping to secure from the film’s presence at Copia Final at this stage?\n\n\tRafaella Costa: The Copia Final session at Ventana Sur is a key window to propel the film toward the world. We believe that our participation in the showcase, combined with the recognition and the awards we received, now gives the film the strength it needs to find the right partners to boost its international reach and commercial punch and help us reach our audience.\n\n\tOur next step is to secure a beautiful premiere at a major festival and then travel with the film across as many territories as possible, in partnership with a sales agent who will join us in this collaboration.\n\n\tHow does Manjericão Filmes’ track record shape your ambitions for “Low Light” in terms of artistic identity and festival and commercial strategy?\n\n\tCosta: Manjericão Filmes has consolidated its identity by producing works led by women and dedicated to the most urgent issues in their lives in contemporary Brazil: friendship, youth, politics and its violences, abortion, among others.\n\n\t“Low Light” continues the ethical and aesthetic vocation that guides our work. The film, which has already drawn attention in work-in-progress sessions in international markets, combines strong character work and precise writing, elements that point to both a solid premiere and a consistent trajectory on the international festival circuit.\n\n\tAt the same time, it is a film capable of engaging broader audiences, first in movie theaters and later on platforms. We are committed to building this path with the same care and artistic ambition that define Manjericão and its projects.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Brazilian Drama ‘Low Light’ Sparks Momentum at Ventana Sur Copia Final With Trio of Awards, Eyes Major Festival Launch (EXCLUSIVE) ",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/LOWLIGHTAlda-e-Vera-carro-de-policia.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-06T12:10:39.000Z",
      "dateModified": "2025-12-06T12:10:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rachid Bouchareb Unveils ‘Reggane,’ Algeria-Set Drama on France’s Nuclear Tests: ‘What Interests Me Is to Bring That to Light’ (EXCLUSIVE)",
    "url": "https://variety.com/2025/film/global/rachid-bouchareb-reggane-nuclear-tests-red-sea-1236602064/",
    "image": "https://variety.com/wp-content/uploads/2025/12/Rachid-Bouchareb.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-06T14:56:33.000Z",
    "description": "\n\tOscar-nominated Franco-Algerian director Rachid Bouchareb (“Days of Glory”) is preparing his next feature, “Reggane,” a fiction film set against the",
    "body": "\n\tOscar-nominated Franco-Algerian director Rachid Bouchareb (“Days of Glory”) is preparing his next feature, “Reggane,” a fiction film set against the backdrop of France’s first nuclear tests in the Algerian Sahara, a long-suppressed chapter of colonial history the filmmaker has been exploring for years.\n\n\tRevealed exclusively to Variety at the Red Sea Film Festival, where Bouchareb is being honored for his body of work, “Reggane” expands on the research behind his short documentary “Boomerang Atomic,” which traced France’s nuclear program through archival material. For Bouchareb, the documentary, which premiered out of competition in Venice this year, was part of the groundwork for a larger fiction project.\n\t\n\n\t“As I looked at the archive at the Ministry of Defense, at the INA (National Audiovisual Institute), and with private individuals, it allowed me to do this work of reading the archives, the images, in order to write my feature film,” he recalled.\n\n\n\tSet in 1960, the year France carried out its first nuclear test near the desert town of Reggane, the film follows a young Algerian shepherd forcibly absorbed into life on a military base after his livestock is confiscated by the French army. Through his eyes, the film moves inside a closed world where Algerian workers and nomadic Tuareg populations live side-by-side with French soldiers and scientists.\n\n\t“One thing struck me immediately,” Bouchareb observed. “In the images, the Algerians don’t exist. Yet there were thousands of them working on the base. Just like in ‘Days of Glory,’ the cameras chose not to film them.” Fiction, he emphasized, allows him “to fill that gap.”\n\t\n\n\tThat impulse to illuminate what he calls “areas where there is no light” has defined Bouchareb’s career, from “Days of Glory,” which helped prompt the French government to restore pensions to colonial soldiers, to “Outside the Law,” which unfolds during the Algerian war for independence, and “London River,” an intimate portrait of human connection that unfolds after the 2005 London bombings. With “Reggane,” he turns to a subject with ongoing consequences, embodied by radioactive contamination that, according to independent studies cited by the filmmaker, could persist for millennia.\n\n\tNow in pre-production, the project is slated to begin filming in southern Algeria in September 2026. While access to the original nuclear test site remains restricted, the production will reconstruct part of the base as a primary set, supplemented by visual effects where necessary. Shooting will take place between Timimoun and Tamanrasset, deep in the Sahara.\n\n\tBouchareb plans to shoot the film in 65mm “because the Sahara is beautiful, and it deserves an image and technical means that can support the artistic side of the film and give it the scale it needs.”\n\n\tLogistically, the film presents significant challenges, including long-distance travel and the difficulty of transporting heavy equipment to remote regions, but the director stressed that the project has full backing from Algerian authorities, including the Ministry of Culture. “The support is total,” he remarked, noting that the subject itself sits at the center of ongoing diplomatic and political discussions between France and Algeria.\n\n\tThe film will star Sami Bouajila, a longtime collaborator who previously appeared in “Days of Glory” and “Outside the Law,” alongside Algerian actors cast locally.\n\n\tFinancing is anchored by Algeria, Belgium (Umedia) and Italy (Urania Pictures), with a potential U.S. partner currently in discussion. Bouchareb will head production through his Paris-based outfit 3B Productions. The director confirmed that the project is proceeding outside France’s CNC system, citing language requirements and a desire to maintain flexibility on that front.\n\n\tWith “Reggane,” Bouchareb returns to themes that have long shaped his work, those of history, memory, and their political and social consequences. “Colonization was built on lies,” he reflected. “What interests me is to bring that to light, even for myself, to discover so many things that were never told, never written, by those who lived them.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rachid Bouchareb Unveils ‘Reggane,’ Algeria-Set Drama on France’s Nuclear Tests: ‘What Interests Me Is to Bring That to Light’ (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/Rachid-Bouchareb.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-06T14:56:33.000Z",
      "dateModified": "2025-12-06T14:56:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Stormi Bree Hot Shots to Celebrate Her 35th Birthday!",
    "url": "https://www.tmz.com/2025/12/06/stormi-bree-hot-shots-birthday/",
    "image": "https://imagez.tmz.com/image/3a/16by9/2024/01/03/3a556106c7b54065b71c9c26a7701bac_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-12-06T15:00:15.000Z",
    "description": "\n    \n                    \n                          Stormi Bree's\n                          Hottest Shots\n                          For Her 35th Birt",
    "body": "\n    \n                    \n                          Stormi Bree's\n                          Hottest Shots\n                          For Her 35th Birthday!🎉\n                      \n                  \n                        Published December 6, 2025 7:00 AM PST\n                                                                            \n      \n    \n      \n        \n              \n    \n    \n          It's hard to look away whenever Stormi Bree's around, and we're thinking she's going to have plenty of eyes on her this weekend ... because she's turning 35!\n      \n    \n          Stormi's accomplished a fair amount throughout the years, as she's gone from earning the title of Miss Teen USA in 2009 to dipping her toes into acting and singing -- she really does it all!\n      \n    \n          And since she's shared lots of sexy snaps along the way, we thought it'd be a good time to share some of our favorites ... check out our gallery and enjoy!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Hotties & Bodies\n              \n                          \n                Birthdays\n              \n                          \n                Photo Galleries\n              \n                          \n                Fairly Legal\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Stormi Bree Hot Shots to Celebrate Her 35th Birthday!",
      "image": [
        "https://imagez.tmz.com/image/3a/16by9/2024/01/03/3a556106c7b54065b71c9c26a7701bac_xl.jpg"
      ],
      "datePublished": "2025-12-06T15:00:15.000Z",
      "dateModified": "2025-12-06T15:00:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Faux Fur Hotties -- Hailey Bieber & Lizzo Fake It Til They Make It!",
    "url": "https://www.tmz.com/2025/12/06/faux-fur-hotties-fake-it-til-you-make-it-lizzo-hailey-bieber/",
    "image": "https://imagez.tmz.com/image/73/16by9/2025/12/02/73c9bf48c31849568fe7beb73be40554_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-12-06T08:45:41.000Z",
    "description": "\n    \n                    \n                          Faux Fur Hotties ..\n                          Fake It\n                          Til You Make It!\n",
    "body": "\n    \n                    \n                          Faux Fur Hotties ..\n                          Fake It\n                          Til You Make It!\n                      \n                  \n                        Published December 6, 2025 12:45 AM PST\n                                                                            \n      \n    \n      \n        \n              \n    \n    \n          Faux fur is all the rage these days, and since temps are droppin' ... it's time for you to warm up with these scruffy-furry baes!\n      \n    \n          From Lizzo's bikini-fur look, to Hailey Bieber's cushy crop top magic, even Oliva Pierson is gettin' her fix of fake! And try on \"Love Island's Amaya Espinal cozying up in this winter's must-have fashion!\n      \n    \n          Living for the cozy life? Check out the gallery and bundle up with Hollywood's hottest!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Amaya Espinal\n              \n                          \n                Hailey Bieber\n              \n                          \n                Lizzo\n              \n                          \n                Weather\n              \n                          \n                Hotties & Bodies\n              \n                          \n                Hot Bodies\n              \n                          \n                Fashion\n              \n                          \n                Photo Galleries\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Faux Fur Hotties -- Hailey Bieber & Lizzo Fake It Til They Make It!",
      "image": [
        "https://imagez.tmz.com/image/73/16by9/2025/12/02/73c9bf48c31849568fe7beb73be40554_xl.jpg"
      ],
      "datePublished": "2025-12-06T08:45:41.000Z",
      "dateModified": "2025-12-06T08:45:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Stars and Scars -- You Be the Judge",
    "url": "https://www.tmz.com/2025/12/06/polls-you-be-the-judge/",
    "image": "https://imagez.tmz.com/image/08/16by9/2025/12/05/080204a316354d8ebd95811dfcede232_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-12-06T08:25:56.000Z",
    "description": "\n      SUBSCRIBE\n      Yes! Send me email updates and offers from TMZ and its Affiliates. By subscribing, I agree to the Privacy Policy and Terms of U",
    "body": "\n      SUBSCRIBE\n      Yes! Send me email updates and offers from TMZ and its Affiliates. By subscribing, I agree to the Privacy Policy and Terms of Use\n        Subscribe to TMZ newsletter\n        \n      FOLLOW\n      \n        \n        \n        \n        \n      \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Stars and Scars -- You Be the Judge",
      "image": [
        "https://imagez.tmz.com/image/08/16by9/2025/12/05/080204a316354d8ebd95811dfcede232_xl.jpg"
      ],
      "datePublished": "2025-12-06T08:25:56.000Z",
      "dateModified": "2025-12-06T08:25:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sexy Sydney Sweeney -- What's The Big Frigin' Difference?!",
    "url": "https://www.tmz.com/2025/12/06/sexy-sydney-sweeney-whats-the-big-frigin-difference/",
    "image": "https://imagez.tmz.com/image/e7/16by9/2025/12/03/e7bfbf42c76a4494811970ceea09eb03_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-12-06T08:01:26.000Z",
    "description": "\n    \n                    \n                          Sexy Sydney Sweeney\n                          What's The Big\n                          Frigin' Di",
    "body": "\n    \n                    \n                          Sexy Sydney Sweeney\n                          What's The Big\n                          Frigin' Difference?!\n                      \n                  \n                        Published December 6, 2025 12:01 AM PST\n                                                                            \n      \n    \n          Bounce into these two bodacious side-by-side shots of Sydney Sweeney and see if you can win over the minor changes ...\n      \n    \n          Earlier this week, the 28-year-old actress rocked a sparkly gown for \"The Housemaid\" New York screening! ... say what you want, but Sydney slays!\n      \n    \n          Flip your hair like you just don't care and hit up the gallery!\n      \n    \n          HINT: There are THREE differences in the above Sydney Sweeney photos!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Sydney Sweeney\n              \n                          \n                Hotties & Bodies\n              \n                          \n                Hot Bodies\n              \n                          \n                Movies\n              \n                          \n                Photo Galleries\n              \n                          \n                What's The Big Frigin' Difference\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sexy Sydney Sweeney -- What's The Big Frigin' Difference?!",
      "image": [
        "https://imagez.tmz.com/image/e7/16by9/2025/12/03/e7bfbf42c76a4494811970ceea09eb03_xl.jpg"
      ],
      "datePublished": "2025-12-06T08:01:26.000Z",
      "dateModified": "2025-12-06T08:01:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Marciano Brunette Sues Demi Engemann For Defamation Over Sexual Assault Claims",
    "url": "https://www.tmz.com/2025/12/05/marciano-brunette-sues-demi-engemann-defamation/",
    "image": "https://imagez.tmz.com/image/57/16by9/2025/12/06/577ad570bdab4fb6ac9cd0002ce78bdd_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-12-06T01:43:25.000Z",
    "description": "\n                    \n                          Demi Engemann Sued\n                          Sexual Assault Claims Are Bogus!!!\n                      ",
    "body": "\n                    \n                          Demi Engemann Sued\n                          Sexual Assault Claims Are Bogus!!!\n                      \n                  \n                        Published December 5, 2025 5:43 PM PST\n                                                                            \n              \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          \"Vanderpump Villa\" star Marciano Brunette is suing \"Secret Lives of Mormon Lives\" star Demi Engemann for defamation ... he says her sexual assault allegations against him are a bunch of baloney.\n      \n    \n          In new legal docs, obtained by TMZ, Marciano claims Demi is damaging his reputation by falsely calling him a \"sexual predator\" and accusing him of sexual assault.\n      \n    \n          He says she's lying about their interaction last year at the \"Vanderpump Villa\" in Italy ... claiming the kiss they shared off camera was totally consensual, despite how Demi has been portraying things on social media and TV.\n      \n\n                  \n          \n                          \n                \n                  \n      \n    \n          In the docs, Marciano says Demi's story about what went down between them in August 2024 during filming in Italy has shifted over time and he says she's \"reframed the obviously consensual interaction as one of sexual misconduct and then as sexual assault\" to give herself a storyline.\n      \n    \n          Marciano is also suing 'Mormon Wives' producer Jeff Jenkins ... he says production \"aired the allegations in a way designed to maximize impact while cutting Marciano out and denying him any meaningful opportunity to respond.\"\n      \n    \n          He says production had \"obvious reasons to doubt Engemann’s account, including inconsistencies, delay, and facts known to Production that undermined the claims\" ... but says the show \"amplified the same accusations for profit.\"\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          In the docs, Marciano includes alleged texts from Demi he says she sent after leaving Italy. He says she stayed in contact with him from months through calls, texts, FaceTime and invited him to visit her in Utah and California.\n      \n    \n          Marciano claims Demi even shared her location with him and says, \"That behavior confirms a continued relationship, not a person reacting to sexual assault.\"\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          In the docs, he says Demi's false claims have resulted in \"lost professional opportunities, harassment by strangers, and lasting harm to Marciano's reputation.\"\n      \n    \n          Marciano is suing for defamation and going after Demi and the producer for damages ... and he wants a \"narrowly tailored injunction\" that prohibits them from \"repeating and republishing all of the statements that are adjudicated by this Court to be defamatory.\"\n      \n    \n          We reached out to Demi and Jeff ... so far no word back.\n      \n      ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Marciano Brunette Sues Demi Engemann For Defamation Over Sexual Assault Claims",
      "image": [
        "https://imagez.tmz.com/image/57/16by9/2025/12/06/577ad570bdab4fb6ac9cd0002ce78bdd_xl.jpg"
      ],
      "datePublished": "2025-12-06T01:43:25.000Z",
      "dateModified": "2025-12-06T01:43:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]