[
  {
    "title": "Channing Tatum Cried ‘Five, Six, Seven Times’ at ‘Josephine’ Premiere as Film Becomes First Sundance 2026 Sensation",
    "url": "https://variety.com/2026/film/news/channing-tatum-cries-josephine-sundance-premiere-1236639359/",
    "image": "https://variety.com/wp-content/uploads/2026/01/GettyImages-2257853547.jpg?w=1000&h=562&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-24T01:23:09.000Z",
    "description": "\n\tAudience members were moved to tears during the world premiere of “Josephine,” one of the first major revelations out of this year’s Sundance Film F",
    "body": "\n\tAudience members were moved to tears during the world premiere of “Josephine,” one of the first major revelations out of this year’s Sundance Film Festival. One of the people who was blubbering at Park City’s Eccles Theater was none other than the film’s star Channing Tatum, who confessed that he “cried five, six, seven times” as he finally watched the movie for the first time.\n\n\tFestival-goers didn’t just weep through “Josephine.” They also laughed and cheered during the few lighthearted moments in the otherwise heart-wrenching drama about a young girl who witnesses a brutal sexual assault at her local park in San Francisco. Tatum and Gemma Chan star as Josephine’s parents, who struggle to console their young daughter as she grapples with the aftermath of the traumatic event.\n\t\n\n\tBeth de Araújo wrote and directed the film about a harrowing real-life experience she faced as a child. When the director took the stage at the Eccles on Friday afternoon, she wiped away tears of her own as she was greeted with a standing ovation. The crowd continued to clap and cheer as de Araújo brought out her actors, newcomer Mason Reeves who plays Josephine, as well as Tatum — who picked up his pint-sized co-star and swung her around — and Chan. \n\n\n\t“I started writing this in 2014 when I realized that something happened to me when I was young that haunted me,” De Araújo said during the Q&A after the screening. “I took a stab at writing about female fear, and how that’s shaped who I’ve become. I kept it through the eyes of an 8-year-old and how she learns about male aggression, and I took the fear to the extreme.”\n\t\n\n\tFriday’s premiere was a star-is-born moment for 8-year-old Reeves, whom the director discovered at a farmer’s market in San Francisco. As for her first time on a film set, Reeves declared “what I liked most was all of it” — prompting laughter from the audience. Reeves continued to charm the crowd, saying she hopes to keep acting but would prefer a less-intense genre the next time around. “I have five different [in mind]…. the first is action, then fantasty, a musical, a movie with animals in it, and the last is one a movie filmed in Paris.”\n\n\tThroughout the film, Tatum and Chan’s characters are forced to reprimand their daughter, who acts out as she wrestles with a newfound fear and anger that she can’t yet comprehend. Tatum, in real life the father to a 12-year-old daughter, was worried that Reeves wouldn’t be able to differentiate pretend from reality.\n\n\t“I was concerned about her actually thinking I was mad at her,” Tatum said about Reeves. “I was like, ‘You know I’m just acting, right?'”\n\n\tReeves, decked out in a sparkly silver dress, interjected: “He kept asking me about it, and I was like, ‘I’m fine!‘”\n\n\tChan, who was the first actor to sign onto the film, said she felt “there was a truth radiating from the page” while reading the script. “It’s a really challenging subject matter, and I thought the way [Beth] approached it and forced us to see it through a child’s eyes was brave.”\n\n\tBefore the audience ventured back into the cold, De Araújo thanked everyone for “engaging with something that isn’t an easy sit” and added, “I hope you feel like you had an opportunity to crack your heart open and give yourself the time and space to imagine a better world for yourself.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Channing Tatum Cried ‘Five, Six, Seven Times’ at ‘Josephine’ Premiere as Film Becomes First Sundance 2026 Sensation",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/GettyImages-2257853547.jpg?w=1000&h=562&crop=1"
      ],
      "datePublished": "2026-01-24T01:23:09.000Z",
      "dateModified": "2026-01-24T01:23:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Dildos, Ball Gags and Threesomes: Kinky Olivia Wilde Thriller ‘I Want Your Sex’ Heats Up Sundance",
    "url": "https://variety.com/2026/film/news/olivia-wilde-i-want-your-sex-sundance-premiere-nudity-dildos-1236639049/",
    "image": "https://variety.com/wp-content/uploads/2026/01/02e8fu8ktI_Want_Your_Sex-Still_1.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-24T04:26:13.000Z",
    "description": "\n\t“I Want Your Sex,” an erotic thriller starring Olivia Wilde as a sexually assured artist who embarks on a sadomasochistic relationship with her gall",
    "body": "\n\t“I Want Your Sex,” an erotic thriller starring Olivia Wilde as a sexually assured artist who embarks on a sadomasochistic relationship with her gallery assistant, got Sundance’s pulse racing on Friday night. Cooper Hoffman plays Elliot, the sub to Wilde’s dom in Gregg Araki’s latest piece of boundary-pushing provocation, one that Sundance programming director Kim Yutani dubbed a “return to form” for the filmmaker in her introductory remarks.\n\t\n\n\tBoth stars go for it — baring all in a relationship that is kinky, but also tender at times. Not in a conventional way, of course. Wilde’s character, Erika Tracy, opens a sexual Pandora’s box for Hoffman, one that comes with ball gags, stilettos, whips, chains, and a cornucopia of dildos and strap-ons. There’s even a disastrous threesome that goes comically off the rails.\n\n\n\tWhen Araki heard that Wilde was interested in playing Erika, he made it clear what would be required. \n\n\n\t“We had a meeting, and I just said, ‘you know, to do this part, you gotta just not give a fuck, and just want to just fucking take the plunge,'” Araki recalled during a post-screening Q&A. “‘Because I don’t want to compromise it. I don’t want to water it down.’ And she said, ‘Let’s go.'”\n\n\tWilde said she never looked back after signing up to play the role of an artist whose swagger masks her dwindling confidence. \n\n\t“I was just so excited by Gregg’s enthusiasm for the medium, for the process,” Wilde said. “I wish more people made movies like [Gregg]. You just said, ‘Let’s do it. Let’s get cool people together who want to tell a story, and let’s just do it. And it doesn’t have to be a whole thing, and it doesn’t have to feel like this corporate project. It has to just come from the heart.’ And I wanted to be a part of something like that.”\n\t\n\n\tHoffman, who turned heads in Paul Thomas Anderson’s “Licorice Pizza,” wasn’t sure he was right for the part of a bumbling boy toy. Araki was drawn to Hoffman because he reminded him of Dustin Hoffman in “The Graduate” and thought he could bring the same nebbish intensity to the part.\n\n\t“I honestly didn’t think I’d get cast,” Hoffman admitted. “I just threw my hat in the ring and kept getting closer and closer. And then they said I got the job. And I was like, ‘Ah, shit. I gotta go do this.’ And I’m very happy I did.”\n\n\tOn the red carpet prior to the premiere, Wilde told Variety that Gen Z wants to see less sex in movies and TV because they “don’t want to see inauthenticity anymore.”\n\n\t“The way that sex has been portrayed in film for a long time hasn’t been particularly realistic,” Wilde said. \n\n\n\tThat may not be a critique that’s leveled at Araki and company. The nudity and S&M mean “I Want Your Sex” will push the R-rating to the breaking point, but it was the film’s heart that the cast kept emphasizing on stage.\n\n\t“Ultimately, the sex feels secondary,” Chase Sui Wonders, who plays Hoffman’s best friend and roommate, said. “It’s a story about being obsessed with someone…It’s just a tragic love story.”\n\n\tMason Gooding, Daveed Diggs and Charli xcx round out the ensemble. Black Bear produced the film, which is looking for distribution. The packed auditorium included executives from indie labels like Magnolia, Roadside and Mubi, and the room was so crowded that Patrick Schwarzenegger was spotted walking up and down the aisle looking for an empty seat.\n\n\t“I Want Your Sex” is Araki’s eleventh feature at Sundance, with the director having previously debuted the likes of “Mysterious Skin” and “The Doom Generation” at the mountain festival. Before the film screened, Araki praised Sundance founder Robert Redford, who died last year at the age of 89.\n\n\t“There’s been nobody in the history of fucking Hollywood movies who says, ‘I want to use my fucking incredible star power and all my fucking clout to create this place in the world for those fucking weird filmmakers, those outsider filmmakers, those different voices,” Araki said. “It’s all about DEI.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Dildos, Ball Gags and Threesomes: Kinky Olivia Wilde Thriller ‘I Want Your Sex’ Heats Up Sundance",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/02e8fu8ktI_Want_Your_Sex-Still_1.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-24T04:26:13.000Z",
      "dateModified": "2026-01-24T04:26:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Extra Geography’ Review: Molly Manners’ Delightful Female Friendship Movie Shines With Original Wit and Disarming British Humor",
    "url": "https://variety.com/2026/film/reviews/extra-geography-review-molly-manners-1236637524/",
    "image": "https://variety.com/wp-content/uploads/2026/01/ExtraGeography.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-24T02:45:00.000Z",
    "description": "\n\tFemale friendships demand something a little extra. As that famous America Ferrera monologue in “Barbie” reminded us, it’s tough to be a woman — or,",
    "body": "\n\tFemale friendships demand something a little extra. As that famous America Ferrera monologue in “Barbie” reminded us, it’s tough to be a woman — or, in the case of the two off-kilter leads of the uniquely witty “Extra Geography,” to be in that transitional and equally contradictory period known as girlhood. On top of the burdens you’re born into, how do you simultaneously navigate schoolwork, peer drama, the many mysteries of your budding sexuality, and the unknowable land of boys while also trying to stay loyal to your friendships and be true to your own identity? And on that note, have you figured out who you are yet?\n\t\n\n\tBased on Rose Tremain’s dreamlike 2007 short story with the same name, Molly Manners’ debut feature “Extra Geography” (adapted by “Succession” scribe Miriam Battye) conquers these treacherous coming-of-age waters with a prose so sharp-tongued, timelessly wise and funny that this Gen-Xer felt as if it arrived to fill a cinematic void in her own teen-hood retroactively, just like other comparable movies this side of “Ghost World.” In that, the first quarter of the 21st century has indeed been good to movies about female friendships, with “Extra Geography” joining the ranks of instant greats like “Lady Bird,” “Booksmart” and “Frances Ha.”\n\n\n\tThen again, the proudly British text and aesthetics of Manners and Battye’s “Extra Geography” charts its own fresh territory, like a contemporary Jane Austen novel unfolding within the walls of an English school. Stylistically in step with Tremain’s nostalgic tale, it’s rooted in the palpable pains of youth, while hovering slightly above the realities of everyday life like a cheeky fantasy. At the film’s center are the lovably gruff duo Flic and Minna, played with precision and stiff-upper-lipped hilarity by newcomers Marni Duggan and Galaxie Clear respectively. Accompanied by a range of tunes — from a touch of Boccherini to the likes of “Crimson and Clover” that accentuates the story’s timeless qualities (“Extra Geography” doesn’t spell out the period it’s set in) — Flic and Minna keep busy enough at their boarding school by playing lacrosse, moving across the property’s expansive grounds with an air of snide untouchability and bickering about the future, almost exclusively with one another. “What will happen if we don’t get into Oxbridge?,” Minna wonders right at the start, while the two pick on their perennially bruised knees. “Maybe we’ll just die,” Flic suggests.\n\t\n\n\tAnd there you have it — the risks always seem that intense during one’s youth when every little triumph or mistake lands like a life-or-death situation. Caught in these currents, the amusingly terse Minna and Flic decide that it isn’t enough to just go to a good school and get good grades. In order to really thrive in the future, they also need to become “worldly.” And you can’t possibly be worldly unless you give yourself a little taste of Shakespeare no matter how “rubbish” he might be, and fall in love with someone. Excited about their plan, the duo auditions for an upcoming production of “A Midsummer Night’s Dream,” and choose an unlikely school project on the side: fall in love with the first person that they’d come across.\n\n\tThe first part of the plan doesn’t quite work out when the casting gets announced with Minna landing the role of Titania the Queen of Fairies, and Flic, a lowly tree. As for the second part, the girls set their sights on their geography teacher Miss Delavigne (a wonderfully nervy Alice Englert). They check out romantic books from the library, study up the intricacies of courtship, and try to score an invitation to their teacher’s cottage to advance their plan. Except, when the rehearsals start in earnest and boys enter the duo’s orbit in after-school adventures, their already off-balance dual existence and sneaky one-upmanship worsens. Will Minna and Flic maintain their best-friend status against the odds?\n\n\tExploring an eager case of codependency, and later on, a heartbreaking instance of growing apart, a film like this requires utmost chemistry between the co-leads, an occasion Duggan and Clear rise to with ease. Establishing a rare closeness of the finishing-each-other’s-sentences kind, the duo truly embrace the immersive feeling of being one half of that singular, irreplaceably defining friendship of the teen years, one that often feels like a high-stakes romantic entanglement. \n\n\tThroughout the movie chaptered like a stage play, Manners captures the two actresses’ rhythms organically with an insightful and mischievously British sense of humor. Her perceptive lensing is especially poignant across wordless scenes where the two girls romance their teacher through longing gazes. (It’s also quite funny when Minna involuntarily makes a “longing” sound while reading about love, to Flic’s astonishment.) When they finally receive that coveted invitation to Miss Delavigne’s home with the pretense of researching their teacher’s motherland New Zealand, Manners follows the trio through a vigilant sense of awe and restraint, without ever sensationalizing the shocking occurrence that follows. \n\t\n\n\t“I’m stressed about everything and I don’t even know what any of it is,” Flic says early on in this infinitely quotable film that feels like a new high-school movie classic. In a way, her words also sum up what’s so wonderful about the searching spirit of “Extra Geography,” a film that mines reserves of tenderness in young female angst and cluelessness with loving empathy.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Extra Geography’ Review: Molly Manners’ Delightful Female Friendship Movie Shines With Original Wit and Disarming British Humor",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/ExtraGeography.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-24T02:45:00.000Z",
      "dateModified": "2026-01-24T02:45:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Firing Up ‘The Power Station’ for a 40th Anniversary Boxed Set: Duran Duran’s John Taylor on Coralling Robert Palmer and Members of Chic for a True Pop Supergroup",
    "url": "https://variety.com/2026/music/news/power-station-anniversary-john-taylor-supergroup-interview-1236639677/",
    "image": "https://variety.com/wp-content/uploads/2026/01/image-2.png?w=915&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-24T01:51:30.000Z",
    "description": "\n\tAs a founding member of Duran Duran, you wouldn’t think that much could surprise John Taylor.By 1984, each of the British new wave gods’ first three",
    "body": "\n\tAs a founding member of Duran Duran, you wouldn’t think that much could surprise John Taylor.By 1984, each of the British new wave gods’ first three albums had gone platinum, their cinematic videos were regularly rotated on MTV, and nonstop global touring attracted Swiftian levels of excitable fans. So, to get away from it all, and rock harder than the synth-pop-driven Duran Duran, bassist Taylor and his guitarist bandmate Andy Taylor hooked up with Chic drummer Tony Thompson, invited Chic bassist Bernard Edwards to produce, and brought in blue-eyed soul legend Robert Palmer to sing a few songs. The next thing Taylor knew, his sidepiece supergroup, the Power Station (named for the NYC studio), had racked up two Billboard Top 10 hits in “Some Like It Hot” and a cover of T. Rex’s “Get It On (Bang a Gong).” The group’s 1985 self-titled debut got to No. 6 on Billboard’s Top 200) and went platinum without even trying.\n\n\n\t“I was not, in annnnny way, prepared for that to happen,” says Taylor, from his home in Los Angeles, about the astonishment that was the success of the Power Station.\n\t\n\n\tTo quote one of Robert Palmer’s solo songs: “Some Guys Have All the Luck.”\n\n\tTaylor is on tour through the end of January with Duran Duran, which will soon release a deluxe version of its eponymously titled 1993 comeback record, oft-referred to as “The Wedding Album.” But the reason for our conversation is a well-deserved 40th anniversary edition of that famous side project, out today. Expanded into 4-CD and 2-LP packages, “The Power Station” comes complete with, among other extras, live rarities from their time with a second journeyman singer Michael Des Barres. (Palmer performed on stage with the Power Station just once, for “Saturday Night Live” in February 1985, then left the band shortly after their album came out the following month.) It also includes testimonies form Taylor paying respects to Power Station’s two late members, Palmer and Thompson, and their producer, Edwards.\n\n\tGoing back to before the start of the supergroup, Taylor recalls Duran Duran’s biggest moment with bittersweet reminiscence. “Collectively, psychologically, after ‘Seven and the Ragged Tiger’… that record was a bitch to make, something where we went in having to top to our massive second album (1982’s “Rio”) and show musical growth,” Taylor says, thinking of the heights of Duran-mania that accompanied their third album. “We had a huge, long arena tour where everything’s bonkers, and was truly the first time that we’d been exposed to such mass hysteria, internationally. To be honest, we were frazzled at tour’s end, to say the very least.”\n\t\n\n\n\n\t\n\n\t\t\t\t\tThe Power Station\n\t\n\n\n\n\tKnowing that, in 1984, the post-tour Duran Duran did not have another album in them, despite the urging of its management (“We gave them one new song, ‘The Wild Boys,’ for the live album ‘Arena'”), the quintet decided to take a break, yet make their time away from each other a working vacation.\n\n\t“Everything was changing within Duran,” Taylor notes of that band’s suddenly sweet smell of success, and the so-called “fork in the road” that brought about both the Power Station and Arcadia, Simon Le Bon and Nick Rhodes’ art-pop project with Roxy Music’s Andy Mackay.\n\n\t“Going back to the question of what was going on psychologically with Duran Duran then, things were complicated. It was the first time where we all had money; some of the guys got married; some of us began to develop outside relationships during that time off, most notably with Tony and Robert. Andy and I just broke off a bit from the others – we were like Thelma and Louise, off into the sunset, motherfuckers…. And with those two guys right there, Andy and I couldn’t resist doing something, something a little bit more organic, a little more muscular, a little less thought-out.”\n\n\tTaylor met Thompson around the time that his fellow Chic member Nile Rodgers had exploded with his first huge production outside of their disco ensemble, David Bowie’s “Let’s Dance” album. “Tony played on ‘Let’s Dance’ and Madonna’s ‘Like a Virgin’ (another Rodgers production) and his was a style of drumming that lit up the dance floor,” says the bassist, before adding that Thompson was the “real star” of the Power Station, the foundation upon which every other sound was built.\n\n\n\n\t\n\n\t\n\n\n\n\tIt was, however, another non-Duran relationship of the time that signaled the start of the Power Station project before it had a name: the one with model and Playboy Playmate Bebe Buell, who, at that moment, was John Taylor’s paramour. It was upon Buell’s urging that the bassist would back her on a crunching cover of 1971’s “Get It On.”\n\t\n\n\t“I was dating her at the tail end of that Duran tour. She was an artiste who’d already had a record out by that time (1981’s “Covers Girl” EP produced by Ric Ocasek and Rick Derringer), and I thought it could be fun producing something with her,” says Taylor, who went to his then-label, EMI, for backing. “They weren’t going to say ‘no,’ so we got the green light for studio time to develop the idea, then she and I fell out. But by then the horse was running, and Andy and I took the bit between our teeth…\n\n\t“Andy, Tony and I were going to be this rhythm section, despite not having played together as a unit at that point,” adds Taylor, talking about a “fantasy” of that trio of musicians backing various vocalists ,as if they were “a new version of the Stax house band.” The schematic of many singing cooks in one Power Station kitchen changed when their pal Robert Palmer stopped by the studio.“Robert came in, sang ‘Communication’ (a tune penned by the two Taylors and co-composer Derek Bramble, to which Palmer added lyrics), and asked about ‘Get It On.’ We put that track up next, and as soon as he finished singing, Bernard said that we’d need not look further for vocalists – that Robert was the perfect singer for this project. At that exact moment, the nature of the project changed.”Robert Palmer, by 1984, was a cooly composed, eclectic, British R&B-rock vocal legend — a “concessioner of many things,” by Taylor’s estimation — without having ever had a huge, continuous presence on the charts since his solo album debut with “Sneakin’ Sally Through the Alley” (1974).\n\n\t“Robert had a very dexterous voice and a clever lyrical style about him,” says Taylor.\n\n\tPalmer’s gritty but gracefully soulful singing prowess and fast way with a lyric brought a different energy to what the Taylors and Thompson had planned for the sessions. “We didn’t have a plan…. Didn’t really think it all out,” says the bassist. “Andy and I didn’t have, as our goal, to start another band. We just wanted to make cool music with Tony and Bernard. Suddenly, however, we had this other group. Fuck me, right? But it all sounded so incredible with Robert in the mix.”Suddenly, and quickly, the Power Station became an “antidote” to what Duran Duran had become at that time, where everything they did felt important and pre-planned, if not fussy. “It was nice to do something that wasn’t at all important,” Taylor says. “Actually, what we did was like we were having an affair from our marriage. And we knew that this affair wasn’t going to last. We were built to come together like a lightning flash, and pull off something unusual.”The album’s most thundering track, one that came together speedily, was Power Station’s biggest hit, “Some Like It Hot,” a Twin Taylor idea where Palmer immediately added the “sweat when the heat is on” lyrics after hearing the title.“The success of these songs was excess to expectation, as no one could anticipate the outcome, let alone the lot of us who made it,” says Taylor. “This project was driven solely by a desire to fuck, to rock – nothing contrived. It all started out as truly unconventional.” Taylor quickly credits the work of “the hottest engineer and mixer at that time, Jason Corsaro, from the hottest studio around, the Power Station,” as hugely beneficial to his band’s buoyant vibes.That drive – and this band’s muscular rock and funk sound – quickly pushed “The Power Station” up the charts following the March 1995 release, to the point they immediately scheduled a summer shed tour. That same sound was so crisp, cutting and, yes, commercial that Palmer suddenly took it as his own, and recorded 1985’s “Riptide” with producer Edwards, drummer Thompson and guitarist Taylor on his biggest-ever solo hit to date, “Addicted to Love.” Not long after “Riptide’s” release, Palmer left his longtime label, Island, for new digs at EMI, and a continuation of the crunch-rock-rhythm sound.\n\n\tPalmer bailed on the tour and split from the Power Station weeks after the album’s release. Taylor doesn’t sound angry at Palmer, now, for having jumped ship on the Power Station when he did.\n\n\t“Hey, Island made him a huge money offer at the time to deliver a new album on the heels of ours,” says the bassist. ”Look, we were blessed just to be able to make a record with Robert. He’s a great artist, a great collaborator, and should be in the Rock and Roll Hall of Fame. Robert just came into the studio, loosened his tie, and took off – he made it all look so easy.”\n\n\tTaylor makes sure to mention that Palmer’s Power Station tour replacement, Michael Des Barres, came nobly to their rescue when the already-booked 1985 Power Station summer tour and Live Aid appearance reared its head. “We started out as a band meant to have more than one singer, so why not,” says Taylor with a laugh. “Still, we needed a singer for this tour, so God bless Michael. \n\t\n\n\t“Everyone knew his reputation as an amazing singer and an underachiever who had two bands who were supposed to have been massive – Silverhead and Detective – that just didn’t happen. And it wasn’t as if he wasn’t current; he had just written that Animotion song ‘Obsession,’ which was a huge hit, and he was wide and alive. We found Michael in Texas hanging out with Don Johnson on a movie set, flew him into New York, he hit the mic, and immediately we knew that he just got it. Michael was perfect. He came in and embraced it.”\n\n\tTaylor says that listening to the never-before-released August 1985 live show that’s part of the new Power Station boxed set was something of a thrill, as he’d never heard the tapes prior to creating this 2026 collection. “I forgot that we’d had to fill out a two-hour set on that tour based on a Power Station album of just eight songs, so, sure, we did ‘Obsession.’ And of course, let’s do a Duran Duran song. Hey, let’s do two.”\n\n\tThe lesson John Taylor learned with the creation of the supergroup: there’s no place like home.\n\n\t“The idea of a supergroup was so everything not punk-rock, right?” says the bassist with a big laugh. “The Power Station started off as this unconventional thing, gained traction, and became more legitimate, more conventional. And by the end of its 1985 tour, I realized that I didn’t start the Power Station for the sake of convention, or even to have another band. I was already in a great band to start: Duran Duran.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Firing Up ‘The Power Station’ for a 40th Anniversary Boxed Set: Duran Duran’s John Taylor on Coralling Robert Palmer and Members of Chic for a True Pop Supergroup",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/image-2.png?w=915&h=563&crop=1"
      ],
      "datePublished": "2026-01-24T01:51:30.000Z",
      "dateModified": "2026-01-24T01:51:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Netflix Postpones Alex Honnold’s ‘Skyscraper Live’ Climb Due to Weather Concerns",
    "url": "https://variety.com/2026/tv/news/netflix-postpones-alex-honnold-skyscraper-live-weather-1236639657/",
    "image": "https://variety.com/wp-content/uploads/2026/01/P114KR87-e1769214851990.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-24T00:37:27.000Z",
    "description": "\n\tNetflix‘s “Skyscraper Live,” which is set to follow free solo climber Alex Honnold as he climbs the Taipei 101 tower in Taiwan, has been postponed b",
    "body": "\n\tNetflix‘s “Skyscraper Live,” which is set to follow free solo climber Alex Honnold as he climbs the Taipei 101 tower in Taiwan, has been postponed because of rain — and will move to Saturday night U.S. time (Sunday morning Taiwan time) instead.\n\n\t“Due to weather, we are unable to proceed with today’s SkyscraperLIVE event. It has been rescheduled for Saturday, January 24 at 8 p.m. ET / 5 p.m. PT,” the streamer said in a statement. “Safety remains our top priority, and we appreciate your understanding.”In a story posted earlier today by Variety, Plimsoll Prods. Ltd. CEO Grant Mansfield, Plimsoll head of adventure James Smith and Netflix unscripted VP Jeff Gaspin addressed the possibility of postponement due to weather.\n\t\n\n\tThe January date for the climb was chosen because it’s dry season in Taiwan right now — although rain was still possible, and the forecast was calling for a chance of moisture the morning Honnold starts his climb. Rain was expected right as “Skyscraper Live” was expected to kick off at 9 a.m. local time. So far, the forecast for tomorrow calls for conditions to be “sunny and pleasant” in Taipei, according to Accuweather.\n\n\n\t“If it is deemed too wet, if there’s too much moisture on the building, we will probably delay to the next day, which would be a Saturday night transmission in the U.S.,” Smith had told Variety. “We could even delay another day if we needed to. Obviously Alex has to be 100% comfortable and happy in himself and in the conditions. And then our safety team likewise have to.”\n\n\tGaspin had compared the live telecast window to “launching a space shuttle. We’ll be on site for a few days after if, for some reason he doesn’t go on that day,” he said. “But after that, it’s probably a bigger reschedule. There’s only certain times of year you can actually climb the tower because it’s rainy season between April and September.”\n\n\tSaid Mansfield: “He won’t be on that building unless we’re all comfortable. But there’s been a huge amount of planning for this. He said he’s the fittest he’s ever been. He’s really been training for this. We’ve gone to Taipei in the dry season, but there’s always a risk of a bit of rain. It’s a live event and anything can happen, and we can’t control the weather.”\n\t\n\n\tHonnold has become a well-known rock climber noted for his daring “free solo” feats of ascending cliffs without the help of any ropes or safety equipment. He was the subject of the Oscar-winning doc “Free Solo,” which chronicled his climb of El Capitan’s 3,000-foot “Freerider” route in Yosemite National Park.\n\n\tThe 2-hour “Skyscraper Live” will follow Honnold as he attempts to free solo the Taipei 101, a 101-story skyscraper that is the 11th tallest building in the world (and the tallest in Taiwan) at 1,667 feet. Plimsoll Prods. Limited, a part of ITV Studios, is producing the special. Al Berman is showrunner and executive producer of “Skyscraper Live,” while Honnold, Grant Mansfield, James Smith, Alan Eyres and Jonathan Retseck are also EPs. Joe DeMaio is director.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Netflix Postpones Alex Honnold’s ‘Skyscraper Live’ Climb Due to Weather Concerns",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/P114KR87-e1769214851990.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-24T00:37:27.000Z",
      "dateModified": "2026-01-24T00:37:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Renée Fleming Becomes Latest Star to Drop Out of a Kennedy Center Engagement",
    "url": "https://variety.com/2026/music/news/renee-fleming-exits-kennedy-center-engagement-1236639524/",
    "image": "https://variety.com/wp-content/uploads/2018/07/renee-fleming.jpg?w=1000&h=562&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-23T23:39:04.000Z",
    "description": "\n\tThe Kennedy Center has lost another one of the few remaining stars on its 2026 schedule, as the legendary soprano Renée Fleming has dropped out of a",
    "body": "\n\tThe Kennedy Center has lost another one of the few remaining stars on its 2026 schedule, as the legendary soprano Renée Fleming has dropped out of an appearance at the embattled venue previously scheduled for May.\n\n\tAlthough many of the musicians who have bowed out of appearances there have made note of the political toxicity that has made it difficult for name artists to fulfill their engagements, a notice on the Kennedy Center’s website blames her exit on an issue with her schedule\n\t\n\n\t“Renée Fleming regrets that, due to a scheduling conflict, she must withdraw from her May 2026 concerts with the NSO,” the notice reads. “A new soloist and repertoire will be announced at a later date, and the remainder of the program remains unchanged.”\n\n\n\tFleming was set to sing with the National Symphony Orchestra and conductor James Gaffigan.on May 29-30.\n\n\tFleming has a strong and recent connection to the center: She was celebrated with an award at the Kennedy Center Honors in 2023. That was prior to President Donald J. Trump taking it over as its chairman in a coup and replacing much of the board with his associates and friends at the beginning of 2025. She had previously served as “Artistic Advisor at Large,” but resigned from that role last year after the president and chair of the center were forced out.\n\n\tA representative for Fleming did not immediately respond to Variety‘s request for comment.\n\n\tOn Jan. 16, the Martha Graham Dance Company said it was withdrawing from performing at the center in April. “The Martha Graham Dance Company regrets that, for a variety of reasons, we are unable to perform at the Kennedy Center in April,” the company said in a statement. “We hope to perform at the center in the future.”\n\t\n\n\tAmong others who have pulled out of shows since the politicized takeover are Stephen Schwartz, a production of “Hamilton,” Béla Fleck, Rhiannon Giddens, Issa Rae, Sonia De Los Santos, the Cookers, Magpie, Kristy Lee, the comedy troupe Asian AF, Balún and one of the Kennedy Center’s anchor attractions for many decades, the Washington National Opera.\n\n\tFew big-name acts remain on the schedule for the rest of this year. The list of those still scheduled is led by right-leaning comic Adam Carolla, Jeff Foxworthy, Tony Hinchcliffe and R&B singer Tyrese.\n\n\tThe center’s president, Richard Grenell, who regularly tweets his conservative positions on Twitter, has gone after other performers who have pulled out, saying they are the ones politicizing the venue.\n\n\tWhen the banjo player Fleck canceled his appearance this month, he wrote, “I have withdrawn from my upcoming performance with the NSO at The Kennedy Center. Performing there has become charged and political, at an institution where the focus should be on the music. I look forward to playing with the NSO another time in the future when we can together share and celebrate art.”\n\n\tGrenell’s heated response: “You just made it political and caved to the woke mob who wants you to perform for only Lefties.”\n\n\tIn December, when jazz musician Chuck Redd canceled a New Year’s Eve appearance, Grenell sent him a letter saying he would be sued for $1 million in damages. There has been no subsequent indication that a lawsuit will be filed against any of the artists canceling shows.\n\n\tThe board recently voted to rename the facility the Trump-Kennedy Center, although many have argued that it would take an act of Congress to rename a national presidential memorial, so many continue to refer to it as simply the Kennedy Center, given questions over the legality of the name change.\n\n\tAudiences have been down since the Trump takeover, according to data acquired by the New York Times that showed single-ticket sales down 50%, and subscription revenue for theater down 82% and dance 57% during April and May of 2024 from the previous year.\n\n\tThe center’s current president and representatives have in turn pointed to $130 million in fundraising since Trump took over, along with $257 million approved by Congress and directed by the president toward building renovations.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Renée Fleming Becomes Latest Star to Drop Out of a Kennedy Center Engagement",
      "image": [
        "https://variety.com/wp-content/uploads/2018/07/renee-fleming.jpg?w=1000&h=562&crop=1"
      ],
      "datePublished": "2026-01-23T23:39:04.000Z",
      "dateModified": "2026-01-23T23:39:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Laura Adler, ‘American Dreams’ Casting Director, Dies at 65",
    "url": "https://variety.com/2026/tv/news/laura-adler-dead-american-dreams-1236639532/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Laura-Adler_Rosalie-Joseph-Humanitarian-Award.jpg?crop=0px%2C435px%2C3662px%2C2062px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-01-23T23:49:02.000Z",
    "description": "\n\tLaura Adler, a former Casting Society administrator and casting director, died on Thursday in Los Angeles following a brief illness. She was 65 year",
    "body": "\n\tLaura Adler, a former Casting Society administrator and casting director, died on Thursday in Los Angeles following a brief illness. She was 65 years old.\n\n\tFor 16 years, Adler worked as a casting director, and was involved with the casting for television shows including “Better Off Ted,” “Dream On,” “The Goode Family” and “American Dreams.” For the latter, Adler was nominated for a Primetime Emmy Award for Outstanding Casting in a Drama Series. Before becoming one herself, she assisted renowned casting directors Barbara Claman, Mark Saks and Ted Hann.\n\t\n\n\tOver more than four decades in the industry, Adler built a career in entertainment that was defined by her service, integrity and tireless advocacy; she became an original member of the steering committee to secure pension and health benefits for casting directors in 2005 and in 2014, she was hired as an administrator for the Casting Society. She held the position for a decade, serving and supporting the global casting community up until she retired from the role in 2024.  \n\n\n\tIn recognition of her tireless efforts and the impact her work had on the casting community, Adler will be receiving the Rosalie Joseph Humanitarian Award, given to those who have made outstanding contributions to humanitarian causes that have in turn supported the casting community. The award will be presented at the 41st Annual Artios Awards on Feb. 26 in Los Angeles. \n\n\tThe daughter of the late actor and director Jerry Adler, Adler was born and raised in New York City. Before transitioning into casting in 1989, she began working in television and film production in 1980. \n\t\n\n\tShe is survived by her sisters Alisa Adler, a talent agent at Paradigm; Emily Adler, a writer; Amy Adler; and nephew, Joe Adler. A memorial service will be announced at a later date.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Laura Adler, ‘American Dreams’ Casting Director, Dies at 65",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Laura-Adler_Rosalie-Joseph-Humanitarian-Award.jpg?crop=0px%2C435px%2C3662px%2C2062px&resize=1000%2C563"
      ],
      "datePublished": "2026-01-23T23:49:02.000Z",
      "dateModified": "2026-01-23T23:49:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chris Pine Tells Future ‘Star Trek’ Bosses to ‘Have Fun’ and ‘Good Luck’ With the Franchise: ‘Live Long and Prosper’",
    "url": "https://variety.com/2026/film/news/chris-pine-paramount-bosses-star-trek-1236639421/",
    "image": "https://variety.com/wp-content/uploads/2026/01/chris.pine_.png?crop=0px%2C39px%2C1614px%2C908px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-01-23T23:33:30.000Z",
    "description": "\n\tChris Pine is in the dark about the future of the “Star Trek” franchise. During a Sundance interview at the Variety Studio presented by Audible, the",
    "body": "\n\tChris Pine is in the dark about the future of the “Star Trek” franchise. During a Sundance interview at the Variety Studio presented by Audible, the actor was asked about Paramount’s new leadership and what they have in store for the space franchise. The answer was simple: “You probably know more than I do.”\n\n\tAs Variety reported last year, Jonathan Goldstein and John Francis Daley, the duo behind the Pine-starring “Dungeons & Dragons: Honor Among Thieves” are writing, producing and directing a new “Star Trek” film that will seek to revitalize the franchise. The new film will not be a continuation of the J.J. Abrams-led reboot of the series and won’t feature Pine, who played Captain Kirk in three “Star Trek” movies between 2009 and 2016.\n\t\n\n\tWhen asked if he had any advice for the new Paramount leadership in regards to “Star Trek,” Pine answered: “Advice? Have fun, good luck, live long and prosper.”\n\n\tPine opened the 2026 Sundance Film Festival with “Carousel,” a romance drama co-starring Jenny Slate and directed by Rachel Lambert. Pine stars in the film as a single father whose life is upended by the reemergence of his high school ex. \n\n\t“Many a male character in film and in life… there is a difficulty for men to communicate feelings with clarity. He struggles with that,” Pine said about his character, noting how Slate’s ex-girlfriend “allows him in the messiest way to confront these feelings and purge them out of the system.”\n\n\tSlate added of the film, “I was so excited by Rachel’s script for many reasons, but I think it’s a real opportunity when you get a full interiority. That makes for good drama. I started in comedy because it’s the easiest way to deal with my shadow, but not because I don’t have one. Now to sort of grow up into my adulthood as performer and to confront it straight on… I saw that opportunity in this script.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chris Pine Tells Future ‘Star Trek’ Bosses to ‘Have Fun’ and ‘Good Luck’ With the Franchise: ‘Live Long and Prosper’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/chris.pine_.png?crop=0px%2C39px%2C1614px%2C908px&resize=1000%2C563"
      ],
      "datePublished": "2026-01-23T23:33:30.000Z",
      "dateModified": "2026-01-23T23:33:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "In ‘Buddy,’ A Cuddly Unicorn Kills Kids Trapped in His TV Show. ‘Too Many Cooks’ Creator Casper Kelly Breaks Down His New Pop Culture Nightmare",
    "url": "https://variety.com/2026/film/features/buddy-casper-kelly-killer-barney-parody-1236638704/",
    "image": "https://variety.com/wp-content/uploads/2026/01/BUDDY-Key-Still.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-23T22:52:53.000Z",
    "description": "\n\tCasper Kelly says his love of analyzing and dissecting pop culture started when he was very young.\n\n\t“Back in the day, they had Mad Magazine, which ",
    "body": "\n\tCasper Kelly says his love of analyzing and dissecting pop culture started when he was very young.\n\n\t“Back in the day, they had Mad Magazine, which had movie parodies and would deconstruct the movies, even the adult movies I couldn’t watch,” Kelly says. “I remember trying to make my own fake movie parodies with comics, although I don’t really consider what I do parodies. But I like having a structure that I can break in a surprising way.”\n\t\n\n\tSome of Kelly’s boldest projects have taken well-trodden tropes and run them through a series of funhouse mirrors, until they’re jagged and nearly unrecognizable. His 2015 Adult Swim viral sensation “Too Many Cooks” mimicked the seemingly endless opening credits of sitcoms, which got more and more surreal until a madman was let loose in the meta world. His sneaky 2022 feature “Adult Swim Yule Log” was a surreal parody of slasher films, and the sequel (2024’s “Branchin’ Out”) was an outrageous take on Hallmark holiday romances. \n\n\n\tHis newest work, “Buddy,” which debuted Thursday night at Sundance as part of the Midnight program, directly takes on Barney the dinosaur, recontextualizing the much-maligned ’90s kid show as a trap for children, who are killed by the titular unicorn if they step out of line or question their reality. The tactile sets of the world inside the TV show recall kids’ fare ranging from “Pee-wee’s Playhouse” to “Dora the Explorer.” The initial idea was pitched to Kelly, but initially, he was concerned it might draw too many comparisons to recent kids’ characters-gone-psycho films.\n\n\t“It came from JD Lifshitz, one of the heads at BoulderLight Pictures, who was interested in doing some kind of horror movie in a world with a character like Barney,” Kelly says. “I felt like that territory had been trodden a bit with ‘Five Nights at Freddy’s’ or ‘The Banana Splits Movie’ or ‘Willy’s Wonderland.’ But when I hit on the idea of them being trapped in a TV show, that was interesting to me. I did an interview with SpectreVision, Elijah Wood and Daniel Noah’s production company, once, and they said, ‘Everything you’ve done has the theme of being trapped.’ It had never occurred to me, but now I keep thinking about it, and I forget about it. After the movie, I’m like, ‘Well, I’ll be damned. It’s about being trapped again.'”\n\t\n\n\tAlthough “Buddy,” which Kelly co-wrote with Jamie King, is thematically linked to his work, it definitely has the opportunity to bring in a bigger audience. Key roles are filled by stars like Keegan-Michael Key, Michael Shannon and Cristin Milioti, and while it is definitely one of the most ambitious and strange movies at Sundance, it’s easy to see it being a crowd-pleasing hit for those looking for something off the beaten path, which is new territory for a cult favorite like Kelly.\n\n\t“This movie had financiers and a lot of creative producers who want this to be a theatrical movie,” he says. “Part of their aim is steering it in a way where it has my weirdness, but also perhaps is more accessible than some of my other work meant for late night at Adult Swim. So it’s trying to keep that blend, and I think we succeeded.”\n\n\tWhile Kelly has sharpened his voice on scores of TV and film projects, he says that “Buddy” expanded his horizons and made him even more excited to tackle future projects.\n\n\t“I learned so much on this movie,” he says. “For example, our DP Zach Kuperstein, who also worked on ‘Barbarian,’ has a very interesting process for blocking scenes and doing the shot list that involves outdated software that is in danger of not being updated anymore. I feel like I got a lot better at blocking scenes, rather than just doing the normal comedy ‘over the shoulder, wide shot’ and things like that. You can keep practicing and trying to get better, but every scenario is new. But it’s so addictive, and I want to make so much stuff. I’m just so excited.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "In ‘Buddy,’ A Cuddly Unicorn Kills Kids Trapped in His TV Show. ‘Too Many Cooks’ Creator Casper Kelly Breaks Down His New Pop Culture Nightmare",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/BUDDY-Key-Still.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-23T22:52:53.000Z",
      "dateModified": "2026-01-23T22:52:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Music Industry Moves: Death Cab for Cutie Sign with Anti-, My Morning Jacket Ink With CAA, BMI Names Todd Horvath President/COO, Primary Wave Music Ups Lexi Todd to Deputy COO",
    "url": "https://variety.com/2026/music/news/universal-music-netease-announce-licensing-deal-for-china-1236636087/",
    "image": "https://variety.com/wp-content/uploads/2026/01/DCFC_Press-Photo-1_-Credit_-Ryan-Russell.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-23T23:05:00.000Z",
    "description": "\n\tAfter 20 years with Atlantic Records and two platinum albums, veteran indie-rock outfit Death Cab for Cutie have joined the ANTI- Records family for",
    "body": "\n\tAfter 20 years with Atlantic Records and two platinum albums, veteran indie-rock outfit Death Cab for Cutie have joined the ANTI- Records family for future music releases, joining a roster that includes Tom Waits, MJ Lenderman, Fleet Foxes, Waxahatchee, and more. The band will tour North America beginning in July.\n\n\t“We are thrilled to be joining the roster at ANTI- which includes some of our favorite artists, old friends and in many cases, both,” says frontman Gibbard. “We also can’t wait to begin this new chapter with the wonderful staff at ANTI- and share with you what we’ve been working on.” \n\t\n\n\t+ Veteran rockers My Morning Jacket have signed with CAA, following the release last year of their ninth studio album, “Is.” In separate CAA news, Beth Morton has joined as an agent in the Global Touring department. Morton will be based in CAA’s London office, where she will focus on representing artists on the agency’s international country and Americana rosters, among other genres. as well as signing new acts. She joins from UTA.  \n\n\n\t+ BMI has announced the appointment of Todd Horvath as president and chief operating officer, effective January 26. In this new role, Horvath will report to BMI CEO Mike O’Neill and, according to the announcement, will oversee the company’s ongoing efforts to modernize its platforms, identify new sources of revenue and improve the affiliate experience at BMI. He will divide his time between BMI’s Nashville and New York offices. He joins BMI from Equifax, where he served as President of U.S. Information Solutions, and earlier roles at Fiserv and ADP. His appointment will enable O’Neill, who recently extended his contract through 2029, to continue to focus on the strategic vision of the company.\n\t\n\n\t“I’m excited to welcome Todd to BMI as we build upon the many efforts we’ve undertaken over the past three years to create long term value for our affiliates,” said O’Neill. “Todd’s unique skill set is a perfect complement to our team, and I look forward to his contributions as we continue to drive growth and position BMI for the future.”\n\n\t+ Primary Wave Music has announced the promotion of Alexandria “Lexi” Todd to the newly created role of Deputy Chief Operating Officer. According to the announcement, she will continue to run point on select music acquisitions while her new role sees her assisting COO Ramon Villa in the day-to-day acquisitions for Primary Wave’s pipeline of catalogs, as well as taking on a management role on several operational matters in an effort to improve efficiency. She will continue to be based out of Primary Wave’s New York office.\n\n\tVilla says, “I have had the pleasure of working with Lexi continuously from the first days of her starting as an intern. Her mix of dedication, smarts, initiative, creative instinct, and empathy is incomparable and I am so very happy to have her alongside as we continue our path.”\n\n\t+ HXOUSE, cofounded by La Mar Taylor and Abel “the Weeknd” Tesfaye, has struck a partnership with Pittsburgh’s Point Park University, designed to provide innovative creative education for aspiring artists. Taylor cofounded XO Records with the Weeknd and has served as the artist’s longtime creative director. The program is funded, in part, through support from the Heinz Endowments, Community Bank, Clair Global and the PA Department of Community & Economic Development.\n\n\tThe first cohort of 50 students will take part in the Creative Direction Credential Program beginning in March. Consisting of four workshops, the program is designed by today’s creative directors working in live entertainment, music and fashion. The first workshops will be led by Charm La’Donna, known for her creative work with superstars such as the Weeknd, Kendrick Lamar and Dua Lipa.\n\n\t“It was immediately clear that HXOUSE would be a perfect partner for Point Park, in part because of shared values around experiential, affordable higher education,” said Point Park President Dr. Chris W. Brussalis, President of Point Park. “Both HXOUSE and Point Park also understand that, now more than ever, innovation and adapting to change is critical for the long-term success of universities.”\n\t\n\n\t+ Electric Feel Entertainment has hired Channing Mitzell as VP of digital marketing. He joins from Artist Partner Group and previously held roles at CAA Nashville, Downtown Artist & Label Services and Hills Artists.\n\n\t“Channing brings a thoughtful, artist-first approach to marketing that aligns perfectly with where EF Records is headed. We’re excited to have him on board and to see what he builds” shared Austin Rosen, Founder & CEO of Electric Feel Entertainment.\n\n\tWednesday, Jan. 21\n\n\tVerve Records has announced a slate of archival and new music releases and events to celebrate the iconic jazz label’s 70th anniversary. Founded in 1956 to showcase Ella Fitzgerald’s talents, over the years the label has been a home for such legendary artists as Louis Armstrong, Billie Holiday, Stan Getz, Bill Evans, Herbie Hancock, Nina Simone, Diana Krall, Frank Zappa and the Velvet Underground, as well as contemporary artists like Grammy favorites Jon Batiste and Samara Joy and edgier talents such as Arooj Aftab and Kurt Vile.\n\n\n\n\n\tKicking off the anniversary releases will be a special previously unreleased 1960 live recording from Oscar Peterson, “Live at Baker’s Keyboard Lounge,” out on April 17. On May 22 — almost 70 years to the day it was first released — will be a re-release of the classic “Ella Fitzgerald Sings the Cole Porter Songbook,” the first Verve album ever released. There will be more live and new music releases from Louis Armstrong, Nina Simone, and others, and the Verve Vault and Verve Record Club will also host an exciting slate of releases throughout the year, as will the audiophile Verve Acoustic Sound Series.\n\n\tFinally, throughout the month of March, Verve is partnering with Devon Turnbull (aka OJAS) as part of the HiFi Pursuit Listening Room Dream No. 3 at the Cooper Hewitt, Smithsonian Design Museum in New York, with an exclusive playback of Verve titles on Turnbull’s large scale, handmade audio system, including curated events with key programmers.\n\n\t+ Giant Records, the label relaunched in 2023 by Irving Azoff’s media and entertainment company, will receive a strategic investment from Concord and, relatedly, will be partnering with Concord-owned Stem for global distribution, the companies announced Wednesday. Financial details were not disclosed in a press release, but the announcement stressed that Giant will maintain “full creative and operational autonomy.” The distribution deal will help provide Giant “with the infrastructure, expertise, and hands-on execution needed to scale.” Giant’s roster includes Cash Cobain, Mike Will Made-It and Empress Of, among others.\n\t\n\n\t+ SoundCloud has promoted Maurice Slade to head of music for the streaming platform, the company announced on Wednesday; he was previously head of marketing and artist relations, joining SoundCloud after stints at Epic Records, Roc Nation and Universal Motown.\n\n\t“Maurice has a deep understanding of artists, culture, and how careers are actually built,” said CEO Eliah Seton. “He brings deep credibility in music, sharp strategic instincts, and a clear point of view on how platforms can serve artists without compromising creativity.”\n\n\t+ Entertainment law firm Myman Greenspan Fox Rosenberg Mobasser Younger & Light has named Audrey Benoualid as the firm’s youngest equity officer. Benoualid works on catalog acquisitions, touring, publishing, brand partnerships, merchandise agreements and recorded music for artists including Tate McRae and Sevdaliza, among others, as well as producers and songwriters including Brett McLaughlin, Mags Duval and Annie Schindel. She was included on Variety’s list of Hollywood’s New Leaders in 2023.\n\n\t+ Richard Burgess, who recently retired as head of independent music association A2IM after a decade in the role, has joined forces with his son Ace Burgess (previously VP of engineering at TuneCore) on a pair of companies they will be running together: AudioNumber and Interline Media Group.\n\n\tAudioNumber is a data intelligence platform intended to help “catalog acquisition funds and music companies identify undervalued assets and optimization opportunities,” according to the announcement, while Interline is designed as a publishing administration platform that uses AudioNumber’s features to help refine and maximize royalty collection. The company says it began signing artists in May 2025 and has “recovered tens of thousands in previously uncollected royalties for clients,” among other metrics.\n\n\t+ IBM’s enterprise and data platform, Watsonx, is working with the Recording Academy on three initiatives aimed at both fans and Academy Members.\n\n\tThe first is Grammy IQ, which will serve up AI-powered quizzes for fans and be available on the Recording Academy’s “digital channels,” according to the announcement. The second, Musical Crossroads, will be an interactive experience viewable at the Grammy Museum in Los Angeles, intended to foster deeper contextual engagement with the music industry for attendees.\n\t\n\n\tFinally, the Academy and IBM are working on enhancements to the “digital processes” that Recording Academy members use to interact with the institution. “This includes reimagining the member portal and offering translations in four additional languages,” according to the announcement.\n\n\t+ Publishing giant Kobalt has signed II, drummer for the shadowy English metal band Sleep Token. “With so many Sleep Token fans already at Kobalt, it’s an honor for us all to protect and serve the songs,” said Kobalt’s Kenny McGoff.\n\n\tTuesday, Jan. 20\n\n\tUniversal Music Group and NetEase Cloud Music, a leading music streaming service provider in China, have announced a strategic multi-year license agreement for UMG’s world-leading music catalog of artists and recordings across NetEase Cloud Music’s streaming platform and associated digital services in China.\n\n\tUnder the agreement, NetEase Cloud Music will distribute UMG’s global recording catalog across its streaming services and affiliated digital products. The catalog includes both local Chinese and international artists that are signed, released and distributed by UMG’s labels.\n\n\tThis strategic agreement will also see the companies collaborate on feature marketing campaigns and product innovation, and “artist-centric” provisions and terms covering artificial intelligence reflecting a shared commitment to responsible AI practices.\n\n\tIn making the announcement, William Ding, CEO of NetEase Cloud Music, said: “NetEase Cloud Music is very pleased to have reached a multi-year licensing agreement with UMG. With the largest user base globally, China stands as the world’s biggest music streaming market. Moving forward, we will continue to work hand in hand with UMG to deliver premium music experiences to our users in China. At the same time, we look forward to exploring even more diverse and multifaceted avenues of collaboration with UMG.”\n\n\tAdam Granite, Executive Vice President, Market Development, Universal Music Group, said: “This renewed agreement with NetEase Cloud Music represents a meaningful step in deepening UMG’s long-term commitment to China’s music market. Together, we aim to strengthen an artist-first streaming environment that supports creators, engages fans, and connects China’s music market more closely with the global music industry.”\n\t\n\n\t+ YeaH1 Group and Sony Music have announced the launch of SYE Holdings, a joint venture through which the two companies “are committed to creating a sustainable path for Vietnamese artists and propelling Vietnamese culture onto the world stage,” according to the announcement. The goal of the partnership is to help establish a “direct pipeline” for V-Pop artists to access international charts and regional playlists, as well as the advertising, film, and entertainment sectors.\n\n\tImmediately following the partnership announcement, SYE Holdings officially launched its first major project, introducing the boy group Uprize, described as “Vietnam’s first idol boy group to debut immediately from the survival reality show ‘Tan Binh Toan Nang’ (‘Show It All’).”\n\n\tKenny Ong, managing director for SME Malaysia, Singapore & Vietnam, says, “Sony Music is dedicated to honoring the unique cultural heritage of the markets we enter. Our strategy is to build a ‘viable model’ for our artists’ sustainable careers, where Vietnamese cultural identity is honored and built upon. By integrating local creativity into Sony Music’s world-class network, we are ensuring that Vietnamese talent has the sustainable career path and international visibility it deserves.”\n\n\tNgo Thi Van Hanh, CEO of YeaH1 Group, adds, “YeaH1 contributes three essential resources to SYE: a deep understanding of local audiences, international-standard production capabilities, and a multi-platform media ecosystem. When these values resonate with Sony Music Entertainment’s global network, we are not only establishing new standards but also creating a sustainable infrastructure for Vietnamese talent to proudly step out into the world with their own identity.”\n\n\t+ Goldenvoice has announced that talent buyer Luke Hanna has joined the company’s San Francisco office. He returns to the company after booking shows at the Regent Theatre, the Belasco, and third-party theaters in Los Angeles. Based in San Francisco and reporting to SVP, Talent at Goldenvoice Danny Bell, Hanna joins the booking team for the Warfield and the Regency Ballroom, in addition to other Bay Area events.\n\n\t“We’re excited to welcome Luke back to Goldenvoice,” Bell says. “He’s built a strong track record booking shows in LA, and we’re confident he’ll be a key contributor as we continue to grow our presence in the Bay Area.”\n\t\n\n\t+ AEG Presents has elevated and added four members to its Global Touring division. Caleb Merrell and Laurel Hilburn, previously serving as tour directors, have been elevated to senior tour directors. Previously a tour marketer at Live Nation, Ryan Erickson joins AEG Presents as senior director of marketing; previously a senior project manager at Paramount, Emily Harenza will now serve as director, digital marketing.\n\n\tMerrell and Hilburn will be based in Nashville, with Merrell reporting to SVP of Production & Direct Support, Jonathan Baden and Hilburn reporting to SVP of Touring, Jenny Heifetz Henault. Erickson will be based in Los Angeles and report to SVP of Marketing & Artist Development, Rich Holtzman, and Harenza will be based in the AEG Presents New York office, reporting to Sr Director of Marketing Victoria Cappelli Greiner.\n\n\tCommented President of Global Touring at AEG Presents, Rich Schaefer, “Laurel and Caleb have played integral roles in our touring operation, and we’re proud to promote them to Senior Directors. We’re equally excited to welcome Ryan and Emily’s expertise to the marketing team, a group that continuously innovates in service of our artists and their tours.” \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Music Industry Moves: Death Cab for Cutie Sign with Anti-, My Morning Jacket Ink With CAA, BMI Names Todd Horvath President/COO, Primary Wave Music Ups Lexi Todd to Deputy COO",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/DCFC_Press-Photo-1_-Credit_-Ryan-Russell.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-23T23:05:00.000Z",
      "dateModified": "2026-01-23T23:05:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "TMZ Sports Streaming Live From Newsroom, Join The Conversation!",
    "url": "https://www.tmz.com/2026/01/23/tmz-sports-live-stream/",
    "image": "https://imagez.tmz.com/image/90/16by9/2026/01/23/90db9407ee1c49e483869ab28dcf6e59_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-23T20:55:11.000Z",
    "description": "\n    \n                    \n                          TMZ Sports Live Stream\n                          Join The Conversation!!!\n                      \n",
    "body": "\n    \n                    \n                          TMZ Sports Live Stream\n                          Join The Conversation!!!\n                      \n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          TMZ Sports is going live from the newsroom to discuss the day's biggest stories ... but we don't just want folks to watch and enjoy the conversation, we want y'all to get involved!!\n      \n    \n          Hit the comment section as Babcock, Lucas, Dylan, Luca, and the whole crew break down the most important topics of the day ... and we'll be interacting with viewers throughout the program between 1 and 2 PM PT.\n      \n    \n          YouTube, X, TikTok ... we're everywhere.\n      \n    \n          So tune in, make fun of us, share your two cents, sound off about your favorite team ... nothing is out of bounds.\n      \n    \n          Friday's show will feature Brett Favre's comments on Matthew Stafford, Sean Payton's former player weighing in on the Broncos, LeBron James' latest comments and much more!!\n      \n      \n              \n          \n                          \n                TMZ Sports\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "TMZ Sports Streaming Live From Newsroom, Join The Conversation!",
      "image": [
        "https://imagez.tmz.com/image/90/16by9/2026/01/23/90db9407ee1c49e483869ab28dcf6e59_xl.jpg"
      ],
      "datePublished": "2026-01-23T20:55:11.000Z",
      "dateModified": "2026-01-23T20:55:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Alessandra Ambrosio Gets Extra Flexible",
    "url": "https://www.tmz.com/2026/01/23/alessandra-ambrosio-flexible-pics/",
    "image": "https://imagez.tmz.com/image/de/16by9/2026/01/23/dea84d8b3ebf4700becb058338ffe378_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-23T20:05:42.000Z",
    "description": "\n    \n                    \n                          Alessandra Ambrosio\n                          Namast-Dayum!!!\n                      \n      \n    \n",
    "body": "\n    \n                    \n                          Alessandra Ambrosio\n                          Namast-Dayum!!!\n                      \n      \n    \n      \n        \n              \n    \n    \n          Here's Alessandra Ambrosio doing some downward dog ... and upward WOW!!!\n      \n    \n          The supermodel slipped her slender frame into some yoga pants and a matching pink top, showing off her flexible body ... and the photos will make your jaw drop.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Looks while Alessandra did some meditation too ... only she can make deep thought a must-see moment for the rest of us.\n      \n\n          We gotta say ... Alessandra is still smoking hot as she goes through her mid-40s ... friendly reminder that age is just a number.\n      \n    \n          Check out the gallery to see all the sexy snaps! Once you're done pickin' your jaws off the floor, can you track down the words below?\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Alessandra Ambrosio\n              \n                          \n                TV\n              \n                          \n                Hotties & Bodies\n              \n                          \n                Hot Bodies\n              \n                          \n                Movies\n              \n                          \n                Photo Galleries\n              \n                          \n                Models\n              \n                          \n                Health & Fitness\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Alessandra Ambrosio Gets Extra Flexible",
      "image": [
        "https://imagez.tmz.com/image/de/16by9/2026/01/23/dea84d8b3ebf4700becb058338ffe378_xl.jpg"
      ],
      "datePublished": "2026-01-23T20:05:42.000Z",
      "dateModified": "2026-01-23T20:05:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Courtney Stodden Sizzles in Bikini For New Hair Style Debut",
    "url": "https://www.tmz.com/2026/01/23/courtney-stodden-sizzles-bikini-new-hair-color/",
    "image": "https://imagez.tmz.com/image/1c/16by9/2026/01/24/1c19563cddb44eec892b41f551fb9138_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-24T00:44:22.000Z",
    "description": "\n    \n                    \n                          Courtney Stodden\n                          Eyes Up Here ...\n                          My Hairdo C",
    "body": "\n    \n                    \n                          Courtney Stodden\n                          Eyes Up Here ...\n                          My Hairdo Changed!!!\n                      \n                  \n                                                                        Published \n                              January 23, 2026\n                            4:44 PM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Courtney Stodden is making some big changes three weeks into a new year ... and, you guessed it, it's a cosmetic one.\n      \n    \n          The influencer hopped on social media Friday and posted a thirst trap of her in a skimpy bikini on the beach, showing off her new feature ... dark hair.\n      \n    \n        Waiting for your permission to load the Instagram Media.\n      \n    \n          Courtney's mostly been blonde since she's been a public figure ... but she's switched things up here and gone many shades darker.\n      \n\n          She captioned the snap, \"New year! New hair!\"\n      \n    \n          The hair color is different, but Courtney's sex appeal remains unchanged ... she knows how to command attention and fish for compliments.\n      \n    \n          Courtney also shared the post on her Instagram Story and added some music ... going with Rihanna's \"Kiss it Better.\"\n      \n    \n          Who says blondes are the only ones who can have fun?!?\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Courtney Stodden\n              \n                          \n                Social Media\n              \n                          \n                Hotties & Bodies\n              \n                          \n                Hot Bodies\n              \n                          \n                Photo Galleries\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Courtney Stodden Sizzles in Bikini For New Hair Style Debut",
      "image": [
        "https://imagez.tmz.com/image/1c/16by9/2026/01/24/1c19563cddb44eec892b41f551fb9138_xl.jpg"
      ],
      "datePublished": "2026-01-24T00:44:22.000Z",
      "dateModified": "2026-01-24T00:44:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Indonesian Influencer Lula Lahfah Found Dead at 26",
    "url": "https://www.tmz.com/2026/01/23/lula-lahfah-indonesian-influencer-dead/",
    "image": "https://imagez.tmz.com/image/c9/16by9/2026/01/23/c9648983634b4a7dbe2afee8de3122fe_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-23T19:37:27.000Z",
    "description": "\n    \n                    \n                          Lula Lahfah\n                          Indonesian Influencer Dead at 26\n                      \n   ",
    "body": "\n    \n                    \n                          Lula Lahfah\n                          Indonesian Influencer Dead at 26\n                      \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Tragic news out of Indonesia -- popular internet personality Lula Lahfah has died at the age of 26.\n      \n    \n          The influencer was found dead Friday evening inside an apartment building in the Dharmawangsa neighborhood of South Jakarta, according to security officers at the scene.\n      \n    \n          The news was confirmed by a Metro Jaya Police spokesperson, who said South Jakarta Police are still processing the crime scene and coordinating with Lula’s family as the investigation continues.\n      \n\n          CNN reports Lula had been dealing with several health issues and even spent New Year’s in the hospital for physical discomfort she was experiencing.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Lahfah had more than 3.3 million followers across IG and TikTok, where she shared lifestyle and beauty content ... her final post went up just two days ago, on January 21.\n      \n    \n          Her BF, Reza Oktovian of the band Weird Genius, canceled a scheduled show Friday -- just hours before news of Lula’s death became public.\n      \n    \n          She was 26.\n      \n    \n          RIP\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Social Media\n              \n                          \n                RIP\n              \n                          \n                Celebrity Death\n              \n                          \n                Viral\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Indonesian Influencer Lula Lahfah Found Dead at 26",
      "image": [
        "https://imagez.tmz.com/image/c9/16by9/2026/01/23/c9648983634b4a7dbe2afee8de3122fe_xl.jpg"
      ],
      "datePublished": "2026-01-23T19:37:27.000Z",
      "dateModified": "2026-01-23T19:37:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Harry Styles Did the Majority of His Own Stunts in 'Aperture' Music Video",
    "url": "https://www.tmz.com/2026/01/23/harry-styles-does-his-own-stunts-aperture/",
    "image": "https://imagez.tmz.com/image/62/16by9/2026/01/23/6207ae021fec4019b68d6e4546105e82_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-24T00:20:16.000Z",
    "description": "\n    \n                    \n                          Harry Styles\n                          Went Full Tom Cruise in 'Aperture' Music Vid Shoot!!!\n    ",
    "body": "\n    \n                    \n                          Harry Styles\n                          Went Full Tom Cruise in 'Aperture' Music Vid Shoot!!!\n                      \n                  \n                                                                        Published \n                              January 23, 2026\n                            4:20 PM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Harry Styles wasn’t just hitting his marks and showing off his dance moves in the music video for his newly released single “Aperture\" ... he was taking hits too!\n      \n    \n          A production source tells TMZ ... Harry personally handled the majority of the action stunts seen in the visually intense video -- including a gnarly staircase fall that took hours to nail ... roughly six hours and multiple takes to get right.\n      \n    \n          We’re told the shoot went down over three days -- following a full week of rehearsals -- with filming centered at the Westin Bonaventure Hotel in Downtown Los Angeles ... famously known as the filming location of \"True Lies,\" \"Blade Runner,\" and Billie Eilish's \"Birds of a Feather\" music video.\n      \n\n          Of course, production wasn’t about to risk damaging Harry’s moneymaker. Our source says the crew built a “soft staircase” specifically for insert and close-up shots, protecting Harry’s face while he fully committed to the falls.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          In a fun behind-the-scenes twist, Harry also “pulled a Taylor Swift” on set ... meaning he never played the song during filming. According to our source, watching the finished video was actually the first time cast and crew heard the track.\n      \n    \n          As for working with the global superstar ... we’re told it was nothing short of a dream, and that Harry was a total gentleman, always on time, an absolute pleasure on set.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          As we've previously reported, days before this new hit single dropped, Harry officially announced his 2026 “Together, Together” tour, with international dates and a residency run that includes 30 nights in New York City ... a move that’s already got fans scrambling for tickets.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Harry Styles\n              \n                          \n                Celebrity News\n              \n                          \n                Music Business\n              \n                          \n                Exclusive\n              \n                          \n                Music\n              \n                          \n                Music Videos\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Harry Styles Did the Majority of His Own Stunts in 'Aperture' Music Video",
      "image": [
        "https://imagez.tmz.com/image/62/16by9/2026/01/23/6207ae021fec4019b68d6e4546105e82_xl.jpg"
      ],
      "datePublished": "2026-01-24T00:20:16.000Z",
      "dateModified": "2026-01-24T00:20:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]