[
  {
    "title": "Donald Trump Returns to ’60 Minutes’ for First Interview After Suing CBS News",
    "url": "https://variety.com/2025/tv/news/donald-trump-60-minutes-interview-1236567302/",
    "image": "https://variety.com/wp-content/uploads/2025/10/trump-60-minutes-interview.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-31T22:11:22.000Z",
    "description": "\n\tPresident Trump will sit down for an interview on CBS’ “60 Minutes,” his first since suing the network last year in a case that ended with its paren",
    "body": "\n\tPresident Trump will sit down for an interview on CBS’ “60 Minutes,” his first since suing the network last year in a case that ended with its parent company Paramount Global agreeing to pay a $16 million settlement. It will also mark Trump’s first appearance on the network since Paramount was acquired by David Ellison’s Skydance Media, and since the company acquired The Free Press and named its founder, Bari Weiss, editor-in-chief of CBS News.\n\t\n\n\tTrump is being interviewed by network correspondent Norah O’Donnell in Florida on Friday afternoon, a network spokesperson confirmed to Variety.\n\n\n\tThe booking represents a mending of a rift between Trump and CBS News. A month prior to the 2024 election, the Trump campaign turned down an offer to be interviewed by “60 Minutes” under the argument that it would not accept interruptions due to fact-checking. \n\n\n\tHis opponent, Democratic nominee Kamala Harris, accepted a “60 Minutes” interview, in turn spurring a lawsuit against CBS News filed by Trump just days before the 2024 election. The filing alleged that “60 Minutes” tried to mislead voters by airing two different edits of remarks made in the interview with Harris.\n\n\tThough CBS and legal experts initially characterized the case as “meritless” and the company sought to have it thrown out, Paramount Global opted to pay $16 million towards Trump’s “presidential library” in July. The settlement came as Skydance Global sought to seek approval from the Trump-appointed leadership of the Federal Communications Commission for its acquisition of Paramount — a deal that has since closed.\n\t\n\n\tSince Ellison’s takeover of Paramount, the company has raised eyebrows for seeming to appease conservative audiences, particularly with CBS News anointing Weiss, who forged her brand as a columnist arguing against progressive politics.\n\n\tFor his part, Trump has voiced his approval of Paramount’s new direction.\n\n\t“[Oracle chairman] Larry Ellison is great, and his son David is great. They’re friends of mine. They’re big supporters of mine,” Trump told reporters on Air Force One in October. “They will make the right decisions. They’re going to revitalize CBS — hopefully, they’ll bring it back to its former glory. … It’s got great potential. CBS has great potential.” Following the Weiss hiring at CBS News, Trump told CNN, “I don’t expect them to become like Fox [News]. Just fair.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Donald Trump Returns to ’60 Minutes’ for First Interview After Suing CBS News",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/trump-60-minutes-interview.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-31T22:11:22.000Z",
      "dateModified": "2025-10-31T22:11:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Taylor Swift Fans Rally to Support Food Banks as SNAP Benefit Cuts Loom",
    "url": "https://variety.com/2025/music/news/taylor-swift-fans-support-food-banks-snap-benefit-cuts-1236567329/",
    "image": "https://variety.com/wp-content/uploads/2025/10/2-Split-3x2-3.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-31T23:32:37.000Z",
    "description": "\n\tTaylor Swift fans are putting their mobilizing skills to work to support those in need. The Swiftie coalition known as Swifties for Hope on X tweete",
    "body": "\n\tTaylor Swift fans are putting their mobilizing skills to work to support those in need. The Swiftie coalition known as Swifties for Hope on X tweeted out on Friday that fans are encouraged to donate $13 or whatever they can afford to support those affected by the potential cuts of the Supplemental Nutrition Assistance Program (SNAP). \n\n\tAlongside an image with text referencing Swift’s “The Life of a Showgirl” song, “Father Figure,” the account wrote in a caption, “Swifties, we’re fundraising for @FeedingAmerica to help support food banks nationwide. Tomorrow, SNAP benefits will halt and the 42 million Americans who rely on them will need help.”\n\t\n\n\tAlthough the group is not affiliated with Swift’s camp, the Swiftie coalition states in its bio that its mission is to “mobilize fans to protect democracy.” \n\n\t The Supplemental Nutrition Assistance Program, or SNAP, aids roughly 42 million people and was set to run out of funds on Saturday without intervention. On Friday, a federal judge in Rhode Island ordered the Trump administration to continue paying for food stamps during the federal shutdown “as soon as possible.” However, if the department finds the funds are insufficient, other sources must be found and used. \n\n\tThis isn’t the first time the Swifites have joined forces in political circles. In 2024, during the presidential campaign for Kamala Harris, Swifties for Kamala raised over $100,000 in donations with a virtual rally that saw a lineup of guest speakers — including Carole King and senator Elizabeth Warren, among others. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Taylor Swift Fans Rally to Support Food Banks as SNAP Benefit Cuts Loom",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/2-Split-3x2-3.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-31T23:32:37.000Z",
      "dateModified": "2025-10-31T23:32:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "CNN Election Night Surprise: Streaming-Only Live-Cast With Harry Enten, Charlamagne tha God, Ben Shapiro",
    "url": "https://variety.com/2025/tv/news/cnn-election-night-surprise-streaming-live-cast-harry-enten-1236567216/",
    "image": "https://variety.com/wp-content/uploads/2025/10/HarryEnten.png?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-31T22:02:00.000Z",
    "description": "\n\tNot all of CNN‘s Election Night coverage will take place on its familiar cable network.\n\n\tThe Warner Bros. Discovery-backed news outlet will make a ",
    "body": "\n\tNot all of CNN‘s Election Night coverage will take place on its familiar cable network.\n\n\tThe Warner Bros. Discovery-backed news outlet will make a play for younger, digital audiences with a “live cast” on its new subscription-based “All Access” streamer, and the show will not be available to viewers who only watch traditional TV. During the program, moderator Harry Enten will lead a group that includes provocative radio host Charlamagne Tha God, conservative podcaster and author Ben Shapiro, and technology journalist Kara Swisher, among others. The group won’t sit behind a desk, but rather will hang out on couches and hash out voting returns over food and drink.\n\t\n\n\t“We are excited to build upon CNN’s best-in-class election coverage and provide a unique and more casual experience for subscribers to CNN’s new streaming service,” says Abigail Crutchfield, the CNN senior vice president of Washington and special-events programming, who is leading the project. The goal of the program, which sounds very unlike traditional CNN fare,” is to give streaming audiences unfiltered access to a raw, smart, engaging conversation with some of the biggest voices in media as the results unfold.” \n\n\n\tThe streaming Election Night special will play out between 8:30 p.m. and 10:30 p.m. eastern on “All Access,” which can be viewed on CNN.com, CNN’s mobile apps and its counterparts on connected TV devices.\n\n\tElection Night on CNN has for years meant spending hours with anchors like John King, Wolf Blitzer and Jake Tapper  — and it still will. But CNN, which under CEO Mark Thompson is making a concerted effort to win cord-cutting viewers who still want to get the news, seems poised to devise more non-traditional programming that will spool through different types of connections.\n\t\n\n\tCNN earlier this week launched a new “All Access” subscription tier that hinges on a broadband connection. The new service serves up the linear CNN feed, but also offers new ways to catch up on the news that are less reliant on familiar TV formulae tied to talent and time-slots. Subscribers can get caught up on trending topics by clicking through a collection of CNN reports on specific storylines. In recent days, CNN has served up some of its most compelling reporting — including an investigation into the missing journalist Austin Tice by overseas correspondent Clarissa Ward — on the streaming outlet, where viewers can watch it at times of their own choosing.\n\n\tOthers have tested new formats on the eve of an election in a bid to woo the broadband crowd. During the 2024 election, Amazon’s Prime Video tapped Brian Williams to moderate a conversation-heavy Election Night hangout with a large crowd of journalists, influencers and hangers-on. The assemblage included Candy Crowley, the former host of CNN’s “State of the Union”; Abby Huntsman, the former Fox News host and panelist on ABC’s “The View”; Jessica Yellin, the veteran of CNN and ABC News; Shep Smith, known for his long run on Fox News and short tenure on CNBC; and Poppy Harlow, the former CNN anchor, who delivered observations from Paris.\n\n\tWhat’s spurring all the news experiments? Headline aficionados have an almost infinite array of choices for information and analysis, thanks to the spread of social media and the rise of independent creators who offer their expertise via newsletter or video podcast. Pew Research in September found that 56% of U.S. adults often use digital devices to get their news, compared with 32% who cited TV in similar fashion. who say they do so often. The figures suggest news sources continue to splinter: in 2020, Pew found 60% of U.S. adults often used digital devices for news, compared with 40% who often used TV.\n\n\tSo-called “alterna-casts” have become all the rage in sports TV. ESPN has tilled new ground, for example, by having Peyton and Eli Manning host a casual show with a “hang out” feel on ESPN2 during which the football brothers analyze the “Monday Night Football” game being telecast more formally on ESPN. Amazon’s Prime Video offers several different takes on its “Thursday Night Football” telecast. During the Paris Olympics in 2024, NBC Sports offered viewers of its Peacock streamer a “Gold Zone” option that took them to various live moments in “whip around” fashion more associated with the NFL’s “Red Zone” network.\n\t\n\n\tElection Night on CNN’s “All Access” promises to be a little more raucous than its traditional TV counterpart. CNN has tapped some contributors who have decidedly partisan leanings and who are more accustomed to hot-talk scenarios. Other guests include Isabel Brown, who hosts “The Isabel Brown Show” with the conservative outlet Daily Wire and examines Generation Z politics, and Ana Kasparian, executive producer of “The Young Turks,” a show infused with a progressive lens on politics. Chances are even Van Jones and Scott Jennings wouldn’t get into the lather one might expect of such commentators.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "CNN Election Night Surprise: Streaming-Only Live-Cast With Harry Enten, Charlamagne tha God, Ben Shapiro",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/HarryEnten.png?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-31T22:02:00.000Z",
      "dateModified": "2025-10-31T22:02:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Woody Harrelson Says ‘No Chance’ of ‘True Detective’ Return With Matthew McConaughey: ‘Never… Doing Another Season Would Tarnish’ the Original",
    "url": "https://variety.com/2025/tv/news/woody-harrelson-rejects-true-detective-matthew-mcconaughey-1236567178/",
    "image": "https://variety.com/wp-content/uploads/2013/09/true-detective-hbo.jpg?w=640&h=352&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-31T21:20:21.000Z",
    "description": "\n\tWoody Harrelson has bad news for “True Detective” fans. Speaking on “Today” while promoting his new movie, “Now You See Me: Now You Don’t,” the acto",
    "body": "\n\tWoody Harrelson has bad news for “True Detective” fans. Speaking on “Today” while promoting his new movie, “Now You See Me: Now You Don’t,” the actor said there is “no chance” of reuniting with Matthew McConaughey for a new season centered on Season 1 protagonists Rust Cohle and Marty Harty. Both actors were Emmy nominated for their roles in the debut season, which aired in winter 2014 on HBO. \n\n\t“A lot of folks want to know if there will ever be another ‘True Detective’ with you and Matthew McConaughey,” “Today” co-host Dylan Dreyer said. “[McConaughey] actually said he would be into it if ‘Woody and I think it’s good enough. It wouldn’t even be a choice.’ Would you do another one?”\n\t\n\n\t“Matthew’s so funny,” Harrelson replied. “In fairness, never. No chance… Because it turned out great. I love that it turned out the way it did, and if anything, doing another season would, I think, tarnish that.”\n\n\n\t“True Detective” creator Nic Pizzolatto said on the “Nothing Left Unsaid” podcast in May that he has an idea for a new story that would bring back the characters of Rust Cohle and Marty Harty. McConaughey told Variety soon after that he would be open to coming back depending on the script.\n\n\t“We nailed that first season,” McConaughey said. “But if it’s a script like that first one, with that fire and originality, I’d do it. And you talk about monologues. Well, Rust Cohle had a monologue. He talked about everything that was inside him, and he didn’t care if you were listening or not. There’s freedom in that.”\n\t\n\n\tPizzolatto described his idea for a new Rust-Marty “True Detective” season as “character-based again. … But it’s not something I’ve written or anything. It’s just, I had that in my head. And we’ve talked about getting back together and doing it, and I think the guys are open to it. It’s just a question of whether that would ever happen or not.”\n\n\tApparently Harrelson isn’t too interested in after all. Watch the actor’s full “Today” interview in the video below.\n\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Woody Harrelson Says ‘No Chance’ of ‘True Detective’ Return With Matthew McConaughey: ‘Never… Doing Another Season Would Tarnish’ the Original",
      "image": [
        "https://variety.com/wp-content/uploads/2013/09/true-detective-hbo.jpg?w=640&h=352&crop=1"
      ],
      "datePublished": "2025-10-31T21:20:21.000Z",
      "dateModified": "2025-10-31T21:20:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Emily Blunt Teases ‘The Devil Wears Prada 2’ and Why She Never Saw ‘The Rock’ While Filming ‘The Smashing Machine’",
    "url": "https://variety.com/2025/film/news/emily-blunt-devil-wears-prada-2-insane-1236565560/",
    "image": "https://variety.com/wp-content/uploads/2025/10/P102H74U.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-31T21:30:00.000Z",
    "description": "\n\tEmily Blunt doesn’t believe in half measures. \n\n\tWhether she’s playing a time-looping soldier in “Edge of Tomorrow,” a pill-popping commuter in “The",
    "body": "\n\tEmily Blunt doesn’t believe in half measures. \n\n\tWhether she’s playing a time-looping soldier in “Edge of Tomorrow,” a pill-popping commuter in “The Girl on the Train,” or a grief-stricken wife in “A Quiet Place,” she approaches every role with empathy and fearlessness. But even by her standards, Benny Safdie’s “The Smashing Machine” pushed her further than ever before.\n\n\n\t“When I saw it with Benny, we both sobbed,” Blunt tells Variety. “It’s strange when you make a movie and then see it reflected back at you. You’re on the inside looking out, and suddenly you’re kidnapped into someone else’s vision of the world.”\n\t\n\n\tJohnson, who built his career on charisma and invincibility, is unrecognizable here — literally and spiritually — as Kerr. His co-star is quick to acknowledge the transformation. “It’s almost more than a performance,” Blunt shares. “I never once saw ‘The Rock’ on set. What he did was extraordinary, but it’s also closer to his soul than people might imagine.”\n\n\n\tThat emotional authenticity extends to Blunt’s portrayal of Kerr’s ex-wife Dawn Staples, a woman she feels was vilified in the 2002 documentary that inspired the film. Blunt took it upon herself to find the person beneath the headlines. “She was nervous about talking to me at first,” Blunt recalls. “Mark had to persuade her. I told her, ‘I will be your advocate.’ And when she opened up, it was invaluable. She knew I’d be playing her at one of the most tumultuous times of her life.”\n\n\tSafdie, known for the chaotic realism of “Uncut Gems” and “Good Time,” filmed the movie in a custom-built house wired with hidden cameras, giving the actors the freedom to move and react without traditional setups. The result is a raw, voyeuristic intimacy — particularly in one extended apartment fight scene that Blunt calls “’High Noon’ in the kitchen.”\n\t\n\n\t“We’d been talking about that fight for weeks,” she says. “Benny never straight-jackets you. If it pops off, if you improvise, if you’re yelling over each other — all of it’s fair game. It feels like you shouldn’t be watching it, like it’s too intimate.”\n\n\tEven the film’s lighter moments tested Blunt’s limits — namely, a sequence involving the Gravitron fairground ride that left her physically ill. “I would rather drink bleach than ride fairground rides,” she admits, laughing. “But Benny has this way of seducing you into saying yes. I ended up on the Gravitron, upside down, wearing this enormous wig, thinking, ‘This is how I die.’”\n\n\tDespite the extremes, “The Smashing Machine” represents something personal for Blunt — a balance between the intensity of her craft and the serenity she seeks off-screen. “I talk to myself when I feel overwhelmed,” she admits. “‘You’re good, you’re good, you’re good. Zen it out.’ That’s how I get through the chaos.”\n\n\tOn the Variety Awards Circuit Podcast, the Oscar nominee Blunt sits down for a wide-ranging conversation about the film, her friendship with Johnson, the long-awaited “Devil Wears Prada” sequel, and why she’s waiting to go to Broadway. \n\n\tAlso on this episode, Oscar nominee Jessie Buckley discusses her towering performance in “Hamnet” and how it taught her to be tender in this world. Listen below!\n\n\n\n\t\n\n\t\t\t\t\tDwayne Johnson as Mark Kerr, Emily Blunt as Dawn Staples, “The Smashing Machine”\n\t\t\t\t\t\t\t\t\tCourtesy Everett Collection / A24\n\t\n\n\n\n\tThis interview has been edited and condensed.\n\t\n\t\tWhat drew you to Dawn Staples as a character?\t\n\n\tI was fascinated by the emotional tightrope of playing someone who, within five minutes, could be both Mark’s Achilles’ heel and his greatest support system. Their relationship was volatile and messy, not tidy or palatable. I wanted to honor that chaos.\n\t\n\t\tHow did speaking with the real Dawn inform your performance?\t\n\n\tIt changed everything. She was nervous to speak with me at first, but Mark persuaded her. I told her, “I will be your advocate. I need the full shadow of your life.” Once she shared, it transformed my understanding. You rarely get to absorb someone so fully; usually, you’re inventing the gaps. Here, she trusted me with one of the most tumultuous periods of her life.\n\t\n\t\tWhen you first watched “The Smashing Machine” what hit you?\t\n\n\tThe second it started, I cried. When you’re making a movie, you’re on the inside looking out; you’re managing the chaos. Then you see it reflected back, and you feel kidnapped into the filmmaker’s vision of the world. With this one, it was deeply emotional for me and for Benny. It means a great deal to both of us.\n\t\n\t\tDwayne Johnson was visibly emotional at Venice. What did you see in that moment?\t\n\n\tI wasn’t surprised. I’ve seen my enormous friend be very emotional before. Part of it was that Mark Kerr was sitting right beside him, shaking through the entire film—for many reasons. For Mark, it felt like a reclamation of his life. The applause was for his path toward peace, not just for the fighter people remember. For DJ, it was an embrace of what he did as an actor and an invitation to keep going in this dramatic space.\n\t\n\t\tAudiences say Johnson is “unrecognizable” here. What was it like opposite him on set?\t\n\n\tI never once saw “The Rock.” The tenderness he shows as Mark is closer to who DJ is, and the pain Mark experiences is closer to DJ’s life than people might imagine. On the day, it was occasionally spooky — like you were witnessing a possession.\n\t\n\t\n\t\tYou’re also filming the long-awaited sequel to “The Devil Wears Prada.” What has that been like?\t\n\n\tOverwhelming — in a good way. I’ve never experienced a movie being shot with this much attention. We’re trying to keep the mystique — changing in bathrooms to avoid being seen in costume — but there are fans everywhere. Playing Emily again feels like slipping into a deranged pair of old slippers. She’s insane, and I love her.\n\t\n\t\tAny teases?\t\n\n\tDisney will come swinging if I say anything. We are still shooting. I had a break to put “The Smashing Machine” out and then I’m back.\n\t\n\t\tYou’ve done film and television — why not Broadway yet?\t\n\n\tI started in theater at 18 and I’m increasingly seduced by the idea. John’s [Krasinski] one-man show off-Broadway was the most creative experience of his life, and I saw a wholeness come over him. But my kids are 11 and 9, and I can’t miss bedtime. When they’re disinterested in me — and that day will come — I’ll be ready. I’d love something new from a female playwright; Penelope Skinner, who wrote John’s play, was exquisite.\n\t\n\t\tWhat are you watching when you’re off the clock?\t\n\n\tCooking shows — “Great British Bake Off,” “Next Gen Chef.” I love sports documentaries. I have no interest in watching the actual sport, but I’m riveted by the athlete’s plight — the pressure to perform. That’s part of why “The Smashing Machine” appealed to me.\n\t\n\t\tYou’ve just wrapped with Steven Spielberg on his new film. What did Spielberg teach you?\t\n\n\tI call him “Double S,” which is a nickname he has never been called before. He and David Koepp wrote me an extraordinary part. Steven is one of the most exquisite humans I’ve met. I grew up on his films—“Jaws,” “Indiana Jones,” “Schindler’s List.” Trying to sum up his impact with words almost takes him down a notch. He’s that vast.\n\t\n\t\tA formative note you got early on that still guides you?\t\n\n\tPawel Pawlikowski on my first film, “My Summer of Love,” taught me that ambiguity is interesting on screen. Remove words. Strip away anything derivative. Lean into the unknown inside a scene. That stayed with me.\n\t\n\t\n\t\tIf you had to leave us with one life note?\t\n\n\tRun toward peace. Things feel chaotic. Try not to lose sleep over it. Find togetherness with the people who make you feel grounded. That’s the work.\n\n\tVariety’s “Awards Circuit” podcast, hosted by Clayton Davis, Jazz Tangcay, Emily Longeretta, Jenelle Riley and Michael Schneider, who also produces, is your one-stop source for lively conversations about the best in film and television. Each episode, “Awards Circuit” features interviews with top film and TV talent and creatives, discussions and debates about awards races and industry headlines, and much more. Subscribe via Apple Podcasts, Stitcher, Spotify or anywhere you download podcasts.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Emily Blunt Teases ‘The Devil Wears Prada 2’ and Why She Never Saw ‘The Rock’ While Filming ‘The Smashing Machine’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/P102H74U.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-31T21:30:00.000Z",
      "dateModified": "2025-10-31T21:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How the Acrisure Arena Became an Unlikely Desert Oasis for Music Fans From Around California… and a Favorite Kickoff Point for Some Major Tours",
    "url": "https://variety.com/2025/music/news/acrisure-arena-tour-kickoffs-palm-desert-1236567296/",
    "image": "https://variety.com/wp-content/uploads/2025/10/Acrisure-Arena.jpeg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-31T23:53:32.000Z",
    "description": "\n\tIs there such a thing as… an intimate arena? That may seem like the type of oxymoron that could only belong to the show-biz hype lexicon. But plenty",
    "body": "\n\tIs there such a thing as… an intimate arena? That may seem like the type of oxymoron that could only belong to the show-biz hype lexicon. But plenty of southern Californians would swear that it’s true, once they’ve been to the Acrisure Arena in Palm Desert, which in its three years open has turned into a sort of destination venue for music fans who like to see a superstar tour in a venue that’s just a little less than super-sized. That holds true not just for the local population of Coachella Valley residents but concertgoers from Los Angeles and even farther afield who, for now, consider it an almost well-kept secret of an alternative venue for certain tours. It’s worth a couple of hours on the freeway, for some, to see a Paul McCartney in a place where no seat counts as a nosebleed.\n\t\n\n\t“It’s kinda like the three little bears,” says John Page, senior VP of Acrisure Arena and the Coachella Valley Firebirds, the hockey team that plays there when Blink 182 isn’t. At a concert capacity of about 10,000 — about a third bigger than the Greek, but smaller by at least a third than the Forum, Crypto, Intuit Dome or Hollywood Bowl — “it’s not too big and it’s not too small.”\n\n\n\tBut what’s in it for the artists who deign to perform a show there, in addition to the larger SoCal markets? For starters, there’s just the ability to squeeze in one that’s just far enough from L.A. to not fall afoul of radius clauses for those other arenas. But more significantly, for some artists, there’s the ability to start a tour there and have rehearsals for days ahead of time in a place that — to borrow the three bears language, again — is not too far away from but also not too close to the watchful eyes of Los Angeles.\n\t\n\n\tSome of that was coming into play in September when the Acrisure Arena had a busier-than-usual period of what it called its “magnificent seven.” Over a two-week period, the venue put on what was the official tour opening for McCartney and the official tour closing for the Who (the latter’s final U.S. show ever, supposedly) in a matter of three days, providing strong evidence that the Palm Springs area offers the kind of creature comforts that make it appealing to hang around either right before or right after a major tour. In that same two-week time span, the arena also was the home for two Blink 182 concerts, a Maroon 5 show, a pre-season game for the Los Angeles Lakers, and the home season opener for the Firebirds, who are effectively the house band for the venue.\n\n\tIn attracting top-name talent for a venue just a little off the beaten track, it has not hurt that one of the principals in this Oak View Group development is veteran manager-mogul Irving Azoff, whose early bookings of a couple of his own clients there  — the Eagles and Harry Styles — surely acted as bait for other A-listers to know that they could do potential sellouts there, too.\n\n\tOn the night of McCartney’s show at the Acrisure, Azoff is holding court with a reporter alongside the backstage mini-mini golf course that is part of the Silvercrest Artist Compound lounge, which basically is this arena’s equivalent of the Forum Club. He’s explaining the origins of the place.\n\n\t“I’ve had a house here for many, many, many years and own a golf course with my partner here, and it’s been my winter place,” Azoff is saying. “So I know it well, and it just felt like the Coachella Valley was underserved. There became an opportunity to do something with the American Hockey League team, the B-team for the Kraken, who have been wildly successful. I think we’ve been pretty much the highest-grossing and attended American Hockey League team for three straight years. So the market supports it. The Lakers love to come down here for preseason and it sells right out. We do college football in November — Michigan State, Arizona, that rivalry. And then for concerts, you don’t make as much money here as you might at a stadium in L.A., but it’s a great stop for people. The building looks great, it sounds great…\n\t\n\n\tHe is interrupted by a visitor — his client, John Mayer. The rock star, suddenly aware that it’s an interview situation he’s stepped into, just takes over as formal interlocutor for a minute.\n\n\t“To what do you attribute this success right now you’re having at the arena?” Mayer asks, playing reporter. “It’s not in L.A. Do you think that Coachella has had something to do with sort of priming people’s minds? Has the Coachella trip sort of embedded that in the culture, coming out to Palm Springs to see a show?”\n\n\tAzoff is too amused to answer until Mayer takes his leave, but yes, he agrees, the answer was embedded in the musician’s question, or at least part of it was. “We get people from L.A., and San Diego’s just as close, as you know, and we get some Phoenix…” And beyond. “People like to travel, as the phenomenon people traveling for a Taylor Swift show proved, that the fans will come to you. And first of all, it’s the best winter weather in the country here, so people who come for a concert aren’t all coming just to go to a concert. There’s a lot to do down here.”\n\n\tPage, interviewed separately, says the geotargeting can be wildly different from show to show (or sporting event to sporting event). “It varies. The first show that we really dug into on this was Harry Styles. When we pulled our purchase metrics, I think it was between 3-5% of the purchasers for the two shows were from the Coachella Valley. And then the balance were from all over the place. We had 3-5% international buyers, as well.” On the opposite end of that scale, “certain events like our Latin/Hispanic shows are, I would say, 90% local.”\n\n\tWhat’s the attraction for out-of-towners, besides the chance to budget time to stay over one or two nights at a place with a nice pool (and maybe  a date shake at Hadley’s on the way)? Even for those who plan to make the trip from the greater L.A. area or back without a hotel stay — maybe most of all for those who don’t have a mini-vacation as part of the plan — there’s just the mere fact that a tour that may be sold out or only have terrible or pricy seats left “in town” may have better and more affordable tickets in Palm Desert. \n\n\t…And, that once inside, first-timers are inevitably surprised by how un-vast the auditorium feels, compared to Crypto, Intuit, et al. Describing it as living-room-like might be a stretch, but there’s no doubt that everyone who enters who’s used to the size and scope of major tours in L.A. knows they are benefitting from being in a secondary market that’s thisclose to a metropolis.\n\t\n\n\tThe difference in scale is part-real, part illusory. The Acrisure Arena has the same basic footprint as those bigger arenas. It just basically has what you’d consider the loge level as the only level, above the floor. (There’s a row of suites on top that has its own concourse and dining and seats 800 high-rollers, but it’s almost easy to miss.)\n\n\tAzoff explains how this size and shape came to be, partly out of practicality for this being a smaller market, and partly for other reasons.\n\n\t“There’s not a bad seat in this house,” Azoff explains, “because, ostensibly, it’s two-thirds of an arena. It’s just that we didn’t put the third deck on, because we didn’t think the demand was there. Well, we couldn’t have gotten permission to, anyway,” he adds, slightly correcting himself, “because it’s in a flight lane. Unless we wanted to dig the building down, that’s as high as we could build.” One man’s zoning restriction is another man’s intimacy-maker.\n\n\tIt would stand to reason that, with attendance necessarily cut down by a third or more from the biggest venues in L.A., tickets might need to cost more for everyone to meet their nut. But looking at ticket prices doesn’t necessarily bear that out. At least, there can be a lower-get-in-the-door cost than at L.A. shows, even if things tend to even out up top. One factor cited by some sources is a lack of union costs that affect ticket prices in major markets. There’s also a desire to look at the wide range of working-class to upper-upper-class residents in the Coachella Valley and have a price point for everyone, to fill the seats.\n\n\t“Even though we’re smaller,” says Page, “sometimes we have more price levels than some venues of our size just because they want to make sure that there’s enough pricing disparity to cover the people from Indio or Coachella as well as the people that are living in some of these country club communities in Indian Wells, La Quinta and Rancho Mirage. Everybody has really gathered enough information, now that we are going into our fourth year, so that they can create the right pricing dynamic so that everybody wins and, at the end of the day, everybody has an opportunity to get a fair-price ticket to see a first-rate artist. … You’ve got tremendous wealth in many cases (in the area). And then you’ve got an incredible blue-collar workforce that just loves to have an arena in their marketplace where they don’t have to drive two hours to see first-rate entertainment or sporting events. So, we punch above our weight in ability to take a gross to make sure that we can take care of a Harry Styles guarantee or a Paul McCartney date or the Who or having two Blink 182 shows.”\n\t\n\n\tLatin-focused entertainment, which, as noted above, draws more significantly from the Valley than most other types of shows, is a significant draw.\n\n\t“We just had Ana Gabrielle last month, second time through the marketplace, and she sold more tickets this time than the first time,” says Page. “We’ve had Peso Pluma two times. We just put Ricardo Arjona on sale. We’ve had a wide variety of Latin artists, some that of that new genre of music coming up, and then some of the older artists that have got such a tremendous following, like Los Tigres Del Norte.” Palomazo Norteño just performed, and the schedule for upcoming shows includes Jorge Medina and Josi Cuén.\n\n\tIt also includes Duran Duran, Cardi B, Tate McRae and “Gabby’s Dollhouse Live.” And hockey. Lots and lots of hockey.\n\n\t“Hockey in the desert” was considered a folly by some prior to opening, but as it turns out, there are a lot of “snowbirds” from Canada as well as the northern U.S. who are happy to buy season tickets and get cold for just a couple of hours a night and that’s it. Proof-of-concept came when the arena did $36 million in gross ticket sales in its first six months after opening in December 2022.\n\n\tSays Page, “Our first three seasons, we’ve been the leader for the most part in most of the metrics that the American Hockey League recognizes — season ticket revenue, paid attendance. We’ve been number one or two in total attendance from the start and the inception of this team. But we’re constantly changing and evolving as well. For most (locals), we were starting to really understand that their threshold was coming to 36 games. So we made some really nice changes for our fans, like having intentional game plans. We’ve made some adjustments on our parking prices. We’re actually going to a 6:30 p.m. start for our weekday games, to really kind of give the families an opportunity to get here early and get home so they get their kids to bed, or, if you’re from an older demographic, you can get home before 10 now.”\n\n\t“Our analysis from a hockey perspective” was valuable for overall planning, says Page. “If you look at just the static population here between the nine communities, it’s approximately 500,000. And when you compare us to the rest of the American Hockey League, we’re the third-smallest market. But from 500,00 permanent residents, this market doubles to north of a million people once you get into the end of October through the 1st of May. So summertime’s slow, but even then there’s still this great core people that are desiring entertainment, and we’re providing that. But when it swells, it’s a completely different animal. It truly morphs for that five- to six-month period. So it’s a real interesting market that we’re constantly learning more about all the time.”\n\t\n\n\tThe off-season is when it’s best for someone like a McCartney to come in and build in time for set-up and rehearsals for an entire tour. He’s not the first to do so; Olivia Rodrigo did the same, rehearsing and starting her first arena tour here at the beginning of 2024. The building isn’t so busy, if hockey isn’t around, that they can’t turn the venue over to a superstar for a bit for whatever they need to do, in a lot of cases. \n\n\t“When we began discussions a couple years ago about the potential to have Sir Paul here at the building, we went through all the amenities and providing enough time for them to come in and do technical rehearsals, band rehearsals, whatever it may be,” Page says. “We carved out a full week, and even a couple days after the date, just so that they could have enough time to do what they needed on the front end and take their time on the back end, whether that was loading trucks or going through some of the technical aspects of the tour so they could have everything buttoned up before they went onto their next stop. So, we want to accommodate as much as we can.”\n\n\tAzoff also emphasizes what a nice landing spot it makes for artists about to go visit an intinerary’s worth of places with fewer creature comforts to come. “As a manager,” he says, “I just give everybody the building to rehearse. If the days are dark, just take it. Costs here are way lower, and the ambience is great. Even though it’s a smaller building, you can hang your full production. Like, Paul’s production is the same production he’ll hang in Vegas at Allegiant Stadium a few nights later. So it’s a great, great place to start.” \n\n\tAs for the Coachella connection… there isn’t one, apart from, as Mayer said, getting all of Los Angeles and its surroundings used to the driveability of the area. They’d like to change that, down the road.\n\n\t“Our biggest issue with respect to radius clauses is the two Coachellas and Stagecoach,” says Page. “We get into that time period now that they’ve announced the Coachella and Stagecoach participants. We try to kind of counterprogram around that. We’d love to do more with Paul Tollette and AEG on that. But, you know, it is what it is. We understand what they’ve created, and we want to be here if they want to look at putting something in here as well during that timeframe.”\n\t\n\n\tAlthough the venues aren’t on the same scale, there is casino competition, particularly from the Yaamava’ midway between L.A. and Palm Springs in Highland, which offers a really intimate experience for fans of some of the acts who play arenas, with limited enough seating that the get-in-the-door price can be more daunting. Says Page, “We firmly believe that you can play a Yaamava’ Theater and then play the Acrisure Arena as well. It’s one plus one is three in my mind, for the artists that can do two (extra) play dates and not skip a market. Those are things that, going into our fourth year, we will continue to push and explain to people and hopefully get them on board with their routing and touring programming.”\n\n\tAzoff wishes the area around the Acrisure had more of the development they foresaw, but there have been snags in that. “There’s been a couple false starts on people building sound stages down here, and recording studios. It’s really hard to develop stuff down here. There’s real problems getting power and infrastructure, because it’s exploded. There’s been an inability to develop around the arena because you can’t get entitlements here because there’s flood plane issues, there’s power issues. You know, we would’ve built more. There should have been a hotel here already, and we would’ve built out rehearsal spaces.\n\n\t“But,” he says, not to complain, “this thing’s here to stay. It’s great.” And if there’s a lack of development immediately surrounding the arena, still? It only makes it seem more oasis-like, which is the feeling a lot of desert travelers will have once they step inside from the heat to see a Beatle in a very sub-Shea Stadium situation.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How the Acrisure Arena Became an Unlikely Desert Oasis for Music Fans From Around California… and a Favorite Kickoff Point for Some Major Tours",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/Acrisure-Arena.jpeg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-31T23:53:32.000Z",
      "dateModified": "2025-10-31T23:53:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘The Witcher’ Boss Explains Ciri’s Queer Love Interest in Season 4, ‘Pushing’ Netflix for That Jaskier Musical and Gearing Up to Kill More Characters in Final Season: ‘The Body Count Keeps Growing’",
    "url": "https://variety.com/2025/tv/news/witcher-ciri-girlfriend-geralt-vesemir-deaths-final-season-1236567150/",
    "image": "https://variety.com/wp-content/uploads/2025/10/The_Witcher_u_S4_E1_00_05_23_02-1.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-31T23:30:00.000Z",
    "description": "\n\tSPOILER ALERT: This article contains spoilers for “The Witcher” Season 4, now streaming on Netflix.\n\n\tThere’s a new witcher on the hunt in the Conti",
    "body": "\n\tSPOILER ALERT: This article contains spoilers for “The Witcher” Season 4, now streaming on Netflix.\n\n\tThere’s a new witcher on the hunt in the Continent.\n\n\tLiam Hemsworth steps into the monster-killing shoes of Geralt in Netflix’s “The Witcher” Season 4, taking over after original star Henry Cavill departed after Season 3. The story picks up in the aftermath of last season, with Geralt, Ciri (Freya Allan) and Yennefer (Anya Chalotra) all separated and searching for each other.\n\t\n\n\tThey’ve each assembled a new group of allies in their hunt: Geralt has his bard buddy Jaskier (Joey Batey), vampire Regis (Laurence Fishburne) and others on his search; Yennefer leads the sorceresses to find her adopted daughter, Ciri, and lover, Geralt; and Ciri has assumed a new identity as Falka, banded together with the Rats, a group of outlaws, and starts a relationship with a criminal named Mistle (Juliette Alexandra). \n\n\n\tGeralt and Yennefer are determined to stop Emperor Emhyr var Emreis (Bart Edwards) from fulfilling an ancient prophecy — which involves marrying his own daughter, Ciri — and gaining enough power to rule the entire Continent. Luckily, they soon realize that the marriage is a sham and Emhyr is holding a fake Ciri hostage to wed. But there are many other threats out there, like the evil wizard Vilgefortz (Mahesh Jadu) who attacks Yennefer’s forces in the climactic Battle of Montecalvo. With the help of the other witchers, they defeat Vilgefortz, but Geralt’s mentor Vesemir (Peter Mullan) and sorcerer Istredd (Royce Pierreson) both die. \n\n\tOn Ciri’s side, the deranged bounty hunter Leo Bonhart (Sharlto Copely) is hot on her and the Rats’ trail. In the finale, he corners them and brutally beheads each of the Rats, taking Ciri as his prisoner. Also in the final moments of the show, Geralt is finally knighted after the Battle of the Bridge, and Emhyr sends out a mysterious monster to follow his scent and kill him.\n\t\n\n\tSpeaking with Variety, showrunner Lauren Schmidt-Hissrich discusses all those deaths, where Geralt and Ciri will find themselves in the upcoming fifth and final season and much more.\n\n\n\n\t\n\n\t\n\n\n\t\n\t\tLet’s start with Ciri. She’s starts the season off with the Rats and grows close to Mistle, which is portrayed very differently in the books. Why did you want to introduce a love interest for her?\t\n\n\tWe definitely wanted to take a page from the books, and we played around with several darker and lighter versions. Where we wanted to land is something that felt like Ciri was actually turning over some of herself to this person, that there was a vulnerability that we’d never been able to see before. That’s why we started with it. For the past three seasons, Ciri has been a princess, the most powerful person on the Continent, someone’s daughter, someone’s granddaughter. What starts to happen when she lives life for herself? And the truth is, is it’s not really a storybook romance. It’s no “happy ever after” for her. But we did want to give her these moments of questioning. Is this love? Is this what it feels like to be in love? Because these are things that Ciri has never experienced. She’s never had the ability to have these normal human experiences, and it doesn’t end on a nice note. When she leaves Mistle, everything is thrown into question. She thought that she was able to build up this mask of this person that she wanted to be. The truth is that Mistle always saw through it. Is it love? Is it not love? I don’t know that I could answer that.\n\t\n\t\tAll of the Rats get gruesomely beheaded by Leo Bonhart. How is that going to stick with Ciri going into the final season?\t\n\n\tWe made a really conscious decision to not end this season on the characters’ higher moments. When we’re doing Seasons 4 and 5 back to back, in some ways it feels like one big season that we split. It really is one long journey back toward each other. We thought it would be interesting, as we’re chugging toward the end, to put all of our characters in the darkest places imaginable because we know that some redemption is going to come. This is going to be Ciri letting go and touching those deepest, darkest places within herself that she’s always pushed away. She’s said several times across the series that she worries that there’s something wrong with her. She worries that death follows her, that she is a monster inside. Once she deals with the heartbreak and loss of the Rats, we get to see her start to access that for a while. It’s her baptism of fire that needs to happen before she can be redeemed.\n\t\n\t\n\t\tSpeaking of sad deaths, we also get Vesemir back this season, but he goes down swinging in a fight against Vilgefortz. Why was this the right time to say goodbye to him?\t\n\n\tPeople who are fans of the books know that the witchers do appear again in the books. We haven’t seen them since Season 2. So we wanted to make sure that we were reintroducing our audience to who these witchers were, their relationship with Geralt, the world, where they see themselves in that hierarchy and the fact that they have always tried to stay neutral in the past. That’s something we’ve seen Geralt go through, his desire to stay neutral and his realization at the end of Season 3 that he can’t. So we want his brothers-in-arms to go through a similar experience. \n\n\tThat was the first reason of bringing them in this season. Obviously, they’re not in this portion of the books. The bigger thing we needed in terms of deaths, audiences sometimes worry that we kill people just for shock value — and yes, I think Vesemir’s death is very shocking — but the more important thing is what it does to the people around him. When Geralt learns about it from Yennefer, we see him taken to a new place. He has lost his father now, and he is pushing to be a father to Ciri, a role that he never expected to step into. When you lose someone important in your world, it makes you reconsider your own priorities. This was the right engine for Geralt at the end of the season, as he’s actually experiencing some of his dreams coming true at the end of Season 4. The thing that he’s dreamt of the most, becoming a white knight, he’s able to get. Yet partially through the death of Vesemir, he knows that time is not on his side. If he is going to reunite his family, he has to give up that dream in order to pursue the dream of family. So it felt like the right time, not just for story and shock, but for Geralt and what he needed.\n\t\n\t\tThe death count seems this season seems pretty high. Will next season have around the same number of deaths?\t\n\n\tYes, the death count this season was huge, also think the death count of people who were really important to us. Anyone who’s familiar with this source material knows that it’s not a happy ending, and I do think that the body count just keeps on growing from here. It feels fitting. Obviously it’s going to be a goodbye to the series. We have to start to say some real goodbyes to these characters.\n\t\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tSusie Allnutt/Netflix\n\t\n\n\n\t\n\t\tGeralt is finally knighted at the end of this season, officially becoming Geralt of Rivia. How will that help him or hinder him next season?\t\n\n\tSince Season 1, Geralt has wanted to be a knight. We see him as a little boy and he’s slaying dragons with a wooden sword. We know that this is a deep-seated dream within him. Even when he became a witcher, we start to hear these lessons that Vesemir is trying to impart on him, which is that you don’t kill for revenge. You don’t kill to be a hero. You kill because you have to. One of the most meaningful things that we were able to express for Geralt this season is the flashback when he explains to Ciri that “Geralt of Rivia” isn’t an honorific. It’s not his real name. It’s one he gave himself to improve his contracts. That is one of the first things that he and Ciri bonded over, where she started to open up to him. For Geralt, it should feel like a moment of celebration and achieving what he always wanted. But for us, it’s more proof to show how the character has changed and how his goals have changed over the season. This man who wanted nothing and no one, who wanted to be a part of nothing larger than himself, suddenly gives up his greatest dream in order to pursue his daughter and the woman that he loves. That is the most poignant shift for him that we’ve seen.\n\t\n\t\tYou’ve spoken a lot already about Liam Hemsworth stepping into Geralt’s shoes this season. Was there anything that surprised you about his performance once you began shooting?\t\n\n\tOn day one, we were all nervous. We all had no idea what to expect. Liam has spoken extensively about putting on the black leathers, contacts and the wig and that process of not becoming yourself. What was most surprising to me when he stepped on set was how comfortable he was and how at ease he was. It was amazing. I know the physical work that he put in, but the mental work that he must have put in to step onto set, not be fidgeting or worried that he was mimicking something — it was incredible. That ease and comfort seeps across both seasons. You really see him comfortable in this character. Honestly, it’s the right time for Geralt, who’s experiencing these emotions he’s never experienced before. Liam got to bring an emotional side to Geralt that we had not seen. In some ways, it’s just perfect timing where the new actor came in to a place where this character was in a state of flux.\n\t\n\n\tWhat I was surprised with is how easily he slipped into the rhythm that we had started to build in Season 1, which is saying things when things needed to be said, knowing when it was the perfect time to just sigh or grunt or say “fuck” and move on. It came so naturally to him. Despite the stories being super heavy, Geralt has a sense of humor and wit about him that feels very authentic, because that’s how people move through trauma. You get to see these beautiful moments of bonding, friendship and family amidst the darkness. It was a lovely surprise. It’s exactly what we wanted and hoped for.\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tSusie Allnutt/Netflix\n\t\n\n\n\t\n\t\tI loved Regis’ animated backstory and Jaskier’s musical in the middle of the season. How did you decide to change up the format and present their origin stories like that?\t\n\n\tWe love to play with structure and form on the show. This was a different chance to do something. It started out of production needs. We had this backstory for Regis that we knew we wanted to tell. We also knew that we did not have the time and resources to tell it the way that it needed to be told. Our episodes are shot across, in general, about 18 days. This was unlike anything we’d done before. We needed to be here for Regis, there for Jaskier, here for Zoltan. We knew we couldn’t accomplish it, but what if we actually played with form and the genre of these moments? Regis was the first one that came to be. We could accomplish the breadth and depth of that flashback with animation. That took so much planning. Animation is a much, much slower, more methodical process. We actually started that animation long before we started shooting Season 4. Laurence got to come in for approvals on his character design. It’s actually modeled after one of his sons, so it is meant to look like Laurence would look as a young man. Jaskier’s came next. I have to say, pitching a musical to Netflix wasn’t a swinging yes out of the gate. It took some movement and pushing, but we’re so happy with it. There’s no better way to tell Jaskier’s story.\n\t\n\t\tWe meet Nimue (Sha Dessi) this season, who seems like she may cross paths with our main characters. Will we see more of her next season?\t\n\n\tWe loved setting up Nimue and Stribog the storyteller like a device. It’s a way of helping our audience adjust to seeing Liam’s face, to seeing this new Geralt. It’s a way to revisit moments from the past, to really get our characters together. It’s one of the huge reasons that we open the season like that. Otherwise, Ciri, Geralt and Yen are on three different paths. We never see them together. We knew that if we went back into the past, we could have these moments of the family united and remind our audience what they’re fighting for. It should feel a little bit like a device at the beginning. By the end of the season, Stribog says to her, “Maybe you have a bigger role in the story. Maybe you are the one who can change the story.” Absolutely in Season 5, we’re going to be stepping back in Nimue’s world a little bit more. We’re going to have an understanding of how stories are changed by the storyteller. But if you think about it, Nimue we say is 100 years in the future, so if she’s going to intersect in the story, it’s a little bit of a hint as to what some of Ciri’s powers might be as well.\n\t\n\t\n\t\tCan you tease what kind of monster Emhyr is sending after Geralt in the final moments of this season?\t\n\n\tOne of the things that we had to cope with in Seasons 4 and 5 is that by this point in the books, Geralt really isn’t a monster hunter anymore. He’s not fighting monsters very often. He has reformulated his goal to solely get to his family. But, of course, we love the monsters, and we know Ciri is the titular witcher of the series and of the books. We know that monster hunting has to stay important to her and her world. So we invented a ton of monsters to putting out there. What we really love is this idea that a monster is specifically coming from Emhyr. Just as Geralt is trying to move forward in Season 5, there’s this piece of his past that keeps coming for him.\n\t\n\t\tThere was a two and a half year break between Season 3 and 4. Will there be as long of a wait to get to Season 5?\t\n\n\tHopefully shorter. Two and a half years is never ideal. Obviously, we had a writers strike in the middle of that, which really pushed Season 4 back. So fingers crossed. We are working so hard in post, we wrapped almost a month ago. We’re we’re pushing ahead and hope to be able to deliver it audiences a little bit sooner.\n\n\tThis interview has been edited and condensed.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘The Witcher’ Boss Explains Ciri’s Queer Love Interest in Season 4, ‘Pushing’ Netflix for That Jaskier Musical and Gearing Up to Kill More Characters in Final Season: ‘The Body Count Keeps Growing’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/The_Witcher_u_S4_E1_00_05_23_02-1.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-31T23:30:00.000Z",
      "dateModified": "2025-10-31T23:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Lady Gaga Shows Support for Alix Earle on ‘Dancing With the Stars’: ‘I’m Rooting for You’ and ‘I Love You’",
    "url": "https://variety.com/2025/music/news/lady-gaga-alix-earle-dancing-with-the-stars-shows-support-1236567344/",
    "image": "https://variety.com/wp-content/uploads/2025/10/2-Split-3x2-4.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-31T23:59:29.000Z",
    "description": "\n\t\t\t\n\t\t\t\t\n\t\n\n\t\n\tOct 31, 2025 4:59pm PT\t\n\t\n\n\t\n\t\tLady Gaga Shows Support for Alix Earle on ‘Dancing With the Stars’: ‘I’m Rooting for You’ and ‘I Love Y",
    "body": "\n\t\t\t\n\t\t\t\t\n\t\n\n\t\n\tOct 31, 2025 4:59pm PT\t\n\t\n\n\t\n\t\tLady Gaga Shows Support for Alix Earle on ‘Dancing With the Stars’: ‘I’m Rooting for You’ and ‘I Love You’\n\t\n\t\n\t\t\t\n\n\n\t\t\t\n\t\t\t\n\t\n\n\t\t\t\t\t\t\t\t\tGetty Images\n\t\n\n\t\t\n\t\n\t\t\t\t\n\tAlix Earle has earned a stamp of approval from Lady Gaga for her performance on “Dancing With the Stars.” \n\n\tAfter Earle posted clips of her Halloween costume — a nod to Lady Gaga’s “Paparazzi” music video from 2009 — to her TikTok, Gaga showed her love for the 24 year-old influencer and entertainer in the comments. \n\n\t “Girl I love you,” Gaga wrote in her response to the TikTok video. “And I’m rooting for you on DWTS! Thank you for this it’s so sweet.” \n\t\n\n\n\tEarle also referenced Lady Gaga during her performance alongside partner Val Chmerkovskiy on this week’s “Halloween Night” episode on Oct. 28. The pair danced a tango to Billie Eilish’s “Bury a Friend,” while the introduction featured the duo rising from a pit of dirt, similar to Gaga’s “skeleton pit” from her “The Mayhem Ball” tour. Gaga utilizes the prop while singing “Perfect Celebrity.”\n\n\n\tEarle has often referred to Gaga as her favorite singer — and it seems Earle is a favorite of Gaga’s on the 34th season of the ABC show. On Friday it was revealed the “Halloween Night” episode averaged 6.74 million total viewers. That’s another season high, the network reports, and the sixth straight week “DWTS” has been up since its season premiere.\n\n\tThe “Halloween Night” episode was up 2% from the previous week (6.63 million on Oct. 21) and rose despite airing opposite World Series Game 4 on Fox. \n\n\n\t\n\t\tMore from Variety\n\t\n\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lady Gaga Shows Support for Alix Earle on ‘Dancing With the Stars’: ‘I’m Rooting for You’ and ‘I Love You’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/2-Split-3x2-4.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-31T23:59:29.000Z",
      "dateModified": "2025-10-31T23:59:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How TikTok Became the Entertainment Industry’s Most Unpredictable Trendsetter",
    "url": "https://variety.com/2025/shopping/news/tiktok-changing-entertainment-attention-economy-1236567182/",
    "image": "https://variety.com/wp-content/uploads/2025/01/TikTok.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-31T21:45:13.000Z",
    "description": "\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.\n\n\tIn the sh",
    "body": "\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.\n\n\tIn the shifting sands of Hollywood’s attention economy, TikTok isn’t just a disruptive force anymore — it’s the unofficial showrunner of a new era. What started as a Gen Z-leaning social app has quickly become the entertainment industry’s most unpredictable trendsetter, reshaping everything from talent discovery to studio marketing strategy to the way stories are written, edited and consumed.\n\n\tThe rules that governed the last century of entertainment — multi-season arcs, theatrical windows, prestige runs on cable — now share space with a format where a 12-second clip can launch a career or mint a No. 1 single before a studio even approves a press junket. Hollywood has always chased the audience, but TikTok flipped the chase as audiences decide a hit before the industry even recognizes it as one.\n\t\n\n\tStudio marketing teams, once married to the three-minute trailer and the primetime late-night rollout, are now operating like meme labs. Instead of cutting one master trailer, they’re slicing footage into 9:16 vertical teasers built to hook in the first 1.5 seconds and even creating TikTok-inspired fan edits garnering millions of views.\n\n\n\tFelipe Mendez, who manages the Lionsgate account, poached a 15-person roster of these Tiktok creators to make fan edits for the studio. “We’re going to the artists that fans are already obsessed with and saying: ‘We want you to create what you’re already doing; we just want to work together,’” Mendez told Variety earlier this month.\n\n\tMendez says he realized the potential of fan edits a couple years ago, when “Suits” videos were garnering hundreds of millions of views on TikTok. He credits those clips with catapulting the 2010s legal drama to the most-streamed show of 2023 and spawning a spinoff.\n\t\n\n\tIt’s also shifted creative development itself. Writers’ rooms are being asked to identify “the TikTok moment” while a show is still on the whiteboard and casting directors are finding talent straight off their own algorithms. When “Saturday Night Live” announced its newest featured players this season, more than one had been plucked directly from TikTok comedy feeds, such as Veronika Slowikowska. The platform has become an unofficial farm system for late-night and studio comedy, where a 45-second character bit can do more for a performer’s career than five years at the Groundlings.\n\n\tHollywood has always reinvented itself to match the medium — the talkies, TV, cable, streaming. TikTok isn’t the next phase. It’s the first platform that didn’t wait for the industry’s permission. And whether execs love it, fear it or quietly build around it, the message is the same: if it can’t live on TikTok, it may not live at all.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How TikTok Became the Entertainment Industry’s Most Unpredictable Trendsetter",
      "image": [
        "https://variety.com/wp-content/uploads/2025/01/TikTok.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-31T21:45:13.000Z",
      "dateModified": "2025-10-31T21:45:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Choreographer Parris Goebel on Working With Lady Gaga on the Mayhem Ball Tour, Collaborating on That Dress for ‘Abracadabra’ and Using Kitty Litter in the Grave Box",
    "url": "https://variety.com/2025/artisans/news/parris-goebel-lady-gaga-choreography-mayhem-ball-1236567199/",
    "image": "https://variety.com/wp-content/uploads/2025/07/GettyImages-2213271025-e1752733784858.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-31T23:35:21.000Z",
    "description": "\n\tChoreographer Parris Goebel was “born with a passion and love for dance.”\n\n\tIt was a passion that led to her collaborate with the duo of Jennifer Lo",
    "body": "\n\tChoreographer Parris Goebel was “born with a passion and love for dance.”\n\n\tIt was a passion that led to her collaborate with the duo of Jennifer Lopez and Shakira, as well as Rihanna on their respective Super Bowl halftime shows in 2020 and 2023. “It doesn’t matter the scale, I give it my all,” she says.\n\n\tAs creative directors and executive producers Lady Gaga and Michael Polansky were conceiving the singer’s Coachella set and subsequent Mayhem Ball tour, the duo brought Goebel on as choreographer.\n\t\n\n\tThe theme of the tour is a grand opera house with stone columns and grand archways, which allow Gaga and her dancers to seamlessly switch from the opening moments of Gaga emerging in a caged dress, housing mayhem dancers to two queens facing off during “Poker Face.”\n\n\n\tGoebel says “Paparazzi’s” rainbow cape, worn when Gaga emerged from a sandbox, representing a grave, was the most challenging element, and also deeply meaningful one. “Being an artist that can survive the test of time, which she is, is such a testimony to her resilience, and how fearless and unapologetic she is,” she says.\n\n\tHere, Goebel, who was recognized on Variety’s Women’s Impact report, spoke about her work as a choreographer and working with Gaga.\n\t\n\t\tI went to the L.A shows in July, and saw you in the audience that night, watching the show. How often do you go in to see the show and make sure everything is on track?\t\n\n\tI usually watch the first couple of shows and make sure it’s all good. I have other stuff that I’m working on so I can’t be on the road like that. So, when I went to watch it in L.A., I genuinely went to go and enjoy it.\n\t\n\t\n\t\tSince we’re honoring you for the women’s impact report, let’s go back. Where did your love for dance begin?\t\n\n\tI was born with a passion and a love for dance. I don’t distinctively remember a moment where I discovered dance. I just have memories of dancing at home in my bedroom and in the lounge. Most of us are just born with something that we really love, and we’re called to do, you know, everyone has a purpose. Some of us find it when we’re kids, and some of us find it later in life. I was blessed to find it when I was a little girl.\n\t\n\t\tWell, here you are working with some of the biggest music stars in the world. What makes you say yes to a collaboration?\t\n\n\tJust genuinely being a fan of their work. It’s obviously changed over the years. Before, I definitely was just saying yes to everything because I couldn’t believe I was in L.A. and people wanted to work with me. Now, being in the industry for 10-plus years, I’m way pickier. I understand my value a lot more. Does this artist or person excite me, and am I genuinely a fan of their work? Those are probably the two things.\n\t\n\t\tOver the course of your career, you’ve done two Super Bowl halftime shows. What is that pressure like when you’re doing something for an audience of that size, and does the approach change at all?\t\n\n\tMy approach is always pretty much the same. It doesn’t matter the scale. I give it my all. I don’t stop until it’s done, and I just want it to be great; it doesn’t matter what the stage is like. I approached everything with the same amount of hard work and execution. I grew up in New Zealand, so I didn’t really understand the magnitude of the Super Bowl to be completely honest. I knew it was big, but I don’t know if I understood how big it was.\n\t\n\t\tGoing back to the Mayhem Ball tour, what was the collaborative process behind the opening of the show and Gaga coming out in this caged dress?\t\n\n\tWe landed on the idea of doing an opera. Once I had that, my brain went crazy. When you think of a female opera singer, you think of these big, gorgeous gowns and the drama of it. With Stefani, you take an idea and think, “How can this be bigger and more epic and louder and bolder?” I became quite literal about it in my head, like, what if it’s massive and larger than life? And then, how do you bring choreography into it? OK, you put dancers in the skirt. It would be sick if there were levels under her dress and it was a cage. We had created these mayhem characters that were extensions of Queen Mayhem. It’s always cool when an artist is elevated, but there was something quite cool about her being elevated, but because of what she was wearing, because of the dress, which was really innovative. That idea has been done in different ways. But when Gaga does it, it’s different; it’s a mic drop.\n\t\n\t\n\t\tI’m fascinated by the choreography of “Poker Face” and the idea of the two queens. What’s the story behind the choreography there?\t\n\n\tI kept thinking, “What are visuals that people can resonate with and relate to?” With the chessboard idea, we ran through that being on different types of songs, and then I was like, “Wait for ‘Poker Face, it’s brilliant.’ It made sense, so we started to develop the story of this push and pull with her and a different version of herself. I thought a battle on a chessboard to “Poker Face” was sick, and being able to tape the squares in the studio was really fun, easy and effortless. Everyone knows how to play chess and putting that in her emotional storyline was really cool and powerful. It landed really strongly.\n\t\n\t\tWhat was the most challenging number to put together?\t\n\n\tProbably “Paparazzi” with the cape and crutches, because of the logistics of the cape. I love that song. When you listen to the lyrics, it can also be taken vulnerably. Stef and I thought it would be great to hear a ballad version, this slow, emotional rendition of ‘Paparazzi.'” She was coming out of the sandbox, representing a grave. Being an artist that can survive the test of time, which she has, has been such a testimony to her resilience, and how fearless and unapologetic she is. She came out from the grave, and “Paparazzi” was a journey of her soaring and finding her wings again. The cape represented that and showed how strong she is.\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tKevin Mazur/Getty Images for Live Nation\n\t\n\n\n\t\n\t\tSpeaking of the grave, what is in that?\t\n\n\tIt’s kitty litter.\n\t\n\t\tWhat’s next for you?\t\n\n\tI’m releasing my own music. I’m signed to Diplo’s label. And I’ve just handed in a complete dance project that I’ve been working on all year, in my spare time. That’s coming out next month.\n\n\tThis interview has been edited and condensed.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Choreographer Parris Goebel on Working With Lady Gaga on the Mayhem Ball Tour, Collaborating on That Dress for ‘Abracadabra’ and Using Kitty Litter in the Grave Box",
      "image": [
        "https://variety.com/wp-content/uploads/2025/07/GettyImages-2213271025-e1752733784858.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-31T23:35:21.000Z",
      "dateModified": "2025-10-31T23:35:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Guess The Sexy Spider ... Trick Or Treat!",
    "url": "https://www.tmz.com/2025/10/31/guess-sexy-spider-halloween/",
    "image": "https://imagez.tmz.com/image/4f/16by9/2025/10/31/4f369ce9e8a940ce9b60afeabffe1425_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-31T21:56:24.000Z",
    "description": "\n    \n                    \n                          Guess The\n                          Sexy Spider\n                          Trick or Treat 🕷️!\n   ",
    "body": "\n    \n                    \n                          Guess The\n                          Sexy Spider\n                          Trick or Treat 🕷️!\n                      \n                  \n                        Published October 31, 2025 2:56 PM PDT\n                                                                            \n      \n    \n      \n        \n              \n    \n    \n          This itsy-bitsy spider is makin' it rain! Can you guess who spun her wicked-hot web on social media in this eye-popping shot?! Grab your candy buckets and see if you can unwrap this sweet star!\n      \n    \n          She's an actress known for \"Players,\" \"Smoky Knights,\" and \"Powerless.\" If you're still unsure, maybe her sister Vanessa can help you out 😘!\n      \n    \n          You know what is ... hit up the gallery for the reveal!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Hotties & Bodies\n              \n                          \n                Hot Bodies\n              \n                          \n                Guess Who\n              \n                          \n                Photo Galleries\n              \n                          \n                Halloween\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Guess The Sexy Spider ... Trick Or Treat!",
      "image": [
        "https://imagez.tmz.com/image/4f/16by9/2025/10/31/4f369ce9e8a940ce9b60afeabffe1425_xl.jpg"
      ],
      "datePublished": "2025-10-31T21:56:24.000Z",
      "dateModified": "2025-10-31T21:56:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Celebs' Best Halloween Costumes Through the Years",
    "url": "https://www.tmz.com/2025/10/31/halloween-costumes-through-the-years/",
    "image": "https://imagez.tmz.com/image/24/16by9/2025/10/29/248c46ab91e7488e82cb75a7ae3f3f60_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-31T19:00:38.000Z",
    "description": "\n    \n                    \n                          Happy Halloween!\n                          Check Out The Best Celeb Costumes\n                    ",
    "body": "\n    \n                    \n                          Happy Halloween!\n                          Check Out The Best Celeb Costumes\n                          Through The Years!\n                      \n                  \n                        Published October 31, 2025 12:00 PM PDT\n                                                                            \n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          Gather around, come near, because Halloween's finally here, and we're looking back at our favorite celebrity costumes over the years!\n      \n    \n          But don't worry, boys and ghouls, you won't catch a fright, it's all in good fun, especially when the stars go trick-or-treating at night!\n      \n    \n          We've got images of Harry Styles, Lizzo, and Nick Cannon in store -- wait, did you think that was it? No, there's way more!\n      \n    \n          Check out our video -- it's begging to be seen -- and from all of us at TMZ, have a Happy Halloween!\n      \n      \n              \n          \n                          \n                Halloween\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Celebs' Best Halloween Costumes Through the Years",
      "image": [
        "https://imagez.tmz.com/image/24/16by9/2025/10/29/248c46ab91e7488e82cb75a7ae3f3f60_xl.jpg"
      ],
      "datePublished": "2025-10-31T19:00:38.000Z",
      "dateModified": "2025-10-31T19:00:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Heidi Klum Struggles With Umbrella in Gale Force Wind on NYC Rooftop, on Video",
    "url": "https://www.tmz.com/2025/10/31/heidi-klum-struggling-umbrella-new-york-rain/",
    "image": "https://imagez.tmz.com/image/29/16by9/2025/10/31/292f5abf4af84b579092f36b5c659f87_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-31T19:17:39.000Z",
    "description": "\n    \n                    \n                          Heidi Klum\n                          High-Rise Hair-Raiser!!!\n                      \n            ",
    "body": "\n    \n                    \n                          Heidi Klum\n                          High-Rise Hair-Raiser!!!\n                      \n                  \n                        Published October 31, 2025 12:17 PM PDT\n                                                                            \n      \n    \n      \n        \n                    \n                  \n      \n                    BACKGRID\n          \n    \n          Heidi Klum went from \"Project Runway\" to \"Project Rainway\" ... 'cause her latest catwalk resembled a wind tunnel -- except it was outside on a rooftop, where she found herself unwittingly locked in a high-fashion duel with her umbrella.\n      \n    \n          Check it out ... Heidi hit the Empire State Building in NYC on Thursday ... but between the howling wind and sideways sheets of rain, her poor little umbrella never stood a chance.\n      \n    \n          The video’s pure comedy ... Heidi was battling her rebellious canopy as it flipped inside out and thrashed from side to side as she desperately tried to keep it together.\n      \n\n          You can really see how wild the weather was -- and that brolly looked pretty sturdy too, but let’s be real … no one’s winning a showdown with Mother Nature.\n      \n    \n          It's unclear if she weathered the storm or blew off whatever she was doing, but one thing’s for sure, Heidi’s glam shoot totally went down the drain! ☔\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Heidi Klum\n              \n                          \n                Celebrity News\n              \n                          \n                Weather\n              \n                          \n                Viral\n              \n                          \n                Fairly Legal\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Heidi Klum Struggles With Umbrella in Gale Force Wind on NYC Rooftop, on Video",
      "image": [
        "https://imagez.tmz.com/image/29/16by9/2025/10/31/292f5abf4af84b579092f36b5c659f87_xl.jpg"
      ],
      "datePublished": "2025-10-31T19:17:39.000Z",
      "dateModified": "2025-10-31T19:17:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "CBS Eyeing Talent From Fox News Channel",
    "url": "https://www.tmz.com/2025/10/31/cbs-eyeing-talent-from-fox-news-channel/",
    "image": "https://imagez.tmz.com/image/e6/16by9/2025/10/31/e611be2977ea409ba324782770f78a5a_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-31T18:03:54.000Z",
    "description": "\n    \n                    \n                          CBS\n                          Network Wants to Hire Fox News Channel Talent\n                     ",
    "body": "\n    \n                    \n                          CBS\n                          Network Wants to Hire Fox News Channel Talent\n                      \n                  \n                        Published October 31, 2025 11:03 AM PDT\n                                                                      |\n                Updated October 31, 2025 12:25 PM PDT\n                                    \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          As rumors swirl about Gayle King's future on the CBS morning show, sources tell TMZ the network is trying to snag talent from Fox News Channel.\n      \n    \n          Sources with direct knowledge tell TMZ ... the new management at CBS News has their eye on \"multiple\" on-air people. We do not know who specifically, but we're told it's definitely more than one.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          It's interesting ... because new CBS News Editor-In-Chief Bari Weiss leans to the right of her predecessors, so it makes sense. Also, FNC is a ratings juggernaut, beating all of its cable competition by a landslide. The CBS morning show, by contrast, is a distant 3rd to its competitors.\n      \n\n          As for Gayle King's future at CBS, we're told the issue is not whether she's taken off the morning show ... it all comes down to money. Gayle pulls somewhere north of $10 million a year, and we're told the brass thinks it's way too much in today's media climate. So the issue comes down to $$$ ... which she addressed when she talked to us Friday after her show.\n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          Gayle has a very active social life, attending numerous evening events in NYC, and the early AM schedule is hard on her. So, we're told, it may be Gayle's decision whether to take a financial haircut and still maintain a pretty grueling schedule.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Gayle King\n              \n                          \n                CBS\n              \n                          \n                News\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "CBS Eyeing Talent From Fox News Channel",
      "image": [
        "https://imagez.tmz.com/image/e6/16by9/2025/10/31/e611be2977ea409ba324782770f78a5a_xl.jpg"
      ],
      "datePublished": "2025-10-31T18:03:54.000Z",
      "dateModified": "2025-10-31T18:03:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Freddy Krueger Star Robert Englund Brings Claw Glove to Hollywood Star Ceremony",
    "url": "https://www.tmz.com/2025/10/31/robert-englund-hollywood-star-freddy-krueger-halloween/",
    "image": "https://imagez.tmz.com/image/2b/16by9/2025/10/31/2bd1ee7025dd470e903c79cbc6811ec2_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-31T22:44:03.000Z",
    "description": "\n    \n                    \n                          Robert Englund\n                          1 ... 2 ... Freddy's Coming For...\n                     ",
    "body": "\n    \n                    \n                          Robert Englund\n                          1 ... 2 ... Freddy's Coming For...\n                          His Hollywood Star!!!\n                      \n                  \n                        Published October 31, 2025 3:44 PM PDT\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Robert Englund got his star on the Hollywood Walk of Fame ... and the dude totally paid spooky homage to the horror character he made an icon.\n      \n    \n          Here's the deal ... Englund was honored with a star on freakin' Halloween for his decades in the biz ... scaring the hell out of us as the nightmare-stalking serial killer, Freddy Krueger.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          And Englund made sure to give Freddy his due ... sporting the trademark knife-claw glove!\n      \n\n          During his speech ... RE gave serious love to the late legendary Wes Craven, who wrote and directed the film that kicked off the slasher franchise -- \"A Nightmare on Elm Street.\"\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          And just to be clear ... Robert is best known for being Freddy -- but the actor has appeared in more than 100 films, so he's been plenty busy in between the 'Nightmare' series.\n      \n    \n          Three ... Four ... He'll be back for more!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Robert Englund\n              \n                          \n                Wes Craven\n              \n                          \n                Movies\n              \n                          \n                Awards / Awards Shows\n              \n                          \n                Halloween\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Freddy Krueger Star Robert Englund Brings Claw Glove to Hollywood Star Ceremony",
      "image": [
        "https://imagez.tmz.com/image/2b/16by9/2025/10/31/2bd1ee7025dd470e903c79cbc6811ec2_xl.jpg"
      ],
      "datePublished": "2025-10-31T22:44:03.000Z",
      "dateModified": "2025-10-31T22:44:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]