[
  {
    "title": "Bill Maher Refuses to Do Stand-Up Comedy Again Because ‘I Could Get Shot by the Left or the Right’: ‘I Don’t Won’t to Be Out There in This Country, in This Political Atmosphere’",
    "url": "https://variety.com/2025/tv/news/bill-maher-refuses-stand-up-comedy-shooting-1236583874/",
    "image": "https://variety.com/wp-content/uploads/2025/11/P10ZA7W-e1763405866429.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-17T22:51:31.000Z",
    "description": "\n\tBill Maher told guest Patton Oswalt on the latest episode of the “Club Random” podcast that he is no longer interested in hitting the road for stand",
    "body": "\n\tBill Maher told guest Patton Oswalt on the latest episode of the “Club Random” podcast that he is no longer interested in hitting the road for stand-up comedy shows given the country’s intense political divide. The often-outspoken Maher regularly stirs up backlash from both sides of the political aisle on his HBO talk show “Real Time.” \n\n\t“I don’t want to be out there in this country, in this political atmosphere. I could get shot by the left or the right,” Maher said (via The Daily Beast). “It’s a good time to not be out there.”\n\t\n\n\tMaher also acknowledged that he is “tired of the travel” and “tired of being twice as funny as people who were selling twice as many tickets as me.” He noted that “because I’m on TV every week” it gives fans less incentive to buy tickets to his stand-up shows. \n\n\n\t“Not that I didn’t sell a lot of tickets and do great theaters—but I didn’t sell arenas,” Maher added. “And some people did, who, frankly, are not that great. But, you know, when the audience is 35 to 45, they don’t wanna see somebody 70… I just did my 13th HBO special. I feel like that’s a good body of work… I felt they all, they basically got better as it went along. I feel like the last one was the best one, which is a good way to get off.”\n\n\tMaher has upset the left in recent months by attacking “crazies” in the democratic party who have gone too “woke,” while he drew backlash from the right for speaking out against ABC’s suspension of Jimmy Kimmel last month. Maher made headlines in March when he said he was partial to “some of the things” Donald Trump is doing in his second administration as U.S. president, which drew scorn from fellow comedians like Marc Maron.\n\t\n\n\tAfter the shooting death of Charlie Kirk in September, Maher told viewers that it’s pointless to debate whether or not Democrats or Republicans are worse because “both sides” are guilty of rampant toxicity.\n\n\t“It’s a very ugly week in America with violence of all kinds: political violence, regular violence, a lot of people talking about a civil war. And then today in Congress, because Charlie Kirk got assassinated, [Colorado Representative] Lauren Boebert stood up and said, ‘We need to have a prayer.’ So they started to have a silent prayer. And then she started screaming, ‘No! Silent prayers get silent results.’ As if praying out loud gets big results,” Maher added.. “Then the Democrats started screaming at her that there was a school shooting in her state. I tell you, so far, the civil war is not very civil.”\n\n\tWatch Maher’s full conversation with Oswalt on the “Club Random” podcast in the video below.\n\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bill Maher Refuses to Do Stand-Up Comedy Again Because ‘I Could Get Shot by the Left or the Right’: ‘I Don’t Won’t to Be Out There in This Country, in This Political Atmosphere’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/P10ZA7W-e1763405866429.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-17T22:51:31.000Z",
      "dateModified": "2025-11-17T22:51:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "A Night in the Writers’ Room: Drama Writers Mix It Up on Writing Process, Time Spent in the Room and to Outline or Not to Outline",
    "url": "https://variety.com/2025/tv/news/night-writers-room-drama-gemmill-han-urman-harjo-ingelsby-1236583247/",
    "image": "https://variety.com/wp-content/uploads/2025/11/BUC_0880-10.jpg?crop=0px%2C104px%2C1200px%2C675px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-11-18T00:09:25.000Z",
    "description": "\n\tFrom the first question, Variety’s A Night in the Writers’ Room gathering of five drama showrunners was a lively affair as the scribes compared note",
    "body": "\n\tFrom the first question, Variety’s A Night in the Writers’ Room gathering of five drama showrunners was a lively affair as the scribes compared notes and reflected on how much television has changed in a short time.\n\n\tBut nothing sparked up the session, moderated by Emily Longeretta, Variety’s senior TV features editor, like the discussion of how each showrunner prefers to work — and what it takes for them to actually get work done.\n\t\n\n\tFor Jennie Snyder Urman, showrunner and executive producer of CBS’ “Matlock,” she has to free herself from the desk to get creative juices flowing. The lengths to which she goes to get her work done surprised her fellow panelists.\n\n\t“My writing process is tied to my walking,” Urman said during the panel held at the Pacific Design Center in West Hollywood. “I do that every day. I take my scripts for walks. My husband’s gotten calls that’s like, ‘We saw your wife in Tarzana and she’s in sweats and she’s got papers and she’s talking and he’s like, ‘she’s working.’ I just think better when I’m moving.”\n\n\tR. Scott Gemmill, showrunner and executive producer of HBO Max’s “The Pitt,” said he completely rejects the idea that writers’ rooms have to work all night.\n\n\t“I’m pretty slack about the writer’s room. I only work with the writers from like, 11 to 2. I feel like a small, quick meeting is something much more effective,” Gemmill said. “I encourage them to be off living life so that they can bring stories to the room. I don’t believe in being in the room for eight hours. I would be sound asleep. They would have to wake me up like four times.”\n\t\n\n\tSterlin Harjo, creator and showrunner of FX’s “The Lowdown,” chimed in with his preferred schedule: “I do 10 to 4.”\n\n\tGemmill added that there’s another key consideration for shows that are based in Los Angeles. “We come into work and it’s like, get your work done and get the hell outta here and beat traffic, and let’s do it again tomorrow.”\n\n\tBrad Ingelsby, creator and showrunner of HBO’s “Task,” brought an entirely different perspective. He’s a one-man-band on his series that stars Mark Ruffalo.\n\n\t“It’s just me in my office at home. I sit in the chair every day. I get up every day early in the morning and write until the kids get home. That’s my trick,” Ingelsby said. To which Gemmill injected: “You wanna come and sit with us for a while, just have some friends?”\n\n\tIngelsby took the joke in stride and added, “When people ask me for any advice about writing, I say that the only valuable piece of information I can give you is to sit in the chair every day. And I do it every day — I just sit in the chair.”\n\n\tHarjo then took up the thread.\n\n\t“I admire that because it’s what I want to do. What I want to do is be a disciplined writer,” Harjo said. “And I try. I’ll do certain things, but I usually end up like driving to a coffee shop, to office, to home, to a coffee shop, on a walk to a thing, and then like, never write.”\n\n\tHarjo’s candor likely encouraged Ingelsby to confess that he never writes scripts based on outlines. That also brought out multiple perspectives.\n\n\t“I don’t even know how to outline stories. That’s probably why I sit in my office so long every day. My brain doesn’t work like that,” Ingelsby said.\n\n\t“Do you just free write?” Urman asked.\n\n\t“What I like about writing is discovery. And when I do an outline that’s so strict and I’m so married to an outline that I lose that discovery,” Ingelsby explained.\n\n\t“Part of what I love about writing is the more time I spend with the characters, the better I can write them and the more complex and layered they become. So if I’m so married to a beat sheet, then I feel like there’s no discovery left. I’m just inputting these beats along the way. So I have some ideas. I kind of know where it goes emotionally. I think I know where the characters go, but I don’t really outline that well, which I know some of the executives don’t like, but it’s the only way I know how to do it.”\n\t\n\n\tJenny Han, creator and showrunner of Amazon’s “The Summer I Turned Pretty,” offered the perspective of being an author who is adapting her own trio of YA novels. When asked by Longeretta about the process of pacing out episodes over multiple seasons, Han admitted that her roadmap for the TV series changed over time.\n\n\t“My vision was always to do just the three seasons, for the three books,” Han said. “And then I think it was during Season 2 when I was realizing — or maybe it was the beginning of Season 3 — we asked for another episode and they were like, ‘Great.’ And so we moved from 10 to, it was seven first season. Second season, we had eight, then we had 10 on the third. And then I was like, ‘I think I need one more.’ And then I’m like, you know, actually I think I need a movie.’ And luckily, Prime Video was happy to accommodate that wish.”\n\n\t(Pictured: R. Scott Gemmill, Jenny Han, Sterlin Harjo, Brad Ingelsby and Jennie Snyder Urman)\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "A Night in the Writers’ Room: Drama Writers Mix It Up on Writing Process, Time Spent in the Room and to Outline or Not to Outline",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/BUC_0880-10.jpg?crop=0px%2C104px%2C1200px%2C675px&resize=1000%2C563"
      ],
      "datePublished": "2025-11-18T00:09:25.000Z",
      "dateModified": "2025-11-18T00:09:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Music Industry Moves: Roc Nation Distribution Unveils Platform Designed for Independent Artists",
    "url": "https://variety.com/2025/music/news/roc-nation-distribution-new-platform-independent-artists-1236583959/",
    "image": "https://variety.com/wp-content/uploads/2025/06/CLIPSE_GRYBGND_10-e1749479643320.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-17T22:07:41.000Z",
    "description": "\n\tRoc Nation Distribution has launched a new dashboard designed to empower its independent artists. \n\n\tRoc Nation’s in-house distribution arm describe",
    "body": "\n\tRoc Nation Distribution has launched a new dashboard designed to empower its independent artists. \n\n\tRoc Nation’s in-house distribution arm describes the platform as its effort to maximize artists’ “global audience reach” towards fan bases, “unlocking new business opportunities by offering all-encompassing tools, services and resources in a centralized hub,” according to a press release. \n\n\n\tAs part of the announcement, independent artists will now be able to sign up and begin distributing their music directly through Roc Nation Distribution’s new dashboard. Whether artists are releasing their own music or having their representatives upload on their behalf, the platform is open to musicians seeking to leverage its distribution and analytics tools.\n\t\n\n\t“The introduction of this new dashboard will be a game-changer for independent artists releasing music with Roc Nation Distribution,” Roc Nation Distribution President Krystian Santini said. “It’s a one-stop shop that will enable artists to receive a holistic understanding of their followers, so they can build impactful strategies and broaden their music’s reach without financial barriers. This dashboard is democratizing access to tools and information historically reserved for the very few established label superstars. Our technology is uniquely ours and sets a new standard with no equivalent in today’s music industry.”\n\n\tThe dashboard will be accessible to Roc Nation Distribution artists such as Clipse, Rapsody, Flau’jae, Yailin La Mas Viral, The LOX, SAINt JHN, Westside Gunn, Conway The Machine, Jay Electronica, Bootsy Collins, and many more who distribute with Roc Nation Distribution.\n\t\n\n\tThe announcement comes after Clipse just earned five Grammy nominations, marking a major milestone for Roc Nation Distribution. The group scored nominations for album of the year and best rap album for “Let God Sort Em Out” as well as best rap performance for “Chains & Whips,” best rap song for “The Birds Don’t Sing,” and best music video for “So Be It.”\n\n\t+ Sony Music Publishing has promoted Dee Hale to senior vice president of film, television and TV administration. Hale will be based in the company’s Nashville office and continue to report to executive vice president, worldwide administration, Dale Esworthy.\n\n\tIn the new role, Hale will be the primary administrative contact for Sony Music Publishing’s studio clients and provide ongoing support to the company’s UK studio clients. She will also continue her role as co-chair of the Society and Publisher Forum A/V Committee.\n\n\tHale has been with Sony Music Publishing for over 30 years, first joining in 1993 as director of film and television music administration. During her time at the company, she has worked with a variety of production studios such as Sony Pictures, Tyler Perry Studios, A&E, Discovery, Twentieth Century Studios and Apple. \n\n\t“I love working for a great company, with great people, doing something I love! It’s been an honor to work with our amazing studio clients and so many others throughout the world to take this part of the business to a higher level, and I am excited for what’s ahead,” shared Hale.\n\n\t“Dee’s dedication to songwriters and composers is unsurpassed and unwavering,” added Esworthy. “Her leadership as co-chair of the Society Publisher Forum’s AV Data Exchange working group has been instrumental in strengthening the global administration practices for composers at SMP and beyond. I look forward to seeing Dee step into this new role and am excited to see what she’ll achieve next.”\n\n\t+ Warner Music Group today announced that Leho Nigul is being promoted to chief technology officer, WMG, from his current role as senior vice president, engineering. Effective Dec. 1, Nigul will lead WMG’s technology strategy, team, and product roadmap, reporting to CEO Robert Kyncl. \n\n\tAt the same time, it was announced that Ariel Bardin has decided to leave the company after a three-year tenure as president of technology. He will remain with the company through the end of 2025 to ensure the continuity of key initiatives and a smooth leadership transition.\n\t\n\n\tHaving joined WMG in 2023, Nigul has overseen engineering teams responsible for wide-ranging initiatives covering distribution, global licensing, royalty management, fan engagement, and AI projects, among others. \n\n\tDuring his time at WMG, Bardin has meaningfully upgraded the company’s tech infrastructure and processes. Under his leadership, the company has launched cutting edge tools for artists, songwriters, and employees, simplified and strengthened its global supply chain, and delivered a whole suite of improvements to its data systems.\n\n\tNigul said, “WMG’s dynamic approach to pioneering the future of music is creating powerful, new opportunities for our artists, songwriters, and teams. I’m delighted to be passed the baton by Ariel, my long-time friend and colleague. With strong foundations in place, we’ll continue to help drive growth, efficiency, and an expanded suite of services for the creative community.”\n\n\tBardin said, “It has been an honor to collaborate with the incredible teams at WMG and serve our extraordinary artists and songwriters. Together, we’ve achieved so much, and I’m pleased to be planning my next opportunity knowing the company is well positioned to win over the long term.”\n\n\t+ Jeremy Vuernick has been named executive vice president, Atlantic Music Group, joining AMG’s global leadership team. In this new post, reporting jointly to AMG CEO Elliot Grainge and Atlantic UK Co-Presidents Ed Howard and Briony Turner, Vuernick will be based in London and work closely with the company’s UK and U.S. teams to sign and develop artists with global potential.\n\n\tIn 2024, Vuernick founded the Los Angeles-based independent company Queens Road Music in partnership with Atlantic. Prior to launching Queens Road Music, he spent over a decade as an executive at Capitol Music Group, most recently serving as president of A&R. While at CMG, Vuernick oversaw the company’s portfolio of labels, developing global superstar talent across genres.\n\n\tEd Howard and Briony Turner noted, “This is the next exciting step to further link our UK and US teams to super-serve our artists and their visions. With Jeremy’s impressive A&R track record and stellar relationships, he’ll be a fantastic addition to our team, as we work together to discover and elevate the next generation of global superstars.”\n\t\n\n\tGrainge said: “I have worked with Jeremy for a number of years and I’m excited to officially welcome him into the AMG family. He comes to us with outstanding experience, instincts, and passion for artists, so he’ll be an ace addition to our newly aligned teams. Under the expert leadership of Ed and Briony, Atlantic UK has been a formidable source of chart-topping, game-changing artistry. With Jeremy now based in London, we are continuing to build our bridge across the ocean, ramping up our collective A&R and cultural firepower.”\n\n\t+ Merlin has appointed Charlie Lexton as its CEO, effective Jan. 1 2026.\n\n\tLexton, who succeeds Jeremy Sirota, has worked for Merlin since its inception, initially alongside founding CEO, Charles Caldas. Most recently, Lexton has served as Merlin’s COO since April 2020.\n\n\tHe has been at the centre of key milestones throughout Merlin’s history, from the negotiation of its suite of DSP and social media deals to the recent announcement of its groundbreaking partnership with the pioneering AI audio company, ElevenLabs. \n\n\tCommenting on his appointment, Lexton said: “I am delighted at the opportunity to lead this organisation. My focus is on our members—the most significant grouping of independent music companies in the world—and on the Merlin team, our incredibly hard working and dedicated staff. I can do nothing without the support of our team. And without our members, there is no Merlin.”\n\n\tOutgoing Merlin CEO Jeremy Sirota remarked: “Charlie has been a great partner in evolving Merlin into what it is today. He consistently delivers – from his unwavering commitment to the Merlin team to pioneering the first significant AI deal with ElevenLabs to empowering our members via Merlin Insights. Next year, I’m proud he will champion Merlin Engage to empower the next generation of female leaders for independent music. I’m excited for Charlie and the team to write Merlin’s next chapter.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Music Industry Moves: Roc Nation Distribution Unveils Platform Designed for Independent Artists",
      "image": [
        "https://variety.com/wp-content/uploads/2025/06/CLIPSE_GRYBGND_10-e1749479643320.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-17T22:07:41.000Z",
      "dateModified": "2025-11-17T22:07:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Heat 2’: Christian Bale Circling Role in Michael Mann’s Long-Awaited Sequel",
    "url": "https://variety.com/2025/film/news/heat-2-christian-bale-michael-mann-sequel-1236583854/",
    "image": "https://variety.com/wp-content/uploads/2025/11/P115RK74.jpg?crop=0px%2C178px%2C1998px%2C1125px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-11-17T21:30:00.000Z",
    "description": "\n\tChristian Bale is being eyed for a role in Michael Mann‘s “Heat 2,” the long-awaited sequel to the filmmaker’s 1995 crime drama starring Al Pacino a",
    "body": "\n\tChristian Bale is being eyed for a role in Michael Mann‘s “Heat 2,” the long-awaited sequel to the filmmaker’s 1995 crime drama starring Al Pacino and Robert De Niro, according to a source with knowledge of the production.\n\n\tBale previously starred in Mann’s “Public Enemies,” and, if deals close, the reunion could see the Oscar winner starring alongside Leonardo DiCaprio, who has also been eyed for a leading role.\n\n\n\tAmazon MGM Studios and United Artists are expected to start production on the film in 2026. (The project received a sizable $37.2 million in tax credits from the California Film Commission to shoot in the state.) Plot details for “Heat 2” haven’t been revealed, though Mann adapted the screenplay from the 2022 New York Times-bestselling novel that he co-wrote with Meg Gardiner. Producers will include Mann, Jerry Bruckheimer, and UA’s Scott Stuber and Nick Nesbitt. Eric Roth and Shane Salerno will serve as executive producers.\n\t\n\n\t“Heat,” which celebrates its 30th anniversary in December, follows an explosive face-off between a Los Angeles Police Department detective (Pacino) and a career thief (De Niro). The film was a box office hit, earning $187 million globally (not adjusted for inflation) against a $60 million budget.\n\n\tBale’s chameleon-like filmography spans from his mainstream breakout in “American Psycho” and the dual role of Bruce Wayne and Batman in “The Dark Knight” trilogy to portraying the likes of Vice President Dick Cheney in “Vice” as well as race car driver Ken Miles in “Ford v. Ferrari,” which Mann executive produced. Bale will next be seen as Frankenstein’s monster opposite Jessie Buckley in Maggie Gyllenhaal’s “The Bride!”. He’ll also portray Raiders owner Al Davis in “Madden” from David O. Russell. He is repped by WME.\n\t\n\n\tDeadline first reported news of Bale’s potential involvement. Amazon had no comment.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Heat 2’: Christian Bale Circling Role in Michael Mann’s Long-Awaited Sequel",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/P115RK74.jpg?crop=0px%2C178px%2C1998px%2C1125px&resize=1000%2C563"
      ],
      "datePublished": "2025-11-17T21:30:00.000Z",
      "dateModified": "2025-11-17T21:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Monday Night Football’: How to Watch the NFL Game Live Online Without Cable",
    "url": "https://variety.com/2025/shopping/news/how-to-watch-monday-night-football-online-free-1236145789/",
    "image": "https://variety.com/wp-content/uploads/2025/11/NFL-Dallas-Cowboys-vs.-Las-Vegas-Raiders-VR-Featured.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-17T21:15:04.000Z",
    "description": "\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.\n\n\tEnd a lon",
    "body": "\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.\n\n\tEnd a long weekend of NFL thrills with even more NFL actions on “Monday Night Football.”\n\n\tFor Week 11, “MNF” features the Dallas Cowboys (3-5-1) facing off against the Las Vegas Raiders (2-7) at Allegiant Stadium in Las Vegas, Nevada, with kickoffs at 8:15 p.m. ET/5:15 p.m. PT, on ESPN or ABC. “Monday Night Football” takes place on Monday, Nov. 17.\n\n\tSince “Monday Night Football” broadcasts on ABC or ESPN, the game is also available to watch online with web-based cable alternatives, like DirecTV — which offer a 5-day, and start at $49.99/month for new subscribers.\n\n\n\tABC is available with a subscription to and Fubo, Hulu + Live TV and Sling Orange + Blue (depending on your local TV market). Additionally, “Monday Night Football” livestreams on NFL+ for subscribers only.\n\n\tNot a subscriber? You can purchase the livestream feed of the game starting at $6.99/month for the standard plan, or $49.99/year when you sign up for an annual subscription here. In addition, you can go with NFL+ Premium (comes with NFL Red Zone) for $14.99/month, or $99.99/year for the annual plan.\n\n\tAside from “Monday Night Football,” NFL+ is the home of all things NFL. The streaming service comes with live out-of-market local and primetime regular season games. It comes with access to postseason games, such as playoff games, the Pro Bowl and even the Super Bowl, with local and national radio game broadcasts, the NFL Network, NFL Films archive and more. It’s all streamable on smartphones, tablets, web browsers and smart TVs.\n\n\tTickets to the game are still available on TicketNetwork, Vivid Seats and SeatGeek. In fact, you can save $150 off when you spend $500 with promo code VARIETY150, or $300 off when you spend $1,000 with promo code VARIETY300 at TicketNetwork.com.\n\n\n\tIn addition, you can use code VAR30 to take $20 off your ticket purchase at VividSeats.com, or you can use promo code VARIETY10 to save $10 at SeatGeek.com.\n\n\tStarting at 8:15 p.m. ET/5:15 p.m. PT, “Monday Night Football” broadcasts on ABC or ESPN via DirecTV, as well as livestreams on NFL+ and ESPN Unlimited.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Monday Night Football’: How to Watch the NFL Game Live Online Without Cable",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/NFL-Dallas-Cowboys-vs.-Las-Vegas-Raiders-VR-Featured.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-17T21:15:04.000Z",
      "dateModified": "2025-11-17T21:15:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Christopher Nolan Shot ‘The Odyssey’ Entirely With Imax Cameras by Creating New Equipment So ‘You Can Shoot a Foot’ Away From an Actor’s Face and ‘Get Usable Sound’",
    "url": "https://variety.com/2025/film/news/christopher-nolan-explains-odyssey-imax-cameras-1236583667/",
    "image": "https://variety.com/wp-content/uploads/2025/07/matt-damon-odyssey.jpg?crop=0px%2C12px%2C1201px%2C675px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-11-17T22:15:26.000Z",
    "description": "\n\tChristopher Nolan‘s “The Odyssey” is making film history as the first narrative feature shot entirely with Imax cameras, and it’s all thanks in part",
    "body": "\n\tChristopher Nolan‘s “The Odyssey” is making film history as the first narrative feature shot entirely with Imax cameras, and it’s all thanks in part to a child and a David Bowie song. The film’s cinematographer, Hoyte van Hoytema, revealed to Empire magazine that he shot Imax test footage of a kid reading Bowie’s “Sound And Vision” lyrics to prove whether or not Imax film cameras were advanced enough to record dialogue.\n\n\t“I presented Chris with a very big close-up of a child on the IMAX screen, reciting David Bowie’s ‘Sound And Vision’ from a piece of paper,” van Hoytema said. “It was very touching: that level of intimacy in both image and sound, fused together, projected in the theatre.”\n\t\n\n\tNolan said the results were “electrifying,” adding: “We never would have been able to get those shots before.” The footage proved once and for all that Nolan could finally make an entire movie shot entirely with Imax cameras, whereas he was limited to mostly action scenes in the past since Imax cameras were too noisy to film dialogue scenes up close to the actor. A new Imax film casing called a “blimp” was created to significantly reduce the noise Imax cameras produce.\n\n\t“The blimp system is a game-changer,” Nolan said. “You can be shooting a foot from [an actor’s] face while they’re whispering and get usable sound. What that opens up are intimate moments of performance on the world’s most beautiful format.”\n\n\tNolan has been building toward making a movie entirely with Imax cameras since 2008, when “The Dark Knight” became the first Hollywood movie to utilize Imax cameras to shoot select action scenes. Since then, Nolan has used Imax cameras for more scenes with every new release. His 2023 Oscar-winning “Oppenheimer” was the first movie to use Imax black-and-white 65mm film.\n\t\n\n\t“The Odyssey” is being shot by van Hoytema, who has collaborated with Nolan on “Interstellar,” “Dunkirk,” “Tenet” and “Oppenheimer.” He won the best cinematography Oscar for the latter film and spoke to Variety at the time about working with Nolan and Kodak to create the first stock of Imax 65mm black-and-white film.\n\n\t“Black and white film doesn’t exist for 65 millimeters, so our first challenge was starting to talk to Kodak about if they could provide us with the necessary film stock that we needed for this film,” van Hoytema said. “We needed to re-engineer the cameras as well because those cameras have these pressure plates behind the film gates that are made out of metal and the backing is much thinner than color stock. The light would bleed back into the films creating all these artifacts.”\n\n\tNolan previously revealed to Empire magazine that he “shot over 2 million feet of film” during the making of “The Odyssey,” which filmed for 91 days earlier this year. Per Kodak, a foot of 65mm film costs $1.50. This means Nolan’s film used around $3 million worth of film.\n\n\tMatt Damon reunites with Nolan after “Interstellar” and “Oppenheimer” to headline “The Odyssey” in the lead role of Odysseus. Tom Holland plays his son, Telemachus. The sprawling ensemble also includes Anne Hathaway, Zendaya, Lupita Nyong’o, Robert Pattinson, Charlize Theron and Jon Bernthal.\n\n\t“As a filmmaker, you’re looking for gaps in cinematic culture, things that haven’t been done before,” Nolan told Empire about why he chose to adapt Homer’s Greek epic. “And what I saw is that all of this great mythological cinematic work that I had grown up with – Ray Harryhausen movies and other things – I’d never seen that done with the sort of weight and credibility that an A-budget and a big Hollywood, IMAX production could do.”\n\n\t“The Odyssey” opens in theaters July 17, 2026, from Universal.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Christopher Nolan Shot ‘The Odyssey’ Entirely With Imax Cameras by Creating New Equipment So ‘You Can Shoot a Foot’ Away From an Actor’s Face and ‘Get Usable Sound’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/07/matt-damon-odyssey.jpg?crop=0px%2C12px%2C1201px%2C675px&resize=1000%2C563"
      ],
      "datePublished": "2025-11-17T22:15:26.000Z",
      "dateModified": "2025-11-17T22:15:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kit Harington ‘Felt Odd’ Kissing Sophie Turner in New Movie After Playing ‘Game of Thrones’ Siblings, Jokes He Stood on an ‘Apple Box Because She’s a Foot Taller Than Me’",
    "url": "https://variety.com/2025/film/news/kit-harington-kissing-sophie-turner-movie-game-of-thrones-1236583937/",
    "image": "https://variety.com/wp-content/uploads/2025/11/P1146BO1-e1763409904433.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-17T21:05:15.000Z",
    "description": "\n\tKit Harington recently told E! News that kissing Sophie Turner during the filming of their new horror movie was “weird” after they spent nearly a de",
    "body": "\n\tKit Harington recently told E! News that kissing Sophie Turner during the filming of their new horror movie was “weird” after they spent nearly a decade playing siblings Jon Snow and Sansa Stark on all eight seasons of HBO’s “Game of Thrones,” which concluded in 2019. Harington and Turner reunited to film “The Dreadful” last fall. Turner said on “Late Night With Seth Meyers” in August that it was “vile” having to kiss her former onscreen brother Harington.\n\t\n\n\t“She was one that sent that movie to me and somehow didn’t see what I saw in it,” Kit told E! News while promoting his new role in “The Family Plan 2” on Apple TV. “I was like, ‘These guys, these are lovers, right?’ I felt very odd about that. But it was a good chance to be with her again and work together… It was slightly embarrassing, having to get on an apple box to kiss her because she’s about a foot taller than me. But other than that, my dignity was pretty intact.”\n\n\n\tHarington added in the interview: “What was lovely is that we got on set together and our friendship completely ignited again. It felt like being with family. It really did.”\n\n\tSet in the 15th century, “The Dreadful” follows Anne (Turner) and her mother-in-law Morwen, who live on the outskirts of society. When a man (Harington) from their past returns, he triggers a chain of events that upends Anne’s life. The film — written and directed by Natasha Kermani — also stars Marcia Gay Harden, Laurence O’Fuarain and Jonathan Howard.\n\n\tTurner appeared on “Late Night With Seth Meyers” in August and revealed for the first time she had to film kissing scenes with Harington.\n\t\n\n\t“So, I sent the script to Kit, and he kind of sent me a message back going like, ‘Yeah, I’d love to, but this is going to be really fucking weird, Soph,’” Turner said. “And I was like, ‘What is he talking about?’ Then I was reading [the script] and it’s like, ‘Kiss, kiss, sex, kiss, sex…’ And then I’m like, ‘Oh, shoot, that’s my brother.’ We put it out of our minds, and then we get on set and it’s the first kissing scene, and we are both retching. Like, really, it is vile. It was the worst.”\n\n\tA release date for “The Dreadful” has yet to be announced.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kit Harington ‘Felt Odd’ Kissing Sophie Turner in New Movie After Playing ‘Game of Thrones’ Siblings, Jokes He Stood on an ‘Apple Box Because She’s a Foot Taller Than Me’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/P1146BO1-e1763409904433.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-17T21:05:15.000Z",
      "dateModified": "2025-11-17T21:05:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cynthia Erivo and Ariana Grande Skipping Interviews at ‘Wicked: For Good’ New York Premiere",
    "url": "https://variety.com/2025/film/news/cynthia-erivo-ariana-grande-skipping-interviews-wicked-for-good-ny-premiere-1236583962/",
    "image": "https://variety.com/wp-content/uploads/2025/11/GettyImages-2246093922.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-17T21:22:49.000Z",
    "description": "\n\tCynthia Erivo and Ariana Grande won’t be doing interviews at Monday night’s New York City premiere of “Wicked: For Good.”\n\n\tUniversal reps informed ",
    "body": "\n\tCynthia Erivo and Ariana Grande won’t be doing interviews at Monday night’s New York City premiere of “Wicked: For Good.”\n\n\tUniversal reps informed members of the media just hours before the carpet is set to open at Lincoln Center that “Cynthia is not feeling well and has lost her voice, therefore she and Ariana will not be doing interviews this evening.”\n\n\tVariety has learned that Grande decided to skip interviews in solidarity with Erivo. The pair is still set to pose for photos on the carpet.\n\t\n\n\tCo-stars Jonathan Bailey, Ethan Slater, Bowen Yang, Marissa Bode, Colman Domingo, Michelle Yeoh, Jeff Goldblum and director Jon M. Chu are expected to attend the premiere.\n\n\n\tSadly, this is another unexpected hiccup in the “Wicked: For Good” world promo tour. Grande was unable to make it to the first premiere in São Paulo, Brazil, on Nov. 4 because of airplane mechanical issues. Last week, Grande was grabbed by a man in Singapore who jumped over the barricades onto the carpet — with Erivo springing into action to push the man off her co-star.\n\n\tOn Saturday, Erivo talked about their “Wicked” journey during a conversation moderated by Variety’s Clayton Davis. “We have come through some shit,” she said. “I mean, fuck even this last week, let’s be honest.”\n\n\tErivo and Grande attended the Governors Awards in Los Angeles on Sunday night. Erivo presented Debbie Allen’s honorary Oscar. Grande walked the red carpet and spoke to some members of the press, including Variety.\n\n\t“For Good” comes a year after the first “Wicked” movie was released. “Wicked” went on to earn more than $746 million in worldwide ticket sales and 10 Oscar nominations, including acting nods for Grande and Erivo as well as one for best picture.\n\t\n\n\tThe second and final movie sees Elphaba (Erivo) continuing her Wicked Witch of the West crusade to bring down the Wizard (Goldblum). Meanwhile, Glinda’s (Grande) popularity rises as she gets ready to marry Fiyero (Bailey).\n\n\t“Wicked: For Good” is in theaters Nov. 21.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cynthia Erivo and Ariana Grande Skipping Interviews at ‘Wicked: For Good’ New York Premiere",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/GettyImages-2246093922.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-17T21:22:49.000Z",
      "dateModified": "2025-11-17T21:22:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Shaquille O’Neal to Lend Boost to Warner’s ‘Dunkman’ Basketball Competition",
    "url": "https://variety.com/2025/tv/news/shaquille-oneal-dunkman-basketball-reality-series-warner-1236583942/",
    "image": "https://variety.com/wp-content/uploads/2009/07/oneal_shaquille.jpg?w=192&h=128&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-17T21:00:00.000Z",
    "description": "\n\t“Inside the NBA” has migrated over to ESPN, but TNT still has a few other jobs for some of that popular studio show’s hosts.\n\n\tShaquille O’Neal will",
    "body": "\n\t“Inside the NBA” has migrated over to ESPN, but TNT still has a few other jobs for some of that popular studio show’s hosts.\n\n\tShaquille O’Neal will serve as a judge along with other NBA greats including Vince Carter, Dwight Howard, Nate Robinson and Mac McClung, and Chris Webber on “Dunkman,” a six-episode reality competition program set to air across Warner Bros. Discovery’s TNT, truTV and HBO Max in December.\n\n\n\tIn “Dunkman,” 40 amateur dunkers from around the globe will compete for a $200,000 grand prize. And while the premise may not prove shocking, what’s interesting is that Warner’s TNT Sports is continuing to find ancillary roles for O’Neal and others even as the company’s flagship sports program becomes a property that will be more associated with Disney’s ESPN.\n\t\n\n\tAdam Lefkoe , a TNT Sports commentator and podcaster who has worked with O’Neal in the past  will host the program, which starts on Thursday, December 4 at 7 p.m. and 8 p.m., and airs in the same hours on two subsequent weeks. Jalen Rose, the former ESPN commentator and host, will appear as an analyst.\n\n\tThe show will give Warner some association with basketball after the company lost its NBA rights after the end of the league’s previous season, cutting ties after a decades-long relationship. The NBA’s current rights deal puts its games on properties tied to NBCUniversal, Amazon and Disney.\n\n\tWarner continues to produce “Inside the NBA,” and there have been discussions about launching a more general sports-commentary program featuring the “Inside” hosts for Warner’s networks. O’Neal has worked with Charles Barkley, Ernie Johnson and Kenny Smith for decades. Smith has signed a deal with ESPN that will result in him making appearances on the Disney network’s shows including “First Take.” Johnson has been expected to stay to work with Warner, where he also has MLB duties.\n\t\n\n\tThe new program will add to O’Neal’s many media activities. He also works as a popular commercial pitchman for companies including The General, an insurance purveyor. \n\n\t“Dunkman” will take place at Overtime Elite Arena in Atlanta. The series is produced by TNT Sports in association with A. Smith & Co, producer of reality series ranging from “Kitchen Nightmares” to “Titan Games,” and Authentic Brands Group.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Shaquille O’Neal to Lend Boost to Warner’s ‘Dunkman’ Basketball Competition",
      "image": [
        "https://variety.com/wp-content/uploads/2009/07/oneal_shaquille.jpg?w=192&h=128&crop=1"
      ],
      "datePublished": "2025-11-17T21:00:00.000Z",
      "dateModified": "2025-11-17T21:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The 25 Best Hallmark Christmas Movies, Ranked",
    "url": "https://variety.com/lists/best-hallmark-christmas-movies-ranked/",
    "image": "https://variety.com/wp-content/uploads/2023/11/Hallmark-Ranking.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-17T20:24:42.000Z",
    "description": "\n\t\n\t\t\t\n\t\t\t\t\n\t\n\t\n\tNov 17, 2025 12:24pm PT\t\n\t\n\n\t\t\t\n\n\n\t\t\t\n\t\t\t\n\t\n\n\t\n\n\t\t\n\t\n\t\t\t\t\n\n\tIt’s officially Christmas movie season — in fact, at the Hallmark Channel",
    "body": "\n\t\n\t\t\t\n\t\t\t\t\n\t\n\t\n\tNov 17, 2025 12:24pm PT\t\n\t\n\n\t\t\t\n\n\n\t\t\t\n\t\t\t\n\t\n\n\t\n\n\t\t\n\t\n\t\t\t\t\n\n\tIt’s officially Christmas movie season — in fact, at the Hallmark Channel, it begins in October. While there have been changes behind-the-scenes at the network, one thing remains the same: Their holiday cheer.\n\n\tThe channel first launched “Countdown to Christmas,” during which more than 20 new holiday movies premiere between October and December, in 2010. In 2013, Hallmark Movies and Mysteries rolled out their own version of “Countdown to Christmas” with “Miracles of Christmas” (originally “The Most Wonderful Movies of Christmas” and then “The Most Wonderful Miracles of Christmas”), airing at least 15 original movies during the same months.\n\n\t“Christmas Under Wraps,” starring Candace Cameron Bure and David O’Donnell, debuted in 2014 and still holds the record for Hallmark’s highest-ever broadcast premiere ratings. Bure stars in four of the 10 most-viewed Christmas movies on the network, which also include “Switched for Christmas,” “The Christmas Train” and “A Royal Christmas.”\n\n\tSince, the company has partnered with a plethora of brands, including the Kansas City Chiefs and the Buffalo Bills, expanding their reach even further. Still, they remain the top destination for holiday movies.  \n\n\tHere, Variety ranks the best Hallmark holiday movies off all time to rewatch this year on demand or on Hallmark+.\n\n\n\t\t\t\n\t\t\t\n\t‘The Most Wonderful Time of the Year’ (2008)\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Hallmark Media\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\tCast: Brooke Burns, Warren Christie, Henry Winkler\n\n\tCome for Henry Winkler, of course; stay for the way this story really does include an entire family and not just a couple.\n\n\t\t\n\t\t\t\n\t\t\t\n\t‘Christmas in Vienna’ (2020)\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: FILMSTILLS.AT\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\tCast: Sarah Drew and Brennan Elliott\n\n\tCome for Austria and Romania — that’s where the movie filmed and it’s quite a sight; stay for Drew and Elliott’s connection. It takes some time, but when they get there, it’s rather pleasant.\n\n\t\t\n\t\t\t\n\t\t\t\n\t‘Snow Bride’ (2013)\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Hallmark\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\tCast: Patricia Richardson, Katrina Law and Jordan Belfi\n\n\tCome for a woman tumbling down a snowy mountain in a wedding dress that isn’t hers; stay for a surprising twist and a mother who actually likes the woman pursuing her son.\n\n\t\t\n\t\t\t\n\t\t\t\n\t‘The Christmas Train’ (2017)\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Ricardo Hubbs\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\tCast: Kimberly Williams-Paisley, Dermot Mulroney, Danny Glover, Joan Cusack\n\n\tCome for Danny Glover, of course; stay for the cross-country train ride full of actual magic and some of the greatest actors in the channel’s history.\n\n\t\t\n\t\t\t\n\t\t\t\n\t‘The Christmas House’ (2020)\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Luba Popovic\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\tCast: Robert Buckley, Ana Ayora, Jonathan Bennett\n\n\tCome for the first Hallmark movie to prominently feature a same-sex couple; stay for three different creative storylines woven together.\n\n\t\t\n\t\t\t\n\t\t\t\n\t‘Christmas Waltz’ (2020)\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Hallmark\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\tCast: Lacey Chabert and Will Kemp\n\n\tCome for the dance lessons — truly, they’re so fun! Stay for the chemistry.\n\n\t\t\n\t\t\t\n\t\t\t\n\t‘Christmas Town’ (2019)\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Hallmark Media\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\tCast: Candace Cameron Bure, Tim Rozon\n\n\tCome for an adoption storyline finally being the focus; stay for the excellent chemistry between Bure and Rozon, the world’s easiest going cat and a magical twist.\n\n\t\t\n\t\t\t\n\t\t\t\n\t‘Write Before Christmas’ (2019)\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Allister Foster\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\tCast: Torrey DeVitto, Chad Michael Murray\n\n\tCome for a “One Tree Hill” reunion you didn’t know you needed; stay for an early-movie kiss — with Murray dressed as Santa.\n\n\t\t\n\t\t\t\n\t\t\t\n\t‘Christmas at Pemberley Manor’ (2018)\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Hallmark\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\tCast: Jessica Lowndes and Michael Rady\n\n\tCome for a very sweet love story at a gorgeous manor; stay for an independent woman standing up to her boss — portrayed by Elaine Hendrix — that will give any “Parent Trap” fan delight.\n\n\t\t\n\t\t\t\n\t\t\t\n\t‘Road to Christmas’ (2018)\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Ryan Plummer\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\tCast: Chad Michael Murray, Jessy Schram\n\n\tCome for a TV producer falling for the son of the host of her annual special; stay for a brother storyline that surprisingly tugs at heartstrings.\n\n\t\t\n\t\t\t\n\t\t\t\n\t‘Christmas Getaway’ (2017)\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Kailey Schwerman\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\tCast: Bridget Regan and Travis Van Winkle\n\n\tCome for Van Winkle as a charming widower who loves his mom and daughter; stay for the independent woman who enjoys traveling around and seeing the world — alone!\n\n\t\t\n\t\t\t\n\t\t\t\n\t‘A Royal Christmas’ (2014)\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Hallmark\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\tCast: Lacey Chabert, Stephen Hagan and Jane Seymour\n\n\tCome for a different format: a happy couple who have been in love for years hit a hurdle when he casually reveals he’s royalty; stay for Jane Seymour as the royal, very cranky Queen of Cordinia.\n\n\t\t\n\t\t\t\n\t\t\t\n\t‘Christmas at the Plaza’ (2019)\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Hallmark\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\tCast: Elizabeth Henstridge and Ryan Paevey\n\n\tCome for the Plaza at Christmas — not since “Home Alone 2” has it looked so magical; stay for the most cringey yet adorable karaoke scene ever.\n\n\t\t\n\t\t\t\n\t\t\t\n\t‘Where Are You Christmas?’ (2023)\n\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\n\tCast: Lyndsy Fonseca, Michael RadyCome for the updated twist on “It’s a Wonderful Life” and a rare new storyline for a Hallmark movie. Stay for a surprising and touching military storyline and a new side of Rady than seen before.\n\t\t\n\t\t\t\n\t\t\t\n\t‘A Wish for Christmas’ (2017)\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Bettina Strauss\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\tCast: Paul Greene, Lacey Chabert\n\n\tCome for the dynamic of two fan-favorites; stay for the way Sara (Chabert) finds herself and her confidence, both at home and at work.\n\n\t\t\n\t\t\t\n\t\t\t\n\t‘A Christmas Detour’ (2015)\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Marcel Williams\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\tStarring Candace Cameron Bure, Paul Greene\n\n\tCome for the classic story of travelers getting stuck in a snowstorm at the holidays, but add in the fact that one is traveling with a giant mood board; stay for the married couple who spend most of their time bickering and admit sometimes, the spark fizzles.\n\n\t\t\n\t\t\t\n\t\t\t\n\t‘The Christmas Cottage’ (2017)\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Ricardo Hubbs\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\tCast: Merritt Patterson, Steve Lund\n\n\tCome for the gorgeous cabin in the woods that magically brings people back together at Christmastime; stay for fireside chats and hot cocoa.\n\n\t\t\n\t\t\t\n\t\t\t\n\t‘Christmas Under Wraps’ (2014)\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Hallmark Media\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\tCast: Candace Cameron Bure, David O’Donnell\n\n\tCome for a doctor moving to Alaska with only heels and no boots; stay for an appearance by the real Santa, who also has high cholesterol. \n\n\t\t\n\t\t\t\n\t\t\t\n\t‘Marry Me At Christmas’ (2020)\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Ricardo Hubbs\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\tCast: Rachel Skarsten and Trevor Donovan\n\n\tCome for the story: A celebrity comes to town to help his little sister plan her wedding and is enamored by the local bridal boutique owner; stay for Johnny (Donovan) thinking everyone is taking photos of him when they’re actually snapping shots of a Christmas tree.\n\n\t\t\n\t\t\t\n\t\t\t\n\t‘Lights, Camera, Christmas!’ (2022)\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: DAVID ASTORGA\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\tCast: Kimberly Sustad, John Brotherton\n\n\tCome for the movie within the movie — a store owner struggling to keep her company is flabbergasted when a Christmas movie comes to film in her town and the lead is annoyingly charming; stay for the surprise romantic twist between the fake movie’s producers.\n\n\t\t\n\t\t\t\n\t\t\t\n\t‘Switched for Christmas’ (2017)\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Jeremy Lee/Hallmark Media\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\tCast: Candace Cameron Bure, Eion Bailey, Mark Deklin\n\n\tCome for Bure playing very different twin sisters who switch places only to fall in love with men who think they’re each other; stay for not one, but two love stories! Double the fun!\n\n\t\t\n\t\t\t\n\t\t\t\n\t‘Let It Snow’ (2013)\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Hallmark Media\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\tCast: Candace Cameron Bure, Jesse Hutch, Alan Thicke\n\n\tCome for Alan Thicke as a very cold father who would rather have dinner in a restaurant than spend the holidays with his daughter; stay for Hutch’s Brady teaching Bure’s Stephanie how to ski and fly fish — and a very sweet, unique holiday tradition.\n\n\t\t\n\t\t\t\n\t\t\t\n\t‘Three Wise Men and a Baby’ (2022)\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Hallmark Media\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\tCast: Paul Campbell, Tyler Hynes and Andrew Walker\n\n\tCome for Tyler Hynes, Paul Campbell and Andrew Walker. Stay for Paul Campbell, Tyler Hynes and Andrew Walker — plus, a ridiculously cute baby, a dance number and actual comedy.\n\n\t\t\n\t\t\t\n\t\t\t\n\tA Biltmore Christmas (2023)\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: ©Hallmark Entertainment/Courtesy Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\tCast: Bethany Joy Lenz, Kristoffer Polaha and Jonathan Frakes\n\n\tCome for the undeniable chemistry between Lenz and Polaha, stay for the insanely charming view of the Biltmore Estate at the holidays — and time travel without the cheese.\n\n\t\t\n\t\t\t\n\t\t\t\n\t‘An Unexpected Christmas’ (2021)\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Allister Foster\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\tCast: Bethany Joy Lenz and Tyler Hynes\n\n\tCome for the sweet pretend-we’re-still-together-for-my-parents storyline; stay for the most natural chemistry yet.\n\n\t\t\n\t\n\t\n\n\n\t\n\t\tMore from Variety\n\t\n\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\n\n\t\t\n\n\t\n\t\tMore From Our Brands\n\t\n\t\n\t\t\n\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\n\tRolling Stone\n\n\t\t\t\t\tAustin Reaves Is Playing Like a Star — and Bringing His ‘A’ Game Beyond the Court\t\t\n\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\n\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\n\tRobb Report\n\n\t\t\t\t\tNikka Just Dropped a Stellar New Twist on Its Blended Japanese Whisky\t\t\n\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\n\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\n\tSportico\n\n\t\t\t\t\tSinclair Snaps Up 8% Stake in Scripps in Advance of Potential Merger\t\t\n\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\n\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\n\tWWD\n\n\t\t\t\t\tThe Met Announces ‘Costume Art’ Exhibition, New Condé M. Nast Galleries, and Met Gala Sponsors\t\t\n\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\n\t\t\n\t\n\t\n\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The 25 Best Hallmark Christmas Movies, Ranked",
      "image": [
        "https://variety.com/wp-content/uploads/2023/11/Hallmark-Ranking.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-17T20:24:42.000Z",
      "dateModified": "2025-11-17T20:24:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Liev Schreiber Hospitalized in New York, Undergoing Tests",
    "url": "https://www.tmz.com/2025/11/17/liev-schreiber-hospitalized/",
    "image": "https://imagez.tmz.com/image/bc/16by9/2025/11/17/bcb2a7e84c624b58a0876a35244cbef0_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-17T22:10:27.000Z",
    "description": "\n    \n                    \n                          Liev Schreiber\n                          Hospitalized In NYC\n                      \n             ",
    "body": "\n    \n                    \n                          Liev Schreiber\n                          Hospitalized In NYC\n                      \n                  \n                        Published November 17, 2025 2:10 PM PST\n                                                                      |\n                Updated November 17, 2025 4:10 PM PST\n                                    \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          UPDATE\n      \n          4:09 PM PT -- Liev's rep tells TMZ, \"Out of an abundance of caution, Liev went into the hospital for testing and as of this afternoon, he has been cleared to return to work.\"\n      \n    \n          Health scare for Liev Schreiber ... he's hospitalized in New York City, where he's going through a battery of tests.\n      \n    \n          Sources with direct knowledge tell TMZ … the \"Ray Donovan\" star had a massive headache Sunday and he called his doctor, who told him to immediately go to a hospital.\n      \n    \n          We're told 58-year-old Liev followed his doctor's advice and stayed overnight Sunday at a NYC hospital ... and today, doctors have been running tests on him.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          It's unclear what is ailing Liev -- our sources say doctors don't know the nature of the problem -- but we're told Liev is able to speak and walk without any issues and has the full use of his limbs.\n      \n    \n          Story developing ...\n      \n      \n              \n          \n                          \n                Liev Schreiber\n              \n                          \n                Celebrity News\n              \n                          \n                Exclusive\n              \n                          \n                Fairly Legal\n              \n                          \n                Health\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Liev Schreiber Hospitalized in New York, Undergoing Tests",
      "image": [
        "https://imagez.tmz.com/image/bc/16by9/2025/11/17/bcb2a7e84c624b58a0876a35244cbef0_xl.jpg"
      ],
      "datePublished": "2025-11-17T22:10:27.000Z",
      "dateModified": "2025-11-17T22:10:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Diane Ladd Cause of Death Released",
    "url": "https://www.tmz.com/2025/11/17/diane-ladd-cause-of-death-revealed/",
    "image": "https://imagez.tmz.com/image/1f/16by9/2025/11/17/1f6aed89e3944da6b74b0cd7b8af7795_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-17T22:21:13.000Z",
    "description": "\n    \n                    \n                          Diane Ladd\n                          Cause of Death Revealed\n                      \n             ",
    "body": "\n    \n                    \n                          Diane Ladd\n                          Cause of Death Revealed\n                      \n                  \n                        Published November 17, 2025 2:21 PM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Academy Award-nominated actress Diane Ladd passed away November 3 at her Ojai, California home ... and now her cause of death has been revealed.\n      \n    \n          People reports a death certificate confirmed her cause of death as acute on chronic hypoxic respiratory failure.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          According to the outlet, the late actress had an interstitial lung disease that plagued her for years and contributed to the conditions which led to her death. Another contributing factor was esophageal dysmotility, according to People.\n      \n\n                  \n          \n                          \n                \n                  \n      \n    \n          Laura Dern -- Ladd's daughter -- announced her passing in a statement, calling Ladd her \"hero\" and stating she was by Ladd's bedside when she passed.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Ladd was perhaps known best for her roles in \"Alice Doesn't Live Here Anymore\" and David Lynch's \"Wild at Heart.\"\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          She began her career on TV, appearing in various roles beginning in the 1950s and 1960s, including \"Naked City\" and \"The Fugitive.\" She had minor film parts before her career on the silver screen kicked off in the '70s, acting in \"White Lightning,\" \"Chinatown,\" and \"Alice Doesn't Live Here Anymore.\"\n      \n    \n          She was 89.\n      \n    \n          RIP\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Celebrity News\n              \n                          \n                RIP\n              \n                          \n                Fairly Legal\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Diane Ladd Cause of Death Released",
      "image": [
        "https://imagez.tmz.com/image/1f/16by9/2025/11/17/1f6aed89e3944da6b74b0cd7b8af7795_xl.jpg"
      ],
      "datePublished": "2025-11-17T22:21:13.000Z",
      "dateModified": "2025-11-17T22:21:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Porsha Williams Lands on FBI's Radar After Incident on Delta Flight",
    "url": "https://www.tmz.com/2025/11/17/porsha-williams-fbi-radar-alleged-delta-flight-incident/",
    "image": "https://imagez.tmz.com/image/b2/16by9/2025/11/17/b27e3ff387ac4e3f831fd3ce0214a2fc_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-17T22:30:05.000Z",
    "description": "\n    \n                    \n                          Porsha Williams\n                          Flying on FBI's Radar ...\n                          All",
    "body": "\n    \n                    \n                          Porsha Williams\n                          Flying on FBI's Radar ...\n                          All Smiles After Flight Incident\n                      \n                  \n                        Published November 17, 2025 2:30 PM PST\n                                                                            \n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          Porsha Williams is on the radar of federal authorities ... after allegedly being involved in an incident on a Delta flight.\n      \n    \n          The incident apparently went down Sunday night on a flight from Las Vegas to Atlanta. In footage, obtained by TMZ, Porsha is seen strutting out of the gate in a fur coat and Uggs --and from the looks of it, she doesn’t seem fazed at all.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          The reality star is accompanied by an officer, who she appears to speak with shortly after deplaning.\n      \n    \n          A spokesperson for FBI Atlanta tells TMZ … \"FBI Atlanta is aware of incident on a Delta flight on November 16th allegedly involving Porsha Williams and/or at least one other person. We are looking to see whether any federal charges may or may not apply.\"\n      \n    \n          A spokesperson for Delta Airlines tells TMZ ... two customers on the flight were spoken to by cabin crew, and the flight continued on to Atlanta and landed without issue. Law enforcement met the flight upon arrival at ATL.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          What exactly happened on Porsha’s flight remains unclear.\n      \n    \n          Porsha spent the weekend in Las Vegas at BravoCon with her “Real Housewives of Atlanta” cast mates … taking part in panels and posing for the cameras.\n      \n    \n          We reached out to Porsha ... so far, no word back.\n      \n      \n              \n          \n                          \n                Porsha Williams\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Porsha Williams Lands on FBI's Radar After Incident on Delta Flight",
      "image": [
        "https://imagez.tmz.com/image/b2/16by9/2025/11/17/b27e3ff387ac4e3f831fd3ce0214a2fc_xl.jpg"
      ],
      "datePublished": "2025-11-17T22:30:05.000Z",
      "dateModified": "2025-11-17T22:30:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Man Charged With Murder In John Beam's Death, Allegedly Confessed",
    "url": "https://www.tmz.com/2025/11/17/cedric-irving-charged-murder-john-beam/",
    "image": "https://imagez.tmz.com/image/42/16by9/2025/11/17/426d7cdb46724807bf3de4d129cb2e31_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-18T00:30:14.000Z",
    "description": "\n    \n                    \n                          John Beam Death\n                          Man Charged With Murder\n                          ... A",
    "body": "\n    \n                    \n                          John Beam Death\n                          Man Charged With Murder\n                          ... Allegedly Confessed\n                      \n                  \n                        Published November 17, 2025 4:30 PM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          A 27-year-old man has been charged with murder in the death of \"Last Chance U\" star John Beam ... officials announced Monday.\n      \n    \n          According to court docs, Cedric Irving Jr. admitted to shooting Beam at Laney College in Oakland on Thursday ... and had the handgun used in the disgusting act in his possession at the time of his arrest at the San Leandro BART station at 3 AM the next morning.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Beam was shot in the head and rushed to a nearby hospital ... but tragically, he died from the injuries he sustained.\n      \n\n          At a press conference, Alameda County DA Ursula Jones Dickson said Irving is facing 50 years to life if convicted.\n      \n    \n          Jones Dickson added Irving -- who is being held without bail -- did not have a criminal record.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          It's unclear if there is a connection to Irving and Beam ... but officials said last week the alleged shooter went to the Laney campus for a \"specific reason\" and the attack was \"very targeted.\"\n      \n    \n          Beam was a staple in the Bay Area ... and dedicated his life to helping the youth through sports.\n      \n    \n          He coached a handful of players who went on to suit up in the NFL.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                John Beam\n              \n                          \n                TMZ Sports\n              \n                          \n                Crime\n              \n                          \n                Fairly Legal\n              \n                          \n                Shootings\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Man Charged With Murder In John Beam's Death, Allegedly Confessed",
      "image": [
        "https://imagez.tmz.com/image/42/16by9/2025/11/17/426d7cdb46724807bf3de4d129cb2e31_xl.jpg"
      ],
      "datePublished": "2025-11-18T00:30:14.000Z",
      "dateModified": "2025-11-18T00:30:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Shedeur Sanders' Ohio Home Burglarized During NFL Debut Against Ravens",
    "url": "https://www.tmz.com/2025/11/17/shedeur-sanders-ohio-home-burglarized-nfl/",
    "image": "https://imagez.tmz.com/image/a5/16by9/2025/11/17/a596dae7028d44dbaf7a433b5f0496c4_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-17T23:45:46.000Z",
    "description": "\n    \n                    \n                          Shedeur Sanders\n                          Ohio Home Burglarized\n                          ... Dur",
    "body": "\n    \n                    \n                          Shedeur Sanders\n                          Ohio Home Burglarized\n                          ... During NFL Debut\n                      \n                  \n                        Published November 17, 2025 3:45 PM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Rough Sunday for Shedeur Sanders -- not only was his NFL debut less than stellar, but police confirm to TMZ Sports his Ohio home was burglarized during the game.\n      \n    \n          Law enforcement said the break-in occurred while the NFL rookie quarterback took over for starter Dillon Gabriel, who suffered a concussion midway through the loss to the Ravens.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Police said no further details are being released at this time.\n      \n\n          This incident is only adding salt to Sanders' wounds. His first official NFL snaps weren't great ... which he admitted himself.\n      \n    \n          Sanders, 23, completed just four passes for 47 yards. He was also sacked twice and threw one interception.\n      \n    \n          \"I don't think I played good,\" Sanders said, \"I don't think I played good at all.\"\n      \n    \n          \"I think it's a lot of things we need to look at during the week and go and just get comfortable even throwing routes with Jerry [Jeudy] and throwing routes with all those guys. I think that was my first ball to him all year. But other than that, I just think overall we just gotta go next week and understand so then we have a week to prepare stuff I like to do.\"\n      \n    \n          Sanders will get another chance to prove himself ... he'll be starting against the Las Vegas Raiders on Sunday.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Shedeur Sanders\n              \n                          \n                TMZ Sports\n              \n                          \n                Crime\n              \n                          \n                Fairly Legal\n              \n                          \n                NFL\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Shedeur Sanders' Ohio Home Burglarized During NFL Debut Against Ravens",
      "image": [
        "https://imagez.tmz.com/image/a5/16by9/2025/11/17/a596dae7028d44dbaf7a433b5f0496c4_xl.jpg"
      ],
      "datePublished": "2025-11-17T23:45:46.000Z",
      "dateModified": "2025-11-17T23:45:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]