[
  {
    "title": "‘Boston Blue’ Bosses on Recasting Sean for ‘Blue Bloods’ Spinoff and Danny’s Romantic Future After That Surprise Return: ‘Long-Distance Relationships Are a Thing’",
    "url": "https://variety.com/2025/tv/news/boston-blue-danny-baez-future-recasting-sean-blue-bloods-spinoff-1236554791/",
    "image": "https://variety.com/wp-content/uploads/2025/10/3094669_1683b.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-18T03:00:00.000Z",
    "description": "\n\tSPOILER ALERT: This story contains spoilers from “Faith and Family,” the series premiere of CBS’ “Boston Blue.”\n\n\tWhen “Blue Bloods” came to an end ",
    "body": "\n\tSPOILER ALERT: This story contains spoilers from “Faith and Family,” the series premiere of CBS’ “Boston Blue.”\n\n\tWhen “Blue Bloods” came to an end last year after 14 seasons, there were multiple questions viewers still had about what happened to the Reagan clan. Luckily, with spinoff “Boston Blue,” led by Donnie Wahlberg’s Dannie Reagan, they got one big answer in the first moments of the Oct. 17 premiere.\n\n\n\tIn the finale, Danny finally asked his longtime partner, Maria Baez (Marisa Ramirez) to get pizza. And in the first minutes of the premiere, he was shown in bed with Baez; their banter returned, this time with a romantic twist.\n\t\n\n\t“Once we realized we were getting a chance to continue Danny Reagan’s story, Brandon and I looked at what the dangling threads were from the finale, and what was owed. Obviously, the big one was what happened when they went out for pizza,” co-showrunner Brandon Margolis tells Variety. “We really did want to feel like this show is continuing that story in fairly real time. It’s going to be about a year since the finale was off the air, so if Danny and Baez were together, where are they at, and what would that look like? How could that potentially complicate a journey going from New York to Boston? It was important to us we pay service to that and continue to establish that relationship.”\n\n\tWhile Ramirez hasn’t yet signed on to more episodes, the relationship will continue, Sonnier confirms. “Long-distance relationships are a thing. I think we can expect to play that relationship through and really get a sense of where they are in the progression of this relationship that we’ve been watching for a decade,” he says. “It’s a four-hour drive!”\n\t\n\n\n\n\t\n\n\t\t\t\t\tMika Amonsen as Sean Reagan\n\t\t\t\t\t\t\t\t\tCBS\n\t\n\n\n\n\tIn the premiere, Danny pairs up with Detective Lena Silver (Sonequa Martin-Green), the eldest daughter of a prominent law enforcement family — something he knows a thing or two about — in Boston. He’s taking on a new role with the Boston Police Department in order to stay close to his son, Sean (Mika Amonsen), after he suffers an injury while on the job as a police officer.\n\n\tOne big difference from “Blue Bloods” is that Sean has been recast; while Andrew Terraciano played the character for 292 episodes of “Blue Bloods,” Mika Amonsen has taken over the role for the spinoff.\n\n\tWe love Andrew and the work he did over the years on ‘Blue Bloods.’ Really, it came down to we’re telling a new chapter in both of their lives. It’s not just Sean who has joined the family business as it were and is turning over this new leaf, but it’s also now Danny Reagan is the father to a cop, which he’s never been before,” explains Margolis. “So there are all these new storytelling lanes to explore. It felt like there was an organic opportunity to bring in a new performance with a new energy, to help dramatize that change. It is the same character, it’s the same relationship, but it’s also completely different. We love what Mika has brought to Sean, this vulnerability, yet this desire to prove himself. It’s just been great to watch it come to life.”\n\n\n\n\t\n\n\t\t\t\t\tSonequa Martin-Green as Lena Silver, Bridget Moynahan as Erin Reagan Boyle, and Donnie Wahlberg as Danny Reagan\n\t\t\t\t\t\t\t\t\tCBS\n\t\n\n\n\n\tThe show will have a similar tone to “Blue Bloods” and will likely include more familiar faces. Bridget Moynahan’s Erin Raegan appeared in the premiere, arriving in Boston to make sure Danny was okay, which seems to be just the start.\n\n\t“Can we expect some family members? Can we expect some visits and some trips? Yes, we can,” co-showrunner Brandon Sonnier adds. “We truly mean that we are an expansion of the universe. It’s not just a run-of-the-mill spinoff. It is a different look at a different dynastic law enforcement family through the eyes of the Reagans. But the Reagans exist. They are still out there in the world, living those lives that we watched for so long.”\n\n\tPlus, every episode will feature a family dinner — the Silver family’s Shabbat dinner, which was part of the premiere, which Danny and Erin excitedly joined.\n\t\n\n\t“We will have Shabbat dinner every episode. We hope to honor the original show and their Sunday dinners were so much a fabric of what that show was about, what that family was about,” says Sonnier. “One of the things Donnie would always tell us about was how many real-life law enforcement people he would meet over the course of working on ‘Blue Bloods’ would express how much they appreciated that the Reagan family reminded them of their family. They would sit down and they would have dinner. This is an organic way to continue that universe. It’s something we do. I sit down to dinner as often as possible with my family. I have four young children. Everyone’s got baseball and dance and all the things that people have. But as often as we can, we sit down and we do celebrate Shabbat, so Friday is our time that we get to connect as a family.”\n\n\t“Boston Blue” airs at 10 p.m. ET on CBS and streams on Paramount+ the next day.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Boston Blue’ Bosses on Recasting Sean for ‘Blue Bloods’ Spinoff and Danny’s Romantic Future After That Surprise Return: ‘Long-Distance Relationships Are a Thing’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/3094669_1683b.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-18T03:00:00.000Z",
      "dateModified": "2025-10-18T03:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘9-1-1’ Actor Rockmond Dunbar Loses COVID Vaccine Lawsuit Against Disney",
    "url": "https://variety.com/2025/tv/news/rockmond-dunbar-trial-verdict-covid-vaccine-1236555850/",
    "image": "https://variety.com/wp-content/uploads/2025/10/dunbar911.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-18T00:58:41.000Z",
    "description": "\n\tA jury on Friday rejected “9-1-1” actor Rockmond Dunbar‘s claim that he was fired from the show due to his religious conviction against getting the ",
    "body": "\n\tA jury on Friday rejected “9-1-1” actor Rockmond Dunbar‘s claim that he was fired from the show due to his religious conviction against getting the COVID-19 vaccine.\n\n\tThe eight-member federal jury found unanimously in favor of Disney-owned 20th Television. When the verdict was read, Dunbar put his head in his hands.\n\n\t“Oh my God! Oh my God! Oh my God!” he shouted, and then turned to his wife and children, who were sitting in the gallery. “I’m so sorry. I’m so sorry. We’ll be okay.”\n\t\n\n\tDunbar sued the company in 2022, alleging that the production failed to accommodate his belief in the tenets of the Congregation of Universal Wisdom, which disapproves of vaccines and other medical interventions.\n\n\n\tDunbar’s character, Michael Grant, was written out of the show in 2021, once the company imposed a vaccine mandate on actors and crew members on set. During a four-day trial in Los Angeles, Dunbar testified about his belief that the COVID vaccine is harmful and against God’s teachings.\n\n\t“Man created the COVID-19 vaccine to separate you from God,” he said. “This is a spiritual war. This is a war of evil against good. I stood on the side of good. I stood on the side of God. I stood on the shoulders of God.”\n\n\tDisney’s lawyers, led by Maria Rodriguez of McDermott Will & Schulte, argued that Dunbar lacked credibility. She noted that Dunbar routinely takes synthetic testosterone and anastrozole, which the leader of the Congregation of Universal Wisdom called “sacrilegious.”\n\n\tDunbar acknowledged on the witness stand that he is not “perfect.” In her closing argument, Rodriguez scrolled through a list of 37 medications Dunbar has taken.\n\t\n\n\t“This is way far from perfect,” she said. “This isn’t even close.”\n\n\tDunbar testified that he was making $100,000 an episode, and was paid even for episodes in which his character did not appear.\n\n\t“It was a dream job,” he said. “It was like winning the lottery.”\n\n\tDunbar testified that since his firing, he has struggled to find work.\n\n\t“I’m underwater. I’ve spent my entire retirement,” he said. “This has taken my life into a hole financially that I will never be able to get out of.”\n\n\tBut he said he had acted on instruction from God not to take the vaccine, and stands by that.\n\n\t“Take my cars, my money — I don’t care. You have to leave here with your soul intact,” he said. “This is my spiritual test and I passed.”\n\n\tDunbar said he is “not an anti-vaxxer,” but testified that his children have not received any vaccines. \n\n\tHe also told the jury that he believes the vaccine has killed more people than COVID-19, and that the vaccine was made with aborted fetal cells and contains “disease.” He also testified that six foreign objects have been found in the Pfizer vaccine that cannot be identified under a microscope.\n\n\tDisney’s lawyers called Dr. Glenn Braunstein, who had consulted for the company during the pandemic, and who testified that there is no live disease or fetal cells in any of the vaccines. He was also asked about the claim the foreign objects seen under the microscope.\n\n\t“Hogwash,” he said. “It’s a ridiculous concept.”\n\n\tScott Street, Dunbar’s attorney, argued that his willingness to sacrifice his job underscores the sincerity of his religious views, which he said are no less real for being outside the mainstream.\n\n\t“What matters is whether he is true to himself and true to his belief,” Street said. “It doesn’t have to be right. There are plenty of beliefs that are right, wrong, kooky — who cares? What matters is whether you believe them. It’s not up to your employer to question your belief.”\n\n\tIn her closing argument, Rodriguez stated that the company was not there to “judge religion.” But she questioned whether Dunbar was seeking to pass off his sincere, but non-religious, opposition to the vaccine as a religious belief.\n\n\tShe also argued that Dunbar failed to engage in an interactive process with his employer to accommodate the issue, suggesting that the situation could have been resolved more favorably if Dunbar had communicated better.\n\t\n\n\tIn a statement, 20th Television said, “We are pleased with today’s verdict, which affirms that 20th Television acted fairly and lawfully toward Mr. Dunbar.”\n\n\tAsked for comment outside court, Dunbar said, “God still won today.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘9-1-1’ Actor Rockmond Dunbar Loses COVID Vaccine Lawsuit Against Disney",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/dunbar911.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-18T00:58:41.000Z",
      "dateModified": "2025-10-18T00:58:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sir David Attenborough Becomes New Oldest Daytime Emmys Winner Ever at 99, Beating Previous Record Holder Dick Van Dyke",
    "url": "https://variety.com/2025/tv/news/sir-david-attenborough-oldest-daytime-emmys-winner-99-1236555938/",
    "image": "https://variety.com/wp-content/uploads/2022/01/David-Attenborough.jpeg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-18T01:28:52.000Z",
    "description": "\n\tDick Van Dyke‘s record as oldest performer to win a Daytime Emmy didn’t last long. At this year’s ceremony, legendary British broadcaster, writer an",
    "body": "\n\tDick Van Dyke‘s record as oldest performer to win a Daytime Emmy didn’t last long. At this year’s ceremony, legendary British broadcaster, writer and naturalist Sir David Attenborough has made history, winning the 2024 Daytime Emmy award for outstanding daytime personality – Non-Daily — for Netflix’s “Secret Lives of Orangutans” at the age of 99. (He turns 100 next May.)\n\n\tThat makes him a hair older than Van Dyke, who previously set the record last year at 98 when won the guest performer in a daytime drama series Daytime Emmy last year via his spot on Peacock’s “Days of Our Lives.” \n\t\n\n\tAttenborough’s win was one of three for Netflix’s “Secret Lives of Orangutans,” which also won directing team for a single camera daytime non-fiction program.\n\n\n\tAttenborough won over Brad Bestelink, “Living with Leopards” (Netflix); Andi Sweeney Blanco, Courtney Dober, Rob North & Kirin Stone, “The Fixers” (BYUtv); Anthony Mackie, “Shark Beach with Anthony Mackie: Gulf Coast” (National Geographic); and Martha Stewart, “Martha Gardens” (Roku).\n\n\tAttenborough is known as one of the world’s most famous natural sciences broadcasters, starting with 1954’s “Zoo Quest.” As a narrator, his more recent successes include include “Planet Earth” and its sequels, “Blue Planet” and its sequels, “The Green Planet,” “Wild Isles,” “Dinosaurs: The Final Day With David Attenborough,” “Life In Colour,” “Frozen Planet” and more. \n\n\tHere’s the logline for “Secret Lives of Orangtutans”: “Orangutans are not just one of our closest relatives, they’re perhaps more relatable to us than any other great ape. Narrated by David Attenborough, this film follows a remarkable group of orangutans in the pristine jungles of Sumatra. At the centre of this story is 8 year old Eden, who’s about to embark on the most challenging moment of her life.”\n\t\n\n\tThe 52nt annual Daytime Emmy Awards took place on Friday, Oct. 17, at the Pasadena Civic Auditorium.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sir David Attenborough Becomes New Oldest Daytime Emmys Winner Ever at 99, Beating Previous Record Holder Dick Van Dyke",
      "image": [
        "https://variety.com/wp-content/uploads/2022/01/David-Attenborough.jpeg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-18T01:28:52.000Z",
      "dateModified": "2025-10-18T01:28:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Black Phone 2’ Mastermind Joe Hill on How He Came Up With The Grabber’s Return and What a Sequel Could Look Like",
    "url": "https://variety.com/2025/film/news/black-phone-2-how-the-grabber-came-back-sequel-1236555766/",
    "image": "https://variety.com/wp-content/uploads/2025/10/MCDBLPH_UV062_3bf279.jpg?crop=0px%2C0px%2C3000px%2C1688px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-10-18T00:16:09.000Z",
    "description": "\n\tSPOILER ALERT: This article contains very light spoilers about “Black Phone 2,” now playing in theaters.\n\n\tThe minute Joe Hill saw The Grabber’s mas",
    "body": "\n\tSPOILER ALERT: This article contains very light spoilers about “Black Phone 2,” now playing in theaters.\n\n\tThe minute Joe Hill saw The Grabber’s mask, he knew “The Black Phone” could become a franchise.\n\n\t“The mask was crafted by Tom Savini and Jason Baker,” Hill says. “I saw the mask with its swappable mouths: Sometimes the devil face is grinning, sometimes it’s frowning, and sometimes he has no mouth at all. I saw that mask and thought, ‘Oh, I think there’s gonna be a whole bunch of these movies.’ It struck me as instantly iconic in the way Freddy Krueger’s glove is iconic, in the way Michael Myers’ mask is iconic. I thought, ‘This is nightmare fuel, and people are going to want a lot of it.’ I thought he had the potential to become of these big, memorable ongoing horror villains, and if that’s going to be the case, I’d rather he be in good movies than bad ones.”\n\t\n\n\tHill’s intuition was spot on, as he brought up this memory during a discussion on the release date of “Black Phone 2,” the sequel from Universal Pictures that is now playing nationwide. The author has a busy few days, as his 900-page new book “King Sorrow” is set to come out during the same week, on Oct. 21. \n\n\n\tBut he’s eager to discuss the expanded world of “Black Phone,” as the 2021 film, which introduced the murderous Grabber, played by Ethan Hawke, was developed from one of Hill’s short stories. The sequel, written by the team from the first film, Scott Derrickson and C. Robert Cargill, embarks on territory beyond the source material. Hill was the first one of the trio to suggest actually doing the sequel, which follows Finney (Mason Thames), who escapes The Grabber in the first film, and his sister, Gwen (Madeleine McGraw), who starts getting scary phone calls in her dreams, which leads to a way for the recently deceased Grabber to return.\n\t\n\n\t“They didn’t know if they wanted to do a second film,” Hill says. “The first film was beautifully self-contained, so it’s not obvious that there should be a second film. But the thing is, it was just sitting right there. There’s this phone that Finney, our hero, uses to speak to people who have died. And I just thought, ‘What if the next person who calls him on it was The Grabber in Hell? I told that idea to Scott and Cargill, and Cargill especially was like, ‘Yes!’ I had some other concepts that they liked — some of them they passed over and some of them ended up in the film. We were just guys spitballing, seeing where we could land.”\n\n\tHill was thrilled that the duo were interested in making the sequel, with Derrickson also returning as director. The author says the pair is able to conjure something deeper from the material.\n\n\t“If there was going to be a sequel, I want it to be Scott and Cargill who did because I had confidence they would deliver quality,” Hill says. “They would deliver something really fun to watch, and the hallmark of their work is a deep affection for their characters, and a sense of warmth even in the iciest of films. ‘Black Phone 2’ is pretty chilly, but you sense that warmth for the lead character, for the kids. If there’s going to be a sequel, let’s hopefully get them to be persuaded to do it, and then it will be good.”\n\n\tWhen asked about another sequel featuring The Grabber, Hill is emphatic that it’s on his mind, but he doesn’t want to put the cart before the horse.\n\n\t“We’ll see if people want more,” he says. “At the time we’re doing this interview, I have seen some numbers on the Thursday previews and they look pretty good. I’m pretty hopeful for where the film is going to land financially. But people vote with their dollars. If people want ‘Black Phone 3,’ they’ll let us know by banging down the doors to go see ‘Black Phone 2.'”\n\n\tAs for what the next chapter could look like?\n\n\t“One of the things which is fun about ‘Black Phone’ is the first story is about Finney in danger and his sister trying to save him,” Hill says. ‘He’s the lead, and she’s the key second character. But in this film, there’s a flip where Gwen is the lead character and her brother is trying to save her. To me, the logical thing is if there is a third film, they are dual stars where they’re sitting trying to save each other. Maybe there’s a way to do that, maybe there isn’t … we’ll have to see.”\n\t\n\n\tWatch the ‘Black Phone 2’ trailer below.\n\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Black Phone 2’ Mastermind Joe Hill on How He Came Up With The Grabber’s Return and What a Sequel Could Look Like",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/MCDBLPH_UV062_3bf279.jpg?crop=0px%2C0px%2C3000px%2C1688px&resize=1000%2C563"
      ],
      "datePublished": "2025-10-18T00:16:09.000Z",
      "dateModified": "2025-10-18T00:16:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Truth and Treason’ Review: A Conventional Biopic of a Teenager Who Resisted the Third Reich",
    "url": "https://variety.com/2025/film/reviews/truth-and-treason-review-1236555435/",
    "image": "https://variety.com/wp-content/uploads/2025/10/Truth-and-Treason.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-18T01:00:00.000Z",
    "description": "\n\tBased on a true story of German resistance to the Third Reich during World War 2, “Truth and Treason” plays it conventionally straight. The familiar",
    "body": "\n\tBased on a true story of German resistance to the Third Reich during World War 2, “Truth and Treason” plays it conventionally straight. The familiar elements of a historic film telling an epic story are all there: the righteous hero, the conflicted villain, the systemic violence. There are fiery speeches, chase scenes and tense moments. But Matthew Whitaker’s film never surprises at any point during its running time, failing to add any singular artistic flair. While telling a compelling story, it plays like so many other films about that dark time in not-so-distant European history. \n\t\n\n\tHelmuth Hübener (Ewan Horrocks) is a religious 17-year-old living an ordinary life with his family in Hamburg — as ordinary as can be during the troubled time the film takes place. He goes to school, plays with his friends and even gets a job at a local government office. Then he starts questioning what was happening around him. The bishop in his church begins to pledge allegiance to Adolf Hitler before his sermons. His inclusive Mormon church bans Jews from entering its premises. One day, he discovers that one of closest friends, Solomon Schwarz (Nye Occomore), has been abducted by the state for being Jewish. When his older brother brings home a radio that plays stations from outside Germany, especially the BBC, he starts to realize that what he’s being told is all lies and propaganda. \n\n\n\tAs a studious and smart young man, Hübener has a knack for oratory and writing influenced by his love of reading. He uses those skills and what he learns listening to the news on the radio to write pamphlets about the truth of the war. He enlists two of his friends, Karl-Heinz Schnibbe (Ferdinand McKay) and Rudi Wobbe (Daf Thomas) to distribute them all over Hamburg. There’s a propulsive energy to those early scenes. Whitaker, working from a screenplay he wrote with Ethan Vincent, manages to create some tension-filled moments. What happens to Schwaz is not overtly shown. The audience is only privy to his fear in the moments leading up to his abduction — and to Hübener’s devastating discovery in the aftermath — although there’s plenty of violence, with many fist fights and beatings resulting in blood-soaked faces as Hübener deals with the wrath of Nazi sympathizers in his community, including his own stepfather (Sean Mahon). \n\t\n\n\tTrue to the facts, the courageous teenager is eventually caught by the Gestapo. The second half of the film dissolves in a dreary interrogation and torture narrative. As the investigator, Rupert Evans takes a larger role in the narrative. At first, he can’t fathom that this teenager is working alone, yet as he gets to know him, a sense of admiration creeps in. This part of the film is much more obvious and less energetic than what precedes it. Still, Horrocks and Evans match each other well as the relationship between captive and jailer is explored. \n\n\tDespite these mostly persuasive elements, “Truth and Treason” is ultimately an old-fashioned period piece with epic aspirations. The characters and narrative are accompanied by sweeping, intrusive music that tries hard to dictate to the audience exactly how to feel at every beat of the story. The actors speak in clipped English accents that seem jarring to the German story. The script does not allow for shading to the characters, with the exception of Evans’: They are presented either as good-hearted and supportive of Hübener or outright odious fascists out to get him. \n\n\t“Truth and Treason” is a well-intentioned, competently made film that never transcends the safety of its own conventions. Whitaker makes a sincere film full of admiration for Hübener’s courage and idealism. However, sincerity cannot make up for stereotypical storytelling. This is a dutiful attempt at re-creating the life of a noble man that nonetheless does not offer its audience much in the way of art or entertainment. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Truth and Treason’ Review: A Conventional Biopic of a Teenager Who Resisted the Third Reich",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/Truth-and-Treason.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-18T01:00:00.000Z",
      "dateModified": "2025-10-18T01:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘No Other Land’ Doc Sets Streaming Self-Release After Turning Down Mubi Deal – Film News in Brief",
    "url": "https://variety.com/2025/film/news/film-news-in-brief-oct-13-2025-1236547669/",
    "image": "https://variety.com/wp-content/uploads/2024/11/No-Other-Land.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-17T22:06:00.000Z",
    "description": "\n\tOscar documentary winner “No Other Land,” which shows Palestinian families in Masafer Yatta struggling to stay on their land, will be available on d",
    "body": "\n\tOscar documentary winner “No Other Land,” which shows Palestinian families in Masafer Yatta struggling to stay on their land, will be available on digital platforms in the U.S. starting Oct. 20. The documentary will be available on Apple TV, Amazon, Google Play and YouTube. \n\n\t“No Other Land” did not have a U.S. distributor until striking a deal with MUBI. But following the announcement that MUBI had accepted a $100 million investment from investment firm Sequoia Capital, the filmmakers ended the deal in objection to Sequoia’s financial ties to the Israeli military and weapons industry. \n\t\n\n\t“This film shows the reality of Israeli occupation and oppression against Palestinians — but that truth apparently didn’t fit the narrative that big U.S. streamers wanted to promote. We talked to MUBI for months, and initially thought our film had found its home, but in the end we learned that they were accepting a huge investment from Sequoia Capital,” said No Other Land co-director Basel Adra.\n\n\n\t“In addition to being unethical, it made no sense to us that they would take our film showing Israel’s oppression of Palestinians, and then also partner with a company contributing to that oppression,” added No Other Land co-director Yuval Abraham.\n\n\t100% of proceeds from purchases and rentals of “No Other Land” will go directly to Palestinian communities in Masafer Yatta. \n\t\n\t\tFriday, Oct. 17\t\n\n\tBen Platt Sets Two-Week Residency in Los Angeles With 10 Shows \n\n\tBen Platt will perform at the Ahmanson Theatre for a new two-week residency from Dec. 12 to Dec. 21.\n\t\n\n\tThe residency features 10 performances by the musician, as well as special guests who will join him onstage. Known for his roles in “Pitch Perfect” and “Dear Evan Hansen,” Platt is also a singer and songwriter with three released albums: “Sing to Me Instead,” “Reverie” and “Honeymind.” \n\n\tHis recent hits include the singles “Grow as We Go,” “Bad Habit,” “Words Fail” and “If I Could Tell Her,” among others. \n\n\t“Ben Platt: Live at the Ahmanson” will be directed by Tony Award-winning director Michael Arden and feature Platt performing Broadway classics and covers in addition to his own solo records.\n\t\n\t\tThursday Oct. 16\t\n\n\tDirectors’ Fortnight Extended to Return for Three Day Festival in Los Angeles\n\n\tAcropolis Cinema will continue its collaboration with the Quinzaine des cinéastes (The Directors’ Fortnight) with a three-day festival at the DGA Theater Complex. The second edition will run from Nov. 7 to Nov. 9, featuring seven films from this year’s Directors’ Fortnight in Cannes.\n\n\tThe festival will open with Lloyd Lee Choi’s “Lucky Lu,” starring Chang Chen as a New York City delivery driver trying to make a new life for his family abroad. Yuiga Danzuka’s family drama “Brand New Landscape” will headline Saturday’s lineup, where the director will be in attendance alongside Chen. The festival will close out with Nadav Lapid’s “Yes,” a portrait of the ongoing turmoil in the Middle East.\n\n\tOther selections include Sang-il Lee’s kabuki drama “Kokuho,” Julia Kowalski’s psychological horror fable “Her Will Be Done,” Prïncia Car’s “The Girls We Want,” and Valéry Carnoy’s teen boxing drama “Wild Foxes,” the winner of the SACD Prize for best French film and the Europa Cinemas Label for best European Film at the 2025 Directors’ Fortnight.\n\t\n\t\tWednesday, Oct. 15\t\n\n\t‘Cover-Up,’ ‘A Life Illuminated,’ Among Other Films Added to Doc Stories Festival Lineup\n\n\t“Ask E. Jean,” “The Bend in the River,” “Divers” and “They Eyes of Ghana” are among the 10 features and 12 short films that will be screened at SFFILM’s 11th annual Doc Stories event at the Vogue Theatre in San Francisco from Nov. 6-9.\n\n\tThe four-day event will bring established and emerging filmmakers to celebrate non-fiction films. The feature film “Cover-Up” is set to open the festival.\n\t\n\n\tThe celebration will feature showings of “In My Day,” “My Mom Jayne,” “Newport & The Great Folk Dream,” “Powwow People,” “Put Your Soul in Your Hand and Walk,” Shorts Block: New York Times Op-Docs,” “Shorts Block: Spaces of Resistance,” “The Tale of Silyan,” “S the Wolf,” among others. \n\n\tA screening of  “A Life Illuminated” will close the festival.\n\n\tSFFILM will also host an event called Doc Congress, which convenes documentary industry professionals, funders and filmmakers for dialogue and features a keynote by Lois Vossen, the founding executive producer of “Independent Lens” on PBS. \n\n\tThe festival will also present a workshop designated for younger filmmakers called “Teen Workshop: Documentary Filmmaking and Creating Understanding.”\n\n\tTickets will go on sale for SFFILM Members on Oct. 15 at 10 am at sffilm.org, with sales opening for the general public on Oct. 17 at 10 am.\n\n\tStudents and teachers get free access to a festival program specially designed by the festival’s long-time education team called Schools at Doc Stories.\n\t\n\t\t“Roads of Fire” Documentary to Have L.A. Premiere\t\n\n\t“Roads of Fire,” the feature documentary from director Nathaniel Lezra will kick off its Los Angeles run at the Laemmle Monica Film Center on Oct. 31. The film, which explores the global migration crises through the lens of three different stories, won Best Documentary Feature at the 2025 Santa Barbara International Film Festival and the Audience Award at the Brooklyn Film Festival. \n\n\tA special preview of the “Roads of Fire” will take place at the Laemmle Glendale on Oct. 29, featuring a Q&A about the film and its subject matter.\n\t\n\t\tTuesday Oct. 14\t\n\n\tJennifer Fox to Produce AMPAS Governors Awards\n\n\tAcademy Producers Branch governor Jennifer Fox will return to produce the 16th Governors Awards for the Academy of Motion Picture Arts and Sciences, set to take place on Nov. 16. This will be Fox’s seventh time producing the event.\n\n\t“Jennifer’s expertise in producing the Governors Awards is unmatched. We are thrilled to welcome her back to kick off our 98th Oscars events with a celebration of four truly remarkable honorees,” said Academy President Howell Taylor in a statement. \n\t\n\n\tThis year’s Honorary Oscars will be presented to Debbie Allen, Tom Cruise and Wynn Thomas, with the Jean Hersholt Humanitarian Award presented to Dolly Parton. The event will be held at the Ray Dolby Ballroom at Ovation Hollywood.\n\n\tIDA and Manhattan Neighborhood Network Launch Facility Partnership\n\n\tThe International Documentary Association and Manhattan Neighborhood Network have formed a partnership that will allow both organizations access to each other’s events, facilities, and communities. Established in 1992, MNN is a media learning, production, and distribution hub with facilities including virtual production studios, two podcast studios, six open edit stations, three closed edit suites and a closed screening room featuring a 4K DCP projector, 193” screen with surround sound, live streaming, and recording capabilities. On Sept. 20, IDA members residing in or visiting New York City will have full access to all MNN amenities for free or at a discounted rate. \n\n\tAs a part of the partnership, all MNN members will receive a 20% discount on IDA memberships. IDA will also host quarterly Work-In-Progress screenings for IDA members to show their work to fellow members and their guests to receive feedback. The first IDA Docs-In-Progress event will be held on November 13.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘No Other Land’ Doc Sets Streaming Self-Release After Turning Down Mubi Deal – Film News in Brief",
      "image": [
        "https://variety.com/wp-content/uploads/2024/11/No-Other-Land.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-17T22:06:00.000Z",
      "dateModified": "2025-10-17T22:06:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Devil in Disguise’ Creator Patrick Macmanus Admits He’s Unsure How Audiences Will React to John Wayne Gacy Series Without Violence: ‘I Don’t Know If a Show That Doesn’t Show Murder Is Going to Work’",
    "url": "https://variety.com/2025/tv/news/patrick-macmanus-devil-in-disguise-john-wayne-gacy-without-violence-1236552779/",
    "image": "https://variety.com/wp-content/uploads/2025/10/NUP_206592_00022.jpg?crop=0px%2C0px%2C1000px%2C562px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-10-17T23:30:00.000Z",
    "description": "\n\tSPOILER ALERT: This story contains spoilers from “Devil in Disguise: John Wayne Gacy,” now streaming on Peacock.\n\n\tWhen it comes to true crime TV sh",
    "body": "\n\tSPOILER ALERT: This story contains spoilers from “Devil in Disguise: John Wayne Gacy,” now streaming on Peacock.\n\n\tWhen it comes to true crime TV shows, especially ones about serial killers, there’s a common element among most series: violence. While some claim to focus on the victims’ stories, they also feature murder, sometimes ghoulishy rendered, and an extensive backstory for the killer.\n\n\n\tWhen Patrick Macmanus began his journey of creating a series about John Wayne Gacy’s case, that was the opposite of what he wanted to do. In fact, he refused to do the show unless it was strictly about the victims and didn’t show any of the actual murders of Gacy’s 33 known victims. \n\t\n\n\tBelow, Macmanus reflects on initially turning the series down, working closely with GLAAD throughout the process, reaching out to five victims’ families, and the competition — namely Ryan Murphy — in the true crime genre.\n\t\n\t\tYou’ve done multiple true crime series now, most recently two seasons of “Dr. Death.” What drew you to John Wayne Gacy’s crimes and his victims specifically?\t\n\n\tLook, the short answer is that it didn’t draw me in. I turned it down a couple of times before I said yes, because I didn’t have the foresight of what it could be. What was right in front of me at the time was another serial killer story, and I didn’t want to do another circular story. I am so grateful that Universal and Peacock pushed me. I said I would do it if I could focus on the victims, the police, the lawyers and the families, and when I said it to them, I didn’t know what that meant. It wasn’t until we got the room up and running that I realized that we could do these short stories. I even pitched it to the studio, asking, “Are you going to be OK with me doing these stories that have absolutely no connection to John Wayne Gacy, except little light droppings here or there?” They said yes. I thought they were lying, but they were so supportive right off the bat.\n\t\n\t\n\t\tHow do you think audiences will react to not showing the actual violence?\t\n\n\tI’m really curious how this is going to go. We know that a certain way of telling the story that leans into something that might be seen as a little bit more salacious or gratuitous, that it works. It brings in people, and I don’t know if a show that doesn’t show a murder is going to work — or that allows itself to slow down and tell just the story of hope or tragedy, or dreams lost, or dreams found, or love, or what it’s like to be a sex worker in Chicago in the ’70s. I don’t know if it’s gonna work, but it was definitely worth a shot.\n\t\n\t\tCan you talk about the research process?\t\n\n\tAll of our research began with NBC News and the Peacock documentary. So they had an extraordinary treasure trove of research. We built out various books that became our go-to for information and for inspiration. And then on top of that, we have Patrick Murphy, who’s our private researcher. He came up with thousands of pages of research that came from court documents, interviews, interrogations, etc.\n\n\tFrom the beginning, we wanted to make every effort to reach out to all of the living family members and even a couple of the living victims. And so a list was put together that came from a lot of hours of research that I had nothing to do with, trying to hunt down home addresses, emails, phone numbers of everyone that we could find. We only ultimately ended up connecting with five people. We reached out with full understanding that there was a probability that they would be angry or that they would be hurt. The point of this isn’t for people to give us their blessing. The point of this is for them to be heard and and while it wasn’t going to stop us from making the show, I wanted them to be able to have the ability to be able to tell us what they really thought and guide us as much as they possibly could if they wanted to. I will say that of the five people that we connected, five for five wished us well. \n\n\n\n\t\n\n\t\t\t\t\tJames Badge Dale as Kozenczak and Gabriel Luna as Tovar\n\t\t\t\t\t\t\t\t\tBrooke Palmer/PEACOCK\n\t\n\n\n\t\n\t\tYou didn’t show any of the trial. Did you ever discuss including any of that? \t\n\n\tNo, I hate trials. “Dr. Death” was an example of where I strategically showed the trial, and that was only because we knew from the beginning that it was in the trial that we would show the surgeries for the first time. With “Devil in Disguise,” the trial was so well known and so well worn. \n\t\n\t\n\t\tThe score of this show, done by Leopold Ross and Nick Chuba, includes 33 tracks, the number of known victims. Whose idea was that?\t\n\n\tThat was actually a late conversation with our composers, where we were trying to find how to score the show in a way that could also honor the victims. So much of what they do and why I work with them over and over again is that they are exceptional at their jobs. I don’t mean just the scoring of our shows, but fundamentally understanding the vision of what each of the shows is. I give them complete credit for hearing rambling from me and creating something so special with our score.\n\t\n\t\tI know most of your writers’ room is queer, and you also worked closely with GLAAD on this. What was that process like?\t\n\n\tEarly on in the process of us developing the show, even before the writers’ room, I knew there was going to be a portion of the story that was about the latent homophobia that coursed through the investigation of John Wayne Gacy. It was really important to me that GLAAD become a partner. They agreed to take a look at our outlines and advise on the scripts. They didn’t agree to come on as formal advisors at that point because they wanted to see the final product before they could formalize our partnership, which I completely understood. But I have to tell you, I don’t think I was nervous about anything in this process except waiting for GLAAD to watch the cuts. I remember exactly where I was when I got the call from GLAAD saying that they were on board to become formal and public partners for the show. That is the thing I am most proud of in this entire process — that they gave us what we needed to know to tell this story right, real, and respectfully.\n\t\n\t\tLet’s dive into the formatting. Each episode focuses on a different victim’s story, but I found it interesting that the last two episodes were the stories of David Cram and Jeffrey Rignall — both of whom were survivors. How did you land on that decision?\t\n\n\tThere was no method to the madness as it related to the order of the story, with the exception of Johnny Szyc in Episode 2, because we were connecting the high school ring to the story. David Cram’s story is difficult, because there are a lot of conspiracy theories out there about his complicity in Gacy’s life. It was so conflicting that we chose not to explore it outside of the moments where [prosecutor William] Kunkle was questioning him. But we felt that it was important to do the grooming story towards the end. It just felt like it fit correctly.\n\t\n\t\n\t\tAnd then in the finale, you told Jeffrey Rignall’s story.\t\n\n\tBefore there was a writers’ room, when I was doing the research alone, I knew that Rignall was going to be the last story. I knew it for two reasons. No. 1, it was really the only story that could properly summarize the neglect and the systemic failure of the police department. It was a story that fully encompassed that. The second reason is very nuanced, and I don’t know if everyone’s going to get it because we never state it outright. Because Jeffrey was a part of a throuple, he was very much bohemian and sexually free. He lived life to the fullest. He just was so full of life and love. For John Wayne Gacy, people tried to explain away what he did because he came from an alcoholic, abusive father. They can try to explain it away because he was struggling with his identity. \n\n\tOne of the things that we wanted to make very clear to audiences is that there were millions of people who are struggling under the yoke of an abusive parent. And there are millions of people who have struggled with their identity in the face of cultural bias, systemic bias, school bias, family bias. But none of them killed 33 people. So by showing this life that was so free in every single way — and that would probably be judged to this day — we were making a statement that this queer person was just living life to the fullest and had nothing to do with debauchery.\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tBrooke Palmer/PEACOCK\n\t\n\n\n\t\n\t\tIn the finale, we see Gacy only in one scene, in the car, smoking with Rignall. Was that a conscious decision not to show him?\t\n\n\tVery, but it didn’t start that way. We have about 23 minutes of Gacy footage of scenes that we shot — the script originally was all about the day of his execution, and we had Gacy all over it. In the edit, I woke up one Sunday morning and had a feeling it was wrong. I called up an editor, Ryan Denmark, and I asked if he’d cut Gacy out to show me. I said, “I feel like it’s our last chance to tell the audience that Gacy is not the center of the story.” He did the cuts, and we watched it together on Zoom. We got to the end, and I looked at him, and said, “What do you think?” He said, “This is exactly how it should be.” And I agree. Then I got scared about telling Chernus. He watched it, and totally got it. He asked me, “Was my performance bad?” I was like, “No, no, no, your performance is great, but you get it?” He goes, “Yeah, I get it.” That scene on the answering machine? It’s so good.\n\t\n\t\n\t\tDo you plan on watching other upcoming shows about serial killers? Do you watch your competitors?\t\n\n\tI understand why you frame it that way, but I will never call them competitors. This is not just a canned line. I have always believed that art, whether it is TV or film or dance or painting or theater, is subjective. And there is no objectivity in art. I am a fan of a lot of other people’s work. I will say it outright. I am a very big fan of Ryan Murphy’s. I have been since “Nip/Tuck” days. What Ryan does is that he always swings for the fences, and whether he hits it out every time or not, is to be determined by subjectivity. But more than anything, what Ryan did from the very beginning is he was one of the very first creators and showrunners to actually open up the aperture of television and allow people that didn’t typically look like they belonged on TV or didn’t come from a particular background on TV, and he deserves a great deal of credit for what he has done for television. And so that is a long-winded way of me saying I will most certainly be tuning in and checking out what he’s done, because, for subjectivity’s sake, whether you like it or you don’t like it, I am always intrigued by what he does.\n\n\tThis interview has been edited and condensed.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Devil in Disguise’ Creator Patrick Macmanus Admits He’s Unsure How Audiences Will React to John Wayne Gacy Series Without Violence: ‘I Don’t Know If a Show That Doesn’t Show Murder Is Going to Work’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/NUP_206592_00022.jpg?crop=0px%2C0px%2C1000px%2C562px&resize=1000%2C563"
      ],
      "datePublished": "2025-10-17T23:30:00.000Z",
      "dateModified": "2025-10-17T23:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Charlie Puth Puts His Jazz Chops to Work at His Blue Note Residency Opening in Los Angeles: Concert Review",
    "url": "https://variety.com/2025/music/concert-reviews/charlie-puth-jazz-chops-blue-note-la-concert-review-1236555683/",
    "image": "https://variety.com/wp-content/uploads/2025/10/MG_0240-e1760730908130.jpeg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-17T20:44:29.000Z",
    "description": "\n\tShortly after Charlie Puth took the stage for the first of his four-night residency at Los Angeles’ freshly-opened Blue Note, he shared his intentio",
    "body": "\n\tShortly after Charlie Puth took the stage for the first of his four-night residency at Los Angeles’ freshly-opened Blue Note, he shared his intentions with those in attendance and the thousands watching on a TikTok livestream. “We’re going to play these songs in the original way that I concocted them in my head,” he said. “Whenever I write anything, it comes from a jazz perspective, because I love jazz so much.” (He accented those last words with chameleonic jazz chords to drive the point.) “You can only put so much into a pop song, but you can trick the listener into appreciating jazz-isms in your pop music, which is something I’ve always taken pride in doing.”\n\t\n\n\tFor the casual listener, Puth has established himself as the sort of outré pop savant whose songs are too meticulously structured to dismiss. Since the release of his 2016 debut album “Nine Track Mind,” he’s consistently shaved down the edges of pop convention to approach an idealized version of the earworm, creating tracks so immediate that in one way or another, they thrust their way into mainstream consciousness, trends be damned. It’s happened regularly over the past decade, from the love-it-or-often-hate-it “Marvin Gaye” to the funk-snapped “How Long” and “Attention” to the TikTokian “Light Switch,” a song that he materialized in real time on social media to the delight of fans yearning for connection to the outside world amid Covid lockdowns.\n\n\n\tBut none to the surprise of Puthers, at the heart of his discography is a fundamental understanding of music theory, more specifically jazz composition. One of Puth’s greatest talents is constructing songs that sound simple but are powered by dynamic chord switches and deceptively complicated harmonies. It’s no secret that he has perfect pitch — it’s become a running gag at this point — but it’s his fundamental understanding of subtle tonal shifts and modulation that deepens his music, creating a sense of propulsion that rooms of songwriters regularly attempt to chase.\n\t\n\n\tPuth often does this all on his own, lifting the curtain on his process on social media and, more recently, becoming pop’s artist-in-residence with his Professor Puth series. (His latest manifesto on how AI could never replace the elasticity of human creativity is worth a watch.) He is, quite frankly, a music nerd. His latest single “Changes,” which he released yesterday and honored with a coronation as the Blue Note set’s closer, is yet another foray into pop’s wilderness, this time landing somewhere between Toto, Peter Gabriel and Phil Collins. It reveals another color in his crayon box, adapting tropes of 1980s pop to modern times.\n\n\tAnd so Puth gave the Blue Note audience a glimpse into the recesses of his mind across his 75-minute set on Thursday night (the first of two performances that evening), transforming his hits and deep cuts into the alternative versions he initially envisioned. “Attention” was presented as a jazz lounge floater, all plucky guitar strings and wobbly bass notes, ultimately concluding with a cappella harmonies alongside his trio of backup singers. Near the end of “Boy,” perhaps his greatest song, he transitioned into the loose, jazz improv groove of Erykah Badu’s “Back in the Day (Puff).” He introduced a breathable cover of New Edition’s “Can You Stand the Rain” as “the song we wish we all wrote,” Puth-ifying it with his trembling falsetto.\n\n\tAs a showman, he has had extensive practice. He’s played New York City’s Radio City Music Hall and Los Angeles’ Greek Theatre, and last year set sail for his “Something New” tour in Asia. On stage, he’s an adorable ham, so galvanized by the music that he’ll stomp his feet like he’s running in place as a song like “How Long” segues from the bridge to its explosive chorus. Yet his Blue Note show was a return to form, at least by his account, and he admitted that the tiny club setting made him nervous. “I’m not a new artist anymore, y’all are still with me,” he said. He prefaced a fleshier version of “Suffer” by detailing how he wrote it when he first moved to Los Angeles at an apartment building less than a mile from the venue. “But I feel like a new artist. These are the stages that I would play in the beginning of my career. I always knew I would do a show like this, it just happened 10 years later.”\n\t\n\n\tMuch has changed for Puth in the past decade. He’s leagues removed from his 2010 EP “Otto Tunes,” a very rough draft of the type of artist he would inevitably become. Yet he’s continuously refined his sound and style to put his years of training into practice. So when Taylor Swift sang that “Charlie Puth should be a bigger artist” on last year’s “The Tortured Poets Department,” she had a point — the venues may change, and the sound may evolve, but the one constant is that Puth remains singular in his pursuit of pop excellence.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Charlie Puth Puts His Jazz Chops to Work at His Blue Note Residency Opening in Los Angeles: Concert Review",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/MG_0240-e1760730908130.jpeg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-17T20:44:29.000Z",
      "dateModified": "2025-10-17T20:44:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘The Diplomat’ Creator on Kate and Hal’s Marriage and Season 3’s Horrifying Last-Minute Twist: ‘There’s Nothing a Character in This Show Does That We Can’t Justify’",
    "url": "https://variety.com/2025/tv/news/the-diplomat-season-3-grace-hal-steal-poseidon-trick-kate-1236555044/",
    "image": "https://variety.com/wp-content/uploads/2025/10/TheDiplomat-Season3-Kate.Hal_.1.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-17T21:45:00.000Z",
    "description": "\n\n\tSPOILER ALERT: This story contains spoilers from Season 3 of “The Diplomat,” now streaming on Netflix.\n\n\tWe’ve met before, “The Diplomat” creator a",
    "body": "\n\n\tSPOILER ALERT: This story contains spoilers from Season 3 of “The Diplomat,” now streaming on Netflix.\n\n\tWe’ve met before, “The Diplomat” creator and showrunner Debora Cahn and I, with Keri Russell, in New York, before the second season of the farcical political thriller dropped. Back then, at an Upper Westside bistro, Cahn, Russell and I had lots of drinks — the kind that, Cahn says, leave you “foggy the next day, and yet you do it anyway.”  “I started doing it at 17,” she says, “and here I am at 50-something still doing it.”\n\n\tWe don’t learn.\n\n\tAnd that’s partly why Kate (Russell), in Season 3 of “The Diplomat,” after her marriage to Hal (Rufus Sewell) has basically ended, has taken up with a guy very much like Hal, and in part why she goes back to Hal in the last few minutes of the season: We don’t learn. But because this is Cahn’s “Diplomat,” it’s much more nuanced and complicated than that.\n\n\tBut, wait, before we get into this, I have to tell you that when Cahn came onto my Zoom to talk about Season 3, it was 6:30 am my time, 9:30 hers, and though I had a cup of coffee in my hand, I hadn’t had a sip.\n\n\tShe said, “We’re always drinking, you and me — we have our wine, we have our coffee.” Or I think that’s what she said, because in the blurry, yet-unshowered, coffeeless excitement of getting to unpack Season 3 with Debora Cahn, I neglected to push the button on my iPhone voice app and she didn’t hit record on Zoom.\n\n\tIt’s a shame, because Cahn is so funny and insightful and has a uniquely wonderful way with words. But I have my notes.\n\n\n\n\t\n\n\t\t\t\t\tKeri Russell with showrunner Debora Cahn\n\t\t\t\t\t\t\t\t\tCourtesy of Liam Daniel/Netflix\n\t\n\n\n\n\tLet’s just start with what happened this season.\n\n\n\tGrace Penn (Allison Janney) learns two things at once: that she’s now the president of the United States because the last president, William Rayburn (who was played by Michael McKean), has died; and that Rayburn had a heart attack during a phone conversation with Hal. Grace knows what this means: that Hal called Rayburn to tell him that it was she, his untrustworthy VP, who, behind this back, had orchestrated the bombing of the HMS Courageous, killing 41 British sailors.\n\n\tSo Grace is furious, mostly at Kate (because Kate was the messenger, but also because Grace has always disliked Kate for gunning for her job). And instead of naming Kate as her VP, Grace Penn names Hal.\n\n\n\tThis precipitates a crisis in the Wyler home (or should I say manse, because they’re still living at Winfield House in England). Hal, in love with his brilliant, beautiful wife, says he’ll turn down the vice-presidency if that’s what Kate wants, and Kate, though she’s cross-eyed with anger, tells him to take it. (What else is she going to say?)\n\t\n\n\tHal is upset too — he knows how hard it is for Kate that he got the job instead of her, and that she’s now going to have the thankless job of being the Second Lady of the United States instead of the Ambassador to England, where she’s thought of as “England’s darling.”\n\n\n\n\t\n\n\t\t\t\t\tAllison Janney as Grace Penn\n\t\t\t\t\t\t\t\t\tCourtesy of Netflix\n\t\n\n\n\n\tLong story short, Grace Penn is sworn in, Kate says her goodbyes to her staff at Winfield and at the embassy and she and Hal drive to the airport. Then Hal climbs the stairs to the plane — and Kate doesn’t follow. She stands on the tarmac with tears in her eyes. Hal waits a beat, their eyes locked, and then he boards the plane, leaving Kate behind.\n\n\tA few months go by, and Hal surprises Kate in England for their anniversary. But the surprise is his when he discovers that Kate is having an affair with a young MI6 agent, Callum Ellis (Aidan Turner), and seems to be happy.\n\n\tHal and Kate, who still have to share a bedroom for appearance’s sake, fight about it that night — about how they agreed to be married on the outside but divorced in private, so why the jealousy? About how Kate, just as much as Hal, would love to have sex with her ex, but that’s a bad idea, so back off. And, finally, from Kate’s point of view, how Hal took the job of VP knowing it would destroy their marriage. After the fight, Kate runs down the stairs to a quiet den, curls up into a fetal position on the rug and weeps.\n\n\tCIA station chief Eidra Park (Ali Ahn), meanwhile, has heard from a source that a Russian official believes that an American was involved in the bombing of the HMS Courageous. The source checks out, and it’s clear that this information is going to leak to the public. Kate, Hal and Eidra fly to meet up with Grace Penn at her home in Amagansett on Long Island, where they encounter Grace Penn’s long-suffering husband, Todd Penn (Bradley Whitford), who really hates being what he calls “first lady.” Todd doesn’t trust his wife nor her new VP, and seems almost jealous of him.\n\t\n\n\n\n\t\n\n\t\t\t\t\tAllison Janney as Grace Penn, Rufus Sewell as Hal Wyler, Nana Mensah as Billie Appiah, Keri Russell as Kate Wyler \n\t\t\t\t\t\t\t\t\tCourtesy of Netflix\n\t\n\n\n\n\tIn any case, Grace, Hal, and the White House Chief of Staff Billie Appiah (Nana Mensah) go back and forth about how to deal with the impending leak that Grace Penn masterminded the bombing of the ship. Finally, they land on bringing British Prime Minister Trowbridge (Rory Kinnear) to Amagansett, telling him about the Russian source and admitting that Grace Penn was involved. They assume he’ll stay quiet once they make a deal where America will solve all of Britain’s financial problems if Trowbridge does a joint press conference with Grace Penn and announces to the world that, not Grace, but Trowbridge’s close confidante Margaret Roylin (Celia Imrie) — who died by suicide in the season premiere, while in U.S. custody — had masterminded the bombing.\n\n\tKate’s the only one among them who knows that this is a suicidal idea. She knows that Trowbridge will freak out when he hears that any American was involved in the bombing. But no one will listen to Kate, least of all Hal. Desperate, Kate finally tells Grace Penn that Hal is lying when he says he thinks this is a good plan; in fact, he only agreed to it because he knows that when the plan fails and Grace Penn is ousted from office, Hal will become president.\n\n\tAt this point, Billie boots Kate, sending her back to England, but she has an idea. She tries to get in contact with Hal, who won’t speak to her — nor will anyone else. No one trusts Kate anymore. No one, that is, except Todd Penn. As the secret service is escorting Kate off the property, she jumps into the pool where Todd is swimming laps. She tells him that Grace Penn should not tell Trowbridge that she bombed the ship, but instead that Rayburn bombed it. After all, he’s dead, so what does it matter? Todd gets out of the pool: He understands that Kate’s plan will save his wife’s career.\n\n\tThough Kate is still persona non grata, she’s allowed to stay. Trowbridge arrives, along with his advisor (and Kate’s crush) Austin Dennison (David Gyasi), and the deal is made: In exchange for America’s financial help, Trowbridge will tell the world that Margaret Roylin bombed the ship. Before the press conference begins, Dennison visits Kate in her quarters and tells her that this deal will mean that America will forever be in the debt of England. That is, anything England wants, America will have to give them for generations to come. Kate tells Dennison that that’s not going to happen. Their parting is icy.\n\n\tThen, when it comes time for the press conference, Trowbridge goes rogue and announces that President Rayburn blew up the HMS Courageous, killing 41 British seamen. He doesn’t even mention Roylin. Mayhem ensues.\n\n\tBack in England, citizens are now protesting the U.S. outside the consulate, and Kate gets stuck inside the manse with Callum, who has come by to tell her that, on top of all these events, there’s a Russian submarine felled off the shores of England, all its crew dead. Not only that, but on the sub was carrying the super weapon Poseidon, a nuke that has heretofore been thought of as only a myth because it’s capable of such unthinkable destruction.\n\n\tKate and Callum fight about the fact that he took it upon himself to make decisions (about who to tell and who not to tell) about such an important matter. And she suddenly realizes that she’s fallen for a man who’s exactly like her husband. She lays into him the way she does Hal. Callum says he’d never let a wife of his talk to him like that.\n\n\n\n\t\n\n\t\t\t\t\tBradley Whitford as Todd Penn, Allison Janney as Grace Penn, David Gyasi as Austin Dennison, Rufus Sewell as Hal Wyler, Tracy Ifeachor as Thema Dennison, Keri Russell as Kate Wyler\n\t\t\t\t\t\t\t\t\tCourtesy of Idris Solomon/Netflix\n\t\n\n\n\n\tStill, something must be done about the sub before China or Russia gets to it. (Trowbridge is currently buddying up to China.) Callum says that Grace Penn needs to apologize to Trowbridge for what Trowbridge thinks are Rayburn’s actions, and then the two countries can deal with the sub and the weapon together.\n\t\n\n\tWhen Kate talks to Hal, he gets Billie on the phone and helps organize a meeting between Grace Penn and Trowbridge in England. She won’t apologize, but she’ll offer to help with the sub. The meeting happens at Trowbridge’s house, and Trowbridge wants nothing to do with Grace Penn or America. He storms out.\n\n\tTurns out Trowbridge thinks Grace Penn is lying about the Poseidon, and so it becomes Kate, Hal, Billie and Grace Penn’s mission to convince him before it’s too late.  Kate tries to get Callum to tell Trowbridge all he knows, but Hal nixes that plan, knowing that Callum is good for Kate, and not wanting her to lose him.\n\n\tSo Kate comes up with another plan: Unbeknownst to Trowbridge, the Americans will send a submarine to take photos of the Russian sub, which will have been modified to hold the weapon. Grace Penn can then show them to Trowbridge and prove that the Poseidon exists.\n\n\tGrace Penn balks at how dangerous sending an American submarine into English waters would be, and Hal, after asking Kate to leave, tells Grace that there’s a way to make this work. We don’t know what that plan is, but Grace Penn agrees.\n\t\n\n\tLater that night, Callum visits Kate in her room and she lies to him, telling him she’s got things to do when in fact she just doesn’t want him there. Maybe the tide is turning on her feelings for him.\n\n\tThe next day Grace Penn, Billie, Kate, and Hal meet with Trowbridge. Grace Penn shows him the photos the Americans have taken of the sub with the Poseidon, and apologizes for all the trouble caused. She says that she’s ready to help Britain with the Russian sub. But Trowbridge still refuses.\n\n\tThat’s when Hal whispers to Kate to talk to Trowbridge — clearly, they made a plan last night where Kate would convince Trowbridge to bury the Russian sub so that no nation could ever get it. Trowbridge agrees to Kate’s plan. This is the kind of teamwork that Hal and Kate have been excelling at for years — and what makes their marriage so electric — and when Hal winks at Kate from across the negotiating table, she is clearly pleased.\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tCourtesy of Netflix\n\t\n\n\n\n\tShortly after, Kate breaks down and apologizes to Hal, begging him to take her back. He does. It’s clear that she’ll give up her job in England and come back to Washington with her husband.\n\n\tAs the cars are being loaded, Callum pulls Kate aside and tells her that he believes the Russians stole the super weapon — that radiation levels near the sub have dropped 60%, and the only explanation for that is that the weapon is no longer there. Kate tells Hal that the Russians found the sub and took the weapon. Hal rushes away, ostensibly to tell Grace Penn.\n\n\tJust then, Todd Penn comes up behind Kate and asks her whether it bothers her, the relationship between Hal and Grace Penn. Kate says no, why would it?, but then she looks over and watches the way Hal and Grace Penn are standing together, whispering, and then she knows: It wasn’t the Russians who stole the super weapon; it was Grace Penn and Hal.\n\t\n\n\tShe confronts Hal, putting it all together as she does: The Brits will consider this an act of war. The Russians will think the Brits stole the weapon, and will attack them. Not only that, but Hal used Kate to convince Trowbridge to bury the sub, implicating her in this plot.\n\n\tHal orders Kate to keep quiet, and then goes over to Grace Penn. She asks if everything’s OK, and Hal says no. He says, “She knows.”\n\n\n\n\t\n\n\t\t\t\t\tAidan Turner as Callum Ellis, Russell as Kate Wyler\n\t\t\t\t\t\t\t\t\tCourtesy of Clifton Prescod/Netflix\n\t\n\n\n\n\t“Kate’s such a mess this season,” I say to Cahn to start our (unrecorded) Zoom call off. She says, “Kate’s always a mess,” and laughs.\n\n\tYeah, I say, but why did she hook up with that shit Callum? Why didn’t she have the long-promised affair with Dennison? Cahn laughs when I call Callum “a shit,” and tells me a story about guy, during a recent interview, who asked her about Kate’s “mental illness.”\n\n\tClearly, this bothered Cahn. So she said to the guy, “I wrote a character who was bipolar in ‘Homeland’ — that’s a medical condition. But I don’t think I’ve said anywhere that Kate is crazy.’” Then she says, “Men think Kate is crazy; women think Callum is a shit.”\n\n\tStill, I’m on Team Hal, because, to quote Paul Newman about Joanne Woodward, why have hamburger when you can have steak? I push Cahn: Kate is all over the place. She tells Hal to take the VP job, and then cries on the rug in a fetal position after blaming the end of their marriage on the fact that he took the VP job. What’s up with that?\n\n\tCahn says: “Kate got to the airport, got out on the tarmac, and she hit a wall. She just couldn’t move forward. And Hal could have turned around and come down the stairs and said to her, ‘Let’s talk about this. Let’s work this out.’ But he didn’t. He just turned around and stepped onto the plane.”\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tCourtesy of Netflix\n\t\n\n\n\n\tOK, fair. But then why didn’t Kate have the affair with Dennison, I ask Cahn.\n\t\n\n\t“You plant these characters like seeds in a garden, and you wait to see how they grow,” she says. “Dennison grew to be a moral center in the show, standing between Trowbridge and Kate. He’s worked so hard to get where he is, and he’s not going to throw his career away by having a fling with an American who’s there only temporarily.”  She then adds, “Dennison was useful to Kate as a comparison to Hal, who Kate has always had issues with when it comes to where he is morally.”\n\n\tSo then why Callum?\n\n\t“Hal has kept Kate centered for years,” Cahn says. “And now they’re at that time in their life, during a divorce, when their world falls apart. So Kate is casting about to figure out who she is.\n\n\t“People do this when they first get divorced: They find the same person. Because they think they have the perfect person in their spouse — except for these flaws. And when they look for a new person, they want that perfect person again, only this time without those flaws. But the flaws are actually the flipside of what makes that person who they are.” She holds out her hand, palm side down and then flips it, palm side up.\n\n\t“True love is not beautiful,” she says. “True love is un-beautiful. I think of relationships like any other drug or addiction.”\n\n\tI am still digging in, because it really bugs me that Kate would have this important revelation about Callum — that he is not a good guy — and then she goes sniveling back to him, asking him to try again. I say to Cahn, “Why would Kate do that? She’s a strong woman.”\n\n\tSuddenly Cahn blanches and says, “Oh, my God, Trish.” She puts her hand over her mouth and takes a sharp intake of breath. “Oh, my God,” she says again, “I just realized something.” Finally, after a solid minute, she says, “I never realized that I’m writing about my parent’s marriage!”\n\n\tShe tells me the story. “My mom wanted to leave; my dad didn’t. He was devastated. And I understood why she did it — my dad didn’t, but I did. But the thing that I found hard was when they then started dating.”\n\n\tThat is, dating each other.\n\t\n\n\tFinally, she says, about her mom and about Kate, “My mom experimented by making decisions and then living them. I think that’s very brave.”\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tCourtesy of Liam Daniel/Netflix\n\t\n\n\n\n\tAfter a moment, she says, “I had no idea that I was writing my parents’ marriage. Thank you for the therapy session.”\n\n\tAnd just like therapy, our time is up.\n\n\tThere is so much more to cover so I throw out one last question about Hal. Did he use Kate to get the super weapon? Was he so angry at her that he just pretended to want her back?\n\n\tCahn says, “Hal used Kate to make the deal where they’d bury the empty sub. But he wanted her back. He accepts her back fully. I have a lot of empathy for Hal; he’s tried so hard to let her go.”\n\n\tBut is he evil?\n\n\t“There’s nothing a character in this show does that we can’t justify,” Cahn says.\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tCourtesy of Netflix\n\t\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘The Diplomat’ Creator on Kate and Hal’s Marriage and Season 3’s Horrifying Last-Minute Twist: ‘There’s Nothing a Character in This Show Does That We Can’t Justify’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/TheDiplomat-Season3-Kate.Hal_.1.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-17T21:45:00.000Z",
      "dateModified": "2025-10-17T21:45:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘General Hospital’ Dominates Daytime Emmys With Seven Wins, Including Top Drama Prize (FULL LIST)",
    "url": "https://variety.com/2025/tv/news/daytime-emmys-2025-full-winners-list-1236555619/",
    "image": "https://variety.com/wp-content/uploads/2025/09/Daytime-Emmys-2025.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-17T23:02:11.000Z",
    "description": "\n\tThey’re celebrating in Port Charles. ABC’s “General Hospital” dominated the 52nd Daytime Emmys, winning seven prizes on Friday night — including  ou",
    "body": "\n\tThey’re celebrating in Port Charles. ABC’s “General Hospital” dominated the 52nd Daytime Emmys, winning seven prizes on Friday night — including  outstanding drama series.\n\n\t“GH”  also picked up wins for lead actress in a daytime drama (Nancy Lee Grahn), supporting actor (Jonathan Jackson), writing team, directing, costume design/styling and for guest performer Alley Mills. \n\n\tThis year’s Daytime Emmys took place at the Pasadena Civic Auditorium, hosted by “Access Hollywood” anchor Mario Lopez. The National Academy of Television Arts & Sciences are behind the show, which this year has struck a deal with “Access” to do a deep recap of the ceremony — including red carpet coverage, winner reactions and other footage — on Monday. Viewers who want to watch the Daytime Emmys live can do so on NATAS’ The Emmys app, as well as at watch.theemmys.tv. (This marks the first year in a while that the Daytime Emmys didn’t run on CBS, which carried the kudocast from 2020 to 2024.)\n\t\n\n\tAmong other big winners, Apple TV+’s “The Secret Lives of Animals,” which picked up three Emmys — including outstanding science and nature program. And then there was Netflix’s “Secret Lives of Orangutans,” which also won three — and made history.\n\n\n\tThat’s because “Secret Lives of Orangutans” narrator Sir David Attenborough became the oldest Daytime Emmy winner ever, at 99. He surpassed Dick Van Dyke, who previously set the record last year. Attenborough’s win was one of three for the doc, which also won directing team for a single camera daytime non-fiction program.\n\n\tAmong other multiple winners: CBS Media Ventures’ “The Drew Barrymore Show” won three, including for outstanding daytime talk host and for outstanding hairstyle and makeup. Also from CBS Media Ventures, “Entertainment Tonight” won two, for outstanding entertainment news series and outstanding daytime personality — daily. Netflix’s “Black Barbie” has won two, for arts and popular culture, and for its writing team. \n\t\n\n\tPeacock’s “Days of Our Lives” won two, including one for lead actor Paul Telfer, and one for casting. And then Food Network’s “The Delicious Miss Brown” also won two, for outstanding culinary instructural series, and for culinary host.\n\n\tAmong specials, ABC’s “Disney Parks Magical Christmas Day Parade” won for daytime special and for technical Direction/camerawork/video. Other big prizes included two for “The Kelly Clarkson Show,” while  “Live with Kelly and Mark” won for daytime talk series.\n\n\tThanks to “General Hospital” and “Secret Lives of Orangutans,” ABC and Netflix led the winner’s circle with nine each. They were followed by syndicator CBS Media Ventures, with six. Others with multiple wins include Apple TV+ (three), and CBS, Food Network, NBCU and Peacock, with two each.\n\n\tThe Daytime Emmys previously took place in June; the decision to move it to October came as NATAS realigned the timing for some of its biggest shows. This year’s eligibility window was between Jan. 1 to Dec. 31, 2024; among major changes to this year’s Daytime Emmy competition are new categories including Outstanding Emerging Talent in a Daytime Drama Program (won by “The Bold and the Beautiful” star Lisa Yamada), while the Culinary Series category has been split into two: Outstanding Culinary Instructional Series and Outstanding Culinary Cultural Series; and the Outstanding Travel, Nature, and Adventure category was also divided into Outstanding Travel and Adventure Program and Outstanding Nature and Science Program.\n\n\tA few other major changes: instead of a separate Creative Arts ceremony, the 52nd Annual Daytime Emmy Awards is being held as a single ceremony this year. And fans were offered the chance to buy tickets and attend for the first time in several years.\n\n\t“Welcome to the Daytime Emmys, the awards show for people who actually still watch television and aren’t doom scrolling on TikTok,” Lopez said in his open. The hot topic of AI also was addressed early in the ceremony, as Jodi Long, the current president of the SAG-AFTRA Los Angeles local chapter, introduced the guest performer category by noting, “Only humans can win an acting award!”\n\n\tDeborah Norville has been tapped to receive the National Academy of Television Arts & Sciences’ lifetime achievement award, which she was set to receive at Friday’s ceremony. Also during the ceremony, “Days of Our Lives” cast members past and present took the stage to mark the soap’s 60th anniversary.\n\t\n\n\tNATAS prexy/CEO Adam Sharp and Lisa Armstrong are executive producers with Rachel Schwartz serving as Head of the Daytime Emmy Awards. \n\n\tHere are this year’s Daytime Emmys winners:\n\t\n\t\tOutstanding Daytime Drama Series \t\n\n\t“Days of our Lives” (Peacock)\n\n\tWINNER: “General Hospital”  (ABC)\n\n\t“The Young and the Restless”  (CBS [Sony Pictures Television])\n\n\t\n\t\tOutstanding Lead Performance in a Daytime Drama Series: Actor \t\n\n\tPeter Bergman as Jack Abbott, “The Young and the Restless” (CBS) \n\n\tEric Martsolf as Brady Black, “Days of our Lives” (Peacock)\n\n\tGreg Rikaart as Leo Stark, “Days of our Lives” (Peacock) \n\n\tWINNER: Paul Telfer as Xander Kiriakis, “Days of our Lives” (Peacock) \n\n\tDominic Zamprogna as Dante Falconeri , “General Hospital” (ABC)\n\n\t\n\t\tOutstanding Lead Performance in a Daytime Drama Series: Actress \t\n\n\tSharon Case as Sharon Newman, “The Young and the Restless” (CBS) \n\n\tEileen Davidson as Ashley Abbott, “The Young and the Restless” (CBS) \n\n\tMelissa Claire Egan as Chelsea Lawson, “The Young and the Restless” (CBS) \n\n\tWINNER: Nancy Lee Grahn as Alexis Davis, “General Hospital” (ABC)\n\n\tMichelle Stafford as Phyllis Summers, “The Young and the Restless” (CBS)\n\n\tLaura Wright as Carly Spencer, “General Hospital” (ABC)\n\n\t\n\t\tOutstanding Supporting Performance in a Daytime Drama Series: Actress\t\n\n\tLindsey Godfrey as Sarah Horton, “Days of Our Lives” (Peacock)\n\n\tCourtney Hope as Sally Spectra, “The Young and the Restless” (CBS)\n\n\tKate Mansi as Kristina Corinthos Davis, “General Hospital” (ABC)\n\n\tEmily O’Brien as Theresa Donovan, “Days of Our Lives” (Peacock)\n\n\tWINNER: Susan Walters as Diane Jenkins Abbott, “The Young and the Restless” (CBS)\n\n\t\n\t\tOutstanding Supporting Performance in a Daytime Drama Series: Actor\t\n\n\tTajh Bellow as TJ Ashford, “General Hospital” (ABC)\n\n\tBlake Berris as Everett Lynch, “Days of Our Lives” (Peacock)\n\n\tMichael Graziadei as Dianel Romalotti, “The Young and the Restless” (CBS)\n\n\tGregory Harrison as Gregory Chase, “General Hospital” (ABC)\n\n\tWINNER: Jonathan Jackson as Lucky Spencer, “General Hospital” (ABC)\n\n\t\n\t\tOutstanding Daytime Talk Series \t\n\n\t“The Drew Barrymore Show” (CBS Media Ventures) \n\n\t“The Jennifer Hudson Show” (Warner Brothers Television Distribution [JHUD Productions | Warner Bros. Unscripted Television | Telepictures]) \n\n\t“The Kelly Clarkson Show” (NBCUniversal Syndication Studios) \n\n\tWINNER: “Live with Kelly and Mark” (Disney Entertainment Distribution) \n\n\t“The View” (ABC)\n\n\t\n\t\tOutstanding Lifestyle Program \t\n\n\t“George to the Rescue” (NBC)\n\t\n\n\t“Hack Your Health: The Secrets of Your Gut”  (Netflix [Tremolo Productions] )\n\n\t“Harlem Globetrotters: Play It Forward ” (NBC [Hearst Media Production Group]) \n\n\t“Homegrown” (Magnolia Network [Eclipse Creative]) \n\n\tWINNER: “You Are What You Eat: A Twin Experiment” (Netflix [Netflix | OPS | The Vogt Foundation]) \n\n\t\n\t\tOutstanding Instructional/How-To Program \t\n\n\t“Dime Como Hacerlo” (Roku [This Old House Productions] )\n\n\t“The Fixers” (BYUtv)\n\n\tWINNER: “Fixer Upper: The Lakehouse” (Magnolia Network [Blind Nil])\n\n\t“Going Home with Tyler Cameron” (Amazon Prime Video [Amazon MGM Studios | High Noon Entertainment])\n\n\t“Married to Real Estate” (HGTV)\n\n\t“Martha Gardens” (Roku [Marquee Brands])\n\n\t\n\t\tOutstanding Culinary Instructional Series \t\n\n\t“Be My Guest with Ina Garten ” (Food Network [Pacific Productions])\n\n\tWINNER: “Delicious Miss Brown” (Food Network [FRANK.])\n\n\t“Emeril Cooks” (Roku [Marquee Brands]) \n\n\t“Lidia’s Kitchen”  (PBS [Tavola Productions]) \n\n\t“Selena + Restaurant”  (Food Network [July Moon Productions | Sony Pictures Television’s The Intellectual Property Corporation (IPC)])\n\n\t\n\t\tOutstanding Travel and Adventure Program \t\n\n\tWINNER: “Expedition Unknown” (Discovery Channel [Ping Pong Productions]) \n\n\t“Field Trip with Curtis Stone: Hong Kong”  (PBS [Sunny Side Up Productions]) \n\n\t“The Good Road”  (PBS [Good All Over]) \n\n\t“How I Got Here” (BYUtv [Forté Entertainment]) \n\n\t“Joseph Rosendo’s Steppin’ Out” (PBS) \n\n\t“Mexico Made With Love” (PBS [Symbio Studios]) \n\n\t\n\t\tOutstanding Entertainment News Series\t\n\n\t“Access Hollywood” (NBCUniversal Syndication Studios)\n\n\t“E! News” (E! Entertainment)\n\n\tWINNER: “Entertainment Tonight” (CBS Media Ventures)\n\n\t“Extra” (Warner Brothers Television Distribution [Warner Bros. Unscripted Television | Telepictures])\n\n\t\n\t\tOutstanding Culinary Cultural Series\t\n\n\t“BBQ High” (Magnolia Network [Hit + Run])\n\n\tWINNER: “Chasing Flavor with Carla Hall” (HBO | Max [Max | Fremantle’s Original Productions])\n\n\t“Ingrediente: Mexico” (Amazon Prime Video)\n\n\t“TrueSouth” (ESPN | ABC | SEC Network [Bluefoot Entertainment])\n\n\t\n\t\tOutstanding Legal/Courtroom Program\t\n\n\t“America’s Court with Judge Kevin Ross” (Entertainment Studios [Allen Media Group])\n\n\t“Divorce Court” (Fox)\n\n\tWINNER: “Hot Bench” (CBS Media Ventures)\n\n\t“Judy Justice” (Amazon Prime Video [Amazon MGM Studios | Sox Entertainment])\n\n\t“Justice For The People with Judge Milian” (Entertainment Studios [Allen Media Group])\n\n\t“We The People with Judge Lauren Lake” (Entertainment Studios [Allen Media Group])\n\t\n\n\t\n\t\tOutstanding Science and Nature Program\t\n\n\t“Living with Leopards” (Netflix [Wild Space | Natural History Film Unit Botswana | Freeborne Media | Netflix])\n\n\t“National Parks: USA” (National Geographic [Stronghold Studios, LLC])\n\n\tWINNER: “The Secret Lives of Animals” (Apple TV+)\n\n\t“Secret Lives of Orangutans” (Netflix [Silverback Films])\n\n\t“Secrets of the Neanderthals” (Netflix [BBC Studios])\n\n\t\n\t\tOutstanding Arts and Popular Culture Program\t\n\n\tWINNER: “Black Barbie” (Netflix [shondalandmedia])\n\n\t“Folk Americana Roots Hall of Fame” (PBS [Bright Blue Media Group])\n\n\t“Off Script With The Hollywood Reporter” (IFC [The Hollywood Reporter])\n\n\t“The Swift Effect” (Peacock)\n\n\t“Variety Studio: Actors on Actors” (PBS)\n\n\t\n\t\tOutstanding Daytime Special\t\n\n\t“Bob Newhart: A Legacy of Laughter: An Entertainment Tonight Special” (CBS)\n\n\t“Dinner Party Diaries With José Andrés” (Amazon Prime Video)\n\n\tWINNER: “Disney Parks Magical Christmas Day Parade” (ABC)\n\n\t“98th Annual Macy’s Thanksgiving Day Parade” (NBC)\n\n\t“Shelter Me: The Cancer Pioneers” (PBS)\n\n\t\n\t\tOutstanding Emerging Talent in a Daytime Drama Series\t\n\n\tOlivia d’Abo as Fifi Garrett, “The Bay” (Popstar! TV [LANY Entertainment | SheMogul Entertainment])\n\n\tAnnaLynne McCord as Cat Greene, “Days of our Lives” (Peacock)\n\n\tAshley Puzemis as Holly Jonas, “Days of our Lives” (Peacock)\n\n\tChristian Weissmann as Remy Pryce, “The Bold and the Beautiful” (CBS)\n\n\tWINNER: Lisa Yamada as Luna Nozawa, “The Bold and the Beautiful” (CBS)\n\n\t\n\t\tOutstanding Guest Performance in a Daytime Drama Series\t\n\n\tLinden Ashby as Cameron Kirsten, “The Young and the Restless” (CBS)\n\n\tClint Howard as Tom Starr, “The Bold and the Beautiful” (CBS)\n\n\tJacqueline Lopez as Blaze, “General Hospital” (ABC)\n\n\tWINNER: Alley Mills as Heather Webber, “General Hospital” (ABC)\n\n\tValarie Pettiford as Amy Lewis, “The Young and the Restless” (CBS)\n\n\tAvery Kristen Pohl as Esme Prince, “General Hospital” (ABC)\n\n\t\n\t\tOutstanding Daytime Talk Series Host\t\n\n\tWINNER: Drew Barrymore, “The Drew Barrymore Show” (CBS Media Ventures)\n\n\tJenna Bush Hager, Hoda Kotb, “Today with Hoda and Jenna” (NBC)\n\n\tKelly Clarkson, “The Kelly Clarkson Show” (NBCUniversal Syndication Studios)\n\n\tMark Consuelos, Kelly Ripa, “Live with Kelly and Mark” (Disney Entertainment Distribution)\n\n\tJennifer Hudson, “The Jennifer Hudson Show” (Warner Brothers Television Distribution)\n\n\t\n\t\tOutstanding Culinary Host\t\n\n\tWINNER: Kardea Brown, “Delicious Miss Brown” (Food Network)\n\n\tJoanna Gaines, “Magnolia Table with Joanna Gaines” (Magnolia Network [Blind Nil])\n\n\tIna Garten, “Be My Guest with Ina Garten” (Food Network)\n\n\tEmeril Lagasse, “Emeril Cooks” (Roku [Marquee Brands])\n\n\tMichael Symon, “Symon’s Dinners Cooking Out” (Food Network)\n\t\n\n\t\n\t\tOutstanding Daytime Personality – Daily\t\n\n\tWINNER: Cassie DiLaura, Denny Directo, Kevin Frazier, Rachel Smith & Nischelle Turner, “Entertainment Tonight” (CBS Media Ventures)\n\n\tScott Evans, Zuri Hall, Kit Hoover & Mario Lopez, “Access Hollywood” (NBCUniversal Syndication Studios)\n\n\tStar Jones, Corey Jovan, “Divorce Court” (Fox)\n\n\tWhitney Kumar, Kevin Rasco, Sarah Rose & Judge Judy Sheindlin, “Judy Justice” (Amazon Prime Video [Amazon MGM Studios | Sox Entertainment])\n\n\t\n\t\tOutstanding Daytime Personality – Non-Daily\t\n\n\tWINNER: Sir David Attenborough, “Secret Lives of Orangutans” (Netflix [Silverback Films])\n\n\tBrad Bestelink, “Living with Leopards” (Netflix [Wild Space | Natural History Film Unit Botswana | Freeborne Media | Netflix])\n\n\tAndi Sweeney Blanco, Courtney Dober, Rob North & Kirin Stone, “The Fixers” (BYUtv)\n\n\tAnthony Mackie, “Shark Beach with Anthony Mackie: Gulf Coast” (National Geographic [Nutopia])\n\n\tMartha Stewart, “Martha Gardens” (Roku [Marquee Brands])\n\n\t\n\t\tOutstanding Writing Team for a Daytime Drama Series\t\n\n\t“Days of our Lives” (Peacock)\n\n\tWINNER: “General Hospital” (ABC)\n\n\t“The Young and the Restless” (CBS)\n\n\t\n\t\tOutstanding Writing Team for a Daytime Non-Fiction Program\t\n\n\tWINNER: “Black Barbie” (Netflix [shondalandmedia])\n\n\t“Modern Pioneering with Georgia Pellegrini” (PBS [Georgia Pellegrini Media Group, Inc.])\n\n\t“National Parks: USA” (National Geographic [Stronghold Studios, LLC])\n\n\t“Secret Lives of Orangutans” (Netflix [Silverback Films])\n\n\t“Shelter Me: The Cancer Pioneers” (PBS [Steven Latham Productions])\n\n\t\n\t\tOutstanding Directing Team for a Daytime Drama Series\t\n\n\t“Days of our Lives” (Peacock)\n\n\tWINNER: “General Hospital” (ABC)\n\n\t“The Young and the Restless” (CBS)\n\n\t\n\t\tOutstanding Directing Team for a Single Camera Daytime Non-Fiction Program\t\n\n\t“Living with Leopards” (Netflix [Wild Space | Natural History Film Unit Botswana | Freeborne Media | Netflix])\n\n\t“Mutual of Omaha’s Wild Kingdom Protecting the Wild” (NBC [Hearst Media Production Group])\n\n\t“The Secret Lives of Animals” (Apple TV+)\n\n\tWINNER: “Secret Lives of Orangutans” (Netflix [Silverback Films])\n\n\t“Shark Beach with Anthony Mackie: Gulf Coast” (National Geographic [Nutopia])\n\n\t\n\t\tOutstanding Directing Team for a Multiple Camera Daytime Non-Fiction Program\t\n\n\t“Disney Parks Magical Christmas Day Parade” (ABC [Film 45 | EverWonder Studio | Yellow Shoes Studio])\n\n\tWINNER: “The Drew Barrymore Show” (CBS Media Ventures)\n\n\t“The Good Road” (PBS [Good All Over])\n\n\t“The Kelly Clarkson Show” (NBCUniversal Syndication Studios)\n\t\n\n\t“The Wizard of Paws” (BYUtv [Vox Media Studios | The Dodo | Nomadica Films])\n\n\t\n\t\tOutstanding Music Direction and Composition\t\n\n\t“Mysteries of the Terracotta Warriors” (Netflix)\n\n\t“National Parks: USA” (National Geographic [Stronghold Studios, LLC])\n\n\t“The Secret Lives of Animals” (Apple TV+)\n\n\tWINNER: “Secret Lives of Orangutans” (Netflix [Silverback Films])\n\n\t“Secrets of the Neanderthals” (Netflix [BBC Studios])\n\n\t\n\t\tOutstanding Technical Direction, Camerawork, Video\t\n\n\tWINNER: “Disney Parks Magical Christmas Day Parade” (ABC [Film 45 | EverWonder Studio | Yellow Shoes Studio])\n\n\t“The Drew Barrymore Show” (CBS Media Ventures)\n\n\t“Neighbours” (Amazon Prime Video [Amazon MGM Studios | FremantleMedia Limited])\n\n\t“The View” (ABC)\n\n\t“The Young and the Restless” (CBS)\n\n\t\n\t\tOutstanding Cinematography\t\n\n\t“Living with Leopards” (Netflix [Wild Space | Natural History Film Unit Botswana | Freeborne Media | Netflix])\n\n\t“Mysteries of the Terracotta Warriors” (Netflix)\n\n\tWINNER: “National Parks: USA” (National Geographic [Stronghold Studios, LLC])\n\n\t“The Secret Lives of Animals” (Apple TV+)\n\n\t“Secret Lives of Orangutans” (Netflix [Silverback Films])\n\n\t\n\t\tOutstanding Single Camera Editing\t\n\n\t“Hack Your Health: The Secrets of Your Gut” (Netflix [Tremolo Productions])\n\n\t“Mysteries of the Terracotta Warriors” (Netflix)\n\n\tWINNER: “The Secret Lives of Animals” (Apple TV+)\n\n\t“Secret Lives of Orangutans” (Netflix [Silverback Films])\n\n\t“Secrets of the Neanderthals” (Netflix [BBC Studios])\n\n\t\n\t\tOutstanding Multiple Camera Editing\t\n\n\t“Disney Parks Magical Christmas Day Parade” (ABC [Film 45 | EverWonder Studio | Yellow Shoes Studio])\n\n\t“The Fixers” (BYUtv)\n\n\t“How I Got Here” (BYUtv [Forté Entertainment])\n\n\t“The Kelly Clarkson Show” (NBCUniversal Syndication Studios)\n\n\tWINNER: “Resurrected Rides” (Netflix [Bright Bay Creative])\n\n\t\n\t\tOutstanding Live Sound Mixing and Sound Editing\t\n\n\tWINNER: “The Kelly Clarkson Show” (NBCUniversal Syndication Studios)\n\n\t“The Talk” (CBS)\n\n\t“The View” (ABC)\n\n\t“The Young and the Restless” (CBS)\n\n\t\n\t\tOutstanding Sound Mixing and Sound Editing\t\n\n\t“Hack Your Health: The Secrets of Your Gut” (Netflix [Tremolo Productions])\n\n\t“Joseph Rosendo’s Steppin’ Out” (PBS)\n\n\t“Living with Leopards” (Netflix [Wild Space | Natural History Film Unit Botswana | Freeborne Media | Netflix])\n\n\t“National Parks: USA” (National Geographic [Stronghold Studios, LLC])\n\n\tWINNER: “The Secret Lives of Animals” (Apple TV+)\n\n\t“Secret Lives of Orangutans” (Netflix [Silverback Films])\n\t\n\n\t“Secrets of the Neanderthals” (Netflix [BBC Studios])\n\n\t\n\t\tOutstanding Lighting Direction\t\n\n\t“Days of Our Lives” (Peacock)\n\n\t“The Drew Barrymore Show” (CBS Media Ventures)\n\n\tWINNER: “The Kelly Clarkson Show” (NBCUniversal Syndication Studios)\n\n\t“The View” (ABC)\n\n\t“The Young and the Restless” (CBS)\n\n\t\n\t\tOutstanding Main Title and Graphic Design\t\n\n\t“Car Masters: Rust to Riches” (Netflix [MAK Pictures])\n\n\t“The Drew Barrymore Show” (CBS Media Ventures)\n\n\tWINNER: “Hack Your Health: The Secrets of Your Gut” (Netflix [Tremolo Productions])\n\n\t“Reconnecting Roots” (PBS [lilDRAGON])\n\n\t“Tex Mex Motors” (Netflix [Mak Pictures])\n\n\t\n\t\tOutstanding Casting\t\n\n\tWINNER: “Days of our Lives” (Peacock)\n\n\t“General Hospital” (ABC)\n\n\t“Making Good” (BYUtv)\n\n\t“Start Up” (PBS [Arcadius Productions])\n\n\t“The Young and the Restless” (CBS)\n\n\t\n\t\tOutstanding Art Direction/Set Decoration/Scenic Design\t\n\n\t“The Drew Barrymore Show” (CBS Media Ventures)\n\n\t“The Kelly Clarkson Show” (NBCUniversal Syndication Studios)\n\n\t“Live with Kelly and Mark” (Disney Entertainment Distribution)\n\n\tWINNER: “Mysteries of the Terracotta Warriors” (Netflix)\n\n\t“The Young and the Restless” (CBS)\n\n\t\n\t\tOutstanding Costume Design/Styling\t\n\n\t“The Drew Barrymore Show” (CBS Media Ventures)\n\n\tWINNER: “General Hospital” (ABC)\n\n\t“Mysteries of the Terracotta Warriors” (Netflix)\n\n\t“Sherri” (Debmar-Mercury)\n\n\t“The Young and the Restless” (CBS)\n\n\t\n\t\tOutstanding Hairstyling and Makeup\t\n\n\t“The Bold and the Beautiful” (CBS)\n\n\tWINNER: “The Drew Barrymore Show” (CBS Media Ventures)\n\n\t“General Hospital” (ABC)\n\n\t“The Jennifer Hudson Show” (Warner Brothers Television Distribution)\n\n\t“The Kelly Clarkson Show” (NBCUniversal Syndication Studios)\n\n\t“Secrets of the Neanderthals” (Netflix [BBC Studios])\n\n\t“Sherri” (Debmar-Mercury)\n\n\t\n\t\tOutstanding Short Form Program\t\n\n\tWINNER: “Ballin’ Out” (Outsports)\n\n\t“Billboard Presents” (Billboard)\n\n\t“Catalyst” (LinkedIn News)\n\n\t“Eat This With Mara” (AJ+)\n\n\t“Live Like a Champion” (Healthline)\n\n\t\n\t\tOutstanding Regional Content in a Daytime Genre\t\n\n\t“Chicagoland’s Best Bites” (WMAQ-TV [Chicago/Midwest Chapter])\n\n\tWINNER: “createid | SARA: A Life in Dreams and Symbols” (Idaho Public Television [Northwest Chapter])\n\n\t“Danzando para Sanar” (WWDT-TV [Suncoast Chapter])\n\n\t“Hidden Homicide” (WGN-TV [Chicago/Midwest Chapter])\n\t\n\n\t“Relish” (Twin Cities PBS [Upper Midwest Chapter])\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘General Hospital’ Dominates Daytime Emmys With Seven Wins, Including Top Drama Prize (FULL LIST)",
      "image": [
        "https://variety.com/wp-content/uploads/2025/09/Daytime-Emmys-2025.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-17T23:02:11.000Z",
      "dateModified": "2025-10-17T23:02:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Celebrity Noods -- Babes Eating Pasta For National Pasta Day!",
    "url": "https://www.tmz.com/2025/10/17/celebrity-noods-babes-eating-pasta-for-national-pasta-day/",
    "image": "https://imagez.tmz.com/image/06/16by9/2025/10/17/0620a72202a241f2b667bde79b14ae46_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-17T20:51:19.000Z",
    "description": "\n    \n                    \n                          Celebrity Noods ...\n                          Babes Eating Pasta\n                          Happy ",
    "body": "\n    \n                    \n                          Celebrity Noods ...\n                          Babes Eating Pasta\n                          Happy Pasta Day 🍝!\n                      \n                  \n                        Published October 17, 2025 1:51 PM PDT\n                                                                            \n      \n    \n      \n        \n              \n    \n    \n          What better way to indulge in the Friday feels than slurpin' up Hollywood's hottest stars eating pasta! In honor of National Pasta Day, we've whipped up quite the treat for you ...\n      \n    \n          Celebs like Olivia Rodrigo savored every last bite of deliciousness, Dua Lipa's pasta nood will mac you smile, and Sofia Vergara brought the good food and good mood chowin' down on vacay ...\n      \n    \n          Grab your napkins and hit our gallery headfirst ... It's mouthwatering!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Dua Lipa\n              \n                          \n                Olivia Rodrigo\n              \n                          \n                Sofia Vergara\n              \n                          \n                Photo Galleries\n              \n                          \n                Famous Food\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Celebrity Noods -- Babes Eating Pasta For National Pasta Day!",
      "image": [
        "https://imagez.tmz.com/image/06/16by9/2025/10/17/0620a72202a241f2b667bde79b14ae46_xl.jpg"
      ],
      "datePublished": "2025-10-17T20:51:19.000Z",
      "dateModified": "2025-10-17T20:51:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bad Bunny Did Nothing Wrong By Sitting During ‘God Bless America,' Says Sports Superfan",
    "url": "https://www.tmz.com/2025/10/17/bad-bunny-marlins-man-speaks-on-not-standing/",
    "image": "https://imagez.tmz.com/image/8a/16by9/2025/10/17/8a1604aefdb34f308fa31c394cdcc424_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-18T00:31:10.000Z",
    "description": "\n    \n                    \n                          Bad Bunny\n                          'God Bless America' Controversy?\n                          Sp",
    "body": "\n    \n                    \n                          Bad Bunny\n                          'God Bless America' Controversy?\n                          Sports Superfan Says He Did Nothing Wrong!!!\n                      \n                  \n                        Published October 17, 2025 5:31 PM PDT\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Bad Bunny’s been getting slammed for sitting through \"God Bless America\" at Yankee Stadium recently -- but \"Marlins Man\" tells TMZ everyone needs to calm down... because the guy didn’t break any rules.\n      \n    \n          The sports superfan (real name Laurence Leavy) says he’s pissed people are ripping Bad Bunny for this ... insisting the rapper had every right to sit, it’s not against the law, and honestly, the world’s got way bigger problems than this.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Marlins Man says he was sitting right next to BB when it all went down and, sure, he told him to stand -- but Bunny’s camp had their own reasons. His handler even brought up that 'SNL' monologue where BB joked about Americans needing \"4 months to learn Spanish before the Super Bowl.”\n      \n\n          But Bunny himself stayed quiet, kept to himself, came late, left early, and was glued to his phone. Fans around them assumed he was ducking the National Anthem, and 'God Bless America' caught him off guard, so he left, but Marlins says it looked more like bad timing than some kind of major political statement.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          He admits the optics didn’t help -- especially since BB was in disguise and sitting next to himself, who was dressed like a human traffic cone -- but still, it shouldn’t be a scandal.\n      \n    \n          At the end of the day, Marlins says the whole thing was nothing but bad luck for Bunny... and it never should’ve blown up the way it did.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Bad Bunny\n              \n                          \n                TMZ Sports\n              \n                          \n                Super Bowl\n              \n                          \n                Politix\n              \n                          \n                Music\n              \n                          \n                MLB\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bad Bunny Did Nothing Wrong By Sitting During ‘God Bless America,' Says Sports Superfan",
      "image": [
        "https://imagez.tmz.com/image/8a/16by9/2025/10/17/8a1604aefdb34f308fa31c394cdcc424_xl.jpg"
      ],
      "datePublished": "2025-10-18T00:31:10.000Z",
      "dateModified": "2025-10-18T00:31:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Denise Richards' Estranged Husband Aaron Phypers Arrested After Court Hearing",
    "url": "https://www.tmz.com/2025/10/17/aaron-phypers-arrested-after-court-hearing/",
    "image": "https://imagez.tmz.com/image/c9/16by9/2025/10/17/c955658207944b4abf28d8e14718719c_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-17T23:32:02.000Z",
    "description": "\n    \n                    \n                          Aaron Phyphers\n                          Arrested Outside Court\n                          Lawyer ",
    "body": "\n    \n                    \n                          Aaron Phyphers\n                          Arrested Outside Court\n                          Lawyer Claims Denise Set Him Up!!!\n                      \n                  \n                        Published October 17, 2025 4:32 PM PDT\n                                                                      |\n                Updated October 17, 2025 6:08 PM PDT\n                                    \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          update\n  \n    \n          5:57 PM PT -- Cameras got Denise Richards leaving the courthouse after Aaron Phypers' arrest ... looking very confident. As you can see, she did not respond to questions. According to court records ... Aaron had an outstanding warrant related to felony domestic violence accusations leveled by Denise.\n      \n    \n      \n        \n                    \n                  \n      \n                    BACKGRID\n          \n    \n          5:01 PM PT -- Michael Finley, Aaron's lawyer, tells TMZ ... Aaron was arrested on an outstanding warrant believed to be connected to Denise's allegations of physical abuse. Aaron was not aware of the warrant ... and Finley accuses Denise and her legal team of \"setting him up\" by possibly incriminating himself in today's proceedings.\n      \n    \n          Denise Richards' estranged husband, Aaron Phypers, has been arrested after a contentious court hearing ... TMZ has learned.\n      \n    \n          Denise and Aaron were in court fighting over a permanent restraining order she wanted against him.\n      \n    \n          The hearing got heated when Aaron's mother testified she witnessed Denise throw a can opener at Aaron. She also denied her son ever abused or threatened Denise ... something Denise has repeatedly claimed.\n      \n    \n          We're told as Aaron exited the courtroom, L.A. County Sheriff's Deputies took him into custody. It's unclear why he was arrested. Although we know Denise has a temporary restraining order against Aaron, we don't know if that's the trigger for the arrest.\n      \n      \n              \n          \n                          \n                Denise Richards\n              \n                          \n                Aaron Phypers\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Denise Richards' Estranged Husband Aaron Phypers Arrested After Court Hearing",
      "image": [
        "https://imagez.tmz.com/image/c9/16by9/2025/10/17/c955658207944b4abf28d8e14718719c_xl.jpg"
      ],
      "datePublished": "2025-10-17T23:32:02.000Z",
      "dateModified": "2025-10-17T23:32:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "President Trump Commutes George Santos' Sentence",
    "url": "https://www.tmz.com/2025/10/17/president-trump-commutes-george-santos-sentence/",
    "image": "https://imagez.tmz.com/image/a7/16by9/2025/10/17/a7786b7104754fe9806b2e65dfe25ef6_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-17T22:28:53.000Z",
    "description": "\n    \n                    \n                          President Trump\n                          Cuts George Santos Huge Prison Break!!!\n               ",
    "body": "\n    \n                    \n                          President Trump\n                          Cuts George Santos Huge Prison Break!!!\n                      \n                  \n                        Published October 17, 2025 3:28 PM PDT\n                                                                      |\n                Updated October 17, 2025 5:42 PM PDT\n                                    \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          updates\n  \n    \n          5:30 PM PT -- Santo's lawyer, Andrew Mancilla, tells TMZ ... GS will likely get out around 11 pm ET, but that is just an estimation. Family will pick him up. He's looking forward to a good night of sleep at home.\n      \n    \n          President Trump is springing ex-Congressman George Santos from prison, saying the convicted fraudster has no business doing 7 years behind bars.\n      \n    \n          POTUS admitted Santos had been a \"rogue\" ... but added, at least Santos \"had the Courage, Conviction, and Intelligence to ALWAYS VOTE REPUBLICAN!\" That's enough in Trump's book to warrant a commutation of Santos' 87-month sentence for wire fraud and aggravated identity theft.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Santos just went into federal prison in NJ in July, when he was open about his fears of being assaulted or even killed while doing his time. He stressed he was NOT suicidal ... just in case something happened to him.\n      \n\n          Trump said he decided to pull the trigger on Santos' release because of Democratic Sen. Richard Blumenthal -- claiming Blumenthal was also a fraud for saying, years ago, he'd been on the battlefields in Vietnam while in the Marine Corps ... something the Senator later said he'd \"misspoken.\"\n      \n    \n          On Truth Social, Trump said he feels that's far worse than anything Santos has done, and that's why he signed the commutation ... and wished Santos a \"great life.\"\n      \n    \n          We've checked with the Bureau of Prisons, and as of Friday evening, Santos is still in custody at FCI Fairton in southern Jersey. It's unclear when he'll get sprung.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Donald Trump\n              \n                          \n                George Santos\n              \n                          \n                Crime & Arrests\n              \n                          \n                Politix\n              \n                          \n                Fairly Legal\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "President Trump Commutes George Santos' Sentence",
      "image": [
        "https://imagez.tmz.com/image/a7/16by9/2025/10/17/a7786b7104754fe9806b2e65dfe25ef6_xl.jpg"
      ],
      "datePublished": "2025-10-17T22:28:53.000Z",
      "dateModified": "2025-10-17T22:28:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sydney Sweeney Is Pretty in Pink at 'Christy' Premiere in London",
    "url": "https://www.tmz.com/2025/10/17/sydney-sweeney-stuns-at-christy-premiere/",
    "image": "https://imagez.tmz.com/image/82/16by9/2025/10/17/82d33db28c904152a0d8dd491a903515_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-17T21:50:47.000Z",
    "description": "\n    \n                    \n                          Sydney Sweeney\n                          Total Knockout in Pink on 'Christy' Red Carpet\n         ",
    "body": "\n    \n                    \n                          Sydney Sweeney\n                          Total Knockout in Pink on 'Christy' Red Carpet\n                      \n                  \n                        Published October 17, 2025 2:50 PM PDT\n                                                                            \n      \n    \n          Sydney Sweeney went from boxer to Barbie for the red carpet premiere of \"Christy\" ... and we have pics!\n      \n    \n          Check 'em out ... the actress stepped out in a pale pink, sheer lace number with a flowy skirt and sequin-embellished neckline in London Town Friday.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Despite playing extremely tough fighter Christy Martin in the movie, Sydney was a total softie at the premiere ... snuggling up to fans for selfies. Inside, Syd graciously shared the stage with her collaborators in front of the BFI London Film Festival crowd.\n      \n\n          The movie, out November 7, chronicles Christy's rise to becoming America's most well-known female boxer in the 1990s, to her husband's attempt to murder her in 2010.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          It's already receiving positive reviews, with a 71% fresh rating on Rotten Tomatoes. The film also stars Ben Foster and Merritt Wever.\n      \n    \n          Knock 'em dead, Sydney!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Sydney Sweeney\n              \n                          \n                Christy Martin\n              \n                          \n                Fashion\n              \n                          \n                Movies\n              \n                          \n                TMZ Sports\n              \n                          \n                Fairly Legal\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sydney Sweeney Is Pretty in Pink at 'Christy' Premiere in London",
      "image": [
        "https://imagez.tmz.com/image/82/16by9/2025/10/17/82d33db28c904152a0d8dd491a903515_xl.jpg"
      ],
      "datePublished": "2025-10-17T21:50:47.000Z",
      "dateModified": "2025-10-17T21:50:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]