[
  {
    "title": "Olivia Wilde Chokes Back Tears Over Sundance Standing Ovation for ‘The Invite’",
    "url": "https://variety.com/2026/film/news/olivia-wilde-sundance-standing-ovation-the-invite-1236640239/",
    "image": "https://variety.com/wp-content/uploads/2026/01/The_Invite-Still_1.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-25T03:44:27.000Z",
    "description": "\n\tOlivia Wilde just landed a massive hit in the snow. \n\n\tThe director and co-star of “The Invite,” a couples dramedy that plays out over one night in ",
    "body": "\n\tOlivia Wilde just landed a massive hit in the snow. \n\n\tThe director and co-star of “The Invite,” a couples dramedy that plays out over one night in a San Francisco apartment, unveiled the film on Saturday at the Sundance Film Festival. A packed house filled with industry heavyweights at the Eccles in Park City, Utah swooned for the project that also features Seth Rogen, Penelope Cruz and Edward Norton. \n\n\n\t“This was the dream, to premiere right here for you guys,” Wilde told the crowd, tossing in a final thank you to Sundance founder Robert Redford, who died last year at age 89. The subsequent 107-minute run followed a hapless, resentful couple (Wilde and Rogen) hosting their free-spirited new neighbors (Cruz and Norton). The ensuing madness — passive aggressive standoffs, food allergies, a swingers reveal, rug fetishes, tequila shots, and the concept of pegging — scored big laughs and poignant appreciation for relatable scenes from a marriage. \n\t\n\n\tAfter the credits rolled, Wilde returned to stage and received a standing ovation. She wiped away tears and asked the audience to sit down to bring out Rogen, Norton, her DP and crafts team and script co-writer Will McCormack. \n\n\tDuring the closing Q&A, Wilde was asked by Sundance programming head Kim Yutani how she walked a line of broad humor and raw emotion. \n\n\t“I heard a wise person say, you’re never as vulnerable as when you’re laughing. And I think that the great thing about this group is it allowed us to take people on that journey, to let them laugh, let them relax, and then just gut punch them,” she said. \n\t\n\n\tNorton praised Wilde for her third directorial outing, following “Booksmart” and “Don’t Worry Darling.” \n\n\t“Seth and I are both who have directed films that we’ve been acting in as well. Inevitably, you you come to moments where you say, ‘This was a terrible decision.’ It’s hard for me to overstate the grace and wisdom with which Olivia gave that performance and directed us.” \n\n\t“The Invite” is on the ground seeking distribution. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Olivia Wilde Chokes Back Tears Over Sundance Standing Ovation for ‘The Invite’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/The_Invite-Still_1.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-25T03:44:27.000Z",
      "dateModified": "2026-01-25T03:44:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Alex Honnold Successfully Free Solo Climbs Taipei 101 Skyscraper in Live Netflix Special",
    "url": "https://variety.com/2026/tv/news/alex-honnold-skyscraper-climb-netflix-live-interview-1236640217/",
    "image": "https://variety.com/wp-content/uploads/2026/01/SKYSCAPER_LIVE_9-e1769310522801.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-25T02:45:29.000Z",
    "description": "\n\tYou can exhale now: Alex Honnold successfully made it to the top of Taipei 101, in a live special on Netflix. “Sick!” he exclaimed at the top of the",
    "body": "\n\tYou can exhale now: Alex Honnold successfully made it to the top of Taipei 101, in a live special on Netflix. “Sick!” he exclaimed at the top of the tower, after climbing the tower in one hour and 35 minutes. “I’m so psyched!” And then he took a selfie.\n\n\tThe “Skyscraper Live” climb, which started a bit after 8 p.m. ET (9 a.m. Sunday morning Taipei time) appeared to be mostly a piece of cake for Honnold, with a few hiccups: Mostly, he appeared to lose audio contact with his team at a few points — and most importantly, lost his in-ear music soundtrack. (Luckily, he eventually got it back.)\n\t\n\n\tAnd then, at one point near the end, Honnold admitted, “You know what, I am kind of tired.” Later, he also noted how windy it was toward the top. \n\n\n\tThe thousands of Taipei residents watching on the ground, and the hundreds more inside the Taipei 101 — taking selfies and waving — cheered and gasped as Honnold made it through each step of the 1,667-feet skyscraper that is the 11th tallest building in the world.\n\n\tThis was a different kind of climb for Honnold, who normally does his feats — including the one that made him famous scaling Yosemite’s El Capitan for the Oscar-winning doc “Free Solo” — in solitude. Honnold’s wife Sanni McCandless was on hand too, and she revealed that she generally isn’t in attendance for his climbs either. At the end of the climb, McCandless was waiting for Honnold, and the two shared a long embrace.\n\n\tGiven the complexity of climbing a major skyscraper without any ropes or safety nets, Netflix and producers Plimsoll Prods. Ltd. worked closely with Honnold and risk management firm Secret Compass to plan out a meticulous set of safety protocols. “Skyscraper Live” was originally scheduled to take place the previous day (Saturday morning in Taipei, Friday night in the U.S.), but weather conditions forced Honnold and the production team to postpone by a day.\n\t\n\n\t“Every scenario has been mapped out, as you might expect,” Plimsoll CEO Grant Mansfield told Variety in a story published earlier this week. “The main focus has been on keeping Alex safe. This is a building he knows very well. It’s a building which is very well suited for climbing. If at any point he decides that he’s too tired when he’s on the building, we can get him off there as well. But Alex really knows what he’s doing. He’s an extraordinary kind of athlete.”\n\n\tIn that same story, Netflix unscripted series VP Jeff Gaspin said Netflix did have a contingency plan in place for a worst-case scenario. “It’s obviously a conversation that everybody has,” Gaspin said. “You can imagine what we’ll do. It’s nothing momentous. We’ll cut away. We have a 10-second delay. Nobody expects or wants to see anything like that to happen. But we will cut away, and it’s as simple as that.”\n\n\tHonnold spent a great deal of time in recent months preparing for the Taipei 101 climb, including practice climbs of the tower. The Taipei 101 climb started with Honnold crefully making his way up the tower’s slab base. From there, he got on the building’s middle section, designed like eight-story “bamboo boxes,” which required steep climbing over these overhanging sections. On the corner of those boxes are dragon figures, which Honnold mounted to get to the next level. The top part of Taipei 101 had overhanging sections where Honnold’s legs were dangling, and he used his upper body strength to scale up. He climbed a swinging ladder (moving due to heavy winds) to the very top, featuring a small, four-foot platform where he was truly the highest man in all of Taiwan.\n\n\tElle Duncan hosted the special, with commentary and contributions from the WWE’s Seth Rollins, YouTube star Mark Rober and climbers Pete Woods and Emily Harrington. Al Berman is showrunner and executive producer of “Skyscraper Live,” while Honnold, Grant Mansfield, James Smith, Alan Eyres and Jonathan Retseck are also EPs. Joe DeMaio is director.\n\n\tWatch below as Honnold makes his way to the very top of Taipei 101:\n\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Alex Honnold Successfully Free Solo Climbs Taipei 101 Skyscraper in Live Netflix Special",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/SKYSCAPER_LIVE_9-e1769310522801.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-25T02:45:29.000Z",
      "dateModified": "2026-01-25T02:45:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sundance Responds to Racist Maxwell Frost Assault at Sundance: We ‘Abhor Any Form of Violence, Harassment and Hate Speech’",
    "url": "https://variety.com/2026/film/news/maxwell-frost-assault-sundance-racist-action-1236640261/",
    "image": "https://variety.com/wp-content/uploads/2026/01/2256152345.jpg?crop=0px%2C80px%2C8192px%2C4608px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-01-25T04:28:32.000Z",
    "description": "\n\tThe Sundance Film Festival has released an official statement condemning an assauly against Florida Congressman Maxwell Alejandro Frost on Friday ni",
    "body": "\n\tThe Sundance Film Festival has released an official statement condemning an assauly against Florida Congressman Maxwell Alejandro Frost on Friday night at a CAA party in Park City.\n\n\tThe statement reads, “We strongly condemn last night’s assault and abhor any form of violence, harassment, and hate speech. While the incident occurred at a non-Festival-affiliated event, such behavior is intolerable and against our values of upholding a welcoming and inspiring environment for all our attendees.\n\t\n\n\t“The safety and security of our festival attendees is always our chief concern, and our thoughts are with Congressman Frost and his continued well-being,” the statement continues. “We encourage anyone with additional information on this matter to contact the Park City Police Department.”\n\n\n\tAfter Variety reported news that a man was arrested at the CAA party after punching another attendee in the face, Frost confirmed he was the victim of the attack on X, writing, “Last night, I was assaulted by a man at Sundance Festival who told me that Trump was going to deport me before he punched me in the face. He was heard screaming racist remarks as he drunkenly ran off. The individual was arrested and I am okay.” \n\n\tHe later added on X, “I am okay. Thank you for all the well wishes. We are in scary times. Please stay sae and do not let these people silence you. Onwards.”\n\n\tAs reported by Variety, the incident happened at Park City’s High West Saloon, where CAA‘s Sundance Film Festival party was taking place. The Caucasian perpetrator was detained by security and arrested by police. The suspect is believed to have snuck into the party, as he was not on the guest list.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sundance Responds to Racist Maxwell Frost Assault at Sundance: We ‘Abhor Any Form of Violence, Harassment and Hate Speech’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/2256152345.jpg?crop=0px%2C80px%2C8192px%2C4608px&resize=1000%2C563"
      ],
      "datePublished": "2026-01-25T04:28:32.000Z",
      "dateModified": "2026-01-25T04:28:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Olivia Wilde Wears ‘ICE Out’ Pin at Sundance and Says ‘This Country Is Hurting. I’m Appalled and Sickened…People Are Being Murdered’",
    "url": "https://variety.com/2026/film/news/olivia-wilde-ice-out-pin-sundance-appalled-sickened-1236640205/",
    "image": "https://variety.com/wp-content/uploads/2026/01/GettyImages-2258020213-1.jpg?crop=0px%2C186px%2C5455px%2C3069px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-01-25T02:03:57.000Z",
    "description": "\n\tOlivia Wilde is at the Sundance Film Festival with two movies, but like most everyone else this weekend, she’s concerned with the devastating news t",
    "body": "\n\tOlivia Wilde is at the Sundance Film Festival with two movies, but like most everyone else this weekend, she’s concerned with the devastating news that Alex Pretti, a 37-year old nurse, was killed by ICE in Minnesota Saturday morning. \n\n\tOn the red carpet for the Seth Rogen comedy she directed, “The Invite,” Wilde had some emotional words about what’s happening in the country right now. “We’re all here getting to celebrate something really beautiful and hopeful in film storytelling,” she said. “But the world is hurting right now, and this country is hurting. And it’s appalling.”\n\t\n\n\t“I’m appalled and sickened,” Wilde continued on the carpet. “We can’t go another day just sort of accepting this as our new norm. It’s outrageous. People are being murdered. And, I don’t want to normalize seeing people being murdered on the internet. On film. It’s. It’s hideous. And so if we can do anything out here to support the movement to cast ICE out, to delegitimize this unbelievably criminal organization, then that’s what we should be doing.”\n\n\tWilde, who is also at the festival to promote her appearance in Gregg Araki’s “I Want Your Sex,” said it was inspiring to see so many people protesting the government’s deployment of ICE.\n\n\t“I think so many Americans are [speaking out]. I mean, you see the marches happening around the country. Americans are speaking up in huge numbers, and it’s dangerous to be a protester now and people are still going out to the streets, which is incredibly inspiring.”\n\n\tEarlier on Saturday, Natalie Portman wore pins saying “ICE Out” and “Be Good” while talking about her film “The Gallerist” at the Variety Studio. “This is such a joyful community celebrating film here and we’re so excited to be showing ‘The Gallerist,’ but we’re also at a moment in our country’s history that is quite devastating,” Portman said. “It’s really impossible not to talk about what is happening right now and the brutality of ICE and how it has to stop immediately. But also, there’s a beautiful community that Americans are showing right now. They’re showing up for each other, protecting each other and fighting for their freedom. It’s a bittersweet moment to celebrate something we’re so proud of on the backdrop of our nation in pain.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Olivia Wilde Wears ‘ICE Out’ Pin at Sundance and Says ‘This Country Is Hurting. I’m Appalled and Sickened…People Are Being Murdered’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/GettyImages-2258020213-1.jpg?crop=0px%2C186px%2C5455px%2C3069px&resize=1000%2C563"
      ],
      "datePublished": "2026-01-25T02:03:57.000Z",
      "dateModified": "2026-01-25T02:03:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rob Lowe Says It’s ‘Criminal’ That L.A. Has Lost So Much Filming — and Reveals the Pettiest Thing Done to Him in Hollywood by Another Actor",
    "url": "https://variety.com/2026/film/news/rob-lowe-film-tv-production-los-angeles-criminal-1236640117/",
    "image": "https://variety.com/wp-content/uploads/2026/01/GettyImages-2257874755.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-25T00:22:56.000Z",
    "description": "\n\tRob Lowe has been vocal about his disdain for the fact that film and television production has been leaving Los Angeles in favor of other, more fina",
    "body": "\n\tRob Lowe has been vocal about his disdain for the fact that film and television production has been leaving Los Angeles in favor of other, more financially affordable cities. Although the actor says the state of filming in Hollywood is “getting better,” Lowe feels it’s “still criminal that we’ve ceded this entire industry to other states; other countries.”\n\n\t“This is going to sound incredibly self-serving, but a large part of the budget for tax credit is above the line,” Lowe says, referring to the salaries of actors, writers, directors and producers. “All of these other territories give you credit for above the line, and L.A. doesn’t. Until they do that, they’re never going to get any of the big shows back.”\n\t\n\n\tDue to new tax incentives for independent features, Lowe was able to stay in Los Angeles to shoot his latest movie, “The Musical,” which premieres at the Sundance Film Festival on Sunday. Directed by Giselle Bonilla and written by Alexander Heller, the zany comedy follows a frustrated playwright and middle school teacher named Doug (Tony-winner Will Brill) who discovers that his ex-girlfriend (“Community” star Gillian Jacobs), a fellow educator, has started dating the principal of the school (Lowe) where they all work. Driven by spite, Doug stages a wildly inappropriate school musical in an effort to ruin the principal’s chances of winning a prestigious award for academic excellence.\n\n\t“We thought a lot about ‘School of Rock’ if it were filmed like ‘Apocalypse Now.’ That guided us for a long time,” Heller said at the Variety Studio presented by Audible. \n\t\n\n\tThere’s an adage in Hollywood: Never work with children or animals. “The Musical” cast pushed back on that notion, with Brill calling the inclusion of several young actors one of “the most audacious” aspects of the film. Added Lowe, “Most of us were kid actors ourselves and have experienced what the kids experience in the film of not getting the part [in the musical] that they’d like; I never made it out of the chorus. So getting to be around kids, when we were once those kids, is really fun and satisfying.”\n\n\tIn line with the theme of “The Musical” — being motivated by spite — the cast and creative team thought about the pettiest thing they’ve ever done or had happen to them.\n\n\t“The list is long,” said Lowe, before bringing up a time he was accepting a trophy at an award ceremony. “There was a particular actor behind me who was trying to take off the bra strap of the other actress, grabbagging and pulling focus from my speech. I didn’t like it.” Lowe continued, “By the way, there’s no group pettier than actors, so it’s not surprising.”\n\n\tAlthough he didn’t specify the incident, there’s a grainy YouTube video that seems to fit the description with Lowe accepting the drama ensemble prize at the 2002 SAG Awards on behalf of “The West Wing.” In the background, his co-star Bradley Whitford appears to be teasing and toying with Allison Janney, who then starts to giggle while Lowe is speaking at the podium.\n\n\n\n\n\tAs for Bonilla, an occasion where she admits she was the perpetrator of some pettiness ended up having an outsized (positive!) influence on her career.\n\n\t“My high school boyfriend cheated on me with a mediocre film student who didn’t get into NYU. I submitted out of spite, and it’s the only film school I got into,” Bonilla said. “So that is why I stand before you today.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rob Lowe Says It’s ‘Criminal’ That L.A. Has Lost So Much Filming — and Reveals the Pettiest Thing Done to Him in Hollywood by Another Actor",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/GettyImages-2257874755.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-25T00:22:56.000Z",
      "dateModified": "2026-01-25T00:22:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘The Traitors’ Urges Viewers Not To ‘Ruin’ The Show With ‘Personal Attacks’: ‘What Happens In The Game Should Never Lead To Cyberbullying Or Harassment’ ",
    "url": "https://variety.com/2026/tv/news/the-traitors-colton-underwood-peacock-cyberbullying-1236640045/",
    "image": "https://variety.com/wp-content/uploads/2026/01/NUP_207869_-00828.jpg?crop=0px%2C0px%2C1000px%2C562px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-01-25T00:54:28.000Z",
    "description": "\n\tAs the competition continues to heat up on Season 4 of “The Traitors,” Peacock has released a statement urging passionate fans of the show to cool o",
    "body": "\n\tAs the competition continues to heat up on Season 4 of “The Traitors,” Peacock has released a statement urging passionate fans of the show to cool off. \n\n\t“We are committed to making our casts feel safe, respected, and supported – on screen and off,” reads the statement, which was posted to the “Traitors” Instagram account Saturday. “The cast of ‘The Traitors’ are real people, and what happens in the game should never lead to cyberbullying or harassment. There’s a difference between discussing a show and targeting individuals.”\n\t\n\n\t“Let’s not ruin the passion for this show with unwarranted negativity and personal attacks,” the statement continued. “We appreciate your support!” \n\n\n\tThe statement comes as online discourse around the season’s cast — specifically “Bachelor” alum Colton Underwood — has reached a fever pitch. But this isn’t the first time Peacock has had to remind viewers to be mindful of their words. The streamer released a similar statement last summer on the “Love Island USA” X account, urging viewers to remember the “amazing group of Islanders” are “real people – so let’s be kind and spread the love!” \n\n\tOn “The Traitors,” reality stars from a range of franchises are chosen to be Faithfuls or Traitors. To win, Faithfuls must successfully vote out the secret Traitors, whose goal is to claim the $250,000 prize for themselves. This season, Lisa Rinna (“Real Housewives of Beverly Hills” alum), Rob Rausch (“Love Island USA”) and Candiace Dillard Bassett (“Real Housewives of Potomac” alum) are the three chosen Traitors. \n\t\n\n\tSo far, all of them are still in the competition, along with Faithfuls including Underwood, Dorinda Medley, Eric Nam, Johnny Weir, Kristen Kish, Mark Ballas, Maura Higgens, Natalie Anderson, Stephen Colletti, Tara Lipinski and Yam Yam Arocho.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘The Traitors’ Urges Viewers Not To ‘Ruin’ The Show With ‘Personal Attacks’: ‘What Happens In The Game Should Never Lead To Cyberbullying Or Harassment’ ",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/NUP_207869_-00828.jpg?crop=0px%2C0px%2C1000px%2C562px&resize=1000%2C563"
      ],
      "datePublished": "2026-01-25T00:54:28.000Z",
      "dateModified": "2026-01-25T00:54:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Natalie Portman Slams ICE Brutality and Calls Out Awards for Shutting Out ‘Sorry Baby,’ ‘Ann Lee’ and More Women-Directed Movies: ‘Not Getting Accolades They Deserve’",
    "url": "https://variety.com/2026/film/news/natalie-portman-slams-ice-awards-women-directed-movies-1236640121/",
    "image": "https://variety.com/wp-content/uploads/2026/01/natalie.png?crop=0px%2C49px%2C1782px%2C1002px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-01-24T23:40:34.000Z",
    "description": "\n\tNatalie Portman hit the Sundance Film Festival press circuit for “The Gallerist” wearing “ICE Out” and “Be Good” pins, just hours after a man was fa",
    "body": "\n\tNatalie Portman hit the Sundance Film Festival press circuit for “The Gallerist” wearing “ICE Out” and “Be Good” pins, just hours after a man was fatally shot by federal agents in Minneapolis. Portman’s “Be Good” references Renée Good, who was killed by ICE in Minneapolis earlier this month. During an interview at the Variety Studio presented by Audible, Portman openly blasted ICE brutality.\n\n\t“This is such a joyful community celebrating film here and we’re so excited to be showing ‘The Gallerist,’ but we’re also at a moment in our country’s history that is quite devastating,” Portman said. “It’s really impossible not to talk about what is happening right now and the brutality of ICE and how it has to stop immediately. But also, there’s a beautiful community that Americans are showing right now. They’re showing up for each other, protecting each other and fighting for their freedom. It’s a bittersweet moment to celebrate something we’re so proud of on the backdrop of our nation in pain.”\n\t\n\n\tPortman’s interview took place ahead of the “The Gallerist” world premiere at this year’s festival. The movie, directed by “Birds of Prey” helmer Cathy Yan and co-starring Jenna Ortega,  centers on a desperate gallerist who conspires to sell a dead body at Art Basel Miami. Portman heaped praise upon her younger co-star.\n\n\t“She’s such a fucking great actress and so knowledgeable about film,” Portman said of Ortega. “She’s so on and in it. It is rare. I think you’re very focused and in tune with everything. You’re not there to mess around.”\n\n\tPortman went on to call Yan “a brilliant leader,” adding: “She has a specificity of vision. All the work ahead of time and her precise leadership leads to the possibility of spontaneity. Balancing this very specific tone that is satirical but also true emotion in it, which is almost impossible to create, she knew how to do it and guide us to it.”\n\t\n\n\tWith “The Gallerist” being one of Sundance’s biggest movies from a woman director and the premiere taking place just a few days after the Oscar nominations, Portman also took a moment during the interview to call out the Academy for snubbing a handful of female-directed movies this year. While Chloe Zhao’s “Hamnet” scored 8 nominations, including best picture and best director, many other movies directed by women were shut out.\n\n\t“So many of the best films I saw this year were made by women,” Portman said. “You just see the barriers at every level because so many were not recognized at awards time. Between ‘Sorry Baby’ and ‘Left-Handed Girl’ and ‘Hedda’ and ‘The Testament of Ann Lee’… Extraordinary films this year that I think a lot of people are enjoying and loving, but are not getting the accolades they deserve.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Natalie Portman Slams ICE Brutality and Calls Out Awards for Shutting Out ‘Sorry Baby,’ ‘Ann Lee’ and More Women-Directed Movies: ‘Not Getting Accolades They Deserve’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/natalie.png?crop=0px%2C49px%2C1782px%2C1002px&resize=1000%2C563"
      ],
      "datePublished": "2026-01-24T23:40:34.000Z",
      "dateModified": "2026-01-24T23:40:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Man Arrested at Sundance For Racially Motivated Incident at CAA Party; Victim Was Florida Congressman",
    "url": "https://variety.com/2026/film/news/man-arrested-sundance-racist-incident-caa-party-1236640115/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Egyptian-Theater-Park-City.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-24T22:54:04.000Z",
    "description": "\n\tA party crasher was arrested at Park City’s High West Saloon on Friday during CAA‘s Sundance Film Festival celebration after allegedly assaulting Co",
    "body": "\n\tA party crasher was arrested at Park City’s High West Saloon on Friday during CAA‘s Sundance Film Festival celebration after allegedly assaulting Congressman Maxwell Alejandro Frost. \n\n\tA source at the talent agency’s party said the man, who is Caucasian, was involved in a racially charged incident that took place at the eatery’s restroom. He apparently shocked other people in the bathroom by talking about how proud he was to be “white.” He then allegedly punched Frost, after he left the facilities. Security detained the man, who has not been identified, and police later took him into custody. \n\t\n\n\tAfter the incident was reported on Saturday, Frost, a Florida Democrat, posted on X that he was the victim of the alleged attack. “Last night, I was assaulted by a man at Sundance Festival who told me that Trump was going to deport me before he punched me in the face,” he wrote. “He was heard screaming racist remarks as he drunkenly ran off. The individual was arrested and I am okay.”\n\n\nLast night, I was assaulted by a man at Sundance Festival who told me that Trump was going to deport me before he punched me in the face. He was heard screaming racist remarks as he drunkenly ran off. The individual was arrested and I am okay.Thank you to the venue security and… https://t.co/Nhpj5rl3JO— Congressman Maxwell Alejandro Frost (@RepMaxwellFrost) January 24, 2026\n\n\n\tA spokesperson for CAA declined to comment, and a spokesperson for the Park City Police Department did not immediately respond to a request for comment. The source tells Variety that the man was not on any guest list and is believed to have snuck into the gathering. The Summit County Sheriff’s Office did not immediately respond to a request for information about whether or not the man had been released from jail.\n\n\tCAA is a major presence at Sundance, both because many of its clients’ projects premiere at the festival and because it is enlisted to help find distribution for some of the indie films that debut in Park City. \n\t\n\n\tThis year’s Sundance is the last one to be held at Park City. It will move to Colorado in 2027. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Man Arrested at Sundance For Racially Motivated Incident at CAA Party; Victim Was Florida Congressman",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Egyptian-Theater-Park-City.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-24T22:54:04.000Z",
      "dateModified": "2026-01-24T22:54:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "AGC Studios Chief Stuart Ford on What the Independent Film Sector Needs Now More Than Ever",
    "url": "https://variety.com/2026/film/news/stuart-ford-indie-agc-studios-strictly-business-podcast-1236638912/",
    "image": "https://variety.com/wp-content/uploads/2026/01/FING-Image-1-e1769240674552.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-24T23:26:38.000Z",
    "description": "\n\tStuart Ford, chairman and CEO of AGC Studios, is film industry veteran who has seen the independent sector rise to incredible heights. And in recent",
    "body": "\n\tStuart Ford, chairman and CEO of AGC Studios, is film industry veteran who has seen the independent sector rise to incredible heights. And in recent years he has watched it struggle.\n\n\tOn the latest episode of Variety‘s “Strictly Business” podcast, Ford goes deep on the issues that the indie film sector faces at a time of shifting financial models for production and major changes in moviegoing habits, particularly among younger audiences. \n\t\n\n\tBut Ford’s AGC Studios banner has maintained a busy slate of indie-produced theatrical releases. His company provides a patchwork quilt of services to creative talent, from financing to physical production to distribution. AGC headed to the Sundance Film Festival this year with a family title, “Fing!” starring Taika Waititi that premiered in the festival’s Family Matinee section.\n\n\n\t“We’re lucky in as much as we have both a self-financing and a sales capability within AGC Studios. We are one of the privileged few in the independent sector that to some extent can drive our own projects into production,” Ford says. “That’s not to say we have carte blanche to do it. Obviously, there are financial parameters and creative parameters that we have to pay very, very close attention to. We really live in the space that’s been largely abdicated by the major studios, which is making intelligent films for adults for the most part, usually via established filmmakers and established filmmaker relationships, but always, hopefully with commercial potential at the end of the rainbow.”\n\n\tFord emphasizes that there is opportunity for original material on the big screen that has a targeted market and accessible to more than arthouse lovers.\n\t\n\n\t“I think that is really where the independent film sector is going to continue to find success and continue to find a role within the broader ecosystem, which is by creating films that have an identity that audiences can discover,” Ford says.\n\n\tThe challenges around moviegoing in the post-COVID era have also coincided with a steep drop in the fees paid by networks and streamers around the world in the so-called Pay 1 window, aka the first TV exposure for a title. \n\n\n\n\t\n\n\t\t\t\t\tStuart Ford (Photo by Pierre Suu/Variety via Getty Images)\n\t\t\t\t\t\t\t\t\tVariety via Getty Images\n\t\n\n\n\n\t“Contrary to popular belief that independent film is dead, I think it’s far from dead. I do think to some extent it is shedding its old skin and moving into the next incarnation, if you like. But there’s a number of economic and financing realities that no amount of rose tinted lenses can can ignore.  Production costs have gone up significantly in recent years, both because of cost of goods and services, and because, the streamers drove up those production costs. Whilst for independents, revenue streams have remained stagnant. So we’ve had the unholy situation of budget inflation meeting buyer conservatism,” Ford says. \n\n\t“Financing structures have had to become more complex. Obviously, we still have soft money and regional incentives. There’s still bank financing available for pre-sales, but as pre-sales have become tougher to obtain, financiers are having to lean more heavily on gap financing, which can be expensive money and take more equity risk. So that increased cost of capital and risk exposure is deterring a lot of capital from coming into the marketplace right now, and we have to address that.”\n\n\tFord made his name as a top international buyer for Miramax Films in its heyday and then went on to launch IM Global. AGC Studios was formed seven years ago and has navigated the choppy waters in part by expanded into television, both scripted and unscripted. \n\n\t“We’re very prolific. We made five or six films last year. We’re going into production on three films in the first quarter of this year,” he says. “It still works for the right projects that are constructed in the right way. But the bullseye definitely got smaller and I think the risk is currently front-loaded onto producers and financiers more than it should be.”\n\t\n\n\tFord has a clear idea of what it will take to rehabilitate the independent film sector that is so vital for the creative community in Hollywood, New York and beyond.\n\n\t“The whole independent sector could light up very quickly if we could somehow get to a place where streamers are paying more meaningful license fees for that Pay 1 window post theatrical,” Ford says. “It is the decline in appetite of the streamers for those films — or certainly decline in appetite to pay — what I would say are market-rate license fees that has caused the slowdown in U.S.”\n\n\t(Pictured: Taika Waititi in ‘Fing!’)\n\n\t“Strictly Business” is Variety’s weekly podcast featuring conversations with industry leaders about the business of media and entertainment. (Please click here to subscribe to our free newsletter.) New episodes debut every Wednesday and can be downloaded at Apple Podcasts, Spotify, Amazon Music, and more.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "AGC Studios Chief Stuart Ford on What the Independent Film Sector Needs Now More Than Ever",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/FING-Image-1-e1769240674552.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-24T23:26:38.000Z",
      "dateModified": "2026-01-24T23:26:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Taika Waititi Says His ‘Star Wars’ Movie Needs to Be ‘More of Its Own Thing’ and He ‘Can’t Wait’ to See Chris Hemsworth’s Thor in ‘Avengers: Doomsday’",
    "url": "https://variety.com/2026/film/news/taika-waititi-star-wars-thor-avengers-doomsday-1236640037/",
    "image": "https://variety.com/wp-content/uploads/2026/01/taika.png?crop=0px%2C57px%2C1936px%2C1089px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-01-24T23:12:06.000Z",
    "description": "\n\tTaika Waititi‘s “Star Wars” movie has been in development since 2020, when Disney and Lucasfilm announced the “Jojo Rabbit” Oscar winner would helm ",
    "body": "\n\tTaika Waititi‘s “Star Wars” movie has been in development since 2020, when Disney and Lucasfilm announced the “Jojo Rabbit” Oscar winner would helm a new film in the franchise written by “1917” scribe Krysty Wilson-Cairns. There’s been no big updates in the six years since, but interest in the project was recently revived after exiting Lucasfilm boss Kathleen Kennedy said Waititi’s “Star Wars” was “still somewhat alive.”\n\n\tSo what does Waititi have in store for “Star Wars” fans? “I’m just trying to go back and harness a little bit more of the fun from the original films, which is what I remember [from] them,” he told Variety at Sundance at the premiere of “Fing!”\n\t\n\n\t“The stakes are very high, and there’s serious things going on, but there’s also a lot of fun to be had in those films. That’s what I was trying to bring back,” Waititi continued. “I was trying to work in a world that was a little bit separate to that because they’ve got so many things going on within that space. For me to do something there, it would need to be a little different and a little bit more its own thing.”\n\n\tKennedy confirmed to Deadline after announcing her exit from Lucasfilm that Waititi has “turned in a script that I think is hilarious and great. It’s not just my decision, especially when I’ve got a foot out the door.”\n\n\tWaititi is at Sundance with the family adventure “Fing!,” which is based on the children’s book of the same name. Directed by Jeffrey Walker and co-starring Iona Bell, Mia Wasikowska and Blake Harrison, the film centers on a young girl and her parents as they contend with a viscount who is trying to get his hands on their wondrous pet creature. Waititi assumes the role of the movie’s villain.\n\t\n\n\t“It was all on the page, so it was pretty easy for me to tap into that,” Waititi said at the Variety Studio presented by Audible when asked about playing the bad guy. “I’ve always liked those kinds of characters.”\n\n\tWhen asked to name his favorite movie villain, Waititi returned the conversation back to the “Star Wars” franchise by naming Darth Vader “one of the greatest villains I’ve ever seen.”\n\n\t“He taps into a child’s biggest nightmare or fear, which that your parent will turn on you and you won’t be able to bring them back,” he added. “‘Body Snatchers’ is like that as well. Zombies, too, they’re great villains as a collective because it’s the idea of people you love who won’t recognize you and will want to eat your brains.”\n\n\tWaititi also expressed his interest in seeing the upcoming “Avengers: Doomsday,” which will feature the return of Thor. The director helmed two “Thor” movies with Chris Hemsworth and said it’s not uncomfortable to be sitting out the God of Thunder’s next movie adventure as the Russo Brothers direct Hemsworth this go around.\n\n\t“Thor was around before me,” Waititi said. “The stuff that Chris and I did and how we shaped him into that new version… that was for the greater good of the franchise as a whole. I can’t wait to see these ‘Avengers’ movies. I was just watching ‘Infinity War’ and ‘Endgame’ two weeks ago. They’re so good. I’m good friends with the Russos and will love to see what they’re doing.”\n\nTaika Waititi says his #StarWars movie in development at Lucasfilm will “harness a little more of the fun from the original films.”“The stakes are very high, and there are serious things going on, but there’s also a lot of fun to be had.”Waititi is promoting his new family… pic.twitter.com/Akli1pSo2t— Variety (@Variety) January 24, 2026\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Taika Waititi Says His ‘Star Wars’ Movie Needs to Be ‘More of Its Own Thing’ and He ‘Can’t Wait’ to See Chris Hemsworth’s Thor in ‘Avengers: Doomsday’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/taika.png?crop=0px%2C57px%2C1936px%2C1089px&resize=1000%2C563"
      ],
      "datePublished": "2026-01-24T23:12:06.000Z",
      "dateModified": "2026-01-24T23:12:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Guess Who This Former Male Stripper Is!",
    "url": "https://www.tmz.com/2026/01/24/guess-who-former-male-stripper/",
    "image": "https://imagez.tmz.com/image/05/16by9/2026/01/19/05b24938babf405ead79e9e82a50e8e8_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-25T00:00:53.000Z",
    "description": "\n    \n                    \n                          Guess Who\n                          This Former Male Stripper Is!\n                      \n        ",
    "body": "\n    \n                    \n                          Guess Who\n                          This Former Male Stripper Is!\n                      \n                  \n                                                                        Published \n                              January 24, 2026\n                            4:00 PM PST\n                                                                            \n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          Lots of celebs had funky jobs before they made it big in the 'biz ... can you guess who this former male stripper is?\n      \n    \n          We ran into this star while he was leaving LAX back in 2015 and asked him what his favorite song to dance to was ... but we guess some things are better kept secret.\n      \n    \n          Oh, and speaking of secrets, this guy also kept quiet about how he felt about filming a sex scene with a liquored-up \"J Law\" -- Jennifer Lawrence -- hey, they're professionals, so don't get any ideas about them!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Movies\n              \n                          \n                Guess Who\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Guess Who This Former Male Stripper Is!",
      "image": [
        "https://imagez.tmz.com/image/05/16by9/2026/01/19/05b24938babf405ead79e9e82a50e8e8_xl.jpg"
      ],
      "datePublished": "2026-01-25T00:00:53.000Z",
      "dateModified": "2026-01-25T00:00:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Guess Who This Fan-Favorite Actor Is!",
    "url": "https://www.tmz.com/2026/01/24/guess-who-fan-favorite-actor/",
    "image": "https://imagez.tmz.com/image/56/16by9/2026/01/19/56be78991a2345ce89660634e893bafa_xl.png",
    "tag": "Entertainment",
    "date": "2026-01-24T20:00:42.000Z",
    "description": "\n    \n                    \n                          Guess Who\n                          This Fan-Favorite Actor Is!\n                      \n      \n   ",
    "body": "\n    \n                    \n                          Guess Who\n                          This Fan-Favorite Actor Is!\n                      \n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          Most stars love their fans, and others really want to know who the real ones are ... can guess who this fan-favorite actor is?\n      \n    \n          We ran into this guy back in 2016 and told him about our love for a certain mystery-solving dog he formerly shared the screen with ... and he wanted to know how hardcore we were about our knowledge of the franchise!\n      \n    \n          We hit him with the oft-repeated line about his character being a pothead, which he denied before telling us his character was more into what got Tony Montana all jazzed up -- ruh roh!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Movies\n              \n                          \n                Guess Who\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Guess Who This Fan-Favorite Actor Is!",
      "image": [
        "https://imagez.tmz.com/image/56/16by9/2026/01/19/56be78991a2345ce89660634e893bafa_xl.png"
      ],
      "datePublished": "2026-01-24T20:00:42.000Z",
      "dateModified": "2026-01-24T20:00:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Stars and Scars -- You Be the Judge",
    "url": "https://www.tmz.com/2026/01/24/polls-you-be-the-judge/",
    "image": "https://imagez.tmz.com/image/5c/16by9/2026/01/24/5cf42c449299456eb0b60c30c27dbaaf_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-24T08:25:46.000Z",
    "description": "\n    \n                  \n          \n                          \n                \n                                  Getty\n                      \n       ",
    "body": "\n    \n                  \n          \n                          \n                \n                                  Getty\n                      \n                  \n      \n    \n          Taylor Swift and Blake Lively's revealing texts about Baldoni go public, Brooklyn Beckham's wedding video's under lock and key, and Dana White and Harvey Levin play cards -- for $10,000!!! So, we gotta ask ...\n      \n      ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Stars and Scars -- You Be the Judge",
      "image": [
        "https://imagez.tmz.com/image/5c/16by9/2026/01/24/5cf42c449299456eb0b60c30c27dbaaf_xl.jpg"
      ],
      "datePublished": "2026-01-24T08:25:46.000Z",
      "dateModified": "2026-01-24T08:25:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ben Affleck and Brooks Nader Not Hooking Up Despite Reports",
    "url": "https://www.tmz.com/2026/01/24/ben-affleck-brooks-nader-not-hooking-up-despite-reports/",
    "image": "https://imagez.tmz.com/image/ba/16by9/2026/01/24/ba25bd1ba7524894999c835952b59090_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-24T23:52:04.000Z",
    "description": "\n    \n                    \n                          Ben Affleck & Brooks Nader\n                          We're Not Hitting 'The Town' Together!!!\n   ",
    "body": "\n    \n                    \n                          Ben Affleck & Brooks Nader\n                          We're Not Hitting 'The Town' Together!!!\n                      \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Ben Affleck and Brooks Nader aren't Hollywood's newest celebrity couple ... in fact, Brooks says the two have never even met!\n      \n    \n          Here's the deal ... reports surfaced earlier today claiming the actor and the model had started up a romance -- which would've marked Ben's first big relationship since divorcing Jennifer Lopez.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          However, Brooks took to social media to shut down the rumors ... writing on Instagram, \"Haven't met him in my life.\" We've also spoken to sources who confirm Nader's comment ... so, conspiracy theorists shouldn't think she's trying to run cover on some secret romance.\n      \n\n          While Ben's stayed out of the dating spotlight since his marriage to Lopez ended, Brooks has been connected to a series of famous faces over the last couple years.\n      \n    \n      \n        \n              \n    \n    \n          Of course, everyone knows about Nader's passionate and ill-fated romance with \"Dancing with the Stars\" pro Gleb Savchenko ... but, Nader's also been linked to tennis stars like Carlos Alcaraz and Jannik Sinner since quitting her dance partner.\n      \n    \n          Turns out she's not flying high with Batfleck though.\n      \n      \n              \n          \n                          \n                Brooks Nader\n              \n                          \n                Ben Affleck\n              \n                          \n                Reality TV\n              \n                          \n                Relationships\n              \n                          \n                Movies\n              \n                          \n                Couples\n              \n                          \n                Gossip / Rumors\n              \n                          \n                Models\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ben Affleck and Brooks Nader Not Hooking Up Despite Reports",
      "image": [
        "https://imagez.tmz.com/image/ba/16by9/2026/01/24/ba25bd1ba7524894999c835952b59090_xl.jpg"
      ],
      "datePublished": "2026-01-24T23:52:04.000Z",
      "dateModified": "2026-01-24T23:52:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "New Video Shows Trump Administration Told False Story About The Killing of Alex Pretti",
    "url": "https://www.tmz.com/2026/01/24/new-angle-minneapolis-shooting-proves-government-told-false-story/",
    "image": "https://imagez.tmz.com/image/d5/16by9/2026/01/25/d51669815a984988813362c08ba51300_xl.png",
    "tag": "Entertainment",
    "date": "2026-01-25T01:33:15.000Z",
    "description": "\n    \n                    \n                          Minneapolis Killing\n                          New Video Shows Trump Administration Created False ",
    "body": "\n    \n                    \n                          Minneapolis Killing\n                          New Video Shows Trump Administration Created False Story\n                          ... Pretti Posed No Threat\n                      \n                  \n                                                                        Published \n                              January 24, 2026\n                            5:33 PM PST\n                                                                            \n      \n    \n      \n        \n                    \n                  \n      \n                    CNN\n          \n    \n          A new video of the killing of Alex Pretti shows the interaction between him and a swarm of DHS officers from start to finish ... and, it batters the credibility of Trump officials who came out of the gates swinging, calling Pretti a domestic terrorist\n      \n    \n          The video shows Pretti directing traffic before it appears he is asked to move out of the street, which he does. As he walks toward the sidewalk, a DHS officer violently pushes a woman to the ground and Pretti moves toward her to help her up. Officers then pepperspray both Pretti and the woman and drag Pretti to the ground. He never pulls a weapon.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          As Pretti is swarmed, you see an officer pull a gun — presumably the concealed weapon Pretti was carrying. A second later another officer fires nine shots at Pretti, killing him.\n      \n\n          As you know, Homeland Security Secretary Kristi Noem said the incident \"looks like a situation where an individual arrived at the scene to inflict maximum damage on individuals and to kill law enforcement.\" Border Patrol Chief Gregory Bonvino also defended the shooting as justified, saying Pretti was there to massacre law enforcement. The video shows the opposite.\n      \n    \n          Pretti had a concealed weapon with ammunition, but he had a legal permit to carry it. There is no evidence he ever brandished or pointed the gun at anyone. Trump officials have made a big point that he was carrying the weapon at all, but as Trump has touted, people have a right to carry a gun under the Second Amendment.\n      \n    \n      \n      Statement from the family of Alex Pretti: pic.twitter.com/yEs4fzbdIG— Yashar Ali 🐘 (@yashar) January 25, 2026\n              @yashar\n          \n  \n    \n          Pretti's family released a statement in the aftermath of the shooting blasting the Trump administration. The statement reads, in part, \"The sickening lies told about our son by the administration are reprehensible and disgusting. Alex is clearly not holding a gun when attacked by Trump’s murdering and cowardly ICE thugs. He has his phone in his right hand and his empty left hand is raised above his head while trying to protect the woman ICE just pushed down all while being pepper sprayed.\"\n      \n    \n          Story developing ...\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Alex Pretti\n              \n                          \n                Weapons & Guns\n              \n                          \n                Politics\n              \n                          \n                Viral\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "New Video Shows Trump Administration Told False Story About The Killing of Alex Pretti",
      "image": [
        "https://imagez.tmz.com/image/d5/16by9/2026/01/25/d51669815a984988813362c08ba51300_xl.png"
      ],
      "datePublished": "2026-01-25T01:33:15.000Z",
      "dateModified": "2026-01-25T01:33:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]