[
  {
    "title": "‘Godzilla’ Studio Toho Acquires U.K.’s Anime Limited, Forms European HQ in London",
    "url": "https://variety.com/2025/film/news/godzilla-studio-toho-anime-limited-1236612524/",
    "image": "https://variety.com/wp-content/uploads/2024/03/MCDGOMI_HT028.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-19T09:37:30.000Z",
    "description": "\n\tJapanese entertainment giant Toho has acquired U.K.-based distributor Anime Limited from Germany’s Plaion Pictures, marking a major expansion of the",
    "body": "\n\tJapanese entertainment giant Toho has acquired U.K.-based distributor Anime Limited from Germany’s Plaion Pictures, marking a major expansion of the “Godzilla” studio’s European operations.\n\n\tThe deal sees Toho Global – the company’s consolidated overseas subsidiary – take full ownership of Glasgow-based Anime Limited, which will operate as a standalone subsidiary. Financial terms were not disclosed.\n\n\n\tAnime Limited founder and managing director Andrew Partridge will remain with the company and join the leadership team of Toho’s new European regional headquarters, which will be established in London by year’s end. The entire Anime Limited staff has been retained.\n\t\n\n\tThe acquisition provides Toho with immediate distribution capabilities across theatrical, home video, TV sales, merchandising and licensing in the U.K. and France. Simultaneously, Toho Global and Plaion Pictures have formed a strategic alliance extending distribution to Germany, Italy and other European territories.\n\n\t“We are excited to welcome Andrew and the Anime Ltd team into the growing Toho family, and to begin our new cooperation relationship with Plaion Pictures,” said Koji Ueda, president and representative director of Toho Global. “This move accelerates the timeline to realize ‘Toho Vision 2032 Group Management Strategy’ by giving Toho an immediate pan-European distribution capability as well as access to Plaion Pictures’ highly additive infrastructure for merchandise operations.”\n\n\tThe expansion aligns with Toho’s aggressive global growth strategy. In October 2024, the company acquired U.S.-based animation distributor GKIDS, and in November launched Toho Entertainment Asia in Singapore. With the European headquarters now established, Toho has secured operational bases across all major global markets.\n\t\n\n\tFounded in 2012, Anime Limited has distributed major Japanese titles including “Attack on Titan,” “Jujutsu Kaisen,” “Neon Genesis Evangelion” and “One Piece Film: Red.” The company has long collaborated with Toho on releases including Makoto Shinkai’s “Your Name” and “Weathering With You,” Studio Trigger’s “Promare” and “Godzilla Minus One,” which became the highest-grossing Japanese live-action film of all time in the U.K.\n\n\t“Both myself and the team have long loved working together on Toho properties,” Partridge said. “We look forward to becoming part of the Toho family and working closer and more collaboratively with its group companies to expand the interest of anime across our territories.”\n\n\tThe European anime market is estimated at $4.77 billion in 2024 and projected to reach $9.05 billion by 2030, representing an 11.2% compound annual growth rate, according to Grand View Research.\n\n\tPlaion Pictures managing directors Stefan Kapelari and Jochen Walter praised the partnership, with Walter noting the companies “share a common vision” and expressing enthusiasm about contributing “extensive expertise in local marketing, our creativity, distribution excellence, and consumer platforms such as ‘Aniverse’ to this alliance.”\n\n\tToho said the acquisition’s impact on current fiscal year results will be negligible, as the initiatives target medium- to long-term growth.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Godzilla’ Studio Toho Acquires U.K.’s Anime Limited, Forms European HQ in London",
      "image": [
        "https://variety.com/wp-content/uploads/2024/03/MCDGOMI_HT028.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-19T09:37:30.000Z",
      "dateModified": "2025-12-19T09:37:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Leonardo DiCaprio-Produced ‘2001’ Doc Among BFI Awards as U.K. Global Screen Fund Set to Expand",
    "url": "https://variety.com/2025/film/news/leonardo-dicaprio-2001-doc-bfi-fund-awards-1236612527/",
    "image": "https://variety.com/wp-content/uploads/2017/02/2001-a-space-odessey.jpg?crop=0px%2C187px%2C1000px%2C563px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-12-19T10:16:56.000Z",
    "description": "\n\tThe British Film Institute has unveiled its latest round of U.K. Global Screen Fund awards, distributing over £1.6 million ($2.1 million) across thr",
    "body": "\n\tThe British Film Institute has unveiled its latest round of U.K. Global Screen Fund awards, distributing over £1.6 million ($2.1 million) across three funding strands as the program prepares for a significant budget increase in 2026.\n\n\tFinanced through the U.K. government’s Department for Culture, Media and Sport, the awards support international co-productions, distribution initiatives and business development strategies for independent screen sector companies. The fund’s budget is set to increase from £7 million ($9.3 million) to £18 million ($24.08 million) per year for 2026-29, with expansion plans to be revealed early next year.\n\t\n\n\tThe International Co-production strand awarded over £763,000 ($1 million) to five U.K. independent companies for partnerships across seven territories: Sweden, Belgium, Iceland, the U.S., Canada, Switzerland and Ireland. The funded projects include four feature films — among them one documentary — and one TV documentary feature.\n\n\n\tObject Studios’ Sean Richard received support for “Monolith,” a minority U.K.-U.S. co-production exploring Stanley Kubrick’s “2001: A Space Odyssey” and its themes of space exploration, artificial intelligence and metaphysics. Stevan Riley will direct the documentary, made with the blessing of the Stanley Kubrick Estate. Leonardo DiCaprio is producing, with Partners in Kind and Time Studios financing and executive producing. Jason Clark, Mike Medavoy and Michael Peterson of Phoenix Pictures are co-producing alongside Catchlight Studios.\n\n\tZephyr Films received funding for “Butterfly Stroke,” a minority U.K.-Switzerland co-production directed by Denis Rabaglia. Written by Nat Luurtsema, Jessica Townsend and Rabaglia based on a story by Townsend, the film follows Ruth, a 65-year-old woman determined to end her life on her own terms in Zurich, until her 22-year-old granddaughter Lori intervenes. Chris Curling and Anya Ryzhenkova are producing for Zephyr Films, with Michael Steiger and Michela Pini producing for Switzerland’s Turnus Films AG.\n\t\n\n\tQuiddity’s Emily Morgan secured funding for “The Wolf Will Tear Your Immaculate Hands,” a minority U.K. co-production with Sweden, Belgium and Iceland. The gothic horror, set in 19th century North America, marks the sophomore feature from writer-director Nathalie Álvarez Mesén, who co-wrote the script with Icelandic novelist and screenwriter Sjón. Darla Contois and Alexander Skarsgård star. Co-producers include Sweden’s HOBAB, Belgium’s Need Production and Iceland’s Still Vivid.\n\n\tStigma Films’ Matthew James Wilkinson received support for “West The Road,” a minority U.K.-Ireland co-production. Written and directed by Ita Fitzgerald in her feature debut, the all-female road movie follows a group of women brought together by a friend’s death as they search for her child on Ireland’s west coast. Imelda Staunton, Philippa Dunne and Charlie Murphy star. John Wallace of Ireland’s Cowtown is co-producing, with support from Screen Ireland.\n\n\tSnowstorm Productions’ Kat Mansoor secured funding for “Yuja,” a majority U.K.-Canada co-production. Directed by Lorna Tucker, the documentary follows classical pianist Yuja Wang as she navigates the pressures of fame and perfection while searching for happiness. Craig Thompson of Canada’s Ballinran Productions, along with David Piperni and Daniel Cantagallo of Cargo Film & Releasing, are co-producing.\n\n\tTo date, the International Co-production strand has awarded over £9.6 million ($12.8 million) to 62 co-productions across partnerships with 34 territories.\n\n\tThe International Business Development strand allocated £104,600 ($139,970) to two companies, bringing the strand’s total to over £9 million ($12 million) across 110 awards. Norfolk-based Blue Pigeon Productions received support to hire a marketing and social media specialist and channel assistant to drive international audiences via a YouTube platform. The natural history documentary specialist has produced work for Curiosity Stream and Sky Nature, including “The Beasts of Halloween.”\n\n\tSouth West-based Slate Works secured funding to hire a bilingual development producer and researcher to enhance its development pipeline for international markets. The high-end factual production company, known for exclusive-access documentaries including “9/11: Inside The President’s War Room,” has been selected for the BBC Small Indie Fund and Channel 4 Emerging Indies Fund. A full round of International Business Development awards is scheduled for announcement in the new year.\n\t\n\n\tThe International Distribution strand made 36 awards totaling £776,772 ($ million), supporting festival launches and prints and advertising campaigns for U.K. independent features. Films receiving P&A support for releases across at least four international territories include “Bird,” “Tornado,” “Urchin,” “The Thing With Feathers,” “Bring Them Down” and “Hot Milk.”\n\n\t“Chaplin | Spirit of The Tramp” became the first documentary to receive P&A funding through the new single-territory award for animation and documentary, with support for its theatrical release in Japan.\n\n\tFestival Launch grants supported titles premiering at Cannes, including “Urchin,” “My Father’s Shadow” and “Pillion.” The latter sold extensively for Cornerstone following its Un Certain Regard premiere. Eleven Festival Launch Support grants aided premieres at Toronto International Film Festival, including “Good Boy” and “Saipan,” while five grants supported Venice International Film Festival premieres, including “Orphan” and “100 Nights of Hero.” The International Distribution strand has made 148 awards totaling over £3.5 million ($4.7 million) to date.\n\n\t“This latest round of awards showcases the creativity and breadth of films, companies and strategies, all focused on international growth and success across co-production, distribution and business development,” said Denitsa Yordanova, head of U.K. Global Screen Fund and International Funds. “We look forward to continuing our work with government and consultation with industry to take forward plans for the future of the UK Global Screen Fund, supporting even more independent screen sector companies from across the UK to thrive and reach their full international potential.”\n\n\tFollowing the U.K. government’s June announcement of the new Creative Industries Sector Plan, fund planning is underway, including industry consultation on its development and expansion.\n\n\tApplications are currently open on a rolling basis for International Distribution Festival Launch Support and P&A Support. International Co-production funding applications reopen in February, with International Business Development funding reopening in April.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Leonardo DiCaprio-Produced ‘2001’ Doc Among BFI Awards as U.K. Global Screen Fund Set to Expand",
      "image": [
        "https://variety.com/wp-content/uploads/2017/02/2001-a-space-odessey.jpg?crop=0px%2C187px%2C1000px%2C563px&resize=1000%2C563"
      ],
      "datePublished": "2025-12-19T10:16:56.000Z",
      "dateModified": "2025-12-19T10:16:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Miike Takashi’s ‘Sham’ Among 26 Features in Japan Foundation’s 2026 U.K. Film Tour (EXCLUSIVE)",
    "url": "https://variety.com/2025/film/news/miike-takashi-sham-japan-foundation-2026-uk-film-tour-1236612513/",
    "image": "https://variety.com/wp-content/uploads/2025/12/Sham.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-19T10:00:00.000Z",
    "description": "\n\tThe Japan Foundation Touring Film Programme will present 26 Japanese features across U.K. venues, including acclaimed director Miike Takashi‘s lates",
    "body": "\n\tThe Japan Foundation Touring Film Programme will present 26 Japanese features across U.K. venues, including acclaimed director Miike Takashi‘s latest film “Sham” among diverse offerings spanning comedy, drama, horror, sci-fi and animation.\n\n\tThe annual celebration, billed as the U.K.’s largest showcase of Japanese cinema, centers on the theme “Knowing Me, Knowing You: The True Self in Japanese Cinema,” exploring identity and self-perception across multiple genres.\n\t\n\n\tMiike, known for “13 Assassins,” “Ichi the Killer” and “Audition,” takes a more realist approach with “Sham,” adapting investigative journalist Fukuda Masumi’s report about a teacher falsely accused of child abuse. Go Ayano stars as an elementary school teacher forced into a public apology after allegations from a student’s mother, triggering a media storm and lawsuit. The social critique will receive its UK premiere during the tour.\n\n\n\tOther U.K. premieres include Tsutsumi Yukihiko’s “The Hotel of My Dream,” a semi-autobiographical story about author Asako Yuzuki starring Non; Sori Fumihiko’s “Hakkenden: Fiction and Reality,” blending historical drama with epic fantasy battles and starring Koji Yakusho and Seiyo Uchino; and Kumazawa Naoto’s thriller “The Final Piece,” featuring Ken Watanabe and Kentaro Sakaguchi investigating a murder connected to the world of shogi (Japanese chess).\n\n\tMaeda Tetsu’s “Petals and Memories” stars Ryohei Suzuki and Kasumi Arimura as siblings navigating family secrets. Fujino Tomoaki’s documentary “What Should We Have Done?” examines the director’s own family’s handling of his schizophrenic sister. Iizuka Kasho’s “Blue Boy Trial” explores a groundbreaking case that questioned the legality of gender-affirming surgery in Japan.\n\t\n\n\tKinoshita Baku’s anime “The Last Blossom” follows an elderly prisoner who befriends his potted plant, with Kaoru Kobayashi and Junki Tozuka voicing the protagonist’s present and past selves.\n\n\tThe tour includes Morita Yoshimitsu’s 2003 drama “Like Asura,” based on a popular 1979 NHK series recently re-adapted by Kore-eda Hirokazu for Netflix, telling the story of four sisters reuniting after learning an unsettling family secret.\n\n\tClassic cinema receives representation through a 4K restoration of Ichikawa Kon’s 1958 psychological drama “Conflagration,” inspired by true events later incorporated into Yukio Mishima’s novel “The Temple of the Golden Pavilion.”\n\n\tTamada Shinya’s “I Am What I Am” stars Toko Miura in a story challenging traditional ideals of love and womanhood. Ueda Shinichiro’s action-comedy “Angry Squad: The Civil Servant and the Seven Swindlers” features Seiyo Uchino and Masaki Okada teaming up to take down a crooked real estate tycoon.\n\n\tYoshida Daihachi’s “Teki Cometh” adapts celebrated novelist Tsutsui Yasutaka’s work about a retired French literature professor who receives an email warning that an enemy is coming from the north.\n\n\tJojo Hideo’s “A Bad Summer” follows a welfare caseworker who discovers a colleague may be coercing a single mother for sex in exchange for benefits. Kai Sayaka’s sci-fi drama “Adabana” stars Arata Iura as a terminally ill man undergoing a revolutionary full-body transplant procedure.\n\n\tIshii Yuya’s “The Real You” tackles AI and assisted dying through the story of a factory worker who seeks to bring his dead mother back to life with Virtual Figure technology.\n\n\tKondo Ryota’s feature debut “Missing Child Videotape,” produced by “Ju-on” franchise creator Takashi Shimizu, follows a man haunted by his younger brother’s mysterious disappearance who receives a VHS tape capturing the exact moment the boy vanished.\n\n\tKensuke Sonomura and writer Yugo Sakomoto’s “Ghost Killer” pairs a university student with the ghost of a murdered hitman in an action film that has played at Beyond Fest, Fantastic Fest and Sitges International Fantastic Film Festival.\n\n\tTanaka Seiji’s “The Man Who Failed to Die” blends comedy and the supernatural, starring Katamari Mizukawa as a comedy sketch writer and Bokuzo Masana as a persistent ghost.\n\t\n\n\tOhku Akiko’s “She Taught Me Serendipity” stars Riku Hagiwara as a university student whose tedious life changes when he meets Hana, played by Yumi Kawai.\n\n\tWakamatsu Setsuro’s “Silence of the Sea” features Masahiro Motoki as a solitary painter devoted to pursuing true beauty in a world of art forgery and murder.\n\n\tIgashi Aya’s “Love Doesn’t Matter to Me” follows three young women scarred by family trauma who redefine love, starring Sara Minami and Fumika Baba.\n\n\tKato Takuya’s feature debut “Ura Aka: L’Aventure” stars Kumi Takiuchi as a woman who creates a secret social media account and posts sexually provocative photos, only to see the boundary between persona and self dangerously dissolve.\n\n\tFurukawa Go’s debut “Kaneko’s Commissary” features Ryuhei Maruyama as a man who runs a commissary service delivering items to prisons and faces a moral crisis when tasked with serving an unrepentant murderer.\n\n\tYugo Sakomoto’s “Nemurubaka: Hypnic Jerks,” adapted from the manga by Masakazu Ishiguro, follows two young women as one pursues musical stardom while the other realizes she’s been drifting through life. The film stars Yuna Taira and Shiori Kubo.\n\n\tTominaga Masanori’s comedy “Strangers in Kyoto” stars Mai Fukagawa as a Tokyo-based writer who marries into a traditional Kyoto family and inadvertently causes chaos by misunderstanding the city’s culture of honne (true feelings) and tatemae (outward opinions).\n\n\tThe tour, which runs Feb. 6 to March 31, 2026, will visit 37 venues across the U.K., including London’s Institute of Contemporary Arts, Manchester’s HOME, Edinburgh’s Filmhouse, and regional venues from Aberystwyth to York.\n\n\tThe Great Britain Sasakawa Foundation serves as major supporter.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Miike Takashi’s ‘Sham’ Among 26 Features in Japan Foundation’s 2026 U.K. Film Tour (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/Sham.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-19T10:00:00.000Z",
      "dateModified": "2025-12-19T10:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "TikTok Awards Debut in Hollywood Despite Technical Glitches",
    "url": "https://variety.com/2025/digital/news/tiktok-awards-hollywood-1236612464/",
    "image": "https://variety.com/wp-content/uploads/2025/12/GettyImages-2251991432-e1766124882958.jpg?w=1000&h=562&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-19T04:01:07.000Z",
    "description": "\n\tThe seams were showing at times at the first TikTok Awards held Thursday night the Hollywood Palladium and live streaming on TikTok and Tubi. \n\n\tBut",
    "body": "\n\tThe seams were showing at times at the first TikTok Awards held Thursday night the Hollywood Palladium and live streaming on TikTok and Tubi. \n\n\tBut producers, presenters and winners soldiered on with few hitches. The event didn’t take itself too seriously to begin with — with awards in cheeky categories such as “Immediately Add to Cart,” “My Show is On” and “CapCut of the Year” — and the roomful of creators and influencers enjoyed the colorful atmosphere of being fabulous together at the famed Sunset Boulevard venue. \n\t\n\n\tMultiple winners cited the importance of TikTok in their professional and personal lives, whether it is used to build businesses, build confidence or express creativity. Multiple winners accepted their translucent award, shaped like the TikTok logo, with phones in hand.\n\n\n\tNew Orleans-based TikTok-er Keith Lee won the top prize of Creator of the Year. He boasts 17.3 million followers on TikTok for his family-friendly posts on food, culture and lifestyle matters. The husband and father of three is building out a larger lifestyle brand under the “Familee” moniker.\n\n\t“This means more to me than I can explain,” Lee said in accepting his award. He told the crowd that he began filming TikTok videos to help overcome his shyness. \n\n\tMariah C. Rose, a sports and lifestyle influencer who hosts “Hoops for Hotties,” was named MVP of the Year. Her kudo was presented by Olympic gold medalist Jordan Chiles. Rose is the daughter of former NBA star Jalen Rose.\n\n\tThe first TikTok Awards held in the U.S. got started almost an hour late because the LED screens on the Palladium’s stage malfunctioned. The ceremony were basically a traditional award presentation — it even opened with a dance number and a satirical song about the events of 2025. It felt awkward in the room for the lack of video clips to demonstrate the nominees’ work, although audio of each clip did run. The video clips did run without interruption on the live stream.\n\t\n\n\tThe ceremony was hosted by La La Anthony. A host of prominent TikTok personalities are participating as presenters and nominees. Popular TikTok-er Ashby made a guest appearance, coming out with “K-pop Demon Hunters” voice star Rei Ami to shoot off a “Labubu cannon” out into the seated crowd on the floor of the legendary Sunset Boulevard venue. \n\n\t“I hope you signed your waivers,” Ashby said as she fired off the Labubus.\n\n\tOther presenters included Trixie Mattel and “The Bachelor” alum Chelsea Vaughn.\n\n\tAmong the winners were Paris Hilton for Muse of the Year. Hilton was on hand to accept the trophy in the shape of the TikTok logo. She thanked “all my little Hiltons.”\n\n\tHilton assured the crowd of colorfully dressed creators and influencers, “You don’t need permission to be iconic. Just show up, sparkle hard and don’t forget that everyone is a princess.”\n\n\tAn hour into to the presentation, the large video screen briefly popped back to life with a video image of the TikTok Awards logo set to the soundtrack of the Coldplay song “Yellow.” But it still could not play clips of nominees.\n\n\tThe crowd was undaunted by the technical snafu. Cheers and shouts were strong from the various cheering sections for nominees.\n\n\t(Pictured: TikTok Award winner Mariah C. Rose)\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "TikTok Awards Debut in Hollywood Despite Technical Glitches",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/GettyImages-2251991432-e1766124882958.jpg?w=1000&h=562&crop=1"
      ],
      "datePublished": "2025-12-19T04:01:07.000Z",
      "dateModified": "2025-12-19T04:01:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "José Luis Cienfuegos, Renowned Director of Spain’s Valladolid, Seville and Gijón Festivals, to Receive Posthumous Bellas Artes Golden Order of Merit",
    "url": "https://variety.com/2025/film/global/jose-luis-cienfuegos-valladolid-seville-gijon-film-festival-1236612532/",
    "image": "https://variety.com/wp-content/uploads/2025/12/Jose-Luis-Cienfuegos.-Courtesy-of-the-Valladolid-Film-Festival.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-19T11:04:58.000Z",
    "description": "\n\tJosé Luis Cienfuegos, an indefatigable force for the modernization, international vision, new talent focus and industry and popular impact of three ",
    "body": "\n\tJosé Luis Cienfuegos, an indefatigable force for the modernization, international vision, new talent focus and industry and popular impact of three important Spanish film festivals, died from a stroke on Dec. 2. He was 61.\n\n\tTwo weeks later, Spain’s Council of Ministers announced that Cienfuegos will receive its Bellas Artes Golden Medal of Merit. The honor has been applauded by a huge sweep of politicians, cineastes, journalists and Spain’s industry across any divides. That’s how things should be. Cienfuegos’ death has left Spain’s industry with a sense of incredulity. Effusive, affable, hard-partying, Cienfuegos also worked as hard as hell for 30 years to share his passion for cinema beyond studio fare, first as director of the Gijón Film Festival (1995-2012), then the Seville European Film Festival (2013-2022) and finally the Valladolid Film Festival, from 2023. \n\t\n\n\tCienfuegos’ Gijón Revolution\n\n\n\tIt is hard to overstate the joyous impact of Cienfuegos when he took over in 1995 the film festival in Gijón, a post-industrial city nestling on the wave-lashed northern coast of Spain, backed by green hills, in Cienfuegos’ native Asturias. \n\n\tDressed de riguer in black, down to his big-rimmed plastic glasses, he looked like an academic parachuted in from a post-punk academy. But he had nothing of a professor’s elitist distance nor traditionalism. \n\n\tIn the early ‘90s, most Spanish film festivals drew much of their big plays from Europe’s grand auteurs. Passionate but accessible to even the humblest of festival goers, talking 19 to a dozen, Cienfuegos looked elsewhere –  U.S. indie cinema, then in its first and only full flush, and edgier European auteurist fare.\n\t\n\n\tGreg Araki’s homage in 1996, Gijón’s second year under Cienfuegos, was, he said, “a declaration of intentions and new directions” for the Northern Spanish event. Within a few years, U.S. indie icons were fest regulars. Todd Haynes presented film shorts in 2000; Tom DiCillo inaugurated Gijón in 2001 with “Double Whammy.” Hal Hartley announced “The Girl From Monday” at Gijón in 2003. From Europe, Ulrich Seidl, Abbas Kiarostami, Bruno Dumont and Claire Denis received retros.\n\n\tCienfuegos also had a knack of picking up on young directors which went on to great things. From Argentina, he screened Lisandro Alonso’s debut “La Libertad” in 2001 and a decade later, Jonás Trueba’s first feature, “Every Love Song Is About Me” and a year later, Santiago Mitre’s “The Student.” \n\n\tVariety’s first interview with Ruben Östlund was not in Cannes nor his native Sweden but in Gijón where he presented and won for “Play” and announced “Tourist.”   \n\n\tBy the 1990s, however, Gijón’s young were leaving for Madrid or Barcelona. Cienfuegos wanted them back, or at least to see films in theaters. So the film festival he conceived tapped deep into and channelled the burgeoning local music scene, the Xijón Sound. 1999 was a case in point, with tributes to DiCillo and Aki Kaurismaki, a first Saturday concert with the Pretenders, followed by a rocking party at a local bar by with music from just formed Spanish rock group Sidonie.   \n\n\tGijón was his masterpiece, José Luis Cienfuegos unleashed. Under him, Variety wrote in 2007, “Gijon has become one — if not the — favored meet of sophisticated young Spanish film buffs.” Attendance quadrupled from 15,000 admissions in 1995 to 67,000 in 2006, 75,000 by 2010.  \n\n\tIt couldn’t last. Spanish film festivals depend heavily on local government funding for finance. In 2011, hard-right politician Fernando Álvarez Cascos was elected president of the Asturias Region. In January 2012, he summarily sacked Cienfuegos, prompting a letter signed by Pedro Almodóvar, Atom Egoyan, Isabel Coixet and Todd Solondz and 400 other filmmakers or writers, asking for him to he brought back. \n\n\tCienfuegos at the Seville European Film Festival…. \n\t\n\n\tOther festivals, however, wanted him elsewhere. Javier Martín Domínguez, had resigned just a week before as artistic director of the Seville European Film Festival, protesting at budget cuts. Martín Dominguez had already built Seville up as a vibrant meeting point in November sun for European producers, distributors and institutions. \n\n\tUnder Cienfuegos, Seville continued to stage the nominations announcement for the European Film Awards, converted Seville into the entry point for annual waves of European auteurs, while he battled to increase the festival’s impact on the city of Seville itself. \n\n\tAnd at Valladolid’s Seminci\n\n\tThat last point for Cienfuegos really mattered. It became a later-life crusade. When sacked at Gijón in 2012, Cienfuegos simply produced statistics underscoring its attendance surge under his mandate. At the time that he was appointed director in 2023 of the Valladolid Film Festival-Seminci, Spain’s traditionally second-biggest arthouse event, Spain’s box office languished post-pandemic at just 62% of 2019’s total annual gross. Young spectators were among the most likely to return to theaters. Cienfuegos’ new-fit reboot immediately honed in on movies from exciting new directors such as Laura Ferrés’ feature debut “The Permanent Picture,” Brit Molly Manning Walker’s Cannes Un Certain Regard victor “How to Have Sex” and U.S. indie doc icons Bill and Turner Ross with their first fiction outing, “Gasoline Alley.” \n\n\tHe also installed Spain’s 3rd Independent Film Market (Merci), hosting distributor screenings which fairly hummed in 2025. By this year, he was concerned that Spanish films selected should include more uplifting commercial propositions, underscoring the crowd-pleasing potential of national movies. Yet, at one and the same time, focusing on first and second features, Meeting Point prize monies was near doubled to $45,000 for distributors of its winning films.\n\n\tAdmissions for 2025 ran at 103,000 up 30% on 2022, box office up 53%, with Meeting Point tripling its audience, and attendance of film industry professionals and journalists soaring 68%, reaching 2,180.\n\n\tWhat makes Cienfuegos’ death so shocking is not just his relative youth but that he was not done yet. He and the Valladolid festival were still a work in progress. The old Gijón excitement was on once more.   \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "José Luis Cienfuegos, Renowned Director of Spain’s Valladolid, Seville and Gijón Festivals, to Receive Posthumous Bellas Artes Golden Order of Merit",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/Jose-Luis-Cienfuegos.-Courtesy-of-the-Valladolid-Film-Festival.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-19T11:04:58.000Z",
      "dateModified": "2025-12-19T11:04:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "BBC Review Finds No Need to Rewrite Editing Guidelines After Trump ‘Panorama’ Error",
    "url": "https://variety.com/2025/tv/news/bbc-review-no-rewrite-editing-guidelines-trump-1236612551/",
    "image": "https://variety.com/wp-content/uploads/2025/11/trump-copy.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-19T11:49:34.000Z",
    "description": "\n\tA BBC-commissioned review has concluded there is no need to rewrite the broadcaster’s editorial editing guidelines following the controversy over a ",
    "body": "\n\tA BBC-commissioned review has concluded there is no need to rewrite the broadcaster’s editorial editing guidelines following the controversy over a “Panorama” program that misleadingly edited President Donald Trump’s Jan. 6 speech, instead pointing to failures in judgment, escalation and oversight.\n\n\tThe findings of both the review of the Editorial Guidelines and Standards Committee (EGSC) and a further examination of issues raised in a leaked memo by former adviser Michael Prescott were unanimously accepted by the BBC board and approved for publication at a board meeting on Thursday.\n\t\n\n\tIn the review published Friday, director of editorial complaints and reviews Peter Johnston said existing BBC rules governing editing are “sufficient,” even in light of the “Panorama” error, but acknowledged that lessons were not acted on quickly or decisively enough across the organization. The report forms part of the BBC board’s most substantive response yet to the Prescott memo, which became public last month and triggered heightened scrutiny of the broadcaster’s editorial governance.\n\n\n\tThe BBC has already acknowledged that the “Panorama” edit constituted an error of judgment. The program spliced excerpts from different points in Trump’s speech in a way that created the impression of a single continuous passage, mistakenly suggesting a direct call for violent action, before cutting to footage of the Proud Boys.\n\n\tJohnston noted that the BBC’s editorial guidelines already prohibit such practices, stating that commentary and editing must never be used to give audiences a materially misleading impression of events, and that content makers should not inter-cut sequences where the resulting juxtaposition distorts meaning.\n\t\n\n\t“I do not believe any changes are required,” Johnston wrote. “But we will ensure these lessons are reinforced.”\n\n\tRather than revising the guidelines, the BBC board is moving to overhaul how editorial risks are identified, escalated and tracked. A separate review of the EGSC, commissioned by BBC chair Samir Shah and conducted by Caroline Thomson with support from Richard Sambrook, calls for a refocused remit centered on managing major areas of editorial risk, alongside a new triage system designed to ensure individual editorial issues are handled swiftly at the appropriate executive level while flagging potential systemic problems for deeper review.\n\n\tThe EGSC review also recommends resetting the committee’s composition to reduce executive dominance and broaden non-executive voices, clarifying the role of external editorial advisers to ensure they inform rather than direct decision-making, and proceeding with the recruitment of two new advisers under revised role definitions.\n\n\tThe Trump “Panorama” issue emerged from a broader examination of BBC coverage of the U.S. presidential election. While internal research found much of the coverage to be of a high standard, it identified shortcomings including excessive weight given to the Selzer Iowa poll late in the campaign and inaccuracies in some reporting of Trump’s remarks about former Rep. Liz Cheney. Some of those issues, particularly on linear output, can no longer be corrected, though online material has since been amended.\n\n\tTo strengthen U.S. coverage, the BBC has appointed a regional director for the Americas, expanded reporting beyond Washington power centers and reallocated resources toward more granular regional and economic storytelling.\n\n\tJohnston’s review also examined editorial concerns raised in Prescott’s memo beyond U.S. coverage, concluding that more corrective action had been taken than the document acknowledged, with further steps implemented since it became public. Those included updates to guidance on data and statistics, changes to sex and gender coverage following a recent Supreme Court ruling, and new editorial leadership, training and oversight structures for BBC News Arabic amid scrutiny of Israel and Gaza reporting.\n\n\tShah said the reforms were aimed at ensuring faster and more transparent action when editorial risks arise. “Along with the BBC board, I am now ensuring immediate changes are made to the EGSC to ensure swift, appropriate and transparent action is taken to address editorial issues as effectively as possible, whenever they occur,” he said.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "BBC Review Finds No Need to Rewrite Editing Guidelines After Trump ‘Panorama’ Error",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/trump-copy.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-19T11:49:34.000Z",
      "dateModified": "2025-12-19T11:49:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Colombia Boosts Tax Incentive CINA to Record Amount for 2026",
    "url": "https://variety.com/2025/film/news/colombia-boosts-tax-incentive-2026-1236612415/",
    "image": "https://variety.com/wp-content/uploads/2025/12/The-Night-ManagerS2.jpg?crop=0px%2C65px%2C3900px%2C2193px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-12-19T02:12:09.000Z",
    "description": "\n\tAfter a bumper year that saw major projects shooting in Colombia, including Seasons 2 of BBC/AMC’s “The Night Manager” and Netflix’s mega epic serie",
    "body": "\n\tAfter a bumper year that saw major projects shooting in Colombia, including Seasons 2 of BBC/AMC’s “The Night Manager” and Netflix’s mega epic series “One Hundred Years of Solitude,” Colombia’s Film Commission at Proimágenes Colombia has increased its CINA incentive to $90 million, a 49% boost from the previous year’s $60 million, which was fully allocated – in record time – by September.\n\n\tCINA offers a 35% transferable tax credit on expenditures for audiovisual services in Colombia and is applicable to feature films, series, music videos, video games, animation, post production and advertising.\n\t\n\n\t Since its launch, the incentive has supported over 165 international audiovisual projects, generating more than $861 million in investment and creating over 130,000 direct jobs, making it the envy of its Latin American neighbors who have also vied to attract more location shoots.\n\n\tIn 2025, 32 projects were approved, including shows from Disney+, Sony Pictures, Paramount, Netflix and Amazon. Altogether, these projects brought in an estimated $188 million in investment.\n\n\t“The success of CINA in 2025 demonstrates that Colombia has a solid, reliable and internationally competitive incentive system,” said Silvia Echeverri, head of the Colombia Film Commission, adding: “With the 2026 CINA allocation, we are marking a milestone in our strategy to consolidate Colombia as a strategic partner for large-scale audiovisual projects. This increase responds to the confidence of international producers, who have found in Colombia highly qualified talent, powerful stories, diverse locations and a robust, globally competitive incentive system.”\n\t\n\n\tMatthew Patnick, executive producer of Season 2 of “The Night Manager,” concurred: “It was a massive decision to come over to Colombia. The tax incentive is so favorable to productions coming here; it made everything much easier and had a huge financial impact on the show.”\n\n\tThe growing influx of international productions that include Zack Snyder’s indie drama “The Last Photograph,” Constantin Film’s survival horror pic “Titan” (renamed “Snake”) and “Sierra Madre,” starring Kiefer Sutherland, has greatly contributed to the advancement of Colombia’s audiovisual infrastructure in both talent and logistics.\n\n\t“Working with filmmakers of such high caliber, has helped us up our game,” said Jaguar Bite production VP Juan Pablo Solano whose company has serviced Snyder’s pic among others.\n\n\tProimágenes reports that audiovisual production has strongly boosted Colombia’s economy, generating over 570,000 hotel nights and 30,000 airline tickets, benefiting tourism and services nationwide. Incentivized projects now span 24 departments and 153 municipalities, reflecting broad regional impact.\n\n\n\n\t\n\n\t\t\t\t\t“One Hundred Years of Solitude,” Netflix\n\t\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Colombia Boosts Tax Incentive CINA to Record Amount for 2026",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/The-Night-ManagerS2.jpg?crop=0px%2C65px%2C3900px%2C2193px&resize=1000%2C563"
      ],
      "datePublished": "2025-12-19T02:12:09.000Z",
      "dateModified": "2025-12-19T02:12:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Mubi Overhauls Content Leadership and Integrates Match Factory",
    "url": "https://variety.com/2025/film/global/mubi-overhaul-content-leadership-integrates-match-factory-1236612540/",
    "image": "https://variety.com/wp-content/uploads/2024/12/Die-my-Love.jpg?w=800&h=533&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-19T12:15:07.000Z",
    "description": "\n\tMubi, the indie film company behind “The Substance” and “Die, My Love,” has restructured its content leadership as it navigates industry headwinds. ",
    "body": "\n\tMubi, the indie film company behind “The Substance” and “Die, My Love,” has restructured its content leadership as it navigates industry headwinds. \n\n\tMubi, which had scaled aggressively in recent years, currently employs approximately 400 staff across 14 international and U.S. offices. The restructuring comes as Mubi offered voluntary exit packages. “About a dozen people across different areas decided to leave,” a Mubi spokesperson told Variety.\n\t\n\n\t“Efe recently explained to the entire Mubi team that the company was going to be asking a lot of everyone going forward, and if anyone felt they were not up for it the company would help them with a generous exit. We will be rehiring many of these roles,” Mubi said.\n\n\n\tAs part of the overhaul, longtime chief content officer Jason Ropell is transitioning to a senior advisory role at Mubi focused on strategic and creative counsel. He will be working closely with Mubi founder and CEO Efe Cakarel. Mubi will not be hiring a new CCO, and the company has now divided its content operations into four pillars, a spokesperson said. \n\n\tArianna Bocco, the well respected former IFC executive who joined Mubi at the start of the year, has been promoted to oversee all acquisitions and distribution globally. \n\n\tMichael Weber, the longtime head of leading German sales company The Match Factory, will become Mubi’s head of global production. The Match Factory, which became part of Mubi in 2022, will now be fully integrated into its parent company; but it will continue handling international sales in territories where Mubi doesn’t have direct distribution operations. The Match Factory will still acquire third-party titles from leading filmmakers. \n\t\n\n\tChiara Maranon and Uriel Kuzniecki have been named co-heads of programming and licensing, while Danny Kasman continues to lead publishing.\n\n\tMubi has had a tumultuous year. After securing $100 million from Sequoia Capital Investment in the Spring, Mubi faced some backlash surrounding the investor’s ties to the Israeli military. Mubi had also been challenged by the theatrical market’s decline for indie movies, in the back of a cycle of splashy acquisitions at festivals. The banner splurged $24 million at Cannes to acquire Lynne Ramsay’s “Die, My Love,” starring Jennifer Lawrence and Robert Pattinson, but the movie has underperformed in theaters. \n\n\tDespite these setbacks, Mubi said it’s “bullish on the future. The company is well capitalized and the team is committed to its mission of bringing more independent cinema and important filmmaking voices to the world.” The banner’s spokesperson said Mubi’s role is more vital than ever “as major consolidation in the entertainment industry continues to challenge independent filmmaking.”\n\n\tMubi releases scored seven Golden Globes nominations, including a best actress nom for Lawrence. The company is also the distributor of several Oscar-shortlisted films, including “Sentimental Value,” Oliver Laxe’s “Sirat,” Park Chan-wook’s “No Other Choice” and Jafar Panahi’s “It Was Just an Accident.” Mubi recently hired veteran publicity executive VJ Carbone as VP of communications in the U.S. as it gears up for a busy awards season.\n\n\tOur sister publication Deadline was first to report on the leadership restructuring.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Mubi Overhauls Content Leadership and Integrates Match Factory",
      "image": [
        "https://variety.com/wp-content/uploads/2024/12/Die-my-Love.jpg?w=800&h=533&crop=1"
      ],
      "datePublished": "2025-12-19T12:15:07.000Z",
      "dateModified": "2025-12-19T12:15:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Last Samurai Standing’ Renewed for Season 2 at Netflix",
    "url": "https://variety.com/2025/tv/news/last-samurai-standing-season-2-netflix-1236611766/",
    "image": "https://variety.com/wp-content/uploads/2025/02/Last-Samurai-Standing.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-19T03:00:00.000Z",
    "description": "\n\tNetflix has greenlit a second season of “Last Samurai Standing,” the Japanese period-action series that has become a global streaming hit since its ",
    "body": "\n\tNetflix has greenlit a second season of “Last Samurai Standing,” the Japanese period-action series that has become a global streaming hit since its debut.\n\n\tSet during Japan’s Meiji period in the late 19th century, “Last Samurai Standing” follows 292 samurai warriors who gather at Kyoto’s Tenryuji Temple for a deadly competition with a grand prize of 100 billion yen. The story centers on protagonist Shujiro Saga, played by Okada Junichi, who enters the dangerous contest to save his ailing wife and child.\n\t\n\n\tThe battle royale epic climbed to No. 1 on Netflix’s Global Top 10 (Non-English Series) chart and ranked in the Top 10 across 88 countries. In Japan, the series held the No. 1 position for four consecutive weeks, establishing itself as one of the country’s most popular recent releases.\n\n\n\tThe show achieved a significant milestone as the first all-Japanese production nominated in the best foreign language series category at the Critics’ Choice Awards.\n\n\tOkada serves triple duty on the series as lead actor, producer and action choreographer, working alongside director Fujii Michihito. The production brings together an ensemble cast featuring some of Japan’s most prominent talent, including Yumia Fujisaki, Kaya Kiyohara, Masahiro Higashide, Shota Sometani, Taichi Saotome, Yuya Endo, Yasushi Fuchikami, Jyo Kairi, Takayuki Yamada, Wataru Ichinose, Riho Yoshioka, Kazunari Ninomiya, Hiroshi Tamaki and Hideaki Ito.\n\n\t“I’m pleased to see that ‘Last Samurai Standing’ has reached global audiences and has been confirmed for a second season,” Okada said. “I’m excited to get back into this wild world and once again charge into battle with the production team. We hope to make the next season even more energetic and action-packed.”\n\t\n\n\tFujii added: “I’m very pleased and relieved that ‘Last Samurai Standing’ has been such a big hit outside Japan. I’m also honored to say that the series has officially been greenlit for a second season. There’s no doubt that Season 2 will be even bigger and better than the first.”\n\n\tThe series is based on Imamura Shogo’s “Ikusagami” novel series, which won the 166th Naoki Prize in 2021. Directors Yamaguchi Kento and Yamamoto Toru join Fujii on the project, with Oshida Kosuke serving as producer.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Last Samurai Standing’ Renewed for Season 2 at Netflix",
      "image": [
        "https://variety.com/wp-content/uploads/2025/02/Last-Samurai-Standing.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-19T03:00:00.000Z",
      "dateModified": "2025-12-19T03:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Best Horror Movies of 2025, Ranked: ‘Sinners,’ ‘Final Destination Bloodlines,’ ‘Weapons’ and More",
    "url": "https://variety.com/lists/best-horror-movies-2025-ranked/",
    "image": "https://variety.com/wp-content/uploads/2025/12/Best-Horror-Movies-of-2025.jpg?crop=0px%2C24px%2C1920px%2C1080px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-12-19T02:20:00.000Z",
    "description": "\n\t\n\t\t\t\n\t\t\t\t\n\t\n\n\t\n\tDec 18, 2025 6:20pm PT\t\n\t\n\n\t\n\t\tThe Best Horror Movies of 2025, Ranked: ‘Sinners,’ ‘Final Destination Bloodlines,’ ‘Weapons’ and More",
    "body": "\n\t\n\t\t\t\n\t\t\t\t\n\t\n\n\t\n\tDec 18, 2025 6:20pm PT\t\n\t\n\n\t\n\t\tThe Best Horror Movies of 2025, Ranked: ‘Sinners,’ ‘Final Destination Bloodlines,’ ‘Weapons’ and More\n\t\n\t\n\t\t\t\n\n\n\t\t\t\n\t\t\t\n\t\n\n\t\t\t\t\t\t\t\t\tVariety\n\t\n\n\t\t\n\t\n\t\t\t\t\n\n\t2025 was a robust year for horror movies, both in terms of the nonstop release schedule and numerous box office hits. From monster openings for features like “Sinners” and “Final Destination Bloodlines” to word-of-mouth streaming debuts like “Dead Mail” and “Best Wishes to All,” there are so many standouts that any genre fan has their work cut out for them to catch up. Below, take a look at Variety’s list of the Best Horror Movies of the Year, a selection that hopefully invites spirited debate and encourages adding some new titles to your Letterboxd Watchlist.\n\n\tFirst, some honorable mentions, in alphabetical order:\n\n\t“Bring Her Back” (A24) — Danny and Michael Philippou’s “Talk to Me” follow-up is handsomely shot and features a great Sally Hawkins performance, but is stuck in one wildly depressing gear.\n\n\t“Clown in a Cornfield” (RLJE Films and Shudder) — More clever than the name implies, a mid-film twist plays well at upending genre conventions.\n\n\t”Drop” (Universal Pictures) — In one of the year’s best popcorn movies, Meghann Fahy has to squeeze out of one sticky situation after another in this dynamically filmed low-budget thriller.\n\n\t“Predator: Killer of Killers” (Hulu) — This impressive triptych delivers some of the most epic Predator battles ever, with animation acting as a wonderful canvas for prohibitively expensive fight scenes.\n\n\t”Sweet Revenge” (Horror Inc. and Jason Universe) — It may be a short, but this brief Jason tale does a great job of delivering some bloody action with a retro feel, and gives the legendary killer a formidable foe. Here’s hoping it gets turned into a feature-length film, as it seems like writer and director Mike P. Nelson really understands what makes the “Friday the 13th” universe tick.\n\n\n\t\t\t\n\t\t\t\n\tThe Toxic Avenger\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Yana Blajeva\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\tCineverse\n\n\tWriter and Director Macon Blair amps up the heart — but keeps the splattery violence and satire — in this reimagining of the signature Troma movie. Peter Dinklage is empathetic as the man behind Toxie, a humble janitor, while Kevin Bacon is wonderfully evil as a billionaire asshole, with Elijah Wood and Taylour Paige also in on the fun. Frantic, bizarre and loaded with love for the original, “The Toxic Avenger” will keep fans happy and bring joy to new devotees.\n\n\t\t\n\t\t\t\n\t\t\t\n\tPresence\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Neon\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\tNeon\n\n\tSteven Soderbergh’s unique take on a ghost story finds his camera roaming a house in a spectral first-person mode. The family inside can certainly feel the spirit roaming around the home, but why? There’s certainly more going on in the story than unfinished business, and Soderbergh can land the plane on the murder mystery penned by his frequent collaborator David Koepp. For experimental work, it’s a rousing success.\n\n\t\t\n\t\t\t\n\t\t\t\n\tHeart Eyes\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: ©Sony Pictures/Courtesy Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\tScreen Gems\n\n\tJosh Ruben directed a tricky piece of pop culture, mixing a perfectly charming rom-com with the DNA of a “Scream”-esque whodunit. Olivia Holt and Mason Gooding are endlessly charming as a new couple with the most conventional meet-cute of all time. But what happens when their first evening together turns into a one-crazy-night movie where they’re pursued by a serial killer? The laughs ultimately outweigh the scares, but it’s a great genre twist for slasher fans, elevated by a supporting cast that includes memorable turns from Gigi Zumbado, Michaela Watkins, Devon Sawa and Jordana Brewster.\n\n\t\t\n\t\t\t\n\t\t\t\n\tBest Wishes to All\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Shudder / Courtesy Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\tShudder\n\n\tThis Japanese horror movie is filled with some of the most indelible imagery put on screen this year, nightmare fuel for those able to keep their eyes open. Kotone Furukawa plays a young woman visiting her grandparents who stumbles upon a very shocking — and seemingly normalized — part of their family history. Telling a larger story about happiness and class culture, Yuta Shimotsu’s film is most impactful when it’s in gonzo family drama mode, making eye-popping sacrifices a family affair.\n\n\t\t\n\t\t\t\n\t\t\t\n\tDead Mail\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Courtesy of Dead Mail LLC\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\tShudder\n\n\tJoe DeBoer and Kyle McConaghy’s unique conspiracy mystery feels beamed out of the ‘80s, with production design and filmmaking that recalls a long-forgotten VHS relic. When a synthesizer expert is kidnapped, he’s able to get a desperate letter into the mail, and the amateur sleuths at the dead letter office start hunting. Things quickly get complicated for all parties involved, and the film’s visuals and soundtrack stick around even after the credits roll.\n\n\t\t\n\t\t\t\n\t\t\t\n\tThe Monkey\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Courtesy Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\tNeon\n\n\tOsgood Perkins’ about-face after the success of “Longlegs” was this bloody dark comedy about a toy monkey who brings death and destruction wherever he goes. Theo James is a hoot playing identical twins trying unsuccessfully to keep this malevolent force buried, and some of the year’s freakiest deaths come courtesy of this furry fiend. A nasty, brutish piece of work that is sure to satisfy gorehounds.\n\n\t\t\n\t\t\t\n\t\t\t\n\tI Love You Forever\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Courtesy Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\tUtopia\n\n\tNot a conventional horror movie, this romantic drama ratchets up the suffocating tension slowly as rom-com trappings give way to an all-too-real-feeling story of a toxic and psychologically abusive relationship. Sofia Black-D’Elia plays a law student who gets love-bombed by the handsome and charming Finn (Ray Nicholson). He seems to be the perfect guy until his grip of control over her escalates from annoyingly frequent text messages to suicidal screaming fits over missed calls. Cazzie David and Elisa Kalani co-wrote and –directed this sharp film.\n\n\t\t\n\t\t\t\n\t\t\t\n\tTogether\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Courtesy of Neon\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\tNeon\n\n\tMichael Shanks’ rip-roaring body horror love story stars real-life spouses Dave Franco and Alison Brie as a couple that grows increasingly close physically even as their relationship is on shaky ground. The film includes some of the year’s most talked-about “turn away from the screen” scenes (The saw! The eyeballs! The penis!) and some great visual nods to other horror classics. It’s a lean, mean, thrilling machine and a great way to get introduced to body horror, for those interested in taking the disgusting plunge.\n\n\t\t\n\t\t\t\n\t\t\t\n\t28 Years Later\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\tSony Pictures Releasing\n\n\tDirector Danny Boyle and writer Alex Garland’s return to the zombie franchise is bold, divisive, gory and a hell of an adventure. Reuniting with “28 Days Later” cinematographer Anthony Dod Mantle, who shot much of the film on complex iPhone rigs, the stylish colors and editing keep things eye-popping. The stylish look underlines the disturbing gore and the heart-pounding pursuits, as young Alfie Williams learns to become a man by sneaking off to shoot zombies in an infected zone. Aaron Taylor-Johnson and Ralph Fiennes add grit to their supporting roles, and it’s hard to believe another sequel will be released in a matter of months.  \n\n\t\t\n\t\t\t\n\t\t\t\n\tCompanion\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Courtesy of Warner Bros. Pictures\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\tWarner Bros. Pictures\n\n\tDrew Hancock’s twisty sci-fi thriller stars Sophie Thatcher as a love robot who is manipulated into murder while on vacation with a devious group of friends. Thatcher is terrific, coming to terms with not only her gaslighting boyfriend (a delightfully smarmy Jack Quaid) but also the fact that she’s not human after all, and the bloody twists keep amping up the stakes. Undervalued theatrically, “Companion” is sure to become a cult favorite once discovered on streaming.\n\n\t\t\n\t\t\t\n\t\t\t\n\tFinal Destination Bloodlines\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\tWarner Bros. Pictures\n\n\tWho would have thought that the sixth film in this beloved franchise — one that comes after a 14-year gap since the previous chapter — would be such a nimble crowdpleaser? “Bloodlines” has many of the same beats as previous installments while making some key changes: The group of people avoiding Death’s cruel fate are all family members instead of random strangers; the opening dream setpiece was a flashback, allowing for the main film to be filled with new characters that hadn’t died yet; and the movie felt bigger in scope overall. But ultimately, what worked very well were the ooey gooey kills, which were a perfect blend of funny and cringey. Mix in a heartfelt goodbye from franchise fixture Tony Todd, and it’s no surprise why this was such a critical and commercial success.  \n\n\t\t\n\t\t\t\n\t\t\t\n\tThe Shrouds\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Courtesy Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\tJanus Films\n\n\tDavid Cronenberg’s latest film is about the living who haunt graveyards, namely Karsh (Vincent Cassel), a man who builds in-tomb cameras so that mourners can watch their loved ones rot in real time. It’s a downer logline that morphs into a thorny story of corporate intrigue, complete with body horror flourishes and romantic moments as horny as they are vulnerable. An odd chapter in an unparalleled career, “The Shrouds” is a must-watch as Cronenberg ponders death with a great troupe of actors, including Diane Kruger, Guy Pearce and Sandrine Holt.\n\n\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\tWarner Bros.\n\n\tZach Cregger’s ambitious examination of evil taking hold of a small town succeeds by putting interesting, complicated characters at the forefront. When a classroom of kids runs away in the middle of the night, troubled townspeople played by Josh Brolin, Julia Garner, Alden Ehrenreich and Austin Abrams are among those searching for (and stumbling on) answers. Well-directed setpieces, sinister twists and an outrageous ending make “Weapons” a must-see.\n\n\t\t\n\t\t\t\n\t\t\t\n\tSinners\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Warner Bros.\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\tWarner Bros. Pictures\n\n\tAn unbelievably confident work stuffed with imagination, writer-director Ryan Coogler delivered his best film yet with this music-filled horror story. Led by a career-high Michael B. Jordan playing the Smokestack twins, each character in this rich work — which swerves into the supernatural once an Irish vampire starts infecting the clientele of the twins’ new juke joint — could anchor their own movie. The blend is sexy, surprising and gorgeously shot, and an unforgettable twist to well-trodden bloodsucker lore.\n\n\t\t\n\t\n\t\n\n\n\t\n\t\tMore from Variety\n\t\n\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\n\n\t\t\n\n\t\n\t\tMore From Our Brands\n\t\n\t\n\t\t\n\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\n\tRolling Stone\n\n\t\t\t\t\tStephen Colbert Takes Aim at ‘Jag Bag’ Donald Trump in Animated Christmas Video\t\t\n\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\n\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\n\tRobb Report\n\n\t\t\t\t\tMeet the Riva Cento, a High-Tech, Ultra-Limited Twist on a Brand Favorite \t\t\n\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\n\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\n\tSportico\n\n\t\t\t\t\tNike Q2 Earnings Crush Estimates, but Are Still Down 32%\t\t\n\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\n\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\n\tWWD\n\n\t\t\t\t\tCoty Divests Remaining Stake in Wella\t\t\n\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\n\t\t\n\t\n\t\n\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Best Horror Movies of 2025, Ranked: ‘Sinners,’ ‘Final Destination Bloodlines,’ ‘Weapons’ and More",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/Best-Horror-Movies-of-2025.jpg?crop=0px%2C24px%2C1920px%2C1080px&resize=1000%2C563"
      ],
      "datePublished": "2025-12-19T02:20:00.000Z",
      "dateModified": "2025-12-19T02:20:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Guess the Bday Babe Sippin' on Her Erewhon Smoothie!",
    "url": "https://www.tmz.com/2025/12/18/guess-sexy-singer-erewhon-smoothie-bday/",
    "image": "https://imagez.tmz.com/image/7f/16by9/2025/12/18/7f61ecdb053549c4acfbead7db2cfc76_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-12-18T21:31:49.000Z",
    "description": "\n    \n                    \n                          Guess The Bday Babe\n                          Sippin' On Her\n                          Erewhon Sm",
    "body": "\n    \n                    \n                          Guess The Bday Babe\n                          Sippin' On Her\n                          Erewhon Smoothie 🥤!\n                      \n      \n    \n      \n        \n              \n    \n    \n          Put down your bottles and pick up this genie posing with her Erewhon smoothie! Do you think you've got what it takes to sip up the sexy singer?!\n      \n    \n          This sultry swooner's been around since the '90s, and she's \"ain't no other!\" Catch her in Vegas for her live show ... or showin' off her stunning looks on socials!\n      \n    \n          Hit the gallery for the reveal!\n      \n      \n      \n          \n            \n              \n                \n                Share on Facebook\n              \n            \n            \n              \n                \n                Share on X\n              \n            \n                          \n                \n                  \n                \n              \n                      \n        \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Hotties & Bodies\n              \n                          \n                Hot Bodies\n              \n                          \n                Photo Galleries\n              \n                          \n                Music\n              \n                          \n                Famous Food\n              \n                      \n        \n          \n  ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Guess the Bday Babe Sippin' on Her Erewhon Smoothie!",
      "image": [
        "https://imagez.tmz.com/image/7f/16by9/2025/12/18/7f61ecdb053549c4acfbead7db2cfc76_xl.jpg"
      ],
      "datePublished": "2025-12-18T21:31:49.000Z",
      "dateModified": "2025-12-18T21:31:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Model Twiggy 'Memba Her?!",
    "url": "https://www.tmz.com/2025/12/19/model-twiggy-memba-her/",
    "image": "https://imagez.tmz.com/image/a3/16by9/2025/12/17/a356cfdf71354e4e904b650256a533f7_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-12-19T08:45:44.000Z",
    "description": "\n    \n                    \n                          Model Twiggy\n                          'Memba Her?!\n                      \n                  \n   ",
    "body": "\n    \n                    \n                          Model Twiggy\n                          'Memba Her?!\n                      \n                  \n                                                                        Published \n                              December 19, 2025\n                            12:45 AM PST\n                                                                            \n      \n    \n          British-born Lesley Lawson was only 17 years old when she shot to superstardom as a model in the mid-to late 1960s.\n      \n    \n          After gracing the covers of fashion magazines like Vogue, she quickly became known by her nickname, \"Twiggy.\"\n      \n    \n          Guess what she looks like now at 76 years old!\n      \n      \n      \n          \n            \n              \n                \n                Share on Facebook\n              \n            \n            \n              \n                \n                Share on X\n              \n            \n                          \n                \n                  \n                \n              \n                      \n        \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Memba Them\n              \n                          \n                Photo Galleries\n              \n                          \n                Models\n              \n                      \n        \n          \n  ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Model Twiggy 'Memba Her?!",
      "image": [
        "https://imagez.tmz.com/image/a3/16by9/2025/12/17/a356cfdf71354e4e904b650256a533f7_xl.jpg"
      ],
      "datePublished": "2025-12-19T08:45:44.000Z",
      "dateModified": "2025-12-19T08:45:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "David Harbour, Millie Bobby Brown Skip 'Stranger Things' Final Season Celebration",
    "url": "https://www.tmz.com/2025/12/18/david-harbour-millie-bobby-brown-skip-stranger-things-event/",
    "image": "https://imagez.tmz.com/image/f6/16by9/2025/12/19/f60a3dd186004e1aaeb6724581f66596_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-12-19T01:54:00.000Z",
    "description": "\n    \n                    \n                          David Harbour, Millie Bobby Brown\n                          MIA From 'Stranger Things' Celebratio",
    "body": "\n    \n                    \n                          David Harbour, Millie Bobby Brown\n                          MIA From 'Stranger Things' Celebration\n                          ... In The Upside Down?!?\n                      \n                  \n                                                                        Published \n                              December 18, 2025\n                            5:54 PM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          The gang's not all here for a \"Stranger Things\" event in New York City ... because David Harbour and Millie Bobby Brown are noticeably absent.\n      \n    \n          Most of the cast was at the \"Stranger Things: The Final Season Celebration\" at New York City's Paley Center Thursday ... but David and Millie were nowhere to be found.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          As we reported ... David was initially supposed to attend the event, but he was scrubbed as an attendee on the event website.\n      \n\n          David's absence comes on the heels of some bizarre behavior in Encinitas, CA. He's had a tough year, going through a messy divorce with Lily Allen.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Millie wasn't scheduled to attend either, and she didn't make a surprise appearance.\n      \n    \n          There's been a rumored feud between David and Millie, but we've seen them together at other \"Stranger Things\" events recently.\n      \n    \n          Check out the pics ... looks like David and Millie missed a good time.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                David Harbour\n              \n                          \n                Millie Bobby Brown\n              \n                          \n                Lily Allen\n              \n                          \n                Celebrity News\n              \n                          \n                TV\n              \n                          \n                Stranger Things\n              \n                          \n                Celebrity Feuds\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "David Harbour, Millie Bobby Brown Skip 'Stranger Things' Final Season Celebration",
      "image": [
        "https://imagez.tmz.com/image/f6/16by9/2025/12/19/f60a3dd186004e1aaeb6724581f66596_xl.jpg"
      ],
      "datePublished": "2025-12-19T01:54:00.000Z",
      "dateModified": "2025-12-19T01:54:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Celebrities Twinning for National Twin Day!",
    "url": "https://www.tmz.com/2025/12/18/celebrities-national-twin-day/",
    "image": "https://imagez.tmz.com/image/e0/16by9/2025/12/18/e0b4dee70ba843f5ab25b3bfbb00efa3_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-12-19T00:00:08.000Z",
    "description": "\n    \n                    \n                          Celebs Twinning For\n                          National Twin Day ...\n                          Dou",
    "body": "\n    \n                    \n                          Celebs Twinning For\n                          National Twin Day ...\n                          Double The Trouble!\n                      \n                  \n                                                                        Published \n                              December 18, 2025\n                            4:00 PM PST\n                                                                            \n      \n    \n      \n        \n              \n    \n    \n          You are seeing double, but there's no need to get your eyes checked -- it's National Twin Day! And we're rounding up the celebs who absolutely nailed the copy-paste look.\n      \n    \n          From Lily Collins and Charlie McDowell to Nicole Scherzinger and Flula Borg, these stars are serving double the trouble!\n      \n\n                  \n          \n                          \n                \n                                  \n      \n    \n          \"Mean Girls\" star Jonathan Bennett and his spouse, Jaymes Vaughan, were both trophy husbands in this elevator selfie.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          And \"Euphoria\" star Maude Apatow and her sister Iris were ready to rock 'n' roll while they rocked matching Bruce Springsteen tees.\n      \n    \n          Click through the gallery for more twinning shots!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Lily Collins\n              \n                          \n                Nicole Scherzinger\n              \n                          \n                Jonathan Bennett\n              \n                          \n                Bruce Springsteen\n              \n                          \n                Fashion\n              \n                          \n                Photo Galleries\n              \n                          \n                Holidays\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Celebrities Twinning for National Twin Day!",
      "image": [
        "https://imagez.tmz.com/image/e0/16by9/2025/12/18/e0b4dee70ba843f5ab25b3bfbb00efa3_xl.jpg"
      ],
      "datePublished": "2025-12-19T00:00:08.000Z",
      "dateModified": "2025-12-19T00:00:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Pete Davidson's Model Girlfriend Elsie Hewitt Gives Birth",
    "url": "https://www.tmz.com/2025/12/18/pete-davidson-elsie-hewitt-birth-baby-parents-announcement/",
    "image": "https://imagez.tmz.com/image/d2/16by9/2025/12/18/d2320d3dfaf243b99227bc5169feed2a_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-12-18T23:22:01.000Z",
    "description": "\n    \n                    \n                          Elsie Hewitt\n                          Me & Pete Are Officially Parents!!!\n                      ",
    "body": "\n    \n                    \n                          Elsie Hewitt\n                          Me & Pete Are Officially Parents!!!\n                      \n      \n    \n      \n        \n              \n    \n    \n          Pete Davidson has joined the diaper squad ... his girlfriend Elsie Hewitt has given birth!\n      \n    \n          Yup, the model officially announced the arrival of their newborn on IG Thursday ... sharing photos of their little one. She says her baby girl, Scottie Rose Hewitt Davidson, was born on December 12, 2025 ... last Friday.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Pete and Elsie were soaking up the soon-to-be-parent vibes over the summer ... relaxing on luxe getaways and enjoying some much-needed chill time together.\n      \n\n          TMZ spilled the tea -- the former \"SNL\" star and Elsie have been expecting since July, after sparks flew back in March.\n      \n    \n      \n        \n              \n    \n    \n          Pete's been a doting dad-to-be in the run-up to the birth ... carrying his GF's pregnancy pillow for him on his shoulders while walking through NYC -- and, we also got video of Pete planting a kiss on her lips at the baby shower.\n      \n    \n          The duo got together after Pete’s high-profile heartbreak tour -- Kim Kardashian, Ariana Grande, Emily Ratajkowski ... you name it.\n      \n    \n          Looks like Pete’s past is officially in the rear-view, and he’s all in on dad mode. Congrats, you two!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Elsie Hewitt\n              \n                          \n                Pete Davidson\n              \n                          \n                Celebrity News\n              \n                          \n                Baby Mama\n              \n                          \n                Relationships\n              \n                          \n                Baby Watch\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Pete Davidson's Model Girlfriend Elsie Hewitt Gives Birth",
      "image": [
        "https://imagez.tmz.com/image/d2/16by9/2025/12/18/d2320d3dfaf243b99227bc5169feed2a_xl.jpg"
      ],
      "datePublished": "2025-12-18T23:22:01.000Z",
      "dateModified": "2025-12-18T23:22:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]