[
  {
    "title": "Nicholas Hoult on Being Given Darker Roles and Working With Robert Eggers, Clint Eastwood and Justin Kurzel in the Space of a Year",
    "url": "https://variety.com/2025/film/global/nicholas-hoult-robert-eggers-clint-eastwood-justin-kurzel-1236603124/",
    "image": "https://variety.com/wp-content/uploads/2025/12/Nicholas-Hoult.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-08T15:41:35.000Z",
    "description": "\n\tHas Nicholas Hoult gone over to the dark side? \n\n\tSpeaking at the Variety Lounge presented by Red Sea Film Festival, the actor acknowledged that cha",
    "body": "\n\tHas Nicholas Hoult gone over to the dark side? \n\n\tSpeaking at the Variety Lounge presented by Red Sea Film Festival, the actor acknowledged that characters such as Lex Luthor in “Superman,” as well as Thomas Hutter in “Nosferatu,” Justin Kemp in “Juror #2” and Bob Mathews in “The Order” had all been darker than those he had earlier in his career.\n\n\tAge has played a part in his choice of roles, something he has discussed with his friend Daniel Kaluuya, who was also at the festival this year. The two have known each other since they were both in the teen comedy drama series “Skins.”\n\t\n\n\t“I think it’s partly to do with age and, speaking of Daniel Kaluuya earlier, we always said that our 20s were like figuring stuff out and trying things, and then when you get to your 30s as an actor that’s when things get really interesting, character-wise,” he said.\n\n\n\t“I feel like with those movies, I had a great little run. I think at the end of the year that we shot ‘The Order,’ ‘Nosferatu’ and ‘Juror #2,’ I was like, oh, you know, if I could say to me 10-15 years ago that I’d get a chance to work with Robert Eggers, Clint Eastwood and Justin Kurzel all in one year, playing those characters and in those films, I’d be very, very satisfied and content.”\n\n\tAlthough Kaluuya and fellow “Skins” alumnus Dev Patel have gone behind the camera with films such as “The Kitchen” and “Monkey Man,” don’t expect to see Hoult follow suit, although he admires their achievements. “I’m so impressed with what they did and what they do. Both of them are so creative, in how their minds work. I just love spending time with them, because they’re so inspiring. I mean, ‘Monkey Man,’ the fact that Dev managed to pull off acting and directing, and it’s such a wonderful piece of directing, but to act in it as well … I just don’t know how your brain can do that. I definitely don’t think I could ever manage that.”\n\t\n\n\tAlthough directing is not in the cards for now, in case he changes his mind he’s been watching carefully. “When I’m working with a director that I really like, I kind of try and keep a few notes, like, what they do, so I’m like, ‘Okay, remember this in case one day you do end up directing, and hopefully learn from the people you work with and really liked.'”\n\n\tTalking about playing Lex Luthor in James Gunn’s “Superman” and the upcoming follow-up, “Man of Tomorrow,” which is set to start shooting in April, Hoult commented: “There’s been so many wonderful actors who’ve played Lex. So I feel honored to be another one, another name added to that list. And I just love what James Gunn writes, how he wants to portray that character, evolve the character going forward as well. So I feel like I’m in safe hands with him, and it’s a character that I really enjoy playing. It makes me happy.”\n\n\tAs for the script for “Man of Tomorrow,” while he wouldn’t go into details, he said it was “awesome.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nicholas Hoult on Being Given Darker Roles and Working With Robert Eggers, Clint Eastwood and Justin Kurzel in the Space of a Year",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/Nicholas-Hoult.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-08T15:41:35.000Z",
      "dateModified": "2025-12-08T15:41:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Marcello Hernández Sets Debut Stand-Up Special at Netflix",
    "url": "https://variety.com/2025/tv/news/marcello-hernandez-netflix-comedy-special-1236603285/",
    "image": "https://variety.com/wp-content/uploads/2025/12/MHSS_2025_Unit_02172R-e1765207332649.jpg?crop=435px%2C48px%2C1357px%2C762px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-12-08T15:25:03.000Z",
    "description": "\n\t“Saturday Night Live” breakout Marcello Hernández has set his first-ever stand-up comedy special at Netflix.\n\n\tThe hour, titled “American Boy,” will",
    "body": "\n\t“Saturday Night Live” breakout Marcello Hernández has set his first-ever stand-up comedy special at Netflix.\n\n\tThe hour, titled “American Boy,” will stream on Jan. 7. Filmed in front of a hometown crowd in Miami, the special sees Hernández musing on his experiences growing up as a first-generation American. \n\n\t“American Boy” is directed by Nicholaus Goossen and executive produced by Hernández and Matthew Vaughan. It’s produced by Rotten Science.\n\t\n\n\tHernández, now 28, joined “SNL” in 2022 and quickly became one of the NBC sketch series’ rising stars. He’s perhaps best known for playing Domingo in the oft-repeated musical sketches about a bride-to-be’s forbidden love affair. He also recently impersonated Sebastian Maniscalco, earning props from the comedian himself, and he often plays characters nodding to his Cuban and Dominican heritage.\n\n\n\tHe played a Miami nightclub promoter showing the ropes to a dim-witted bouncer played by Jason Momoa. And he played the son to a protective mother played by a dolled up Pedro Pascal.\n\n\tHernández recently appeared in “Happy Gilmore 2” alongside Adam Sandler, as well as the Michelle Williams miniseries “Dying for Sex.” Next, he has voice roles in “Shrek 5” and “The Angry Birds Movie 3,” and he’ll appear in the Teyana Taylor and Kevin Hart comedy “72 Hours.”\n\n\tIn 2024, Hernández was one of Variety‘s Power of Young Hollywood cover stars. Listing inspirations Steve Harvey, Cedric the Entertainer, Kevin Hart and Bernie Mac, he said, “I want to be as successful as those guys, but I’m gonna be the Hispanic version.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Marcello Hernández Sets Debut Stand-Up Special at Netflix",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/MHSS_2025_Unit_02172R-e1765207332649.jpg?crop=435px%2C48px%2C1357px%2C762px&resize=1000%2C563"
      ],
      "datePublished": "2025-12-08T15:25:03.000Z",
      "dateModified": "2025-12-08T15:25:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Wrapbook, Payroll and Production Accounting Company, Buys Cinapse, Film and TV Scheduling Platform (EXCLUSIVE)",
    "url": "https://variety.com/2025/biz/news/wrapbook-payrollproduction-accounting-company-buys-cinapse-film-scheduling-platform-1236603203/",
    "image": "https://variety.com/wp-content/uploads/2025/12/WrapbookCinapse-1.png?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-08T16:00:00.000Z",
    "description": "\n\tWrapbook, a payroll and production accounting platform for the entertainment industry, has acquired Cinapse, a scheduling platform for film and tele",
    "body": "\n\tWrapbook, a payroll and production accounting platform for the entertainment industry, has acquired Cinapse, a scheduling platform for film and television ventures. Traditionally, scheduling and production finance have operated in separate worlds. Wrapbook says its acquisition bridges that gap, connecting planning and financial execution to close the loop from scheduling to spending decisions. Financial details of the transaction were not disclosed. \n\t\n\n\tThe move reflects a broader shift toward uniting creative and financial workflows across the industry, as productions look to align planning, costs and delivery more closely. Cinapse has worked on major productions, including “Euphoria,” “The Boys,” “Shrinking,” “Outer Banks” and “High Potential.” It has worked with the likes of Netflix, Disney, Apple TV, NBCUniversal, Paramount and Sony.\n\n\n\t“Cinapse and Wrapbook share a vision for how modern productions should operate as fully connected, collaborative and efficient,” said Herman Phillips, co-founder and CEO of Cinapse. “Together, we’re building what every filmmaker and studio has wanted for decades: one seamless system that connects scheduling, budgeting, and payroll from prep to wrap. By combining Wrapbook’s financial infrastructure with Cinapse’s real-time scheduling technology, we’re giving ADs, producers, and directors tools that restore control over time, money, and creativity.”\n\n\n\t“Cinapse is the best scheduling platform on the market,” said Ali Javid, CEO and co-founder of Wrapbook. “This acquisition isn’t about expanding for expansion’s sake—it’s about aligning two mission-critical workflows. Together, we’re redefining how productions plan and track every dollar of their creative process.”\n\t\n\n\tAs part of the acquisition, Wrapbook will add Cinapse’s Herman Phillips, director and general manager of scheduling, and François Van der Merwe, senior engineer, to their team.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Wrapbook, Payroll and Production Accounting Company, Buys Cinapse, Film and TV Scheduling Platform (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/WrapbookCinapse-1.png?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-08T16:00:00.000Z",
      "dateModified": "2025-12-08T16:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Paramount Vows to Release More Than 30 Films Theatrically as It Launches Hostile Takeover Bid for Warner Bros. Discovery",
    "url": "https://variety.com/2025/biz/news/paramount-promises-30-films-in-theaters-hostile-takeover-bid-warner-bros-discovery-netflix-1236603343/",
    "image": "https://variety.com/wp-content/uploads/2025/11/David-Ellison-Credit-Nate-Jensen.jpg?crop=0px%2C0px%2C1920px%2C1080px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-12-08T16:05:31.000Z",
    "description": "\n\tParamount promised to release more than 30 films theatrically as the company launched its hostile takeover bid for Warner Bros. Discovery. In a call",
    "body": "\n\tParamount promised to release more than 30 films theatrically as the company launched its hostile takeover bid for Warner Bros. Discovery. In a call with press and investors on Monday, the company said it will also honor “healthy traditional windows.” \n\n\tIt’s a clear swipe at Netflix, which outmaneuvered Paramount to reach a binding agreement to acquire Warner Bros. and HBO for $82.7 billion. Netflix Co-CEO Ted Sarandos has been dismissive of the theatrical experience, sparking fears among Hollywood’s creative community that by overtaking one of the major film studios, Netflix would hurt cinemas by releasing fewer films. Sarandos did say that Netflix will Warner Bros.’s current theatrical commitments and noted that the streamer releases dozens of its films in theaters (though that is mostly to qualify for awards). But he did hint that the amount of time that films are exclusively in cinemas will “evolve,” positioning that as better for audiences. \n\t\n\n\t“I wouldn’t look at this as a change in approach for Netflix movies or for Warner movies,” Sarandos said in a conference call on Friday. “I think, over time, the windows will evolve to be much more consumer friendly, to be able to meet the audience where they are quicker…I’d say right now, you should count on everything that is planned on going to the theater through Warner Bros. will continue to go to the theaters through Warner Bros., and Netflix movies will take the same strides they have, which is, some of them do have a short run in the theater beforehand. But our primary goal is to bring first-run movies to our members, because that’s what they’re looking for.”\n\t\n\n\tOn Monday,  Paramount Skydance announced it has commenced an all-cash tender offer to acquire all of the outstanding shares of WBD for $30 per share — the same terms it offered in a Dec. 4 bid submitted to the Warner Bros. Discovery’s board. Paramount’s proposed transaction is for the entirety of Warner Bros. Discovery, including the TV business with CNN, TBS, TNT and other networks, whereas Netflix’s bid is for certain parts of the company and would allow most of Warner Bros. Discovery’s cable assets to be spun off into a separate entity. \n\n\tAccording to Paramount, its all-cash offer equates to an enterprise value of $108.4 billion (including assumption of debt). In contrast, the Netflix proposal is valued at $27.75/share and is a mix of cash ($23.25) and stock ($4.50).\n\n\tSince taking over Paramount last summer, the company’s new chairman David Ellison and his team have worked to reinvigorate the studio’s theatrical output. The company is hoping to bolster current eight annual releases to 15 by 2026, 17 by 2027 and 18 by 2028.  Warner Bros. traditionally releases between 12 to 14 movies in theaters annually. This year was a strong one for the studio, which is tops in market share, having released hits such as “Weapons,” “Sinners” and “Superman.” \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Paramount Vows to Release More Than 30 Films Theatrically as It Launches Hostile Takeover Bid for Warner Bros. Discovery",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/David-Ellison-Credit-Nate-Jensen.jpg?crop=0px%2C0px%2C1920px%2C1080px&resize=1000%2C563"
      ],
      "datePublished": "2025-12-08T16:05:31.000Z",
      "dateModified": "2025-12-08T16:05:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "YouTube’s Neal Mohan Named Time CEO of the Year",
    "url": "https://variety.com/2025/digital/news/youtube-neal-mohan-time-ceo-of-the-year-1236603198/",
    "image": "https://variety.com/wp-content/uploads/2025/02/Neal-Mohan-YouTube-CEO.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-08T14:55:36.000Z",
    "description": "\n\tYouTube chief Neal Mohan has been named Time CEO of the Year for 2025.\n\n\t“The entire dynamics of the entire media industry are changing before our e",
    "body": "\n\tYouTube chief Neal Mohan has been named Time CEO of the Year for 2025.\n\n\t“The entire dynamics of the entire media industry are changing before our eyes,” Mohan said in an interview with Time published Dec. 4. “It’s incredibly disruptive, and if you don’t adapt, you can be left by the wayside.” \n\n\tOver the past 20 years, Google-owned YouTube has become the undisputed most-watched video platform in the world. It’s the preferred starting point for countless self-made influencers, podcasters, commentators and entrepreneurs and over time has made it into the big leagues of TV through rights deals with the NFL, Disney, Warner Bros. Discovery and NBCUniversal.\n\t\n\n\tMohan described the video platform as “a metropolis with lots of interconnected dependencies, and what you do on one street impacts what happens on another street.” “In the early days, it was much more like a village, where lots of the creators knew each other,” Mohan told Time. And I think that if you’re the leader of one vs. the other, you’re forced to think about decisions in maybe a different way.”\n\n\tStarting with the 2023-24 season, YouTube became the exclusive U.S. retailer for the NFL’s Sunday Ticket out-of-home package, replacing DirecTV — and beating out other highly interested parties, including Apple, for the rights.\n\n\t“I would say Neal is very well prepared,” NFL commissioner Roger Goodell told Time. “He understands what he’s trying to build. He’s got a deep understanding of the media landscape and where YouTube fits and where content can help him advance his strategies.” \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "YouTube’s Neal Mohan Named Time CEO of the Year",
      "image": [
        "https://variety.com/wp-content/uploads/2025/02/Neal-Mohan-YouTube-CEO.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-08T14:55:36.000Z",
      "dateModified": "2025-12-08T14:55:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Golden Globes Snubs and Surprises: Jacob Elordi and ‘Demon Hunters’ Soar While ‘Wicked,’ ‘Superman’ and Sydney Sweeney Left Cold",
    "url": "https://variety.com/2025/awards/news/golden-globes-snubs-surprises-wicked-superman-1236603123/",
    "image": "https://variety.com/wp-content/uploads/2025/12/Golden-Globes-Snubs-and-Surprises.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-08T14:14:36.000Z",
    "description": "\n\tThe 2026 Golden Globe nominations are here, and with it are some wild, wonderful and unexpected picks…as well as some favorites that don’t make the ",
    "body": "\n\tThe 2026 Golden Globe nominations are here, and with it are some wild, wonderful and unexpected picks…as well as some favorites that don’t make the cut. Check out our list of the biggest snubs and surprises below.\n\t\n\t\t“Wicked: For Good” and “Jay Kelly” miss best picture nominations\t\n\n\tTwo crowd-pleasers that seemed like shoo-ins stumbled at the last minute.\n\t\n\t\tSydney Sweeney snubbed for “Christy”\t\n\n\tDid the film’s poor box office and small cultural footprint keep Sweeney from a nod?\n\t\n\t\n\t\tNo love for Bradley Cooper’s newest film, “Is This Thing On?”\t\n\n\tNot even for Laura Dern’s buzzy performance.\n\n\t\n\t\t“Superman” left out of the cinematic and box office achievement category\t\n\n\tMaybe superhero movies need to clear $1 billion for consideration?\n\t\n\t\tJacob Elordi scores acting noms for two different projects\t\n\n\tThe hunky thespian was thought to get awards attention for his portrayal of The Creature in “Frankenstein,” but his work in the Australian miniseries “The Narrow Road to the Deep North” also earned him a nod.\n\t\n\t\tEva Victor lands an acting nod for “Sorry, Baby”\t\n\n\tThis year’s little indie that could scored a big nomination.\n\t\n\t\tKathryn Bigelow and “A House of Dynamite” couldn’t spark Globes attention\t\n\n\tThe divisive political thriller didn’t attract enough fans in the voting body.\n\t\n\t\tNo love for “The Gilded Age”\t\n\n\tThe sumptuous HBO series might have one of the most celebrated casts on television, but no nominations broke through.\n\t\n\t\tDual acting nominations for Amanda Seyfried\t\n\n\tSeyfried has had a busy year, but voters didn’t forget her work on the miniseries “Long Bright River.”\n\t\n\t\n\t\tHelen Mirren’s TV renaissance continues\t\n\n\tAfter getting a Globes nod in 2024 for her work on the Yellowstone prequel series “1923,” her work in the new series “MobLand” brought her back into the race.\n\t\n\t\tWunmi Mosaku snubbed for “Sinners”\t\n\n\tDespite being the beating heart of the hit vampire movie and a Gothams win, Mosaku didn’t earn a supporting nod.\n\t\n\t\tPodcasts: Nothing incendiary was fêted\t\n\n\tIt was surprising that Joe Rogan didn’t get a nom, given his ubiquity in the medium. And Ben Shapiro’s advertising campaign didn’t change hearts or minds, leaving a relatively innocuous group of nominees.\n\t\n\t\t“Blue Moon” earned a best motion picture nod\t\n\n\tWhile star Ethan Hawke has been surging to the top of the acting field for his work in “Blue Moon,” the film itself hadn’t yet received the same amount of attention as his work.\n\t\n\t\tRachel Sennott didn’t make the cut\t\n\n\tThe Globes love a rising star, but Sennott’s work on “I Love LA” didn’t draw that attention.\n\t\n\t\t“KPop Demon Hunters” gets a nod for box office achievement…without even a proper box office release\t\n\n\tNetflix had a victory lap sing-along release, but that doesn’t really count, does it?\n\t\n\t\tKatherine LaNasa and Shawn Hatosy snubbed for “The Pitt” after winning Emmys for their work on the show\t\n\n\tAny buzzy show with a big cast can leave deserving actors in the cold — it’s just surprising that it was these two actors.\n\t\n\t\tThe third “Knives Out” didn’t make the cut for best motion picture — musical or comedy\t\n\n\tWhile the first two films got the nod, “Wake Up Dead Man” was completely snubbed.\n\t\n\t\t“The Girlfriend” arrives out of nowhere\t\n\n\tThe Amazon Prime Video limited series was barely discussed by pundits this season, and yet the show itself and star Robin Wright both received nominations.\n\t\n\t\tAshley Walters gets a spot for “Adolescence”\t\n\n\tObviously not the showiest role on a show full of great performances, but Walters did soulful work that’s worthy of a nom.\n\t\n\t\tWhy are there so many mispronounced names EVERY year?\t\n\n\tMarlon Wayans, we love you, but c’mon! Rehearse! \n\n\tVariety parent company Penske Media Corporation owns Golden Globes producer Dick Clark Prods. in a joint venture with Eldridge.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Golden Globes Snubs and Surprises: Jacob Elordi and ‘Demon Hunters’ Soar While ‘Wicked,’ ‘Superman’ and Sydney Sweeney Left Cold",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/Golden-Globes-Snubs-and-Surprises.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-08T14:14:36.000Z",
      "dateModified": "2025-12-08T14:14:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Brendan Fraser and Dwayne Johnson on Their Life-Changing ‘Mummy’ Friendship, Loneliness and Learning to Stop Trying So Hard: ‘Why Am I Doing This?’",
    "url": "https://variety.com/2025/film/news/dwayne-johnson-brendan-fraser-mummy-friendship-1236598846/",
    "image": "https://variety.com/wp-content/uploads/2025/12/Dwayne-Johnson-and-Brendan-Fraser-Variety-CNN-Actors-on-Actors.jpg?crop=0px%2C67px%2C1200px%2C674px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-12-08T14:00:00.000Z",
    "description": "\n\tDwayne Johnson and Brendan Fraser first met making “The Mummy Returns.” The 2001 sequel continued Fraser’s burgeoning leading-man career, but it was",
    "body": "\n\tDwayne Johnson and Brendan Fraser first met making “The Mummy Returns.” The 2001 sequel continued Fraser’s burgeoning leading-man career, but it was the first ever film role for Johnson, then better known as WWE’s The Rock. In recent years, both actors have enjoyed festival acclaim (and lengthy standing ovations). “Rental Family,” Fraser’s first leading role after winning an Oscar for “The Whale” in 2023, tasks the star with playing an actor in Tokyo helping people to feel human connection, and drew tears at its Toronto premiere. And “The Smashing Machine,” starring Johnson as real-life MMA athlete Mark Kerr, earned tearful rounds of applause at Venice and Toronto.\n\t\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tAlexi Lubomirski for Variety\n\t\n\n\n\n\tBrendan Fraser: Hi, Dwayne.\n\n\n\tDwayne Johnson: Good to see you, brother. I’d love to start off our conversation by giving you flowers. OK? I’m going to deliver a lot of flowers to your doorstep right now. You and I first connected on “The Mummy Returns.” That was one of the biggest franchises in the world at that time. I was ready to make my transition into Hollywood. And there was a moment where you could have said, “This guy, Dwayne Johnson, he’s never acted before; he’s in pro wrestling.” The word I got back was, “Brendan loves the idea. He welcomed you with open arms.” It meant something to me, because you took a risk on me, and years later, you and I are sitting here. I want to thank you for really changing my life.\n\n\tFraser: You’re too kind, Dwayne. You were always the right guy for the job. When I was told that you were a possibility for it, forgive me, but I didn’t know you from the wrestling world. And when I was shown, I said, “That is inspired casting. We’d be lucky to get the guy.” You need a stadium persona to play a villain you love to hate. It’s going to take a lot of confidence and belief. In the wrestling world, you were painting with a 10-inch brush — you need to have big energy.\n\t\n\n\tAnd your paintings are getting better all the time. I’ve seen “The Smashing Machine.”\n\n\tJohnson: I know. Thank you for all the support. This was my first foray into this level of drama, and I was running toward this opportunity. I get to the Toronto Film Festival and the film ends and the audience is clapping, and we’re getting whisked onstage. Who was right there, and actually stepped in the line of traffic to stop me? It was you, with the biggest smile and the biggest hug.\n\n\tFraser: You nailed it, dude. You got me in the feels. Not only the physical pain, which was formidable — and I know Dwayne’s a big, strong guy, but hard knocks hurt — but that’s not the real pain that you had in that role.\n\n\tJohnson: That’s right.\n\n\tFraser: That guy was accustomed to getting hurt. It’s what he did for a living, right? But the real pain was the emotional stuff.\n\n\tJohnson: The insides.\n\n\tFraser: Do you ever feel like, “It’s OK, you can throw me off the back of a moving vehicle or light me on fire or knock the crap out of me all afternoon; just don’t say anything mean to me, because that’ll really hurt.” That’s the vulnerability. I understand what it’s like to be the guy who’s not allowed to show that pain.\n\n\tJohnson: You do know that.\n\n\tFraser: To a lesser degree, I’m sure, than yourself. But look, we’re human. And at the end of the day, you’re going to need an ice bag, maybe a cup of chamomile tea and someone to kiss you on the forehead and say it’s going to be OK.\n\n\tJohnson: Brendan, you’re a big guy. You’re a very big man. And there’s a big presence to you, where for years, you weren’t allowed to reveal it. When was the turning point where you went, “You know what? I want to perform now for an audience of one — for me.”\n\n\tFraser: There comes a point where you fall apart. And I guess around 2007 or ’08 or ’09, around there, I was doing a movie in Sault Ste. Marie, Ontario — it was a low-budget thing, and we were rolling around in streams and off of mountains, making stuff up as we go along. And I was playing hurt but pretending that I wasn’t. The movie ended and I thought, “I’m getting too old for this shit. It’s starting to catch up with me. If I’m going to continue, I have to have a real reckoning with myself about why I am getting banged around and bruised.” I had to actually ask myself a serious question that I’d been avoiding: Why am I doing this? I had to take ownership of the reason, and that was [that] I was trying too hard.\n\t\n\n\tJohnson: Yes.\n\n\tFraser: I was feeling like, unless it hurts, then I’m not earning my keep. That idea is what I saw in your work in “The Smashing Machine,” because we feel for the supposedly invulnerable titan. But how do you bring them down with just a minor injury that takes them apart? Not allowing oneself to be vulnerable publicly — the stoicism seems harder than the loss. That was when I went, “Oh, man, Dwayne, you’ve done it.”\n\n\tJohnson: There’s this great quote from Floyd Patterson, who was this heavyweight. I’m paraphrasing here, but he says, “When you win, what a walk going back to the locker room! You take it all in. But if you lose,” he goes, “Man, I wish there was a trap door in the ring, where I could just fall into the earth and disappear and never have to do that again.” There was a connection to my life — things could be so loud and noisy in our world, but at the same time, we can feel lonely. We can feel alone.\n\n\tFraser: Loneliness is a public health concern, I believe. In “Rental Family” …\n\n\tJohnson: You deal with that, right? With loneliness?\n\n\tFraser: The character, Philip, does deal with that. He’s got such solitude in such a busy, populous place. You’ve been to Tokyo, and you know it’s a beehive of activity. But the instances of suicides and people bereft of connection are too high. And that’s why a “rental family” agency exists and did since the 1980s. Seriously — there’s like 300 agencies. People feel a need for connection in a meaningful way, even if it’s make-believe. Even if it’s only for a little while and you’re paying for it. Loneliness seems like a simple enough thing to ameliorate, but until you really feel it, you’re not going to know exactly what it can do to you.\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tAlexi Lubomirski for Variety\n\t\n\n\n\n\tJohnson: You just have to feel it and experience it. Right. You provided peace — that peace is something we all look for. One of the moments that rocked me was Kikuo, the character in the film, an older gentleman—\n\n\tFraser: Akira Emoto-san is [the actor’s] name.\n\n\tJohnson: He’s a legend.\n\n\tFraser: He’s like the Japanese Ian McKellen.\n\n\tJohnson: How is he to work with?\n\n\tFraser: Incredible. He has his own theater, a black-box theater in Tokyo, and he lives on the floor above. Every morning at eight a.m., he has a free performance that he gives — of anything. He’ll read something from a play, or some piece of obscure text. One morning I went, he was reading this 15th-century shogun’s shopping list.\n\t\n\n\tJohnson: Wow.\n\n\tFraser: A certain amount of bushels of wheat, and the peasants are acting up again — and he’s performing it in this classical form of Japanese that even Japanese people are going, “What did he say?”\n\n\tJohnson: Was there a different tone and intonation?\n\n\tFraser: I don’t know enough about the language, but it’s the difference between you and I speaking right now and “Henry V.”\n\n\tJohnson: You feel his power onscreen. I loved the relationship between you two. And I’m dealing with dementia in our family, so I loved this idea that you want to create this moment for him, even if he’s going to forget it, to give him this peace, take him home. What you say to him rocked me, because it’s what I said to my dad. It’s your version of “I’ll see you again, my friend.” It just moved me. I was getting emotional — I was crying! And I loved the relationship you had with the little girl.\n\n\tFraser: Shannon [Mahina] Gorman is her name. Her mother is Japanese, her father is Irish. And that’s the dynamic of who she is written to be — because she’s the daughter of a single mother. Whoever her father is, he’s just not in the picture. But he was Caucasian. So she feels trapped between worlds.\n\n\tShannon showed up to the rehearsal with an explanation of what it felt like to be made to feel other. She said, “I’ve been bullied.” And that can be biting, because you’re not “Japanese enough.” Or you’re not “white enough.” She showed up at this movie with all of this emotional bandwidth. It was so available, that we had to stop rehearsing, because we didn’t want to play our game in the locker room.\n\n\tJohnson: Yes. Go out on the field.\n\n\tFraser: “Just point the camera at the kid and we’re good! Just give Brendan a Red Bull.”\n\n\tJohnson: The movie’s amazing, but the conceit of it is so unique and different. How did the script come to you?\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tAlexi Lubomirski for Variety\n\t\n\n\n\n\tFraser: I was just looking for a job, man. It’s all in the title: “Rental Family”? Insert pejorative, cheeky joke here. But it piques your interest. And that’s what this director, Hikari, embraces. She goes toward the prickly side of what that could mean, along with the softer side. The movie lives in between — it’s not cynical. I needed to find something like that.\n\t\n\n\tJohnson: Why did you need something like that? I’m curious.\n\n\tFraser: It was before the Oscars. I saw the script first before the Oscars. Not that that changed — believe me, it doesn’t change much of anything.\n\n\tJohnson: You still would’ve done it, right?\n\n\tFraser: Yes, absolutely. But I’m still the same guy. I was looking for a job, and I wanted something that was out of the ordinary. I wanted to not jump into something splashy and huge. I wanted to be challenged by working with what I’ve got.\n\n\tJohnson: After your Oscar win, did you feel anything shift? Did it allow you to look at things maybe a little deeper, or look at material differently? Did it give you a different kind of desire to challenge yourself?\n\n\tFraser: I think of it two ways. On the one hand, “You better earn this. You got the brass ring but be worthy of it going forward. Uphold the standard if you can.” But also, I felt like I don’t have anything to prove. But that doesn’t mean I’m going to just coast.\n\n\tJohnson: It’s not like you’re not hungry.\n\n\tFraser: If anything, I feel like I have to work.\n\n\tJohnson: Hungrier. When I saw you win — and I’ve known you a long time — I thought, “Oh, if you think he’s not going to be hungry anymore, that is not him. You’ve made him hungrier.” And then, the idea of, “Hey, you’ve got to be worthy of this.”\n\n\tFraser: Like you, I’m in it for the long haul. Most actors, the secret is, we would be doing this whether they paid us or not. I love it. And you have to take ownership of who you are, what you’re capable of, and have the courage to continue.\n\n\tJohnson: You brought up the idea of “I felt like I didn’t need to prove anything anymore”? Had you felt that before —\n\n\tFraser: I had everything to prove. I knew I was a capable actor, and I had plenty of bumps in the road along the way, but that’s just the way it goes. And maybe it was a perfect storm of when “The Whale” was shot: It was during COVID. It was one room. It was a man encumbered by a health condition that caused his body to be so overweight that he was confined to a single place. What Darren Aronofsky directed was a movie that made us all feel — because it was when we were all locked down — that we were all under existential threat. This might be the last time we ever get to do this.\n\t\n\n\tJohnson: So it had that energy.\n\n\tFraser: “If I’m going to do this, I’m going to go down swinging. I’m going to give it everything I’ve got.” When I finished, I felt like, “Well, I am all out of moves. If it doesn’t land, I guess I’ll crack open the Yellow Pages and go look for a marketing job or something. I really don’t know what the hell I’m doing.” And that was the first time in my career that I felt like I left it all out there.\n\n\tI owe you a debt of gratitude because when I took “The Whale” with Darren and the crew to Venice, and they applauded for a very long time and stayed on their feet — I’d never been there before. I didn’t know the whole ritual of it.\n\n\tJohnson: I was in tears when I watched you.\n\n\tFraser: I know! And you put your shoulder into that by showing your support through Twitter. Dwayne, you’re a godfather of sorts of the success of that project. Thank you for that.\n\n\tJohnson: Look, I’m happy to support you. But also, that moment rocked me and it moved me. I had not experienced Venice until “Smashing Machine.” I’ve watched it from afar. And then I see this long applause for you. You’re emotional; I’m emotional watching you get emotional. But I felt such joy for you because I felt like that’s what you work for. The other stuff that comes our way — if it does well, great. If it flops, OK, we move on. But that ceremonial applause for something that you ripped yourself open and you went elsewhere — I was so happy for my friend and even more inspired. I want to do that. I want to find that role.\n\n\tFraser: I felt like I was in an out-of-body experience. It felt like the fulfillment of a dream I would never have admitted to having. What happened when the shoe was on the other foot with the reception for “The Smashing Machine”? Where did it take you?\n\n\tJohnson: I was living my dream; not others’ dreams. These other projects, which I love doing, there’s a lot of other entities connected to them. “Smashing Machine” was just me, Benny Safdie and Emily Blunt. That was my exhale. I felt like I’d never exhaled like that in my career. Like, Wow. We did it.\n\n\tFraser: Did you compare it to everything you’ve done prior? I found myself thinking, “All right, for all these movies I made, some might’ve been crap, some were good, [but] all of them brought you to this point.”\n\t\n\n\tJohnson: That’s right. Every single thing I’ve done has led to this moment.\n\n\tThis is a conversation from Variety and CNN’s Actors on Actors. To watch the full video, go to CNN’s streaming platform now. Or check out Variety’s YouTube page at 3 p.m. ET today.\n\n\t\n\t\tProduction: Emily Ullrich; Agency: Nevermind Agency\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Brendan Fraser and Dwayne Johnson on Their Life-Changing ‘Mummy’ Friendship, Loneliness and Learning to Stop Trying So Hard: ‘Why Am I Doing This?’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/Dwayne-Johnson-and-Brendan-Fraser-Variety-CNN-Actors-on-Actors.jpg?crop=0px%2C67px%2C1200px%2C674px&resize=1000%2C563"
      ],
      "datePublished": "2025-12-08T14:00:00.000Z",
      "dateModified": "2025-12-08T14:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Piers Morgan Teams With WME to Expand ‘Uncensored’ Operations, Seeks $30 Million",
    "url": "https://variety.com/2025/tv/news/piers-morgan-wme-expand-uncensored-seeks-30-million-1236602922/",
    "image": "https://variety.com/wp-content/uploads/2022/05/Piers-Morgan.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-08T14:35:00.000Z",
    "description": "\n\tPiers Morgan isn’t exactly an upstart in the media world, but he’s acting as if he’s got the mojo of a young digital influencer.\n\n\tThe former Daily ",
    "body": "\n\tPiers Morgan isn’t exactly an upstart in the media world, but he’s acting as if he’s got the mojo of a young digital influencer.\n\n\tThe former Daily Mirror editor, “Good Morning Britain” co-anchor and CNN host is launching Uncensored, a network of what he expects will be a series of verticals across different topics — including his own “Piers Morgan Uncensored” series — that will assemble a group of smart creators under a single banner.\n\t\n\n\t“Expect fresh perspectives delivered with the social media savviness, quality production, and journalistic rigor which makes ‘PMU’ a smash hit,” Morgan said in a statement. “This is the next step in the Uncensored evolution.”\n\n\n\t“Piers Morgan Uncensored” has amassed more than 4 million YouTube subscribers in less than three years, according to people familiar with the host’s operations. The show averages a little under 800,000 audio and video listens and views per episode. Soon, Morgan will launch “History Uncensored,” which will be hosted by Bianca Nobilo, a former anchor for CNN’s international programming who left the company in 2024. The new series will be available on YouTube and as a podcast on a weekly basis.\n\n\tThe show aims to re-examine history and call into question interpretations of past events. “We’ll challenge distortion, question official narratives, and uncover what’s been buried or conveniently forgotten,” said Nobilo, in a statement. ” It’s about curiosity, debate, and discovery — the thrill of finding out what really happened and why it still matters.”\n\n\n\n\n\tAs more journalists and personalities leave traditional media for their own digital ventures, one big question has continued to surface: Can all of these people make money with their own individual businesses? Morgan’s new push offers a solution: bundling.\n\t\n\n\tJust as traditional media outlets are striking deals that make disparate networks or streamers available via a single subscription, so too are efforts afoot to bring specific digital creators together and, hopefully, create an entity that is greater than the sum of its parts. Puck, a content company that specializes in news tied to media, politics, fashion and sports, offers a group of individual newsletters for a single price, for example.\n\n\tMorgan’s “Uncensored” intends to launch verticals tied to subjects including long-form interviews, sports, true crime, and royals, among others — all to debut in months to come. Morgan has been working with WME, one of the industry’s top talent agencies, to build his business. WME will work alongside Morgan’s business manager, Alan S. Goldman of Gelfand, Rennert & Feldman, and Alex Campbell, executive editor of Uncensored. The move represents a homecoming, of sorts. Morgan had been represented by WME for years, but left in 2009 when his longtime agent, John Ferriter, parted ways with the firm. Ferriter passed away in 2019.\n\n\tIn recent months, WME has helped launch several new creator-focused ventures for recognizable journalists including Oliver Darcy, Jen Rubin, Joy Reid and Jim Acosta. The agency also works with Katie Couric, Ezra Klein, Aaron Parnas, V. Spehar, Alex Heath, Derek Thompson, Dave Jorgensen, Jennifer Welch and Angie “Pumps” Sullivan.\n\n\tMorgan and his colleagues are working with The Raine Group, an investment bank that specializes in the media sector, on a $30 million fundraising round that will value the company at about $130 million, according to people familiar with the business. Investors in “Uncensored” include Raine’s venture fund; Antenna Group’s Theo Kyriakou; and family offices. Joe Ravitch, a Raine partner and co-founder, will join the board of “Uncensored,” and will oversee the fundraising round with Erik Hodge, a Raine partner, according to people familiar with the matter. \n\n\tMichael Kassan, a longtime consultant who works with the advertising and media industries and runs 3C Ventures, is advising Uncensored on brand and partnership strategy and is considering an investment, these people said. \n\n\t“Piers Morgan Uncensored” was originally launched in a venture with the Murdoch family’s News Corp. in 2022. Morgan took ownership of the venture earlier this year. During the program’s tenure, he has interviewed notables including President Donald Trump, Cristiano Ronaldo and Kanye West. \n\t\n\n\tThe new history program “is just the first step in the growth of our brand, so watch this space,” Morgan said.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Piers Morgan Teams With WME to Expand ‘Uncensored’ Operations, Seeks $30 Million",
      "image": [
        "https://variety.com/wp-content/uploads/2022/05/Piers-Morgan.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-08T14:35:00.000Z",
      "dateModified": "2025-12-08T14:35:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Paul Dano Joins Cast of Florian Zeller’s Psychological Thriller ‘Bunker’ (EXCLUSIVE)",
    "url": "https://variety.com/2025/film/global/paul-dano-florian-zeller-thriller-bunker-1236603085/",
    "image": "https://variety.com/wp-content/uploads/2025/11/paul-dano.jpg?w=1000&h=562&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-08T14:19:25.000Z",
    "description": "\n\tPaul Dano has landed his next big project. The actor will star in “Bunker,” an elevated psychological thriller from Oscar-winning filmmaker Florian ",
    "body": "\n\tPaul Dano has landed his next big project. The actor will star in “Bunker,” an elevated psychological thriller from Oscar-winning filmmaker Florian Zeller.\n\n\tDano, known for his performances in “There Will Be Blood,” “The Batman” and “The Fabelmans,” has joined the star-studded ensemble of “Bunker,” led by Javier Bardem and Penelope Cruz, alongside Stephen Graham and Patrick Schwarzenegger. The actor, who’s been loved-bombed by his Hollywood peers since Quentin Tarantino called him “the worst fucking actor in SAG,” recently presented “The Wizard of the Kremlin” in which he stars as spin-doctor Vadim Baranov.\n\t\n\n\tCurrently in its second week of filming, “Bunker” marks Zeller’s hotly anticipated follow up to “The Son” which competed at Venice and earned Hugh Jackman a best actor nomination at the Golden Globes; and “The Father” which won best actor for Anthony Hopkins and best adapted screenplay (for Christopher Hampton and Zeller) at the Oscars.\n\n\n\t“Bunker” explores the unraveling of a family as a mysterious construction project — a bunker commissioned by a powerful tech mogul — begins to infiltrate their lives. The movie is already positioned as one of 2026’s standout projects. Zeller, a celebrated playright-turned-filmmaker, has guided actors to deliver career-high performances in his first two movies, from Hopkins in “The Father” to Jackman in “The Son.” “Bunker,” which Zeller also penned, also promises to showcase his signature blend of emotional rigor and haunting atmosphere.\n\n\t“We are thrilled to welcome Paul Dano to the cast,” said Zeller. “From ‘Little Miss Sunshine’ to ‘There Will Be Blood,’ Paul has consistently impressed me as an actor. He possesses an extraordinary singularity — something genuinely unique — and in that sense, he is truly irreplaceable.”\n\t\n\n\tThe film is produced by Blue Morning Pictures, which is part of Mediawan, and MOD Producciones. “Bunker” is being shot between Madrid and London. International sales are handled by FilmNation Entertainment with CAA Media Finance and WME Independent handling domestic rights.\n\n\tBlue Morning Pictures’ Federica Sainte-Rose is producing alongside Fernando Bovaira and Simon de Santiago of MOD Producciones. Alice Dawson also serves as a producer on the film. Mariano Cohn, Gaston Duprat, Andres Duprat, Emanuel Nunez and Fernando Sokolowicz are executive producers. \n\n\tZeller praised Cohn and Duprat as “incredibly inventive and talented filmmakers, for whom (he holds) a deep artistic admiration.” “Their film ‘El hombre de al lado’ was a source of inspiration for me while writing ‘Bunker,'” Zeller continued.\n\n\tDano is represented by WME, Anonymous Content, Relevant and Goodman, Genow, Schenkman, Smelkinson & Christopher.\n\n\tZeller is represented by CAA and Adequat in France, as well as attorneys Carlos Goodman and Mitch Smelkinson at Goodman Genow Schenkman Smelkinson & Christopher.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Paul Dano Joins Cast of Florian Zeller’s Psychological Thriller ‘Bunker’ (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/paul-dano.jpg?w=1000&h=562&crop=1"
      ],
      "datePublished": "2025-12-08T14:19:25.000Z",
      "dateModified": "2025-12-08T14:19:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Paramount Launches Hostile Takeover Bid for Warner Bros. Discovery Valued at $108 Billion, Seeking to Derail Netflix’s Deal",
    "url": "https://variety.com/2025/tv/news/paramount-hostile-takeover-bid-warner-bros-discovery-1236603175/",
    "image": "https://variety.com/wp-content/uploads/2025/10/Ellison-Zaslav.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-08T14:14:20.000Z",
    "description": "\n\tDavid Ellison is not going away quietly in his quest to land Warner Bros. Discovery.\n\n\tOn Monday, Ellison’s Paramount Skydance announced it has comm",
    "body": "\n\tDavid Ellison is not going away quietly in his quest to land Warner Bros. Discovery.\n\n\tOn Monday, Ellison’s Paramount Skydance announced it has commenced an all-cash tender offer to acquire all of the outstanding shares of WBD for $30 per share — the same terms it offered in a Dec. 4 bid submitted to the Warner Bros. Discovery’s board. Paramount’s proposed transaction is for the entirety of Warner Bros. Discovery, including the TV business with CNN, TBS, TNT and other networks.\n\t\n\n\tParamount’s announcement, taking its bid directly to WBD shareholders, comes after Netflix and Warner Bros. Discovery revealed their binding agreement Friday under which Netflix would buy Warner Bros.’s studio operations, HBO and HBO Max for $72 billion (with an enterprise value of $82.7 billion).\n\n\n\tAccording to Paramount, its all-cash offer equates to an enterprise value of $108.4 billion (including assumption of debt) with an equity value of $77.9 billion. In contrast, the Netflix proposal entails “a volatile and complex structure” valued at $27.75/share in a mix of cash ($23.25) and stock ($4.50), subject to collar and the future performance of Netflix, equating to an enterprise value of $82.7 billion (excluding the TV biz), per Paramount.\n\n\tParamount said its deal offer for WBD would close within 12 months, compared with Netflix’s projected 12-18 months for completing its deal. WBD is required to respond to Paramount Skydance’s $30/share offer in 10 business days. Paramount’s tender offer, which was approved unanimously by its board, is scheduled to expire at 5 p.m. ET on Jan. 8, 2026, unless the offer is extended.\n\t\n\n\t“Our proposal is superior to Netflix in every dimension,” Paramount Skydance CEO David Ellison said on a call Monday morning with analysts and investors.\n\n\tParamount Vows to Release More Than 30 Films Theatrically as It Launches Hostile Takeover Bid for Warner Bros. Discovery\n\n\t“Paramount’s strategically and financially compelling offer to WBD shareholders provides a superior alternative to the Netflix transaction, which offers inferior and uncertain value and exposes WBD shareholders to a protracted multi-jurisdictional regulatory clearance process with an uncertain outcome along with a complex and volatile mix of equity and cash,” Paramount said in announcing the hostile takeover maneuver.\n\n\tParamount’s $30/share offer is backed by $40.7 billion in capital from Oracle co-founder Larry Ellison, David Ellison’s father, and RedBird Capital Partners — both of which put in the money for Skydance Media’s acquisition of Paramount Global.\n\n\tParamount’s offer for WBD as of Dec. 1 also included an aggregate $24 billion in backing from the sovereign wealth funds of Saudi Arabia, Qatar and Abu Dhabi, according to an SEC filing by the company. Variety had previously reported the the three funds were part of the latest bid.\n\n\tParamount’s offer also is backed by Affinity Partners, the investment company formed by Jared Kushner, who is Donald Trump’s son-in-law, according to the filing. In addition, Paramount said its WBD bid will be financed in part by $54 billion in debt commitments from Bank of America, Citi and Apollo Global Management.\n\n\tAccording to Paramount’s deal terms to WBD, the three Middle Eastern sovereign wealth funds (Saudi Arabia, Qatar and Abu Dhabi) and Kushner’s Affinity Partners “have agreed to forgo any governance rights — including board representation — associated with their non-voting equity investments.” As such. according to Paramount, the deal “will not be within CFIUS’s jurisdiction,” a reference the Committee on Foreign Investment in the United States, which is the U.S. government’s interagency body that reviews foreign investments in U.S. businesses potential national security risks.\n\n\tDavid Ellison previously submitted three bids for WBD, starting with a $19/share offer in Sept. 14, then $22/share on Sept. 30 and $23.50/share on Oct. 19, which comprised 80% cash and 20% stock. The Warner Bros. Discovery board rejected all three offers. Paramount Skydance then submitted an all-cash bid of $26.50/share on Dec. 1 followed by the $30/share on Dec. 4, but the board of WBD selected Netflix’s as the buyer for WB and HBO Max. \n\t\n\n\tOn the call Monday, Ellison said that Warner Bros. Discovery did not respond at all to Paramount Skydance’s Dec. 4 offer of $30/share in cash.\n\n\tThe Paramount offer for the entirety of WBD provides shareholders is $18 billion higher than the Netflix proposal — and Paramount alleged that the WBD board’s recommendation of the Netflix transaction over Paramount’s offer is based on “an illusory prospective valuation” of the WBD TV networks entity, to be called Discovery Global, that is “unsupported by the business fundamentals and encumbered by high levels of financial leverage assigned to the entity.” Paramount asserts that WBD’s Discovery Global entity should be valued at $1/share, whereas WBD estimates the TV company is worth $3 to $4 per share.\n\n\tReps for Warner Bros. Discovery did not immediately respond to requests for comment. Netflix declined to comment.\n\n\tIn his previous bids, Ellison had proposed offering WBD chief David Zaslav a co-chairman and co-CEO role in a merged Paramount Skydance-WBD; it’s not known if that’s still on the table in Paramount’s latest offer.\n\n\tEllison, chairman and CEO of Paramount, said in a statement Monday: “WBD shareholders deserve an opportunity to consider our superior all-cash offer for their shares in the entire company. Our public offer, which is on the same terms we provided to the Warner Bros. Discovery Board of Directors in private, provides superior value, and a more certain and quicker path to completion. We believe the WBD Board of Directors is pursuing an inferior proposal which exposes shareholders to a mix of cash and stock, an uncertain future trading value of the Global Networks linear cable business and a challenging regulatory approval process. We are taking our offer directly to shareholders to give them the opportunity to act in their own best interests and maximize the value of their shares.”\n\n\tParamount said WBD shareholders can find additional information about the Paramount proposal at strongerhollywood.com.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Paramount Launches Hostile Takeover Bid for Warner Bros. Discovery Valued at $108 Billion, Seeking to Derail Netflix’s Deal",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/Ellison-Zaslav.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-08T14:14:20.000Z",
      "dateModified": "2025-12-08T14:14:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "University Student Stabbed to Death Celebrating End of Semester in England",
    "url": "https://www.tmz.com/2025/12/08/henry-nowak-student-stabbed-death-england/",
    "image": "https://imagez.tmz.com/image/17/16by9/2025/12/08/1772148932cd47ee96a018da7b721f2c_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-12-08T15:19:54.000Z",
    "description": "\n    \n                    \n                          England\n                          First-Year Student Fatally Stabbed ...\n                        ",
    "body": "\n    \n                    \n                          England\n                          First-Year Student Fatally Stabbed ...\n                          Celebrating Semester's End\n                      \n                  \n                        Published December 8, 2025 7:19 AM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Tragedy in England -- a teenage boy went out to celebrate wrapping his first semester of college ... but, heartbreakingly, he never made it home.\n      \n    \n          According to Hampshire and Isle of Wight Constabulary, 18-year-old Henry Nowak was walking along the southern coast of England on Wednesday -- about an hour and a half southwest of London -- when he got caught up in an altercation with two men he didn’t even know ... leading to a fatal stabbing.\n      \n    \n          Henry suffered a puncture wound to his chest and two more to the back of his leg ... and was tragically pronounced dead at the scene.\n      \n\n          In a statement, Henry’s family said he was an all-around top lad loved by everyone -- out with his football teammates celebrating the end of his first semester studying accounting and finance at Southampton College.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Authorities say two men, ages 22 and 26, are now in custody on suspicion of murder in connection with Nowak’s death.\n      \n    \n          Cops also arrested a 51-year-old man on suspicion of murder -- he’s since been released on bail -- while a 52-year-old woman remains in custody on suspicion of assisting an offender. The investigation is ongoing.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Weapons & Guns\n              \n                          \n                Arrests\n              \n                          \n                Crime\n              \n                          \n                News\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "University Student Stabbed to Death Celebrating End of Semester in England",
      "image": [
        "https://imagez.tmz.com/image/17/16by9/2025/12/08/1772148932cd47ee96a018da7b721f2c_xl.jpg"
      ],
      "datePublished": "2025-12-08T15:19:54.000Z",
      "dateModified": "2025-12-08T15:19:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Marjorie Taylor Greene Clashes With Lesley Stahl Over Political Toxicity",
    "url": "https://www.tmz.com/2025/12/08/marjorie-taylor-greene-argues-lesley-stahl-toxic/",
    "image": "https://imagez.tmz.com/image/8d/16by9/2025/12/08/8df37913aa9644fe95ae37ab873de599_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-12-08T13:50:05.000Z",
    "description": "\n    \n                    \n                          Marjorie Taylor Greene\n                          Politics Are Toxic And So Is My '60 Minutes' Int",
    "body": "\n    \n                    \n                          Marjorie Taylor Greene\n                          Politics Are Toxic And So Is My '60 Minutes' Interview!!!\n                      \n                  \n                        Published December 8, 2025 5:50 AM PST\n                                                                      |\n                Updated December 8, 2025 7:26 AM PST\n                                    \n      \n    \n      \n        \n                    \n                  \n      \n                    CBS\n          \n    \n          Marjorie Taylor Greene got into a heated back-and-forth with \"60 Minutes\" journalist Lesley Stahl as both accused each other of fueling the current toxic political environment.\n      \n    \n          The Georgia congresswoman sat down with Stahl for a wide-ranging interview, during which they turned to the subject of Green apologizing on CNN three weeks ago for taking part in the toxic culture.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Greene explained that American politics has become the most toxic it's ever been ... prompting Stahl to say \"you contributed to that\" and slamming Greene for \"insulting people.\"\n      \n\n          Greene hit back, saying Stahl also contributed to the toxicity for being accusatory. The two then argued over accusing each other -- and it gets pretty heated between them before it finally dies down.\n      \n    \n          At another point in the interview, Greene claimed Trump \"directly fueled\" death threats after he called her a traitor for breaking with MAGA after years of being a loyalist.\n      \n    \n          As you know, Greene has been publicly criticizing Trump since she broke with him last month, mainly over the release of the \"Epstein Files.\" Greene -- a staunch Republican -- recently announced she was resigning from Congress in January.\n      \n      \n              \n          \n                          \n                Marjorie Taylor Greene\n              \n                          \n                Interview\n              \n                          \n                Politix\n              \n                          \n                News\n              \n                          \n                Fights & Feuds\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Marjorie Taylor Greene Clashes With Lesley Stahl Over Political Toxicity",
      "image": [
        "https://imagez.tmz.com/image/8d/16by9/2025/12/08/8df37913aa9644fe95ae37ab873de599_xl.jpg"
      ],
      "datePublished": "2025-12-08T13:50:05.000Z",
      "dateModified": "2025-12-08T13:50:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jonathan Bailey Blamed Himself For Play Bombing When He Was 8",
    "url": "https://www.tmz.com/2025/12/07/jonathan-bailey-blamed-himself-for-theater-flop-as-child/",
    "image": "https://imagez.tmz.com/image/e8/16by9/2025/12/07/e8a88933246a4e5aa449c34992049d3b_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-12-08T01:05:55.000Z",
    "description": "\n    \n                    \n                          Jonathan Bailey\n                          I May Have Cursed on One of My First Projects!!!\n      ",
    "body": "\n    \n                    \n                          Jonathan Bailey\n                          I May Have Cursed on One of My First Projects!!!\n                      \n                  \n                        Published December 7, 2025 5:05 PM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Jonathan Bailey thought he'd single-handedly ruined a highly anticipated show when he was a child ... violating a theater superstition right before a memorable bomb.\n      \n    \n          The actor opened up about his foolish faux pas during an episode of \"Actors on Actors\" -- the popular Variety series where stars interview one another about their lives and careers.\n      \n    \n          Bailey told Superman himself, David Corenswet, he took part in the 1996 show \"Les Enfants du Paradis\" helmed by \"Four Wedding and A Funeral\" actor Simon Callow ... and, before the show, Jonathan says he said the word \"Macbeth.\"\n      \n\n          If you don't know ... there's an old acting susperstition which prohibits actors from saying the play title \"Macbeth\" in a theater -- with allegedly dire consequences if they do.\n      \n    \n          In true ghostly fashion, the show tanked -- and, Bailey says his chaperone told him he played a part its unfortunate end. He jokes he even thought he killed the beloved Royal Shakespeare Company as a result.\n      \n    \n          Obviously, it's all just a silly superstition ... and, Bailey's career hasn't suffered too much because of his mistake -- since he's receiving pretty much universal praise for his performance as Fiyero in \"Wicked\" and its sequel \"Wicked: For Good.\"\n      \n    \n          Still, Bailey may want to watch his words going forward ... 'cause you never knew which witches might be listening 👀.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                You Might Want to Rethink\n              \n                          \n                Movies\n              \n                          \n                Controversial S#!T\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jonathan Bailey Blamed Himself For Play Bombing When He Was 8",
      "image": [
        "https://imagez.tmz.com/image/e8/16by9/2025/12/07/e8a88933246a4e5aa449c34992049d3b_xl.jpg"
      ],
      "datePublished": "2025-12-08T01:05:55.000Z",
      "dateModified": "2025-12-08T01:05:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Brookelyn Cuts Through Winter Cold with Hot Shots",
    "url": "https://www.tmz.com/2025/12/07/brookelyn-hot-shots/",
    "image": "https://imagez.tmz.com/image/9b/16by9/2025/12/07/9b22f5ed53be45b5a3cb363b73ac5bc1_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-12-08T01:57:36.000Z",
    "description": "\n    \n                    \n                          Brookelyn\n                          Every Rose Tattoo Has It's Thorns ...\n                       ",
    "body": "\n    \n                    \n                          Brookelyn\n                          Every Rose Tattoo Has It's Thorns ...\n                          Check Out the One on My Thigh!!!\n                      \n                  \n                        Published December 7, 2025 5:57 PM PST\n                                                                            \n      \n    \n      \n        \n              \n    \n    \n          Brookelyn might've melted her last name ... because the mononymous model's so hot she doesn't need to use her full government moniker.\n      \n    \n          The sizzling star boasts nearly 1 million followers on Instagram and regularly posts bikini shots like the one above to show off her generous curves.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          On top of her tiny swimsuits, Brookelyn's easily recognizable for the large rose tattoo on her right thigh ... which has us eyeing her through rose-tinted glasses for sure.\n      \n\n                  \n          \n                          \n                \n                                  \n      \n    \n          And, when she's not in a bikini, she's still not wearing much clothing ... just a tiny brown top that barely contains her chest -- so, we expect some fashionable looks as we get deeper into winter, too.\n      \n    \n          A rose by any other name smells just as sweet ... and, looks pretty damn good, too!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Social Media\n              \n                          \n                Summer/Beach\n              \n                          \n                Hot Bodies\n              \n                          \n                Models\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Brookelyn Cuts Through Winter Cold with Hot Shots",
      "image": [
        "https://imagez.tmz.com/image/9b/16by9/2025/12/07/9b22f5ed53be45b5a3cb363b73ac5bc1_xl.jpg"
      ],
      "datePublished": "2025-12-08T01:57:36.000Z",
      "dateModified": "2025-12-08T01:57:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Shocking Video Shows Mercedes-Benz Catapulting Over Traffic Before Crashing",
    "url": "https://www.tmz.com/2025/12/08/mercedes-benz-flies-over-cars-crashes/",
    "image": "https://imagez.tmz.com/image/6a/16by9/2025/12/08/6a76150aa0084ec29e4a1645c97fe7f6_xl.png",
    "tag": "Entertainment",
    "date": "2025-12-08T13:37:34.000Z",
    "description": "\n    \n                    \n                          High-Flying Car Crash\n                          See Mercedes-Benz Catapult Over Traffic On Video\n",
    "body": "\n    \n                    \n                          High-Flying Car Crash\n                          See Mercedes-Benz Catapult Over Traffic On Video\n                      \n                  \n                        Published December 8, 2025 5:37 AM PST\n                                                                      |\n                Updated December 8, 2025 6:49 AM PST\n                                    \n      \n    \n        \n                    \n                  \n      \n    \n          Terrifying video shows a Mercedes-Benz propelling over traffic in Romania before crashing into a pole — and the driver somehow survived with just a few broken bones.\n      \n    \n          The CCTV footage captured a portion of the car wreck last Wednesday in Oradea, a city in northwest Romania, and the dramatic video is now making the rounds in the international media.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          As you can see ... everything seems normal at first as a bus and several cars drive toward a roundabout. Suddenly, the Mercedes launches through the air over the vehicles, nearly clipping the roof of the bus before reportedly crashing into a utility pole near a gas station.\n      \n\n          Police told The Independent ... the Benz driver fell unconscious during a medical episode triggered by his diabetes.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          The news outlet said rescue workers had to free the 49-year-old man from his wrecked vehicle before rushing him to a hospital, where he was treated for several broken bones, yet he managed to avoid life-threatening injuries.\n      \n    \n          Cops reportedly suspended his license for 90 days and issued him a $365 fine.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Insane Videos\n              \n                          \n                Car Crashes\n              \n                          \n                Cars\n              \n                          \n                News\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Shocking Video Shows Mercedes-Benz Catapulting Over Traffic Before Crashing",
      "image": [
        "https://imagez.tmz.com/image/6a/16by9/2025/12/08/6a76150aa0084ec29e4a1645c97fe7f6_xl.png"
      ],
      "datePublished": "2025-12-08T13:37:34.000Z",
      "dateModified": "2025-12-08T13:37:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]