[
  {
    "title": "Guillermo del Toro Tells Bradley Cooper ‘I’ve Written 42 Screenplays’ but Only ‘Made 13 Movies’ as They Discuss Directing Struggles, ‘Frankenstein’ and ‘Is This Thing On?’",
    "url": "https://variety.com/2026/awards/features/bradley-cooper-guillermo-del-toro-frankenstein-casting-1236619230/",
    "image": "https://variety.com/wp-content/uploads/2025/12/Bradley-Cooper_Guillermo-del-Toro-Variety-Directors-on-Directors.jpg?crop=0px%2C59px%2C1200px%2C674px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-01-05T20:00:00.000Z",
    "description": "\n\tGuillermo del Toro is known for his painstakingly crafted tales of monsters and ghosts. But the Oscar-winning filmmaker recoils at being called a vi",
    "body": "\n\tGuillermo del Toro is known for his painstakingly crafted tales of monsters and ghosts. But the Oscar-winning filmmaker recoils at being called a visionary. “It’s not like you’re in a recliner with somebody feeding you grapes, going, ‘I see a castle,’” del Toro tells his friend Bradley Cooper when they meet in Variety’s midtown Manhattan studio.  \n\n\tThe point del Toro is making is there’s a lot of hard, unglamorous work that goes into bringing movies to life — from hiring the right actors to making decisions on the fly when budgets are tight and time is running short. His latest sumptuously produced epic, “Frankenstein,” is a project he struggled for decades to bring to the screen before Netflix agreed to greenlight a $130 million horror film where the creature (Jacob Elordi) is more sympathetic than his creator (Oscar Isaac). It’s a film that reflects del Toro’s own turmoil and pain.  \n\t\n\n\tCooper, who starred in del Toro’s 2021 film “Nightmare Alley,” sees his latest directorial effort, “Is This Thing On?,” as a similarly personal project. It’s the story of a middle-aged man (Will Arnett) who discovers a love for stand-up when his marriage collapses. It also gave Cooper a chance to show a deeper, more sensitive side of Arnett, a close friend famous for broadly comedic turns in “Arrested Development” and “The Lego Movie.”  \n\n\tBradley Cooper: I think Warren Beatty said this: Casting is plot. \n\n\tGuillermo del Toro: That’s a great way of putting it. I was talking about that the other day with Al Pacino. If you do Shakespeare and all of a sudden you cast a Hamlet in his 50s, that changes everything. \n\t\n\n\tCooper: You’ve been obsessed with “Frankenstein” since you were a kid. These characters have been gestating inside you. This idea of casting is plot — how does that relate to finding Oscar Isaac? \n\n\tDel Toro: When you read the book, Victor is a young, brilliant student. But I was fascinated by this idea of a person in their 30s who was stuck in their teens. The point of the character for me is that after his mother died when he was a child, he grew intellectually, he grew socially, but he stopped growing emotionally. Also, I wanted Oscar to not belong completely to the family of his father; I wanted him to be frowned upon because his skin was darker, his hair was unruly, and he had this fiery temperament. I wrote it for him.  \n\n\tYou came to “Is This Thing On?” after it was developed? \n\n\tCooper: But I rewrote it. And much like you, I wrote it for Will Arnett and Laura Dern and where they are in their lives. \n\n\tDel Toro: Both movies are strangely auto­­biographical. \n\n\tCooper: Don’t you think if we’re doing our jobs properly, everything’s autobiographical? \n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tBenedict Evans for Variety\n\t\n\n\n\n\tDel Toro: People say, “Oh, you identify with the creature.” In the past, yes. Now I identify with the creator. I’m the antagonist of my own story, as well as the protagonist. \n\n\tCooper: I know you, so I identify you throughout the film. \n\n\tDel Toro: That’s the biography.  \n\n\tYou operated the camera on your film? \n\n\tCooper: I did wind up operating the camera for the lion’s share of filming, which created an environment with the actors that was special. I was able to keep the flow going. \n\n\tDel Toro: Did you talk to them from behind the camera?  \n\n\tCooper: I would shout lines or ask them to explore something. \n\n\tDel Toro: You were like David O. Russell? \n\n\tCooper: I learned so much from him [on “Silver Linings Playbook,” “American Hustle” and “Joy”]. He expanded my horizons about what it can be like in a creative environment on a set. I took to that way of making movies.  \n\n\tWhat [you and I] share is that we love this so much. We love every aspect. \n\n\tDel Toro: When people talk about filmmaking visionaries, I go, “Well, it’s hard work and it’s hardware.” You have to build it; you have to film it with a certain lens. You have to decide between a Steadicam or a handheld. The decision is precision.  \n\t\n\n\tCooper: Both of our movies take chances structurally and trust the audience. Where the camera is has everything to do with how the viewer relates to the story. In “Is This Thing On?” you don’t see a full shot of our main character’s face until about 20 minutes into the movie. It’s all profiles or three-quarter shots until he gets up on that stage, finally turns and says, “I’m getting a divorce.” I wrote it into the script, and the studio was trepidatious about the idea of not seeing your main character. And I said, “It will work because hopefully the audience won’t know it cerebrally, but they’ll feel like all of a sudden there he is.”  \n\n\tI love the scene in “Frankenstein” where you have the monster hiding behind this wall, looking at the blind man’s house. \n\n\tDel Toro: The moment where he crosses from his hiding place into the house, the camera crosses with him through the set. All of a sudden, he’s in a completely different environment. It’s the widest shot of the scene, so that when we enter the house, it’s magical.  \n\n\tThat happened to me at the Academy Awards. When I got the Oscar for “Shape of Water,” people asked, “How does it feel?” I said, “Well, you’re in your seat and then you climb up to the stage and turn around and go, ‘What is this?’” All of a sudden, you’re in your dream moment in the shower as a kid rehearsing your speech with the shampoo bottle. \n\n\tThe monster needed to feel like that. He enters the house, and it needs to feel like a palace. Everything we did is 99% anchored in practical elements. We wanted to build giant sets. We wanted to build a massive ship on real motors.  \n\n\tCooper: Which is incredible. \n\n\tDel Toro: You want to stage everything so that that world exists in a way that feels natural. [But] you have to be able to adapt to unforeseen circumstances.  \n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tBenedict Evans for Variety\n\t\n\n\n\n\tCooper: Things can just pass you by — these wonderful gifts — and if you’re not looking, you’re not going to see them. \n\n\tDel Toro: One detail can change everything, and you have to identify those accidents. I ordered oversized irises for Jacob Elordi to make his eyes more animalistic. So those are scleral contact lenses; they’re large and troublesome. He put one on and the other hurt, and he says, “I can’t put in the two lenses. Let’s do it digitally.” And I said, “No, let’s keep two different sizes of eyes, and the bigger eye is going to reflect back the light, and I’m going to use it to show when he’s angry.”  \n\t\n\n\tCooper: It wound up being an incredible story weapon. \n\n\tDel Toro: If you’re playing chess with reality, you will lose. That’s true of every filmmaker that has ever lived, even when they create their entire world, like Jim Cameron. What was fascinating about the “Avatar” [movies] is the more control he has over the world, the more he can be loose with the actors. On the most recent movie, you see how much he’s improvising.  \n\n\tCooper: Yes, 100%. It’s funny, the more structured I am, the freer the actors feel. \n\n\tDel Toro: How do you choose the movies you direct? \n\n\tCooper: It sounds hokey, but they choose me. It takes so much work and energy; it has to be something that feels slightly otherworldly to harness what it takes to see it through. For each movie that I’ve directed, I asked, “What’s the nuclear weapon?” With “A Star Is Born,” there’s no better way to tell a love story than two people singing, because you cannot hide your emotions. And then Gaga was the nuclear weapon. For “Maestro,” it was being obsessed with conducting since I was a kid. But then the nuclear power was finding Leonard Bernstein. \n\n\tDel Toro: And for “Is This Thing On?” \n\n\tCooper: It was Will Arnett. Here is this guy who is like Robert Mitchum. He’s 6’4”. His voice is what you would dream of having. To see him on a nightclub stage — knowing where he is right now in his life — I knew he could open up. \n\n\tDel Toro: And you could push him where he has not gone, because you know him? \n\n\tCooper: Every day was a struggle. Every day he was uncomfortable. It was about trusting me.  \n\n\tDel Toro: People say, “Why did you choose this movie?” I say, “Listen, I’ve written 42 screenplays; I’ve made 13 movies.” It’s not like I said, “Oh, no, I’ll do that one now.” It’s which project can I get produced.  \n\n\tCooper: When we made “Nightmare Alley,” we both had other obsessions. \n\n\tDel Toro: But because we made it, I got to make “Frankenstein” and you made “Maestro.”  We approached the character that you played in “Nightmare Alley” as being the worst and the best of us, [which helped me on “Frankenstein”]. I did that with Jacob Elordi and Oscar Isaac. I said, “Let us not be the actor and the director; let us be flawed human beings and confess to each other our shortcomings and come to these characters through that pain.”\n\t\n\n\tIf I had done “Frankenstein” 20 years ago, it would have been about my father and me as a child. Now it’s too late for that. It needed to be about me as a father and my fear of repeating mistakes through generations with my children.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Guillermo del Toro Tells Bradley Cooper ‘I’ve Written 42 Screenplays’ but Only ‘Made 13 Movies’ as They Discuss Directing Struggles, ‘Frankenstein’ and ‘Is This Thing On?’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/Bradley-Cooper_Guillermo-del-Toro-Variety-Directors-on-Directors.jpg?crop=0px%2C59px%2C1200px%2C674px&resize=1000%2C563"
      ],
      "datePublished": "2026-01-05T20:00:00.000Z",
      "dateModified": "2026-01-05T20:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jeff Probst Breaks Down ‘Survivor’ 50’s Celeb Collabs, Promises They Don’t ‘Overshadow’ the Game: ‘Our Show Is Not Changing’",
    "url": "https://variety.com/2026/tv/news/jeff-probst-survivor-50-celebrity-collabs-mr-beast-jimmy-fallon-1236622622/",
    "image": "https://variety.com/wp-content/uploads/2026/01/3051569_51066b.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-05T19:43:34.000Z",
    "description": "\n\tWhen Jeff Probst began planning “Survivor” 50, he knew he had to go big. As always, that began with the cast — sifting through the 700+ castaways wh",
    "body": "\n\tWhen Jeff Probst began planning “Survivor” 50, he knew he had to go big. As always, that began with the cast — sifting through the 700+ castaways who have competed over the last 25 years to find the most memorable and iconic ones to return. Then, Probst quickly moved onto designing the season’s theme.\n\n\tAs revealed in the first trailer for this season, “In the Hands of the Fans” will include twists featuring Billie Eilish and Jimmy Fallon, and cameos from Jimmy “MrBeast” Donaldson and Zac Brown.\n\t\n\n\tBut don’t fret, “Survivor” loyalists: Probst isn’t losing the plot.\n\n\n\t“Once we committed to turning the game design over to the fans, the next question became: ‘How far can we go with this idea!?’” the host and showrunner tells Variety. “We knew some of ‘Survivor’s’ biggest fans happen to be celebrities, so we thought sprinkling a few of them in with their own unique twists felt like a fun way to make the game even more unpredictable! It definitely caught the players off guard in some really exciting ways, and added another layer to this celebratory season.”\n\n\tThis is the largest cast to ever play, and the castaways will, as always, be the real stars of the season — even when there are game-changing twists with celebrities attached. Variety was on set in Fiji for two of the collaborations, and can confirm that “Survivor” still feels like “Survivor,” even when A-list names are attached.\n\n\t“I think it’s a legitimate concern when you start adding layers like celebrities, that they can overshadow the game and take it off course. Our job was to make sure that we stayed true to what we’re doing on ‘Survivor,’ which is exploring this continuous social experiment. And now we’re adding another layer,” Probst says. “And when you bring in a celebrity like Zac Brown or MrBeast or Jimmy Fallon, you now add idolatry, and you add different perceptions and reputations. Suddenly, people can get off track a little bit, or they lean in, and they want something to do with Jimmy Fallon. A lot of the players said, ‘I’ve always dreamed of being in a MrBeast video.’ So the twist is designed to see if you can stay on course with the thought process you should — or how is it going to shift your thought process, and will it do you in?”\n\t\n\n\tHe also adds that he didn’t go out to celebrities and ask who wanted to be involved — it was through his own friendships and relationships that each collaboration came about. And it was the celebrity’s idea.\n\n\t“With Jimmy Fallon, it was on his show. Jimmy texts me ideas all the time about ‘Survivor,’ and we put some of them in the show, and we’ve always talked about this idea,” Probst says. That idea, for now, won’t be shared — but it is an exciting one, which is hinted at during the trailer, and didn’t go at all how Probst thought it would. “I think people will see, when they see these play out, I think they’ll understand these are legit ‘Survivor’ fans who wanted to be a part of 50.”\n\n\tThe biggest collab of the season, however, will be the one with MrBeast; Probst appears on Season 2 of “Beast Games” and Donaldson shows up for something on Season 50 of “Survivor.” The cameos were filmed days apart from each other in June in Fiji.\n\n\n\tThe crossover conversation began when Lori DelliColli, VP of communications at CBS, was eating breakfast, and her kids showed her a MrBeast video. One of his team members, Karl Jacobs, was wearing a “Survivor” buff and talking about the show. She flagged to the marketing team, who invited Jacobs, along with “Beast Games” co-creator Sean Klitzner, to participate in the influencer experience filmed ahead of Season 49.\n\n\tNo one knew at the time just how big of fans they were of the franchise. Executive producer Matt Van Wagenen recalls Klitzner applying and getting close to being cast on an earlier season. In 2020, Jacobs DM’d Van Wagenen on Twitter (as it was then), raving about the show. Van Wagenen mailed him a crew T-shirt and when Jacobs posted it on social media, the producer started hearing from friends and family. He had no idea how big Jacobs’ following was. Once they re-met in Fiji, “it felt like this was a conversation we never finished,” Van Wagenen says.\n\n\tDuring the influencer experience, Klitzner pitched Probst on some sort of collaboration — and “the camaraderie was instant; my respect for them was instant,” says Probst. “And then it was Lori’s idea to say, ‘That felt like some synergy there.’ We’ve never said, ‘Let’s collaborate with another show.’ Ever. We are our own tiny little world trying to just stay out of the way, and do our show.”\n\t\n\n\tA main part of the crossover, though, was logistics; the calendar for “Survivor” Season 50 and “Beast Games” Season 2 were already set. But the Prime Video reality competition series was willing to bend: They all wanted to make it work.\n\n\t“I said, ‘Jeff, if you really want to do this, ‘I’ll push my entire shoot. I’ll fit your dates no matter what,’” says Klitzner. “We had a kick-off meeting where they pitched us what we should do for our show. They said, ‘We don’t want to overstep.’ We said, ‘We want you to overstep in every sense of the word.’ They said they could shoot it with their crew and could build challenges. They came in, designed everything from soup to nuts. And of course, then our team came in, and we put ‘Beast’ into it… There was not one moment that Jeff went, ‘I don’t know if we can do this.'”\n\n\n\n\t\n\n\t\t\t\t\tJeff Probst on “Beast Games” Season 2\n\t\n\n\n\n\tThough “Beast Games” and “Survivor” are both reality competition shows, they have very little in common. \n\n\t“They have a chaotic approach. They have cameras everywhere; they break the fourth wall all the time. They talk to players whenever they want. It’s a completely different form of storytelling, and it works,” Probst says. And Donaldson is a very different type of host from Probst. “He’s not focused on a longer-term story. He seems more focused on an in-the-moment reaction, and they bounce from one reaction to another, to another. It’s similar to his online environment, which is this constant hit of another moment, another event, one after another. “On ‘Survivor,’ we’re looking at the long game. We want to introduce you to somebody, let you know who they are, where they’re from, what their vulnerabilities are, and then we add things to the game to exacerbate that uncertainty and force adaptability.”\n\n\tAnd Donaldson’s style was “exhilarating” for Probst to see, allowing him a look into such a different production than he’s used to. “Who knows what influence I will take from that?” Probst says. “I’m sure in some ways, I will take things from my time with Jimmy and go, ‘I could use some elements of that in ‘Survivor.’”\n\n\tIn a way, it was “like I was in a video game and just trying to keep up,” Probst says of being part of the “Beast Games” episode. “He just goes wherever he wants. He, like me, is the producer of his show. He can decide to do whatever he wants, and he does. He doesn’t hesitate to say, ‘I think I’ll just bribe you with money right now.’ It was fascinating to be inside their world and watch them.”\n\t\n\n\tOf course, having Probst by his side was a huge learning experience for Donaldson — both as a host and as a producer. After the first part of the collab is filmed, Donaldson says: “I’m a little more monotone. Jeff projects his voice, and has a swag with certain things — like Island swag! I would love to have more presence with my voice like he does.”\n\n\tFrom a producer’s standpoint, Donaldson realized while in Fiji that maybe “Beast Games” has “over-indexed on changing things. He’s essentially done similar vibes for 25 years, and it’s still cool. People like familiarity, and I usually try to mix things up, but that makes the production way harder,” says Donaldson. “It’s helped me realize that not everything has to be fresh, because sometimes fans just like things, and if they like it, do it over and over again.”\n\n\tBut after figuring out how “Survivor” would be incorporated into “Beast Games,” it came time for Probst to figure out how to mix MrBeast into his show. \n\n\t“The key point for me was, our show is not changing. Jimmy will come in, and we’ll bring the aspects of ‘Beast Games’ that we want to explore on our show,” says Probst. “If you look at the two shows, ‘Beast Games’ asks one question: What will people do for money? ‘Survivor’ asks a different question: Who are you when you’re stripped of everything?”\n\n\tWhat Donaldson’s role is in “Survivor” 50 needs to stay secret for now, other than what’s shown in the trailer: He shows up with his briefcase. Let’s just say, what’s inside has major potential to change the game.\n\n\t“When you take people who are being stripped of everything,” Probst says, “and then you bring in maybe the most well-known person for unpredictable moments, it took the uncertainty to another level.”\n\n\t“Survivor” premieres on CBS Feb. 25 at 8 p.m. ET.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jeff Probst Breaks Down ‘Survivor’ 50’s Celeb Collabs, Promises They Don’t ‘Overshadow’ the Game: ‘Our Show Is Not Changing’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/3051569_51066b.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-05T19:43:34.000Z",
      "dateModified": "2026-01-05T19:43:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Black Phone 2’ Sets Peacock Release Date",
    "url": "https://variety.com/2026/film/news/black-phone-2-peacock-release-date-streaming-1236575320/",
    "image": "https://variety.com/wp-content/uploads/2025/10/MCDBLPH_UV062_3bf279.jpg?crop=0px%2C0px%2C3000px%2C1688px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-01-05T17:49:11.000Z",
    "description": "\n\tThe Grabber is coming home on Jan. 16 as “Black Phone 2” becomes available to stream on Peacock.\n\n\tBlumhouse’s sequel to the 2021 Scott Derrickson-d",
    "body": "\n\tThe Grabber is coming home on Jan. 16 as “Black Phone 2” becomes available to stream on Peacock.\n\n\tBlumhouse’s sequel to the 2021 Scott Derrickson-directed horror film hit theaters last October. It saw Derrickson’s return to the director’s chair as well as Ethan Hawke’s reprisal of the villainous Grabber, haunting protagonists Finney and Gwen Blake (Mason Thames and Madeleine McGraw) from beyond the grave.\n\n\n\tThe sequel also brought Miguel Mora and Jeremy Davies back from the first film’s cast, and introduced Arianna Rivas, Demián Bichir, Maev Beaty, Graham Abbey and Anna Lore as original characters. Derrickson and C. Robert Cargill wrote the screenplay, which focuses on Finney and Gwen dealing with their trauma four years after the events of the first movie while trying to figure out the mystery of their telekinetic abilities. Meanwhile, the Grabber seeks vengeance for the fate he suffered at their hands at the end of the first film, returning as a lethal and menacing phantom.\n\t\n\n\t“Black Phone 2” premiered at Fantastic Fest in September and went on to gross over $125 million at the worldwide box office, a success in an otherwise slow October. However, the sequel still grossed less than the first “Black Phone,” which earned $161 million in 2021.\n\n\t“The Black Phone” was adapted from a short story of the same name by Joe Hill, published in his 2005 anthology “20th Century Ghosts.” Hill also contributed to the story for “Black Phone 2.” \n\n\tJason Blum produced both films alongside Derrickson and Cargill. Both were released by Universal Pictures. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Black Phone 2’ Sets Peacock Release Date",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/MCDBLPH_UV062_3bf279.jpg?crop=0px%2C0px%2C3000px%2C1688px&resize=1000%2C563"
      ],
      "datePublished": "2026-01-05T17:49:11.000Z",
      "dateModified": "2026-01-05T17:49:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kevin O’Leary on the ‘Sheer F—ing Genius’ of ‘Marty Supreme’ and Why He’s ‘Unsatisfied’ With the Final Scene: ‘This Kumbaya Ending Is Absurd … Rachel Has to Die in Childbirth’",
    "url": "https://variety.com/2026/film/news/kevin-oleary-marty-supreme-ending-rachel-die-1236623761/",
    "image": "https://variety.com/wp-content/uploads/2026/01/MCDMASU_EC025-e1767633991290.jpg?crop=0px%2C48px%2C1820px%2C1024px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-01-05T18:30:00.000Z",
    "description": "\n\tAt the height of the Great Recession, Kevin O’Leary met Mark Burnett for breakfast at a beachside hotel in Los Angeles.\n\n\tThe 71-year-old venture ca",
    "body": "\n\tAt the height of the Great Recession, Kevin O’Leary met Mark Burnett for breakfast at a beachside hotel in Los Angeles.\n\n\tThe 71-year-old venture capitalist, known as Mr. Wonderful, had sold his educational software company to Mattel for $4.2 billion, and he had spent the last couple of years on a panel of investors on the Canadian series “Dragon’s Den.” Burnett, the reality TV titan behind “The Apprentice,” was looking to bring that same entrepreneurial format to American audiences with a new series called “Shark Tank.”\n\t\n\n\t“He said, ‘We’re looking for a real asshole, and you’re it,’” O’Leary recalls, sitting in a Manhattan hotel room in December, far from the Santa Monica sunshine. “I said, ‘Do I take that as a compliment?’ We never looked back after that.”\n\n\n\tSeventeen seasons and five Emmys later, “Shark Tank” has spawned nearly 45 international spinoffs and struck hundreds of deals. According to O’Leary, the show “changed the elevator pitch forever.” It also made him a celebrity whose blunt ruthlessness cemented him as the Simon Cowell of capitalism.\n\n\tO’Leary was not an actor, and he insists Mr. Wonderful is not a character. (Yes, it’s really him when he tells an aspiring business owner, “You’re dead to me,” or berates them as a “greedy pig” or “vampire cockroach.”) So, it came as a surprise when, two decades after that breakfast in L.A., he got a call from director Josh Safdie, who was casting “Marty Supreme,” an A24 film centered on a ping pong star played by Timothée Chalamet. Safdie uttered the same magic words as Burnett: “We’re looking for a real asshole.”\n\t\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\t©ABC/Courtesy Everett Collection\n\t\n\n\n\n\tDespite his lack of acting experience, the “Uncut Gems” auteur envisioned O’Leary as the central foe in the movie, a pen-hawking millionaire WASP named Milton Rockwell who spars with Chalamet’s hustler athlete. Safdie asked O’Leary to come to New York to read for the part, but O’Leary refused. “I can’t do it. It’s the middle of summer. I’m sitting on my dock,” he told the director. “I’ll send a plane for you. You come see me.” O’Leary surmised that if Safdie was willing to jet to his lake house in Muskoka just to hear him read for the part, the opportunity must be serious.\n\n\tSafdie and his co-writer Ronald Bronstein obliged and sent O’Leary the script, which he printed out and left on his home bar. The next morning, O’Leary’s friend, the investment banker Gene McBurney, was outside on his dock, reading the screenplay as the sun peeked over the water. “Have you read this fucking thing?” McBurney asked O’Leary. “Whoever wrote this is a very sick puppy, but you can’t stop turning the pages.”\n\n\tO’Leary was sold. He read for the part, and his agent soon began negotiating the deal. The “regular Hollywood bullshit” ensued. But O’Leary’s rep wasn’t so sure it was a good career move for him: “He said, ‘I have to be transparent with you. Some of us at UTA are nervous that you’ve never acted before. What happens if you shit the bed?’”\n\n\t“Marty Supreme” opened wide on Christmas, quickly becoming A24’s second-biggest opening weekend and generating Oscar buzz. Most important for O’Leary, his performance has received raves from critics. “This asshole thing is starting to work for me a little bit,” he smiles.\n\n\n\tI first meet O’Leary on an icy morning in Midtown, where he’s just arrived, suitcase in hand, after a weather-delayed flight. He’s wearing a black suit with cufflinks in the shape of skulls, and he shows me a prototype earpiece that translates his texts from five languages, gifted to him by “Shark Tank” co-star Mark Cuban. As O’Leary checks in at the front desk, I offer to grab us a table in the half-vacant hotel restaurant. He shrugs me off with a grin and suggests, “Let’s just do it in the penthouse.” \n\n\tIn the hotel suite, O’Leary’s wife, Linda, insists I order a coffee and a bite to eat as O’Leary sets up a small camera on a tripod. He films every interview and clips them for his social media pages, he says, pegging a microphone on my jacket. It’s an unusual move that speaks to his passion for video production and also, perhaps, a desire for control.\n\n\tHe struggles to explain his acting process other than to say he didn’t feel like he was acting at all. When he stepped onto the set with his hairpiece and glasses and red watches — which he’s wearing now, one on each wrist — he simply was Milton. “I just breathed the 1952 air,” he says.\n\t\n\n\tThe first scene he filmed was opposite Chalamet. “We talked about the scene for a couple of minutes, then he’d get up, walk around the camera for a second and come back as Marty Supreme. Sparks are flying off his fingertips,” he says. “The first time we shot, that freaked me out. It never freaked me out again. I knew exactly how he worked, and it was marvelous.” O’Leary is confident that Chalamet will win the Academy Award for best actor.\n\n\tIn the film, Milton mocks and marvels at Marty. In one particularly memorable scene, O’Leary smacks Chalamet’s bare ass with a ping pong paddle. O’Leary says the scene required 40 takes and shot until 4 a.m., and Chalamet refused to use a butt double because “he didn’t want some other ass immortalized” on screen. When the prop paddle broke after one hit, Chalamet insisted O’Leary use a real one, which left indents on his tush.\n\n\t“It was easy to beat him up because he was that arrogant little bastard right out of the gate — that assumptive little prick. It was amazing,” O’Leary says. \n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tCourtesy Everett Collection\n\t\n\n\n\n\tIn another threatening speech, Milton sneers at Marty, “I’m a vampire,” a line O’Leary came up with himself. He pulls up his texts with Safdie and shows me a video he sent the director of him getting into character. “We have a contract … and we sealed it with a paddle,” O’Leary improvises, looking at the iPhone camera. “I was born in 1601 … and I’ve met many Marty Mausers over the centuries.” Safdie and Bronstein loved the immortality quip and worked it into the script. \n\n\tBut O’Leary and the writers didn’t agree on everything, and he still gripes about the ending of the film, which sees Marty holding his newborn child, tears streaming down his face, overwhelmed, terrified, euphoric. He’s come straight off the plane from Japan, where he sabotaged Milton by refusing to lose an exhibition match against the country’s star table tennis player, Koto Endo (Koto Kawaguchi).\n\n\t“I told them I was really unsatisfied with the ending, for my character to get fucked over like that. This kumbaya ending is absurd,” O’Leary says. (He circles back to this frustration five or six separate times throughout our conversations.) O’Leary feels that Marty “fucked everybody” in his relentless quest for ping pong success, and “why should he not live a life in misery in perpetuity after that?”\n\t\n\n\tO’Leary believes not only Marty should suffer but his love interest Rachel, played by Odessa A’Zion, should too. He pitched Safdie on an idea: “Rachel has to die. She has to die in childbirth.” (Safdie allegedly considered the suggestion before deciding it was too “sick.”) O’Leary also wanted the film to end with Milton literally biting Marty, and he says Safdie and Bronstein “went as far as to make digital teeth” before nixing the vampiric twist. “I know that sounds nuts, but to me that would be the right punishment,” O’Leary says.\n\n\tFor O’Leary, “Marty Supreme” marked the first time in decades he was an employee. “I learned my lesson that film sets are not democracies. I’m not used to being told what to do. I do the telling,” O’Leary says. “We shot something 20 times and I said to Josh, ‘OK, I think we got it. We can move on.’ He said, ‘What the fuck are you talking about? There’s no moving on until I say we’re moving on.’”\n\n\tBefore he built up his nine-figure net worth, Montreal-born O’Leary was a film editor who worked primarily in sports television. Photography is a lifelong passion of his, and he still edits one social media post per week on Premiere Pro, despite having a personal marketing team. (His online portfolio features a dramatic self-portrait in black and white, Canadian landscapes and behind-the-scenes shots of Chalamet.)\n\n\tWatching Safdie and co. work with Aeroflex cameras, Panavision lenses and 35mm film was a fantasy for O’Leary. But it was also, at times, a pain in the ass.\n\n\t“I’d never seen such inefficiency. The cinematographer drove me nuts,” he says of Darius Khondji, who required flawless lighting for every scene. Shooting with one camera meant constantly resetting between two characters, and Safdie and Bronstein were “anally insane for perfection.”\n\n\t“Then I saw the movie and I realized the sheer fucking genius of this guy,” O’Leary says of the director. “Every single frame was perfect. The lighting was perfect. The scenes were perfect.”\n\t\n\n\tIn October, O’Leary suggested in a podcast interview that Safdie could have saved millions of dollars by replacing thousands of extras with artificial intelligence. He maintains that AI can be a useful tool in entertainment for backgrounds. “I used blow-up sex dolls in the stands of hockey arenas when we were shooting so that people didn’t have to freeze for 16 hours,” he says of his TV editing days. “They were slightly out of focus. You couldn’t tell they were sex dolls.”\n\n\tStill, O’Leary, a bullish investor in AI, rejects that the technology will meaningfully encroach on the work of artists. “I don’t think it’s going to be anytime soon that it’s integrated into filmmaking,” he says. “What makes an actor magic is their life, who they are and what they mean to the fan base. It’s the same phobia we had when television hit radio. ‘Oh, it’s going to decimate radio!’ No it’s not. The art form exists today, even bigger, terrestrial and in space. To me, AI is just a tool.”\n\n\tAnd while he says the growth of streaming and decline of theatrical distribution is “obvious” — especially amid Netflix’s impending acquisition of Warner Bros. — O’Leary doesn’t think movie theaters will go away. “I go to these large-screen formats. It’s not just the images, it’s the sound,” he says. “Even in the most expensive home theater — and I’ve got one — there’s no way you can get that same feel. As long as the experience is unique, particularly these new theaters with full bar service, food service, incredible sofa-like chairs in a giant room with perfect sound and a 70mm-size screen, you can’t beat it.”\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tDisney\n\t\n\n\n\n\tWe’re past our allotted time at the hotel, and O’Leary’s phone won’t stop buzzing. “Let’s keep going,” he says, flipping the device face-down on the coffee table. “We’re in a groove here.” But eventually, he hits the answer button. It’s his publicist, and he’s late for other interviews. “OK, OK. OK,” he says, hurriedly. “Got it. Got it. OK. I’m going. I’m going. I’m going right now.” He looks at me, without cracking a smile, and says: “We’re fucked.”\n\n\tLinda brings over O’Leary’s breakfast — scrambled eggs, smoked salmon and gluten free toast — and I wolf down some berries before scurrying out of the penthouse. As O’Leary preps for his junket interviews, I ask if doing press for a movie is a thrill or a chore. His wife answers for him: “He’s having the most fun of his life.”\n\t\n\n\tO’Leary is keen on growing his Hollywood career. Even before “Marty Supreme” arrived in theaters, he had already received a couple of offers from directors and producers who saw early previews of the film. He’s going to wait until the promotional cycle ends before deciding what to do next. “I’ve definitely caught the bug, and I want to see how diverse I can be in terms of what roles I play,” he says. \n\n\tStill, there’s one part in particular he has his eyes on.\n\n\t“My whole life, since I was a teenager, I’ve wanted to be the bad guy in a Bond movie,” O’Leary says. “I want to blow shit up. I could blow a lot of shit up.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kevin O’Leary on the ‘Sheer F—ing Genius’ of ‘Marty Supreme’ and Why He’s ‘Unsatisfied’ With the Final Scene: ‘This Kumbaya Ending Is Absurd … Rachel Has to Die in Childbirth’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/MCDMASU_EC025-e1767633991290.jpg?crop=0px%2C48px%2C1820px%2C1024px&resize=1000%2C563"
      ],
      "datePublished": "2026-01-05T18:30:00.000Z",
      "dateModified": "2026-01-05T18:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Aubrey O’Day on Participating in Netflix’s Diddy Doc and Danity Kane’s Reunion: ‘It Can’t Just End Here’",
    "url": "https://variety.com/2026/music/news/aubrey-oday-on-netflix-diddy-doc-danity-kane-reunion-1236623462/",
    "image": "https://variety.com/wp-content/uploads/2026/01/PE_n_S1_E2_00_57_29_00-e1767577483193.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-05T19:48:57.000Z",
    "description": "\n\tIn Netflix’s documentary series “Sean Combs: The Reckoning,” close associates of Diddy share their various experiences working with the fallen mogul",
    "body": "\n\tIn Netflix’s documentary series “Sean Combs: The Reckoning,” close associates of Diddy share their various experiences working with the fallen mogul in a professional and personal capacity throughout the years. For Aubrey O’Day, who Diddy signed to his girl group Danity Kane as part of “Making the Band” in the early aughts, it was the culmination of years of speaking out about her former boss and the trauma she’s endured.\n\n\t“Today, I have this fear of the grieving process or putting things together or living with the limited perspective I have now, understanding the full context through the documentary and with the world watching,” she tells Variety. “When I woke up early this morning, all of these thoughts were starting to consume my mind.”\n\t\n\n\tO’Day, 41, is discussing her participation in the documentary — which was directed by Alexandria Stapleton and executive produced by Curtis “50 Cent” Jackson — just days after wrapping the 2025 dates of Danity Kane’s “The Untold Chapter Tour” in late December, a reunion that saw her taking the stage once again with D. Woods and Aundrea Fimbres. She explains that she didn’t realize how overwhelming it would be to revisit the foundation of her music career amid the release of the documentary, in which she shares how Diddy fired her from the group for rebuffing his sexual advances and, in a shocking moment, reads an affidavit from a woman who claims she witnessed Diddy sexually assaulting her while she was inebriated.\n\n\tBut, as she says, O’Day is using her appearance on the documentary to open up conversations about abuse not just in the music industry, but beyond. “I’m overall wanting the behavior to stop across the board,” she says. “We’re having open discussions to this day about behaviors that are very similar. And I’m wondering what we as a society are going to do about them.”\n\t\n\t\n\t\tYou were one of the first people to be vocal publicly about Sean Combs. It’s been going on for years, and the reaction may not have always been as warm or supportive as it is now. Do you feel a sense of vindication in all of this?\t\n\n\tYou know, I’ve gone back to that so much and my answer is, yes, I have been speaking out for 20 years. I did it in ways that I could based on the things that I had to sign contractually to get out of my 360 deal. I did it a lot less then. I started over the years as I started to understand myself and build my own career away from “Making the Band” and Danity Kane and Diddy. I started to understand the power of my voice differently, and so I spoke bigger about it. \n\n\tBut even when I look back at something like “Celebrity Apprentice,” this clip always comes back around during election time where Trump is praising Diddy and saying he’s the greatest guy and encouraging me to say that as well — and I refuse to say it. And I noticed even then I wasn’t so far removed from that situation, but I wasn’t willing to compromise my integrity even in front of a man that had all the power. So I think it’s been very consistent.\n\t\n\t\tWatching your part of the docuseries was, frankly, very difficult, not only because of what you’re talking about, but also watching you share that with the world. Why was it important for you to read the affidavit publicly?\t\n\n\tSo when this whole thing occurred, the very first thing that happened in my world is every single person that was making a documentary ran straight to me and offered me the world. And I would have conversations, and I would notice, “Oh, these people are just wanting to make a hit piece on Diddy. These people seem interesting, but I’ve spoken with all the producers and I’ve asked to meet all of the editing bay and there is no Black representation here. How would they ever be able to tell a culture piece and not have any representation on the production side or the editing bay?” I didn’t trust that. \n\n\tI was talking with Alex a lot about everything, and she was kind of the last one that came through and had her deal with Netflix. And then she was the last person that got to me. But when I got on with her, she’s just such an incredible, incredible human. The way that she listened to me, the way that she validated the things that I said, the way that she listened to the things that had happened to me prior to doing the documentary and advised me that I’m not experiencing the way that doing a documentary on this project would look. It almost sounded like I’m experiencing what a reality TV version of this would look like, which I’m very used to.\n\t\n\n\tSo when I spoke with her, she had such patience, respect. She knew and understood. She knew all of the connections. She knew the world. And she’s a woman that has a lot of pressure on her being a mixed woman. She spends her life doing culture pieces and having people wonder if she’s the right person to do it. She’s got a smaller production company. And so to put that much on her back and for her to be part of, I mean, you’ve seen how huge this documentary has become. And it is a statement of the culture, of the industry, and of a time and place in which a lot of things were going unchecked. I just saw that Netflix was willing to take its time and that she was taking her job of telling this piece of history with a lot of integrity and she was being very careful. I wanted to be on a documentary that was going to tell a through story of a man’s life, good and bad.\n\t\n\t\tWhat was your reaction when you were first given the affidavit?\t\n\n\tThe first thing I did was verify everything that I was told that this woman was. Who she was, how many kids she had, or what she does for a living, or her degrees. I wanted to make sure, as the daughter of a lawyer — my stepdad was a lawyer too, so of lawyers — that I did my due diligence in understanding that this person is real. And when I got that concerned was right around the time that [the authorities] reached out to me and wanted to meet with me. So the problem was for me, when you speak with them, they tell you two things when they leave, which is, don’t tell anyone that you’ve met with us, obviously, until you’ve been subpoenaed or you’re not being subpoenaed and the trial is over. And two, can’t speak to victims because you can drastically create errors in the case if you’re talking with other victims. What if both of you need to take the stand? There can be no communication between two people or else you could have compromises to the actual trial. And so at that point it was, if you wanted to even investigate this, it’s a non-starter. \n\n\tSo I just started reading every civil lawsuit. One thing I noticed in all of them is these instances in which they start feeling woozy. There were instances throughout all of them in which these details occurred and I just kept trying to find myself in any of them. Find anything in them that made sense to me like, oh, I had that feeling too. But it was very difficult to sift through a lot of those lawsuits. Some of them are so horrific. I would be feeling sick over it for days. And when the conversations that were had with this woman over a multiple-year period of time, her story never changed once, and she was speaking with people who did not discuss knowing me. And this is all happening as [Aundrea] called me and said she found me on “Masked Singer” [in early 2025] and wants to sing again. So I’m trying to get an agent to put a tour together and bring all of these girls back. But I’m also secretly suffering in this whole world. And I didn’t even realize when combining the worlds how absolutely horrific it would be for me, for my mental health. \n\t\n\t\n\t\tWhat do you think is going to happen to Sean Combs once he’s out of prison and this part of his life is behind him?\t\n\n\tI am unsure that the amount of time that he’s going to be in prison is enough to fully, solely do the type of work that you would need to become a better person and to — how do I say this? To heal into the type of person that could be effective and good going back into life, and I’m mostly worried that a lot of money and a great spin team could create the idea that he has once again recreated a new version of himself. And that worries me, because there are people that will always be around to be able to potentially be pulled into that.\n\t\n\t\tYou were saying how you didn’t realize that doing this reunion and dealing with the docuseries rollout at the same time would be a lot to handle. Regarding the timing of the reunion, was it done with the intention of creating a new path forward following what you’ve been through these past few years, or is it just that the timing worked out that way?\t\n\n\tI was feeling like it can’t just end here for all of the artists that went through so much. So my thought was being able to end the year on seeing the artists come back and shine, having nothing to do with him. He didn’t build it. He didn’t create it. He didn’t put the show together. Like being able to still show resilience after such a traumatic period of time for so many people, whether you knew him or not, it was so palpable. The trial was so palpable. The behaviors were so palpable. So many people who have been abused in this world in any shape or form, they all were just feeling really heavy. So I thought that this tour would be a good way of closing out the year and really bringing it back to the music and to the reason why all of us showed up in the first place. \n\t\n\t\tYou teased the reunion with silhouettes. People were unsure of who was going to be on the actual stage. Dawn Richard said publicly that she didn’t know about the reunion. What sort of conversations happened behind the scenes to get it into the formation that people have been seeing at these shows?\t\n\n\tSo I reached out to Dawn to come back. It originally started with an agent reaching out to everyone. When I saw her release that, I had reached out and said, “Come back.” The reason I don’t post the receipts or get into it is that we go right back into that divisive Diddy mentality of chaos. And I don’t want to revisit that. The whole point was to not revisit that. And so I just have always kind of let her know a few different times, you are welcome back. I kept the shadows on our initial announcement, because I hadn’t even signed the contract at that point, let alone if any other girls wanted to come forward, we could make room and make it happen. There was a bandmate that did not want Dawn back. There was certain things that were occurring, but for me personally, the motto of Danity Kane is every single time, everyone is invited back. I’ll listen to everybody and I’ll hear them out, but I want everyone to come and speak to each other and where it’s solved is where it should fall. And that’s how it should have been done. And it didn’t get done that way. And that’s not anything that I had anything to do with. \n\t\n\n\tBut I have reached out to her multiple times. And of course, I mentioned her and Shannon on the stage. I was able to get Shannon to still be part of the show, even though she’s retired. But I just think that when you’re made under Diddy, there’s just so much that he did to each individual person. Everybody experiences it in different ways, and certain people got it way heavier than others, as the documentary tells the world. And I think that when you build something in an unhealthy environment, that I’m not sure that it ever gets to a place where it isn’t thick.\n\t\n\t\tNow that the tour is coming to an end, have you discussed recording new music? Is that something that’s been on your mind?\t\n\n\tNo.\n\n\tThis interview has been edited and condensed.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Aubrey O’Day on Participating in Netflix’s Diddy Doc and Danity Kane’s Reunion: ‘It Can’t Just End Here’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/PE_n_S1_E2_00_57_29_00-e1767577483193.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-05T19:48:57.000Z",
      "dateModified": "2026-01-05T19:48:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "National Popcorn Day Returns to Participating Movie Theaters – Film News in Brief",
    "url": "https://variety.com/2026/film/news/film-news-roundup-week-of-january-5-1236622495/",
    "image": "https://variety.com/wp-content/uploads/2021/11/AMCPerfectlyPopcorn.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-05T17:00:00.000Z",
    "description": "\n\tBig news for popcorn enthusiasts: In celebration of National Popcorn Day on Monday, Jan. 19, participating movie theaters nationwide will feature on",
    "body": "\n\tBig news for popcorn enthusiasts: In celebration of National Popcorn Day on Monday, Jan. 19, participating movie theaters nationwide will feature one-day-only promotions, discounts and offers on the famed movie theater snack in an initiative with Cinema United and The Cinema Foundation. Fandango has joined the campaign as its presenting sponsor.\n\n\t“National Popcorn Day is one of those moments that reminds us why people love going to the movies,” said Michael O’Leary, President and CEO of Cinema United, in a statement. “It’s about sharing a big screen experience and enjoying the amazing combination of movies and popcorn together that you simply can’t replicate anywhere else.”\n\t\n\n\tConcessions are a core part of the moviegoing experience, according to a Fandango study of more than 6,000 moviegoers: 96% of general ticket buyers said they purchased concessions during their trip to the movies and 61% of participants said they like to order a variety of concessions. Of the many refreshments offered in theaters, popcorn remains one of the most popular picks. \n\n\n\t“We’re excited to once again partner with The Cinema Foundation to celebrate National Popcorn Day in theaters nationwide on January 19,” said Jerramy Hainline, EVP of Fandango, in a statement. “The theatrical experience is truly unmatched and concessions like Popcorn play a big role in making every theater visit memorable to fans, whether they are watching the latest blockbuster, a beloved re-release, or even a live event. We’re proud to support exhibitors by helping fans enjoy their favorite theater snacks at a great value.”\n\t\n\n\tTo find participating theaters and their offers, visit your local movie theater’s website or app, AtTheMovies.co, or Fandango.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "National Popcorn Day Returns to Participating Movie Theaters – Film News in Brief",
      "image": [
        "https://variety.com/wp-content/uploads/2021/11/AMCPerfectlyPopcorn.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-05T17:00:00.000Z",
      "dateModified": "2026-01-05T17:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Corporation for Public Broadcasting to Shut Down After 58 Years Due to Trump Eliminating Funding",
    "url": "https://variety.com/2026/tv/news/corporation-for-public-broadcasting-shuts-down-trump-1236623793/",
    "image": "https://variety.com/wp-content/uploads/2025/09/GettyImages-659146296.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-05T18:49:26.000Z",
    "description": "\n\tLess than a year after the Trump administration and Congress voted to defund the Corporation for Public Broadcasting, the entity — which helped fund",
    "body": "\n\tLess than a year after the Trump administration and Congress voted to defund the Corporation for Public Broadcasting, the entity — which helped fund the operations of local public TV and radio stations — has voted to shut down. The CPB announced Monday that its board of directors voted to close the organization after 58 years, rather than continue to exist and potentially be “vulnerable to future political manipulation or misuse.”\n\n\tThe CPB was created by Congress by the Public Broadcasting Act of 1967 to support the federal government’s investment in public broadcasting. The org noted that the rescission of all of CPB’s federal funding came after years of political attacks.\n\t\n\n\t“For more than half a century, CPB existed to ensure that all Americans—regardless of geography, income, or background—had access to trusted news, educational programming, and local storytelling,” said CPB president/CEO Patricia Harrison. “When the Administration and Congress rescinded federal funding, our Board faced a profound responsibility: CPB’s final act would be to protect the integrity of the public media system and the democratic values by dissolving, rather than allowing the organization to remain defunded and vulnerable to additional attacks.CPB Board of Directors chair Ruby Calvert called the move — and what has happened to public media — “devastating.”“After nearly six decades of innovative, educational public television and radio service, Congress eliminated all funding for CPB, leaving the Board with no way to continue the organization or support the public media system that depends on it,” Calvert said. “Yet, even in this moment, I am convinced that public media will survive, and that a new Congress will address public media’s role in our country because it is critical to our children’s education, our history, culture and democracy to do so.”\n\n\n\tThe news doesn’t come as a surprise after the Republican Congress in July approved Trump’s rescission package, eliminating $1.1 billion in crucial funding for public broadcasting that had been approved for the next two years. Without that money, the Corporation for Public Broadcasting was set to shut down. And the fate of hundreds of TV and radio stations remains up in the air.The funding was used to support both public radio and public television stations, directing over 70 percent of CPB’s appropriation straight to local stations. The funds also supported independent filmmakers. Without the funds, PBS has been scrambling to support and protect some of its most vulnerable member stations. Some stations have announced plans to shut down; Arkansas’ PBS stations disaffiliated with the service and went independent to save money.\n\n\t“CPB’s support extends to every corner of the country—urban, rural, tribal, and everywhere in between,” the org noted.” In many communities, public media stations are the only free source of trusted news, educational children’s programming, and local and national cultural content.” The CPB said that without funding, its board determined that “maintaining the corporation as a nonfunctional entity would not serve the public interest or advance the goals of public media. A dormant and defunded CPB could have become vulnerable to future political manipulation or misuse, threatening the independence of public media and the trust audiences place in it, and potentially subjecting staff and board members to legal exposure from bad-faith actors.”\n\t\n\n\tAs it closes, CPB is distributing its remaining funds, and also supporting the American Archive of Public Broadcasting in digitizing and preserving historic content. The CPB’s own archives will be preserved at the University of Maryland, which will make it accessible to the public.\n\n\tIn September, the Television Academy honored CPB with its Governors Award, presenting it to Harrison , who had led the organization since 2005, at the Creative Arts ceremony.\n\n\t“Public media remains essential to a healthy democracy,” Harrison added. “Our hope is that future leaders and generations will recognize its value, defend its independence, and continue the work of ensuring that trustworthy, educational, and community-centered media remains accessible to all Americans.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Corporation for Public Broadcasting to Shut Down After 58 Years Due to Trump Eliminating Funding",
      "image": [
        "https://variety.com/wp-content/uploads/2025/09/GettyImages-659146296.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-05T18:49:26.000Z",
      "dateModified": "2026-01-05T18:49:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "CrimeCon’s Clue Awards Open Submissions for 2026 Ceremony (EXCLUSIVE) ",
    "url": "https://variety.com/2026/tv/news/crimecons-clue-awards-open-submissions-2026-ceremony-1236617748/",
    "image": "https://variety.com/wp-content/uploads/2025/12/Ice-T-and-Dr.-Ann-Burgess.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-05T17:00:00.000Z",
    "description": "\n\tCrimeCon’s Clue Awards, an awards program dedicated to true crime storytelling, is now accepting submissions for its 2026 ceremony. The ceremony wil",
    "body": "\n\tCrimeCon’s Clue Awards, an awards program dedicated to true crime storytelling, is now accepting submissions for its 2026 ceremony. The ceremony will be presented during CrimeCon’s annual flagship event for true crime fans, creators and industry professionals on Saturday, May 30, in Las Vegas. \n\n\tDedicated to celebrating excellence across true crime content, The Clue Awards honor projects across television, podcasting, film and publishing. Television categories include outstanding episodic series, outstanding docuseries and outstanding scripted series or film, which was previously added in 2025. The podcast category will recognize outstanding episodic series and outstanding docuseries. Outstanding documentary film and true crime book of the year will also be awarded, in addition to individual achievement honors. Entries can be submitted at ClueAwards.com. \n\t\n\n\tEarly submissions for the 2026 awards will be accepted at a discounted rate through the Feb. 15 deadline. Regular submissions will be accepted until March 21, and April 1 is the cut-off for final submissions. To be eligible for consideration, projects must have been released between May 31, 2025 and March 31 and be available in the United States. \n\n\n\tA third-party committee of true crime content producers, executives and creatives will select the nominees and winners of the Clue Awards. Last year’s panel included professionals from Inside Crime, Campfire Studios, National Center for Victims of Crime, Law&Crime Network, CourtTV and more.\n\n\tLast year’s awards were hosted by Grammy-award winning hip hop artist and award-winning actor Ice-T, who stars on “Law & Order: Special Victims Unit.” Netflix’s “American Murder: Gabby Petito,” ABC News’ “The Girl Who Looked Like Me” and MGM+’s “Godfather of Harlem” were amongst the winners at the 2025 awards, and the families of Liberty German and Abigail Williams, Lead Investigator Lt. Jerry Holeman of the Indiana State Police (“Crimefighter of the Year”) and “Crime Weekly” hosts Derrick Levasseur and Stephanie Harlowe (“People’s Choice: Creator of the Year”) received individual achievement awards. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "CrimeCon’s Clue Awards Open Submissions for 2026 Ceremony (EXCLUSIVE) ",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/Ice-T-and-Dr.-Ann-Burgess.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-05T17:00:00.000Z",
      "dateModified": "2026-01-05T17:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Box Office 2026 Predictions: Will ‘The Odyssey,’ ‘Avengers: Doomsday’ and a New ‘Star Wars’ Finally Propel Grosses Above $9 Billion?",
    "url": "https://variety.com/2026/film/news/box-office-2026-predictions-avengers-doomsday-spiderman-brand-new-day-odyssey-1236615235/",
    "image": "https://variety.com/wp-content/uploads/2025/12/cap.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-05T16:30:00.000Z",
    "description": "\n\tFor long-suffering movie theaters, salvation always seems to be just around the corner. In 2026, many of the biggest film franchises in history are ",
    "body": "\n\tFor long-suffering movie theaters, salvation always seems to be just around the corner. In 2026, many of the biggest film franchises in history are returning to screens. It’s a squadron of high- profile spinoffs and sequels to everything from “The Avengers” (with Robert Downey Jr. and Chris Evans back in spandex) to “Star Wars,” with a smattering of Mario and Luigi and Buzz and Woody in between. But since COVID upended the movie business, the box office has never been harder to predict. Last year, Marvel, once the most consistent hit–maker in Hollywood, saw one hyped-up superhero movie after another fail to connect with audiences, while auteur-driven films like “Sinners” and anime offerings like “Demon Slayer: Kimetsu no Yaiba Infinity Castle” became some of 2025’s most unlikely successes. So, with that caveat out of the way, we’re staring into our crystal ball and going out on a limb to predict the movies that will struggle or soar over the next 12 months. \n\t\n\t\n\t\tSure Things\t\n\n\n\n\t\n\n\t\t\t\t\tMatt Damon in “The Odyssey“\n\t\t\t\t\t\t\t\t\tUniversal Pictures\n\t\n\n\n\t\n\t\tThe Super Mario Galaxy Movie (Universal)\t\n\n\tRelease date: April 3 Thrill factor: Generations of gamers have traveled to the Mushroom Kingdom, a familiarity that helped turn “The Super Mario Bros. Movie” into a billion-dollar smash. The follow-up should get a similar reception, particularly as it has the spring box office more or less to itself. Chill factor: Video game adaptations like “A Minecraft Movie” and “Sonic the Hedgehog” have been one of the only genres that have reliably worked. Could we be nearing oversaturation? Verdict: Who are we kidding? The Nintendo brand is king, and those mustachioed siblings are its most beloved ambassadors. \n\t\n\t\n\t\tToy Story 5 (Disney)\t\n\n\tRelease date: June 19 Thrill factor: “Toy Story” represents Pixar at its best, and this installment — which confronts the reality that children would rather play with screens than dolls — feels like a timely reason to revisit the animated world of talking toys.  Chill factor: Maybe the tech-forward premise will hit too close to home for parents who prefer to park their kids in front of iPads at restaurants? Verdict: Woody and Buzz might be afraid of smart tablets, but they needn’t worry about box office grosses. “Toy Story 5” will be the biggest family film of the year. \n\t\n\t\tThe Odyssey (Universal)\t\n\n\tRelease date: July 17 Thrill factor: Christopher Nolan turned the life story of J. Robert Oppenheimer into a silver-screen sensation. The Trojan War sounds a lot more commercial, and it helps that the actors filling out the tunics include A-listers like Matt Damon, Tom Holland and Zendaya.  Chill factor: Homer? During the summer? Sounds like homework.  Verdict: July belongs to Nolan, who has debuted blockbusters such as “The Dark Knight” and “Dunkirk” at the height of popcorn season. “The Odyssey” will join the club. \n\t\n\t\tSpider-Man: Brand New Day (Sony) \t\n\n\tRelease date: July 31 Thrill factor: Tom Holland is dusting off his Spidey suit for the first time since 2021’s “No Way Home” became a bonanza with $1.9 billion. That film ended on a massive cliff-hanger, meaning a lot of people have been waiting to see what happens after Peter Parker makes the difficult decision to erase his identity from the world. Chill factor: “No Way Home” became a cinematic event in part because multiversal shenanigans allowed two prior Spider-Men, Andrew Garfield and Tobey Maguire, to save the day with Holland. Will hype be as high with just one Spidey on-screen? Verdict: Marvel might be waning in box office popularity, but Spider-Man remains on the comic book A-list.\n\t\n\t\tSafe Bets\t\n\n\n\n\t\n\n\t\t\t\t\tBaby Yoda in “The Mandalorian and Grogu”\n\t\t\t\t\t\t\t\t\tLUCASFILM\n\t\n\n\n\t\n\t\tThe Mandalorian and Grogu (Disney)\t\n\n\tThe Mandalorian and Grogu — Disney Release date: May 22 Thrill factor: The last “Star Wars” movie, 2019’s billion-dollar blockbuster “The Rise of Skywalker,” was released seven long years ago. In the time since, Baby Yoda (né the Child né Grogu) has become a household name through the very popular Disney+ series “The Mandalorian.” Chill factor: Lucasfilm has struggled for what feels like eons to get a theatrical release off the ground. Meanwhile, Disney+ has become the go-to destination for all things set in a galaxy far, far away with shows ranging from “The Book of Boba Fett” and “Ahsoka” to “Andor.” Do audiences still associate “Star Wars” with the cinematic experience, or is it a franchise they now prefer to watch at home? Verdict: “The Mandalorian and Grogu” will benefit from goodwill and brand recognition. However, not every “Star Wars” spinoff will feel the box office Force.\n\t\n\t\n\t\tAvengers: Doomsday (Disney)\t\n\n\tRelease date: Dec. 18 Thrill factor: Downey and Evans return to the MCU, bringing the two mightiest heroes back into the fold. They’re joined by fan-favorite characters from “The X-Men” and “The Fantastic Four” in a true “the gang’s all here” extravaganza.  Chill factor: Superhero fatigue is real, and Marvel can’t seem to shake it. The studio’s last few films — “Thunderbolts,” “Captain America: Brave New World” and “The Fantastic Four: First Steps” — all disappointed at the box office.  Verdict: Absence makes the heart grow fonder. It’s been six years since the last “Avengers” adventures, and Evans and Downey’s presence will make this sequel a bona fide event.\n\t\n\t\tVerity (Amazon MGM)\t\n\n\tRelease date: Oct. 2 Thrill factor: Colleen Hoover might be the new box office whisperer after “It Ends With Us” became a sleeper success for Sony, and “Regretting You” was one of Paramount’s only 2025 releases to turn a theatrical profit. “Verity,” which follows a struggling writer hired to complete a popular book series after the potentially unhinged author becomes injured, promises deliciously campy performances from stars Dakota Johnson and Anne Hathaway. Chill factor: Adult-oriented fare is, alas, always a risk in post-pandemic times. Verdict: Twisty thrillers are fun to watch with crowds, so “Verity” will become a breakout with women in the vein of “The Housemaid” or “A Simple Favor.” \n\t\n\t\tQuestion Marks\t\n\n\n\n\t\n\n\t\t\t\t\tRyan Gosling in “Project Hail Mary”\n\t\t\t\t\t\t\t\t\tScreenshot courtesy YouTube/Amazon MGM\n\t\n\n\n\t\n\t\tProject Hail Mary (Amazon MGM)\t\n\n\tRelease date: March 20 Thrill factor: Phil Lord and Christopher Miller are returning to the director’s chair for the first time since 2014’s “22 Jump Street.” With “Project Hail Mary,” the very funny filmmakers team up with the endlessly charming Ryan Gosling on a sci-fi adventure about an amnesiac astronaut tasked with saving the world from Armageddon.  Chill factor: Amazon MGM doesn’t have a track record of launching original properties, and with a hefty $150 million budget, “Project Hail Mary” needs to pack ’em in to justify its price tag. Verdict: Gosling, a versatile actor who should have won an Oscar for his performance of “I’m Just Ken” at the Academy Awards ceremony, isn’t a bankable star. After all, his 2024 action comedy “The Fall Guy” misfired theatrically despite great reviews. That means quality won’t be enough to get people to multiplexes. It’s up to the studio’s marketing department to turn the film into a must-see cinematic event.  \n\t\n\t\n\t\tDisclosure Day (Universal)\t\n\n\tRelease date: June 12 Thrill factor: For decades, Steven Spielberg has been synonymous with blockbuster entertainment. Now, the man who made “Indiana Jones” and “E.T.” returns to spectacle-style filmmaking with an alien-invasion adventure.  Chill factor: Does the old master still have it? Spielberg’s spent most of the past 20 years directing Oscar bait like “Bridge of Spies” and “Lincoln.” Has he outgrown his populist roots? Verdict: The title sounds like a bad airplane novel, but the trailer delivers plenty of thrills. It’s just hard to convince people to turn out for something that isn’t based on a game or a known property. \n\t\n\t\tClayface (Warner Bros.) \t\n\n\tRelease date: Sept. 11 Thrill factor: With comic book adaptations, audiences are fine with familiar faces but clearly aren’t settling for more of the same story. In that respect, “Clayface,” a body-horror film about a struggling actor with a disfigured face who takes drastic measures to transform his body into clay, feels vastly different from “Brave New World,” “Thunderbolts” and the family-friendly “Superman.”  Chill factor: Has anyone, on this planet or any other, ever heard of Clayface? Verdict: James Gunn and Peter Safran may have revived the DCU with “Superman,” but not every comic book character is worthy of the big-screen treatment. \n\t\n\t\tPractical Magic 2 (Warner Bros)\t\n\n\tRelease date: Sept. 18 Thrill factor: Nearly 30 years after the first “Practical Magic” became a cult hit on home entertainment — remember VHS? — Sandra Bullock and Nicole Kidman reunite for another supernatural rom-com. Chill factor: It’s worth noting that “Practical Magic” flopped when it was released in 1998. Given Bullock and Kidman’s price tags, Warners is probably banking on them casting a stronger spell on moviegoers in 2025. Verdict: Nostalgia is powerful — just look at other long-gestating sequels like “Top Gun: Maverick” and “Beetlejuice, Beetlejuice.” But this follow-up feels random. Besides Bullock and Kidman’s agents, who’s asking for this?  \n\t\n\t\n\t\tBiggest Risks\t\n\n\n\n\t\n\n\t\t\t\t\tJessie Buckley as Frankenstein’s monster’s betrothed in “The Bride”\n\t\t\t\t\t\t\t\t\t©Warner Bros/Courtesy Everett Collection\n\t\n\n\n\t\n\t\tThe Bride! (Warner Bros.)\t\n\n\tRelease date: March 6 Thrill factor: Audiences have been flipping for auteur-driven horror films such as Ryan Coogler’s “Sinners” and Robert Eggers’ “Nosferatu.” Maggie Gyllenhaal, who impressed with her directorial debut, “The Lost Daughter,” is offering up a bold vision with her steampunk take on “Frankenstein.”  Chill factor: Guillermo del Toro just did his own thing with Mary Shelley with last fall’s “Frankenstein.” Some stories don’t need to be revived again and again.  Verdict: The buzz on the $80 million production has been frightful. Unless critics swoon, audiences aren’t showing up to see this undead couple in action. \n\t\n\t\tHoppers (Disney)\t\n\n\tRelease date: March 6 Thrill factor: Family films have, for the most part, been all the rage. And the most recent animated adventure was December’s “SpongeBob” sequel, so “Hoppers” should benefit from pent-up demand. Chill factor: Pixar hasn’t successfully launched a new animated film since 2017’s musical hit “Coco.” Even last year’s positively reviewed “Elio” cratered at the box office. Plus, the plot — revolving around scientists who can transfer human consciousness to robotic animals — sounds kind of confusing. Verdict: “Hoppers” needs to be undeniably great and marketable to parents of youngsters. Otherwise, Pixar is doomed to retreat into the world of sequels and possibly forced to send anything new to streaming. \n\t\n\t\tDigger (Warner Bros.)\t\n\n\tRelease date: Oct. 2 Thrill factor: It’s been a while since Tom Cruise, who once worked with Spielberg and Scorsese, put himself in the hands of a true master. He’s got one of the greatest who ever slid behind a camera in Alejandro G. Iñárritu. Chill factor: These two are partnering on the story of a powerful man who tries to save humanity from a disaster he’s unleashed. We just lived through Elon Musk and DOGE. Oh, and it’s a comedy.  Verdict: Execution dependent. Cruise’s movies are pricey, so unless he gave WB a big bargain, he and Iñárritu better deliver the next “Tropic Thunder.”  \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Box Office 2026 Predictions: Will ‘The Odyssey,’ ‘Avengers: Doomsday’ and a New ‘Star Wars’ Finally Propel Grosses Above $9 Billion?",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/cap.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-05T16:30:00.000Z",
      "dateModified": "2026-01-05T16:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "26 Coolest and Most Inspired Acting Oscar Nominated Performances This Century (So Far)",
    "url": "https://variety.com/lists/best-acting-oscars-nominations-2000-2025-ranked/",
    "image": "https://variety.com/wp-content/uploads/2025/12/Ellen-Burstyn-Denzel-Washington-Stephanie-Hsu-Brad-Pitt-Lupita-Nyongo.jpg?crop=0px%2C10px%2C1000px%2C562px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-01-05T18:30:00.000Z",
    "description": "\n\t\n\t\t\t\n\t\t\t\t\n\t\n\n\t\n\tJan 5, 2026 10:30am PT\t\n\t\n\n\t\n\t\t26 Coolest and Most Inspired Acting Oscar Nominated Performances This Century (So Far)\n\t\n\t\n\t\t\t\n\n\n\t\t\t\n",
    "body": "\n\t\n\t\t\t\n\t\t\t\t\n\t\n\n\t\n\tJan 5, 2026 10:30am PT\t\n\t\n\n\t\n\t\t26 Coolest and Most Inspired Acting Oscar Nominated Performances This Century (So Far)\n\t\n\t\n\t\t\t\n\n\n\t\t\t\n\t\t\t\n\t\n\n\t\t\t\t\t\t\t\t\tCourtesy of Everett Collection\n\t\n\n\t\t\n\t\n\t\t\t\t\n\n\tThe Oscars were never meant to be a museum (no shade to the actual Academy Museum). \n\n\tThey are a living record of what performance, film and art can look like when craft, courage and cultural timing collide. Since the turn of the century, Oscar-nominated acting has expanded far beyond prestige archetypes.\n\n\tWe’ve seen movie stars dismantle their personas, character actors seize once-in-a-lifetime spotlights, international performers redefine what Hollywood deems “universal” and first-timers arrive fully formed, carrying entire films on instinct rather than résumé.\n\n\tWhat binds the most inspiring acting nominees of this century is not merely garnering rave reviews. It’s also about risk, and these performances often challenged voter comfort, resisted sentimentality or refused to explain themselves. Inspiration, in this context, isn’t limited to victory speeches or cultural firsts, although those do matter. It’s found in the way Ellen Burstyn aged in real time on-screen without vanity, or how Riz Ahmed turned silence into a language or in how Quvenzhané Wallis used childhood imagination against despair.\n\n\tThis list isn’t about the “best acting” in the clinical sense. It’s about performances that expanded the vocabulary of mainstream cinema, redefined what Oscar recognition could look like in the modern era and have made an indelible impression. Some won, some lost, but none faded.\n\n\tFrom 2000 until now, these are the coolest and most inspiring picks by the Actors Branch.\n\n\tHonorable mentions: Melissa McCarthy, “Bridesmaids” (2011); Joaquin Phoenix, “Joker” (2019), Marisa Tomei, “In the Bedroom” (2001)\n\n\n\t\t\t\n\t\t\t\n\tMaria Bakalova — ‘Borat Subsequent Moviefilm’\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Courtesy of Amazon Studios\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tMaria Bakalova performed without a safety net. She navigated real people, unpredictable chaos and a fictional character arc simultaneously. Her work borders on miraculous. Bakalova’s nomination broke barriers for Eastern European actresses and guerrilla-style filmmaking, showing the Academy could embrace experimental work when execution is undeniable. She made the absurd feel human, which is perhaps the most complex acting challenge imaginable.\n\t\t\n\t\t\t\n\t\t\t\n\tBrad Pitt — ‘Moneyball’ (2011)\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Courtesy of Columbia Pictures\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\tSurprised by a Brad Pitt Oscar nom?\n\n\tThat’s because Pitt dismantled movie-star vanity. His Billy Beane is all clenched jaws and unfinished sentences, showing power told through restraint. The turn redefined leading-man masculinity, presenting vulnerability as strength rather than weakness. Pitt’s work helped legitimize sports dramas as Oscar vehicles beyond traditional triumph narratives, focusing on the process rather than the victory. \n\n\t\t\n\t\t\t\n\t\t\t\n\tRegina King — ‘If Beale Street Could Talk’ (2018)\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Everett Collection / Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tRegina King’s work is a maternal ferocity. She proved, in multiple sequences in Barry Jenkins’ masterful James Baldwin adaptation, that an entire performance can be defined by absolute clarity. She elevated Jenkins’ lyrical filmmaking through grounded fury, showing how Black women can still feel like leading work even when presence overwhelms screen time.\n\t\t\n\t\t\t\n\t\t\t\n\tAndrew Garfield — ‘Tick, Tick…Boom!’\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Macall Polay/Netflix\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tAndrew Garfield channels the ambition and spirit of Jonathan Larson in Lin-Manuel Miranda’s outstanding directorial debut. With musical virtuosity, Garfield’s singing and acting are simultaneously compelling without sacrificing either, raising the bar for musical biopics. \n\t\t\n\t\t\t\n\t\t\t\n\tAmerica Ferrera — ‘Barbie’ (2023)\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Warner Bros.\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tAmerica Ferrera’s monologue in “Barbie” became instant cultural shorthand. She bridges Greta Gerwig’s candy-colored satire with genuine feminist reckoning, anchoring a billion-dollar spectacle in lived frustration. Ferrera gave voice to feelings audiences didn’t realize needed articulation, turning a supporting role into the film’s emotional thesis.\n\t\t\n\t\t\t\n\t\t\t\n\tJesse Plemons — ‘The Power of the Dog’ (2021)\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: ©Netflix/Courtesy Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tJesse Plemons breaks your heart in Jane Campion’s dark western. He carved out a space in a film dominated by showier performances, proving that a supporting player can be radical through subtraction rather than addition. The work of character actors who build dread through stillness and shape how masculinity and complicity are portrayed in Westerns and period pieces was reinvented in its entirety in the modern era.\n\t\t\n\t\t\t\n\t\t\t\n\tSamantha Morton — ‘In America’ (2002)\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: ©Fox Searchlight/Courtesy Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tSamantha Morton strips away every protective layer, delivering grief as a constant undercurrent. Her performance in Jim Sheridan’s loving family drama redefined naturalistic acting in the 2000s, proving emotional transparency could compete with showier work. She captures how loss reshapes every gesture, breath and interaction without announcing it. The nomination validated quieter, less calculated performances in a category often dominated by big swings.\n\t\t\n\t\t\t\n\t\t\t\n\tYuh-jung Youn — ‘Minari’ (2020)\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Courtesy Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tYuh-jung Youn delivered a grandmother in Lee Isaac Chung’s beautiful gem, who is mischievous, abrasive, tender and unpredictable — all at the same time. Her Oscar win broke barriers for Asian and Korean actresses, bridging generations and cultures through specificity. Her acceptance speech became an instant legend, matching the performance’s fearless honesty, and was handed to her by Brad Pitt no less.\n\t\t\n\t\t\t\n\t\t\t\n\tNaomie Harris — ‘Moonlight’ (2016)\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Courtesy of A24\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tNaomie Harris disappears into addiction in Barry Jenkins’ surprise (and worthy) best picture winner. Her work gives the character dignity even in collapse, embodying the film’s central tension between love and damage between a mother and child. Harris expanded how Black motherhood and addiction have been portrayed onscreen, refusing stereotypes while honoring the soul of the story.\n\t\t\n\t\t\t\n\t\t\t\n\tJackie Earle Haley — ‘Little Children’ (2006)\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: ©New Line Cinema/Courtesy Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tJackie Earle Haley’s registered sex offender refuses easy categorization, locating danger inside vulnerability rather than menace. Every scene pulses with unease that never resolves, forcing viewers to examine their own discomfort in Todd Field’s “Little Children.” The performance resurrected Haley’s career while proving that character actors could command Oscar attention through fearlessness alone. It expanded what supporting actor work could interrogate, making the category less about charm and more about necessary provocation. \n\t\t\n\t\t\t\n\t\t\t\n\tQuvenzhané Wallis — ‘Beasts of the Southern Wild’ (2012)\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: ©Fox Searchlight/Courtesy Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tQuvenzhané Wallis embodies imagination as survival, becoming the youngest-ever best actress nominee at age 9. Wallis doesn’t perform emotion in Benh Zeitlin’s stunning debut; she inhabits it so thoroughly that acting seems besides the point. Her recognition influenced how filmmakers cast and direct children.\n\t\t\n\t\t\t\n\t\t\t\n\tDiane Lane — ‘Unfaithful’ (2002)\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: ©20thCentFox/Courtesy Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tDiane Lane charts a desire and awakening into self-destruction with terrifying consequences. Lane’s courage lives in how exposed she allows herself to be. She uses eroticism as an emotional reckoning, and not just a fantasy. Her nom showed actresses could play complicated sexuality in their 40s and receive recognition for it, challenging Hollywood’s narrow view of female desire onscreen.\n\t\t\n\t\t\t\n\t\t\t\n\tLesley Manville — ‘Phantom Thread’ (2017)\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: ©Focus Features/courtesy Everett Collect / Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tLesley Manville’s Cyril in Paul Thomas Anderson’s fashion story is power incarnated. Every glance, pause and tonal shift is a micro-adjustment that commands absolute control. It’s acting as architecture, an invisible structure that holds everything together while others claim the spotlight.\n\t\t\n\t\t\t\n\t\t\t\n\tAriana DeBose — ‘West Side Story’ (2021)\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Photo by NIKO TAVERNISE / 20th Century Studios\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tAriana DeBose exploded onscreen with precision and musical storytelling in perfect synthesis. Her Anita honors Rita Moreno’s legacy in Steven Spielberg’s remake while asserting her own authority. DeBose’s triumph as the first Afro-Latina and openly queer woman to claim the supporting actress award represents progress alongside virtuosity. Now all we need is for Hollywood to offer her more roles worthy of such a talent.\n\t\t\n\t\t\t\n\t\t\t\n\tJohn C. Reilly — ‘Chicago’ (2002)\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: ©Miramax/Courtesy Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tJohn C. Reilly had a 2002 film year that most actors dream about. Acclaimed works in “Gangs of New York,” “The Hours” and his Oscar-nominated work in “Chicago.” He transformed “Mr. Cellophane” from comic relief into the film’s bruised conscience. While everyone around him explodes in razzle-dazzle, Reilly delivers quiet devastation in a man so emotionally invisible he’s become transparent even to himself. The performance helped legitimize movie musicals in the early 2000s by grounding spectacle in recognizable human cost. \n\t\t\n\t\t\t\n\t\t\t\n\tIan McKellen — ‘The Lord of the Rings: The Fellowship of the Ring’ (2001)\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: ©Warner Bros/Courtesy Everett C\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tIan McKellen grounded Peter Jackson’s epic fantasy in emotional truth and gave a trilogy its soul. His Gandalf carries wisdom and authority without arrogance. The nom legitimized genre acting as Oscar-worthy, proving that fantasy performances could be as meaningfully profound as those in prestige drama. \n\t\t\n\t\t\t\n\t\t\t\n\tShohreh Aghdashloo — ‘House of Sand and Fog’ (2003)\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: ©DreamWorks/Courtesy Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tShohreh Aghdashloo’s voice brings a Shakespearean gravity to an immigrant tragedy, playing a woman who holds her family together through pride that becomes a prison. The restraint devastates more than any outburst could. Aghdashloo’s nomination for Vadim Perelman’s drama opened doors for Middle Eastern actresses in American cinema, proving that an accent and specificity enhance rather than limit awards consideration.\n\t\t\n\t\t\t\n\t\t\t\n\tHalle Berry — ‘Monster’s Ball’ (2001)\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tHalle Berry’s historic win as the first Black woman to claim best actress shaped industry assumptions about what Black actresses were allowed to do onscreen. Berry’s courage opened doors, but it also became a cautionary tale about Hollywood’s failure to sustain that progress. The performance in Marc Foster’s drama is a refusal to sanitize pain or desperation. She creates something new entirely.\n\t\t\n\t\t\t\n\t\t\t\n\tRiz Ahmed — ‘Sound of Metal’ (2020)\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Courtesy of Amazon Studios\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tRiz Ahmed makes the silence devastating, transforming sensory loss into an awakening. He delivers one of the most immersive performances of the century in a work that is rigorously physical and unsentimental. Ahmed’s work in writer-director Darius Marder’s remarkable “Sound of Metal” influenced how sound design and performance interact, teaching actors that restraint can communicate more than a mere demonstration. \n\t\t\n\t\t\t\n\t\t\t\n\tStephanie Hsu — ‘Everything Everywhere All at Once’ (2022)\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Courtesy Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tStephanie Hsu anchors the Daniels’ multiverse comedy “Everything Everywhere All at Once” with varied transformations, but a single heart focused on the story and the vision. While her co-stars Michelle Yeoh, Ke Huy Quan and Jamie Lee Curtis all won Oscars, it’s her performance that remains the most memorable and vibrant, standing out years after the credits rolled.\n\t\t\n\t\t\t\n\t\t\t\n\tJeffrey Wright — ‘American Fiction’ (2023)\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Courtesy of TIFF\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tJeffrey Wright uses his intelligence for comedy, balancing satire and sorrow in Cord Jefferson’s outstanding gem. His work influenced how race, art and commerce are portrayed onscreen, proving comedy and fury can coexist (if we allow it to). His Thelonious “Monk” Ellison (and his faux-author persona) becomes a witty philosophy, teaching future actors what they can do when they subvert the world’s expectations of them.\n\t\t\n\t\t\t\n\t\t\t\n\tEllen Burstyn — ‘Requiem for a Dream’ (2000)\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: ©Artisan Entertainment/Courtesy Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tEllen Burstyn charts her descent into addiction and psychosis with a terrifying, unflinching clarity in Darren Aronofsky’s drama. An emotionally annihilating turn showing loneliness calcifying into obsession, before collapsing into horror. Her work is often unbearable (by how raw she plays it) and essential, showing that great acting can traumatize while demanding you to witness it.\n\t\t\n\t\t\t\n\t\t\t\n\tYalitza Aparicio — ‘Roma’ (2018)\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Image by Alfonso Cuarón\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tYalitza Aparicio’s debut is defined by her presence in Alfonso Cuaron’s Mexican drama. She foregrounded domestic labor as a cinematic epic, giving visibility to Indigenous Mexican women that the world routinely ignores and vilifies. Her nom sparked crucial conversations about representation, class, and who gets to be a movie star. \n\t\t\n\t\t\t\n\t\t\t\n\tFernanda Torres — ‘I’m Still Here’ (2024)\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Adrian Teijido/Sony Pictures Classics\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tA barrier-breaking nomination, career-defining performance and embodiment of a woman’s (and country) survival. Fernanda Torres’ work in Walter Salles’ Brazilian drama proves great acting assembles, scene by scene, until grief becomes an endurance testimony. Torres represents everything Oscar claims to value but rarely rewards: international excellence, political courage, and restraint over showmanship.\n\t\t\n\t\t\t\n\t\t\t\n\tLupita Nyong’o — ’12 Years a Slave’ (2013)\n\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\n\tLupita Nyong’o’s debut is devastating. She shows suffering portrayed as a stolen humanity rather than an endurance. Her eyes carry terror, history and impossible resolve compressed into shattering moments. The performance announced a major artist instantly while helping Steve McQueen’s “12 Years a Slave” secure its best picture win through sheer cinematic force. She made the unbearable watchable through dignity that never flinched.\n\t\t\n\t\t\t\n\t\t\t\n\tDenzel Washington — ‘Training Day’ (2001)\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Courtesy of Warner Bros.\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tDenzel Washington detonated his charisma into a menace, subverting his entire star persona to create one of cinema’s great villains. His Alonzo Harris in Antoine Fuqua’s classic crime story is seductive even as he becomes monstrous. Washington’s win came as the second for a leading Black man, teaching that star power properly weaponized becomes more compelling than any character work. He made evil irresistible, which is cinema’s most difficult magic trick.\n\t\t\n\t\n\t\n\n\n\t\n\t\tMore from Variety\n\t\n\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\n\n\t\t\n\n\t\n\t\tMore From Our Brands\n\t\n\t\n\t\t\n\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\n\tRolling Stone\n\n\t\t\t\t\tDepeche Mode ‘M’ Docu Film Heading to Netflix\t\t\n\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\n\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\n\tRobb Report\n\n\t\t\t\t\tThis Brand-New Condo in Brooklyn Brings a Sense of Intimacy to Apartment Living\t\t\n\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\n\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\n\tSportico\n\n\t\t\t\t\tNCAA Defends House Settlement From Title IX, Opt-Out Appeal\t\t\n\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\n\t\t\n\t\n\t\n\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "26 Coolest and Most Inspired Acting Oscar Nominated Performances This Century (So Far)",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/Ellen-Burstyn-Denzel-Washington-Stephanie-Hsu-Brad-Pitt-Lupita-Nyongo.jpg?crop=0px%2C10px%2C1000px%2C562px&resize=1000%2C563"
      ],
      "datePublished": "2026-01-05T18:30:00.000Z",
      "dateModified": "2026-01-05T18:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Skateboarder Terry Kennedy Released From Prison Years After Fatal Incident",
    "url": "https://www.tmz.com/2026/01/05/terry-kennedy-skateboard-released-prison-parole/",
    "image": "https://imagez.tmz.com/image/e6/16by9/2026/01/05/e60251a6fe0f4bfeae9bd3dd086bcaf2_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-05T18:08:50.000Z",
    "description": "\n    \n                    \n                          Skateboarder Terry Kennedy\n                          Released From Prison\n                       ",
    "body": "\n    \n                    \n                          Skateboarder Terry Kennedy\n                          Released From Prison\n                          Paroled 4+ Years After Skater's Death\n                      \n                  \n                                                                        Published \n                              January 5, 2026\n                            10:08 AM PST\n                                                                      |\n                                                                Updated \n                                  January 5, 2026\n                                11:26 AM PST\n                                    \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Terry Kennedy is officially a free man ... the famed skateboarder is out on parole just over three years after he was convicted of assaulting a fellow skater -- an incident that led to the man's death.\n      \n    \n          TMZ Sports broke the story last month ... the Illinois Department of Corrections told us Kennedy -- known by fans as \"Compton-Ass Terry\" -- was eligible for parole and set to be released on New Year's Eve.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          True to the plan, Kennedy, according to inmate records, was released from custody on December 31.\n      \n\n          Kennedy was found guilty of two counts of aggravated battery and sentenced to five years in prison in late 2022 for his role in a violent July 2021 altercation that ultimately claimed the life of skater Josiah Kassahun.\n      \n    \n          Terry was also charged with first-degree murder, but was acquitted by the judge during his bench trial.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Kennedy -- who competed in the X Games and Malook Money Cup -- isn't totally free and clear ... he's still on parole until June 30, which was initially set to be his release date.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                TMZ Sports\n              \n                          \n                Crime\n              \n                          \n                Exclusive\n              \n                          \n                Fairly Legal\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Skateboarder Terry Kennedy Released From Prison Years After Fatal Incident",
      "image": [
        "https://imagez.tmz.com/image/e6/16by9/2026/01/05/e60251a6fe0f4bfeae9bd3dd086bcaf2_xl.jpg"
      ],
      "datePublished": "2026-01-05T18:08:50.000Z",
      "dateModified": "2026-01-05T18:08:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cardi B Defends Stefon Diggs Amid Allegations, Confident Chef's Lying",
    "url": "https://www.tmz.com/2026/01/05/cardi-b-defends-stefon-diggs-chef-allegations/",
    "image": "https://imagez.tmz.com/image/7b/16by9/2026/01/05/7b3289932fd44584a05af05d12e1cc1d_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-05T17:15:19.000Z",
    "description": "\n    \n                    \n                          Cardi B\n                          Passionately Defends Diggs\n                          That Chef'",
    "body": "\n    \n                    \n                          Cardi B\n                          Passionately Defends Diggs\n                          That Chef's Lying!!!\n                      \n                  \n                                                                        Published \n                              January 5, 2026\n                            9:15 AM PST\n                                                                      |\n                                                                Updated \n                                  January 5, 2026\n                                9:55 AM PST\n                                    \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          UPDATE\n  \n    \n          9:39 AM PT -- Cardi B has deleted her post ... although it's unclear why she decided to scrub it from her account.\n      \n    \n          Cardi B's proving she's a ride or die for her man -- vehemently defending Stefon Diggs as he faces serious charges ... saying his former personal chef never previously accused the star WR of getting physical.\n      \n    \n          The support came amid a tense social media exchange on Monday ... when one user pointed out Diggs' charges stemming from allegations made by his ex-employee, who claimed he choked and slapped her over a salary dispute in early December.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Cardi was having none of it ... clapping back and making it clear she won't tolerate any negative talk directed at Diggs -- 'cause she claims she has all the proof she needs to believe the chef is lying through her teeth.\n      \n\n          \"Not once has that woman said anything to me about being touched.. NOT ONCE!!,\" Cardi said on X ... while also posting a screenshot of a text she claims is from the chef, but the full context of the exchange is unclear.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          \"Mind you, we was talking every single day until she left that house and she JUST wrote me this.. but I’m gonna let the courts handle s*** and when it gets handled I want all yall talkin s*** on your f***in knees with apologies just as loud the way yall been harassing over a lie… and I put that on my two month old son in the name of the lord!! That’s how confident I am.\"\n      \n    \n          Cardi's stance echoes what Diggs' attorneys also said last week -- claiming the allegations are simply untrue. The Patriots are siding with Diggs as well ... and he went on to have three catches for 43 yards on Sunday against the Miami Dolphins.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          As of now, Diggs is slated to have his arraignment on Jan. 23 -- two days before the AFC Championship Game.\n      \n      \n              \n          \n                          \n                Cardi B\n              \n                          \n                Stefon Diggs\n              \n                          \n                Hip Hop\n              \n                          \n                Relationships\n              \n                          \n                TMZ Sports\n              \n                          \n                Crime\n              \n                          \n                Fairly Legal\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cardi B Defends Stefon Diggs Amid Allegations, Confident Chef's Lying",
      "image": [
        "https://imagez.tmz.com/image/7b/16by9/2026/01/05/7b3289932fd44584a05af05d12e1cc1d_xl.jpg"
      ],
      "datePublished": "2026-01-05T17:15:19.000Z",
      "dateModified": "2026-01-05T17:15:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Influencer Yulia Burtseva Dies at 38 After Undergoing Cosmetic Surgery",
    "url": "https://www.tmz.com/2026/01/05/influencer-yulia-burtseva-dead-cosmetic-surgery/",
    "image": "https://imagez.tmz.com/image/7d/16by9/2026/01/05/7d2e021d94454c488017cab3d3a5c6c3_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-05T18:18:52.000Z",
    "description": "\n    \n                    \n                          Influencer Yulia Burtseva\n                          Dead at 38 After Cosmetic Surgery\n           ",
    "body": "\n    \n                    \n                          Influencer Yulia Burtseva\n                          Dead at 38 After Cosmetic Surgery\n                      \n                  \n                                                                        Published \n                              January 5, 2026\n                            10:18 AM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Tragedy to start the year -- Yulia Burtseva, an Italian influencer, has died at just 38 after undergoing cosmetic surgery in Moscow.\n      \n    \n          The social media star went under the knife at a private clinic in Moscow on Jan. 4 -- but things took a devastating turn when her condition rapidly worsened. She was rushed to the hospital soon after and later pronounced dead, according to Russian outlet MSK1.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          The outlet reports Moscow investigators have now opened a criminal case, looking into possible negligence tied to the procedure. Officials say multiple forensic tests are being ordered -- including a medical examination -- as they work to determine what went wrong.\n      \n\n          Burtseva lived in Naples, Italy, with her husband Giuseppe and young daughter, and built a following of more than 73K by sharing family moments online.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Her final post came the morning of the surgery -- a video on Russian social media platform VK from a Moscow coffee shop, captioned, “Good morning Moscow 😘.”\n      \n    \n          She was 38.\n      \n    \n          RIP\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Social Media\n              \n                          \n                RIP\n              \n                          \n                Instagram\n              \n                          \n                Influencers\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Influencer Yulia Burtseva Dies at 38 After Undergoing Cosmetic Surgery",
      "image": [
        "https://imagez.tmz.com/image/7d/16by9/2026/01/05/7d2e021d94454c488017cab3d3a5c6c3_xl.jpg"
      ],
      "datePublished": "2026-01-05T18:18:52.000Z",
      "dateModified": "2026-01-05T18:18:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nicolás Maduro's Nike Tracksuit He Wore Landing In U.S. Sells Out",
    "url": "https://www.tmz.com/2026/01/05/nicolas-maduro-venezuela-dictator-nike-tracksuit-sells-out/",
    "image": "https://imagez.tmz.com/image/68/16by9/2026/01/05/6892bf8a056f4b3bb320d769ce9c8d1f_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-05T16:06:23.000Z",
    "description": "\n    \n                    \n                          Nicolás Maduro\n                          Arrest Outfit Breaks The Internet!!!\n                   ",
    "body": "\n    \n                    \n                          Nicolás Maduro\n                          Arrest Outfit Breaks The Internet!!!\n                      \n                  \n                                                                        Published \n                              January 5, 2026\n                            8:06 AM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Nobody -- and we mean nobody -- thought fashion would enter the chat after ousted Venezuelan dictator Nicolás Maduro got scooped up by U.S. forces... but the internet did what it does best, turning his landing-day tracksuit into a sold-out hot commodity!\n      \n    \n          Yep, that grey Nike Tech Fleece jacket and matching joggers retailing at $140 flew off shelves within hours of Donald Trump posting the now-viral Truth Social pic of Maduro being transported on the USS Iwo Jima to NYC on Saturday.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          The memes are everywhere online -- Maduro in that tracksuit, fit pics and all, making the rounds online like it’s a full-blown fashion rollout.\n      \n\n          And yeah, it does look comfy... but LBR -- it’s probably the last time he’s gonna be comfortable for a long while!\n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          As you know, Maduro and his wife Cilia Flores were both indicted on drug and weapons charges -- and on Monday, the couple was hauled from a NYC detention facility to federal court, where their initial appearances are expected to be quick, no-frills, and strictly procedural.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Nicolás Maduro\n              \n                          \n                Donald Trump\n              \n                          \n                President Trump\n              \n                          \n                Fashion & Apparel\n              \n                          \n                Politix\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nicolás Maduro's Nike Tracksuit He Wore Landing In U.S. Sells Out",
      "image": [
        "https://imagez.tmz.com/image/68/16by9/2026/01/05/6892bf8a056f4b3bb320d769ce9c8d1f_xl.jpg"
      ],
      "datePublished": "2026-01-05T16:06:23.000Z",
      "dateModified": "2026-01-05T16:06:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Mickey Rourke Checks Into West Hollywood Hotel With Dog Amid Threat of Eviction",
    "url": "https://www.tmz.com/2026/01/05/mickey-rourke-checks-into-hotel-amid-eviction-threat/",
    "image": "https://imagez.tmz.com/image/d8/16by9/2026/01/05/d8bdf8b7ae5f45938faea64b00658774_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-05T16:43:30.000Z",
    "description": "\n    \n                    \n                          Mickey Rourke\n                          Checks Into Hotel With Dog\n                          ...A",
    "body": "\n    \n                    \n                          Mickey Rourke\n                          Checks Into Hotel With Dog\n                          ...Amid Eviction Threat\n                      \n                  \n                                                                        Published \n                              January 5, 2026\n                            8:43 AM PST\n                                                                      |\n                                                                Updated \n                                  January 5, 2026\n                                10:24 AM PST\n                                    \n      \n    \n          Mickey Rourke has been desperately trying to avoid eviction from his L.A. home ... and we now have photos of the actor checking into a hotel.\n      \n    \n          It's unclear whether MR was officially kicked out of his home, but the 73-year-old Golden Globe winner was snapped Sunday checking into a hotel in West Hollywood with his dog in tow.\n      \n    \n          Mickey looked a little rough with a bandaged thumb and pants hanging below the waist. He also donned a wig under a cowboy hat, concealing his recently shaved head.\n      \n\n                  \n          \n                          \n                \n                  \n      \n    \n          As we reported ... Mickey is allegedly $59,100 behind on rent payments and allowed a friend to launch a GoFundMe on his behalf. The fundraiser set a goal of $100,000 to help Mickey avoid eviction.\n      \n    \n          The fundraiser page states the goal is ... \"to give Mickey some stability and peace of mind during a stressful time -- so he can stay in his home and have the space to get back on his feet. Any donation, no matter the size, will make a real difference. And if you’re not able to contribute, sharing this page is a huge help and deeply appreciated. Thank you so much for your kindness, compassion, and support.”\n      \n    \n          At the time of publishing, the fundraiser has reached nearly 70 percent of its goal.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Mickey Rourke\n              \n                          \n                Celebrity News\n              \n                          \n                Movies\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Mickey Rourke Checks Into West Hollywood Hotel With Dog Amid Threat of Eviction",
      "image": [
        "https://imagez.tmz.com/image/d8/16by9/2026/01/05/d8bdf8b7ae5f45938faea64b00658774_xl.jpg"
      ],
      "datePublished": "2026-01-05T16:43:30.000Z",
      "dateModified": "2026-01-05T16:43:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]