[
  {
    "title": "Square Eyes Acquires ‘The Kartli Kingdom’ Ahead of IDFA World Premiere (EXCLUSIVE)",
    "url": "https://variety.com/2025/film/global/square-eyes-the-kartli-kingdom-idfa-1236553252/",
    "image": "https://variety.com/wp-content/uploads/2025/10/The-Kartli-Kingdom.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-15T08:13:49.000Z",
    "description": "\n\tVienna-based sales outlet Square Eyes has secured international rights to “The Kartli Kingdom,” directed by Tamar Kalandadze and Julien Pebrel. The ",
    "body": "\n\tVienna-based sales outlet Square Eyes has secured international rights to “The Kartli Kingdom,” directed by Tamar Kalandadze and Julien Pebrel. The film is set to world premiere in the International Competition at the International Documentary Festival Amsterdam (IDFA), taking place Nov. 13-23.\n\n\t“Kartli” refers both to Georgia’s medieval kingdom and a Tbilisi sanatorium sheltering refugees from the 1990s war in Abkhazia, meant as temporary but lasting 30 years. The collapsing building became a recreated “country”: a farm, garden, terraces, and rooms where old VHS tapes revive memories of Abkhazia, their lost paradise. Through Tamuna, Irma and others, the film reveals the exile’s trauma and shared resilience. Even if time seems frozen in Kartli’s walls, nothing stays the same.\n\t\n\n\t“Our film narrates a community’s story through the shelter of Kartli: past, present and imagined future, lending gentleness, violence, sadness, memories, and humor,” Kalandadze and Pebrel commented. “These layers of time merge in editing, combining image and sound materials. Memories, words and tales of Kartli’s past shape its inhabitants’ lives, forming foundational myths. These stories, like an underground stream, resurface during conversations, interrupting scenes we filmed. Archival footage adds bursts of collective memory, showing the 1992 war’s impact on the community.”\n\n\n\t“We love how the film gives us a glimpse inside the walls of the Kartli sanatorium, where the collective memory of the 1992 war in Abkhazia and the current lives of the residents mix into a touching and poetic documentary,” stated Wouter Jansen, CEO of Square Eyes. “The mix of these two narratives makes the film a perfect match for our catalog.”\n\t\n\n\t“The Kartli Kingdom” is produced by Ketevan Kipiani for Giorgia’s Sakdoc Film and Jean-Baptiste Bonnet for Habilis Productions in France. Square Eyes is in charge of world sales.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Square Eyes Acquires ‘The Kartli Kingdom’ Ahead of IDFA World Premiere (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/The-Kartli-Kingdom.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-15T08:13:49.000Z",
      "dateModified": "2025-10-15T08:13:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘High Wire’ Director Calif Chong on Stephen Chow Dreams, BFI London Film Festival Premiere and Making Immigration Funny",
    "url": "https://variety.com/2025/film/festivals/high-wire-calif-chong-stephen-chow-bfi-london-film-festival-racism-1236553223/",
    "image": "https://variety.com/wp-content/uploads/2023/05/Isabella-Wei-High-Wire.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-15T07:04:21.000Z",
    "description": "\n\tWhen Calif Chong was growing up in a working-class Hong Kong household, no one in her family went to the cinema. But Stephen Chow’s comedies changed",
    "body": "\n\tWhen Calif Chong was growing up in a working-class Hong Kong household, no one in her family went to the cinema. But Stephen Chow’s comedies changed everything for her.\n\n\t“I thought, oh my God, if I could become the female version of Stephen Chow, how cool would that be?” Chong recalls. “You make everyone laugh. You make everyone just love films.”\n\n\tNow, with her feature debut “High Wire” world premiering at the BFI London Film Festival, Chong has achieved something equally ambitious: crafting a comedy-drama that speaks to the immigrant experience while making audiences laugh and feel.\n\t\n\n\t“High Wire” follows Go-wing, a British-Chinese takeaway girl who discovers her inner strength and artistic bravery when a circus comes to her small English town. The film stars Isabella Wei, known for her breakout role in Netflix’s “1899,” alongside Hong Kong actor Dominic Lam.\n\n\n\tFor Chong, the project represents a deliberate choice to make her debut feature a comedy. “My short film [“Underneath”] was really hard drama, and while making, it was really difficult,” she explains. “I wanted this full-length film to be enjoyable throughout for everyone who makes the film, who acts, who edits the film. We try to make people laugh. That’s the goal.”\n\n\tBut beneath the humor lies something deeper. The film explores family dynamics within the Chinese community, a subject Chong feels hasn’t been portrayed with enough nuance on screen. “In the Chinese community, the family relationship is still very complex, but it’s not portrayed well,” she says. “It’s always a bit sad. I come from that background, and I know there is a lot of trauma, but for my debut, I wanted to be a mix of hard drama, but also comedy.”\n\t\n\n\tChong’s journey to filmmaking was unconventional. She started as a creative trainee at TVB, Hong Kong’s major television network, working as a junior scriptwriter for two years. She then collaborated with director Lawrence Lau on film scripts, though the financial realities of Hong Kong’s screenwriting landscape proved challenging.\n\n\t“I really couldn’t afford that lifestyle, so I had to work,” Chong explains. She took a job at RTHK, Hong Kong’s equivalent of the BBC, working in documentary filmmaking before eventually winning a pitching competition at the Berlin Film Festival. That success convinced her to pursue international opportunities.\n\n\tShe moved to London to study at the London Film School, taking on significant debt to make it happen. “Me and my mom kind of made it work,” she says. “And yeah, here I am. Made my first feature and screening in London Film Festival.”\n\n\tCasting the lead role presented unique challenges. Chong needed someone who could speak both English and Cantonese fluently, read Chinese script, dance professionally, and rollerblade — a particularly niche skill in the U.K. Wei, a Hong Kong actress and dancer who made her television debut in Netflix’s “1899,” proved to be the perfect fit. “She is just perfect. She ticks all the boxes,” Chong says. “She’s bilingual, she can read Chinese, her acting is amazing.”\n\n\tWhat surprised Chong was how Wei’s interpretation added unexpected depth to the character. Where Chong had initially envisioned Go-wing as upbeat and extroverted, Wei brought an introverted quality that resonated deeply with the director’s own experience.\n\n\t“I see myself there,” Chong reflects. “I’m not extroverted when I’m being put in a foreign place. You’re kind of timid, you’re kind of second-guessing yourself, you kind of worry you’re not going to fit in. Her portrayal in a different way kind of brings more complexity, which I never imagined.”\n\n\tThe circus element came about through producer connections, Djonny Chen of Silent D Pictures, but Chong immediately saw its potential as a metaphor for the immigrant experience. Working with Circus Extreme, she was struck by how modern circus pushes human limits — much like immigrants pushing against societal constraints.\n\n\t“People don’t see it as an art form, somehow,” she notes. “That’s kind of the same as how the Western world had misconceptions of Asian people. They don’t understand Asian culture, and then they portray Asian people in a certain way on screen.”\n\t\n\n\tWorking with cinematographer Matthew P. Scott, Chong created distinct visual languages for Go-wing’s two worlds. In the takeaway, camera movements are static and still, reflecting constraint. In the circus, everything flows in circles, reflecting freedom and possibility.\n\n\tThe North Yorkshire landscape also became a character itself. “Hong Kong is so packed, and you feel so suffocated,” Chong explains. “Whereas in Yorkshire, it’s the other way around. It’s extremely vast, it’s extremely nothing else. It’s wilderness.”\n\n\tDepicting racism proved one of the film’s most delicate challenges. Chong, who has experienced racism firsthand since moving to the U.K., was determined not to make “High Wire” a message movie.\n\n\t“I really wanted to play it out as comedy,” she explains. “We do have some racial slurs written, but that was real. I didn’t make it up. But the most important thing is we don’t drill into those. We don’t focus on those hatred towards us.”\n\n\tThe film intentionally includes a white British friend, to reflect the reality of genuine cross-cultural friendships. “That’s real life. We do make friends,” Chong says. “We can’t just focus on a small group of people who don’t know us. We focus on the people who want to.”\n\n\tRecent events in the U.K. — including anti-immigrant protests — have made the film feel even more urgent. Chong describes a distressing incident in the London tube where she heard anti-immigrant rhetoric. “Sometimes your reality is one thing, but people around you make you feel like something else,” she reflects. “You feel like you’re still other group.”\n\n\tBeyond the London Film Festival premiere, Chong hopes to bring “High Wire” to Hong Kong audiences. She’s already working on her next project, exploring thriller and dark comedy territory, and is interested in directing television, citing shows like “Slow Horses” and “The Gentlemen” as inspirations.\n\n\t“I just love shows like that,” she says. “I want to see some women directing these really male-driven stories.”\n\n\tFor now, Chong hopes “High Wire” will resonate globally. “I want it to be something really reachable, accessible. Anyone can watch it, not just British Hong Kong immigrants, not just Asian immigrants, but I think it should speak to any immigrants,” she says. “I hope films is the one thing that can draw us together and we can welcome each other.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘High Wire’ Director Calif Chong on Stephen Chow Dreams, BFI London Film Festival Premiere and Making Immigration Funny",
      "image": [
        "https://variety.com/wp-content/uploads/2023/05/Isabella-Wei-High-Wire.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-15T07:04:21.000Z",
      "dateModified": "2025-10-15T07:04:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Fremantle’s Doc ‘Luca: Seeing Red’ Not Just About Ferrari, Argue Protagonist Luca di Montezemolo and Director Manish Pandey: ‘Family, Italy, Loyalty’",
    "url": "https://variety.com/2025/tv/global/luca-seeing-red-ferrari-luca-di-montezemolo-manish-pandey-1236552745/",
    "image": "https://variety.com/wp-content/uploads/2025/10/Use-This-as-the-Lead-Photo-1.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-15T06:00:00.000Z",
    "description": "\n\tFremantle’s new documentary “Luca: Seeing Red” takes on the former Ferrari chairman Luca di Montezemolo. But it’s not just about Ferrari. \n\n\t“That w",
    "body": "\n\tFremantle’s new documentary “Luca: Seeing Red” takes on the former Ferrari chairman Luca di Montezemolo. But it’s not just about Ferrari. \n\n\t“That was one of the conditions. First – it won’t be just about Ferrari. Second – it won’t be fiction. You don’t want to see an actor playing Kimi Räikkönen, you want to see Kimi Räikkönen. Third – it won’t be about my private life,” di Montezemolo tells Variety in Cannes.\n\t\n\n\t“If you’re passionate about racing and cars, you’ll see them. You’ll see Enzo Ferrari, Michael Schumacher, Niki Lauda’s accident and his face, scarred by fire. But this film is also about Italy.”\n\n\n\tAs well as di Montezemolo’s other ventures, from the launch of yacht racing team Azzurra – “People named their daughters after it!” – to co-founding train transport company Italo and spearheading the final concert of Three Tenors. \n\n\t“It was difficult to convince Pavarotti. He said: ‘Why do I have to share [the stage] with these two guys? I can do it myself’,” he laughs, recalling the event that united Pavarotti with Plácido Domingo and José Carreras. \n\n\t“This movie has given me the possibility to reflect on all the things I’ve done.”\n\n\tJoined by “Top Gear’s” Chris Harris, in the doc, di Montezemolo’s looking back on a long road that started in the 1970s when Enzo Ferrari hired him as an assistant. \n\n\t “I was only 25 years old, but I’ve always liked to take risks and put my face up front. I won 19 Formula One championship titles, but I know how much work is behind these victories. You have to pick the right people and have clear goals, but I’ve been lucky to have art in my life, my family and my friends. Apart from maybe your health, these are the absolute priorities.”\n\t\n\n\tWhile the film – presented to buyers at Mipcom – offers “a nice mix of archive and new material,” some of the glamour remains intact. \n\n\t“Ferrari is a myth,” states di Montezemolo. \n\n\t“Even Räikkönen, when he started to race for Sauber and McLaren, told me Ferrari was always his dream [he won the 2007 Formula One World Championship while driving for it]. There’s this beautiful shot of a red Ferrari in the film, in Bologna’s square called Piazza delle Sette Chiese. We are showing different Italy from that stereotypical [combo] of Florence, Venice and Rome.” \n\n\tDirector Manish Pandey, also behind award-winning “Senna,” notes: “For me, this film is about two things. The background is Italy, of course, but it’s about loyalty and about family. That’s the common theme in every single frame. There’s a key line right at the end: ‘Apart from my family, Ferrari is the most important thing in my life’.”\n\n\t“To tell this story, you need to understand Luca and you need to understand Italy. That’s why we put him together with Chris, who sees Luca as a father figure,” he says, calling the third act of the film “essential.”\n\n\t“You see him always saying ‘yes’ to the Agnellis [behind Fiat], and then they give him the impossible job. And that’s suddenly when Chris is in the film. There’s a turning point. He spends two thirds of the story listening. But in the last act, he’s absolutely a part of the drama. And it’s a difficult one: it’s a corporate assassination, happening right in front of you.” \n\n\tThe film was already shown in Rome and in London.\n\n\t“Obviously, this is not a fictional Formula One movie with Brad Pitt. But [theatrical partner] Everyman Cinemas saw it and loved it. They put it in 30 cinemas and 18 of these screenings were completely sold out,” says Pandey. In Rome, it was shown to selected audience at the Parco della Musica Auditorium. \n\n\t“I was so happy that 900 people came there for me, and not for some actor or actress. I didn’t expect it,” adds di Montezemolo. “In Rome, when people watch a film, they usually talk to each other or comment. Now, it was silent.”  \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Fremantle’s Doc ‘Luca: Seeing Red’ Not Just About Ferrari, Argue Protagonist Luca di Montezemolo and Director Manish Pandey: ‘Family, Italy, Loyalty’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/Use-This-as-the-Lead-Photo-1.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-15T06:00:00.000Z",
      "dateModified": "2025-10-15T06:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Samsara,’ ‘It Was Just an Accident,’ ‘Magellan’ Lead Asia Pacific Screen Awards Nominations",
    "url": "https://variety.com/2025/film/awards/apsa-nominations-samsara-it-was-just-an-accident-magellan-1236553220/",
    "image": "https://variety.com/wp-content/uploads/2025/10/Samsara.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-15T06:16:46.000Z",
    "description": "\n\tGarin Nugroho’s “Samsara,” Jafar Panahi’s “It Was Just an Accident” and Lav Diaz’s “Magellan” are among the top nominees for the 18th Asia Pacific S",
    "body": "\n\tGarin Nugroho’s “Samsara,” Jafar Panahi’s “It Was Just an Accident” and Lav Diaz’s “Magellan” are among the top nominees for the 18th Asia Pacific Screen Awards (APSA), the Asia Pacific Screen Academy has revealed.\n\n\tThe Indonesian drama “Samsara” leads with three nominations, while “It Was Just an Accident” (Iran, France, Luxembourg) and “Magellan” (Portugal, Spain, France, Philippines, Taiwan) each earned two nominations. Cai Shangjun’s “The Sun Rises on Us All” (China) and Sho Miyake’s “Two Seasons, Two Strangers” (Japan) round out the best film category, also with two nominations apiece.\n\t\n\n\tThese five films are competing in additional categories including best director, best cinematography and best performance. “Yunan” (Germany, Canada, Italy, Palestine, Qatar, Jordan, Saudi Arabia) also earned multiple nominations for best cinematography and best performance.\n\n\n\tIn a notable trend, 48% of the directors of nominated films are presenting only their first or second feature, underscoring the awards’ role in launching emerging talent from the region. The best animated film category is particularly striking, with all nominated directors making their directorial debuts.\n\n\t“With almost half the nominated works being debut features, 2025 is a testament to the vitality and innovation of emerging voices across our diverse region,” said Tracey Vieira, chair of the Asia Pacific Screen Awards.\n\n\tThe ceremony will take place Nov. 27 at The Langham, Gold Coast and Jewel Private Residences, in partnership with strategic sponsor Jewel Private Residences. The event runs alongside the 7th Asia Pacific Screen Forum, scheduled for Nov. 24-27, under the theme Beyond Borders.\n\t\n\n\tThe forum will focus on five key areas: transcending boundaries through innovative collaborations, cultural bridge-building, self-empowerment in a fragmented world, innovation over convention, and transforming vision into reality. Programming includes the initiative Post Code Doesn’t Matter, led by Women in Film & Television Australia, sessions on development and breaking into new markets, and country-specific roundtables.\n\n\t“It is an exciting time for the Gold Coast to host this important event where we will see filmmakers across the Asia Pacific region come with a project and leave with a pathway,” Vieira added.\n\n\tThe event is supported by major partners including the City of Gold Coast, Screen Queensland, Motion Picture Association Asia Pacific, The Langham Gold Coast, and The Post Lounge Group.\n\n\tAPSA represents 78 countries and areas across the Asia Pacific region.\n\n\tFULL LIST OF NOMINEES\n\n\tBest Film“It Was Just an Accident” — Islamic Republic of Iran, France, Luxembourg. Directed by Jafar Panahi“Magellan” — Portugal, Spain, France, Philippines, Taiwan. Directed by Lav Diaz“Samsara” — Indonesia. Directed by Garin Nugroho“The Sun Rises on Us All”  — People’s Republic of China. Directed by Cai Shangjun“Two Seasons, Two Strangers” — Japan. Directed by Sho Miyake\n\n\tBest DirectorAmir Azizi for “Inside Amir”  — Islamic Republic of IranJafar Panahi for “It Was Just an Accident” — Islamic Republic of Iran, France, LuxembourgAkio Fujimoto for “Lost Land”  — Japan, France, Malaysia, GermanyGarin Nugroho for “Samsara” — IndonesiaSengedorj Janchivdorj for “Silent City Driver” — Mongolia\n\n\tBest ScreenplayShu Qi for “Girl”  — TaiwanNawapol Thamrongrattanarit for “Human Resource” — ThailandAnnemarie Jacir for “Palestine 36” — Palestine, U.K., France, Denmark, Norway, Qatar, Saudi Arabia, JordanChie Hayakawa for “Renoir” — Japan, France, Singapore, Philippines, Indonesia, QatarKaouther Ben Hania for “The Voice of Hind Rajab” — Tunisia, France\n\n\tBest PerformanceKhairiah Nathmy for “Hijra” — Saudi Arabia, Iraq, Egypt, U.K.Sean Lau for “Papa” — Hong KongXin Zhilei for “The Sun Rises on Us All” — People’s Republic of ChinaAriel Bronz for “Yes”  — France, Israel, Cyprus, GermanyGeorges Khabbaz for “Yunan” — Germany, Canada, Italy, Palestine, Qatar, Jordan, Saudi Arabia\n\t\n\n\tBest Youth Film“Amoeba” — Singapore, Netherlands, France, Spain, Republic of Korea. Directed by Tan Siyou“Before the Bright Day” — Taiwan. Directed by Tsao Shih-Han“The President’s Cake” — Iraq, U.S., Qatar. Directed by Hasan Hadi“Village Rockstars 2” — India, Singapore, People’s Republic of China. Directed by Rima Das“The World of Love” — Republic of Korea. Directed by Yoon Ga-eun\n\n\tBest Animated Film“Another World” — Hong Kong. Directed by Tommy Ng Kai Chung“ChaO” — Japan. Directed by Yasuhiro Aoki“The Lost Tiger” — Australia. Directed by Chantelle Murray“The Square” — Republic of Korea. Directed by Kim Bo-sol“A Story About Fire” — People’s Republic of China. Directed by Wenyu Li\n\n\tBest Documentary Film“10s Across the Borders” — Philippines, Singapore, Germany. Directed by Chan Sze-Wei“Always” — U.S., France, People’s Republic of China, Taiwan. Directed by Deming Chen“Put Your Soul on Your Hand and Walk” — France, Palestine. Directed by Sepideh Farsi“We Live Here” — Kazakhstan. Directed by Zhanana Kurmasheva“Writing Hawa” — France, Netherlands, Qatar, Afghanistan. Directed by Najiba Noori\n\n\tBest CinematographyArtur Tort, Lav Diaz for “Magellan” — Portugal, Spain, France, Philippines, TaiwanPrabhath Roshan for “Riverstone” — Sri LankaBatara Goempar for “Samsara” — IndonesiaYuta Tsukinaga for “Two Seasons, Two Strangers”  — JapanRonald Plante for “Yunan” — Germany, Canada, Italy, Palestine, Qatar, Jordan, Saudi Arabia\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Samsara,’ ‘It Was Just an Accident,’ ‘Magellan’ Lead Asia Pacific Screen Awards Nominations",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/Samsara.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-15T06:16:46.000Z",
      "dateModified": "2025-10-15T06:16:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Robbie Brenner Steps Up TV Production at Mattel Studios as Toymaker’s ‘Masters of the Universe,’ ‘Matchbox,’ ‘Barney’ Franchises Head to Theaters",
    "url": "https://variety.com/2025/film/news/robbie-brenner-tv-mattel-studios-1236553077/",
    "image": "https://variety.com/wp-content/uploads/2025/10/MIPCOM2025-1593-e1760484703794.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-15T00:59:48.000Z",
    "description": "\n\tCANNES — Robbie Brenner told Mipcom attendees that the toymaker is focused on stepping up its TV development and production now that the Mattel Stud",
    "body": "\n\tCANNES — Robbie Brenner told Mipcom attendees that the toymaker is focused on stepping up its TV development and production now that the Mattel Studios arm has been unified under her leadership as president and chief content officer. \n\n\tBrenner spoke Tuesday with Leo Barraclough, Variety‘s international features director, in the keynote address on Day 2 of the Mipcom content market. Brenner detailed her unlikely journey from independent film producer to Mattel Studios leader. She reflected on the out of the box success of “Barbie,” which was Mattel’s first feature film effort under the new regime led by CEO Ynon Kreiz, who recruited Brenner to the toymaker in 2018 to drive the key component of his strategy to transform Mattel into a media and entertainment firm in addition to its consumer toy and game businesses.\n\t\n\n\t“It’s not very often get to go to work and dream every day,” Brenner said of her role. After joining the company she was impressed at Mattel’s culture of detail and innovation. She appreciates Mattel’s history of “having the integrity to make these toys the best they can be,” Brenner said. Her job is to “find ways to honor that and celebrate the brands do it I a way feels interesting an out of the box and unexpected.”\n\n\n\tBrenner explained to Barraclough how Mattel tries to cast the creative auspices of its projects well with distinctive writers, directors, producers and stars who have a feel for the material. Travis Knight, the writer-director steering Mattel’s second feature film release, “Masters of the Universe,” is a “fanboy” who grew up playing with the action figures and knows the mythos behind them. The live-action film starring Nicholas Galitzine, Camila Mendes and Idris Elba bows June 5, distributed by Amazon MGM Studios.\n\t\n\n\t“He knows the characters,” she said of Knight. “His attention to detail has been wonderful to watch.”\n\n\tThe same is true for Daniel Kaluuya, who is taking on a fresh take on the purple dino for A24, with Ayo Edebiri co-starring. Stunt peformer turned director Sam Hargraves is in the driver’s seat for the “Matchbox” feature in the works with John Cena and Jessica Biel. And one day before Brenner’s Mipcom appearance, her studio unveiled a pact with M. Night Shamalayan to develop a series based on the iconic  Magic 8 Ball toy.\n\n\t“Television is a big push for us – I feel good about where my team is,” Brenner said. Brenner had been the company’s head of film. She was promoted in June to oversee TV as well. She firmly believes there will be benefits to the tighter alignment. \n\n\t“Everything historically has been so separated” between film and TV at studios,” Brenner said. “Everything really is so blended today….For us to all exist under the umbrella together — we figure out what is the best past forward for each one of these brands to navigate that together as television and theatrical.”\n\n\t(Pictured: Variety’s Leo Barraclough with Mattel Studios’ Robbie Brenner at Mipcom in Cannes on Oct. 14)\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Robbie Brenner Steps Up TV Production at Mattel Studios as Toymaker’s ‘Masters of the Universe,’ ‘Matchbox,’ ‘Barney’ Franchises Head to Theaters",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/MIPCOM2025-1593-e1760484703794.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-15T00:59:48.000Z",
      "dateModified": "2025-10-15T00:59:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "FilmSharks Secures Rights to Political Action Thriller Project ‘Insurrección,’ Teams With ‘El Capo’s’ Marlon Moreno (EXCLUSIVE)",
    "url": "https://variety.com/2025/film/global/filmsharks-insurreccion-marlon-moreno-latin-american-thriller-1236552935/",
    "image": "https://variety.com/wp-content/uploads/2025/10/MARLON-MORENO.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-15T06:00:00.000Z",
    "description": "\n\tGuido Rud‘s Buenos Aires-based FilmSharks has secured all rights — including derivative IP — to “Insurrección,” a provocative and politically charge",
    "body": "\n\tGuido Rud‘s Buenos Aires-based FilmSharks has secured all rights — including derivative IP — to “Insurrección,” a provocative and politically charged action-thriller film project, teaming with acclaimed Colombian actor-producer Marlon Moreno (“El Capo,” “Dog Eat Dog”).\n\n\tWritten by Colombian screenwriter Mauricio Marulanda González, “Insurrección” is in development with plans for dual Spanish and English-language versions.\n\t\n\n\tEnvisioned as “Public Enemy” meets “The Bourne Identity” (meets “Nuevo Orden”), the project seeks to fuse high-octane genre storytelling with a sharp sociopolitical pulse.\n\n\n\tFor the Spanish-language version, Marlon Moreno – of Disney+ TV series “El Capo,” Sundance hit “Dog Eat Dog,” Netflix top ranked series “La Venganza de Analía” and box office success “Corazón de León” –  is joining as executive producer and creative collaborator, bringing both star power and creative vision.\n\n\tSet against a backdrop of corruption and social unrest, “Insurrección” follows Nicolás Díaz, a law professor who, disillusioned by the system, leads a masked insurgent cell that live-streams the trials and executions of high-ranking politicians. \n\n\tAs their message electrifies the public, state forces hunt to unmask the mysterious leader —only to discover he has assumed the identity of a man who died 22 years earlier.\n\n\tThe project fits FilmSharks’ strategy of developing bold, socially reflective IPs with crossover potential.\n\n\t“You have to bet on stories with impact, without fearing whether they’re politically correct or not,” Rud told Variety. \n\t\n\n\t“‘Insurrección’ echoes the unrest of Ibero-American societies – a cry against inequality and manipulation. It’s an IP built for high controversy, deep debate, and massive audience engagement.”\n\n\tMoreno described the project as an artistically ambitious and emotionally resonant reflection of today’s world.\n\n\t“It’s not just a story — it’s a pulse, a collective and intimate call to question power, memory, and dignity,” he said. “It merges the personal and the epic to interrogate the times we live in.”\n\n\tThe announcement strengthens FilmSharks’ position as one of Ibero-America’s leading indie movie outfits. With over 35 production credits and partnerships with Sony, Warner Bros., Universal, Disney, Videocine, and Patagonik, FilmSharks continues expanding from sales and remakes into high-concept original development.\n\n\tA force in the crossover world of Latin American and Hollywood cinema, Rud is also involved in upcoming or recent titles such as Demian Rugna’s genre film “Félix,” sci-fi movie “Pacífico,” with “Undertow’s” Manolo Cardona; Pancho Rodríguez’s Disney-backed thriller “Abracadáver” and Hugo Cardozo’s “Do Not Enter,” sold to over 45 territories for theatrical release.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "FilmSharks Secures Rights to Political Action Thriller Project ‘Insurrección,’ Teams With ‘El Capo’s’ Marlon Moreno (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/MARLON-MORENO.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-15T06:00:00.000Z",
      "dateModified": "2025-10-15T06:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Dancing With the Stars’: Danielle Fishel Reunites With Bill Daniels and ‘Boy Meets World’ Cast for Emotional Tribute Dance",
    "url": "https://variety.com/2025/tv/news/danielle-fishel-boy-meets-world-reunion-dancing-with-the-stars-1236552103/",
    "image": "https://variety.com/wp-content/uploads/2025/10/179544_EM207929.jpg?crop=0px%2C17px%2C1000px%2C562px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-10-15T01:50:12.000Z",
    "description": "\n\tThe “Boy Meets World” cast is back together to support Topanga.\n\n\tDuring Tuesday’s dedication night on “Dancing With the Stars,” Danielle Fishel dan",
    "body": "\n\tThe “Boy Meets World” cast is back together to support Topanga.\n\n\tDuring Tuesday’s dedication night on “Dancing With the Stars,” Danielle Fishel danced to the theme song from the hit sitcom in a number honoring William Daniels, who played Mr. George Feeny.\n\n\tFishel danced a jive with her partner, Pasha Pashkov. Daniels, 98, joined the duo in the routine, sitting at the teacher’s desk holding a paper with an A+ on it. She received her first 8 of the season, landing a 29 of 40.\n\t\n\n\t“When Danielle first came on ‘Boy Meets World,’ I knew she would be the smartest and the leader of the group. It has been such a pleasure to watch her grow and develop as an actress, as a student, and then as a mother, as well as a director and producer,” Daniels said in a statement. “It is rewarding that so many thousands of fans have spoken to me about my influence in their lives as Mr. Feeney. It is really incredible. And all of the ‘BMW’ cast has certainly played a part in that. We see each other and still love each other.”\n\n\n\tHe added, “Being on the stage is certainly nothing new to me, so I’m just happy that I can still manage to appear here tonight in honor of Danielle’s talent and achievement.”\n\n\tMany members from the cast were also in the audience, including Will Friedle (Eric Matthews), Betsy Randle (Amy Matthews), William Russ (Alan Matthews), Trina McGee (Angela Moore), Bonnie Bartlett (Lila Bolander and Williams’ wife), and Alex Désert (Eli Williams).\n\n\tAhead of the routine, Fishel opened up about the routine on her “Danielle With the Stars” podcast, sharing that it “feels crazy” to say that she’s dancing to the popular theme song. “I’m so excited. It’s really a dedication to Bill and the role he has played in my life and the role ‘Boy Meets World’ has played in my life. I have really felt like ‘Dancing with the Stars’ has been a second act for me in my career and as a performer.”\n\t\n\n\tShe mentioned how much of an inspiration Daniels has been in her life and to many members of the TV family. She added, “To be able to say thank you to him and give him this kind of a platform for him to receive the love that he deserves is going to be very memorable. So I’m very, very excited about that. I can’t wait.”\n\n\t“Boy Meets World” aired from 1993 to 2000. The cast later reunited for a spinoff, “Girl Meets World,” which aired for three seasons on Disney Channel from 2014 to 2017.\n\n\tWatch the routine below:\n\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Dancing With the Stars’: Danielle Fishel Reunites With Bill Daniels and ‘Boy Meets World’ Cast for Emotional Tribute Dance",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/179544_EM207929.jpg?crop=0px%2C17px%2C1000px%2C562px&resize=1000%2C563"
      ],
      "datePublished": "2025-10-15T01:50:12.000Z",
      "dateModified": "2025-10-15T01:50:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ten Classic D’Angelo Deep Cuts, From Prince Covers to Duets With Erykah Badu and Lauryn Hill",
    "url": "https://variety.com/2025/music/news/dangelo-best-deep-cuts-prince-cover-1236553100/",
    "image": "https://variety.com/wp-content/uploads/2025/10/GettyImages-50856805-e1760487931797.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-15T00:27:45.000Z",
    "description": "\n\tD’Angelo, who died Tuesday at the age of just 51, was indisputably a musical genius, but he didn’t leave much behind: Just three studio albums and a",
    "body": "\n\tD’Angelo, who died Tuesday at the age of just 51, was indisputably a musical genius, but he didn’t leave much behind: Just three studio albums and an under-the-radar live disc over the course of two decades, and a handful of remixes and loose tracks. So a “10 greatest songs” (out of maybe 35 original compositions) seems kind of pointless — just cue up any of a dozen “greatest hits” playlists and click.\n\n\tBut his discography is deep enough to hold some buried treasure, and we’ll throw in some rarities like his live sets with Questlove — which were mostly soul covers from the ‘60s and ‘70s — and the “Soul Blends” cassette, which was the first whiff we got of “Voodoo” back in the fall of 1999 when a then-little-known New York DJ named Mark Ronson made a mixtape of several of its songs.\n\t\n\n\tScroll down as we go deep into the crates and uncover for some vintage deep cuts from one of the leading lights of R&B.\n\n\n\n\n\t“I Found My Smile Again” (1995)\n\n\tAn outtake from “Brown Sugar” and a rare unreleased D’Angelo original, this song — which premiered on the soundtrack of the 1996 blockbuster “Space Jam” film — only saw the light of day because, according to Questlove, the film’s producers blanched at the song they originally submitted: an early version of “Playa Playa,” which was finally released on “Voodoo” nearly four years later (which gives a sense of how long “Voodoo” was in the oven). The song fits in perfectly with “Brown Sugar” and would slot nicely between sides one and two.\n\t\n\n\n\n\n\t“Can’t Hide Love” (live 1995)\n\n\tThe “Live at the Jazz Cafe” EP was such a low-key release that many people didn’t know it existed before it was re-released in 2014. The album was originally an EP, then re-released in Japan with a bonus cut, and finally the full set, nearly 20 years after it was recorded. But this September 1995 set, captured live shortly after the release of D’Angelo’s debut, finds him in full flight as a 21-year-old, with his paramour at the time, the late Angie Stone, delivering stellar backing vocals. The album includes three covers — his take on Smokey Robinson’s “Cruisin’,” also featured on “Brown Sugar”; the Ohio Players’ “Heaven Must Be Like This,” only on the Japanese version; and finally this faithful but stunning take on Earth Wind & Fire’s classic “Can’t Hide Love.”\n\n\n\n\n\t“Heaven Must Be Like This” (live 1995)\n\n\tAnother “Jazz Café” track, this Ohio Players cover was originally relegated to the Japanese version of the EP and is curiously not available on the otherwise-full version of the album or Spotify, suggesting that D’Angelo himself was unhappy with the track. It’s hard to understand why he would be: It’s a beautifully sung version, featuring raindrop-like electric piano, a full horn section and some gorgeous backing vocals from Stone.\n\n\n\n\n\t“Me and Those Dreaming Eyes of Mine” Def Squad remix / DJ Premier remix (1996)\n\n\tThe one full collaboration between D’Angelo and the great DJ Premier, “Devil’s Pie” (originally released on the “Best Man” soundtrack two years before it appeared on “Voodoo”) was enough to have fans thirsting in vain for more. But lurking deep in the crates on vintage EMI Records 12” singles are some remixes from D’s first album, including ten different mixes of one of his all-time great love songs, “Me and Those Dreaming Eyes of Mine” (guess they had bigger budgets back then). It’s an embarrassment of riches, but the two winners are the DJ Premier remix and the even more innovative “Def Squad Remix,” featuring Erick Sermon and Redman.\n\t\n\n\n\n\n\n\n\n\t“Your Precious Love” with Erykah Badu (1996)\n\n\tThis cover of the 1967 Marvin Gaye-Tammi Terrell duet, featured on the “High School High” soundtrack, was recorded well before these two stellar singers became neo-soul icons. It sticks closely to the original arrangement, but the two deliver the song — a classic from the Ashford and Simpson catalog — with the reverence it deserves.\n\n\n\n\n\t“Girl You Need a Change of Mind” (1996)\n\n\tAnother cover, this one by original Temptations member Eddie Kendricks, from his second solo album, 1973’s “People… Hold on.” This is the classic-soul D’Angelo that fans jones for, complete with string stabs at the end and stellar falsetto; it’s of a piece with “Brown Sugar” but already anticipating the hard funk of “Voodoo.” From Spike Lee’s 1996 film “Get on the Bus” about a group of Black men traveling cross-country to participate in the Million Man March.\n\n\n\n\n\t“She’s Always in My Hair” (1997)\n\n\tIt’s surprising that D’Angelo didn’t record more Prince covers, given the vast influence and his reverence for the man, but it figures that when he did, he’d dig deep into the crates. This psychedelicized track — the 1985 B-side of “Raspberry Beret,” fact fans — is one of the best of Prince’s many non-LP tracks, and was often performed live during D’Angelo’s “Brothers in Arms” jams with Questlove.\n\n\n\n\n\t“Everybody Loves the Sunshine” (1999)\n\n\tThis is probably the best known song by the great jazz musician Roy Ayers (although there are many great ones). Recorded by D’Angelo with Questlove and released as the B-side of the European CD single of “Untitled (How Does It Feel),” the song is perhaps deservedly obscure , as the two are just jamming tentatively on the track. It’s not as strong as the other songs on this list (but hopefully compensated by the bonus track at the end.)\n\t\n\n\n\n\n\t“Glass Mountain Trust” with Mark Ronson (2010)\n\n\tThis bizarre track from Ronson’s oddly obscure third solo album “Record Collection” may be the deepest cut here: The album doesn’t come up in Ronson’s Spotify discography (it’s credited to “Mark Ronson and the Business Intl”) and is one of the strangest songs in both of their catalogs. Led by blaring ‘80s synthesizers and a pounding beat, the song features a distorted lead vocal from D’Angelo, who accompanies himself on multitracked backing vocals with the occasional soul shriek thrown in for good measure.\n\n\n\n\n\tQuestlove and D’Angelo SuperJam (live at Bonnaroo Festival, 2012)\n\n\tThe “Brothers in Arms” played several public jams on classic R&B covers during this era, at least two of which (witnessed by this writer) were a bit disorganized and shambolic. However, for this set at Bonnaroo, they delivered the goods: With a directive not to play any D’Angelo or Roots songs, they were accompanied by a stellar hybrid band featuring virtuoso bassist Pino Palladino, Time guitarist Jesse Johnson, members of the Roots, D’Angelo’s Vanguard and even longtime Prince saxophonist Eric Leeds. The all-star group tore up covers of songs by the Funkadelic, the Ohio Players, Jimi Hendrix, Sly & the Family Stone, Prince (of course), the Time and even Led Zeppelin and the Beatles. Highlights are featured in this multi-part mini-documentary about the set.\n\n\n\n\n\tBONUS:\n\n\t“Nothing Even Matters” with Lauryn Hill (1998)\n\n\tIt’s absurd to call a song from one of the top-selling albums in history a “deep cut,” yet this soulful duet is tucked away as track 12 on “The Miseducation of Lauryn Hill” and is often overlooked. The two harmonize beautifully, freestyling over the song’s last couple of minutes, underpinned by D’Angelo’s unmistakable electric piano embellishments. The mutual admiration was real: Hill wrote just a few hours after his death was announced: “I regret not having more time with you. Your undeniable beauty and talent were not of this world… You sir, moved us, stirred us, inspired and even intimidated others to action with your genius.”\n\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ten Classic D’Angelo Deep Cuts, From Prince Covers to Duets With Erykah Badu and Lauryn Hill",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/GettyImages-50856805-e1760487931797.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-15T00:27:45.000Z",
      "dateModified": "2025-10-15T00:27:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Conan O’Brien’s Emmy-Winning TBS Series Lands at Radial Entertainment",
    "url": "https://variety.com/2025/tv/news/conan-obrien-tbs-series-radial-entertainment-1236552670/",
    "image": "https://variety.com/wp-content/uploads/2013/04/conan_andy_tbs.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-15T04:00:00.000Z",
    "description": "\n\tRadial Entertainment has struck a deal for the U.S. distribution rights to Conan O’Brien’s long-running TBS late-night talk show, the company reveal",
    "body": "\n\tRadial Entertainment has struck a deal for the U.S. distribution rights to Conan O’Brien’s long-running TBS late-night talk show, the company revealed at Mipcom.\n\n\tThe agreement gives Radial exclusive rights across multiple digital platforms — including subscription and ad-supported streaming, transactional video, and digital networks — for all 11 seasons of “Conan,” which aired from 2010 to 2021. Jeff Peisch made the announcement on behalf of Radial Entertainment.\n\t\n\n\t“Conan O’Brien is widely regarded as one of the most original and enduring figures in American comedy,” Peisch said. “His influence has shaped modern comedy, and his work continues to resonate with audiences across generations. We are excited to continue his extraordinary late-night legacy by allowing fans to watch his decade-long series on streaming platforms.”\n\n\n\tThe talk show featured O’Brien and sidekick Andy Richter mixing comedy sketches with interviews spanning entertainment, sports, politics and culture. The series became particularly recognized for its international remote segments and won multiple Emmy Awards during its run.\n\n\tThe show later spawned “Conan Without Borders” and “Conan O’Brien Must Go,” both of which stream on HBO Max. Jeff Ross served as longtime executive producer.\n\n\tO’Brien was inducted into the Television Academy Hall of Fame in earlier this year, capping a nearly 30-year career in late-night television.\n\n\tBruce David Eisen of Eisen Law represented Radial Entertainment alongside Peisch in negotiations.\n\n\tThe newly formed Radial Entertainment, which operates the FilmRise and Shout! Studios brands and is backed by funds managed by Oaktree Capital Management, boasts a library of over 70,000 movies and episodes spanning genres including true crime, reality, animation, classics and horror.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Conan O’Brien’s Emmy-Winning TBS Series Lands at Radial Entertainment",
      "image": [
        "https://variety.com/wp-content/uploads/2013/04/conan_andy_tbs.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-15T04:00:00.000Z",
      "dateModified": "2025-10-15T04:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Dancing With the Stars’ Reaches 50 Million Votes During Emotional Dedication Night — and a New Duo Tops the Leaderboard",
    "url": "https://variety.com/2025/tv/news/dancing-with-the-stars-dedication-night-1236552808/",
    "image": "https://variety.com/wp-content/uploads/2025/10/179544_EM206074.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-15T02:01:41.000Z",
    "description": "\n\tSPOILER ALERT: This story contains spoilers from the Tuesday, Oct. 14 episode of “Dancing With the Stars.”\n\n\tIt was the most emotional night yet on ",
    "body": "\n\tSPOILER ALERT: This story contains spoilers from the Tuesday, Oct. 14 episode of “Dancing With the Stars.”\n\n\tIt was the most emotional night yet on Season 34 of “Dancing With the Stars.” For dedication night, each of the ten remaining couples performed a number to honor someone special in their life — which meant multiple reunions during the evening. It also meant a special returning guest — former pro Kym Johnson returned to the ballroom as a guest judge.\n\t\n\n\tEarly in the night, Robert Irwin dedicated his dance to his mother, who became his rock after his father, Steve Irwin, died. The contemporary number left the entire room in tears, including judge Derek Hough, who could barely get words out. Hough previously won “DWTS” with Robert’s sister, Bindi Irwin.\n\n\n\tElaine Hendrix, best known for her role in “The Parent Trap,” dedicated her dance to Lisa Ann Walter, her costar from the 1998 film. Dennis Quaid, who starred in the movie with the pair, was cheering her on from the audience.\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tDisney\n\t\n\n\n\n\tDanielle Fishel dedicated her dance to “Boy Meets World” teacher Bill Daniels, who played Mr. Feeny to her Topanga Lawrence. In addition to Daniels, who joined Fishel and Pasha Pashkov on the ballroom floor, her costars also came to support her, including Will Friedle (Eric Matthews), Betsy Randle (Amy Matthews), William Russ (Alan Matthews), Trina McGee (Angela Moore), Bonnie Bartlett (Lila Bolander and Williams’ wife), Matthew Lawrence (Jack Hunter) and Alex Désert (Eli Williams).\n\n\tThe show ended without an elimination, surprising the cast. For the first time, Dylan Efron and partner Daniella Karagach topped the leaderboard, while Andy Richter returned to the bottom.\n\t\n\n\tAt the end of the night, no one was eliminated! And, for the first time ever, the show surpassed 50 million votes. \n\n\tHere’s a full list of scores from the night:\n\n\tJen Affleck and partner Jan RavnikDance: Viennese Waltz to “Rescue” by Lauren DaigleScore: 29/40\n\n\tJordan Chiles and partner Ezra SosaDance: Viennese Waltz to “Daughters” by John MayerScore: 32/40\n\n\tAlix Earle and partner Val ChmerkovskiyDance: Contemporary to “Sparks” by ColdplayScore: 35/40\n\n\tDylan Efron and partner Daniella KaragachDance: Contemporary to “Rewrite the Stars” by Zac Efron & ZendayaScore: 36/40\n\n\tDanielle Fishel and partner Pasha PashkovDance: Jive to “Boy Meets World” by Twenty Cent Crush featuring Phil RosenthalScore: 29/40\n\n\tElaine Hendrix and partner Alan BerstenDance: Foxtrot to “This Will Be (An Everlasting Love)”Score: 30/40\n\n\tScott Hoying and partner Rylee ArnoldDance: Foxtrot to “Parallel” by Scott HoyingScore: 30/40\n\n\tRobert Irwin and partner Witney CarsonDance: Contemporary to “You’ll Be In My Heart” by Phil CollinsScore: 35/40\n\n\tWhitney Leavitt and partner Mark BallasDance: Contemporary to “Heal” by Jamal RobertsScore: 33/40\n\n\tAndy Richter and partner Emma SlaterDance: Salsa to “Jump In the Line” by Harry BelafonteScore: 24/40\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Dancing With the Stars’ Reaches 50 Million Votes During Emotional Dedication Night — and a New Duo Tops the Leaderboard",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/179544_EM206074.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-15T02:01:41.000Z",
      "dateModified": "2025-10-15T02:01:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Guess Who This 'Hansons' Fan Turned Into!",
    "url": "https://www.tmz.com/2025/10/15/guess-who-this-hansons-fan-turned-into/",
    "image": "https://imagez.tmz.com/image/0c/16by9/2025/09/24/0cab9a2beb614d18b2e54cfcafab2b59_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-15T07:10:53.000Z",
    "description": "\n    \n                    \n                          Guess Who This\n                          'Hanson' Fan\n                          Turned Into!\n    ",
    "body": "\n    \n                    \n                          Guess Who This\n                          'Hanson' Fan\n                          Turned Into!\n                      \n                  \n                        Published October 15, 2025 12:10 AM PDT\n                                                                            \n      \n    \n          Before this kid rockin' his Hanson tee turned into a superstar, he was just rockin' his curly hair in chilly Illinois, tumbling and cheerleading for his high school, and dreaming of Hollywood's flashing lights ...\n      \n    \n          They tend to get curious on their podcast -- which has been in motion since 2015 -- and you've probably seen him flippin' around with Olympic champ Simone Biles in an Uber Eats commercial ... Before he scored big on Netflix, he was known for his hilarious one-liners on \"Gay of Thrones.\"\n      \n    \n          Need one more clue? \"Queer Eye!\"\n      \n    \n          Can you guess who he is?\n      \n      \n              \n          \n                          \n                Netflix\n              \n                          \n                Guess Who\n              \n                          \n                Kids\n              \n                          \n                celebrity kids\n              \n                          \n                Photo Galleries\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Guess Who This 'Hansons' Fan Turned Into!",
      "image": [
        "https://imagez.tmz.com/image/0c/16by9/2025/09/24/0cab9a2beb614d18b2e54cfcafab2b59_xl.jpg"
      ],
      "datePublished": "2025-10-15T07:10:53.000Z",
      "dateModified": "2025-10-15T07:10:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "President Trump Rips Into Alyssa Farah After MAGA Hat Proposition",
    "url": "https://www.tmz.com/2025/10/14/donald-trump-alyssa-farah-maga-hat-bluff/",
    "image": "https://imagez.tmz.com/image/d5/16by9/2025/10/14/d517b29432ad493697f159ff6f0e7ad1_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-14T21:09:08.000Z",
    "description": "\n    \n                    \n                          Donald Trump\n                          Where's Your MAGA Hat, Alyssa Farah?!?\n                   ",
    "body": "\n    \n                    \n                          Donald Trump\n                          Where's Your MAGA Hat, Alyssa Farah?!?\n                      \n                  \n                        Published October 14, 2025 2:09 PM PDT\n                                                                            \n      \n    \n      \n        \n                    \n                  \n      \n                    FOX News\n          \n    \n          Alyssa Farah might have some explaining to do ... 'cause Donald Trump is calling her out after she seemingly bluffed on live television.\n      \n    \n          ICYMI ... the 'View' co-host promised back in January she'd put on a MAGA hat if the prez was able to reach a Gaza peace deal -- specifically if he was able to free Israeli prisoners. Now that he's accomplished that, she has yet to hold up her end of the deal.\n      \n    \n      \n        \n                    \n                  \n      \n                    ABC\n          \n    \n          Now, Trump ripped into her while speaking to the press Tuesday. Just check out the clip -- he calls \"The View\" a \"fraud\" and Alyssa \"a joke\" ... and says she never thought she'd \"make it\" after she worked for him. She formerly served as his White House Communications Director.\n      \n\n          He even claims Alyssa wrote him \"the most beautiful letter you've ever seen,\" applauding his time in the White House during his first term and calling him a \"great president.\"\n      \n    \n          But, her views have since changed -- she's been an outspoken critic of Trump over the years ... and he's claiming it's because ABC hired her and put \"a couple bucks\" in her hand.\n      \n    \n          Trump ends his response by gloating that he's been called \"the greatest President of them all\" -- a far better compliment than Alyssa ever gave him.\n      \n    \n          The media personality has yet to respond to his criticism ... but we're sure she has some thoughts. We'll stay tuned ...\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Donald Trump\n              \n                          \n                Celebrity News\n              \n                          \n                TV\n              \n                          \n                The View\n              \n                          \n                Politix\n              \n                          \n                Fairly Legal\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "President Trump Rips Into Alyssa Farah After MAGA Hat Proposition",
      "image": [
        "https://imagez.tmz.com/image/d5/16by9/2025/10/14/d517b29432ad493697f159ff6f0e7ad1_xl.jpg"
      ],
      "datePublished": "2025-10-14T21:09:08.000Z",
      "dateModified": "2025-10-14T21:09:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Steven Van Zandt Praises Jeremy Allen White's Work in Bruce Springsteen Movie",
    "url": "https://www.tmz.com/2025/10/14/steven-van-zandt-jeremy-allen-white-bruce-springsteen-movie/",
    "image": "https://imagez.tmz.com/image/04/16by9/2025/10/14/04ea47f62b5c4337a20614df3626526e_xl.png",
    "tag": "Entertainment",
    "date": "2025-10-14T21:59:50.000Z",
    "description": "\n    \n                    \n                          Steven Van Zandt\n                          Jeremy's Incredible As Bruce In New Movie\n            ",
    "body": "\n    \n                    \n                          Steven Van Zandt\n                          Jeremy's Incredible As Bruce In New Movie\n                      \n                  \n                        Published October 14, 2025 2:59 PM PDT\n                                                                            \n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          Steven Van Zandt is praising Jeremy Allen White's work as Bruce Springsteen on the big screen ... telling us it's one of the most emotional movies he's ever seen.\n      \n    \n          We got the E-Street Band guitarist in New York City on Tuesday and our photog asked him about Jeremy's performance in \"Springsteen: Deliver Me From Nowhere.\"\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Steven says Jeremy is \"incredible\" as Bruce and he says folks don't even need to know Bruce or his story to appreciate the acting in the movie, which he's already predicting as the movie of the year.\n      \n\n          The film hits theaters next week and Steven's also envisioning some Oscar wins for Jeremy and company ... and he's got some sage advice for moviegoers. SVZ shouts out his foundation, TeachRock.org, too.\n      \n    \n          'Springsteen' focuses on the making of Bruce's 1982 album \"Nebraska\" and ends with the success of his \"Born In The USA\" hit ... and Steven salutes Disney for making a movie out of this period in Bruce's life.\n      \n    \n          Check out the clip for an unbiased review!!! 😜\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Bruce Springsteen\n              \n                          \n                Jeremy Allen White\n              \n                          \n                Steven Van Zandt\n              \n                          \n                Movies\n              \n                          \n                Exclusive\n              \n                          \n                Music\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Steven Van Zandt Praises Jeremy Allen White's Work in Bruce Springsteen Movie",
      "image": [
        "https://imagez.tmz.com/image/04/16by9/2025/10/14/04ea47f62b5c4337a20614df3626526e_xl.png"
      ],
      "datePublished": "2025-10-14T21:59:50.000Z",
      "dateModified": "2025-10-14T21:59:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Former 'GMA' Cohosts T.J. Holmes and Amy Robach Are Engaged",
    "url": "https://www.tmz.com/2025/10/14/tj-holmes-amy-robach-engaged/",
    "image": "https://imagez.tmz.com/image/cc/16by9/2025/10/14/cc0585fdc6d147bb9ed7f857a41d3408_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-14T20:50:58.000Z",
    "description": "\n    \n                    \n                          T.J. Holmes & Amy Robach\n                          Former 'GMA' Cohosts Engaged!!!\n              ",
    "body": "\n    \n                    \n                          T.J. Holmes & Amy Robach\n                          Former 'GMA' Cohosts Engaged!!!\n                          Years After Rumored Scandalous Affair\n                      \n                  \n                        Published October 14, 2025 1:50 PM PDT\n                                                                            \n      \n    \n      \n        \n                    \n                  \n      \n                    Amy and T.J.\n          \n    \n          Former \"Good Morning America\" cohosts T.J. Holmes and Amy Robach have battled rumors for years that they carried on a love affair while still married to their respective spouses ... and surprise, surprise -- now they're engaged!\n      \n    \n          Amy spilled the tea on Tuesday's episode of the \"Amy & TJ\" podcast, gushing, \"We are sharing with all of you that we are engaged and we’ve been engaged for just about a month now.\"\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          T.J. added, \"We wanted to let you all know before anybody else was able to; we’ve learned that lesson, I guess, in the past about our relationship.\"\n      \n\n          They sure have ... the two were photographed in a romantic setting in November 2022, while they were both still married. They've always denied having an affair, insisting they were both separated from their spouses at the time, but 'GMA' wasn't having it. The ABC morning show canned them following an internal investigation.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          The whole situation got even messier when -- wait for it ... their now-exes started dating each other! Yes, T.J.'s ex-wife, Marilee Fiebig and Amy's ex-husband, Andrew Shue, started their own romance together.\n      \n    \n          There's no official word on whether Marilee and Andrew will be headed down the aisle anytime soon, but rumors of T.J. and Amy's engagement first started swirling in March when she showed up at the iHeartRadio Music Awards with a huge ring on that finger.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          \"We haven't been keeping it a secret, but nobody asked!\" said T.J.\n      \n    \n          What a love story ... Congrats, you two!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                T.J. Holmes\n              \n                          \n                Amy Robach\n              \n                          \n                Relationships\n              \n                          \n                Couples\n              \n                          \n                Tying The Knot\n              \n                          \n                Good Morning America\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Former 'GMA' Cohosts T.J. Holmes and Amy Robach Are Engaged",
      "image": [
        "https://imagez.tmz.com/image/cc/16by9/2025/10/14/cc0585fdc6d147bb9ed7f857a41d3408_xl.jpg"
      ],
      "datePublished": "2025-10-14T20:50:58.000Z",
      "dateModified": "2025-10-14T20:50:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Heidi Klum Shows Off Her Boob Hair, Asks Fans If They Have It Too",
    "url": "https://www.tmz.com/2025/10/14/heidi-klum-boob-hair-instagram-cleavage/",
    "image": "https://imagez.tmz.com/image/65/16by9/2025/10/14/65a29666b08f4c03b764c4da8d4ee1f9_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-14T21:21:03.000Z",
    "description": "\n    \n                    \n                          Heidi Klum\n                          I Have Boob Hair ...\n                          Does Anyone E",
    "body": "\n    \n                    \n                          Heidi Klum\n                          I Have Boob Hair ...\n                          Does Anyone Else?!!\n                      \n                  \n                        Published October 14, 2025 2:21 PM PDT\n                                                                            \n      \n    \n      \n        \n                    \n                  \n      \n                    Instagram / @heidiklum\n          \n    \n          Heidi Klum’s in a hairy situation -- literally -- polling fans to see if chest fluff is normal, or if she’s the only Angel sporting a peach-fuzz bra.\n      \n    \n          Okay, so the German supermodel doesn't exactly have a full-on chest carpet -- just a lone rebel strand sprouting from one boob ... which she proudly flaunted on IG, giving it a playful tug for the camera.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Heidi zoomed in -- while speaking German -- enough to reveal the spout was gray, and while she played it cool, she polled fans on whether this was normal ... or just her own follicle freak show.\n      \n\n          But looks like Heidi's little chest whisker sparked more buzz than she bargained for ... 'cause by the time we looked, she had the comments shut down.\n      \n    \n          This ain’t Heidi’s first hairy tale though -- back in Feb she copped to boob hair as long as her pinky ... and yep, even a couple chin sprouts made the cut.\n      \n    \n          Guess Heidi’s just letting her hair down ... everywhere!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Heidi Klum\n              \n                          \n                Social Media\n              \n                          \n                Celebrity News\n              \n                          \n                Beauty\n              \n                          \n                Fashion\n              \n                          \n                Viral\n              \n                          \n                Fairly Legal\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Heidi Klum Shows Off Her Boob Hair, Asks Fans If They Have It Too",
      "image": [
        "https://imagez.tmz.com/image/65/16by9/2025/10/14/65a29666b08f4c03b764c4da8d4ee1f9_xl.jpg"
      ],
      "datePublished": "2025-10-14T21:21:03.000Z",
      "dateModified": "2025-10-14T21:21:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]