[
  {
    "title": "Razzie Nominations 2026: ‘Snow White’ and Ice Cube’s ‘War of the Worlds’ Lead With Six Nods, The Weeknd Is Worst Actor Contender",
    "url": "https://variety.com/2026/film/news/razzie-nominations-2026-snow-white-the-weeknd-ice-cube-war-of-the-worlds-1236635371/",
    "image": "https://variety.com/wp-content/uploads/2026/01/snow-white-cube-weeknd.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-21T08:00:00.000Z",
    "description": "\n\tThe Golden Raspberry Awards has announced the nominations for its 46th edition, with the live-action “Snow White” and Ice Cube’s “War of the Worlds”",
    "body": "\n\tThe Golden Raspberry Awards has announced the nominations for its 46th edition, with the live-action “Snow White” and Ice Cube’s “War of the Worlds” in the lead with six nods apiece.\n\n\tAlongside “Snow White” and “War of the Worlds,” the parody award show — whose members recognize what they consider the worst films each year — nominated “The Electric State,” “Hurry Up Tomorrow” and “Star Trek: Section 31” for worst picture. \n\n\n\tIn the acting categories, Abel “The Weeknd” Tesfaye is nominated for worst actor for his performance as a fictionalized version of himself in “Hurry Up Tomorrow,” which received five Razzie nominations in total. The singer-songwriter will compete against Dave Bautista (“In the Lost Lands”), Ice Cube (“War of the Worlds”), Scott Eastwood (“Alarum”) and Jared Leto (“Tron: Ares”) for the (dis)honor. \n\t\n\n\tMeanwhile, the worst actress nominees include Ariana DeBose (“Love Hurts”), Milla Jovovich (“In the Lost Lands”), Natalie Portman (“Fountain of Youth”), Rebel Wilson (“Bride Hard”) and Michelle Yeoh (“Star Trek: Section 31”). \n\n\tAnother notable category is worst screen combo, with nominees including the seven dwarfs from the live-action “Snow White”; James Corden and Rihanna in 2025’s “Smurfs”; Ice Cube and his Zoom camera in “War of the Worlds”; Robert DeNiro as Frank and Vito in “The Alto Nights”; and The Weeknd and “his colossal ego” in “Hurry Up Tomorrow.” \n\n\tThe winners of the 46th annual Razzies will be unveiled on March 14. \n\n\tSee the full nominations list below. \n\n\tWORST PICTURE “The Electric State”          “Hurry Up Tomorrow”“Snow White” (2025)   “Star Trek: Section 31”“War of the Worlds” (2025)\n\t\n\n\tWORST ACTOR Dave Bautista / “In the Lost Lands”Ice Cube / “War of the Worlds”Scott Eastwood / “Alarum”Jared Leto / “Tron: Ares”Abel “The Weeknd” Tesfaye / “Hurry Up Tomorrow”WORST ACTRESS Ariana DeBose / “Love Hurts”Milla Jovovich / “In the Lost Lands”Natalie Portman / “Fountain of Youth” Rebel Wilson / “Bride Hard”Michelle Yeoh / “Star Trek: Section 31”WORST REMAKE/RIP-OFF/SEQUEL“I Know What You Did Last Summer” (2025)“Five Nights at Freddy’s 2”“Smurfs” (2025)“Snow White” (2025)“War of the Worlds” (2025)WORST SUPPORTING ACTRESS Anna Chlumsky / “Bride Hard” Ema Horvath / “The Strangers: Chapter 2”Scarlet Rose Stallone / “Gunslingers” Kacey Rohl / “Star Trek: Section 31”Isis Valverde / “Alarum”WORST SUPPORTING ACTORAll Seven Artificial Dwarfs / “Snow White” (2025)Nicolas Cage / “Gunslingers”Stephen Dorff / “Bride Hard”Greg Kinnear / “Off the Grid”Sylvester Stallone / “Alarum”WORST SCREEN COMBOAll Seven Dwarfs / “Snow White” (2025)James Corden & Rihanna / “Smurfs” (2025)Ice Cube & His Zoom Camera / “War of the Worlds” (2025)Robert DeNiro & Robert DeNiro (as Frank & Vito) / “The Alto Knights”The Weeknd & His Colossal Ego / “Hurry Up Tomorrow”WORST DIRECTORRich Lee / “War of the Worlds” (2025)Olatunde Osunsanmi / “Star Trek: Section 31”The Russo Brothers / “The Electric State”Trey Edward Shults / “Hurry Up Tomorrow”Marc Webb / “Snow White” (2025)WORST SCREENPLAY“The Electric State” / Screenplay by Christopher Markus and Stephen McFeely. Adapted from the illustrated novel by Simon Stalenhag.“Hurry Up Tomorrow” / Screenplay by Trey Edward Shults, Abel Tesfaye, Reza Fahim“Snow White” (2025)  / Screenplay by Erin Cressida Wilson and a bunch of others too numerous to mention.   Drawing from the original fairy tale by the Brothers Grimm.“Star Trek: Section 31” / Screenplay by Craig Sweeny with original story concept developed by Bo Yeon Kim & Erika Lippoldt“War of the Worlds” (2025) / Screen Story and Screenplay by Kenny Golde and screenplay by Marc Hyman, adapting (or destroying) the classic novel by H.G. Wells.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Razzie Nominations 2026: ‘Snow White’ and Ice Cube’s ‘War of the Worlds’ Lead With Six Nods, The Weeknd Is Worst Actor Contender",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/snow-white-cube-weeknd.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-21T08:00:00.000Z",
      "dateModified": "2026-01-21T08:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Def Jam Recordings China Launches in Chengdu, Partners With Migu on ‘Guofeng Hip-Hop’",
    "url": "https://variety.com/2026/music/news/def-jam-recordings-china-chengdu-1236636435/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Vivian-Xu-DengDianGuo-DDG-BOSS-X-Adam-Granite-Timothy-Xu-YiTai-Wang.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-21T07:30:33.000Z",
    "description": "\n\tUniversal Music Greater China has established Def Jam Recordings China, marking the iconic hip-hop label’s entry into the Chinese market with headqu",
    "body": "\n\tUniversal Music Greater China has established Def Jam Recordings China, marking the iconic hip-hop label’s entry into the Chinese market with headquarters in Chengdu, a city recognized as the country’s hip-hop capital.\n\n\tThe move extends Def Jam’s 40-year legacy into China’s growing urban music scene, with the new division focused on developing local hip-hop and supporting artists who express contemporary stories through Chinese language and culture. Universal Music Group positions the launch as part of its long-term Greater China market strategy.\n\t\n\n\tChengdu’s selection as headquarters reflects the southwestern city’s established hip-hop community and live entertainment infrastructure. The city serves as both a creative hub and emerging international cultural center where street culture and live performance intersect.\n\n\n\tTo support artist development, Def Jam Recordings China has named three prominent Chinese rappers as special guest curators: Xie Di, Yitai Wang, and Deng Dianguo “DDG.” The curators will help identify and mentor emerging talent across the country.\n\n\tThe label is partnering with Migu, a digital content platform under China Mobile, to develop “Guofeng Hip-hop” — a creative direction that blends Chinese cultural references and storytelling traditions with contemporary production and global music trends. The collaboration with the Chengdu-based platform encompasses content development, talent incubation, marketing, distribution, live performances and merchandise.\n\n\t“China is one of the most important and dynamic music markets in the world today, with a new generation of artists shaping culture both locally and globally,” said Adam Granite, executive VP of market development at Universal Music Group. “Launching Def Jam Recordings China reflects our long-term commitment to this market and our belief that Chinese hip-hop has a powerful role to play in the global evolution of the genre.”\n\t\n\n\tTunji Balogun, chair and CEO of Def Jam Recordings, said the Chinese division continues the label’s tradition of amplifying voices from specific communities. “The goal is not to copy what’s worked elsewhere, but to support Chinese artists in defining hip-hop on their own terms, in ways that feel authentic, contemporary, and culturally grounded,” he said.\n\n\tTimothy Xu, chair and CEO of Universal Music Group Greater China, emphasized the platform’s comprehensive artist services spanning creative development, production, marketing, distribution and live performance. “Most importantly, we hope to help Chinese HipHop and urban music travel beyond China – reaching international audiences while staying true to its cultural roots,” he said.\n\n\tThe label was unveiled at an event at Eastern Suburb Memory, a Chengdu cultural district that has transformed industrial heritage into a creative hub. The launch featured an exhibition celebrating Def Jam’s four-decade history, with participation from Chinese hip-hop artists, label founders, designers and venue operators.\n\n\tUniversal Music and NetEase recently unveiled a multi-year licensing deal for China. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Def Jam Recordings China Launches in Chengdu, Partners With Migu on ‘Guofeng Hip-Hop’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Vivian-Xu-DengDianGuo-DDG-BOSS-X-Adam-Granite-Timothy-Xu-YiTai-Wang.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-21T07:30:33.000Z",
      "dateModified": "2026-01-21T07:30:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chris Pratt Says Panic About AI ‘Actor’ Tilly Norwood Is ‘All Bulls—‘: ‘I Don’t Know Who This Bitch Is’",
    "url": "https://variety.com/2026/film/news/chris-pratt-actor-tilly-norwood-panic-ai-actor-1236636353/",
    "image": "https://variety.com/wp-content/uploads/2026/01/MixCollage-20-Jan-2026-06-53-PM-894.jpg?crop=15px%2C15px%2C1167px%2C656px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-01-21T03:18:17.000Z",
    "description": "\n\tChris Pratt told Variety Tuesday night at the New York premiere of “Mercy” that he doesn’t “feel like someone’s gonna replace me” with AI. He added ",
    "body": "\n\tChris Pratt told Variety Tuesday night at the New York premiere of “Mercy” that he doesn’t “feel like someone’s gonna replace me” with AI. He added that the panic surrounding synthetic AI performers like Tilly Norwood is “all bullshit.”\n\n\t“I don’t feel like someone’s gonna replace me that’s AI,” Pratt said. “I heard this Tilly Norwood thing, I think that’s all bullshit. I’ve never seen her in a movie. I don’t know who this bitch is. It’s all fake until it’s something.”\n\t\n\n\n\tPratt went on to say there are wider applications of AI that don’t threaten human jobs, and that the emerging tech can be “an amazing tool in the right hands.” Although he thinks it will “inevitably disrupt the industry,” he had no doubts that “great filmmakers” will continue to make “great films.”\n\n\n\tHe added, “I don’t think you’re going to replace the human soul of a director or a writer or an actor or a singer or any of this stuff that requires human yearning and suffering and vision in art.”\n\n\tTilly Norwood is a synthetic AI performer created by Dutch comedian Eline Van der Velden. After Van der Velden unveiled her creation at the Zurich Film Festival last summer, claiming Tilly would soon sign for representation, there was immediate backlash from the entertainment industry at large. SAG-AFTRA said Tilly and other AI performers like it create “the problem of using stolen performances to put actors out of work, jeopardizing performer livelihoods and devaluing human artistry.”\n\t\n\n\tIn response, Van der Velden defended Tilly as “not a replacement for a human being, but a creative work – a piece of art.”\n\n\tPratt is hardly the first Hollywood mainstay to give his thoughts on AI in film. In December, Leonardo DiCaprio said AI lacks humanity and therefore could never be “authentically” considered art.\n\n\t“It could be an enhancement tool for a young filmmaker to do something we’ve never seen before,” DiCaprio said. “I think anything that is going to be authentically thought of as art has to come from the human being.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chris Pratt Says Panic About AI ‘Actor’ Tilly Norwood Is ‘All Bulls—‘: ‘I Don’t Know Who This Bitch Is’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/MixCollage-20-Jan-2026-06-53-PM-894.jpg?crop=15px%2C15px%2C1167px%2C656px&resize=1000%2C563"
      ],
      "datePublished": "2026-01-21T03:18:17.000Z",
      "dateModified": "2026-01-21T03:18:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Criterion Collection Deals: David Lynch Films Are on Sale for Up to 35% Off",
    "url": "https://variety.com/2026/shopping/news/david-lynch-criterion-collections-deals-online-1236636354/",
    "image": "https://variety.com/wp-content/uploads/2026/01/David-Lynch-Criterion-Collection-VR-Featured.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-21T03:45:10.000Z",
    "description": "\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.\n\n\tOn what w",
    "body": "\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.\n\n\tOn what would’ve been his 80th birthday, the Criterion Collection launched a flash sale on all of David Lynch‘s titles from the home video company. Born on Jan. 20, 1946, Lynch — who passed away in 2025 — influenced the landscape of cinema and television (namely Twin Peaks) with his style of bizarre and surreal storytelling rooted in American sincerity and nostalgia.\n\n\tFrom “Eraserhead” to “Inland Empire,” you can shop Lynch’s films in the Criterion Collection (and Janus Contemporaries) with savings up to 35% off list prices. In fact, prices start at $20.49 (reg. $29.95). Additionally, there are even titles about the director’s life, including “David Lynch: The Art Life” and “Lynch/Oz” on sale.\n\n\n\tWith a career in film spanning nearly 30 years from 1977 to 2006, Lynch has made some of the most important films of the 20th and 21st centuries — such as “Twin Peaks: Fire Walk With Me,” “Mulholland Dr.,” “Lost Highway” and others.\n\n\tHowever, act fast and shop now since these deals expire at the end of the day on Friday, Jan. 23. In the meantime, scroll down to shop deals on Lynch films in the Criterion Collection on Amazon: \n\n\t\t\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\t\t\t\tCriterion Collection\n\t\n\t\t\t\t\t\n\t\t\n\n\t\t\t\t\t\t\t\t\t\tThe Criterion Collection\t\t\t\t\t\t\n\n\t\t\t\t\t‘Eraserhead’\t\t\n\n\t\n\t\tBlu-ray\t\n\t\t\n\t\n\n\t\t\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\t\t\t\tCriterion Collection\n\t\n\t\t\t\t\t\n\t\t\n\n\t\t\t\t\t\t\t\t\t\tThe Criterion Collection\t\t\t\t\t\t\n\n\t\t\t\t\t‘Blue Velvet’\t\t\n\n\t\n\t\t4K Ultra HD\t\n\t\t\n\t\n\n\t\t\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\t\t\t\tCriterion Collection\n\t\n\t\t\t\t\t\n\t\t\n\n\t\t\t\t\t\t\t\t\t\tThe Criterion Collection\t\t\t\t\t\t\n\n\t\t\t\t\t‘Twin Peaks: Fire Walk With Me’\t\t\n\n\t\n\t\t4K Ultra HD\t\n\t\t\n\t\n\n\t\t\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\t\t\t\tCriterion Collection\n\t\n\t\t\t\t\t\n\t\t\n\n\t\t\t\t\t\t\t\t\t\tThe Criterion Collection\t\t\t\t\t\t\n\n\t\t\t\t\t‘Lost Highway’\t\t\n\n\t\n\t\t4K Ultra HD\t\n\t\t\n\t\n\n\t\t\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\t\t\t\tCriterion Collection\n\t\n\t\t\t\t\t\n\t\t\n\n\t\t\t\t\t\t\t\t\t\tThe Criterion Collection\t\t\t\t\t\t\n\n\t\t\t\t\t‘Mulholland Dr.’\t\t\n\n\t\n\t\t4K Ultra HD\t\n\t\t\n\t\n\n\t\t\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\t\t\t\tCriterion Collection\n\t\n\t\t\t\t\t\n\t\t\n\n\t\t\t\t\t\t\t\t\t\tThe Criterion Collection\t\t\t\t\t\t\n\n\t\t\t\t\t‘Inland Empire’\t\t\n\n\t\n\t\tBlu-ray\t\n\t\t\n\t\n\n\t\t\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\t\t\t\tCriterion Collection\n\t\n\t\t\t\t\t\n\t\t\n\n\t\t\t\t\t\t\t\t\t\tThe Criterion Collection\t\t\t\t\t\t\n\n\t\t\t\t\t‘David Lynch: The Art Life’\t\t\n\n\t\n\t\tBlu-ray\t\n\t\t\n\t\n\n\t\t\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\t\t\t\tJanus Contemporaries\n\t\n\t\t\t\t\t\n\t\t\n\n\t\t\t\t\t\t\t\t\t\tJanus Contemporaries\t\t\t\t\t\t\n\n\t\t\t\t\t‘Lynch/Oz’\t\t\n\n\t\n\t\tBlu-ray\t\n\t\t\n\t\n\n\tAnd since these Criterion Collection releases are from Amazon, you can get them shipped to your home for free, if you’re an Amazon Prime member.\n\n\tIf you’re not a member, you can sign up for a 30-day free trial to take advantage of all that Amazon Prime has to offer, including access to Prime Video for streaming movies and TV, as well as NFL and NBA games, Prime Gaming, Prime Reading and Amazon Photos; fast free shipping in less than two days with Prime Delivery; in-store discounts at Whole Foods Market; access to exclusive shopping events — such as Prime Day and Black Friday — and much more. Learn more about Amazon Prime and its benefits here.\n\n\n\tWant more? Shop more Criterion Collection deals and releases on Amazon, below:\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Criterion Collection Deals: David Lynch Films Are on Sale for Up to 35% Off",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/David-Lynch-Criterion-Collection-VR-Featured.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-21T03:45:10.000Z",
      "dateModified": "2026-01-21T03:45:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Final Oscar Predictions: Supporting Actor — Any Room for Some Surprises?",
    "url": "https://variety.com/lists/2026-oscars-best-supporting-actor-predictions/",
    "image": "https://variety.com/wp-content/uploads/2025/03/MCDSEVA_EC013.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-21T00:20:00.000Z",
    "description": "\n\t\t\n\n\t\n\tJan 20, 2026 4:20pm PT\t\n\t\n\n\t\n\tFinal Oscar Predictions: Supporting Actor — Any Room for Some Surprises?\n\t\n\n\n\n\t\t\t\n\t\t\t\n\t\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\tCourtes",
    "body": "\n\t\t\n\n\t\n\tJan 20, 2026 4:20pm PT\t\n\t\n\n\t\n\tFinal Oscar Predictions: Supporting Actor — Any Room for Some Surprises?\n\t\n\n\n\n\t\t\t\n\t\t\t\n\t\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\tCourtesy Everett Collection\n\t\n\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\n\t\t\n\n\tVariety Awards Circuit section is the home for all awards news and related content throughout the year, featuring the following: the official predictions for the upcoming Oscars, Emmys, Grammys and Tony Awards ceremonies, curated by Variety chief awards editor Clayton Davis. The prediction pages reflect the current standings in the race and do not reflect personal preferences for any individual contender. As other formal (and informal) polls suggest, competitions are fluid and subject to change based on buzz and events. Predictions are updated every Thursday.\n\n\n\n\t\n\n\t\t\t\t\tBLUE MOON, from left: Andrew Scott as Richard Rodgers, Margaret Qualley, 2025. ph: Sabrina Lantos / © Sony Pictures Classics / Courtesy Everett Collection\n\t\t\t\t\t\t\t\t\t©Sony Pictures/Courtesy Everett Collection\n\t\n\n\n\n\tOscars Best Supporting Actor Commentary (Updated Jan. 20, 2026): This looks like a tight five (unless it isn’t).\n\n\tBenicio Del Toro, Sean Penn, Jacob Elordi, Paul Mescal and Stellan Skarsgård seem to be the immovable occupiers. However, this category (and the Oscars) is never that simple. \n\n\tAndrew Scott (“Blue Moon”) has a shot, and if “Sinners” overperforms, expect Miles Caton and/or even Delroy Lindo to swoop in. Think Judd Hirsch-style switch-aroo/sneak attack. This is a category where one scene can change everything.\n\n\n\tThe Actor Awards (formerly SAG Awards) narrowed the field to five, naming surprise inclusion Miles Caton (“Sinners”), Benicio Del Toro and Sean Penn (both for “One Battle After Another”), Jacob Elordi (“Frankenstein”) and Paul Mescal (“Hamnet”). That group shows where the Actors Branch might currently lie, despite the Stellan Skarsgård snub.\n\n\tBAFTA’s longlist shows the internationally-leaning strong contenders citing Benicio Del Toro and Sean Penn for “One Battle After Another,” alongside Jacob Elordi (“Frankenstein”), Delroy Lindo (“Sinners”), Paul Mescal (“Hamnet”), Peter Mullan (“I Swear”), Adam Sandler (“Jay Kelly”), Andrew Scott (“Blue Moon”), Alexander Skarsgård (“Pillion”) and Stellan Skarsgård (“Sentimental Value”). \n\n\tAt the Critics Choice Awards, Elordi scored the win for his transformative turn as the Creature in “Frankenstein,” prevailing over Del Toro, Mescal, Penn, Adam Sandler and Stellan Skarsgård. The victory positions Elordi as a serious threat, particularly as his performance continues to resonate across multiple voting bodies.\n\n\tThe Golden Globes, which announce winners on Sunday, could further complicate the matter, depending on who wins. Nominees include Del Toro (“One Battle After Another”), Elordi (“Frankenstein”), Mescal (“Hamnet”), Penn (“One Battle After Another”), Sandler (“Jay Kelly”) and Stellan Skarsgård (“Sentimental Value”). With no single performance sweeping the precursors, the race remains fluid (although Del Toro leads overall). This will likely hinge on how Academy voters respond to the balance between transformation, screen time and the gravitational pull of best picture strength.\n\n\tNominations voting will begin Monday, Jan. 12 and conclude Friday, Jan. 16. Official nominations for the 98th Academy Awards will be revealed Thursday, Jan. 22. The 98th Academy Awards will take place Sunday, March 15, at the Dolby Theatre and will be televised live on ABC in more than 200 territories worldwide.\n\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: ©Warner Bros/Courtesy Everett C\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\nwindow.addEventListener(\"message\",function(a){if(void 0!==a.data[\"datawrapper-height\"]){var e=document.querySelectorAll(\"iframe\");for(var t in a.data[\"datawrapper-height\"])for(var r,i=0;r=e[i];i++)if(r.contentWindow===a.source){var d=a.data[\"datawrapper-height\"][t]+\"px\";r.style.height=d}}});\n\n\n\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: ©Netflix/Courtesy Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\nwindow.addEventListener(\"message\",function(a){if(void 0!==a.data[\"datawrapper-height\"]){var e=document.querySelectorAll(\"iframe\");for(var t in a.data[\"datawrapper-height\"])for(var r,i=0;r=e[i];i++)if(r.contentWindow===a.source){var d=a.data[\"datawrapper-height\"][t]+\"px\";r.style.height=d}}});\n\n\n\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: ©Sony Pictures/Courtesy Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\nwindow.addEventListener(\"message\",function(a){if(void 0!==a.data[\"datawrapper-height\"]){var e=document.querySelectorAll(\"iframe\");for(var t in a.data[\"datawrapper-height\"])for(var r,i=0;r=e[i];i++)if(r.contentWindow===a.source){var d=a.data[\"datawrapper-height\"][t]+\"px\";r.style.height=d}}});\n\n\n\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: ©Netflix/Courtesy Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\nwindow.addEventListener(\"message\",function(a){if(void 0!==a.data[\"datawrapper-height\"]){var e=document.querySelectorAll(\"iframe\");for(var t in a.data[\"datawrapper-height\"])for(var r,i=0;r=e[i];i++)if(r.contentWindow===a.source){var d=a.data[\"datawrapper-height\"][t]+\"px\";r.style.height=d}}});\n\n\n\t\t\n\t\t\t\n\t\t\t\n\tEligible Actors\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: A24\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\nwindow.addEventListener(\"message\",function(a){if(void 0!==a.data[\"datawrapper-height\"]){var e=document.querySelectorAll(\"iframe\");for(var t in a.data[\"datawrapper-height\"])for(var r,i=0;r=e[i];i++)if(r.contentWindow===a.source){var d=a.data[\"datawrapper-height\"][t]+\"px\";r.style.height=d}}});\n\n\n\t\t\n\t\n\t\n\n\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Final Oscar Predictions: Supporting Actor — Any Room for Some Surprises?",
      "image": [
        "https://variety.com/wp-content/uploads/2025/03/MCDSEVA_EC013.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-21T00:20:00.000Z",
      "dateModified": "2026-01-21T00:20:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Taylor Swift Slams ‘It Ends With Us’ Director Justin Baldoni as a ‘Bitch’ In Text With Blake Lively",
    "url": "https://variety.com/2026/film/news/taylor-swift-it-ends-with-us-justin-baldoni-bitch-1236636278/",
    "image": "https://variety.com/wp-content/uploads/2025/09/MixCollage-12-Sep-2025-11-31-AM-6604.jpg?crop=15px%2C27px%2C981px%2C552px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-01-21T01:26:29.000Z",
    "description": "\n\tTaylor Swift called “It Ends with Us” director Justin Baldoni a “bitch” in a 2024 text exchange with Blake Lively, according to court documents obta",
    "body": "\n\tTaylor Swift called “It Ends with Us” director Justin Baldoni a “bitch” in a 2024 text exchange with Blake Lively, according to court documents obtained by Variety.\n\n\tWhile discussing the pending New York Times bombshell exposé about Baldoni and Lively’s feud, Swift wrote to Lively, “I think this bitch knows something is coming because he’s gotten out his tiny violin.”\n\n\n\tA year prior, Lively referred to Baldoni as the “doofus director of my movie” in a message to Swift, adding that he is a “clown” who “thinks he’s a writer now.”\n\t\n\n\tTuesday brought a flood of court documents containing allegations against Baldoni of inappropriate on-set behavior from Lively and her “It Ends with Us” co-stars. As exhibited by the texts between Lively and Swift, the documents spelled out deep creative rifts between Lively and Baldoni while developing “It Ends with Us.” Lively created her own cut of the film as a result, and in a court declaration, she said that Baldoni’s version “marginalized the female characters” and “glorified the abuser.”\n\n\tLively also refused to appear alongside Baldoni and producer Jamey Heath while promoting the film, accusing them of vilifying her as punishment for her complaints.\n\n\t“They painted themselves as the victims and me as a bully,” she stated. “I was not willing to endorse Baldoni or Heath personally by appearing alongside or promoting the Film with them.”\n\n\tLively sued Baldoni, his publicist and the “It Ends with Us” producers for harassment and retaliation. The case will go to trial on May 18. Baldoni’s team filed a motion to dismiss the case, claiming that Lively’s complaints are “minor grievances.” A hearing on that motion will take place on Thursday.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Taylor Swift Slams ‘It Ends With Us’ Director Justin Baldoni as a ‘Bitch’ In Text With Blake Lively",
      "image": [
        "https://variety.com/wp-content/uploads/2025/09/MixCollage-12-Sep-2025-11-31-AM-6604.jpg?crop=15px%2C27px%2C981px%2C552px&resize=1000%2C563"
      ],
      "datePublished": "2026-01-21T01:26:29.000Z",
      "dateModified": "2026-01-21T01:26:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kenan Thompson, Kel Mitchell to Star in Horror Comedy ‘Kenan & Kel Meet Frankenstein’",
    "url": "https://variety.com/2026/tv/news/kenan-thompson-kel-mitchell-kenan-kel-meet-frankenstein-1236635998/",
    "image": "https://variety.com/wp-content/uploads/2026/01/DD5C45F9-B071-4093-A335-64F11EF75483.jpeg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-21T01:15:00.000Z",
    "description": "\n\tKenan Thompson and Kel Mitchell are teaming up once again for a horror comedy film that will pit the pair against an iconic monster. \n\n\tThompson and",
    "body": "\n\tKenan Thompson and Kel Mitchell are teaming up once again for a horror comedy film that will pit the pair against an iconic monster. \n\n\tThompson and Mitchell will star in and produce the film “Kenan & Kel Meet Frankenstein.” The announcement was made during the Amazon sports talk show “Good Sports,” which Thompson typically co-hosts with Kevin Hart, though Mitchell was filling in as guest host. The full clip can be seen below.\n\n\n\tThe film will begin production this summer. Per the official logline, the story follows “two delivery drivers whose routine drop-off takes a terrifying turn when they arrive at a creepy, out-of-place castle and accidentally awaken Frankenstein’s monster — turning an ordinary night into a fight for survival.” \n\t\n\n\tHowever, this will not be Thompson and Mitchell’s first horror comedy together. They also starred in the Nickelodeon made-for-TV movie “Two Heads Are Better Than None,” which aired as a finale movie for their beloved sitcom, “Kenan & Kel.” \n\n\t“Kel and I have always loved finding new ways to work together, and this project felt like the perfect mix of nostalgia, comedy, and something completely unexpected,” said Thompson. “We’re excited to bring a fresh take on a classic monster story and have some fun doing it.”\n\n\t“Coming back together always feels natural, and this lets us tap into everything people love about our dynamic while trying something totally new,” Mitchell added. “It’s funny, it’s scary, and it’s a great ride.”\n\n\tThis marks the comedy duo’s first announced joint project since they reunited for “Good Burger 2” in 2023. At that time, they teased that they were planning to keep collaborating moving forward. Thompson and Mitchell first met when they were both cast members on the Nickelodeon sketch comedy series “All That,” from which “Good Burger” originated. Along with the success of the first film, the duo worked together for four seasons on “Kenan & Kel.” \n\t\n\n\tJonah Feingold (“At Midnight,” “31 Candles”) will write the screenplay for the new film. Thompson and John Ryan Jr.’s Artists for Artists will co-produce with Range Media Partners. Ryan Jr.,, Brian Kavanaugh-Jones, and Carter Swan will produce alongside Thompson and Mitchell, with Will Hariton, Azim Spicer, and Monica Weber executive producing.  \n\n\t“First it was Abbott and Costello, then Pryor and Wilder. Kenan and Kel,” said Ryan Jr. “Think ‘Shaun of the Dead’ meets ‘Scooby-Doo.’”\n\n\tRange Media will handle sales, led by Brian Kavanaugh-Jones and Pete Micelli. Thompson and Ryan Jr. are repped by Range Media Partners. Thompson is repped by Innovative Artists Entertainment, Untitled Entertainment, and attorney Mark Temple. \n\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kenan Thompson, Kel Mitchell to Star in Horror Comedy ‘Kenan & Kel Meet Frankenstein’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/DD5C45F9-B071-4093-A335-64F11EF75483.jpeg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-21T01:15:00.000Z",
      "dateModified": "2026-01-21T01:15:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘House of Villains’ Sets Season 3 Release Date on Peacock (TV News Roundup)",
    "url": "https://variety.com/2026/tv/news/tv-news-roundup-week-of-january-19-1236635925/",
    "image": "https://variety.com/wp-content/uploads/2026/01/PKTV-000113810-000299452-KEY-ART.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-21T01:11:54.000Z",
    "description": "\n\tReality series “House of Villains” is back for a third season, premiering Feb. 26, 2026, at 6 p.m. PT/9 p.m. ET on Peacock. The first three episodes",
    "body": "\n\tReality series “House of Villains” is back for a third season, premiering Feb. 26, 2026, at 6 p.m. PT/9 p.m. ET on Peacock. The first three episodes will be available to stream on premiere day, with the remaining episodes dropping weekly, beginning Mar. 5. \n\n\tHosted by actor and comedian Joel McHale, the competition series will bring together 11 reality-TV stars who “must scheme, strategize and shade each other in different challenges for a chance to win $200,000 and the title of ‘America’s Ultimate Supervillain.’” \n\t\n\n\tThis season’s line-up of villains includes Paul Abrahamian (“Big Brother”), Tyson Apostol (“The Challenge” and “Survivor”), Kate Chastain (“Below Deck” and “The Traitors”), Jackie Christie (“Basketball Wives”), Drita D’Avanzo (“Mob Wives”), Plane Jane (“RuPaul’s Drag Race”) Johnny Middlebrooks (“Love Island” and “The Challenge”), Ashley Mitchell (“The Challenge”) Tiffany “New York” Pollard (“Flavor of Love,” “I Love New York,” and “House of Villains” Seasons 1 & 2), Christine Quinn (“Selling Sunset”)  and Tom Sandoval (“The Traitors” and “Vanderpump Rules”). \n\n\n\tFormer contestants Johnny Bananas, Victoria Larson, and Kandy Muse are also set to host challenges this season.     \n\n\t“House of Villains” is produced by Irwin Entertainment. John Irwin, Dave Kuba, Justin Rae Barnes, Joel McHale, David Mills, and Jessica O’Byrne executive produce.\n\t\n\t\tEVENTS\t\n\n\t“Paradise” writer Stephen Markley will lead a student discussion on how environmental issues are portrayed on television, the Television Academy Foundation announced Tuesday. The free, virtual event titled  “Access: Behind the Screens with ‘Paradise’ Writer Stephen Markley” will be presented by the academy foundation in association with the Natural Resources Defense Council (NRDC) on Wednesday from 11 a.m. to noon PST or 2 to 3 p.m. EST.\n\t\n\n\tIn addition to Markley, whose writing frequently explores environmental themes, two-time Emmy-winner and Rewrite the Future Director Daniel Hinerfeld and Rewrite the Future Creative Director and former studio executive and producer Meredith Milton will lead the discussion. Rewrite the Future is NRDC’s initiative to support Hollywood creators in representing environmental topics on screen.\n\n\t“We’re proud to partner with NRDC to offer this free event to spark awareness and dialogue,” said Tina Perry, chair of the Television Academy Foundation, in a statement. “This conversation embodies the Foundation’s commitment to empowering aspiring storytellers with the tools, perspectives and inspiration they need to tell impactful stories that reflect the world around us.”\n\n\tStudents can register for the online discussion here. \n\t\n\t\tFIRST LOOKS\t\n\n\tApple TV has released the trailer for the second season of “The Last Thing He Told Me,” set to premiere Feb. 20, 2026.\n\n\tThe eight-episode season will air weekly on Fridays, starring and executive-produced by Jennifer Garner. The show’s cast members include returning actors Angourie Rice, David Morse, and Nikolaj Coster-Waldau, along with new additions Judy Greer and Rita Wilson.\n\n\tBased on “The First Time I Saw Him,” Laura Dave’s sequel to her New York Times bestseller “The Last Thing He Told Me,” season two sees the return of Owen (Coster-Waldau) after five years on the run as Hannah (Garner) and her stepdaughter Bailey (Rice) find themselves in a race to figure out how to reunite their family before the past catches up to them.\n\n\tThe second season also welcomes new and returning cast members Augusto Aguilera, Josh Hamilton, Nick Hargrove, Michael Galante, John Noble, Michael Hyatt, Luke Kirby, and Elizabeth O’Donnell.\n\n\t“The Last Thing He Told Me” is produced by 20th Television and Reese Witherspoon’s Hello Sunshine, a part of Candle Media. The show is created and adapted by Dave, alongside her husband and Academy Award winner Josh Singer. The pair serve as executive producers along with Garner, Witherspoon, and Lauren Neustadter. Emmy Award nominee Aaron Zelman has joined season two as co-showrunner and executive producer with Singer. Daisy von Scherler Mayer and Merri D. Howard will also serve as executive producers.\n\t\n\n\tWatch the trailer below. \n\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘House of Villains’ Sets Season 3 Release Date on Peacock (TV News Roundup)",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/PKTV-000113810-000299452-KEY-ART.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-21T01:11:54.000Z",
      "dateModified": "2026-01-21T01:11:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Entertainment Journalist Zuri Hall on Her New ‘Not About Sports’ Talk Show, Interviewing Oprah Winfrey and ‘Heated Rivalry’",
    "url": "https://variety.com/2026/digital/columns/entertainment-journalist-zuri-hall-not-about-sports-talk-show-oprah-winfrey-heated-rivalry-1236636158/",
    "image": "https://variety.com/wp-content/uploads/2026/01/GettyImages-2255230717.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-20T23:42:18.000Z",
    "description": "\n\tVeteran entertainment journalist Zuri Hall is leaving the field.\n\n\tThe playing field, that is.\n\n\tHall has launched “Zuri Hall’s Not About Sports,” a",
    "body": "\n\tVeteran entertainment journalist Zuri Hall is leaving the field.\n\n\tThe playing field, that is.\n\n\tHall has launched “Zuri Hall’s Not About Sports,” a YouTube talk show centered around sports stars and personalities. But instead of focusing on the games, Hall is interviewing her guests about what goes on off the field. “The human interest angle is what’s exciting me the most about it,” she says. “We’re casting a wide net with who our guests could be and seeing what viewers resonate with most. We’ve got people like Loreal Sarkisian, the wife of the head coach of the Texas Longhorns, coming on pretty soon.”\n\t\n\n\t“We’re talking about marriage and motherhood,” Hall added. “She’s opening up like she never has before, about that journey, about giving birth three months early, about her high-risk pregnancy, about what it’s like to support a powerhouse coach at the highest level, and the stresses that come with that, while maintaining her own identity.”\n\n\n\tThe lineup for “Not About Sports” also includes two-time Super Bowl champion Malcolm Jenkins of Philadelphia Eagles fame and Akbar Gbajabiamila, an 8-year NFL veteran turned Emmy-nominated TV host and commentator.\n\n\tHall is best known for her work on celebrity magazine shows like “E! News” and “Access Hollywood.” She is currently the lead host of the “Live From E!” red carpet specials as well as co-host of NBC’s primetime competition series, “American Ninja Warrior.” She is producing “Not About Sports” under her Good News First Studios production company.\n\n\tWho are some of your dream guests?\n\t\n\n\tIt’s hard to pick, but Michael Jordan, because he is notoriously private and he is the GOAT, and because he doesn’t do interviews very often, let alone ones in the style that I’m doing. I would love for him to come on and tell his story in a different way, particularly because I won’t be talking anything basketball-related. I would love to be able to give fans a different side of Michael Jordan. Also, Tom Brady, because I think he’s in a really interesting point of his life right now. I got a lot of questions. I got a lot of questions about what life looks like for him now, what he hopes life will look like for him in the near future, and also maybe more context around some of the decisions that he’s made. I also have to get Jordan Chiles. She’s just so fun, so bubbly.\n\n\tYou’re focusing on guests from the world of sports, but are you also thinking of trying for people like Bradley Cooper, who could talk about his beloved Philadelphia Eagles?\n\n\tI love that you brought that up. I think about that. I don’t want to get too ahead of myself, but Hollywood is definitely my wheelhouse. I’ve been talking to the stars for the better part of 12 years. I’m trusted in this space. My rapport with them is great. I love talking to the stars. I’d love to get Bradley Cooper talking about sports, but this is a show not about sports. We’d have to figure that out.\n\n\tWe can’t talk about sports without talking about hockey and “Heated Rivalry.”\n\n\tThe show is so sexy and so fun, and we’re all loving it right now. It’s the biggest sports romance series that’s out right now. If I could get Connor Storrie and Hudson Williams to lock in on an episode, hands down, we’re making it happen. We’ll have to workshop how exactly it fits. Maybe we’ll bring them on with an actual hockey player.\n\n\tWhat was the first red carpet that you covered?\n\n\tI remember the first one that I was nervous about, like I was nauseous, was Oprah. I’d been in the game a little bit, but I was still super green, and my producers wanted me to give her a loaf of bread [after Winfrey said she was eating bread every day, even while on Weight Watchers]. I was nervous that Oprah was going to be like, “Never again with you.” But in those moments, you see why Oprah is who she is. She has this unique ability to make everyone feel like they’re exactly who she wants to be talking to at that very moment.\n\t\n\n\tWho was your most challenging interview?\n\n\tThe most challenging ones were earlier on in my career when I was still trying to strengthen the muscle of how to navigate some of those trickier questions. I will say it was kind of challenging interviewing Leonardo DiCaprio at the premiere of “The Revenant.” There were those ridiculous rumors — saying it out loud just feels so ridiculous – but there was a scene with him and a bear. [A bizarre claim that a bear sexually assaulted DiCaprio’s character had gone viral at the time]. That was a nice little moment of earning my stripes because I also had food poisoning that day. I had been throwing up literally all morning and all night before. My boss was going to take me off the assignment, and I was like, “Hell no, it’s DiCaprio.” I asked the question, and I got the bite, and the headline got picked up globally. So thank you, Leonardo DiCaprio – it’s been a pleasure interviewing you all these years. [For the record, Variety’s Marc Malkin was with E! Online at the time and wrote the story about Hall’s DiCaprio interview.]\n\n\tThis Q&A was edited for length and clarity.\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Entertainment Journalist Zuri Hall on Her New ‘Not About Sports’ Talk Show, Interviewing Oprah Winfrey and ‘Heated Rivalry’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/GettyImages-2255230717.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-20T23:42:18.000Z",
      "dateModified": "2026-01-20T23:42:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Blackpink’s Jisoo, Gong Yoo, Song Hye-kyo Lead Netflix Korea 2026 Slate",
    "url": "https://variety.com/2026/tv/news/blackpink-jisoo-gong-yoo-song-hye-kyo-netflix-korea-2026-slate-1236635381/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Boyfriend-on-Demand-Tantara.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-21T03:00:00.000Z",
    "description": "\n\tNetflix has unveiled an extensive 2026 Korean content slate headlined by Blackpink’s Jisoo, Gong Yoo and Song Hye-kyo, as the streamer celebrates 10",
    "body": "\n\tNetflix has unveiled an extensive 2026 Korean content slate headlined by Blackpink’s Jisoo, Gong Yoo and Song Hye-kyo, as the streamer celebrates 10 years of operations in Asia Pacific.\n\n\tThe lineup features series, films and unscripted titles organized around five emotional experiences: romance, depth and desire, edge-of-seat thrills, comedy, and genre-defying wonder.\n\n\tJisoo stars in romantic comedy series “Boyfriend on Demand,” playing Seo Mi-rae, an exhausted webtoon producer who subscribes to a virtual dating simulation service. Seo In-guk co-stars as her colleague and rival producer. The series is directed by Kim Jung-sik, known for “Work Later, Drink Now” and “No Gain No Love.”\n\t\n\n\tGong Yoo and Song Hye-kyo reunite for “Tantara,” a period drama set in Korea’s entertainment industry during the 1960s and ’80s. The series chronicles those who risked everything for success and is penned by Noh Hee-gyoung (“Our Blues,” “Dear My Friends”) and directed by Lee Yoon-jung (“Coffee Prince,” “Cheese in the Trap”).\n\n\n\tAcclaimed filmmaker Lee Chang-dong (“Burning”) returns to directing after eight years with “Possible Love” (working title), marking his first Netflix collaboration. The film follows two married couples leading different lives whose worlds collide, starring Jeon Do-yeon, Sul Kyung-gu, Zo In-sung and Cho Yeo-jeong.\n\n\tThe romance category continues with “Can This Love Be Translated?” which premiered Jan. 16 starring Kim Seon-ho and Go Youn-jung, alongside “No Tail to Tell” featuring Kim Hye-yoon and Lomon.\n\t\n\n\tAdditional romantic series include “Our Sticky Love” with Jung Hae-in and Ha Young, “Take Charge of My Heart” starring Kim Young-kwang and Chae Soo-bin, and “Sold Out On You” with Ahn Hyo-seop and Chae Won-bin.\n\n\tReality dating franchise “Single’s Inferno” returns for its fifth season, becoming the first Korean reality show to reach that milestone. “Better Late Than Single” also comes back for Season 2.\n\n\tThe thriller slate includes “The Art of Sarah” starring Shin Hye-sun and Lee Jun-hyuk, directed by Kim Jin-min (“Extracurricular,” “My Name”). “Notes from the Last Row” features Choi Min-sik as a literature professor obsessed with a student prodigy, while “Mousetrap” stars Ryu Jun-yeol and Sul Kyung-gu in a suspense thriller based on Kakao Entertainment’s webtoon “Field Mouse.”\n\n\tSon Ye-jin, Ji Chang-wook and Nana lead “The Scandal,” based on the 2003 film “Untold Scandal,” depicting forbidden love in the Joseon dynasty. “The East Palace” features Nam Joo-hyuk, Roh Yoon-seo and Cho Seung-woo in a supernatural thriller about palace mysteries.\n\n\tAction returns with “Bloodhounds” Season 2, reuniting Woo Do-hwan and Lee Sang-yi with new cast member Jung Ji-hoon. Han Jun-hee, creator of “D.P.” and “Weak Hero,” helms “Road” (working title), a cross-border murder thriller starring Son Suk-ku and Eita Nagayama.\n\n\tThe comedy lineup features “Husbands in Action,” an action-comedy where a woman’s ex-husband and current husband team up to rescue her, starring Jin Sun-kyu and Gong Myoung. “Mission: Cross 2” brings back Hwang Jung-min and Yum Jung-ah, while “Undercover Miss Hong” stars Park Shin-hye in a 1990s-set office comedy.\n\n\tUnscripted offerings include “Culinary Class Wars” Season 3, returning with a team-based format after the show topped Netflix’s Global Top 10 Non-English rankings. “The Devil’s Plan” comes back for Season 3, while “Agents of Mystery” returns for Season 2 with new team member Gabee joining Lee Yong-jin, John Park, Lee Hyeri, Kim Do-hoon and Karina.\n\n\tProducer Nah Yung-suk delivers two new reality series: “Ready or Not: Texas,” following Lee Seo-jin on a spontaneous U.S. journey, and “Take a Hike!,” tracking non-experienced hikers through Korea’s snowy mountains. Yu Jae-seok leads “Jae-seok’s B&B Rules!” alongside Lee Kwang-soo, Byeon Woo-seok and Ji Ye-eun, while “Kian’s Bizarre B&B” returns for Season 2.\n\t\n\n\tGenre-bending titles include “The Wonderfools,” a 1999-set comedy action-adventure starring Park Eun-bin and Cha Eun-woo about townspeople who gain superpowers. “If Wishes Could Kill” marks Netflix’s first Korean young-adult horror series, while “Dead-End Job” is a mystery-horror fantasy from Kim Da-min and executive producer Han Jun-hee, starring Lee Jae-wook, Ko Min-si, Kim Min-ha and Lee Hee-jun.\n\n\t“Teach You a Lesson” stars Kim Moo-yul and Lee Sung-min in a series about a fictional government task force restoring teachers’ authority. “We Are All Trying Here” features Koo Kyo-hwan, Go Youn-jung and Oh Jung-se.\n\n\tFilm releases include “Pavane,” director Lee Jong-pil’s latest work starring Ko A-sung, Byun Yo-han and Moon Sang-min.\n\n\tDon Kang, VP of content for Korea at Netflix, said: “Content made in Korean, a language spoken by only 50 million of the world’s 8 billion people, has become the most viewed content in the world only after English content. Over the past five years, more than 210 Korean titles have been ranked in the global top 10.”\n\n\tThe slate announcement coincides with Netflix’s 10th anniversary operating in Asia Pacific. Minyoung Kim, VP of content for APAC (excluding India), highlighted the streamer’s regional investments over the decade, from anime expansion in Japan to breakthrough series across Southeast Asia and Australia.\n\n\t“Each of these slates reflects what Netflix stands for in this region: our commitment to celebrating and partnering with Asia Pacific’s vibrant creative community and its incredible storytelling voices,” Kim said. “And as each country continues to expand their variety of stories and take bigger, bolder creative risks, APAC will continue to grow its place on the global entertainment stage.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Blackpink’s Jisoo, Gong Yoo, Song Hye-kyo Lead Netflix Korea 2026 Slate",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Boyfriend-on-Demand-Tantara.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-21T03:00:00.000Z",
      "dateModified": "2026-01-21T03:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Meredith Duxbury Hot Shots to Celebrate Her 27th Birthday!",
    "url": "https://www.tmz.com/2026/01/21/meredith-duxbury-birthday-hot-shots/",
    "image": "https://imagez.tmz.com/image/31/16by9/2026/01/20/3171206373764dcc9f0c5d0fc2763c47_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-21T08:01:32.000Z",
    "description": "\n    \n                    \n                          Meredith Duxbury\n                          Hot Shots For Her 27th Birthday!!!\n                   ",
    "body": "\n    \n                    \n                          Meredith Duxbury\n                          Hot Shots For Her 27th Birthday!!!\n                      \n                  \n                                                                        Published \n                              January 21, 2026\n                            12:01 AM PST\n                                                                            \n      \n    \n      \n        \n              \n    \n    \n          Meredith Duxbury’s been serving up wildly OTT makeup content for years -- and now it’s time we serve her a major birthday shoutout right back!\n      \n    \n          Yep, for Meredith’s big 2-7, we’ve rounded up her hottest bikini shots from her ultra-glam getaways ... and it’s clear she’s putting that influencer-earned bag to very good use.\n      \n    \n          Can you find the 6 makeup words below:\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          One thing about Meredith? She’s got an unreal body -- and she knows exactly how to work it with those killer poses.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Happy birthday, Meredith!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Hotties & Bodies\n              \n                          \n                Hot Bodies\n              \n                          \n                Birthdays\n              \n                          \n                Photo Galleries\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Meredith Duxbury Hot Shots to Celebrate Her 27th Birthday!",
      "image": [
        "https://imagez.tmz.com/image/31/16by9/2026/01/20/3171206373764dcc9f0c5d0fc2763c47_xl.jpg"
      ],
      "datePublished": "2026-01-21T08:01:32.000Z",
      "dateModified": "2026-01-21T08:01:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "TMZ Sports Streaming Live From Newsroom, Join The Conversation!",
    "url": "https://www.tmz.com/2026/01/20/tmz-sports-live-stream/",
    "image": "https://imagez.tmz.com/image/03/16by9/2026/01/20/0343685e78f447e7ac010af02dfd9ff3_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-20T20:58:44.000Z",
    "description": "\n    \n                    \n                          TMZ Sports Live Stream\n                          Join The Conversation!!!\n                      \n",
    "body": "\n    \n                    \n                          TMZ Sports Live Stream\n                          Join The Conversation!!!\n                      \n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          TMZ Sports is going live from the newsroom to discuss the day's biggest stories ... but we don't just want folks to watch and enjoy the conversation, we want y'all to get involved!!\n      \n    \n          Hit the comment section as Babcock, Lucas, Dylan, Luca, and the whole crew break down the most important topics of the day ... and we'll be interacting with viewers throughout the program between 1 and 2 PM PT.\n      \n    \n          YouTube, X, TikTok ... we're everywhere.\n      \n    \n          So tune in, make fun of us, share your two cents, sound off about your favorite team ... nothing is out of bounds.\n      \n    \n          Tuesday's show will break down the national championship game, the latest on Lamar Odom's DUI, Naomi Osaka's awesome outfit and so much more!!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Lamar Odom\n              \n                          \n                Naomi Osaka\n              \n                          \n                Celebrity News\n              \n                          \n                Live Stream\n              \n                          \n                TMZ Sports\n              \n                          \n                Viral\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "TMZ Sports Streaming Live From Newsroom, Join The Conversation!",
      "image": [
        "https://imagez.tmz.com/image/03/16by9/2026/01/20/0343685e78f447e7ac010af02dfd9ff3_xl.jpg"
      ],
      "datePublished": "2026-01-20T20:58:44.000Z",
      "dateModified": "2026-01-20T20:58:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Avani Gregg vs. James Kennedy Who'd You Rather (Snowboarding Stars)",
    "url": "https://www.tmz.com/2026/01/20/avani-gregg-vs-james-kennedy-whod-you-rather/",
    "image": "https://imagez.tmz.com/image/5e/16by9/2026/01/20/5ed8991853ed494a9a56fb1eb1c72f20_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-20T22:38:49.000Z",
    "description": "\n    \n      \n        \n        \n          Launch Gallery\n        \n                  Getty/TMZ Composite\n              \n    \n    \n          Avani Gregg ",
    "body": "\n    \n      \n        \n        \n          Launch Gallery\n        \n                  Getty/TMZ Composite\n              \n    \n    \n          Avani Gregg and James Kennedy have been shreddin' the gnar, but which snowy star would you rather hit the slopes with?!\n      \n    \n          The question is: Who'd You Rather?!\n      \n    \n          VOTE NOW!\n      \n      ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Avani Gregg vs. James Kennedy Who'd You Rather (Snowboarding Stars)",
      "image": [
        "https://imagez.tmz.com/image/5e/16by9/2026/01/20/5ed8991853ed494a9a56fb1eb1c72f20_xl.jpg"
      ],
      "datePublished": "2026-01-20T22:38:49.000Z",
      "dateModified": "2026-01-20T22:38:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Meghan Trainor and Daryl Sabara Welcome Baby Via Surrogate",
    "url": "https://www.tmz.com/2026/01/20/meghan-trainor-announces-baby-through-surrogate/",
    "image": "https://imagez.tmz.com/image/72/16by9/2026/01/21/7259cd0c71e64b6d9854ceb5bfe88d2c_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-21T01:37:55.000Z",
    "description": "\n    \n                    \n                          Meghan Trainor\n                          Baby No. 3 Via Surrogate!!!\n                      \n     ",
    "body": "\n    \n                    \n                          Meghan Trainor\n                          Baby No. 3 Via Surrogate!!!\n                      \n                  \n                                                                        Published \n                              January 20, 2026\n                            5:37 PM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Meghan Trainor and Daryl Sabara are expanding their family ... because they have a baby girl at home ... and she was born via surrogate.\n      \n    \n          The singer and actor now have three children together ... and their newborn is named Mikey Moon Trainor.\n      \n    \n          In a social media post announcing her daughter, Meghan says ... \"Our baby girl Mikey Moon Trainor has finally made it to the world thanks to our incredible, superwoman surrogate.\"\n      \n\n          Meghan continues ... \"We are forever grateful to all the doctors, nurses, teams who made this dream possible. We had endless conversations with our doctors in this journey and this was the safest way for us to be able to continue growing our family.\"\n      \n    \n          She adds ... \"We are over the moon in love with this precious girl. Riley and Barry have been so excited, they even got to choose her middle name. We are going to enjoy our family time now, love you all.\"\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Meghan posted a ton of photos of the baby at home and in the hospital ... so click through the gallery to see her growing family.\n      \n    \n          Congrats!!!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Daryl Sabara\n              \n                          \n                Meghan Trainor\n              \n                          \n                Celebrity News\n              \n                          \n                Family\n              \n                          \n                Relationships\n              \n                          \n                celebrity kids\n              \n                          \n                Couples\n              \n                          \n                Instagram\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Meghan Trainor and Daryl Sabara Welcome Baby Via Surrogate",
      "image": [
        "https://imagez.tmz.com/image/72/16by9/2026/01/21/7259cd0c71e64b6d9854ceb5bfe88d2c_xl.jpg"
      ],
      "datePublished": "2026-01-21T01:37:55.000Z",
      "dateModified": "2026-01-21T01:37:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Abella Danger Upset With ESPN Over National Championship Game Shot",
    "url": "https://www.tmz.com/2026/01/20/abella-danger-upset-espn-national-championship-game/",
    "image": "https://imagez.tmz.com/image/3c/16by9/2026/01/20/3c19c6191e6c4fbf84f5ef221f2207e6_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-20T21:17:06.000Z",
    "description": "\n    \n                    \n                          Abella Danger\n                          Pissed At ESPN ...\n                          I Didn't Wan",
    "body": "\n    \n                    \n                          Abella Danger\n                          Pissed At ESPN ...\n                          I Didn't Want To Be Filmed!!!\n                      \n                  \n                                                                        Published \n                              \n                January 20, 2026\n                \n                            1:17 PM PST\n                                                                      |\n                                                                Updated \n                                  January 20, 2026\n                                2:53 PM PST\n                                    \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Abella Danger wishes she could've watched her Miami Hurricanes compete without her face being plastered all over national TV ... with the adult film icon telling TMZ Sports she's sorry to anyone offended by her cameo appearance during Monday night's championship game.\n      \n    \n          The current Miami student's mug popped up during ESPN's broadcast of the Hurricanes' College Football Playoff Championship matchup with the Indiana Hoosiers at Hard Rock Stadium ... right when her fav team was down 10 with under seven minutes left in the game.\n      \n    \n          The crowd shot was intended to show Canes fans' emotions during the crucial moment in the contest ... and it succeeded, 'cause it looked like she was really going through it.\n      \n\n          Danger's appearance immediately made rounds on social media ... with some cracking jokes and others questioning whether the network was aware of WHO exactly they were showing.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Regardless, it's not the first time she's been shown on screen -- as she's attended a ton of Miami games in the past -- and camera crews have tracked her down numerous times.\n      \n    \n          But Danger's legitimately upset over her camera time ... telling us, \"I would give anything in the world to not have had ESPN film me, and I am so deeply sorry to anyone I offended with my attendance at the game.\"\n      \n    \n      \n        \n                    \n                  \n      \n                    Instragram/@dangershewrote / ESPN\n          \n    \n          \"I wish I could be any other student supporting my team.\"\n      \n    \n          Danger's quite famous -- whether folks will publicly admit it or not, chances are they know her face -- but she's clearly trying to keep it more lowkey these days.\n      \n    \n      \n        \n              \n    \n    \n          To make matters worse, she was truly sad to see her team lose ... but hey, they'll be back, Abella!!\n      \n    \n          ESPN declined to comment.\n      \n      \n              \n          \n                          \n                Abella Danger\n              \n                          \n                College Football\n              \n                          \n                TMZ Sports\n              \n                          \n                Exclusive\n              \n                          \n                ESPN\n              \n                          \n                Pornography\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Abella Danger Upset With ESPN Over National Championship Game Shot",
      "image": [
        "https://imagez.tmz.com/image/3c/16by9/2026/01/20/3c19c6191e6c4fbf84f5ef221f2207e6_xl.jpg"
      ],
      "datePublished": "2026-01-20T21:17:06.000Z",
      "dateModified": "2026-01-20T21:17:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]