[
  {
    "title": "Trump’s Threatened Tariffs on Film Are Not Viable Says Close Associate Steven Paul: ‘I Am Hopeful That We Won’t Be Going Down That Path’",
    "url": "https://variety.com/2025/film/global/trumps-tariffs-film-steven-paul-1236590634/",
    "image": "https://variety.com/wp-content/uploads/2025/05/trump-group-1.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-24T12:18:21.000Z",
    "description": "\n\tWhile attending the inaugural Doha Film Festival, veteran U.S. film producer Steven Paul said President Donald Trump’s plan to impose 100% tariffs o",
    "body": "\n\tWhile attending the inaugural Doha Film Festival, veteran U.S. film producer Steven Paul said President Donald Trump’s plan to impose 100% tariffs on films made outside the U.S is unlikely to materialize. \n\n\tPaul, who is a special advisor to Jon Voight – who, in turn, is one of three “special ambassadors” to Trump on Hollywood – said “it’s very difficult to tariff the entertainment business and I don’t think it would be good if there were tariffs on the entertainment business.”\n\t\n\n\tPaul delivered a masterclass at the Industry Days at Doha and took the opportunity to weigh in on Trump’s tariffs threats which he’s made twice; once in May and once in September, sending ripples of shock and disbelief across the international film industry.\n\n\n\t“I am hopeful that we won’t be going down that path, but we will introduce coproductions and tax credits and all of that, because I also don’t want us only filming in the United States. I want there to be treaties so that we can do things like I’m saying between Doha and America,” added Paul, who is CEO of SP Media Group.\n\n\tPaul went on to explain how the tariffs controversy was sparked. “We went around all of Hollywood: the idea was, there weren’t enough films being made in the U.S.,” he said. “Productions have been going everywhere in the world, England, Australia, Bulgaria. There’s a series of reasons for that; one is it’s very expensive to film in the United States. The other thing is there are great tax incentives when you go overseas.\n\n\t“We haven’t really been having that in the United States. We’ve been looking at how to make the American industry healthy again – or great again. We’ve come up with a plan, which we then submitted to the president. We met with every streamer, the studios, every union. We put together a coalition,” he added.\n\t\n\n\t“We came up with a laundry list, a wish-list: there was tax credits in America; there was co-production ideas; there is write-offs for individuals, infrastructure ideas,” Paul continued.\n\n\tPaul recounted that during a meeting with Trump in his Mar-a-Lago, Florida, home “We gave the whole list to the president. We’re sitting there in Mar-a-Lago. And one of the things that he liked, 20 pages in, was the word ‘tariffs.’ That got a lot of news. It’s been crazy.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump’s Threatened Tariffs on Film Are Not Viable Says Close Associate Steven Paul: ‘I Am Hopeful That We Won’t Be Going Down That Path’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/05/trump-group-1.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-24T12:18:21.000Z",
      "dateModified": "2025-11-24T12:18:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chance the Rapper and Julianne Hough Join ‘Dick Clark’s New Year’s Rockin’ Eve’ As Co-Hosts",
    "url": "https://variety.com/2025/tv/news/julianne-hough-chance-the-rapper-new-years-rockin-eve-hosts-1236590288/",
    "image": "https://variety.com/wp-content/uploads/2025/11/MixCollage-23-Nov-2025-05-18-PM-7223.jpg?crop=0px%2C49px%2C1200px%2C675px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-11-24T12:00:00.000Z",
    "description": "\n\tThree-time Grammy-winner Chance the Rapper and “Dancing With The Stars” presenter Julianne Hough have joined as co-hosts for “Dick Clark’s New Year’",
    "body": "\n\tThree-time Grammy-winner Chance the Rapper and “Dancing With The Stars” presenter Julianne Hough have joined as co-hosts for “Dick Clark’s New Year’s Rockin’ Eve” 2026.\n\n\tRyan Seacrest will be ringing in the New Year as the main host of this year’s “Rockin’ Eve” with British singer-songwriter Rita Ora returning as his co-host for the third year in a row for the ABC event in Times Square. 2026 marks Seacrest’s 21st year hosting the celebratory event.\n\t\n\n\tThis year’s show will kick off in New York and continue through Las Vegas, Chicago and Puerto Rico. Chance the Rapper, best known for his Grammy-winning hit “No Problem,” joins the Chicago broadcast as co-host and will welcome in the New Year from the Central Time Zone countdown for the first time in the show’s history.\n\n\n\tFormer NFL player Rob Gronkowski returns alongside the performer and Hough, who makes her “Dick Clark’s New Year’s Rockin’ Eve” co-hosting debut from Las Vegas. Details for the Puerto Rico celebration will be announced soon.\n\n\t“Dick Clark’s New Year’s Rockin’ Eve with Ryan Seacrest” has previously featured performances from artists like Taylor Swift, Jennifer Lopez, Sabrina Carpenter, Lenny Kravitz and the Jonas Brothers. Last year, Carrie Underwood capped the night with a Times Square performance as the broadcast drew more than 29 million total viewers at midnight, according to a Nielsen report.\n\n\tThe lineup for this year’s event will be unveiled in the coming weeks.\n\n\tABC’s “Dick Clark’s New Year’s Rockin’ Eve with Ryan Seacrest 2026” is produced by Dick Clark Productions, with Seacrest, Michael Dempsey and Barry Adelman serving as executive producers.\n\t\n\n\t“Dick Clark’s New Year’s Rockin’ Eve with Ryan Seacrest 2026” airs Wednesday, Dec. 31, live on ABC beginning at 8:00 p.m. EST, and the next day on Hulu. \n\n\tDick Clark Productions is owned by Penske Media Eldridge, a Penske Media Corp. (PMC) subsidiary and joint venture between PMC and Eldridge. PMC is the parent company of Variety.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chance the Rapper and Julianne Hough Join ‘Dick Clark’s New Year’s Rockin’ Eve’ As Co-Hosts",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/MixCollage-23-Nov-2025-05-18-PM-7223.jpg?crop=0px%2C49px%2C1200px%2C675px&resize=1000%2C563"
      ],
      "datePublished": "2025-11-24T12:00:00.000Z",
      "dateModified": "2025-11-24T12:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Adolescence’ Cinematographer Reveals Plans for Another One-Shot Series, Details Emmy-Winning Technical Innovation",
    "url": "https://variety.com/2025/tv/markets-festivals/adolescence-cinematographer-one-shot-series-1236590650/",
    "image": "https://variety.com/wp-content/uploads/2025/08/A_103_Unit_00333_RT.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-24T11:51:58.000Z",
    "description": "\n\tEmmy-winning cinematographer Matthew Lewis and camera operator Lee David Brown indicated they will make another one-shot series following Netflix’s ",
    "body": "\n\tEmmy-winning cinematographer Matthew Lewis and camera operator Lee David Brown indicated they will make another one-shot series following Netflix’s “Adolescence” during a panel at WAVES Film Bazaar, though they emphasized the new project would feature a different story.\n\n\t“There won’t be something that is the same story, because that story is definitely finished,” Lewis explained during the session moderated by actor Rajdeep Choudhury. “But we’ll probably be making another one of the same format down the line, but not just yet. We’re going to let it breathe… we don’t want to saturate the market with one-shot, because everyone’s going to get really bored of it eventually.”\n\t\n\n\tLewis won the 2025 Primetime Emmy Award for Outstanding Cinematography for Limited or Anthology Series or Movie for the first season. The series collected eight Emmy Awards total and distinguished itself through hour-long episodes filmed as seamless single takes.\n\n\n\tThe production utilized a DJI Ronin 4D paired with Cooke SP3 lenses. Lewis initially considered Sony Venice and Arri Alexa Mini cameras but found those setups either technically incapable of lasting an hour or too cumbersome.\n\n\t“My grip actually suggested to use the 4D from DJI, and we had a test day with it, and we fell in love with it,” Lewis said. “It meant that we could hand the camera between people really easily. It didn’t have to be attached to us, because it’s so lightweight.”\n\n\tThe team programmed lighting into a desk system with cues corresponding to camera positions, with the first episode alone featuring 50 to 60 different cues. “We basically built in lighting connected to a lighting desk, and we had essentially every position that the camera went into was like a new cue for us,” Lewis explained.\n\t\n\n\tThe blocking developed through extensive collaboration. “So much of the blocking was a conversation between me, the director, the actors, even the writer, sometimes,” Lewis said. “If it’s a school, and we can’t knock down the walls, we had to add dialog for certain walk and talks, or lose dialog in certain places.”\n\n\tBrown emphasized performance-driven camera work. “The camera movements have to be motivated, and the lighting has to be motivated,” he explained. “I don’t think there is ever a point where the camera moved or did something that wasn’t dictated by something as small as a look or a slight movement.”\n\n\tLewis stressed that story remained paramount. “It would be very easy for the one shot to create too much compromise and ruin the story. I didn’t want that to happen, because I wanted people to forget that it was a one-shot piece and just be inside the story,” he said.\n\n\tTechnical mishaps occurred during the lengthy takes. Lewis walked into a wall in episode one and backed into a fence in episode two. A boom dipped across an actor’s face 45 minutes into an episode four take.\n\n\tBrown described episode four’s vehicle journey as particularly challenging. “Every time we went around the corner or up a hill or round a roundabout, I was always adjusting the camera remotely from the wheels,” he said.\n\n\tDuring episode two, Brown had to quickly adjust when actor Ryan jumped through a window at a camera handoff point where neither operator could see the monitor. “It was just a reactive moment where I think it helped to add energy to the section,” Brown explained.\n\n\tThe operators had never worked together before production. “We’d actually never met prior to ‘Adolescence.’ ‘Adolescence’ was our first job together,” Brown said. Lewis began running eight months before production but sustained a knee injury during the shoot.\n\n\tLewis praised lead actors Stephen Graham and Owen Cooper, though Cooper presented uncertainty. “We didn’t know Owen was going to be any good, because he’s a child,” Lewis said. “We only started to know that he was going to be really good for this in energy reads. But at that point, we were already committed to him. Luckily, he was fantastic.”\n\n\tThe decision to use a one-shot format originated from Lewis’s previous work on “Adolescence” director Philip Barantini’s “Boiling Point.” “Off the back of that, there was already a discussion straight away about seeing where we could take the format,” Lewis said. \n\t\n\n\tLewis emphasized the format’s limitations while expressing pride in the project. “It’s definitely not the best way to make everything, there’s massive compromises everywhere, but it does teach you a lot about camera language and motivation,” he said. “I’m more proud of this project than anything else I’ve done. I’m normally very self critical. So it’s quite nice to look back on something and be like, ‘Oh, it’s objectively quite good.'”\n\n\tWAVES Film Bazaar is the market component of the International Film Festival of India, Goa. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Adolescence’ Cinematographer Reveals Plans for Another One-Shot Series, Details Emmy-Winning Technical Innovation",
      "image": [
        "https://variety.com/wp-content/uploads/2025/08/A_103_Unit_00333_RT.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-24T11:51:58.000Z",
      "dateModified": "2025-11-24T11:51:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "France’s CNC Launches First Baltic-Focused Co-Production Workshop ",
    "url": "https://variety.com/2025/film/global/cnc-baltic-co-production-tallinn-black-nights-festival-1236590595/",
    "image": "https://variety.com/wp-content/uploads/2025/11/Michel-Plazanet-CNC-Edith-Sepp-Estonian-Film-Institute-1.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-24T09:27:10.000Z",
    "description": "\n\tTALLINN, Estonia — Since it was launched more than a decade ago, the Baltic countries have been conspicuously absent from one of Europe’s most influ",
    "body": "\n\tTALLINN, Estonia — Since it was launched more than a decade ago, the Baltic countries have been conspicuously absent from one of Europe’s most influential co-production funds: France’s Aide aux cinémas du monde (ACM). This was openly acknowledged by Michel Plazanet, deputy head of international affairs at France’s National Film Board (CNC), as he opened an industry session at the Tallinn Black Nights Film Festival in the Estonian capital.\n\t\n\n\t“So far the Baltic states haven’t been that successful, but I’m pretty sure there’s a lot of potential,” Plazanet said. “We are doing our best to encourage co-production with France. And of course, one of the best tools is cinémas du monde.”\n\n\n\tIn an effort to move things forward, the CNC will host an international co-production workshop in Paris in February 2026, welcoming nine Baltic projects – three from each country. The program will pair regional producers with French co-producers and advisors, to guide applicants through ACM’s demanding requirements. The initiative follows the launch of the CinéBaltique festival in Paris in February 2025, which brought some 25 short and feature films to the French capital, marking the first-ever Baltic film event of its kind.\n\n\n\tFor Baltic producers, the upcoming workshop is a significant opportunity: the fund is among the most competitive and prestigious in Europe, and often serves as a launchpad to A-list festivals.\n\n\tFounded in 2012, Aide aux cinémas du monde supports feature-length international co-productions involving a French partner. Originally co-run with the Institut Français – a cultural branch of the Foreign Ministry – the program will be fully administered by the CNC from 2026, with a budget increase expected in the coming cycle. Its influence is substantial: of nearly 700 films supported since its creation, two-thirds have premiered in Cannes, Venice, Berlin or Locarno, including 184 titles in Cannes alone.\n\t\n\n\tWith a budget of €7 million ($8 million) in 2025, ACM supports around 65 films each year, including approximately 45 production grants and 20 post-production awards. Maximum support reaches €300,000 ($345,000) for production – with average amounts of €150,000 ($172,000) for fiction and €80,000 ($92,000) for documentaries – and €70,000 ($80,000) for post-production, where the average grant is €45,000 ($52,000). Half of all awards are reserved for first and second features through a dedicated selection committee for emerging filmmakers.\n\n\tTo qualify, a project must have a French co-producer and commit to a French theatrical release. Applicants must also submit a finished script in French, a procedural hurdle that has discouraged some international producers but remains non-negotiable. “It is funded by France,” said Plazanet, “and it is a fund for diversity of culture and languages, which means the respect of culture, so we request a script in French, and that’s the first important job of the French co-producer.”\n\n\tThe role of the French partner’s is also key in the selection process, which includes a 20-minute hearing in which only the French co-producer is present. “We don’t want the French co-producer to be just a letterbox – that’s a waste of money,” Plazanet said. “We want them to be on board as early as possible and bring a real input to the film.”\n\n\tCommittees evaluate artistic merit, how early the French partner joined, and the creative or technical contribution of the collaboration.\n\n\tFor the Baltic region, the Paris workshop signals a shift. It comes amid rising cultural visibility of Estonia, Latvia and Lithuania in Europe since the start of the war in Ukraine.\n\n\tOn the sidelines of the event, Edith Sepp, the head of Estonia’s Film Institute, who moderated the session, told Variety, “We are a priority now because of the political situation,” noting that the geopolitical moment is unsettling but has pushed European institutions to pay closer attention to Baltic filmmakers.\n\n\tThat urgency was echoed by Estonian producer Ivo Felt (“Not Made for Politics,” “Lioness”), who stressed the symbolic weight of cultural cooperation. “Unfortunately, unfortunately, we are really on the border here and we feel that we are getting more attention compared to before the war [in Ukraine] started. This is right because, here, we are basically on the front line. Our weapon is culture, it is filmmaking. And it is very important that we are not left alone here – there are bigger countries in Europe and in the European Union. We are all in this together. It’s not only us on the border,” he said.\n\t\n\n\tIndustry@Tallinn & Baltic Event, which ran alongside the Tallinn Black Nights Film Festival, wrapped on Nov. 21.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "France’s CNC Launches First Baltic-Focused Co-Production Workshop ",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/Michel-Plazanet-CNC-Edith-Sepp-Estonian-Film-Institute-1.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-24T09:27:10.000Z",
      "dateModified": "2025-11-24T09:27:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tallinn Winner ‘Lady,’ With ‘Fleabag’ Star Sian Clifford, Broken Down by Director Samuel Abrahams",
    "url": "https://variety.com/2025/film/global/tallinn-winner-lady-sian-clifford-samuel-abrahams-1236590637/",
    "image": "https://variety.com/wp-content/uploads/2025/10/Faili-F_1_Lady.png-koopia-1.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-24T11:39:25.000Z",
    "description": "\n\t“Activist,” “muse,” “empath,” “icon” read credits for four photo shots of Lady Isabella Ravenhyde in Samuel Abrahams’ buzzy and tenderly comic mocku",
    "body": "\n\t“Activist,” “muse,” “empath,” “icon” read credits for four photo shots of Lady Isabella Ravenhyde in Samuel Abrahams’ buzzy and tenderly comic mockumentary “Lady,” packing a tour de force performance by Sian Clifford, Phoebe Waller-Bridge’s control-freak elder sister in “Fleabag.”\n\n\tTallinn’s best director winner in its First Feature Competition on Saturday, “Lady”’s “icon” pose has Clifford as Isabella, dry martini glass in hand, astride a big pink rubber flamingo on the lawn of the Hall’s huge landscaped park. “I’m the aristocracy’s answer to the Kardashians,” she tells Sam, a filmmaker still awaiting his big breakthrough whom she hires for a Netflix documentary on her.\n\t\n\n\tTrouble is, a vampish aristo reality TV star meriting her own show in her dreams, now in her forties, the biggest gig she’s scored to date is co-hosting at the Hall “Stately Stars,” an annual kids talent show which she pays for. Netflix hasn’t heard of the documentary either. But as Sam begins to shoot his doc, thinking he’s found a hilarious one-can-short-of-a-sixpack cross between Norma Desmond and the Mitfords, Isabella begins literally to disappear, and more moving dimensions to her behaviour emerges. \n\n\n\t“Lady” was shot at Suffolk’s Somerleyton Hall, a magnificent, sprawling Tudor-Jacobean country house which was given an stunning Anglo-Italianate makeover over 1843-50. \n\n\tAlready a buzz title before its world premiere at the BFI London Film Festival on Oct. 16, “Lady” marks Abraham’s feature debut after he scored a BAFTA nomination for 2010 short “Connect.” “Lady” has gleaned glowing reviews in the U.K., The Guardian’s for instance, hailing “an outrageous barnstormer in this bizarre mockumentary comedy” that plays “like a scuzzier, shroomier B-side to “Saltburn,’” giving it four-and-a-half stars out of five.   \n\t\n\n\t“Lady” saw two sold-out screenings at Tallinn which marked the film’s international premiere on Nov. 20. It will be released in U.K. cinema theaters in 2026.      \n\n\tCo-written by Abrahams and his partner Miranda Campbell Bowling, “Lady” also stars Laurie Kynaston (“Cradle to Grave”) as the eager-beaver filmmaker Sam and Juliet Cowan (“Back to Black”) as Isabella’s long-suffering housekeeper. MetFilm Studio produced “Lady” and is handling its international sales. Variety talked to Abrahams the day after his “magical night” at Tallinn on Friday, just back in the U.K. but with a big smile written large across his face after his award. It will almost certainly not be the film’s last. \n\n\n\n\t\n\n\t\t\t\t\tSamuel Abrahams with his first feature best director award at the Tallinn Black Nights Film Festival  \n\t\t\t\t\t\t\t\t\tERLEND STAUB\nR-LEND OU\n\t\n\n\n\n\t“Lady” seems to me to represent, especially in its early going, the tragedy of much of modern mankind which would love to be the star of its own reality TV show yet has a sense of growing invisibility. But maybe I’m wrong….\n\n\tThe film doesn’t really specifically deal with technology or reality TV but it touches on that modern compulsion or obsession of wanting the world to look at us and give us validation, a sort of warm hug, when in fact technology is making us lonelier.\n\n\tThat need for validation is seen most immediately in Isabella but broadens out to Sam the director in the film whom Isabella accuses in a moment of catty lucidity of fearing that he will be exposed as a talentless coward with nothing to say….   \n\n\tThe spark, the initial idea, came from watching YouTube clips of people making their first posts, aspiring to be influencers, but clearly with no idea of how to present themselves, which was just really interesting. Every decision they were making was completely off – the song choices, the editing, just the subject matter. Their decisions were so bizarre and strange, and I was hooked on it. So, obviously, I subscribed. The audience was very small, probably only three people watching, but I was one of them. And I thought, this is so interesting. \n\n\tAnd not just because the clips were so bad?\n\n\tYes, it wasn’t just the car crash kind of perspective but also because it’s really related to Isabella’s wanting to put stuff out into the world and wanting an audience, because it’s exactly the same thing that I’m going through. I’m sort of in a way hiding more behind the work. She’s exposing herself and putting herself on the line and I’m making films and writing them and then getting actors to be in them. So it’s even more cowardly.\n\t\n\n\tSo you’d admit to a parallel between Sam the director of the film and Sam the director in the film…..\n\n\tYes. It was funny when Tallinn announced that the director award goes to Samuel Abrahams and then played a clip of Sam in the film introducing himself to housekeeper Becky, a clip of this director saying, hi, I’m Sam, I’m trying to make this movie. I think some people in the room were wondering: ‘Wait a minute, what’s, who is this?’\n\n\tReviewing the film some critics talk of its magic realism. But would you buy that?\n\n\tIt’s just a sort of a label, but helpful for people to sort of give it a kind of frame, to understand it. That said, when conceiving the idea for the film I didn’t set out out to make magical realism or necessarily even something surreal….\n\n\tSo where does it come from?\n\n\tIt came out of the character. I grew up on high concept ‘90s movies, like where Bill Murray repeats the same day over and over again. Or you can climb inside John Malkovich’s head or Jim Carrey can’t lie. There’s something about those ideas that are big, silly, cinematic, surreal conceits that drew me in. And then by the end of the movie, they’re delivering some kind of deep human meaning. When developing this character of Isabella as someone who was nakedly, desperately wanting the world to see her, it felt like a wicked curse I could bestow on her to watch her vanishing limb-by-limb towards complete invisibility and disappearance and oblivion.\n\n\tAt the get go, you collect a collage of shots of Isabella in death positions harking back to Agatha Christie when her supposedly dead body lies in a conservatory or to Japanese horror in the shot of a figure under a white sheet. The film constantly teases the audience what way it could go. Did that structure take a lot of time to develop?\n\n\tThere was a lot of urgency with this film in its creation right from the get-go. Once I had the character, about 18 months later we were shooting. So it was pretty quick. I wrote the script with Miranda, who’s also my partner. Sometimes when you’re writing, it can be very speculative, which it has been for me in the past, like if I was going to make this movie, this is what I’d want it to be. In this case, however, we knew the film was happening. It needed to get done.\n\t\n\n\tI imagine one turning point was securing Sian Clifford as the film’s star. \n\n\tIt was a very exciting moment. Sian is so talented and so funny and has delivered such a sort of layered performance with this great sort of vulnerability at its core. When we sent the script to her, she read it and said resonated with her and that she loved it. So we really hit it off, and she was an incredible collaborator and we’re very, very proud of her performance.\n\n\tAnd where do you go from here? \n\n\tMiranda and I have started writing the next one, which feels like a really clear evolution of the tone of voice,  the kind of vibe of this film but just bigger…\n\n\tAnd how would you describe your tone of voice? I’d say you’re touchingly comic. But would you agree? \n\n\tI love that. It’s great. But it’s very hard thing because before you’ve made the film, no one really knows what it is. Ultimately, the tone comes from all the decisions that are made to piece together this final movie, this story and, and how the story is being told. I suppose the things that interest me with tone is like finding a kind of vulnerability to characters and bringing that out – the truthfully strange peculiarities of human behaviour, avoiding the generic and finding the really kind of specific strangeness to the characters.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tallinn Winner ‘Lady,’ With ‘Fleabag’ Star Sian Clifford, Broken Down by Director Samuel Abrahams",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/Faili-F_1_Lady.png-koopia-1.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-24T11:39:25.000Z",
      "dateModified": "2025-11-24T11:39:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Latvia’s Animated Oscar Pick ‘Dog of God’ Flies to Germany and Greece – ‘The Naughty Stuff Was Inspired by Baltic Folk Songs’ (EXCLUSIVE)",
    "url": "https://variety.com/2025/film/global/latvia-oscar-dog-of-god-sales-germany-greece-1236590611/",
    "image": "https://variety.com/wp-content/uploads/2025/11/Dog-of-God-Tritone-Studio.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-24T10:16:45.000Z",
    "description": "\n\t“Dog of God,” Latvia’s second-in-a-row animated Oscar contender after the winning phenomenon “Flow,” continues to bark out loud after its successful",
    "body": "\n\t“Dog of God,” Latvia’s second-in-a-row animated Oscar contender after the winning phenomenon “Flow,” continues to bark out loud after its successful launch at Tribeca and follow up bow at 30-plus festivals, including Sitges and Tallinn’s Black Night.\n\n\tAfter major sales to Cartuna for North America and ESC Films for French-speaking territories, Berlin-based Media Move has clinched deals on the ‘Monty Pythonesque’ animation pic with Little Dream Pictures for Germany and Weird Wave for Greece. Little Dream Pictures will release the pic under its label Animation Addicts. \n\t\n\n\tThe only Baltic pic vying for the European Film Awards, both in the best European Film and animation categories, “Dog of God” is “building on its festival and awards buzz, and attracting a lot of interest in the specialised market,” said Media Move’s Justyna Koronkiewicz, currently negotiating rights for Japan, Poland, Latin-America and Korea. “Audiences want something fresh, elevated, in new genres and styles. We’ve seen with an innovative movie like ‘Hundreds of Beavers,’ how indie distributors took their guard down; now they take their chances with daring content, betting on a niche but devoted fan base. We’re extremely happy that all our distributors have committed to a theatrical release with ‘Dog of God,’” said Koronkiewicz. The U.S. launch via Cartuna is slated for second quarter 2026. \n\n\n\tA polar opposite to Gints Zilbalodis’s family animated pic “Flow,” “Dog of God” is an adult-focused horror comedy. Directed by Latvian brothers Lauris Ābele and Raitis Ābele who share the writing credit with Ivo Briedis and Harijs Grundmanis, the rotoscoped animation was depicted in Variety as “an envelope-pushing mix of savage satire and parabolic fantasy, set in a miserable 17th-century village where the sacred is frequently profane, and vice versa.” The third Ābele brother Marcis serves as cinematographer.\n\t\n\n\tThe story centres on an 80-year-old self-proclaimed werewolf called The Dog of God who turns up at a woman’s trial for witchcraft with a mysterious gift: the Devil’s Balls. “His arrival triggers a chain of unexpected events that climax” in a wild sexual rave party, transforming the village into a frenzy of unleashed desires,” runs the logline.\n\n\tSpeaking to Variety after the pic’s screening at Tallinn Black Nights’ Midnight Shivers, New-York Film Academy alumnus Raitis Ābele who graduated in clinical psychology “because my brother Lauris did philosophy and I couldn’t do the same,” said he got the idea to turn Ivo Briedis’ initial story into animation after working on “Flow” as production coordinator.\n\n\t“Ivo approached us because of our previous doc ‘Baltic Tribes, Last Pagans of Europe.’ We first tried to make it in live action. But it was super hard to find the tone, the angle and the money of course. After spending a year helping the “Flow” creators put their animation team together, I had the idea to use animation to push the film’s universe and themes,” says Raitis.\n\n\tA second pivotal moment was post-COVID, when the filmmakers could tap into a special recovery fund for experimental films. “We felt free to unleash our creativity as it was O.K. to be experimental.”\n\n\tEuropean Genre Forum\n\n\tThe Ābele brothers then attended the European Genre Forum, including the workshop’s finale in Tallinn. “Our mentors said, your audience is adult animation, don’t hold anything back. That audience has seen Japanese animation from the ‘90s, which means they are ready for anything,” Raitis recalls. Encouraged “to go wild”, the Ābele Bros decided to stick to a specific frame and stay close to their Baltic roots. \n\n\t“We wanted to stick to our Baltic pagan culture and in the film, all the naughty stuff are directly inspired by traditional folk songs. Then we widened the story of a court trial in the 17th century with a werewolf and added ‘fairy-tale like characters and magician spells.”\n\n\tFor Raitis, the pic, which features a flagellation-obsessed cleric, is not anti-religion but anti-authority, whatever its shape. “We are against the use of power. We’re not against a hierarchical society when it’s natural. But every hierarchy fucks up at some point. When order becomes too strict, it needs to be challenged. In Latvia, we’ve lived under Soviet occupation, and since gaining independence [in 1991], we’ve seen all the benefits of living in a democracy. We know its meaning and value.”\n\t\n\n\tRaitis said besides support from the National Film Centre of Latvia, the Latvian-U.S pic which he produced with Kristele Pudane for Tritone Studio for less than €1 million ($1.1 million), found a white knight in U.S. indie producer Giovanni Labadessa of Lumiere Lab. Impressed by the Latvian filmmakers’ 2021 “Troubled Minds,”, the L.A.-based producer helped them lock the financing.\n\n\tOscar campaign\n\n\t“Now we’re all working hard on the Oscar campaign,” said Raitis whose brother Lauris – at press time – was flying to the U.S., with a special Latvian present in his bags to AMPAS members: Chaga mushroom body skincare. “These aren’t psychedelic but medicinal mushrooms with healing powers. I hope Lauris will make it through customs with them!”, quipped Raitis who hopes to build on the “Flow” momentum and make it to the next round of Oscar short-listing for best international feature Dec. 16.\n\n\t“Flow” has propelled Latvian – and Baltic cinema – onto the global stage but Gints’ film has also opened the doors to the full spectrum of animated pics outside Pixar and Disney,” he said.\n\n\tNext up for the brothers is the live action pic “Wagner and Satan” about the German composer’s formative years in the Latvian capital. “It will be a thriller full of paganism, occultism, a true Faustian drama,” pledges Raitis.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Latvia’s Animated Oscar Pick ‘Dog of God’ Flies to Germany and Greece – ‘The Naughty Stuff Was Inspired by Baltic Folk Songs’ (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/Dog-of-God-Tritone-Studio.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-24T10:16:45.000Z",
      "dateModified": "2025-11-24T10:16:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Parrot Analytics Teams With Qatar’s Nascent Film Committee, Opens Middle East Office in Doha",
    "url": "https://variety.com/2025/digital/global/parrot-analytics-qatar-film-committee-middle-east-doha-1236590517/",
    "image": "https://variety.com/wp-content/uploads/2025/11/Hossan-Al-Thawadi.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-24T09:10:50.000Z",
    "description": "\n\tProminent media analytics company has partnered with Qatar’s nascent Film Committee to open a regional office in the Qatari capital of Doha that wil",
    "body": "\n\tProminent media analytics company has partnered with Qatar’s nascent Film Committee to open a regional office in the Qatari capital of Doha that will provide data-driven intelligence to the tiny Arab state rich in oil and gas that is aiming to take its nascent film and TV business to the next level.\n\n\tThe Qatar Film Committee is an official body that is part of the Media City Qatar hub tasked with driving growth of the country’s entertainment industry. It is led by Hassan Al Thawadi (pictured) the Qatari lawyer who oversaw the 2022 FIFA World Cup soccer tournament, which was considered a triumph for the country.\n\t\n\n\t“Under the partnership, Film Committee will embed Parrot Analytics‘ predictive analytics into every investment decision, transforming how content is selected, developed, and marketed,” according to a joint statement. \n\n\n\t“This makes Qatar the first country in the MENA [Middle East and North Africa] region to adopt an end-to-end data-driven film financing strategy, setting a new standard for a return on investment-driven national content investment,” the statement noted.\n\n\tThe partnership was announced during the inaugural Doha Film Festival‘s Industry Days, which saw a flurry of announcements including the launch of a a regional rebate on production offering up to 50% in cash, production deals with U.S. studios Neon, Miramax and Sony and with Hollywood’s post-production and VFX giant Company 3 to set up a post-production and VFX studio in Doha.\n\n\tIn leveraging Parrot Analytics’ global audience analytics, Qatar’s Film Committee joins top streamers and  studios including Disney, Amazon Prime Video, Warner Bros. Discovery and Sony Pictures.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Parrot Analytics Teams With Qatar’s Nascent Film Committee, Opens Middle East Office in Doha",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/Hossan-Al-Thawadi.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-24T09:10:50.000Z",
      "dateModified": "2025-11-24T09:10:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Baltic Projects to Watch Shed Light on Global Issues That Are ‘Painfully Relevant’",
    "url": "https://variety.com/2025/film/global/baltic-projects-to-watch-sarunas-bartas-erika-salumae-1236589398/",
    "image": "https://variety.com/wp-content/uploads/2025/11/MixCollage-24-Nov-2025-11-01-AM-9808.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-24T10:39:13.000Z",
    "description": "\n\tFrom ambitious dramas to a TV series inspired by the Danske Bank scandal, Baltic projects look for inspiration in the most unusual places. According",
    "body": "\n\tFrom ambitious dramas to a TV series inspired by the Danske Bank scandal, Baltic projects look for inspiration in the most unusual places. According to director Ove Musting, behind “Business as Usual,” the goal was not to judge the characters, “but to understand how the system seduces them.”\n\n\t“This is a world where bankers behave like aristocracy, where Danish executives function like kings and where oligarchs appear almost mythological: charming, terrifying, and willing to offer unimaginable wealth for a few drops of blood.”\n\t\n\n\tCorruption doesn’t start with grand criminal masterminds, he states, but with “small compromises made by normal people who believe they can outsmart the devil. ‘Business as Usual’ is thrilling, absurd, visually bold and painfully relevant. It shows how billions can flow silently across Europe, beneath the radar of politicians and regulators – until one day, the truth becomes too big to hide.”\n\n\n\tJust like in “War on Women” about networks spreading anti-women and anti-LGBTQ message, called by producer Elina Litvinova a “story with increasing urgency for the global audiences and the protection of human rights and democracy.” She adds: “It’s a deeply moving personal journey while shedding light on global issues.”\n\n\tAs for documentaries, Šarūnas Bartas opens up about personal tragedy in “Laguna,” Aistė Žegulytė comes close to microorganisms in “Holy Destructors” and in “A Goodnight Kiss,” the life of Holocaust survivor Irena Veisaitė might inspire those struggling today. \n\n\t“So far, both national and international audiences have shared the same response: the film has a deeply calming effect. Even though the film shows the brutal experiences of the 20th century and carries an unsettling sense that history’s darkness is returning, our heroine, through her humanity and inner strength, seems to offer a way to endure in these turbulent times,” she said. \n\t\n\n\tIn “Morten” by debuting director Ivan Pavljutškov, where a teen is suddenly faced with two girls in his life, “threads of folklore weave through the narrative, giving the film a sense of timelessness, as if the past breathes softly alongside the present.” Pavljutškov notes: “It contains elements of magical realism, but they remain subtle, serving the story in a delicate, poetic way.”\n\n\tPoetry also made its way into “No Me Without You” by Janno Jürgens, offering an usual take on sisterly conflicts. \n\n\t“The story’s exploration of love, anger, grief and reconciliation resonates broadly, while the rural Estonian setting grounds it in a unique, tangible world. Janno’s decision to place the characters in extreme, morally complex situations amplifies the emotional stakes and allows audiences to engage fully with the characters’ inner lives,” say producers Marju Lepp and Manfred Vainokivi.\n\n\tThe film is set in the countryside, where “one is in more direct contact with the surrounding nature and the primal essence of being human,” observes Jürgens, praising his “unique Estonian homeland” with its “unspoiled nature.” “It’s a Nordic jungle where nature and people are deeply connected, with shared stories and histories.”\n\n\tWhile “China Sea” marked the first co-production between Lithuania and Taiwan, while “Our Erika” by German Golub also bet on international collaboration. It’s a biopic of Erika Salumäe, Olympic champion in track cycling.\n\n\t“Despite the relatively modest budgets of Baltic cinema, our co-production pushes production values to the edge: we aim for a minimalist, atmospheric and authentic depiction of Erika’s world,” he told Variety. It’s produced by Estonia’s Filmivabrik, joined by Amber Land Film from Latvia and Uljana Kim Studio from Lithuania, with additional Estonian co-producers Hansafilm and Elisa Estonia.\n\n\t“It’s more than just an Estonian tale; it is the story of a girl who, like many athletes in occupied Soviet countries, tried to endure and succeed in a very challenging system. Erika’s example illustrates the shared history of post-Soviet countries and, hopefully, inspires today’s generation to persevere in their goals, even when their dreams seem almost impossible.” \n\t\n\n\tProfiles of some recent and upcoming Baltic titles to keep on the radar:\n\n\t“Business as Usual”\n\n\tTV Series\n\n\t(Estonia)\n\n\tDir: Ove Musting\n\n\tThis six-part thriller, inspired by the Danske Bank scandal, follows Artur, who becomes the favorite banker of Russian oligarchs. Musting says: “The tone of the series sits at the intersection of dark comedy, crime thriller and character-driven drama. It has the energy and chaos of ‘The Wolf of Wall Street,’ the criminal absurdity of ‘Snatch’ and the grounded psychological realism of Nordic drama.” “Our aim is to reveal the mechanisms behind dirty money to audiences in an entertaining and captivating way. We are currently seeking partners from the Nordics and beyond to co-develop, package, and finance the project into a truly international series,” adds Evelin Penttilä, producer at Stellar Film. \n\n\n\n\t\n\n\t\n\n\n\n\t“China Sea”\n\n\t(Lithuania, Taiwan, Poland, Czechia)\n\n\tDir: Director Jurgis Matulevičius\n\n\tThe first-ever co-production between Lithuania and Taiwan about a martial artist finding refuge in a Taiwanese restaurant – which world-premiered at Black Nights – features a cast from both countries, performing in a hybrid dialect that blends Mandarin and Lithuanian. Producer Ieva Cern says: “In this political climate, it’s a great pleasure for a country like Lithuania to have as co-producers not only our close European partners from Poland and the Czech Republic, but also Taiwan – a country we deeply relate to and that has brought an absolutely outstanding cast to the film.”\n\n\n\n\t\n\n\t\n\n\n\n\t“Flesh, Blood, Even a Heart” \n\n\t(Latvia)\n\n\tDir: Alise Zarina\n\n\tThe film, set to premiere in January 2026, explores two of the most universal struggles we carry into adulthood, says producer Alise Rogule (Mima Films): “The longing to heal old wounds with a parent and the quiet work of keeping love alive with a partner.” As Liv faces her estranged father’s sudden collapse and the growing distance in her marriage, the film moves between humor and heartbreak “with disarming honesty”. “It explores Eastern Europe’s ongoing efforts to process post-Soviet trauma, an experience that still haunts the region and the generation striving to move beyond it, placing the work within the new wave of Baltic cinema that examines the contemporary, the present and the urgent.” \n\t\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tCourtesy of Mima Films\n\t\n\n\n\n\t“A Goodnight Kiss”\n\n\tDocumentary\n\n\t(Lithuania, Estonia)\n\n\tDir: Giedrė Žickytė\n\n\tThis co-production between Lithuania, Estonia and Bulgaria (Moonmakers, Allfilm and Agitprop) follows the final years of professor Irena Veisaitė, a Holocaust survivor who “lived through war, atrocities and loss yet never succumbed to hatred,” explained Žickytė, admitting her protagonist became an inspiration to “many in Lithuania and beyond.” “The film [shows] how to remain human in inhuman times. It speaks to our present moment, to a world that once again feels fragile and polarized.” It features the music of renowned composer Arvo Pärt and was edited by Atanas Georgiev who also worked on “Honeyland.” \n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tCourtesy of Moonmakers\n\t\n\n\n\n\t“Holy Destructors”\n\n\tDocumentary\n\n\t(Lithuania, France, Latvia)\n\n\tDir: Aistė Žegulytė\n\n\tShown at IDFA as well as Black Nights, this creative documentary takes on the incredible world of… fungi and other microorganisms, as well as the never-ending circle of life. “I’m incredibly happy that after six years of living with fungi and with the people who became the film’s protagonists, our premiere finally happened. Only with them could all these magical adventures come to life,” notes Žegulytė, also known for “Animus Animalis (A Story About People, Animals and Things).” Produced by Studio Uljana Kim, it was co-produced by To Be Continued and Studio Locomotive.\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tCourtesy of Studio Uljana Kim\n\t\n\n\n\n\t“Laguna”\n\n\tDocumentary\n\n\t(Lithuania, France)\n\n\tDir: Šarūnas Bartas\n\n\tOne of Lithuania’s best-known filmmakers returns with a documentary. Produced by Studija Kinema and sold by Shellac, it premiered in Venice in September. “I could divide my life into two parts. The first – before the death of my daughter, and the second – after she was no longer among us. Naturally, there were sincere thoughts of ending everything. Only a barely visible thread, thin as a strand of silk, kept me tied to this world,” he said. “With the help of my youngest daughter, Una Marija, I managed to find a new beginning and continue doing what I have done all my life – to show people my feelings with unconditional openness. I managed to come back.”\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tCourtesy of Shellac\n\t\n\n\n\n\t“Morten”\n\n\t(Estonia, Lithuania)\n\n\tDir: Ivan Pavljutškov\n\n\tIn the film, aimed at young audiences and based on award-winning novel, Morten – an introverted teenager – hides his chaotic home life. Then Emilie, a mysterious girl he meets in a swamp, and Miia enter the picture. He finds himself trapped between friendship and love. “It’s a special story for me. Though it holds the realistic everyday life of a young person and the gentle romance of first relationships, it is also imbued with a quiet mysticism,” observes Ivan Pavljutškov, making his feature debut. “And of course, the fresh, talented young actors are a wonder to behold.” Anneli Ahven produces, joined by Fralita Films. \n\t\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tCourtesy of Anneli Ahven\n\t\n\n\n\n\t“No Me Without You”\n\n\t(Estonia)\n\n\tDir: Janno Jürgens\n\n\tDescribed as a psychological thriller about all-consuming love and revenge, now in post-production, it’s “set in a Nordic jungle where three women collide.” “The love-hate dynamic between sisters is a mystery. Our way of grappling with this is by placing the characters in an extreme situation – a chain of events that seems unbelievable, painful, even veering into the realm of fantasy – at the center of which their deepest emotions are revealed,” says Jürgens. “His vision has transformed a deeply emotional narrative into a visually compelling, immersive experience, blending drama, thriller, and horror elements,” add producers Marju Lepp and Manfred Vainokivi.\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tCourtesy of Filmivabrik\n\t\n\n\n\n\t“Our Erika”\n\n\t(Estonia, Lithuania, Latvia)\n\n\tDir: German Golub \n\n\tThis biographical sports film is inspired by the life of Estonian Olympic cycling champion Erika Salumäe. “Erika is known as a powerful athlete, politician and person whose fate still divides opinion,” notes Golub. Karolin Jürise prepared for the role for over two years. “Like Erika’s journey to the Olympic heights, the creation of this Estonian film, co-produced with Lithuania and Latvia, has been as hard and unique as track cycling, where tactics, determination and speed are key to success.” He calls the film “dense and eventful.” “Through Erika’s story we explore how childhood trauma reshapes desire, what genuine support looks like, and what the victory actually costs the person who wins.” \n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tCourtesy of Filmivabrik\n\t\n\n\n\n\t“Ulya”\n\n\t(Latvia, Estonia, Poland, Lithuania)\n\n\tDir: Viesturs Kairišs\n\n\tThis drama, written by Livia Ulman, Andris Feldmanis and Kārlis Arnolds Avots, follows a teenage girl in Soviet Latvia. “The idea of the film came from Kārlis Arnolds Avots, who also wrote the first draft of the script and played Ulya in the film,” said producer Guntis Trekteris (Ego Media). In 1964, the protagonist is caught between the safety of her village and the spotlight of a legendary women’s basketball team, and must confront whether her extraordinary body is a curse or her only path to belonging. Chulpan Khamatova, Alise Dzene and Artūrs Krūzkops also star, while Polish cinematographer Wojciech Staroń is lensing the film. \n\t\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tCourtesy of Ego Media\n\t\n\n\n\n\t“War on Women”\n\n\tDocumentary\n\n\t(Estonia, Romania, Germany, UK)\n\n\tDir: Maris Salumets\n\n\tIn her doc, Salumets takes on European networks’ deepening gender inequality. “When I saw a wave of anti-women and anti-LGBTQ attacks sweeping Eastern Europe, I realized these weren’t isolated events but a coordinated movement,” she says. “Together with my co-writer Tereza Nvotová [director of ‘Father’], we wanted to go beyond a heavy journalistic exposé and create an investigative film that works through emotion as well as evidence – so audiences don’t just understand what is happening, but they also feel why it matters.” Three Brothers, Gambit Film, Doc Society, Insel Film, Manifest Film and Allfilm produce. \n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tCourtesy of Three Brothers\n\t\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Baltic Projects to Watch Shed Light on Global Issues That Are ‘Painfully Relevant’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/MixCollage-24-Nov-2025-11-01-AM-9808.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-24T10:39:13.000Z",
      "dateModified": "2025-11-24T10:39:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Dharmendra, Iconic Bollywood Star of ‘Sholay’ and ‘Phool Aur Patthar,’ Dies at 89",
    "url": "https://variety.com/2025/film/obituaries-people-news/dharmendra-dead-sholay-bollywood-star-1236590603/",
    "image": "https://variety.com/wp-content/uploads/2025/11/GettyImages-1832516603.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-24T09:39:24.000Z",
    "description": "\n\tDharmendra, one of Indian cinema’s most beloved and enduring stars whose career spanned more than six decades, died on Monday. He was 89. In recent ",
    "body": "\n\tDharmendra, one of Indian cinema’s most beloved and enduring stars whose career spanned more than six decades, died on Monday. He was 89. In recent weeks he was admitted to a hospital in Mumbai due to respiratory issues and later discharged. \n\n\tKnown to generations as the “He-Man” of Hindi cinema, Dharmendra combined matinee-idol looks with a naturalistic charm that made him a household name from the 1960s onward. He appeared in more than 250 films, including some of India’s biggest hits such as “Sholay,” “Phool Aur Patthar,” “Satyakam,” “Chupke Chupke,” “Seeta Aur Geeta,” “Yaadon Ki Baaraat,” “Loafer,” “Blackmail” and “Jugnu.”\n\t\n\n\tBorn in Nasrali, Punjab, on Dec. 8, 1935 – sources variously list his birth name as Dharam Singh Deol or Dharmendra Kewal Krishan Deol – he moved to Mumbai (then Bombay) after winning a talent contest organized by Filmfare magazine. He made his screen debut in 1960 with “Dil Bhi Tera Hum Bhi Tere,” and achieved stardom six years later with O.P. Ralhan’s “Phool Aur Patthar,” where his bare-chested scene earned him the “He-Man” moniker.\n\n\n\tOver the next decade, Dharmendra dominated the box office through a diverse slate of films that showcased his versatility — from the tragic idealist of Hrishikesh Mukherjee’s “Satyakam” to the comic lightness of “Chupke Chupke” and the rugged heroism of “Sholay,” where he played Veeru opposite Amitabh Bachchan’s Jai in one of Indian cinema’s most iconic buddy pairings.\n\n\tBetween 1978 and 1997, he sustained his stardom through action-oriented and ensemble films such as “The Burning Train,” “Azaad,” “Rajput,” “Batwara” and “Hathyar,” while transitioning gradually into patriarchal and character roles. He also founded his own production banner, Vijayta Films, which produced the 1983 blockbuster “Betaab,” launching his son Sunny Deol.\n\t\n\n\tDharmendra married Prakash Kaur, before he entered the film industry, and the couple had four children, including actors Sunny and Bobby Deol. In the 1970s, he formed one of Bollywood’s most enduring on- and off-screen partnerships with actress Hema Malini, his co-star in more than 40 films and later his wife. Their relationship drew intense public scrutiny, but the pair remained together for decades and had two daughters, Esha and Ahana Deol.\n\n\tBeyond acting, Dharmendra entered politics as a member of India’s Parliament from 2004 to 2009, representing Bikaner for the Bharatiya Janata Party. He later returned to film with roles in “Apne,” “Yamla Pagla Deewana,” and its sequels, sharing the screen with his sons Sunny and Bobby Deol, both successful actors in their own right.\n\n\tHe was honored with India’s Padma Bhushan, one of the nation’s highest civilian awards, and received the Filmfare Lifetime Achievement Award in 1997.\n\n\tIn later years, Dharmendra remained active on social media and made public appearances celebrating Indian cinema’s golden age. His warmth and humility earned him a reputation as one of the industry’s most generous colleagues.\n\n\tHe is survived by Prakash Kaur; Hema Malini; sons Sunny, Bobby, and Karan Deol; and daughters Esha and Ahana Deol, among others.\n\n\tIndian Prime Minister Narendra Modi posted: “The passing of Dharmendra Ji marks the end of an era in Indian cinema. He was an iconic film personality, a phenomenal actor who brought charm and depth to every role he played. The manner in which he played diverse roles struck a chord with countless people. Dharmendra Ji was equally admired for his simplicity, humility and warmth. In this sad hour, my thoughts are with his family, friends and innumerable fans. Om Shanti.”\n\n\tOne of Dharmendra’s last films is war epic “Ikkis,” releasing over Christmas, directed by Sriram Raghavan, who also helmed the actor’s “Johnny Gaddaar” (2007.” \n\n\t“Naturally, I feel terrible,” Raghavan told Variety. “This [“Ikkis”] is a very important role he’s done, and I’m very happy he did the film with me. We began shooting in 2023, Diwali time, and I dubbed with him in October. He’s got one of the main characters in the film. I used to feel very bad when people used to take him and give him very small roles, almost insignificant roles. So five years back, I told him, I’m doing this film, that you have to be there. And he heard the story. He was completely wowed by it and then he came, and he shot all over the country.”\n\t\n\n\t“His age was there… he gets tired easily and all that. But the wonderful thing is, when the camera goes on, he changes. That is something I’ve noticed, like almost every shot, you think, okay, he’s tired. We should pack up now. Then two more shots, then he’ll come and he’ll start,” Raghavan added. “I have loved him as an actor. There are all kinds of roles, from ‘Bandini’ and ‘Anupama’ and there was there “Johnny Gaddaar” also. I had a great time working with him. I spent a lot of time with him. That’s my good luck.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Dharmendra, Iconic Bollywood Star of ‘Sholay’ and ‘Phool Aur Patthar,’ Dies at 89",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/GettyImages-1832516603.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-24T09:39:24.000Z",
      "dateModified": "2025-11-24T09:39:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘The Office’ South African Adaptation ‘Die Kantoor’ Sets Showmax Premiere Date (EXCLUSIVE)",
    "url": "https://variety.com/2025/tv/news/the-office-south-african-adaptation-die-kantoor-premiere-1236590533/",
    "image": "https://variety.com/wp-content/uploads/2025/11/The-Office-South-Africa.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-24T09:00:00.000Z",
    "description": "\n\tThe Afrikaans-language adaptation of “The Office” has locked in its premiere date, with “Die Kantoor” set to debut on Showmax on Jan. 20.\n\n\tBroadcas",
    "body": "\n\tThe Afrikaans-language adaptation of “The Office” has locked in its premiere date, with “Die Kantoor” set to debut on Showmax on Jan. 20.\n\n\tBroadcaster kykNET will preview the first episode on Jan. 18, ahead of the double-episode premiere on the African streamer two days later.\n\n\tThe South African version marks the 14th international adaptation of the BBC Studios format. The series relocates the workplace from a paper company to Deluxe Processed Meats, a polony manufacturer.\n\t\n\n\tSAFTA and Silwerskerm winner Bennie Fourie is writing and directing the adaptation.\n\n\n\t“It’s a massive honor to be able to make the show,” Fourie said. “When we started way back with “Hotel,” this was the type of show that we were trying to emulate. I don’t think we were ready to make it then but after 10 years of playing with the mockumentary genre, now is the perfect time for us to do this. Everything has really fallen into place and we’re extremely excited.”\n\n\tFourie emphasized the series reimagines the format for South African audiences rather than offering a direct translation. “South Africa is not the U.K. and it’s not the U.S., and we really wanted to reflect that,” he said.\n\n\tThe choice of a polony manufacturer as the workplace setting reflects local culture while maintaining the format’s signature awkward dynamics. “South Africa is a proud meat-consuming nation,” Fourie explained. “From biltong to droëwors to steak, many South Africans find some of our identity in the meat we eat. But polony is not on that list. It’s just so flippen pink. When you’re standing around a braai, the last thing you want to say is that you are passionate about polony. Especially after that Listeriosis outbreak.”\n\t\n\n\tAlbert Pretorius, winner of the 2025 Fleur du Cap award, leads the cast as Flip, the office manager. “Flip’s only been the manager for the last year but he’s excited to welcome the documentary crew,” Fourie said. “He feels like this is his ‘Chasing the Sun’ [rugby documentary]; like his rise to greatness needs to be recorded.”\n\n\tThe ensemble includes SAFTA winner Schalk Bezuidenhout, Lida Botha, Carl Beukes, Silwerskerm winner Ilse Oppelt, Daniah de Villiers, Mehboob Bawa, Sipumziwe Lucwaba and newcomer Gert du Plessis.\n\n\tRapid Blue, part of BBC Studios, is producing the Showmax Original, with BBC Studios handling global sales.\n\n\t“Our very first Showmax Original was a mockumentary, ‘Tali’s Wedding Diary,’ so reimagining the most iconic mockumentary of them all has been a full circle moment for us,” said Tracy-Ann van Rooyen, executive head of content at Showmax, part of MultiChoice, a Canal+ company.\n\n\tThe original British series, created by Ricky Gervais and Stephen Merchant, debuted over 20 years ago. The format has since been adapted in territories including Australia, France, Canada, Chile, Israel, India, the Middle East and Poland. The U.S. version won five Emmys, including outstanding comedy series.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘The Office’ South African Adaptation ‘Die Kantoor’ Sets Showmax Premiere Date (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/The-Office-South-Africa.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-24T09:00:00.000Z",
      "dateModified": "2025-11-24T09:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'Serial Intruder' Who Grabbed Ariana Grande Reportedly Deported, Barred From Singapore",
    "url": "https://www.tmz.com/2025/11/23/ariana-grande-fan-barred-from-singapore/",
    "image": "https://imagez.tmz.com/image/73/16by9/2025/11/23/73b45df5e927440189cbbc49012c1b41_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-23T20:14:19.000Z",
    "description": "\n    \n                    \n                          Ariana Grande\n                          'Wicked' Actions Get Clout Chaser Barred From Singapore '",
    "body": "\n    \n                    \n                          Ariana Grande\n                          'Wicked' Actions Get Clout Chaser Barred From Singapore 'For Good'!!!\n                      \n                  \n                        Published November 23, 2025 12:14 PM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Ariana Grande hasn't shut the door on 'Wicked 3' ... but Singapore has shut the door on a clout chaser who grabbed her during a \"Wicked: For Good\" event.\n      \n    \n          Remember, 26-year-old Johnson Wen jumped on the red carpet November 13 and rushed at the star, forcing Cynthia Erivo to step in and shield her close pal.\n      \n    \n      \n        \n                    \n                  \n      \n                    X/@lelandweszka\n          \n    \n          Now, The Straits Times -- an English-language newspaper based in the Southeast Asian country -- reports Wen was deported from the country Sunday ... and, he's been barred from reentering the nation.\n      \n\n          Prosecutors described Wen as a \"serial intruder\" ... and a judge determined he planned the intrusion to make a viral video on social media.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Wen pled guilty to one charge of being a public nuisance and was sentenced to nine days in jail. However, he seemed unconcerned about the arrest ... sharing photos after his release from jail, and even thanking Grande for letting him \"Jump on the Yellow Carpet\" with him.\n      \n    \n          Johnson's IG page shows this isn't the first time he's sidled up to celebrities like this ... having previously jumped onstage to get close to Katy Perry and The Weeknd.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Ariana Grande\n              \n                          \n                Cynthia Erivo\n              \n                          \n                Celebrity News\n              \n                          \n                Fairly Legal\n              \n                          \n                Wicked\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Serial Intruder' Who Grabbed Ariana Grande Reportedly Deported, Barred From Singapore",
      "image": [
        "https://imagez.tmz.com/image/73/16by9/2025/11/23/73b45df5e927440189cbbc49012c1b41_xl.jpg"
      ],
      "datePublished": "2025-11-23T20:14:19.000Z",
      "dateModified": "2025-11-23T20:14:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Avani Gregg Hot Shots to Celebrate Her 23rd Birthday!",
    "url": "https://www.tmz.com/2025/11/23/avani-gregg-hot-shots-23rd-birthday/",
    "image": "https://imagez.tmz.com/image/63/16by9/2025/11/19/6382dd247244410a9d9247174eaac3ee_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-23T15:00:02.000Z",
    "description": "\n    \n                    \n                          Avani Gregg's\n                          Hottest Shots\n                          To Celebrate Her ",
    "body": "\n    \n                    \n                          Avani Gregg's\n                          Hottest Shots\n                          To Celebrate Her 23rd Birthday!\n                      \n                  \n                        Published November 23, 2025 7:00 AM PST\n                                                                            \n      \n    \n      \n        \n              \n    \n    \n          We keep tabs on lots of social media stars ... and we're really paying attention to Avani Gregg this weekend -- because she's turning 23!\n      \n    \n          She's also an actress on a steady rise to fame ... and since she's shared plenty of sexy snaps along the way, here's a refresher for the occasion.\n      \n    \n          Make the most of this, because Gregg's special day only comes once a year ... Happy Birthday Avani!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Social Media\n              \n                          \n                Hotties & Bodies\n              \n                          \n                Hot Bodies\n              \n                          \n                Birthdays\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Avani Gregg Hot Shots to Celebrate Her 23rd Birthday!",
      "image": [
        "https://imagez.tmz.com/image/63/16by9/2025/11/19/6382dd247244410a9d9247174eaac3ee_xl.jpg"
      ],
      "datePublished": "2025-11-23T15:00:02.000Z",
      "dateModified": "2025-11-23T15:00:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Disney Cruise Passenger Missing, Presumed Dead After Falling Overboard",
    "url": "https://www.tmz.com/2025/11/23/disney-cruise-passenger-missing/",
    "image": "https://imagez.tmz.com/image/de/16by9/2025/11/23/de1d79b2b0ae41c488c7a4c2a3a35b71_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-23T21:30:56.000Z",
    "description": "\n    \n                    \n                          Disney Cruise\n                          73-Year-Old Man Goes Missing ...\n                        ",
    "body": "\n    \n                    \n                          Disney Cruise\n                          73-Year-Old Man Goes Missing ...\n                          Authorities Think He Jumped Overboard\n                      \n                  \n                        Published November 23, 2025 1:30 PM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          A 73-year-old man is missing after falling overboard off a Disney cruise between Australia and New Zealand.\n      \n    \n          According to 7 News Australia, the man -- who hasn't been publicly identified -- fell off the Disney Wonder ship around 4:30 AM local time on Saturday.\n      \n    \n          A police spokeswoman told the outlet, “It is understood the man died after he jumped from a cruise liner into the waters in the Tasman Sea.\"\n      \n\n                  \n          \n                          \n                \n                  \n      \n    \n          The crew searched for the missing man for approximately five hours according to reports ... and one passenger told 7 News Australia the atmosphere on the ship was \"a bit eerie\" the rest of the day.\n      \n    \n          Authorities say they're not treating the death as suspicious ... and the ship is still on its way to Auckland, NZ -- though it will now arrive a day behind schedule.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Celebrity News\n              \n                          \n                Fairly Legal\n              \n                          \n                Disney\n              \n                          \n                Vacations\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Disney Cruise Passenger Missing, Presumed Dead After Falling Overboard",
      "image": [
        "https://imagez.tmz.com/image/de/16by9/2025/11/23/de1d79b2b0ae41c488c7a4c2a3a35b71_xl.jpg"
      ],
      "datePublished": "2025-11-23T21:30:56.000Z",
      "dateModified": "2025-11-23T21:30:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Guess Who This Low-Key Performer Is!",
    "url": "https://www.tmz.com/2025/11/23/guess-who-low-key-performer/",
    "image": "https://imagez.tmz.com/image/e2/16by9/2025/11/19/e2613fe768f84e62bd05cc459235e700_xl.png",
    "tag": "Entertainment",
    "date": "2025-11-24T00:00:04.000Z",
    "description": "\n    \n                    \n                          Guess Who\n                          This Low-Key Performer Is!\n                      \n           ",
    "body": "\n    \n                    \n                          Guess Who\n                          This Low-Key Performer Is!\n                      \n                  \n                        Published November 23, 2025 4:00 PM PST\n                                                                            \n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          We all know some actors love to steal the spotlight, but others are just as powerful when they blend into the scenery -- can you guess who this low-key star is?\n      \n    \n          We ran into this guy way back in the day stepping out in the Big Apple, and the guy naturally blended into the hustle and bustle of New York City ... in a borderline Oscar-winning performance!\n      \n    \n          He didn't have an Academy Award at the time, though ... he had to wait until 2023 to pick up one of those!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Guess Who\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Guess Who This Low-Key Performer Is!",
      "image": [
        "https://imagez.tmz.com/image/e2/16by9/2025/11/19/e2613fe768f84e62bd05cc459235e700_xl.png"
      ],
      "datePublished": "2025-11-24T00:00:04.000Z",
      "dateModified": "2025-11-24T00:00:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "LeBron James Would Be 'Baller' For USMNT In His Prime, Says Diego Luna",
    "url": "https://www.tmz.com/2025/11/24/diego-luna-says-lebron-james-great-for-usmnt/",
    "image": "https://imagez.tmz.com/image/6a/16by9/2025/11/21/6a45e288fc3c489e9bf92e0cf808e8c4_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-24T08:30:58.000Z",
    "description": "\n    \n                    \n                          Diego Luna\n                          LeBron Would Be A Boss On USMNT\n                          ..",
    "body": "\n    \n                    \n                          Diego Luna\n                          LeBron Would Be A Boss On USMNT\n                          ... 'He'd Be A Baller!!!'\n                      \n                  \n                        Published November 24, 2025 12:30 AM PST\n                                                                            \n      \n    \n      \n        \n                    \n                  \n      \n                    TMZSports.com\n          \n    \n          LeBron James was quite the football player in high school ... but how about football?? USMNT player Diego Luna tells TMZ Sports he woulda been a BEAST on the pitch in his prime!!\n      \n    \n          There's always an athlete claiming they could dominate another sport ... so when we ran into Luna at LAX this week, we had to ask which American jock could actually pull it off for the Red, White, and Blue.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          \"LeBron man, put him up top,\" Luna said. \"Scoring goals, just bossing people around. That would be pretty sick.\"\n      \n\n          Of course, Luna -- a two-time MLS All-Star -- is envisioning a younger James. LeBron is turning 41 this December ... and just started his 23rd season in the NBA -- the first player to ever reach the milestone.\n      \n    \n          \"In his prime, he'd be a baller, for sure,\" Luna said.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          James was a versatile athlete back at Akron's St. Vincent-St. Mary High School. Remember, outside of basketball, LBJ played wide receiver on the football team. Some believe he was so good, he could've played in the NFL.\n      \n    \n          Who knows what might have been ... but one thing's clear ... there's no limit to what King James can do!!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                LeBron James\n              \n                          \n                Celebrity News\n              \n                          \n                TMZ Sports\n              \n                          \n                NBA\n              \n                          \n                MLS\n              \n                          \n                Fairly Legal\n              \n                          \n                In The Field\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "LeBron James Would Be 'Baller' For USMNT In His Prime, Says Diego Luna",
      "image": [
        "https://imagez.tmz.com/image/6a/16by9/2025/11/21/6a45e288fc3c489e9bf92e0cf808e8c4_xl.jpg"
      ],
      "datePublished": "2025-11-24T08:30:58.000Z",
      "dateModified": "2025-11-24T08:30:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]