[
  {
    "title": "‘Pluribus’ Ad Features Bob Odenkirk, Bryan Cranston and More Stars From ‘Breaking Bad’ Universe Talking to Rhea Seehorn",
    "url": "https://variety.com/2025/tv/news/pluribus-ad-breaking-bad-bob-odenkirk-bryan-cranston-1236573999/",
    "image": "https://variety.com/wp-content/uploads/2025/11/Screen-Shot-2025-11-10-at-10.17.34-AM-e1762789225508.png?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-10T16:06:00.000Z",
    "description": "\n\tIt’s a “Pluribus“-“Breaking Bad”-“Better Call Saul” crossover! (Sort of.)\n\n\tIn a new promotional teaser for Vince Gilligan’s new Apple TV series, Bo",
    "body": "\n\tIt’s a “Pluribus“-“Breaking Bad”-“Better Call Saul” crossover! (Sort of.)\n\n\tIn a new promotional teaser for Vince Gilligan’s new Apple TV series, Bob Odenkirk, Bryan Cranston, Aaron Paul and more actors from the Walter White universe appear on television to greet Rhea Seehorn’s character, Carol Sturka.\n\n\t“Pluribus” follows Carol — dubbed “the most miserable person on Earth” — as she must “save the world from happiness.” When a world-shattering event turns most of the global population into a friendly hive mind, Carol sets out to protect her individuality.\n\t\n\n\tAt the end of the first episode, Carol turns on her TV and communicates with a White House official who tries to reassure her that she is safe and that there has been no alien invasion. Apple TV mimicked the scene in a 100-second ad that begins with Cranston’s face above a chyron reading “JOIN US.” A montage of hundreds of friendly faces flashes across her screen, including Paul standing in front of the Eiffel Tower.\n\n\n\tOdenkirk and Patrick Fabian, who played Howard Hamlin on “Better Call Saul,” tell Carol, “We just want to make you happy.” Giancarlo Esposito, who played Gustavo Fring across both of Gilligan’s series, says, “We’re sorry we upset you,” and Jonathan Banks, who played Mike Ehrmantraut, has a blink-and-you’ll-miss-it cameo.\n\n\tCarol Burnett, who had a memorable Season 6 guest role on “Better Call Saul,” says, “Carol, if you need us, we’re here for you.” And even Drew Barrymore, from the set of her talk show, says directly to the camera, “We love you, Carol, and we just want you to be happy.”\n\t\n\n\tSeehorn played Kim Wexler across six seasons of “Better Call Saul,” on which she appeared opposite Odenkirk, Fabian, Esposito and Ehrmantraut. In the final season of the “Breaking Bad” prequel, Gilligan overlapped the timelines of his two series with surprise guest roles for Cranston and Paul, reprising their roles of Walter White and Jesse Pinkman.\n\n\t“Pluribus” debuted on Nov. 7 with two episodes. Despite this new promotional video, the series is not set in the “Breaking Bad” universe. The series has already been renewed for Season 2, and Gilligan told Variety in a wide-ranging interview that he expects the show will go beyond that. \n\n\tWatch the promo below.\n\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Pluribus’ Ad Features Bob Odenkirk, Bryan Cranston and More Stars From ‘Breaking Bad’ Universe Talking to Rhea Seehorn",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/Screen-Shot-2025-11-10-at-10.17.34-AM-e1762789225508.png?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-10T16:06:00.000Z",
      "dateModified": "2025-11-10T16:06:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "AccuWeather Strikes Deal to Supply Information to MS NOW, CNBC",
    "url": "https://variety.com/2025/tv/news/accuweather-ms-now-cnbc-new-deal-1236573967/",
    "image": "https://variety.com/wp-content/uploads/2025/08/MS_NOW_LogoTag08-18.png?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-10T15:05:00.000Z",
    "description": "\n\tMS NOW and CNBC have long told viewers which way the political and financial winds are blowing. Soon, they’ll be able to do the same with the real t",
    "body": "\n\tMS NOW and CNBC have long told viewers which way the political and financial winds are blowing. Soon, they’ll be able to do the same with the real thing.\n\n\tMS NOW and other operations that are part of Versant, the company soon to be spun off from NBCUniversal, have struck a multi-year deal with AccuWeather that will make its weather forecasts and data available for use. AccuWeather will support MS NOW, as well as CNBC, and will turn up in daily on-air segments on both “Morning Joe” and “Squawk Box.”\n\t\n\n\tWe know, at a moment of unprecedented weather events, that AccuWeather will bring top-quality data and reporting to our audiences,” said Scott Matthews, senior vice president of newsgathering at MS NOW, in a statement.\n\n\n\tMS NOW, which will become the name of MSNBC on November 15, has been working to build out its own newsgathering operation. In September, the company unveiled an alliance with Sky News, owned by parent Comcast, for international reportage.\n\n\tTo bolster its new weather reports, MS NOW has hired David Parkinson as senior weather and elections data analyst and Moses Small as a climate reporter. Parkinson joins MS NOW from CBS News, while Small joins from Scripps’ KGTV in San Diego. Parkinson and Small will be working alongside AccuWeather’s expert meteorologists to deliver forecasts across Versant networks.\n\n\tAccuWeather’s forecasts and warnings with proven Superior Accuracy from its expert meteorologists will now reach millions more people with this multi-year deal on many new platforms,” said Steven R. Smith,. CEO of AccuWeather, in a statement.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "AccuWeather Strikes Deal to Supply Information to MS NOW, CNBC",
      "image": [
        "https://variety.com/wp-content/uploads/2025/08/MS_NOW_LogoTag08-18.png?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-10T15:05:00.000Z",
      "dateModified": "2025-11-10T15:05:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Joe Cortese and Julia Ormond Indie Dramedy ‘Here’s Yianni!’ Boarded by Motion Picture Exchange, Launching Sales at AFM (EXCLUSIVE)",
    "url": "https://variety.com/2025/film/global/joe-cortese-heres-yianni-motion-picture-exchange-1236573871/",
    "image": "https://variety.com/wp-content/uploads/2025/11/Yianni.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-10T15:36:57.000Z",
    "description": "\n\tThe Los Angeles-based Motion Picture Exchange has acquired worldwide sales rights on dramedy “Here’s Yianni!” starring Joe Cortese, Julia Ormond and",
    "body": "\n\tThe Los Angeles-based Motion Picture Exchange has acquired worldwide sales rights on dramedy “Here’s Yianni!” starring Joe Cortese, Julia Ormond and Rosanna Arquette. They will be launching sales on the indie title during the American Film Market this week.\n\n\tCortese (“Green Book”) plays the titular character in the feel-good film, which is based on the true story of writer-director Christina Eliopoulos’s father. Cortese plays a Greek diner owner who is living with dementia and imagines himself as a late-night talk show host. \n\t\n\n\tOrmond (“The Curious Case of Benjamin Button”) plays Yianni’s wife Plousia in the film. Arquette (“Pulp Fiction”), Kevin Pollak (“A Few Good Men”) and Colleen Camp (“American Hustle”) also star.\n\n\n\tYianni and Plousia have spent 40 years running their beloved seaside Greek diner, which serves as a warm hub of laughter, stories, food and community. When Yianni begins slipping into a dreamlike world where he imagines himself as the host of a late-night talk show starring those close to him, Plousia “grapples with her new reality that he’s battling dementia and attempts to hide his illness from his best friends played by Pollak and Arquette,” the synopsis says.\n\n\tCortese and Camp serve as producers on “Here’s Yianni!” alongside Nick Vallelonga and Valerie McCaffrey for McCaffrey Productions.\n\n\t“Here’s Yianni!,” which launched from several U.S. festivals including the Arpa Film Fest in L.A. and premiered internationally at Italy’s Torino Film Festival, also features an original song titled “Remember to Remember” penned by multiple Oscar nominee Diane Warren and performed by Grammy-winning band Train.\n\t\n\n\t“‘Here’s Yianni!’ immediately struck us as something rare; a film that balances profound emotional truth with genuine warmth,” said Ryan Bury, president and co-founder of Motion Picture Exchange. “Christina has delivered a beautifully crafted, performance-driven story that feels intimate, yet universal. The film is the perfect blend of heart and artistry we’re proud to represent.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Joe Cortese and Julia Ormond Indie Dramedy ‘Here’s Yianni!’ Boarded by Motion Picture Exchange, Launching Sales at AFM (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/Yianni.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-10T15:36:57.000Z",
      "dateModified": "2025-11-10T15:36:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Oscar Isaac Was ‘Not So Open to Working With Disney’ After Jimmy Kimmel Suspension, Said He’d Return to ‘Star Wars’ if Disney Does ‘Not Succumb to Fascism’",
    "url": "https://variety.com/2025/film/news/oscar-isaac-star-wars-disney-fascism-1236573930/",
    "image": "https://variety.com/wp-content/uploads/2025/11/oscar.png?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-10T15:10:02.000Z",
    "description": "\n\tOscar Isaac told Variety in late August before the world premiere of “Frankenstein” at the Venice Film Festival that he was more than open to return",
    "body": "\n\tOscar Isaac told Variety in late August before the world premiere of “Frankenstein” at the Venice Film Festival that he was more than open to returning as Poe Dameron in a future “Star Wars” movie. Isaac played the dashing X-wing fighter pilot in three “Star Wars” films from 2015 to 2019. But returning to the Disney-owned franchise got a little more complicated for Isaac just a few weeks later, when Disney-owned ABC pulled Jimmy Kimmel off the air over comments he made about the shooting death of Charlie Kirk.\n\t\n\n\tIn a new interview with GQ magazine, Isaac was asked about returning to “Star Wars” and had this new clarification to add: “Yeah. I mean, I’d be open to it, although right now I’m not so open to working with Disney. But if they can kinda figure it out and, you know, not succumb to fascism, that would be great… if that happens, then yeah, I’d be open to having a conversation about a galaxy far away. Or any number of other things.”\n\n\n\tGQ notes the interview with Isaac “took place two days after ABC and Disney suspended production on ‘Jimmy Kimmel Live!’ in response to Kimmel’s comments about the death of Charlie Kirk.” Kimmel returned to ABC four days after GQ’s interview with Isaac.\n\n\tIn his Sept. 15 monologue shortly after Kirk’s suspected killer was arrested, Kimmel quipped: “We hit some new lows over the weekend with the MAGA gang trying to characterize this kid who killed Charlie Kirk as anything other than one of them.” The line got the late-night host suspended. When he returned to air on Sept. 23, an emotional Kimmel said it was never his intention “to make light of the murder of a young man.”\n\t\n\n\tAs for Isaac, the actor has come a long way since initially resisting the idea of returning as Poe Dameron in the “Star Wars” universe. Speaking on a Deadline panel in 2020 a few months after the release of “Star Wars: The Rise of Skywalker,” Isaac noted that “Star Wars” movies were “not really what I set out to do” as an actor.\n\n\t“What I set out to do was to make handmade movies, and to work with people that inspire me,” Isaac said, nothing that he would “probably” not return to “Star Wars” but “who knows. [Maybe] if I need another house or something.”\n\n\tIsaac now admitted to GQ that perhaps he should not have made such an opinion public, explaining: “Yeah. That was a real likable quote. Jesus Christ. Y’know, people ask you things, you say stuff, you don’t really think about it that much. I said a slightly dickish thing.”\n\n\tHead over to GQ’s website to read Isaac’s interview in its entirety.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Oscar Isaac Was ‘Not So Open to Working With Disney’ After Jimmy Kimmel Suspension, Said He’d Return to ‘Star Wars’ if Disney Does ‘Not Succumb to Fascism’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/oscar.png?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-10T15:10:02.000Z",
      "dateModified": "2025-11-10T15:10:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "AFM Attendees Relieved to Return to Los Angeles as They Grapple With Serious Indie Challenges",
    "url": "https://variety.com/2025/film/entertainment-industry/afm-returns-to-los-angeles-indies-struggle-1236561836/",
    "image": "https://variety.com/wp-content/uploads/2025/10/Lice.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-10T16:15:00.000Z",
    "description": "\n\t“Las Vegas is a cinematic city, but it’s not cinema-friendly” is one of the more diplomatic reviews of the American Film Market’s — thankfully brief",
    "body": "\n\t“Las Vegas is a cinematic city, but it’s not cinema-friendly” is one of the more diplomatic reviews of the American Film Market’s — thankfully brief — stint in Sin City last year. As if recalling a bad dream, sales agents and buyers practically shudder when describing having to navigate a maze of slot machines and roulette tables to get to their offices in the Palms Casino Resort. That is assuming they could get in an elevator — lengthy queues meant meetings were often late or cancelled. Screenings, too, were wracked by technical problems. And in the middle of all that — an election.\n\t\n\n\t“It’s such a tightly choreographed ballet that we do with these markets,” says Scott Shooman, head of IFC Entertainment Group. “So the second you have an elevator line that’s longer than a 10 to 15 minute walk, people go bananas.”\n\n\n\tBut AFM — still a vital stop on the industry circuit — is now making a triumphant return to Los Angeles, with a new location at the Fairmont Century Plaza in Century City. Global attendees appear to have an extra spring in their step, extending stays to meet with agencies and studios. Essentially, visitors are looking forward to doing all the important things they used to when they came previously (and couldn’t in Vegas).\n\n\tUltimately, the location misstep isn’t the only issue the AFM has faced in recent years. The hurdle also reflects the fragile health of the independent film industry since the pandemic and double Hollywood strikes. It also reflects the increasing challenge of not just putting together packages, but ensuring they’re the right package for an extremely cautious market. And like any good Hollywood script, there’s optimism.\n\t\n\n\tShooman is hopeful that this year’s AFM will bring out some solid packages on the back of a “very healthy Toronto Film Festival,” where he says he saw a “shift from a buyer’s market to a seller’s market, with a lot of robust MGs [minimum guarantees] paid for a lot of different movies.” He also notes that sales agents have a “slightly more competitive marketplace” with “new domestic distributors in the mix.”\n\n\tThe issue for the indie film business now lies in the need for a “constant recalibration” on “how stuff is made and how much it’s made for,” he says. Case in point: IFC Films just scored big with Ben Leonberg’s directorial debut, “Good Boy,” a micro-budgeted horror pic — told from the perspective of a dog — that’s now grossed over $6 million at the box office. Shooman says it’s on track to become one of the year’s most profitable films.\n\n\n\n\t\n\n\t\t\t\t\tBen Leonberg’s ‘Good Boy’ has grossed over $6 million at the box office. \n\t\n\n\n\n\t“‘Good Boy’ is a story that you root for and it’s how you want the independent business to come together,” Shooman says. “This film is going make us a lot of money, and it’s going to make him [Leonberg] a lot of money, and it’s got the right margins. And when you think about it, ‘Good Boy’ is going to make a lot more money than many movies out there.”\n\n\tThe film wags a tail towards a trend echoed across the board of sales execs — that more risk-averse buyers want packages that have a clearly defined audience. \n\n\t“We feel that distributors want movies where they know exactly who it’s for so they know what to do with it,” says Janina Vilsmaier, senior VP of sales and distribution at Protagonist Pictures, which is launching sales on the Chloe Grace Moretz rom-com “Love Language” in LA. “Is it a genre? Is it an awards movie? Whatever it is, it needs to know what it is so distributors know exactly who to target. And for anything that sits in between, it’s much more difficult.”\n\n\tA recent film many critics suggested did sit in between, unsure of its precise crowd, was A24’s Dwayne Johnson-led wrestling drama “The Smashing Machine,” which came with a hefty $50 million price tag and buzzy noise out of Venice yet flopped at the box office. Then there’s romantic fantasy “A Big Bold Beautiful Journey” — a major $45 million package launched out of Berlin in 2024 thanks to its two leads, Margot Robbie and Colin Farrell — which also crashed out after poor reviews cited its uneven tone. \n\t\n\n\t“It’s a tough time out there,” says Nick Shumaker, head of AC Independent, the sales and finance arm of Anonymous Content. “It’s the age-old question of marrying budget with market value. I think that the conversation is going to be more prominent now than it’s ever been.”\n\n\tWith budgets often weighed down by top-tier talent wages, the woes faced by “Machine” and “Journey” point to another growing realization — that star wattage simply isn’t enough. \n\n\t“People won’t go and see and see a movie anymore because of the star in the movie,” says Mister Smith CEO David Garrett, who suggests that the value in a Hollywood A-lister is now their ability to create awareness, to hit the chat-show circuit and land magazine covers. “But they only have pulling power if the movie is good. If it’s no good, it still won’t work.”\n\n\tEven with an emphasis on the script and filmmaking team, putting together a package has become a labyrinthine puzzle. Garrett describes is as “like alchemy, turning lead into gold.” The alchemy recently worked with shark-meets-serial killer survival horror “Dangerous Animals,” which launched at the Marche du Cannes in 2024, premiered in the festival’s Directors’ Fortnight competition this year and became a box office success for Independent Film Company. Then there’s “Chasing Red,” a YA teen romance that began life as one of the most-read novels on writing platform Wattpad and is now heading into production having almost sold out via pre-sales.\n\n\t“Both of these films were ones that had a very, very clear demographic,” says Garrett, who this year has the animated fantasy “The Turning Door,” whose starring voice cast is led by Alivia Vikander and Jamie Dornan.\n\n\tBut going into markets relying solely on territory pre-sales alone — once the norm at AFM — is today a rarity, with most packages having some financing already in place to mitigate risk — and jitters. There are also egos to consider, notes one sales exec, who claims agencies are now reluctant for projects featuring their bigger names to launch without some money committed to paper beforehand. \n\n\n\n\t\n\n\t\t\t\t\tIndependent Film Company saw success with ‘Dangerous Animals.’\n\t\n\n\n\n\t“It’s embarrassing for them to take a project to market starring one of their clients and then come back saying they haven’t done any pre-sales so the film won’t work,” the exec says. (As a financier claims, it’s “more embarrassing” for the movie to be made, premiere at a festival and still fail to find a domestic distributor).\n\t\n\n\tHence why “the role of equity is super important,” claims Delphine Perrier of Highland Film Group. “So are tax incentives and where you’re going to shoot. You’ve got to be crafty to make it all happen.”\n\n\tKristen Figeroid, who heads up Neon’s international sales and distribution, contends that “the target to pre-sell scripts has become smaller and smaller for buyers in order to make money, and so they have become more discerning at the script stage.” Figeroid will be bringing to Steven Soderberg’s next film, “The Christophers,” which they picked up at Toronto for worldwide rights, to the AFM.\n\n\tWhile the being in the auteur business is more challenging than it used to, Figeroid says the “desire to make these passion projects for directors and actors is still very prevalent, and it’s the thing that studios have shied away from.” As such, “a lot of those projects fall into the independent market because of that,” she says.\n\n\tDylan Leiner, Sony Pictures Classics’ executive VP of acquisitions, production and business affairs, says the reason why buyers are still attracted to auteur-driven movies is because the younger audience cares about name directors.\n\n\tWhile some assume that the younger generation — mostly fed on social media — could care less about auteurs, Leiner says they are in fact pickier with the precious hours at their disposal. “They have grown up in a time where everything happens faster and there’s less patience, and there’s more competition for their time and attention, so they are looking for entertainment that they already know going in will have some bona-fide success level or a guaranteed satisfaction,” he claims. “So the auteur films, just like with certain classic movies, they know them by reputation, and so it gives them more assurance that their time is going to be used satisfactorily.” \n\n\tThe longtime SPC executive says the company’s acquisition strategy underscores the shake-up in moviegoing since the pandemic, skewing slightly younger demos. While the older audience hasn’t fully returned to theaters since COVID, “a younger audience is moving into that space and developing a new culture for theatrical films,” Leiner says.\n\n\tBesides prestige projects that continue to boast some appeal, such market stalwarts as genre and animation are expected to continue to drive dealmaking at the AFM.\n\t\n\n\tShumaker will be showing footage of “Victorian Psycho,” which AC Independent began pre-selling at last year’s AFM and will also be launching “Buzzkill,” Joe Lynch’s horror comedy starring Billy Magnussen and Lulu Wilson.\n\n\tGenre and animation is also heading up Paris-based Charades’ AFM slate following a year illuminated by the phenomenal success — at the box office and Oscars — of “Flow,” which it sold worldwide in early 2024. “It’s a safe bet when it comes to the type of film you want to launch at the AFM,” says CEO Yohann Comte, who does note that a flood of mid-budget CGI family animation has made that area a “little tougher.” In its place — the rise and rise of Japanese animation, as marked by the recent box office smash “Demon Slayer: Infinity Castle,” currently resting on a global haul in excess of $660 million (on a two-digit budget). “Obviously it’s better when it’s IP-driven, but the market is really growing and is super appealing,” Comte notes. Thanks to “Slayer” and Netflix’s “KPop Demon Hunters,” expect the word “Demon” to feature heavily across the promo posters on the walls of the AFM.\n\n\t“We’ve definitely seen an uptick in quality over the last 10 years because there are more high-end animation studios around the world,” says Leiner, noting the company is currently handling “Scarlet” by Mamoru Hosoda and “A Magnificent Life” by Sylvain Chomet. In fact, SPC has been “considering adult animation to be as relevant as any other genre for well over 20 years,” he says, citing a handful of Oscar-nominated SPC releases, such as “Persepolis,” “Waltz With Bashir” and “Red Turtle.”\n\n\tGenre, however, is starting to get over-supplied, with Shooman suggesting the quality has been pushed down. “The marketplace last year was saturated with mediocre genre products because everyone on the independent side and the studios had jumped into that space — if you look at the release calendar there’s an inundation of genre.”\n\n\tBut the continued ability of genre to every now and then make an absolute fortune from a small budget will undoubtedly maintain its status as flavor of the day, especially at the AFM. Action-comedies and horror-comedies are also having a sustained moment, notes Perrier at Highland, which is selling 1980s throwback horror “Lice,” starring Emile Hirsch, Justin Long and Kevin Connolly. “Weapons” — which blended supernatural horror and dark comedy and scared up $268 million — is a film that nearly every sales exec cites.\n\t\n\n\tAgain, it’s about finding the quality packages with that clear, defined target audience, like “Weapons” and, indeed, “Good Boy.” This year’s AFM will, as ever, be all about matching the latest crop of “Good Boys” with their perfect owners — owners who, hopefully, won’t be too busy waiting in line for an elevator or cursing the din from a floor of slot machines.\n\n\tAs Vilsmaier notes on the markets return to L.A.: “Sometimes you need go somewhere else to realize what you’ve got.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "AFM Attendees Relieved to Return to Los Angeles as They Grapple With Serious Indie Challenges",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/Lice.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-10T16:15:00.000Z",
      "dateModified": "2025-11-10T16:15:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Anatomy of a Moment,’ ‘A Better Man’ Triumph at Serielizados – Barcelona Series Festival ",
    "url": "https://variety.com/2025/tv/global/the-anatomy-of-an-instant-a-better-man-1236573971/",
    "image": "https://variety.com/wp-content/uploads/2025/09/Anatomy-of-a-Moment.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-10T14:51:11.000Z",
    "description": "\n\tServing more recognition for two of the most lauded European series of 2025, Spanish-French co-production “The Anatomy of a Moment” and Norway’s “A ",
    "body": "\n\tServing more recognition for two of the most lauded European series of 2025, Spanish-French co-production “The Anatomy of a Moment” and Norway’s “A Better Man” scored the biggest prizes on offer at Barcelona’s Serielizados – Barcelona Series Festival, one of Spain’s most important TV events.\n\n\tNow in its 12th edition as a Festival, Serielizados was boosted this year by an inaugural Mind the Gap project contest and a  high-powered Serielizados PRO conference attracting top international execs from Arte France, Slot Machine, BBC Studios, Beta Film, Sweden’s SVT and Finland’s YLE. Serielizados also served on Friday a high-caliber masterclass by Alan Ball, received by yelps of reverent enthusiasm from a fandom packed audience. Ball drilled down on the writers’ room dynamics of HBO’s “Six Foot Under” and “True Blood” while his inability – and this looks indicative of the way the world’s TV industry has gone – to place any project at a streaming service or broadcaster in the last five years.   \n\t\n\n\tSerielizados other major plaudits went to Canada’s already multi-prized “Empathy” as well as Spain’s “Jakarta,” both with large fan bases at the festival. \n\n\n\tThe Festival’s prizes also represent a major victory for Beta Film, which handles international distribution on both “A Better Man” and “Empathy.” Its major industry plaudit, best series at Mind the Gap went to multicultural tale “Fortune Cookie.”\n\n\tSerielizados has often shown impecable taste in its lineup selection and top prizes, a jury recognising Sweden’s “Pressure Point” last year, for instance, as best international series. This year few will protest its prizes.\n\t\n\n\t‘The Anatomy of a Moment’\n\n\tIt may not be a coincidence that in these conflictive times this year’s top two Serielizados awards for best national and international series went to titles which captured the complexity of human character serving also as a lesson about how figures of supposed vastly different ideological viewpoints for the common good.\n\n\tCreated by Spain’s Alberto Rodríguez (“The Plague,” “Tigres”), written by Rodríguez, Rafael Cobos and Fran Araújo adapting Javier Cercas’ non-fiction novel, “The Anatomy of a Moment,” for instance, chronicles how Spanish prime minister Adolfo Suárez, a former member of dictator Francisco Franco’s Falange, put through democracy in Spain, abetted by Santiago Carillo, head of Spain’s Communist Party and Manuel Gutierrez Mellado, a reformist Francoist general. “The six-part series is directed with flair, including a trenchant voiceover which clarifies the trio’s characters and actions and their consequences, as the three emerge, as Rodriguez told Variety, as figures of a “Shakesperian stature.”\n\n\t‘A Better Man’\n\n\tWinning Serielizados’ best series and the Audience Award, “A Better Man,” created by Thomas Seeberg Torjussen, turns on a misogynist internet troll, Tom, who is outed. Dressing as a woman to avoid further persecution, he finds a sense of self-respect as he treads a rocky road to redemption. Tackling three burning issues of the modern age – internet trolling, the cancel culture and masculinity, “A Better Man” manages to give an explanation for trolls, suggest how they can stop and wraps this is an engrossing, affecting narrative, a large achievement demanding a nuanced performance from Baasmo which takes in two physical transformations and a hard-won spiritual makeover. \n\n\tSerielizados’ plaudits for “A Better Man” add to a Canneseries best series and performance (Anders Baasmo, “Kon-Tiki”) wins in April, for a series which bowed on Norwegian public broadcaster NRK on Nov. 9 and will launch in Germany titled “Toxic Tom” on ZDFneo and ZDFmediathek on Nov. 18. It is produced by Maipo Film (“State of Happiness,” “Miss Julie”) and Artbox for NRK, behind so many good series in recent years, in co-production with ZDFneo. \n\t\n\n\t“Empathy”\n\n\tSerielizados also served sympathy for modern society’s supposed losers. Set in a Quebec psychiatric institute, “Empathy” captures the epic tragic emotional battles with self of the mentally disturbed, often with large humor. It is created by and stars Florence Longpré, now consolidated as one of Canada’s great TV auteurs, already having won the Audience Award at Series Mania after Longpré scored a Canneseries double win with “Audrey’s Back.” At Serielizados, she took home three awards in the International Section, securing  performance (Longpré), screenplay (Longpré), and the Young Jury Award for best series. The Crave and Canal+ original scored over 10 million views on Canal+ in France within a few weeks of its premiere.\n\n\t“Jakarta” \n\n\tSet in a Spain of drab high-rise flats, desolate sports halls and anonymous mid-sized towns, “Jakarta” turns on Joserra (the ever inimitable Javier Camera, star of Almodóvar’s “Talk to Her”) dressed in a dingy track-suit and still stuck in 1992, where he played badminton at the Olympics, though he was knocked out in the first round. Now he thinks he’s discovered a badminton prodigy, Mar, 15, (Carla Quílez, “Motherhood”) who could be his ticket as a trainer to the Jakarta world championships. First of all, however, Mar has triumph in Spain. Creator Diego San José’s follow-up to Series Mania winner  “Celeste,”  “Jakarta,” produced by Buendía Estudios Canarias and Mediapro Canarias, confirms San José as one of Spain’s most engaging mainstream TV auteurs. \n\n\t‘Fortune Cookie,’ ‘Precocity Fair’ Score at Mind the Gap\n\n\tKnown for features “The Erection of Toribio Bardelli” (2023) and “The Cleaner” (2012), Peru’s Oscars entry, Adrián Saba won Mid the Gap’s best series, carrying a $5,500 cash prize. A low-fi sci-fi drama thriller set in Madrid’s Usera Chinatown, “Fortune Cookie” – “a show about family ties, misunderstood children and mothers on the rescue,” Saba told Variety –  is produced by Kubik Films, Newen Studios Spanish banner headed by brothers Fernando, Jorge and Alberto Sánchez-Cabezudo.   \n\n\t“A comedy about two Gen Z misfits dodging eviction, chasing dreams, flipping the finger to adulthood and to the glittering city [Barcelona] that’s leaving them behind,” said producer Anna M. Bofarull, “Precarity Fair,” created by Eli Cruz and Mika Cilindro and produced by KaBoGa, won Mind the Gap’s Konga Music Award. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Anatomy of a Moment,’ ‘A Better Man’ Triumph at Serielizados – Barcelona Series Festival ",
      "image": [
        "https://variety.com/wp-content/uploads/2025/09/Anatomy-of-a-Moment.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-10T14:51:11.000Z",
      "dateModified": "2025-11-10T14:51:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Predator: Badlands’ Director Dan Trachtenberg on That Cliffhanger Ending, Why ‘The Avengers’ Could Influence Future Films and the Surprise ‘Stranger Things’ Cameos",
    "url": "https://variety.com/2025/film/news/predator-badlands-ending-stranger-things-cameos-explained-1236573753/",
    "image": "https://variety.com/wp-content/uploads/2025/11/PB-TP3-still_008.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-10T16:00:00.000Z",
    "description": "\n\tSPOILER ALERT: This story includes major plot details, including the ending, of “Predator: Badlands,” currently playing in theaters.\n\n\tWhen Dan Trac",
    "body": "\n\tSPOILER ALERT: This story includes major plot details, including the ending, of “Predator: Badlands,” currently playing in theaters.\n\n\tWhen Dan Trachtenberg first began conceiving “Predator: Badlands,” the director knew he wanted to do something totally different with the 38-year-old sci-fi franchise. He’d already done it once with 2022’s “Prey,” which is set in the early 1700s and follows a Comanche woman (Amber Midthunder) who must fend off the fearsome alien monster with little more than her wits and her trusty dog. Trachtenberg did it again with the franchise’s first animated feature, 2025’s “Predator: Killer of Killers” (directed with Joshua Wassung), which chronicles how a ninth century Viking warrior, a 17th century Japanese ninja and a 20th century American WWII pilot all manage to defeat one of the titular aliens — aka the Yautja — only to be captured, frozen in suspended animation and then thrown together into a gladiatorial battle overseen by a brutal Yautja warlord.\n\t\n\n\tFor “Badlands” (written, like “Prey,” by Patrick Aison), Trachtenberg decided to invert the entire premise of the series, and cast the Yautja not as his story’s villain, but as its protagonist.\n\n\n\tThe movie opens with Dek (Dimitrius Schuster-Koloamatangi) sparring with his brother, Kwei (Mike Homik), to try to prove himself worthy of their father, Njohrr (Reuben De Jong). Instead, Njohrr orders Kwei to execute Dek, who he regards as a disgraceful runt who must be put down. Instead, Kwei sacrifices himself to free Dek, sending his brother to the deadly planet Genna to achieve something no other Yautja has accomplished: killing the planet’s seemingly invincible apex predator, the Kalisk.\n\t\n\n\tOn Genna, Dek quickly learns that just about every plant and animal on the planet is actively trying to kill him, until he happens upon two unlikely compatriots. The first is Thia (Elle Fanning), a friendly android from the Weyland-Yutani Corporation — part of the cross-pollination between the “Predator” and “Alien” franchises that started with 2004’s “Alien vs. Predator.” Thia, a member of an all-android expedition to Genna, was separated from her legs during a previous encounter with the Kalisk, so she convinces Dek to use her knowledge of the local flora and fauna as a “tool” for his hunt, so he can return her to her missing lower half. En route, they encounter Bud, a disarmingly endearing creature roughly the size of a large dog who takes such a liking to Dek that it spits on him to mark him as part of its clan. But Dek abandons Bud because he believes Yautja are meant to hunt alone.\n\n\tEventually, Dek confronts the Kalisk in a ferocious battle, and succeeds in cutting off its head — only to discover that the Kalisk’s regenerative abilities are so potent that it can literally reconnect its head back onto its body. But when the newly restored Kalisk pounces to kill Dek, it hesitates, stopped short by something it smells on Dek’s body.\n\n\n\n\t\n\n\t\t\t\t\tDimitrius Schuster-Koloamatangi (left) confronts the Kalisk in “Predator: Badlands.”\n\t\t\t\t\t\t\t\t\t20th Century Studios\n\t\n\n\n\n\tAt that moment, both Dek and the Kalisk are frozen by Thia’s android sister, Tessa (also Fanning), who is under orders by Weyland-Yutani’s ruthless AI, Mu/th/ur, to capture the Kalisk by any means necessary. Tessa tortures and taunts Dek, shocking Thia, who decides to help Dek escape, even though it means Tessa will decommission her. \n\n\tStaggered by Thia’s sacrifice, Dek makes another unexpected discovery after he reunites with Bud: It’s a baby Kalisk, and Tessa has abducted its mother. The Kalisk spared him earlier because Bud had marked him — they’re his family now.\n\n\tSo Dek refocuses his mission, teaming up with Bud to rescue Thia and the Kalisk. Which they do, but when the Kalisk subsequently swallows Tessa whole, the android explodes the heretofore unkillable creature from the inside. So Dek stabs the back of Tessa’s head, killing her permanently.\n\n\tDek returns to his home planet, Yautja Prime, and presents his father with Tessa’s skull. His father rebuffs him, but Dek is prepared: They fight, Dek wins, and Bud (who has grown much larger) bites off Njohrr’s head.\n\t\n\n\tThe film ends with Dek standing alongside Thia and Bud, his new clan, as a large, menacing Yautja ship appears on the horizon. The ship, Dek explains to Thia, carries his mother. \n\n\tAs Trachtenberg explains to Variety, the revelation about Bud and the reveal about Dek’s mother were all part of a desire to shake up the “Predator” franchise as much as possible. \n\n\t“We’re making a movie where the monster, predator, ugly motherfucker is the protagonist,” he says. “I did not think that should be the only crazy idea.”\n\n\tThe filmmaker talked about how he and his team designed all the creatures on Genna, why “The Avengers” is on his mind when thinking about where the “Predator” franchise could go next, how he got the creators of “Stranger Things” to make a cameo and what advice he got from James Cameron. (Disclosure: Trachtenberg and I became friends when our kids attended the same preschool.)\n\n\n\n\t\n\n\t\t\t\t\tDan Trachtenberg on the set of “Predator: Badlands.”\n\t\t\t\t\t\t\t\t\tNicola Dove/20th Century Studios\n\t\n\n\n\t\n\t\tHow did you approach designing the creatures on Genna? Were you making the creatures first and then building a story around them, or vice versa?\t\n\n\tIt all really came from the narrative. Creature design is really hard. Having done it a couple of times now, it tends to be like, “We’ve seen this kind of silhouette before. What if we make it curvy here, instead of straight, and what if we put the horns on it?” Because we can do visual effects so well now, all of it looks cool, but none of it becomes iconic or stands out. I didn’t want to fall into any of those traps. For instance, we had the scene set in the razor grass field, and a creature that that would have evolved to feed in those fields would have developed armor on its hide and a beak to cover its mouth to help push away the grass, so that crazy Cthulhu-y snout could graze. We just tried to apply that everywhere, thinking of what the actual ecology or the evolution of the planet would be so the creatures ended up feeling related — not just cool for cool’s sake or scary for scary’s sake.\n\t\n\t\tHow did you go about designing Bud? He’s kind of cute, and “Predator” and “cute” have not been synonymous in the past.\t\n\n\tThe movie is very much about characters that appear to be one way, but then are actually quite different. I thought about Rocket Raccoon or Groot — adorable, but also super badass. We’re making a movie where the monster, predator, ugly motherfucker is the protagonist. I did not think that should be the only crazy idea. \n\t\n\n\tI thought a lot about how “Terminator 2” has one of the most iconic lines in action cinema: “Hasta la vista, baby.” That line comes from a scene where a robot is bonding with the teenage boy, one of the warmest places in the story. I just love the idea of constantly playing with what felt intense and visceral and ferocious and what was emotional. I love that as badass as this movie is, there’s also a warmth and emotionality to it. And then technically, I play a lot of “World of Warcraft” and the Murloc is a creature from “World of Warcraft” that informed her design a little bit. Then it was bouncing back and forth between what a big Bud would be like and what a small Bud would be like to find the right stuff.\n\t\n\t\tDid you worry that you were going to make Bud too cute?\t\n\n\tA little bit, which is why Bud has dope action scenes and does some gnarly things. Even “Prey” was story with a warrior and her dog. That came from the silhouette of Mad Max and his pup. There’s always something really cool to me about the badass with the sidekick. It’s something that makes us care in a very specific way. We care about creatures and animals very differently than we care about humans. I love the idea of him backpacking and something little beside him. I always have in my head one shot in “The Monster Squad” of all the kids with Frankenstein in the silhouette of the setting sun. Sometimes I think in that kind of iconography. So that informed it, too.\n\t\n\t\tWas Bud always going to be the baby Kalisk? \t\n\n\tPretty much. I should say, actually, at one point, we went down a road of, maybe it becomes [the Kalisk]. Almost like a gremlin, the same creature that appears small and tiny then molts its skin and then becomes huge. That just felt a little bit too supernatural to me, but I know everyone’s taste may vary. \n\n\tThe thing that I ended up really loving is that both Dek and Thia are dealing with really upsetting familial situations — abusive parents, so to speak, abusive family — while hunting down what’s supposed to be the most ferocious thing. And actually, that’s the thing in the movie that has the best family relationship. Once again, it all comes from the desire to surprise.\n\t\n\t\tIn the moment with the title card, there’s a giant cliffside in the background with a huge, worm-like thing crawling on it. What was that?\t\n\n\tI always called that the Rock Biter. There’s a great line in “The Neverending Story”: “A rock biter? A rock biter!” It was always an earworm for me. They’re in the background in a few shots. But you’re like, how come we never actually get up in there and interact with it? \n\t\n\t\n\t\tThat’s what I’m getting at, yeah.\t\n\n\t[Laughs] We’re always trying to have some sort of food chain element in the frame somewhere, and always make it feel like it’s deadly. So often when we do these kinds of movies — like Skull Island in the in the first half of a “King Kong” movie or whatever — the place is majestic, but then the creatures are deadly. If we’re saying it’s a death planet, everything should be trying to kill and everything should feel dangerous. So there’s something in the corner that’s like eating something else.\n\t\n\t\tHow did James Cameron come to be listed in the special thanks in the end credits?\t\n\n\tIt came in two forms. He had seen “Prey” and loved it — which, there’s no words for that. We shot “Badlands” in New Zealand, up in Auckland and he was down in Wellington making “Avatar.” He invited me to see him doing some of “Avatar,” and we spent some time on his soundstage and when we were in the edit bay, I pitched him what we were doing with the movie, this brand new process having a guy in a prosthetic suit, and then visual effects are taking over for his face. Then we reconvened at dinner, and when he sat down, he said, “I was thinking about what you’re doing on the way over here. And I gotta tell you, think it’s going to work.” That blew wind in my sails all the way back to Auckland.\n\n\tThen, when we were finishing the movie, the cut was in pretty good shape — not totally finished, but pretty good. I wanted to send it his way to get, if he had the time, whatever feedback he could give. He wrote me a note back that said many things, and one of them was, “I have to tell you, when I first heard about what you’re doing, I did not think it was going to work. But holy crap, you really pulled it off.” And that put wind in my sails. \n\n\tI think he just knows exactly what someone needs to hear when they need to hear it. He’s just a tremendously generous filmmaker.\n\t\n\t\tYou were going to direct on Season 5 of “Stranger Things” before the strikes changed your schedule, but how did you wind up using the show’s creators, Matt and Ross Duffer, as the voice for the computer on Dek’s ship?\t\n\n\tWe were mixing “Badlands” on the very same stages where they were mixing “Stranger Things” at the same time. We had some of the same sound mixers working on both. We needed to do the Yautja ship voice, and I was like, “What if I asked the Duffers to do it? How crazy would that be?”  They had no idea that I was gonna hand him a piece of paper with, like, “‘N, G, I, L, A’ is a word. Good luck!” They had to very quickly learn Yautja. The computer voice is heavily treated and needs to sound affected. So actually, smearing their voices together and then doing other stuff in the computer made the perfect voice.\n\t\n\n\n\n\t\n\n\t\t\t\t\tElle Fanning as Tessa and Thia in “Predator: Badlands.”\n\t\t\t\t\t\t\t\t\t20th Century Studios\n\t\n\n\n\t\n\t\tSince “Badlands” integrates the “Alien” universe, did you figure out when in time your movie is in relation to the other movies in both franchise?\t\n\n\tVery intentionally, it is the furthest into the future in both “Predator” and “Alien.” When we were making it, I wasn’t really sure what was going on with “Alien: Romulus” and I don’t even know how aware I even was of “Alien: Earth.” So I just didn’t want to step on anyone’s toes. I wanted to make sure we were doing our own thing, and selfishly, I’d also done so much “Predator” in different time periods that I was excited for this to be in the future, even past “Alien: Resurrection.”\n\t\n\t\tAt the very end of “Badlands,” a ship containing Dek’s mother appears on the horizon. Are you deliberately setting up how you’d want the franchise to continue, with Dek confronting his mother as we meet female Yautja for the first time?\t\n\n\tWhat I love about that ending is that it works as a final twist on the story that we’ve just been seeing, but also sets up an expectation for something that I think is pretty groovy. If I were to go forward, I don’t think that would be the whole reason, but that would be a very cool element to include.\n\t\n\t\tAnd you’d want to continue with Dek’s story?\t\n\n\tWhat’s so great is we now have all these interesting characters, and who knows what the next one is? I didn’t know the next one was going to be “Killer of Killers” or Dek’s story, and then it ended up we doing both at the same time. There’s many open doors to walk through next, that’s for sure.\n\t\n\t\tSo how far inside those doors have you looked to start planing where you would want to go?\t\n\n\tIt can all go out the door once we start putting pen to paper on stuff, but I’ve looked as far as I could to feel comfortable about what I’m doing. Every movie is a complete thought, not that much unlike the early Marvel stuff before the first “Avengers” movie, where it’s like, those are great movies, and lo and behold, we’re actually setting up that things could come together in a delicious way. But they weren’t like, “See how everything’s interconnected like crazy all of a sudden!” So I’m trying to learn that lesson and make sure that any of these movies that we do are awesome ideas for movies on their own.\n\t\n\t\n\t\t“Killer of Killers” ends by connecting back to “Predator,” “Predator 2” and “Prey,” and since you did just evoke the Avengers, have you thought about integrating all of these different threads together into a larger thing?\t\n\n\tIt’s hard. It’s fun to geek out and think, “Oh my god, wouldn’t it be cool if…,” even on a movie that you’d never expect that to happen in. But it’s only cool if the journey there is equally worth taking.\n\t\n\t\tSo how long do you think you could live inside this franchise?\t\n\n\tI didn’t think I would be living in it this long. What I realized is that because the Yautja has the code that it has, it’s allowed for me to make the kind of movies that I’ve always wanted to. It is not Michael Myers or Jason. It’s not there just to kill victims in its periphery. It’s a creature with a culture and a code, and it’s looking for the most worthy. That resonates in our lives, where we’re constantly thinking about how we measure up to the outside world, to ourselves, in career and love and whatever it is. So I get to keep making movies with this fulcrum that bears all this thematic weight and brings out the emotional storytelling that I love. And also, because it’s this kick-ass creature with unique designs and assets that other franchises don’t have, I get to also make those stories with kick-ass action. It really has allowed for me to make very different kinds of stories, and have them each be worthy of the franchise itself. \n\n\tThis story has been edited and condensed.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Predator: Badlands’ Director Dan Trachtenberg on That Cliffhanger Ending, Why ‘The Avengers’ Could Influence Future Films and the Surprise ‘Stranger Things’ Cameos",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/PB-TP3-still_008.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-10T16:00:00.000Z",
      "dateModified": "2025-11-10T16:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Mark Ruffalo to Lead Vatican Thriller ‘Santo Subito!’ Directed by Bertrand Bonello, Playtime Launching Hot Project at AFM (EXCLUSIVE)",
    "url": "https://variety.com/2025/film/global/mark-ruffalo-bertrand-bonello-vatican-thriller-santo-subito-1236573726/",
    "image": "https://variety.com/wp-content/uploads/2023/06/Mark-Ruffalo-e1686248319864.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-10T14:30:00.000Z",
    "description": "\n\tMark Ruffalo, who landed an Oscar nomination in 2023 for his role in “Poor Things,” will head back to Europe for his next daring project. He’s poise",
    "body": "\n\tMark Ruffalo, who landed an Oscar nomination in 2023 for his role in “Poor Things,” will head back to Europe for his next daring project. He’s poised to play a morally complex investigator in “Santo Subito!,” a Vatican-set thriller based on a true story, which will be directed by French helmer Bertrand Bonello (“The Beast,” “Saint Laurent”).\n\n\tCo-written by Thomas Bidegain, the Oscar-nominated co-screenwriter of “Emilia Perez,” “Santo Subito!” will star Ruffalo as Father Joseph Murolo, an American-born priest summoned by the Vatican to serve as the “devil’s advocate” in the investigation of Pope John Paul II’s life and potential path to sainthood. Set after the pontiff’s death on April 2, 2005, the film follows Murolo as he interviews confidantes and witnesses, navigating a “moral labyrinth” that ultimately puts his own faith to the test.\n\t\n\n\t“Santo Subito!” will begin filming on March 9 on location in Italy and Poland. Playtime, a Vuelta Group company, has boarded international sales on the project and will introduce it to buyers at the American Film Market, alongside Christine D’Souza Gelb of 2AM and Rena Ronson at UTA, who reps the U.S.\n\n\n\tEuropean studio Vuelta is also backing the ambitious project, underscoring the company’s ambition to build a track record in high-profile international movies following Alexander Payne’s “Somewhere Out There,” which was bought by Searchlight Pictures before it even started shooting.\n\n\t“Santo Subito!” is produced by thriving companies across Europe, including France with Mandarin & Compagnie (“Alpha,” “Monsieur Aznavour”); Italy with Indiana Production (“Romeo is Juliet”), another Vuelta-owned label; and Poland with Madants (“High Life”).\n\t\n\n\tTeased as both a thriller and a theological reckoning, the story follows Murolo, who “must make sure that nothing undermines the sanctification of Karol Wojtyla, the first non-Italian pope in 450 years. As he interviews a range of witnesses — from devoted colleagues to secret confidantes — Murolo is drawn ever deeper into a moral labyrinth. This journey of truth will ultimately put his own faith to the test,” the synopsis reads.\n\n\tPlaytime partner Nicolas Brigaud-Robert, who co-produces the film on top of handling international sales, billed “Santo Subito!” as spiritually immersive. “The film offers a genuine behind-the-scenes investigation of the Vatican world, while also taking us into the deeper realm of faith and values. The script itself is a page-turner, and I can’t imagine any audience remaining indifferent to Father Murolo’s journey,” said Brigaud-Robert, who also predicted “Ruffalo will bring the character the depth and intensity it deserves.”\n\n\tMandarin’s veteran producer Eric Altmayer emphasized the story’s global reach: “We are very proud to tell this universal story, which raises intimate questions, carried by a great filmmaker.” Mandarin has so far produced more than 70 films, spanning François Ozon’s “By the Grace of God,” Michel Hazanavicius’s “OSS 117,” Anne Fontaine’s “Chocolat” and Bonello’s “Saint Laurent,” which competed at Cannes.\n\n\tFor Vuelta, the Vatican intrigue carries strategic weight. “We’re blessed to partner with visionary producers Mandarin and Madants on ‘Santo Subito!’, the first project to embody Vuelta’s 360° European studio approach,” said CCO David Atlan-Jackson. “Uniting the exceptional talents of Bertrand Bonello and Thomas Bidegain with the magnetic presence of Mark Ruffalo, there could be no better film to express Vuelta’s ambition and belief in the creative power of cinema to speak to the world.”\n\n\tThe below-the-line roster underscores the project’s prestige pedigree, featuring cinematographer Josée Deshaies (“The Beast,” “Saint Laurent”), art director Dimitri Capuani (“Io Capitano”), costume designer Edoardo Russo (“Diamanti,” “The Hand of God”) and sound designer Nicolas Cantin (“Father Mother Sister Brother”). Alessandro Mascheroni (“Five Seconds,” “Human Capital”) serves as executive producer.\n\t\n\n\tBonello, one of France’s most prominent auteurs, has presented three films in official competition at Cannes — “Tiresia” (2003), “House of Tolerance” (2011) and “Saint Laurent” (2014). In 2023, he premiered “The Beast,” a dystopian romance starring Léa Seydoux and George MacKay, at Venice and Toronto.\n\n\tRuffalo is represented by Lighthouse Management and Media, UTA, Relevant and Keith Klevan.\n\n\tPlaytime will launch sales on “Santo Subito!” at the American Film Market, where its slate also includes Nanni Moretti’s “It Will Happen Tonight,” Emmanuel Courcol’s “Greenland” and Rafa Cobos’s “Golpe,” as well as the family adventure “Indiana and the Otters’ Legend” from the producers of “Mia and the White Lion.” \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Mark Ruffalo to Lead Vatican Thriller ‘Santo Subito!’ Directed by Bertrand Bonello, Playtime Launching Hot Project at AFM (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2023/06/Mark-Ruffalo-e1686248319864.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-10T14:30:00.000Z",
      "dateModified": "2025-11-10T14:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Donald Trump Threatens to Sue BBC for $1 Billion Over Editing Controversy",
    "url": "https://variety.com/2025/digital/global/donald-trump-threatens-legal-action-bbc-speech-editing-1236573931/",
    "image": "https://variety.com/wp-content/uploads/2025/11/trump.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-10T14:02:15.000Z",
    "description": "\n\tU.S. President Donald Trump has threatened to sue the BBC for $1 billion over documentary program “Panorama’s” editing of the speech he made ahead o",
    "body": "\n\tU.S. President Donald Trump has threatened to sue the BBC for $1 billion over documentary program “Panorama’s” editing of the speech he made ahead of the Capitol riots on Jan. 6, 2021.\n\n\tThe BBC confirmed it has received a letter from Trump’s lawyers and will “respond in due course.” The New York Times obtained the letter, which it reported demands a full retraction of the documentary, an apology and payment to “appropriately compensate President Trump for the harm caused.”\n\t\n\n\tIf these conditions are not met by Friday, Nov. 14 at 10 p.m. U.K. time, the letter said: “President Trump will be left with no alternative but to enforce his legal and equitable rights, all of which are expressly reserved and are not waived, including by filing legal action for no less than $1,000,000,000 (One Billion Dollars) in damages.”\n\n\n\tControversy erupted over the weekend after a leaked memo from former BBC Editorial Guidelines and Standards committee adviser Michael Prescott was published by The Telegraph suggesting that “Panorama” edited a Trump speech to make it sound like he encouraged the Jan. 6 riots. It resulted in the shocking resignations of both BBC director general Tim Davie and CEO of news Deborah Turness on Sunday night.\n\n\tOn Monday, BBC Chair Samir Shah apologized for the edit in a letter to the U.K. culture, media and sport committee and called it an “error of judgement.” Speaking with the BBC’s Katie Razzall following the letter’s publication, Shah said that he has been in contact with Trump’s team and is considering personally apologizing to the president. Asked if Trump will sue the BBC, Shah said: “I do not know that yet, but he’s a litigious fellow so we should be prepared for all outcomes.”\n\t\n\n\tPrescott’s memo said “Panorama” edited Trump’s speech to be: “We’re gonna walk down to the Capitol and I’ll be with you and we fight. We fight like hell and if you don’t fight like hell, you’re not gonna have a country anymore.” Prescott wrote that Trump said the part beginning with “and we fight” 54 minutes after “we’re gonna walk down to the Capitol and I’ll be with you.”\n\n\tTrump celebrated the news of Davie and Turness’ resignations on Sunday night, calling the organization “corrupt ‘journalists.’”\n\n\t“These are very dishonest people who tried to step on the scales of a Presidential Election,” Trump wrote. “On top of everything else, they are from a Foreign Country, one that many consider our Number One Ally. What a terrible thing for Democracy!”\n\n\tIn September, Trump sued the New York Times for $15 billion claiming defamation and libel, which was tossed out days later by a judge. Last month, he refiled the suit.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Donald Trump Threatens to Sue BBC for $1 Billion Over Editing Controversy",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/trump.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-10T14:02:15.000Z",
      "dateModified": "2025-11-10T14:02:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "CNN’s News, Brought to You by T-Mobile in Aggressive Ad Deal",
    "url": "https://variety.com/2025/tv/news/cnn-t-mobile-advertising-deal-sponsors-newsgathering-1236573196/",
    "image": "https://variety.com/wp-content/uploads/2023/07/631550_3346_R.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-10T14:00:00.000Z",
    "description": "\n\tTV’s news shows are often brought to you by a sponsor. Now, in the case of CNN, so too is its actual newsgathering.\n\n\tAs part of a bold ad deal, T-M",
    "body": "\n\tTV’s news shows are often brought to you by a sponsor. Now, in the case of CNN, so too is its actual newsgathering.\n\n\tAs part of a bold ad deal, T-Mobile’s logo will turn up often on CNN’s digital screens when CNN reporters and correspondents deliver live reportage from outside the studio, a sign that the telecom giant’s nascent “SuperMobile” service, tailored for business users who want quick, reliable connections and privacy safeguards, has helped establish the connection between journalists and audience. T-Mobile struck a similar deal in October with Fox Corp’s Fox Weather streaming service.\n\t\n\n\tSuch stuff is tricky in the news environment, and CNN will have to navigate the process carefully. What if T-Mobile becomes the center of a national story? Or what if the T-Mobile logo surfaces on screen while a correspondent is in the midst of covering a riot or outbreak of war? Others have tread upon this ground, including MSNBC’s “Morning Joe,” which for years enjoyed a sponsorship from a certain coffee giant that included on-air promotion saying the show was “brewed by Starbucks.” The network raised eyebrows in 2011 when co-anchor Mika Brzezinski conducted a seven-minute-long interview with Howard Schultz, then Starbucks’ CEO, without any mention of the advertising support.\n\n\n\tCNN and T-Mobile seem aware of the challenges. “Our anchors and reporters and journalists can’t have any implicit or explicit endorsement of any product,” notes Guy Griggs, recently named senior vice president of advertising sales and partnerships at the Warner Bros. Discovery news operation. And there are times when having T-Mobile’s logo on screen would not work, acknowledges Mo Katibeh, chief marketing officer of T-Mobile’s business services. “We will be sensitive in our approach,” he notes. When viewers “are there for the news” at critical moments, he adds, “we wouldn’t manifest the logo” on screen.\n\t\n\n\tStill, the alliance may offer new ideas for the nation’s biggest backers of TV news, who have been hard-pressed to win ad dollars for such programing in recent years.\n\n\t“We know business leaders don’t want an ad. They want proof that technology works and it’s there for them at the moments that matter,” says Katibeh, during a recent interview.  “They are going to see uninterrupted live CNN coverage during the biggest news moments.” The on-screen demonstration makes clear how T-Mobile’s efforts help “trusted professionals like CNN’s journalists deliver breaking news live, securely, and from virtually anywhere.”\n\n\tMarketers continue to be wary of putting commercials against content that might feature harsh images or tough conversations. More of the big TV-news operations feature hot-talk programming in primetime that is designed to appeal to partisan audiences, or just those looking for tension or a verbal donnybrook. And yet, many advertisers need to appeal to the broadest audience possible, and, as such, have moved money out of news as the world has grappled with international battles, climate change, a global pandemic and political extremism.\n\n\tIndeed, all three of the nation’s cable-news outlets are projected to have a shortfall in advertising revenue for 2025.  CNN’s ad sales are seen falling 10% in 2025 to $576.2 million, according to data from Kagan, a market-research firm that is part of S&P Global Intelligence. MSNBC’s is estimated to fall by 11% to $653.9 million. Meanwhile Fox News Channel’s advertising is forecast to dip by about 3% to nearly $1.4 billion, though the network’s parent company recently announced it saw record ad revenue for the outlet in its most recent fiscal quarter.\n\n\tT-Mobile “is a marketer that needs to hit high-value audiences, and partnerships that are authentic enable them to do that and showcase like the power of their technology solutions,” says Griggs. Marketers remain concerned about issues tied to “brand safety,” he notes, but this new alliance “provides a very authentic path toward reaching an audience.”\n\n\tT-Mobile comes to CNN’s screens just as the news company is working to widen its audience. CNN last month launched a new “All Access” streaming service that gives subscribers access to more reporting and video, including deep-dive, long-form journalism that only occasionally finds a place on the company’s linear cable network.  CNN is using the fact that it has one of the largest cadre of journalists covering news around the world as a means of luring potential customers.\n\t\n\n\tIf the new ad pact works, audiences would come to view T-Mobile as helping to support the CNN reports that keep them informed, says Griggs. “We are going from this linear cable news network that has defined real-time journalism on TV for the last 45 years, and we’re now going to be this global digital-first, streaming-first news brand of the 21st century, really reaching audiences across every screen device and platform, and T-Mobile’s going to be there, helping us do that” he says.  T-Mobile will also back various facets of “All Access,” he says, including a new live, vertical video feed, “enabling and empowering our journalists to go wherever they are across the country, to get the news that our audiences need.”\n\n\tIn decades past, CNN was known in advertising circles for being very cautious about weaving commercials into its news coverage. But the network, like its rivals, has faced increasing demand from advertisers for closer ties to the news programs themselves, as well as content that looks a lot like programming. Indeed, CNN last year sold commercials in its telecast of a presidential debate between President Joe Biden and President Donald Trump, bucking years of keeping such an event ad-free.\n\n\tNearly all the mainstream news outlets have had to grapple with similar choices. NBC News in past years created videos for Xerox that talked about stories and subjects of interest to the audiences that watch different news and sports networks owned by parent NBCUniversal. On CNBC, promotional vignettes tackled financial news, while MSNBC’s examined progressive topics. NBCUniversal once had a pact with retirement and investment company ING that called for the creation of personal-finance segments on CNBC’s “Mad Money with Jim Cramer” as well as NBC’s “Today.” Disney has in recent months sought sponsors who might put logos in a ticker at the bottom of the screen of a new short-form news program, “What You Need to Know,” which streams on Disney+.\n\n\tSome modern advertising deals probably would not have been embraced decades ago. Both “Today” and “Good Morning America” have allowed advertisers like Walmart or Starz to sponsor individual story segments tied to topics that help burnish the advertisers. Fox News Channel in 2019 allowed the anchors of “Fox & Friends” to appear in promotional vignettes touting the Dodge Durango. And, in a pact similar to the one CNN has entered, CNBC struck a deal with Cisco in 2010 that showed how the technology company’s TelePresence networking equipment helped the news outlet bring authoritative sources to the screen.\n\t\n\n\tCNN has good reason to court the telecom marketer. In 2017, CNN often won more than 40% or 50% of telecom ad dollars spent on cable news, according to Guideline, a tracker of advertiser spending on media. But in the third quarter of 2025, CNN’s command of share of that category had fallen to 10%.\n\n\t“In the late 2010s, people were still frequently buying phones with each new launch. Telco companies had an incentive to spend across the board to get people to come out and buy new phones,” says Sean Wright, Guideline’s chief insights and analytics officer. “As new features on phones have slowed and financing a new phone has become increasingly expensive, people are now buying new phones every 2.5 years,” and telco advertisers are increasingly focused on sales to corporations. As a result, he says, more of their ad spending has moved to venues including CNBC, Bloomberg and Fox Business.\n\n\tT-Mobile has spent months running commercials showing how it’s trying to help consumers break through communications obstacles. It’s “Super Mobile” service is just the latest in a series of ads that demonstrate “how we smash customer pain points,” says Katibeh. During this year’s Super Bowl, T-Mobile backed away from its usual coterie of commercials featuring celebrities in favor of a spot touting its ability to help customers vanquish so-called ‘dead zones” by connecting them to service.\n\n\tCNN could be open to similar connections with Madison Avenue, says Griggs. “If it makes sense to provide a better experience to our audience, we are here for it and we definitely want to kick the tires on what’s out there,” he says.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "CNN’s News, Brought to You by T-Mobile in Aggressive Ad Deal",
      "image": [
        "https://variety.com/wp-content/uploads/2023/07/631550_3346_R.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-10T14:00:00.000Z",
      "dateModified": "2025-11-10T14:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Stun Gun Kid in 'The Hangover' 'Memba Him?!",
    "url": "https://www.tmz.com/2025/11/10/stun-gun-kid-the-hangover-memba-him/",
    "image": "https://imagez.tmz.com/image/ed/16by9/2025/11/05/edd4f41326524085b409e519955b94f8_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-10T08:01:08.000Z",
    "description": "\n    \n                    \n                          Stun Gun Kid In\n                          'The Hangover'\n                          'Memba Him?!\n ",
    "body": "\n    \n                    \n                          Stun Gun Kid In\n                          'The Hangover'\n                          'Memba Him?!\n                      \n                  \n                        Published November 10, 2025 12:01 AM PST\n                                                                      |\n                Updated November 10, 2025 6:43 AM PST\n                                    \n      \n    \n          Actor Nicolas Furu was only 10 years old when he landed the role as 'stun gun boy' in the 2009 comedy film \"The Hangover.\"\n      \n    \n          Furu joined many Hollywood legends on set like Bradley Cooper, Zach Galifianakis, Ed Helms, and Ken Jeong.\n      \n    \n          Nicholas also acted in \"Modern Family\" and \"100 Things to Do Before High School.\"\n      \n    \n          Guess what he looks like now in his late 20s!\n      \n      \n      \n          \n            \n              \n                \n                Share on Facebook\n              \n            \n            \n              \n                \n                Share on X\n              \n            \n                          \n                \n                  \n                \n              \n                      \n        \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Bradley Cooper\n              \n                          \n                Movies\n              \n                          \n                Memba Them\n              \n                          \n                Photo Galleries\n              \n                      \n        \n          \n  ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Stun Gun Kid in 'The Hangover' 'Memba Him?!",
      "image": [
        "https://imagez.tmz.com/image/ed/16by9/2025/11/05/edd4f41326524085b409e519955b94f8_xl.jpg"
      ],
      "datePublished": "2025-11-10T08:01:08.000Z",
      "dateModified": "2025-11-10T08:01:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tony Romo Says Patriots 'DTF' During Game",
    "url": "https://www.tmz.com/2025/11/10/tony-romo-patriots-dtf/",
    "image": "https://imagez.tmz.com/image/31/16by9/2025/11/10/31801ee7ff0d4b2daa1531fa12afba2c_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-10T14:59:33.000Z",
    "description": "\n    \n                    \n                          Tony Romo\n                          Patriots Are 'DTF!!!'\n                      \n                ",
    "body": "\n    \n                    \n                          Tony Romo\n                          Patriots Are 'DTF!!!'\n                      \n                  \n                        Published November 10, 2025 6:59 AM PST\n                                                                      |\n                Updated November 10, 2025 7:54 AM PST\n                                    \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Tony Romo had quite the head-scratching analysis of the Patriots defense on Sunday ... saying they're a bunch of dudes who are all \"DTF.\"\n      \n    \n          \"Details, toughness, and they finish.\"\n      \n    \n      \n      According to Tony Romo, the Patriots are \"DTF.\"DETAILS. TOUGHNESS. And they FINISH.Why, what else do you think he meant? pic.twitter.com/aBPC0lOTh5— Awful Announcing (@awfulannouncing) November 9, 2025\n              @awfulannouncing\n          \n  \n    \n          Yeah ... that's not what \"DTF\" usually stands for.\n      \n\n          The intended high praise came in the second quarter of New England's win over the Tampa Bay Buccaneers .... when the Pats stuffed running back Rachaad White for a loss on first down.\n      \n    \n          \"Fundamentally sound ... this team is DTF, Jim,\" Romo told his partner, Jim Nantz. \"The Patriots -- details, toughness and they finish.\"\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Nantz played it off ... cracking a joke that the acronym might be aligned with something Pats head coach Mike Vrabel would tell his players behind closed doors.\n      \n    \n          Of course, \"DTF\" is short for something entirely different -- sex -- so when Romo uttered the words, social media had some fun with it.\n      \n    \n          The Pats ended up getting the win, 28-23 ... so maybe Romo wasn't too far off with his take??\n      \n    \n          The victory now puts New England at 8-2 on the season ... and they've won seven in a row to sit pretty at the top of the AFC East.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Tony Romo\n              \n                          \n                New England Patriots\n              \n                          \n                TMZ Sports\n              \n                          \n                Fairly Legal\n              \n                          \n                NFL\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tony Romo Says Patriots 'DTF' During Game",
      "image": [
        "https://imagez.tmz.com/image/31/16by9/2025/11/10/31801ee7ff0d4b2daa1531fa12afba2c_xl.jpg"
      ],
      "datePublished": "2025-11-10T14:59:33.000Z",
      "dateModified": "2025-11-10T14:59:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Beyoncé & Jay-Z Avoided Paparazzi, Attended Kris Jenner's Birthday Party",
    "url": "https://www.tmz.com/2025/11/09/beyonce-jay-z-avoided-paparazzi-attended-kris-jenner-birthday-party/",
    "image": "https://imagez.tmz.com/image/92/16by9/2025/11/10/923d31aea3fb47ef8b9f6e853a2b2d82_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-10T01:50:15.000Z",
    "description": "\n    \n                    \n                          Beyoncé & Jay-Z\n                          Spies Like Us Never Get Caught ...\n                    ",
    "body": "\n    \n                    \n                          Beyoncé & Jay-Z\n                          Spies Like Us Never Get Caught ...\n                          Avoided Paps Outside Kris Jenner's 70th Birthday!!!\n                      \n                  \n                        Published November 9, 2025 5:50 PM PST\n                                                                      |\n                Updated November 10, 2025 4:54 AM PST\n                                    \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Beyoncé and Jay-Z did their best James Bond impression in order to sneak into Kris Jenner's 007-themed birthday ... 'cause photogs didn't get a single pic of them!\n      \n    \n          Multiple sources with knowledge tell TMZ ... the pop star and her rapper husband pulled up to Jeff Bezos and Lauren Sanchez's Beverly Hills mansion to celebrate their friend.\n      \n    \n          However, our sources say paparazzi couldn't get a money shot of the happy couple because they got prime parking ... pulling onto the estate and hopping out of the ride away from prying eyes.\n      \n\n          We didn't know Beyoncé attended last night, but we did know a different Knowles was in the house ... 'cause Tina didn't mind photographers snapping a few shots of her red outfit.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Bey and Jay are usually the biggest stars to attend any bash ... though they were among a very star-studded celebration last night -- with Oprah, Prince Harry, Meghan Markle, Hailey Bieber, Mariah Carey, Snoop Dogg and more in attendance.\n      \n    \n          The party got so wild cops even showed up to the place ... telling the bash to keep it down after neighbors reported several loud disturbances.\n      \n    \n          Beyoncé and Jay-Z might want to apply for their license to kill ... 'cause these two spies certainly pulled the wool over our eyes!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Jay-z\n              \n                          \n                Beyonce Knowles\n              \n                          \n                Reality TV\n              \n                          \n                Movies\n              \n                          \n                Birthdays\n              \n                          \n                Exclusive\n              \n                          \n                Music\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Beyoncé & Jay-Z Avoided Paparazzi, Attended Kris Jenner's Birthday Party",
      "image": [
        "https://imagez.tmz.com/image/92/16by9/2025/11/10/923d31aea3fb47ef8b9f6e853a2b2d82_xl.jpg"
      ],
      "datePublished": "2025-11-10T01:50:15.000Z",
      "dateModified": "2025-11-10T01:50:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Passenger Who Died on Carnival Cruise Identified as 18-Year-Old From Florida",
    "url": "https://www.tmz.com/2025/11/10/anna-kepner-carnival-cruise-teen-dead/",
    "image": "https://imagez.tmz.com/image/a7/16by9/2025/11/10/a7c8f229e2b9488aa3a4f209097f4c94_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-10T15:28:44.000Z",
    "description": "\n    \n                    \n                          Carnival Cruise Death\n                          Family Identifies 18-Year-Old Floridian\n         ",
    "body": "\n    \n                    \n                          Carnival Cruise Death\n                          Family Identifies 18-Year-Old Floridian\n                      \n                  \n                        Published November 10, 2025 7:28 AM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          The passenger reported dead aboard a Carnival Cruise Line ship Saturday has reportedly been identified by her family as 18-year-old Anna Kepner, from Titusville, Florida.\n      \n    \n          The family told ABC News they will remember Anna as a \"happy, bubbly, straight-A student with a bright future ahead.\"\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          The FBI is investigating the mysterious death of the young woman, who was set to graduate from high school in May, according to ABC. The death was reported as the ship was returning to Miami, Florida from a trip through the Caribbean.\n      \n\n          Details surrounding the cause of death have not been released.\n      \n    \n          Anna clearly enjoyed taking trips with her family, evidenced by TikToks and photos she's posted from previous cruises.\n      \n    \n          One was captioned, \"I miss this day,\" while she danced with a relative.\n      \n    \n      \n        \n                    \n                  \n      \n                    TikTok/@fl.anna18\n          \n    \n          Family members reportedly told ABC News Anna was a gymnast from the age of 2, which led to her joining her high school's varsity cheerleading team. They added she was also deeply involved with her grandparents' 55+ community, with her grandmother affectionately calling her \"Anna Banana.\" She intended to join the military, the family said.\n      \n    \n          She was 18.\n      \n    \n          RIP\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                RIP\n              \n                          \n                Fairly Legal\n              \n                          \n                News\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Passenger Who Died on Carnival Cruise Identified as 18-Year-Old From Florida",
      "image": [
        "https://imagez.tmz.com/image/a7/16by9/2025/11/10/a7c8f229e2b9488aa3a4f209097f4c94_xl.jpg"
      ],
      "datePublished": "2025-11-10T15:28:44.000Z",
      "dateModified": "2025-11-10T15:28:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kim Kardashian Poses in Sexy Bikini Pics After Failing Bar Exam",
    "url": "https://www.tmz.com/2025/11/10/kim-kardashian-sexy-bikini-pics-after-failing-bar-exam/",
    "image": "https://imagez.tmz.com/image/c1/16by9/2025/11/10/c17100f1a1db42bebb4e9548b0d89408_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-10T12:53:03.000Z",
    "description": "\n    \n                    \n                          Kim Kardashian\n                          Passes The Bikini Test ...\n                          Aft",
    "body": "\n    \n                    \n                          Kim Kardashian\n                          Passes The Bikini Test ...\n                          After Failing The Bar Exam\n                      \n                  \n                        Published November 10, 2025 4:53 AM PST\n                                                                      |\n                Updated November 10, 2025 6:04 AM PST\n                                    \n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Don't think for a second Kim Kardashian is stressin' over failing the bar exam ... because judging from her Instagram, she's living her best life.\n      \n    \n        Waiting for your permission to load the Instagram Media.\n      \n    \n          The reality star posted a series of bikini shots Sunday ... coolin' out at a beautiful, sun-drenched resort in a black two-piece -- shortly after celebrating her sister Kendall's 30th birthday. In one of the pics, you can see balloons wishing Kendall a happy birthday.\n      \n    \n      \n        \n              \n    \n    \n          Kim uploaded the series of sexy pics following another birthday bash -- her mom Kris' 70th -- held Saturday night at Jeff Bezos' L.A. compound.\n      \n\n          Kris' party was loaded with some of the biggest names in Hollywood ... including Oprah Winfrey, Jay-Z, Beyoncé, Prince Harry, Meghan Markle, Hailey Bieber, and Mariah Carey.\n      \n    \n          As for the bar exam ... Kim revealed she failed it Saturday before heading over to Kris' big night.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          She joked she's not a lawyer yet but plays one on TV, referring to her divorce-attorney role in the legal drama, \"All's Fair.\"\n      \n    \n          Despite the setback, Kim says she's determined more than ever to become a real attorney ... vowing she will eventually pass the bar.\n      \n      \n              \n          \n                          \n                Kim Kardashian\n              \n                          \n                Kendall Jenner\n              \n                          \n                Jeff Bezos\n              \n                          \n                Kris Jenner\n              \n                          \n                Social Media\n              \n                          \n                Summer/Beach\n              \n                          \n                Hotties & Bodies\n              \n                          \n                Fairly Legal\n              \n                          \n                The Kardashians\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kim Kardashian Poses in Sexy Bikini Pics After Failing Bar Exam",
      "image": [
        "https://imagez.tmz.com/image/c1/16by9/2025/11/10/c17100f1a1db42bebb4e9548b0d89408_xl.jpg"
      ],
      "datePublished": "2025-11-10T12:53:03.000Z",
      "dateModified": "2025-11-10T12:53:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]