[
  {
    "title": "‘KPop Demon Hunters’ Soundtrack Is Now Available on Yoto, the Kids Screen-Free Audio Platform",
    "url": "https://variety.com/2025/shopping/news/kpop-demon-hunters-soundtack-yoto-soundtrack-card-buy-online-1236560799/",
    "image": "https://variety.com/wp-content/uploads/2025/10/KPopDemonhunterLifestyle2-1.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-24T19:52:57.000Z",
    "description": "\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.\n\n\t“KPop Dem",
    "body": "\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.\n\n\t“KPop Demon Hunters” is coming to Yoto. The chart-topping soundtrack from the original Netflix movie is now available on the kids audio platform.\n\n\tThe card will give fans exciting, early access to music from the film, coming out in tandem with the  official vinyl release last week. Featuring the chart-topping songs “Golden” and “Soda Pop,” it allows children to enjoy music from the film on Yoto’s safe, screen-free audio player.\n\n\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\n\tTo mark the launch, Yoto will also spotlight the voices behind the film’s central trio — EJAE (Rumi), Rei Ami (Zoey), and Audrey Nuna (Mira) — on Yoto Daily, the brand’s free podcast for kids. Fans will hear the artists open up about preparing for their biggest musical moments, share advice for aspiring young performers, reveal their favorite tracks from the soundtrack and discuss the global rise of K-pop.\n\n\t“The KPop Demon Hunters soundtrack is a cultural phenomenon that has resonated with families around the world, and we are incredibly proud to bring its platinum-certified power and incredible cast talent to the Yoto platform,” Dom Hodge, Head of Music and Sound at Yoto, said in a statement. “After seeing the runaway success of the movie when it was released in the summer we just knew we had to bring it to our Yoto families in an audio format, so the team worked incredibly hard to make this happen as quickly as possible. We hope this release will inspire many epic kitchen sing-alongs and dress-up dance parties!”\n\n\tThis collaboration builds on Yoto’s mission to partner with leading entertainment and music creators to deliver safe, independent, and enriching screen-free storytelling and soundtracks to kids globally.\n\n\n\tThe KPop Demon Hunters Yoto card launched on Oct. 15, and is available at yotoplay.com priced at $14.99 each with a run time of 37min. The card is compatible with both the Yoto Player (3rd Generation) and the Yoto Mini (2024 Edition).\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘KPop Demon Hunters’ Soundtrack Is Now Available on Yoto, the Kids Screen-Free Audio Platform",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/KPopDemonhunterLifestyle2-1.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-24T19:52:57.000Z",
      "dateModified": "2025-10-24T19:52:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ms. Rachel Launches Kids Play Couch With Family-Friendly Furniture Brand Nugget",
    "url": "https://variety.com/2025/shopping/news/ms-rachel-kids-play-couch-nugget-buy-online-1236560750/",
    "image": "https://variety.com/wp-content/uploads/2025/10/0925-photography-msrachelPRimages-10.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-24T19:45:20.000Z",
    "description": "\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.\n\n\tNugget’s ",
    "body": "\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.\n\n\tNugget’s foam play couch has long been a favorite for parents and kids alike. With a mission to grow imaginations across the U.S, the brand pioneered family-friendly play furniture when it first launched in 2014.\n\n\tNow, they’re tapping into the cultural zeitgeist with a strategic partnership with the ultra-popular Youtuber Ms. Rachel, who this week has launched her own version of the brand’s headlining Original Play Couch. The Ms. Rachel Nugget is now available to shop online for $289.\n\n\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\n\tWith designs inspired by Ms. Rachel’s most popular songs, including “Hop Little Bunnies,” “If You Should Meet an Elephant” and “Wheels On The Bus,” the new launch highlights her song-driven education style, all while encouraging creativity, movement and connection.\n\n\t“Play is one of the most powerful ways children learn. That’s why I’m excited to collaborate with Nugget, a company that shares our commitment to sparking imagination and connection at home,” Ms. Rachel, born Rachel Griffin-Accurso, said in a statement. “The Ms. Rachel Nugget was created to bring families together, and I can’t wait to see the joy it inspires in little ones everywhere.”\n\n\tDavid Baron, CEO and co-founder of Nugget shares, “Our collaboration with Ms. Rachel embodies Nugget’s fundamental mission to grow imaginations through thoughtfully designed play furniture. The Ms. Rachel Nugget is a perfect testament to that commitment.”\n\n\tOver the past few years, Ms. Rachel has transformed from a YouTube educator into a full-fledged children’s media brand with a suite of high-profile partnerships — from a global master toy deal with Spin Master to music collaborations with “Sesame Street” and John Legend. Most recently, Netflix signed Ms. Rachel to a streaming content deal.\n\n\n\tThe Ms. Rachel Nugget is now available to pre-order and will ship on Nov. 14, exclusively at NuggetComfort.com. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ms. Rachel Launches Kids Play Couch With Family-Friendly Furniture Brand Nugget",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/0925-photography-msrachelPRimages-10.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-24T19:45:20.000Z",
      "dateModified": "2025-10-24T19:45:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Casting Director Francine Maisler on Discovering ‘Sinners’ Breakout Miles Caton and Why Matthew Pellicano Made the Perfect Young ‘Springsteen’",
    "url": "https://variety.com/2025/film/news/casting-director-francine-maisler-sinners-springsteen-stars-1236560001/",
    "image": "https://variety.com/wp-content/uploads/2025/04/MCDSINN_WB036-1.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-24T19:32:50.000Z",
    "description": "\n\tWhen Aaron Sorkin, Steven Soderbergh, Scott Cooper and Denis Villeneuve are looking to cast their films, they turn to casting director Francine Mais",
    "body": "\n\tWhen Aaron Sorkin, Steven Soderbergh, Scott Cooper and Denis Villeneuve are looking to cast their films, they turn to casting director Francine Maisler. This year alone, Maisler has worked on “Sinners,” “The Lost Bus,” “Springsteen: Deliver Me from Nowhere” and the upcoming “Ella McCay.”\n\n\tMaisler reveals she’s working around the clock on multiple projects. That includes Tom Ford’s much anticipated third movie. \n\n\n\t“He’s in London and he’s my first call at 6:30 in the morning,” she tells Variety‘s Awards Circuit Podcast. “We work around the clock because it’s him. We collaborate on every single thing.”\n\t\n\n\tVariety reached out to Ford’s rep, Simon Halls, who says, “The project is still in early development stages.”\n\n\tMaisler teases, “It’s going to be this epic, incredible movie that you’re going to love.” Maisler is also hard at work on Sorkin’s latest. “My life is pretty full,” she says.\n\n\tThis year, now that the Academy is finally recognizing casting directors for their work — with the launch of a casting category — there’s a world where Maisler could snag more than one nomination.\n\n\t“I personally am not somebody who seeks likes the attention, it’s not why I do it behind the scenes,” Maisler says.\n\n\tThe Television Academy, BAFTA and the Casting Society have recognized the craft for years, which means the Oscars are finally playing catchup. “I do think that being recognized by the Academy with this award for casting directors, with this award for casting directors, is long overdue,” Maisler says. “The contribution casting directors make is an integral part of a film.”\n\t\n\n\tMaisler spoke to the Awards Circuit Podcast about her prolific career; listen below!\n\n\t“Sinners” reunites Maisler with Ryan Coogler, following their collaboration on “Creed.” She recalls getting a call from him in 2023: “He said, ‘Hey, you know, I’m thinking of doing this little, tiny movie, low budget, and would you want to do it?’”\n\n\tShe didn’t have a script at that point, as is often the case, but the criteria were to search for a young man who could sing and play the blues.\n\n\tEvery casting process is different, and this one was far-reaching. Aside from putting out calls and talking to people, Maisler says, “We were talking to blues clubs in Atlanta, anywhere we could think of schools, everything, and we welcomed any tape.” \n\n\tThousands of auditions came her way, but she remembers seeing Miles. “One day we see this young man in this dark room playing the guitar, and this voice comes out of him,” Maisler says. “We decide to fly him to L.A. and he came in the room with Michael, Ryan, and he sang. We all looked at our each other, and I’m not a very religious person, but I just said, ‘Man, if there’s somebody up there, he’s channeling something through this kid, because it moved all of us.'”\n\n\tSince the film’s release, Caton has garnered recognition, including Variety’s 10 Actors to Watch and Young Hollywood. Does she feel proud of her discoveries? “I don’t say, ‘I discovered somebody.’ I go, ‘Oh, thank goodness he was able to fulfill what Ryan wanted.’”\n\n\tThis year also saw Maisler reunite with Cooper for “Springsteen: Deliver Me from Nowhere.” The film follows Jeremy Allen White as Springsteen, making his very personal 1982 album “Nebraska.”\n\n\tFor the role of young Bruce Springsteen, Matthew Anthony Pellicano had never acted before — but his audition tape struck her. “He definitely warranted a call back. But Scott also said, ‘I want to see him again, and I want him to not use words to show, to convey what he’s feeling inside,’” she says.\n\n\tMaisler and Cooper were looking for someone who could convey emotions, and Pellicano was given prompts rather than line. “That’s when Scott knew,” Maisler says. “When you see Springsteen, you see that boy’s face and without words, it’s just incredible.”\n\t\n\n\tAlso on this episode, “Train Dreams” director Clint Bentley discusses the themes and challenges of making the period drama, working with Joel Edgerton, William H. Macy and the rest of the cast in developing their characters, and the music, cinematography and visual style.\n\n\tVariety’s “Awards Circuit” podcast, hosted by Clayton Davis, Jazz Tangcay, Emily Longeretta, Jenelle Riley and Michael Schneider, who also produces, is your one-stop source for lively conversations about the best in film and television. Each episode, “Awards Circuit” features interviews with top film and TV talent and creatives, discussions and debates about awards races and industry headlines, and much more. Subscribe via Apple Podcasts, Stitcher, Spotify or anywhere you download podcasts.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Casting Director Francine Maisler on Discovering ‘Sinners’ Breakout Miles Caton and Why Matthew Pellicano Made the Perfect Young ‘Springsteen’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/04/MCDSINN_WB036-1.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-24T19:32:50.000Z",
      "dateModified": "2025-10-24T19:32:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "LISTEN: How Rachel Sennott Planted Roots With ‘I Love L.A.’; Sarah Michelle Gellar Dishes on ‘Buffy’ Reboot; What Superfans See in ‘Love is Blind’",
    "url": "https://variety.com/2025/tv/news/rachel-sennott-i-love-la-sarah-gellar-buffy-love-is-blind-1236560977/",
    "image": "https://variety.com/wp-content/uploads/2025/10/Rachel-Sennott-8.jpg?crop=0px%2C136px%2C1620px%2C911px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-10-24T19:43:30.000Z",
    "description": "\n\t\t\t\n\t\t\t\t\n\t\n\n\t\n\tOct 24, 2025 12:43pm PT\t\n\t\n\n\t\n\t\tLISTEN: How Rachel Sennott Planted Roots With ‘I Love L.A.’; Sarah Michelle Gellar Dishes on ‘Buffy’ R",
    "body": "\n\t\t\t\n\t\t\t\t\n\t\n\n\t\n\tOct 24, 2025 12:43pm PT\t\n\t\n\n\t\n\t\tLISTEN: How Rachel Sennott Planted Roots With ‘I Love L.A.’; Sarah Michelle Gellar Dishes on ‘Buffy’ Reboot; What Superfans See in ‘Love is Blind’\n\t\n\n\t'Daily Variety' podcast dives into news, trends and personalities making headlines in showbiz\n\t\n\t\t\t\n\n\n\t\t\t\n\t\t\t\n\t\n\n\t\t\t\t\t\t\t\t\tMax Montgomery for Variety\n\t\n\n\t\t\n\t\n\t\t\t\t\n\tOn today’s episode, Variety reporter Selome Hailu details her cover story on Rachel Sennott, the multihyphenate behind HBO’s new comedy “I Love L.A.” Marc Malkin has a Red Carpet Rundown with Sarah Michelle Gellar dishing about Hulu’s “Buffy the Vampire Slayer” reboot. And reporter Giana Levy explains what superfans see Netflix’s “Love Is Blind.”\n\n\tHailu has been intrigued by Sennott’s work since the latter was fresh out of NYU and gaining attention for the 2020 micro-budget feature “Shiva Baby” that found its way to Netflix. Sennott is emblematic of her generation of auteur creatives who built their first followings via content shared on social media platforms.\n\t\n\n\t“She’s very intentional about her image,” Hailu says. “She had this experience of constantly going viral online and building a platform on social media, especially on Twitter, that preceded her career. And that was what she leveraged to get meetings with executives and to get standup gigs and to really establish herself before she had real inroads to the industry.”\n\n\tSennott quickly proved a master of marketing herself. Perhaps even too well.\n\n\t“A way to do that online, and to get that attention, is by playing with your sexuality. And so we talked about this push and pull she felt of having fun with that and being true to herself with that, but then also feeling that people were projecting onto her or thinking that they knew her more deeply than they did,” Hailu observes. “Eventually she got off social media and that really helped soothe those feelings. For the last several years, she’s been putting all of those thoughts that are conflicting and exciting about the sexuality of a young woman into the work. You see it in ‘Shiva Baby.’ You see it in [2023 film] ‘Bottoms’ and you really see it in ‘I Love L.A.’ ”\n\t\n\n\tListen to Daily Variety on iHeartPodcasts, Apple Podcasts, Variety’s YouTube Podcast channel, Amazon Music, Spotify and other podcast platforms.\n\n\n\t\n\t\tMore from Variety\n\t\n\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "LISTEN: How Rachel Sennott Planted Roots With ‘I Love L.A.’; Sarah Michelle Gellar Dishes on ‘Buffy’ Reboot; What Superfans See in ‘Love is Blind’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/Rachel-Sennott-8.jpg?crop=0px%2C136px%2C1620px%2C911px&resize=1000%2C563"
      ],
      "datePublished": "2025-10-24T19:43:30.000Z",
      "dateModified": "2025-10-24T19:43:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Netflix Shuts Down ‘Squid Game’ Mobile Game Studio",
    "url": "https://variety.com/2025/gaming/news/squid-game-mobile-studio-shut-down-netflix-1236560746/",
    "image": "https://variety.com/wp-content/uploads/2025/01/Squid-Game-Unleashed-video-game.png?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-24T19:17:49.000Z",
    "description": "\n\tNetflix has shut down Boss Fight Entertainment, the studio behind its hit mobile game based on the “Squid Game” franchise.\n\n\tThe two games the devel",
    "body": "\n\tNetflix has shut down Boss Fight Entertainment, the studio behind its hit mobile game based on the “Squid Game” franchise.\n\n\tThe two games the developer has released for the streamer, the “Netflix Stories” (which had already stopped releasing new titles earlier this year) series and “Squid Game: Unleashed,” will continue to be available via Netflix, Variety has learned.\n\n\tThe studio closure comes as Netflix continues to adjust its gaming strategy under president Alain Tascan, who joined the company in July 2024. The games division, which launched in November 2021, is now focused on party games (a slew of which will be released this holiday season), narrative games, kids games and mainstream games, as well as games played directly on TVs versus mainly mobile titles.\n\t\n\n\tNetflix first began this pivot when it closed its AAA video game studio, known as Team Blue, last October before the developer had released a project.\n\n\tHowever, the shuttering of Boss Fight (which was acquired by Netflix in 2022) is still a shock, considering that “Squid Game: Unleashed” had been touted as a very successful title by Netflix upon its release last December, and Netflix continues to emphasize the importance of developing content around its owned IP.\n\n\tNetflix declined to comment Friday.\n\n\t“Hi everyone – well, word has gotten around quickly about Boss Fight’s closure,” Boss Fight co-founder and CEO David Rippy said in a statement posted to LinkedIn Thursday. “Thanks, everyone who reached out today. Rough news, for sure, but I’m very grateful for the time we had at Netflix. We worked with some awesome people and made many games that I’m very proud of, including Squid Game Unleased which hit #1 in 26 countries. You’ll see lots of Boss Fighters with similar posts. Please consider them if you have any open roles – they are outstanding people and true professionals through-and-through. As for Bill, Scott and me – we’re going to take a little breather before tackling whatever is next. Love to hear from you if there’s anything interesting going on, workwise or otherwise.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Netflix Shuts Down ‘Squid Game’ Mobile Game Studio",
      "image": [
        "https://variety.com/wp-content/uploads/2025/01/Squid-Game-Unleashed-video-game.png?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-24T19:17:49.000Z",
      "dateModified": "2025-10-24T19:17:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘The Hunger Games: Sunrise on the Reaping’ Announces Winner of Fan Casting Contest: ‘I’m Super Excited’",
    "url": "https://variety.com/2025/film/news/the-hunger-games-sunrise-on-the-reaping-fan-casting-winner-1236560855/",
    "image": "https://variety.com/wp-content/uploads/2025/03/Sunrise-on-the-Reaping.jpg?crop=0px%2C32px%2C1800px%2C1012px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-10-24T18:00:21.000Z",
    "description": "\n\tFive months after announcing an open casting call, Lionsgate has discovered the fan who will appear in “The Hunger Games: Sunrise on the Reaping.”\n\n",
    "body": "\n\tFive months after announcing an open casting call, Lionsgate has discovered the fan who will appear in “The Hunger Games: Sunrise on the Reaping.”\n\n\tDevon Singletary has been selected to appear in the sixth installment of “The Hunger Games” film series, due in theaters Nov. 20, 2026.\n\n\tSingletary’s reaction to the news was captured on video, which was posted on “The Hunger Games” Instagram page as the official announcement. Singletary is a Florida-based actor and filmmaker.\n\t\n\n\t“I’m blown away,” he said on the video. “I’m really just speechless. I’m super excited.”\n\n\n\n\tSingletary was joined by cast members McKenna Grace, Whitney Peak and Joseph Zada congratulating him. They also revealed he would be playing Blair, who is a close friend of Haymitch Abernathy and Burdock Everdeen, Katniss’ father, in the “Hunger Games” prequel.\n\n\tThe video also showed Singletary arriving in front of his trailer for his first day on set, expressing his excitement to be a part of the film. \n\n\t“I love the ‘Sunrise on the Reaping’ book,” he said. “Being selected into the ‘Hunger Games’ is a great honor.”\n\n\tBack in May, Lionsgate announced an open audition for fans to act out their favorite scene, perform their favorite song or improv for a chance to be selected for a role in “The Hunger Games: Sunrise on the Reaping.”\n\n\tAs previously reported, Francis Lawrence, who has directed every “Hunger Games” installment since 2012, will return for the prequel series. \n\n\tRounding out the cast are Glenn Close, Kieran Culkin, Elle Fanning, Ralph Fiennes, Kelvin Harrison Jr., Maya Hawke, Jesse Plemons, Billy Porter and Lili Taylor, Iris Apatow, Edvin Ryding and Ben Wang.\n\t\n\n\tBased on Suzanne Collins’ novel of the same name, “Sunrise on the Reaping” will revisit the world of Panem nearly a quarter of a century before the events of the original “Hunger Games” saga. It starts on the morning of the reaping of the 50th Hunger Games, known as the Second Quarter Quell, in which Haymitch Abernathy enters the deadly arena. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘The Hunger Games: Sunrise on the Reaping’ Announces Winner of Fan Casting Contest: ‘I’m Super Excited’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/03/Sunrise-on-the-Reaping.jpg?crop=0px%2C32px%2C1800px%2C1012px&resize=1000%2C563"
      ],
      "datePublished": "2025-10-24T18:00:21.000Z",
      "dateModified": "2025-10-24T18:00:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Music Industry Moves: ‘KPop Demon Hunters’ Singer Kevin Woo Inks With UTA",
    "url": "https://variety.com/2025/music/news/milk-and-honey-launch-record-label-songwriters-1236558196/",
    "image": "https://variety.com/wp-content/uploads/2025/10/GettyImages-2220500124.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-24T18:00:00.000Z",
    "description": "\n\tUTA has signed K-pop singer, songwriter, and actor Kevin Woo for worldwide representation in all areas.\n\n\tThe announcement comes on the heels of Woo",
    "body": "\n\tUTA has signed K-pop singer, songwriter, and actor Kevin Woo for worldwide representation in all areas.\n\n\tThe announcement comes on the heels of Woo’s star turn as the singing voice of Mystery Saja – of the Billboard Hot 100-charting Saja Boys – in “KPop Demon Hunters.” With over 315 million views and counting, “KPop Demon Hunters” is officially Netflix’s most-watched film of all time, and made history as the streaming giant’s first to reach No. 1 at the worldwide box office. \n\t\n\n\tUTA represents the film’s creator/director Maggie Kang, as well as Rei Ami, one of the voices of Huntr/x. The soundtrack made U.S. chart history recently with four songs in the top 10 on the Billboard Hot 100, including The Saja Boys’ “Your Idol” and “Soda Pop” at No.s 4 and 5, respectively.\n\n\n\tKevin Woo is managed by Gary Marella at Mono Music Group for music, and by Daisy Burnham at Atlas Artists for acting.\n\t\n\t\tThursday, Oct. 23\t\n\n\tChappell Roan has launched The Midwest Princess Project, a new non-profit initiative that supports organizations providing resources for trans youth and LGBTQ+ communities through action, care and connection.\n\n\tTo date, The Midwest Princess Project has already raised over $400,000 with combined efforts from the sold out “Visions of Damsels and Other Dangerous Things Pop-Up Shows.” One dollar from every ticket sold from the 8-date run in New York, Los Angeles and Kansas City, Missouri will be donated to support organizations, including the Ali Forney Center and the LGBT Center in New York, Trans Wellness Center and TransLatin@ Coalition in Los Angeles, and The GLO Center and The Center Project in Missouri, that provide resources for trans youth. (The Midwest Princess Project is a sponsored project of the Catalyst Philanthropy Fund.)\n\t\n\n\t “I am so excited to announce The Midwest Princess Project! These funds will be donated to incredible organizations making a positive impact for trans youth in their communities,” said Roan in a statement. \n\n\tRoan also partnered with Propeller and eBay to bring bespoke activations in and around her shows that helped to raise money, in addition to donations contributed from industry, friends and show guests, to go towards The Midwest Princess Project’s efforts.\n\n\t+ Sony Music Publishing today announced it has renewed an exclusive worldwide publishing agreement with British artist and songwriter Daecolm. The deal renews the company’s long-established partnership with Daecolm, which began in 2016, and covers his existing catalogue and future recordings.\n\n\tIn 2024, Daecolm achieved global success with the international hit “I Adore You” alongside Hugel. The hit single charted in the Top 20 across multiple European territories and has amassed over 420 million streams on Spotify.\n\n\tAs both a songwriter and performing artist, he has collaborated with Wizkid, Arya Starr, Chris Brown, J Balvin, Ty Dolla $ign, Anitta, Mario, Alok and more.\n\n\tDaecolm said, “This new chapter with SMP represents more than just a deal, it’s a shared commitment to artistic growth and breaking new ground. I’m proud to keep building with a team that truly understands and supports my vision.”\n\n\t+ Audiomack has unveiled advanced features for Audiomack for Tastemakers, the company’s global curatorial program, in the newest version of its iOS app. This update equips select music curators around the world with professional-grade analytics to track and optimize their playlist performance.\n\n\tThe Audiomack for Tastemakers app provides curators, now on both iOS and on the previously-introduced Android app, with comprehensive performance metrics including Stream Impact, Save Impact, Finish Rate, Engagement Stats, 30-second Stream Rate, and seven-day performance snapshots, among other metrics. These tools enable Tastemakers to understand how their playlists resonate with listeners and refine their curation strategies in real time.\n\n\t“I started Audiomack because I’m a music fan and passionate about discovering music. As we’ve grown and helped break new artists around the world, we’ve found that a common trait of an Audiomack listener is that they, too, want to lean in and be a part of discovering the next big artist or sound,” said David Ponte, co-founder and CMO of Audiomack. “By providing our listeners with carefully curated playlists from our Tastemakers, we ensure they always have their finger on the pulse of new music and emerging artists.”\n\t\n\t\n\t\tTuesday, Oct. 22\t\n\n\tMusic management company Milk and Honey have announced their plans to launch a label under the banner Milk and Honey Records. The roster will be primarily composed of pop and dance music, with a physical and digital distribution agreement in place with The Orchard.\n\n\tMilk and Honey founder, Lucas Keller, said: “Today, artists and their managers have become more independent from the major labels and are building tremendous cottage industries, so we decided that now is the right time for us to enter the space. Milk and Honey is a house built by songwriters, and the firm has never lost its way in putting them first.”\n\n\tIn a press release, the company says it will offer songwriters a “sizeable amount” of gifted master points. “Nothing about this is performative, the label will be giving songwriters as much as double digits worth of points perpetually accounted directly to them as a production royalty,” the company said. “The label is focused on transparent marketing commitments, friendly deals and will even be doing one-off-track deals.”\n\n\t+ Michael Farris has been promoted to vice president, business strategy and insights of the Country Music Association (CMA), advancing from his previous role as senior director, business strategy and insights. In this elevated position, Farris drives CMA’s strategic growth by leveraging data, technology, and cross-department collaboration to streamline processes, foster innovation, and enhance organizational growth.\n\n\tHe continues to oversee insights, ticketing, and data architecture teams, while expanding his role to lead a cross-functional initiative that aligns revenue efforts through shared planning and resources to drive greater impact toward CMA’s mission. Prior to joining CMA in 2018, he led the strategic consulting and research team at The Aspire Group.\n\n\tKate Watson has been promoted to senior director, industry relations, moving from her previous role as director, industry relations. Watson leads CMA’s industry relations and membership strategy, overseeing industry partnerships, community building, talent relations, and workforce development initiatives that strengthen CMA’s role across the music industry. She also directs membership engagement and events while ensuring seamless artist and industry experiences at all major CMA events. \n\t\n\n\t+ Warner Chappell Music (WCM) Nashville has promoted rising music professional Eric Reid to Jr. manager, A&R. In his new role, he will focus on identifying and nurturing new talent, pitching songs, and creating new opportunities for the publisher’s growing roster. \n\n\tAdditionally, he will continue supporting efforts to onboard new songwriters, maintain updated marketing materials, and assist with songwriting camps. Reid will report to Austen Adams, president, WCM Nashville.\n\n\tAdams shared: “Eric brings a lot of passion and drive to everything that he does. He consistently goes above and beyond for our team, and our songwriters trust and respect him. We’re excited to see him grow in this next chapter.”\n\n\tReid added: “I am incredibly thankful to be afforded the opportunity to continue my career at Warner Chappell. Thank you to all of my mentors and friends that have provided guidance and support, especially Jessi Vaughn Stevenson, Bethany Mako, Phil May, Austen Adams, and our entire Warner Chappell team. It is a privilege to work with people that believe in me so much. I am honored to continue working with such talented songwriters and dedicated industry professionals, as well be a part of the Music Row community. I’m excited for the next chapter as I take on this new role!”\n\n\t+ Warner Chappell Music (WCM) has today announced the signing of Victor Le Masne to a global administration deal. The agreement covers all works produced through Le Masne’s Multiman Records and will be administered by WCM’s teams in France and the US. \n\n\tWidely known as the composer and music director for the Ceremonies of the Paris 2024 Olympic and Paralympic Games, Le Masne created the original music for the ceremonies, the Games’ anthem “Parade,” and worked alongside stars like Lady Gaga, Gojira, Aya Nakamura, and Jean-Michel Jarre. Since 2022, Le Masne has also been the musical director of the acclaimed, multi-award winning musical “Starmania”. \n\n\tAs a solo artist, he has collaborated with artists such as Kavinsky, Juliette Armanet, Gaspard Augé (Justice) and more. Over the past couple of years, Le Masne has also received external recognition for his work, including a Grammy for best metal performance, and a Victoire de la Musique for best concert, received for the opening and closing ceremonies of the Paris Olympic and Paralympic Games.\n\t\n\n\tLe Masne said, “After the incredible challenge of serving as composer and musical director for the last Olympics, I’m truly proud to take this next step by signing with the amazing teams at Warner Chappell. This transatlantic collaboration between the U.S. and France feels both unique and exciting, and I’m honored to join such a legendary music house. Huge thanks to Guy, Carianne, Matthieu, Rachel, Rich, Alex, and the entire team — I’m really looking forward to working with you all.” \n\n\tGuy Moot, Co-Chair and CEO, Warner Chappell Music, and Carianne Marshall, Co-Chair and COO, Warner Chappell Music, continued, “Victor is an exceptional visionary and holds the rare ability to blend classical styles with innovation. His work on the Paris 2024 Olympic ceremonies showcased his incredible skills to the world stage. We’re delighted to welcome him to Warner Chappell and look forward to working with the Multiman Records team.”\n\n\t+ Producer and DJ Maesic has signed with WME in all areas. Leading the agency team at WME is industry veteran and booking powerhouse Steve Hogan who will book shows for Maesic globally alongside his colleagues Laura Ruiz (London) and Ian Wilkerson (Los Angeles).\n\n\t“I’m thrilled to be joining one of the most iconic agencies in the game, driving the music and dance scene forward with the legend himself, Steve Hogan,” said Maesic.\n\n\t“From the first time I watched him play at Exit Festival in the summer, I knew Maesic had something special about him – the more I asked about him, behind the scenes the writers and producers came back with great feedback – he feels like the full package. We are all very excited about the future,” added Hogan.\n\n\tOver the years, Maesic has joined forces with an all-star lineup of artists including Major Lazer, Dillon Francis, Jung Kook, Bob Sinclar, HUGEL, Wax Motif, Blond:ish, ANYMA, Carlita, and Diplo, the latter of whom has been a frequent collaborator. On Oct. 25, Maesic will also perform with Diplo at The Edge NYC.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Music Industry Moves: ‘KPop Demon Hunters’ Singer Kevin Woo Inks With UTA",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/GettyImages-2220500124.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-24T18:00:00.000Z",
      "dateModified": "2025-10-24T18:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "SCAD Savannah Film Festival Brings Student Filmmakers and Elite Auteurs Together",
    "url": "https://variety.com/2025/film/festivals/scad-savannah-film-festival-premieres-1236547066/",
    "image": "https://variety.com/wp-content/uploads/2025/10/4245_D015_02240_R2.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-24T18:45:00.000Z",
    "description": "\n\tSCAD Savannah Film Festival returns Oct. 25-Nov. 1 with a lineup of exciting premieres, screenings, honorees and guests who will congregate at the l",
    "body": "\n\tSCAD Savannah Film Festival returns Oct. 25-Nov. 1 with a lineup of exciting premieres, screenings, honorees and guests who will congregate at the largest university-run film festival in the world.\n\n\tThe festival, which is organized by and hosted at the Savannah College of Art and Design, showcases a combination of student and professional work. The fest brings together SCAD’s emergent artists and Hollywood’s most elite filmmakers through screenings, panels and discussions during the week.\n\t\n\n\t“Our team’s goal when programming the SCAD Savannah Film Festival is to curate a lineup that brings the most compelling, innovative and culturally resonant films to our screens — not only to celebrate the art of cinema but to inspire the next generation of storytellers studying at SCAD,” says festival director Christina Routhier.\n\n\n\tThe festival opens with a screening of “Eternity,” A24’s romantic comedy starring Miles Teller, Elizabeth Olsen, Callum Turner and Da’Vine Joy Randolph. Teller will receive the Distinguished Performance Award that same night, joined by his co-star, Oscar-winner Randolph.\n\n\t“’Song Sung Blue’ serves as the festival’s Centerpiece Gala. Hugh Jackman and Kate Hudson topline Focus Features’ comedy-drama about the Neil Diamond cover duo Thunder & Lightening. Director Craig Brewer will receive the festival’s Spotlight Director Award.\n\n\tFinally, the festival closes with a screening of “Wake Up Dead Man: A Knives Out Mystery,” the third installment of Rian Johnson’s whodunnit murder mystery series starring an ensemble cast led by Daniel Craig’s detective Benoit Blanc. The film had its world premiere at the Toronto International Film Festival in September, begins a limited theatrical run on Nov. 26 and releases globally on Netflix Dec. 12. Johnson will receive SCAD’s Outstanding Achievement in Directing Award at the screening.\n\t\n\n\tOther honorees at SCAD this year include Jon Chu, recipient of the Vanguard Director Award, while Hannah Beachler will receive the Variety Creative Impact in Production Design Award. Actors, including Will Arnett, Rose Byrne, Miles Caton, Zoey Deutch, Joel Edgerton, Mark Hamill, Oscar Isaac, Dylan O’Brien, Tessa Thompson, Brendan Fraser, Amanda Seyfried and Jennifer Lopez, will each be honored with a specific prize tied to their films that will screened at the festival.\n\n\tThis year’s festival will also showcase expansions and additions at SCAD Film Studios in Savannah, Ga., the school’s film production campus. The studio’s 11 acres already feature over 40 facades and dressed interior spaces, a 17,000-square-foot production and costume space and an LED volume screen for virtual production. During the festival, SCAD will introduce new backlot facades as well as plans for two new soundstages and 11 new classrooms set to open in 2026.\n\n\tOther events at this year’s festival include the animation roundtable Pixels and Pencils, a panel of cinematographers called Behind Their Lens, an Artisans series featuring casting directors, production designers and composers, the SCAD Alumni Voices Panel highlighting accomplished graduates of the school and Variety’s 10 Artisans to Watch panel.\n\n\tPaula Wallace founded SCAD Savannah Film Festival in 1997 and continues to serve as the organization’s president. In anticipation of this year’s festival, she says, “Every October, SCAD transforms Savannah into a masterclass in moviemaking, with our 2025 SCAD Savannah Film Festival lineup featuring Jennifer Lopez, Mark Hamill (the original Skywalker!), ‘Wicked’s’ Jon M. Chu, and so many more who help SCAD Bees make the leap from classroom to call sheet. Come for the Oscar-bound premieres and stay for the splendor of the South’s most cinematic city.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "SCAD Savannah Film Festival Brings Student Filmmakers and Elite Auteurs Together",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/4245_D015_02240_R2.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-24T18:45:00.000Z",
      "dateModified": "2025-10-24T18:45:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "David Trueba on Adapting David Trueba, Life After Great Love Breakup, and What Could Be a Kind of Coming of Age  ",
    "url": "https://variety.com/2025/film/global/david-trueba-valladolid-david-verdaguer-isabelle-renauld-1236560899/",
    "image": "https://variety.com/wp-content/uploads/2025/10/siempre-es-invierno-quim-vives.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-24T18:31:18.000Z",
    "description": "\n\tIn David Trueba’s “Always Winter,” the closing night film of this year’s Valladolid Film Festival in Spain, Miguel Mena (David Verdaguer), 40, a job",
    "body": "\n\tIn David Trueba’s “Always Winter,” the closing night film of this year’s Valladolid Film Festival in Spain, Miguel Mena (David Verdaguer), 40, a jobless landscape architect travels to a Brussels conference to pitch a project, Gardens of Life, in which people are invited to sit on grass or a bench and contemplate three-minute hour-glasses.\n\n\t“We love hour-glasses because they are a visual representation of time sliding by. They allow is to see the passing of something we never see: the Passage of Time,” Miguel says on stage, commandingly. And then he can’t remember how to go on.\n\t\n\n\t“The importance is to go back to the real world. Technology has become a real religion,” he says in a debate the next day. \n\n\n\tDistances apart, Miguel could be talking about David Trueba’s film.\n\n\tIt’s the first time in a now 30-year-career that Trueba – selected for Cannes with “The Good Life” and “Salamina Soldiers,” has adapted one of his novels, and one of his best, the 2015 novella “Blitz,” an international breakout, hailed by Liberation as “delicious, original and subtle.”\n\n\tIn both, Miguel is accompanied to a conference by Marta (Amaia Salamanca), his girlfriend of dazzling beauty and his only emotional mainstay. In Brussels, Marta reveals she leaving him. “Broken and out of place, Miguel meets Olga (Isabelle Renauld), an older woman who works as a volunteer at the architecture congress. At her side, he will begin to rebuild himself and to understand what his new life project consists of,” the film’s synopsis ends.\n\n\tBringing the Power of Cinema to the Table\n\t\n\n\t“Always Winter,” however, brings the full power of cinema to the table. That cuts several ways. \n\n\tSome people may have read “Blitz” at one sitting, others not. Everyone will catch “Always Winter,” at least on its theatrical run, in one go. That allows the film to capture far more clearly, the emotional density of time. Its January chapter, where Miguel is left by Marta and meets Olga, lasts 90 minutes. Other months, until a final December, go by in a flash, one-minute or less chapters.\n\n\tSingle shots capture the felt strangeness of rupture. When Marta is leaving the Brussels hotel to travel back to Madrid, while Miguel stays, Miguel is caught lying on his bed. Marta’s face enters the frame to kiss him goodbye and then she is gone. The camera lingers for a few seconds on Miguel, in his new emotive state for the rest of his life, without Marta.\n\n\tAbove all, the film captures the ravages and awe of time, on the actors’ faces and bodies, or on the sun suddenly peaking out above a dawn Mediterranean sea horizon, the real world, manifest in a scene of incontrovertible wonder.\n\n\t“Always Winter” reunites Trueba with actor David Verdaguer and Ikiru Films, Atresmedia Cine and La Terraza Films, and also Film Factory, star, producers and sales agent of 2023’s “Jokes & Cigarettes,” which broke out to an appreciable €891,991 ($972,270) at Spanish theaters. Verdaguer went on to win a Spanish Academy Goya – and indeed any Spanish best actor plaudit going in a historic first – for his performance in “Jokes & Cigarettes”  \n\n\tVariety talked to Trueba on the eve of the 2025 Valladolid Film Festival, about the power of cinema, post great love and a kind of adult coming of age.\n\n\tYou’ve said that some aspects of “Blitz,” turning on the passage of time, were apt for new expression in a film. One could be the emotional density of time, caught in the length of the January chapter, contrasting with many others. This is felt more strongly in a film…\n\n\tAbsolutely. Yes, I think it’s more noticeable. Also, there’s a visual aspect. You can describe in a book bodies but differences in age, bodies’ skin, are all the more evident in film.   \n\n\tDid the fact you had developed the story in a written form, “Blitz,” encourage you to focus more on the especially “filmic” aspects of “Always Winter”?\n\t\n\n\tLet’s say the second or final part of “Always Winter” was precisely about that: Trying to find cinematographic way of telling what’s apparently the same story, but telling it in a different way to how it’s told in the novel, precisely because in the novel you have the voice of the narrator and it’s easier to sat what he’s thinking. Film’s a more eternal in this sense…  \n\n\tThe film is pretty open, beginning with its title: “Always Winter,” which seems a reference to Miguel’s spiritual malaise and then, three quarters of the way through the film, he’s says just that, as a joke about not being able to turn off the air conditioning in the office, which has given him cold….\n\n\tThe novel was called “Blitz.” Given in the film, Olga is no longer German, it didn’t make much sense to keep the title. “Always Winter” is a reference to the state of spirit: After rupture, there’s a kind of emotional blocking, like a freezing. You become someone who can’t give nor receive. I’m very interested in that. It’s a state where a person seem normal but is really blocked. People ask me: Isn’t that a bit sad for a title? And I’d answer that as soon as you see David Verdaguer, you know there’s an irony in the title…..       \n\n\tI sense the film asks if the break-up isn’t part of a larger life-cycle….\n\n\tBeyond break-ups, also when there’s a death of someone close, from that point on it’s as if life is a matter of surviving that absence, going on living despite that absence. It’s a bit the sensation that the film tries to transmit, that’s there’s something missing and in a way will be missing now forever. So you’re life has received a message. What Martin Amis called “The Information.” You have to learn to live with this information, while before you lived in another way, because you didn’t have this baggage. It’s the accumulation of experiences which transform a person.\n\n\tIn a way you could call “Always Winter” a coming of age tale in which Miguel learns to abandon sexist taboos like that a man can’t have a relationship with a quite older woman. \n\n\tAnd, the architect he joins at his company, he judged without even knowing him, forming an opinion based on rivalry. Miguel learns that people aren’t always what they seem and many times your opinions about them are too hasty. And learning that, you feel a bit better about the world.  \n\t\n\n\tThat sense of coming of age cuts other ways. With Marta, he’s a bit like a funny child. Olga also talks a the feverishness her you grandson has, always asking: ‘What do we do now?’ And after her own great love ended, she lost that sensation…. \n\n\tMiguel has to learn that he can’t remain anchored in the past, petrified in the past. After something, there’s something else. He has to learn that.\n\n\tI wrote in April, announcing Film Factory’s pickup of “Always Winter,” that it melded the intimacy and sense of fragility of characters of Frech Cinema, the bathos of Spain’s Rafael Azcona and the structural play of the U.K.’s Martin Amis, Julian Barnes and Ian McKewan generation. But maybe I’m totally wrong…. \n\n\tCertainly, one of my big influences, is the spirit of films, like those from Éric Rohmer. “My Night at Maud’s,” for example. Films which unspool in closed spaces, whose spectacle is their intimacy. I’ve also always felt a large affinity with many of the works of Julian Barnes. He’s written about time, absence, relationships, mixing elements from an animality in behaviour to the rationality of cultivated characters whose reactions are much more sophisticated.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "David Trueba on Adapting David Trueba, Life After Great Love Breakup, and What Could Be a Kind of Coming of Age  ",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/siempre-es-invierno-quim-vives.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-24T18:31:18.000Z",
      "dateModified": "2025-10-24T18:31:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bari Weiss’ First Weeks at CBS News: ‘60 Minutes’ Miss, Hunt for New Talent, Concerns Over Union Status at Free Press",
    "url": "https://variety.com/2025/tv/news/bari-weiss-early-cbs-news-60-minutes-free-press-talent-1236560768/",
    "image": "https://variety.com/wp-content/uploads/2025/10/Bari-Weiss-CBS-News.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-24T17:50:00.000Z",
    "description": "\n\tBari Weiss is poised to revamp one of the nation’s most venerable down-the-middle news outlets, CBS News. The question is, will she be able to make ",
    "body": "\n\tBari Weiss is poised to revamp one of the nation’s most venerable down-the-middle news outlets, CBS News. The question is, will she be able to make money for corporate parent Paramount Skydance after doing so?\n\n\tThe query is legitimate. Paramount executives believe Weiss, named editor in chief of CBS News earlier this month as part of an acquisition of her digital opinion site, The Free Press, will bring “a sense of energy and fearlessness” to the home of “60 Minutes” and “CBS Evening News,” according to a person familiar with the company. Paramount brass were particularly impressed by a segment shown on the most recent telecast of “60 Minutes,” this person says, featuring a sit-down with Jared Kushner and Steve Witkoff, with the pair detailing for correspondent Lesley Stahl how they helped broker a seeming peace between Israel and Hamas.\n\t\n\n\tThe trouble? The telecast was one of the lowest-rated broadcasts of “60 Minutes” in the early weeks of the current season. The show, crimped by a late-running NFL game which delayed “60 Minutes” in New York, lured an average of 6.9 million viewers overall, and 946,000 among people between 25 and 54, according to Nielsen data, compared with nearly 10.2 million viewers overall, and nearly 2.1 million viewers between 25 and 54, the previous week. Overall viewership fell 32% from the prior week, according to Nielsen, and 54% among viewers between 25 and 54 — the demographic coveted most by advertisers in news programming.\n\n\n\t Such ups and downs aren’t unusual for “60,” which can see ratings spike after an NFL broadcast. Still, the numbers are below the average audience for the show, which came to nearly 8.6 million viewers last season, when the 2024 presidential election goosed viewership. The network was encouraged by attention the interview of Witkoff and Kushner received online, according to a person familiar with the matter.\n\t\n\n\tIn the TV news business, scoops matter. But so too does sizzle — promotion of a big interview, parceling it out among several programs — and Weiss, who has no previous experience running an editorial operation the size of CBS News or producing TV programs, needs to master it.\n\n\tThere are many in the newsroom who hope she can. And there are still others who do not understand what she intends to do in her new perch or how she will go about doing it.\n\n\tUpon completion of her deal with Paramount, Weiss hailed the transaction as “a great moment for the Free Press.” People are still trying to determine what it means for the news division over which she now presides.\n\n\tNo one seems able to articulate the relationship between Free Press, which is still publishing stories, and CBS News, which has featured Weiss’ sister and “Free Press” cofounder Suzy Weiss on programs. Are the two part of a single unit? Is “Free Press” bound by the same ethics and newsgathering standards as CBS News? There is some concern among CBS News staffers, according to two people familiar with the matter, that “Free Press,” which is not unionized, will not be bound by the same workplace policies as CBS News, where many employees are represented by Writers Guild of America. Weiss recently hired Adam Rubenstein as a deputy editor of “Free Press,” a move CBS News staffers anticipate will give him some say in the newsgathering direction of CBS News. And yet, CBS News’ union will expect its contract to be honored, even by “Free Press” personnel.\n\n\tCBS News declined to make executives available for comment. A spokesman for WGA’s East Coast operations did not respond to a query seeking comment.\n\n\tInside CBS News, employees have some hope Weiss can help boost the viewership of the company’s streaming properties, which aren’t pulling in the audience executives might like. While CBS News was early to join the streaming game, it hasn’t maximized its efforts to the extend that NBC News has, which operates a stand-alone streaming outlet devoted to “Today” and a live-streaming service for national news called NBC News Now. In recent months, CBS merged its national newsgathering business with its local stations and has tapped personnel from both sides to create new streaming formats and programs, including a show that takes viewers to news stories covered by local stations in “whip-around” style.\n\t\n\n\tThere is also a sense that some of CBS News’ best-known programs are in for an overhaul.\n\n\tWeiss has already leaped to help book newsmakers for segments on CBS News programs, setting Norah O’Donnell to moderate a panel discussion online with former Secretaries of State Hillary Clinton and Condoleeza Rice, and arranging an interview between Tony Dokoupil and Israeli Prime Minister Benjamin Netanyahu. It’s notable that such assignments weren’t given to the current “CBS Evening News” anchors, Maurice DuBois and John Dickerson, who preside over a retooled show that uses a dual-anchor format and has tried to focus more heavily on enterprise stories rather than breaking headlines — and seen viewership drop noticeably as a result.\n\n\tDespite the recent spotlight on O’Donnell and Dokoupil, CBS News executives have begun making outreach to talent agencies in hopes of luring new anchors to the fold, according to three people familiar with the matter. CBS News has tried to find out what journalists might be available in case the offer of a job comes their way, these people say, and would be amenable to putting these people in new places at CBS News even ahead of internal candidates — at least for now.\n\n\tSuch queries aren’t atypical when new management comes into a news division. CBS News reached out in similar fashion to agents after Neeraj Khemlani took the reins at CBS News in 2021, according to two people familiar with the matter, eager to see if potential candidates who worked elsewhere might be near a negotiating window in their contracts.\n\n\tThe move to inject new talent into CBS News spotlights the fact that no matter what new policies and projects Weiss brings, a host of old challenges remain — and may be of more critical economic importance to Paramount Skydance than any ideas she has on the caliber of reporting and journalism.\n\n\t“CBS Evening News” and “CBS Mornings” have long been mired in third place, partially the result of CBS losing affiliates in 1994 after ceding NFL rights to a still-nascent Fox. But the network can perform well, often notching first-place wins in primetime and late night (CBS will likely lose that distinction next year after it shuts down “The Late Show,” hosted by Stephen Colbert).\n\n\tWeiss will also have to grapple with what will likely be a much-scrutinized talent decision. The contract of Gayle King, the well-liked co-anchor of “CBS Mornings,” expires in 2026, according to three people familiar with the matter. Renewing King is always “a question mark,” says one of these people, as the host often debates about whether to continue and how to balance her job with her family. At a time when CBS News’ corporate parent is cutting costs and laying off staff, it’s not clear whether Paramount will want to continue paying the morning host her current salary, and whether King would want to continue if asked to take a cut.\n\t\n\n\tWeiss has shown early skill in landing good “gets” for CBS News. But there’s a lot more she’ll have to master in coming months — with little time to get it right.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bari Weiss’ First Weeks at CBS News: ‘60 Minutes’ Miss, Hunt for New Talent, Concerns Over Union Status at Free Press",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/Bari-Weiss-CBS-News.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-24T17:50:00.000Z",
      "dateModified": "2025-10-24T17:50:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'Love Island' Star Pepe Garcia Says Dating Has Been Tough Since Show",
    "url": "https://www.tmz.com/2025/10/24/pepe-garcia-love-island-dating-reality-television-tj-iris/",
    "image": "https://imagez.tmz.com/image/96/16by9/2025/10/24/960a32d5a45d400c9c76b4e48503cab9_xl.png",
    "tag": "Entertainment",
    "date": "2025-10-24T20:00:15.000Z",
    "description": "\n    \n                    \n                          'Love Island' Pepe Garcia\n                          I'm Struggling To Find Love Off The Island!!!",
    "body": "\n    \n                    \n                          'Love Island' Pepe Garcia\n                          I'm Struggling To Find Love Off The Island!!!\n                      \n                  \n                        Published October 24, 2025 1:00 PM PDT\n                                                                            \n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          Pepe Garcia’s keepin’ it real ... fresh off \"Love Island\" fame, he tells us dating hasn’t exactly been a breeze ... in fact, he admits he’s actually struggling to find love out here!\n      \n    \n          We bumped into the reality hunk outside L.A.’s celeb-fave spot Via Alloro on Thursday ... and he admitted it’s been a rollercoaster since the villa days -- but at the end of it all, he’s just focused on finding the one.\n      \n    \n      \n        \n              \n    \n    \n          Catch the full clip ... Pepe also dishes on whether he’d jump back into reality TV for love -- and drops a little tease about something big on the horizon.\n      \n\n          But we had to rewind a bit -- asking if he’s still cool with pal TJ Palma after that whole Iris Kendall drama. At first, Pepe kept it coy ... saying he only stays in touch with a select few from the cast.\n      \n    \n          But when we pressed him directly about TJ ... let’s just say, you’ll wanna catch his answer for yourself!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Pepe Garcia-Gonzalez\n              \n                          \n                Love Island\n              \n                          \n                Reality TV\n              \n                          \n                Relationships\n              \n                          \n                Dating\n              \n                          \n                Fairly Legal\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Love Island' Star Pepe Garcia Says Dating Has Been Tough Since Show",
      "image": [
        "https://imagez.tmz.com/image/96/16by9/2025/10/24/960a32d5a45d400c9c76b4e48503cab9_xl.png"
      ],
      "datePublished": "2025-10-24T20:00:15.000Z",
      "dateModified": "2025-10-24T20:00:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "HGTV Couple Demand Accountability From Pro Pet-Sitter and Rover.com",
    "url": "https://www.tmz.com/2025/10/24/hgtv-eilyn-ray-jimenez-accountability-pet-sitter-rover/",
    "image": "https://imagez.tmz.com/image/2d/16by9/2025/10/24/2da2472d53434ccda469f775b54e90bb_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-24T19:30:50.000Z",
    "description": "\n                    \n                          HGTV Couple\n                          We Want Accountbaility For Dog's Death ...\n                     ",
    "body": "\n                    \n                          HGTV Couple\n                          We Want Accountbaility For Dog's Death ...\n                          And We Gotta Change the Law in Florida\n                      \n                  \n                        Published October 24, 2025 12:30 PM PDT\n                                                                            \n              \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          The HGTV couple who say their dog was killed while supposedly in the care of a professional pet-sitter is demanding accountability ... and, they're thinking about ways they can redefine the legal status of dogs in Florida.\n      \n    \n          We spoke with Eilyn and Ray Jimenez -- best known for starring in the hit reality show \"Divided by Design\" -- on \"TMZ Live\" Friday ... and, they ran through the events surrounding their dog's death, which they previously laid out on social media.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          ICYMI ... Eilyn and Ray were told their dog Aria -- a 12-year-old Shih Tzu -- died of a heart attack while in the care of a pet-sitter while they were out of town for 2 days. However, they said they learned from the cremation center where their dog was taken before they got home that their pup was actually killed by another dog.\n      \n\n          Adding insult to injury, they say the pet-sitter wasn't actually around to look after the dog ... she had flown from Florida to Las Vegas for a jiu-jitsu tournament -- and actually posted on social media about it -- while she was supposed to be watching the dog. Her boyfriend was actually taking care of Aria ... which is how the poor pooch ended up dead.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          The Miami couple says they're shocked at the pet-sitter's bald-faced lies to them -- they say she even burst into tears while telling the couple the elaborate fabrication -- and, they want accountability.\n      \n    \n          They tell us they've been in contact with Rover.com ... they say the company told them this poor excuse for a pet-sitter has been fired. The company also offered them $1,000 for their dog's death.\n      \n    \n          Worth noting ... in a statement to us, Rover said, \"Upon learning of this incident, Rover’s 24/7 Trust & Safety team conducted a thorough investigation into Aria’s passing. The sitter involved has been deactivated from our platform without the option to appeal .... We stand ready to assist law enforcement with their investigation should they become involved.\"\n      \n    \n    \n              \n                \n  \n    \n          As for whether they might take Rover.com to court to get the accountability they're seeking ... the couple says their main focus is to change the legal status of dogs in Florida -- arguing they're family, not property, as the law currently holds.\n      \n    \n          Stay tuned ... 'cause this couple seems ready to make some noise about the people involved.\n      \n      ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "HGTV Couple Demand Accountability From Pro Pet-Sitter and Rover.com",
      "image": [
        "https://imagez.tmz.com/image/2d/16by9/2025/10/24/2da2472d53434ccda469f775b54e90bb_xl.jpg"
      ],
      "datePublished": "2025-10-24T19:30:50.000Z",
      "dateModified": "2025-10-24T19:30:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tyla Shakes Her Sexy Body in New Dance Video",
    "url": "https://www.tmz.com/2025/10/24/tyla-sexy-dance-video-new-song-chanel/",
    "image": "https://imagez.tmz.com/image/57/16by9/2025/10/24/5720e14e8bec439aa34be55192f6eac5_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-24T17:17:46.000Z",
    "description": "\n    \n                    \n                          Tyla\n                          Shakes It to 'Chanel' in New Vid\n                      \n          ",
    "body": "\n    \n                    \n                          Tyla\n                          Shakes It to 'Chanel' in New Vid\n                      \n                  \n                        Published October 24, 2025 10:17 AM PDT\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Could Tyla be any cuter??? The singer-songwriter looked insanely hot in a new video posted Friday.\n      \n    \n        Waiting for your permission to load the Instagram Media.\n      \n    \n          The 23-year-old Grammy winner stunned in a skimpy polka-dot bikini reminiscent of a maid's outfit, strutting and twisting on a soundstage to her new song, \"Chanel.\"\n      \n    \n          She wrote, \"CHANEL OUT EVERYWHEREEEE\" promoting her latest banger.\n      \n\n          This comes after Yung Miami accused Tyla of stealing the song from her in an X post ... writing, \"This girl really ran off with my song and ion know how to feel about it mind you I played this song for this girl.\"\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Yung Miami's no stranger to social media tiffs ... she's even snapped at her former friend and collaborator JT -- the other half of her rap group, City Girls.\n      \n    \n          She accused JT of sneak-dissing her in solo songs ... though JT denied it and fired back by claiming YM was just looking for attention.\n      \n    \n      \n        \n              \n    \n    \n          Tyla hasn't explicitly responded to the shot fired, but this seems to send a message that she's ... unbothered.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Yung Miami\n              \n                          \n                Hot Bodies\n              \n                          \n                Hip Hop\n              \n                          \n                Music\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tyla Shakes Her Sexy Body in New Dance Video",
      "image": [
        "https://imagez.tmz.com/image/57/16by9/2025/10/24/5720e14e8bec439aa34be55192f6eac5_xl.jpg"
      ],
      "datePublished": "2025-10-24T17:17:46.000Z",
      "dateModified": "2025-10-24T17:17:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Three Deaths Reported at Disney World Over the Last 10 Days",
    "url": "https://www.tmz.com/2025/10/24/walt-disney-world-deaths-orlando-florida/",
    "image": "https://imagez.tmz.com/image/af/16by9/2025/10/24/aff09485135742dd8d4006fe1be4fcb9_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-24T15:38:22.000Z",
    "description": "\n    \n                    \n                          Disney World\n                          Another Day, Another Body\n                      \n         ",
    "body": "\n    \n                    \n                          Disney World\n                          Another Day, Another Body\n                      \n                  \n                        Published October 24, 2025 8:38 AM PDT\n                                                                      |\n                Updated October 24, 2025 12:33 PM PDT\n                                    \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          The Most Magical Place on Earth has been anything but for the last 10 days -- TMZ has confirmed yet another death occurred on Walt Disney World property ... the third happening yesterday.\n      \n    \n          Waiting for your permission to load TikTok Post.\n      \n    \n          In a TikTok video posted Thursday morning, you can see a heavy police presence near a taped-off pool at Bay Lake Tower at Disney's Contemporary Resort in Florida. The user wrote ... \"We were told it was a 'medical emergency.' Prayers to the family & those involved!\"\n      \n    \n          Later, the Orange County Medical Examiner's Office in Orlando confirmed the death to TMZ, saying, \"We are still in the process of completing our exams\" on the deceased.\n      \n\n                  \n          \n                          \n                \n                  \n      \n    \n          This marks the third death on the amusement park's property to happen in just over a week, following a reported suicide on October 14 -- also at the Contemporary -- and another body found at Disney's Fort Wilderness Resort and Campground on October 21.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          The apparent suicide victim was identified as 31-year-old Summer Equitz ... while Tuesday's tragedy was reportedly \"a man in his 60s\" who experienced a \"medical episode.\" No foul play is suspected in that instance.\n      \n    \n      \n        \n                    \n                  \n      \n                    Courtesy of Aaron Childs\n          \n    \n          This follows reports of a guest at Disneyland in California who was found unresponsive on the Haunted Mansion ride on October 8 ... paramedics responded, and the woman in her 60s was pronounced dead at a hospital.\n      \n    \n          We've reached out to Disney ... so far, no word back.\n      \n    \n          If you or someone you know is struggling or in crisis, help is available. Call or text 988 or chat 988lifeline.org.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Fairly Legal\n              \n                          \n                News\n              \n                          \n                Disney\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Three Deaths Reported at Disney World Over the Last 10 Days",
      "image": [
        "https://imagez.tmz.com/image/af/16by9/2025/10/24/aff09485135742dd8d4006fe1be4fcb9_xl.jpg"
      ],
      "datePublished": "2025-10-24T15:38:22.000Z",
      "dateModified": "2025-10-24T15:38:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ariana Grande Moved to Tears Getting Voicemail From Sarah Jessica Parker",
    "url": "https://www.tmz.com/2025/10/24/ariana-grande-sarah-jessica-parker-shut-up-evan-podcast/",
    "image": "https://imagez.tmz.com/image/d6/16by9/2025/10/24/d6f6b7c547924f35b3b86367936aed9d_xl.png",
    "tag": "Entertainment",
    "date": "2025-10-24T15:46:05.000Z",
    "description": "\n    \n                    \n                          Ariana Grande\n                          Carrie Bradshaw Knows Who I Am?!😭\n                      ",
    "body": "\n    \n                    \n                          Ariana Grande\n                          Carrie Bradshaw Knows Who I Am?!😭\n                      \n                  \n                        Published October 24, 2025 8:46 AM PDT\n                                                                            \n      \n    \n      \n        \n                    \n                  \n      \n                    Shut Up Evan\n          \n    \n          Even celebs get starstruck ... Ariana Grande practically lost all chill when the one and only Sarah Jessica Parker acknowledged her existence!\n      \n    \n          On the \"Shut Up Evan\" podcast, the \"Wicked\" star got a surprise voicemail from none other than the \"Sex and The City\" queen herself. But before Ariana could even answer SJP’s burning question, she was already tearing up like a total fangirl.\n      \n    \n          Ariana was so shook, she blurted out to Evan, \"She knows who I am!\" ... then pulled it together just enough to dive into how fame looks now versus what she dreamed it’d be as a kid.\n      \n\n          Ariana admitted fame turned out nothing like she imagined ... as a young girl, she was all about focusing on the pure artistry, but now she leans heavy on spiritual discernment to survive the spotlight side of it.\n      \n    \n          But TBH, fame can’t be that bad if SJP knows your name -- full circle moment unlocked. Now somebody cast these two in a movie already!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Sarah Jessica Parker\n              \n                          \n                Ariana Grande\n              \n                          \n                Celebrity News\n              \n                          \n                TV\n              \n                          \n                Sex and the City\n              \n                          \n                Podcasts\n              \n                          \n                Interview\n              \n                          \n                Movies\n              \n                          \n                Music\n              \n                          \n                Fairly Legal\n              \n                          \n                Wicked\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ariana Grande Moved to Tears Getting Voicemail From Sarah Jessica Parker",
      "image": [
        "https://imagez.tmz.com/image/d6/16by9/2025/10/24/d6f6b7c547924f35b3b86367936aed9d_xl.png"
      ],
      "datePublished": "2025-10-24T15:46:05.000Z",
      "dateModified": "2025-10-24T15:46:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]