[
  {
    "title": "C-SPAN Chief Jumps to ‘Ceasefire’ After ‘Crossfire’ in Bid to Create News Programs That Unify, Not Divide",
    "url": "https://variety.com/2025/tv/news/cspan-sam-feist-ceasefire-crossfire-tv-news-1236540678/",
    "image": "https://variety.com/wp-content/uploads/2025/10/Sam-Feist-Headshot-e1759698919674.png?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-06T14:10:00.000Z",
    "description": "<div><p>\n\tEarlier in his career, <a target=\"_blank\" href=\"https://variety.com/t/sam-feist/\">Sam Feist</a> ran a news program called “Crossfire” that t",
    "body": "<div><p>\n\tEarlier in his career, <a target=\"_blank\" href=\"https://variety.com/t/sam-feist/\">Sam Feist</a> ran a news program called “Crossfire” that tried to capture viewership by having liberals and conservatives bicker with one another. Now he hopes to achieve similar results with a similar program that drops the arguments and squabbles.</p>\n<p>\n\tThe new offering is called “<a target=\"_blank\" href=\"https://variety.com/t/ceasefire/\">Ceasefire</a>” and will debut Friday on <a target=\"_blank\" href=\"https://variety.com/t/c-span/\">C-SPAN</a>, the public-affairs cable network that has for nearly half a century provided viewers a fly-on-the-wall presence at major Congressional hearings and other important policy discussions crucial to U.S. government. In an era when the only things that truly attract significant news audience seem to be are on-air conflict and partisan rants, Feist, <a target=\"_blank\" href=\"https://variety.com/2024/tv/news/sam-feist-cspan-cnn-ceo-1236002640/\">who was named the organization’s CEO last year</a>, thinks there is new business to be found in programming that avoids such stuff.\n\t</p>\n<p>\n\t“Clearly our politics has us divided, and we’ve sorted ourselves into these media echo chambers — in many ways, to red news and blue news. I think that’s terrible for the country, says Feist during a recent interview. “C-SPAN is defying that, to some extent.”\n</p>\n<p>\n\t“Ceasefire” will, each week, feature Republicans and Democrats trying to find common ground, not necessarily getting their backs up about the hill upon which they wish to die. The show is hosted by Dasha Burns of Politico – a younger moderator than many viewers might expect – and will in its first week bring on former U.S. Vice President Mike Pence and former Chicago mayor and White House Chief of Staff Rahm Emmanuel. In a separate conversation, Sean Spicer, former White House Press Secretary under President Trump, will hold forth with Faiz Shakir, a senior advisor to Senator Bernie Sanders.\n\t</p>\n<p>\n\tThe idea for “Ceasefire” has been rattling around Feist’s head, the executive says, since he was working on CNN’s “Crossfire,” a cable-news institution that had conservatives like Tucker Carlson, Bob Novak and Pat Buchanan square off against liberals such as Bill Press, Michael Kinsley and Tom Braden. “What it did not do was look for common ground or compromise and show America that Republicans and Democrats can be friends and get along,” says Feist. He credits Kinsley, who broached the concept with Feist as he stepped away from the show, with having the original notion of helping differing sides find a mutual path forward</p>\n<p>\n\tExecutives at C-SPAN believe there is demand for such content. A study of C-SPAN viewership by Magid, the long-serving media-sector consultant, found that 27% of its audience was liberal while 28% was conservative, with 41% identifying as moderate. With left and right watching in equal measure, says Feist, “that gives us a really unique opportunity to speak to Republicans and Democrats at the same time in a way that isn’t happening anywhere else.”</p>\n<p>\n\tOthers have tried — and continue to do so. CNN runs a 10 p.m. program called “News Night” that has panelists from different political backgrounds weigh in on the news of the day. “Americans with different perspectives aren’t talking to each other, but here they do,” viewers are told when the show comes on each evening. <a target=\"_blank\" href=\"https://variety.com/2024/tv/news/cnn-abby-phillip-newsnight-primetime-1236148514/\">The discussion usually ends up being more “Crossfire” than “Crossfire” ever was</a>. Fox Corp. makes a point of telling investors that its Fox News Channel reaches more liberals and independents than any of its competitors.</p>\n<p>\n\tC-SPAN, however, has new impetus to try harder. The network recently struck new streaming carriage deals with Google’s YouTube TV and Disney’s live-TV service via Hulu. The pacts could prove to be a lifeline to C-SPAN, which for decades has subsisted on the fees it collects from various cable and satellite operators in exchange for carrying the service. With more people cutting their linear-TV subscriptions in favor of streaming, C-SPAN was once received in 100 million homes, according to a person familiar with the matter. In 2025, that number stands at less than 50 million, Meanwhile, its monthly fee per subscriber has increased only slightly over the decades, this person says, to 7.25 cents from 6.25. Over a year, carriers get to run three different C-SPAN channels for just around 87 cents per year. The company accepts no government funding and runs no advertising on TV — only a little bit on its web site and accompanying some of the clips it makes available on YouTube.\n\t</p>\n<p>\n\tC-SPAN in recent months made a concerted effort to get carriage from Disney and Google, says Feist. “It was an early priority for me,” he says, and not just because of the revenue. “We had to be seen in all of these houses that used to have us, but don’t now,” and many of those customers had moved to YouTube TV or Hulu + Live, he says.</p>\n<p>\n\tAsking media companies for money in exchange for carrying the nitty-gritty meetings of government at a time of tumult in the sector is no easy task. But C-SPAN made the point to the streamers that their subscription services would benefit from carrying live, newsy programming, which would help to keep audiences on their platforms. The fact that the news cycle is never-ending during President Trump’s second term doesn’t hurt. And executives also made the point to their potential new partners that their support would be noticed in the halls of the U.S. Senate and House –- just as the backing of companies like Comcast, Charter and traditional cable and satellite companies had been for years. Indeed, Disney’s and Google’s contributions will be noted in a new C-SPAN effort to celebrate the coming 250<sup>th</sup> birthday of the United States.</p>\n<p>\n\tMeanwhile, C-SPAN has under Feist embraced new techniques. The network has introduced new graphics and even recently featured a “countdown clock” to the start of the current government shutdown – something the company, not known for flashy promotion, might not have done under previous managers.</p>\n<p>\n\tDisney did not respond to a query seeking comment while Google declined to make executives available for comment.</p>\n<p>\n\tBut at least one lawmaker appreciates the new arrangements. “C-SPAN has connected Congress with the American people for decades — providing the public an opportunity to see their government at work on the Senate and House floor and in committee meetings. Access to this live coverage on all platforms, including streaming services, is essential to keeping the American people informed and engaged in our democracy,” says Senator Amy Klobuchar in a statement provided via email. She and Senator Chuck Grassley earlier this year led an effort to pass a resolution urging TV providers to carry C-SPAN’s networks. “I’m glad YouTube and Hulu agreed to provide this vital insight service to their customers, and I continue to urge all platforms to do the same,” she adds.\n\t</p>\n<p>\n\tLeading an independent cable outlet in the streaming era may seem like a thankless job, but Feist has over decades become known for a “can-do” attitude, according to people who know him. During his time at CNN, he rose from working as a freelance producer to running the network’s Washington coverage and had a hand in signature programs including “The Situation Room” and “State of the Union.” His knowledge of the way Washington works and how to get to newsmakers was well-established, according to one former colleague, as was his enthusiasm for getting things done.</p>\n<p>\n\tHe has other plans. Feist would like to do more with “Washington Journal,” the signature C-SPAN program that takes calls from viewers from all political backgrounds. Feist remembers when Larry King might interact with callers at CNN, and notes that “on TV, we don’t do that anymore.” He also points to C-SPAN’s coverage of books and authors, with a new program, “America’s Book Club,” which will be hosted by David Rubenstein, the philanthropist and former Kennedy Center chair, who will talk to authors including John Grisham, Walter Isaacson and Stacy Schiff not necessarily about a new book, but about their larger bodies of work and bigger issues.</p>\n<p>\n\tAnd while C-SPAN’s academic tilt has been lampooned for years on “Saturday Night Live” and other shows, Feist seems to believe there’s nothing wrong in leaning into the things that make the company different. “We don’t edit these events. We don’t offer commentary around these events,” he says of the network’s coverage. “Our mission is to put it out there and let the voters decide for themselves who is right and who is wrong, who has the better argument and who doesn’t.” A bigger percentage of streaming audiences might get a chance to determine if C-SPAN’s case for itself is worth more consideration.</p>\n</div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "C-SPAN Chief Jumps to ‘Ceasefire’ After ‘Crossfire’ in Bid to Create News Programs That Unify, Not Divide",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/Sam-Feist-Headshot-e1759698919674.png?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-06T14:10:00.000Z",
      "dateModified": "2025-10-06T14:10:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Ozzy: No Escape From Now’ Director on the Rock Icon Dying While Doc Was in Edit, Why the Osbourne Family ‘Wanted Us to Keep Going’ and Their One Request for the Film’s Ending",
    "url": "https://variety.com/2025/film/global/ozzy-no-escape-from-now-director-osbourne-dying-film-edit-1236540669/",
    "image": "https://variety.com/wp-content/uploads/2025/10/OZZY-NEFN-UHDMMOV177_6-SCREEN-GRAB.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-06T14:00:00.000Z",
    "description": "<div><p>\n\t“Ozzy: No Escape From Now” — released on Paramount+ on Oct. 6 (alongside several special fan screenings) — wasn’t supposed to be a posthumou",
    "body": "<div><p>\n\t“Ozzy: No Escape From Now” — released on Paramount+ on Oct. 6 (alongside several special fan screenings) — wasn’t supposed to be a posthumous feature documentary looking back at the final years of <a target=\"_blank\" href=\"https://variety.com/t/ozzy-osbourne/\">Ozzy Osbourne</a>‘s life. But that’s what it tragically turned out to be after the rock icon passed away in July, when the film was still in the edit.</p>\n<p>\n\tBrit director Tania Alexander, with the consent and involvement of <a target=\"_blank\" href=\"https://variety.com/t/sharon-osbourne/\">Sharon Osbourne</a> (who exec produces), had set out to make a film exploring the aftermath of Ozzy’s life-changing fall in 2019, the toll it took it on him, his mental health and his family, alongside his desperate efforts to get back on stage and the emotional devastation at having to cancel his farewell tour. \n\t</p>\n<p>\n\tAmid the pain, “No Escape From Now” also manages to showcases the comfort Ozzy found in making music once more — particularly for what would be his final studio album “Patient Number 9” — and his determination to say one last goodbye to his fans, culminating in his triumphant farewell gig in his home city of Birmingham (surrounded by some of the biggest rock stars on the planet — most of them extremely emotional about honoring their hero).\n</p>\n<p>\n\tWhen Ozzy passed away less than three weeks later, Alexander was still deep in the edit on the film. But as she explains, not only did she keep going — at the full request of the family — but, barring one addition at the very end, she didn’t change a second.</p>\n\t<h5>\n\t\tHow did this film come your way?\t</h5>\n<p>\n\tPhil [Alexander, producer and former editor of Kerrang! magazine] and I have a very long-standing relationship with the Osbornes. We knew what had happened to Ozzy, and we knew around the time he was doing “Patient Number Nine.” We had a conversation with Sharon. We wanted to tell the story of what had happened to him since that fall, which we knew had really impacted him and the family, and she said: Well, I really want it told, but I want it told as it is, as harsh as it is, I don’t want any punches pulled. The one thing that you know about the Osbournes is they are really honest. There’s no spin involved. Sharon will let you completely have your freedom, but we always wanted to prefix that with: this is what we want to do. And if there were going to be any red flags, she would have flagged them.\n\t</p>\n\t<h5>\n\t\tSo did she effectively give you access all areas?\t</h5>\n<p>\n\tWhen you’ve got somebody as ill as Ozzy was, you just need to have things slightly more planned in the sense of, ‘what are your intentions’? And Sharon never blocked anything and was really trusting. We went into it knowing that there might be some ups and downs when it came to being able to film because he was going through operations, or he was going through bad patches. So we just had to be flexible. But she said: just tell the truth. We’ve been through a terrible time, so we want it reflected.</p>\n\t<h5>\n\t\tAs you say, you’re dealing with someone who’s really ill and going through up and downs. Were there ever any moments where it felt too intrusive or where it was too much for him to continue?\t</h5>\n<p>\n\tThere were moments you see in the opening where he sits in his chair and he’s quite uncomfortable, because of the Parkinson’s but also because he had horrendous back pain continually. I was always very aware of his cushions. So we were constantly asking him, do you want to stop? And he’s the kind of person who sits down and goes, how long is this going to take? And then, honestly, about 20 minutes in he’d be really enjoying chatting about himself and say, have you got any more questions? You could see that it was part of his day and almost something enjoyable to do. </p>\n\t<h5>\n\t\tThe doc builds up to Ozzy’s final farewell show in Birmingham and whether or not he’ll be able to appear. But this gig hadn’t even been discussed when you started.\t</h5>\n<p>\n\tWhich is crazy. When we first started filming with him, he’d had to postpone his world tour. So when we were filming, it was always about, will he be able to do the tour? Can he get fit to do the tour? And then he does the Commonwealth Games and comes back with all guns blazing, saying, I’m going to do the tour. And then the rug’s pulled again. So up until that point, we were seeing if he could get back on stage to do the tour. And then it literally happened in that chat. He’d been saying to Sharon, I feel I haven’t said thank you and goodbye, and if I can’t do a tour, I need to do something. And so she said what about doing this one last show. We didn’t start off with that being the end. Our pitch was a story about one man’s battle to get back on stage one last time. But that’s what it became. And the determination I saw. He had sepsis at the end of April, and I think had 72 days before he was meant to be on stage. The determination was phenomenal.\n\t</p>\n\t<h5>\n\t\tI loved the scenes with the other major rockers getting together. The warmth and love they have towards Ozzy was so sweet to see\t</h5>\n<p>\n\tThere is genuine respect and love. A lot of those guys will reflect back to when they were kids and how he changed their lives. Billy Corgan got really upset. James Hetfield was really emotional. He means so much in so many different ways. It was an extraordinary moment for me, seeing Ozzy watch those really big artists singing his songs in front of him. And they were genuinely nervous, you felt that. But I did think they said some really nice things, and they all really meant it.</p>\n\t<h5>\n\t\tThis was made as a living doc. What stage were you at when Ozzy passed away?\t</h5>\n<p>\n\tWe were in the edit and had another six weeks to go. We’d cut 90 minutes and were doing the last 30 — the build up to the farewell gig. After he died, there was a part of me that thought, if look back on the 90 minute now it’s going to look different through a new lens. So I watched it back and didn’t change it — I just thought, no, it’s the same film I cut before. And it ends in exactly the same way we always wanted — where it cuts to black. Apart from we we added the funeral procession at the end at the request of the family.</p>\n\t<h5>\n\t\tWhat conversations were had about the doc with the family, who were obviously in mourning at the time. Was there ever a suggestion of not keeping going with it?\t</h5>\n<p>\n\tThey wanted us to keep going. Sharon has always been really behind it. She’s always been really supportive. But there was just a request from the family that we added the cortege montage at the end. So we did. But otherwise it didn’t change, and it ended where it was meant to end originally.</p>\n\t<h5>\n\t\tAnd no other element of the film changed at all?\t</h5>\n<p>\n\tNothing at all, because he still made it onto the stage. It was heartbreaking looking at the scene of him and Sharon talking about how he could hang up the mic and then ‘it’s just us, pottering around the garden.’ That was really hard to cut. Me and my editor cried a bit at times.</p>\n</div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Ozzy: No Escape From Now’ Director on the Rock Icon Dying While Doc Was in Edit, Why the Osbourne Family ‘Wanted Us to Keep Going’ and Their One Request for the Film’s Ending",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/OZZY-NEFN-UHDMMOV177_6-SCREEN-GRAB.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-06T14:00:00.000Z",
      "dateModified": "2025-10-06T14:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘You Got Gold: A Celebration of John Prine’ Tribute Concert Doc to Be Released by Abramorama",
    "url": "https://variety.com/2025/music/news/john-prine-concert-doc-abramorama-1236540691/",
    "image": "https://variety.com/wp-content/uploads/2025/10/john_prine6-e1759702139904.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-06T14:00:00.000Z",
    "description": "<div><p>\n\tAbramorama announced that it has acquired North American theatrical rights to “You Got Gold – A <a target=\"_blank\" href=\"https://variety.com",
    "body": "<div><p>\n\tAbramorama announced that it has acquired North American theatrical rights to “You Got Gold – A <a target=\"_blank\" href=\"https://variety.com/2020/music/news/john-prine-dead-dies-singer-coronavirus-1234574129/\">Celebration of John Prine,</a>” a documentary from the tribute concert for the legendary singer-songwriter starring Brandi Carlile, Kacey Musgraves, Tyler Childers, the War and Treaty, Lucinda Williams, Steve Earle, Bonnie Raitt, Dwight Yoakam, Jason Isbell, Kurt Vile, Lyle Lovett, Allison Russell & JT Nero, Valerie June, Nathaniel Rateliff, The Milk Carton Kids, Swamp Dogg, I’m With Her and the Grateful Dead’s Bob Weir.\n\t</p>\n<p>\n\tThe show took place at Nashville’s legendary Ryman Auditorium; the documentary, which features exclusive interviews and performances with the above artists, is produced by RadicalMedia and Oh Boy Pictures production.\n</p>\n<p>\n\tAbramorama will release the doc in theaters beginning with a week-long engagement at the Quad in New York on November 28, followed by bookings across North America and in select North American territories; it will have its Nashville theatrical premiere on October 9 at Nashville’s Belcourt Theater. This will be followed by another all-star concert at the Ryman on October 10, the fourth and final concert in the memorial series. The film premiered at the Nashville Film Festival to a sold-out audience last month.</p>\n<p>\n\t“You Got Gold” began as a memorial concert series organized by Fiona Whelan Prine to celebrate her late husband after he passed from COVID-related complications in April 2020. The film is produced by Fiona Whelan Prine, directed by Michael John Warren, and executive produced by Jon Kamen, Meredith Bennett, Jack Prine, Jody Whelan, Eileen Tilson and Robert Meitus.\n\t</p>\n<p>\n\t“When John passed, we couldn’t mourn together in the way we and his community needed to,” said Fiona Whelan Prine. “This film documents that long-awaited moment when we finally came together at the Ryman—John’s favorite stage—to honor him with his songs, music, stories and love. I’m grateful to everyone who shared their talent and their hearts to celebrate John’s legacy, and I’m thrilled that audiences everywhere will now have the chance to experience this special night.”</p>\n<p>\n\t“<a target=\"_blank\" href=\"https://variety.com/t/john-prine/\">John Prine</a> was one of America’s most beloved storytellers,” said Richard Abramowitz, Founder and Karol Martesko-Fenster, CEO of Abramorama. “And this film captures something truly special—the moment when a community came together to celebrate an irreplaceable voice. We’re honored to be bringing this superb concert film to audiences in the most meaningful place they can experience it – in theaters.”</p>\n<p>\n\tThe Belcourt Theater will also host screenings throughout the remainder of the year and into 2026 for Prine’s dedicated fanbase. Oh Boy Records plans premium digital releases of Prine’s music, as well as other rarities and collectibles to be announced.</p>\n</div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘You Got Gold: A Celebration of John Prine’ Tribute Concert Doc to Be Released by Abramorama",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/john_prine6-e1759702139904.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-06T14:00:00.000Z",
      "dateModified": "2025-10-06T14:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Wayne Gretzky Re-Ups for NHL Coverage at Warner Bros. Discovery",
    "url": "https://variety.com/2025/tv/news/wayne-gretzky-renews-contract-nhl-warner-bros-discovery-1236540673/",
    "image": "https://variety.com/wp-content/uploads/2025/10/1560200_0173_CC.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-06T13:45:00.000Z",
    "description": "<div><p>\n\tHockey players aren’t known for being shy about fighting over different plays on the ice, but <a target=\"_blank\" href=\"https://variety.com/t",
    "body": "<div><p>\n\tHockey players aren’t known for being shy about fighting over different plays on the ice, but <a target=\"_blank\" href=\"https://variety.com/t/wayne-gretzky/\">Wayne Gretzky</a> and his current compatriots have learned not to come to blows.</p>\n<p>\n\t“We might disagree about a play or a player or a team, but there’s no animosity,” says Gretzky about “<a target=\"_blank\" href=\"https://variety.com/t/nhl/\">NHL</a> on TNT,” the sports program for which he recently signed a deal extension. “Nobody tries to take over the microphone or take over the camera. We are a team, just like a hockey team.”\n\t</p>\n<p>\n\tGretzky re-ups with <a target=\"_blank\" href=\"https://variety.com/t/warner-bros-discovery/\">Warner Bros. Discovery</a>’s <a target=\"_blank\" href=\"https://variety.com/t/tnt-sports/\">TNT Sports</a> at an interesting moment. The company’s signature sports program, “Inside the NBA,” is moving to Disney’s ESPN in the new season, though Warner will continue to produce it. That means Warner may be hoping to build a new franchise with the studio programs<a target=\"_blank\" href=\"https://variety.com/2021/tv/news/nhl-warnermedia-rights-deal-hbo-max-1234961331/\"> it has created around its NHL and MLB rights.</a>\n</p>\n<p>\n\t“Listen, we are not trying to reinvent the wheel,” says Gretzky, who will start his fifth season with Warner. “We are largely riding the coattails of what those guys on ‘Inside the NBA’ have done so phenomenally. They know the game, but they are positive, and their personalities come through, even if they don’t always agree.’</p>\n<p>\n\tWarner last renewed Gretzky’s contract — along with those of his TNT colleagues, Wayne Gretzky, Paul Bissonnette, Anson Carter and Henrik Lundqvist in 2023. All four work with studio host Liam McHugh, to whom Gretzky believes credit is due. “I don’t think the show would exist” without him, he says. “He is a fan. He loves sports. He loves hockey and he truly wants the players to be successful.”\n\t</p>\n<p>\n\tThe new NHL season at Warner’s TNT Sports will include 72 regular season games on Tuesdays and Wednesdays throughout the season, with games on Sundays starting in Spring 2026.  The season starts Wednesday, Oct. 8 with the Boston Bruins at Washington Capitals at 7:30 p.m., followed by LA Kings at Vegas Golden Knights at 10 p.m.</p>\n<p>\n\t The schedule also includes the 2026 Discover NHL Winter Classic, with the reigning Stanley Cup Champion Florida Panthers hosting the New York Rangers at LoanDepot Park in Miami.</p>\n<p>\n\tGretzky finds broadcasting can be almost as arduous as playing the sport itself. “It’s a lot more preparation than people think,” with knowledge of players and their potential maneuvers being critical. “It’s truly something you need to have,” Gretzky says.</p>\n</div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Wayne Gretzky Re-Ups for NHL Coverage at Warner Bros. Discovery",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/1560200_0173_CC.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-06T13:45:00.000Z",
      "dateModified": "2025-10-06T13:45:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sega’s ‘Sonic the Hedgehog’ Sets Multiyear Licensing Deal With International Olympic Committee",
    "url": "https://variety.com/2025/gaming/news/sonic-the-hedgehog-olympics-licensing-deal-1236538239/",
    "image": "https://variety.com/wp-content/uploads/2025/10/image002.jpg?crop=0px%2C236px%2C3506px%2C1974px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-10-06T13:00:00.000Z",
    "description": "<div><p>\n\t<a target=\"_blank\" href=\"https://variety.com/t/sega/\">Sega</a> Corporation and the International Olympic Committee have joined forces for a ",
    "body": "<div><p>\n\t<a target=\"_blank\" href=\"https://variety.com/t/sega/\">Sega</a> Corporation and the International Olympic Committee have joined forces for a new multi-year agreement to celebrate the legacies of “<a target=\"_blank\" href=\"https://variety.com/t/sonic-the-hedgehog/\">Sonic the Hedgehog</a>” and the Olympic brand.</p>\n<p>\n\tA first look at the forthcoming “Five Rings” collaboration is available now and features the Olympic rings with a Sonic the Hedgehog spin. The custom art highlights the connection with Sonic and the core Olympic values of excellence, respect and friendship. \n\t</p>\n<p>\n\tThe next Winter <a target=\"_blank\" href=\"https://variety.com/t/olympics/\">Olympics</a> will air in February from Milan and Cortina d’Ampezzo, and the next Summer games are set for 2028 in Los Angeles. The Olympics air on NBC and Peacock in the U.S.\n</p>\n<p>\n\t“We’re committed to fostering respectful and inclusive communities across the globe at SEGA,” Shuji Utsumi, president and COO, representative director of Sega Corporation, said. “Partnering with the International Olympic Committee allows us to bring those values to the forefront, especially with the Five Rings program, and celebrate the innovative and diverse spirit both of these brands promote.” </p>\n<p>\n\tSega Corporation and the International Olympic Committee’s partnership will explore opportunities to license the designs for select merchandise collaborations, inviting like-minded brands to join in this unique fusion of sports and video games. </p>\n<p>\n\tThe companies are now seeking partners for a full merchandise collection to launch in 2026. </p>\n<p>\n\t“The IOC is delighted to unite with SEGA for this exciting new chapter for the Olympic brand, embracing the power of storytelling and innovation to engage audiences globally,” Elisabeth Allaman, deputy managing director of IOC TMS, said. “By combining the universally recognized Olympic rings with the beloved character of Sonic, we are creating fresh opportunities for fans of all ages to experience the spirit of sport and play in new and memorable ways. </p>\n</div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sega’s ‘Sonic the Hedgehog’ Sets Multiyear Licensing Deal With International Olympic Committee",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/image002.jpg?crop=0px%2C236px%2C3506px%2C1974px&resize=1000%2C563"
      ],
      "datePublished": "2025-10-06T13:00:00.000Z",
      "dateModified": "2025-10-06T13:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Studiocanal Boards Quentin Dupieux’s Paris-Set Film ‘Full Phil,’ Starring Woody Harrelson and Kristen Stewart as Father and Daughter (EXCLUSIVE)",
    "url": "https://variety.com/2025/film/global/quentin-dupieux-full-phil-kristen-stewart-studiocanal-1236540859/",
    "image": "https://variety.com/wp-content/uploads/2025/10/kristen-woody.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-06T13:48:03.000Z",
    "description": "<div><p>\n\tStudiocanal is reteaming with French producer <a target=\"_blank\" href=\"https://variety.com/t/hugo-selignac/\">Hugo Selignac</a> for <a target",
    "body": "<div><p>\n\tStudiocanal is reteaming with French producer <a target=\"_blank\" href=\"https://variety.com/t/hugo-selignac/\">Hugo Selignac</a> for <a target=\"_blank\" href=\"https://variety.com/t/quentin-dupieux/\">Quentin Dupieux</a>‘s star-studded next movie, “Full Phil,” which brings together <a target=\"_blank\" href=\"https://variety.com/t/kristen-stewart/\">Kristen Stewart</a> and <a target=\"_blank\" href=\"https://variety.com/t/woody-harrelson/\">Woody Harrelson</a> alongside Emma Mackey and Charlotte Le Bon.</p>\n<p>\n\tStudiocanal will be handling international sales on the English-language film, which will be distributed in France by Diaphana and has been pre-bought by Canal+.</p>\n<p>\n\tThe hot project might have a “White Lotus” vibe. Harrelson stars as Philip Doom, a wealthy American industrialist who attempts to reconnect with his daughter Madeleine (played by Stewart) during a luxurious trip to Paris. “Unfortunately, French cuisine, a 1950s horror film and an intrusive hotel employee disrupt the smooth running of their stay,” reads the synopsis. Tim Heidecker and Nassim Lyes complete the cast.\n\t</p>\n<p>\n\tWhile the film features American actors, it’s filming entirely in Paris with Dupieux’s regular French crew. “Full Phil” is not his English-language debut; he previously made “Rubber,” which lensed in California with a cast including Stephen Spinella.\n</p>\n<p>\n\tThe prolific and iconoclastic filmmaker — who was previously a successful French electronic musician and record producer — is known for his absurdist and quirky sense of humor, as well as his boldness that stands out in the French cinema landscape. His 2024 film “The Second Act,” which world premiered on the opening night of Cannes Film Festival, delivered a hilarious stab at a French actors (played by Lea Seydoux, Vincent Lindon and Louis Garrel) adjusting to the #MeToo era while filming a romantic comedy. The movie ended up being a commercial success, selling over 500,000 tickets in French theaters.\n\t</p>\n<p>\n\t“It’s wild — Quentin’s films are extremely popular with the coolest American actors,” said Selignac, whose company Chi-Fou-Mi is part of Mediawan. “When we send them Quentin’s films, they’re struck, because when you look at American comedy today, it’s a bit dead.”</p>\n<p>\n\tSelignac said that “‘The Second Act,’ in particular, generated a lot of excitement. Suddenly, American actors said to themselves, ‘Wait, can we still make films like this? Can we still laugh at everything? Can we still make jokes like this about women, men, minorities?'”</p>\n<p>\n\t“Full Phil” is the eighth Dupieux film produced by Selignac in six years, following “Mandibules,” “Smoking Causes Coughing,” “Yannick,” “Daaaaalí!,” “The Second Act”, “The Piano Accident” and “Signaux.”</p>\n<p>\n\tDupieux’s films always feature prestigious French casts and have become a reference for young cinephiles, performing well at the local box office and selling around the world. Selignac attributes the filmmaker’s acclaim to his “talent for writing extraordinary roles and his exceptional dialogue.”</p>\n<p>\n\tSelignac has had a win-win partnership with Studiocanal. The company has backed 13 films produced by him, including Gilles Lellouche’s “Beating Hearts” (which grossed $36 million in France) and Cedric Jimenez’s thrillers “The Stronghold” and “November.” They have also partnered on the upcoming <a target=\"_blank\" href=\"https://variety.com/2025/film/global/hugo-selignac-venice-dog-51-cedric-jimenez-dupieux-carax-1236510190/\">“Dog 51</a>,” which world premiered on the closing night of Venice Film Festival and is being theatrically released by Studiocanal on Oct. 15.</p>\n</div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Studiocanal Boards Quentin Dupieux’s Paris-Set Film ‘Full Phil,’ Starring Woody Harrelson and Kristen Stewart as Father and Daughter (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/kristen-woody.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-06T13:48:03.000Z",
      "dateModified": "2025-10-06T13:48:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Projeto Paradiso and Embratur Launch ScreenBrasil Initiative to Promote the International Distribution of Brazilian Films (EXCLUSIVE)",
    "url": "https://variety.com/2025/film/global/projeto-paradiso-embratur-screenbrasil-1236540689/",
    "image": "https://variety.com/wp-content/uploads/2025/10/VARIETY-SIZING-19.png?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-06T13:15:00.000Z",
    "description": "<div><p>\n\tRIO DE JANEIRO, <a target=\"_blank\" href=\"https://variety.com/t/brazil/\">Brazil</a> – <a target=\"_blank\" href=\"https://variety.com/t/projeto-",
    "body": "<div><p>\n\tRIO DE JANEIRO, <a target=\"_blank\" href=\"https://variety.com/t/brazil/\">Brazil</a> – <a target=\"_blank\" href=\"https://variety.com/t/projeto-paradiso/\">Projeto Paradiso</a>, a philanthropic initiative supporting the Brazilian film sector from the Olga Rabinovich Institute, and <a target=\"_blank\" href=\"https://variety.com/t/embratur/\">Embratur</a>, the Brazilian Tourism Board, are joining forces to launch an initiative to promote the international distribution of films made in the leading South American country. The program, titled ScreenBrasil with a pointed “s,” will offer support to the distribution of three national feature fiction films produced in 2024 and 2025. \n\t</p>\n<p>\n\tThe initiative, which aims to strengthen the country’s image abroad and attract foreign industry by promoting the Brazilian film industry, is the result of a Technical and Financial Cooperation Agreement between the two organizations. The announcement of the partnership will take place during the <a target=\"_blank\" href=\"https://variety.com/t/rio-film-festival/\">Rio Film Festival</a>’s industry arm RioMarket on Oct. 6. On Oct. 22, the regulations will be presented in further detail during the opening of the Encontro de Ideias at the São Paulo International Film Festival. \n</p>\n<p>\n\tThe announcement of the selected films is scheduled for April 2026, following the submission period that runs from January to March. The selected films will each receive US$15,000 for international distribution. These funds can be used for subtitling, international marketing, press relations, and other promotional and distribution initiatives. A specialized technical committee will be assembled to pick the participating films.</p>\n<p>\n\tEmbratur president Marcelo Freixo pointed out ScreenBrasil is “part of the Agency’s strategy of acknowledging the audiovisual industry as a tool for international tourism promotion.”\n\t</p>\n<p>\n\t“This project is the culmination of a strategy initiated during our tenure at Embratur, which recognizes the audiovisual industry as a strategic vector for promoting Brazil internationally,” he added. “We understand that films, series, documentaries and other audiovisual products can work as powerful showcases of the best our country has to offer and spark interest in experiencing Brazil in person.”</p>\n<p>\n\tFreixo pointed out that the initiative “seeks to reach international audiences with works that highlight our quality and cinematic talent and portray our stories, diversity, and creativity,” emphasizing how Brazil is “currently experiencing a period of great visibility for its cinema abroad.”</p>\n<p>\n\t“We also have examples of countries such as Spain, Portuga  and South Korea, that have established the audiovisual industry as a key strategic sector to promote their soft power. More than that, studies show that approximately 80 million tourists from around the world choose destinations influenced by audiovisual productions,” added the Embratur president.</p>\n<p>\n\t<a target=\"_blank\" href=\"https://variety.com/2025/film/global/eduardo-paes-rio-de-janeiro-rio-film-festival-riofilme-1236537272/\">Ahead of this year’s Rio Film Festival kick-off, <em>Variety </em>spoke with Rio Mayor Eduardo Paes, who echoed Freixo in praising Brazil’s great moment for cinema while pointing out how Rio is currently one of the most popular cities in the world for film.</a> According to the Rio Film Commission, Rio hosted a record 8,782 days of filming for 505 productions in 2024. Of the 505, it said, 27 were international productions, accounting for 748 filming days, a 100% uptick over 2023. This year’s Rio Film Festival also features a record-breaking number of Brazilian films, a whopping 124 productions, including features and shorts, in addition to the premieres of four TV series.</p>\n<p>\n\tProjeto Paradiso has made investing in international exhibition a core strategic priority. “Since 2019, we’ve offered support to the presence of more than 150 films and projects in major festivals and international markets through the Brasil no Mundo (Brazil in the World) program,” said Rachel do Valle, program director at the philanthropic institution. “Now, we’re taking a step forward, seeking to broaden the release windows for Brazilian productions around the world. Our goal is to expand the possibilities for international audiences to connect with Brazilian cinema, thus strengthening our industry.”</p>\n</div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Projeto Paradiso and Embratur Launch ScreenBrasil Initiative to Promote the International Distribution of Brazilian Films (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/VARIETY-SIZING-19.png?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-06T13:15:00.000Z",
      "dateModified": "2025-10-06T13:15:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jane Goodall’s Most Recent Written Work, ‘Book of Hope,’ Returns to Bestseller Lists Following Death",
    "url": "https://variety.com/2025/shopping/news/jane-goodalls-book-of-hope-buy-online-1236540698/",
    "image": "https://variety.com/wp-content/uploads/2025/10/jane-goodall-book-of-hope-buy-online.png?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-06T13:00:00.000Z",
    "description": "<div><p>\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.</p>",
    "body": "<div><p>\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.</p>\n<p>\n\t<a target=\"_blank\" href=\"https://variety.com/t/jane-goodall/\">Jane Goodall</a>‘s “The Book of Hope” has returned to the top of bestseller lists following the <a target=\"_blank\" href=\"https://variety.com/2025/film/news/jane-goodall-dead-chimpanzees-1236536481/\">chimpanzee expert’s death last week. </a></p>\n<p>\n\tHer final major work, <a href=\"https://clicks.trx-hub.com/xid/pmc_0aaa4_variety?q=https%3A%2F%2Fwww.amazon.com%2Fdp%2F1250784093%3Ftag%3Dvariety0e8-20%26linkCode%3Dogi%26th%3D1%26psc%3D1%26language%3Den_US%26asc_source%3Dweb%26asc_campaign%3Dweb%26asc_refurl%3Dhttps%253A%252F%252Fvariety.com%252F2025%252Fshopping%252Fnews%252Fjane-goodalls-book-of-hope-buy-online-1236540698%252F&p=https%3A%2F%2Fvariety.com%2F2025%2Fshopping%2Fnews%2Fjane-goodalls-book-of-hope-buy-online-1236540698%2F&ref=pmcTrackonomicsReferrer&event_type=click\" target=\"_blank\">“The Book of Hope: A Survival Guide for Trying Times,”</a> co-written by Douglas Abrams, was originally published in 2021 and conceived as a dialogue on how to maintain faith in humanity and the planet amid escalating crises — a mix of memoir, philosophy and moral guidance that feels especially poignant in the wake of her passing.\n\t</p>\n<div>\n\t\t<div>\n<p><a href=\"https://clicks.trx-hub.com/xid/pmc_0aaa4_variety?q=https%3A%2F%2Fwww.amazon.com%2Fdp%2F1250784093%3Ftag%3Dvariety0e8-20%26linkCode%3Dogi%26th%3D1%26psc%3D1%26language%3Den_US%26asc_source%3Dweb%26asc_campaign%3Dweb%26asc_refurl%3Dhttps%253A%252F%252Fvariety.com%252F2025%252Fshopping%252Fnews%252Fjane-goodalls-book-of-hope-buy-online-1236540698%252F&p=https%3A%2F%2Fvariety.com%2F2025%2Fshopping%2Fnews%2Fjane-goodalls-book-of-hope-buy-online-1236540698%2F&ref=pmcTrackonomicsReferrer&event_type=click\" target=\"_blank\">\n\t\t\t\t\t\t<img srcset=\"https://variety.com/wp-content/uploads/2025/10/image.jpeg 984w, https://variety.com/wp-content/uploads/2025/10/image.jpeg?resize=98,150 98w, https://variety.com/wp-content/uploads/2025/10/image.jpeg?resize=197,300 197w\" src=\"https://variety.com/wp-content/uploads/2025/10/image.jpeg?w=672\" alt=\"Jane Goodall 'Book of Hope': Buy Online\" />\n\t\t\t</a>\n\t</p>\n<figcaption>\n\t</figcaption>\n\t\t\t\t\t</div>\n\t\t<div>\n<p>\n\t\t\t\t\t\t\t\t\t\tNO. 1 BESTSELLER\t\t\t\t\t\t</p>\n<h3 id=\"c-title-68e3cfee7e9829.24341461\">\n\t\t\t\t\tThe Book of Hope: A Survival Guide for Trying Times (Global Icons Series)\t\t\n</h3>\n\t\t</div>\n\t</div>\n<p>\n\tStructured as a dialogue between Goodall and Abrams, the book explores what she identifies as the four pillars of hope: human intellect, the resilience of nature, the power of young people and the indomitable human spirit. Rather than offering abstract theory, it’s grounded in personal stories — from her early fieldwork with chimpanzees in Gombe to her encounters with communities fighting deforestation and climate change across the globe. \n</p>\n<p>\n\tGoodall was a protegé of the noted anthropologist Louis S.B Leakey. Her 1960 discovery that chimpanzees were able to make and use tools revolutionized the field of primatology.</p>\n<p>\n\tShe was the subject of more than 40 documentaries from National Geographic, Animal Planet, Disneynature and more. Most recently, the 2023 Imax film “Jane Goodall: Reasons for Hope” explored her habitat restoration projects, while Netflix’s “Famous Last Words” revealed its first episode, featuring an interview with Goodall, last week following her death. </p>\n<p>\n\t“Jane Goodall was fearless in all things,” the show’s producer Brad Falchuk said in a statement. “She deeply loved humanity and the natural world. It was clear to me in our conversation that she was approaching her final adventure with the same fearlessness, hope, humor and joy that she approached everything else in life. She was one of the world’s greatest and most beloved champions of good.”\n\t</p>\n<p>\n\tPurchase Goodall’s most recent written work, “Book of Hope,” <a href=\"https://clicks.trx-hub.com/xid/pmc_0aaa4_variety?q=https%3A%2F%2Fwww.amazon.com%2Fdp%2F1250784093%3Ftag%3Dvariety0e8-20%26linkCode%3Dogi%26th%3D1%26psc%3D1%26language%3Den_US%26asc_source%3Dweb%26asc_campaign%3Dweb%26asc_refurl%3Dhttps%253A%252F%252Fvariety.com%252F2025%252Fshopping%252Fnews%252Fjane-goodalls-book-of-hope-buy-online-1236540698%252F&p=https%3A%2F%2Fvariety.com%2F2025%2Fshopping%2Fnews%2Fjane-goodalls-book-of-hope-buy-online-1236540698%2F&ref=pmcTrackonomicsReferrer&event_type=click\" target=\"_blank\">here</a>. <br /></p>\n</div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jane Goodall’s Most Recent Written Work, ‘Book of Hope,’ Returns to Bestseller Lists Following Death",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/jane-goodall-book-of-hope-buy-online.png?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-06T13:00:00.000Z",
      "dateModified": "2025-10-06T13:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rush Sets Reunion Tour for 2026; Geddy Lee and Alex Lifeson Discuss the ‘Difficult Decision’ of Finding a New Drummer After Neil Peart’s Death",
    "url": "https://variety.com/2025/music/news/rush-reunion-tour-2026-geddy-lee-alex-lifeson-new-drummer-1236540828/",
    "image": "https://variety.com/wp-content/uploads/2025/10/Rush-press-photo-Richard-Sibbald-e1759758957927.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-06T14:00:00.000Z",
    "description": "<div><p>\n\tBack in March, <a target=\"_blank\" href=\"https://variety.com/t/rush/\">Rush</a> released “Rush 50,” a career-spanning greatest hits collection",
    "body": "<div><p>\n\tBack in March, <a target=\"_blank\" href=\"https://variety.com/t/rush/\">Rush</a> released “Rush 50,” a career-spanning greatest hits collection that ended with the final songs the band played at their final concert in 2015. Given the January 2020 death of drummer/lyricist Neil Peart from glioblastoma, it’s been assumed that a Rush live reunion wasn’t in the cards.</p>\n<p>\n\tBut like <a target=\"_blank\" href=\"https://variety.com/t/geddy-lee/\">Geddy Lee</a>’s beloved Toronto Blue Jays, the Canadian band knows how to throw a good curveball: Lee and Alex Lifeson are returning to the stage as Rush for a summer 2026 headline tour.\n\t</p>\n<p>\n\tDrumming for the band will be <a href=\"https://www.anikanilles.com/\" target=\"_blank\">Anika Nilles</a>, an award-winning German composer and producer who previously toured with Jeff Beck and has released four solo albums.\n</p>\n<p>\n\tThe tour, dubbed Fifty Something, is described as a “celebration of Rush’s music, legacy, and the life of late drummer and lyricist Neil Peart” and is slated to hit seven cities in North America, kicking off with two nights at the Kia Forum in Los Angeles on June 7 and 9. (The booking is poignant and significant: Rush’s last show was at the same venue.)</p>\n<p>\n\tThe tour will then go to Mexico City for one show and then hit two nights in multiple other cities — including Fort Worth, Chicago, New York and Toronto — before concluding with a single concert in Cleveland on September 17. (Scroll down for the full list of dates and venues, along with ticket onsale times and links.)</p>\n<p>\n\tThe tour news was first shared with select media and fans at a top-secret private event Sunday night at the Rock & Roll Hall of Fame in Cleveland that included a viewing of Rush’s induction speeches and performance and ended with a loose, animated interview with Lee and Lifeson. The reformation of the band was casually dropped on the surprised crowd in Cleveland partway through what started off as a far less momentous conversation.\n\t</p>\n<p>\n\tA “fan question” from a “C.B. from Highland Park, Ill.” (likely Q Prime Management co-founder Cliff Burnstein, who was in attendance) asked whether the band would tour again.</p>\n<p>\n\tThe musicians hemmed and hawed a bit with some lighthearted banter before Lee said, “I kind of think that we should tour next year.” At first, the audience reacted in disbelief, wondering if it was a joke, but then erupted into applause once it became clear he was serious. (Everyone cheered loudly again when it was noted Cleveland was on the touring itinerary.)</p>\n<p>\n\tLee acknowledged that deciding to tour was a “very difficult decision” in part because of the work involved, but also due to the “devastating” loss of Peart. “It was a very sad time, and it took time for us to even contemplate,” he said, adding, “And how do you replace someone who is irreplaceable?”</p>\n<p>\n\tBut Lifeson and Lee noted they had started privately jamming on Rush songs together, just casually, with no aim in mind. For both, that was a turning point. “We were laughing so hard, and we were enjoying it so much, and it was almost like playing those songs dispelled the dark clouds,” Lee said.</p>\n<p>\n\tPeart’s widow, Carrie Nuttall-Peart, and his daughter, Olivia, have given their blessing to and support for the Fifty Something tour. The two family members said jointly in a press statement: “We are thrilled to support the Fifty Something tour, celebrating a band whose music has resonated and inspired fans for generations, and to honor Neil’s extraordinary legacy as both a drummer and lyricist. … As the band enters this new chapter, it promises to be truly unforgettable. We are excited to see how their new vision unfolds, and to hear this legendary music played live once again.”</p>\n<p>\n\tAt the Rock & Roll Hall of Fame event in Cleveland, Lee and Lifeson were brought onstage with a galvanizing introduction from media historian and professor Donna Halper, who broke Rush in the United States while working as music director at Cleveland’s influential rock radio station WMMS. Halper received the original Moon Records pressing of Rush’s 1974 self-titled debut from a label friend in Canada and played “Working Man” on the radio. The song resonated with listeners and import copies of the LP sold well in local record stores, opening the door for Rush to eventually land a U.S. record deal and become global superstars.\n\t</p>\n<p>\n\tLee and Lifeson were then interviewed by author and Washington Post journalist Geoff Edgers. The conversation started off light, with questions about Lifeson’s Rock Hall acceptance speech, which notoriously consisted of blah-blah-blahs in place of actual words (the guitarist admitted he didn’t tell his bandmates in advance he was pulling the stunt), the duo’s deep friendship, musical influences and a very funny story about Rush touring with KISS in the 1970s. (Turns out Lee does a bang-up impression of Ace Frehley.) And then came the amusingly casual revelation of the night’s big news.</p>\n<p>\n\tThe major question at hand was how and why Fifty Something came about. Since Peart’s death, Lee and Lifeson have performed together onstage several times, including at the 2022 tribute concerts for the late Foo Fighters drummer Taylor Hawkins, and with Primus’s Les Claypool at “South Park’s” 25th anniversary concert. Lifeson also records regularly with his new band, the shoegaze-influenced Envy of None, while Lee wrote multiple books, including the new “72 Stories: From the Baseball Collection of Geddy Lee.”</p>\n<p>\n\tBut in recent years, Lifeson had been dealing with some health issues that impacted his ability to tour  and was rather adamant in press interviews that another Rush tour was out of the question. But Lee reassured the Cleveland attendees that his bandmate is “pretty effing healthy right now.” </p>\n<div><p>\n\tLifeson said he’d enjoyed reacquainting himself with Rush songs and found himself re-energized by the complex material. “To be challenged with that again was really, really exciting,” the guitarist said. “And the more we started rehearsing and playing, the more I just fell in love with the idea of playing again.”</p><p>Nilles came on the band’s radar via Lee’s bass tech John “Skully” McIntosh, who was touring with Jeff Beck and raved about the drummer. Intrigued, the musicians secretly brought Nilles to Canada — not to audition but rather as an “experiment,” as Lee put it. The three played together and clicked, which Lee notes was no easy feat, as fitting in with Rush involves a complicated calculus of technique and feel, as well as communicating unique musical nuances.</p></div>\n<p>\n\t“No matter who the drummer is, they all have their own perception of what it’s like to play a Rush song, and they may not line up with the way we play Rush songs,” Lee said, as the audience laughed. “So whoever we were going to choose was going to be difficult, and there was going to be a translation.”</p>\n<p>\n\tLee notes Rush intends to hire a keyboard player to give him more space onstage — and Lifeson as well, because “Alex loves to dance,” he quipped, as the guitarist jokingly did a little seated jig. They plan to work up “35, 36 songs” so they can switch the setlist up from night to night.\n\t</p>\n<p>\n\tAlthough marathon three-hour sets likely aren’t in the cards, Rush is “certainly going to play over two hours,” Lee added, and they’ve already been rehearsing. He also reassured fans that Peart would be honored throughout the trek, noting the band would pay tribute to the drummer “at least a couple of times during the show in our own way” every night.</p>\n<p>\n\t“Our idea was not to try to be Rush 2.0,” he says. “[We want] to pay homage to our music, pay homage to our lost brother, represent the songs — and celebrate the songs.”</p>\n<div>\n<figure>\n<p><img srcset=\"https://variety.com/wp-content/uploads/2025/10/Screenshot-2025-10-06-at-6.24.27 https://variety.com/2025/music/news/rush-reunion-tour-2026-geddy-lee-alex-lifeson-new-drummer-1236540828/AM.png 1470w, https://variety.com/wp-content/uploads/2025/10/Screenshot-2025-10-06-at-6.24.27 https://variety.com/2025/music/news/rush-reunion-tour-2026-geddy-lee-alex-lifeson-new-drummer-1236540828/AM.png?resize=150,150 150w, https://variety.com/wp-content/uploads/2025/10/Screenshot-2025-10-06-at-6.24.27 https://variety.com/2025/music/news/rush-reunion-tour-2026-geddy-lee-alex-lifeson-new-drummer-1236540828/AM.png?resize=300,298 300w\" src=\"https://variety.com/wp-content/themes/pmc-variety-2020/assets/public/lazyload-fallback.gif\" alt=\"\" />\n\t</p>\n<figcaption>\n\t</figcaption>\n</figure>\n</div>\n<p>\n\tLee said the following in a press statement: <em>“It’s been over 10 years since Alex and I have performed the music of Rush alongside our fallen bandmate and friend Neil. A lifetime’s worth of songs that we had put our cumulative hearts and souls into writing, recording and playing together onstage. And so, after all that has gone down since that last show, Alex and I have done some serious soul searching and come to the decision that we fucking miss it, and that it’s time for a celebration of 50-something years of RUSH music. So in 2026 my BFF Lerxst (aka Alex Lifeson) and I are going to hit the road once again to pay tribute to our past and to Neil by performing a vast selection of RUSH songs in a handful of cities. No small task, because as we all know Neil was irreplaceable.</em></p>\n<p>\n\t“<em>Yet life is full of surprises,” </em>Lee continued, <em>“and we have been introduced to another remarkable person; an incredible drummer and musician who is adding another chapter to our story while continuing her own fascinating musical journey. Her name is Anika Nilles, and we could not be more excited to introduce her to our loyal and dedicated RUSH fanbase, whom, we know, will give her every chance to live up to that near impossible role. Before we hit the stage, we also hope to add another musician or two to expand our sound a wee bit and free up Alex and I, in order to show off some of our new fancy dance steps. </em> … <em>Lerxst, Anika and myself, along with many of our longstanding crew members have been hard at work rehearsing and designing the kind of Rush show you’ve grown accustomed to expect from us. We dearly hope you will come along and help us celebrate our history together.”</em></p>\n<p>\n\t<strong>Rush’s 2026 tour dates:</strong>\n\t</p>\n<p>\n\tSun Jun 7, Los Angeles, CA Kia Forum<br />Tue Jun 9, Los Angeles, CA Kia Forum<br />Thu Jun 18, Mexico City, MX Palacio de los Deportes<br />Wed Jun 24, Fort Worth, TX Dickies Arena<br />Fri Jun 26, Fort Worth, TX Dickies Arena<br />Thu Jul 16, Chicago, IL United Center<br />Sat Jul 18, Chicago, IL United Center<br />Tue Jul 28, New York, NY Madison Square Garden<br />Thu Jul 30, New York, NY Madison Square Garden<br />Fri Aug 7, Toronto, ON Scotiabank Arena<br />Sun Aug 9, Toronto, ON Scotiabank Arena<br />Thu Sep 17, Cleveland, OH Rocket Arena</p>\n<p>\n\t<strong>Ticket information:</strong></p>\n<p>\n\tFans will be able to participate in the Rush artist presale by signing up <a href=\"https://livemu.sc/rush\" target=\"_blank\">here</a> before this Thursday at 11:59 p.m. ET. For Artist presales on Ticketmaster, no code is needed; access is tied to users’ accounts. The artist presale on SeatGeek for Cleveland will require a code, however. </p>\n<div><p>\n\tThe artist presale begins on Oct. 13 at noon local time in the U.S. and Canada and Oct. 16 at noon local time in Mexico. General onsale ticketing begins <a href=\"https://nam02.safelinks.protection.outlook.com/?url=https%3A%2F%2Fwww.rush.com%2F&data=05%7C02%7Ccwillman%40variety.com%7C248c1474488d41a7664a08de04acff18%7Ce950f25546e44144a778a6ff4f557492%7C0%7C0%7C638953338225067576%7CUnknown%7CTWFpbGZsb3d8eyJFbXB0eU1hcGkiOnRydWUsIlYiOiIwLjAuMDAwMCIsIlAiOiJXaW4zMiIsIkFOIjoiTWFpbCIsIldUIjoyfQ%3D%3D%7C0%7C%7C%7C&sdata=3DLzRWMjiLHWtcBj39KytwDN04I0ykWl2MCFfIivnTQ%3D&reserved=0\" target=\"_blank\">here</a> on Oct. 17 at noon local time for the U.S. and Canada, and 11 a.m. local time for the Mexico dates.</p><p>Additionally, these pre-sales will be available:</p></div>\n<div>\n<ul>\n<li>Citi for U.S shows<em>: </em>Cardholders will have access to presale tickets beginning Friday at noon local time through Sunday at 11:59 p.m. local time. Complete details can be found at <a href=\"https://nam02.safelinks.protection.outlook.com/?url=http%3A%2F%2Fwww.citientertainment.com%2F&data=05%7C02%7Ccwillman%40variety.com%7C248c1474488d41a7664a08de04acff18%7Ce950f25546e44144a778a6ff4f557492%7C0%7C0%7C638953338225082367%7CUnknown%7CTWFpbGZsb3d8eyJFbXB0eU1hcGkiOnRydWUsIlYiOiIwLjAuMDAwMCIsIlAiOiJXaW4zMiIsIkFOIjoiTWFpbCIsIldUIjoyfQ%3D%3D%7C0%7C%7C%7C&sdata=YwUYUz%2FoDi0S8HS58FMHDLZG%2B0AgM434EzQKJvdr0f0%3D&reserved=0\" target=\"_blank\">www.citientertainment.com</a>. </li>\n<li>American Express for Canada: Cardholders can purchase tickets for the Toronto show before the general public beginning Friday at noon local time and running through Sunday at 11:59 p.m. local time.</li>\n<li>Banamex for Mexico City: Cardholders will have presale access ahead of the general onsale. Times vary based on Banamex card type:\n<div>\n<ul>\n<li>Beyond Babamex:<strong> </strong>Presale available Oct. 13, 9 a.m. local to 11:59 p.m. local</li>\n<li>Elite Banamex:<strong> </strong>Presale available Oct. 14, 9 a.m. local to 11:59 p.m. local</li>\n<li>All cards:<strong> </strong>Presale available Oct. 15 11 a.m. local to 11:59 p.m. local</li>\n</ul>\n</div>\n</li>\n</ul>\n</div>\n</div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rush Sets Reunion Tour for 2026; Geddy Lee and Alex Lifeson Discuss the ‘Difficult Decision’ of Finding a New Drummer After Neil Peart’s Death",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/Rush-press-photo-Richard-Sibbald-e1759758957927.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-06T14:00:00.000Z",
      "dateModified": "2025-10-06T14:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "30 Paramount Employees Slam Studio Leaders for Condemning Israeli Film Boycott: ‘You Are Aligning Yourselves’ With ‘Genocide in Gaza’ (EXCLUSIVE)",
    "url": "https://variety.com/2025/film/news/paramount-israel-boycott-employee-letter-1236536692/",
    "image": "https://variety.com/wp-content/uploads/2025/07/Paramount-Headquarters.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-06T13:00:00.000Z",
    "description": "<div><p>\n\tOn Sept. 17, a group of roughly 30 <a target=\"_blank\" href=\"https://variety.com/t/paramount/\">Paramount</a> Skydance employees sent a letter",
    "body": "<div><p>\n\tOn Sept. 17, a group of roughly 30 <a target=\"_blank\" href=\"https://variety.com/t/paramount/\">Paramount</a> Skydance employees sent a letter to the office of CEO David Ellison and other senior executives slamming the company for “aligning” with “a genocide in Gaza and of the Palestinian people.” After two weeks without receiving a response, the group followed up on Oct. 1 with a list of demands, including a call for Paramount to donate $1 million to the Palestine Children’s Relief Fund in order to match its 2023 donation of the same amount to humanitarian relief efforts in Israel.\n\t</p>\n<p>\n\tThe employee group, which calls itself both Paramount Employees of Conscience and Paramount Employees for Human Rights, operates anonymously; members did not sign their names on the letter “⁠out of fear of retaliation, doxxing and elimination given the company’s upcoming, well publicized layoffs,” they tell <em>Variety</em>. However, the group does specify that it includes staffers “from every business unit within the enterprise and across all levels of seniority,” including at the executive level. (<em>Variety</em> has spoken to multiple members of the group to confirm their identities, employment at Paramount and involvement with the letter.)\n</p>\n<p>\n\tParamount Employees of Conscience tells <em>Variety</em> that company leadership has not acknowledged receipt of either message. A Paramount representative declined <em>Variety</em>’s request for comment.</p>\n<p>\n\tEarlier this month, an organization called <a target=\"_blank\" href=\"https://variety.com/2025/film/global/stars-sign-pledge-complicit-israeli-film-companies-1236511010/\">Film Workers for Palestine circulated a pledge</a> not to “work with Israeli film institutions …that are implicated in genocide and apartheid against the Palestinian people,” which has since been signed by more than 5,000 people in the entertainment industry including A-listers such as Emma Stone and Joaquin Phoenix. Shortly thereafter, <a target=\"_blank\" href=\"https://variety.com/2025/film/news/paramount-condemns-israeli-film-boycott-1236516511/\">Paramount released a statement condemning that pledge</a> for “silencing individual creative artists based on their nationality.” (In response, <a href=\"https://www.instagram.com/p/DOhYycEjMYZ/?img_index=1\" target=\"_blank\">Film Workers for Palestine emphasized</a> that the pledge is intended to target companies and organizations, not individual Israelis.)\n\t</p>\n<p>\n\tThe following week, Paramount Employees of Conscience wrote to several company leaders to call the statement a “dangerous and intentional distortion” that “does not represent the employees of this company.” The letter reads, “Paramount’s claim that the Pledge is an attempt to silence Israeli artists is a purposeful misrepresentation of the boycott and its objective. We applaud the FWP for pushing back against this bad-faith argument.”</p>\n<p>\n\tIn the letter, the employees accuse Paramount of hypocrisy, pointing to the company’s mission to “promote mutual understanding” as stated in its response to the boycott. The letter reads, “How can a company with this supposed creative mission actively ignore, suppress, and silence internal calls for years to champion stories that shed a light on the reality that marginalized and excluded communities, particularly Palestinians, face every day?” </p>\n<p>\n\tParamount Employees of Conscience claims that staffers across the company have “meaningfully attempted to engage Paramount leadership with data-driven and objectively strategic business recommendations” to acquire projects from Palestinian creators, such as the documentary “No Other Land,” which never found a U.S. distributor despite winning the best documentary Oscar earlier this year, and the short form news series “It’s Bisan From Gaza and I’m Still Alive,” which was eventually picked up by Al Jazeera’s AJ+ and won Emmy and Peabody awards in 2024.</p>\n<p>\n\tInstead, the letter claims that Paramount has distributed what it calls “one-sided stories,” noting the documentary projects “We Will Dance Again,” “The Children of October 7,” and “As1One: The Israeli-Palestinian Pop Music Journey” in particular. (“As1One” follows a boy band made up of four Israelis and two Palestinians, which was conceptualized by American music executives and formed in Israel. “We Will Dance Again” and “The Children of October 7” focus on Israeli children and attendees of Israel’s Nova Music Festival.)</p>\n<p>\n\tAs such, the list of demands sent to Paramount leadership on Oct. 1 includes “a commitment to producing, acquiring, and distributing content that represents not just the perspective and experience of the Palestinian people, but to also amplify Jewish voices that speak out against how the Israeli government misrepresent their culture and religious beliefs.” The group additionally demands that Paramount “guarantee that there will be no retaliation or punishment made against Paramount employees who speak out against genocide and apartheid.”\n\t</p>\n<p>\n\tAlong with Ellison, the letter and the demands were sent to <a target=\"_blank\" href=\"https://variety.com/t/paramount-skydance/\">Paramount Skydance</a> president Jeff Shell, chief strategy and operating officer Andy Gordon, chief communications officer Melissa Zukerman, head of HR Jim Sterner, direct-to-consumer chair Cindy Holland, co-chair of Paramount Pictures and chair of Paramount Television Dana Goldberg, co-chair of Paramount Pictures and vice chair of platforms Josh Greenstein and TV chair George Cheeks.</p>\n<p>\n\tRead the full letter below, followed by the list of demands.</p>\n<p>\n\t<em>To Paramount Leadership:</em></p>\n<p>\n\t<em>As Paramount employees from every business unit within the enterprise and across all levels of seniority, we firmly reject the leadership team’s</em><a href=\"https://www.nytimes.com/2025/09/13/arts/israel-hollywood-boycott-paramount.html\" target=\"_blank\"><em> </em><em>condemnation</em></a><em> of the</em><a href=\"https://www.nytimes.com/2025/09/08/movies/hollywood-israel-boycott.html\" target=\"_blank\"><em> </em><em>Film Workers for Palestine Pledge</em></a><em>.</em></p>\n<p>\n\t<em>From the hypocrisy of the purported creative mission to the intentional misrepresentation of the FWP Pledge, the statement made by Paramount leadership </em><strong><em>does not</em></strong><em> represent the employees of this company. In condemning the Pledge, you are aligning yourselves with systems of apartheid, occupation, and what Amnesty International, Human Rights Watch, Holocaust scholars,</em><a href=\"https://apnews.com/article/israel-gaza-genocide-palestinians-c9d40ab3714b46957c5716132f9eb2a6\" target=\"_blank\"><em> </em><em>independent experts commissioned by the United Nations’ Human Rights Council</em></a><em>, and countless other organizations, including Israeli institutions like B’Tselem, have recognized as a genocide in Gaza and of the Palestinian people.</em></p>\n<p>\n\t<em>As Paramount employees, we refuse to have our labor used to endorse complicity in the brutalization and erasure of an entire population. We do not and will not support the leadership team’s attempts to align a publicly traded American company with the intentions, actions, and</em><a href=\"https://open.substack.com/pub/dropsitenews/p/google-youtube-netanyahu-israel-propaganda-gaza-famine\" target=\"_blank\"><em> </em><em>propaganda arm</em></a><em> of a foreign government.</em></p>\n<p>\n\t<em>As the parent company of a massive news organization in CBS, it is incredibly telling that Paramount chooses to say nothing as hundreds of journalists are targeted and murdered with impunity in Gaza while simultaneously publicly chastising film workers for choosing whom they would like to work with based on shared values.</em></p>\n<p>\n\t<em>We stand with our colleagues of conscience across the industry who are demanding justice, and we affirm the call for a boycott of institutions that are complicit in war crimes, apartheid, and genocide as a legitimate, ethical, and necessary act of solidarity.</em></p>\n<p>\n\t<em>The very thesis of your statement condemning the Pledge is rooted in blatant hypocrisy:</em>\n\t</p>\n<p>\n\t<em>“At Paramount, we believe in the power of storytelling to connect and inspire people, promote mutual understanding, and preserve the moments, ideas, and events that shape the world we share. This is our creative mission.”</em></p>\n<p>\n\t<em>How can a company with this supposed creative mission actively ignore, suppress, and silence internal calls for years to champion stories that shed a light on the reality that marginalized and excluded communities, particularly Palestinians, face every day? Stories for which there is clear, global, and growing audience demand? As employees of this company, we are increasingly galvanized to push back against the demonstrable hypocrisy of this statement.</em></p>\n<p>\n\t<em>For years, a growing and varied coalition of employees has meaningfully attempted to engage Paramount leadership with data-driven and objectively strategic business recommendations to acquire and distribute award-winning stories like </em><a href=\"https://apnews.com/article/best-documentary-2025-oscars-f589d9ed361df2220a1f0e122fe9f84b\" target=\"_blank\"><em>No Other Land</em></a><em> and </em><a href=\"https://peabodyawards.com/award-profile/its-bisan-from-gaza/\" target=\"_blank\"><em>It’s Bisan From Gaza And I’m Still Alive</em></a><em> that meet the creative mission stated in your condemnation statement—stories that truly promote mutual understanding of events that shape the world we share.</em></p>\n<p>\n\t<em>How can a company with this purported mission actively and exclusively platform Israeli perspectives, while silencing Palestinian voices? Budgets and resources have been diverted from existing programming and marketing priorities, only investing in one-sided stories like </em><a href=\"https://www.paramountpressexpress.com/search/results?q=we+will+dance+again&filter=releases\" target=\"_blank\"><em>We Will Dance Again</em></a><em>,</em><a href=\"https://www.paramountpressexpress.com/paramount-plus/releases/?view=111221-paramount-acquires-the-children-of-october-7-featuring-montana-tucker-to-premiere-april-23\" target=\"_blank\"><em> </em><em>Children of Oct 7th</em></a><em>, and </em><a href=\"https://www.paramountpressexpress.com/paramount-plus/shows/as1one-the-israeli-palestinian-pop-music-journey/releases/?view=110606-paramount-announces-new-as1one-the-israeli-palestinian-pop-music-journey\" target=\"_blank\"><em>As1One</em></a><em> that did not lead to any material business success. Rather, these projects contributed to the organization’s seemingly perpetual reputational decline and furthered its disconnect from audiences.</em></p>\n<p>\n\t<em>In addition to the hypocrisy of platforming one perspective while suppressing another—in direct opposition to the creative mission you purport—the second half of the company’s condemnation statement is equally disingenuous in its dangerous and intentional distortion of the Pledge:</em></p>\n<p>\n\t<em>“We do not agree with recent efforts to boycott Israeli filmmakers. Silencing individual creative artists based on their nationality does not promote better understanding or advance the cause of peace. The global entertainment industry should be encouraging artists to tell their stories and share their ideas with audiences throughout the world. We need more engagement and communication — not less.”</em>\n\t</p>\n<p>\n\t<em>Paramount’s claim that the Pledge is an attempt to silence Israeli artists is a purposeful misrepresentation of the boycott and its objective. We applaud the FWP for pushing back against this bad-faith argument, and we appreciate Hannah Einbinder for using</em><a href=\"https://www.hollywoodreporter.com/news/politics-news/emmy-winner-hannah-einbinder-free-palestine-comment-1236371665/\" target=\"_blank\"><em> her Emmy win presser</em></a><em> as a platform to reiterate the truth: “the Film Workers for Palestine boycott does not boycott individuals. It only boycotts institutions that are directly complicit in the genocide.” We also commend Javier Bardem</em><a target=\"_blank\" href=\"https://variety.com/2025/tv/news/javier-bardem-gaza-genocide-palestine-film-workers-1236518172/\"><em> for rejecting this while speaking to Variety on the Emmy red carpet</em></a><em>: “Film Workers for Palestine do not target any individuals based on identity. The targets are those film companies and institutions that are complicit and are white-washing or justifying the genocide and its apartheid regime. We do stand with those who are helping and being supportive of the oppressed people.”</em></p>\n<p>\n\t<em>As Paramount employees who support the Pledge, we believe it is critical to underscore this point: the boycott is not an attack on filmmakers. It explicitly draws inspiration from</em><a href=\"https://www.latimes.com/archives/la-xpm-1987-11-03-ca-18374-story.html\" target=\"_blank\"><em> </em><em>Filmmakers United Against Apartheid</em></a><em>, the organization co-founded in 1987 by Jonathan Demme and Martin Scorsese and comprised of more than 100 prominent filmmakers who refused to screen their films in apartheid South Africa. Similarly, we are confident that when history looks back at the Film Workers for Palestine Pledge, it will do so with a similar respect for its foresight and the humanitarian insight with which the FUAA Pledge is regarded.</em></p>\n<p>\n\t<em>When a powerful media conglomerate attempts to intimidate film workers for exercising their freedom of expression to condemn war crimes in this manner—who is really doing the silencing?</em></p>\n<p>\n\t<em>Signed,</em><em><br /></em><em>Paramount Employees for Human Rights</em></p>\n<p>\n\t<em>—</em></p>\n<p>\n\t<em>EMPLOYEE SAFETY: We call on Paramount Leadership to acknowledge the harm caused to Paramount employees by their condemnation of the FWP Pledge. We call for them to commit to a guarantee that there will be no retaliation or punishment made against Paramount employees who speak out against genocide and apartheid.</em></p>\n<p>\n\t<em>CONTENT & STORYTELLING: We call on leadership to actually deliver on their creative mission to “promote mutual understanding” by making a commitment to producing, acquiring, and distributing content that represents not just the perspective and experience of the Palestinian people, but to also amplify Jewish voices that speak out against how the Israeli government misrepresent their culture and religious beliefs.</em>\n\t</p>\n<p>\n\t<em>HUMANITARIAN SUPPORT: We call on Paramount leadership to match the $1M in corporate donations made in October 2023 to Israeli organizations by donating $1M in humanitarian relief to the Palestine Children’s Relief Fund, a non-profit providing medical and humanitarian aid to children.</em></p>\n</div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "30 Paramount Employees Slam Studio Leaders for Condemning Israeli Film Boycott: ‘You Are Aligning Yourselves’ With ‘Genocide in Gaza’ (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2025/07/Paramount-Headquarters.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-06T13:00:00.000Z",
      "dateModified": "2025-10-06T13:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Guess Who This Smilin' Sweetie Turned Into!",
    "url": "https://www.tmz.com/2025/10/06/guess-who-smilin-sweetie-turned-into/",
    "image": "https://imagez.tmz.com/image/70/16by9/2025/10/01/70b355df3e554b67a6f6b6bdb960f5ed_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-06T07:01:52.000Z",
    "description": "<div>\n    <article>\n                    <h2>\n                          <span>Guess Who This</span>\n                          <span>Smilin' Sweetie</sp",
    "body": "<div>\n    <article>\n                    <h2>\n                          <span>Guess Who This</span>\n                          <span>Smilin' Sweetie</span>\n                          <span>Turned Into!</span>\n                      </h2>\n                  <p>\n                        Published October 6, 2025 12:01 AM PDT\n                                                                            </p>\n      <div>\n    <section>\n          <p>Before this sweetie pie puttin' on her biggest smile for the camera turned into an actress, she was just throwin' on her precious hat, and throwing <em>stones</em> down the river in Texas ...</p>\n      </section>\n    <section>\n          <p>This shining star has quite the resume ... She's had roles in movies like \"Secondhand Lions\" with <a target=\"_blank\" href=\"https://www.tmz.com/people/haley-joel-osment/\"><strong>Haley Joel Osment</strong></a><strong> </strong>and \"Mean Girls 2\" with <a target=\"_blank\" href=\"https://www.tmz.com/people/tim-meadows/\"><strong>Tim Meadows</strong></a><strong> </strong>... but she's most known for her role on the Disney Channel ... Does \"Harper Finkle\" ring a bell?</p>\n      </section>\n    <section>\n          <p>Fun fact: she finished nursing school in 2019 and helped on the frontlines during the Covid pandemic.</p>\n      </section>\n    <section>\n          <p>You have <em>nothing left to fear</em> ...</p>\n      </section>\n    <section>\n          <p><a href=\"https://www.tmz.com/photos/2018/09/04/guess-who-these-cute-kids-turned-into-part-15-photos/\" target=\"_blank\"><strong>Can you guess who she is?</strong></a></p>\n      </section>\n      </div>\n              <section>\n            <h3>\n              Related articles\n            </h3>\n        </section>\n              <section>\n          <ul>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/categories/guess-who/\">\n                Guess Who\n              </a>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/categories/kids/\">\n                Kids\n              </a>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/categories/celebrity-kids/\">\n                celebrity kids\n              </a>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/categories/photo-galleries/\">\n                Photo Galleries\n              </a>\n                      </ul>\n        </section>\n          </article>\n          </div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Guess Who This Smilin' Sweetie Turned Into!",
      "image": [
        "https://imagez.tmz.com/image/70/16by9/2025/10/01/70b355df3e554b67a6f6b6bdb960f5ed_xl.jpg"
      ],
      "datePublished": "2025-10-06T07:01:52.000Z",
      "dateModified": "2025-10-06T07:01:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Dua Lipa's Security Slaps Away Fan's Hand As It Inches Toward Her Butt, On Video",
    "url": "https://www.tmz.com/2025/10/06/dua-lipa-fan-hands-butt-security-kia-forum/",
    "image": "https://imagez.tmz.com/image/03/16by9/2025/10/06/03bf742769d041ce8f4e70b5526b036a_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-06T13:55:33.000Z",
    "description": "<div>\n    <article>\n                    <h2>\n                          <span>Dua Lipa</span>\n                          <span>Handsy Fan Is A Pain In t",
    "body": "<div>\n    <article>\n                    <h2>\n                          <span>Dua Lipa</span>\n                          <span>Handsy Fan Is A Pain In the Butt!!!</span>\n                      </h2>\n                  <p>\n                        Published October 6, 2025 6:55 AM PDT\n                                                                            </p>\n      <div>\n    <div>\n                  <a>\n          <div>\n                          <p><img src=\"https://imagez.tmz.com/image/03/4by3/2025/10/06/03bf742769d041ce8f4e70b5526b036a_md.jpg\" alt=\"dua lip and fan getty tiktok 1\" />\n                </p></div>\n                  </a>\n      </div>\n    <section>\n          <p><a target=\"_blank\" href=\"https://www.tmz.com/people/dua-lipa/\"><strong>Dua Lipa</strong></a>’s hot, no cap ... but try anything funny and you’re getting schooled -- just ask the fan who learned the hard way!</p>\n      </section>\n    <section>\n          <p>Catch the clip ... Dua was killing it at the Kia Forum in L.A. this weekend, posing for fan pics when one dude got <em>way</em> too familiar, sliding his hand near her booty -- before security delivered an instant rear-end reality check.</p>\n      </section>\n    <div>\n      <blockquote>\n      <p>oh my god this is disgusting ugh i’m so sick of these barricade weirdos.. but dua’s security deserves a raise fr <a target=\"_blank\" href=\"https://t.co/8oiTa3W056\">pic.twitter.com/8oiTa3W056</a></p>— ece 🥬 | fan account (@lipadelrey) <a target=\"_blank\" href=\"https://twitter.com/lipadelrey/status/1974763395904885020?ref_src=twsrc^tfw\">October 5, 2025</a>\n              <a href=\"https://twitter.com/lipadelrey\" target=\"_blank\">@lipadelrey</a>\n          </blockquote>\n  </div>\n    <section>\n          <p>The whole crowd saw it go down and couldn’t help but laugh out loud when security smacked his hand away. Oof, instant cringe!</p>\n      </section>\n<section>\n          <p>Dua didn’t even notice the near-bum grab -- she was too in the zone, snapping pics like a pro ... but the clip went viral fast, leaving fans totally horrified.</p>\n      </section>\n    <section>\n          <p>But thankfully, her security served up a real \"rear\" reminder -- lesson learned, no hands allowed!</p>\n      </section>\n      </div>\n              <section>\n            <h3>\n              Related articles\n            </h3>\n        </section>\n              <section>\n          <ul>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/people/dua-lipa/\">\n                Dua Lipa\n              </a>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/categories/celebrity-news/\">\n                Celebrity News\n              </a>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/categories/viral/\">\n                Viral\n              </a>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/categories/music/\">\n                Music\n              </a>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/categories/fairly-legal/\">\n                Fairly Legal\n              </a>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/categories/concerts-tours/\">\n                Concerts and Tours\n              </a>\n                      </ul>\n        </section>\n          </article>\n          </div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Dua Lipa's Security Slaps Away Fan's Hand As It Inches Toward Her Butt, On Video",
      "image": [
        "https://imagez.tmz.com/image/03/16by9/2025/10/06/03bf742769d041ce8f4e70b5526b036a_xl.jpg"
      ],
      "datePublished": "2025-10-06T13:55:33.000Z",
      "dateModified": "2025-10-06T13:55:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Hundreds of Mt. Everest Climbers Stuck on Mountain",
    "url": "https://www.tmz.com/2025/10/05/hundreds-mt-everest-climbers-trapped-on-mountain/",
    "image": "https://imagez.tmz.com/image/6c/16by9/2025/10/05/6ca9fe04e5234975b96a8b734092ec62_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-05T21:08:25.000Z",
    "description": "<div>\n    <article>\n                    <h2>\n                          <span>Mt. Everest</span>\n                          <span>Hundreds Trapped By Bl",
    "body": "<div>\n    <article>\n                    <h2>\n                          <span>Mt. Everest</span>\n                          <span>Hundreds Trapped By Blizzard While Climbing</span>\n                      </h2>\n                  <p>\n                        Published October 5, 2025 2:08 PM PDT\n                                                                            </p>\n      <div>\n    <div>\n                  <a>\n          <div>\n                          <p><img src=\"https://imagez.tmz.com/image/6c/4by3/2025/10/05/6ca9fe04e5234975b96a8b734092ec62_md.jpg\" alt=\"mount-everest-getty-1\" />\n                </p></div>\n                  </a>\n      </div>\n    <section>\n          <p>Nearly 1,000 climbers were trapped on Mt. Everest by a blizzard ... and, while several hundred are safely down, a majority are still stuck up there.</p>\n      </section>\n    <section>\n          <p>The <a href=\"https://www.bbc.com/news/articles/cj4ykkgxqwko\" target=\"_blank\"><strong>BBC</strong></a> -- citing Chinese state media -- reports rescure efforts are underway, with authorities and locals in the area teaming up to get people off the world's tallest mountain.</p>\n      </section>\n    <div>\n                  <a>\n          <div>\n                          <p><img src=\"https://imagez.tmz.com/image/4c/4by3/2025/10/05/4c88a027cf0745a5889d73d520a077a3_md.jpg\" alt=\"mount-everest-sub-getty-1\" />\n                </p></div>\n                  </a>\n      </div>\n    <section>\n          <p>About 350 people are already safely down from the mountain ... but the rest are still fighting and braving the elements.</p>\n      </section>\n<section>\n          <p>A large snowfall began Friday night ... pelting the eastern slopes of the mountain in Tibet -- a popular spot for hikers. Reuters reports authorities have made contact with the remaining hikers on the mountain.</p>\n      </section>\n    <div>\n                  <a>\n          <div>\n                          <p><img src=\"https://imagez.tmz.com/image/c4/4by3/2025/10/05/c49024a076c94e4b998c87e6c7dfb6c7_md.jpg\" alt=\"mount-everest-sub-getty-2\" />\n                </p></div>\n                  </a>\n      </div>\n    <section>\n          <p>BBC also reports heavy rains in Nepal has triggered landslides and floods ... which have led to the death of 47 people.</p>\n      </section>\n    <section>\n          <p>Everest is a notoriously dangerous mountain to climb ... with more than 400 people dying while trying to reach the peak.</p>\n      </section>\n      </div>\n              <section>\n            <h3>\n              Related articles\n            </h3>\n        </section>\n              <section>\n          <ul>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/categories/weather/\">\n                Weather\n              </a>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/categories/natural-disasters/\">\n                Natural Disasters\n              </a>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/categories/fairly-legal/\">\n                Fairly Legal\n              </a>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/categories/news/\">\n                News\n              </a>\n                      </ul>\n        </section>\n          </article>\n          </div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Hundreds of Mt. Everest Climbers Stuck on Mountain",
      "image": [
        "https://imagez.tmz.com/image/6c/16by9/2025/10/05/6ca9fe04e5234975b96a8b734092ec62_xl.jpg"
      ],
      "datePublished": "2025-10-05T21:08:25.000Z",
      "dateModified": "2025-10-05T21:08:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ike Turner Jr., Son of Tina and Ike Turner, Dead at 67",
    "url": "https://www.tmz.com/2025/10/05/ike-turner-jr-dead/",
    "image": "https://imagez.tmz.com/image/bb/16by9/2025/10/05/bbc863ce0f574b5699fa24305b0102ab_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-05T17:01:21.000Z",
    "description": "<div>\n    <article>\n                    <h2>\n                          <span>Tina Turner's Son Ike Turner Jr.</span>\n                          <span>D",
    "body": "<div>\n    <article>\n                    <h2>\n                          <span>Tina Turner's Son Ike Turner Jr.</span>\n                          <span>Dead at 67</span>\n                      </h2>\n                  <p>\n                        Published October 5, 2025 10:01 AM PDT\n                                                                      <span>|</span>\n                Updated October 5, 2025 12:37 PM PDT\n                                    </p>\n      <div>\n    <div>\n                  <a>\n          <div>\n                          <p><img src=\"https://imagez.tmz.com/image/bb/4by3/2025/10/05/bbc863ce0f574b5699fa24305b0102ab_md.jpg\" alt=\"Ike-Turner-Jr-getty-1\" />\n                </p></div>\n                  </a>\n      </div>\n    <section>\n          <p><a target=\"_blank\" href=\"https://www.tmz.com/people/tina-turner/\"><strong>Tina Turner</strong></a> and <a target=\"_blank\" href=\"https://www.tmz.com/people/ike-turner/\"><strong>Ike Turner</strong></a>'s son, <strong>Ike Turner Jr</strong>. has died ... TMZ has learned.</p>\n      </section>\n    <section>\n          <p>Tina’s niece, <strong>Jacqueline Bullock</strong>, tells TMZ ... Ike Jr. died Saturday at a Los Angeles hospital from kidney failure. She says he'd battled severe heart issues for years, and we're told his health had been declining for some time. He also recently suffered a stroke in early September.</p>\n      </section>\n    <div>\n                  <a>\n          <div>\n                          <p><img src=\"https://imagez.tmz.com/image/18/4by3/2025/10/05/18f826010bb24a7da14b9bc463598e31_md.jpg\" alt=\"Ike-Turner-Jr-sub-getty-4\" />\n                </p></div>\n                  </a>\n      </div>\n    <section>\n          <p>Born in 1958 to Ike Sr. and <strong>Lorraine Taylor</strong>, Ike Jr. was adopted by Tina early in his life and grew up amid his parents' whirlwind music career.</p>\n      </section>\n<section>\n          <p>After Tina split from her ex-husband Ike Sr., Ike Jr. went on to work as her sound engineer for a short time but the collaboration was brief.</p>\n      </section>\n    <div>\n                  <a>\n          <div>\n                          <p><img src=\"https://imagez.tmz.com/image/3d/4by3/2025/10/05/3d8f6e68afa74a46b4d262ee783f9a73_md.jpg\" alt=\"Ike-Turner-Jr-sub-getty-3\" />\n                </p></div>\n                  </a>\n      </div>\n    <section>\n          <p>Ike Jr. was one of four children connected to Tina and Ike's iconic union. He largely stayed out of the spotlight in recent years but remained connected to the legacy of both of his parents. Ike Turner Sr., died in 2007, and Tina passed in 2023.</p>\n      </section>\n    <section>\n          <p>Ike Jr. was 67.</p>\n      </section>\n    <section>\n          <p>RIP</p>\n      </section>\n      </div>\n              <section>\n            <h3>\n              Related articles\n            </h3>\n        </section>\n              <section>\n          <ul>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/people/ike-turner/\">\n                Ike Turner\n              </a>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/people/tina-turner/\">\n                Tina Turner\n              </a>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/categories/rip/\">\n                RIP\n              </a>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/categories/celebrity-death/\">\n                Celebrity Death\n              </a>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/categories/exclusive/\">\n                Exclusive\n              </a>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/categories/music/\">\n                Music\n              </a>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/categories/fairly-legal/\">\n                Fairly Legal\n              </a>\n                      </ul>\n        </section>\n          </article>\n          </div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ike Turner Jr., Son of Tina and Ike Turner, Dead at 67",
      "image": [
        "https://imagez.tmz.com/image/bb/16by9/2025/10/05/bbc863ce0f574b5699fa24305b0102ab_xl.jpg"
      ],
      "datePublished": "2025-10-05T17:01:21.000Z",
      "dateModified": "2025-10-05T17:01:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Travis Kelce Celebrates Birthday at Taylor Swift's 'Showgirl' Movie With Family",
    "url": "https://www.tmz.com/2025/10/06/travis-kelce-birthday-taylor-swift-showgirl-movie-family/",
    "image": "https://imagez.tmz.com/image/28/16by9/2025/10/06/288db143174b40fd9175f4f9b4d96ff1_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-06T13:29:56.000Z",
    "description": "<div>\n    <article>\n                    <h2>\n                          <span>Travis Kelce</span>\n                          <span>Rings in B-Day at Tay",
    "body": "<div>\n    <article>\n                    <h2>\n                          <span>Travis Kelce</span>\n                          <span>Rings in B-Day at Taylor's Movie With Family</span>\n                      </h2>\n                  <p>\n                        Published October 6, 2025 6:29 AM PDT\n                                                                            </p>\n      <div>\n    <div>\n                  <a>\n          <div>\n                          <p><img src=\"https://imagez.tmz.com/image/28/4by3/2025/10/06/288db143174b40fd9175f4f9b4d96ff1_md.jpg\" alt=\"travis kelce and taylor swift getty 1\" />\n                </p></div>\n                  </a>\n      </div>\n    <section>\n          <p><a target=\"_blank\" href=\"https://www.tmz.com/people/travis-kelce/\"><strong>Travis Kelce</strong></a> is choosing to be a supportive fiancé instead of partying with his bros on his 36th birthday ... showing up at a movie theater with his family to watch <a target=\"_blank\" href=\"https://www.tmz.com/people/taylor-swift/\"><strong>Taylor</strong></a>’s new film.</p>\n      </section>\n    <section>\n          <p>The NFL star is all smiles with his arms around his mother, <a target=\"_blank\" href=\"https://www.tmz.com/people/donna-kelce/\"><strong>Donna Kelce</strong></a> -- along with his uncle and aunt -- at “Taylor Swift: The Official Release Party of a Showgirl,\" which hit theaters over the weekend.</p>\n      </section>\n    <div>\n      <blockquote>\n      <p>Travis, Donna, her brother Don and his wife Joan went to \"The Official Release Party of a Showgirl\" together tonight in Jacksonville ❤️‍🔥 <a target=\"_blank\" href=\"https://t.co/l2X8rhirGp\">pic.twitter.com/l2X8rhirGp</a></p>— Kelce Brothers (@kelcebrothers) <a target=\"_blank\" href=\"https://twitter.com/kelcebrothers/status/1975025505654202691?ref_src=twsrc^tfw\">October 6, 2025</a>\n              <a href=\"https://twitter.com/kelcebrothers\" target=\"_blank\">@kelcebrothers</a>\n          </blockquote>\n  </div>\n    <section>\n          <p>The crew flocked to a Jacksonville, Florida movie theater ... which makes sense, since Travis and the Kansas City Chiefs are set to face the Jacksonville Jaguars on Monday night.</p>\n      </section>\n<section>\n          <p>Sticking to the theme colors of this \"era\" ... the whole gang was decked out in orange -- with Travis and Donna even holding matching orange feathered fans.</p>\n      </section>\n    <section>\n          <p>No surprise here ... the film was a smash hit at the box office, <a target=\"_blank\" href=\"https://www.tmz.com/2025/10/04/taylor-swift-amc-release-screening-making-history/\"><strong>raking in</strong></a> about $33M domestically.</p>\n      </section>\n    <section>\n          <p>To all of you with a special someone out there ... take notes!</p>\n      </section>\n      </div>\n              <section>\n            <h3>\n              Related articles\n            </h3>\n        </section>\n              <section>\n          <ul>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/people/travis-kelce/\">\n                Travis Kelce\n              </a>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/people/taylor-swift/\">\n                Taylor Swift\n              </a>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/people/donna-kelce/\">\n                Donna Kelce\n              </a>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/categories/celebrity-news/\">\n                Celebrity News\n              </a>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/categories/kansas-city-chiefs/\">\n                Kansas City Chiefs\n              </a>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/categories/relationships/\">\n                Relationships\n              </a>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/categories/movies/\">\n                Movies\n              </a>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/categories/tmzsports/\">\n                TMZ Sports\n              </a>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/categories/music/\">\n                Music\n              </a>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/categories/fairly-legal/\">\n                Fairly Legal\n              </a>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/categories/taylor-swift-travis-kelce-engaged/\">\n                Taylor and Travis Engaged\n              </a>\n                      </ul>\n        </section>\n          </article>\n          </div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Travis Kelce Celebrates Birthday at Taylor Swift's 'Showgirl' Movie With Family",
      "image": [
        "https://imagez.tmz.com/image/28/16by9/2025/10/06/288db143174b40fd9175f4f9b4d96ff1_xl.jpg"
      ],
      "datePublished": "2025-10-06T13:29:56.000Z",
      "dateModified": "2025-10-06T13:29:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]