[
  {
    "title": "Former Try Guy Ned Fulmer Reveals MS Diagnosis: I Wondered ‘If I Was Going to Be Able to Walk Again’",
    "url": "https://variety.com/2025/tv/news/try-guys-ned-fulmer-ms-diagnosis-1236592494/",
    "image": "https://variety.com/wp-content/uploads/2022/09/Ned-Fulmer-The-Try-Guys.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-26T05:02:17.000Z",
    "description": "\n\tNed Fulmer revealed on Sunday that he’s struggled with multiple sclerosis for the past 12 years. \n\n\tThe internet personality and former member of Th",
    "body": "\n\tNed Fulmer revealed on Sunday that he’s struggled with multiple sclerosis for the past 12 years. \n\n\tThe internet personality and former member of The Try Guys broke the news in a video posted to YouTube on Nov. 23 titled “I Have MS.” Fulmer explained that in 2013, after experiencing numbness in his hands, arms and back over several days, he went to the hospital for an MRI. The results revealed lesions in his brain.\n\n\n\t“The doctor was like, ‘You probably have MS,’ and I was like, ‘What is that? Isn’t that really bad?” Fulmer recalled. “I was totally in denial, [I] didn’t want to have MS.”\n\t\n\n\tFulmer said he hoped the numbness would fade on its own and left the hospital. However, the symptoms worsened. He recalled a serious scare when he was walking to the bathroom in the middle of the night and collapsed from weakness. He was rushed to the hospital afterward for further testing and care.\n\n\tHe said of the incident, “I remember sitting in that hospital bed and it getting worse and just being so scared and wondering if I was going to be able to walk again.”\n\n\tLuckily, after he was given some medication, he was able to move his legs again. Fulmer said the recovery “felt like a miracle.” Now more than a decade ahead of his diagnosis, Fulmer shared that a recent MRI came back “clean,” but added he still struggles with “low-level sensory issues.”\n\n\t“I was keeping it a really big secret for a long time, and I don’t think that was very healthy for me,” Fulmer said. “I’m trying to be more open with it, just in conversation, and I am very grateful to be in remission, and I am very happy to be making this video.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Former Try Guy Ned Fulmer Reveals MS Diagnosis: I Wondered ‘If I Was Going to Be Able to Walk Again’",
      "image": [
        "https://variety.com/wp-content/uploads/2022/09/Ned-Fulmer-The-Try-Guys.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-26T05:02:17.000Z",
      "dateModified": "2025-11-26T05:02:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Education Through Music-Los Angeles Set to Honor Diane Warren – Film News in Brief",
    "url": "https://variety.com/2025/film/news/film-news-in-brief-nov-24-2025-1236590866/",
    "image": "https://variety.com/wp-content/uploads/2025/11/ETM-LA_DianeWarren_20251114_110150.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-26T00:05:00.000Z",
    "description": "\n\t\tTuesday, November 25\t\n\n\tEducation Through Music-Los Angeles is set to honor songwriter Diane Warren.\n\n\tIt will host the 20th Year Benefit Gala at t",
    "body": "\n\t\tTuesday, November 25\t\n\n\tEducation Through Music-Los Angeles is set to honor songwriter Diane Warren.\n\n\tIt will host the 20th Year Benefit Gala at the Skirball Cultural Center in Los Angeles on Jan. 27.\n\n\tIn addition to Warren, ETM-LA will present Shining Star Awards to Sonic Fuel Studios, and music educator Ryan Gonzales from James Monroe High School.\n\n\n\t“There is no better way of reaching young hearts and minds than music. What ETM-LA is doing is making that happen for so many who might never get the chance to experience the beauty and power of music,” said Warren.\n\t\n\n\tSonic Fuel Studios Co-Founder and composer Christopher Lennertz shared, “The mission of ensuring every child has access to quality music education at an early age is so vitally important.”\n\n\tHonorary chair members for the event include John Debney, Randy Jackson, Mike Knobloch, Rickey Minor, Lionel Richie, Randy Spendlove, Nia Vardalos, Paul Williams, and Renée Zellweger.\n\t\n\t\tTitle and Release Date Revealed for Adam Shankman’s RuPaul-Starring Film\t\n\n\tBleecker Street, Universal Pictures Content Group and World of Wonder have revealed the title and release date for Adam Shankman’s next film, starring RuPaul Charles. The film will be titled “Stop! That! Train!” and Bleecker Street will release it in theaters on May 29, 2026.\n\n\tThe campy action comedy follows two train stewardesses who upgrade their shifts from the Stank Rail to the luxurious Glamazonian Express. When a “Stormaganza” threatens to derail the train, the duo must team up with the snooty first-class attendants to save the passengers aboard the wild ride.\n\t\n\n\tIn addition to RuPaul playing President Gagwell, the film is filled with familiar faces from “RuPaul’s Drag Race.” Series favorites Ginger Minj and Jujubee play the main duo and are joined by Brooke Lynn Hytes, Latrice Royale, Marcia Marcia Marcia, Monét X Change and Symone in supporting roles.\n\n\t“Stop! That! Train!” was written by Connor Wright and Christina Friel and produced by Shankman and RuPaul alongside Fenton Bailey, Randy Barbato and Tom Campbell.\n\t\n\t\tMonday, November 24\t\n\t\n\t\tStudiocanal Launches New Label ‘Studiocanal on Stage’\t\n\n\tFollowing the West End opening of “The Producers” and with “Paddington the Musical” in previews, Studiocanal has announced the launch of “Studiocanal on Stage.” The new label is focused on the development, production and distribution of stage productions of the company’s film catalogue, as well as translating projects from stage to screen.\n\n\t“Studiocanal on Stage strengthens our strategy to develop and extend our IP across multiple formats,” said Anna Marsh, CEO of Studiocanal and Chief Content Officer of Canal+, in a statement. “Alongside Studiocanal Stories and Sixth Dimension, this new label gives us a clear framework to grow our catalogue and bring our stories to new audiences.”\n\n\t“The Producers” was adapted from the Studiocanal library film and is a revival of Mel Brooks’ musical, which won 12 Tony Awards, including best musical. The show runs through Sept. 2026. “Paddington” is adapted from Michael Bond’s beloved book series and the award-winning Studiocanal films, which have earned more than $700 million at the global box office. The musical production opens on Nov. 30 and is booked through May 2026.\n\n\tPrevious Studiocanal library films that have been adapted for the stage include “The Graduate,” “Evil Dead,” “The Ladykillers,” “Billy Elliot” and “The Third Man” (co-licensed with the estate of Graham Greene).\n\n\tOther productions set to debut this year include “Restless Natives,” “Summer Holiday” and “A Boy Called Christmas.” In development is “Kind Hearts and Coronets,” which inspired the upcoming film “How to Make a Killing.” Glen Powell and Margaret Qualley star in the movie, which opens in theaters next year via A24 in the U.S. Other titles include “The Belles of St. Trinians” and “The Proud Valley.”\n\t\n\n\tAlternatively, Studiocanal is also focused on bringing adaptations from stage to screen; the company is currently shooting the Danny Boyle-directed adaptation of James Graham’s “Ink” and is in post-production on “Pressure,” directed by Anthony Maras and based on David Haig’s critically acclaimed play.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Education Through Music-Los Angeles Set to Honor Diane Warren – Film News in Brief",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/ETM-LA_DianeWarren_20251114_110150.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-26T00:05:00.000Z",
      "dateModified": "2025-11-26T00:05:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "James Bond to Batman: Oscar Winner Chris Corbould Breaks Down the Art of Practical Spectacle at International Film Festival of India",
    "url": "https://variety.com/2025/film/festivals/james-bond-batman-oscar-winner-chris-corbould-sfx-iffi-1236592474/",
    "image": "https://variety.com/wp-content/uploads/2025/11/Ravi-Kottarakka-Chris-Courbould.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-26T04:15:18.000Z",
    "description": "\n\tAt the International Film Festival of India, Oscar-winning special effects supervisor Chris Corbould pulled back the curtain on four decades of big-",
    "body": "\n\tAt the International Film Festival of India, Oscar-winning special effects supervisor Chris Corbould pulled back the curtain on four decades of big-screen engineering — from tank chases and truck flips to collapsing houses and controlled explosions — insisting that the emotional power of spectacle still hinges on what can be achieved physically, not digitally. \n\n\tSpeaking at a masterclass moderated by Variety’s Naman Ramachandran, Corbould revisited his work on the James Bond and Christopher Nolan films and stressed that his guiding rule remains unchanged: do as much as possible in camera, and let technology support the story rather than overwhelm it.\n\t\n\n\tThe discussion was replete with anecdotes and movie clips that spanned some of cinema’s most ambitious practical stunts. Corbould, who won an Oscar award for best visual effects for “Inception,” explained that his philosophy has remained consistent throughout his career. Even as digital tools have evolved, he insisted that the strongest results come from collaboration, not replacement. “Digital is a fantastic tool,” he said, “but the minute you rely on it for everything, you start losing the emotional connection.”\n\n\n\tCorbould described his first step on any project as reading the script and asking how he can push originality. Sometimes this results in radical rethinking. Having worked on 15 Bond movies, he cited examples for a few including “GoldenEye”, recounting how a routine motorbike chase was transformed into the now-iconic tank sequence when Corbould proposed an out-of-the-box idea. Speaking about “No Time To Die”, he recalled scaling back an early version of the car chase because it threatened to overshadow the emotional tension between Bond and Madeleine: “What I learned over the years is, don’t get people going into a film just to see a spectacular effect. Everything should dovetail together – the actors, the storyline, the locations. That’s a complete film, not just me blowing something up.”\n\t\n\n\tChristopher Nolan’s influence loomed large over the discussion. Their long-running collaboration is anchored in a shared belief that digital effects should be used only when the physical is impossible. This mindset led to some of the most daring sequences in modern cinema, including the revolving corridor in “Inception” and the real-life truck flip in “The Dark Knight.” Corbould admitted he initially doubted whether the truck flip could be achieved safely, but Nolan refused any digital workaround. “He pushes you to your absolute limits,” Corbould said.\n\n\tMany of Corbould’s achievements border on engineering feats. The sinking house in “Casino Royale” required a huge interior set capable of tilting and descending into a massive tank, paired with a detailed miniature for exterior shots.\n\n\tHe also dispelled the myth that he enjoys blowing things up. Explosions, he noted, are the most stressful element of his job. He only relaxes once they’re finished. The record-breaking desert blast in “Spectre” – a single-take, practical effect stunt conducted in Morocco – “was never intended to be a world record” he said, but it was a shot that needed to look right.\n\n\tBeneath the spectacle, Corbould emphasised the countless hours of planning and safety checks that underpin every stunt, because the comfort and safety of actors and stuntmen is paramount. “The safety of the stunt driver and stunt people is totally non-negotiable,” he said.\n\n\tLooking toward the future, Corbould said of emerging AI tools that, just as digital effects once did, he believes they will find their place. “I hope directors keep valuing the physical craft,” he said. “Chris Nolan is the perfect example of that.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "James Bond to Batman: Oscar Winner Chris Corbould Breaks Down the Art of Practical Spectacle at International Film Festival of India",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/Ravi-Kottarakka-Chris-Courbould.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-26T04:15:18.000Z",
      "dateModified": "2025-11-26T04:15:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "LAPD Confirms Investigation of D4vd’s Trip to Santa Barbara Location",
    "url": "https://variety.com/2025/music/news/d4vd-lapd-santa-barbara-trip-investigation-1236592252/",
    "image": "https://variety.com/wp-content/uploads/2025/11/GettyImages-1643214581-e1764111191147.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-25T23:36:03.000Z",
    "description": "\n\tThe Los Angeles Police Department confirmed Tuesday they are investigating a trip singer D4vd took to the Santa Barbara area sometime during the spr",
    "body": "\n\tThe Los Angeles Police Department confirmed Tuesday they are investigating a trip singer D4vd took to the Santa Barbara area sometime during the spring of 2025 following the disappearance of Celeste Rivas Hernandez. \n\n\tThe teenage victim was most recently reported missing in April 2024 from Lake Elsinore, Calif., about 70 miles southeast of Los Angeles. Her deceased body was found Sept. 8 inside the trunk of a Tesla. She had been there “for an extended period of time,” the medical examiner’s office previously said.\n\t\n\n\tThe LAPD said in a statement they intended to “dispel some information” as stories from TMZ and other local news channels began circulating online this week. TMZ reported Rivas’ body was partially frozen when it was examined, but the LAPD disputed she was not frozen when she was discovered. LAPD additionally noted she had not been decapitated, as one rumor suggested.\n\n\n\tAs for the alleged trip Burke took, “we have evidence that D4vd travelled to the Santa Barbara area… The reason for that trip is still under investigation and we’ve drawn no conclusions at this point about the relevance of the trip to this case.”\n\n\tOn Nov. 25, the medical examiner’s office said the Los Angeles police blocked the county coroner’s office from releasing details about the death of the teen girl. \n\n\t“As far as the court order, the LAPD sought to seal the records of the Los Angeles County Medical Examiner’s investigation into Celeste Rivas’ death,” they said. “That order was sought only to ensure detectives from Robbery-Homicide Division learned of important information surrounding her death before the media and the public. The order was not sought to undermine transparency.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "LAPD Confirms Investigation of D4vd’s Trip to Santa Barbara Location",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/GettyImages-1643214581-e1764111191147.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-25T23:36:03.000Z",
      "dateModified": "2025-11-25T23:36:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ariana Grande Says ‘Certain People’ Wanted to Cut the ‘Wicked: For Good’ Door Scene Even Though ‘It’s One of the Most Beautiful Moments’ in Either Movie",
    "url": "https://variety.com/2025/film/news/ariana-grande-cut-wicked-for-good-door-scene-1236591074/",
    "image": "https://variety.com/wp-content/uploads/2025/11/2552_D046_00112_0120R_COMP-1.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-25T23:30:57.000Z",
    "description": "\n\tAriana Grande appeared on the “Shut Up Evan” podcast for a spoiler interview about “Wicked: For Good” and revealed that “certain people” wanted to c",
    "body": "\n\tAriana Grande appeared on the “Shut Up Evan” podcast for a spoiler interview about “Wicked: For Good” and revealed that “certain people” wanted to cut the shot of a door separating Elphaba and Glinda after they say their final goodbyes. The two characters break down in tears on opposite sides of the door. The image has since become a fan favorite on social media and is widely being praised as one of director Jon M. Chu’s most inspired directorial choices.\n\t\n\n\t“It was a really heavy day. There was actually a conversation about… certain people wanted to cut that shot,” Grande said. “Jon was like, ‘This is the movie. There is no question about it.’ I was so grateful for how fiercely he advocated for those honest moments. It’s one of the most beautiful and connected moments in both of the movies. I’m so grateful that it’s there. It’s tough. It was very hard emotionally.”\n\n\n\tChu previously told Variety that the door scene was not in the original script for the movie and was added after he spotted Erivo and Grande improvising a goodbye between their characters during the film’s rehearsal process. The two actors placed their hands against an imaginary door and Chu said he “started to weep.” \n\n\n\t“It was in rehearsals that we found it,” Chu said. “Cynthia grabs her and says, ‘Come here.’ And I’m like, where are they going? And they go to this corner, and she puts her in a box or a closet.”\n\n\tThe shot of the door splitting the characters comes right after Glinda tells Elphaba she loves them, which Chu also had to fight to keep in the movie since there is apparently a rule in the Oz franchise that characters do not express such a thought.\n\t\n\n\t“You’re not allowed to say ‘I love you’ in Oz,” Chu told Variety. “No God, no okay, no I love you… [but Ariana saying it] was so human. It crossed over a boundary of Oz into our world.” \n\n\tWatch Grande’s full interview on the “Shut Up Evan” podcast in the video below.\n\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ariana Grande Says ‘Certain People’ Wanted to Cut the ‘Wicked: For Good’ Door Scene Even Though ‘It’s One of the Most Beautiful Moments’ in Either Movie",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/2552_D046_00112_0120R_COMP-1.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-25T23:30:57.000Z",
      "dateModified": "2025-11-25T23:30:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Dancing With the Stars’ Finale: Who Took Home the Season 34 Mirrorball?",
    "url": "https://variety.com/2025/tv/news/dancing-with-the-stars-robert-irwin-wins-season-34-1236592205/",
    "image": "https://variety.com/wp-content/uploads/2025/11/180161_EM104251-1.jpg?w=903&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-26T04:02:49.000Z",
    "description": "\n\tSPOILER ALERT: This story contains spoilers from the Tuesday, Nov. 25 finale of “Dancing With the Stars.”\n\n\t“Dancing With the Stars'” biggest season",
    "body": "\n\tSPOILER ALERT: This story contains spoilers from the Tuesday, Nov. 25 finale of “Dancing With the Stars.”\n\n\t“Dancing With the Stars'” biggest season yet came to an end on Tuesday night as Alix Earle, Robert Irwin, Dylan Efron, Elaine Hendrix and Jordan Chiles battled for the Len Goodman mirrorball trophy. Plus, the hosts announced the episode received 72 million votes during the finale — double last year’s tally.\n\n\n\tEach team did three dances — judges’ pick, the insta dance and a freestyle. For their insta dance, the teams found out five minutes before their number which dance they’d be doing and to what song (which means they could have been practicing four different dances on top of their other two for the week).\n\t\n\n\tAlix and Val kicked off the show with a samba assigned by Carrie Ann Inaba, and it earned a perfect score of 30. Despite the next dance being their insta dance, no one would know they hadn’t prepared their high-energy cha-cha, which earned a perfect score. Of course, the most anticipated dance was the freestyle — something Val is always extremely good at. She was excited to show her confidence with the routine and did just that, earning a 30. Ultimately, she was the only one to earn a perfect score of 90/90 for the night.\n\n\n\tDylan and Daniella took on the past double at Bruno Tonioli’s request. While it wasn’t perfect, it still received a 10 from Bruno, then two 9s for a score of 27. For their insta dance, they chose a foxtrot. The ballroom absolutely exploded for the routine, as did the judges, who called it one of the best dances of the season and gave it a perfect 30. Their freestyle was one of the best of the night as well, as it featured a contemporary routine with the pair in water. Unsurprisingly, it earned a 30, bringing their night total to an 87/90.\n\t\n\n\tDerek Hough gave Elaine and Alan the rumba, and Bruno called the routine “pitch perfect.” So it was no surprise when it received a perfect 30. For their insta dance, they picked a quickstep. Although they had one misstep, they still received a score of 27/30. For the freestyle, the pair did a routine to “Chorus Line” with cameos by Andy Richter and Lisa Ann Walter. It earned a 30, bringing their score to an 87/90.\n\n\tDerek then assigned the quickstep to Robert and Witney. Despite suffering a rib injury during rehearsals, Derek and Bruno were wowed by his routine, with Derek calling him the “quickstep king.” They earned a score of 29/30. For their insta dance, they chose a cha cha — the one he said he didn’t want. Still, they managed to get a perfect 30. The freestyle was both emotional and full of energy, also getting a perfect score. Their final score was 89/90.\n\n\n\tJordan and Ezra were given the paso doble from Carrie Ann, going last in the first round. However, Carrie Ann pointed out the very small mistakes they made resulted in a score of 29/30. For their insta dance, the pair were happy to choose the tango. And it paid off, with the duo getting a perfect 30. The pair did the last freestyle of the night, and it seemed they saved the best for last. Carrie Ann said that it was the best freestyle she’s seen in 20 years, and it earned a perfect 30. Their overall score was 89/90.\n\n\tBefore announcing the winner, the show announced that the live tour will include Danielle Fishel, Andy Richter and Elaine Hendrix. Additionally, the finalists will make surprise appearances.\n\n\tIn the end, Robert Irwin took home the mirrorball trophy. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Dancing With the Stars’ Finale: Who Took Home the Season 34 Mirrorball?",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/180161_EM104251-1.jpg?w=903&h=563&crop=1"
      ],
      "datePublished": "2025-11-26T04:02:49.000Z",
      "dateModified": "2025-11-26T04:02:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Stranger Things’ Season 5 Preview: Where Did We Leave Off at the End of Season 4?",
    "url": "https://variety.com/2025/tv/news/stranger-things-4-recap-ending-explained-season-5-1236584631/",
    "image": "https://variety.com/wp-content/uploads/2022/07/Stranger-Things-4.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-26T01:00:00.000Z",
    "description": "\n\tIt’s time to start running up that hill again. But since it’s been more than three years since “Stranger Things” aired its fourth season finale, the",
    "body": "\n\tIt’s time to start running up that hill again. But since it’s been more than three years since “Stranger Things” aired its fourth season finale, the trek might be a little rough for those who haven’t re-binged the Duffer brothers’ hit Netflix series before it debuts Volume I of the fifth and final season Nov. 26 at 5pm PT.\n\n\tSince carving out a 2-hour, 21-minute window to re-watch the “Stranger Things” Season 4 finale before you carve the bird on Thanksgiving Day isn’t a possibility for everyone, Variety has a character-by-character recap of where everyone in Hawkins circa 1986 left off ahead of Season 5. So see below for where Eleven and the gang were at the end of “Stranger Things” Season 4, before we return to the Upside Down this Thanksgiving.\n\t\n\n\tEleven\n\n\n\tShe’s back in Hawkins — actually, everyone is now. At the end of Season 5, Eleven (Millie Bobby Brown) is with Mike, Will, Joyce, Hopper, Nancy and Jonathan in a field in Hawkins, watching as the Upside Down seeps up into the Indiana town. Ash-like material darkens the air, coming out of the giant cracks in the world Vecna ripped open by using the lives of four people, including the now-comatose Max, to open four gates from the Upside Down.\n\n\tEleven has discovered that Vecna is also Henry Creel and One (the first subject of Dr. Brenner’s). Eleven has also learned that she is responsible for pushing him into the Upside Down, when she rejected his offer to transform the world together, essentially creating Vecna, the evil she and her friends have been fighting.\n\n\tShe tried to save Max from Vecna through dream walking into Max’s brain, but managed only to bring Max back to life after she technically died for long enough for the fourth gate into the Upside Down to open.\n\t\n\n\tVecna/Henry Creel/One\n\n\tVecna (Jamie Campbell Bower) once wanted to join forces with Eleven, back when he was One/Henry Creel, to reshape the world into his own twisted vision. After Eleven unintentionally threw him into the Upside Down and made him into his current form, Vecna began to seek out ways to reach the outside world and control kids in Hawkins — like Will and Max.\n\n\tThough Eleven tried to take him out during her dream-walking in Max’s mind, and Steve, Nancy and Robin blasted him with shotguns and torched his body in the Upside Down, Will can feel his presence and knows he’s not dead.\n\n\tMike Wheeler\n\n\tMike (Finn Wolfhard) is back in Hawkins, and back on good terms with his girlfriend, El. With Will’s help, Mike supported Eleven through her dream-walking battle with Vecna in Max’s mind. However, Mike is unaware that Will has feelings for him, and is suffering in silence over this unrequited love, all as the Upside Down enters Hawkins.\n\n\tWill Byers\n\n\tWill (Noah Schnapp) feels Vecna’s presence in the final moments of “Stranger Things 4,” confirming that he has not been killed and that Will’s connection to the Upside Down is still intact. Will worked with Mike, Jonathan and Argyle to get Eleven access to Max’s mind via dream-walking so El could try to save Max and everyone else from Vecna from afar.\n\n\tDespite his romantic feelings for Mike, Will encouraged Mike to offer his love and support to El to help her try to defeat Vecna. After spending Season 4 living with his brother Jonathan, his mom Joyce and El in California, he and the rest of his family have now returned to Hawkins to help in the fight.\n\n\tLucas Sinclair\n\n\tLucas (Caleb McLaughlin) had spent the season trying to save Max from Vecna and repair their romantic relationship after she became depressed following her stepbrother Billy’s death. Lucas stayed with her while Vecna entered her mind and tried to bring her back with the trigger of her favorite song, Kate Bush’s “Running Up That Hill,” but her heart stopped. Max was revived by Eleven through dream-walking, but the damage was done, and Max is now in a coma in the hospital with Lucas staying close by her side.\n\n\tDustin Henderson\n\n\tDustin (Gaten Matarazzo) watched Eddie Munson die after they valiantly fought off a mess of Demobats in the Upside Down to give Steve, Nancy and Robin coverage while they went to attack Vecna. As a result, everyone else was able to safely return home, and Dustin told the story of Eddie’s heroism to Eddie’s uncle, knowing the rest of the town still thinks Eddie is a villain and responsible for several deaths in Hawkins.\n\t\n\n\tMax Mayfield\n\n\tCurrently comatose in the hospital. All Max’s (Sadie Sink) bones were broken by Vecna, and she was dead for a full minute before being brought back to life via dream-walking by Eleven. Lucas is by her side in the hospital, hoping she pulls through and wakes up, though the doctors say she may never come out of her coma.\n\n\tSteve Harrington\n\n\tSteve (Joe Keery) survived the fight against Vecna alongside Nancy and Robin in the Creel House in the Upside Down. He’s returned with the gang to Hawkins, but they have no idea where Vecna has gone to after they couldn’t find the body.\n\n\tNancy Wheeler\n\n\tNancy (Natalia Dyer) fought Vecna, shooting him, along with Steve and Robin, who managed to torch him with fire and send him flying through the attic window of the Creel House in the Upside Down. However, his body was missing before they could confirm his death. At one point during a trance, Nancy walked through Vecna’s memories and learned his backstory as the troubled Henry Creel.\n\n\tJonathan Byers\n\n\tJonathan (Charlie Heaton) returned to Hawkins alongside Will, Mike and Eleven. He’s spent time consoling his brother, Will, who is clearly heartbroken over his unrequited feelings for Mike. When Jonathan and girlfriend Nancy are reunited, he makes a crack about Nancy’s ex, Steve, and Nancy refutes it. Before the Upside Down begins to creep into Hawkins, Jonathan asks Nancy if things are OK between them in their romantic relationship, and she responds with an unconvincing yes.\n\n\tRobin Buckley\n\n\tRobin (Maya Hawke) survived the Vecna battle with Nancy and Steve in the Upside Down. Upon returning to the now-in-shambles Hawkins, she finds a silver lining: her crush, Vickie, is potentially returning her affections.\n\n\tJim Hopper\n\n\tHopper (David Harbour) is back from his hostage situation in Soviet Russia, and reunited with Eleven, thanks to a rescue mission led by Joyce. While in the U.S.S.R., he fought off a Demogorgon in hopes of weakening the overall power of the Upside Down to help out the kids back home.\n\n\tJoyce Byers\n\n\tJoyce (Winona Ryder) returned Hopper safe and sound to the mess that is Hawkins. They were even talking about finally making it to their date at Enzo’s — though that’s likely going to be difficult with the giant cracks in the world.\n\t\n\n\tErica Sinclair\n\n\tErica (Priah Ferguson) was at the Creel House in the Rightside Up when Vecna took over Max, and she called the ambulance for Lucas to get Max help after Vecna broke all the bones in her body. Erica is with the rest of the crew in Hawkins as the Upside Down seeps into the world.\n\n\tThe Wheelers\n\n\tThe other members of Mike and Nancy’s family — mom Karen (Cara Buono), dad Ted (Joe Chrest) and little sister Holly (played in Season 5 by Nell Fisher) — were all at home when the ground cracked open. Young Holly is seemingly able to notice what is going on more so than her parents, and appears to perceive the impact the unseen Vecna is having on their world.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Stranger Things’ Season 5 Preview: Where Did We Leave Off at the End of Season 4?",
      "image": [
        "https://variety.com/wp-content/uploads/2022/07/Stranger-Things-4.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-26T01:00:00.000Z",
      "dateModified": "2025-11-26T01:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Ramayana’ Aims to Set New Global Benchmark for VFX, Director Reveals at WAVES Film Bazaar",
    "url": "https://variety.com/2025/film/news/ramayana-global-benchmark-vfx-1236592303/",
    "image": "https://variety.com/wp-content/uploads/2025/11/VFX-panel.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-26T00:10:27.000Z",
    "description": "\n\tNitesh Tiwari said his upcoming “Ramayana,” described as India’s most expensive film, is being built to deliver a level of visual scale and craftsma",
    "body": "\n\tNitesh Tiwari said his upcoming “Ramayana,” described as India’s most expensive film, is being built to deliver a level of visual scale and craftsmanship that can stand alongside the world’s top VFX productions, telling a WAVES Film Bazaar audience that the epic demands “something visually so stunning that it becomes a benchmark for the whole world.” \n\n\tSpeaking about a five-year process of virtual production, motion capture and world-building with Prime Focus, Tiwari detailed the ambition and pressure behind reimagining the mythological saga while fellow filmmakers Prasanth Varma and Ashwin Kumar stressed that technology must serve story, not drive it.\n\t\n\n\tThe directors, in the forefront of India’s visual-effects boom, joined moderator Rajiv Chilaka of Green Gold Animation to discuss how technology is reshaping Indian cinema. They drew on their specific experiences with films in a conversation that explored India’s expanding creative capabilities, cutting-edge technologies, and the growing demand for high-quality VFX across films, streaming, and animation.\n\n\n\tNitesh Tiwari spoke on the ambition of “Ramayana,” and about the scale and responsibility of imagining the epic tale into a VFX film. “Ramayana” deserves to be told in the grandeur it deserves… something visually so stunning that it becomes a benchmark for the whole world,” he said. Working with one of the world’s leading VFX studios (Prime Focus) has been “scary, liberating, and mind-numbing all at the same time,” he said.\n\n\tHe described a five-year journey of learning and adapting to virtual production, motion capture, and world-building. “It took me two years to come to terms with the fact that I was making such a big film… Today I’m very comfortable, but it wasn’t easy, and we are still one year away from the release of the first part,” he said.\n\t\n\n\tPrasanth Varma, whose Telugu-language superhero film “HanuMan” became a pan-India hit, emphasised that technology alone cannot drive success. “Films work because of stories. All other crafts, including VFX, help in telling that story in a grand way.”\n\n\tSelf-taught in VFX, editing, and cinematography, Varma, who is working on “Jai Hanuman” revealed his practical approach. “Either you give the artist a lot of time or you have a lot of money… We didn’t have money, but we had time.”\n\n\tAshwin Kumar spoke about his breakout animated hit “Mahavatar Narsimha” and about building films from sheer determination. As he moves to his next project, “Mahavatar Parshuram,” the second in the “Mahavatar” animated cinematic universe, Kumar said AI is a useful catalyst to get to a final outcome faster. Kumar believes the next five years will redefine filmmaking: “We are at the cusp and in five years, there will probably be an AI film that will make you cry.”\n\n\tOn the topic of animated films, Tiwari said it was on his “bucket list to do an animation film based on Indian locations, Indian characters and story but for the world.”\n\n\tThe discussion emphasised how innovation, talent, and ambition are propelling India forward in visual effects and redefining cinematic possibilities adding that VFX and technology cannot be the starting point for the idea, but can be enablers of the idea.\n\n\tWAVES Film Bazaar is the market component of the International Film Festival of India (IFFI), Goa. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Ramayana’ Aims to Set New Global Benchmark for VFX, Director Reveals at WAVES Film Bazaar",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/VFX-panel.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-26T00:10:27.000Z",
      "dateModified": "2025-11-26T00:10:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "WAVES Film Bazaar’s Screenwriters Lab Emerges as Vital Development Pipeline for Indian Cinema: ‘Nothing Is More Important Than the Filmmaker’s Voice’",
    "url": "https://variety.com/2025/film/markets-festivals/film-bazaar-screenwriters-lab-vital-development-pipeline-1236592323/",
    "image": "https://variety.com/wp-content/uploads/2025/11/Screenwriters-lab.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-26T00:32:46.000Z",
    "description": "\n\tThe National Film Development Corporation’s Screenwriters Lab at the WAVES Film Bazaar has established itself as a crucial launching pad for indepen",
    "body": "\n\tThe National Film Development Corporation’s Screenwriters Lab at the WAVES Film Bazaar has established itself as a crucial launching pad for independent Indian filmmakers, providing rare development support in a market where such resources remain scarce.\n\n\tThe lab, which develops eight projects annually, offers writers an intensive four-to-six-month mentorship with international script consultants, filling what filmmaker and lab mentor Bikas Mishra describes as a critical gap in the Indian film ecosystem.\n\t\n\n\t“There is no other development support, definitely in India, mostly not in South Asia,” said Mishra, whose film “Chauranga” was developed through the program. “Independent filmmakers, they are expected to go with a fully developed script to a producer and pitch it. But this crucial phase of the journey of a story, where it develops from a story to a screenplay, there is neither financial support nor expert support.”\n\n\n\tThe program has produced notable successes including “The Lunchbox” and Ajit Pal Singh’s “Fire in the Mountains,” which premiered at Sundance. More recently, Diwa Shah’s project “Kyab” secured a spot in the Cannes La Résidence program, where she spent six months in Paris before winning the pitching forum at the Cannes Film Festival.\n\n\tScript consultant Claire Dobbin, who has worked with the lab for several years, emphasized the program’s unique position within India’s film industry infrastructure. “People recognize that the screenwriters Lab is a key development program,” Dobbin said. \n\n\tThe lab attracts projects from across India’s regions, deliberately seeking voices beyond traditional urban film centers. Participants work one-on-one with expert mentors drawn from international development programs. The lab’s framework was established by Marten Rabarts, who previously headed Binger Film Lab.\n\t\n\n\tUpon completing the program, filmmakers pitch their projects to international collaborators, producers, festivals and funding bodies at Film Bazaar. Mishra secured coin from the Gothenburg Film Festival’s development fund for “Chauranga,” marking the first funding for his project.\n\n\t“That meant a lot. That’s the first money that flew into the ‘Chauranga’ projects account,” Mishra said.\n\n\tDobbin noted the program’s evolution over recent years, with stronger projects entering the pipeline as understanding of development processes grows within the industry. “Initially, because there’s not a huge history of development in industry, the projects, many of them were not of a sufficiently high standard,” she said. “But we are now attracting compelling projects and actually compelling filmmakers with strong projects.”\n\n\tThe lab includes three sessions over its duration, featuring lectures on screenplay craft alongside individual mentorship. Topics range from technical aspects like opening sequences to broader questions about when established screenwriting conventions should be challenged.\n\n\tDobbin contrasted the lab’s approach with mainstream Bollywood production, which she suggested suffers from an echo chamber effect. “You don’t make the future by looking at the past. You make the future by coming up with new ideas,” she said. “The world was completely thunderstruck by ‘All We Imagine As Light,’ because it was the most powerful, poetic, imaginative world.”\n\n\tThis year’s mentors include Dobbin, New Zealand-based Christina Andreef and Indian filmmaker Umesh Kulkarni, with each writer receiving guidance from one or two mentors throughout the program.\n\n\tThe lab’s focus on distinctive regional voices positions it as what Dobbin called “a diamond in the NFDC crown,” preparing filmmakers for international markets while helping them develop their unique artistic perspectives.\n\n\t“What these filmmakers are developing here is their voice,” Dobbin said. “Nothing is more important than the filmmaker’s voice.”\n\n\tWAVES Film Bazaar is the market component of the International Film Festival of India (IFFI), Goa. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "WAVES Film Bazaar’s Screenwriters Lab Emerges as Vital Development Pipeline for Indian Cinema: ‘Nothing Is More Important Than the Filmmaker’s Voice’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/Screenwriters-lab.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-26T00:32:46.000Z",
      "dateModified": "2025-11-26T00:32:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Simu Liu Says the ‘Backslide’ of Asian Representation in Hollywood Is ‘F—ing Appalling’: ‘Studios Think We Are Risky’",
    "url": "https://variety.com/2025/film/news/simu-liu-backslide-asian-representation-hollywood-appalling-1236592508/",
    "image": "https://variety.com/wp-content/uploads/2025/11/GettyImages-2246612442.jpg?crop=0px%2C141px%2C5537px%2C3114px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-11-26T05:49:54.000Z",
    "description": "\n\tSimu Liu took to Threads on Sunday to post a fiery message about the “backslide” of Asian representation in Hollywood. In the post, he included soci",
    "body": "\n\tSimu Liu took to Threads on Sunday to post a fiery message about the “backslide” of Asian representation in Hollywood. In the post, he included social media reports about Asian actors struggling to find fulfilling roles.\n\n\t“Put some Asians in literally anything right now,” he wrote. “The amount of backslide in our representation onscreen is fucking appalling. Studios think we are risky.”\n\n\n\tDespite this perceived risk, Liu listed several films starring Asian actors that were critical successes, including “Minari,” “Farewell,” “Past Lives,” “Everything Everywhere All At Once,” “Crazy Rich Asians” and his Marvel tentpole “Shang-Chi and the Legend of the Ten Rings.”\n\t\n\n\tHe added, “Every single one a financial success. No Asian actor has ever lost a studio even close to 100 million dollars but a white dude will lose 200 million TWICE and roll right into the next tentpole lead.We’re fighting a deeply prejudiced system. And most days it SUCKS.”\n\n\tLiu has a history of being vocal on social media, especially when it comes to speaking out against right-leaning politics. He told Variety in a recent interview that he “should probably be more scared” of backlash, but his appetite to speak his mind and stand up for what he believes often overcomes his fears.\n\n\t“I just feel like there’s something about the internet that makes people just crazy,” Liu said. “There’s something about the publicness of it and where people love being the guy to put someone else down [or] put an entire group of people down. I am so not for that energy.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Simu Liu Says the ‘Backslide’ of Asian Representation in Hollywood Is ‘F—ing Appalling’: ‘Studios Think We Are Risky’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/GettyImages-2246612442.jpg?crop=0px%2C141px%2C5537px%2C3114px&resize=1000%2C563"
      ],
      "datePublished": "2025-11-26T05:49:54.000Z",
      "dateModified": "2025-11-26T05:49:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'RHOSLC' Mary Cosby's Son Robert Jr.'s Wife Files For Divorce",
    "url": "https://www.tmz.com/2025/11/25/rhoslc-mary-cosby-son-robert-jr-wife-files-divorce/",
    "image": "https://imagez.tmz.com/image/5a/16by9/2025/11/25/5ad0c7f48cb3403da475f108756d1569_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-26T01:14:21.000Z",
    "description": "\n    \n                    \n                          'RHOSLC' Mary Cosby\n                          Son Robert's Wife Files For Divorce\n               ",
    "body": "\n    \n                    \n                          'RHOSLC' Mary Cosby\n                          Son Robert's Wife Files For Divorce\n                      \n                  \n                        Published November 25, 2025 5:14 PM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Thanksgiving arrives with a side of family drama for \"Real Housewives of Salt Lake City\" star Mary Cosby ... because her son is going through a divorce.\n      \n    \n          Robert Cosby Jr.'s wife, Alexiana Smokoff, beelined it to a Utah court Monday and filed to divorce the reality star's son ... according to new legal documents obtained by TMZ.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          The docs — which were filed in Utah — are under seal ... so, at least for now, there's no way of knowing the reason for the split ... ditto for any details on what she’s looking for in terms of spousal support, division of property, etc.\n      \n\n          Robert's appeared on 'RHOSLC' a few times over the years ... and during season 4 there was a storyline about Mary learning Robert had secretly gotten married right under her nose. The wedding reportedly went down in August 2022 at a courthouse.\n      \n    \n          The estranged couple does not have any kids together and they apparently had been living in Mary's Utah mansion ... as best we can tell from the show.\n      \n    \n          'RHOSLC' also made Robert and Alexiana's alleged drug problems a big part of Mary's storyline.\n      \n    \n          We reached out Mary and her son ... so far no word back.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Mary Cosby\n              \n                          \n                Celebrity News\n              \n                          \n                Reality TV\n              \n                          \n                Real Housewives\n              \n                          \n                Celebrity Divorce\n              \n                          \n                Exclusive\n              \n                          \n                Fairly Legal\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'RHOSLC' Mary Cosby's Son Robert Jr.'s Wife Files For Divorce",
      "image": [
        "https://imagez.tmz.com/image/5a/16by9/2025/11/25/5ad0c7f48cb3403da475f108756d1569_xl.jpg"
      ],
      "datePublished": "2025-11-26T01:14:21.000Z",
      "dateModified": "2025-11-26T01:14:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rosie Mee In \"We Bought A Zoo\" 'Memba Her?!",
    "url": "https://www.tmz.com/2025/11/26/rosie-mee-we-bought-a-zoo/",
    "image": "https://imagez.tmz.com/image/6c/16by9/2025/11/19/6c203b73b0214f45ae5314be12bad02c_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-26T08:01:22.000Z",
    "description": "\n    \n      \n        \n        \n          Launch Gallery\n        \n                  Shutterstock Premier\n              \n    \n    \n          Retired chi",
    "body": "\n    \n      \n        \n        \n          Launch Gallery\n        \n                  Shutterstock Premier\n              \n    \n    \n          Retired child star Maggie Elizabeth Jones was only 8 years old when she played Rosie Mee  -- the innocent and pure hearted kiddo -- in the family/comedy film \"We Bought A Zoo\" back in 2011.\n      \n    \n          Other noteworthy stars from the film include Matt Damon, Scarlett Johansson, and Elle Fanning.\n      \n    \n          Guess what she looks like now in her 20s!\n      \n      ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rosie Mee In \"We Bought A Zoo\" 'Memba Her?!",
      "image": [
        "https://imagez.tmz.com/image/6c/16by9/2025/11/19/6c203b73b0214f45ae5314be12bad02c_xl.jpg"
      ],
      "datePublished": "2025-11-26T08:01:22.000Z",
      "dateModified": "2025-11-26T08:01:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Guess the Tatted 'Manic' Singer Popping Out Her Bikini",
    "url": "https://www.tmz.com/2025/11/25/guess-the-singer-bikini-manic/",
    "image": "https://imagez.tmz.com/image/07/16by9/2025/11/25/075db886623a4e3ca968c3e24a09bee7_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-25T22:57:27.000Z",
    "description": "\n    \n                    \n                          Guess The\n                          Sexy Singer Whose Bikini Snap Screams 'Now or Never!'\n       ",
    "body": "\n    \n                    \n                          Guess The\n                          Sexy Singer Whose Bikini Snap Screams 'Now or Never!'\n                      \n                  \n                        Published November 25, 2025 2:57 PM PST\n                                                                            \n      \n    \n          This sexy tatted singer just dropped a fire bikini snap that'll make fans pick their jaw up off the floor ... and say, \"Be Kind.\"\n      \n    \n          The singer-songwriter and actress has snapped up a slew of awards over her career ... and was even once named one of Time's 100 most influential people in the world.\n      \n    \n          Still unsure? Hit up the gallery for the reveal!\n      \n      \n      \n          \n            \n              \n                \n                Share on Facebook\n              \n            \n            \n              \n                \n                Share on X\n              \n            \n                          \n                \n                  \n                \n              \n                      \n        \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Guess Who\n              \n                          \n                Music\n              \n                          \n                Fairly Legal\n              \n                      \n        \n          \n  ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Guess the Tatted 'Manic' Singer Popping Out Her Bikini",
      "image": [
        "https://imagez.tmz.com/image/07/16by9/2025/11/25/075db886623a4e3ca968c3e24a09bee7_xl.jpg"
      ],
      "datePublished": "2025-11-25T22:57:27.000Z",
      "dateModified": "2025-11-25T22:57:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'Seeking Sister Wife' Star Garrick Merrifield Arrested",
    "url": "https://www.tmz.com/2025/11/25/garrick-merrifield-arrested/",
    "image": "https://imagez.tmz.com/image/e0/16by9/2025/11/26/e061b3dc5c9d49809a9f81e1f7ec3d2b_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-26T03:21:48.000Z",
    "description": "\n    \n                    \n                          'Seeking Sister Wife' Star Garrick Merrifield\n                          Arrested For Alleged Dome",
    "body": "\n    \n                    \n                          'Seeking Sister Wife' Star Garrick Merrifield\n                          Arrested For Alleged Domestic Violence\n                      \n                  \n                        Published November 25, 2025 7:21 PM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          \"Seeking Sister Wife\" star Garrick Merrifield is juggling a lot these days ... he's got a couple wives, a baby and three other kids ... and now he's got some legal trouble to deal with ... because he just got busted for misdemeanor domestic violence ... TMZ has learned.\n      \n    \n          Garrick was arrested Monday in Chaffee County and has since bonded out of jail ... according to a jail spokesperson. According to online court records he's facing a charge of telephone-obstruct service.\n      \n    \n          Its currently unclear what exactly went down to land the reality star behind bars.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Garrick married a Brazilian woman, Lorrana, in October 2024 and this past July they welcomed their first child together ... a daughter.\n      \n    \n          He is in a plural marriage with his first wife, Dannielle. They have three older children together and they legally divorced years ago so Garrick could marry two other women ... both from Brazil.\n      \n    \n          Garrick, Danielle, Lorrana and the four children all appeared to be living together at the time of his arrest.\n      \n    \n          We've reach out to Garrick for comment ... so far, no word back.\n      \n      \n              \n          \n                          \n                Fairly Legal\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Seeking Sister Wife' Star Garrick Merrifield Arrested",
      "image": [
        "https://imagez.tmz.com/image/e0/16by9/2025/11/26/e061b3dc5c9d49809a9f81e1f7ec3d2b_xl.jpg"
      ],
      "datePublished": "2025-11-26T03:21:48.000Z",
      "dateModified": "2025-11-26T03:21:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Xochitl Gomez Supports Robert Irwin Ahead of 'DWTS' Finale Amid Romance Rumors",
    "url": "https://www.tmz.com/2025/11/25/robert-irwin-xochitl-gomez-dwts-backstage-finale/",
    "image": "https://imagez.tmz.com/image/73/16by9/2025/11/26/7311ef02e7174e91a552255653fa4fdf_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-26T01:36:47.000Z",
    "description": "\n    \n                    \n                          'DWTS' Robert Irwin\n                          Visit From Xochitl Before Finale ...\n              ",
    "body": "\n    \n                    \n                          'DWTS' Robert Irwin\n                          Visit From Xochitl Before Finale ...\n                          Are They An Item Now?!?\n                      \n                  \n                        Published November 25, 2025 5:36 PM PST\n                                                                            \n      \n    \n          Robert Irwin and Xochitl Gomez are doing little to dispel rumors they're dating ... in fact, it's quite the opposite ... because they were spotted hanging out before his big \"Dancing With The Stars\" finale.\n      \n    \n          Check out these photos from backstage on the 'DWTS' lot Tuesday ... looks like Xochitl paid her rumored man a little visit.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Robert's one of the four finalists and he and Xochitl look pretty comfortable together ... they chatted, hugged from the side and she brought him a flower bouquet.\n      \n\n          Plus, folks who were there say Xochitl also spent some time backstage with Robert's family.\n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com - Disney/Eric McCandless\n          \n    \n          Robert danced around the dating rumors a couple weeks ago when he asked him about Xochitl at 'DWTS' practice ... but they're looking more and more like an item.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Xochitl's super familiar with 'DWTS' ... she won the whole darn thing on season 32 and earlier this season she teamed up with Robert for a dance.\n      \n    \n          The alarm bells are really going off now ... new couple alert?!?\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Robert Irwin\n              \n                          \n                Celebrity News\n              \n                          \n                Reality TV\n              \n                          \n                Relationships\n              \n                          \n                Gossip / Rumors\n              \n                          \n                Exclusive\n              \n                          \n                Dancing with the Stars\n              \n                          \n                Fairly Legal\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Xochitl Gomez Supports Robert Irwin Ahead of 'DWTS' Finale Amid Romance Rumors",
      "image": [
        "https://imagez.tmz.com/image/73/16by9/2025/11/26/7311ef02e7174e91a552255653fa4fdf_xl.jpg"
      ],
      "datePublished": "2025-11-26T01:36:47.000Z",
      "dateModified": "2025-11-26T01:36:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]