[
  {
    "title": "Kiernan Shipka on Loving How ‘Industry’ Role — Featuring a Threesome in a Castle — ‘Challenges’ Former Child-Star Status: ‘People Have Known Me Since I Was 6’",
    "url": "https://variety.com/2026/tv/global/kiernan-shipka-industry-threesome-sex-scene-child-star-1236639928/",
    "image": "https://variety.com/wp-content/uploads/2026/01/IND_406_250620_SR_132515_V1.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-26T04:00:00.000Z",
    "description": "\n\tSPOILER ALERT: This story contains plot details for “Habseligkeiten,” Season 4, Episode 3 of HBO’s “Industry,” now streaming on HBO Max.\n\n\tAnyone wh",
    "body": "\n\tSPOILER ALERT: This story contains plot details for “Habseligkeiten,” Season 4, Episode 3 of HBO’s “Industry,” now streaming on HBO Max.\n\n\tAnyone who last saw Kiernan Shipka as little Sally Draper in “Mad Men,” or even as wand-waving adolescent Sabrina Spellman in “Sabrina the Teenage Witch,” may well blink twice upon seeing her latest role as Hayley Clay in “Industry.”\n\n\n\tIn the first scenes of the Season 4 opener alone, she’s popping pills in a nightclub, getting frisky on the dance floor (with Charlie Heaton’s Jim, also a new character) and giving colorful descriptions of her vagina to her new acquaintance back at her — quite impressive — apartment. And this all before Hayley is eventually introduced as an executive assistant at shady financial startup Tender.\n\t\n\n\tBut it’s Episode 3 that truly kicks whatever remaining child-star status Shipka has left firmly into the annals of TV history in a scene in which she’s playfully encouraged to have sex with trouble aristocrat Henry Muck (Kit Harington) by his deviously manipulative wife Yasmin (Marisa Abela). Hayley obliges, perhaps too enthusiastically, prompting Yasmin to get involved in the action herself so as not to be outdone in the endless game of power play. Naturally, with this being “Industry,” and a season in which creators Konrad Kay and Mickey Down have all but blown the doors off the show’s financial roots, this threesome takes place in a medieval Austrian castle run by a family of fascists, where paintings by an “A. Hitler” hang on the walls.\n\n\tAs Shipka notes, “Industry” is a show that is not only “brave and it’s rule-breaking and it’s pushing limits” — but it’s a show that manages to “get away” with it.\n\t\n\t\n\t\tAt first, Hayley seems to be the doting assistant, albeit one who also likes to go out and hook up and take drugs. But we see more of her identity as show moves on. How would you describe her?\t\n\n\tWhen I taped for the show, it was pretty much the opening sequence, and then it was a scene from a later episode. And I was kind of going, “Who is she, who is this girl?” I could sense that she was playing some sort of game, and was also wild and living her life, and had a much grittier, more raw quality to her, given how much she explodes within the first five minutes of meeting her. But I really didn’t know what she was all about.\n\t\n\t\tAnd then what did you later find out at her?\t\n\n\tOnce I came on, I read the first four scripts, and I talked to Mickey and Konrad about what her later arc was going to be, and got to really map out this real long game that she plays. I find Hayley to be an incredibly smart and calculated and oftentimes deceptive character. I think that she is playing a game of chess and is sort of figuring out what kind of chess piece each moment is after she lives out the moment. She’s very emotionally linked to all these people as the show goes on — I think her business is interpersonal relationships, these complicated power dynamics with other people. And that was so fun to play. She’s got a real “dive in, nothing to lose” quality to her that I really liked. As calculated and fine-tuned as I found her, I also found that she didn’t have this “Am I doing the right thing?” thing, and had a forward movement to her game that was intoxicating.\n\n\n\n\t\n\n\t\t\t\t\tKiernan Shipka in “Industry”\n\t\n\n\n\t\n\t\tWe have to talk about the threesome scene in Episode 3 with Yasmin and Henry. There’s a lot of power play going on in there. At first it seems like Yasmin is being manipulative over Henry, and merely using Hayley, but this seems to quickly turn. How did you see it?\t\n\n\tIt’s such an important scene for all three characters. But what I think is so interesting about that scene is that everybody’s got this wildly different emotional arc: You’re doing something together, but everyone is on kind of their own journey. The actual physical nature of the scene came last for me. It was much more about what this meant for Hayley — why she was doing it, and what she kind of knew she was getting herself into. And obviously, for Marisa and for Kit, it was equally about where their characters were and why they had found themselves in the situation, and what it meant for them. And for those three worlds to come and collide and feel all those different energies, it was a really interesting moment. And a really fun thing to do.\n\t\n\t\n\t\t“Industry” has been daring throughout the last three seasons, but I think there are some lines in that scene that will still raise eyebrows. When you read the script, was there a part of you that was like “Oh, ok, this is what we’re doing then?”\t\n\n\tThe amount of stuff that I that I read and went, “Oh, I guess I’m saying that!” I’ve never been on a show where I’ve read the scene, and then in real time gone, “Oh, wait, no, no, I’m actually doing that.” But also, at the same time, I feel like we’re in such good hands. And that’s why the show, for lack of a better term, gets away with this stuff as it’s done, in such a careful, tasteful manner. But it’s brave and it’s rule-breaking and it’s pushing limits. And I think that’s why everyone’s excited about it.\n\t\n\t\tI hope it wasn’t your first day on set…\t\n\n\tNo, that would be a different story! But we’d shot some stuff, so I knew everyone by then!\n\t\n\t\tThere’s a bit of editing from the sex scene straight into Yasmin eating oysters for breakfast that is quite wonderful.\t\n\n\tIt is! And that was in the script. So it’s really testament to Mickey and Konrad knowing exactly what kind of show they wanted to make.\n\n\n\n\t\n\n\t\n\n\n\t\n\t\tCasting director Julie Harkin said she really wanted to give you a role that was something completely against what audiences have seen you in before. As someone who last saw you in “Mad Men,” this is obviously very different. Was that a consideration of yours as well going into this?\t\n\n\tYeah, it was really exciting. I and I’m very grateful to Julie and to Mickey and to Konrad for seeing me in this part, because she is different and she’s more grown up. I mean, I’m 26 now, but people have known me since I was 6. And I’m very aware of what kind of weight that holds. So for them to say, “Hey, I think she’s the girl for Hayley,” is very exciting for me. It’s a part I love. So I was definitely aware that I was doing something more mature. But I wasn’t really thinking, “I’ve really got to do this sort of thing next.” It’s about the people and the material. But when it can also be something that challenges someone’s perspectives of me as a performer and when it goes up against stuff I’ve done previously, that’s so exciting and so fun.\n\n\tThis interview has been edited and condensed.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kiernan Shipka on Loving How ‘Industry’ Role — Featuring a Threesome in a Castle — ‘Challenges’ Former Child-Star Status: ‘People Have Known Me Since I Was 6’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/IND_406_250620_SR_132515_V1.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-26T04:00:00.000Z",
      "dateModified": "2026-01-26T04:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Frank & Louis’ Review: Kingsley Ben-Adir and Rob Morgan Give Immaculate Performances in a Stoically Moving Story of Prison Care",
    "url": "https://variety.com/2026/film/reviews/frank-and-louis-review-1236640495/",
    "image": "https://variety.com/wp-content/uploads/2026/01/uxabhzxtnFrank__Louis-Still_1.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-26T03:00:00.000Z",
    "description": "\n\tLife behind bars means death behind bars, and all the pain and frailty that often precedes it — a fate that awaits a good number of America’s incarc",
    "body": "\n\tLife behind bars means death behind bars, and all the pain and frailty that often precedes it — a fate that awaits a good number of America’s incarcerated millions, though one we rarely see discussed or depicted on screen. A two-hander set entirely within the steel-blue confines of an American men’s prison, Petra Volpe‘s “Frank & Louis” charts with grace and sensitivity the initially reluctant but increasingly dependent connection between two inmates: a 60-year-old lifer slipping into the fog of Alzheimer’s disease, and a younger parole applicant enlisted to be the older man’s daily carer. \n\t\n\n\tThe ensuing story of trust and purpose regained in a spirit-sinking environment only really has one place to go — Volpe has scant time for melodrama or far-fetched buddy antics. But it’s all the more moving for that steady, solemn sense of mortal inevitability: As one man’s life gradually escapes his grasp, the other seeks to reclaim his while he still has time. \n\n\n\tFor Volpe, the Swiss writer-director behind last year’s effective, Oscar-shortlisted hospital procedural “Late Shift,” the film marks an equally assured, audience-friendly entry into English-language filmmaking. For stars Rob Morgan and Kingsley Ben-Adir, meanwhile, it’s a pleasingly patient and generous showcase: Both give performances of exquisite composure, with roiling anguish beneath the stillness. \n\n\t“Frank & Louis” keeps its location non-specific, and after decades spent between the walls and fences of this unforgiving institution, our two principals might themselves feel stuck in a placeless limbo. But Volpe and co-writer Esther Bernstorff have modeled their tale on the innovative real-life Gold Coats program at the California Men’s Colony in San Luis Obispo — whereby long-term prisoners are trained to act as carers for elder inmates stricken with dementia. \n\t\n\n\tRenamed the Yellow Coats initiative for the purposes of this fiction, it’s a project that taciturn convict Frank (Ben-Adir), who has already spent nearly 20 years inside for armed robbery and murder, initially joins purely out of self-interest. His parole hearing is coming up, and he reckons his participation will prove to the review board that he’s a better, gentler and altogether changed man these days. Following the release of a more seasoned carer, he’s assigned to Louis (Morgan), a similarly closed-off personality, now exasperated at losing his self-sufficiency in addition to his freedom. \n\n\tPerhaps sensing Frank’s less-than-wholehearted investment in all this, Louis at first resists the younger man’s help. But he’s deteriorating fast, losing control of his bodily functions and mental faculties, and in an environment that is already hostile to the vulnerable, he needs what support and protection he can get. Frank, meanwhile, is unprepared for the physical and psychological demands of the job — but also for its emotional rewards, and for the sense of community he finds with the other Yellow Coats, managed with plainspoken but kindly pragmatism by prison counselor Dr. Watts (Indira Varma).\n\n\tGradually, the two men gain each other’s trust, and a largely unspoken kinship emerges between them. In one lovely scene, a quiet, shared meal of cup noodles and Louisiana hot sauce says much about the fleeting sense of home they find in each other’s company, in stark single cells decorated with scrappy mementos of ever more distant family; in their absence, Louis and Frank become surrogate family to each other, with all the imminent heartbreak that entails. The words “I love you, son,” spoken with both sincerity and glazed confusion, are as close as this intelligently restrained film gets to sentimentality. The resulting swell of feeling is earned.\n\n\tIt’s a script and a production tightly built around its performers, both superb individually, but most importantly, warmly attentive to each other on screen, and capable of sharing a silence. Filmmakers too rarely gaze this intently at Morgan’s extraordinary face, which often stares back out at us in terror or defiance or sudden, ephemeral remembrance of where and why he is. In body language, too, he conveys Louis’ volatile swings between presence and internal absence. \n\t\n\n\tBen-Adir, the British star who made a strong impression as Malcolm X in “One Night in Miami…” but was hemmed in by the Wiki-drama conventions of “Bob Marley: One Love,” finally gets to show leading-man gifts beyond a knack for inhabiting icons. As Frank, he carries himself with a sadness that has become its own kind of armor, sometimes tapping into latent rage: He’s learnt impulse control, he tells Dr. Watts, though we feel the aching effort of that discipline.\n\n\tOccasionally, Volpe and Bernstorff’s script wants for a more precise, flavorful local vernacular. “Frank & Louis” never quite shakes the air of a story researched and respectfully observed from the outside in, though its humane reserve is a rare virtue in the prison-movie genre, often given to more lurid displays of grit and misery. Assisted by the low, somber strings of Oliver Coates’ score and the clean, crisp brightness of Judith Kaufmann’s lensing, Volpe directs with much the same simplicity and moderation, toward a pitch-perfect ending of wholly disarming terseness and economy. No redemptive speechifying or cathartic waterworks here, just life carrying on with a slightly heavier tread.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Frank & Louis’ Review: Kingsley Ben-Adir and Rob Morgan Give Immaculate Performances in a Stoically Moving Story of Prison Care",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/uxabhzxtnFrank__Louis-Still_1.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-26T03:00:00.000Z",
      "dateModified": "2026-01-26T03:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Wicker’ Review: Olivia Colman Orders a Man Made of Wood in a Bawdy Fable Perfectly Suited for Anyone Tempted to Marry Their AI Chatbot",
    "url": "https://variety.com/2026/film/reviews/wicker-review-1236640385/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Wicker.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-26T02:15:00.000Z",
    "description": "\n\tIn Ursula Wills-Jones’ 2008 short story “The Wicker Husband” (not to be confused with the “The Wicker Man”), an unpleasant fisherwoman in an unenlig",
    "body": "\n\tIn Ursula Wills-Jones’ 2008 short story “The Wicker Husband” (not to be confused with the “The Wicker Man”), an unpleasant fisherwoman in an unenlightened medieval town asks the local basketmaker to weave her a partner. From there, the supernatural fable could be “Pinocchio” for adults, only it’s not the wooden creation’s nose that grows, and this ideal husband cannot tell a lie, whispering things like “I was made to be with you” and “You are the only reason that I live and breathe” — which are not only true, but just about the most romantic thing one can say to a woman so unfortunate of feature and unfragrant of aroma.\n\t\n\n\tIn writer-directors Eleanor Wilson and Alex Huston Fischer’s bawdy bigscreen adaptation, the “ugly woman” of Wills-Jones’ imagination is played by the perfectly lovely Olivia Colman, who’s no grimier than the other townsfolk — except perhaps the lovely tailor’s wife (Elizabeth Debicki) — and seemingly content to have no part in the local marriage customs. In a significant step up from 2020 Sundance darling “Save Yourselves!” the filmmaking pair don’t stray far from Wills-Jones’ intention, using the story’s unspecified time and place to poke fun at superstition, the pressures to conform and the institution of marriage.\n\n\n\tAt the same time, they take feisty delight in embellishing just how uncouth these townspeople are (except for Peter Dinklage’s master basketmaker, who’s as couth as an openly gay artisan can be in a town where people piss and fart in public). One could say the filmmakers have been strategically reverent toward the source material, but slyly disrespectful in all other respects — like the marriage custom of locking a heavy copper collar around the bride’s neck and a strap-on carrot over the groom’s nibbly bits.\n\t\n\n\tSuch touches give the film a distinctively irreverent tone, not dissimilar from the ignorant peasant folk in “Monty Python and the Holy Grail,” to the degree that it might have been fun to see a man in drag playing Colman’s “ugly woman” role — not that there’s anything wrong with the Oscar winner’s interpretation. The adventurous actress dirties up her frock and face to play the village pariah, who reeks of fish and would be no man’s idea of a suitable wife, except perhaps the one-eyed bum who sleeps in the town square.\n\n\tNo matter. Solitude suits her fine. And then one day, after accidentally “winning” a silly game to predict who will be the next to wed, she changes her mind and orders up a mate from the master basketmaker — the way one might request a mail-order bride or life-size love doll. He’s a wordy chap (the basketmaker, not his creaking creation), waxing Shakespearean as he considers his commission. Dinklage’s multiple monologues stick out, assuming you can hear them over Anna Meredith’s jauntily invasive score — one of the few embellishments that doesn’t improve the experience.\n\n\tWhere Wilson and Fischer really deepen Wills-Jones’ tale is in the private moments between the fisherwoman and her wicker husband, who awaits her at the altar in a handsome new suit and shoes borrowed from her neighbors — the tailor (Nabhaan Rizwan), shoemaker (Scott Alexander Yougng) and so on. Back at her run-down shack, the long-neglected lass enthusiastically experiences a lover’s attention for the first time, unperturbed by his wooden … everything. And who can blame her, seeing as how he’s embodied by Swedish actor Alexander Skarsgård, that strapping sapling of a man, clearly recognizable beneath a veneer of elegantly woven willow?\n\n\tOne can only imagine the endless hours of debate that went into deciding how this wicker husband should look. He couldn’t be too sexy, or else the other women in town would be instantly jealous. They should be initially skeptical, the way one might be to learn that a friend was marrying her AI chatbot, only to come around once they see the fisherwoman’s husband doing chores and doting on his wife. But he can’t be too offputting either, lest he alienate the audience. (Per the directors’ Sundance Film Festival intro, there were practical considerations, too, like whether to give him nipples.)\n\t\n\n\tAfter all those considerations, the filmmakers landed somewhere between “Bicentennial Man” (whose boxy robot shell was kind of deal-breaker) and the fish man in “The Shape of Water” (far from human, but blessed with nice abs and a limited vocabulary). The wicker husband isn’t exactly hot, but he’s handsome, and where the other men in town love to hear themselves talk, the newcomer proves reserved in both speech and gesture. The early scenes between this unlikely couple are tender, almost loving — a dynamic that’s not lost on the village women, all of whom have trouble with their own husbands.\n\n\tFor a time, it doesn’t feel like Wilson and Fischer know what to do with the story, which stalls a bit in the second act — the part where they ought to have embellished upon what Wills-Jones had written. The plot requires the tailor’s wife to introduce doubts in the fisherwoman’s mind about her affectionate man’s fidelity. It could be a consequence of the movie’s insolent sense of humor, but there’s something unconvincing (or else too convenient) about how often the fisherwoman’s attitude changes, from caring nothing about marriage to cautiously inviting a man into her life to completely distrusting him when rumors swirl.\n\n\tIs she really so weak of will? The script needs her to be in order to prove its point, which makes a few of her choices (to say nothing of her peers’ behavior) tough to accept. A fable is only as strong as its moral lesson, and while so many are rock solid, this one’s made of wicker.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Wicker’ Review: Olivia Colman Orders a Man Made of Wood in a Bawdy Fable Perfectly Suited for Anyone Tempted to Marry Their AI Chatbot",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Wicker.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-26T02:15:00.000Z",
      "dateModified": "2026-01-26T02:15:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘The Odyssey’: Travis Scott Appears in New TV Trailer for Christopher Nolan’s Epic",
    "url": "https://variety.com/2026/film/news/the-odyssey-travis-scott-christopher-nolan-1236640716/",
    "image": "https://variety.com/wp-content/uploads/2026/01/GettyImages-2235307172.jpg?crop=0px%2C29px%2C2510px%2C1412px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-01-26T02:02:37.000Z",
    "description": "\n\tNFL fans got a first look at Travis Scott in Christopher Nolan’s Greek epic “The Odyssey” during a new TV spot, which aired during Fox’s Sunday broa",
    "body": "\n\tNFL fans got a first look at Travis Scott in Christopher Nolan’s Greek epic “The Odyssey” during a new TV spot, which aired during Fox’s Sunday broadcast of the NFL AFC Championship matchup between the New England Patriots and the Denver Broncos.\n\n\tIn the teaser, Scott stands on top of a table and demands the attention of a group of soldiers, which includes Tom Holland’s Telemachus and Jon Bernthal’s Menelaus. Clips of the 10-time Grammy nominee’s debut quickly went viral on social media.\n\t\n\n\tUniversal declined Variety’s request for comment.\n\n\n\tThis is not the first collaboration between Scott and Nolan. Scott recorded the track “The Plan” for Nolan’s 2020 sci-fi thriller “Tenet.”\n\n\t“His voice became the final piece of a yearlong puzzle,” Nolan told GQ as part of a 2020 profile of Scott. “His insights into the musical and narrative mechanism [composer] Ludwig Göransson and I were building were immediate, insightful and profound.” \n\n\t“The Odyssey” is shaping up to be one of the most highly anticipated films in recent memory. Starring Matt Damon as the Greek Hero Odysseus, the film flaunts and all star cast of Holland, Anne Hathaway, Robert Pattinson, Lupita Nyong’o, Zendaya, Charlize Theron, Bernthal, Benny Safdie and Elliot Page.\n\n\t“The Odyssey” is the first narrative feature shot entirely on Imax cameras. The feat was previously impossible because the Imax cameras are so loud that intimate dialogue scenes are a no-go. But thanks to a new film casing called a “blimp,” the noise can be significantly reduced. \n\t\n\n\t“The blimp system is a game-changer,” Nolan told Empire Magazine. “You can be shooting a foot from [an actor’s] face while they’re whispering and get usable sound. What that opens up are intimate moments of performance on the world’s most beautiful format.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘The Odyssey’: Travis Scott Appears in New TV Trailer for Christopher Nolan’s Epic",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/GettyImages-2235307172.jpg?crop=0px%2C29px%2C2510px%2C1412px&resize=1000%2C563"
      ],
      "datePublished": "2026-01-26T02:02:37.000Z",
      "dateModified": "2026-01-26T02:02:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Zoey Deutch: ‘I Feel So Ashamed to Be an American Seeing How Our Government Is Handling’ ICE Brutality",
    "url": "https://variety.com/2026/film/news/zoey-deutch-ice-ashamed-to-be-american-sundance-1236640594/",
    "image": "https://variety.com/wp-content/uploads/2026/01/ACW_6411.jpg?crop=0px%2C160px%2C4000px%2C2250px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-01-25T22:09:56.000Z",
    "description": "\n\tZoey Deutch is at the 2026 Sundance Film Festival with “Gail Daughtry and the Celebrity Sex Pass,” the latest outrageous comedy from “Wet Hot Americ",
    "body": "\n\tZoey Deutch is at the 2026 Sundance Film Festival with “Gail Daughtry and the Celebrity Sex Pass,” the latest outrageous comedy from “Wet Hot American Summer” and “Wanderlust” filmmaker David Wain. But the actor got serious at the Variety Studio presented by Audible while discussing her decision to wear an “ICE Out” pin during her Sundance press tour. \n\n\t“I just feel like, for me, it’s impossible not to be thinking about the state of our country and the brutality of ICE,” Deutch said. “I feel so proud to be an American, seeing the way communities and people are coming together during this time. But I feel so ashamed at the same time to be an American, seeing how our government is handling things. I just want to stand with the amazing people of Minnesota.”\n\t\n\n\tDeutch was making the press rounds at Sundance just a day after a man was fatally shot by federal agents in Minneapolis. Earlier this month, Renée Good was also killed by an ICE agent in Minneapolis. Many stars on the ground in Sundance have been wearing “ICE Out” and “Be Good” pins and speaking out against ICE. \n\n\t“We’re at a moment in our country’s history that is quite devastating. It’s really impossible not to talk about what is happening right now and the brutality of ICE and how it has to stop immediately,” Natalie Portman told Variety before the Sundance premiere of “The Gallerist.” “But also, there’s a beautiful community that Americans are showing right now. They’re showing up for each other, protecting each other and fighting for their freedom. It’s a bittersweet moment to celebrate something we’re so proud of on the backdrop of our nation in pain.”\n\t\n\n\tOlivia Wilde told Variety on the Sundance red carpet for her latest directorial effort, “The Invite,” that she is “appalled and sickened” by ICE.\n\n\t“We can’t go another day just sort of accepting this as our new norm. It’s outrageous. People are being murdered,” Wilde said. “And, I don’t want to normalize seeing people being murdered on the internet. On film. It’s hideous. And so if we can do anything out here to support the movement to cast ICE out, to delegitimize this unbelievably criminal organization, then that’s what we should be doing.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Zoey Deutch: ‘I Feel So Ashamed to Be an American Seeing How Our Government Is Handling’ ICE Brutality",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/ACW_6411.jpg?crop=0px%2C160px%2C4000px%2C2250px&resize=1000%2C563"
      ],
      "datePublished": "2026-01-25T22:09:56.000Z",
      "dateModified": "2026-01-25T22:09:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Union County’ Review: Will Poulter and Noah Centineo Integrate Seamlessly With a Cast of Recovering Addicts in Low-Key Opioid Portrait",
    "url": "https://variety.com/2026/film/reviews/union-county-review-1236639970/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Union_County-Still_1.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-26T00:00:00.000Z",
    "description": "\n\tAdam Meeks studied film at NYU’s Tisch School for the Arts, where one can imagine the true-to-his-roots filmmaker learning alongside eclectic classm",
    "body": "\n\tAdam Meeks studied film at NYU’s Tisch School for the Arts, where one can imagine the true-to-his-roots filmmaker learning alongside eclectic classmates. Manhattan must have felt like a stark break from the reality of rural Ohio, where Meeks grew up, but instead of abandoning his upbringing, the way so many do after moving to the big city, the writer-director honors what he left behind — and especially those struggling with opioid epidemic back home — in his feature debut, “Union County.” The make-or-break ingredient turns out to be British actor Will Poulter, whose immersive commitment dovetails beautifully with Meeks’ unvarnished sensibility. \n\t\n\n\tExpanded from a 2020 short of the same name, Meeks’ raw, honest movie fits neatly within a tradition of red-state escapees who remain committed to depicting the communities they know best with empathy and compassion (other examples include Nicole Riegel’s slice-of-life indie “Holler” and J.D. Vance’s bestselling memoir “Hillbilly Elegy”). While Hollywood remains disproportionately invested in depicting glamorous coastal lifestyles, Meeks focuses on what’s going on with the other 70% of the country, paying particular attention to a handful of recovering drug addicts.\n\n\n\tCommitted to authenticity, Meeks takes an unconventional approach that can feel almost like social work at times, partnering with the Adult Recovery Court in Bellfontaine, Ohio (pronounced “Bell Fountain”). With the exception of Poulter (who plays Cody Parsons) and Noah Centineo (as his brother Jack), nearly everyone in the film is a nonprofessional actor, tasked with bringing their own truth to the screen. The naturalistic drama opens with a handful of testimonials, as court-supervised addicts step to the lectern and address the judge, sharing their progress and setbacks on the route to sobriety.\n\t\n\n\tAll but unrecognizable behind his scruffy beard, Poulter blends right in with these hard-knock folks, whose homemade tattoos and missing teeth are the real deal. Whether from news reports or personal experience, we know by now what addiction looks like (roughly a third of Americans have a family member with an opioid problem). Too many of those stories turn out tragically. While Meeks’ movie doesn’t ignore that dimension, the filmmaker prefers to emphasize how entire communities have come together to fight back.\n\n\tThe recovering addicts we meet in the opening scene are supported by social workers and sponsors, as well as the legal system (which is so often presented as a kind of punishment, but here seems to prioritize forgiveness and recovery). When Poulter takes the podium, we don’t see an actor, but a good man worn down by bad decisions. This is Clay, who accepts that he’s an addict, but isn’t quite ready to change his life. He sleeps in his car, which affords him a degree of independence (or so he thinks).\n\n\tThe program requires him to get a job and a proper residence, steps that “Union County” chronicles, without turning away from his stumbles. Rehabilitation is rarely a straight line, but there’s something in Clay/Poulter’s face that suggests he could do it — his eyes are clear, his gaze determined — whereas Centineo’s Jack looks like trouble — a bad influence. We ought to know better than to judge a book by its cover, and Meeks reveals in time that it was Clay who got Jack hooked, not the other way around. If anything, Jack is the responsible one, helping Clay find work at the local lumber mill (the car and the job are the same as they were in the short film, though most of the faces are different).\n\n\tInstead of taking comfort in seeing them reunited, we watch warily. Jack brings his brother along to a campfire, where he drinks — enough to fail his next toxicology screening — while Clay chats with Anna (Elise Kibler), a woman who’ll become important later. She’s an ex-addict, too, it turns out, and though we might hope she could steer him in the right direction, we also respect her for refusing to get involved with someone who could jeopardize custody of her child. Life has a way of getting complicated when you introduce temptation, and though “Union County” can be frustratingly simple at times, the stakes are life and death. Not everyone Meeks introduces will make it to the end.\n\t\n\n\tAfter one character relapses, Clay is offered the empty room at a group home. But he’s still susceptible to opioid use as well, and the scene where he shoots up — passing out behind the wheel, as his white car rolls forward into a ditch — says everything about how dangerous addiction can be. No wonder his sister (Emily Meade) freaks out when Clay shows up at her house, calling the cops to come take him away. Clay starts the film with a clean slate (in the audience’s eyes, at least), but he’s been letting others down for more than a decade.\n\n\tWill Clay get it together by the end of the film? “Union County” knows it doesn’t work that way. Success is measured in days of sobriety, as well as the incremental realization that these addicts are not alone (a kindly sponsor played by Annette Deao beautifully embodies the patience it takes to support such cases). If Meeks’ project somehow feels less than the sum of its parts, that’s likely because the filmmaker doesn’t impose a more compelling crime story or romance to hook us. It’s one of those projects that is “about what it is about,” minus subplots or sizzle. There’s integrity in that choice, even if it ultimately costs “Union County” the kind of commercial appeal we expect from Sundance movies. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Union County’ Review: Will Poulter and Noah Centineo Integrate Seamlessly With a Cast of Recovering Addicts in Low-Key Opioid Portrait",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Union_County-Still_1.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-26T00:00:00.000Z",
      "dateModified": "2026-01-26T00:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rian Johnson Hopes ‘Star Wars’ Brings in ‘Fresh Voices and Filmmakers’ to Tell ‘New Stories in That World’ as Kathleen Kennedy Exits Lucasfilm",
    "url": "https://variety.com/2026/film/news/rian-johnson-star-wars-new-stories-1236640553/",
    "image": "https://variety.com/wp-content/uploads/2026/01/MCDSTWA_EC194.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-26T00:06:12.000Z",
    "description": "\n\tRian Johnson is “excited to see” what Kathleen Kennedy does next after stepping down as the head of Lucasfilm. Kennedy, who took charge of the “Star",
    "body": "\n\tRian Johnson is “excited to see” what Kathleen Kennedy does next after stepping down as the head of Lucasfilm. Kennedy, who took charge of the “Star Wars” franchise after George Lucas handpicked her to run Lucasfilm 14 years ago, announced her studio exit earlier this month. She is being replaced by Dave Filoni and Lynwen Brennan.\n\n\t“I love Kathy. I am excited now to see what she does next,” Johnson said at the Variety Studio presented by Audible while in Sundance as an executive producer on “The Only Living Pickpocket in New York.” “As a ‘Star Wars’ fan, the most exciting thing for me is always seeing when they bring in fresh voices and fresh filmmakers to come in and tell new stories in that world. That’s what I am looking forward to seeing more happen.”\n\t\n\n\tJohnson directed “Star Wars: The Last Jedi” and said of the experience, “I had the time of my life doing it. I am now an even bigger ‘Star Wars’ fan than I was when going into it. I would feel blessed if that were to ever happen [again].”\n\n\tKelly Marie Tran, who played Rose Tico in “Star Wars: The Last Jedi” and “The Rise of Skywalker,” was also on the ground in Sundance promoting the new movie “Rock Springs.” Asked at the Variety Studio about what Kennedy’s leadership meant to her, Tran said it’s “such a loss” that the “Star Wars” franchise is losing her.\n\n\t“She’s had such an incredible career,” Tran said. “To have someone who is not just a woman but who is so capable in that role for so long, and it’s historic. I think that it’s such a loss, but I am very happy for all the life changes she is making.”\n\t\n\n\tAfter 2017’s “The Last Jedi,” Johnson was set to develop another “Star Wars” trilogy. But the project never got off the ground, and Johnson moved on to writing and directing his “Knives Out” trilogy. In her exit interview with Deadline, Kennedy explained that Johnson never returned to the “Star Wars” franchise because the “Knives Out” movies ate up “a huge amount of his time.” She also claimed he got “a little scared” by the fan backlash to “The Last Jedi,” which is something Johnson then denied on X by posting: “Lol zero spooked, sorry.” \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rian Johnson Hopes ‘Star Wars’ Brings in ‘Fresh Voices and Filmmakers’ to Tell ‘New Stories in That World’ as Kathleen Kennedy Exits Lucasfilm",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/MCDSTWA_EC194.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-26T00:06:12.000Z",
      "dateModified": "2026-01-26T00:06:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NHL Commissioner Says He Binge-Watched ‘Heated Rivalry’ in One Night: ‘It’s a Wonderful Story’",
    "url": "https://variety.com/2026/tv/news/nhl-commissioner-binge-watched-heated-rivalry-1236640705/",
    "image": "https://variety.com/wp-content/uploads/2026/01/GettyImages-2244869712.jpg?crop=0px%2C334px%2C6000px%2C3375px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-01-26T01:18:00.000Z",
    "description": "\n\tNHL commissioner Gary Bettman, 73, recently told Hockey News that he watched the entire first season of HBO Max’s queer hockey drama “Heated Rivalry",
    "body": "\n\tNHL commissioner Gary Bettman, 73, recently told Hockey News that he watched the entire first season of HBO Max’s queer hockey drama “Heated Rivalry” in one sitting and thought it was “a wonderful story.”\n\n\t“The content — particularly for young people — may be a little spicy, so you have to balance that out with how you embrace it,” he said. \n\n\tBettman added, “I thought the storyline was very compelling. And a lot of fun, because I could see where they were picking at things we [as a league] had done in the past, whether or not it was being in Sochi or the All-Star Game in Tampa. It was very well done.”\n\t\n\n\t“Heated Rivalry” has exploded in popularity ever since it debuted on HBO Max in late November of 2025. Based on Rachel Reid’s “Game Changer” book series, the show follows Shane Hollander (Hudson Williams) and Ilya Rozanov (Connor Storrie), two up-and-coming hockey stars who engage in a secret, years long romanace off the ice. The show has been renewed for a second season.\n\n\tAs proof of the show’s universal appeal, stars Williams and Storrie carried the Olympic torch on Sunday as part of the Milano Cortina 2026 relay in Feltre, Italy. They also presented at the Golden Globes, escorted to the stage by two UFC fighters. In the days following the Globes, Williams went to Milan for Men’s Fashion Week, where he walked in the Dsquared2 show and attended the Giorgio Armani runway presentation.\n\n\tDuring a recent appearance on the “Shut Up Evan” podcast, Williams said that the sudden fame has been tricky to navigate. He said, “I was just talking with one of my agents yesterday, and she said Connor and I have had to learn what a lot of actors get in five years, in like 30 days.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NHL Commissioner Says He Binge-Watched ‘Heated Rivalry’ in One Night: ‘It’s a Wonderful Story’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/GettyImages-2244869712.jpg?crop=0px%2C334px%2C6000px%2C3375px&resize=1000%2C563"
      ],
      "datePublished": "2026-01-26T01:18:00.000Z",
      "dateModified": "2026-01-26T01:18:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Will Poulter and Noah Centineo Drug Recovery Drama ‘Union County’ Lands Extended Sundance Standing Ovation",
    "url": "https://variety.com/2026/film/news/union-county-will-poulter-noah-centineo-standing-ovation-1236640704/",
    "image": "https://variety.com/wp-content/uploads/2026/01/P103W207.jpg?crop=0px%2C0px%2C2000px%2C1125px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-01-26T01:40:35.000Z",
    "description": "\n\tPark City had another crowd-pleasing premiere on Sunday with Adam Meeks’ “Union County,” which earned a lengthy standing ovation following its scree",
    "body": "\n\tPark City had another crowd-pleasing premiere on Sunday with Adam Meeks’ “Union County,” which earned a lengthy standing ovation following its screening at the Eccles Theater.\n\n\tThe drama, which stars Will Poulter and Noah Centineo as brothers who are in drug recovery together, was shot in a real-life drug court in Ohio. Many of their co-stars were non-actors who were working the program itself.\n\n\n\tThe biggest cheers from the Sundance Film Festival crowd came for Annette Deao, who works as a therapist helping people navigate addiction recovery in real life. Deao has several emotional moments opposite Poulter.\n\t\n\n\tAt the Q&A following the screening, Meeks described how he became interested in the project.\n\n\n\t“I’m from central Ohio, in the area where this film is set, but my immediate family and I left when I was 6,” he said. “It wasn’t until 2016 that I started spending a lot of time there as an adult. My grandmother was sick, and I came back to spend time there. And I think it was because I had been away for so long, but I was falling in love with Ohio and seeing the place differently and seeing people differently. Around the same time, my, extended family was telling me about the way that the opioid epidemic at that time was impacting friends and loved ones,” Meeks said. “It was intense, and my uncle actually introduced me to the drug court judge at the time, the previous judge, and he invited me to sit in on a meeting. I had been hearing about what I think most of us were hearing about, in terms of the bleakness and tragedy of the overdose statistics. I was immediately seeing people getting better and getting back on their feet, and I was also seeing the incredible work that Annette and her team and everybody were doing.”\n\t\n\n\tPrior to the screening, Meeks spoke to Variety on the red carpet about how Poulter got involved with the project.\n\n\t“He actually read the script through his agent and reached out to us,” Meeks said. “I got on a Zoom with him and fell in love immediately. We did the kind of coy thing at the end of a call where you’re like, ‘Alright, I’ll talk to my people, and you talk to your people.’ And then five minutes later, we had offered him the role, and he had accepted it. It was just a really organic, beautiful, mutual connection.”\n\n\tDeao also spoke to Variety on the carpet about how abuse of opioids is evolving in the Midwest.\n\n\t“I believe the opioid epidemic is changing,” Deao said. “Part of that is education. People are understanding — even our medical professionals understand much better — you cannot keep prescribing that and expect people not to get addicted. We are seeing improvement. Also, medication-assisted treatment has been an amazing part of how people are recovering from substance use disorder.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Will Poulter and Noah Centineo Drug Recovery Drama ‘Union County’ Lands Extended Sundance Standing Ovation",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/P103W207.jpg?crop=0px%2C0px%2C2000px%2C1125px&resize=1000%2C563"
      ],
      "datePublished": "2026-01-26T01:40:35.000Z",
      "dateModified": "2026-01-26T01:40:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Meghan, Duchess of Sussex, on Backing the Sundance Doc ‘Cookie Queens’ and What Being a Girl Scout Taught Her About Business",
    "url": "https://variety.com/2026/film/features/meghan-markle-sundance-interview-cookie-queens-documentary-1236640458/",
    "image": "https://variety.com/wp-content/uploads/2026/01/2258131303.jpg?crop=0px%2C127px%2C5000px%2C2812px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-01-25T22:19:14.000Z",
    "description": "\n\tWhat’s Meghan, Duchess of Sussex’s, favorite Girl Scout cookie?\n\n\t“Isn’t everyone’s Thin Mints?” Meghan says over Zoom, her eyes glimmering conspira",
    "body": "\n\tWhat’s Meghan, Duchess of Sussex’s, favorite Girl Scout cookie?\n\n\t“Isn’t everyone’s Thin Mints?” Meghan says over Zoom, her eyes glimmering conspiratorially as she adds: “I prefer them crumbled on top of vanilla ice cream.”\n\n\tIndeed, Thin Mints are regularly among the top-selling flavors of the $800 million worth of cookies that Girl Scouts across America sell annually, followed by Samoas and Tagalongs. Director Alysa Nahmias chronicled the six-week selling spree for the documentary “Cookie Queens,” of which Meghan, a former scout, is an executive producer.\n\t\n\n\t“You know what the sleeper hit was?” Nahmias chimes in from the other corner of the screen. “The Lemonade are amazing. It’s an iced lemon cookie, and it’s a really large cookie. You get your money’s worth with that one.”\n\n\n\tMoney, or rather, economics, is a key theme of “Cookie Queens,” which follows four Girl Scouts between ages 5 and 12 as they work to sell as many cookies as possible in that window. One seller, Olive, a 12-year-old from North Carolina, once moved more than 8,000 boxes in a season. Meanwhile, Ara, a 5-year-old from San Diego, has a more modest goal of 55 boxes. Eight-year-old Shannon Elizabeth of El Paso, TX hopes to sell enough boxes to go to cookie camp — an expense that would otherwise be out of her family’s reach. Nikki, a 9-year-old from Chino, CA is following in her older sisters’ footsteps to be named the “cookie queen,” a colloquial term for the top seller in the area, that season.\n\n\tTo craft the 91-minute observational documentary, Nahmias’ crew crisscrossed the country to shoot some 300 hours of footage of the girls and their families as they canvassed their local neighborhoods to make sales.\n\t\n\n\t“What’s so fantastic about the experience of being a Girl Scout — and my mom was my troop leader as well — is I don’t think you understand just how impactful all of those tools that you’re learning are going to carry through in your life later on outside of the community building,” Meghan says.\n\n\t“What I love about what Alysa did in bringing this film to life is it gives such an objective point of view about girlhood, humanity, but also how they’re leveraging technology, how they’re learning micro-finance, financial independence,” she explains. “All of these elements that are baked in — dare I say — to the tradition of the Girl Scouts’ cookie season.”\n\n\tMeghan and Nahmias chatted with Variety ahead of the documentary’s Sundance premiere on Sunday, where the film’s young stars joined them on the red carpet with Prince Harry.\n\n\n\n\t\n\n\t\t\t\t\tPrince Harry, Duke of Sussex, Alysa Nahmias and Meghan, Duchess of Sussex pose with the cast and crew at the “Cookie Queens” premiere in Park City, Utah.\n\t\t\t\t\t\t\t\t\tCindy Ord/Getty Images\n\t\n\n\n\t\n\t\tYour subjects were able to join you for the premiere. Was this the first time they’d seen the film? \t\n\n\tAlysa Nahmias: They’ve seen it and they’re very pleased. One of the wonderful things about having them see it was that they got to see each other’s stories and see themselves reflected in each other, which is such a big part of the experience of watching “Cookie Queens.” People can see themselves reflected in each other and remind ourselves that we do have at least as much in common as we have that makes us different.\n\n\tThat’s something that young people understand, oftentimes so innocently and so powerfully that we somehow sometimes forget, but it’s expressed in the ways that these kids share themselves with the world. I’m really very grateful and honored to be entrusted with that and to have such a marvelous team that understands the responsibility and the honor that that is as storytellers. I hope that people will watch this with multi-generational audiences, where you can tell your mom, your grandma and your kids and watch it together.\n\t\n\t\tAlysa, you’ve said “Cookie Queens” is your most personal project yet. How did you get the idea to make this documentary?\t\n\n\tNahmias: I had just made a film, “Art & Krimes by Krimes,” which was a look at art and artists who make work while incarcerated and the community that they built when they came home, and a film called “Wildcat,” that I produced about mental health and conversation. One night at dinner, my kids, who were 8 and 11 at the time, said, “Mom, can you make a film that we really want to watch and share with our friends?” So, I had that in my heart as an intention for a next project.\n\t\n\n\tI ended up talking with my friends, producers Michael Dweck and Gregory Kershaw, and Michael brought up that he had been sold an ungodly amount of cookies from a Girl Scout who told him her goals were off the charts. I said, “If you guys want to make that movie, I’m 100% in. I can relate to that girl. I feel like there’s a whole world of girlhood and capitalism and the ways that girls are engaging with the economy at young ages, learning what their value is, and building their identity.” That was a way in that could also become this wonderful, vivid world of primary colors and plucky kids and eccentric customers, and be very observational and immersive. The vision was instantaneous.\n\t\n\t\tHow did you get the idea to reach out to Meghan to join the project as an executive producer?\t\n\n\tNahmias: We looked at who in the world has been a Girl Scout — women we admire, who are doing interesting things and that we respect. Meghan was on that short list early. When we first got to show her footage, the connection was really clear and meaningful. She got that this is about Girl Scout cookies, and it’s about so much more. An observational documentary is not something that everyone is willing to take a risk on — you don’t know how it’s going to end — and I really appreciated that.\n\n\tMeghan: We first saw that footage almost two years ago, and I couldn’t stop thinking about it. And in really wanting to support independent filmmakers through Archewell Productions, it felt like something where I knew where the hook was. So, as it started to expand and grow, I could see Alysa’s vision really coming to life. I just thought, “Oh my gosh, it would be such a privilege to uplift and support this, so that people, even if they aren’t Girl Scouts and don’t understand the tradition, can have this glimpse into the families and what adolescence looks like for young girls in this day and age.” I just find the messaging that she’s put together to be incredibly inspiring and brave, because it could just be cookie cutter and sweet, and it’s not. It goes a lot deeper than that and that nuance makes it incredibly special.\n\n\tNahmias: One of the first scenes we showed you was of [5-year-old] Ara selling cookies at the waterfront.\n\n\tMeghan: Yes, just the tutorial of what was happening – that you could use Venmo [to pay for cookies]. Obviously, we didn’t have that as young girls. It was such an interesting glimpse. The character-driven storytelling is what makes this film so meaningful.\n\t\n\n\n\n\t\n\n\t\t\t\t\t“Cookie Queens”\n\t\n\n\n\t\n\t\tI didn’t realize how much money these cookie sales produce each year. Alysa, how did you go about finding your subjects?\t\n\n\tNahmias: The numbers are staggering. They outsell Chips Ahoy and Oreo.\n\n\tThere’s 50 million Girl Scouts alive and 20 million current participants or so. I wanted to find girls and families who had both interesting sales goals and prizes that they were looking to go for, and also different motivations, different backgrounds, different geographical contexts and communities. I always knew from the beginning that it would be an ensemble. I worked with a casting producers and we got a lot of interest from the Girl Scout community. We got hundreds of inquiries; I did a lot of Zoom interviews, and when I narrowed it down, I went and spent time getting to know these families without filming. I wanted to know that they understood what it meant to participate and that it would be done with a lot of conscious desire to collaborate, that these kids were going to be willing to take risks, and that we’d be able to see them go through changes and make choices while filming.\n\t\n\t\tWith two of the subjects being from California, Meghan, did watching them make you nostalgic?\t\n\n\tMeghan: Yes, without question. Especially now, as a mother of a daughter, there’s a very different lens that you’re witnessing it through. And, of course, being reminiscent of my own experience of having been a Girl Scout and in California. But I love how varied and diverse the casting is. I love that you see some of these families and what they’re sacrificing to give their daughters these opportunities. And, on the flip side, some daughters were pushing themselves more than their parents would ever push them, and how that’s ingrained so early on.\n\t\n\t\tWhat was your go to method for getting that sale? Did you have a good strategy?\t\n\n\tMeghan: In many ways, the cookies can sell themselves, because they’re so good. But back then wasn’t the same. There was no social media to try to sell cookies. So, it was just smiling and being kind and knowing that you had entrepreneurial goals. I think targets and goals and learning metrics like that at a young age are really helpful for young girls who are oftentimes scared to talk about finance, math and economics in that way. The empowerment that happens early on is really key.\n\t\n\n\tNahmias: One of the things that we saw on camera is that it’s about the sales, but it’s also about the interactions they’re having with the adult world and the economy and the things that are said to them, and how they navigate people’s perceptions of them. [Or] how you deal with failure or rejection.\n\n\n\n\t\n\n\t\t\t\t\t Meghan, Duchess of Sussex, introduces the premiere screening of “Cookie Queens” at Eccles Center Theater in Park City, Utah. \n\t\t\t\t\t\t\t\t\tCindy Ord/Getty Images\n\t\n\n\n\t\n\t\tThis is the next Archewell Productions following your Netflix series “With Love, Meghan.” How does this documentary fit into the vision you have for the company moving forward?\t\n\n\tMeghan: It’s been key to focus on stories that resonate with people; things that are not necessarily the most topical and end up becoming something that is more topical. It’s not dissimilar to saying “Hide the vegetables.” When you see this film, you might not know what you’re going in to find, but, ultimately, you come out of it with so much more to talk about, to dissect and to really better understand each other. Everything, for us, is intertwined with community. So, when I saw the first few cuts of what Alyssa put together, I knew that really hit the nail on the head. This is such a prime example of the direction and the types of projects we want to support on the nonfiction side.\n\t\n\t\tWhat did you learn from producing that series in terms of audiences’ appetite for lifestyle programming?\t\n\n\tMeghan: “Suits” was seven years for me, and then doing “With Love, Meghan” was 17 episodes of television in a year, with pre- and post-production. It is such an undertaking, and it makes me have even more respect for creatives who are throwing themselves into this every single day. From my standpoint, it’s an industry that I grew up in and that I know really well. And at the same time, it is such an exciting opportunity as an adult to find something that piques curiosity at every turn, and to continue to remind each other how we can be creative, how we can work as a team, how dedicated a crew is, building trust with the subjects of the film and their families. It’s multifaceted, but I’m just excited to continue to explore and play and have fun.\n\t\n\t\tSpeaking of fun, you just returned to acting with a cameo in the Amazon movie, “Close Personal Friends,” with Lily Collins and Brie Larson. How much fun was that?\t\n\n\tMeghan: It was great! It was a lot of fun. But that’s just the point, right? We continue to explore different ways to uplift and celebrate the entertainment industry and all the incredible pieces of work that are out there that people work so hard on — “Cookie Queens” being one of them. This is such an important piece of cinema to be able to share with people and I just know people are going to love it the same way you and I do.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Meghan, Duchess of Sussex, on Backing the Sundance Doc ‘Cookie Queens’ and What Being a Girl Scout Taught Her About Business",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/2258131303.jpg?crop=0px%2C127px%2C5000px%2C2812px&resize=1000%2C563"
      ],
      "datePublished": "2026-01-25T22:19:14.000Z",
      "dateModified": "2026-01-25T22:19:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Guess Who This Oscar-Nominated Actor Is!",
    "url": "https://www.tmz.com/2026/01/25/guess-who-oscar-nominated-actor/",
    "image": "https://imagez.tmz.com/image/0c/16by9/2026/01/23/0c20e8f99b734ec5816d0d0904a6ebb3_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-26T00:00:32.000Z",
    "description": "\n    \n                    \n                          Guess Who\n                          This Oscar-Nominated Actor Is!\n                      \n       ",
    "body": "\n    \n                    \n                          Guess Who\n                          This Oscar-Nominated Actor Is!\n                      \n                  \n                                                                        Published \n                              January 25, 2026\n                            4:00 PM PST\n                                                                            \n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          It's finally that time of the year again, folks, and you probably need a brush-up on who got put up for an Academy Award ... can you guess who this Oscar-nominated actor is?\n      \n    \n          We ran into this star right after he got off a crazy weather-delayed flight back in 2018 ... he had a lot to say about the \"bomb cyclone\" and climate change -- and it's particularly relevant again as half the country's facing freakishly frigid weather this week!\n      \n    \n          Take your best shot ... Guess Who!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Movies\n              \n                          \n                Guess Who\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Guess Who This Oscar-Nominated Actor Is!",
      "image": [
        "https://imagez.tmz.com/image/0c/16by9/2026/01/23/0c20e8f99b734ec5816d0d0904a6ebb3_xl.jpg"
      ],
      "datePublished": "2026-01-26T00:00:32.000Z",
      "dateModified": "2026-01-26T00:00:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Guess Who These Sexy Stars From Florida Are!",
    "url": "https://www.tmz.com/2026/01/25/sexy-stars-from-florida-guess-who/",
    "image": "https://imagez.tmz.com/image/4b/16by9/2026/01/19/4b92c5043104434d9135045bb54e23c1_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-25T20:00:30.000Z",
    "description": "\n    \n                    \n                          Guess Who\n                          These Sexy Stars From Florida Are!\n                      \n   ",
    "body": "\n    \n                    \n                          Guess Who\n                          These Sexy Stars From Florida Are!\n                      \n      \n    \n      \n        \n              \n    \n    \n          You know the old saying, \"everything's bigger in Texas?\" Well, we've got a little secret for you ... everything's crazier in Florida -- especially the hot bods on the celebs from the Sunshine State!\n      \n    \n          The thing is, you're gonna have to guess who these stars are, but we don't think it's a far stretch of the imagination to think lots of them are Gators fans!.\n      \n    \n          We know it's cold outside and all, but these snaps should get you real, real hot ... and we're sure Florida Man's gonna go crazy over this gallery, too!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Hotties & Bodies\n              \n                          \n                Hot Bodies\n              \n                          \n                Guess Who\n              \n                          \n                Photo Galleries\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Guess Who These Sexy Stars From Florida Are!",
      "image": [
        "https://imagez.tmz.com/image/4b/16by9/2026/01/19/4b92c5043104434d9135045bb54e23c1_xl.jpg"
      ],
      "datePublished": "2026-01-25T20:00:30.000Z",
      "dateModified": "2026-01-25T20:00:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'Blind Side' Actor Quinton Aaron Hospitalized After Falling At Home",
    "url": "https://www.tmz.com/2026/01/25/blind-side-actor-quinton-aaron-hospitalized-after-falling-at-home/",
    "image": "https://imagez.tmz.com/image/e5/16by9/2026/01/26/e5f8cd57d3914ceebb6b84923c75988a_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-26T01:06:41.000Z",
    "description": "\n    \n                    \n                          'The Blind Side' Actor\n                          Hospitalized After Falling at Home\n             ",
    "body": "\n    \n                    \n                          'The Blind Side' Actor\n                          Hospitalized After Falling at Home\n                      \n                  \n                                                                        Published \n                              January 25, 2026\n                            5:06 PM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Quinton Aaron -- the actor who played Michael Oher in \"The Blind Side\" -- has been hospitalized after collapsing at his home .. TMZ has learned.\n      \n    \n          A manager for the actor tells TMZ ... he's been hospitalized in Atlanta for the past three days. We're told Quinton was walking up the stairs in his apartment last week when his legs suddenly stopped functioning, causing him to collapse. He was rushed to the hospital.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          According to a GoFundMe page, organizers claim Quinton is \"on life support due to a severe blood infection.\" However, his manager tells us he's stable, communicating with his family and team, and receiving precisely the care needed at this time.\n      \n    \n          His manager tells us doctors are still running tests and evaluating Quinton's condition, and at this time, there's no definitive word on what caused the fall.\n      \n    \n          We're told Quinton and his family are taking things one step at a time. While they're asking for privacy during this period, his rep says they want fans to know they deeply appreciate the outpouring of love, prayers, and well wishes.\n      \n    \n          The health scare comes after a series of medical battles for the 40 year old actor. In March 2025, he was rushed to a California medical facility after developing a fever and coughing up blood.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          At the time, Aaron said doctors ran multiple tests and believed he was dealing with Type A flu and pneumonia. In 2019, he battled a severe upper respiratory infection.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          In October 2025, Quinton shared his dramatic 200 pound weight loss journey with us.\n      \n      \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Blind Side' Actor Quinton Aaron Hospitalized After Falling At Home",
      "image": [
        "https://imagez.tmz.com/image/e5/16by9/2026/01/26/e5f8cd57d3914ceebb6b84923c75988a_xl.jpg"
      ],
      "datePublished": "2026-01-26T01:06:41.000Z",
      "dateModified": "2026-01-26T01:06:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Barack & Michelle Obama Break Silence on Alex Pretti Killing",
    "url": "https://www.tmz.com/2026/01/25/barack-obama-michelle-alex-pretti-minneapolis/",
    "image": "https://imagez.tmz.com/image/16/16by9/2026/01/25/161defbd7ac540c1a9287c97455852b5_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-25T20:00:40.000Z",
    "description": "\n    \n                    \n                          Barack & Michelle Obama\n                          Alex Pretti Killing Is a Wake-Up Call To Every ",
    "body": "\n    \n                    \n                          Barack & Michelle Obama\n                          Alex Pretti Killing Is a Wake-Up Call To Every American\n                      \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Barack and Michelle Obama released a strong-worded joint statement Sunday, breaking their silence on the killing of Alex Pretti, making one thing clear ... \"This has to stop.\"\n      \n    \n          Calling Pretti's death a heartbreaking tragedy that \"should be a wake-up call to every American,\" the former president and first lady said no matter what political party you align with, our collective core values as a nation are \"increasingly under assault.\"\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          The couple stated that while federal law enforcement have a difficult job, they have a duty to work with state and local officials to carry out their work in a lawful and accountable way. But \"that's not what we're seeing in Minnesota,\" they wrote.\n      \n\n          The Obamas slammed the Trump administration for seeming \"eager to escalate the situation,\" as chaos spreads in the streets of Minnesota.\n      \n    \n      \n        \n                    \n                  \n      \n                    Drop Site News\n          \n    \n          \"This has to stop,\" they said plainly. \"I would hope that after this most recent tragedy, administration officials will reconsider their approach, and start finding ways to work constructively with Governor Walz and Mayor Frey as well as state and local police to avert more chaos and achieve legitimate law enforcement goals.\"\n      \n    \n          They continued ... \"In the meantime, every American should support and draw inspiration from the wave of peaceful protests in Minneapolis and other parts of the country. They are a timely reminder that ultimately it's up to each of us as citizens to speak out against injustice, protect our basic freedoms, and hold our government accountable.\"\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Alex Pretti\n              \n                          \n                Michelle Obama\n              \n                          \n                Barack Obama\n              \n                          \n                ICE\n              \n                          \n                Politics\n              \n                          \n                Shootings\n              \n                          \n                News\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Barack & Michelle Obama Break Silence on Alex Pretti Killing",
      "image": [
        "https://imagez.tmz.com/image/16/16by9/2026/01/25/161defbd7ac540c1a9287c97455852b5_xl.jpg"
      ],
      "datePublished": "2026-01-25T20:00:40.000Z",
      "dateModified": "2026-01-25T20:00:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'My Strange Addiction' Cassy Lied About 'Vabbing' In Hopes Of Finding a Man",
    "url": "https://www.tmz.com/2026/01/25/vabbing-my-strange-addiction-lied-cassy/",
    "image": "https://imagez.tmz.com/image/7c/16by9/2026/01/25/7c6f518d78884eccaa68bca5d3b5dcd9_xl.png",
    "tag": "Entertainment",
    "date": "2026-01-25T19:13:27.000Z",
    "description": "\n    \n                    \n                          'My Strange Addiction' Vabbing Lady\n                          I Lied To Get More Dates & It Worke",
    "body": "\n    \n                    \n                          'My Strange Addiction' Vabbing Lady\n                          I Lied To Get More Dates & It Worked!!!\n                      \n                  \n                                                                        Published \n                              \n                January 25, 2026\n                \n                            11:13 AM PST\n                                                                      |\n                                                                Updated \n                                  January 25, 2026\n                                4:24 PM PST\n                                    \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          It's been hard out here for a pimp! So hard that Cassy from Boston lied about vabbing 50 times a day, thinking it would attract more dates ... and it did!\n      \n    \n          To be fair ... the type of guy interested in you because of your addiction to applying your own vaginal fluids to your neck probably isn't going to be marriage material, but they're coming out the woodwork for your girl.\n      \n    \n          ICYMI ... Cassy went on \"My Strange Addiction\" claiming she uses two fingers to collect her vaginal discharge and then rub it onto her neck as a natural perfume.\n      \n    \n      \n        \n                    \n                  \n      \n                    TLC\n          \n    \n          But now, she admits it was a lie. She says what she was actually addicted to was alcohol.\n      \n    \n          In a video uploaded to YouTube, which she has since set to Private, she explains, \"I was drinking a lot. I was eating a lot of processed food and I was just genuinely unhappy and lonely.\"\n      \n\n          Cassy says she applied to be on dating shows but got rejected. She believes she didn't make the cut because she wasn't deemed attractive enough.\n      \n    \n          But then she learned about a new trend called \"vabbing\" and thought it could be the perfect thing to get her on TV.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          \"At that time, I was really desperate to find a boyfriend,\" she says. \"And I thought, if I expose myself, if I put myself on TV, that will increase my chances of finding a relationship.\"\n      \n    \n          And now, Cassy says she's been going on \"a lot of dates,\" is on a dozen dating apps and has received a thousand messages.\n      \n    \n          She says, \"Since the episode aired, I've been going on breakfast, lunch, dinner dates. Hopefully I can find 'the one.'\"\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Cassy promises the whole \"vabbing\" thing was the only lie she told on the show. But get this ... Cassy says she's actually not embarrassed because she suffers from alexithymia.\n      \n    \n          Now, it's hard to trust anything Cassy says because while alexithymia makes it difficult to communicate emotions, it can actually make you feel more shame, but what seems to be true is ... homegirl is still on the prowl and still looking for attention.\n      \n      \n              \n          \n                          \n                TLC\n              \n                          \n                Weird News\n              \n                          \n                YouTube\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'My Strange Addiction' Cassy Lied About 'Vabbing' In Hopes Of Finding a Man",
      "image": [
        "https://imagez.tmz.com/image/7c/16by9/2026/01/25/7c6f518d78884eccaa68bca5d3b5dcd9_xl.png"
      ],
      "datePublished": "2026-01-25T19:13:27.000Z",
      "dateModified": "2026-01-25T19:13:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]