[
  {
    "title": "‘The Morning Show’ Cast and Producers on Filming Season 4 Finale the Day After the Election and Tackling Current Events in Season 5: ‘The World Is Upside Down’",
    "url": "https://variety.com/2025/tv/news/the-morning-show-season-5-current-events-1236590318/",
    "image": "https://variety.com/wp-content/uploads/2025/11/JCO14389.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-24T19:59:12.000Z",
    "description": "\n\t“The Morning Show” has a knack for covering current events — the MeToo movement, space travel and in Season 4, AI. And that reflection of what’s hap",
    "body": "\n\t“The Morning Show” has a knack for covering current events — the MeToo movement, space travel and in Season 4, AI. And that reflection of what’s happening in the real world will likely continue into Season 5.\n\n\t“I think we will be leaning into what’s going on now. The current state of affairs is daunting; the world is upside down and how do we navigate through this world of half-truths? What is real? Certainly, the Epstein Files are current now,” executive producer and director Mimi Leder said ahead of Variety‘s screening of the finale on November 19 in Los Angeles. “I’m not saying we’re doing that, I’m just saying it’s a constant theme, it seems, from the beginning of our show — from the Me Too movement to where we are today with the release of the files. Let’s hope there’s some justice for these women.”\n\t\n\n\tMark Duplass also hopes that the show covers the current attack on journalism. “I would love to see a big storyline next season where some man, in some position of power, gets his fucking head taken off for calling somebody a piggy on a press line,” he said ahead of the panel.\n\n\tThe panel also featured showrunner Charlotte Stoudt, casting director Victoria Thomas, executive producer Kristin Hahn, executive producer and star Jennifer Aniston, actors Boyd Holbrook and Karen Pittman.\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tJC Olivera\n\t\n\n\n\n\tLeder shared that the Season 4 finale scene of Mia walking into Celine’s office and looking around was shot the day after the election, when Kamala Harris lost to Donald Trump, upping the emotion on set.\n\n\t“It was about, is there gonna be a possibility for Mia to assume her power? Is she gonna get there? We knew what the state of the world was and what was happening, and it was terrifying,” Leder, who directed the episode, said. “We just wanted to take moments of Mia with her long fingernails touching the desk and just taking in the room and what could be… We were definitely saying, ‘It’s not over. We’ve gotta fight the fight. And we still do.”\n\t\n\n\tStoudt added that there are many current issues that the show could tackle going forward, as the goal is to be “emotionally resonant” and for audiences to see “what it feels like to be in America.”\n\n\t“We’re not just talking about [the] 47[th president]. That’s not the only thing to talk about — it’s partly [asking] how can we look at the whole landscape and pull out some interesting things?” she asked. “Like, why do the seven richest guys in the world have a lot of feelings about journalism? And should they be allowed to control those things?”\n\n\tPittman chimed in after Stoudt’s question, answering, “No. They shouldn’t.”\n\n\tThat sounds as though Paul, played by Jon Hamm, will be back next season. While the group played coy about it during the panel, Leder confirmed to Variety ahead of time that Hamm will return in Season 5.\n\n\t“Jon Hamm’s coming back. Is that a spoiler? Who cares?” she laughed. “He’s going to be back. He’s the Hammster, we love him.”\n\n\tWatch the full panel from “The Morning Show” event above. All four seasons are available to stream on Apple TV+.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘The Morning Show’ Cast and Producers on Filming Season 4 Finale the Day After the Election and Tackling Current Events in Season 5: ‘The World Is Upside Down’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/JCO14389.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-24T19:59:12.000Z",
      "dateModified": "2025-11-24T19:59:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rebecca Yarros’ ‘Variation’ Film Adaptation Set at Amazon From ‘It Ends With Us’ Screenwriter; Obamas’ Higher Ground and Misty Copeland Producing",
    "url": "https://variety.com/2025/film/news/rebecca-yarros-variation-movie-amazon-it-ends-with-us-writer-1236590952/",
    "image": "https://variety.com/wp-content/uploads/2025/11/variation-copeland-split.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-24T19:42:00.000Z",
    "description": "\n\tA film adaptation of Rebecca Yarros‘ best-selling ballerina novel “Variation” is in the works at Amazon MGM Studios, Variety has confirmed.\n\n\t“It En",
    "body": "\n\tA film adaptation of Rebecca Yarros‘ best-selling ballerina novel “Variation” is in the works at Amazon MGM Studios, Variety has confirmed.\n\n\t“It Ends With Us” screenwriter Christy Hall is penning the script for the movie and President Barack and Michelle Obama’s Higher Ground and American Ballet Theatre vet Misty Copeland‘s Life in Motion Productions are producing.\n\n\tFrom Yarros (best known as the author of the “Fourth Wing” romantasy novel series, which is in development as a TV series at Amazon), “Variation” follows a renowned ballerina who returns to her family’s Cape Cod summer home to heal from her career-threatening injury, where she reunites with the Coast Guard rescue swimmer she never forgot about. As they confront unaddressed feelings from their past, family secrets about the tragedy that drove them apart are uncovered, they’re forced to question whether they made the wrong choices for the right reasons.\n\t\n\n\tAlong with “Variation” and “Fourth Wing,” other Yarros book-to-screen adaptations currently in the works include “In the Likely Event” movie at Netflix and “The Last Letter” as a film from Amazon MGM.\n\n\n\tIn addition to her work as screenwriter on the film adaptation of Colleen Hoover’s “It Ends With Us,” which grossed more than $350 million worldwide, Hall’s recent projects include her directorial debut and screenplay for the feature film “Daddio,” starring Sean Penn and Dakota Johnson, which she also wrote. Her other credits include co-creating the Netflix series “I Am Not Okay With This.” \n\n\tShe is repped by CAA, Untitled Entertainment and Yorn Levine Barnes.\n\t\n\n\t“Variation” marks the first feature film produced by Copeland’s Life in Motion Productions, which was co-founded with Emmy-winning writer and producer Leyla Fayyaz with the mission of “amplifying movement storytelling in film, television and on stage.” Under Copeland, who was named American Ballet Theatre’s first Black female principal dancer in 2015 and recently retired as the company’s principal dancer, Life in Motion has also produced the Emmy-nominated documentary “Lift” and the recently released documentary “Match in a Haystack,” as well as the indie narrative short, “Flower,” which premiered at the 2023 Tribeca Film Festival and was nominated for an NAACP Award.\n\n\tHigher Ground’s previous film credits include the Academy Award-winning documentary feature “American Factory” and the recently released Netflix apocalyptic thriller “Leave the World Behind,” as well as “Rustin,” “American Symphony,” “Crip Camp,” “Fatherhood,” “Becoming” and “Worth.”\n\n\tNews of the “Variation” film project was first reported by The Washington Post.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rebecca Yarros’ ‘Variation’ Film Adaptation Set at Amazon From ‘It Ends With Us’ Screenwriter; Obamas’ Higher Ground and Misty Copeland Producing",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/variation-copeland-split.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-24T19:42:00.000Z",
      "dateModified": "2025-11-24T19:42:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ice-T Says Reduced ‘Law & Order: SVU’ Screen Time Is Due to Budget Amid Kelli Giddish’s Return: ‘Everything Was Cool With Me. I Understood’",
    "url": "https://variety.com/2025/tv/news/ice-t-law-and-order-svu-screen-time-budget-1236590912/",
    "image": "https://variety.com/wp-content/uploads/2025/11/NUP_208907_01357.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-24T18:39:52.000Z",
    "description": "\n\tIce-T is explaining the lack of Fin on Season 27 of “Law & Order: Special Victims Unit.” After Mariska Hargitay, Ice-T has been on the Dick Wolf ser",
    "body": "\n\tIce-T is explaining the lack of Fin on Season 27 of “Law & Order: Special Victims Unit.” After Mariska Hargitay, Ice-T has been on the Dick Wolf series the longest, joining the show in Season 2 in 2000. However, he’s only appeared in four of the eight episodes this year.\n\n\t“It’s just basically business. They brought Kelli back. At the end of the day, they couldn’t keep both of us on both times, as far as budget-wise,” Ice-T said during a recent interview with TMZ, referring to Kelli Giddish, who portrayed detective Amanda Rollins from seasons 13 to 24, when she was written off. She returned full-time for Season 27, something that Hargitay fought for.\n\t\n\n\t“They said, ‘Ice, we’ll have you come in and out this year.’ Everybody wanted Kelli back. We have new cops. I am not leaving the show. I am more concerned with going to Season 28. This year, they said, ‘Ice, we’re going to work you a little less.’ Everything was cool with me. I understood. I said, ‘Are you getting rid of me?’ They said, ‘No way. We can’t imagine “Law and Order” without you,'” he continued. “I’ve been on this show for 27 years. I am not going to say anything negative about this show. They have taken care of me for so long. I’m trying to get to Season 28.”\n\n\n\tHe added that the free time has allowed him to do “other things,” like work on new music.\n\n\t“Don’t worry about me. I am kind of glad the fans are upset. What if I was missing and nobody cared?” he added. “I will be sprinkled throughout this season.”\n\n\tAt the end of Season 26, Juliana Martinez and Octavio Pisano exited the show. Aimé Donna Kelly was upped to series regular as Captain Curry and Noma Dumezweni joined as a recurring guest. Returning cast members also included Peter Scanavino and Kevin Kane.\n\t\n\n\tWolf executive produces with Hargitay, Kenneth Brown, Anastasia Puglisi and Peter Jankowski. Michele Fazekas joined as showrunner and executive producer for Season 27.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ice-T Says Reduced ‘Law & Order: SVU’ Screen Time Is Due to Budget Amid Kelli Giddish’s Return: ‘Everything Was Cool With Me. I Understood’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/NUP_208907_01357.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-24T18:39:52.000Z",
      "dateModified": "2025-11-24T18:39:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "As ‘Stranger Things’ Comes to an End, Its Impact on the ‘Dungeons & Dragons’ Renaissance Keeps Rolling",
    "url": "https://variety.com/2025/gaming/news/stranger-things-dungeons-and-dragons-hellfire-club-game-1236584626/",
    "image": "https://variety.com/wp-content/uploads/2025/11/Stranger-Things.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-24T19:04:42.000Z",
    "description": "\n\t“Something is coming. Something hungry for blood. A shadow grows on the wall behind you, swallowing you in darkness. It is almost here.” \n\n\tThe firs",
    "body": "\n\t“Something is coming. Something hungry for blood. A shadow grows on the wall behind you, swallowing you in darkness. It is almost here.” \n\n\tThe first dialogue spoken in Netflix’s “Stranger Things,” 12-year-old Mike Wheeler’s (Finn Wolfhard) scene-setting for a fictional attack he’s about to unleash on friends Will Byers (Noah Schnapp), Dustin Henderson (Gaten Matarazzo) and Lucas Sinclair (Caleb McLaughlin) in his basement, immediately establishes what is inarguably the show’s most iconic product tie-in: “Dungeons & Dragons.”\n\t\n\n\tThe influence the iconic table-top roleplaying game has had on Matt and Ross Duffer’s ’80s-set, sci-fi phenomenon is undeniable, both in terms of how often the game itself is played throughout the show, and the classic monsters and villains it has inspired within the show’s universe. \n\n\n\n\n\t\n\n\t\n\n\n\n\tBut the impact “Stranger Things” has had on “D&D” over the past nine years is equally impressive as the show (along with significant contributions from Critical Role, Dropout’s “Dimension 20,” and 2023 film “Dungeons and Dragons: Honor Among Thieves”) made what was largely still considered a cult classic game into a mainstream 2020s pastime.\n\n\t“I’ve been playing and running games for over 10 years now,” “Dungeons & Dragons” game designer Justice Arman told Variety. “And to see this explosion with 5th Edition and see ‘D&D’ bring people together during the pandemic through games over Zoom, I really am so glad to see this kind of renaissance happening. And it’s in no small part to shows like ‘Stranger Things,’ to our friends over at Critical Role, to all of these kind of artists who, much like Eddie Munson, probably played this game when they were younger and got inspired to become storytellers and now are paying it forward.”\n\t\n\n\tLast month, Hasbro and “Dungeons & Dragons” maker Wizards of the Coast released “Stranger Things: Welcome to the Hellfire Club,” a collaborative 3-5 player tabletop game product based on “Stranger Things,” which was made in partnership with the Duffers and Netflix. The game features the “lost adventures” created by “D&D” player Eddie Munson, the beloved Dungeon Master for the Hellfire Club introduced in the fourth season of “Stranger Things.”\n\n\n\n\t\n\n\t\n\n\n\n\tThe “Welcome to the Hellfire Club” set is a direct tie-in for the show and comes with character sheets featuring the “D&D” characters played by Mike, Dustin, Lucas, Will (not officially a Hellfire Club member, but they just had to get Will the Wise in there), and Lucas’ sister Erica (Priah Ferguson), and campaigns made in the classic 1st Edition format that Eddie and the “Stranger Things” kids would have been playing back in the ’80s. The materials are even styled to look worn and tattered, like they’d been discovered in someone’s attic after years of use.\n\n\t“I really love this set, because I think it was a really fun chance to, not only combine what is fun and amazing about ‘Stranger Things’ and ‘D&D’ and what those those two brands have in common, but also a chance for Justice and I and the rest of the team to do a little history dive into 1st Edition,” “Dungeons & Dragons” franchise creative director Kara Kenna said. “We did so much visual research into fonts, reading some of those modules that Eddie would have had. And it was a really fun deep dive, even into getting to look at the modules he would have played, and what we could pull from them to add to this experience.”\n\n\tArman, Kenna and the team incorporated plenty of Hawkins-specifics into the set, drawing from “Stranger Things” lore to make the work feel authentic to the in-universe storyline heading into the show’s fifth and final season, which debuts on Netflix Thursday.\n\n\n\n\t\n\n\t\n\n\n\n\t“For the earlier seasons, we walked this kind of interesting line of, we could have made these adventures just repeat beats from the show, but we wanted to find this line line between what people who are familiar with the show saw, as far as theme and inspiration, even some Easter eggs, but also giving them the agency to tell their own unique fantasy stories around it,” Arman said. “The second adventure in this set, ‘Scream of the Crop,’ takes a lot of inspiration from Season 2. There’s blighted farms. There are tunnels beneath the farms. There are some creatures underneath there. But the story that emerges is also one that’s categorically ‘D&D.’ And that also relates to the conceit of this set; that Eddie is entrusting these four adventures to the next wave of Hellfire Club. And there’s a beautiful welcome letter at the beginning that’s addressed to Dustin, basically encouraging him to finish his campaign, to take these things forward. And we’re kind of asking our people who play the set to do the same.”\n\t\n\n\tWhile the “D&D” team wanted to make this game a love letter back to the show that is itself a love letter to “D&D”, they also wanted to “make sure this was a full 5th Edition experience,” so “that it didn’t feel like something less than that for anyone that does play” today’s modern “D&D” offering.\n\n\n\n\t\n\n\t\n\n\n\n\t“But the pre-generated character sheets start you out without having to do any homework,” Kenna said. “You can just start with those characters at whatever level you want. And then the adventures are shorter, so it’s a little easier to do in a night or a couple nights, rather than having a big, long campaign, if you haven’t done that before. It has that balance between feeling like a nice entry point, but also is really a full 5E experience.”\n\n\tAs for whether you’ll get some hints to the “Stranger Things 5” plot by playing through “Welcome to the Hellfire Club,” Arman and Kenna confirmed they were exposed to Season 5 storylines and got “small hints” while developing the game.\n\n\t“Justice and I got to go to Atlanta and be on the set of Season 5 while they were filming for a day, which was very fun,” Kenna said. “We got to see some of the costuming and some of the things that are coming up in Season 5 as inspiration and part of the collaboration. But knowing the date that this came out, the goal was definitely not to spoil anything that we’re about to see in Season 5. We really focused on the overall tone of the whole show, really capturing that adventurous spirit that’s in both ‘D&D’ and ‘Stranger Things.’ And if there are any spoilers, you’ll find out later.”\n\n\tAs “Stranger Things” comes to an end, the Duffer Brothers are already planning a prequel series at Netflix. Does that mean more “D&D” collabs ahead?\n\n\t“We don’t have anything announced right now, but we’re always open,” Kenna said.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "As ‘Stranger Things’ Comes to an End, Its Impact on the ‘Dungeons & Dragons’ Renaissance Keeps Rolling",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/Stranger-Things.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-24T19:04:42.000Z",
      "dateModified": "2025-11-24T19:04:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "LISTEN: ‘Wicked: For Good’ Soars to Fourth-Highest Opening of 2025; HBO Preps for Busy 2026 Amid Warner Bros. Discovery M&A Drama",
    "url": "https://variety.com/2025/film/news/wicked-for-good-fourth-highest-2025-hbo-casey-bloys-1236590920/",
    "image": "https://variety.com/wp-content/uploads/2025/11/GettyImages-2246660626_629466-e1763444757362.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-24T18:11:12.000Z",
    "description": "\n\n\t\n\t\t\t\t\t\n\t\n\t\t\tPlus Icon\n\n\tFilm\n\n\t\n\t\t\t\n\t\t\t\t\t\n\t\n\t\t\tPlus Icon\n\n\tTV\n\n\t\n\t\t\t\n\t\t\t\t\t\n\t\n\t\t\tPlus Icon\n\n\tWhat To Watch\n\n\t\n\t\t\t\n\t\t\t\t\t\n\t\n\t\t\tPlus Icon\n\n\tMusic\n\n\t\n\t\t",
    "body": "\n\n\t\n\t\t\t\t\t\n\t\n\t\t\tPlus Icon\n\n\tFilm\n\n\t\n\t\t\t\n\t\t\t\t\t\n\t\n\t\t\tPlus Icon\n\n\tTV\n\n\t\n\t\t\t\n\t\t\t\t\t\n\t\n\t\t\tPlus Icon\n\n\tWhat To Watch\n\n\t\n\t\t\t\n\t\t\t\t\t\n\t\n\t\t\tPlus Icon\n\n\tMusic\n\n\t\n\t\t\t\n\t\t\t\t\t\n\t\n\t\t\tPlus Icon\n\n\tDocs\n\n\t\n\t\t\t\n\t\t\t\t\t\n\t\n\t\t\tPlus Icon\n\n\tDigital & Gaming\n\n\t\n\t\t\t\n\t\t\t\t\t\n\t\n\t\t\tPlus Icon\n\n\tGlobal\n\n\t\n\t\t\t\n\t\t\t\t\t\n\t\n\t\t\tPlus Icon\n\n\tAwards Circuit\n\n\t\n\t\t\t\n\t\t\t\t\t\n\t\n\t\t\tPlus Icon\n\n\tVideo\n\n\t\n\t\t\t\n\t\t\t\t\t\n\t\n\t\t\tPlus Icon\n\n\tWhat To Hear\n\n\t\n\t\t\t\n\t\t\t\n\n\t\n\t\n\t\t\t\t\t\n\n\tGot a Tip?\n\t\t\t\t\t\t\n\t\t\t\t\t\n\n\tNewsletters\n\t\t\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\n\t\n\t\n\t\tLISTEN: ‘Wicked: For Good’ Soars to Fourth-Highest Opening of 2025; HBO Preps for Busy 2026 Amid Warner Bros. Discovery M&A Drama\n\t\n\n\t'Daily Variety' podcast dives into news, trends and personalities making headlines in showbiz\n\t\n\t\t\t\n\n\n\t\t\t\n\t\t\t\n\t\n\n\t\t\t\t\t\t\t\t\tVariety\n\t\n\n\t\t\n\t\n\n\t\n\t\tMore from Variety\n\t\n\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\n\n\t\t\n\n\t\n\t\tMore From Our Brands\n\t\n\t\n\t\t\n\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\n\tRolling Stone\n\n\t\t\t\t\tThe 14 Best ‘KPop Demon Hunters’ Merch And Gifts to Show Off How It’s Done, Done, Done\t\t\n\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\n\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\n\tRobb Report\n\n\t\t\t\t\tThis Sprawling $88 Million Silicon Valley Estate Was Inspired by Lake Como\t\t\n\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\n\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\n\tSportico\n\n\t\t\t\t\tReal Madrid Forecasts Record $1.44B in Revenue as It Preps Stake Sale\t\t\n\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\n\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\n\tWWD\n\n\t\t\t\t\tOpenAI Launches Shopping Research Feature Aimed at Stronger Product Discovery\t\t\n\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\n\t\t\n\t\n\t\n\t\n\n\n\t\n\n\tFilm\n\t\n\t\n\t\t\t\t\t\n\n\tNews\n\t\t\t\n\t\t\t\t\t\n\n\tReviews\n\t\t\t\n\t\t\t\t\t\n\n\tPodcasts\n\t\t\t\n\t\t\t\t\t\n\n\tBox Office\n\t\t\t\n\t\t\t\t\t\n\n\tEvents\n\t\t\t\n\t\t\t\t\t\n\n\tColumns\n\t\t\t\n\t\t\t\t\t\n\n\tTrailers\n\t\t\t\n\t\t\t\n\n\n\t\n\n\tTV\n\t\n\t\n\t\t\t\t\t\n\n\tNews\n\t\t\t\n\t\t\t\t\t\n\n\tReviews\n\t\t\t\n\t\t\t\t\t\n\n\tPodcasts\n\t\t\t\n\t\t\t\t\t\n\n\tRatings\n\t\t\t\n\t\t\t\t\t\n\n\tColumns\n\t\t\t\n\t\t\t\t\t\n\n\tTrailers\n\t\t\t\n\t\t\t\n\n\n\t\n\t\t\t\t\t\n\n\tLists & Features\n\t\t\t\n\t\t\t\n\n\n\t\n\n\tMusic\n\t\n\t\n\t\t\t\t\t\n\n\tNews\n\t\t\t\n\t\t\t\t\t\n\n\tAlbum Reviews\n\t\t\t\n\t\t\t\t\t\n\n\tConcert Reviews\n\t\t\t\n\t\t\t\t\t\n\n\tHitmakers\n\t\t\t\n\t\t\t\t\t\n\n\tMusic For Screens\n\t\t\t\n\t\t\t\t\t\n\n\tGrammys\n\t\t\t\n\t\t\t\n\n\n\t\n\n\tDocs\n\t\n\t\n\t\t\t\t\t\n\n\tLists & Features\n\t\t\t\n\t\t\t\n\n\n\t\n\n\tTech\n\t\n\t\n\t\t\t\t\t\n\n\tFeatures\n\t\t\t\n\t\t\t\t\t\n\n\tGlobal\n\t\t\t\n\t\t\t\t\t\n\n\tVIP+ Tech\n\t\t\t\n\t\t\t\n\n\n\t\n\n\tGlobal\n\t\n\t\n\t\t\t\t\t\n\n\tNews\n\t\t\t\n\t\t\t\t\t\n\n\tAsia\n\t\t\t\n\t\t\t\t\t\n\n\tMarkets & Festivals\n\t\t\t\n\t\t\t\t\t\n\n\tFeatures\n\t\t\t\n\t\t\t\n\n\n\t\n\t\t\t\t\t\n\n\tNews\n\t\t\t\n\t\t\t\t\t\n\n\tFilm Predictions\n\t\t\t\n\t\t\t\t\t\n\n\tTV Predictions\n\t\t\t\n\t\t\t\t\t\n\n\tVideo\n\t\t\t\n\t\t\t\t\t\n\n\tArtisans\n\t\t\t\n\t\t\t\t\t\n\n\tColumns\n\t\t\t\n\t\t\t\t\t\n\n\tAwards Circuit Podcast\n\t\t\t\n\t\t\t\n\n\n\t\n\n\tVideo\n\t\n\t\n\t\t\t\t\t\n\n\tPopular\n\t\t\t\n\t\t\t\t\t\n\n\tCover Shoots - Behind the Scenes\n\t\t\t\n\t\t\t\t\t\n\n\tActors on Actors\n\t\t\t\n\t\t\t\t\t\n\n\tPower of Women\n\t\t\t\n\t\t\t\t\t\n\n\tEvents\n\t\t\t\n\t\t\t\t\t\n\n\tArtisans\n\t\t\t\n\t\t\t\n\n\n\t\n\t\t\t\t\t\n\n\tLists & Features\n\t\t\t\n\t\t\t\n\n\n\t\n\t\t\t\t\t\n\n\tObituaries - submit obituaries to obits@variety.com\n\t\t\t\n\t\t\t\t\t\n\n\tPhotos\n\t\t\t\n\t\t\t\t\t\n\n\tPodcasts\n\t\t\t\n\t\t\t\t\t\n\n\tScene\n\t\t\t\n\t\t\t\t\t\n\n\tVoices\n\t\t\t\n\t\t\t\t\t\n\n\tTheater\n\t\t\t\n\t\t\t\n\n\n\t\n\t\t\t\t\t\n\n\tLive Media Summits\n\t\t\t\n\t\t\t\t\t\n\n\tVscore\n\t\t\t\n\t\t\t\t\t\n\n\tLuminate - Film & TV\n\t\t\t\n\t\t\t\t\t\n\n\tVariety Archives\n\t\t\t\n\t\t\t\t\t\n\n\tVariety500\n\t\t\t\n\t\t\t\t\t\n\n\tIndustry Executives\n\t\t\t\n\t\t\t\n\n\t\n\t\n\t\t\t\t\t\n\n\tHave a News Tip?\n\t\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\n\n\tNewsletters\n\t\t\t\t\t\t\n\t\t\t\n\t\t\t\n\t\tad\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "LISTEN: ‘Wicked: For Good’ Soars to Fourth-Highest Opening of 2025; HBO Preps for Busy 2026 Amid Warner Bros. Discovery M&A Drama",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/GettyImages-2246660626_629466-e1763444757362.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-24T18:11:12.000Z",
      "dateModified": "2025-11-24T18:11:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How ‘Frankenstein’ Used Color to Create Victorian-Era Edinburgh: ‘Everything Is Vintage and of the Period’",
    "url": "https://variety.com/2025/artisans/news/frankenstein-artisans-creating-color-victorian-edinbrugh-1236588375/",
    "image": "https://variety.com/wp-content/uploads/2025/11/319_Frankenstein_u_00_09_14_15L_0efa13.png?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-24T18:00:00.000Z",
    "description": "\n\tWhile beginning the pre-production process for Guillermo del Toro’s “Frankenstein,” production designer Tamara Deverell began her research by going ",
    "body": "\n\tWhile beginning the pre-production process for Guillermo del Toro’s “Frankenstein,” production designer Tamara Deverell began her research by going to museums to create the look of 1850s Edinburgh.\n\n\t“One of the first opportunities I had to spend time with Guillermo was when we were scouting. One of the first things we did was go to museums,” said Deverell in a conversation moderated by Variety in partnership with Netflix. “We went to the Ontarian, where the real Evelyn tables are, because we had to do our own version of them. We saw the equipment and the tools of the trade of the scientists and doctors of that period.”\n\t\n\n\tIn creating the Victorian landscape of Edinburgh, costume designer Kate Hawley collaborated with Deverell to help bring to life a color scheme that reflected Victor Frankenstein’s (Oscar Isaac) state of mind as he gets expelled from the Royal College of Surgeons. The world of Edinburgh is cold and bitter, with small glimpses of color seen throughout the costumes of characters like Lady Elizabeth Harlander (Mia Goth).\n\n\t“Edinburgh is the color of wet cobblestone and the incredible stone buildings,” said Deverell. “That was our color palette, and as we picked the locations of Gosford House, we had the color palette of the marble and the cream tones that were all these beautiful period tones.”\n\n\t“Color serves as a sort of different role. All the time when I worked with Guillermo, the background is part of the environment in the world,” Hawley said. “All those colors ended up in the colors of the background extras. We have a different language of color. There’s also a beautiful tone of melancholy and mood. That affected how we did color.”\n\t\n\n\tColor played a large part into creating the look of the Creature (Jacob Elordi), a monstrous creation that Victor creates in order to defy the odds and conquer death. By utilizing the look of different body parts and decaying corpses from the Crimean War, prosthetics designer Mike Hill collaborated with del Toro to amplify the look of the Creature to be accurate to the time period.\n\n\t“Everything is vintage and of the period,” said Hill. “The one thing we tried to achieve was making this creature feel like he stepped out of the 1800s, and he’s not a modern day creature design.”\n\n\tAside from the streets of Edinburgh, the film also utilizes a Royal Danish Navy ship, the Horisont, whose crew discovers a wounded Victor Frankenstein in the opening sequence of the film. Instead of resorting to green screens, del Toro and his team handcrafted a practical ship encased in ice on its way to the North Pole. Deverell collaborated with historians and shipbuilders on creating a ship that looked authentic, but could also move as if it was on sea.\n\n\t“It was an adventure building the ship. We looked at what Guillermo wanted to do in the film, [such as] the action and the requirements to really move the ship,” said Deverell. “We built it on a giant gimbal that actually did the movement. When the creature pushes it, it’s a whole huge engineered gimbal inside the ship. We had this great guy, Matthew Betts, who advised us [as] an Arctic historian but also a shipbuilder. He was bringing me information like we could do iron plates on the ship because that’s what they had for the ice. We were devising ways on how to make the ice.”\n\n\t207 years later, “Frankenstein” cemented itself as a literary classic, and with the film adaptation, has opened the doorway for new generations to discover Mary Shelley’s words. After reading the book as a child, del Toro hopes that the message behind the story resonates with audience members watching the film for the first time. \n\n\t“The fact that it was written by a teenager, and it is as urgent as a book written by a teenager is what makes it immortal,” revealed del Toro. “It asks all the questions in the time you need to ask the questions. My hope is people don’t say, ‘Oh, the movie is the book,’ but that they discover Mary Shelley. It’s one of those books that makes your life richer.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How ‘Frankenstein’ Used Color to Create Victorian-Era Edinburgh: ‘Everything Is Vintage and of the Period’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/319_Frankenstein_u_00_09_14_15L_0efa13.png?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-24T18:00:00.000Z",
      "dateModified": "2025-11-24T18:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Remembering Robert Pietranton: A PR Legend With a Taste for Springsteen, Scorsese, Soccer and Steelers",
    "url": "https://variety.com/2025/tv/news/remembering-robert-pietranton-springsteen-scorsese-soccer-1236590532/",
    "image": "https://variety.com/wp-content/uploads/2025/11/David-Shaw-Robert-and-Stu.jpg?w=448&h=299&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-24T18:00:00.000Z",
    "description": "\n\tFormer Variety staffer Stu Levine, now a PR executive at NBCUniversal, was a close friend of publicity and communications exec Robert Pietranton, th",
    "body": "\n\tFormer Variety staffer Stu Levine, now a PR executive at NBCUniversal, was a close friend of publicity and communications exec Robert Pietranton, the Warner Bros. TV Group senior VP who died last week at 56. Here, Levine shares his personal memories of Pietranton.\n\n\tThank you, Marianne Romano.\n\n\n\tIt was circa 2002 and I was covering the TV beat at Variety when my phone rang in the office. It was Marianne, who was a good friend and the head of publicity for Nickelodeon. She was calling to say I should probably meet one of her publicist friends for lunch, a guy named Robert Pietranton. He had read my stories and was a big Bruce Springsteen fan, like myself. She thought we’d have a lot in common and hit it off.\n\t\n\n\tAbsolutely, I said. I loved talking Bruce. What did I have to lose?\n\n\tWe met at the long-shuttered Ammo on Highland Avenue in Hollywood and I brought along my best friend, David Shaw, another Bruceaholic for what we figured would be a fun and long lunchtime conversation.\n\n\tIt lasted 23 years.\n\n\tThere hadn’t been a day up until last Wednesday where the three us didn’t text or talk to each other.\n\n\tMy good friends at Variety and Deadline, who all have been great colleagues with Robert for the past few decades, were kind of enough to let me use their space today so I can share my stories about him with all of you. His dear friends and colleagues. And, trust me, there are a lot of you.\n\n\tIf you go to his Facebook page right now, you’ll see he had 850 friends. That’s not an exaggeration or Mark Zuckerberg-invented bots. That’s truly how beloved he was.\n\t\n\n\tAs much as Robert was the GOAT of PR and communications, I can tell you he would’ve traded it all in to be a journalist. He loved those ink-stained wretches who get to the truth and uncover dirty deeds, whether it was in politics, sports or entertainment.\n\n\tHe bought and read all 21 books by Bob Woodward, the award-winning Washington Post writer. That’s who he wanted to be.\n\n\tWhen he was between jobs at Sony and Warner Bros. and feeling a little disheartened, I hired him to write several freelance stories for Variety. I knew it would cheer him up and help keep him financially afloat for a little while. He loved it. He was at the Beverly Hilton one day on an assignment, interviewing an Israeli diplomat who was in town trying to drum up some business for the Israeli TV community. He called me right after to say what a great day it was and how it got his journalism juices flowing. I told him before he got too excited about switching professions, he should stick to PR because he couldn’t afford the drop in pay. We laughed.\n\n\tHe was never great with money. I would give him financial tips and advice about investing. He would listen, but it wouldn’t stick. He was the kind of guy to put money under the mattress. He was old school, all cash. We would often joke that I would never have more than $10 in my wallet and he would never have less than $1,000 in his.\n\n\tWhen current events dictated, we would chat about politics, but not often. His political leanings were to the left of Bernie Sanders and he loathed the ultra rich who flaunted their wealth. I would often tease him about his own finances.\n\n\t“Robert, you’re a senior vice president at a major Hollywood studio making a very nice salary. About 95% of the country would say you’re rich!” “Well, maybe,” he would retort right back, sharply, “but I don’t act rich!”\n\n\tNo, he didn’t. Much of his family were raised living hardscrabble lives in West Virginia and he grew up with that mindset. He was generous to a fault, always thinking about the working class. When we would go out to dinner, he would never leave less than a 30% tip. Never. If I was treating and filling out the receipt, he would look at me and plead, “Please leave a good tip. I know these people and have to come back here.”\n\t\n\n\tWe would chat on the phone all the time and, oh, how he loved to talk when he got on a roll. Admittedly, I’m not the kind of guy who can gab for an extended length of time on the phone, but I never really wanted to hang up on him because I know he’d be so disappointed. When I would start to wrap up a conversation, he’d pause and say, “That’s it? You’re done with me? Nice friend, you are!”\n\n\tIn a strange turn of fate, I would leave Variety after 15 terrific years and become a PR professional myself. We practically had identical jobs – him at Warner Bros. and me at NBC, writing press releases, internal/external communications, dealing with the entertainment press and trying to soothe nervous execs about upcoming stories in the trades. We would often talk at the end of a busy day and trade war stories (“Did Nellie call you about this today? No? Well, she will. Get ready.”) We worked side-by-side on many WB-NBC shows together (“Manifest,” “Night Court,” “Found” and “Brilliant Minds,” just to name a few) and were even lucky enough to share the same boss, the wonderful Rebecca Marks. I can’t tell you how happy Robert was when he found out Rebecca would be leading the PR team at WB after her long run at NBC.\n\n\tHe wasn’t a saint. He certainly had his faults. He could be grumpy, he spent too much money on Door Dash, ran his car into the ground until I convinced him to buy a new one and never watched “Friday Night Lights,” a sin for which I will never forgive him.\n\n\tWithout a doubt, our shared obsessions were movies, television and Bruce. He loved no director more than Martin Scorsese. Whenever the opening night of a Scorsese film was announced, often months or even years in advance, Robert, David and I would circle it on our calendars and then immediately make a reservation at Rao’s, our favorite Italian restaurant in Hollywood, so after the movie we could discuss it in endless detail over meatballs and gravy.\n\n\tHis love of Scorsese and films such as “GoodFellas” and Francis Ford Coppola’s “The Godfather” remind me of how he wore his Italian heritage like a badge of honor. Watching Italy playing in the World Cup was his national holiday. It makes me truly sad that he never got to travel to his homeland and eat pasta near the Trevi Fountain in Rome or gelato on the streets of Florence.\n\t\n\n\tWhen it came to TV, Robert was a connoisseur. We bowed to the Three Holy Davids – Milch, Simon and Chase – and would rewatch seasons and recite lines from “Deadwood” (“Open the peaches, Johnny!”), “The Wire” (“Omar comin’!”) and “The Sopranos” (“What? No fuckin’ ziti?”) every year. Oh, and how he could speak verbatim from “The West Wing” and “Homicide: Life on the Street.”\n\n\tWhat put a huge smile on Robert’s face this past year was the success of “The Pitt.” Not only was it a huge hit for his home studio, but it represented a return to old school television. Fifteen episodes. In the hands of the ultimate professional, John Wells. Coming out at the same time every year.\n\n\tLike enjoying his favorite shows year after year, he loved the repetitions of life, the traditions in everything he did. Watching European soccer every weekend, going to the movies on Friday nights with David and planting himself each and every fall Sunday – whether at his home or in a sports bar – to watch and lament over his beloved Pittsburgh Steelers.\n\n\t(True story: I went over to his house to watch a Steelers playoff game one year and said I would bring food. He was fully expecting a bucket of wings and/or maybe a pizza. When I showed up with a fruit salad, it might’ve been the saddest I’ve ever seen him.)\n\n\tThe last time I saw Robert was about 10 days ago, when we took him to Rao’s for his 56th birthday dinner. As you all know, he hated the spotlight and would rather crawl under a rock than get any sort of attention. So, just for that reason, as I loved to make him squirm, I asked the waiters to sing happy birthday. They didn’t, but David, his good friend TJ Johnson and I sure did. Loudly. Making sure the whole restaurant could hear and applaud.\n\n\tOn the day of his passing as I was silently grieving, my wife texted me this:\n\n\t“When I pulled into the garage at home, a beautiful white owl flew onto the telephone wires in the backyard. Have never seen this before, so I looked up the spiritual meaning and this came up: ‘Owls are often seen as messengers between worlds. In many traditions, they symbolize wisdom, intuition and the unseen. Encountering an owl after a loss might feel like a sign that your friend’s spirit is at peace or trying to communicate reassurance.’”\n\t\n\n\tTo bring it back to Springsteen’s own words, which I think Robert would appreciate, I’ll share exactly what Bruce said when he lost Clarence Clemons, who was his longtime sax man and musical appendage.\n\n\t“I’ll see you in the next life, Big Man.”\n\n\tIf you’d like to share your stories about Robert with Levine, please reach him at stuart.levine@nbcuni.com.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Remembering Robert Pietranton: A PR Legend With a Taste for Springsteen, Scorsese, Soccer and Steelers",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/David-Shaw-Robert-and-Stu.jpg?w=448&h=299&crop=1"
      ],
      "datePublished": "2025-11-24T18:00:00.000Z",
      "dateModified": "2025-11-24T18:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘All’s Fair’ Renewed for Season 2 at Hulu",
    "url": "https://variety.com/2025/tv/news/alls-fair-renewed-season-2-1236590879/",
    "image": "https://variety.com/wp-content/uploads/2025/11/175993_0151RC-e1764004599278.jpg?crop=0px%2C180px%2C8035px%2C4520px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-11-24T18:30:00.000Z",
    "description": "\n\tJustice is served? “All’s Fair” has been renewed for Season 2 at Hulu.\n\n\tThe Ryan Murphy series debuted on Nov. 4 and quickly became a camp classic.",
    "body": "\n\tJustice is served? “All’s Fair” has been renewed for Season 2 at Hulu.\n\n\tThe Ryan Murphy series debuted on Nov. 4 and quickly became a camp classic. Despite being despised by critics (Variety dubbed it a “condescending take on girlboss fantasia”), the divorce lawyer drama starring Kim Kardashian was a ratings hit, launching at No. 1 on the Hulu viewership chart and becoming the streamer’s biggest original scripted series premiere in three years (based on the first three days of streaming).\n\t\n\n\t“All’s Fair” follows a team of female divorce attorneys who leave a male-dominated firm to start their own powerhouse practice. Per the logline, “Fierce, brilliant, and emotionally complicated, they navigate high-stakes breakups, scandalous secrets, and shifting allegiances — both in the courtroom and within their own ranks. In a world where money talks and love is a battleground, these women don’t just play the game — they change it.”\n\n\n\tThe series stars Naomi Watts, Niecy Nash-Betts, Teyana Taylor, Matthew Noszka, Sarah Paulson and Glenn Close, who all one-up each other with deliriously absurd lines of dialogue. (There’s talk of “piggly-wiggly titties” and “blowing a priest with chlamydia,” but Paulson takes the cake, perhaps, with “See you in court, cuntburger.”)\n\n\t“All’s Fair” is written and executive produced by Murphy, who also directs. EPs also include Jon Robin Baitz, Joe Baken, Jamie Pachino, Lyn Greene and Richard Levine, alongside series stars Kardashian, Close, Watts, Nash-Betts and Paulson. Anthony Hemingway executive produces and directs. And wait — there’s more! Kris Jenner, Eric Kovtun, Scott Robertson and Nissa Diederich also executive produce.\n\t\n\n\tTaylor defended the show during an interview with Variety‘s Marc Malkin earlier this month at the Governors Awards in Los Angeles. “It’s our first season,” she said, in part. “Give us a little bit of grace.”\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘All’s Fair’ Renewed for Season 2 at Hulu",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/175993_0151RC-e1764004599278.jpg?crop=0px%2C180px%2C8035px%2C4520px&resize=1000%2C563"
      ],
      "datePublished": "2025-11-24T18:30:00.000Z",
      "dateModified": "2025-11-24T18:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Greg Berlanti, Bash Doran’s ‘Foster Dade’ Hulu Pilot Casts Cameron Mann (EXCLUSIVE)",
    "url": "https://variety.com/2025/tv/news/greg-berlanti-foster-dade-hulu-pilot-cast-cameron-mann-1236590812/",
    "image": "https://variety.com/wp-content/uploads/2025/11/Cameron-Mann-e1764002162719.jpeg?w=527&h=394&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-24T18:00:00.000Z",
    "description": "\n\tThe “Foster Dade” pilot at Hulu has added Cameron Mann to its cast, Variety has learned exclusively. \n\n\tMann will appear in the pilot, which is base",
    "body": "\n\tThe “Foster Dade” pilot at Hulu has added Cameron Mann to its cast, Variety has learned exclusively. \n\n\tMann will appear in the pilot, which is based on the Nash Jenkins novel “Foster Dade Explores the Cosmos,” alongside previously announced cast members Matt Bomer and Chloe East. The project was picked up to pilot at Hulu back in August. \n\n\tThe official logline states the show is a “sophisticated mystery set at an East Coast boarding school that explores privilege, scandal, sexuality, and masculinity amid the rise of social media, millennial anxiety and pharmaceuticals.” \n\t\n\n\tMann will star as Jack Albright, described as “Kennedy’s golden boy — magnetic, athletic, born to lead. He moves through the world with effortless charm and unshakable confidence, his lacrosse stick a permanent appendage. On Foster’s first day, Jack greets him with an easy grin and a welcoming hand — but beneath his charisma lies a volatility, a combustible mix of privilege and insecurity.” \n\n\tMann recently appeared in the Ari Aster feature “Eddington” in his feature debut. He is primarily known for his television roles, which include hit shows like “Mare of Easttown” at HBO, “Daredevil” at Netflix, and “Law & Order: SVU” at NBC. He is also an accomplished stage actor, including starring in the the Broadway developmental lab production of “The Secret Garden” and playing Nate in “Peace, Love and Cupcakes” at the New York Music Festival.  \n\n\tHe is repped by Innovative Artists, Stride Management, and Jackoway Austen Tyerman. \n\n\t“Foster Date” is being written and executive produced by Greg Berlanti and Bash Doran. Sarah Schechter and Leigh London Redman of Berlanti Productions also executive produce along with Donald De Line of De Line Pictures, Robbie Rogers, and Jenkins. Warner Bros. Television, where Berlanti is under an overall deal, is the studio. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Greg Berlanti, Bash Doran’s ‘Foster Dade’ Hulu Pilot Casts Cameron Mann (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/Cameron-Mann-e1764002162719.jpeg?w=527&h=394&crop=1"
      ],
      "datePublished": "2025-11-24T18:00:00.000Z",
      "dateModified": "2025-11-24T18:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ray Romano and Phil Rosenthal on What Took So Long for an ‘Everybody Loves Raymond’ Reunion and Why There Will Never Be a Reboot",
    "url": "https://variety.com/2025/tv/news/ray-romano-phil-rosenthal-no-everybody-loves-raymond-reboot-1236590564/",
    "image": "https://variety.com/wp-content/uploads/2025/11/3123414_0233bc3.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-24T18:22:13.000Z",
    "description": "\n\tDuring the waning days of the COVID-19 pandemic, Ray Romano was flipping through Peacock when he stumbled across his old show “Everybody Loves Raymo",
    "body": "\n\tDuring the waning days of the COVID-19 pandemic, Ray Romano was flipping through Peacock when he stumbled across his old show “Everybody Loves Raymond.” And whaddyuh know, it was pretty good! \n\n\t“I hadn’t seen an episode in 10 years, 15 years,” he says. “And I went, ‘wow!’ I appreciated it more than before.”\n\n\tSo Romano did what any self-respecting fan would do: He binged the entire series, all 210 episodes — and he ranked each one, on a scale up to 100.  “I never gave everything 100 because nothing is perfect, but I did appreciate everybody’s work more now,” he says. “Now that I can take a step back and it feels like a different time. I appreciated the show more, and all the actors and the writers even more.”\n\t\n\n\tTalk about perfect timing to pull out that notebook. After years of trying, series creator Phil Rosenthal finally got the show’s living veterans together, on stage at Television City, to reminisce about the hit CBS sitcom, which aired from 1996 to 2005. \n\n\n\tRomano and Rosenthal host “Everybody Loves Raymond: 30th Anniversary Reunion,” a 90-minute special that airs Monday on CBS (and for some Paramount+ subscribers).  The reunion, filmed last month, took place on a soundstage where the Barone family’s living room was recreated for the event. Besides Romano, who played sportswriter and family man Ray Barone on “Everybody Loves Raymond,” series stars also joining in on the special included Patricia Heaton (Debra), Brad Garrett (Robert), Monica Horan (Amy), Madylin Sweeten (Ally) and Sullivan Sweeten (Michael).\n\n\tThe special includes a tribute to Doris Roberts and Peter Boyle, who played Ray’s parents Marie and Frank Barone on the show.  Fulwell Entertainment, which was behind the special “Friends: The Reunion,” celebrating another landmark 1990s sitcom, is also the producer on “Everybody Loves Raymond: 30th Anniversary Reunion.”\n\t\n\n\tSo what took so long to get everyone back together? “Ten years ago, I thought, ‘Hey, it’s 20 years. We should do a reunion.’ CBS, not so excited. How about 25 years? ‘Nah, we have other things.’ And then this is a new regime there, and they’re into it,” Rosenthal says.\n\n\tDid this inspire Rosenthal and Romano to consider revisiting the series with a revival or reboot? Hard pass from them both. \n\n\t“We never wanted to do a reboot,” Rosenthal says. “First of all, we can’t because, sadly, we’re missing some people. So it would never be the same. Secondly, I think Ray and I agree that they’re not really ever as good.”\n\n\tIn a wide-ranging conversation, Rosenthal and Romano discuss how they can’t believe how much time has passed — Romano is now older than Boyle was on the show — and Romano also defends his lack of travel (until Rosenthal forced him to go to Italy as part of the show). They also talk about Rosenthal’s new restaurant and so much more.  Here’s Variety‘s full chat with Romano and Rosenthal about “Everybody Loves Raymond: 30th Anniversary Reunion.”\n\t\n\t\tAs I’m getting ready to talk to you guys, I see breaking Ray Romano news, which is exciting. He’s joining the cast of “Running Point” over at Netflix!\t\n\n\tROMANO: Yeah, that just happened in the last two weeks. We’re almost done. I’m jamming in my scenes here, and. I shot for a week and a half. It’s great. They’re fun over there.\n\t\n\t\tAnd Phil, we like everything you do as well. I know not to play favorites.\t\n\n\tROSENTHAL: That’s very sweet. But Ray has become an incredible actor over the years. I think he was always great, I thought on our show, and then went to another level.\n\t\n\t\tHe became such a fantastic dramatic actor as well! Now that I’ve been covering this business for 30 years, that puts me a year in front of the start of Raymond. I remember covering the launch of “Everybody Loves Raymond,” and at the time there was that question of, “well, can Ray act?”\t\n\n\tROMANO: And the answer was “almost” — because I had just gotten fired year before, from another sitcom.\n\t\n\t\tOh, it was “NewsRadio.” We remember. We know the history!\t\n\n\tROMANO: Right, so I understand the worry. And actually, when I look at the first season of “Raymond,” I see the evolution. I really do.\n\t\n\t\tHow often do you go back and watch? Or did you do a refresher binge for the special?\t\n\n\tROMANO: I didn’t do it for the special, but I did it around COVID, or maybe a little bit after COVID. I caught one show on Peacock, and I hadn’t seen an episode in 10 years, 15 years. And I went, “wow.” I appreciated it more than before. So I said, You know what? I get into these things, I’m a little OCD. So I started watching every episode in order and rating them. I gave each one a grade from 1 to 100 And I watched. It took me about a month or so, and I watched all 210 episodes again. I never gave everything a 100 because nothing is perfect, but I did appreciate everybody’s work more now. Now that I can take a step back and it feels like a different time. I appreciated the show more, and all the actors and the writers even more.\n\t\n\t\n\t\tDo you still have this book with all the ratings?\t\n\n\tROMANO: It’s just a list of 1 to 100 and I think I put them in groups. Like the ones that were in the 90s and the 80s and 70s.\n\t\n\t\tWhat was the lowest rating?\t\n\n\tROMANO: In the 70s. Listen, you’re making 210 episodes. Without fail, any episode that I gave in the 70s is somebody’s favorite episode. That’s just the way I look at it. I’m critiquing myself. It’s that kind of thing.\n\n\tROSENTHAL: I think I’m very happy with that rating system. I think we always said there was a level that we shouldn’t go below.\n\n\tROMANO: Yes, so even our worst episode is a good episode.\n\n\tROSENTHAL: You can live with it.\n\t\n\t\tI was gonna say, 70 is still a strong C. If you had gotten into the 60s, you’re getting to the D territory. But this sounds like mostly A’s and B’s.\t\n\n\tROMANO: I think Paul Reiser said it once, he goes, “when you’re making 26 episodes a season, and you got to crank them out, six or seven of them you’re going to love. Six or seven you’re not going to love. And the rest are going to be really good episodes.” But we did have our share of episodes that were stellar, you know?\n\t\n\t\tAnd I can’t believe now we’re hitting 30 years. How do you guys feel about that number? It’s hard to believe.\t\n\n\tROSENTHAL: Old!\n\n\tROMANO: Yeah, old. It’s it’s odd, how fast it goes.\n\t\n\t\tAnd yet you guys are still doing such great work and are still right there in the zeitgeist.\t\n\n\tROMANO: I really think of time. I gauge it on sometimes the show, and I think, “wow, this birthday coming up for me, I am going to be as old as Peter Boyle, who played my father, was in the seventh season of ‘Raymond.'” That’s where I am now.\n\t\n\t\tA lot of people follow the “Wilfred Brimley line,” how old Wilfred Brimley was in “Cocoon” when he had just turned 50 or something like that.\t\n\n\tROSENTHAL: People looked older back then. How old were Carroll O’Connor and Jean Stapleton doing “All in the Family”?\n\n\tROMANO: I remember a while back, I stumbled on “Marty” and I watched the movie. Ernest Borgnine’s mother, who’s trying to get him married, is like, “I want to see him get married. I mean, how much longer? Look at me. I’m a 57 years old!”‘ What?\n\t\n\t\tSo Ray, you have the “Peter Boyle line” of, “what’s my age in comparison to Peter on the show,” which is pretty wild. Meanwhile, I love seeing the two of you together. For years now, as Phil has gone on book tours and “Somebody Feed Phil” show tours — and he always tells the story about taking you to Italy for the first time and breaking you into global travel, global food, et cetera. What it meant to take “the show “Everybody Loves Raymond” to Italy, and what a game changer that was for you. How do you now look back on that and how Phil maybe helped open your world a little bit.\t\n\n\tROMANO: In defense of myself, part of my reluctance is, I’m a very neurotic person. I don’t like to fly,  I worry about what if I need medicine and all that kind of stuff. But what the beauty of that was, yes, there was truth to me being content. I don’t think I ever needed to fly overseas. Not that I don’t enjoy other people’s cultures and and meeting other people — because I will be honest, I really get satisfaction and joy now knowing that this show resonates with people from totally different backgrounds and cultures. It’s a great feeling of thinking that underneath everything, we’re all the same, you know? And when that happened, I hadn’t experienced that. \n\t\n\n\tRight after we filmed that episode, my wife, who’s from Sicily, and I visited her parents’ hometown, a little village on a hill — and it was life imitating art. It was exactly like the episode we had just filmed. I was eating this pizza. There were goats. There was a farm. There was these people and all this love and affection and everything. I do like meeting people from different parts and having this bond with them, It reassures my faith in humanity. So I’m not this curmudgeon, who’s, you know, misanthropic, to use a big word.\n\n\tROSENTHAL: Oh, that’s a good word. You even said it right.\n\t\n\t\tFor the both of you, in your travels, when people bring up “Raymond,” what’s generally their connection? What do they want to talk to you about? What’s the thing that they gravitate toward?\t\n\n\tROMANO: One of the biggest things is the mother. Everybody seems to have a mother like that.\n\n\tROSENTHAL: They say that the biggest compliment, even when we were on originally, that ‘you were listening outside our house last night.’ Because it felt real to them, they related to it. But we didn’t have to listen outside their house, because we were listening inside our house. And it just proves that if you if you’re truthful, and you write the truth of a situation and get very specific about it, it’ll resonate. Even if that person’s experience isn’t exactly yours, the specifics of it are relatable in and of themselves.\n\t\n\t\tTell me more about the special and when the conversation started to come about of, “let’s get everyone who can back together again.”\t\n\n\tROSENTHAL: Ten years ago, I thought, “Hey, it’s 20 years. We should do a reunion.” CBS, not so excited. How about 25 years? “Nah, we have other things.” And then this is a new regime there, and they’re into it. By the way, that’s no small thing. I always say you have to get lucky, right? Here we had to get lucky for the right people to be in the right spot at the right time. Otherwise there is no show. You’re dependent on their taste and their needs and the thing. So, we just got lucky with with the new president over there is a fan of the show, Amy. I’m very grateful that they gave us this opportunity because we had a wonderful time filming it, getting to see everybody again. Including the crew and our guest cast. We had a little party after, it was delightful. Couldn’t have been better.\n\t\n\t\n\t\tWhat was it like for you, Ray, to walk on the re-creation of the set, and how they did their best to make it like you were stepping back into that world again?\t\n\n\tROMANO: You’ll probably see that in the special, because they filmed that. They filmed before we opened it up to the audience. Before they opened the curtain, they took me and Phil out there to show us the set. And was emotional. I think we both got emotional, and they filmed us.\n\t\n\t\tWas there anything that you guys heard that surprised you? Maybe from from anyone else on stage, or anything that came up that you maybe learned after 30 years?\t\n\n\tROMANO: We talked to the audience a little and I learned that some woman in the Philippines learned to speak English listening to me.\n\n\tROSENTHAL: Hilarious. Madylin Sweeten, the little girl on the show, said that I gave her a note. I gave lots of notes I don’t remember, but she said it had this profound effect on her. You never know. That’s the thing about going through life, you you have to be careful. You have to know what you say, everything lands on somebody in a way that could affect them, you never know.\n\n\tROMANO: And she showed a clip of that example that she was giving. She had this outburst of “I hate you” to me. And I think she was doing it a certain way, and you gave her a certain tip.\n\n\tROSENTHAL: Maybe she said it in a sad way. And I told her, “really give it to him like you really hate him. ‘I hate you!’ like this.” And then she did it, and she realized the power of just changing it up a tiny bit.\n\n\tROMANO: I saw that clip and forgot about it!\n\n\tROSENTHAL: I forgot it too. But it’s funny. Thousands and thousands of moments in a nine-year series, and this one little moment meant something to her. That’s profound to me, to hear this.\n\t\n\t\tThat’s the fun of getting everyone together. During the pandemic, we saw a lot of cast reunions. It’s kind of where we’re at this point in nostalgia, where people really dig these kind of specials. They want to see their old friends get back together.\t\n\n\tROSENTHAL: And it’s so much better than a reboot. We never wanted to do a reboot. First of all, we can’t because, sadly, we’re missing some people. So it would never be the same. Secondly, I think Ray and I agree that they’re not really ever as good.\n\t\n\t\n\t\tIt’s hard to pull off a reboot. And, you’re right, without Peter Boyle and Doris Roberts, it just wouldn’t be the same, right? It’d be a different show, the dynamic is 100% different without them.\t\n\n\tROSENTHAL: You have two big gears in the machine missing.\n\t\n\t\tUnless it’s about the new generation, as the kids get older and have families of their own.\t\n\n\tROSENTHAL: It’s never as good. And you can’t help but compare it to the original. Tell me when it’s worked great.\n\n\tROMANO: New Coke. The New Coke.\n\t\n\t\tIt sounds like you came away feeling like this was a good experience.\t\n\n\tROMANO: It was really emotional and exciting.\n\n\tROSENTHAL: The best. The lucky streak continues.\n\t\n\t\tSo Ray, let’s hear your review of Phil’s new restaurant, Max & Helen’s. From zero to 100 in your 100 scale.\t\n\n\tROMANO: I mean, if you allow me to never give anything 100, I’m giving it a 99.\n\n\tROSENTHAL: Wow, Raymond!\n\n\tROMANO: I’m going on the food. I’m telling you, get there early, because there’s going to be a line, a long line.\n\n\tROSENTHAL: It’s Nancy Silverton and my son-in-law, Mason Royal. You know, my son-in-law’s the chef de cuisine at the restaurant. He and my daughter got married a week before the “Raymond” reunion.\n\t\n\t\tCongratulations. So every everything’s coming up Phil right now.\t\n\n\tROSENTHAL: I mean, something bad is gonna happen, knock wood.\n\t\n\t\tWe didn’t hear what was number one on Ray’s chart, on the number one episode of all time for “Everybody Loves Raymond.”\t\n\n\tROMANO: There’s a few. that are tied, and my memory is blanking, but one of them is the episode “Good Girls” [Season 2, Episode 19]. And then “Not So Fast,” the second episode in the ninth season. When Frank and Marie have to come back home? That’s tied. Maybe “She’s the One” [Season 7, Episode 9] where the woman eats the fly.\n\n\t“Everybody Loves Raymond: 30th Anniversary Reunion” airs Monday, Nov. 24 at 8 p.m. ET on CBS and some Paramount+ subscriptions.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ray Romano and Phil Rosenthal on What Took So Long for an ‘Everybody Loves Raymond’ Reunion and Why There Will Never Be a Reboot",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/3123414_0233bc3.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-24T18:22:13.000Z",
      "dateModified": "2025-11-24T18:22:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "TMZ Streaming Live, Come Into Our Newsroom and Watch Things Happen!",
    "url": "https://www.tmz.com/2025/11/24/watch-tmz-live-today/",
    "image": "https://imagez.tmz.com/image/d1/16by9/2025/11/24/d1b680ad4a8a41dfab1ee1fe1c51e5bb_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-24T17:32:35.000Z",
    "description": "\n    \n                    \n                          TMZ Live Stream\n                          Come Into Our Office and Watch News Happen!!!\n         ",
    "body": "\n    \n                    \n                          TMZ Live Stream\n                          Come Into Our Office and Watch News Happen!!!\n                      \n                  \n                        Published November 24, 2025 9:32 AM PST\n                                                                      |\n                Updated November 24, 2025 12:11 PM PST\n                                    \n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          We want you to be a part of TMZ, so every weekday, between 9:30 AM and 11:30 AM PT, we take you inside our newsroom via live stream.\n      \n    \n          You never know what you're gonna get ... a big story that breaks, an argument erupts in the room, or someone's just joking around.\n      \n    \n          Your comments are a big part of the stream, and the staff spends a lot of time speaking directly to you. Every day is different!\n      \n    \n          We also use our live stream to produce our \"TMZ Live\" TV show.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Celebrity News\n              \n                          \n                Live Stream\n              \n                          \n                Viral\n              \n                          \n                Fairly Legal\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "TMZ Streaming Live, Come Into Our Newsroom and Watch Things Happen!",
      "image": [
        "https://imagez.tmz.com/image/d1/16by9/2025/11/24/d1b680ad4a8a41dfab1ee1fe1c51e5bb_xl.jpg"
      ],
      "datePublished": "2025-11-24T17:32:35.000Z",
      "dateModified": "2025-11-24T17:32:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kylie Jenner Shares Sexy Pics From Shower in Silver Bikini",
    "url": "https://www.tmz.com/2025/11/24/kylie-jenner-sexy-silver-bikini-shower/",
    "image": "https://imagez.tmz.com/image/a2/16by9/2025/11/24/a249cb4ec88747269cc3257873d56eb8_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-24T17:35:11.000Z",
    "description": "\n    \n                    \n                          Kylie Jenner\n                          Dripping In Silver!!!\n                      \n             ",
    "body": "\n    \n                    \n                          Kylie Jenner\n                          Dripping In Silver!!!\n                      \n                  \n                        Published November 24, 2025 9:35 AM PST\n                                                                      |\n                Updated November 24, 2025 10:07 AM PST\n                                    \n      \n    \n      \n        \n              \n    \n    \n          If you’ve got the Monday blues, here’s your silver lining ... Kylie Jenner just dropped another bikini selfie -- and OMG, she looks damn good!\n      \n    \n          Check out the IG photo dump -- Miss Kylie was feelin’ herself Sunday, squeezing that envy-inducing figure into a teeny silver metallic bikini ... serving poses in the mirror and shower.\n      \n    \n        \n                    \n                  \n      \n    \n          Kylie was straight-up smokin' in the pics -- and she kept the vibe going on IG Stories, dropping a lil’ golden-hour video just to finish us all off.\n      \n    \n          Bet Timothée Chalamet’s annoyed AF he didn’t make the cut -- those steamy pics were prime BF cameo territory!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Kylie Jenner\n              \n                          \n                Celebrity News\n              \n                          \n                Beauty\n              \n                          \n                Instagram\n              \n                          \n                Fairly Legal\n              \n                          \n                The Kardashians\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kylie Jenner Shares Sexy Pics From Shower in Silver Bikini",
      "image": [
        "https://imagez.tmz.com/image/a2/16by9/2025/11/24/a249cb4ec88747269cc3257873d56eb8_xl.jpg"
      ],
      "datePublished": "2025-11-24T17:35:11.000Z",
      "dateModified": "2025-11-24T17:35:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Anna Kepner's Grandparents Speak Out About Stepbrother After Cruise Ship Death",
    "url": "https://www.tmz.com/2025/11/24/anna-kepner-grandparents-stepbrother-carnival-cruise/",
    "image": "https://imagez.tmz.com/image/5b/16by9/2025/11/24/5b3af949fbd649d5a5b13d57dca69603_xl.png",
    "tag": "Entertainment",
    "date": "2025-11-24T15:28:55.000Z",
    "description": "\n    \n                    \n                          Carnival Cruise Death\n                          Anna Kepner's Grandparents Stand By Stepbrother\n ",
    "body": "\n    \n                    \n                          Carnival Cruise Death\n                          Anna Kepner's Grandparents Stand By Stepbrother\n                      \n                  \n                        Published November 24, 2025 7:28 AM PST\n                                                                      |\n                Updated November 24, 2025 10:53 AM PST\n                                    \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Anna Kepner’s grandparents are shutting down any talk she was scared of her stepbrother -- the teen reportedly under investigation in her cruise-ship death -- making it clear they have faith in his innocence.\n      \n    \n          In an ABC News sit-down interview, Barbara and Jeffrey Kepner said 18-year-old Anna and her 16-year-old stepbrother were \"two peas in a pod,\" and cared for each other \"in the right way\" -- a far cry from what Joshua Tew, Anna’s first love, claimed ... saying her other brother told him about a nasty blowout the pair allegedly had inside the cabin they were all sharing.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          The grandparents say authorities told them the stepbrother is considered a suspect in the case. They admit they’ve got no clue what actually went down inside that cabin -- they’re waiting on answers just like everyone else -- but pointing the finger at the stepbrother? They’re nowhere near ready to go there.\n      \n\n                  \n          \n                          \n                \n                                  \n      \n    \n          The family says this cruise was meant to kick off a new tradition -- a big, blended-family getaway -- and they vividly remember the last night they saw Anna. Her braces were bugging her at dinner, but she powered through, stayed for the fun ... then headed back to her room.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          As you know, the cheerleader’s body was found in that shared cabin on Nov. 8, reportedly wrapped in a blanket and tucked under a bed ... as we reported, she died from asphyxiation reportedly caused by a \"bar hold,\" basically someone’s arm pressed across her neck. She’s not believed to have been sexually assaulted.\n      \n    \n          So far ... no charges have been filed.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Anna Kepner\n              \n                          \n                Interview\n              \n                          \n                Crime\n              \n                          \n                Fairly Legal\n              \n                          \n                News\n              \n                          \n                True Crime\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Anna Kepner's Grandparents Speak Out About Stepbrother After Cruise Ship Death",
      "image": [
        "https://imagez.tmz.com/image/5b/16by9/2025/11/24/5b3af949fbd649d5a5b13d57dca69603_xl.png"
      ],
      "datePublished": "2025-11-24T15:28:55.000Z",
      "dateModified": "2025-11-24T15:28:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sarah Hyland Hot Shots to Kick Off Her 35th Birthday!",
    "url": "https://www.tmz.com/2025/11/24/sarah-hyland-hot-shots-birthday/",
    "image": "https://imagez.tmz.com/image/80/16by9/2024/05/31/804f197d427440a4bbee17cae5bd0248_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-24T20:00:57.000Z",
    "description": "\n    \n                    \n                          Sarah Hyland\n                          Hottest Shots\n                          To Kick Off Her 35",
    "body": "\n    \n                    \n                          Sarah Hyland\n                          Hottest Shots\n                          To Kick Off Her 35th Birthday!\n                      \n                  \n                        Published November 24, 2025 12:00 PM PST\n                                                                            \n      \n    \n          Sarah Hyland is killing it on Broadway, and we have some of her sexiest shots \"Just In Time\" for her 35th birthday!\n      \n    \n          The \"Modern Family\" star may have returned to the stage, but the camera still loves her ... as seen in these stunning pics.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          We hope the actress got some great presents this year, because this collection of photos she's shared online is an absolute gift. Enjoy!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Sarah Hyland\n              \n                          \n                TV\n              \n                          \n                Hotties & Bodies\n              \n                          \n                Hot Bodies\n              \n                          \n                Birthdays\n              \n                          \n                Modern Family\n              \n                          \n                Photo Galleries\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sarah Hyland Hot Shots to Kick Off Her 35th Birthday!",
      "image": [
        "https://imagez.tmz.com/image/80/16by9/2024/05/31/804f197d427440a4bbee17cae5bd0248_xl.jpg"
      ],
      "datePublished": "2025-11-24T20:00:57.000Z",
      "dateModified": "2025-11-24T20:00:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jill Freud, Actress Who Inspired 'Chronicles of Narnia' Character, Dead at 98",
    "url": "https://www.tmz.com/2025/11/24/jill-freud-dead/",
    "image": "https://imagez.tmz.com/image/88/16by9/2025/11/24/8809854ebfb34818bc082f04c87c735b_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-24T18:53:47.000Z",
    "description": "\n    \n                    \n                          'Love Actually' Actress Jill Freud\n                          Dead at 98\n                      \n  ",
    "body": "\n    \n                    \n                          'Love Actually' Actress Jill Freud\n                          Dead at 98\n                      \n                  \n                        Published November 24, 2025 10:53 AM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Jill Freud, a British actress who provided C.S. Lewis with the inspiration for Lucy Pevensie in \"The Chronicles of Narnia,\" has died.\n      \n    \n          Jill's daughter Emma Curtis announced her death Monday, posting ... “My beautiful 98-year-old mum has taken her final bow. After a loving evening -- where we knew she was on her way -- surrounded by children, grandchildren and pizza, she told us all to f*** off so she could go to sleep. And then she never woke up. Her final words were ‘I love you.’”\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Born June Flewett, Jill moved in with C.S. Lewis and his companion, Jane Moore, when she was just 16 after evacuating London to escape The Blitz bombing by Nazi Germany. She stayed with them at their country house as a housekeeper, and eventually Lewis based the youngest Pevensie kid, Lucy, on her.\n      \n\n                  \n          \n                          \n                \n                                  \n      \n    \n          After 3 years, Jill returned to London to study acting at the Royal Academy of Dramatic Art. From there, she took the stage in the West End and was featured in films like \"The Woman in the Hall\" and on TV shows like \"Torchy, the Battery Boy.\"\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          In 1950, she married Clement Freud, a grandson of psychoanalyst Sigmund Freud. When Clement was knighted in 1987, Jill became Lady Freud.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Her final film role came in 2003 as a Downing Street housekeeper in \"Love Actually.\"\n      \n    \n          She was 98.\n      \n    \n          RIP\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Celebrity News\n              \n                          \n                RIP\n              \n                          \n                Fairly Legal\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jill Freud, Actress Who Inspired 'Chronicles of Narnia' Character, Dead at 98",
      "image": [
        "https://imagez.tmz.com/image/88/16by9/2025/11/24/8809854ebfb34818bc082f04c87c735b_xl.jpg"
      ],
      "datePublished": "2025-11-24T18:53:47.000Z",
      "dateModified": "2025-11-24T18:53:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]