[
  {
    "title": "Taylor Swift Takes Over ‘Late Night with Seth Meyers’: Wedding Invites, ‘Life of a Showgirl’ Stories and Travis Kelce’s Botched Intro to Greta Gerwig",
    "url": "https://variety.com/2025/tv/news/taylor-swift-seth-meyers-life-of-showgirl-travis-kelce-1236543910/",
    "image": "https://variety.com/wp-content/uploads/2025/10/NUP_208945_01766.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-09T05:59:06.000Z",
    "description": "<div><p>\n\t<a target=\"_blank\" href=\"https://variety.com/t/taylor-swift/\">Taylor Swift</a> closed out “<a target=\"_blank\" href=\"https://variety.com/t/th",
    "body": "<div><p>\n\t<a target=\"_blank\" href=\"https://variety.com/t/taylor-swift/\">Taylor Swift</a> closed out “<a target=\"_blank\" href=\"https://variety.com/t/the-life-of-a-showgirl/\">The Life of a Showgirl</a>” press tour with one last stop on “<a target=\"_blank\" href=\"https://variety.com/t/late-night-with-seth-meyers/\">Late Night with Seth Meyers</a>.” Appearing on Tuesday’s broadcast – Meyers’ 1,713th episode, a number that fittingly adds up to 12, matching Swift’s 12th studio album (and nodding to her lucky 13) – was appropriate to the numerology that’s followed her entire career.</p>\n<p>\n\tSwift and Meyers covered her <a target=\"_blank\" href=\"https://variety.com/2025/music/news/taylor-swift-breaks-adele-record-life-of-a-showgirl-album-sales-1236543292/\">record-breaking new release</a>, which became the most-consumed album in a single week hours before the taping started, and the self-directed “Fate of Ophelia” music video that reunited her with Eras Tour dancers and backup singers.\n\t</p>\n<p>\n\tKnown for keeping her songs locked down with click tracks, she revealed she played the top-secret release for her dancers before the music video was filmed. “If they were on the Eras tour, they know how to keep a secret,” she said.</p>\n<p>\n\tLooking back on her stadium run, Swift admitted to some FOMO watching the VIP tent each night. During one of her London shows, then-boyfriend, now fiancé <a target=\"_blank\" href=\"https://variety.com/t/travis-kelce/\">Travis Kelce</a> was joined by hometown friends and A-listers Mila Kunis, Ashton Kutcher, Tom Cruise, Hugh Grant and Greta Gerwig – Kelce’s favorite director. “He loves Greta Gerwig. He loves her movies, he loves her range,” Swift said.</p>\n<p>\n\tAfter the concert – as part of what Swift described as their routine car-ride debriefs – Kelce told her he was disappointed that Gerwig didn’t laugh at his “Barbie” joke. She recalled him telling who he thought was Gerwig, “I love ‘Barbie.’ I’m just Ken, <em>too</em>,” before pointing to Swift. He said she “smiled politely but didn’t say anything.”\n\t</p>\n<p>\n\tLater, after seeing videos online of Gerwig and Kelce “dancing all night,” Swift realized the case of mistaken identity. “Do the math,” she said. “Is there any chance at all, baby, that you complimented Hugh Grant’s wife, Anna, on her movie, ‘Barbie?’ And she politely nodded, because she didn’t have the heart to tell you she didn’t direct it?”</p>\n<p>\n\tBut with the Eras tour wrapped and the “Showgirl” rollout winding down, Swift is shifting her focus to wedding planning. Meyers pitched invitation ideas — from an electronic blast to a framed print, since “people will do it anyway.” “You can say it’s my idea, so nobody says you’re being cocky or arrogant or anything,” he joked.</p>\n<p>\n\tSwift also reflected on when her head of security called her when Zoë Kravitz’s snake got loose in her house during the Palisades fire, her recent hyperfixation on baking bread, and meeting Meyers on SNL in 2009.</p>\n<p>\n\t“[Hosting SNL] the most exciting thing that had ever happened to me in my life at 19,” she said. The two reminisced over her Twilight-recreated skit, which parodied one of the biggest films of all time. “Now that I look back, I am so lucky that we got to like do anything around something as iconic and as 2009 as ‘Twilight.'”</p>\n<p>\n\tMore than a decade later, she jokingly credits that SNL week with preparing her for the chaos of the Eras Tour. “It was absolutely the most amount of times I’ve changed clothes,” Swift said. “I knew I could do the Eras Tour. I can get these costume changes. This is the most fact-paced thing ever.” </p>\n<p>\n\tThat same sense of readiness carried her into this latest chapter – her 12th album release, and the one she calls her favorite yet. “It’s been the most joyful album release I’ve ever had,” she said.</p>\n</div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Taylor Swift Takes Over ‘Late Night with Seth Meyers’: Wedding Invites, ‘Life of a Showgirl’ Stories and Travis Kelce’s Botched Intro to Greta Gerwig",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/NUP_208945_01766.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-09T05:59:06.000Z",
      "dateModified": "2025-10-09T05:59:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "AI-Powered Cinematic Universe Platform enGEN3 Launched by Goldfinch, The Squad (EXCLUSIVE)",
    "url": "https://variety.com/2025/film/news/ai-powered-cinematic-universe-platform-engen3-1236543349/",
    "image": "https://variety.com/wp-content/uploads/2025/10/enGEN3.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-09T07:00:00.000Z",
    "description": "<div><p>\n\tTwo entertainment companies are betting that artificial intelligence can help independent filmmakers compete with major studios in building ",
    "body": "<div><p>\n\tTwo entertainment companies are betting that artificial intelligence can help independent filmmakers compete with major studios in building expansive story worlds.</p>\n<p>\n\t<a target=\"_blank\" href=\"https://variety.com/t/goldfinch/\">Goldfinch</a> and <a target=\"_blank\" href=\"https://variety.com/t/the-squad/\">The Squad</a> have unveiled <a target=\"_blank\" href=\"https://variety.com/t/engen3/\">enGEN3</a>, a jointly owned platform that uses <a target=\"_blank\" href=\"https://variety.com/t/ai/\">AI</a> to help creators develop cinematic universes while managing IP rights and revenue sharing with fans. The venture aims to democratize tools typically available only to large studios, enabling filmmakers to expand stories across multiple media formats.\n\t</p>\n<p>\n\t“enGEN3 gives filmmakers studio-level tools to build cinematic universes with fan participation, extending their stories seamlessly across film, games, print, and beyond,” said Jordan Bayne, founder of The Squad and enGEN3.\n</p>\n<p>\n\tThe platform’s first project is “By Blood & By Bone,” a sci-fi anime feature pilot from writer Dave Kebo. The film integrates two Web3 anime collections – Ordinauts on Bitcoin and Oni Force on Ethereum – in what the companies describe as a new model for community-driven storytelling.</p>\n<p>\n\t“With ‘By Blood & By Bone,’ we’re bringing community storytelling into an epic anime series while creating a model for IP ownership and monetization that benefits both creators and fans,” said Kebo.</p>\n<p>\n\tHenry Finn, CEO of Oni Force, added: “This is the next chapter in storytelling: ownership and imagination shared by all.”</p>\n<p>\n\tThe venture taps experienced tech and creative talent. CTO Doug Thompson previously held roles at gaming and AI companies including Remedy and Sojen. Creative director HaZ Dulull has directed for Disney+ and contributed to video game projects including “Dune: Awakening” and Fortnite. He runs transmedia studio Beyond The Pixels.\n\t</p>\n<p>\n\tA Q1 2026 full launch is targeted for enGEN3, with beta access coming sooner. The companies plan to roll out more projects and tools next year, drawing from Goldfinch’s catalog of hundreds of financed productions.</p>\n<p>\n\t“At Goldfinch, we back bold visions for the future of entertainment,” said Phil McKenzie, co-founder of Goldfinch. “Jordan pioneered the Film3 model, and enGEN3 represents the next evolution – a way for creators and fans to connect through both creation and distribution.”</p>\n<div><p>\n\tGoldfinch has backed more than 300 projects since its 2014 founding and has won Academy Awards and BAFTAs. The Squad focuses on projects blending cinema with generative AI and Web3 technology under what it calls the Film3 framework – emphasizing creator ownership and audience participation in storytelling.</p></div>\n</div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "AI-Powered Cinematic Universe Platform enGEN3 Launched by Goldfinch, The Squad (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/enGEN3.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-09T07:00:00.000Z",
      "dateModified": "2025-10-09T07:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Netflix’s Gay Military Dramedy ‘Boots’ Is a Heartfelt Coming-of-Age Tale: TV Review",
    "url": "https://variety.com/2025/tv/reviews/boots-review-netflix-1236529532/",
    "image": "https://variety.com/wp-content/uploads/2025/09/Boots_u_S1_E1_00_05_47_20_R.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-09T07:01:00.000Z",
    "description": "<div><p>\n\tBased on former U.S. Marine Greg Cope White’s memoir “The Pink Marine,” executive produced by the late <a target=\"_blank\" href=\"https://vari",
    "body": "<div><p>\n\tBased on former U.S. Marine Greg Cope White’s memoir “The Pink Marine,” executive produced by the late <a target=\"_blank\" href=\"https://variety.com/t/norman-lear/\">Norman Lear</a> and adapted for television by Andy Parker, <a target=\"_blank\" href=\"https://variety.com/t/netflix/\">Netflix</a>‘s military dramedy, “<a target=\"_blank\" href=\"https://variety.com/t/boots/\">Boots</a>,” is an irreverent but insightful look at friendship, self-determination, courage and acceptance amid the challenges and demands of the United States Marine boot camp. As hilarious as it is devastating, the series is a unique coming-of-age story centered on an unlikely Marine recruit who is desperate to find himself. \n\t</p>\n<p>\n\t“Boots” opens in 1990 in a recruiter’s office in New Orleans. With the chaos of high school and its constant bullying behind him, Cameron Cope (a perfectly cast <a target=\"_blank\" href=\"https://variety.com/t/miles-heizer/\">Miles Heizer</a>) is desperate for a new chapter. Determined to hide his sexuality and exhausted by the whims of his chaotic mother, Barbara (<a target=\"_blank\" href=\"https://variety.com/t/vera-farmiga/\">Vera Farmiga</a>), who has moved their family 10 times in the past 12 years, the Wilson Phillips-loving Cameron decides to join the Marines alongside his best and only friend, Ray McAffey (Liam Oh), as a way to escape the monotony of his life and his mother’s antics.\n</p>\n<p>\n\tUnfortunately, he isn’t quite aware of what he’s getting into, and he definitely should have watched “Full Metal Jacket” like Ray suggested instead of “Golden Girls” reruns. When he and Ray arrive at Parris Island, South Carolina, for their 13-week basic training and get hauled off the bus by a tyrannical Senior Drill Sargent (Cedrick Cooper) and his assistants, he quickly realizes he has made an abysmal choice. It also doesn’t help that being gay is illegal in all branches of the armed forces. \n\t</p>\n<p>\n\tThe series spans the entire three months of boot camp, encompassing obstacle and confidence courses, rifle shooting and the final 54-hour test, known as the Crucible. Cameron, Ray and the entire platoon are pushed to their emotional and physical limit. Though he’s already out of his element, things shift even more for Cameron amid the arrival of Drill Sgt. Sullivan (Max Parker), a highly decorated and vicious Marine who sees him as a target. Moreover, Ray’s determination to become the unit’s Honor Man — the highest honor for recruits — and Cameron’s struggles to fit in put their friendship to the test.</p>\n<p>\n\t“Boots” hits all of the poignant, heart-tugging beats that Lear’s body of work is known for, but creator Parker and the writers’ room put their own stamp on the show. From the 1990s-infused soundtrack, which features songs by George Michael and Sade, to a diverse and robust cast with distinctive and memorable characters, the series is a compelling, funny and sometimes tragic portrayal of brotherhood, self-sacrifice, and the cost of serving one’s country. Though much of “Boots” is heavy, lighter bits, including Cameron’s inner monologue, which presents as a sassier, more confident version of himself, to standout characters like his maniacal but humorous fellow recruit Hicks (Angus O’Brien) and the late addition of the proudly Dominican Santos (Rico Paris) make the narrative memorable. </p>\n<p>\n\tThough the platoon itself anchors the story, audiences also get to see a bit more about the inner workings of the Marines and Parris Island. Capt. Fajardo (Ana Ayora) is the first woman to lead a male-dominated company on the base, and the series illustrates the misogyny-laced pushback she receives in her role, not just from her superiors but from her subordinates as well. Moreover, Cameron, who had been previously focused on what he perceives to be his own flaws and hiding his sexuality, begins to see the injustices his fellow recruits are also facing, including fatphobia and racism. </p>\n<p>\n\t“Boots” is a delightful, heartfelt watch. It is about a young man gaining introspection and a sense of maturity in an extraordinarily challenging and repressive environment. On the eve of the Gulf War, the audience is introduced to several young men (and a couple of women) who are pulled together by circumstance and pushed to the brink as they slowly, and often painfully, learn exactly who they are and what they are made of.\n\t</p>\n<p>\n\t<em>“Boots” is now streaming on Netflix.</em><br /></p>\n</div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Netflix’s Gay Military Dramedy ‘Boots’ Is a Heartfelt Coming-of-Age Tale: TV Review",
      "image": [
        "https://variety.com/wp-content/uploads/2025/09/Boots_u_S1_E1_00_05_47_20_R.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-09T07:01:00.000Z",
      "dateModified": "2025-10-09T07:01:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘DDLJ’ Iconic Song ‘Tujhe Dekha To’ Greets U.K. Prime Minister Keir Starmer at India’s Yash Raj Films (EXCLUSIVE)",
    "url": "https://variety.com/2025/film/news/ddlj-tujhe-dekha-keir-starmer-yash-raj-films-1236544053/",
    "image": "https://variety.com/wp-content/uploads/2025/10/Keir-Starmer-YRF.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-09T06:50:11.000Z",
    "description": "<div><p>\n\tIn a memorable cultural exchange moment that captured the enduring magic of Bollywood cinema, U.K. Prime Minister <a target=\"_blank\" href=\"h",
    "body": "<div><p>\n\tIn a memorable cultural exchange moment that captured the enduring magic of Bollywood cinema, U.K. Prime Minister <a target=\"_blank\" href=\"https://variety.com/t/keir-starmer/\">Keir Starmer</a> was treated to the iconic love anthem “Tujhe Dekha To Ye Jana Sanam” from “<a target=\"_blank\" href=\"https://variety.com/t/dilwale-dulhania-le-jayenge/\">Dilwale Dulhania Le Jayenge</a>” (DDLJ) during his visit to Yash Raj Studios in Mumbai on Wednesday.</p>\n<p>\n\tThe screening of the timeless track, which marked the film’s 30th anniversary since its release, set the tone for a landmark announcement: <a target=\"_blank\" href=\"https://variety.com/2025/film/global/yash-raj-films-uk-three-picture-deal-1236542980/\">Yash Raj Films will return to filming in the U.K.</a> with three major productions starting in early 2026, ending an eight-year hiatus.\n\t</p>\n<p>\n\tThe choice of song was particularly poignant, given the deep connection “DDLJ” has to the U.K. The film, which became a cultural phenomenon bridging Indian cinema and British culture, was extensively shot in London and across the U.K., making it synonymous with the U.K.-India relationship.\n</p>\n<figure></figure>\n<p>\n\t<a target=\"_blank\" href=\"https://variety.com/t/yash-raj-films/\">Yash Raj Films</a> CEO Akshaye Widhani, who hosted Starmer at the studio, emphasized this special bond. “The U.K. holds a very special place in our hearts and some of our most iconic films, including Dilwale Dulhania Le Jayenge (DDLJ) were shot in this beautiful and incredibly hospitable country,” he said.</p>\n<p>\n\t“It is truly special to reignite YRF and UK’s filming ties in the 30th anniversary of ‘DDLJ’ – a film that is synonymous to U.K.-India’s relationship,” Widhani added.</p>\n<p>\n\tFollowing the cultural presentation, Starmer announced that the three productions are expected to create more than 3,000 jobs and inject millions of pounds into the British economy.\n\t</p>\n<p>\n\t“Bollywood is back in Britain, and it’s bringing jobs, investment and opportunity, all while showcasing the U.K. as a world-class destination for global filmmaking,” Starmer said. “This is exactly the kind of partnership our trade deal with India is destined to unlock.”</p>\n<p>\n\tStarmer was accompanied by a delegation of British film industry heavyweights, including representatives from the British Film Institute, British Film Commission, Pinewood Studios, Elstree Studios and Civic Studios.</p>\n<p>\n\tThe Prime Minister also met with actor Rani Mukerji, who is married to Yash Raj Films chair Aditya Chopra.</p>\n<p>\n\tYRF is currently producing the English-language stage musical adaptation of DDLJ, titled “Come Fall in Love” (CFIL) in the U.K.—an “East meets West” story that celebrates the spirit of inclusivity and love beyond borders.</p>\n<p>\n\tThe visit coincided with Yash Raj Studios’ 20th anniversary of operations in India and builds on the U.K.-India Free Trade Agreement signed in July.</p>\n</div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘DDLJ’ Iconic Song ‘Tujhe Dekha To’ Greets U.K. Prime Minister Keir Starmer at India’s Yash Raj Films (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/Keir-Starmer-YRF.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-09T06:50:11.000Z",
      "dateModified": "2025-10-09T06:50:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "CAA Slams OpenAI’s Sora 2 For Posing ‘Serious and Harmful Risks’ to Clients’ Intellectual Property: ‘Compensation Is a Fundamental Right’",
    "url": "https://variety.com/2025/film/news/caa-openai-sora-2-harmful-intellectual-property-1236543954/",
    "image": "https://variety.com/wp-content/uploads/2022/06/CAA-logo-2-e1740072040164.jpg?crop=0px%2C56px%2C841px%2C473px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-10-09T03:10:49.000Z",
    "description": "<div><p>\n\tLeading Hollywood agency <a target=\"_blank\" href=\"https://variety.com/t/caa/\">CAA</a> issued a statement rejecting <a target=\"_blank\" href=\"",
    "body": "<div><p>\n\tLeading Hollywood agency <a target=\"_blank\" href=\"https://variety.com/t/caa/\">CAA</a> issued a statement rejecting <a target=\"_blank\" href=\"https://variety.com/t/openai/\">OpenAI</a>‘s video model <a target=\"_blank\" href=\"https://variety.com/t/sora-2/\">Sora 2</a>, which has sent shockwaves through the industry for allowing users to create clips using copyrighted IP.</p>\n<p>\n\t“CAA is unwavering in our commitment to protect our clients and the integrity of their creations,” the agency said in a statement on Wednesday. “The misuse of new technologies carries consequences that reach far beyond entertainment and media, posing serious and harmful risks to individuals, businesses, and societies globally. It is clear that Open AI/Sora exposes our clients and their intellectual property to significant risk.”\n\t</p>\n<p>\n\tThe statement goes on to question OpenAI of “disregarding global copyright principles and blatantly dismissing creators’ rights.” It deemed “control, permission for use, and compensation” a “fundamental right” for the usage of copyrighted material, and that anything less should be considered “unacceptable.”\n</p>\n<p>\n\tCAA’s statement continues, “We are open to hearing the solutions that Open AI has to these critical issues and remain steadfast in our work with intellectual property businesses and leaders, and creative guilds and unions, as well as state and federal legislators and global policymakers, to answer these challenges and set an aligned path for the future.”</p>\n<p>\n\tSora 2 operates on an opt-out system, meaning that if any rights holders object to having their IP used on the site, they could notify OpenAI and have it removed. However, some have recognized this as shaky legal ground. Under copyright law, rights holders can sue and obtain statutory damages for infringements, regardless of the opt-out policy.\n\t</p>\n<p>\n\tOn Oct. 3, OpenAI CEO Sam Altman said Sora 2 will soon be updated to give copyright holders “more granular control over generation of characters.” However, there was no assurance that copyrighted material would be removed from the platform entirely.</p>\n<p>\n\tThe Motion Picture Association was one of the first major Hollywood institutions to disavow the OpenAI platform. It <a href=\"https://variety.com/2025/film/news/motion-picture-association-openai-sora-2-copyright-1236541775/\" target=\"_blank\">said in a statement</a> on Monday, “While OpenAI <a href=\"https://blog.samaltman.com/sora-update-number-1\" target=\"_blank\">clarified</a> it will ‘soon’ offer rightsholders more control over character generation, they must acknowledge it remains their responsibility – not rightsholders’ – to prevent infringement on the Sora 2 service. OpenAI needs to take immediate and decisive action to address this issue. Well-established copyright law safeguards the rights of creators and applies here.”</p>\n<p>\n\tDisney and Universal <a href=\"https://variety.com/2025/digital/news/disney-nbcuniversal-studio-lawsuit-ai-midjourney-copyright-infringement-1236428188/\" target=\"_blank\">sued</a> another AI leader, Midjourney, in June for allowing users to create videos and images infringing on their copyright through its site. Waner Bros. <a href=\"https://variety.com/2025/film/news/warner-bros-midjourney-lawsuit-ai-copyright-1236508618/\" target=\"_blank\">also took legal action</a> against Midjourney in September. Midjourney claimed that AI training is “fair use” under copyright law and that if users are infringing on copyrighted IP, they are doing so of their own accord and violating the terms of service.</p>\n</div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "CAA Slams OpenAI’s Sora 2 For Posing ‘Serious and Harmful Risks’ to Clients’ Intellectual Property: ‘Compensation Is a Fundamental Right’",
      "image": [
        "https://variety.com/wp-content/uploads/2022/06/CAA-logo-2-e1740072040164.jpg?crop=0px%2C56px%2C841px%2C473px&resize=1000%2C563"
      ],
      "datePublished": "2025-10-09T03:10:49.000Z",
      "dateModified": "2025-10-09T03:10:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Variety, Panera, Digitas and Nicky Campbell to Participate in Advertising Week Panel",
    "url": "https://variety.com/2025/biz/news/variety-panera-digitas-nicky-campbell-advertising-week-1236543899/",
    "image": "https://variety.com/wp-content/uploads/2025/10/campbell-ringer-lanzi-lawrence.jpg?crop=0px%2C0px%2C1800px%2C1013px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-10-09T02:00:00.000Z",
    "description": "<div><p>\n\tExecutives from <em><a target=\"_blank\" href=\"https://variety.com/t/variety/\">Variety</a></em>, Panera and Digitas, plus creator <a target=\"_",
    "body": "<div><p>\n\tExecutives from <em><a target=\"_blank\" href=\"https://variety.com/t/variety/\">Variety</a></em>, Panera and Digitas, plus creator <a target=\"_blank\" href=\"https://variety.com/t/nicky-campbell/\">Nicky Campbell</a> will take the Advertising Week stage on Oct. 9 for the “Leveraging Moments to Create Moments” panel. The group will share the strategy behind <em>Variety’s</em> partnership with Panera, as the two worked to create an organic, influencer-driven campaign promoting the restaurant chain’s new Croissant Toast Sandwich and limited-edition Croissant Clutch. The campaign was tied to fashion’s biggest night of the year: the Met Gala, which was held in May.\n\t</p>\n<p>\n\tSpeakers include Dea Lawrence, chief operating and marketing officer for <em>Variety</em>; Amy Lanzi, CEO of Digitas North America; Nicky Campbell, creator; and Beth Ringer, vice president of media strategy at Panera Bread. \n</p>\n<p>\n\tThe effort consisted of a three-part social-first video campaign along with alignment to <em>Variety’s</em> red carpet coverage of the night. The campaign demonstrates how brands can anchor themselves to cultural tentpoles to create moments that resonate far beyond the night itself. </p>\n<p>\n\t<em>Variety’s </em>Panera partnership featured a <a target=\"_blank\" href=\"https://www.instagram.com/p/DJU-Hpxzv7U/\">Get Ready With Me style video</a> from Nicky Campbell. </p>\n<p>\n\t“The integration of brand, marketing, and influencers is key to building a popular, well-thought-out campaign,” said Lawrence. “Our collaboration was a seamless fit, driving buzz and excitement for Panera’s new Croissant Toast Sandwich and clutch bag in an organic way.”</p>\n<p>\n\tThe panelists will share insights on how to harness hallmark moments for brand recognition, as well as how to combine brands with new sectors through innovative thinking and engage influencers in dynamic, culturally relevant ways. The conversation will take place on the Marketplace stage at 12:30 pm.  </p>\n</div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Variety, Panera, Digitas and Nicky Campbell to Participate in Advertising Week Panel",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/campbell-ringer-lanzi-lawrence.jpg?crop=0px%2C0px%2C1800px%2C1013px&resize=1000%2C563"
      ],
      "datePublished": "2025-10-09T02:00:00.000Z",
      "dateModified": "2025-10-09T02:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Netflix Co-CEO Greg Peters, Asked if Company Is Interested in Buying Warner Bros. Discovery, Says ‘Big Media Mergers Don’t Have an Amazing Track Record’",
    "url": "https://variety.com/2025/tv/news/netflix-ceo-greg-peters-warner-bros-discovery-media-mergers-1236512022/",
    "image": "https://variety.com/wp-content/uploads/2025/09/Netflix-Greg-Peters.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-09T03:35:59.000Z",
    "description": "<div><p>\n\tWill <a target=\"_blank\" href=\"https://variety.com/t/netflix/\">Netflix</a> pursue a large-scale media M&A play? Don’t bet on it.</p>\n<p>\n\t<a ",
    "body": "<div><p>\n\tWill <a target=\"_blank\" href=\"https://variety.com/t/netflix/\">Netflix</a> pursue a large-scale media M&A play? Don’t bet on it.</p>\n<p>\n\t<a target=\"_blank\" href=\"https://variety.com/t/greg-peters/\">Greg Peters</a>, co-CEO of Netflix, downplayed the company’s desire to grow through a major acquisition, speaking Wednesday evening at the Bloomberg Screentime conference in L.A. Peters was asked by moderator Lucas Shaw, Bloomberg’s managing editor for media and entertainment, if there was any truth to rumors that Netflix was interested in making a bid for Warner Bros. Discovery.\n\t</p>\n<p>\n\t“I would say this: We come from a deep heritage of being builders rather than buyers,” Peters responded. He continued, “One should have a reasonable amount of skepticism around big media mergers — they don’t have an amazing track record over time.”\n</p>\n<p>\n\tSaid Peters, “Our job is to figure out, ‘What is the best way to grow our business?'” If a major acquisition is “the best way to grow our business, great. If not, we should do something else.”</p>\n<p>\n\tChatter circulated about Netflix’s supposed interest in WBD after news broke that David Ellison, just weeks after closing the $8 billion deal to form Paramount Skydance, is <a target=\"_blank\" href=\"https://variety.com/2025/tv/news/paramount-warner-bros-discovery-acquisition-consolidation-analysis-1236515947/\">kicking around a possible bid to acquire Warner Bros. Discovery in its entirety</a>.</p>\n<p>\n\tAfter Shaw asked Peters about Netflix now competing with “the second-richest person in the world” — a reference to Oracle founder Larry Ellison, who largely funded the Skydance Media deal to acquire Paramount Global — Peters said, “It’s fun to have some new vigor in the competitive ecosystem. It’s exciting, keeps everyone on their toes.” But, he said, “it doesn’t change the business fundamentals.” Asked whether Paramount Skydance bid “irrationally” in clinching a <a target=\"_blank\" href=\"https://variety.com/2025/tv/news/paramount-ufc-deal-events-espn-2026-1236486487/\">$7.7 billion deal for UFC rights</a> over seven years, Peters noted that Netflix is constantly competing in bids for content rights. If Netflix is outbid, Peters said his feeling is, “Go with God and try to monetize the heck outta that.”\n\t</p>\n<p>\n\tAbout YouTube, Peters said, “for sure, they’re a competitor, of course.” But he said YouTube is an “orthogonal” rival, in that its mostly user-generated content model is fundamentally different from Netflix’s. “Orthogonal competition is the hardest” to track, he said. Peters said Netflix wants to invest in projects from creators, whether they come from YouTube, TikTok or elsewhere, and help “find the biggest global audience for them.”</p>\n<p>\n\tPeters also announced that Netflix is expanding games available on TVs with a new slate of “party games,” which you play using your smartphone as a controller. Those titles, set to come to the service this holiday season, include “Boggle Party,” “Pictionary: Game Night,” “Tetris Time Warp,” “Lego Party” and “Party Crashers: Fool Your Friends.” Overall, Peters gave Netflix’s games initiative, which it launched in late 2021, a “B-” grade. He recalled that when Netflix first launched in Japan, just 2% of the country’s consumers had even heard of the company. Netflix’s current situation with games and interactive programming, he said, “is not dissimilar to that.”</p>\n<div><p>\n\tPeters was asked whether Netflix would have made more money if it had given animated <a target=\"_blank\" href=\"https://variety.com/2025/tv/news/kpop-demon-hunters-record-weeks-top-10-1236535187/\">smash hit “KPop Demon Hunters,”</a> the services most-viewed movie to date, a theatrical run. “I don’t think so, at the end of the day,” Peters said. “It’s worked incredibly well for us.” Any box office upside from “KPop Demon Hunters,” he suggested, would not be a reason to deviate from Netflix’s strategy of mostly streaming-first releases. Asked if Netflix had any plans to syndicate programing to third parties, Peters said, “I doubt it… I’m not sure why we would do it.”</p><p>Meanwhile, last week billionaire <a target=\"_blank\" href=\"https://variety.com/2025/digital/news/elon-musk-cancel-netflix-war-kids-shows-trans-lgbtq-characters-1236537089/\">Elon Musk kicked off a concerted “cancel Netflix” campaign</a> on his X social platform, urging people to ditch the streamer over the company’s perceived “woke” bias, including some kids’ shows on the platform that depict transgender characters.</p></div>\n<p>\n\tPeters did not directly address Musk’s anti-Netflix initiative. But he spoke about the fact that there is certain programming on the service that “people don’t like” — which he said stems from the fact that Netflix is creating content for an audience approaching 1 billion people worldwide. “If we’re doing it right, there’s something on the service [some people] think is not great, that they don’t like or think is maybe harmful. That’s the business we’re in,” Peters said.</p>\n<p>\n\tFor the first two quarters of the year, Netflix topped Wall Street expectations on revenue and earnings. As of the the first quarter of 2025, the company <a target=\"_blank\" href=\"https://variety.com/2024/digital/news/netflix-stop-reporting-subscriber-totals-apple-iphone-sales-1235976401/\">no longer regularly reporting subscriber counts</a>, with the company wanting to focus on financials and user engagement. In <a target=\"_blank\" href=\"https://variety.com/2025/tv/news/netflix-q2-earnings-2025-1236463977/\">reporting Q2 results</a>, Netflix increased its revenue forecast for full-year 2025 to a range of $44.8 billion to $45.2 billion (previously $43.5 billion to $44.5 billion), which would represent 15%-16% year-over-year growth, primarily because of the recent depreciation of the U.S. dollar. The company is scheduled to report Q3 earnings Oct. 21 after market close.\n\t</p>\n<p>\n\tPeters was named Netflix co-CEO — alongside Ted Sarandos — in January 2023 after <a target=\"_blank\" href=\"https://variety.com/2023/digital/news/reed-hastings-steps-down-netflix-ceo-1235495351/\">Reed Hastings stepped down from the role</a>. Previously, Peters was chief product officer and chief operating officer.</p>\n</div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Netflix Co-CEO Greg Peters, Asked if Company Is Interested in Buying Warner Bros. Discovery, Says ‘Big Media Mergers Don’t Have an Amazing Track Record’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/09/Netflix-Greg-Peters.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-09T03:35:59.000Z",
      "dateModified": "2025-10-09T03:35:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Newport & the Great Folk Dream’ Review: A Rapturous Documentary Shows You Why the Newport Folk Festival Was Electric Even When It Was Acoustic",
    "url": "https://variety.com/2025/film/reviews/newport-and-the-great-folk-dream-review-1236542848/",
    "image": "https://variety.com/wp-content/uploads/2025/10/Bob-Dylan-the-Freedom-Singers-Peter-Yarrow-Pete-Seeger-Newport-the-Great-Folk-Dream-scaled-1.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-09T04:04:42.000Z",
    "description": "<div><p>\n\t“Newport & the Great Folk Dream” is a rapturous documentary — elegant and transporting, full of scratchy lyrical black-and-white images and ",
    "body": "<div><p>\n\t“Newport & the Great Folk Dream” is a rapturous documentary — elegant and transporting, full of scratchy lyrical black-and-white images and performances that have a timeless power. The movie tells the story of the Newport Folk Festival from the pivotal years of 1963 to 1966, and when I say that it “tells the story,” I mean that there’s a surprisingly sharp and resonant narrative at play we haven’t seen before. Murray Lerner’s 1967 documentary “Festival” covered those same years, but that film was more of a scattershot folk and blues and country collage.\n\t</p>\n<p>\n\tIt turns out that Lerner, who died in 2017, shot 100 hours of footage at Newport, almost all of which got stuck in a vault; it has never been seen before. That’s the footage that director Robert Gordon and his editor and producing partner, Laura Jean Hocking, have drawn from to construct “Newport & the Great Folk Dream.”\n</p>\n<p>\n\tThe movie presents a far richer, more wide-ranging and ingeniously structured vision of Newport than “Festival” did. That film was fine, but it was never more than fine. The new movie feels essential, and I think there’s potentially a major audience for it, comprised of all the people who have been passionate about American roots music over the decades, but also the new generation of folk-adjacent fans who felt ignited by “A Complete Unknown.” I’m tempted to say: Forget that pesky word <em>folk</em>. This is a movie for music fans of every stripe.</p>\n<p>\n\tAt the beginning of the documentary, there are shots of Johnny Cash, looking lean and hungry, and there’s an oblique but deliberate mention of the year 1965. As soon as we hear that year, we know just what it means, because the whole mythology of Newport is centered on what happened then: the famous Sunday-night set in which <a target=\"_blank\" href=\"https://variety.com/t/bob-dylan/\">Bob Dylan</a> went electric, changing the world of folk music and the world at large.\n\t</p>\n<p>\n\t“Newport & the Great Folk Dream” expands our vision of that moment in two ways. It presents such a broad and exquisitely chosen swath of the music that was there at Newport that it leaves us with a far more profound sense of what Dylan was <em>disrupting</em>. At the same time, the festival was caught in its own state of evolution. The real change had begun at the 1964 festival, the first one to take place after the arrival of the Beatles in America (on Feb. 7, 1964) — and it was Beatlemania, far more than anything Bob Dylan did, that spelled the beginning of the end for folk music as a reigning populist form. Dylan aside, electric instruments were already dotting the stages of Newport — we see Howlin’ Wolf, ax in hand, doing a raging blues number. And the spirit of the crowd evolved in tandem with that.</p>\n<p>\n\tThe famous stately image of Newport is of all those lawn chairs stretching back from the stage in neat rows, almost as if this were a very large wedding. But with each year, the festival began to feel looser, with kids hanging out and drinking, showing up for the party; at moments, women would be dancing barefoot in their brassieres. What had begun as a highly <em>civilized</em> event began to morph, in small ways, into the roots of Woodstock. There’s a performance by Mimi and Richard Fariña at the 1965 festival that’s nothing short of stunning. The song they’re doing is called “House Unamerican Blues Activity Dream,” which sounds very 1950s, but what a groove! It’s like hearing a drugged version of Simon and Garfunkel’s “Cecilia,” and the crowd rocks out to it. Even <em>Joan Baez </em>rocks out to it, right up there on stage (Mimi, who beams like Margaret Qualley, was Joan’s sister), and the message is: This is not your father’s folk music…or even 1963’s folk music. This was a whole new thing.  </p>\n<p>\n\tThe folk dream, as the movie presents it, was about music of various stripes fusing into a community of spiritual and political power. This was really Pete Seeger’s dream, fueled by his alliances with labor unions and African-Americans, and it’s why he had been dragged in front of HUAC in 1955 (his refusal to name names there made him a hero). At the 1963 festival, Seeger, who was producing the event, made the momentous decision to ask the board to pay every performer the same amount of money: $50. Very radical, and very folk.\n\t</p>\n<p>\n\tThe music at that year’s festival embodies that burning idealism. The first full performance in the film is Clarence Ashley & Doc Watson doing “The Coo Coo Bird,” an incandescent down-home number that seems to rise up out of the earth. The Moving Star Hall Singers’ performance of “Michael Row the Boat Ashore” is so primal and ancient it sounds like one of the field recordings collected by Alan Lomax (the legendary ethnomusicologist who was one of the festival’s organizing curators) that Moby sampled on “Play.” The New Lost City Ramblers do a bluegrass number that the fiddle player turns into a train-kept-a-rollin’ version of countrified rock ‘n’ roll, and the Freedom Singers just about set “Woke Up This Morning” on fire.</p>\n<p>\n\tIn many ways, the 1963 Newport Folk Festival was a set-up for the March on Washington, the epochal Civil Rights demonstration that would take place just one month later. The 1964 edition builds on that spirit, but the music is more seductively unruly, and more personal. There are still the quavery-voiced sopranos — Mary Travers and Joan Baez dueting on the Civil Rights anthem “Lonesome Valley,” Judy Collins performing a sublime “Carry It On.” But there’s also the anarchic stomp of the Blue Ridge Mountain Dancers, an extraordinary young Buffy Sainte-Marie singing “Co’dine” (about her addiction), music from Egypt and Senegambia and Nova Scotia and native Hawaii, and the ecstatic guitar energy of José Feliciano doing “Walk Right In.”</p>\n<p>\n\tThe folk world saw itself as one of acoustic purity, but suddenly that idea was becoming the horse-and-buggy. It would have been nice if the film let us hear more about the arguments we’re told happened backstage — between Lomax and Seeger and the festival board members. But they were all, on some level, about adjudicating the purity of folk. And it’s got to be one of the greatest ironies in the history of pop music that Dylan, when he wrote “The Times They Are A-Changin’,” defined the cutting edge of folk music by laying down a challenge to the old world, but by the time you get to the 1965 Newport Folk Festival, it was the folk purists who had to adjust to how much the times they were a-changin’. They were the ones stuck on the “old road.”</p>\n<p>\n\t“Newport & the Great Folk Dream” makes it clear, in a way that it hasn’t been up until now, that Dylan did not come on and perform his revolutionary electric set in a vacuum. For one thing, the Paul Butterfield Blues Band, who he arranged to back him up just about overnight (they had a quick rehearsal), were already on the program. More than that, the whole energy of the festival was erupting in a new way. If you still think Peter, Paul and Mary are quaint, just listen to them perform “If I Had My Way.” The intensity is enthralling. The Chambers Brothers, wielding electric guitars, have an infectious funk. By the time Dylan gets up there and plays “Maggie’s Farm,” the stage has literally been set. Loudon Wainwright III sums it up perfectly: “There was some sanctimony about folk music. Like, this is precious and this should not be fooled with, and certainly not fucked with. Well, that night, Dylan fucked with it.”\n\t</p>\n<p>\n\tFolk music was never the same, but not because Bob Dylan played an electric set. It’s because folk music was about community, activism, and a kind of radiant selflessness that allowed people to blend into a holy mass. The ’60s counterculture sometimes pretended to be about that (and occasionally was), but that’s not really what the ’60s were about. The ’60s were about people coming into themselves, sexing and drugging themselves, singing the song of themselves, to the point that they often couldn’t see anything else. The ’60s stood on the fault line between the culture of peace and love and what would become the culture of narcissism.</p>\n<p>\n\tWhen Dylan finishes his performance, we hear boos from the crowd. Yet watching “Newport & the Great Folk Dream,” it somehow seems <em>less </em>momentous than we’ve been led to believe. People booed because Dylan, the folk messiah, had let them down. But how could it have been otherwise? The film presents the 1966 Newport Folk Festival as an epilogue, because by then the dream of what folk music was — a force that felt like it could change the world — had come to an end. Rock ‘n’ roll had taken over. The glory of the self had taken over. Yet for one fabled moment at Newport, a moment that only <em>lasted</em> a moment, everyone blamed Dylan the messenger. “Newport & the Great Folk Dream” is a testament to the purity he helped bring to an end, but it’s also a testament to the beauty that remains.</p>\n</div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Newport & the Great Folk Dream’ Review: A Rapturous Documentary Shows You Why the Newport Folk Festival Was Electric Even When It Was Acoustic",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/Bob-Dylan-the-Freedom-Singers-Peter-Yarrow-Pete-Seeger-Newport-the-Great-Folk-Dream-scaled-1.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-09T04:04:42.000Z",
      "dateModified": "2025-10-09T04:04:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Ozzy: No Escape From Now’ Review: Forced Into Retirement, Ozzy Osbourne Opens Up in a Compellingly Downbeat Portrait of a Rocker in Chronic Pain",
    "url": "https://variety.com/2025/film/reviews/ozzy-no-escape-from-now-review-1236543666/",
    "image": "https://variety.com/wp-content/uploads/2025/10/OZZY-NEFN-UHDMMOV177_2-SCREEN-GRAB.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-09T00:35:51.000Z",
    "description": "<div><p>\n\tIs the primary audience for “<a target=\"_blank\" href=\"https://variety.com/t/ozzy-no-escape-from-now/\">Ozzy: No Escape From Now</a>” metalhea",
    "body": "<div><p>\n\tIs the primary audience for “<a target=\"_blank\" href=\"https://variety.com/t/ozzy-no-escape-from-now/\">Ozzy: No Escape From Now</a>” metalheads … or caregivers? There’s not often a significant crossover audience there. But there’s no mistaking that the Paramount+ documentary about the rocker’s final years is mostly somber stuff, focused more on his pain, frailty and depression than on the few moments when he is convinced to go into entertainer mode, as best he can. The “Diary of a Madman” singer is much more of a sad man in director Tania Alexander’s fairly unflinching portrait of a legendary musician grappling with a diminishing quality of life as his body finds new ways to fail him. Fans expecting something more overtly uplifting may need to buckle up.\n\t</p>\n<p>\n\tIt’s clear that when Alexander and her team began filming on the doc four years ago, there was some expectation or at least a hope of finding a story that would end with Osbourne rising up and overcoming his afflictions. But his followers may be surprised to learn — and probably Alexander was, too — that however bad his public thought Ozzy might have been doing as he rescheduled and then canceled gigs, he was actually doing a little bit worse than that. There’s not any whitewashing going on here as the singer’s physical condition goes from bad to worse as filming goes on in period visits over the last four years. It can be a tough watch, seeing someone who has been such an avatar of maniacal fun confessing that his pain is so chronic, he has moments of wanting it all to just end.\n</p>\n<p>\n\tAt times it does seem like the audience that is most likely to find “No Escape From Now” worth all the frustration and sorrow may be family members who have loved ones dealing with similar issues of creeping decrepitude. But eventually, in the second hour, the film does settle into “fun” mode, or as close as it’s going to get, as the tired and somewhat reluctant star gets nudged toward activities that will bring him moments of respite. \n\t</p>\n<p>\n\tThere are all-star recording sessions with his greatest cheerleader, producer Andrew Watt, for what turns out to be a final album, 2022’s “Patient Number 9.” In 2024, he shows up for his even starrier Rock & Roll Hall of Hame induction as a solo artist, with Jack Black infectiously leading the cheer squad. And, of course, in July of this year, Osbourne actually roused himself to sing — from a throne — at a massively publicized and televised farewell concert in his native Birmingham, just three weeks before he died. Just how happy that counts as an ending will be in the eye of the beholder, but it’s happier than some of the earlier passages, where he seems ready to resign himself to a downhill slope, out of the public’s eye.</p>\n<p>\n\tAlong with anything else, this is effectively the two-hour series finale of “The Osbournes,” with a lot less madcap fun and repartee. It’s also a very flattering portrait of <a target=\"_blank\" href=\"https://variety.com/t/sharon-osbourne/\">Sharon Osbourne</a> — and of course it would be, with her as one of the executive producers — but credibly flattering. It’s hard for a viewer to know for sure if the subject’s wife is as even-tempered, patient and supportive off-camera as on. Still, the tenderness between the two of them, as they become somewhat long-suffering together, sure feels real, as she settles even further into the role of motivational coach for a husband who has very good reasons for feeling like he doesn’t want to get out of bed, let alone do physical therapy. If they gave an Emmy for “best supporting,” leaving off the actress part, you might say she merits it here. And while it seems that Ozzy is being hamstrung by some of the same issues that can befall anyone at his time of life, it’s clear not everyone has a navigator like this to help make a way through it. He’s gotten both the short end and the long end of the stick.</p>\n<p>\n\tAs for what got Osbourne to the sorry state shown in some of these scenes, that’s a sad story that involves what the family insinuates is medical malpractice. If true, it’s a bracing reminder that not even great wealth necessarily brings a correct diagnosis or treatment at every turn. The litany of the singer’s setbacks almost requires a road map: In October 2018, in the middle of a two-year tour, he was forced to cancel everything after getting a staph infection in his neck and a compromised immune system. Four months later, he had a fall, “and that was it,” as Sharon tells it, for his future health. \n\t</p>\n<p>\n\tThe doc shows footage of Osbourne happily bopping around in his bed before going in for surgery, with the contention that he came out far worse than he came in — “having posture like fucking Gollum,” as daughter Kelly puts it. The family’s position is that the surgery was “overly aggressive,” with a different surgeon saying he can’t undo all the damage … leading to the crushing realization that, with some calamities in life, there are no do-overs.</p>\n<p>\n\t“I was getting ready to fucking off myself at some point,” Osbourne says, describing a pain that never leaves him, but “knowing me, I’d half do it and I’d be half dead … I’d fucking set myself on fire. I mean, I wouldn’t die. That’s my luck.” It is a big step forward to get from this mindset to at least being willing to force himself to go back to work, in very slight dribs and drabs, in a way that seems to offer at least a bit of replenishment. But the sight you may most remember from “No Escape From Now” is a scene from that farewell concert in July, half-backstage and on-stage. Osbourne steps onto a riser, looking like a defeated man … and then, a few seconds before coming into public view of his final audience, breaks into his trademark Looney Tunes grin. The abrupt, forced transition is a little bit sad, but we can sure hope that the adoration of 100,000 ultimately turned into a moment of real joy for him.</p>\n<p>\n\tIf you’re a big Ozzy fan, you probably already love him for being brave enough to go out and meet his public one last time, against what we can now see from this film were nearly all odds. But the greater bravery might have been going on camera repeatedly for this doc, and allowing himself to convey that old age is not for the faint-hearted, even as it renders you fainter of heart. That truth feels at least as cathartic, in its own gallows-wisdom way, as a big farewell party.</p>\n</div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Ozzy: No Escape From Now’ Review: Forced Into Retirement, Ozzy Osbourne Opens Up in a Compellingly Downbeat Portrait of a Rocker in Chronic Pain",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/OZZY-NEFN-UHDMMOV177_2-SCREEN-GRAB.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-09T00:35:51.000Z",
      "dateModified": "2025-10-09T00:35:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jimmy Kimmel Thought His Show Would Never Return After Suspension: ‘I Said to My Wife, That’s It. It’s Over’",
    "url": "https://variety.com/2025/tv/news/jimmy-kimmel-thought-he-might-not-return-after-boycott-1236542828/",
    "image": "https://variety.com/wp-content/uploads/2025/09/GettyImages-2185417956.jpg?crop=0px%2C234px%2C5000px%2C2813px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-10-09T03:31:45.000Z",
    "description": "<div><p>\n\tIn the hours after ABC benched “<a target=\"_blank\" href=\"https://variety.com/t/jimmy-kimmel/\">Jimmy Kimmel</a> Live!” and both the Sinclair ",
    "body": "<div><p>\n\tIn the hours after ABC benched “<a target=\"_blank\" href=\"https://variety.com/t/jimmy-kimmel/\">Jimmy Kimmel</a> Live!” and both the Sinclair and Nexstar affiliate groups said they would put the show on indefinite hiatus, Kimmel thought the show might be over for good. He figured that might be a real possibility after Sinclair shared a list of demands (including an apology) from Kimmel before it would reinstate his show.</p>\n<p>\n\t“Tthe idea that I would not have 40 affiliates, I was like, ‘Well, that’s it.’ Because there seemed to be a list of demands presented to me and I was not going to go along with any of them,” he told the audience Wednesday at the Bloomberg Screentime event in Hollywood. “So it’s was like, ‘well, I guess we’re done.’ I said to my wife, ‘that’s it. It’s over.'”\n\t</p>\n<p>\n\tUltimately, Kimmel was back on air — and he believes his return to TV after a brief suspension “probably went about as good as it could go.” Most importantly, he said he wanted the opportunity to explain what he was trying to say after “It was intentionally, and I think, maliciously, mischaracterized.”\n</p>\n<p>\n\tKimmel’s Bloomberg Screentime appearance marked the first time he answered questions from a reporter about last month’s kerfuffle, when he was pulled off the air for several days by ABC and pre-empted by Nexstar and Sinclair ABC affils.</p>\n<p>\n\tDescribing how he prepared for that return episode on Sept 23, “it was something really that had to come from inside me,” he said. “It had to be truthful, and I had to lay it all out there and just be honest about what I was feeling and what I’d experienced. And I think I did. I knew that it wasn’t going to be perfect. There were always going to be people that didn’t like it and didn’t accept it, but the important thing to me was that I was able to explain what I was saying, what I was trying to say.”\n\t</p>\n<p>\n\tAsked about his talks with Disney CEO Bob Iger and Disney Entertainment co-chair Dana Walden in the immediate aftermath, KImmel characterized them as “really good conversations. These are people that I’ve known for a long time, and who I like very much. We all wanted this to work out best. And I will tell you, first of all, I ruined Dana’s weekend. It was just non stop phone calls all weekend.”</p>\n<p>\n\tKimmel gave Walden credit for his return: “I don’t think what I don’t think the result, which I think turned out to be very positive, would have been as positive if I hadn’t talked to Dana as much as I did. Because it helped me think everything through, and it helped me just kind of understand where everyone was coming from. I can sometimes be reactionary. I can sometimes be aggressive. And I could sometimes be unpleasant. I think really having those days to think about it was helpful.”</p>\n<p>\n\tLater, he was asked if he had a pick for Iger’s successor as Disney CEO. Kimmel didn’t want to play favorites, but given his close relationship with Walden and how she helped him navigate the events of the past month, he noted “I happen to love Dana Walden very much, and I think she’s done a great job. And I think what has happened over the last like three weeks, I think was very unfair to my bosses at Disney. I don’t think anyone should ever be put in a position like this, it is insane, and I hope that we drew a really, really bold red line as Americans about what we will and will not accept.”</p>\n<p>\n\tKimmel was benched for three nights by ABC after <a target=\"_blank\" href=\"https://variety.com/t/brendan-carr/\">Brendan Carr</a>, chairman of the Federal Communications Commission, threatened to punish the network over comments the host made in a monologue. Carr lashed out at Disney after Kimmel noted that the right wing was trying to “characterize the kid who murdered Charlie Kirk as anything other than one of them, and doing everything they can to score political points from it.” In particular, on a right-wing podcast prior to Kimmel’s benching, Carr threatened to investigate ABC affiliates unless they took Kimmel off the air, implying the FCC could pull their broadcast licenses.</p>\n<p>\n\tAsked when he realized that there might be a problem, “I didn’t think there was a big problem” at first, Kimmel said. “I saw it as distortion on the part of some of the right wing media networks, and  I aimed to correct it. I have problems. all the time and it’s kind of funny, because sometimes you think, ‘oh this is not a problem’ and then it turns into a big problem, and then sometimes it goes the other way.”\n\t</p>\n<p>\n\tNexstar and Sinclair yanked Kimmel off their ABC stations after Carr’s comments, forcing Disney to put “<a target=\"_blank\" href=\"https://variety.com/t/jimmy-kimmel-live/\">Jimmy Kimmel Live</a>!” on pause. But that turned the controversy into a lightning rod for free speech, giving Kimmel an opening to come roaring back on Sept. 23, averaging 6.3 million viewers — its most-watched regularly scheduled episode ever, despite not airing in 23% of U.S. households. By the end of the week Nexstar and Sinclair had restored the show as well.</p>\n<p>\n\tMore recently, Carr has agreed to appear before the Senate Commerce Committee to testify about the events that led to ABC’s temporary suspension of Kimmel.</p>\n<p>\n\tEarlier at the Bloomberg event, Los Angeles Mayor Karen Bass also celebrated the quick return of Kimmel. “People got activated and demanded that Jimmy Kimmel come back on the air. And I think that that was a great victory,” she said. “So sometimes, when you’re struggling and you’re going through all these changes, it’s important to realize Jimmy Kimmel will be back on the back on the air was a victory for all of us.”</p>\n<p>\n\tBeyond discussion of the recent news, Kimmel was also asked to elaborate on his previous comments to <em>Variety</em> that he didn’t think CBS was truthful when it said “The Late Show With Stephen Colbert” was canceled because it was losing $40 million a year.</p>\n<p>\n\t“I know what the budgets for these shows are,” Kimmel said, pegging them at around $100 million to $120 million a year. “I know what I make. I know what Stephen makes. I know what the ad sales people make. I know that there are values that nobody bothers to consider, like the affiliate fees that have to account for a portion of that… I’s not $40 million. Is the show losing money? That I don’t know. I can’t imagine it’s losing a lot of money if it is.”</p>\n<p>\n\tAsked about his latest feeling on when “<a target=\"_blank\" href=\"https://variety.com/t/jimmy-kimmel-live-2/\">Jimmy Kimmel Live!</a>” might end, he repeated his assertion that “I often answer that question, and then I do the opposite of what I said. I previously said, ‘this is going to be like my last one,’ the last three contracts. So I’ve learned not to say anything anymore, because it upsets my staff. It’s best that when I make a decision, I will make that decision.”</p>\n<p>\n\tAs for his conversation on air this week with comedian Aziz Ansari about Ansari’s decision to perform at the controversial Riyadh comedy festival in Saudi Arabia, Kimmel said the two of them agreed to talk about the hot button subject beforehand.\n\t</p>\n<p>\n\t“I wouldn’t have gone, but I wanted to hear his reasons, and I thought he had some compelling reasons,” Kimmel said. “Nothing’s black and white. It’s not something I would do. But I do understand the idea that if we close ourselves off to the world, or we isolate somebody, that maybe it’s not good. I don’t know that my reasoning is the correct reasoning. Also, we see it happening in this country too. I mean, we travel abroad. Many of us don’t want to be held accountable for what our president does and says. As an American going someplace, I’m fortunate enough to be well known, and people know where I’m coming from. But I think it would be a different situation if people didn’t know who I was. I think probably the first thing I’d say as I got into every cab is, ‘I didn’t vote for him, just FYI!’ I do think that kind of makes me understand his position better.”</p>\n</div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jimmy Kimmel Thought His Show Would Never Return After Suspension: ‘I Said to My Wife, That’s It. It’s Over’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/09/GettyImages-2185417956.jpg?crop=0px%2C234px%2C5000px%2C2813px&resize=1000%2C563"
      ],
      "datePublished": "2025-10-09T03:31:45.000Z",
      "dateModified": "2025-10-09T03:31:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bella Hadid Hot Shots To Kick Off Her 29th Birthday!",
    "url": "https://www.tmz.com/2025/10/09/bella-hadid-hot-shots-to-kick-off-her-29th-birthday/",
    "image": "https://imagez.tmz.com/image/01/16by9/2025/10/08/01a8d1563896449c83fb844a95f45611_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-09T07:01:50.000Z",
    "description": "<div>\n    <article>\n                    <h2>\n                          <span>Bella Hadid Hot Shots</span>\n                          <span>To Kick Off ",
    "body": "<div>\n    <article>\n                    <h2>\n                          <span>Bella Hadid Hot Shots</span>\n                          <span>To Kick Off Her</span>\n                          <span>29th Birthday!</span>\n                      </h2>\n                  <p>\n                        Published October 9, 2025 12:01 AM PDT\n                                                                            </p>\n      <div>\n    <section>\n          <p><a target=\"_blank\" href=\"https://www.tmz.com/people/bella-hadid/\"><strong>Bella Hadid</strong></a> is slaying another year around the sun and we've got some juicy hot shots to kick off the birthday fun!</p>\n      </section>\n    <section>\n          <p>At 29 years old, there's no bikini Bella busts out that's a disappointment -- We're just wondering which boxing gym she goes to, and how do we make an appointment 😉?!</p>\n      </section>\n    <div>\n                  <a>\n          <div>\n                          <p><img src=\"https://imagez.tmz.com/image/47/4by3/2025/10/08/478e682c11d54bbd9fe94fece189eb47_md.jpg\" alt=\"1008-Bella-Hadid-Hot-Shots-Sub1\" />\n                </p></div>\n                                  </a>\n      </div>\n    <section>\n          <p>In her cowgirl era, the top model rarely shares sexy shots like this -- so when it's up for grabs you best darn believe we're gonna snatch it right up!</p>\n      </section>\n    <div>\n                  <a>\n          <div>\n                          <p><img src=\"https://imagez.tmz.com/image/d7/4by3/2025/10/08/d7ecdf0537114e69b62ebbfecd234c56_md.jpg\" alt=\"1008-Bella-Hadid-Hot-Shots-Sub2\" />\n                </p></div>\n                                  </a>\n      </div>\n    <section>\n          <p>Blue checker bikini tops are a home run, and the winky face is just a blissful bonus underneath the sun!</p>\n      </section>\n    <section>\n          <p>Bring it like Bella and have a ball with our hot shots photo gallery!</p>\n      </section>\n    <section>\n          <p>Happy Birthday, Bella!</p>\n      </section>\n      </div>\n              <section>\n          <ul>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/people/bella-hadid/\">\n                Bella Hadid\n              </a>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/categories/hotties-and-bodies/\">\n                Hotties & Bodies\n              </a>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/categories/hot-bodies/\">\n                Hot Bodies\n              </a>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/categories/photo-galleries/\">\n                Photo Galleries\n              </a>\n                      </ul>\n        </section>\n          </article>\n          </div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bella Hadid Hot Shots To Kick Off Her 29th Birthday!",
      "image": [
        "https://imagez.tmz.com/image/01/16by9/2025/10/08/01a8d1563896449c83fb844a95f45611_xl.jpg"
      ],
      "datePublished": "2025-10-09T07:01:50.000Z",
      "dateModified": "2025-10-09T07:01:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Gene Simmons Crashes SUV in Malibu After Fainting Behind the Wheel",
    "url": "https://www.tmz.com/2025/10/08/gene-simmons-car-crash-malibu/",
    "image": "https://imagez.tmz.com/image/9f/16by9/2025/10/08/9f3230e9484d40e58d72a6577572bb2c_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-08T20:16:25.000Z",
    "description": "<div>\n    <article>\n                    <h2>\n                          <span>Gene Simmons</span>\n                          <span>Smashes SUV Into Park",
    "body": "<div>\n    <article>\n                    <h2>\n                          <span>Gene Simmons</span>\n                          <span>Smashes SUV Into Parked Car ...</span>\n                          <span>Fainted Behind the Wheel</span>\n                      </h2>\n                  <p>\n                        Published October 8, 2025 1:16 PM PDT\n                                                                      <span>|</span>\n                Updated October 8, 2025 6:34 PM PDT\n                                    </p>\n      <div>\n    <div>\n                  <a>\n          <div>\n                          <p><img src=\"https://imagez.tmz.com/image/9f/4by3/2025/10/08/9f3230e9484d40e58d72a6577572bb2c_md.jpg\" alt=\"gene simmons getty\" />\n                </p></div>\n                  </a>\n      </div>\n    <section>\n          <p>Scary moment for <a target=\"_blank\" href=\"https://www.tmz.com/people/gene-simmons/\"><strong>Gene Simmons</strong></a> ... he crashed his SUV into a parked car in Malibu after losing consciousness while driving down Pacific Coast Highway.</p>\n      </section>\n    <section>\n          <p>The KISS rocker crashed his Lincoln Navigator on Tuesday afternoon ... and he reportedly told sheriff's deputies he had passed out or fainted behind the wheel.</p>\n      </section>\n    <div>\n                  <a>\n          <div>\n                          <p><img src=\"https://imagez.tmz.com/image/e1/4by3/2025/10/08/e18b3bdbfc534cd6aa9591333eac9666_md.jpg\" alt=\"gene simmons getty sub\" />\n                </p></div>\n                  </a>\n      </div>\n    <section>\n          <p>Gene's wife Shannon tells TMZ that her husband passed out while driving down PCH. His SUV veered into oncoming traffic and traveled across several lanes before hitting a parked car.</p>\n      </section>\n<section>\n          <p>Gene was transported to a hospital but has since been discharged and is recovering at home. Luckily no one was hurt in the accident and Gene is going to be just fine.</p>\n      </section>\n    <section>\n          <p>According to Shannon Gene hates to drink water and was put on a new medication recently and was dehydrated, which is what caused him to pass out.</p>\n      </section>\n      </div>\n              <section>\n            <h3>\n              Related articles\n            </h3>\n        </section>\n              <section>\n          <ul>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/people/gene-simmons/\">\n                Gene Simmons\n              </a>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/categories/car-crashes/\">\n                Car Crashes\n              </a>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/categories/music/\">\n                Music\n              </a>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/categories/fairly-legal/\">\n                Fairly Legal\n              </a>\n                      </ul>\n        </section>\n          </article>\n          </div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Gene Simmons Crashes SUV in Malibu After Fainting Behind the Wheel",
      "image": [
        "https://imagez.tmz.com/image/9f/16by9/2025/10/08/9f3230e9484d40e58d72a6577572bb2c_xl.jpg"
      ],
      "datePublished": "2025-10-08T20:16:25.000Z",
      "dateModified": "2025-10-08T20:16:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kardashian Curves -- Can You Guess the Famous Sister?!",
    "url": "https://www.tmz.com/2025/10/08/kardashian-curves-guess-the-famous-sister/",
    "image": "https://imagez.tmz.com/image/bc/16by9/2025/10/08/bc0ca3e0df9142a1b40b277d30787748_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-08T21:15:31.000Z",
    "description": "<div>\n    <article>\n                    <h2>\n                          <span>Kardashian Curves ...</span>\n                          <span>Guess The</s",
    "body": "<div>\n    <article>\n                    <h2>\n                          <span>Kardashian Curves ...</span>\n                          <span>Guess The</span>\n                          <span>Famous Sister!</span>\n                      </h2>\n                  <p>\n                        Published October 8, 2025 2:15 PM PDT\n                                                                            </p>\n      <div>\n    <div>\n      <a target=\"_blank\" href=\"https://www.tmz.com/photos/2017/03/12/guess-the-kardashian-kurves-photos/\">\n        <img src=\"https://imagez.tmz.com/image/bc/4by3/2025/10/08/bc0ca3e0df9142a1b40b277d30787748_md.jpg\" alt=\"Guess the Kardashian Curves!\" />\n              </a>\n    </div>\n    <section>\n          <p>Can you guess which Kardashian-Jenner sister put her famous curves on blast in this eye-popping shot?! This ain't rocket science y'all ...</p>\n      </section>\n    <section>\n          <p>She once lost her diamond earring in the ocean, and she sometimes models her shapewear 'shoots in slow-motion ...</p>\n      </section>\n    <section>\n          <p>You already know, hit up the gallery for the reveal 😘!</p>\n      </section>\n      </div>\n      <div>\n          <ul>\n            <li>\n              <a target=\"_blank\" href=\"https://www.tmz.com/2025/10/08/kardashian-curves-guess-the-famous-sister/\">\n                <span></span>\n                Share<span> on Facebook</span>\n              </a>\n            </li>\n            <li>\n              <a target=\"_blank\" href=\"https://www.tmz.com/2025/10/08/kardashian-curves-guess-the-famous-sister/\">\n                <span></span>\n                Share<span> on X</span>\n              </a>\n            </li>\n                          <li>\n                <a target=\"_blank\" href=\"https://www.tmz.com/2025/10/08/kardashian-curves-guess-the-famous-sister/#disqus_thread\">\n                  <span></span>\n                </a>\n              </li>\n                      </ul>\n        </div>\n              <section>\n            <h3>\n              Related articles\n            </h3>\n        </section>\n              <section>\n          <ul>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/people/kim-kardashian/\">\n                Kim Kardashian\n              </a>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/categories/hotties-and-bodies/\">\n                Hotties & Bodies\n              </a>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/categories/hot-bodies/\">\n                Hot Bodies\n              </a>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/categories/who-would-you-rather/\">\n                Who'd You Rather?\n              </a>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/categories/the-kardashians/\">\n                The Kardashians\n              </a>\n                      </ul>\n        </section>\n          </article>\n  </div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kardashian Curves -- Can You Guess the Famous Sister?!",
      "image": [
        "https://imagez.tmz.com/image/bc/16by9/2025/10/08/bc0ca3e0df9142a1b40b277d30787748_xl.jpg"
      ],
      "datePublished": "2025-10-08T21:15:31.000Z",
      "dateModified": "2025-10-08T21:15:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Lee Greenwood Agrees With Mike Johnson, 'I'd Be Great for Super Bowl Show'",
    "url": "https://www.tmz.com/2025/10/08/lee-greenwood-agree-mike-johnson-super-bowl/",
    "image": "https://imagez.tmz.com/image/a7/16by9/2025/10/08/a714c09fb083476792a750c60e8e0912_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-08T22:05:37.000Z",
    "description": "<div>\n    <article>\n                    <h2>\n                          <span>Lee Greenwood</span>\n                          <span>Backs Speaker Johnso",
    "body": "<div>\n    <article>\n                    <h2>\n                          <span>Lee Greenwood</span>\n                          <span>Backs Speaker Johnson's Super Bowl Swap ...</span>\n                          <span>I'm Ready To Bless The U.S.A!!!</span>\n                      </h2>\n                  <p>\n                        Published October 8, 2025 3:05 PM PDT\n                                                                            </p>\n      <div>\n    <div>\n                  <a>\n          <div>\n                          <p><img src=\"https://imagez.tmz.com/image/a7/4by3/2025/10/08/a714c09fb083476792a750c60e8e0912_md.jpg\" alt=\"Bad Bunny lee greenwood Mike Johnson getty 1\" />\n                </p></div>\n                  </a>\n      </div>\n    <section>\n          <p>One person’s backing House Speaker <strong>Mike Johnson</strong>’s call to swap <a target=\"_blank\" href=\"https://www.tmz.com/people/bad-bunny/\"><strong>Bad Bunny</strong></a> for <strong>Lee Greenwood</strong> at the Super Bowl ... it’s the country singer himself!</p>\n      </section>\n    <section>\n          <p>Lee tells TMZ he’s right in step with what Speaker Johnson said yesterday ... confirming he’d crush the Super Bowl gig, thanks to years of belting it out for NFL teams, especially at their Salute to Service games.</p>\n      </section>\n    <div>\n                  <a>\n          <div>\n                          <p><img src=\"https://imagez.tmz.com/image/a0/4by3/2024/07/16/a0e97e6b0d0a41ca840e3c8a49dc3e4e_md.jpg\" alt=\"071624 lee greenwood convention sub getty\" />\n                </p></div>\n                  </a>\n      </div>\n    <section>\n          <p>In fact, the 82-year-old's such a hot ticket, he’s set to rock halftime for the Dallas Cowboys on MNF come November 3rd -- and since football’s basically America’s favorite pastime, he says busting out the anthem or \"God Bless the U.S.A.\" at games is always a thrill.</p>\n      </section>\n<section>\n          <p>With Bad Bunny already <a target=\"_blank\" href=\"https://www.tmz.com/2025/09/28/bad-bunny-headline-super-bowl-halftime-show/\"><strong>locked for the halftime spotlight</strong></a>, Lee says maybe the NFL can still tap him to fire up the crowd pre-game!</p>\n      </section>\n    <section>\n        <p>Waiting for your permission to load the Instagram Media.</p>\n      </section>\n    <section>\n          <p>Of course, Lee’s hype is all about his passion for music and football only ... and his rep stresses he’s got zero beef with Bad Bunny, and what really bums him out is seeing how divided the country’s gotten over the whole thing.</p>\n      </section>\n    <section>\n          <p>In general, Lee can’t stand how nasty folks get with each other over politics -- he’s just here for the tunes and the touchdowns!</p>\n      </section>\n      </div>\n              <section>\n            <h3>\n              Related articles\n            </h3>\n        </section>\n              <section>\n          <ul>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/people/bad-bunny/\">\n                Bad Bunny\n              </a>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/categories/tmzsports/\">\n                TMZ Sports\n              </a>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/categories/super-bowl/\">\n                Super Bowl\n              </a>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/categories/politix/\">\n                Politix\n              </a>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/categories/exclusive/\">\n                Exclusive\n              </a>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/categories/music/\">\n                Music\n              </a>\n                      </ul>\n        </section>\n          </article>\n          </div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lee Greenwood Agrees With Mike Johnson, 'I'd Be Great for Super Bowl Show'",
      "image": [
        "https://imagez.tmz.com/image/a7/16by9/2025/10/08/a714c09fb083476792a750c60e8e0912_xl.jpg"
      ],
      "datePublished": "2025-10-08T22:05:37.000Z",
      "dateModified": "2025-10-08T22:05:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sexy Costumes for Halloween 2025 -- From Street Fighter to Top Gun!",
    "url": "https://www.tmz.com/2025/10/09/sexy-halloween-costumes-leg-avenue/",
    "image": "https://imagez.tmz.com/image/0d/16by9/2025/10/08/0dfd943ff8ca48d6b2b89567bd5405dc_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-09T07:01:28.000Z",
    "description": "<div>\n                    <h2>\n                          <span>Toil, Trouble & Thirst Traps</span>\n                          <span>Sexy Halloween Cost",
    "body": "<div>\n                    <h2>\n                          <span>Toil, Trouble & Thirst Traps</span>\n                          <span>Sexy Halloween Costumes for 2025</span>\n                          <span>Street Fighter, Top Gun & More!</span>\n                      </h2>\n                  <p>\n                        Published October 9, 2025 12:01 AM PDT\n                                                                            </p>\n              </div><div>\n    <div>\n                  <a>\n          <div>\n                          <p><img src=\"https://imagez.tmz.com/image/0d/4by3/2025/10/08/0dfd943ff8ca48d6b2b89567bd5405dc_md.jpg\" alt=\"Amazon-Leg-Avenue-Costumes-PRIMARY\" />\n                </p></div>\n                                  </a>\n      </div>\n    <section>\n          <p><em>TMZ may collect a share of sales or other compensation from links on this page.</em></p>\n      </section>\n    <section>\n          <p>You don’t need to be a scream queen to turn heads this Halloween! Get decked out in something a little sultry (and not scary) in these pop culture inspired costumes. You'll look frightfully good…whether you're channeling your inner pop star or street fighter!</p>\n      </section>\n    <section>\n          <p>And if these sexy looks aren’t for you, we’ve also rounded up <a target=\"_blank\" href=\"https://www.tmz.com/2025/09/26/leg-avenue-sexy-spooky-costumes/\"><strong>scary good costumes that will have everyone spellbound</strong></a> as well as <a target=\"_blank\" href=\"https://www.tmz.com/2025/09/25/leg-avenue-sexy-fairy-tale-costumes/\"><strong>fairy tale favs that’ll steal the show</strong></a>!</p>\n      </section>\n    <section>\n              <a target=\"_blank\" href=\"https://amzn.to/4moUSCP\">\n      <h3>ChunLi</h3>\n      </a>\n        </section>\n    <section>\n                    <p><a target=\"_blank\" href=\"https://amzn.to/4moUSCP\">\n                          <img src=\"https://imagez.tmz.com/image/f3/4by3/2025/10/08/f324a485376d407b8bd1c49af768d50a_md.jpg\" alt=\"ChunLi-Leg-Avenue-Costumes-MAIN\" />\n                                  </a>\n      </p>\n        </section>\n    <section>\n          <p>All men will bow before you in this <a target=\"_blank\" href=\"https://amzn.to/4moUSCP\"><strong>Street Fighter Chun-Li Costume</strong></a>!</p>\n      </section>\n<section>\n          <p>Channel your inner warrior with this fierce three piece set that includes Chun-Li’s signature blue and gold qipao as well as her iconic accessories: her hair bun covers and her spiked wrist bands. Take to the streets to fight for justice on your own…or find friends to join in with other costumes from the franchise!</p>\n      </section>\n    <section>\n              <a target=\"_blank\" href=\"https://amzn.to/48lrRo2\">\n      <h3>Pink Princess</h3>\n      </a>\n        </section>\n    <section>\n                    <p><a target=\"_blank\" href=\"https://amzn.to/48lrRo2\">\n                          <img src=\"https://imagez.tmz.com/image/e8/4by3/2025/10/08/e8bc3a7a21094fb6ae363e95be024225_md.jpg\" alt=\"Pink-Princess-Leg-Avenue-Costumes-MAIN\" />\n                                  </a>\n      </p>\n        </section>\n    <section>\n          <p>You’ll be looking just <em>peachy</em> in this video game inspired <a target=\"_blank\" href=\"https://amzn.to/48lrRo2\"><strong>Pink Princess Costume</strong></a>.</p>\n      </section>\n    <section>\n          <p>Whether you’re racing down Rainbow Road or across Coconut Mall, there will be no stopping you this Halloween as the head of all of Mushroom Kingdom ... even if a red shell comes your way. Who really needs Mario and Luigi to save the day anyway?</p>\n      </section>\n    <section>\n              <a target=\"_blank\" href=\"https://amzn.to/3VTpRMn\">\n      <h3>Top Gun</h3>\n      </a>\n        </section>\n    <section>\n                    <p><a target=\"_blank\" href=\"https://amzn.to/3VTpRMn\">\n                          <img src=\"https://imagez.tmz.com/image/47/4by3/2025/10/08/471a7ee563d04555b718f34ba4722f4f_md.jpg\" alt=\"Top-Gun-Leg-Avenue-Costumes-MAIN\" />\n                                  </a>\n      </p>\n        </section>\n    <section>\n          <p>Talk to me, Goose! Fly high in this sexy <a target=\"_blank\" href=\"https://amzn.to/3VTpRMn\"><strong>Top Gun Flight Dress Costume</strong></a>.</p>\n      </section>\n    <section>\n          <p>While it may not be exactly what pilots are wearing in the cockpit, you’ll still certainly turn heads in this flirty mini dress. It comes equipped with patches inspired by the movie, including interchangeable Maverick and Goose name badges.</p>\n      </section>\n    <section>\n              <a target=\"_blank\" href=\"https://amzn.to/4265peP\">\n      <h3>Oktoberfest</h3>\n      </a>\n        </section>\n    <section>\n                    <p><a target=\"_blank\" href=\"https://amzn.to/4265peP\">\n                          <img src=\"https://imagez.tmz.com/image/ee/4by3/2025/10/08/eed844c364674a01ac8cd3b1ae73e63e_md.jpg\" alt=\"Oktoberfest-Leg-Avenue-Costumes-MAIN\" />\n                                  </a>\n      </p>\n        </section>\n    <section>\n          <p>You may not have made it to Germany this October but who says you can’t still celebrate Oktoberfest? Raise a stein on Halloween in this <a target=\"_blank\" href=\"https://amzn.to/4265peP\"><strong>Gretchen Oktoberfest Dirndl Costume</strong></a>.</p>\n      </section>\n    <section>\n          <p>It includes everything you need for a traditional Oktoberfest outfit, including an off-the-shoulder peasant blouse, corset with ribbon lace, attached apron and flirty skirt…all in one piece for easy wear. Plus, you can’t forget the matching socks with ribbon details!</p>\n      </section>\n    <section>\n              <a target=\"_blank\" href=\"https://amzn.to/48oQkJ7\">\n      <h3>British Flag Pop Singer</h3>\n      </a>\n        </section>\n    <section>\n                    <p><a target=\"_blank\" href=\"https://amzn.to/48oQkJ7\">\n                          <img src=\"https://imagez.tmz.com/image/90/4by3/2025/10/08/903967c903ba40fe979acfc2a690c8df_md.jpg\" alt=\"British-Flag-Pop-Singer-Leg-Avenue-Costumes-MAIN\" />\n                                  </a>\n      </p>\n        </section>\n    <section>\n          <p>I’ll tell you what I want, what I really, really want…It’s this Spice Girls-inspired <a target=\"_blank\" href=\"https://amzn.to/48oQkJ7\"><strong>British Flag Pop Star Costume</strong></a>.</p>\n      </section>\n    <section>\n          <p>Channel your inner Ginger Spice in this totally ’90s form-fitting Union Jack dress. Really ramp up your look by finishing it off with white gogo boots and accessorizing with your own mic. Now you just need to find Posh Spice and the rest of the group!</p>\n      </section>\n    <section>\n              <a target=\"_blank\" href=\"https://amzn.to/3IvSXOT\">\n      <h3>Ringmaster</h3>\n      </a>\n        </section>\n    <section>\n                    <p><a target=\"_blank\" href=\"https://amzn.to/3IvSXOT\">\n                          <img src=\"https://imagez.tmz.com/image/47/4by3/2025/10/08/4783d761908449bea334945aeb1c50a9_md.jpg\" alt=\"Ringmaster-Leg-Avenue-Costumes-MAIN\" />\n                                  </a>\n      </p>\n        </section>\n    <section>\n          <p>All eyes will be on you in the center of the ring in this <a target=\"_blank\" href=\"https://amzn.to/3IvSXOT\"><strong>Ravishing Ringmaster Costume</strong></a>. You’ll call the shots in this sexy look which includes a gold trimmed garter teddy bodysuit and an attached velvet tail coat as well as a top hat. Whether you’re a one man circus or have gathered a group of clowns, lions and acrobats, you’ll certainly steal the show this Halloween.</p>\n      </section>\n    <section>\n          <p><a target=\"_blank\" href=\"https://amzn.to/3RZ4jg0\"><strong>Sign up for Amazon Prime</strong></a> to get the best deals!</p>\n      </section>\n    <section>\n          <p><em>All prices subject to change.</em></p>\n      </section>\n      </div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sexy Costumes for Halloween 2025 -- From Street Fighter to Top Gun!",
      "image": [
        "https://imagez.tmz.com/image/0d/16by9/2025/10/08/0dfd943ff8ca48d6b2b89567bd5405dc_xl.jpg"
      ],
      "datePublished": "2025-10-09T07:01:28.000Z",
      "dateModified": "2025-10-09T07:01:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]