[
  {
    "title": "Berlin Selection ‘Light Pillar’ Unveils New Clip (EXCLUSIVE)",
    "url": "https://variety.com/2026/film/festivals/berlin-selection-light-pillar-new-clip-1236663816/",
    "image": "https://variety.com/wp-content/uploads/2026/01/light-pillar.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-15T12:26:58.000Z",
    "description": "\n\tVariety is exclusively unveiling a new clip from “Light Pillar,” the feature debut from Chinese writer-director Xu Zao, which is in the Berlin Film ",
    "body": "\n\tVariety is exclusively unveiling a new clip from “Light Pillar,” the feature debut from Chinese writer-director Xu Zao, which is in the Berlin Film Festival‘s Perspectives section.\n\n\tDubai-based company Cercamon recently acquired worldwide sales rights to the production, which screens in competition for the best first feature award in the strand.\n\n\t“Light Pillar” follows a solitary janitor working in a deteriorating film studio who becomes absorbed in a virtual romance before his illusion collapses. When a production crew arrives to film an alien invasion movie on the crumbling backlot, the janitor decides to vanish alongside the studio itself.\n\t\n\n\tThe genre-crossing romantic sci-fi drama with touches of comedy uses hand-drawn animation to portray the protagonist’s mundane reality while live-action sequences depict the virtual realm to where he escapes.\n\n\t“‘Light Pillar’ combines romance, science fiction, and comedy,” Xu said in a statement. “Although the story takes place in the future, its themes come from our lives today. In life, love and happiness are sometimes things we chase, but often they are already around us – we just don’t notice them because we’re distracted by everything else.”\n\n\tThe director explained his unconventional visual strategy: “Visually, the film mixes animation and live action to show two different worlds. Unlike the usual approach, animation here represents our protagonist’s real life, while live-action footage shows the virtual world. For him, reality feels flat, while the virtual world looks vivid, rich, and full of new possibilities.”\n\t\n\n\tDa Peng stars as the janitor and serves as executive producer on the film, which Lu Xiaowei produces.\n\n\tXu holds a master’s degree from the Beijing Film Academy’s School of Fine Art. His 43-minute animated work “No Changes Have Taken In Our Life” premiered at Rotterdam in 2023 and collected the Golden Dove for animated film at DOK Leipzig plus the Grand Prize at Japan’s Image Forum Festival. Beyond directing, Xu also wrote the screenplay and created the storyboards for “Light Pillar.”\n\n\tWatch the clip here:\n\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Berlin Selection ‘Light Pillar’ Unveils New Clip (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/light-pillar.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-15T12:26:58.000Z",
      "dateModified": "2026-02-15T12:26:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Taiwan Prison Drama ‘Sunshine Women’s Choir’ Becomes Highest-Grossing Local Film Ever",
    "url": "https://variety.com/2026/film/box-office/sunshine-womens-choir-highest-grossing-taiwanese-film-1236663778/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Sunshine-Womens-Choir.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-15T12:01:12.000Z",
    "description": "\n\tTaiwanese prison drama “Sunshine Women’s Choir” has become the highest-grossing local film in Taiwan‘s box-office history, surpassing NT$545 million",
    "body": "\n\tTaiwanese prison drama “Sunshine Women’s Choir” has become the highest-grossing local film in Taiwan‘s box-office history, surpassing NT$545 million ($17.3 million) on Feb. 14 and dethroning the previous record-holder “Cape No. 7” (2008).\n\n\tThe drama follows a baby girl born inside a women’s prison, welcomed by four inmates each carrying painful pasts. When a rebellious newcomer arrives, initial clashes evolve into friendship. After the infant is diagnosed with an eye disease, the inmates form a prison choir to create a lasting memory for the child. Drawing from real-life stories and Kang Dae-kyu’s Korean film “Harmony” (2010), the film blends humor, music and themes of redemption.\n\t\n\n\tThe Mandarin-language feature, directed by Gavin Lin, released on Dec. 31, 2025. The film claimed the number one position at Taiwan’s daily box office on January 12, overtaking “Avatar: Fire and Ash,” achieved consistent daily grosses exceeding NT$10 million ($318,000) since Jan. 16.  \n\n\n\t66cc Company Limited handles local distribution in Taiwan and international sales for the production. The film has already opened in Singapore and Malaysia alongside its Taiwan release. In Hong Kong, preview screenings began Jan. 17, with a theatrical rollout scheduled for March 5. Additional territories including Cambodia, North America, Australia and New Zealand are planned for March releases, while Vietnam is tentatively scheduled for April.\n\n\tThe ensemble cast features veteran actor Judy Ongg, alongside Chen Yi-Han, Sun Shu-May, Amber An and Chung Hsin-Ling. Director Lin previously gained international recognition with “More Than Blue” (2018), a box-office success that earned a Golden Horse Award nomination in 2019. His other credits include “Welcome to the Happy Days” (2015) and “A Trip with Your Wife” (2021).\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Taiwan Prison Drama ‘Sunshine Women’s Choir’ Becomes Highest-Grossing Local Film Ever",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Sunshine-Womens-Choir.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-15T12:01:12.000Z",
      "dateModified": "2026-02-15T12:01:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Rocky the Troll,’ Produced by Team Behind Netflix Hit ‘Troll,’ Travels to Several Territories (EXCLUSIVE)",
    "url": "https://variety.com/2026/film/global/rocky-the-troll-sales-reinvent-yellow-1236663577/",
    "image": "https://variety.com/wp-content/uploads/2025/11/Rocky-the-Troll.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-15T07:00:00.000Z",
    "description": "\n\tSales outfit Reinvent Yellow has closed deals in several territories for adventure-family film “Rocky the Troll,” which it is selling at the Europea",
    "body": "\n\tSales outfit Reinvent Yellow has closed deals in several territories for adventure-family film “Rocky the Troll,” which it is selling at the European Film Market in Berlin. It is produced by the team behind “Troll” (2022), the most watched non-English-language film on Netflix.\n\n\t“Rocky the Troll” has been acquired for Czech Republic and Slovakia by Foxx, for Poland by Monolith, and for Germany, Austria, Switzerland and the Baltics by Daro.\n\t\n\n\tThe Norwegian movie centers on 12-year-old Gaia, who discovers her great-grandfather’s collection of rocks are troll eggs. When one of the eggs hatches, Gaia forms a magical bond that soon draws her into an exciting yet dangerous adventure. Forces beyond her control threaten both her own world and the trolls’ hidden existence.\n\n\n\tThe director is Andrea Eckerbom, and the script is by Edward A. Dreyer.\n\n\tThe producers are Terje Strømstad, Kristian Strand Sinkerud, Espen Horn and John M. Jacobsen. It is produced by Motion Blur, with support from the regional film fund FimInvest, the Norwegian Film Institute, SF Studios and REinvent.\n\n\tWhen Reinvent Yellow acquired the film before AFM, deputy CEO, Rikke Ennis, told Variety: “ ‘Rocky the Troll’ is a dream project for Reinvent Yellow. It’s as close as you can get to the iconic family films we cherish from the eighties (such as ‘E.T.’ and ‘Gremlins’). With Motionblur and the ‘Troll’ team behind the film, we have no doubt that it will be a smashing hit, combining great ambition with excellent execution.”\n\n\tHelene Aurø, chief sales officer at Reinvent Yellow, added, “We see ‘Rocky the Troll’ as one of the most commercially promising family adventures in years — it has all the ingredients for strong international sales and long-lasting audience appeal.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Rocky the Troll,’ Produced by Team Behind Netflix Hit ‘Troll,’ Travels to Several Territories (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/Rocky-the-Troll.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-15T07:00:00.000Z",
      "dateModified": "2026-02-15T07:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Madrid Launches Berlin Networking Event, Aims to Strengthen International Positioning as Production Hub",
    "url": "https://variety.com/2026/film/global/madrid-audiovisual-cluster-berlinale-efm-networking-spain-1236663311/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Foto-Acto-Cluster-Audiovisual-de-Madrid-EFM.jpeg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-15T11:36:22.000Z",
    "description": "\n\tSpain’s muscular presence at this year’s Berlinale and European Film Market was bolstered on Saturday with an inaugural presentation and networking ",
    "body": "\n\tSpain’s muscular presence at this year’s Berlinale and European Film Market was bolstered on Saturday with an inaugural presentation and networking event organized by the Madrid Audiovisual Cluster in collaboration with the Madrid Film Office and Film Madrid Region.  \n\n\tThe Madrid delegation has a packed schedule of activities in Berlin under the “Madrid Make it Possible” banner, integrating the joint efforts of the Madrid Audiovisual Cluster, Film Madrid Region and Madrid Film Office to consolidate the sector’s international reach, strengthen strategic alliances in the European market and bolster the region’s international positioning as a strategic hub for film and TV production.\n\t\n\n\tThe delegation also has its own EFM space within the Spanish stand at the Martin-Gropius-Bau.\n\n\n\tThe noon-time event, held at the Wandelbar in the Marriott Hotel, inspired by Spain’s traditional vermouth hour, brought together producers, distributors, buyers and other international industry professionals from Germany, Belgium, Brazil, Canada, Denmark, Spain, the U.S., Finland, France, Ireland, Italy, Latvia, Mexico, Norway, the Netherlands, the U.K. and Uruguay.\n\n\tWelcoming guests and introducing the organizations from both Spain’s capital city and the surrounding autonomous community of Madrid were Teresa Azcona, managing director of the Madrid Audiovisual Cluster; Luis Lloret and Xiomara García of Film Madrid Region; and María Prada and Víctor Aertsen from the Madrid Film Office, who explained the support they provide to the audiovisual sector and their work in promoting the industry in the region and the city of Madrid.\n\t\n\n\tSeveral members of the Madrid Audiovisual Cluster provided further insights into organization’s activities, including Rafael Alberola, head of ECAM Industria, who highlighted the ECAM Forum, an international co-production event designed to foster emerging talent and promoted by the Madrid Film and Audiovisual School.\n\n\tAlso on hand was Samuel Castro, co-director of Iberseries & Platino Industria and member of the Madrid Audiovisual Cluster’s board of directors. A leading international event for the Ibero-American audiovisual sector, the Iberseries & Platino Industria’s sixth edition will be held from Sept. 29 to Oct. 2 in Madrid, where key professionals involved in the creation, production and marketing of film and TV content in Spanish and Portuguese will once again gather. \n\n\tEstablished as the largest international business event for the Spanish and Portuguese-language film and TV industry, Iberseries & Platino Industria has become a strategic meeting point for producers, distributors, buyers and platforms from Ibero-America and Europe.\n\n\tIn Berlin, Iberseries & Platino Industria has co-launched Series Match, a new initiative at the Berlinale Series Market that connects Ibero-American and German companies with series projects in early development.\n\n\tBacked by the Madrid City Council and the Community of Madrid, the Madrid Audiovisual Cluster aims to strengthen the audiovisual industry in the region by supporting companies and encouraging new projects, creating an integrated ecosystem that promotes business opportunities, innovation and employment while boost international events in the capital.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Madrid Launches Berlin Networking Event, Aims to Strengthen International Positioning as Production Hub",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Foto-Acto-Cluster-Audiovisual-de-Madrid-EFM.jpeg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-15T11:36:22.000Z",
      "dateModified": "2026-02-15T11:36:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Emma Laird on Going From ‘The Brutalist’ to ‘The Bone Temple’ and Picking Bold, Bonkers Roles: ‘I Don’t Want to Do Shakespeare, I Want to Play a Fish’",
    "url": "https://variety.com/2026/tv/global/emma-laird-the-brutalist-the-bone-temple-bold-roles-1236655902/",
    "image": "https://variety.com/wp-content/uploads/2026/02/28-Years-Later-Premiere-Low-Res.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-15T09:58:50.000Z",
    "description": "\n\tEmma Laird recalls a moment — not all that long ago — when she was stood on the rooftop of her apartment in Los Angeles, looking out across a pictur",
    "body": "\n\tEmma Laird recalls a moment — not all that long ago — when she was stood on the rooftop of her apartment in Los Angeles, looking out across a picture-postcard sunset skyline and smoking a cigarette.\n\n\t“It was so cinematic,” she says. “And I was crying my eyes out.”\n\n\tThe Brit had been on the phone to her agent, who had informed her that, despite making it to the screen test stage for HBO’s “Gossip Girl” reboot — the closest to any role she’d got after months of grinding daily auditions — the part was going elsewhere.\n\t\n\n\t“And I just thought, that’s it, I tried, my visa’s running out and I’m broke,” she says. “So I went back to London.”\n\n\n\tSkip forward a little over half a decade and Laird is still in London. But she’s now one of the U.K.’s fastest rising young names, boasting an enviable and eclectic array of high-profile projects (“Mayor of Kingstown,” “The Brutalist,” “28 Years Later: The Bone Temple”) already under her belt and with many more (“Blood on Snow,” “War,” “Neuromancer”) incoming. At the Berlinale, she’s attending with the buzzy new series “Mint,” her first lead role.\n\n\tBut almost comically down-to-earth, the 27-year-old — part of a decreasing array of working-class British actors rising up call sheets — isn’t one to revel in her recent achievements.\n\n\t“I’m constantly working from a place of self-deprecation,” she says between gulps of matcha latte in a west London café near her recently bought home. “It does feel like a nice trajectory, but I’m too insecure to feel like I’m amazing. But I do take pride — I know when shit’s good.”\n\t\n\n\tAnd shit has been very good.\n\n\tIn stark contrast to the L.A. rooftop scene, Laird experienced something of a career epiphany in a semi-freezing field in Yorkshire. The moment occurred while shooting Nia DaCosta’s wild and gory franchise sequel “The Bone Temple” and a delightfully unhinged performance as Jimmima, the most sadistic member of the murderous, wig-wearing cult led by Jack O’Connell.\n\n\t“I just looked around and was like, I am living the dream,” she says. “I was just looking at this derelict set of a zombie apocalypse and thinking ‘This is fucking amazing — this is I want to do!’”\n\n\tBlood-splattered screen star was not on the cards when Laird first started out.\n\n\tSpotted at a music festival by a model scout, at the age of 17 she packed her bags, quit her studies and moved from her hometown in Chesterfield in the north of England to London. “I was so focused on being successful,” she says. And she was, fronting numerous fashion campaigns (including for Vivienne Westwood, who she wore at “The Bone Temple” premiere) and magazine shoots.\n\n\tBut after six years of modelling she had become disillusioned with the industry, not helped by calls from her agency to “lose some weight.” Having spent so long hanging around enthusiastic, creative people, she was urged to give acting a go.\n\n\tIt was Taylor Sheridan’s bleak Michigan-set prison drama “Mayor of Kingstown” — in typical style booked just months after her tearful return from L.A. — that was Laird’s major breakout several years later. Her debut turn alongside Jeremy Renner as a seductive escort got industry tongues wagging. Variety named her a Brit to Watch in 2021. She was off.\n\n\tApple TV series “The Crowded Room” and Kenneth Branagh’s all-star Agatha Christie whodunnit “A Haunting in Venice” soon followed, and later, “The Brutalist,” playing the standoffish — and possibly antisemitic — wife of Adrien Brody’s cousin (and a role Laird says she only got because Brady Corbet accidentally trapped her finger in a door when filming “The Crowded Room”). Although she couldn’t enjoy its awards season success due to being “so back-to-back,” she claims that the “The Brutalist” was the “first thing I watched that I’ve been proud of.”\n\t\n\n\t“The Bone Temple” was the second. But this film also helped ignite a craving for the wild and the weird, for daring roles where the prep could involve, for example, digging into the twisted childlike mind of someone who had been “raised in an apocalypse.”\n\n\tIn short, from here on Laird wants to be bold, bonkers and loud.\n\n\t“That’s not to say to shout,” she asserts. “But subtlety is easier to do, because you can hide behind it. Whereas in making brave choices, you run the risk of making mistakes.”\n\n\tFor the actress, while prestige, awards and acclaim are all well and good, that’s not her focus at this point in her career. \n\n\t“I get that you can give a beautiful performance like Jessie Buckley in ‘Hamnet,’ which was fucking amazing,” she says. “But what inspires me is watching people do mad stuff. So I want to make films about fairies or wizards or weird shit. I don’t want to do Shakespeare, I want to play a fish.”\n\n\n\n\t\n\n\t\t\t\t\tEmma Laird in ‘Mint’. Courtesy of BBC Studios\n\t\t\t\t\t\t\t\t\tHouse/Fearless Minds/BBC\n\t\n\n\n\n\tHollywood certainly serves up more literary than fishy roles, but Laird does have her eye on joining HBO’s “Harry Potter” series, potentially as one of the underwater Merpeople. (She claims to be such a fan of the original films that she regularly puts one on each night before she goes to sleep).\n\n\tBut before any potential future enrolment in Hogwarts (the Merpeople don’t actually show up until the fourth book, “The Goblet of Fire,” so there’s a few years to wait), Laird has another TV series incoming.\n\n\t“Mint,” premiering in Berlin and from fellow rising Brit Charlotte Regan — who made a splash with her feature debut “Scrapper” — is a distinctly stylized and exquisitely shot drama in which she portrays the love-struck daughter of a crime family. This time, she’s not to the sidelines wearing blood-splattered tracksuits and fairy wings, but front and center of the action, and it’s a debut lead role she’s feeling quite anxious about.\n\n\t“I’ve been doing all this work, but it’s been with these smaller, cool characters,” Laird notes. “And it feels like now people are starting to watch me in stuff, and that’s quite scary — I have the fear of what people will think when they watch me.”\n\n\tWith her “nice trajectory” only appearing to point upwards, Laird acknowledges that she’ll have to get over this fear, especially as she goes for noisier roles. Ironically, just a day after we meet, it’s announced that she’s cast, not in a film about Shakespeare, but as Daphne du Maurier in “The Housekeeper” alongside Helena Bonham Carter and Anthony Hopkins. However, she notes that her research into the famed author of “Rebecca” has revealed that she was “loud and rich” and aims to bring that presence to the set when filming kicks off later this month.\n\t\n\n\tLaird is also very much aware that her rising in-demand, booked-and-busy status might very different had the call about “Gossip Girl” (mixed reviews, scrapped after two seasons) gone the other way on that cinematic evening on the rooftop in L.A.\n\n\t“I think it’s a nice thing to remember — that maybe the thing you think you want is not the thing you need,” she says. “Who knows what would have happened, but it all worked out so well. And now it’s just a beautiful memory to look back on and think, how poetic!”\n\n\tShe laughs. \n\n\t“But I do remember that that was probably the best cigarette I’ve ever smoked in my life.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Emma Laird on Going From ‘The Brutalist’ to ‘The Bone Temple’ and Picking Bold, Bonkers Roles: ‘I Don’t Want to Do Shakespeare, I Want to Play a Fish’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/28-Years-Later-Premiere-Low-Res.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-15T09:58:50.000Z",
      "dateModified": "2026-02-15T09:58:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Director Hanna Bergholm and Star Seidi Haarla Talk Berlinale Shocker ‘Nightborn’: ‘We Were Dead Serious While Making It’",
    "url": "https://variety.com/2026/film/global/nightborn-berlin-festival-hanna-bergholm-seidi-haarla-1236663704/",
    "image": "https://variety.com/wp-content/uploads/2026/02/MixCollage-15-Feb-2026-09-34-AM-1320.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-15T11:30:20.000Z",
    "description": "\n\tHanna Bergholm’s Finnish chiller “Nightborn” shook up Berlinale’s competition, with some viewers laughing during its violent scenes. But its star, S",
    "body": "\n\tHanna Bergholm’s Finnish chiller “Nightborn” shook up Berlinale’s competition, with some viewers laughing during its violent scenes. But its star, Seidi Haarla, isn’t laughing. \n\n\t“We were dead serious while making it,” she tells Variety.\n\n\tHaarla plays Saga, who moves with her British husband, Jon (“Harry Potter” alumnus Rupert Grint), to a house surrounded by a Finnish forest. Saga becomes pregnant, but after giving birth she’s convinced something is very wrong with her baby boy. \n\t\n\n\t“For Saga, what’s happening isn’t funny. Her journey is about accepting things the way they are as opposed to her fantasy about motherhood. As this reality reveals itself, she goes: ‘What the fuck?! This is not what I expected.’ Perhaps the biggest lesson of this film is that parenting would be so much easier if we listened to our children more.” \n\n\n\t“Sometimes, the advice you get just doesn’t apply,” agrees Bergholm. “In the end, you just have to listen to your child’s needs and trust your instincts. It helps if you also acknowledge who you are and how you feel, because then you can really connect.” \n\n\tBergholm, who gained recognition following Sundance hit “Hatching” – also co-written with Ilja Rautsi – is no stranger to shocking the viewers. \n\n\t“When faced with big emotions and difficult situations, we try to cope. There’s an intentional way of telling this story in a way that puts people in a ‘discomfort zone’ and a certain humor that comes from people misunderstanding each other.”\n\t\n\n\tJust like Saga and Jon, who’s tired of everyone around him acting so… Finnish. \n\n\t“Saga has always been an outsider and now so is Jon, living in this new place. He doesn’t even speak the language. This kind of cultural shock can manifest itself in this way. You’re just frustrated and annoyed by everything.”\n\n\tBut it’s Saga’s connection to nature, not to her native country, that’s the main topic of conversation. \n\n\t“I think she has lost it. So many of us did. She has to lose and break a lot of things, and there will be a lot of suffering, but that’s the only way it was supposed to go,” says Haarla.\n\n\tBergholm adds: “It’s about understanding who you are, even when society and others say you are ‘wrong’. I’m not claiming that everything Saga does is right, but she has to accept herself and all of her emotions.”\n\n\tAs well as her changing body. \n\n\t“She feels: ‘This baby has broken me.’ There are things that happen to a woman’s body during childbirth that we never really talk about. If we look at what’s ‘allowed’ in films, it’s all about killing people, blood and exploding veins, but we don’t want to show someone giving birth or defecating. Why are some things forbidden and others admired?,” wonders Bergholm.\n\n\tHaarla generally thinks of herself as a “body-oriented” actor.  \n\n\t“The body is where I find all my answers and truths. Of course, it also provides a bridge to motherhood, even though in real-life I gave birth by C-section and that wasn’t my dream. I’m not afraid of physicality; the mind is much scarier.” \n\n\tShe wanted to ensure Saga’s body wouldn’t be made fun of in the film. \n\n\t“Early on, Seidi asked: ‘Are we laughing at her?’ We would never do that. It’s important people call each other beautiful, but it’s also important to sometimes say: ‘I feel ugly.’ And for someone to hear that,” notes Bergholm.\n\n\tFollowing a challenging year for the Finnish industry, which barely avoided government cuts of seven million euros, the inclusion of “Nightborn” in Berlinale competition is a much-needed win. \n\n\t“People ask: ‘Why do films cost so much?’ It’s not the film itself that costs – it’s people’s salaries. Statistically, for every euro invested in Finnish films, at least double is returned. It benefits Finland economically to bring these stories to the world. We need to communicate that,” says Bergholm.\n\t\n\n\tHaarla, who previously starred in one of the biggest Finnish successes in recent years, “Compartment No. 6,” is more solemn. \n\n\t“We are now under this government, this regime, which is announcing cuts and making decisions based on their values. I am not sure if people who value creativity and art will win that competition,” she says. \n\n\t“I think films will never disappear, and people will never stop creating and coming together, but the way we do it will change. We are too entrenched in a capitalistic mindset for that not to happen.”\n\n\tBefore it does, it’s worth making films that are different, argues Bergholm.\n\n\t“There’s value in making something that shakes people. We love Mozart and Van Gogh now, but people didn’t respond well to them at first. They thought it was wrong! If you just repeat what you have already seen and done, why bother?” \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Director Hanna Bergholm and Star Seidi Haarla Talk Berlinale Shocker ‘Nightborn’: ‘We Were Dead Serious While Making It’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/MixCollage-15-Feb-2026-09-34-AM-1320.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-15T11:30:20.000Z",
      "dateModified": "2026-02-15T11:30:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "German Animation Showcase at EFM Pitch Sessions Celebrates Kids Fare, Teases Bovine-Pantherine Love, New Struwwelpeter, Life as a Kalashnikov",
    "url": "https://variety.com/2026/film/global/germany-efm-animation-days-berlinale-1236662547/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Your-Spotted-Skin_4.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-15T11:43:12.000Z",
    "description": "\n\tBerlin’s EFM Animation Days industry showcase presented a selection of eight German animation projects on Friday in a lively pitching session that o",
    "body": "\n\tBerlin’s EFM Animation Days industry showcase presented a selection of eight German animation projects on Friday in a lively pitching session that offered a wide range of family-friendly and darker, adult-themed fare.\n\n\tProjects included modern twists on such classics as Robert Louis Stevenson’s “Treasure Island” and “Der Struwwelpeter,” by German psychiatrist Heinrich Hoffmann, as well as more contemporary children books, like “Troll and the Oliver” and the “Onno & Ontje” series, not to mention the Wild Hunt of local folklore.\n\t\n\n\n\n\t\n\n\t\t\t\t\t“Onno and Ontje – Friends are the Best Gift”\n\t\t\t\t\t\t\t\t\tBlaue Pampelmuse\n\t\n\n\n\n\tFeature film projects included “Onno and Ontje – Friends are the Best Gift,” from Leipzig-based Blaue Pampelmuse and based on the works of Thomas Springer. The story follows solitary former fisherman Onno, who lives alone on an island until he befriends a little otter named Ontje, and an unexpected friendship blooms.  \n\n\n\tBlaue Pampelmuse is looking for two co-producers for what would be a 60% German production with an estimated budget of some €5.2 million ($6.2 million). The project is so far backed by federal and regional funders German Federal Film Board (FFA) and Mitteldeutsche Medienförderung (MDM).\n\n\n\n\t\n\n\t\t\t\t\t“Treasure Island”\n\t\t\t\t\t\t\t\t\tLittle Dream Entertainment\n\t\n\n\n\n\tCologne and Hamburg-based Little Dream Entertainment unveiled its feature film project, a fresh, anthropomorphic take on “Treasure Island,” featuring the young feline heroine Jane Hawkins in a musical adventure.\n\n\tLittle Dream Entertainment, producing with partner firm Red Parrot Studios, is seeking co-producers, broadcasters and a sales agent. “Treasure Island” has so far secured support from regional funders Filmförderung Hamburg Schleswig-Holstein (MOIN) and Film und Medien Stiftung NRW.\n\t\n\n\n\n\t\n\n\t\t\t\t\t“Struwwel”\n\t\t\t\t\t\t\t\t\tFabian&Fred\n\t\n\n\n\n\tHamburg-based Fabian&Fred, run by Fabian Driehorst and Frédéric Schuld, likewise presented a novel take on a classic tome with “Struwwel,” in which Paulinchen, a 9-year-old girl at boarding school, brings to life a wild girl from her picture book who sparks cheerful chaos in her new home. But when the school principal takes away her book, Struwwel disappears, so Paulinchen sets off on a magical adventure to find her friend.  \n\n\tDriehorst and Schuld see the project not just as a feature film, but as a “multiplatform story universe,” noting that the original book is still hugely popular in Germany and worldwide and whose influence and impact can be seen in works like Tim Burton’s “Edward Scissorhands,” even referenced in Conan O’Brien’s TBS show, and more recently the basis of an upcoming HBO Max show from “Dark” creators Jantje Friese and Baran Bo Odar.\n\n\t“Troll and the Oliver,” based on the works of British author Adam Stower, is being adapted by Ludwigsburg-based Zooper Film along with Seru Animation and Big Idea Farm. It centers on a frightening creature with a sweet tooth who, after trying but failing to eat the boy Oliver, realizes he much more prefers the delicious pastries that Oliver bakes.\n\n\tZooper Film is looking for international co-producers, world sales agents, distribution and broadcasters.\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tArx Anima\n\t\n\n\n\n\tAustrian-German studio Arx Anima, meanwhile, has adapted a folkloric tale in the form of “Alma and the Wild Hunt,” a family-friendly animated adventure that follows the courageous 10-year-old Alma and her squirrel companion on a mission to save her village from eternal winter and recover a magical crystal stolen by the dastardly mine owner Baron Rupert.  \n\n\tStill at an early stage, Arx Anima is on the lookout for co-producers, world sales, distributors and broadcasters. The project has so far secured initial support from MDM.  \n\n\n\n\t\n\n\t\t\t\t\tLuise Heyer and Henning Baum working on “Your Spotted Skin”\n\t\t\t\t\t\t\t\t\tStudio Film Bilder\n\t\n\n\n\n\tAiming for more adult audiences, Stuttgart-based Studio Film Bilder presented “Your Spotted Skin,” a romantic comedy about Antonia the Cow and Kurt the Lion, who fall in love but whose relationship faces great skepticism by the world around them. Based on an award-winning script by Daniel Nocke and directed by Stefan Krohmer and Studio Film Bilder’s Thomas Meyer-Hermann, “Your Spotted Skin” employs motion capture performed by actors Luise Heyer (“The Life of Wishes”) and Henning Baum (“The Last Cop”).\n\t\n\n\tThe feature-length project, co-produced by Raumkapsel Animation, Balance Film and Something Big, has already raised some €5 million ($5.9 million) towards its estimated €10 million budget. The producers are looking for additional support, including global distribution. “Your Spotted Skin” has already secured funding from MDM, Filmstiftung NRW, Creative Europe Media, FFA, MOIN, Hessen Film & Medien and MFG Baden Württemberg, with backing from broadcasters MDR, Arte and SWR.\n\n\n\n\t\n\n\t\t\t\t\t“Angst”\n\t\t\t\t\t\t\t\t\tBrave New Work\n\t\n\n\n\n\tAlso focusing on the adult demo, Hamburg and Cologne-based Brave New Work explores the dark era of 1930s Germany in “Angst,” in which a young working-class woman in Berlin is drawn into the sinister dealings of a decadent illusionist, while society sinks into chaos.\n\n\tHandled by Little Dream Pictures’ Animation Addicts distribution label, “Angst” is supported by MOIN and Creative Europe Media.\n\n\n\n\t\n\n\t\t\t\t\t“In Their Own Flesh”\n\t\t\t\t\t\t\t\t\tPaper Plane Animation\n\t\n\n\n\n\tLikewise examining darker themes of militarism, the proliferation of weapons and war is Weimar-based Paper Plane Animation with “In Their Own Flesh,” which follows the life of a German produced AK-47 assault rifle. \n\n\tUsing cut-out animation and documentary footage, the hybrid film tells the fateful story, based on true events, of an East German-made MPi KM-72 Kalashnikov that makes it’s way from Europe to West Asia, and then across the Atlantic to South America from the rifle’s own point of view. \n\n\tAna Vallejo and Franka Sachse of Paper Plane are working with German and Colombian artists on the visual language of the film. \n\n\tPaper Plane, which has secured support from MDM, is looking for co-production partners, broadcasters and world sales companies. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "German Animation Showcase at EFM Pitch Sessions Celebrates Kids Fare, Teases Bovine-Pantherine Love, New Struwwelpeter, Life as a Kalashnikov",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Your-Spotted-Skin_4.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-15T11:43:12.000Z",
      "dateModified": "2026-02-15T11:43:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Shanghai Daughter’ Director Agnis Shen Zhongmin on Blurring Fiction and Documentary in Berlin Panorama Debut",
    "url": "https://variety.com/2026/film/festivals/shanghai-daughter-director-blurring-fiction-documentary-berlin-1236663180/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Shanghai-Daughter.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-15T07:33:00.000Z",
    "description": "\n\tAgnis Shen Zhongmin’s debut feature, “Shanghai Daughter,” approaches China’s Down to the Countryside Movement through an unconventional lens, treati",
    "body": "\n\tAgnis Shen Zhongmin’s debut feature, “Shanghai Daughter,” approaches China’s Down to the Countryside Movement through an unconventional lens, treating the southwestern rubber plantations where her late father was sent during the Cultural Revolution as what she calls “a geological theater that already contained all the information of the scripts.”\n\n\tThe film, which is in the Panorama section of the Berlin Film Festival, follows a Shanghai woman who journeys alone to a rubber plantation in southwest China, searching for a mysterious woman while strangers drift unexpectedly into her path. Starring Liang Cuishan alongside non-professional performers, the project deliberately blurs the boundaries between fiction and documentary.\n\t\n\n\t“I have never believed that there exists such a thing as pure fiction or pure reality,” Shen Zhongmin says. Her hybrid approach extended to treating her non-professional cast as creative collaborators rather than traditional actors. “To me, they were even my ‘screenwriters’ and my ‘on-site producers,'” she explains. “Not a single non-professional performer in the film ever received a so-called ‘script.’ They had no prior concept of what they were going to shoot or say.”\n\n\n\tThe director’s methodology emerged organically from her initial search for her father’s old farm residence, a process marked by uncertainty and improvisation due to limited archival materials. “This was never a project that began as a research-based or investigative endeavor; it arose purely from a very primal intuition and emotional impulse within me,” she says. That experience of drifting and searching directly shaped the film’s narrative structure.\n\t\n\n\tRather than treating the rubber plantations and forests as mere backdrops, Shen Zhongmin positions the natural environment as an active narrative force. “A rubber tree produces latex for only about 20 or 30 years, which is not so different from a person’s youth,” she observes. “On many levels, I feel that trees are like people — they have sensations, life cycles and the same impermanence of fate.”\n\n\tThe filmmaker’s approach to collaboration created what she describes as a kinship-based dynamic on set. Liang, the only professional actor in the cast, “possesses a natural, almost non-professional quality” with strong empathetic capacities that allowed her to blend seamlessly with the ensemble. “The state of the set truly was an overlap of real life and fictional creation — for example, after the camera cut, the food on the table could still be eaten, and the conversation could continue,” Shen Zhongmin says.\n\n\tComing to cinema from backgrounds in literature, journalism and contemporary art, the director views filmmaking as a particularly expansive medium. “Compared with these, cinema is perhaps more vast and complex, and also more ambiguous and multivalent,” she says. “It can borrow from, transform, and contain all the fields mentioned above.”\n\n\tThe film touches on themes of ecofeminism and social history without overt didacticism, favoring what Shen Zhongmin calls “a space for perception” over comprehensive explanation. “Sometimes, ambiguity may actually activate our senses and thinking more effectively,” she notes, adding, “I even think it’s perfectly fine if an audience member falls asleep in the cinema — because in sleep, our perception can still be stirred.”\n\n\tAbout the film’s Berlin world premiere, she says: “This film carries both the cultural specificity of China and the universal dimensions of human experience. I hope this premiere in Berlin can serve as a window through which Chinese local filmmakers can convey new reflections on history and the present, as well as a form of subjective lived experience with international audiences.”\n\n\tThe cast also includes Zhu Yufei, Kong Chuanzhen and Li Xiuqiong. “Shanghai Daughter” is produced by Twelve Oaks Film Art. Parallax Films is handling international sales. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Shanghai Daughter’ Director Agnis Shen Zhongmin on Blurring Fiction and Documentary in Berlin Panorama Debut",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Shanghai-Daughter.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-15T07:33:00.000Z",
      "dateModified": "2026-02-15T07:33:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Berlinale Issues Statement Following Political Backlash at Festival, Says Artists Should Not Be ‘Expected to Speak on Every Political Issue’",
    "url": "https://variety.com/2026/film/global/berlinale-issues-statement-following-political-backlash-1236663708/",
    "image": "https://variety.com/wp-content/uploads/2026/02/GettyImages-2261202704-1.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-15T08:47:40.000Z",
    "description": "\n\tThe Berlin Film Festival has issued a lengthy statement from head Tricia Tuttle over what it describes as a “media storm” that has swept over the fe",
    "body": "\n\tThe Berlin Film Festival has issued a lengthy statement from head Tricia Tuttle over what it describes as a “media storm” that has swept over the festival.\n\n\tThe note — sent out late on Saturday night — comes following criticism faced by multiple attendees over the comments about politics, most notably the jury in the opening day press conference. Faced with questions about the conflict in Gaza, jury head Wim Wenders said, “We have to stay out of politics because if we make movies that are dedicatedly political, we enter the field of politics,” prompting immediate backlash on social media. Indian author Arundhati Roy later pulled out of the festival in anger over the comments. \n\t\n\n\tBoth Michelle Yeoh and Neil Patrick Harris later faced online criticism for their reaction to questions about politics and the rise of facism, Harris for asserting that he was interested in “doing things that were “apolitical.”\n\n\n\tSee the full statement from Tricia Tuttle below\n\n\tPeople have called for free speech at the Berlinale. Free speech is happening at the Berlinale. But increasingly, filmmakers are expected to answer any question put to them. They are criticised if they do not answer. They are criticised if they answer and we do not like what they say. They are criticised if they cannot compress complex thoughts into a brief sound bite when a microphone is placed in front of them when they thought they were speaking about something else.\n\n\tIt is hard to see the Berlinale and so many hundreds of filmmakers and people who work on this festival distilled into something we do not always recognise in the online and media discourse. Over the next ten days at the Berlinale, filmmakers are speaking constantly. They are speaking through their work. They are speaking about their work. They are speaking, at times, about geopolitics that may or may not be related to their films. It is a large, complex festival. A festival that people value in so many different ways and for so many reasons.\n\t\n\n\tThere are 278 films in this year’s programme. They carry many perspectives. There are films about genocide, about sexual violence in war, about corruption, about patriarchal violence, about colonialism or abusive state power. There are filmmakers here who have faced violence and genocide in their lives, who may face prison, exile, and even death for the work they have made or the positions they have taken. They come to Berlin and share their work with courage. This is happening now. Are we amplifying those voices enough?\n\n\tThere are also filmmakers who come to the Berlinale with different political aims: to ask how we can talk about art as art, and how we can keep cinemas alive so that independent films still have a place to be seen and discussed. In a media environment dominated by crisis, there is less oxygen left for serious conversation about film or culture at all, unless it can be folded as well into a news agenda.\n\n\tSome films express a politics with a small “p”: they examine power in daily life, who and what is seen or unseen, included or excluded. Others engage with Politics with a capital “P”: governments, state policy, institutions of power and justice. This is a choice. Speaking to power happens in visible ways, and sometimes in quieter personal ones. Across the history of the Berlinale, many artists have made human rights central to their work. Others have made films which we see as quietly radical political acts which focus on small, fragile moments of care, beauty, love, or on people who are invisible to most of us, people who are alone. They help us make connections to our shared humanity through their movies. And in a broken world this is precious.\n\n\tWhat links so many of these filmmakers at the Berlinale is a deep respect for human dignity. We do not believe there is a filmmaker screening in this festival who is indifferent to what is happening in this world, who does not take the rights, the lives and the immense suffering of people in Gaza and the West Bank, in the Democratic Republic of the Congo, in Sudan, in Iran, in Ukraine, in Minneapolis, and in a terrifying number of places, seriously.\n\n\tArtists are free to exercise their right of free speech in whatever way they choose. Artists should not be expected to comment on all broader debates about a festival’s previous or current practices over which they have no control. Nor should they be expected to speak on every political issue raised to them unless they want to.\n\t\n\n\tWe continue to do this work because we love cinema but we also hope and believe watching films can change things even if that is the glacial shift of changing people, one heart or mind at a time.\n\n\tWe thank our team, guests, juries, our filmmakers, and the many others engaged with the Berlinale for cool heads in hot times.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Berlinale Issues Statement Following Political Backlash at Festival, Says Artists Should Not Be ‘Expected to Speak on Every Political Issue’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/GettyImages-2261202704-1.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-15T08:47:40.000Z",
      "dateModified": "2026-02-15T08:47:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Welcoming a New Life: ‘Papaya’ Debuts Trailer as Director Priscilla Kellen Talks Crafting Non-Dialogue Hope-Filled Narratives (EXCLUSIVE)",
    "url": "https://variety.com/2026/film/global/papaya-priscilla-kellen-animation-best-friend-forever-1236663753/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Papaya.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-15T11:23:29.000Z",
    "description": "\n\t“Between a mother-tree and a young seed at the same time” is how Brazilian director Priscilla Kellen felt as she became a mother at 36. A very free ",
    "body": "\n\t“Between a mother-tree and a young seed at the same time” is how Brazilian director Priscilla Kellen felt as she became a mother at 36. A very free and independent woman until then, it was this pregnancy and birth that shaped what would become “Papaya”, Kellen’s feature directorial debut. \n\n\tAfter being presented in Rio Film Festival last October, “Papaya” will make its international premiere as part of the Generation Kplus competition here in Berlin, a true honor for both the director herself and for Brazilian cinema. \n\t\n\n\tBest Friend Forever handles international sales for Priscilla Kellen’s animated feature “Papaya”, with animation specialist label Gebeka Films handling French distribution rights to the title, scheduled for 2026. \n\n\n\tVariety spoke with Kellen ahead of the Berlinale premiere about the personal and professional journey that is “Papaya,” a family friendly, non-dialogue animated feature that uses digital cut-out technique and lush colors to bring forth a tale of parenthood, independence and how to fight against environmental degradation. Variety has also had access in exclusivity to the trailer for “Papaya.”\n\n\n\n\n\tBefore you started your career, can you recall your very first vivid memory of animation?\n\n\tThe first image that comes to mind, more of a baby’s feeling than a proper memory, is of the characters and colors of the “Barbapapa” family. I was a middle-class child in a large city in the ‘80s, so besides playing with my neighbors in the street, we spent a good part of our time gathered in front of the TV playing Atari and watching everything that was on broadcast television. \n\t\n\n\tI also remember the cozy feeling of watching more abstract animations shown on TV Cultura (our state-owned TV station), especially those made with stop-motion in claymation, like “Mio Mao” and “Pingu,” usually at my grandmother’s house full of my cousins.\n\n\tIt seems that animation was always part of your life. How did you start to work in this industry?\n\n\tMy path in animation began during my undergraduate studies in graphic design, when, through Anima Mundi, I discovered incredible experimental animations from around the world and decided to work in animated film. \n\n\tDuring this period, I met Alê Abreu and began collaborating on his projects, initially as a graphic designer and later becoming part of the art and animation teams for his first two feature films “Garoto Cósmico” and “The Boy and the World.” Afterwards, I directed the 26-episode TV series “Vivi Viravento.”\n\n\tAll three very different projects, and I followed them all from development to completion, always seeking the language and style that best suited the personality of each work. This trajectory connects to a long-standing curiosity: Since childhood, my interest in drawing, painting, artistic techniques, and art history has consistently guided my creative perspective.\n\n\tCan you tell us more about how “Papaya” came to you as a project?\n\n\tThe inspiration came during pregnancy and took shape after my son’s birth, as the baby grew and discovered the world. I was delighted to follow this entire process of human development so closely, in a symbiotic exchange, and at the same time, to see the impact and reflections of welcoming this new life on my own life. \n\n\tI became a mother at 36, I had been a very free and independent woman until then, and suddenly I found myself rooted to care for a new life. I felt like I was losing the freedom and autonomy I used to have, while my most naive dreams and desires continued to provoke my imagination. It was a kind of existential crisis: I felt like a mother-tree and also a young seed at the same time.\n\n\tRegarding the artistic direction, I sensed the story asked for an expressive acting and, at the same time, simple and minimalist animation that reflected the protagonist’s difficulty in moving in the heavy environment and her diminutive proportions. My request to the Birdo animation studio was that the movements have a certain weight and intensity to appear real, without the exaggerated distortions typical of conventional 2D animation. Therefore, the animation team needed to combine this dramatic quality with the principles of cut-out animation, since this also aligned with the abstract forms of the scenarios, helping viewers to immerse themselves in Papaya’s universe. \n\t\n\n\tWhat challenges did this technique present to you as an animator? \n\n\tFrom the beginning of the project, the goal was to make the story clear without words, drawing a parallel with a seed discovering the world, and also aiming for the film to reach the widest possible audience. Without spoken language to narrate, relying only on vocal reactions, noises, and music to mark atmospheres and culminating moments, we were challenged from pre-production to find more graphic narrative solutions, starting with the storyboards, character design and background art. The animation and effects team developed the acting based on reference sounds and soundtracks. \n\n\tIf I had to pinpoint a favorite sequence, I love the beginning with the nutrients flowing through the papaya tree cells and the baby seeds suckling in the cozy orange cave. Another scene that always gives me goosebumps is the one with the birds and winged creatures invading the high-tech production, especially because of the sound work and the powerful voice of Tulipa Ruiz.\n\n\tAny other hurdles you had to overcome during this production?\n\n\tThe scenes showing the underground network and the communication between plants and fungi in the soil were an exercise in patience and overcoming challenges for the team at all stages of production. Fortunately, we all survived, strengthened and happy with the result! \n\n\tThe various shapes and clever designs of the animals particularly stand out, how did you approach the creation of this wide range of creatures, and their textures? \n\n\tEven before I began developing “Papaya”, as a graphic designer, I had already collected some references from geometric abstract art and ethnic patterns in crafts, fabrics, and popular children’s products. As an illustrator of children’s content, I sought ways to apply some of this geometry to my work, especially in paper collages. Through my son, I felt that babies and children deserved less literalness in graphic representations, leaving more room for their visual perception and imagination to develop. When I started creating Papaya’s\n\n\tstory, I expanded this research to the crafts of papaya fruits’ region of origin: Central America, southern North America, and the Amazon region of South America, from where I found incredibly colorful and beautiful design patterns. The concept for the film’s art direction was born from this mix. \n\t\n\n\tSound and music-wise, the film is also unique. Can you elaborate on this part of the project? Since the goal was to have a clear story in a non-verbal way, from the development of the script structured in actions, without narrator or dialogue, I made director’s notes on sound elements and environmental sensations that would be important in driving the plot. While we were making the animatic (a kind of video sketch), I added reference sounds and music, marking atmospheres and climax points. As we were nearing completion, music producer Talita Del Collado offered a profound reinterpretation of these references and created the original soundtrack for “Papaya.” She developed musical elements inspired by the sounds of nature and, from them, composed the main musical themes influenced by Brazilian popular music from different regions. In dialogue with Talita’s compositions, the Submarino Fantástico studio team created and edited the sound effects. Finally, singer Tulipa Ruiz, who lends her bittersweet and powerful voice to the character “Mother-Tree” in the film, also performs the final song, “Borboleta,” composed by her father Luiz Chagas and produced by her brother Gustavo Chagas.\n\n\n\n\t\n\n\t\t\t\t\t‘Papaya’\n\t\n\n\n\n\t“Papaya” mirrors a lot of the ecological concerns already present in “The Boy and the World.” Was it important to you to tackle these issues as well? \n\n\tSince it’s generally not easy growing up in this world, I felt that “Papaya” should address themes such as existential dilemmas and climate issues, which are also major concerns for young people. I wanted to approach these themes in a playful and poetic way, offering the possibility of dreaming freely and even with magical solutions, while also leaving room for reflection and personal interpretation, respecting the viewer’s critical sense and their developing perspective. In that sense, Generation Kplus is the perfect place for the premiere of “Papaya”.\n\n\tSpeaking of the Berlinale, how do you feel being part of this strong Brazilian representation? \n\n\tBrazilian cinema is experiencing a very prosperous period with the recent worldwide success of films such as “I’m Still Here” by Walter Salles, “The Secret Agent” by Kleber Mendonça, and “The Blue Trail” by Gabriel Mascaro. The selection of “Papaya” for the Berlinale is a true honor and was very celebrated news, reinforcing the sector’s optimism at the moment. It’s a recognition of the artistic and cinematographic quality of our animation, along with other six Brazilian films in this edition, demonstrating the festival’s curatorial interest in authentic creations. I’m very excited to attend the film’s screenings at the Berlinale and even a little anxious to know how the audience will react. I hope they enjoy Papaya’s journey in pursuit of her dream! \n\t\n\n\tWhat is animation for you as a medium? \n\n\tThank you! It’s always an important reminder that animation is a medium, not a genre. I understand that the countless animation techniques available (and yet to be created) allow us to tell stories and create worlds that would be impossible or almost always unfeasible in live-action. I feel that with these unlimited resources we have in animation, dreams and other fantastic realities do indeed come true. We are then limited only by our own imagination and ability to create. And in this sense, I hope that there will be more and more space for animated films that are not practically restricted to children’s audiences.\n\n\tBest Friend Forever handles international sales for Priscilla Kellen’s animated feature “Papaya”, with animation specialist label Gebeka Films handling French distribution rights to the title, scheduled for 2026. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Welcoming a New Life: ‘Papaya’ Debuts Trailer as Director Priscilla Kellen Talks Crafting Non-Dialogue Hope-Filled Narratives (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Papaya.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-15T11:23:29.000Z",
      "dateModified": "2026-02-15T11:23:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Megan Thee Stallion's Hot Shots to Kick Off Her 31st Birthday!",
    "url": "https://www.tmz.com/2026/02/15/megan-thee-stallion-hot-shots-birthday/",
    "image": "https://imagez.tmz.com/image/52/16by9/2024/10/31/528bf1ab462f4c268347f83ceb28733d_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-15T09:00:27.000Z",
    "description": "\n    \n                    \n                          Megan Thee Stallion\n                          'Savage' Hot Shots To Kick Off Her 31st!!!\n        ",
    "body": "\n    \n                    \n                          Megan Thee Stallion\n                          'Savage' Hot Shots To Kick Off Her 31st!!!\n                      \n                  \n                                                                        Published \n                              February 15, 2026\n                            1:00 AM PST\n                                                                            \n      \n    \n      \n        \n              \n    \n    \n          It’s Megan Thee Stallion's birthday -- consider this your official heat warning!\n      \n    \n          The \"Hot Girl\" coach never misses when it comes to serving looks, and these bikini snaps prove exactly why she stays winning ... confidence isn’t just part of her brand -- it is the brand.\n      \n    \n          From jaw-dropping curves to headline-stealing poses, Megan knows how to shut it down from every angle -- and she’s never been shy about giving fans exactly what they came for.\n      \n    \n          Another year older, still running the game -- Happy Birthday, Meg!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Megan Thee Stallion\n              \n                          \n                Hot Bodies\n              \n                          \n                Hip Hop\n              \n                          \n                Birthdays\n              \n                          \n                Music\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Megan Thee Stallion's Hot Shots to Kick Off Her 31st Birthday!",
      "image": [
        "https://imagez.tmz.com/image/52/16by9/2024/10/31/528bf1ab462f4c268347f83ceb28733d_xl.jpg"
      ],
      "datePublished": "2026-02-15T09:00:27.000Z",
      "dateModified": "2026-02-15T09:00:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rapper Tone Loc Hospitalized After Flight Emergency, Misses Mardi Gras Appearance",
    "url": "https://www.tmz.com/2026/02/14/tone-loc-hospitalized-after-medical-emergency-on-plane/",
    "image": "https://imagez.tmz.com/image/fd/16by9/2026/02/14/fd53ab833e9f47cba0f0713537f181c4_xl.png",
    "tag": "Entertainment",
    "date": "2026-02-15T00:00:04.000Z",
    "description": "\n    \n                    \n                          Rapper Tone Loc\n                          Hospitalized in Georgia ...\n                          S",
    "body": "\n    \n                    \n                          Rapper Tone Loc\n                          Hospitalized in Georgia ...\n                          Suffered Medical Crisis on Way to Alabama Parade\n                      \n                  \n                                                                        Published \n                              February 14, 2026\n                            4:00 PM PST\n                                                                      |\n                                                                Updated \n                                  February 14, 2026\n                                5:12 PM PST\n                                    \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Update\n  \n    \n          4:49 PM PT -- A rep for Tone Loc tells TMZ ... he's fine, and he's on his way back to Los Angeles. The rep neither confirmed nor denied the medical incident announced by The Krewe of Kolosse.\n      \n    \n          Tone Loc -- the popular rapper best known for the hit songs \"Wild Thing\" and \"Funky Cold Medina\" -- is recovering in a Georgia hospital after a medical incident\n      \n    \n          The Krewe Of Kolosse -- a men's Mardi Gras society -- announced the news because the rapper was supposed to serve as the Grand Marshal of a parade in Dothan, Alabama Saturday.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          However, while flying to Dothan, the Krewe of Kolosse says Tone Loc experienced a medical emergency. The organization did not provide additional information.\n      \n\n          We've kept you informed about Tone Loc's health issues over the years ... including in 2012 when he collapsed multiples times on stage.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          In 2013, Tone Loc suffered an apparent seizure while performing in Iowa. Medical professionals attended the rapper on stage for five minutes before the audience was asked to leave.\n      \n    \n          We've reached out to Tone Loc and his team ... so far, no word back.\n      \n      \n              \n            \n              Related articles\n            \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rapper Tone Loc Hospitalized After Flight Emergency, Misses Mardi Gras Appearance",
      "image": [
        "https://imagez.tmz.com/image/fd/16by9/2026/02/14/fd53ab833e9f47cba0f0713537f181c4_xl.png"
      ],
      "datePublished": "2026-02-15T00:00:04.000Z",
      "dateModified": "2026-02-15T00:00:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "SWAT Makes Its Move in the Nancy Guthrie Kidnapping -- The Latest",
    "url": "https://www.tmz.com/2026/02/14/swat-detains-in-guthrie-investigation-harvey-levin-cnn-interview/",
    "image": "https://imagez.tmz.com/image/87/16by9/2026/02/14/87cb79cc53cd440082817d5086cd5e30_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-14T14:29:06.000Z",
    "description": "\n    \n                    \n                          Nancy Guthrie\n                          SWAT Makes Its Move In Her Kidnapping, Here's The Latest\n",
    "body": "\n    \n                    \n                          Nancy Guthrie\n                          SWAT Makes Its Move In Her Kidnapping, Here's The Latest\n                      \n                  \n                                                                        Published \n                              \n                February 14, 2026\n                \n                            6:29 AM PST\n                                                                      |\n                                                                Updated \n                                  February 14, 2026\n                                1:57 PM PST\n                                    \n      \n    \n      \n        \n                    \n                  \n      \n                    CNN\n          \n    \n          The swat operation Friday night -- leading to the detention of a driver in the Tucson area and the search of a home -- appears to be something other than a direct lead from the ransom note TMZ received.\n      \n    \n          Harvey Levin appeared on CNN Saturday morning, breaking down the limited information we know at this time. A law enforcement source involved in the investigation told him this morning neither the ransom note we received nor the reward demand emails we received were the trigger for last night's action.\n      \n    \n          We have not confirmed, but it appears ... the main target last night was someone in a vehicle in the Tucson area. Again, it appears but is not confirmed ... the search of the house is connected to the traffic stop. 2 people were taken out of the house, and it was searched for several hours.\n      \n\n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          Levin said the FBI had multiple contacts with TMZ Friday about both the ransom letter and the reward demands. Those interactions went on until the early evening Friday night.\n      \n    \n          BTW, the Pima County Sheriff's Office clarified the events from Friday night ... saying Saturday, \"Last night, a federal court-ordered search warrant was executed at a residence near E. Orange Grove Rd. and N. First Ave. in connection with the Guthrie case.\" The warrant was based on a lead they received, and no arrests were made.\n      \n    \n          They also confirmed a traffic stop was conducted, and a person was questioned -- but again, no arrests.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Nancy Guthrie\n              \n                          \n                Nancy Guthrie Case\n              \n                          \n                News\n              \n                          \n                Police\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "SWAT Makes Its Move in the Nancy Guthrie Kidnapping -- The Latest",
      "image": [
        "https://imagez.tmz.com/image/87/16by9/2026/02/14/87cb79cc53cd440082817d5086cd5e30_xl.jpg"
      ],
      "datePublished": "2026-02-14T14:29:06.000Z",
      "dateModified": "2026-02-14T14:29:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Margot Robbie Good Genes or Good Docs?!",
    "url": "https://www.tmz.com/2026/02/15/margot-robbie-good-genes-or-good-docs/",
    "image": "https://imagez.tmz.com/image/1a/16by9/2026/02/10/1a166646556744179a7ae6f6ccea4f9a_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-15T08:45:40.000Z",
    "description": "\n    \n                    \n                          Margot Robbie\n                          Good Genes or\n                          Good Docs?!\n     ",
    "body": "\n    \n                    \n                          Margot Robbie\n                          Good Genes or\n                          Good Docs?!\n                      \n                  \n                                                                        Published \n                              February 15, 2026\n                            12:45 AM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Margot Robbie's looks over the years have soared to new Heights!\n      \n    \n          Here is a 23-year-old version of the blonde starlet at \"The Wolf Of Wall Street\" premiere in NYC back in 2013 (left). This was her breakout role, playing \"Naomi\" alongside Leonardo DiCaprio.\n      \n    \n          And, 16 years later, Margot wowed the crowd in a custom Dilara Findikoglu sheer corseted gown at last week's \"Wuthering Heights\" premiere in London (right).\n      \n    \n          We know she nailed her role as \"Barbie,\" but the question here is: Good Genes or Good Docs?!\n      \n    \n          \"Come on, Barbie, let's go party!\"\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Margot Robbie\n              \n                          \n                Leonardo DiCaprio\n              \n                          \n                Jacob Elordi\n              \n                          \n                Movies\n              \n                          \n                Photo Galleries\n              \n                          \n                Good Genes or Good Docs\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Margot Robbie Good Genes or Good Docs?!",
      "image": [
        "https://imagez.tmz.com/image/1a/16by9/2026/02/10/1a166646556744179a7ae6f6ccea4f9a_xl.jpg"
      ],
      "datePublished": "2026-02-15T08:45:40.000Z",
      "dateModified": "2026-02-15T08:45:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Justina Valentine Fire-Hot Snaps to Celebrate Her 39th Birthday",
    "url": "https://www.tmz.com/2026/02/14/justina-valentine-birthday-photos/",
    "image": "https://imagez.tmz.com/image/18/16by9/2026/02/03/189725df65da491c84780c4859ff801b_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-14T20:00:11.000Z",
    "description": "\n    \n                    \n                          Justina Valentine\n                          Fire-Hot Snaps To Celebrate Bday!!!🔥\n               ",
    "body": "\n    \n                    \n                          Justina Valentine\n                          Fire-Hot Snaps To Celebrate Bday!!!🔥\n                      \n      \n    \n      \n        \n              \n    \n    \n          Justina Valentine is 39 and looking great ... and if you need receipts, this gallery’s got 'em!\n      \n    \n          The birthday babe knows exactly how to crank up the heat -- and it’s not just the signature red hair, 'cause those barely-there bikinis are doing all the talking and showing off every curve.\n      \n    \n          Justina’s body confidence is on full blast, keeping it on-brand in fiery red ... no matter what corner of the globe she’s posing in.\n      \n    \n          So go ahead -- scroll, stare, and celebrate. Justina’s blowing out candles and serving looks. Happy Birthday!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Justina Valentine\n              \n                          \n                Hotties & Bodies\n              \n                          \n                Hot Bodies\n              \n                          \n                Birthdays\n              \n                          \n                Photo Galleries\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Justina Valentine Fire-Hot Snaps to Celebrate Her 39th Birthday",
      "image": [
        "https://imagez.tmz.com/image/18/16by9/2026/02/03/189725df65da491c84780c4859ff801b_xl.jpg"
      ],
      "datePublished": "2026-02-14T20:00:11.000Z",
      "dateModified": "2026-02-14T20:00:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]