[
  {
    "title": "‘Saturday Night Live’ Sets ‘Heated Rivalry’ Star Connor Storrie as Next Host",
    "url": "https://variety.com/2026/tv/news/connor-storrie-heated-rivalry-snl-host-1236643810/",
    "image": "https://variety.com/wp-content/uploads/2026/01/2258536121.jpg?crop=0px%2C280px%2C4897px%2C2753px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-02-01T05:06:34.000Z",
    "description": "\n\t“Saturday Night Live” has announced its next host and musical guest, with Connor Storrie set to take over Studio 8H on Feb. 28, joined by Mumford & ",
    "body": "\n\t“Saturday Night Live” has announced its next host and musical guest, with Connor Storrie set to take over Studio 8H on Feb. 28, joined by Mumford & Sons.\n\n\tThe booking continues a high-profile season for NBC’s long-running sketch series, which has leaned heavily into budding first-time hosts, pop-forward musical guests and a newly reconfigured cast following a major shakeup earlier this year.\n\n\n\tStorrie will make his first appearance on the show, arriving amid “Heated Rivalry” fever. Meanwhile, Mumford & Sons is promoting their upcoming album, “Prizefighter,” set to be released on Feb. 20.\n\t\n\n\tThe upcoming episodes follows a January run that featured first-time hosts Finn Wolfhard, Teyana Taylor and Alexander Skarsgård, with musical guests A$AP Rocky, Geese and Cardi B. That stretch marked the show’s return after the holidays, helping set the tone for the back half of the season.\n\n\tThis season has also had notable changes behind the scenes and on camera. Bowen Yang departed the series after seven seasons following Ariana Grande’s hosting stint earlier this year — an exit that marked the end of an era for one of the show’s most prominent breakout stars.\n\n\tHis departure came alongside a larger cast reset that saw longtime players Heidi Gardner and Ego Nwodim exit, while several new faces joined the ensemble, including Jeremy Culhane, Veronika Slowikowska and Ben Marshall of previously contributing “SNL” comedy trio Please Don’t Destroy.\n\n\tNow in its 51st season, “Saturday Night Live” continues to balance legacy appeal with new voices as it navigates a post-transition period under creator and executive producer Lorne Michaels.\n\t\n\n\t“SNL” airs Saturdays at 11:30 p.m. ET on NBC. See the announcement below.\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Saturday Night Live’ Sets ‘Heated Rivalry’ Star Connor Storrie as Next Host",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/2258536121.jpg?crop=0px%2C280px%2C4897px%2C2753px&resize=1000%2C563"
      ],
      "datePublished": "2026-02-01T05:06:34.000Z",
      "dateModified": "2026-02-01T05:06:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Pete Davidson Opens SNL as Border Czar Tom Homan, Training ICE Agents to Not Get Filmed When They Break the Law",
    "url": "https://variety.com/2026/tv/news/pete-davidson-snl-ice-agents-avoid-getting-caught-1236647437/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Pete-Davidson-SNL.png?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-01T04:55:33.000Z",
    "description": "\n\tPete Davidson returned to “Saturday Night Live” for the cold open of the Jan. 31 episode, portraying border czar Tom Homan as he’s training some woe",
    "body": "\n\tPete Davidson returned to “Saturday Night Live” for the cold open of the Jan. 31 episode, portraying border czar Tom Homan as he’s training some woefully underprepared ICE agents.\n\n\tDavidson opened the segment by saying, “Wondering why Gregory Bovino was dismissed? I want to stress that it wasn’t because he did a bad job, or publicly lied about the shooting of an American citizen, or even dressed like a Nazi, even though he was still doing these things when the president elected him. So I’m here now. We need to tighten up. That starts with remembering the mission objective. Now who could tell me why we’re here in Minneapolis?”\n\t\n\n\tOf course, the recruits had no clear answers.\n\n\n\tAs he continued, Daivdson as Homan said, “Let’s talk about use of force. What do we want to use force right away? … It’s kind of a trick question, because we actually don’t want to use force. Remember, the job ultimately is about keeping America safe. From what?”\n\n\tA recruit answered, “This could be wrong, but Don Lemon?”\n\n\tUltimately, he agreed that the key was to avoid getting videotaped doing anything illegal.\n\n\tThe episode was hosted by Alexander Skarsgård, with musical guest Cardi B. Pete Davidson launched his new Netflix video podcast “The Pete Davidson Show” on Friday, with MGK as his first guest.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Pete Davidson Opens SNL as Border Czar Tom Homan, Training ICE Agents to Not Get Filmed When They Break the Law",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Pete-Davidson-SNL.png?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-01T04:55:33.000Z",
      "dateModified": "2026-02-01T04:55:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jay-Z, Harvey Weinstein and Pusha T Mentioned in Latest Epstein File Release",
    "url": "https://variety.com/2026/film/news/jay-z-harvey-weinstein-pusha-t-epstein-files-1236647297/",
    "image": "https://variety.com/wp-content/uploads/2026/01/MixCollage-31-Jan-2026-03-02-PM-6672.jpg?crop=15px%2C16px%2C1159px%2C653px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-02-01T00:46:49.000Z",
    "description": "\n\tThe Department of Justice on Friday released 3 million documents from the Jeffrey Epstein files, along with 2,000 videos and roughly 180,000 images.",
    "body": "\n\tThe Department of Justice on Friday released 3 million documents from the Jeffrey Epstein files, along with 2,000 videos and roughly 180,000 images. The latest batch included mention of celebrities like Jay-Z, Pusha T and Harvey Weinstein.\n\n\tMentions of the trio did not come from Epstein’s personal records nor reports corroborated by law enforcement. The two rappers and the disgraced Hollywood mogul were named in a tip to the FBI, which was archived as part of the Epstein investigation. The tip itself does not imply these individuals were investigated, nor does it in any way imply guilt for the accusations posed.\n\t\n\n\tAccording to an FBI crisis intake report included in the latest Epstein release, an anonymous victim, who claimed she had been drugged and sexually abused in several instances throughout the years, said Pusha T (Terrence LeVarr Thornton) was one of her “handlers.” Also in the report, the victim said she once woke up in a room with Weinstein and Jay-Z (Shawn Carter) with her. The report also stated that because the victim was drugged in both scenarios, her memory was clouded.\n\n\n\tReps for Jay-Z and Pusha T did not immediately respond to Variety‘s request for comment. \n\n\tDirector Mira Nair, the mother of New York mayor Zohran Mamdani, was also found in the new release. She was mentioned by name in an email from publicist Peggy Siegal to Epstein. Siegal wrote that she saw Nair at an after-party for the 2009 film “Amelia,” which Nair directed. The email implies no wrongdoing or investigation.\n\n\tA rep for Nair did not immediately respond to Variety‘s request for comment. \n\t\n\n\tMessages between Casey Wasserman, chairman of the LA28 Olympics committee, and Ghislaine Maxwell, who was found guilty of child sex trafficking in connection with Epstein, were also included in the files. In one correspondence, Maxwell offers Wasserman a massage that could “drive a man wild.”\n\n\tIn a statement obtained by Variety, Wasserman said his interactions with Maxwell occurred “over two decades ago” and were “long before her horrific crimes came to light.” He also denied any connection to Epstein.\n\n\tWasserman wrote, “I never had a personal or business relationship with Jeffrey Epstein. As is well documented, I went on a humanitarian trip as part of a delegation with the Clinton Foundation in 2002 on the Epstein plane. I am terribly sorry for having any association with either of them.”\n\n\tAfter a rare, bipartisan push from Congress, President Donald Trump in November signed the Epstein Files Transparency Act into law, which has since brought a surge of previously sealed material on the Epstein investigation into the public eye. Trump has his own complicated past with the late New York financier, but has adamantly denied any knowledge of his criminal behavior. Throughout Trump’s second term, the Epstein files have remained a cultural hot point as well as a political one, referenced on everything from “Saturday Night Live” to “South Park.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jay-Z, Harvey Weinstein and Pusha T Mentioned in Latest Epstein File Release",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/MixCollage-31-Jan-2026-03-02-PM-6672.jpg?crop=15px%2C16px%2C1159px%2C653px&resize=1000%2C563"
      ],
      "datePublished": "2026-02-01T00:46:49.000Z",
      "dateModified": "2026-02-01T00:46:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kenan Thompson Says He ‘Definitely’ Thinks About Leaving ‘SNL’: ‘It’s Gonna Suck’",
    "url": "https://variety.com/2026/tv/news/kenan-thompson-thinks-about-leaving-snl-1236647210/",
    "image": "https://variety.com/wp-content/uploads/2026/01/GettyImages-2239817885.jpg?crop=0px%2C0px%2C3425px%2C1927px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-01-31T21:41:01.000Z",
    "description": "\n\tKenan Thompson recently told People that he “definitely” thinks about leaving “Saturday Night Live” and fears saying goodbye is “gonna suck.” Thomps",
    "body": "\n\tKenan Thompson recently told People that he “definitely” thinks about leaving “Saturday Night Live” and fears saying goodbye is “gonna suck.” Thompson has been on “SNL” since 2003.\n\n\t“There’s just so many layers to it. It’s not just the on-screen that you see in that one, you know, camera shot,” Thompson said. “It’s so many people behind the scenes and years and years and years with each one of those people. So it’s gonna be a lot.”\n\t\n\n\tHe then joked, “I might have to just rip the bandaid and run out the back door and not say nothing to nobody and just write letters.”\n\n\n\tAs “SNL’s” longest tenured cast member, Thompson has seen plenty of his co-stars come and go. He said it is “usually always sad” when someone leaves the show. “SNL” Season 51 saw the departures of several long-time cast members, with the most recent exit being Bowen Yang.\n\n\t“It’s tough for me because I have yet to have the moment,” Thompson said. “You know, if I was on the other side of it, I’d be a little more like, ‘Yeah, you know, it’s all good,’ like, ‘Shake it off’ kind of thing. But, like, I’m dreading the moment. I might collapse in the moment because it’s been so many years and so many relationships and just…”\n\n\tHe continued, “That’s gonna be a drastic change at this point that I never thought, you know, ‘SNL’ would be such a large component in my life. I never thought I’d even get the job in the first place.”\n\n\tBack in May of 2025, Thompson hinted at the major cast shakeup in Season 51. Heidi Gardner, Devon Walker, Michael Longfellow and Emil Wakim all left before the season kicked off, with Yang being the last to leave partway through.\n\t\n\n\t“Especially this year where it feels like there’s maybe, possibly, a lot of change next year,” Thompson told Page Six. “You want everyone to stay forever, knowing that people may be making decisions this summer…it’s always like you want your kids to stay young.”\n\n\tA smattering of fresh faces joined “SNL” for Season 51, including Tommy Brennan, Jeremy Culhane, Kam Patterson and Veronika Slowikowska. Of the new additions, “SNL” mastermind Lorne Michaels told Entertainment Tonight, “Change is good. The people we’re bringing in, I’m really excited about.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kenan Thompson Says He ‘Definitely’ Thinks About Leaving ‘SNL’: ‘It’s Gonna Suck’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/GettyImages-2239817885.jpg?crop=0px%2C0px%2C3425px%2C1927px&resize=1000%2C563"
      ],
      "datePublished": "2026-01-31T21:41:01.000Z",
      "dateModified": "2026-01-31T21:41:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘The Studio’ Cancels Apple TV Press Day Panel After Catherine O’Hara’s Death",
    "url": "https://variety.com/2026/tv/news/the-studio-apple-tv-press-day-catherine-ohara-1236647377/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Catherine-OHara-Seth-Rogen-The-Studio-010625-3-e5a720e49de545b6a1d19f05f98aabaf.jpg?crop=0px%2C70px%2C1500px%2C844px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-02-01T01:43:11.000Z",
    "description": "\n\t“The Studio” has canceled its panel at Apple TV’s upcoming press day after star Catherine O’Hara died on Friday.\n\n\t“The Studio” was just one of the ",
    "body": "\n\t“The Studio” has canceled its panel at Apple TV’s upcoming press day after star Catherine O’Hara died on Friday.\n\n\t“The Studio” was just one of the many scheduled panelists at the Apple TV press day, set for Tuesday at the Barker Hangar in Los Angeles. The streamer announced the cancellation on Friday shortly after O’Hara’s death. According to the program, O’Hara was not slated to attend the panel alongside her scheduled co-stars Seth Rogen, Ike Barinholtz, Kathryn Hahn and Chase Sui Wonders\n\t\n\n\t“We are all heartbroken by the loss of Catherine O’Hara,” Apple and Lionsgate said Friday in a joint statement. “An undeniable legend, icon, and incomparable talent, Catherine elevated every project she was a part of, including the singular genius she brought to her role on ‘The Studio,’ and every transcendent performance she gifted to us. Her artistic accomplishments will forever bring humor, light, and love for generations to come, and her brilliance and generosity of spirit touched everyone around her. We will hold her in our hearts always, and extend our thoughts and deepest sympathies to her husband Bo, and children, Matthew and Luke.”\n\n\n\tO’Hara’s manager announced Friday that the “Home Alone” star had died in her Los Angeles home after a brief illness. She was 71.\n\n\tO’Hara’s prolific comedy career started with the Canadian sketch comedy show “Second City Television” and ended with a late-career renaissance that included “Beetlejuice Beetlejuice,” “Schitt’s Creek” and “The Studio.” After her death, there was an outpour of remembrances and tributes from the Hollywood community.\n\t\n\n\t“Really don’t know what to say… I told O’Hara when I first met her I thought she was the funniest person I’d ever had the pleasure of watching on screen. ‘Home Alone’ was the movie that made me want to make movies,” Rogen, co-creator and star of “The Studio,” wrote on Instagram. “Getting to work with her was a true honour. She was hysterical, kind, intuitive, generous… she made me want to make our show good enough to be worthy of her presence in it. This is just devastating. We’re all lucky we got to live in a world with her in it.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘The Studio’ Cancels Apple TV Press Day Panel After Catherine O’Hara’s Death",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Catherine-OHara-Seth-Rogen-The-Studio-010625-3-e5a720e49de545b6a1d19f05f98aabaf.jpg?crop=0px%2C70px%2C1500px%2C844px&resize=1000%2C563"
      ],
      "datePublished": "2026-02-01T01:43:11.000Z",
      "dateModified": "2026-02-01T01:43:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jane Fonda Speaks Out After Don Lemon’s Arrest: ‘They Arrested the Wrong Don’",
    "url": "https://variety.com/2026/tv/news/jane-fonda-don-lemon-arrest-ice-1236647352/",
    "image": "https://variety.com/wp-content/uploads/2026/01/GettyImages-2254556170.jpg?crop=0px%2C0px%2C4460px%2C2509px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-02-01T01:07:42.000Z",
    "description": "\n\tJane Fonda on Friday spoke out in support of Don Lemon at a rally in Los Angeles after the former CNN anchor was arrested and indicted on charges of",
    "body": "\n\tJane Fonda on Friday spoke out in support of Don Lemon at a rally in Los Angeles after the former CNN anchor was arrested and indicted on charges of interfering with a religious service during a Minnesota ICE protest.\n\n\t“We are not ready to sit and be quiet. We have to speak up,” Fonda said (via TMZ). “Every American who believes in our Constitution has to speak up. Don Lemon is a professional journalist. He and his producer were doing their job, nothing more, nothing less. And he’s been arrested. And they’ll make up all kinds of defamatory things to say about him; that’s what they’re doing. That’s how autocrats act. We can’t fall for it. We have to speak up. When a red line is crossed like this, we cannot be silent.”\n\t\n\n\tShe added, “I know Don Lemon. My husband created CNN, and I will fight for their right to speak, which is guaranteed in our Constitution. They arrested the wrong Don.”\n\n\n\tA judge on Friday afternoon ordered Lemon to be released on his own recognizance. Outside the downtown L.A. courthouse, Lemon declared that his arrest would not hamper his work as an independent journalist.\n\n\t“I have spent my entire career covering the news. I will not stop now,” he said. “I will not stop ever. Last night, the DOJ sent a team of federal agents to arrest me in the middle of the night for something that I have been doing for the last 30 years, and that is covering the news. The First Amendment of the Constitution protects me and countless other journalists who do what I do. I stand with all of them, and I will not be silenced. I look forward to my day in court.”\n\t\n\n\tFonda has long been an advocate for Hollywood’s most politically outspoken. In October of 2025, she relaunched the Committee for the First Amendment. Started by her father, Henry Fonda, the McCarthy-era initiative was designed to protect against attacks on free speech.\n\n\t“The McCarthy Era ended when Americans from across the political spectrum finally came together and stood up for the principles in the Constitution against the forces of repression,” Fonda said at the time. “Those forces have returned. And it is our turn to stand together in defense of our constitutional rights.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jane Fonda Speaks Out After Don Lemon’s Arrest: ‘They Arrested the Wrong Don’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/GettyImages-2254556170.jpg?crop=0px%2C0px%2C4460px%2C2509px&resize=1000%2C563"
      ],
      "datePublished": "2026-02-01T01:07:42.000Z",
      "dateModified": "2026-02-01T01:07:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Steve Martin and Martin Short Pause Comedy Show to Honor Catherine O’Hara: ‘The Greatest, Most Brilliant, Kindest, Sweetest Angel’",
    "url": "https://variety.com/2026/film/news/catherine-ohara-steve-martin-martin-short-1236647281/",
    "image": "https://variety.com/wp-content/uploads/2025/03/catherine-ohara-1.jpg?crop=0px%2C0px%2C791px%2C445px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-01-31T23:29:33.000Z",
    "description": "\n\tSteve Martin and Martin Short paid tribute to the late Catherine O’Hara Friday night, raising a glass to the star during their “The Best of Steve Ma",
    "body": "\n\tSteve Martin and Martin Short paid tribute to the late Catherine O’Hara Friday night, raising a glass to the star during their “The Best of Steve Martin and Martin Short” comedy show in Austin, Texas. \n\n\t“Catherine O’Hara, I met when she was 18 years of age, and all these years later, she has been the greatest, most brilliant, kindest, sweetest angel that any of us worked with,” said Short alongside Martin. “So god bless Catherine,” he added while toasting. \n\t\n\n\tAs the two stood on stage, a large image of the actress was on the screen behind them. The tribute came just hours after O’Hara’s death was announced on Friday. Her agency, CAA, confirmed she died at her home in Los Angeles following a brief illness. She was 71. \n\n\n\tA longtime friend and collaborator, Short first met O’Hara on the Canadian sketch comedy series “Second City Television,” which ran from 1976 to 1984. Martin previously worked with the “Best in Show” and “Schitt’s Creek” actor on the 1994 film “A Simple Twist of Fate,” directed by Gillies MacKinnon. \n\n\tSince O’Hara’s death, a number of stars have shared heartfelt messages.  “Mama. I thought we had time. I wanted more. I wanted to sit in a chair next to you. I heard you but I had so much more to say,” O’Hara’s “Home Alone” co-star Macaulay Culkin wrote on Instagram. “I love you. I’ll see you later.”\n\n\tSeth Rogan, who co-starred with O’Hara on “The Studio,” also shared his thoughts on Instagram. “Really don’t know what to say… I told O’Hara when I first met her I thought she was the funniest person I’d ever had the pleasure of watching on screen. ‘Home Alone’ was the movie that made me want to make movies,” Rogen wrote. “Getting to work with her was a true honour. She was hysterical, kind, intuitive, generous… she made me want to make our show good enough to be worthy of her presence in it. This is just devastating. We’re all lucky we got to live in a world with her in it.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Steve Martin and Martin Short Pause Comedy Show to Honor Catherine O’Hara: ‘The Greatest, Most Brilliant, Kindest, Sweetest Angel’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/03/catherine-ohara-1.jpg?crop=0px%2C0px%2C791px%2C445px&resize=1000%2C563"
      ],
      "datePublished": "2026-01-31T23:29:33.000Z",
      "dateModified": "2026-01-31T23:29:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘The Secret Agent’ Director Kleber Mendonça Filho Praises Oscar Nominee Wagner Moura: ‘Everything Came Together Because of the Main Actor Who Believes in Generosity’",
    "url": "https://variety.com/2026/film/global/the-secret-agent-kleber-mendonca-filho-oscars-wagner-moura-1236647075/",
    "image": "https://variety.com/wp-content/uploads/2025/09/VARIETY-SIZING-1.png?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-31T20:59:47.000Z",
    "description": "\n\t“The Secret Agent” director Kleber Mendonça Filho praised Wagner Moura at Rotterdam Film Festival, calling him a generous star. \n\n\t“Since ‘Neighbori",
    "body": "\n\t“The Secret Agent” director Kleber Mendonça Filho praised Wagner Moura at Rotterdam Film Festival, calling him a generous star. \n\n\t“Since ‘Neighboring Sounds,’ I’ve believed that a film is a great opportunity to show faces. Once you do, you say a lot about the country you come from. Brazil has great faces – we are a mix of many different things and anyone who tries to prove otherwise has a problem. Just this week we had a governor saying the whole state is white. Which is not true.”\n\t\n\n\tHe doesn’t really differ between professional and non-professional actors, he stressed.  \n\n\n\t“They are all great actors!” \n\n\t“‘The Secret Agent’ has 60-plus characters with lines – and an international star. Wagner was very important in making that whole ensemble work. Everything came together because of the main actor who believes in generosity.”\n\n\t“The Secret Agent” scored four Oscar nominations, including Best Picture and Best Actor for Moura. He became the first Brazilian to be nominated in that category. \n\n\t“My films are exactly the films I wanted to make. Some people ask: ‘Are you going to release a director’s cut?’ All my films are director’s cut. They are challenging, however, all of them. It’s like having someone say: ‘Here’s our supermarket, you can have everything for free but you have two minutes.’ We shot ‘The Secret Agent’ like maniacs.” \n\n\tDuring Rotterdam’s Big Talk, Mendonça Filho discussed his love for cinema with Spanish filmmaker Carla Simón (“Romería”). \n\n\t“I grew up in the countryside, so we didn’t watch many films. Then I discovered that cartoons weren’t actually real, which was very disappointing. I member how it affected me. It was like finding out Santa doesn’t exist,” recalled Simón.\n\t\n\n\tMendonça Filho “was always very curious about films,” he said. \n\n\t“My mother was a cinephile. I was lucky. She kept telling me about a Hitchcock film she had seen. She couldn’t remember the title, but she said it was about a woman going up the stairs and falling. It was only many years later that I realized it was ‘Vertigo.’ It was one of my earliest memories,” he said. \n\n\t“That and a ‘Tom & Jerry’ marathon – officially my first trip to the cinema.”\n\n\tThey both like to focus on families and their complicated dynamics in their work – as well as very young protagonists. \n\n\t“I’m fascinated by children and by trying to capture them with a camera. It should feel life-like and natural, which is tricky. Some films have children play in situations that are unnatural, I think,” said Mendonça Filho.\n\n\t“You don’t choose your family,” said Simón. “You do what you can. Raising a child is so hard. They have this amazing ability to discover the world for the first time. Now that I have a child, too, I see how they accept the mystery of life. Just like an audience that’s open to discovering a universe [in a cinema]. It’s a very similar experience.”\n\n\tAlthough “children never give you two takes,” they make adults actors better. \n\n\t“They are more in the moment,” she claimed.\n\n\t“When we made ‘The Secret Agent,’ we looked for kids and some of them were trained, I thought, at the Influencer School of Acting in Front of the Camera. I found it so disturbing to see them already changed like that,” added Mendonça Filho.  \n\n\tSimón recalled: “Once, during a casting, one girl saw another [leaving a room] and told me: ‘This girl is my enemy.’ Wow. And she was seven or eight years old! So I try not to work with children from agencies.” \n\n\tThey’re both connected to the places they come from, they agreed.\n\n\t“It deeply marks who you are: our space, its history and context. Everything intimate is very political,” noted Simón. “I always get this question: ‘Why in Catalan?’ Because it’s my language.”\n\n\t“I come from a city [Recife] that’s well-established culturally, but the actors still go away to [find] work. They go through a special treatment to lose their accent, which is so 40 years ago,” added Mendonça Filho. Things are slowly changing, however. “I am very much for authentic speaking.”\n\t\n\n\t“In the old days, cinema was so theatrical. Marilyn Monroe could play a British character, which is a crazy example. At the end of the day, I like to mix extreme realism with extreme cinema.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘The Secret Agent’ Director Kleber Mendonça Filho Praises Oscar Nominee Wagner Moura: ‘Everything Came Together Because of the Main Actor Who Believes in Generosity’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/09/VARIETY-SIZING-1.png?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-31T20:59:47.000Z",
      "dateModified": "2026-01-31T20:59:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘The Last Resort’ by Maria Sødahl Named Best Nordic Film at Göteborg: ‘Pitch-Perfect Performances and a Razor-Sharp Script’",
    "url": "https://variety.com/2026/film/global/the-last-resort-maria-sodahl-best-nordic-film-goteborg-1236647034/",
    "image": "https://variety.com/wp-content/uploads/2026/01/The-winners-at-the-2026-Goteborg-Film-Festival.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-31T22:31:46.000Z",
    "description": "\n\t“The Last Resort,” directed by Maria Sødahl, won the Dragon Award for Best Nordic Film at the Göteborg Film Festival on Saturday night.\n\n\tThe award ",
    "body": "\n\t“The Last Resort,” directed by Maria Sødahl, won the Dragon Award for Best Nordic Film at the Göteborg Film Festival on Saturday night.\n\n\tThe award comes with a whooping SEK 400,000 ($41,500) which, according to the organizers, makes it one of the world’s largest film prizes. \n\n\tThe jurors argued that Sødahl’s film, which is about a family who expects an exotic vacation but instead comes face-to-face with the harsh realities of a refugee crisis, “shows how the callousness bred by habitual cruelty diminishes us all, hollowing out our relationships – even with our partners and children.”\n\t\n\n\tThe jury, headed by “The Act of Killing” director Joshua Oppenheimer and including Fabrice Aragno, Lia Boysen, Sanna Lenken, and Gergely Pálos, added: “With pitch-perfect performances, a razor-sharp yet nuanced script, and not a trace of sentimentality, the film is a mirror in which we see ourselves with devastating clarity. If we refuse to confront our own complicity in the cruelty unfolding around us right now, the love we claim to live by cannot save us – because the compassion that underpins it is conditional.”\n\n\n\tThe film is sold by TrustNordisk. Sødahl, who’s Norwegian, previously directed Stellan Skarsgård and Andrea Bræin Hovig in well-received “Hope,” based on a personal story. \n\n\t“My previous films are shamelessly autobiographical,” Sødahl told Variety, arguing that her latest opens up to a “more complex universe.” \n\n\t“[It’s] a story where our Scandinavian protagonists start out as diplomatic humanists, until xenophobia leads them to act with primal violence and paranoia. The suspense is strong, and the gaze is unsentimental, in a story about us, for us and by us.”\n\t\n\n\tSweden’s Adam Lundgren – recently spotted in the arthouse hit “The Ugly Stepsister” – won a gender-neutral Best Acting award for “The Quiet Beekeeper,” which also opened the fest. \n\n\tThe jurors called it a “courageous, melancholic portrait of a life illuminated by longing and shadowed by loss – in which the unspoken carries more weight than words. When vulnerability finally dissolves the quiet façade, we are offered a delicate yet profound catharsis: love, and grief.”\n\n\tThe film also resonated with the viewers, claiming the Audience Award. \n\n\tEmilie Thalund’s “Weightless” won the Fipresci Award and the Sven Nykvist Cinematography Award for Louise McLaughlin. Meanwhile, Iván Blanco’s “Malandro Moon” won Best Nordic Documentary. \n\n\tDuring the event, the festival also spotlighted Noomi Rapace, who picked up the Nordic Honorary Dragon Award, and Polish director Agnieszka Holland (Honorary Dragon Award).  \n\n\tRapace dedicated the award to her son. “This award is so much bigger than me. There’re so many people behind me: My teachers, my mentors, the people around me,” she said during the ceremony. \n\n\t“I can’t speak about everyone, so I decided to speak about one person today: my son Lev, who has been my closest witness and my truth-teller. Who has grounded me and guided me, and who has been the person I learnt from the most. He always holds me accountable, makes me want to be braver and go further.”\n\n\tYou can find a full list of awards here:\n\n\tDragon Award Best Nordic Film\n\n\t“The Last Resort” by Maria Sødahl\n\n\tDragon Award Best Acting \n\n\tAdam Lundgren for “The Quiet Beekeeper”\n\n\tSven Nykvist Cinematography Award\n\n\tLouise McLaughlin for “Weightless”\n\n\tFIPRESCI Award\n\n\t“Weightless” by Emilie Thalund\n\n\tAudience Dragon Award Best Nordic Film\n\n\t“The Quiet Beekeeper” by Marcus Carlsson\n\n\tDragon Award Best Nordic Documentary\n\n\t“Malandro Moon” by Iván Blanco\n\n\tThe Ingmar Bergman Debut Award\n\n\t“Bouchra” by Meriem Bennani and Orian Barki\n\n\tDragon Award Best International Film\n\n\t“Calle Malaga” by Maryam Touzani\n\n\tYouth Jury Dragon Award \n\n\t“My Father’s Shadow” by Akinola Davies Jr.\n\n\tDraken Film Award \n\t\n\n\t“Uncle Ali and I” by Shahab Mehrabi\n\n\tHonorary Dragon Award \n\n\tAgnieszka Holland \n\n\tNordic Honorary Dragon Award \n\n\tNoomi Rapace \n\n\tStartsladden – Best Swedish Short\n\n\t“All That Remains of Me” by Christer Wahlberg \n\n\tStartsladden Cinematography Award \n\n\tChristine Leuhusen for “Without Kelly” \n\n\tStartsladden – Audience Award \n\n\t“All That Remains of Me”\n\n\tThe Church of Sweden Angelos Film Award\n\n\t“The Patron” by Julia Thelin. \n\n\tThe Nordic Series Script Award \n\n\tIngeborg Topsøe, writer of “Secrets We Keep”\n\n\tCreative Courage Award\n\n\t“Blood Cruise,” produced by Alexander Rönnberg from Northern Fableand and Will Tennant from Imaginarium Productions and commissioned by Johanna Gårdare and Sonja Nilsson Hermele from SVT.\n\n\tNordic Film Market Awards\n\n\t“Out of Athens” by Badrudin Ga’ur\n\n\t“Chentian” by Suha Arraf\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘The Last Resort’ by Maria Sødahl Named Best Nordic Film at Göteborg: ‘Pitch-Perfect Performances and a Razor-Sharp Script’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/The-winners-at-the-2026-Goteborg-Film-Festival.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-31T22:31:46.000Z",
      "dateModified": "2026-01-31T22:31:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Top Latin America Fest Guadalajara Goes to Berlin With Best of Fest Hits From Mexico’s ‘Amelie’ to Diego Luna Passion Project, the Standout ‘State of Silence’",
    "url": "https://variety.com/2026/film/global/guadalajara-festival-corina-state-of-silence-1236647195/",
    "image": "https://variety.com/wp-content/uploads/2025/03/corina-review.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-31T21:19:12.000Z",
    "description": "\n\tTo celebrate 40 years, Mexico’s Guadalajara Film Festival, based out of Mexico’s second biggest city and Guillermo del Toro’s home town, is doing wh",
    "body": "\n\tTo celebrate 40 years, Mexico’s Guadalajara Film Festival, based out of Mexico’s second biggest city and Guillermo del Toro’s home town, is doing what it has always done: taking Mexican films and talent, especially new voices, to the world. \n\n\tIn its latest initiative, Berlin’s legendary Kino Babylon will host a showcase of recent notable titles from the Guadalajara Festival, FICG in popular parlance, and headed from 2019 by Estrella Araiza.\n\t\n\n\tRunning Jan. 30-Feb. 8, the FICG Goes to Berlin showcase will unspool as the Festival gears up for its 2026 edition, taking place April 17-25. The Kino Babylon, opened in 1929 and still going strong despite vicissitudes, is an appropriate venue for Guadalajara’s 40th anniversary showcase. \n\n\n\tLaunched in 1986, and focusing on films from Mexico and beyond it, the rest of Latin America, Spain and Portugal,  the festival had seen good times and bad in state funding and survived COVID-19 to consolidate, hitting 40 as one of, if not the biggest of film festivals in Latin American, with a 2025 attendance figure for its 40th edition,  including all activities, of 289,777, according to Araiza’s final count. Only Brazil’s Rio Film Festival may come close to that popular impact. \n\n\tAn industry pioneer, now set to stage its 22nd edition of its Co-Production Meeting and 20th Guadalajara Construye pix-in-post showcase in 2026, Guadalajara welcomed 1,473 industry participants to a 2025 program which also took in TV focused Episodio Cero, a DocuLab, a local talent-focused Pitch Guadalajara and Talents Guadalajara, a Talent Project Market and a vid-game-themed FICGames Playtest. \n\t\n\n\n\n\t\n\n\t\t\t\t\tEstrella Araiza, director, the Guadalajara Film Festival\n\t\t\t\t\t\t\t\t\tCourtesy of FICG\n\t\n\n\n\n\tFICG Goes to Berlin: 10 Highlights from the Lineup\n\n\tNot only a celebration, FICG Goes to Berlin also marks part of festivals’ transformation from one-off events to round-the-year culture and entertainment business drivers. The event takes in 18 fiction features and 9 doc-features. Below, Variety takes a closer look at 10 bound for Berlin which were Guadalajara highlights in its 2024 and 2025 editions. \n\n\tThe 10 and the FICG Goes to Berlin showcase at large also says a lot about current Mexican cinema. \n\n\tOf Variety’s choices, some titles and directors have a higher profile. One case in point: Produced by Diego Luna (“Ardor”), “State of Silence,” the fourth doc feature by Mexico’s Santiago Maza (“The Thunder Feast”) world premiered at Tribeca and was picked up by Netflix for North and Latin America.  \n\n\tLikewise, “Rock, Weeds and Rocanrol” marks the latest from one of Mexico’s greatest mavericks, José Manuel Cravioto, a “Diablero ” showrunner and director on “El Chapo” and Alex Pina’s “Billionaires’ Bunker.” “Corina” was a global 2025 SXSW Audience Award winner, then nominated for eight Mexican Academy Ariel Awards. \n\n\tOf the other eight films in Variety’s selection, six are first solo feature debuts, reflecting Guadalajara’s status as a key platform for the exhibition and international promotion of new voices. \n\n\tSome major titles in FICG Goes to Berlin carry large social point. “State of Silence” begins, for example, by pointing up the appalling death count among journalists in Mexico and delivers a memorable homage to those who continue to put their lives on the line. \n\n\t“Rock, Weeds and Rocanrol” nails the unbending conservatism of Mexico’s establishment. FICG Goes to Berlin takes in, however, a broad spread of features, running a gamut from the auteurist and LGBTQ (“After”) to a crossover love story (“Café Chainel”).\n\n\tAbove all, as the world goes to pot, many of FICG Goes to Berlin titles explore bedrock relations, of father and son or mother and son, for instance. “I was keen to highlight the love between father and son with the hope that their story would reflect our own aspirations and inspire us to believe that we too can realize our dreams,” says Pourailly of “The Fabulous Gold Harvesting Machine.”\n\t\n\n\tDepicting such profound bonds, film can of course stir powerful emotions. Expect, for example, that there will be very few dry eyes in the house when “Concert For Other Hands,” a father-son story, plays at Berlin’s Kino Babylon.\n\n\tVariety’s take on just 10 of the films playing at FICG Goes to Berlin:\n\n\t“After,” (“Después,” Sofia Gomez Cordova, Mexico)\n\n\tAfter the death at 20 of her son, quite possibly a suicide, Carmen, has to accept that their relationship, however deep, still had its hidden secrets, as a future opens up of self-discovery. “A reflection on motherhood when social precepts on gender roles, love relationships ad sexuality are transforming,” Gómez Córdova has said of the film. Produced by Guadalajara’s Bruja Azul. \n\n\t“Café Chairel,” (Fernando Barreda Luna, Mexico)\n\n\tStarring “After Lucía’s” Tessa la, a second chance romantic drama set in the picturesque port of Tampico, as Alfonso (Maurice Isaac) and Katia (la), both suffering deep loss, launch a café and haltingly awaken to life. The second feature as a director of Barreda Luna, produced by his label Nopal Army Films (“Crocodiles”).\n\n\t“Concert for Other Hands,” (“Concerto para otras manos,” Ernesto González Díaz, 2024, Mexico)\n\n\t“It’s what every father desires – for your tastes, passions to be shared by a son,” classical pianist José Luis says in “Concert for Other Hands.” But son David is born with a short arm and a hand with four fingers. Remarkably, he sets out to play in public a concerto for piano and orchestra composed for him by José Luis. A modest but touching father-son relationship doc-feature from González Díaz (“Escucha”) which received the 2025 Mexican Cinema Journalists’ best documentary award. \n\n\t“Corina,” (Urzula Barba Hopfner, Mexico) \n\n\t“A refreshingly endearing, surprisingly incisive defence of happy endings that plays like a Mexican ‘Amélie,’” says Variety, with “Ted Lasso” actor Cristo Fernández co-starring in a stylized dramedy about a 20 year-old who’s never ventured from her close neighbourhood until she sets out to find a writer who could save her job, and her colleagues’, at a local publishing house. Lead produced by Mandarina Cine, also behind “Nudo Mixteco” and Berlinale Perspectives winner “The Devil Smokes.”\n\t\n\n\t“The Fabulous Gold Harvesting Machine,”(“La fabulosa máquina de cosechar oro,” Alfredo Pourailly, Chile, Netherlands)\n\n\tA top winner at Guadalajara, Sanfic and Lima in 2024, the story of charismatic artisanal gold miner Toto whose devoted son is building a gold harvesting machine – virtually on his own – to help his ailing father. Their poignant expressions of relief at the  end when they finally get the machine up and running are worth their weight in gold. From Chile’s ambitious Juntos Films.  \n\n\t“The Mollusk,” (“Molusco,” Mauricio Bidault, Mexico)\n\n\tBidault’s latest documentary and third feature. It chronicles the life and times of storied Mexican graphic artist José Ignacio Solórzano, known professionally as Jis, who shot to fame, Variety recalls, with “El Santos,” “a collection of whacked-out narratives that featured graphic sex, drugs and quotidian minutiae.” Jis stars but talking heads include Guillermo del Toro and Diego Luna. \n\n\t“Rock, Weeds and Rocanrol,” (“Autos, Mota y Rocanrol,” José Manuel Cravioto), Mexico \n\n\tA ‘70s set mockumentary based on true facts: How el Negro and Justino set out to organize a car race which balloons into Mexico’s Woodstock, attended by 150,000 revellers. Mexico’s blow-hards had a field day, one lambasting “a hell of naked depravity, blood, potheads and death.” Its government cracked down on rock ’n’ roll, which took a decade to recover.\n\n\n\n\t\n\n\t\t\t\t\t‘Rock, Weeds and Rocanrol’ Courtesy of José Manuel Cravioto\n\t\n\n\n\n\t “State of Silence,” (“Estado de silencio,” Santiago Maza, Mexico)\n\n\tA recent standout from Mexico by any standard. What sets “State of Silence” apart is its sense of intimacy as its follows the lives of four journalists who refuse to be silent about Mexico’s crux: the toxic mix of organized crime syndicates and local governments, or narco-politics. Fast-paced in its interviews, “State of Silence” achieves an aesthetic cinematographic finish with the idea of ennobling the extraordinary courage of journalists portrayed, Maza explained to Variety.   \n\n\n\n\t\n\n\t\t\t\t\tState of Silence\n\t\t\t\t\t\t\t\t\tCourtesy: La Corriente del Golfo\n\t\n\n\n\n\t“Twelve Moons,” (“Doce Lunas,” Victoria Franco)\n\n\tA 2025 Tribeca International Narrative Competition entry, led by Ana de la Reguera (“Ana,” “Nacho Libre” ), star of Ariel Winograd’s Mexican B.O, breakout “Una Pequeña Confusion.” Here, she plays playing Sofía, 40, an architect in emotional freefall after a loss, battling infertility and ever spiralling addiction. Shot in b/w by director Victoria Franco and ace DP Sergio Armstrong (“Neruda”), Franco’s solo debut after helming with brother Michel Franco 2013’s “Through the Eyes.” “Twelve Moons” is produced by Michel Franco, sold by The Match Factory. \n\t\n\n\t“We Shall Not Be Moved,” (“No nos moverán,” Pierre Saint-Martin, Mexico)\n\n\tMexico’s 2026 Oscar entry and hailed by Variety as an “auspicious” debut, “a scorching chamber piece about the country’s unhealed wounds.” It stars veteran actress Luisa Huertas as a now aged lawyer Soccoro seeking extrajudicial revenge decades after her brother is murdered during the 1968 Tlatelolco student massacre. “Tightly conceived,” says Variety, and produced by Mexico’s Varios Lobos (“Tragic Jungle,” “The Darkness”).  \n\n\n\n\t\n\n\t\t\t\t\tWe Shall Not Be Moved\n\t\t\t\t\t\t\t\t\tCourtesy of Varios Lobos\n\t\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Top Latin America Fest Guadalajara Goes to Berlin With Best of Fest Hits From Mexico’s ‘Amelie’ to Diego Luna Passion Project, the Standout ‘State of Silence’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/03/corina-review.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-31T21:19:12.000Z",
      "dateModified": "2026-01-31T21:19:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Guess Who This Suited-Up Star Is!",
    "url": "https://www.tmz.com/2026/01/31/guess-who-suited-up-star/",
    "image": "https://imagez.tmz.com/image/44/16by9/2026/01/27/44053f97529441b6978df2b5420c8cc3_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-01T00:00:13.000Z",
    "description": "\n    \n                    \n                          Guess This\n                          Suited-Up Star!\n                      \n                  \n  ",
    "body": "\n    \n                    \n                          Guess This\n                          Suited-Up Star!\n                      \n                  \n                                                                        Published \n                              January 31, 2026\n                            4:00 PM PST\n                                                                            \n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          Lots of stars out there really take pride in their appearance ... can you guess who this suited-up star is?\n      \n    \n          We ran into this singer all the way back in 2015, and we tried to get a word in with him ... but he was already busy hanging out with his adoring fans!\n      \n    \n          Still, he managed to look flawlessly fly the whole time -- despite not necessarily having a tie to go with his suit ... which seems like something that'd be good to write a song about!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Pop Music\n              \n                          \n                Guess Who\n              \n                          \n                Music\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Guess Who This Suited-Up Star Is!",
      "image": [
        "https://imagez.tmz.com/image/44/16by9/2026/01/27/44053f97529441b6978df2b5420c8cc3_xl.jpg"
      ],
      "datePublished": "2026-02-01T00:00:13.000Z",
      "dateModified": "2026-02-01T00:00:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Brooke Monk Hot Shots to Celebrate Her 23rd Birthday",
    "url": "https://www.tmz.com/2026/01/31/brooke-monk-birthday-hot-shots/",
    "image": "https://imagez.tmz.com/image/e5/16by9/2026/01/27/e5dd0572aa034d90b5b754565cbf7015_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-31T20:00:04.000Z",
    "description": "\n    \n                    \n                          Slay, Queen!\n                          Brooke Monk's Hottest Shots\n                          To C",
    "body": "\n    \n                    \n                          Slay, Queen!\n                          Brooke Monk's Hottest Shots\n                          To Celebrate Her 23rd Birthday!\n                      \n      \n    \n      \n        \n              \n    \n    \n          It's TikTok influencer Brooke Monk's 23rd birthday weekend!\n      \n    \n          Brooke has been sharing plenty of hot shots throughout her career as a social media powerhouse ... so we're sharing some of our favorites to mark her special day!\n      \n    \n          Just remember to pinch yourself every now and then as a reminder -- no, you're not dreaming!\n      \n      \n      \n          \n            \n              \n                \n                Share on Facebook\n              \n            \n            \n              \n                \n                Share on X\n              \n            \n                          \n                \n                  \n                \n              \n                      \n        \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Hotties & Bodies\n              \n                          \n                Birthdays\n              \n                          \n                Photo Galleries\n              \n                          \n                Influencers\n              \n                      \n        \n          \n  ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Brooke Monk Hot Shots to Celebrate Her 23rd Birthday",
      "image": [
        "https://imagez.tmz.com/image/e5/16by9/2026/01/27/e5dd0572aa034d90b5b754565cbf7015_xl.jpg"
      ],
      "datePublished": "2026-01-31T20:00:04.000Z",
      "dateModified": "2026-01-31T20:00:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Snoop Dogg's 10-Month-Old Granddaughter Codi Dies",
    "url": "https://www.tmz.com/2026/01/31/snoop-doggs-infant-granddaughter-dies/",
    "image": "https://imagez.tmz.com/image/c8/16by9/2026/02/01/c89c776d464545f5b7c527ed0fa1b869_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-01T00:40:42.000Z",
    "description": "\n    \n                    \n                          Snoop Dogg\n                          Daughter Cori Announces Death of Her 10-Month-Old Daughter\n ",
    "body": "\n    \n                    \n                          Snoop Dogg\n                          Daughter Cori Announces Death of Her 10-Month-Old Daughter\n                      \n                  \n                                                                        Published \n                              January 31, 2026\n                            4:40 PM PST\n                                                                      |\n                                                                Updated \n                                  January 31, 2026\n                                5:21 PM PST\n                                    \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Snoop Dogg's 10-month-old granddaughter Codi has passed away ... this according to his only daughter, Cori Broadus.\n      \n    \n          Cori announced the news Saturday afternoon ... sharing a black-and-white photo where she's grinning and lovingly holding Codi in her arms.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          She writes that Codi -- the \"love of her life\" -- passed away Monday ... adding an angel wing emoji to the post.\n      \n\n          Codi was born three months premature, Broadus revealed in February of last year ... and Codi spent most of the next 10 months in the neonatal intensive care unit or NICU.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          However, just three weeks ago, Broadus shared a photo of her and Codi at relaxing in bed together ... telling her followers God heard all their prayers.\n      \n    \n          Codi's father, Wayne Deuce, also shared a heartfelt tribute to his daughter ... writing on social media that he will always be with her.\n      \n    \n          RIP\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Snoop Dogg\n              \n                          \n                RIP\n              \n                          \n                Family\n              \n                          \n                Hip Hop\n              \n                          \n                celebrity kids\n              \n                          \n                Music\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Snoop Dogg's 10-Month-Old Granddaughter Codi Dies",
      "image": [
        "https://imagez.tmz.com/image/c8/16by9/2026/02/01/c89c776d464545f5b7c527ed0fa1b869_xl.jpg"
      ],
      "datePublished": "2026-02-01T00:40:42.000Z",
      "dateModified": "2026-02-01T00:40:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bella Hadid Filmed Dancing with Adan Banuelos Hours Before His Arrest",
    "url": "https://www.tmz.com/2026/01/31/bella-hadid-dancing-adan-banuelos-before-arrest/",
    "image": "https://imagez.tmz.com/image/ae/16by9/2026/01/31/aec614faaa37416b8c8b2a49f26957f5_xl.png",
    "tag": "Entertainment",
    "date": "2026-01-31T23:27:53.000Z",
    "description": "\n    \n                    \n                          Bella Hadid & Adan Banuelos\n                          Dance All Over Breakup Rumors Before Adan's",
    "body": "\n    \n                    \n                          Bella Hadid & Adan Banuelos\n                          Dance All Over Breakup Rumors Before Adan's Arrest!!!\n                      \n                  \n                                                                        Published \n                              \n                January 31, 2026\n                \n                            3:27 PM PST\n                                                                      |\n                                                                Updated \n                                  January 31, 2026\n                                4:55 PM PST\n                                    \n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          Bella Hadid and Adan Banuelos might not be totally through like early reports indicated ... because video captures the two cutting a rug in a Texas bar -- just hours before Banuelos was arrested.\n      \n    \n          We've obtained exclusive video from a bar in Weatherford, TX from Friday night ... which shows the model and the cowboy slow dancing in the little Western-themed spot -- before Adan sweetly nuzzles his face into her neck.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Banuelos then pulls off a series of fancy moves ... spinning Hadid all around him and finishing it off by pulling her into a sweet embrace.\n      \n\n          While the two are just dancing in this clip, eyewitnesses tell us they were at the locale for about an hour or an hour and a half before they grabbed food to go ... totally acting like a couple while at the bar.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          We're told the lovebirds were holding hands and kissing, on top of chatting and dancing ...  though none of that was captured by cameras.\n      \n    \n          Worth noting ... the two aren't out of control in this clip -- and we're told they only had a drink or two at the bar, which makes you wonder how Adan ended up getting picked up by police for public intoxication mere hours later.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          We broke the story ... Adan was arrested and booked into Parker County Jail early Saturday morning -- though he bonded out after paying a pretty minor $386 fee.\n      \n    \n          Reports came out earlier this week that Bella and Adan were through ... with a source telling Entertainment Tonight Bella was \"doing her best to stay positive and distract herself.\"\n      \n    \n          We've reached out to Bella and Adan's teams for clarification on their relationship status.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Bella Hadid\n              \n                          \n                Breakups\n              \n                          \n                Arrests\n              \n                          \n                TMZ Sports\n              \n                          \n                Couples\n              \n                          \n                Exclusive\n              \n                          \n                Models\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bella Hadid Filmed Dancing with Adan Banuelos Hours Before His Arrest",
      "image": [
        "https://imagez.tmz.com/image/ae/16by9/2026/01/31/aec614faaa37416b8c8b2a49f26957f5_xl.png"
      ],
      "datePublished": "2026-01-31T23:27:53.000Z",
      "dateModified": "2026-01-31T23:27:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'Melania' Director Brett Ratner Pictured on Couch with Jeffrey Epstein & Women",
    "url": "https://www.tmz.com/2026/01/31/brett-ratner-with-epstein-women-photos-files/",
    "image": "https://imagez.tmz.com/image/5e/16by9/2026/01/31/5e530a5666744f6a8103c7b570453925_xl.png",
    "tag": "Entertainment",
    "date": "2026-01-31T22:53:53.000Z",
    "description": "\n    \n                    \n                          Jeffrey Epstein Files\n                          'Melania' Director Brett Ratner Spoons Woman on C",
    "body": "\n    \n                    \n                          Jeffrey Epstein Files\n                          'Melania' Director Brett Ratner Spoons Woman on Couch With Epstein\n                      \n                  \n                                                                        Published \n                              \n                January 31, 2026\n                \n                            2:53 PM PST\n                                                                      |\n                                                                Updated \n                                  January 31, 2026\n                                4:53 PM PST\n                                    \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Brett Ratner makes an appearance in the latest dump of the infamous Epstein Files ... sitting next to Jeffrey Epstein and two redacted women in newly released photos.\n      \n    \n          The director -- who helmed the new documentary \"Melania\" about First Lady Melania Trump -- wears a white shirt in the photo and leans in close to a woman sitting next to him.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          His arms are wrapped around the youthful woman's waist from behind ... and she's leaning into Epstein, who has another woman to his right.\n      \n\n          There isn't much context for these photos ... we don't know when they were taken or who the two redacted women are, and Ratner isn't being accused of any wrongdoing in the files regarding these women -- but their release comes at the end of a fraught week for Ratner.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          ICYMI ... film production sources told Rolling Stone about the \"chaos\" surrounding the making of \"Melania\" -- with many specifically referring to Ratner's behavior.\n      \n    \n          The movie itself is getting strangely mixed reviews ... with critics absolutely savaging the film -- while audiences are applauding it for its patriotism.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          \"Melania\" is Ratner's first big production since several women made allegations of sexual misconduct against him in 2017.\n      \n    \n          We've reached out to Ratner for comments about the photos ... so far, no word back.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Jeffrey Epstein\n              \n                          \n                Brett Ratner\n              \n                          \n                Donald Trump\n              \n                          \n                Melania Trump\n              \n                          \n                Movies\n              \n                          \n                Politics\n              \n                          \n                Fairly Legal\n              \n                          \n                News\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Melania' Director Brett Ratner Pictured on Couch with Jeffrey Epstein & Women",
      "image": [
        "https://imagez.tmz.com/image/5e/16by9/2026/01/31/5e530a5666744f6a8103c7b570453925_xl.png"
      ],
      "datePublished": "2026-01-31T22:53:53.000Z",
      "dateModified": "2026-01-31T22:53:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]