[
  {
    "title": "Doha Film Institute, La Fémis, and Gobelins Team Up on New Training Pipeline: ‘Catalysts for Creativity Across Our Region’",
    "url": "https://variety.com/2025/film/global/doha-film-institute-la-femis-gobelins-vocational-training-1236594276/",
    "image": "https://variety.com/wp-content/uploads/2025/11/Gobelins.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-27T19:24:33.000Z",
    "description": "\n\tThe Doha Film Institute is expanding its footprint as one of the Arab world’s most active talent incubators with new vocational training programs de",
    "body": "\n\tThe Doha Film Institute is expanding its footprint as one of the Arab world’s most active talent incubators with new vocational training programs developed in partnership with France’s prestigious film school, La Fémis, and Gobelins Paris, the country’s leading animation school. The initiative, announced on Nov. 26 during the Doha Film Festival, marks one of DFI’s most ambitious education pushes to date, aimed at fast-tracking the next wave of creatives across the region.\n\t\n\n\tBacked by the Institut Français du Qatar and Qatar Museums, the programs represent DFI’s long-term strategy and investment in expanding access to industry-ready training as the demand for skilled crew, animators, and content creators is surging, particularly across the Gulf. The launch also arrives as Qatar positions itself as a growing creative hub, investing heavily in both production capacity and infrastructure.\n\n\n\t“Vocational training represents the future of learning,” said DFI CEO Fatma Hassan Alremaihi. “In a fast-changing world, we must empower young people with education that is practical, adaptable, and connected to real opportunities. Our partnerships with La Fémis and Gobelins Paris add to our year-round workshops and mentoring sessions that have helped build a thriving creative ecosystem in Qatar and the wider region.”\n\n\tThe La Fémis Cinematography Certificate Program, set for a June 2026 launch, will deliver a four-month, hands-on training course blending theory, exercises, and both online and in-person sessions. Designed to give participants a solid foundation in the creative and technical responsibilities of a director of photography, the program aims to give emerging cinematographers the industry-facing skills needed to compete on global productions.\n\t\n\n\tGobelins will lead a nine-month Animation Certificate Program, beginning in September 2026, structured around three modules in animation fundamentals, character performance, and visual storytelling. With a mix of lectures, practical workshops in Doha, and continuous online follow-up, each module culminates in a completed project, and graduates receive a Gobelins Certificate of Achievement. The program is also designed to complement DFI’s existing ToonBoom certification, creating a more complete training pipeline for regional animators.\n\n\tThe move underscores DFI’s strategy of pairing local talent development with global partnerships, a model the institute has leaned on across its labs, fellowships, and festival initiatives over 15 years. The new vocational tracks, which emphasize mentorship and real-world application, further signal an investment in building sustainable creative industries rather than short-term workshops alone.\n\n\tBy embedding internationally recognized schools directly into Qatar’s training landscape, the institute is looking to create not just access, but a pathway from introductory courses to specialized professional training, without requiring young creatives to leave the region.\n\n\t“Our focus is on placing skills, creativity, and hands-on experience at the heart of how we prepare the next generation of storytellers,” Alremaihi insisted. “These programs are pathways into the industry, bridges to global networks, and catalysts for creativity across our region.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Doha Film Institute, La Fémis, and Gobelins Team Up on New Training Pipeline: ‘Catalysts for Creativity Across Our Region’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/Gobelins.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-27T19:24:33.000Z",
      "dateModified": "2025-11-27T19:24:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "From Blind Boxes to Action Figures, ‘Zootopia 2’ Toys Selling Quickly Online on Heels of Film’s Big Box Office Debut",
    "url": "https://variety.com/2025/shopping/news/shop-best-zootopia-2-toys-books-merch-gifts-buy-online-1236594261/",
    "image": "https://variety.com/wp-content/uploads/2025/11/buy-zootopia-2-toys.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-27T19:49:53.000Z",
    "description": "\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.\n\n\tDisney’s ",
    "body": "\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.\n\n\tDisney’s “Zootopia 2” is trampling all competitors at the box office, with the animated sequel besting even “Wicked: For Good’s” massive opening weekend. \n\n\tThe new film follows the police duo of rabbit Judy Hopps (Ginnifer Goodwin) and red fox Nick Wilde (Jason Bateman) as they go undercover to track Zootopia’s mysterious new villain, Gary De’Snake (voiced by Ke Huy Quan). A sequel to 2016’s “Zootopia,” the latest film is not only a hit at the box office, it’s also led to a bonanza at booksellers and retailers online, as families scramble to pick up official “Zootopia 2” merch, toys and gifts ahead of the holidays.\n\n\n\tFrom action figures to plush toys and even a Labubu-style blind box, here’s a look at some of the “Zootopia 2” merch available to buy online now. You’ll want to add your items to cart soon as many of these products are selling quickly, amidst the Black Friday rush.\n\n\t\t\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\t\t\n\n\t\t\t\t\tDisney Zootopia 2 Little Golden Book\t\t\n\n\t\n\t\tA 24-page picture book retelling of the animated feature film, this is the latest release from the Little Golden Book entertainment series, which has featured everyone from Lady Gaga to Taylor Swift in the past.\t\n\t\t\n\t\n\n\t\t\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\t\t\n\n\t\t\t\t\tThe New Adventures Of Zootopia 2 Vol. 1: Better Zoogether\t\t\n\n\t\n\t\tThis 88-page hardcover graphic novel is designed for readers ages 7-12\t\n\t\t\n\t\n\n\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\t\t\n\n\t\t\t\t\tDisney Zootopia 2 Illustrated Characters and Logo T-Shirt\t\t\n\n\t\n\t\tThis officially-licensed movie T-shirt is available in more than a dozen colors and kids and adults sizes XS to 6X. Amazon says hundreds of shoppers have picked up this shirt in the last few weeks alone.\t\n\t\t\n\t\n\n\t\t\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\t\t\n\n\t\t\t\t\tDisney’s Zootopia 2 Adventure Five-Pack\t\t\n\n\t\n\t\tGet the official “Zootopia 2” collectibles in this boxed set, which features the main characters of the film as three-inch figurines.\t\n\t\t\n\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\t\t\n\t\t\n\n\t\t\t\t\tDisney Zootopia 2 Mystery Tails 5-Pack Mini Plush\t\t\n\n\t\n\t\tThe set includes three-inch plush versions of Nick Wilde, Judy Hopps, Gary DeSnake, Nibbles Maplestick and Flash\t\n\t\t\t\n\t\t\t\t\t\t\t\n\t$24.99\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\n\t\n\n\t\t\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\t\t\n\n\t\t\t\t\tDisney Zootopia 2 Plush Gary De’Snake\t\t\n\n\t\n\t\tGet an eight-inch plushie version of the movie’s newest character complete with his Volt Viper fanny pack. \t\n\t\t\n\t\n\n\t\t\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\t\t\n\n\t\t\t\t\tDisney’s Zootopia 2 Plush Flash\t\t\n\n\t\n\t\tFans will also love this eight-inch plush version of Flash, the three-toed sloth who works at the DMV. The fan favorite (and so-called “fastest sloth) from the first “Zootopia” film is back for the sequel.\t\n\t\t\n\t\n\n\tPlush toy versions of the other characters in the new film are also available for $12.99 here.\n\n\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\t\t\n\n\t\t\t\t\tDisney Zootopia 2 Mystery Tails Pack\t\t\n\n\t\n\t\tThis mystery pack gets you a two-inch figurine of Nick plus one surprise character for you to unbox. This is a great gift for collectors and makes for a fun stocking stuffer too.\t\n\t\t\n\t\n\n\t\t\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\t\t\n\n\t\t\t\t\tPOP MART Disney Zootopia: Next Adventure Series Blind Box Figures\t\t\n\n\t\n\t\tLabubu creators POP MART are also getting into the “Zootopia 2” buzz, with these limited-edition blind boxes, that feature one surprise character per box. You can also purchase the complete set of 12 characters here.\t\n\t\t\n\t\n\n\t\t\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\t\t\n\n\t\t\t\t\tDisney Zootopia 2 My Busy Books Storybook\t\t\n\n\t\n\t\tThis set features a “Zootopia 2” storybook, plus 10 mini figurines and a playmat to help take the story out of the pages and onto your tabletop.\t\n\t\t\n\t\n\n\t\t\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\t\t\n\n\t\t\t\t\tFunko Pop! Disney: Zootopia 2 – Nick Wilde Collectable Vinyl Figure \t\t\n\n\t\n\t\tYou can also pick up the official “Zootopia 2” Funko Pop collection on Amazon. Each vinyl figure measures approximately 3.75 inches and comes in a colorful display box.\t\n\t\t\n\t\n\n\t\t\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\t\t\n\n\t\t\t\t\tZootopia (4K Blu-ray Edition)\t\t\n\n\t\n\t\tAnd you can catch up on the first “Zootopia” film with this collector’s edition 4K Blu-ray set, which features deleted scenes, deleted characters, a “making of” featurette and more.\t\n\t\t\n\t\n\n\tYou can also stream “Zootopia” on Disney+ or rent it online through Prime Video here.\n\n\t“Zootopia 2” is not only a hit with viewers, the film is earning raves from reviewers as well, with Variety’s Peter Debruge plugging its “classic ‘Chinatown’-style detective stories, populating adult-caliber plots with appealing, kid-friendly critters,” while calling the movie “a worthy successor” to the original.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "From Blind Boxes to Action Figures, ‘Zootopia 2’ Toys Selling Quickly Online on Heels of Film’s Big Box Office Debut",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/buy-zootopia-2-toys.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-27T19:49:53.000Z",
      "dateModified": "2025-11-27T19:49:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "LISTEN: Marlo Thomas on the St. Jude Story and Advancing Her Father’s Mission to Save Children’s Lives",
    "url": "https://variety.com/2025/biz/news/marlo-thomas-st-jude-childrens-hospital-danny-thomas-1236594174/",
    "image": "https://variety.com/wp-content/uploads/2025/11/GettyImages-1193817283-e1764259013238.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-27T17:15:06.000Z",
    "description": "\n\tOn a special Thanksgiving Day edition of “Daily Variety” podcast, Marlo Thomas, the actor, author and activist, revisits the remarkable story of how",
    "body": "\n\tOn a special Thanksgiving Day edition of “Daily Variety” podcast, Marlo Thomas, the actor, author and activist, revisits the remarkable story of how her father, entertainer Danny Thomas, launched St. Jude Children’s Research Hospital in Memphis, Tenn. And we take a Vintage Variety look back at how the St. Jude origin story played out in our pages.\n\n\tSt. Jude Children’s Research Hospital opened its doors in 1962, after Danny Thomas spent more than a  decade of barnstorming the country to host fundraisers. He also leaned on his Hollywood pals to help bring attention and bucks to his cause. St. Jude serves children facing pediatric cancer and other life-threatening illnesses. The organization’s ethos is that no family is turned away for lack of ability to pay. St. Jude provides an incredible level of services free of charge for families overwhelmed by the hardship of dealing with severe illness.\n\n\n\tMarlo Thomas and her brother, producer Tony Thomas, and sister Terre Thomas, have been an integral part of the St. Jude story since they were children. Today, St. Jude is a world renowned facility and the three siblings and their families remain active in fundraising campaigns for the institution that their father devoted so much of his life to build.\n\n\n\tAt present, the Thomas siblings are in the midst of St. Jude’s annual Thanks and Giving holiday drive.\n\t\n\n\t“My sister and brother and I created this 22 years ago. We’ve raised $1 billion so far on this program, which we’re very excited about, and we brought it up to $100 million dollars a year program now,” Thomas says. “Nobody pays at Saint Jude. Nobody pays for anything. They don’t pay for treatment or travel or housing or food. We pay for all of that. And it’s our honor and privilege to do that.”\n\n\tDanny Thomas’ extraordinary commitment to St. Jude was rooted in his upbringing, growing up in the 1910s and ’20s in an immigrant neighborhood in Toledo, Ohio, his daughter explains.\n\n\t“His parents were from Lebanon. He was a first-generation American. And little kids in his neighborhood died of things like appendicitis and influenza. Those are illnesses that should be curable. But because their parents couldn’t afford a doctor, they didn’t see a doctor. And so they didn’t make it. And that really imprinted on my dad,” Thomas recalls. “That’s why he thought if he ever was successful, he was going to build a hospital for children of all religions and all races, and that nobody would have to pay and they’d all get the same first-class care. And that’s something that my family and all of us at Saint Jude have taken very seriously.”\n\n\tBelow is a terrific “Sully’s Scrapbook” column that ran in the Feb. 28, 1962, edition of Variety that chronicles Danny Thomas’ long road to opening St. Jude Children’s Research Hospital on Feb. 4, 1962. The column also has great color on Thomas’ work in front of and behind the camera, as a producer of “The Andy Griffith Show” and many other series.\n\n\n\n\t\n\n\t\t\t\t\tFrom the Feb. 28, 1962, edition of Variety\n\t\n\n\n\n\tListen to Daily Variety on iHeartPodcasts, Apple Podcasts, Variety’s YouTube Podcast channel, Amazon Music, Spotify and other podcast platforms.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "LISTEN: Marlo Thomas on the St. Jude Story and Advancing Her Father’s Mission to Save Children’s Lives",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/GettyImages-1193817283-e1764259013238.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-27T17:15:06.000Z",
      "dateModified": "2025-11-27T17:15:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Danny Seagren, ‘Sesame Street’ Puppeteer Who Was Also First TV Spider-Man, Dies at 81",
    "url": "https://variety.com/2025/tv/news/danny-seagren-dead-dies-spider-man-sesame-street-1236594252/",
    "image": "https://variety.com/wp-content/uploads/2025/11/GettyImages-1157610791.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-27T19:15:14.000Z",
    "description": "\n\tDanny Seagren, a “Sesame Street” puppeteer who also appeared as an early iteration of Spider-Man on “The Electric Company,” died on Nov. 10 at 81 ye",
    "body": "\n\tDanny Seagren, a “Sesame Street” puppeteer who also appeared as an early iteration of Spider-Man on “The Electric Company,” died on Nov. 10 at 81 years old. His cause of death was not listed. His family announced the news via an online obituary. \n\n\tSeagren was born on Nov. 15, 1943 in Minneapolis.\n\n\tFamily described Seagren as a “dancer, writer and producer,” who also served as a puppeteer and puppet maker for Jim Henson. This led to Seagren’s appearances on “Sesame Street,” where he occasionally portrayed Big Bird — not only on the show, but also at live events and appearances on “The Ed Sullivan Show.”\n\t\n\n\tSeagren also went on to create puppets for and perform puppet characters on “Captain Kangaroo”, “Who’s Afraid Of Opera” and “Miss Peach,” the last of which earned him a daytime Emmy.\n\n\tHe was also the first TV portrayal of Spider-Man when he appeared on “The Electric Company,” the popular kids’ show starring Rita Moreno and Morgan Freeman.\n\n\tIn his later years, Seagren enjoyed connecting with now-adult fans of his work at various conventions.\n\n\tSeagren worked in NYC and eventually retired to Little River, SC. He is survived by his longtime companion, Kate Vereau, brother Dr. Stephen L. Seagren, his wife Jill R. Seagren and their son, Sean G. Seagren.\n\n\t“Danny will be greatly missed by his family, friends and those throughout the community he loved living in,” the family wrote in the obituary.\n\n\tPer the family, a celebration of life will be held at a later date. Memorial donations are encouraged to be sent to the Entertainment Community Fund.\n\t\n\n\tWatch Seagren perform as Big Bird in the clip below.\n\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Danny Seagren, ‘Sesame Street’ Puppeteer Who Was Also First TV Spider-Man, Dies at 81",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/GettyImages-1157610791.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-27T19:15:14.000Z",
      "dateModified": "2025-11-27T19:15:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Noah Schnapp on Will’s Game-Changing [SPOILER] in ‘Stranger Things 5’: ‘I Wanted to Tell Everyone I Knew’",
    "url": "https://variety.com/2025/tv/news/noah-schnapp-stranger-things-5-will-powers-coming-out-1236593002/",
    "image": "https://variety.com/wp-content/uploads/2025/11/magic-will.png?crop=163px%2C0px%2C2553px%2C1435px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-11-27T16:30:00.000Z",
    "description": "\n\tSPOILER ALERT: This story contains spoilers from Season 5, Volume 1 of “Stranger Things.”For the entire run of “Stranger Things,” Will Byers (Noah S",
    "body": "\n\tSPOILER ALERT: This story contains spoilers from Season 5, Volume 1 of “Stranger Things.”For the entire run of “Stranger Things,” Will Byers (Noah Schnapp) has had it rough. In Season 1, he was abducted into the Upside Down and, as we later find out, is filled with some kind of malignant goo by the show’s lead villain, Vecna (Jamie Campbell Bower). In Season 2, he was possessed by a malevolent entity known as the Mind Flayer. In Season 3, he was left behind by his friend group — Mike (Finn Wolfhard), Lucas (Caleb McLaughlin) and Dustin (Gaten Matarazzo) — as they turned their attention away from Dungeons & Dragons and to their (often terrible) attempts to romance their girlfriends. And in Season 4, he suffered in closeted silence as his feelings about Mike shifted from friendship to something more.\n\n\n\tIn the show’s fifth and final season, at the darkest possible moment, Will turns it all around. In the fourth episode, “Sorcerer,” Will discovers that his connection to the Upside Down hive mind — which has been growing stronger, allowing him to see through the eyes of Demogorgons and Vecna himself — runs both ways. Just as three Demogorgons are about to kill Mike, Lucas and their friend Robin (Maya Hawke), Will’s eyes turn white, his body goes rigid, and like a really bad-ass puppeteer, he stops the Demos in mid-air, pulls them higher off the ground, and then snaps their bones, killing them. The final shot of the episode (and of Volume 1 of the season) is of Will, exhausted, wiping a drop of blood from his nose, Eleven-style.\n\t\n\n\n\tThe catalysts for this holy shit moment come earlier in episode. First, when Will’s mother, Joyce (Winona Ryder), confronts a Demogorgon with an axe, Will sees through its eyes — and the creature appears to back off. This causes Mike to posit a theory to Will later that afternoon, as they’re about to enter the tunnels underneath Hawkins.\n\n\t“Maybe when you tap into the hive, you can pull the strings, too,” Mike says to Will. “I’m just saying you’re a wizard.”\n\n\t“In D&D, Mike,” Will says. “Not in real life.”\n\n\t“True,” Mike replies. “In real life, you’re more like a sorcerer, because your powers don’t come from a book of spells. They’re innate.”\n\n\n\tRobin watches this exchange, and the effect Mike’s attention and praise has on Will. Earlier in the season, Will accidentally saw Robin kissing her girlfriend, Vickie (Amybeth McNulty), and he’s since asked her some questions that would lead any queer person to surmise what’s driving Will’s curiosity. \n\t\n\n\tSo while they’re walking in the tunnels, Robin pulls Will aside. She tells him about her first crush, Tammy Thompson, and how Tammy’s relationship with Steve Harrington (Joe Keery) so gutted her that her life totally fell apart. Until the day she stumbled upon old 8mm home movies in her family’s attic.\n\n\t“I got it up on the projector, and all of a sudden, I was looking at this little version of myself,” she says. “And that little me, I could hardly recognize her. She was so carefree and fearless. And that’s when it hit me. It was never about tone-deaf Tammy. It was always just about me. I was looking for answers in somebody else, but I had all the answers. I just needed to stop being so goddamn scared. Scared of who I really was. Once I did that, oh, I felt so free. It’s like I could fly, you know?”\n\n\tAnd so, when the Demogorgons are about to kill Will’s friends, he closes his eyes, and home movies from his childhood appear on the screen. Over snippets from Robin’s monologue, we see the day Mike and Will became friends, and when he built Castle Byers with his brother Jonathan, and, finally, him running through the woods, dressed as a sorcerer, wielding his magic wand.\n\n\tThe moment was especially meaningful for Schnapp, given how much his own journey of self-acceptance has mirrored Will’s. In an interview with Variety in July 2022, Schnapp confirmed for first time that Will is gay and in love with Mike. Six months later, Schnapp came out as gay himself, something he told Variety would not have happened had Will not come out first.\n\n\tIn Season 5, Schnapp gets to return the favor, bringing Will’s coming out journey to life in a way that he hopes will speak to queer and straight people alike. He talked with Variety about becoming “completely nocturnal” for over a month to shoot the full action sequence, his varied experiences watching the episode and how he came to think of Will as a silverback gorilla when he’s exercising his powers. \n\n\t(Click here for more insight from creators Matt and Ross Duffer into Will’s powers — as well as answers to many more burning questions about Volume 1.)\n\n\n\n\t\n\n\t\t\t\t\tNoah Schnapp and Maya Hawke\n\t\t\t\t\t\t\t\t\tCourtesy of Netflix\n\t\n\n\n\t\n\t\tWhen did you first learn the full extent of what was going to happen with Will through Episode 4?\t\n\n\tI remember the scripts being written the year prior, and Shawn Levy and some of some of the directors not telling me explicitly, because they never trust me with any of the information. But they told me, like, “Sit tight, be excited, like, there’s some good stuff coming.” I was like, “Oh, OK, whatever.” We only get the scripts a week or so before the table reads. I read Episode 4 the day of the table read, because I was like, “OK, I have to make sure I know my parts a little bit so I don’t sound like an idiot.” So I was skimming it, and then, like, literally, in the shower getting ready, I got to the end, and I was like, “Oh my God!” I ran out of the shower screaming. I lived with an assistant. Her name is Brooke. And I was like, “Brooke! Oh, my God, I have powers!” I wanted to tell everyone I knew. And of course, I had to wait two years for anyone to see it. But: coolest thing ever.\n\t\n\t\tOnce you got a chance to talk with Matt and Ross about it, how did they talk to you about Will’s abilities?\t\n\n\tThey kind of just left it up to me, which was a challenge, but exciting. There’s so much, with the Demo-vision as well — just all of these supernatural things that are presented brand new and there’s no reference to anything in the show or anything in real life, so you kind of just have to create it on your own. I remember FaceTiming the Duffers before establishing how the powers work, because you learn later in the season that it comes differently than El’s powers. So I wanted to show that in his physicality and the way he stretches out his hands. One of the hardest parts of the season was just figuring out, even with the Demo-vision, like, OK, so he’s entering into the view of the Demogorgon. How do I show that? And how do I show that he’s switching channels through the different Demogorgons?\n\t\n\t\tHow long did it take to shoot the whole action sequence of Vecna’s attack on the military base in Hawkins?\t\n\n\tProbably a month, I would say, or month and a half, maybe. Definitely July and a bit of August. It was all overnight. We completely became nocturnal. I slept in a room in my apartment with no windows, and just became like a bat. Would wake up at 8 p.m. go to set. Then there was one week where it was kind of just me. I thought it would be weird, not having any co-stars to bounce off of, but it was just so fun. It was like being on a big playground. I got to work so freely, and run back and forth to the tent, watching playback, being like, “I don’t like this. I don’t like that.”\n\n\tThen I remember the last shot — where it’s zooming in and he wipes his nose — I was like, OK, this is a big deal. We’re gonna have to work through this for many takes. Let’s make it perfect. Then we did the first take of it. I ran to the tent with the Duffers, and me and Ross looked at each other, and we just laughed. We were like, “OK, don’t touch it. It’s perfect.” It was just, like, a one-take wonder. It was such a thrill as an actor. What a dream!\n\t\n\t\n\t\tHow was it to shoot Will’s face-off with Vecna?\t\n\n\tIt’s just so physical, like, my neck was strained so much because you’re just sitting like this [raises head up and back] for three days. Obviously, I’m on a harness, and we had to rehearse that to make that work well. I became so close with all the stunt teams — this was their biggest sequence of the season. It was a monthlong choreographed dance. And getting to work with Jamie for the first time face-to-face was incredible. He’s an amazing actor, and it makes it easier for me to be scared of him, because he’s so terrifying. I mean, off camera, I did not want to go near him. I just gave him his space.\n\t\n\t\tWhen we spoke on set, you said you’d been working with an acting coach. Was one of the reasons to work out all this physicality?\t\n\n\tYeah, for sure. How do I make this stuff look like it’s real-ish — like, believable, but it’s so supernatural and otherworldly. We worked with animals a lot. When I was getting into the powers thing, I would like grunt and channel a silverback gorilla, so it felt like completely not this little innocent Will that we know. You get to see that evolve later on — which was also a thing I had to be mindful about, because, not to dive into too many spoilers, but I was making sure the powers evolve properly as he’s learning to use them and learning how to hone them.\n\n\n\n\t\n\n\t\t\t\t\tSchnapp in Season 4 of “Stranger Things.”\n\t\t\t\t\t\t\t\t\tCourtesy of Netflix\n\t\n\n\n\t\n\t\tMy read was that Will’s ability to access these powers was really unlocked once he accepts himself as a gay person. How did you see it?\t\n\n\tOf course! It was so beautifully written. I think this is one of the best gay characters we’ve ever received in media. It makes me so excited for all the queer people out there to have a character like this to look up to. I would have loved to have someone like this, because he is not just this one tone, defined by his gayness — which I found so many times in the media, and I was like, that’s not me. You’re not just gay and that’s your whole life. That’s a piece of Will — of course, a huge piece of him. But it’s not everything. Accepting his identity allowed him to unleash this strength within him. That’s a trope that that goes way beyond queerness, and I think can resonate with so many people. Matt Duffer, he was like, “It resonates with me, and I’m not gay.” Just learning to accept yourself, that resonates with anyone.\n\t\n\t\tThe story Robin shares with Will in the tunnels — what was that like for you to hear?\t\n\n\tI didn’t expect to feel as emotional as I did. When I watched Episode 4 with my sister, she was sobbing through that whole Robin speech scene. It just made me well up so much, realizing how real it feels to my own life.\n\t\n\t\n\t\tYou hadn’t worked much at all with Maya Hawke before this season. What was that like?\t\n\n\tOh, the best! I adore that woman. I had such a friend-crush on her through the years. She definitely was a role model for me in real life. She has two iconic parents who who have related lots of knowledge onto her. I was like a sponge around her, taking all the knowledge, and I loved it.\n\t\n\t\tThe opening sequence of the season, when we flashback to Season 1 and see Will get captured by the Demogorgon and encounter Vecna for the first time — how much were you involved with that?\t\n\n\tPretty involved. I wasn’t working on any of the days that the young actor [playing young Will] was, but they had me come each time to guide and direct him. The Duffers were like, “It’s all you.” And I was like, “Oh shit, really?” Then I got to reflect on, like, How do I work? How do I breathe? How do I show fear? And how did I do that as a young kid? Really get into the nitty gritty of my work and relay this to this kid to make him understand it. He was incredible, and so adorable.\n\t\n\t\tAnd then did you do any face-replacement work?\t\n\n\tThe face replacement was in a tent on a separate day. They had me sit still in a chair with a camera, and they were like, “OK, now show fear of the Demogorgon. And you’re looking back.” Just every little technical detail.\n\n\n\n\t\n\n\t\t\t\t\tLuke Kokotek as Young Will Byers in Season 5 of “Stranger Things”\n\t\t\t\t\t\t\t\t\tCourtesy of Netflix\n\t\n\n\n\t\n\t\tThere’s a moment in the first trailer where the camera’s tight on Will’s face and he’s screaming, “Run!” — and you look as absolutely terrified as anyone I’ve seen. First, I presume that’s from the second half of the show? \t\n\n\tMmmhmm.\n\t\n\t\n\t\tSo what is it like to do that kind of thing, to get yourself into a place where you are so terrified?\t\n\n\tInsane. You just have to be so vulnerable. This was, again, with the animal work, where I kind of can’t be Will. He’s too soft and sweet. So I’m channeling this, like [starts breathing deeply and energetically] gorilla physicality, and becoming something else. Also there’s paparazzi, and I’m yelling so loud across this field that they got video all the way down to the road of someone yelling. I remember it going a little viral on social media last year, and people being like, “Who is saying ‘run’?” I have to get that anxiety out of my head, of like, “Oh shit. There’s people videoing this, and I might spoil something.”\n\t\n\t\tHow has doing all that work changed your perception of yourself as an actor?\t\n\n\tIt was just the most challenges I’ve ever had, playing things that I can’t reference to anything in my personal life, and seeing like, can I still do it? I just really tried to care the most I have about this character and really understand not just that he’s scared of Vecna, but he’s dealing with all these traumas. I mean, you saw those first five minutes. That is so traumatizing in itself, and then it’s compiled with his abusive father and being bullied at school and being excluded from his friends and struggling with his self-identity.\n\t\n\t\tWhen I spoke to Finn Wolfhard for our cover story, he told me that he was getting together with you, Caleb McLaughlin and Gaten Matarazzo in a few days to watch Episode 4. What was that experience like?\t\n\n\tI had seen it, like, three times already, but they hadn’t. We were all sitting on a hotel bed together, and I was just side-eyeing all of them to see their reactions. They were screaming, grabbing each other. And then, like, when it ended, they were like [clapping], “The Duffers did it again! They never miss.” I hope we get to watch the finale together.\n\t\n\t\tSo the first time you watched this episode, what was that experience like for you?\t\n\n\tThe first time, I have to watch it alone, because I’m so self-critical, I will not enjoy it with someone else. I’m just analyzing everything, and regretting everything. Once I put that aside, I can watch it a little bit more as just a viewer. Watching with my sister the third time was the most I just got lost in the story.\n\t\n\t\n\t\tThe part where it cuts to the home movies of young young Will, meeting Mike for the first time, making Castle Byers with his brother — how aware were you of that sequence?\t\n\n\tOh, my God, I was all over it. I was like, “Guys, have you cast the young Will yet? Have you cast the young Will yet? Have you cast the young Mike? I need to see! I need to see!” They were like, “It’s so difficult. We cannot find anyone that looks like you guys.” It was a last minute casting right before they filmed that sequence. Because people know what we look like young, so it was hard to make it believable. But I think they found pretty realistic young versions of us, and that young Will was a different young Will than the beginning of Season 5 young Will. It was really fun to just keep getting to meet these younger versions of me. Oh, he was so adorable.\n\n\t\n\t\tSo this last question has a bit of a windup. I realized recently that if the pandemic and the strikes hadn’t happened, then Season 5 likely would’ve filmed at least two years ago. That made me wonder what it would’ve been like for you to go through all the stuff Will goes through this season at a different stage of your own self-awareness as a gay man. We’ve talked before about how much Will’s journey parallels your own — what was it like for you to experience his own self-acceptance and empowerment?\t\n\n\tIf I filmed it few years ago, yeah, I wouldn’t have had anywhere close to the amount of inner belief that I could harness. No, it wouldn’t have been as strong. I have found through the years a lot more confidence and strength in myself. I think that’s what makes that scene so beautiful. He’s so low, not just from that scene, but through the past five seasons. He is the most stepped-on kid out of the whole show. He’s been through so much, and he always comes out of it pushing through and not letting any of it jade him. And to make it now all the way to this final moment, and not just be pushing through it, but rising above it and stronger than we’ve ever seen him before is so empowering and so inspiring. It’s just such a powerful message that I’m so proud to have brought to life.\n\n\n\tThis interview has been edited and condensed.\n\n\t\n\t\tInside the Upside Down\t\n\n\t• The Duffer Brothers Answer Volume 1 Burning Questions• Linda Hamilton on Being Millie Bobby Brown’s ‘Biggest Fan’• Shawn Levy on ‘Sticking the Landing’ for Season 5• David Harbour on How ‘Stranger Things’ Has Changed Him• The Cast of ‘Stranger Things’ on the Show’s Final Days\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Noah Schnapp on Will’s Game-Changing [SPOILER] in ‘Stranger Things 5’: ‘I Wanted to Tell Everyone I Knew’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/magic-will.png?crop=163px%2C0px%2C2553px%2C1435px&resize=1000%2C563"
      ],
      "datePublished": "2025-11-27T16:30:00.000Z",
      "dateModified": "2025-11-27T16:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Mediawan’s Imagissime and Atlas V Team on Surreal Sci-Fi Comedy Series ‘Paradoxes,’ Blending Live Action and AI (EXCLUSIVE)",
    "url": "https://variety.com/2025/tv/global/mediawan-atlas-v-team-arte-paradoxes-live-action-ai-1236594133/",
    "image": "https://variety.com/wp-content/uploads/2025/11/FotoJet-48.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-27T17:09:53.000Z",
    "description": "\n\tMediawan’s Imagissime label and immersive-media pioneer Atlas V have teamed to produce “Paradoxes,” a surreal sci-fi comedy series blending live act",
    "body": "\n\tMediawan’s Imagissime label and immersive-media pioneer Atlas V have teamed to produce “Paradoxes,” a surreal sci-fi comedy series blending live action and generative AI, starring up-and-comers such as Xavier Lacaille (“Parlement”), Zita Hanrot (“The Hook Up Plan”), Nora Hamzawi (“Irma Vep”) and Oussama Kheddam (“Mes premieres vacances”). \n\n\tArte France is co-producing and has ordered the series which will stream it on its service, while Mediawan Rights will distribute it internationally. Now filming until next month, “Paradoxes” also secured R&D support from Google on the AI front, alongside public funding from CNC and the Île-de-France region. \n\t\n\n\tThe six-part show, which is directed by Pierre Zandrowicz (” I, Philip”), follows Roman (Lacaille), a depressed journalist who travels to a forest to report on a rare oak species for Bois Magazine, only to fall into an expanding quantum anomaly caused by a zealous scientist, Lea (Hanrot). The latter soon realizes the interior of the alternate zone is in fact the materialization of Roman’s tortured subconscious, a surreal mental landscape where neuroses, fantasies, childhood memories and shameful ghosts spill into physical reality, all while the army and Roman’s unconventional therapist (Hamzawi) attempt to contain the catastrophe. “Paradoxes” was created and written by Maxime Donzel and Émilie Valentin. \n\n\n\tZandrowicz, who co-founded Atlas V in 2017 with Antoine Cayrol and Arnaud Colinart, previously directed the VR short films “I, Philip,” and “Mirror,” as well as produced a flurry of festival prizewinners, including “Gloomy Eyes” and “Battlescar.”  Zandrowicz previously worked with Hanrot on “Mirror,” a narrative sci-fi VR short in the veins of “Under The Skin” and “Annihilation.” For “Paradoxes,” he said he was inspired by the surrealism and existential playfulness of Michel Gondry, Spike Jonze and Charlie Kaufman’s works, blurring the lines between the conscious and the unconscious, the absurd and the real.\n\t\n\n\t“Paradoxes” marks Atlas V’s first full original live-action series, and it’s also a bold new step for Imagissime, Élodie Polo Ackerman’s ambitious production label which has been thriving with critically acclaimed, cinematic documentaries for Netflix (“Gregory,” “L’affaire Florence Cassez”), Disney+ (“L’affaire Swagg Man : Hip-hop, influence et bitcoins”), France Télévisions (“Féroces”), Arte (“Yakuza”), TF1 (“Temple solaire : L’enquête impossible”) and Canal+ (“X contre Z”). Under Polo Ackerman’s helm, the banner has recently started producing fiction and is venturing into hybrid narration with “Paradoxes.” \n\n\tPolo-Ackermann told Variety that Imagissime “connected with this project because of its quality — all the work Atlas has been doing for years in a highly innovative field, always with the story at the center of everything.” \n\n\t“Pierre has incredible talent, with a universe that sits right at the edge of the absurd to tackle the theme of mental health,” she says, adding that this subject is universal, citing “Patrick Melrose” starring Benedict Cumberbatch as a rich dandy suffering from a heroin addiction. There’s also “Vie Privée,” starring Jodie Foster as a therapist who falls into neurosis after a patient’s suicide. \n\n\tAtlas V COO Oriane Hurard said the banner started developing “Paradoxes” a year-and-a-half ago, and  stemmed directly from Zandrowicz’s artistic deep dive into generative AI.\n\n\tDespite its cutting-edge aesthetic, the writing process on “Paradoxe” followed a traditional path. Arte paired Zandrowicz with two seasoned comedy writers, Donzel and Valentin, who have worked across OCS, France Télévisions and Disney+, Hurard said. \n\n\tArte’s digital creation unit also played a key role in shepherding “Paradoxes” whose visual pipeline is highly sophisticated. While the real world depicted in the series is shot traditionally with actors in physical locations, Roman’s inner psyche (also called the zone) is designed with generative AI, explained Hurard, who also pointed out the complex transitional sequences, such as characters crossing the portal between real world and psyche, required mixed techniques, including green-screen setups, 3D mapping and motion-capture. \n\n\t“Paradoxes” also drew unexpected support from the French Army and Mission Cinema who oined the project after watching the prototype video put together by Atlas V and Imagissime. Their backing went far beyond location access — the production has had access to military training grounds, tents and vehicles, and even benefited from consultants advising actors on terminology and weapons-handling. Recent scenes were filmed on the Montlhéry military base and the production is now filming at Bry-sur-Marne studios.\n\t\n\n\tHurard framed “Paradoxes” as a natural evolution of Atlas V’s decade-long collaboration with Arte, spanning from early VR shorts to bringing generative AI into narrative storytelling. Yet, Polo-Ackermann says “Paradoxes” isn’t an experimental work, but rather a “series rooted in traditional fiction that uses cutting-edge tools to explore the uncharted landscapes of the mind with a blend of emotional surrealism and sharp comedy.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Mediawan’s Imagissime and Atlas V Team on Surreal Sci-Fi Comedy Series ‘Paradoxes,’ Blending Live Action and AI (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/FotoJet-48.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-27T17:09:53.000Z",
      "dateModified": "2025-11-27T17:09:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Marcello Hernández, Skyler Gisondo to Play Shrek and Fiona’s Sons in ‘Shrek 5’",
    "url": "https://variety.com/2025/film/news/marcello-hernandez-skyler-gisondo-shrek-fiona-sons-shrek-5-1236594191/",
    "image": "https://variety.com/wp-content/uploads/2022/03/shrek.png?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-27T16:24:51.000Z",
    "description": "\n\t\t\t\n\t\t\t\t\n\t\n\n\t\n\tNov 27, 2025 8:24am PT\t\n\t\n\n\t\n\t\tMarcello Hernández, Skyler Gisondo to Play Shrek and Fiona’s Sons in ‘Shrek 5’\n\t\n\t\n\t\t\t\n\n\n\t\t\t\n\t\t\t\n\t\n\n\t\t\t",
    "body": "\n\t\t\t\n\t\t\t\t\n\t\n\n\t\n\tNov 27, 2025 8:24am PT\t\n\t\n\n\t\n\t\tMarcello Hernández, Skyler Gisondo to Play Shrek and Fiona’s Sons in ‘Shrek 5’\n\t\n\t\n\t\t\t\n\n\n\t\t\t\n\t\t\t\n\t\n\n\t\t\t\t\t\t\t\t\tEverett Collection\n\t\n\n\t\t\n\t\n\t\t\t\t\n\tMarcello Hernández and Skyler Gisondo are heading to the land of Far Far Away. \n\n\tThe two actors are set to join the cast of “Shrek 5” as Shrek and Fiona’s sons, Fergus and Farkle. Hernández is best known for his work on “SNL.” He also appeared in “Happy Gilmore 2” and is set to star in the upcoming comedy, “72 Hours.” Gisondo played Jimmy Olsen in last summer’s “Superman” and also had supporting roles in “Licorice Pizza” and “Booksmart.”\n\t\n\n\tUniversal Pictures will release DreamWorks Animation’s “Shrek 5” on June 30, 2027. The franchise’s vocal cast of Mike Myers, Eddie Murphy and Cameron Diaz are set to reprise their roles as Shrek, Donkey and Fiona. Zendaya is also joining the ogre fun as Shrek and Fiona’s daughter, Felicia. Rebooting “Shrek” has been a priority for the studio and for Chris Meledandri, the head of Illumination and the man behind the “Despicable Me” and “Minions” franchise,” as well as “The Super Mario Bros. Movie.” \n\n\n\t“Shrek 5” will be directed by Conrad Vernon and Walt Dohrn. Vernon’s directing credits include “Shrek 2” and “Madagascar 2,” and he is also the voice of Gingerbread Man (aka Gingy). Dohrn worked on the second and third “Shrek” films as a writer and artist, and as head of story on the fourth film. Dohrn also voiced Rumpelstilskin.\n\n\tThe film will be produced by Gina Shay, who produced “Shrek Forever After,” and by Meledandri. “Shrek 5” will be co-directed by Brad Ableson (“Minions: The Rise of Gru”).The four “Shrek” films have earned more than $2.9 billion worldwide, as well as inspired a Broadway musical, an immersive tourist destination in London, a spin-off series involving Puss in Boots, as well as events and attractions across Universal Studios parks.\n\n\tHernández is represented by CAA, LBI Entertainment and Patti Felkner. Gisondo is represented by UTA, Untitled Entertainment and Jackoway Tyerman.\n\t\n\n\n\t\n\t\tMore from Variety\n\t\n\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Marcello Hernández, Skyler Gisondo to Play Shrek and Fiona’s Sons in ‘Shrek 5’",
      "image": [
        "https://variety.com/wp-content/uploads/2022/03/shrek.png?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-27T16:24:51.000Z",
      "dateModified": "2025-11-27T16:24:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jonathan Groff Kisses Bowen Yang’s Hand After Dancing Together During Thanksgiving Day Parade Performance",
    "url": "https://variety.com/2025/tv/news/gay-kiss-thanksgiving-day-parade-jonathan-groff-bowen-yang-1236594186/",
    "image": "https://variety.com/wp-content/uploads/2025/11/Jonathan-Groff-and-Bowen-Yang.png?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-27T16:31:48.000Z",
    "description": "\n\tJonathan Groff and Bowen Yang shared a warm and flirty moment together during the Macy’s Thanksgiving Day Parade.\n\n\tThe Broadway and “Saturday Night",
    "body": "\n\tJonathan Groff and Bowen Yang shared a warm and flirty moment together during the Macy’s Thanksgiving Day Parade.\n\n\tThe Broadway and “Saturday Night Live” stars, respectively, did a dance number at the beginning of Groff’s performance alongside his “Just in Time” cast. It ended with Groff kissing Yang on the hand. Groff leads the Broadway musical, which is about the life of singer Bobby Darin.\n\n\n\tThe Macy’s Thanksgiving Day Parade is a ratings juggernaut for NBC and Peacock, with viewership over 31 million people last year.\n\t\n\n\tIn this year’s Broadway Actors on Actors, Groff spoke with “Sunset Blvd.” star Nicole Scherzinger about channeling a real person who came from a different world.\n\n\n\t“Bobby Darin was this playboy crooner,” he said. “I’m this guy from Amish country Pennsylvania. Who would think we had that much in common? But we both have this deep, passionate connection with the audience. We say it’s the only relationship he was any good at. This immersive experience of being in the audience, looking in people’s eyes … I’m showering them with sweat and spit. It’s like I’m a sprinkler going around.”\n\n\tThe cast of “Just in Time” also includes Sarah Hyland, Sadie Dickerson, Emily Bergl and Joseph Barbara.\n\n\tYang is no stranger to the world of musicals, as he is one of the stars of “Wicked: For Good,” which is a box office blockbuster this holiday season, and is expected to add $100 million more to its total from Wednesday to Sunday.\n\n\tWatch the “Just in Time” performance below.\n\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jonathan Groff Kisses Bowen Yang’s Hand After Dancing Together During Thanksgiving Day Parade Performance",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/Jonathan-Groff-and-Bowen-Yang.png?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-27T16:31:48.000Z",
      "dateModified": "2025-11-27T16:31:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Box Office: ‘Zootopia 2’ Kicks Off With $39.5 Million Heading Into Thanksgiving",
    "url": "https://variety.com/2025/film/news/box-office-zootopia-2-thanksgiving-eve-wicked-for-good-1236594119/",
    "image": "https://variety.com/wp-content/uploads/2025/11/MCDZOTW_WD006.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-27T16:10:00.000Z",
    "description": "\n\t“Zootopia 2” is off to a roaring start at the box office, earning $39.5 million in its first full day of release. \n\n\tAnd the Disney animated sequel ",
    "body": "\n\t“Zootopia 2” is off to a roaring start at the box office, earning $39.5 million in its first full day of release. \n\n\tAnd the Disney animated sequel isn’t the only follow-up film feasting at the Thanksgiving box office. “Wicked: For Good” brought in $17.2 million, bringing its stateside gross to $194.6 million. Unsurprisingly, Universal, which brought the Broadway musical to the big screen, has said it wants to find a way to extend the franchise and make more movies about Oz. “Wicked: For Good” should add more than $90 million to its haul to push its domestic total to nearly $270 million. \n\t\n\n\t“Zootopia 2,” a buddy cop movie with anthropomorphic animals as the bickering partners, is expected to collect $125 million to $150 million over the Thanksgiving holiday weekend, to take the box office crown.\n\n\n\tThat’s a massive opening, even though it will probably fall short of the record set by 2024’s “Moana 2,” which earned $139 million over the traditional weekend and $225 million over the five days. Other Thanksgiving all-stars include Disney’s 2019 sequel “Frozen II” ($125 million over the five days) and 2013’s “Hunger Games: Catching Fire” ($109 million over the five days). But for exhibitors, who have endured a punishing fall filled with flop films like “The Smashing Machine” and “Tron: Ares,” the arrival of another “Zootopia” and more Elphaba and Glinda finally gives them a reason to be thankful.\n\n\tThe second “Zootopia” should also dominate the international box office, earning $41.6 million to push its global total to $81.1 million. It is projected to pull in an additional $135 million to $145 million from foreign markets over its first five days of release. The film launched on Wednesday in China, where Shanghai Disneyland recently debuted a Zootopia Land, and Korea to huge results. In China, “Zootopia 2” scored the 10th-highest opening day ever for a U.S. release with $33.7 million, becoming one of the few Hollywood films to resonate at the Chinese box office since COVID. Since the pandemic, the country’s local-language films have been far more popular than U.S.-backed pictures.\n\t\n\n\tDirected by Jared Bush and Byron Howard, “Zootopia 2” follows a rabbit police officer (Ginnifer Goodwin) and con artist fox (Jason Bateman) as they reunite to pursue a mysterious new reptilian resident (Ke Huy Quan). Variety’s chief film critic Peter Debruge praised “Zootopia 2” as a “worthy successor,” and most reviewers agreed, handing the film an impressive 94% “fresh” rating on Rotten Tomatoes. \n\n\t Elsewhere, A24’s “Eternity,” a rom-com set in the afterlife that stars Elizabeth Olsen, Miles Teller, and Callum Turner, debuted to $1.4 million from 1,348 screens, while Focus Features’ “Hamnet,” a drama about William Shakespeare dealing with personal tragedy, opened to $330,000 from 160 locations. “Hamnet” is considered to be an Oscar frontrunner, with critics lavishing praise on the work of director Chloe Zhao and stars Jessie Buckley and Paul Mescal.\n\n\tTicket sales should dip on Thanksgiving Day as people celebrate with their families and stream “Stranger Things,” but audiences tend to hit up the multiplex on Black Friday and through the weekend.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Box Office: ‘Zootopia 2’ Kicks Off With $39.5 Million Heading Into Thanksgiving",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/MCDZOTW_WD006.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-27T16:10:00.000Z",
      "dateModified": "2025-11-27T16:10:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Stephen Schwartz on His Two New ‘Wicked: For Good’ Songs and What They Say About America, Plus Spinoff Prospects: ‘I Might Be Participating in Other Visits to Oz’",
    "url": "https://variety.com/2025/music/news/stephen-schwartz-wicked-new-songs-music-spinoff-interview-1236594150/",
    "image": "https://variety.com/wp-content/uploads/2025/11/MixCollage-27-Nov-2025-08-12-AM-2957.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-27T17:06:48.000Z",
    "description": "\n\tWhat a long, strange bubble ride it’s been. But the work of songwriter Stephen Schwartz on “Wicked” — the property he first discovered as a source n",
    "body": "\n\tWhat a long, strange bubble ride it’s been. But the work of songwriter Stephen Schwartz on “Wicked” — the property he first discovered as a source novel and has led into Broadway and dual film iterations — has finally come to a close. (Or has it? More on his feelings about spinoffs momentarily.) He did not coast to the finish line, having come up with two new songs for “Wicked: For Good,” the Elphaba-sung “No Place Like Home” and Glinda’s “The Girl in the Bubble,” to make the second film in the two-parter at least as emotionally and thematically holistic as the first.\n\t\n\n\tIn a conversation with Variety after the new film came out of the gate with a $147 million opening weekend at the domestic box office (and $223 million globally), Schwartz said that he is still “cautiously” waiting for a final verdict on whether fans like the inevitably darker conclusion to the story as much as its wildly popu-luhr predecessor. But after more than a quarter-century of shepherding the franchise, he’s personally satisfied that “the two movies together, just talking from the point of view of cinematic accomplishment, are an extraordinary achievement on the part of Jon Chu.” And although there have been ambiguous signals about whether the team believes there is further creative gas in the “Wicked” tank, if you read through to the end of our interview, you’ll find that Schwartz is willing to say he believes his work here may not be done.\n\n\n\tBefore moving on to the future, anyway, much of our conversation focused on just how much the songs of “Wicked” — the historical song score, but especially the two new ones he wrote for Cynthia Erivo and Ariana Grande — speak to America’s and the wider world’s uncertain present. (The following interview has been edited for length and clarity.)\n\t\n\n\tIs it fair to imagine you’re taking pleasure, if not some kind of vindication, in “Wicked: For Good” opening even bigger than the first movie?\n\n\tWell, sequels tend to open bigger than the originals, if the originals have been successful. I mean, it’s not really a sequel, it’s a continuation. But yeah, that’s not uncommon. If you hear any hesitance in what I’m saying, I was quite confident that the movie would do very well when it first opened, and of course it’s exceeded expectations. And I think it’s a really good movie and my understanding is that people are liking it. But I’m still waiting to see how it holds up — if the word of mouth is good, and people who are seeing it are telling their friends to go see it, and people who are seeing it decide they’d like to see it again, as they did with the first movie. We need a little bit of time to ascertain that. So I’m still being cautious, to be honest.\n\n\tAll right — you’ve had experience in being smart about not being rash in assuming success.\n\n\tIt’s my nature over the years.\n\n\tLet’s start by talking about the two new songs. Certainly with the stage production, there was so much thought that went into what you could and couldn’t get into a second act that’s inevitably shorter than the first…\n\n\tExactly.\n\n\tWhen you were writing these new songs, did they come in similar places to where you were already thinking back in the ‘90s or early 2000s, “It would be great to have this beat covered”? Or did you kind of start from scratch, in thinking where those songs should go?\n\n\tTotally started from scratch. We actually were not really ever thinking of these songs —these beats — when we were doing the show originally. The whole sequence of “No Place Like Home” is something that we could never have done on stage anyway, because it involves all these animals, and we only have one little animal in our show [the goat professor]. All the other animals were conveniently off stage.\n\n\tI do think that if we hadn’t had time limitations, we might have come to the point of thinking about “The Girl in the Bubble,” because that very important turning point for the character of Glinda does exist in the show; it just happens off-stage. But because of the time constraints and how things develop when you’re doing a show, it really never occurred to us. It certainly didn’t occur to me. In fact, Kristin (Chenoweth, who first played Glinda on stage) kept asking: Couldn’t she have another song later in the second act? We were looking at places where she might be able to, and ultimately decided against it. But oddly enough, this was not one of the places that we thought of.\n\t\n\n\tPeople sometimes talk about the balance between the two leads. With a new song for each leading lady now, that helps keep them equally balanced here. Although “lead” is in the eye of the beholder. Because we know that Ariana is being campaigned for supporting actress, and we’re thinking: In no realistic world is Glinda a supporting role. But we understand why they have to do those things.\n\n\tYou are exactly right. I mean, the logic behind those sort of characterizations often elude me. But you know, that’s not up to us, to determine how they’re characterized.\n\n\tMany people have said that in terms of the journey the characters take or the epiphanies they come to, the first half is a little bit more Elphaba’s, and then they’re surprised that the second film seems to be more Glinda’s journey.\n\n\tWell, this was pretty conscious on our parts — and by “our,” I mean myself, (co-screenwriters) Winnie Holzman and Dana Fox, (director) Jon Chu and (producer) Marc Platt, who were the group that spent endless hours on Zoom figuring out the structure of the two films. And it did arise quite consciously, as we were discussing it, that essentially the first film was Elphaba’s story arc in terms of her becoming at the end of the film who she truly is. Then, of course, she has a lot of action in the second film, but she doesn’t evolve as a character in terms of… Well, that’s not quite true. She does a little bit, when, in “No Good Deed,” she comes to certain realizations. But she’s still the Wicked Witch of the West, if you know what I mean. In the first film, she starts out as a schoolgirl wanting to do good and have all of Oz love her, and at the end of the film, she embraces her identity as the Wicked Witch.\n\n\tThe second film, we realized, is Glinda’s. She’s the one who has the big turning point. She’s the one who starts in a certain place, because she’s unable to change in the first film, and then ultimately comes to the point where she feels she has to — and she does. So, yeah, this is a long-winded way of solidifying what you said: that we were quite conscious that the larger story arc in terms of character development in the second film was Glinda’s. And that’s why we felt a song at that turning point was necessary for the storytelling.\n\t\n\n\tYou might not like the term “message songs,” but in a way, these do seem like quote-unquote message songs, whether you’re writing them strictly with the film in mind or not. When Elphaba sings “No Place Like Home,” I was watching it for the first time and nearly gasped, kind of thinking before the first verse was over, “Oh my God, this is a song about America.”\n\n\tOf course. Yeah. Or indeed, for anyone who’s living in a country that they love that is changing. I think everybody across the ideological and political spectrum who lives in America would agree that we are not living in the same country we were living in 10 years ago. Maybe you like it better; maybe you think it’s not a good development. But no one could feel like nothing has changed, because it’s an entirely different country. And so, if you are someone who feels that it hasn’t gone in the right direction, what do you do about it? What is your responsibility as an individual citizen of the country, particularly when it’s increasingly dangerous to resist? How much courage do you need? Or do you just feel it’s somebody else’s responsibility?\n\n\tI think those questions are in everybody’s mind. But we’re not the only country in the world that is undergoing a considerable change. You know, Hungary is certainly not the country that it was pre-Viktor Orbán… etc. So I feel it has ramifications beyond America. But I live in America, and so obviously I was writing from that point of view.\n\n\tI mean, I write from the point of view of a character. But this is definitely a character who is wrestling with the fact that the country that she loves and lives in — the land that she loves and lives in — has, from her point of view, devolved, and that she feels that she wants to try to help change that, and help bring it back to the country, the land, that she feels it can and should be.\n\n\tIt can be very moving to hear that. Even with animated animals circling around.\n\n\tWell, the nice thing about being able to write about Oz is that you have this charming world, even at its worst. And yet you can deal with issues that pertain as well to our world.\n\n\n\n\t\n\n\t\t\t\t\tCynthia Erivo, as Elphaba, sings ‘There’s No Place Like Home’ in ‘Wicked: For Good.’\n\t\t\t\t\t\t\t\t\tUniversal Pictures\n\t\n\n\n\n\tAnd then when Glinda sings “The Girl in the Bubble,” it so fits in with the movie’s themes of “I’ve been fooled” or “I’ve been kidding myself,” and yet it comes off as a very sweet song. We’ve talked before about your realization that there was an audience for young girls for the stage musical that you didn’t even have in mind when the show was being created. Now you’re very aware of it, do you think about how young girls or women will receive a song of enlightened disillusionment like that?\n\t\n\n\tNo, to be honest, I was not thinking about the audience per se in terms of either of the songs. But certainly in terms of “Girl in the Bubble,” I do feel that, again, it is a moment of courage for Glinda, because it would be very easy for her to continue to live in this metaphorical bubble where life is easy for her and where she gets to float above all the turmoil and close out the things that are disturbing. But she has an inner goodness that even she doesn’t quite know is there, but it will not allow her to do that anymore. So she makes a courageous choice to give up the privilege that she has.\n\n\tIt’s not entirely dissimilar to what we were just talking about with “No Place Like Home.” If you are living in a place that you feel is going in the wrong direction, but you yourself are perfectly comfortable and safe, what do you do? Do you just stay comfortable and safe, or do you risk that in order to try to make a difference for the land, for the country? I think both songs are somewhat opposite sides of the same coin.\n\n\n\n\t\n\n\t\t\t\t\tAriana Grande, as Glinda, sings ‘The Girl in the Bubble’ in ‘Wicked: For Good.’\n\t\t\t\t\t\t\t\t\tUniversal Pictures\n\t\n\n\n\n\tTo talk generally about fleshing out the second act for the second movie… It feels to me like there are benefits to the second act as it stands in the musical, even though it’s kind of rushed. That hurry kind of works in feeling like you’re rushing toward tragedy and bad things happening, so maybe there’s something to be said for that momentum. But then then expanding the length here for all that action to take place, there are different kinds of emotional beats that you need to have, because it’s its own separate movie and you didn’t just get some of those sitting through act one…\n\n\tExactly.\n\n\tSo having more comedy or more ballads makes it feel more holistic. But did you feel originally the second act on stage was rushed, or did it seem just right at the time?\n\n\tI wish the second act in the show could have been longer. There were sequences that I would like to have seen, and that at one point were there, and then the reality of how long a show can be started to make its its presence known when we were actually performing and the curtain was coming down way too late. But I happen to be a fan of shows that are, like, four hours long. So I’d have been delighted to have more time. But I do feel that what we came up with for the second act of the Broadway show works well.\n\t\n\n\tThe one thing we do in the movie that I wish we had thought of for the show is the inclusion of Glinda in “Wonderful.” I think it actually helps that sequence a lot, and it just never occurred to us. When we were working on the movie, because it was its own movie, it became clear as we were looking at the events of the second act as they occur in the show that it was too long a time where Glinda and Elphaba, who are the central relationship of the story, are not actually in the same place at the same time. It’s OK in the second act of the musical, for many reasons, but in a whole separate movie, that was not OK. So we had to figure out, well, where could they get together earlier? Then the idea came up: when Elphaba goes back to the Emerald City, she could actually have interaction with Glinda, instead of just seeing Glinda from afar and then interacting with the Wizard. I do feel it’s better, and maybe if we thought of it, we would’ve done it in the show.\n\n\tIt makes sense, because Elphaba is kind of backsliding, reconsidering the path she’s taken. Maybe that’s more realistic if she’s got her friend Glinda there egging her on.\n\n\tIt’s much more persuasive. And in the movie Glinda makes a really good case, I think, for why Elphaba should join them rather than keep up what is apparently futile resistance.\n\n\n\n\t\n\n\t\t\t\t\tJeff Goldblum as the Wizard of Oz and Cynthia Erivo as Elphaba meet up for the song “Wonderful” in “Wicked: For Good.”\n\t\t\t\t\t\t\t\t\tGiles Keyte/Universal Pictures\n\t\n\n\n\n\tCan you talk about other existing songs that got fleshed out, and how much additional material you wrote for the second part?\n\n\tThe first movie, more or less, is the first act of the show, except the “Emerald City” sequence got extended and fleshed out with seeing the Wizard’s propaganda. But the second movie has a lot of new material in it, not just in the screenplay, but in the music as well. I’ve just cited “Wonderful” and the two new songs; that’s where most of the new material comes. But it’s quite a bit, actually. The opening sequence, which is quite extensive, has lots of new stuff in it. We’re seeing what Elphaba has been doing all this time; we’re seeing where Glinda has come to. The opening number is considerably different than in the show. Oh, and the scene where Elphaba goes to see her sister. I’m not gonna tell too much about what happens there — because, spoilers — but that also has new music in it.\n\t\n\n\tIt is quite different at the start. On stage, Glinda is singing “Couldn’t Be Happier” almost at the very top of Act 2, whereas it takes about 15 minutes to get to that moment in the movie.\n\n\tExactly. [In the stage show] there’s a very brief reprise of “Every Day More Wicked,” which is also in the movie, and then we go right to “I Couldn’t Be Happier.” There’s a great deal more that happens in the movie before we get to that point.\n\n\tLet’s talk about this movie’s title song, “For Good.” When people who were maybe a little bit cynical about this movie’s box office compared to the first one were talking a few months ago, there was some talk along the lines of, “Well, it doesn’t have a ‘Defying Gravity.’ So maybe that limits its prospects.” Yet hardcore fans of the show would say “For Good” is just as impactful, even without the battle cry.\n\n\tWell, it is impactful in a different way. I mean, I do think that that last 10 minutes of the first movie, with the way Jon Chu created the “Defying Gravity” sequence, is pretty much as exciting as musical movies get, or maybe any movies can get. It’s true, we were never going to have that. Although there are a couple of very cool action sequences in this movie that I didn’t… I mean, I knew they were there because they were in the screenplay, but I didn’t know they were going to be quite as cool and as in the superhero movie sort of style as they are. There’s plenty of action, I’m saying. But it does not end in an action sequence. It ends with the beating heart of the movie, and of this relationship. That’s a different kind of impact.\n\n\tFor people who revere that song, it has a profound impact within seconds. People who know it start crying before more than a couple lines have been sung, with this sense memory of how emotional it’s going to become over the next five minutes or so. What is the legacy of that song, even outside of the show? It’s been made to fit everything from graduations to funerals.\n\n\tWell, indeed it seems to be making an appearance at many ceremonies, like those you cited, or a beloved teacher retiring, etc. Most of it seems to be able to translate. I mean, there are some specific things in it which don’t make sense if you left the movie out, where they ask for forgiveness and all that. But, yeah, in writing it originally, I just wanted to find a way to express essentially these two people who love each other having to say goodbye and trying to tell the other one what she has meant, the impact that she’s had.\n\t\n\n\tI’ve talked frequently about how the song got to be written, and I can talk about it again with you. It got written out of talking about a real relationship, which was a relationship my daughter has with a longtime friend of hers. She talked to me about: if she could only have one time to tell this friend what she’s meant to her, what would she say? A lot of what’s in the song came out of that conversation I had with my daughter, Jessica. So I think there’s an inherent truth to it that somehow then gave it a resonance for the audience.\n\n\tThere are other inspirational songs about friendship, like “Wind Beneath My Wings,” but something that is appealing to some people about this one is just openly it acknowledges tough times, and that the friends might even have screwed each other over… it’s not just sunshine and roses prompting the tears.\n\n\tAnd that’s long-term friendships. That tends to be true. If they’re real friendships, they’ll have some bumpy patches along the way.\n\n\n\n\t\n\n\t\t\t\t\tStephen Schwartz works on ‘Wicked: For Good’\n\t\t\t\t\t\t\t\t\tLara Cornell/Universal Pictures\n\t\n\n\n\n\tYou have said, often, that you’re not always a critics’ favorite. I’m a critic, and I contend “Wicked” is among the greatest musicals ever written…\n\n\tThank you. Not all the New York critics agreed with you. Let me just put it that way.\n\n\tSo we’re not all immune. But those 2003 reviews dismissing it are there, to be looked up. And it’s not as if everyone has completely come around to embrace the movies, although more critics get it now. But there is a gulf going back 22 years, where the people who’ve love it look at the ones who don’t look and say: Why don’t you see this?\n\n\tI have a theory, because these people are not idiots, frankly. You know, many of the critics who didn’t get the show when it first came out… I do think that critics can mistake size and spectacle for lack of substance — that if they see a show that has a lot of spectacle to it and visceral audience excitement about certain things, it can feel lighter-weight in terms of its content than a smaller, more obviously thoughtful show. And I think they can miss the fact that there’s a seriousness of purpose to a show like “Wicked,” too. I do think some of the critics came in and saw the spectacle and didn’t really notice that we were trying to tell a pretty thoughtful story.\n\t\n\n\tDeveloping the show originally, did you ever get stuck and wonder if you were biting off more than you could chew? There’s themes of love, and of friendship, and then there’s political satire — it addresses a lot of life experience. On paper it ought to have been hard to work all that into a single piece.\n\n\tIt wasn’t so much the different content in terms of the personal story and the larger social story, or political story, if you will. The more difficult part is, there’s just a lot of plot. Musicals really don’t tend to have that much plot, where so many things happen. We kept trying to eliminate things, and some of it we could, but some of it, we just couldn’t, and we had to figure out a way to tell it efficiently to get all those events and all those characters in. That was challenging. The fact that it was always gonna be both a personal story and a political story — that comes with the title. As soon as you have that title, you know that’s what it’s gonna be.\n\n\tWorking on these movies as you have, and then having your new Broadway show, “The Queen of Versailles” [which stars Chenoweth], in development and finally reaching the stage at the same time, was that a challenge to balance those things?\n\n\tOf course, yes. But that’s just how the timing worked out. Obviously there is an advantage to being able to split your focus, so I got to be extremely good at compartmentalization.\n\n\tHow are you feeling about that now? There were some tough reviews, but then the New York Times gave it a great one.\n\n\tObviously we’re very glad about that [the New York Times]. You know, it’s very political, the show, in its social satire. I think there is some misunderstanding out there about what the show is, because I mean, it’s sort of similar to what we were just talking about. Just as you can misunderstand “Wicked” through the spectacle, I think you can misunderstand “Queen of Versailles” because it’s funny, and there’s a lot of sort of lighter satire. But it really is an attempt to look at what’s going on in our culture right now, and the ramifications of that.  [This interview was conducted before it was announced “Queen of Versailles” will close in January, two months after its official opening night.]\n\n\tIn the new movie, “No Place Like Home” feels like it written for 2025, and you’ve acknowledged it as being something you wouldn’t necessarily have written 10 or more years ago. But the show feels very topical to people generally.\n\t\n\n\tCertainly, yeah. I wish it were less relevant. What can I tell you? I wish by the time the movie came out, people would say like, “Oh yeah, remember when that was going on in our world?” But unfortunately, that’s not the case.\n\n\tIt doesn’t date. The only thing that maybe is so tied to its time, or earlier, is in “Popular,” when Glinda makes that Reagan joke, about “even Great Communicators…” By now, probably most of the audience is too young to get that reference.\n\n\tSure. But the people who know it know it.\n\n\tI wrote an article back in 2011, interviewing you and Platt and some others, about how “Wicked” had already become a major cultural touchstone… and of course anticipating when the movie would finally get made, which it was first envisioned as. There was every indication at the time that it was might still be a few years before it happened. Certainly there could have been opportunities along the way to get it wrong, but everyone thought it was worth the delayed gratification, to stick the landing.\n\n\tI mean, exactly. We did take a lot of care with it. Frankly, there were, as we were developing it, some wrong roads or cul-de-sacs that we found ourselves in. I have a lot of gratitude to not just Marc Platt but Universal as a company that they never pushed us to get it out until we felt we had it right. And they could have. They’re a movie company, after all [which helped produce the Broadway show, with hopes of a film translation]. And they were very patient and waited a long time while we were saying, “We haven’t solved this yet.” So here’s a moment for me to say thank you to them.\n\n\n\n\t\n\n\t\t\t\t\tStephen Schwartz works on ‘Wicked: For Good’\n\t\t\t\t\t\t\t\t\tLara Cornell/Universal Pictures\n\t\n\n\n\n\tFinally, with all the Wicked-mania right now, everybody wants to ask about the possibility for sequels, prequels or side roads.\n\n\tI think that there will… there is… I don’t know. I’m trying to think what I’m allowed to say. But let me just say, I think that a spinoff is not out of the question. Let me put it that way. Oz is a very rich territory. There are a lot of stories there, and possible stories. L. Frank Baum wrote many other odd stories beside that first book. So I think there may be some other visits to Oz in the future, and I might even be participating in one of them.\n\n\tYou sound surprisingly open to that.\n\t\n\n\tYeah… Yeah.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Stephen Schwartz on His Two New ‘Wicked: For Good’ Songs and What They Say About America, Plus Spinoff Prospects: ‘I Might Be Participating in Other Visits to Oz’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/MixCollage-27-Nov-2025-08-12-AM-2957.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-27T17:06:48.000Z",
      "dateModified": "2025-11-27T17:06:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Guess Who This Curly-Haired Cutie Turned Into!",
    "url": "https://www.tmz.com/2025/11/27/guess-who-this-curly-haired-cutie-turned-into/",
    "image": "https://imagez.tmz.com/image/6b/16by9/2025/11/17/6b36629bf63b4cd2af97fd3c69a0e38e_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-27T08:01:41.000Z",
    "description": "\n    \n                    \n                          Guess Who This\n                          Curly-Haired Cutie\n                          Turned Into",
    "body": "\n    \n                    \n                          Guess Who This\n                          Curly-Haired Cutie\n                          Turned Into!\n                      \n                  \n                        Published November 27, 2025 12:01 AM PST\n                                                                            \n      \n    \n          Before this lil' cutie pie with cute curly hair turned into an American actress and singer, she was just auditioning for acting roles, growing up in New Jersey and dreaming of becoming a star ...\n      \n    \n          She met her manager at the mall when she was just 3 years old. While rockin' sparkly pink outfits, she sang about \"Fabulous.\" You may recall her from Disney's \"High School Musical\" with Zac Efron and Vanessa Hudgens.\n      \n    \n          Can you guess who she is?\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Guess Who\n              \n                          \n                Kids\n              \n                          \n                celebrity kids\n              \n                          \n                Photo Galleries\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Guess Who This Curly-Haired Cutie Turned Into!",
      "image": [
        "https://imagez.tmz.com/image/6b/16by9/2025/11/17/6b36629bf63b4cd2af97fd3c69a0e38e_xl.jpg"
      ],
      "datePublished": "2025-11-27T08:01:41.000Z",
      "dateModified": "2025-11-27T08:01:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jordin Sparks Reveals Her Cozy Thanksgiving Plans",
    "url": "https://www.tmz.com/2025/11/27/jordin-sparks-thanksgiving-plans/",
    "image": "https://imagez.tmz.com/image/16/16by9/2025/11/21/16e8bec92bd8457c95f210ba722ca6f4_xl.png",
    "tag": "Entertainment",
    "date": "2025-11-27T09:00:14.000Z",
    "description": "\n    \n                    \n                          Jordin Sparks\n                          My Thanksgiving Plans ...\n                          I'm S",
    "body": "\n    \n                    \n                          Jordin Sparks\n                          My Thanksgiving Plans ...\n                          I'm Season the Day!!!\n                      \n                  \n                        Published November 27, 2025 1:00 AM PST\n                                                                            \n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          Jordin Sparks was strolling through NYC on Friday when TMZ grabbed her for some Thanksgiving talk -- and her plans are as simple as they are wholesome.\n      \n    \n          She told us she’s all about rest, good food, family time and football ... though she admits her mom will probably pull her into the kitchen to whip up the sides and the sweet stuff.\n      \n    \n      \n        \n              \n    \n    \n          We also asked her about her go-to Christmas song -- hit the vid to hear which one she’s already humming.\n      \n    \n          Looks like Jordin’s holiday season is shaping up to be cozy, tasty ... and very on-brand festive!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Jordin Sparks\n              \n                          \n                Thanksgiving\n              \n                          \n                Exclusive\n              \n                          \n                Music\n              \n                          \n                Holidays\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jordin Sparks Reveals Her Cozy Thanksgiving Plans",
      "image": [
        "https://imagez.tmz.com/image/16/16by9/2025/11/21/16e8bec92bd8457c95f210ba722ca6f4_xl.png"
      ],
      "datePublished": "2025-11-27T09:00:14.000Z",
      "dateModified": "2025-11-27T09:00:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Patti LaBelle Breaks Down What She's Got Planned for Thanksgiving Dinner",
    "url": "https://www.tmz.com/2025/11/27/patti-labelle-thanksgiving/",
    "image": "https://imagez.tmz.com/image/d5/16by9/2025/11/18/d51375cab23142b392f32ce0a3cabc10_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-27T15:00:01.000Z",
    "description": "\n    \n                    \n                          Patti LaBelle\n                          Check Out What She's Cooking For Thanksgiving!\n          ",
    "body": "\n    \n                    \n                          Patti LaBelle\n                          Check Out What She's Cooking For Thanksgiving!\n                      \n                  \n                        Published November 27, 2025 7:00 AM PST\n                                                                            \n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          Patti LaBelle's more than just a singer, she's also an accomplished cook ... and since lots of us are gonna be in the kitchen over Thanksgiving, we asked her what she'll have on the stove for her Turkey Day celebration!\n      \n    \n          We caught up with her while she was heading through the Big Apple and she gave us the run-down of her menu ... and we're seriously salivating at the thought of sitting at the Godmother of Soul's table!\n      \n    \n          If you needed any last-minute tips about what to serve up for Thanksgiving -- or any other special occasion, in fact -- check out our video to see what Patti has planned!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Patti LaBelle\n              \n                          \n                Thanksgiving\n              \n                          \n                Music\n              \n                          \n                Fairly Legal\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Patti LaBelle Breaks Down What She's Got Planned for Thanksgiving Dinner",
      "image": [
        "https://imagez.tmz.com/image/d5/16by9/2025/11/18/d51375cab23142b392f32ce0a3cabc10_xl.jpg"
      ],
      "datePublished": "2025-11-27T15:00:01.000Z",
      "dateModified": "2025-11-27T15:00:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Macy's Thanksgiving Day Parade Balloons & Floats -- See The Highlights!",
    "url": "https://www.tmz.com/2025/11/27/macys-thanksgiving-day-parade-floats/",
    "image": "https://imagez.tmz.com/image/9a/16by9/2025/11/27/9a04b386ec04402984ba2c5edc5587ab_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-27T15:32:34.000Z",
    "description": "\n    \n                    \n                          Macy's Thanksgiving Day Parade\n                          Check Out These Icons\n                  ",
    "body": "\n    \n                    \n                          Macy's Thanksgiving Day Parade\n                          Check Out These Icons\n                          Floatin' Through NYC!\n                      \n                  \n                        Published November 27, 2025 7:32 AM PST\n                                                                            \n      \n    \n          Everyone knows Thanksgiving wouldn't be complete without some pop culture icons taking a long stroll through the streets of New York City ... so check out some of the most iconic floats and balloons at this year's Macy's Thanksgiving Day Parade!\n      \n    \n          SpongeBob swapped his pineapple under the sea for the Big Apple this turkey day ... being pulled by a group of chummy folks, all dressed in sponge-like attire.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Goku from the \"Dragon Ball\" series is posing for the camera as he makes his way through the city! He probably should be lookin' for some Dragon Balls, but hey -- even Saiyans need to celebrate the holidays.\n      \n\n                  \n          \n                          \n                \n                  \n      \n    \n          And what Macy's parade would be complete without a giant minion floating across NYC? Stuart the Minion is holding some minions while being walked by a group of guys and gals decked out in minion garb -- that's a lotta minion!!!\n      \n    \n          Tap into our gall above to check out all the coolest floats and balloons this year -- and enjoy the turkey!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                TV\n              \n                          \n                Thanksgiving\n              \n                          \n                Fairly Legal\n              \n                          \n                Holidays\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Macy's Thanksgiving Day Parade Balloons & Floats -- See The Highlights!",
      "image": [
        "https://imagez.tmz.com/image/9a/16by9/2025/11/27/9a04b386ec04402984ba2c5edc5587ab_xl.jpg"
      ],
      "datePublished": "2025-11-27T15:32:34.000Z",
      "dateModified": "2025-11-27T15:32:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "TikTok Star Tini Younger Says She Miscarried One of Her Twins",
    "url": "https://www.tmz.com/2025/11/27/tini-younger-twins-miscarriage-tiktok/",
    "image": "https://imagez.tmz.com/image/ae/16by9/2025/11/27/ae5573c1f10f42159e7d1b3c5d634055_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-27T12:48:40.000Z",
    "description": "\n    \n                    \n                          TikTok Sensation Tini Younger\n                          Announces She Miscarried One Of Her Twin ",
    "body": "\n    \n                    \n                          TikTok Sensation Tini Younger\n                          Announces She Miscarried One Of Her Twin Girls\n                      \n                  \n                        Published November 27, 2025 4:48 AM PST\n                                                                      |\n                Updated November 27, 2025 8:29 AM PST\n                                    \n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          TikTok star Tini Younger is dealing with a horrible tragedy ... she suffered a miscarriage and lost one of her twin babies.\n      \n    \n        Waiting for your permission to load the Instagram Media.\n      \n    \n          The internet chef broke the bad news Wednesday night in an Instagram post with a series of photos showing her with her \"sweet girl\" Arya and her husband, Antoine Wright Jr.\n      \n    \n          In the caption, Tini wrote they lost Arya earlier this week after she had been pregnant for nearly 36 weeks. Even worse, Tini said, the twin girls were almost to term when she had a placental abruption.\n      \n\n          That complication causes the placenta to partly or completely separate from the inner wall of the uterus before delivery. As a result, it decreases or blocks the baby's supply of oxygen and nutrients, which could be life-threatening to the baby and mother.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          The good news, according to Tini, is that Arya's twin sister is \"doing really good and breathing on her own.\" Tini also said, \"Arya will always be celebrated\" and \"her sister will know she is a twin and has a beautiful twin sister.\"\n      \n    \n          As for TikTok, Tini told her millions of fans she will be taking a break for a while, so don't expect to see her making her famous mac and cheese videos.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Social Media\n              \n                          \n                Celebrity News\n              \n                          \n                RIP\n              \n                          \n                Fairly Legal\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "TikTok Star Tini Younger Says She Miscarried One of Her Twins",
      "image": [
        "https://imagez.tmz.com/image/ae/16by9/2025/11/27/ae5573c1f10f42159e7d1b3c5d634055_xl.jpg"
      ],
      "datePublished": "2025-11-27T12:48:40.000Z",
      "dateModified": "2025-11-27T12:48:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]