[
  {
    "title": "LISTEN: ‘We’re a Sprint’: Actor Awards EP Jon Brockett on Producing the Live Kudocast for Netflix",
    "url": "https://variety.com/2026/tv/news/jon-brockett-actor-award-netflix-kristen-bell-daily-variety-1236673861/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Shutterstock-for-The-Actor-Awards3-e1772134453294.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-26T19:40:18.000Z",
    "description": "\n\tOn today’s episode of “Daily Variety” podcast, we’ll hear from Jon Brockett, who is executive producer and showrunner of Sunday’s Actor Awards. The ",
    "body": "\n\tOn today’s episode of “Daily Variety” podcast, we’ll hear from Jon Brockett, who is executive producer and showrunner of Sunday’s Actor Awards. The kudocast veteran discusses producing a live event for Netflix without strict time limit considerations, showcasing host Kristen Bell, paying tribute to Harrison Ford’s long career and invoking vintage Hollywood glamour.\n\n\tThe Actor Awards will have its third outing on Netflix this year. Brockett says the move to the streaming giant has “given us much more freedom because there was always this pressure that we had to come in at 11 o’clock eastern time, that we could not go any later. the goal for us with Netflix was let’s give the show a little bit of room to breathe.”\n\t\n\n\tAt the same time, Brockett emphasizes, producers are cognizant of not wearing out their welcome with viewers. \n\n\t“There’s no one asking for another three or three and a half hour award show, in my opinion. I love that we’re around two hours because we’re sort of a sprint. We’re not a marathon — people can get in and and have a great entertaining time and watch the show and then they’re done. It’s not this long slog of other awards that may not be what people want to watch. We’re all actors. We’re what everybody wants to see. That’s one of the things that we’re really leaning into,” Brockett says.\n\n\tBrockett promises that Kristen Bell, who is on her third hosting stint, will again open the show with a musical number featuring timely lyrics about the state of Hollywood and sundry things.\n\n\t“The goal is to make it even better than last year’s opening number,” Brockett says. “We’re really excited about it because she’s just so charming and funny. She’s just the whole package.”\n\t\n\n\tAnother element that Brockett hopes will stand out to viewers this year is a conscious effort invoke old-school Hollywood glamour as a theme that extends through the night, on the set and in the frocks and formal wear donned by guests.\n\n\t“Part of our approach with the show this year is escapism,” he says. “Just sit back for two hours — or three hours if you include the red carpet show — and enjoy all the moments on the carpet, enjoy the moments from the show. Get away from thinking about what’s going on in the world and just enjoy this night of TV, live on Netflix.”\n\n\tListen to Daily Variety on iHeartPodcasts, Apple Podcasts, Variety’s YouTube Podcast channel, Amazon Music, Spotify and other podcast platforms.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "LISTEN: ‘We’re a Sprint’: Actor Awards EP Jon Brockett on Producing the Live Kudocast for Netflix",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Shutterstock-for-The-Actor-Awards3-e1772134453294.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-26T19:40:18.000Z",
      "dateModified": "2026-02-26T19:40:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ex-‘Bachelor’ Host Chris Harrison Sets New Dating Series on Fox Nation About ‘Traditional Marriage’",
    "url": "https://variety.com/2026/tv/news/chris-harrison-fox-nation-dating-show-1236673816/",
    "image": "https://variety.com/wp-content/uploads/2026/02/GettyImages-2242434164-1.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-26T19:40:47.000Z",
    "description": "\n\tNearly five years after his controversial exit as the host of the “Bachelor” franchise, Chris Harrison is making his return to reality TV.\n\n\tFox Nat",
    "body": "\n\tNearly five years after his controversial exit as the host of the “Bachelor” franchise, Chris Harrison is making his return to reality TV.\n\n\tFox Nation has greenlit a new dating series for people seeking a “traditional marriage” with Harrison as host and an expected premiere in 2027. Before Fox Nation’s involvement was known, Harrison posted a casting call for the project on Instagram, saying the show was looking for single men and women age 21 and older “who want a traditional, marriage-minded partnership built on commitment and shared values. We’re looking for singles who believe in clear roles, long-term commitment, and building a life together — and who are dating with real intention. \n\t\n\n\tThe official logline for the series reads, “Several women will embark on a relationship journey designed for individuals seeking lasting commitment. Blending romance, real-world compatibility tests and emotionally charged eliminations, the series reimagines modern dating through the lens of shared values, authenticity and the goal of marriage.”\n\n\n\tHarrison isn’t the only “Bachelor” alum working on the currently untitled series. Other previous “Bachelor” producers on board include Louis Caris as executive producer, Elan Gale as consulting producer, Linday Liles as casting director and Michael Shea as director. Executive producers also include Harrison’s wife, Lauren Zima, plus Lionsgate Alternative Television executives Nicholas Caprio and Tom Huffman.\n\n\tHarrison hosted “The Bachelor” and all of its spinoffs beginning in 2002, when the iconic reality dating series premiered. In 2021, he left the franchise after making racially insensitive comments while defending former contestant Rachael Kirkconnell, who was receiving online backlash over photos circulating online of her attending an antebellum plantation-themed party as a college student. Variety reported at the time that, after Harrison took a temporary hiatus from hosting when the controversy began, his team became outraged with the dragging-out process” surrounding his return “and was unhappy with the network and studio not publicly supporting Harrison.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ex-‘Bachelor’ Host Chris Harrison Sets New Dating Series on Fox Nation About ‘Traditional Marriage’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/GettyImages-2242434164-1.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-26T19:40:47.000Z",
      "dateModified": "2026-02-26T19:40:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Former Château de Versailles President Catherine Pégard Appointed France’s Culture Minister, Succeeding Rachida Dati",
    "url": "https://variety.com/2026/film/global/catherine-pegard-france-culture-minister-rachida-dati-1236673764/",
    "image": "https://variety.com/wp-content/uploads/2026/02/GettyImages-2235730044.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-26T19:14:53.000Z",
    "description": "\n\tCatherine Pégard, a former film journalist who previously worked in Nicolas Sarkozy’s cabinet and headed the Château de Versailles, has been appoint",
    "body": "\n\tCatherine Pégard, a former film journalist who previously worked in Nicolas Sarkozy’s cabinet and headed the Château de Versailles, has been appointed France’s culture minister. \n\n\tPégard succeeds Rachida Dati, who handed her resignation to French President Emmanuel Macron on Wednesday morning to pursue her ambition to become mayor of Paris which she described as “the battle of my life.” The municipal elections are starting in two and a half weeks. \n\t\n\n\tThe appointment of Pégard was unveiled on Thursday, hours before the start of the César Awards ceremony, France’s equivalent to the Oscars. \n\n\n\tAfter presiding over the Chateau de Versailles for 13 years, Pegard was appointed director of cultural development at Afalula, the French agency co-managing the development of the Al-Ula heritage site in Saudi Arabia. She most recently worked as Macron’s advisor on cultural affairs.  \n\n\tDati, who stayed in post for two years despite several government reshuffles, spearheaded the culture and rurality plan to promote access to culture in rural areas. She also reportedly fought to limit cuts to the culture budget which amounts to €4.2 billion — €200 million less than in 2025. Dati also led a push to include a panel on culture during last year’s AI Summit which was organized by the Elysée Palace. \n\n\tPégard could be the last culture minister appointed by Macron, whose second mandate will end next year. As France battles to reduce its national debt, the film and TV industry has been concerned about potential further cuts to budgets. The National Film Board (CNC), which backs the sector, has also been criticized in light of declining box office results.  \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Former Château de Versailles President Catherine Pégard Appointed France’s Culture Minister, Succeeding Rachida Dati",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/GettyImages-2235730044.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-26T19:14:53.000Z",
      "dateModified": "2026-02-26T19:14:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Julia Louis-Dreyfus, Cecily Strong Dramedy ‘Nanny Squatter’ Nears Series Order at Apple (EXCLUSIVE)",
    "url": "https://variety.com/2026/tv/news/julia-louis-dreyfus-cecily-strong-apple-series-1236672999/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Julia-Louis-Dreyfus-Cecily-Strong.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-26T20:00:00.000Z",
    "description": "\n\tApple is nearing a greenlight for a limited series starring Julia Louis-Dreyfus and Cecily Strong, Variety has learned exclusively. \n\n\tThe limited d",
    "body": "\n\tApple is nearing a greenlight for a limited series starring Julia Louis-Dreyfus and Cecily Strong, Variety has learned exclusively. \n\n\tThe limited dramedy is inspired by the New York Magazine article “The Nanny Squatter” by Bindu Bansinath. Mary Bronstein is attached to write, direct, and serve as showrunner.\n\n\tThe logline states the show “centers on a couple whose lives are upended after welcoming a seemingly ideal caregiver into their home, only to find boundaries blurred and control slipping as the arrangement spirals into a tense, unsettling power struggle.” \n\t\n\n\tBoth Louis-Dreyfus and Strong are executive producers on the show, with Bronstein executive producing along with Scoop Wasserstein of New York Magazine. Apple Studios will produce. \n\n\n\tLouis-Dreyfus is one of the greatest and most celebrated comedy actresses of all time. She is a 26-time Emmy Award nominee and an 11-time winner. Her wins include: one for her work in the seminal sitcom “Seinfeld;” one for “The New Adventures of Old Christine,” which ran for five seasons on CBS; and six consecutive wins for best actress in a comedy for leading the HBO political comedy “Veep,” with Louis-Dreyfus also sharing in the show’s three wins for outstanding comedy series. \n\n\tStrong previously starred in the Apple TV musical comedy series “Schmigadoon,” which ran for two seasons and inspired a live stage show of the same name. She is best known for her time on “Saturday Night Live,” where she worked as a cast member from 2012 to 2022. She received two Emmy nominations for her work on the show in 2020 and 2021. She has also been in films like “The Bronze,” 2016’s “Ghostbusters,” and “Zootopia 2.” \n\t\n\n\tBronstein most recently wrote and directed the critically-acclaimed film “If I Had Legs I’d Kick You” starring Rose Byrne. The film had its world premiere at the 2025 Sundance Film Festival and was released by A24 in theaters in October of that year. Byrne has won a Golden Globe and numerous other accolades for the film, while she is currently nominated for an Academy Award for best actress. Bronstein also appeared onscreen in the film as Dr. Spring. Her other film credits include “Yeast,” in which she also starred in addition to directing.\n\n\tLouis-Dreyfus is repped by CAA and Latham & Watkins LLP. Strong is repped by CAA and Brillstein Entertainment Partners. Bronstein is repped by CAA, attorney David Krintzman and 42West. Vox Media Studios and New York Magazine are represented by CAA and Del Shaw.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Julia Louis-Dreyfus, Cecily Strong Dramedy ‘Nanny Squatter’ Nears Series Order at Apple (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Julia-Louis-Dreyfus-Cecily-Strong.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-26T20:00:00.000Z",
      "dateModified": "2026-02-26T20:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Back to the Future’ Star Crispin Glover Accused of Holding Former Model ‘Captive’ as ‘Sex Slave’ in New Lawsuit",
    "url": "https://variety.com/2026/film/news/back-to-the-future-star-crispin-glover-accused-former-model-sex-slave-lawsuit-1236673702/",
    "image": "https://variety.com/wp-content/uploads/2026/02/GettyImages-2170721246-1.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-26T20:00:58.000Z",
    "description": "\n\tCrispin Glover has been sued by an alleged former girlfriend who claims the “Back to the Future” actor used her for “sex and free labor” after lurin",
    "body": "\n\tCrispin Glover has been sued by an alleged former girlfriend who claims the “Back to the Future” actor used her for “sex and free labor” after luring her with the promise of a job opportunity in Los Angeles.\n\n\tAccording to a civil complaint filed Wednesday and obtained by Variety, Glover is being accused of “battery, fraud, wrongful eviction, malicious prosecution, intentional infliction of emotional distress, and bane act violations, stemming from a disturbing series of incidents in which Jane Doe was essentially held captive and used for sex and free labor by Mr. Glover under false pretenses.” \n\t\n\n\tDoe, described as a 30-year-old former model from the U.K., claims she was “lured and manipulated” into moving to L.A. to work for Glover as his assistant in the entertainment industry. According to the lawsuit, the two first connected through social media in 2015, and Glover allegedly made “strange advances” and encouraged her for years to come to L.A. In 2023, Doe and Glover met in person in Dresden, Germany, where he allegedly showed her items of Nazi memorabilia from his personal collection. \n\n\n\tThe complaint reports that during a series of calls and correspondence in 2023, Glover “groomed Jane Doe with promises of a new life where she could start over and have a career in the entertainment industry through some sort of business relationship with him.” She ultimately moved to L.A. in early 2024.\n\n\t“But when Ms. Doe took the bait and uprooted herself and moved to Los Angeles, she found herself in a disturbing situation where Mr. Glover wanted to control her actions and track her whereabouts and basically serve him as a live in girlfriend/sex slave,” the lawsuit reports. \n\t\n\n\tAfter she refused to comply with his “increasingly bizarre and inappropriate demands,” Doe alleges she was unlawfully evicted and that Glover filed false legal actions against her, including a fraudulent petition for a restraining order.\n\n\tIn a statement shared with Variety, a lawyer for Glover said, “Mr. Glover denies these baseless allegations in the strongest possible terms. The reality is that on March 2, 2024, Mr. Glover was the victim of an unprovoked felony assault by Jane Doe at his Los Angeles residence. Mr. Glover called LAPD, which came to the scene, investigated, and arrested Jane Doe. These facts are documented by law enforcement records and by the restraining order filed by Mr. Glover against Jane Doe at that time. Mr. Glover intends to vigorously defend himself and pursue all available relief. He is confident the judicial process will expose this lawsuit as a meritless fabrication.”\n\n\tGlover is known for his role as the clumsy George McFly in 1985’s “Back to the Future.” His other credits include “Charlie’s Angels,” “Alice in Wonderland,” “Willard” and “River’s Edge.” \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Back to the Future’ Star Crispin Glover Accused of Holding Former Model ‘Captive’ as ‘Sex Slave’ in New Lawsuit",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/GettyImages-2170721246-1.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-26T20:00:58.000Z",
      "dateModified": "2026-02-26T20:00:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Lisa Rinna Speaks Out on Allegedly Being Drugged at ‘Traitors’ Premiere Party: ‘I Had Fentanyl in My System’ After Taking Test",
    "url": "https://variety.com/2026/tv/news/lisa-rinna-drugged-fentanyl-traitors-party-1236673749/",
    "image": "https://variety.com/wp-content/uploads/2026/02/lisa-brinna.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-26T18:39:46.000Z",
    "description": "\n\tLisa Rinna has spoken out after a report claimed she had been drugged at “The Traitors” Season 4 premiere party in January.\n\n\tThe reality TV star ap",
    "body": "\n\tLisa Rinna has spoken out after a report claimed she had been drugged at “The Traitors” Season 4 premiere party in January.\n\n\tThe reality TV star appeared on “Good Day New York” and told hosts Jerry O’Connell and Rosanna Scotto that she had fentanyl and amphetamines in her system after the Jan. 8 party. TMZ was first to report on Monday that Rinna thought she had been roofied with something at the party, which took place at The Abbey in West Hollywood. According to TMZ, Rinna’s “Traitors” co-star Colton Underwood noticed that she was “completely inebriated” despite not drinking much and notified Rinna’s team after he became concerned. Rinna said she left the party and thanked her husband, Harry Hamlin, for helping her.\n\t\n\n\tWhen asked by the hosts if she was certain she’d been roofied, Rinna said, “Yes, I was. I had fentanyl in my system.”\n\n\n\tAfter the hosts expressed shock, she said she took a test after the party: “I’m not kidding. I had fentanyl, high levels of amphetamines and other things. But I can’t talk a lot about it because we’re still dealing with it. It was leaked, and my team is dealing with it now.”\n\n\tRinna, who’s appeared on “Days of Our Lives,” “Melrose Place” and reality shows like “Real Housewives of Beverly Hills,” “Dancing With the Stars” and more, was selected as one of the traitors on Season 4 of the Peacock series. She was known for her rivalry with “Bachelor” alum Underwood and butting heads with her fellow traitor, “Love Island’s” Rob Rausch. The season finale airs Thursday night.\n\n\tRinna added about her alleged drugging, “So many people that I know have had this happen at the Abbey. All my daughter’s friends. I mean, this is not a first-time thing. This is something that’s gone on for years. And I do think it needs to be a conversation. And I’m glad now that it’s out and we will deal with it. I just haven’t had my own time to do that yet.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lisa Rinna Speaks Out on Allegedly Being Drugged at ‘Traitors’ Premiere Party: ‘I Had Fentanyl in My System’ After Taking Test",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/lisa-brinna.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-26T18:39:46.000Z",
      "dateModified": "2026-02-26T18:39:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Variety Announces 2026 Entertainment Marketing Summit Program Featuring Tina Knowles and Warner Bros. Motion Picture Group Co-Chair Pam Abdy",
    "url": "https://variety.com/2026/biz/news/entertainment-marketing-summit-tina-knowles-pam-abdy-1236673781/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Tina-Knowles-and-Pam-Abdy.jpg?crop=0px%2C29px%2C1000px%2C562px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-02-26T19:01:49.000Z",
    "description": "\n\tVariety has announced the first speakers for the 2026 Entertainment Marketing Summit, presented by Deloitte, on April 22 in Los Angeles, including T",
    "body": "\n\tVariety has announced the first speakers for the 2026 Entertainment Marketing Summit, presented by Deloitte, on April 22 in Los Angeles, including Tina Knowles and Warner Bros Motion Picture Group co-chair and CEO Pam Abdy. The summit also includes conversations with Emmy-winning design expert and TV host Bobby Berk and TV personality, host and entrepreneur Harry Jowsey.\n\tKnowles, the visionary businesswoman, fashion designer, art collector, philanthropist and activist, will delve into her best-selling memoir “Matriarch” and discuss her influential work with Parkwood Entertainment, Cécred, BeyGOOD and more. \n\t\n\tAbdy will highlight Warner Bros.’ exceptional commitment to storytelling, its over $4 billion global box office in 2025, and its historic Oscar success, including “Sinners” with a record 16 nominations and “One Battle After Another” with 13. Dwight Caines, President, Domestic Marketing at Universal Pictures, Josh Goldstine, Global President, Marketing and Distribution at Paramount Pictures and Shauna Spenley, Global Chief Marketing Officer at Warner Bros. Streaming will come together for a keynote roundtable to share their strategies developing compelling campaigns for new films and TV series. Berk and Jowsey will participate in the roundtable discussion “Entertainment Entrepreneurs Tell All.” “Variety’s Entertainment Marketing Summit brings together the leaders shaping the future of entertainment marketing, and Deloitte is proud to return as presenting sponsor in 2026,” said Danny Ledger, US Telecom, Media & Entertainment Leader, Deloitte Consulting LLP. “From experiential and live engagement to AI-driven innovation and the continued growth of the creator economy, this year’s agenda highlights the strategies redefining how brands connect with audiences. We look forward to joining these important conversations and helping drive what’s next for the industry.” Additional speakers, with more soon to be announced, include the following:  Josh Silverman, president of consumer products and experiences, Paramount Amy Durini, chief marketing & strategy officer, Taco Bell International Sean Booker, head of media and entertainment, VizioJames Finn, global head of brand & content marketing, Audible Kathryn Kai-Ling, CMO, Los Angeles Rams Tim Clark, chief brand officer, NASCAR Alana Dolgin, president, digital marketing, Atlantic Music Group and President at Homemade Projects Rose Phillips, EVP, global digital and social marketing, Sony Pictures Entertainment Margaret Walker, EVP, entertainment marketing at NBCUniversal Claudine Cheever, CMO, Pinterest Nicole Parlapiano, CMO, Tubi Kayleen Walters, head of Mojang Studios (Minecraft) and franchise development for gaming, Microsoft Brian Borkowski, CMO, Fox Direct-to-Consumer Jim Squires, CMO, Reddit Jasmine Taylor, VP, brand marketing, Instacart Topics include: Building the Brand-Verse – Success with Franchises: An exploration into best strategies for bringing beloved characters and storylines to new audience touch points, spanning sequels, podcasts, video games, spin-offs, digital content, merchandise, themed attractions and more. The Main Event – Best of Experiential, Live and Event Marketing: In a noisier than ever media environment, marketers are pulling out all the stops to break through to today’s audiences through in-person moments. Hear from event marketing leaders across entertainment, sports and consumer brands as they share their strategies for success. New Leaders of Creator Marketing: Marketing leaders share their views on today’s creator economy and what goes into a marketing strategy that connects. In the Director’s Chair – Brand Storytelling Masters: Leaders in brand storytelling explore how the growth of media platforms can help brands break through across varied demographics. Breakthrough Brands – Innovating through AI: An exploration into how companies are integrating AI into their operations in ways that take advertising and marketing to new heights.  Additional speakers and sessions to be announced. Deloitte is the presenting sponsor of the summit. The Los Angeles Film School and Vizio are supporting partners. Reserve your ticket here: variety.com/entmar.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Variety Announces 2026 Entertainment Marketing Summit Program Featuring Tina Knowles and Warner Bros. Motion Picture Group Co-Chair Pam Abdy",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Tina-Knowles-and-Pam-Abdy.jpg?crop=0px%2C29px%2C1000px%2C562px&resize=1000%2C563"
      ],
      "datePublished": "2026-02-26T19:01:49.000Z",
      "dateModified": "2026-02-26T19:01:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Final Actor Winner Predictions: The Circuit’s Last Stop Could Bring Upset Potential for Michael B. Jordan, Benicio Del Toro and More",
    "url": "https://variety.com/lists/sag-awards-predictions-winners-2026/",
    "image": "https://variety.com/wp-content/uploads/2026/02/SAG-Awards-Predictions-2.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-26T20:15:47.000Z",
    "description": "\n\n\tThe awards season train is pulling into its penultimate stop before heading to the Dolby Theatre.\n\n\tThe last stop before Oscar voting closes is oft",
    "body": "\n\n\tThe awards season train is pulling into its penultimate stop before heading to the Dolby Theatre.\n\n\tThe last stop before Oscar voting closes is often where narratives harden, momentum crystallizes, and actors — the Academy’s largest voting bloc — make their collective preferences known. The Actor Awards (formerly SAG Awards), which are voted on by the over 160,000 SAG-AFTRA members, have long been one of the most reliable bellwethers in the race, particularly in performance categories, where overlap with the Academy’s acting branch is strongest. This year’s slate is no exception, offering a mix of blockbuster muscle, prestige drama and a few inspired curveballs.\n\n\tIn the top category for best cast ensemble, the battle (pun intended) appears to center on the cultural force of Ryan Coogler’s vampire drama “Sinners” versus Paul Thomas Anderson’s sprawling political epic “One Battle After Another.”\n\n\tThe former, powered by Michael B. Jordan and an electric supporting lineup, has the kind of across-the-board strength that signals broad industry passion. There are many things to consider when projecting who will walk away with the prize. Timothée Chalamet is back in the running for “Marty Supreme,” after winning the SAG prize last year for “A Complete Unknown.” Notably, no one has ever won two consecutive film awards in the same category (Renee Zellweger won back-to-back for “Chicago,” 2002, in lead and “Cold Mountain,” 2003, in supporting). Does that mean he won’t win? Not necessarily, but it is evidence worth considering. His challengers seem to be Jordan’s turn as twin brothers in Coogler’s film, Leonardo DiCaprio as the pothead revolutionary father from “One Battle,” and Ethan Hawke as musician Lorenz Hart in “Blue Moon.”\n\n\tMuch of the season, I’ve been on record believing that Hawke would be the type of last-minute victory that propels someone over the finish line. There has been a considerable momentum shift towards “Sinners,” especially over the last few weeks since it broke the all-time Oscar nomination record. SAG voters tend to lean populist in their selections, and while Hawke is still possible, we’re predicting an eleventh-hour victory for Jordan.\n\n\tThat is also expected to bleed into other categories, such as cast ensemble and his co-star supporting actress for Wunmi Mosaku, on the upswing following her BAFTA victory. Close on her heels are Critics Choice winner Amy Madigan from “Weapons” and Golden Globe victor Teyana Taylor from “One Battle After Another.”\n\n\tWith “Hamnet,” a quieter, more intimate showcase, it represents the kind of actor’s toolbelt they love to reward. Its star, Jessie Buckley, is expected to continue her season sweep. Rose Byrne has many TV connections, which probably give her a slight edge as the runner-up, but Kate Hudson has deep industry connections that also give her a boost.\n\n\tSupporting actor will be where you bite your fingernails down low. Thus far, like the supporting actress category, we’ve had a different winner at every ceremony. Sean Penn from “One Battle After Another” is off his surprise BAFTA victory, although he wasn’t present. His co-star Benicio Del Toro has won the most critics’ awards this year, but has yet to be seen on stage with a prize in hand. The other season CCA winner, Jacob Elordi from “Frankenstein” and Golden Globe winner (and absent SAG nominee) Stellan Skarsgård from “Sentimental Value.” The other SAG nominee is the Oscar-nomination-less Paul Mescal from “Hamnet.” If Mescal wins, expect complete anarchy on Oscar night.\n\n\tWith stunt performers also taking center stage — where “F1” roars with race cars, it could push past the swan song of Ethan Hunt a.k.a. Tom Cruise from “Mission: Impossible — The Final Reckoning.”\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tApple TV\n\t\n\n\n\n\tOn the television side, there isn’t much room for surprises, but we’re open to them.\n\n\tAfter winning their top Emmys categories, HBO Max’s drama series “The Pitt” and Apple TV’s “The Studio” are expected to take home the ensemble races, along with their leading men — Noah Wyle and Seth Rogen.\n\n\tOn the female actor side, Rhea Seehorn could continue her favored Emmy run for this coming year with the freshman drama series “Pluribus.” On the female comedy actor side of the house, Jean Smart is always a threat in the category, never losing an award for “Hacks.” However, the sudden and sad passing of veteran actor Catherine O’Hara from “The Studio,” may have garnered many sympathy votes, which could make her the first posthumous TV acting winner, the first woman posthumously in any of the categories, and the third overall after Heath Ledger from “The Dark Knight” (2008) and Chadwick Boseman from “Ma Rainey’s Black Bottom” (2020). Notably, many of Kristen Wiig’s castmates, such as Ricky Martin and Carol Burnett, have been publicly supporting their three-time SAG-nominated actress under the hashtag #TisTime, to try to secure her a first-ever win for the Apple TV series.\n\n\tIn the two limited series races (when are we getting an ensemble category for these already?), they are where the flip-coins may come, where Emmy-winning co-stars Stephen Graham and Owen Cooper are facing off against one another from “Adolescence” — we’re predicting the 52-year-old veteran former to walk away with that one.\n\n\tAlso, from “Adolescence,” Erin Doherty, who won supporting actress (limited) at the Emmys, will face a steeper hill with her co-star Christine Tremarco, also nominated, and big names such as Sarah Snook from “All Her Fault,” Claire Danes from “The Beast in Me” and Michelle Williams from “Dying for Sex.” We think Snook takes it home.\n\n\tThe complete predictions are below.\n\n\n\t\t\t\n\t\t\t\n\tFILM\n\t\t\t\t\n\t\t\n\t\t\t\n\t\t\t\n\tCast Ensemble in a Motion Picture\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Warner Bros.\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\n“Frankenstein” (Netflix)David Bradley, Christian Convery, Charles Dance, Jacob Elordi, Mia Goth, Oscar Isaac, Felix Kammerer, Lars Mikkelsen, and Christoph Waltz\n“Hamnet” (Focus Features)Joe Alwyn, Jessie Buckley, Noah Jupe, Paul Mescal, and Emily Watson\n“Marty Supreme” (A24)Odessa A’zion, Sandra Bernhard, Timothée Chalamet, Emory Cohen, Fran Drescher, Abel Ferrara, Penn Jillette, Koto Kawaguchi, Luke Manley, Tyler Okonma, Kevin O’Leary, Gwyneth Paltrow, Géza Röhrig, and Larry Sloman\n“One Battle After Another” (Warner Bros.)Benicio del Toro, Leonardo DiCaprio, Regina Hall, Chase Infiniti, Sean Penn, and Teyana Taylor\n“Sinners” (Warner Bros.)Miles Caton, Buddy Guy, Michael B. Jordan, Jayme Lawson, Delroy Lindo, Omar Miller, Wunmi Mosaku, Jack O’Connell, and Hailee Steinfeld\n\n\n\n\tWill Win: “Sinners”Could Win: “One Battle After Another”Should Win: “Hamnet”Should Have Been Nominated: “Nouvelle Vague”\n\n\t\t\n\t\t\t\n\t\t\t\n\tMale Actor in a Leading Role\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: ©Warner Bros/Courtesy Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\nTimothée Chalamet, “Marty Supreme” (A24)\nLeonardo DiCaprio, “One Battle After Another” (Warner Bros.)\nEthan Hawke, “Blue Moon” (Sony Pictures Classics)\nMichael B. Jordan, “Sinners” (Warner Bros.)\nJesse Plemons, “Bugonia” (Focus Features)\n\n\n\n\tWill Win: Michael B. JordanCould Win: Ethan HawkeShould Win: Michael B. JordanShould Have Been Nominated: Wagner Moura, “The Secret Agent”\n\n\t\t\n\t\t\t\n\t\t\t\n\tMale Actor in a Supporting Role\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Warner Bros.\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\nMiles Caton, “Sinners” (Warner Bros.)\nBenicio Del Toro, “One Battle After Another” (Warner Bros.)\nJacob Elordi, “Frankenstein” (Netflix)\nPaul Mescal, “Hamnet” (Focus Features)\nSean Penn, “One Battle After Another” (Warner Bros.)\n\n\n\n\tWill Win: Benicio Del ToroCould Win: Sean PennShould Win: Miles CatonShould Have Been Nominated: Aidan Delbis, “Bugonia”\n\n\t\t\n\t\t\t\n\t\t\t\n\tFemale Actor in a Supporting Role\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Warner Bros.\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\nOdessa A’zion, “Marty Supreme” (A24)\nAriana Grande, “Wicked: For Good” (Universal Pictures)\nAmy Madigan, “Weapons” (Warner Bros.)\nWunmi Mosaku, “Sinners” (Warner Bros.)\nTeyana Taylor, “One Battle After Another” (Warner Bros.)\n\n\n\n\tWill Win: Wunmi MosakuCould Win: Amy MadiganShould Win: Odessa A’zionShould Have Been Nominated: Da’Vine Joy Randolph, “Eternity”\n\n\t\t\n\t\t\t\n\t\t\t\n\tStunt Ensemble in a Motion Picture\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: ©Warner Bros/Courtesy Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\n“F1” (Apple Original Films/Warner Bros.)\n“Frankenstein” (Netflix)\n“Mission: Impossible — The Final Reckoning” (Paramount Pictures)\n“One Battle After Another” (Warner Bros.)\n“Sinners” (Warner Bros.)\n\n\n\n\tWill Win: “F1”Could Win: “Mission: Impossible — The Final Reckoning”Should Win: “F1”Should Have Been Nominated: “Superman”\n\n\t\t\n\t\t\t\n\t\t\t\n\tTELEVISION\n\t\t\t\t\n\t\t\n\t\t\t\n\t\t\t\n\tCast Ensemble in a Drama Series\n\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\n\n\n“The Diplomat” (Netflix)Ali Ahn, Penny Downie, Rosaline Elbay, Ato Essandoh, David Gyasi, Rory Kinnear, Nana Mensah, Graham Miller, Keri Russell, and Rufus Sewell\n“Landman” (Paramount+)Paulina Chávez, Mark Collie, Sam Elliott, Colm Feore, Andy Garcia, James Jordan, Ali Larter, Jacob Lofland, Caleb Martin, Demi Moore, Michelle Randolph, Mustafa Speaks, Billy Bob Thornton, and Kayla Wallace\n“The Pitt” (HBO Max)Amielynn Abellera, Shabana Azeez, Patrick Ball, Isa Briones, Jalen Thomas Brooks, Taylor Dearden, Fiona Dourif, Supriya Ganesh, Joanna Going, Gerran Howell, Michael Hyatt, Tracy Ifeachor, Katherine LaNasa, Krystel V. McNeil, Brandon Mendez Homer, Alexandra Metz, Tracy Vilar, Kristin Villanueva, and Noah Wyle\n“Severance” (Apple TV)Patricia Arquette, Sarah Bock, Michael Chernus, Zach Cherry, Dichen Lachman, Britt Lower, Darri Ólafsson, Adam Scott, Tramell Tillman, Jen Tullock, John Turturro, and Christopher Walken\n“The White Lotus” (HBO Max)Leslie Bibb, Carrie Coon, Nicholas Duvernay, Arnas Fedaravicius, Christian Friedel, Scott Glenn, Walton Goggins, Jon Gries, Dom Hetrakul, Sarah Catherine Hook, Jason Isaacs, Yuri Kolokolnikov, Julian Kostov, Charlotte Le Bon, Lalisa Manobal, Michelle Monaghan, Sam Nivola, Morgana O’Reilly, Lek Patravadi, Shalini Peiris, Parker Posey, Sam Rockwell, Natasha Rothwell, Patrick Schwarzenegger, Tayme Thapthimthong, and Aimee Lou Wood\n\n\n\n\tWill Win: “The Pitt”Could Win: “Severance”Should Win: “The Pitt”Should Have Been Nominated: “Andor”\n\n\t\t\n\t\t\t\n\t\t\t\n\tCast Ensemble in a Comedy Series\n\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\n\n\n“Abbott Elementary” (ABC)\n“The Bear” (FX)\n“Hacks” (HBO Max)\n“Only Murders in the Building” (Hulu)\n“The Studio” (Apple TV)\n\n\n\n\tWill Win: “The Studio”Could Win: “Hacks”Should Win: “The Studio”Should Have Been Nominated: “The Paper” \n\n\t\t\n\t\t\t\n\t\t\t\n\tMale Actor in a Drama Series\n\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\n\n\nSterling K. Brown, “Paradise” (Hulu)\nBilly Crudup, “The Morning Show” (Apple TV)\nWalton Goggins, “The White Lotus” (HBO Max)\nGary Oldman, “Slow Horses” (Apple TV)\nNoah Wyle, “The Pitt” (HBO Max)\n\n\n\n\tWill Win: Noah WyleCould Win: Sterling K. BrownShould Win: Noah WyleShould Have Been Nominated: Ethan Hawke, “The Lowdown”\n\n\t\t\n\t\t\t\n\t\t\t\n\tFemale Actor in a Drama Series\n\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\n\n\nBritt Lower, “Severance” (Apple TV)\nParker Posey, “The White Lotus” (HBO Max)\nKeri Russell, “The Diplomat” (Netflix)\nRhea Seehorn, “Pluribus” (Apple TV)\nAimee Lou Wood, “The White Lotus” (HBO Max)\n\n\n\n\tWill Win: Rhea SeehornCould Win: Britt LowerShould Win: Rhea SeehornShould Have Been Nominated: Katherine LaNasa, “The Pitt”\n\n\t\t\n\t\t\t\n\t\t\t\n\tMale Actor in a Comedy Series\n\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\n\n\nIke Barinholtz, “The Studio” (Apple TV)\nAdam Brody, “Nobody Wants This” (Netflix)\nTed Danson, “A Man on the Inside” (Netflix)\nSeth Rogen, “The Studio” (Apple TV)\nMartin Short, “Only Murders in the Building” (Hulu)\n\n\n\n\tWill Win: Seth RogenCould Win: Martin ShortShould Win: Seth RogenShould Have Been Nominated: Alexander Skarsgård, “Murderbot”\n\n\t\t\n\t\t\t\n\t\t\t\n\tFemale Actor in a Comedy Series\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Apple TV\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\nKathryn Hahn, “The Studio” (Apple TV)\nCatherine O’Hara, “The Studio” (Apple TV)\nJenna Ortega, “Wednesday” (Netflix)\nJean Smart, “Hacks” (HBO Max)\nKristen Wiig, “Palm Royale” (Apple TV)\n\n\n\n\tWill Win: Catherine O’HaraCould Win: Jean SmartShould Win: Catherine O’HaraShould Have Been Nominated: Hannah Einbinder, “Hacks”\n\n\t\t\n\t\t\t\n\t\t\t\n\tMale Actor in a TV Movie or Limited Series\n\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\n\n\nJason Bateman, “Black Rabbit” (Netflix)\nOwen Cooper, “Adolescence” (Netflix)\nStephen Graham, “Adolescence” (Netflix)\nCharlie Hunnam, “Monster: The Ed Gein Story” (Netflix)\nMatthew Rhys, “The Beast in Me” (Netflix)\n\n\n\n\tWill Win: Stephen GrahamCould Win: Owen CooperShould Win: Stephen GrahamShould Have Been Nominated: Brian Tyree Henry, “Dope Thief”\n\n\t\t\n\t\t\t\n\t\t\t\n\tFemale Actor in a TV Movie or Limited Series\n\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\n\n\nClaire Danes, “The Beast in Me” (Netflix)\nErin Doherty, “Adolescence” (Netflix)\nSarah Snook, “All Her Fault” (Peacock)\nChristine Tremarco, “Adolescence” (Netflix)\nMichelle Williams, “Dying for Sex” (FX)\n\n\n\n\tWill Win: Erin DohertyCould Win: Michelle WilliamsShould Win: Christine TremarcoShould Have Been Nominated: Lola Pettigrew, “Say Nothing”\n\n\t\t\n\t\t\t\n\t\t\t\n\tStunt Ensemble in a Television Series\n\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\n\n\n“Andor” (Disney+)\n“Landman” (Paramount+)\n“The Last of Us” (HBO Max)\n“Squid Game” (Netflix)\n“Stranger Things” (Netflix)\n\n\n\n\tWill Win: “Andor”Could Win: “Stranger Things”Should Win: “Andor”Should Have Been Nominated: “Severance”\n\n\t\t\n\t\n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Final Actor Winner Predictions: The Circuit’s Last Stop Could Bring Upset Potential for Michael B. Jordan, Benicio Del Toro and More",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/SAG-Awards-Predictions-2.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-26T20:15:47.000Z",
      "dateModified": "2026-02-26T20:15:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "PGA Awards Predictions: Preferential Ballot Breakdown and the Pros and Cons for ‘One Battle After Another’ vs. ‘Sinners’",
    "url": "https://variety.com/lists/pga-awards-predictions-2026-sinners-one-battle-after-another/",
    "image": "https://variety.com/wp-content/uploads/2026/02/PGA-Predictions.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-26T18:20:00.000Z",
    "description": "\n\t\t\n\t\t\n\n\t\n\tFeb 26, 2026 10:20am PT\t\n\t\n\n\t\n\tPGA Awards Predictions: Preferential Ballot Breakdown and the Pros and Cons for ‘One Battle After Another’ v",
    "body": "\n\t\t\n\t\t\n\n\t\n\tFeb 26, 2026 10:20am PT\t\n\t\n\n\t\n\tPGA Awards Predictions: Preferential Ballot Breakdown and the Pros and Cons for ‘One Battle After Another’ vs. ‘Sinners’\n\t\n\n\n\n\t\t\t\n\t\t\t\n\t\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\tWarner Bros.\n\t\n\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\n\t\t\n\n\tThe Producers Guild of America Awards have long held outsized influence in the Oscar conversation.One structural reason keeps them at the center of every best picture debate: the PGA uses a preferential ballot, the same vote-counting system the Academy uses to determine best picture.That matters because preferential voting doesn’t simply reward passion. It rewards broad consensus.\n\n\tIn a standard plurality vote, the film with passion wins. Under a preferential model, voters rank nominees, and if no film has a majority of first-place votes, the lowest-ranked title is eliminated, and its ballots are redistributed based on the next choices. That process continues until one film crosses 50% plus one.\n\n\tWhat that means is that it’s not the “most loved” film that wins. On the contrary, it’s the “most liked.” A divisive frontrunner can lose to a film that is widely popular across voting blocs. A movie that shows up as many voters’ second or third choice can outlast a movie that inspires intense support from one wing of the industry but resistance from others.\n\n\tThis season’s PGA 10 is also notable for nearly mirroring the Oscar best picture field, with one high-profile swap when “Weapons” made the PGA slate instead of Brazil’s “The Secret Agent.”\n\n\tWith the Feb. 28 ceremony approaching — where Amy Pascal, Jason Blum and Mara Brock Akil will receive honorary recognition — the final best picture puzzle is less about who is loudest and more about who is hardest to rank low.\n\n\tFinal Oscar voting runs from Feb. 26 to March 5. The 98th Oscars will be held March 15 on ABC, hosted by Conan O’Brien.\n\n\tBelow is a contender-by-contender look at the Darryl F. Zanuck Award nominees, with the case for and against each title:\n\n\n\t\t\t\n\t\t\t\n\t‘Bugonia’\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: ©Focus Features/Courtesy Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tFor:   The Yorgos Lanthimos-directed film has the profile of a movie that can generate real passion among voters who prioritize authorial risk, tonal ambition and singular filmmaking choices. In ranked-choice races, that kind of committed first-place bloc can be extremely valuable in early rounds, especially if the field is fragmented. It also helps the ambition of its central star, Emma Stone, who has proven to be a notable producer on her projects. Against:   The very qualities that create passion can also create resistance. Preferential systems are unforgiving to films that inspire “top or bottom” reactions, because surviving later rounds requires middle-ballot strength across a broad base of voters.\n\t\t\n\t\t\t\n\t\t\t\n\t‘F1’\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: ©Warner Bros/Courtesy Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tFor:   Apple’s ambitious racing flick from Joseph Kosinski appeals to a substantial slice of voters who value theatrical scale. In industry circles, a movie that demonstrates top-tier production logistics and commercial appeal can command respect beyond pure critics’ enthusiasm. Against:   Its central vulnerability is that it has respect without urgency. Films in this lane are often praised but not necessarily ranked first or second enough by voters to establish a clear winner.\n\t\t\n\t\t\t\n\t\t\t\n\t‘Frankenstein’\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: ©Netflix/Courtesy Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tFor:   Guillermo Del Toro’s monster epic has the potential to unite craft-first voters with story-first voters. Prestige genre can perform very well when it transcends category expectations and feels like a full-spectrum cinematic achievement. Against:   Genre friction remains a real factor in some corners of awards voting. Even when widely respected, genre-adjacent films can be treated as “craft triumphs” rather than top-prize choices. Also, if you’re a horror admirer, you might be more down with “Sinners.”\n\t\t\n\t\t\t\n\t\t\t\n\t‘Hamnet’\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: ©Focus Features/Courtesy Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tFor:   Chloé Zhao’s Shakespearean drama looks like a contender built for preferential stability. Films in this emotional mold are often hard for voters to rank at the bottom, which is a major asset. It also helps that it has familiar names like Oscar-winning Steven Spielberg and Sam Mendes. If the race gets chaotic, “Hamnet” could become the compromise winner many camps can live with — not necessarily everyone’s favorite, but consistently high enough to survive and then surge as more polarizing titles drop out. Against:   The main risk is that “Hamnet” becomes the race’s most admired and least championed film. There is a difference between being broadly liked and actively prioritized. It feels like the antithesis of the “One Battle” and “Marty Supreme” voter, who there are many of.\n\t\t\n\t\t\t\n\t\t\t\n\t‘Marty Supreme’\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Courtesy Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tFor:   The Timothée Chalamet sports vehicle can thrive as a possible “momentum” candidate. It’s a film that feels alive in conversation and is culturally relevant. If the growing love combines the type of unconventional energy the movie has shown (i.e., the marketing stunt of the orange blimp) with enough key blocs, it could be the spoiler that turns a two-film race into a reshuffle. Against:   Momentum can be noisy without being that deep. If support is concentrated in specific demographics, the Josh Safdie movie may struggle to find avenues to clear the required threshold.\n\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Warner Bros.\n\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tFor:   Paul Thomas Anderson’s action epic has the profile of a classic high-end contender with critical acclaim, a clear artistic identity, and strong support from the Hollywood community. In ranked voting, that can produce robust first place showing and meaningful downstream placements from voters who rate it just behind their top pick. And who won’t want to see PTA miss his overdue moment? Against:   Its threat profile is polarization by tone to some industry voters. If some see it as imposing or cold, they may place it too low. In addition, when it comes to ranked-choice voting, the season’s narrative has been “One Battle” vs. “Sinners” — and a “Sinners” voter can actively try to thwart its chances. Moreover, there may be a tiny bit of vote-siphoning from “Marty Supreme.”\n\t\t\n\t\t\t\n\t\t\t\n\t‘Sentimental Value’\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Courtesy Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tFor:   Joachim Trier’s Norwegian drama could be the stealth climber in a crowded field. Its intimacy, beloved by actor-driven and writing-sensitive voters, could be the secret sauce.  If larger contenders cancel each other out, voters often pivot to the movie that feels honest and least divisive. Against:   The biggest risk is simple voting physics. It’s a smaller-scale contender that can suffer if initial first-place totals are too low.\n\t\t\n\t\t\t\n\t\t\t\n\t‘Sinners’\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: ©Warner Bros/Courtesy Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tFor:   Ryan Coogler’s vampire epic has one of the strongest all-around pathways: major cultural heat, substantial critical conversation, and cross-branch enthusiasm. In terms of preferential treatment, it gives it two routes to victory — either first-place dominance or broad top-three durability. If it’s both a passion pick and a consensus pick, it becomes exceptionally hard to beat. Against:   With high visibility comes heightened scrutiny. Frontrunners often trigger countercoalitions, and preferential voting gives them a mechanism to consolidate around alternatives. If some voters do not want “Sinners” to win, they could align behind other challengers (i.e., “One Battle After Another” or “Hamnet”).\n\t\t\n\t\t\t\n\t\t\t\n\t‘Train Dreams’\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: ©Netflix/Courtesy Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tFor:   Clint Bentley’s beautiful “Train Dreams” benefits from the qualities that ranked systems were made for. It can be a middle of the road admired flick that keeps its chances alive while flashier contenders cannibalize one another. If it becomes the film voters love most as a final compromise, it could outperform more heavily branded rivals in the rounds that matter most, and perhaps surprise as Netflix’s first legitimate winner. Against:   The counterpoint is that consensus without urgency can plateau. A film can be everyone’s third choice and still lose to a contender with stronger placements.\n\t\t\n\t\t\t\n\t\t\t\n\t‘Weapons’\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Warner Bros.\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tFor:   Zach Cregger’s box-office horror hit enters the lineup, showing strong guild enthusiasm, and suggests the film connects strongly with at least one influential voting lane. This is the best kind of sign for supporting actress Oscar nominee Amy Madigan. Against:   The absence from the Oscar best picture lineup is still a major structural obstacle. In a season where PGA and Academy lineups otherwise overlap heavily, that makes it impossible to triumph.\n\t\t\n\t\t\t\n\t\t\t\n\tWhich Film Wins?\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Jordan Strauss/Invision/AP\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\tWill Win: “Sinners”  \n\n\tCould Win: “One Battle After Another”\n\n\tShould Have Been Nominated: “It Was Just an Accident” (Neon); “Nuremberg” (Sony Pictures Classics); “The Secret Agent” (Neon); “Sirāt” (Neon); “Sorry, Baby” (A24); “The Voice of Hind Rajab” (Willa)\n\n\t\t\n\t\n\t\n\n\t\n\n\t\t\n\n\t\n\t\tMore From Our Brands\n\t\n\t\n\t\t\n\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\n\tRolling Stone\n\n\t\t\t\t\tHere’s How You Can Watch the Season 4 Finale of ‘The Traitors’ Online for Free\t\t\n\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\n\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\n\tRobb Report\n\n\t\t\t\t\tThis Luxe Hotel in Turks and Caicos Will Help Perfect Your Tennis Game\t\t\n\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\n\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\n\tSportico\n\n\t\t\t\t\tMLS to Allow Teams to Sell Ads on Lower Back of Jerseys\t\t\n\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\n\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\n\tWWD\n\n\t\t\t\t\tCarolyn Bessette Kennedy’s Minimalistic Beauty: A Closer Look at Her Effortless Hair and Quiet Makeup\t\t\n\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\n\t\t\n\t\n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "PGA Awards Predictions: Preferential Ballot Breakdown and the Pros and Cons for ‘One Battle After Another’ vs. ‘Sinners’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/PGA-Predictions.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-26T18:20:00.000Z",
      "dateModified": "2026-02-26T18:20:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "France’s 2026 Cesar Awards Announced (Updating Live)",
    "url": "https://variety.com/2026/film/global/frances-2026-cesar-awards-announced-1236673826/",
    "image": "https://variety.com/wp-content/uploads/2026/01/MCDNOVA_ZX002.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-26T19:36:48.000Z",
    "description": "\n\tThe Cesar Awards, France’s equivalent to the Oscars and BAFTA’s, is unfolding this evening at the Olympia theater in Paris. \n\n\tThis 51st edition cou",
    "body": "\n\tThe Cesar Awards, France’s equivalent to the Oscars and BAFTA’s, is unfolding this evening at the Olympia theater in Paris. \n\n\tThis 51st edition could have a Hollywood flavor with Richard Linklater’s “Nouvelle Vague,” a love letter to the French cinematic movement known as the New Wave, leading the race with 10 nominations.\n\n\tJim Carrey will also receive this year’s honorary Cesar award. The actor was greeted by a long ovation. The ceremony’s host, French actor Benjamin Lavernhe, shed tears as he introduced Carrey who sat on the front row alongside Canal+ boss Maxime Saada and “The Artist” star Jean Dujardin. Lavernhe put on a musical show paying tribute to “The Mask,” impersonating Jim Carrey while dressed in the character’s iconic yellow suit. It was the splashiest kick-off of the Cesar ceremony in recent history. \n\t\n\n\tCamille Cottin (“Call My Agent!”) presided over the ceremony and delivered a sharply sarcastic monologue that took aim at mounting criticism of the National Film Board (CNC) and France’s subsidized film financing system at a time when the box office is under pressure.  \n\n\tCottin mocked those calling for French filmmakers to make more profitable movies. “As of today,” she quipped, “any director whose film draws fewer than 500,000 admissions will have to publicly apologize and go back to school — business school — to relearn their craft.” As for arthouse cinema, “Of course we’ll keep making those — but as short films. Ten minutes max. And let’s avoid niche topics like women, queer people, immigrants, nature or peace. It’s boring,” she said ironically.  \n\t\n\n\tHer speech then shifted to a graver tone. “It hurts to imagine a world where thought itself could be killed,” Cottin said. “Culture, universities, research, journalism — these are our lungs. They’re what keep us alive. Without them, we suffocate or turn on each other.”\n\n\t“French cinema is very much alive. It’s alive and fragile. In fact, I’d even say it’s alive because it’s fragile. You have to make many films for a few wonders to emerge. You have to train many people to strive for excellence. And it’s precisely because art is fragile that we must protect it,” she said. \n\n\tBesides “Nouvelle Vague,” strong Cesar contenders include Carine Tardieu’s intimate drama “L’attachement,” Dominik Moll’s procedural “Case 137,” set during France’s yellow vests protests and Stéphane Demoustier’s “The Great Arch,” a historical drama starring Claes Bang, with eight nominations each. They’re followed by Hafsia Herzi’s queer coming-of-age story “The Little Sister,” which is in the running with seven noms, and Thierry Kliffa’s “The Richest Woman in the World,” a film loosely based on the 2010 Bettencourt Affair and starring Isabelle Huppert, with six nominations. “Arco,” Ugo Bienvenu’s poetic animated feature produced by Natalie Portman is nominated for four Cesar Awards, alongside Francois Ozon‘s “The Stranger,” an adaptation of Albert Camus’ classic.\n\n\tPaul Thomas Anderson’s “Once Battle After Another” won the Cesar Award for best international feature, beating Joachim Trier’s “Sentimental Value,” Oliver Laxe’s “Sirat,” Kleber Mendonça Filho’s “The Secret Agent” and Guan Hu’s “Black Dog.”\n\n\tThe ceremony also boasted a tribute to French icon Brigitte Bardot who died on Dec. 28. \n\n\tMore to come. \n\n\tHere are the winners (bolded) of the 51st Cesar Awards: \n\n\tBest Film\n\n\t“L’attachement”“Case 137”“Nouvelle Vague”“The Little Sister”“It Was Just an Accident”Best DirectorCarine Tardieu, “L’attachement”Dominik Moll, “Case 137”Stéphane Demoustier, “The Great Arch”Richard Linklater, “Nouvelle Vague”Hafsia Herzi, “The Little Sister”Best ActressLeïla Bekhti, “Ma Mère, Dieu et Sylvie Vartan”Valeria Bruni Tedeschi, “L’attachement”Léa Drucker, “Case 137”Isabelle Huppert, “The Richest Woman in the World”Mélanie Thierry, “La Chambre de Mariana”Best ActorClaes Bang, “The Great Arch”Bastien Bouillon, “Leave One Day”Laurent Lafitte, “The Richest Woman in the World”Pio Marmaï, “L’attachement”Benjamin Voisin, “The Stranger”Best Supporting ActressJeanne Balibar, “Nino”Dominique Blanc, “Partir Un Jour”Marina Foïs, “The Richest Woman in the World”Ji-Min Park, “La Petite DernièreVimala Pons, “L’attachement”Best Supporting ActorSwann Arlaud, “The Great Arch”Xavier Dolan, “The Great Arch”Michel Fau, “The Great Arch”Pierre Lottin, “The Stranger”Raphaël Personnaz, “The Richest Women in the World”Best Female NewcomerManon Clavel, “Kika”Suzanne Lindon, “La Venue de l’Avenir”Nadia Melliti, “La Petite Dernière”Camille Rutherford, “Jane Austen a Gâché Ma Vie”Anja Verderosa, “L’Épreuve du Feu”Best Male NewcomerIdir Azougli, “Météors”Sayyid El Alami, “La Pampa”Félix Lefebvre, “L’Épreuve du Feu”Guillaume Marbeck, “Nouvelle Vague”Théodore Pellerin, “Nino”Best Original ScreenplayDominik Moll, Gilles Marchand, “Case 137”Pauline Loquès, “Nino”Holly Gent, Vince Palma, “Nouvelle Vague”Franck Dubosc, Sarah Kaminsky, “Un Ours Dans le Jura”Jafar Panahi, “It Was Just an Accident”Best Adapted ScreenplayCarine Tardieu, Raphaëlle Moussafir, Agnès Feuvre, “L’attachement”Stéphane Demoustier, “The Great Arch”Hafsia Herzi, “The Little Sister”\n\n\tBest Animated Feature\n\n\t“Little Amélie or the Character of Rain”\n\t\n\n\t“Arco”\n\n\t“My Castle Life: Growing Up in Versailles”Best International Film“The Secret Agent,” Kleber Mendonça Filho“Black Dog,” Guan Hu“Sirât,” Oliver Laxe“One Battle After Another,” Paul Thomas Anderson“Sentimental Value,” Joachim Trier\n\n\tBest Original Score  Arnaud Toulon, “Arco”Olivier Marguerit, “Case 137”Fatima Al Qadiri, “The Stranger”Alex Beaupain, “The Richest Woman in the World”Amine Bouhafa, “The Little Sister”Best Sound“Arco”“Le Chant des Forêts”“Case 137”“Nouvelle Vague”“Leave One Day”Best CinematographyElin Kirschfink, “L’attachement”Patrick Ghiringhelli, “Case 137”Marine Atlan, “L’Engloutie”Manu Dacosse, “The Stranger”David Chambille, “Nouvelle VagueBest EditingStan Collet, “13 Jours, 13 Nuits”Christel Dewynter, “L’attachement”Laurent Rouan, “Case 137”Catherine Schwartz, “Nouvelle Vague”Géraldine Mangenot, “The Little Sister”Best Costume Design Céline Guignard, “La Condition”Corinne Bruand, “Dracula”Jürgen Doering, “The Richest Woman in the World”Pascaline Chavanne, “Nouvelle Vague”Pierre-Yves Gayraud, “La Venue de l’Avenir”Best Production Design Jean-Philippe Moreaux, “Dog 51”Catherine Cosme, “L’Inconnu de la Grande Arche”Riton Dupire-Clément, “Once Upon My Mother”Katia Wyszkop, “Nouvelle Vague”Marie Cheminel, “La Venue de l’Avenir”Best Visual EffectsCédric Fayolle, “Dog 51”Rodolphe Chabrier, Benoît de Longlée, “L’Homme qui Rétrécit”Lise Fischer, “The Great Arch”Alain Carsoux, “Nouvelle Vague”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "France’s 2026 Cesar Awards Announced (Updating Live)",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/MCDNOVA_ZX002.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-26T19:36:48.000Z",
      "dateModified": "2026-02-26T19:36:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Guess The Influencer In Her Skivvies!",
    "url": "https://www.tmz.com/2026/02/26/guess-the-influencer-in-her-skivvies/",
    "image": "https://imagez.tmz.com/image/ae/16by9/2026/02/26/ae1ef7154acb44ea8fd43f58f10161cf_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-26T20:03:25.000Z",
    "description": "\n    \n                    \n                          Guess Who\n                          The Influencer In Her Undies Is !!!\n                      \n  ",
    "body": "\n    \n                    \n                          Guess Who\n                          The Influencer In Her Undies Is !!!\n                      \n                  \n                                                                        Published \n                              February 26, 2026\n                            12:03 PM PST\n                                                                            \n      \n    \n      \n        \n              \n    \n    \n          This influencer has no problem keeping up with the Kardashians ... constantly hanging around Kylie Jenner and co. -- can you guess who she is???\n      \n    \n          This star is a prominent presence online ... boasting more than 10 million followers -- and, one look at her body will tell you why.\n      \n    \n          BTW ... her Kardashians connection goes far past just personal -- because her skivvies are from SKIMS!\n      \n    \n          Ready for the reveal? Hit up the gallery, then play the game to find the hidden word!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Anastasia Karanikolaou\n              \n                          \n                Kylie Jenner\n              \n                          \n                Hotties & Bodies\n              \n                          \n                Hot Bodies\n              \n                          \n                Guess Who\n              \n                          \n                Influencers\n              \n                          \n                Culture\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Guess The Influencer In Her Skivvies!",
      "image": [
        "https://imagez.tmz.com/image/ae/16by9/2026/02/26/ae1ef7154acb44ea8fd43f58f10161cf_xl.jpg"
      ],
      "datePublished": "2026-02-26T20:03:25.000Z",
      "dateModified": "2026-02-26T20:03:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "TMZ Streaming Live, Come Into Our Newsroom and Watch Things Happen!",
    "url": "https://www.tmz.com/2026/02/26/watch-tmz-live-today/",
    "image": "https://imagez.tmz.com/image/bf/16by9/2026/02/26/bf2f2b0453fc4b26a5037128893b36bf_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-26T17:41:56.000Z",
    "description": "\n    \n                    \n                          TMZ Live Stream\n                          Come Into Our Office and Watch News Happen!!!\n         ",
    "body": "\n    \n                    \n                          TMZ Live Stream\n                          Come Into Our Office and Watch News Happen!!!\n                      \n                  \n                                                                        Published \n                              February 26, 2026\n                            9:41 AM PST\n                                                                      |\n                                                                Updated \n                                  February 26, 2026\n                                12:21 PM PST\n                                    \n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          We want you to be a part of TMZ, so every weekday, between 9:30 AM and 11:30 AM PT, we take you inside our newsroom via live stream.\n      \n    \n          You never know what you're gonna get ... a big story that breaks, an argument erupts in the room, or someone's just joking around.\n      \n    \n          Your comments are a big part of the stream, and the staff spends a lot of time speaking directly to you. Every day is different!\n      \n    \n          We also use our live stream to produce our \"TMZ Live\" TV show.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Celebrity News\n              \n                          \n                Live Stream\n              \n                          \n                Streaming\n              \n                          \n                TMZ Live\n              \n                          \n                Viral\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "TMZ Streaming Live, Come Into Our Newsroom and Watch Things Happen!",
      "image": [
        "https://imagez.tmz.com/image/bf/16by9/2026/02/26/bf2f2b0453fc4b26a5037128893b36bf_xl.jpg"
      ],
      "datePublished": "2026-02-26T17:41:56.000Z",
      "dateModified": "2026-02-26T17:41:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Judge Slams Shia LaBeouf for Homophobic Slur, Orders Drug Testing",
    "url": "https://www.tmz.com/2026/02/26/judge-chastises-shia-labeouf-for-slur/",
    "image": "https://imagez.tmz.com/image/f5/16by9/2026/02/26/f5304daf61f6405bb2975cf685d9c3fd_xl.png",
    "tag": "Entertainment",
    "date": "2026-02-26T17:54:21.000Z",
    "description": "\n    \n                    \n                          Shia LaBeouf\n                          Judge Slams Him for Shouting Gay Slur in NOLA Arrest\n     ",
    "body": "\n    \n                    \n                          Shia LaBeouf\n                          Judge Slams Him for Shouting Gay Slur in NOLA Arrest\n                      \n                  \n                                                                        Published \n                              February 26, 2026\n                            9:54 AM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          A judge absolutely tore into Shia LaBeouf in court today for his alleged copious use of the homophobic F-word during the actor's recent brouhaha in New Orleans ... and ordered him to participate in weekly drug tests.\n      \n    \n          In court Thursday, a judge determined Shia was not taking his addiction seriously and, by using a homophobic slur, he'd threatened the safety of a marginalized community that has gone through \"so much terror already.\"\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          As you know ... Shia has been charged with 2 counts of simple battery after he allegedly punched a bar worker, sparking a street melee that ended with Shia in handcuffs last week.\n      \n\n                  \n          \n                          \n                \n                  \n      \n    \n          What's more ... the judge ordered Shia to take a drug test down the hall. The results of the test turned up something -- not ethanol -- in his system. The found substance wasn't revealed in court, as it was a \"private health matter\" ... but it seemed to have influenced the judge's bond ruling.\n      \n    \n        \n                    \n                  \n      \n    \n          The judge set Shia's bail at $100K and required him to get drug and alcohol treatment and participate in weekly drug tests if released.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Shia LaBeouf\n              \n                          \n                Celebrity Arrests\n              \n                          \n                Celebrity News\n              \n                          \n                Crime & Arrests\n              \n                          \n                Shia LaBeouf Arrest\n              \n                          \n                Drugs & Alcohol\n              \n                          \n                Crime\n              \n                          \n                Fairly Legal\n              \n                          \n                True Crime\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Judge Slams Shia LaBeouf for Homophobic Slur, Orders Drug Testing",
      "image": [
        "https://imagez.tmz.com/image/f5/16by9/2026/02/26/f5304daf61f6405bb2975cf685d9c3fd_xl.png"
      ],
      "datePublished": "2026-02-26T17:54:21.000Z",
      "dateModified": "2026-02-26T17:54:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'Mob Wives' Star Renee Graziano's Son AJ Hospitalized",
    "url": "https://www.tmz.com/2026/02/26/renee-graziano-son-aj-hospitalized/",
    "image": "https://imagez.tmz.com/image/5a/16by9/2026/02/26/5ac7eafe9408453282581da263d1268e_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-26T19:14:46.000Z",
    "description": "\n    \n                    \n                          'Mob Wives' Renee Graziano\n                          Son AJ Rushed to Hospital With Chest Pains\n ",
    "body": "\n    \n                    \n                          'Mob Wives' Renee Graziano\n                          Son AJ Rushed to Hospital With Chest Pains\n                      \n                  \n                                                                        Published \n                              February 26, 2026\n                            11:14 AM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Renee Graziano's son was hospitalized Wednesday after experiencing symptoms similar to those of a heart attack, TMZ has learned.\n      \n    \n          The \"Mob Wives\" star shared an update with us Thursday ... saying her son, AJ, underwent testing at a hospital after he felt numbness in his left arm and chest pains while at work. She tells us AJ is home now and \"doing well\" ... adding he did not have a heart attack.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          AJ will be following up with his doctor to determine what caused the symptoms, we're told.\n      \n\n          Renee says this incident was a \"reminder to never ignore your health,\" adding ... \"It’s a mother’s worst nightmare, especially knowing he has a wife and four children. Your health is your wealth.\"\n      \n    \n          AJ is Renee's only child, who she shares with her ex-husband, Hector Pagan Jr. ... a former associate of the Bonanno crime family who helped the FBI send multiple members of the family -- and Renee's own father -- to the clink.\n      \n    \n          Renee starred on \"Mob Wives\" during its 6 seasons, from 2011 to 2016. Earlier this month, TMZ broke the news a reboot is in the works with Renee ... though without her former costar Drita D’Avanzo.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Renee Graziano\n              \n                          \n                Drita D'avanzo\n              \n                          \n                TV\n              \n                          \n                Mob Wives\n              \n                          \n                Reality TV\n              \n                          \n                Health & Wellness\n              \n                          \n                Exclusive\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Mob Wives' Star Renee Graziano's Son AJ Hospitalized",
      "image": [
        "https://imagez.tmz.com/image/5a/16by9/2026/02/26/5ac7eafe9408453282581da263d1268e_xl.jpg"
      ],
      "datePublished": "2026-02-26T19:14:46.000Z",
      "dateModified": "2026-02-26T19:14:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Amanda Bynes Shows Off 30-Pound Ozempic Weight Loss During Outing With BF",
    "url": "https://www.tmz.com/2026/02/26/amanda-bynes-seen-weight-loss-ozempic/",
    "image": "https://imagez.tmz.com/image/9b/16by9/2026/02/26/9b25fcfad8de4c399e7e31d5554bb8ba_xl.png",
    "tag": "Entertainment",
    "date": "2026-02-26T18:40:17.000Z",
    "description": "\n    \n                    \n                          Amanda Bynes\n                          Check Out My Ozempic Weight Drop!!!\n                      ",
    "body": "\n    \n                    \n                          Amanda Bynes\n                          Check Out My Ozempic Weight Drop!!!\n                      \n                  \n                                                                        Published \n                              February 26, 2026\n                            10:40 AM PST\n                                                                      |\n                                                                Updated \n                                  February 26, 2026\n                                12:23 PM PST\n                                    \n      \n    \n      \n        \n                    \n                  \n      \n                    BACKGRID\n          \n    \n          Amanda Bynes was out and about living her best life ... and while she was at it, she dropped a little fitspo reminder ... showing off nearly 30 pounds of weight loss.\n      \n    \n          Check the pics -- Amanda bared her trimmed-down midriff in a sports bra and shorts while grabbing coffee and lunch at L.A.’s Marmalade Cafe on Wednesday.\n      \n    \n          Amanda kept it low-key with shades and Vans, strolling beside her boo -- and yeah, the vibes were very much loved-up and locked in.\n      \n\n          As we’ve told you, Amanda’s been open about her Ozempic journey, recently revealing she’s down 28 pounds to 152.\n      \n    \n                    \n                          \n                                  \n      \n        \n    \n          The former child star kicked things off last summer with a goal of 130 -- and she’s clearly playing the long game. Slow, steady ... and looking healthy while she’s at it!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Amanda Bynes\n              \n                          \n                Movie Stars\n              \n                          \n                Celebrity News\n              \n                          \n                Ozempic\n              \n                          \n                Exclusive\n              \n                          \n                Celebrity Health\n              \n                          \n                Weight Loss Medication\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Amanda Bynes Shows Off 30-Pound Ozempic Weight Loss During Outing With BF",
      "image": [
        "https://imagez.tmz.com/image/9b/16by9/2026/02/26/9b25fcfad8de4c399e7e31d5554bb8ba_xl.png"
      ],
      "datePublished": "2026-02-26T18:40:17.000Z",
      "dateModified": "2026-02-26T18:40:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]