[
  {
    "title": "BBC Confirms Landmark YouTube Deal, Including New Channels and Winter Olympics Coverage",
    "url": "https://variety.com/2026/tv/global/bbc-confirms-landmark-youtube-deal-1236636483/",
    "image": "https://variety.com/wp-content/uploads/2026/01/bbc-youtube.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-21T10:59:04.000Z",
    "description": "\n\tThe BBC has confirmed what it is billing as a “strategic partnership” with YouTube that will see the British broadcaster produce original content fo",
    "body": "\n\tThe BBC has confirmed what it is billing as a “strategic partnership” with YouTube that will see the British broadcaster produce original content for the video platform. \n\n\tThe landmark deal — first reported last week — will include investment in YouTube-first programming and the launch of new YouTube channels aimed at children and young adults. \n\n\tThe BBC will also look to use YouTube to showcase what it describes as “BBC moments that bring the U.K. together” and promote is linear channels starting with the Winter Olympics in February. \n\t\n\n\tThe deal has been seen as part of a major effort by the BBC to deal with the challenge of YouTube when it comes to younger audiences, who have been increasingly turning to the platform for both entertainment and news. In December, ratings agency Barb reported that the number of viewers watching YouTube (52 million) surpassed that of the BBC’s combined channels (51 million) for the first time.\n\n\n\tAlongside original content, the partnership will also see the BBC and YouTube support the government’s Creative Industries Sector Plan by investing in creators across the U.K., alongside upskilling and partnering with creators and established TV producers who want to create and commission digital-first content.\n\n\tLed by the National Film and Television School, 150 media professionals will be invited to develop their YouTube skills with a series of workshops and events. \n\n\t“It’s essential that everyone gets value from the BBC, and this groundbreaking partnership will help us connect with audiences in new ways,” said BBC director-general Tim Davie. “We’re building from a strong start and this takes us to the next level, with bold homegrown content in formats audiences want on YouTube and an unprecedented training programme to upskill the next generation of YouTube creators from across the UK. Importantly, this partnership also allows new audiences different routes into BBC services like BBC iPlayer and Sounds.” \n\t\n\n\tAdded Pedro Pina, VP EMEA YouTube: “We are delighted to partner with the BBC to redefine the boundaries of digital storytelling. This partnership translates the BBC’s world-class content for a digital-first audience, ensuring its cultural impact reaches a younger, more global audience. Beyond the content, our first-of-its-kind training programme represents a deep investment in the UK’s creative pipeline designed to empower the next generation of British talent to lead the global creator economy. In doing so, we are not just telling the stories of today; we are building the stage for the storytellers of tomorrow.”\n\n\tLast week, the FT reported that the BBC would also be able to generate a profit from any partnership with YouTube by advertising on programs shown outside of the U.K. As a public service broadcaster, it does not earn money through advertising on home soil, instead charging a license fee to British audiences for access to its content. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "BBC Confirms Landmark YouTube Deal, Including New Channels and Winter Olympics Coverage",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/bbc-youtube.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-21T10:59:04.000Z",
      "dateModified": "2026-01-21T10:59:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Soccer Superstar Ronaldinho Gets Bio Series",
    "url": "https://variety.com/2026/film/global/soccer-ronaldinho-mediacrest-playtime-movies-mixer-1236636415/",
    "image": "https://variety.com/wp-content/uploads/2026/01/ronaldinho-620.jpg?w=620&h=348&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-21T11:53:40.000Z",
    "description": "\n\tSpain’s Mediacrest Entertainment and Playtime Movies have partnered with Brazil’s Mixer Films to co-produce “Época 10: Ronaldinho,” a bio-series abo",
    "body": "\n\tSpain’s Mediacrest Entertainment and Playtime Movies have partnered with Brazil’s Mixer Films to co-produce “Época 10: Ronaldinho,” a bio-series about one of the greatest soccer players.\n\n\tThe announcement comes as anticipation for the 2026 FIFA World Cup continues to build.\n\n\tA two-time FIFA World Player of the Year, Ronaldinho, now 45, is widely regarded as the only soccer player to have won the Copa América, the Ballon d’Or, the UEFA Champions League, the FIFA Confederations Cup and the Copa Libertadores.\n\t\n\n\tBased on interviews with the former FC Barcelona star and particularly his brother-manager Roberto de Assis, the series traces their meteoric rise and dramatic fall—from their beginnings in Porto Alegre, Brazil to prison in Paraguay. Set in Paris, Barcelona and Milan, it explores Ronaldinho’s sporting, professional and personal triumphs and failures, charting the journey that made him a generational icon. But at its core, the series is about the relationship between the two brothers.\n\n\n\tHaving lost their father prematurely, Roberto, also a successful soccer player until an injury ended his career, became a father figure to Ronaldinho. His younger brother’s rapid rise to stardom stirred both jealousy and friction between them.\n\n\t“Their relationship was similar to that between Salieri and Mozart at the time, admiring but also jealous,” said Cristian Liarte, CEO of Mediacrest Entertainment, referring to the real-life characters portrayed in Milos Forman’s multi-Oscar winning film, “Amadeus.”\n\n\t‘“We are looking at an intellectual property with strong international appeal. Ronaldinho is a global name with a unique ability to connect with audiences and platforms,” he noted.\n\t\n\n\t“It’s also about how sport can resonate so powerfully that it transforms individuals, reshapes teams and even alters the spirit of a country at a defining moment,” Liarte mused.\n\n\tWith the pilot script and series bible completed, they have kickstarted the financing and international sales phase at Content Americas.\n\n\t“Having the opportunity to produce a series about Ronaldinho is a privilege. Beyond being a football genius, his life follows a trajectory of success and conflict worthy of a dramatic hero,” said João Daniel Tikhomiroff, CEO of Mixer Films who will tap his head writer Camila Raffanti, who wrote 13 episodes for Mixer smash hit “The Business,” which ran for four seasons on HBO Lati America, to work on the Brazilian part of the story alongside Spanish writer Carlos Franco. \n\n\t“It’s not just a series about soccer. It’s a series about Ronaldinho – the man, the character and his journey. It’s an extraordinary journey, marked by moments of pure brilliance and moments of deep hardship. That contrast is what makes his story so compelling and so beautiful,” he added.\n\n\tThe languages spoken will naturally reflect the settings, with dialogue in English, Spanish, Italian and Portuguese.\n\n\tThe series was created by Franco and Álex Murrull. The latter co-directed the 1992 Olympics-set water polo drama “42 Segundos” (“The Final Game”) with Playtime’s Dani de la Orden, which Franco wrote.\n\n\t“We believe Ronaldinho’s biopic is a unique piece of fiction, set within a historically significant moment for Barcelona and its most internationally renowned institution, FC Barcelona. That’s why we say it is ‘més que un club’ (‘more than a club’),” said de la Orden, CEO of Playtime Movies.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Soccer Superstar Ronaldinho Gets Bio Series",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/ronaldinho-620.jpg?w=620&h=348&crop=1"
      ],
      "datePublished": "2026-01-21T11:53:40.000Z",
      "dateModified": "2026-01-21T11:53:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Games of Thrones’ Actor Jacob Anderson, ‘Minx’ Star Ophelia Lovibond Headline Stillbirth Drama ‘Still Life’ (EXCLUSIVE)",
    "url": "https://variety.com/2026/film/news/jacob-anderson-ophelia-lovibond-stillbirth-drama-still-life-1236636449/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Still-Life.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-21T09:44:37.000Z",
    "description": "\n\t“Minx” star Ophelia Lovibond and “Game of Thrones” and “Interview With the Vampire” actor Jacob Anderson headline “Still Life,” a short film explori",
    "body": "\n\t“Minx” star Ophelia Lovibond and “Game of Thrones” and “Interview With the Vampire” actor Jacob Anderson headline “Still Life,” a short film exploring the aftermath of stillbirth through a lens of dark comedy and emotional honesty, produced by 19th Street Productions.\n\n\tThe project marks a deeply personal undertaking for writer-producer Kate Radcliffe, who drew from her own experience of losing her son Dexter to craft a story that confronts a topic rarely addressed on screen. Director Sophie King, whose brother was stillborn, helms the production, which is currently in post-production.\n\t\n\n\tThe film follows Jess and Max after their son is stillborn at 24 weeks of pregnancy. Lovibond portrays Jess as she navigates an unexpected form of motherhood marked by silent milestones and uncomfortable social encounters, while Anderson plays Max, attempting to hold their family together through grief.\n\n\n\tJordan Alexandra, Phoebe Pryce, Alex Bhat and Felicity Montagu round out the supporting ensemble.\n\n\t“Kate’s script struck me as such an important subject matter to bring to light,” Lovibond said. “There’s still so little conversation around baby loss that it can feel impossible to navigate, both for those experiencing its bewildering devastation directly and for those wanting (but not knowing how) to be supportive.”\n\n\tAnderson added: “Stories are a great way to work through things that need to be said, and Kate has written a brave, darkly funny and ultimately hopeful story about continuing to live in the face of the unimaginable.”\n\n\tAccording to U.K. statistics, one in every 250 pregnancies ended in stillbirth in 2022, with 2,680 stillbirths recorded that year and an average of eight babies stillborn daily. Stillbirth rates rose for the first time in seven years in 2021.\n\t\n\n\tKing said: “The greatest power of cinema is its capacity for catharsis and empathy, and Kate’s brutally honest script delivers on this so fully. As well as learning all about Kate’s first son, Dexter, it’s been an honor to pay tribute to my stillborn brother Alex by making this film.”\n\n\tThe production was staffed predominantly by women, with Radcliffe noting that many crew members, including men, had personal connections to baby loss.\n\n\tRadcliffe said: “If this film does anything, I hope it opens up a conversation about baby loss and resonates with anyone who has felt as lonely and devastated as I did the day Dexter died.”\n\n\tThe creative team envisions the short film as a proof of concept for a potential television series. Sarah Roy produces alongside Radcliffe. Simon Higgins serves as casting director, with Carmen Pellon as director of photography.\n\n\tRadcliffe’s credits include “The Graham Norton Show,” “The Russell Howard Hour,” “Rhod Gilbert’s Growing Pains” and “A League of Their Own.” King is a BAFTA Connect director whose work has screened at Oscar and BAFTA-qualifying festivals, with credits including Channel 4’s “Disability Benefits” and the award-winning short “Does Your Condom Make You Fat?”\n\n\tThe filmmakers plan a targeted festival run beginning this year, focusing on U.K. and international festivals. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Games of Thrones’ Actor Jacob Anderson, ‘Minx’ Star Ophelia Lovibond Headline Stillbirth Drama ‘Still Life’ (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Still-Life.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-21T09:44:37.000Z",
      "dateModified": "2026-01-21T09:44:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Inside Netflix Mega-Hit ‘Secrets We Keep’: Writer Ingeborg Topsøe on White Privilege and That Argued About Ending",
    "url": "https://variety.com/2026/tv/global/netflix-secrets-we-keep-ingeborg-topsoe-1236636500/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Secrets-We-Keep-credit-Tine-Harden-Netflix.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-21T11:49:49.000Z",
    "description": "\n\tThe first Netflix Original battling for the coveted Nordic Series Script Award at Göteborg, Danish thriller “Secrets We Keep” (“Reservatet”) shot to",
    "body": "\n\tThe first Netflix Original battling for the coveted Nordic Series Script Award at Göteborg, Danish thriller “Secrets We Keep” (“Reservatet”) shot to No. 1 in 28 countries when it launched on the U.S. streamer May 15, and has since captured around 40 million Netflix viewers worldwide. That’s quite a coup for Ingeborg Topsøe who signs her first fully-fledged TV show as a creator-writer, although her contributions to the Danish thrillers-psycho drama pics “The Charmer” (2017) and “Wildland” (2020) already established her name among top Nordic writers to watch. \n\t\n\n\tThe former graduate from the National Film & Television School in the U.K. also served as episodic writer on the Emmy-nominated Amazon show “Hanna.” \n\n\n\tTrue to her taste for suspense drama, Topsøe has skilfully combined crime with social commentary in this six-part series, inspired by her own privileged upbringing, with au pairs as outsourced family support. Set in one of Copenhagen’s most affluent neighbourhoods, “Secrets We Keep” turns on the successful businesswoman and mother of two Cecilie, whose seemingly perfect life starts to crack when her neighbours’ Filipino au pair goes missing. Cecilie and her own au pair Angel begin to investigate, but the case of the missing foreigner is a low priority for the local police. Eventually Cecilie is forced to confront her own blind spots, her “friendship” with her racist neighbours Rasmus and Katarina and how she should raise her children. \n\n\tIn the title roles are Marie Bach Hansen (“The Legacy,” “White Sands”), Danica Curcic (“The Chestnut Man”) Simon Sears (“Ride Upon the Storm”), Lars Ranthe (“Another Round”) and Sara Fanta Traore (“The Nurse”), joined by newcomers Excel Busano and Donna Levkovski as the Filipino au pairs.The show, co-written by Ina Bruhn (“Darkness: Those Who Kill”) and Mads Tafdrup (“Speak No Evil”) was helmed by the seasoned Per Fly (“Borgen”) for Uma Film (“The Opponent,” “The Excavation”) and Netflix. \n\t\n\n\tTopsøe spoke with Variety ahead of “Secrets We Keep”’s bow at Göteborg’s TV Drama Vision.\n\n\tYou’re in the running for best screenplay with “Secrets We Keep.” Could you first tell us how you got into screenwriting?\n\n\tThat’s a tough question to answer. I think it started when I went through a depression at university, while I was studying philosophy. Trying to write was a way of trying to regain a sense of self or point of view of the world. My writing didn’t amount to much at the time, but I finished my BA in philosophy with an exchange year at UCLA, where I took a minor in creative writing. This is where I really fell in love with writing. It was literature, but I remember one of my teachers who was a novelist said that if the TV business had had the same opportunities when she started writing, she would probably have gone in that direction. After UCLA, I applied for the National Film and Television School in London, as I was already writing in English and you could only apply for the Danish Film School every other year – which seems like an eternity when you’re in your 20s.\n\n\tWhat type of stories and genres make you tick?\n\n\tI’m always attracted to subject matters that I find intriguing or puzzling. Something you can look at from a lot of different angles, and with no easy solution or conclusion. Creating a TV show or a film is a very lengthy process and you have to be able to keep yourself engaged and interested for a long period of time. So I’ve never been attracted to a brave-man’s-fight-against-injustice” type of stories. \n\n\tIn terms of genres, I’ve never written anything that was pure drama. I always try to play with suspense or uncertainty. I’m seriously wondering if it’s because I have anxiety, but suspense just feels much more true to how I experience life in general. I always wonder what something reallymeans or what’s reallygoing on. I also like the suspense genre because it requires the audience to stay hyper-aware.\n\n\tWith “Secrets We Keep,” I purposely used the well-known techniques and themes of the crime genre to draw the audience in: the disappearance of a young woman, a concerned neighbour, a sexual motive, a police investigation. But hopefully I’ve used it slightly differently as class, ethnicity, white guilt and privileges are an inherent part of how this crime story unfolds\n\t\n\n\tWhen and how did you first get the idea for this Nordic Noir, with a missing Filipino au pair at the heart of the plot?\n\n\tI actually think of my show as anti-Nordic Noir. If you think of shows like “The Killing,” “The Bridge”and “The Investigation,” it’s all so cold, all water, glass, metal. Cool tones and police officers who show no emotions. I’m not really into that, and that’s why my police character Aicha is pretty emotional. Besides, “Secrets We Keep” takes place in this green, lush suburb north of Copenhagen with colorful homes and stylish outfits. The unease and suspense is present in broad daylight inside of the domestic sphere. In “Secrets We Keep,”it’s a culture and society as a whole that’s under indictment and assigning guilt is not as straightforward as in a normal whodunnit. Even once the truth about what happened becomes clear. The show should leave you with a really bad taste in your mouth.\n\n\tThe core idea for the show came from my own experience of growing up with au pairs. When I was three years old, my family moved to Germany for my mother’s work and my parents hired their first au pair, a young Danish girl who had just finished high school. From then on, my sister and I grew up with au pairs until our early teens. I never thought too much about it, until I was older and began thinking about starting a family myself.\n\n\tContemplating motherhood, family life and the division of labor in the home; I started wondering what it means to outsource intimacy in a family. Are picking a child up from school and making a sandwich, washing their sheets acts of love and ways for a parent to get to know their child, or are they simply domestic tasks which can easily be outsourced without implications? That’s what I set out to investigate. Then I started researching the current use of au pairs in Denmark, which is no longer young European girls working abroad for a year, but mainly women from the other side of the world; the majority (80%) are from the Philippines. And even though it’s officially a cultural exchange program, there are some very hardcore power structures at play in those homes where foreign women live with their employers who sponsor their stay in Europe. And while researching, I found that the people who employ au pairs don’t really seem to acknowledge this. There seems to be this interesting mental glitch.\n\t\n\n\n\n\t\n\n\t\t\t\t\tSecrets We Keep\n\t\t\t\t\t\t\t\t\tCredit: Nikolaj Thaning Rentzmann/Netflix\n\t\n\n\n\n\tDenmark is usually perceived as a very egalitarian society. Was your intention to challenge this image?\n\n\tYes. Definitely. I really wanted to challenge the Danish self-perception. These upstairs-downstairs homes exist in Denmark, but I’ve never seen them portrayed on Danish television, or anywhere else for that matter. Danes think of ourselves as living in a very egalitarian society as you say, so I think it’s more uncomfortable for us to be faced with class division then for other nationalities. That’s why I think the au pair scheme was perfect for investigating the Danish perception of class and privileges. Even the language of the au pair program itself is not really representative of reality. The grown women who come here are called au pair “girls,” they live with their host “mom” and host “dad,” but these people are their employers. The women are given an allowance, but many come here to support their families. We say that au pairs are “part of the family,” while obviously being able to be fired and forced to leave the country. So it has this “double speak” quality, which I just wanted to dig into.\n\n\tYou also describe the households without much parental guidance, where the teen boys Oscar and Viggo use misogynistic online content. Can you comment on this storyline which nurtures both the crime plot and social commentary?\n\n\tI was interested in these parents who are well-meaning and articulate, while also absent and full of blind spots. And these children who are both over-protected, while nonetheless overlooked. I kind of knew this dynamic from my own childhood to a certain extent, but wanted to take it further.\n\n\tI do think there can be this triangle of silence between au pairs, parents and children. How much is the child aware of the power they hold over the employee? How much can the employee tell the parents about problematic behavior without it seeming like criticism of the children or even their parents? How well do the parents know what goes on in their own home if they’re not hands-on?\n\n\tMisogynistic content is obviously present in all parts of society, unfortunately. But even if you’re well-educated and consider yourself a feminist like Cecilie, what do you really teach boys, and girls, about privilege, ethnicity and gender, when it’s always a woman of a different ethnicity who picks up after them? Does that change how they view others and their place in society? I thought that was interesting to investigate.\n\t\n\n\tWhat were your inspirations for the show in terms of setting and atmosphere? It’s easy to think of “Big Little Lies”….\n\n\tThe setting and community were largely inspired by my own upbringing in the wealthy suburb north of Copenhagen, where you find the highest concentration of au pairs in the country and where the show is set and largely shot. But “Big Little Lies” was definitely an inspiration and a reference. It doesn’t really deal with class all that seriously, but I loved the female characters and I was inspired by the way the police was used. I knew pretty early on that I needed a police character and was looking for other less traditional ways to use the police. In “Big Little Lies,”the police circles around the community and main characters in a way I liked.\n\n\tThis is your first full series as creator-writer. What did you find most challenging and also most rewarding?\n\n\tThat’s so hard to answer. The process is so long and there are so many highs and lows along the way. Seeing it all come to life is so rewarding and the reception has been overwhelming. I’m especially happy with the ending. It ends with the exact feeling I always wanted, and it was a real balance to make sure it wasn’t too unsatisfying, but still haunting. \n\n\tI love the end scene. I feel like everything came together. I think I cried when I watched the dailies that day, because I knew it would work. The actors completely pulled off this kind of tricky scene and Jasper Spanning the cinematographer got the mood just right. To me, it ends like when you tap a crystal glass and it makes a clear, ringing sound that lasts a few second. It encapsulated the precise tone of the whole show.\n\n\tEndings are so important. I’m working on something else right now – my first play – where the ending doesn’t feel right and that’s really stressing me out!\n\n\tHow was your collaboration with Per Fly?\n\n\tMy ambitions for the show where always extremely high. We knew we really needed an equally ambitious director and we needed that person to take on all six episodes, because we had a big built [set] in a studio and couldn’t really shoot in blocks.\n\n\tWhen we met with Per, it was clear he had a natural interest in the subject matter. He made a Danish film trilogy about class in the 2000s before working on TV shows like “Borgen.” He has almost always made things that have been very accessible, so he has a natural focus on opening material up to a broad audience. And he really managed to do that here as well.  \n\t\n\n\tWere you involved in the casting process, and why do you feel Marie Bach Hansen, Danica Curcic, Sara Fanta were perfect for their roles?\n\n\tI had worked with the casting director Anja Philip two times previously and she knew the kind of characters I create, and what they require from an actor. I really trust her opinion, so working with her and Per during casting was wonderful. I have a love for inactive, observing main characters and the show is structured around the main character Cecilie’s slow realization of the realities around her. Marie Bach Hansen managed to carry the show and make sure we never lose interest in Cecilie, sometimes with very few means. Without that, the whole show would fall apart.\n\n\tDanica Curcic’s character Katarina is much more outrageous, and Danica was not afraid to take that character to her limit. I love her for that. Some people thought the character was too much, but Danica managed to make her just that without losing the truthfulness, and the ending wouldn’t have worked without that. So it was extremely important for Danica to give Katarina this sort of disarming over-the-topness with a real undercurrent.\n\n\tSara Fantawho plays the police officer Aicha, probably had the most underwritten character of the core cast to be honest, because I wanted to limit the role and only ever see her at work. But I think that just gave Sara the freedom to somehow really make the character her own and just fill out all the blanks.\n\n\tHow was your relationship with Uma Film and with Netflix?\n\n\tI had worked with Uma on the project for quite a while before the show went to Netflix, so they really fought for this show with me and Netflix were great. As you said it’s my first show as a creator and a pretty big show. I feel like they had a lot of faith in me and what I wanted to accomplish, so I felt very supported.\n\n\tWill there be a second season?\n\n\tThe story was always intended to end the way it does. Some viewers are clearly very unhappy with that. I got messages from different places in the world from viewers who looked me up and contacted me. I remember waking up one morning to an American woman simply writing: “This ending is unacceptable. I need justice for Ruby.” But there will be no justice for Ruby, unfortunately.\n\t\n\n\tWhat’s next for you?\n\n\tI actually have a feature film – “Ghosts” – with director Milad Alami, which is set to shoot later this year and which is being presented in Göteborg. Milad, the producer Stinna Lassen and I made our feature debut together with “The Charmer”back in 2017, so it’s great to be working together again. \n\n\n\n\t\n\n\t\t\t\t\tIngeborg Topsoe\n\t\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Inside Netflix Mega-Hit ‘Secrets We Keep’: Writer Ingeborg Topsøe on White Privilege and That Argued About Ending",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Secrets-We-Keep-credit-Tine-Harden-Netflix.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-21T11:49:49.000Z",
      "dateModified": "2026-01-21T11:49:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Italy’s RAI Cinema International Boards Berlin Perspectives Title ‘Forest High’",
    "url": "https://variety.com/2026/film/global/rai-cinema-international-berlin-forest-high-1236636470/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Forest.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-21T11:41:17.000Z",
    "description": "\n\t RAI Cinema International Distribution has acquired world rights to Belgian director Manon Coubia’s “Forest High” ahead of the Alps-set drama’s Berl",
    "body": "\n\t RAI Cinema International Distribution has acquired world rights to Belgian director Manon Coubia’s “Forest High” ahead of the Alps-set drama’s Berlin Film Festival launch.\n\n\tThe Belgian film’s pick-up marks the first non-Italian title acquired by the recently established sales arm of Italian state broadcaster RAI, which bowed at the European Film Market in Berlin last year.\n\n\tIn “Forest High,” a trio of women named Anne, Hélène and Suzanne take turns tending to a hut in thenorthern Alps where hikers come and go through the seasons. The film’s three protagonists have chosen to withdraw from the world below because “each carries a secret, a wound, put to the test by this chosen solitude,” the synopsis says.\n\t\n\n\t“Forest High,” which is Coubia’s debut feature, will premiere in Berlin’s Perspectives sidebar section dedicated to first works. Coubia previously got notice for her shorts, one of which scored the top prize in Locarno.\n\n\n\tThis film is a Belgian–French co-production, produced by Belgium’s the Blue Raincoat in co-production with France’s Aurora Films. \n\n\t“We are very proud to support such a bold and distinctive debut by a talented filmmaker,” said RAI Cinema International Distribution sales chief Fulvio Firrito. “This project represents a further step forward for us, and we are grateful to the Belgian and French producers for entrusting us as their international distributor on such an original and profound project.”\n\n\tOther new titles that RAI Cinema International Distribution will launch at the EFM include prominent Italian director Gabriele Muccino’s latest feature “Things We Don’t Say” and Greta Scarano’s “Siblings,” which recently won the European Young Audience Award at the European Film Awards.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Italy’s RAI Cinema International Boards Berlin Perspectives Title ‘Forest High’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Forest.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-21T11:41:17.000Z",
      "dateModified": "2026-01-21T11:41:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Criterion Collection Deals: David Lynch Films Are on Sale for Up to 35% Off",
    "url": "https://variety.com/2026/shopping/news/david-lynch-criterion-collections-deals-online-1236636354/",
    "image": "https://variety.com/wp-content/uploads/2026/01/David-Lynch-Criterion-Collection-VR-Featured.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-21T03:45:10.000Z",
    "description": "\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.\n\n\tOn what w",
    "body": "\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.\n\n\tOn what would’ve been his 80th birthday, the Criterion Collection launched a flash sale on all of David Lynch‘s titles from the home video company. Born on Jan. 20, 1946, Lynch — who passed away in 2025 — influenced the landscape of cinema and television (namely Twin Peaks) with his style of bizarre and surreal storytelling rooted in American sincerity and nostalgia.\n\n\tFrom “Eraserhead” to “Inland Empire,” you can shop Lynch’s films in the Criterion Collection (and Janus Contemporaries) with savings up to 35% off list prices. In fact, prices start at $20.49 (reg. $29.95). Additionally, there are even titles about the director’s life, including “David Lynch: The Art Life” and “Lynch/Oz” on sale.\n\n\n\tWith a career in film spanning nearly 30 years from 1977 to 2006, Lynch has made some of the most important films of the 20th and 21st centuries — such as “Twin Peaks: Fire Walk With Me,” “Mulholland Dr.,” “Lost Highway” and others.\n\n\tHowever, act fast and shop now since these deals expire at the end of the day on Friday, Jan. 23. In the meantime, scroll down to shop deals on Lynch films in the Criterion Collection on Amazon: \n\n\t\t\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\t\t\t\tCriterion Collection\n\t\n\t\t\t\t\t\n\t\t\n\n\t\t\t\t\t\t\t\t\t\tThe Criterion Collection\t\t\t\t\t\t\n\n\t\t\t\t\t‘Eraserhead’\t\t\n\n\t\n\t\tBlu-ray\t\n\t\t\n\t\n\n\t\t\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\t\t\t\tCriterion Collection\n\t\n\t\t\t\t\t\n\t\t\n\n\t\t\t\t\t\t\t\t\t\tThe Criterion Collection\t\t\t\t\t\t\n\n\t\t\t\t\t‘Blue Velvet’\t\t\n\n\t\n\t\t4K Ultra HD\t\n\t\t\n\t\n\n\t\t\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\t\t\t\tCriterion Collection\n\t\n\t\t\t\t\t\n\t\t\n\n\t\t\t\t\t\t\t\t\t\tThe Criterion Collection\t\t\t\t\t\t\n\n\t\t\t\t\t‘Twin Peaks: Fire Walk With Me’\t\t\n\n\t\n\t\t4K Ultra HD\t\n\t\t\n\t\n\n\t\t\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\t\t\t\tCriterion Collection\n\t\n\t\t\t\t\t\n\t\t\n\n\t\t\t\t\t\t\t\t\t\tThe Criterion Collection\t\t\t\t\t\t\n\n\t\t\t\t\t‘Lost Highway’\t\t\n\n\t\n\t\t4K Ultra HD\t\n\t\t\n\t\n\n\t\t\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\t\t\t\tCriterion Collection\n\t\n\t\t\t\t\t\n\t\t\n\n\t\t\t\t\t\t\t\t\t\tThe Criterion Collection\t\t\t\t\t\t\n\n\t\t\t\t\t‘Mulholland Dr.’\t\t\n\n\t\n\t\t4K Ultra HD\t\n\t\t\n\t\n\n\t\t\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\t\t\t\tCriterion Collection\n\t\n\t\t\t\t\t\n\t\t\n\n\t\t\t\t\t\t\t\t\t\tThe Criterion Collection\t\t\t\t\t\t\n\n\t\t\t\t\t‘Inland Empire’\t\t\n\n\t\n\t\tBlu-ray\t\n\t\t\n\t\n\n\t\t\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\t\t\t\tCriterion Collection\n\t\n\t\t\t\t\t\n\t\t\n\n\t\t\t\t\t\t\t\t\t\tThe Criterion Collection\t\t\t\t\t\t\n\n\t\t\t\t\t‘David Lynch: The Art Life’\t\t\n\n\t\n\t\tBlu-ray\t\n\t\t\n\t\n\n\t\t\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\t\t\t\tJanus Contemporaries\n\t\n\t\t\t\t\t\n\t\t\n\n\t\t\t\t\t\t\t\t\t\tJanus Contemporaries\t\t\t\t\t\t\n\n\t\t\t\t\t‘Lynch/Oz’\t\t\n\n\t\n\t\tBlu-ray\t\n\t\t\n\t\n\n\tAnd since these Criterion Collection releases are from Amazon, you can get them shipped to your home for free, if you’re an Amazon Prime member.\n\n\tIf you’re not a member, you can sign up for a 30-day free trial to take advantage of all that Amazon Prime has to offer, including access to Prime Video for streaming movies and TV, as well as NFL and NBA games, Prime Gaming, Prime Reading and Amazon Photos; fast free shipping in less than two days with Prime Delivery; in-store discounts at Whole Foods Market; access to exclusive shopping events — such as Prime Day and Black Friday — and much more. Learn more about Amazon Prime and its benefits here.\n\n\n\tWant more? Shop more Criterion Collection deals and releases on Amazon, below:\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Criterion Collection Deals: David Lynch Films Are on Sale for Up to 35% Off",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/David-Lynch-Criterion-Collection-VR-Featured.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-21T03:45:10.000Z",
      "dateModified": "2026-01-21T03:45:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Razzie Nominations 2026: ‘Snow White’ and Ice Cube’s ‘War of the Worlds’ Lead With Six Nods, the Weeknd Is Worst Actor Contender",
    "url": "https://variety.com/2026/film/news/razzie-nominations-2026-snow-white-the-weeknd-ice-cube-war-of-the-worlds-1236635371/",
    "image": "https://variety.com/wp-content/uploads/2026/01/snow-white-cube-weeknd.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-21T08:00:00.000Z",
    "description": "\n\tThe Golden Raspberry Awards has announced the nominations for its 46th edition, with the live-action “Snow White” and Ice Cube’s “War of the Worlds”",
    "body": "\n\tThe Golden Raspberry Awards has announced the nominations for its 46th edition, with the live-action “Snow White” and Ice Cube’s “War of the Worlds” in the lead with six nods apiece.\n\n\tAlongside “Snow White” and “War of the Worlds,” the parody award show — whose members recognize what they consider the worst films each year — nominated “The Electric State,” “Hurry Up Tomorrow” and “Star Trek: Section 31” for worst picture. \n\n\n\tIn the acting categories, Abel “The Weeknd” Tesfaye is nominated for worst actor for his performance as a fictionalized version of himself in “Hurry Up Tomorrow,” which received five Razzie nominations in total. The singer-songwriter will compete against Dave Bautista (“In the Lost Lands”), Ice Cube (“War of the Worlds”), Scott Eastwood (“Alarum”) and Jared Leto (“Tron: Ares”) for the (dis)honor. \n\t\n\n\tMeanwhile, the worst actress nominees include Ariana DeBose (“Love Hurts”), Milla Jovovich (“In the Lost Lands”), Natalie Portman (“Fountain of Youth”), Rebel Wilson (“Bride Hard”) and Michelle Yeoh (“Star Trek: Section 31”). \n\n\tAnother notable category is worst screen combo, with nominees including the seven dwarfs from the live-action “Snow White”; James Corden and Rihanna in 2025’s “Smurfs”; Ice Cube and his Zoom camera in “War of the Worlds”; Robert DeNiro as Frank and Vito in “The Alto Nights”; and The Weeknd and “his colossal ego” in “Hurry Up Tomorrow.” \n\n\tThe winners of the 46th annual Razzies will be unveiled on March 14. \n\n\tSee the full nominations list below. \n\n\tWORST PICTURE “The Electric State”          “Hurry Up Tomorrow”“Snow White” (2025)   “Star Trek: Section 31”“War of the Worlds” (2025)\n\t\n\n\tWORST ACTOR Dave Bautista / “In the Lost Lands”Ice Cube / “War of the Worlds”Scott Eastwood / “Alarum”Jared Leto / “Tron: Ares”Abel “The Weeknd” Tesfaye / “Hurry Up Tomorrow”WORST ACTRESS Ariana DeBose / “Love Hurts”Milla Jovovich / “In the Lost Lands”Natalie Portman / “Fountain of Youth” Rebel Wilson / “Bride Hard”Michelle Yeoh / “Star Trek: Section 31”WORST REMAKE/RIP-OFF/SEQUEL“I Know What You Did Last Summer” (2025)“Five Nights at Freddy’s 2”“Smurfs” (2025)“Snow White” (2025)“War of the Worlds” (2025)WORST SUPPORTING ACTRESS Anna Chlumsky / “Bride Hard” Ema Horvath / “The Strangers: Chapter 2”Scarlet Rose Stallone / “Gunslingers” Kacey Rohl / “Star Trek: Section 31”Isis Valverde / “Alarum”WORST SUPPORTING ACTORAll Seven Artificial Dwarfs / “Snow White” (2025)Nicolas Cage / “Gunslingers”Stephen Dorff / “Bride Hard”Greg Kinnear / “Off the Grid”Sylvester Stallone / “Alarum”WORST SCREEN COMBOAll Seven Dwarfs / “Snow White” (2025)James Corden & Rihanna / “Smurfs” (2025)Ice Cube & His Zoom Camera / “War of the Worlds” (2025)Robert DeNiro & Robert DeNiro (as Frank & Vito) / “The Alto Knights”The Weeknd & His Colossal Ego / “Hurry Up Tomorrow”WORST DIRECTORRich Lee / “War of the Worlds” (2025)Olatunde Osunsanmi / “Star Trek: Section 31”The Russo Brothers / “The Electric State”Trey Edward Shults / “Hurry Up Tomorrow”Marc Webb / “Snow White” (2025)WORST SCREENPLAY“The Electric State” / Screenplay by Christopher Markus and Stephen McFeely. Adapted from the illustrated novel by Simon Stalenhag.“Hurry Up Tomorrow” / Screenplay by Trey Edward Shults, Abel Tesfaye, Reza Fahim“Snow White” (2025)  / Screenplay by Erin Cressida Wilson and a bunch of others too numerous to mention.   Drawing from the original fairy tale by the Brothers Grimm.“Star Trek: Section 31” / Screenplay by Craig Sweeny with original story concept developed by Bo Yeon Kim & Erika Lippoldt“War of the Worlds” (2025) / Screen Story and Screenplay by Kenny Golde and screenplay by Marc Hyman, adapting (or destroying) the classic novel by H.G. Wells.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Razzie Nominations 2026: ‘Snow White’ and Ice Cube’s ‘War of the Worlds’ Lead With Six Nods, the Weeknd Is Worst Actor Contender",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/snow-white-cube-weeknd.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-21T08:00:00.000Z",
      "dateModified": "2026-01-21T08:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Def Jam Recordings China Launches in Chengdu, Partners With Migu on ‘Guofeng Hip-Hop’",
    "url": "https://variety.com/2026/music/news/def-jam-recordings-china-chengdu-1236636435/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Vivian-Xu-DengDianGuo-DDG-BOSS-X-Adam-Granite-Timothy-Xu-YiTai-Wang.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-21T07:30:33.000Z",
    "description": "\n\tUniversal Music Greater China has established Def Jam Recordings China, marking the iconic hip-hop label’s entry into the Chinese market with headqu",
    "body": "\n\tUniversal Music Greater China has established Def Jam Recordings China, marking the iconic hip-hop label’s entry into the Chinese market with headquarters in Chengdu, a city recognized as the country’s hip-hop capital.\n\n\tThe move extends Def Jam’s 40-year legacy into China’s growing urban music scene, with the new division focused on developing local hip-hop and supporting artists who express contemporary stories through Chinese language and culture. Universal Music Group positions the launch as part of its long-term Greater China market strategy.\n\t\n\n\tChengdu’s selection as headquarters reflects the southwestern city’s established hip-hop community and live entertainment infrastructure. The city serves as both a creative hub and emerging international cultural center where street culture and live performance intersect.\n\n\n\tTo support artist development, Def Jam Recordings China has named three prominent Chinese rappers as special guest curators: Xie Di, Yitai Wang, and Deng Dianguo “DDG.” The curators will help identify and mentor emerging talent across the country.\n\n\tThe label is partnering with Migu, a digital content platform under China Mobile, to develop “Guofeng Hip-hop” — a creative direction that blends Chinese cultural references and storytelling traditions with contemporary production and global music trends. The collaboration with the Chengdu-based platform encompasses content development, talent incubation, marketing, distribution, live performances and merchandise.\n\n\t“China is one of the most important and dynamic music markets in the world today, with a new generation of artists shaping culture both locally and globally,” said Adam Granite, executive VP of market development at Universal Music Group. “Launching Def Jam Recordings China reflects our long-term commitment to this market and our belief that Chinese hip-hop has a powerful role to play in the global evolution of the genre.”\n\t\n\n\tTunji Balogun, chair and CEO of Def Jam Recordings, said the Chinese division continues the label’s tradition of amplifying voices from specific communities. “The goal is not to copy what’s worked elsewhere, but to support Chinese artists in defining hip-hop on their own terms, in ways that feel authentic, contemporary, and culturally grounded,” he said.\n\n\tTimothy Xu, chair and CEO of Universal Music Group Greater China, emphasized the platform’s comprehensive artist services spanning creative development, production, marketing, distribution and live performance. “Most importantly, we hope to help Chinese HipHop and urban music travel beyond China – reaching international audiences while staying true to its cultural roots,” he said.\n\n\tThe label was unveiled at an event at Eastern Suburb Memory, a Chengdu cultural district that has transformed industrial heritage into a creative hub. The launch featured an exhibition celebrating Def Jam’s four-decade history, with participation from Chinese hip-hop artists, label founders, designers and venue operators.\n\n\tUniversal Music and NetEase recently unveiled a multi-year licensing deal for China. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Def Jam Recordings China Launches in Chengdu, Partners With Migu on ‘Guofeng Hip-Hop’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Vivian-Xu-DengDianGuo-DDG-BOSS-X-Adam-Granite-Timothy-Xu-YiTai-Wang.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-21T07:30:33.000Z",
      "dateModified": "2026-01-21T07:30:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Danish Actor-Turned-Director Marijana Janković Finally Goes ‘Home’ as Her Feature Debut Sells to Multiple Territories: ‘It’s Not Just My Story’ (EXCLUSIVE)",
    "url": "https://variety.com/2026/film/global/marijana-jankovic-home-feature-debut-sales-exclusive-1236635200/",
    "image": "https://variety.com/wp-content/uploads/2026/01/MixCollage-20-Jan-2026-11-17-AM-9597.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-21T09:00:00.000Z",
    "description": "\n\tMarijana Janković’s personal feature debut “Home” – set to world premiere at IFFR and handled by TrustNordisk – has sold to Bulgaria (Beta Film), th",
    "body": "\n\tMarijana Janković’s personal feature debut “Home” – set to world premiere at IFFR and handled by TrustNordisk – has sold to Bulgaria (Beta Film), the Baltics (Estinfilm OÜ) and Singapore (September Film). \n\n\tThe trailer debuts here:\n\n\n\n\n\tJanković, a Danish actress born in Montenegro, previously explored her immigrant family’s story in “Maja,” which won the Best Narrative Short award at Tribeca.\n\t\n\n\t“That’s how everything started. In ‘Maja,’ I played my own mother and it was completely based on my own life. ‘Home’ is only inspired by it. This time, I don’t want to be in the spotlight; I want the film to be in the spotlight because it deserves it,” she told Variety.\n\n\n\tIn “Home,” six-year-old Maja suddenly moves to Denmark with her parents, while two brothers have to stay behind. Soon, she effectively becomes her parents’ translator. Janković was just as young when her family made a similar decision. \n\n\t“I’ve also experienced this, because I learnt Danish in three months. It can be shocking to witness, and I’d never put my own daughter in that situation. But back then, it was necessary. Also, we were a team. It was like football. Every time I helped, it felt like I’d just scored a goal,” said Janković.\n\n\tAlthough she’s not exactly traumatized by her childhood, making the film still “felt like therapy.”\n\n\t“It has been worth all the blood and tears, because I told the story of my generation and of those who came before us. I’m very proud of that.”\n\t\n\n\tAs she prepares to host the upcoming Danish Film Awards, Janković reflected on her long career.\n\n\t“I was one of the first ‘foreign’ actresses in Denmark. Then there’s Dejan Čukić, who actually appears in the film. I used to look up to him, thinking: ‘If Dejan can do it, so can I.’ We’re from the same village in Montenegro. His parents came to Denmark on the same bus as my aunt!”\n\n\tShe added: “I wouldn’t necessarily describe my skin as dark, but it was considered dark in Denmark. I was always cast as the Arabic or Turkish girl. At one point, I stopped accepting these roles. I went: ‘I’m Danish. Give me something else.’”\n\n\tWhen she decided to become a director, she had a specific goal. \n\n\t“I wanted to change something in the system,” she noted.  \n\n\t“When people from the Balkans appear in Danish films, they’re usually portrayed as criminals. I got tired of that. My father is not a criminal; he’s an honest man who left his country and abandoned his language in order to provide a better life for his children. Why isn’t anyone talking about that?” \n\n\tJanković, who co-wrote the script with Babak Vakili, Bo Hr. Hansen and Emil Nygaard Albertsen, can be seen in one of the supporting roles. \n\n\t“At first, I wanted to focus solely on the 1990s, but then I decided to depict what happened to this family and talk about generations,” she said. “I ended up playing ‘myself,’ in a way, and there was something beautiful about it. It gave me a sense of closure.” \n\n\tApart from Čukić, Nada Šargin or Tara Cubrilo, she cast some familiar faces: Jesper Christensen, Zlatko Burić, Claes Bang and Trine Dyrholm.\n\n\t“Trine is one of my best friends. I told her: ‘You’re the best Scandinavian actress, but I can only offer you this small part.’ They wanted to be there to support me and this story. They felt it was important to tell.” \n\n\tLooking ahead, she would like to explore other themes.\n\t\n\n\t“My heart is so full of this film, but I don’t need to talk about my life anymore. What I would like to do is explore the idea of a love story between people from two different cultures: an immigrant woman and a Danish man. I used to date Danes, and then I married a Serbian guy. Why?,” she wondered, clearly still thinking about the themes of identity. \n\n\t“During the pandemic, my father was scared. He called me up, saying: ‘If this thing kills me, I don’t want to be buried in Denmark.’ I was shocked, but I also understood. He wanted to go home.” \n\n\t“When immigrants decide to leave, there’s a price to pay. You keep on wondering: Where do I belong? Is it where I live or where I want to be buried? This has been changing for me, too.” \n\n\tDespite the intimate personal details she shares, she views “Home” as a universal story. She’s not alone in that. “It’s a profoundly moving exploration of identity, belonging, and the sacrifices that define us,” said TrustNordisk’s Nicolai Korsgaard. “With its universal themes and strong international appeal, we’re proud to bring the film to global audiences.”\n\n\tJanković observed: “I keep saying: ‘It’s not just my story’.” \n\n\t“Every foreigner and every immigrant will recognize something here. At Tribeca, a girl stopped me in the street to say the same thing about ‘Maja,’ even though her family was from Chile. That’s my calling, I think: to be honest. That’s why I started directing. I want to tell more stories about immigrants that can bring people together. We can’t be so afraid of each other.” \n\n\n\n\t\n\n\t\t\t\t\tClaes Bang in ‘Home’\n\t\t\t\t\t\t\t\t\tCourtesy of TrustNordisk\n\t\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Danish Actor-Turned-Director Marijana Janković Finally Goes ‘Home’ as Her Feature Debut Sells to Multiple Territories: ‘It’s Not Just My Story’ (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/MixCollage-20-Jan-2026-11-17-AM-9597.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-21T09:00:00.000Z",
      "dateModified": "2026-01-21T09:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Projects From ‘Apolonia, Apolonia,’ ‘Mr. Nobody Against Putin’ Directors Among Lineup for Financing and Co-Production Event CPH:Forum",
    "url": "https://variety.com/2026/film/global/cphforum-lineup-2026-1236636011/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Letter-to-Alvin.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-21T08:30:00.000Z",
    "description": "\n\tThis year’s edition of CPH:DOX’s financing and co-production event CPH:Forum, which runs March 17-19, will showcase projects by 101 directors and pr",
    "body": "\n\tThis year’s edition of CPH:DOX’s financing and co-production event CPH:Forum, which runs March 17-19, will showcase projects by 101 directors and producers representing 23 countries, who will take the stage to present 30 new documentary projects spanning early to late development and production.\n\n\tAmong the project are those by directors such as Lea Glob (“Apolonia, Apolonia”), David Borenstein (“Mr. Nobody Against Putin”), Göran Hugo Olsson (“Israel Palestine on Swedish TV 1958-1989”), Verena Paravel (“De Humani Corporis Fabrica”), Beniamino Barrese (“The Disappearance of My Mother”), Robert Greene (“Kate Plays Christine”), Hansen Lin and Siyi Chen (“Always”), Diana El Jeiroudi (“Republic of Silence”), Ra’anan Alexandrowicz (“The Viewing Booth”), Kathryn Ferguson (“Nothing Compares”) along with producers such as Alex Pritz and Will N. Miller (“The Territory”), and Aman Mann and Shaunak Sen (“All That Breathes”).\n\t\n\n\tThe projects will be presented to film financiers and representatives of streaming platforms such as Netflix, Hulu, HBO Max and HBO Europe; broadcasters ARTE, ZDF, VPRO, BBC, France Télévisions, National Geographic, POV, NHK, Al Jazeera and RAI; film studios such as Sky Studios, Concordia Studio, Wavelength Productions and Sandbox Films; distributors IMAX, ROCO Films, Grasshopper Film; funds and foundations such as Field of Vision, Impact Partners, Ford Foundation, InMaat Foundation, Sundance Institute, Doc Society, Chicken and Egg Pictures, Catapult and The Whickers.\n\n\n\tMara Gourd-Mercado, head of industry and training, said, “The 2026 CPH:Forum selection tells the story of the times we live in through the lenses of filmmakers who challenge the status quo, take risks and engage in dialogue with the world. We envision this edition as not just a showcase, but as a vital space where the transformative power of documentary in defending democracy and fostering understanding in these challenging times is revealed once again. We are honored that this group of filmmakers have entrusted us with their projects.”\n\t\n\n\tThe selected projects will be presented to financiers and representatives from the documentary film industry and will be in the running for a number of awards at CPH:Forum, running from March 17-19 in Copenhagen, with CPH:ROUGHCUT and CHANGE presentations taking place on March 16.\n\n\tCPH:ROUGHCUT showcasing projects close to completionAs part of CPH:Forum, the CPH:ROUGHCUT selection will showcase five upcoming films at rough cut stage aiming to premiere in 2026 and looking for distribution, sales, buyers, festival premieres and other forms of exhibition. The teams will present selected scenes from their soon-to-be-finished films on March 16.\n\n\tEastern European perspectives from the CHANGE projectsFor the fifth year running, CPH:DOX, IMS (International Media Support) and EAVE (European Audiovisual Entrepreneurs) are bringing together the development co-production training program CHANGE, empowering documentary projects and filmmakers from the Eastern Partnership countries – Armenia, Azerbaijan, Belarus, Georgia, Moldova, and Ukraine.\n\n\tFollowing two residential workshops in Moldova, the six-month long training program will culminate in a final workshop in Copenhagen during CPH:DOX, in partnership with the National Film School of Denmark, and the presentation of the eight participating projects at the CHANGE pitch session on March 16.\n\n\tEight awards to be handed out during CPH:Forum 2026Together with new as well as longstanding partners, CPH:Forum will present a slate of awards totalling more than €100,000. As an addition, CPH:Forum has partnered with leading European public broadcaster ARTE to award two projects in the form of two consultations with Rough Cut Services totalling a value of €2,500 each. Another new award by the Jacob Burns Film Center will grant one project a stipend and residency including access to editing and post-producing facilities totalling a value of approximately €8,500.\n\n\tThe Sandbox Films Science Pitch Prize will highlight an outstanding science documentary project which will receive a $25,000 cash award along with support from Sandbox Films to bring their vision to life. The Al Jazeera Documentary Channel Co-Production Award with a €15,000 prize will be awarded to a project highlighting urgent matters of our times from, or about, the MENA region and Sub-Saharan Africa.\n\t\n\n\tThe Eurimages New Lab Awards will celebrate innovative projects by non-conventional filmmakers and visual artists through two awards: The Innovation Award of €20,000 for an experimental project in development and the Outreach Award of €30,000 to promote audience outreach for an experimental project in late production or post-production.\n\n\tIn addition, the Rise and Shine Award of €3,000 will be awarded to the best pitch project with international potential and no sales agent attached as well as the Unifrance/Titrafilm Doc Award totalling €5,500 in benefits for the best French production or co-production presented.\n\n\tThe awards will be handed out at the CPH:INDUSTRY Happy Hour & Award show taking place on March 19 at the Social Cinema at Kunsthal Charlottenborg.\n\n\tThe selected CPH:Forum projects:“Artifacts of War” (Spain, Chile)Directed by Jorge Caballero; produced by Anna Giralt Gris, Diego Pino Anguita\n\n\t“Blackest Ever Black” (Ireland, U.K.)Directed by Roisin Agnew; produced by Alison Millar, Jack O’Brien, Roisin Agnew\n\n\t“Bromansky” (Finland, France, Denmark, Norway)Directed by Arthur Franck; produced by Sandra Enkvist, Anders Lindström, Rémi Grelletty, Sara Skrodzka, Thorvald Nilsen, Esther Nissen\n\n\t“Children of the Moon Land” (Slovakia, Czech Rep., France)Directed by Roman Ďuriš; produced by Richard Šimeček, Michal Sikora, Albin Bourgeois\n\n\t“Cosmofonia” (France)Directed by Verena Paravel; produced by Florence Cohen\n\n\t“Dark Horse” (Sweden, Kenya, U.S.)Directed by Lauren DeFilippo, Sam Soko; produced by Amanda Pollak\n\n\t“Director’s Cut” [WT] (Romania, Denmark)Directed by Radu Ciorniciuc; produced by Tereza Šimíková\n\n\t“Everything Is Red and Grey” (Palestine, Canada)Directed by Shourideh C. Molavi, Shrouq Alaila; produced by Shourideh C. Molavi, Henry Plavidal, Laura Poitras\n\n\t“Face Value” (U.S.)Directed by Faye Tsakas; produced by Riel Roch Decter\n\n\t“God of the In-Between” (India, U.S.)Directed by Archana Phadke; produced by Aman Mann, Shaunak Sen, Jim Wilson\n\n\t“Green Gold” (France, U.S.)Directed by Ivonne Serna, Sélim Benzeghia; produced by Geoffrey Livolsi, Alex Pritz, Will N. Miller, Sélim Benzeghia\n\n\t“Joud” (Denmark, Netherlands)Directed by Diana El Jeiroudi; produced by Diana El Jeiroudi, Orwa Nyrabia\n\t\n\n\t“Last Standing Women” (Denmark)Directed by Talal Derki; produced by Charlotte Reekers, Talal Derki\n\n\t“Last Weekend in October” (U.S., Nigeria)Directed by Nosarieme Garrick; produced by Chioma Onyenwe\n\n\t“Letter to Alvin” (Sweden)Directed by Hilton Als, Göran Hugo Olsson; produced by Tobias Janson, Melissa Lindgren\n\n\t“Letters of Hope” (Denmark, Germany, U.S.)Directed by Lea Glob; produced by Sigrid Dyekjær, Eric Holland, Konstanze Speidel, Mstyslav Chernov\n\n\t“Living in Our Heads (Confidential)” (Denmark)Directed by David Borenstein; produced by Helle Faber\n\n\t“Matrescence” (U.K.)Directed by Kathryn Ferguson; produced by Eleanor Emptage, Rosie Crerar\n\n\t“My Father the Iceman” (Poland, Denmark)Directed by Łukasz Kowalski; produced by Anna Mazerant, Łukasz Kowalski, Signe Byrge Sørensen\n\n\t“Queens Ballroom” (U.S., France, Belgium)Directed by Hansen Lin, Siyi Chen; produced by Hansen Lin, Siyi Chen, Clara Vuillermoz, Laurence Buelens\n\n\tSkeptics (U.S.)Directed by Ra’anan Alexandrowicz; produced by James Doolittle, Thomas Lennon\n\n\t“State of Immortality” (Denmark, U.S.)Directed by Piotr Winiewicz; produced by Henrik Underbjerg\n\n\t“Sweet Mystery of Life” (U.S.)Directed by Robert Greene; produced by Bennett Elliott, Susan Bedusa, Douglas Tirola\n\n\t“The Calling” (Denmark)Directed by Beniamino Barrese; produced by Harry Vaughn, Benimiano Barrese\n\n\t“The Day After” (France, Israel)Directed by Yuval Orr, Aziz Abu Sarah; produced by Margaux Missika, Liel Maghen\n\n\t“The Elephant in the Room” (U.S.)Directed by Marley McDonald; produced by John Cardellino\n\n\t“The Niki De Saint Phalle Documentary Project” (France)Directed by Matt Wolf, Svetlana Zill; produced by Emma Lepers\n\n\t“The Silent Network” (Denmark, Norway)Directed by Pernille Rose Grønkjær, Noa Agnete Metz; produced by Vibeke Vogel, Nina Leidersdorff, Malthe Koch\n\n\t“Untitled UNRWA Archive Documentary” (Canada)Directed by Benedict Moran, Ramzy Haddad; produced by Benedict Moran, Ramzy Haddad\n\n\t“We Are Volcanoes” (Hong Kong, Norway)Directed by Sharon Yeung, Natalie Chao; produced by Sharon Yeung, Jillian Schlesinger\n\n\tThe selected CPH:ROUGHCUT projects:“Don’t Let the Sun Go Up on Me” (Macao, France, Denmark, Norway, Chile)Directed by Asmae El Moudir; produced by Emma Lepers, Monica Hellström, Asmae El Moudir\n\t\n\n\t“Rescue” (Denmark, Italy, Iceland, Germany)Directed by Sine Plambech; produced by Sofie Husum Johannesen, Andreas Dalsgaard, Tereza Šimíková\n\n\t“The Dawn of the Post Plantation” (Netherlands, Belgium, U.K., Congo, U.S., Italy, Indonesia)Directed by Ced’art Tamasala, Renzo Martens; produced by Lea Fels, Isidoor Roebers\n\n\t“The Siege of Paradise” (Ireland, Switzerland)Directed by Gar O’Rourke; produced by Andrew Freedman, Ken Wardrop, Jessie Hayden, Luzius Fischer, Philipp Ritler\n\n\t“War on Women” (Spain, Romania, Germany)Directed by Maris Salumets; produced by Elina Litvinova, Monica Lazurean-Gorgan, Gregor Streiber, Maris Salumets\n\n\tThe selected CHANGE projects:“10 Things” [WT] (Georgia, France)Directed by Niniko Lekishvili; produced by Ana Kvichidze, Irina Gelashvili, Estelle Robin You\n\n\t“3 Daughters” (Moldova)Directed by Ana Gherciu; produced by Ana Gherciu\n\n\t“Life on Mars” (Armenia)Directed by Mery Aghakhayan; produced by Karina Simonyan\n\n\t“My Home” (Azerbaijan)Directed by Ulviyya Ahmadova; produced by Nijat Dadashov\n\n\t“My School Is Seized” (Ukraine)Directed by Halyna Lavrinets; produced by Oleksandr Ivanov\n\n\t“Sounds of Revolution” (Georgia, France)Directed by Nikoloz Bezhanishvili; produced by Nikoloz Bezhanishvili, Victor Ede\n\n\t“Total Mess” (Sweden, Ukraine)Directed by Oleksandra Horiienko; produced by Alex Shiriaieff, Kateryna Yahodka\n\n\t“UXXR: Is There Sex After the USSR?” (Armenia)Directed by Lilit Movsisyan; produced by Sona Margaryan\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Projects From ‘Apolonia, Apolonia,’ ‘Mr. Nobody Against Putin’ Directors Among Lineup for Financing and Co-Production Event CPH:Forum",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Letter-to-Alvin.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-21T08:30:00.000Z",
      "dateModified": "2026-01-21T08:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Guess Who This Long-Haired Kid Turned Into!",
    "url": "https://www.tmz.com/2026/01/21/guess-who-long-haired-kid/",
    "image": "https://imagez.tmz.com/image/d3/16by9/2026/01/05/d3ba0d3a8acb403091123b8950902837_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-21T08:45:31.000Z",
    "description": "\n    \n                    \n                          Guess Who This\n                          Long-Haired Kiddo\n                          Turned Into!",
    "body": "\n    \n                    \n                          Guess Who This\n                          Long-Haired Kiddo\n                          Turned Into!\n                      \n                  \n                                                                        Published \n                              January 21, 2026\n                            12:45 AM PST\n                                                                            \n      \n    \n          Before this girl in blue turned into a model, she was just braving the cold in Canada ... playing soccer, field hockey and swimmin' up a storm!\n      \n    \n          She's most known for her Sports Illustrated appearances. In 2020, she graced the cover with Jasmine Sanders and Olivia Culpo.\n      \n    \n          Can you guess who she is?\n      \n      \n      \n          \n            \n              \n                \n                Share on Facebook\n              \n            \n            \n              \n                \n                Share on X\n              \n            \n                          \n                \n                  \n                \n              \n                      \n        \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Jasmine Sanders\n              \n                          \n                Olivia Culpo\n              \n                          \n                Hotties & Bodies\n              \n                          \n                Hot Bodies\n              \n                          \n                Guess Who\n              \n                          \n                Kids\n              \n                          \n                celebrity kids\n              \n                      \n        \n          \n  ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Guess Who This Long-Haired Kid Turned Into!",
      "image": [
        "https://imagez.tmz.com/image/d3/16by9/2026/01/05/d3ba0d3a8acb403091123b8950902837_xl.jpg"
      ],
      "datePublished": "2026-01-21T08:45:31.000Z",
      "dateModified": "2026-01-21T08:45:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Meghan Trainor and Daryl Sabara Welcome Baby Via Surrogate",
    "url": "https://www.tmz.com/2026/01/20/meghan-trainor-announces-baby-through-surrogate/",
    "image": "https://imagez.tmz.com/image/72/16by9/2026/01/21/7259cd0c71e64b6d9854ceb5bfe88d2c_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-21T01:37:55.000Z",
    "description": "\n    \n                    \n                          Meghan Trainor\n                          Baby No. 3 Via Surrogate!!!\n                      \n     ",
    "body": "\n    \n                    \n                          Meghan Trainor\n                          Baby No. 3 Via Surrogate!!!\n                      \n                  \n                                                                        Published \n                              January 20, 2026\n                            5:37 PM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Meghan Trainor and Daryl Sabara are expanding their family ... because they have a baby girl at home ... and she was born via surrogate.\n      \n    \n          The singer and actor now have three children together ... and their newborn is named Mikey Moon Trainor.\n      \n    \n          In a social media post announcing her daughter, Meghan says ... \"Our baby girl Mikey Moon Trainor has finally made it to the world thanks to our incredible, superwoman surrogate.\"\n      \n\n          Meghan continues ... \"We are forever grateful to all the doctors, nurses, teams who made this dream possible. We had endless conversations with our doctors in this journey and this was the safest way for us to be able to continue growing our family.\"\n      \n    \n          She adds ... \"We are over the moon in love with this precious girl. Riley and Barry have been so excited, they even got to choose her middle name. We are going to enjoy our family time now, love you all.\"\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Meghan posted a ton of photos of the baby at home and in the hospital ... so click through the gallery to see her growing family.\n      \n    \n          Congrats!!!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Daryl Sabara\n              \n                          \n                Meghan Trainor\n              \n                          \n                Celebrity News\n              \n                          \n                Family\n              \n                          \n                Relationships\n              \n                          \n                celebrity kids\n              \n                          \n                Couples\n              \n                          \n                Instagram\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Meghan Trainor and Daryl Sabara Welcome Baby Via Surrogate",
      "image": [
        "https://imagez.tmz.com/image/72/16by9/2026/01/21/7259cd0c71e64b6d9854ceb5bfe88d2c_xl.jpg"
      ],
      "datePublished": "2026-01-21T01:37:55.000Z",
      "dateModified": "2026-01-21T01:37:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL Star Justin Simmons Says 'No Drop Off' Between Bo Nix & Jarrett Stidham",
    "url": "https://www.tmz.com/2026/01/21/justin-simmons-says-no-drop-off-bo-nix-jarrett-stidham/",
    "image": "https://imagez.tmz.com/image/c9/16by9/2026/01/20/c9f89e4510514918861ee8a0b2ef9a6f_xl.png",
    "tag": "Entertainment",
    "date": "2026-01-21T08:30:14.000Z",
    "description": "\n    \n                    \n                          Ex-Broncos Star Justin Simmons\n                          'No Drop Off'\n                          ",
    "body": "\n    \n                    \n                          Ex-Broncos Star Justin Simmons\n                          'No Drop Off'\n                          ... Between Nix & Stidham\n                      \n                  \n                                                                        Published \n                              January 21, 2026\n                            12:30 AM PST\n                                                                            \n      \n    \n      \n        \n                    \n                  \n      \n                    TMZSports.com\n          \n    \n          Don't go penciling in the Patriots for the Super Bowl just yet ... 'cause former star Broncos safety Justin Simmons says backup QB Jarrett Stidham's play will be every bit as good as Bo Nix's!\n      \n    \n          \"This isn't a shot at anyone,\" Simmons told TMZ Sports. \"There's going to be no drop off.\"\n      \n    \n          Of course, 25-year-old Nix went down on the second-to-last play of their overtime thriller against the Bills on Saturday ... thrusting 29-year-old Stidham into the spotlight, with a trip to Super Sunday on the line.\n      \n\n                  \n          \n                          \n                \n                  \n      \n    \n          Simmons says that while Jarrett may not be the starter, he's a talented player who can positively impact the game.\n      \n    \n          \"The offense is gonna look a little different. Bo, when he needs to obviously uses his legs to run. [Stidham's] more of a pocket passer, but, his ball accuracy and his knowledge of what opposing defenses are giving him, he's super smart, super quick with his reads. I think Denver is going to rally behind and help him,\" the 4x All-Pro player said.\n      \n    \n          Sunday's AFC Championship Game will be just the fifth start of Stidham's career ... but while he may lack experience, he's shared a locker room with the GOAT.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          \"He's learned from greats like Tom Brady. You know, he's been in that Patriots system. He knows football really well. I'm excited for him and it's going to be his moment!\"\n      \n    \n          Simmons, who played for the Broncos from 2016 to 2023, admits he's friends with Stidham ... but that doesn't change the fact that Justin wholeheartedly believes Denver can beat the Patriots on Sunday.\n      \n    \n          Check out the full interview with Justin!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Denver Broncos\n              \n                          \n                TMZ Sports\n              \n                          \n                Exclusive\n              \n                          \n                NFL\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL Star Justin Simmons Says 'No Drop Off' Between Bo Nix & Jarrett Stidham",
      "image": [
        "https://imagez.tmz.com/image/c9/16by9/2026/01/20/c9f89e4510514918861ee8a0b2ef9a6f_xl.png"
      ],
      "datePublished": "2026-01-21T08:30:14.000Z",
      "dateModified": "2026-01-21T08:30:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jeffrey Epstein Used Birthday As Excuse to Traffic Victims, Congressman Claims",
    "url": "https://www.tmz.com/2026/01/21/jeffrey-epstein-used-birthday-excuse-trafficking-girls/",
    "image": "https://imagez.tmz.com/image/b8/16by9/2026/01/21/b88b08d069ba44969007e7070e9f9977_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-21T09:00:08.000Z",
    "description": "\n    \n                    \n                          Jeffrey Epstein Turns 73 In Hell\n                          Pedo Used Bday To Traffic Girls?!?\n   ",
    "body": "\n    \n                    \n                          Jeffrey Epstein Turns 73 In Hell\n                          Pedo Used Bday To Traffic Girls?!?\n                      \n                  \n                                                                        Published \n                              January 21, 2026\n                            1:00 AM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Here's how twisted Jeffrey Epstein was ... his birthday was little more than another reason to victimize young women, at least according to one of the Congressmen pushing for the release of Epstein photos and docs.\n      \n    \n          The late pedophile would have turned 73 on Tuesday, and Rep. Suhas Subramanyam -- a Democrat from Virginia who sits on the House Oversight Committee -- tells TMZ, Epstein's birthday is \"probably a very difficult day for many women.\"\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Subramanyam says that for a specific reason ... telling us, \"It's clear from the evidence that Epstein used his birthday as an excuse to traffic and take advantage of girls.\"\n      \n\n          It's creepy ... in the portion of the Epstein Files that have already been released, there's a number of photos showing the convicted creep with 3 young women celebrating his 54th birthday, and the women are all wearing dresses emblazoned with the No. 54 on the back.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          There are other photos of him with two other people sitting at a table with a birthday cake ... and Epstein's wearing the same sweatshirt from the photos with the girls.\n      \n    \n          Unclear who Epstein is sharing his birthday cake with ... the faces are redacted.\n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          Epstein's birthday has been one focus of the Epstein files ... Ghislaine Maxwell put together a book for his 50th birthday with letters from his celeb pals ... including a salacious letter allegedly sent from Donald Trump, who has denied being behind the note.\n      \n    \n          Subramanyam previously told us it's time to name names in the files ... but so far the release of documents has slowed to a trickle, despite a legal deadline that came and went more a month ago.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Jeffrey Epstein\n              \n                          \n                Donald Trump\n              \n                          \n                Ghislaine Maxwell\n              \n                          \n                Celebrity News\n              \n                          \n                Rape and Sexual Assault\n              \n                          \n                Birthdays\n              \n                          \n                Politix\n              \n                          \n                Exclusive\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jeffrey Epstein Used Birthday As Excuse to Traffic Victims, Congressman Claims",
      "image": [
        "https://imagez.tmz.com/image/b8/16by9/2026/01/21/b88b08d069ba44969007e7070e9f9977_xl.jpg"
      ],
      "datePublished": "2026-01-21T09:00:08.000Z",
      "dateModified": "2026-01-21T09:00:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Meredith Duxbury Hot Shots to Celebrate Her 27th Birthday!",
    "url": "https://www.tmz.com/2026/01/21/meredith-duxbury-birthday-hot-shots/",
    "image": "https://imagez.tmz.com/image/31/16by9/2026/01/20/3171206373764dcc9f0c5d0fc2763c47_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-21T08:01:32.000Z",
    "description": "\n    \n                    \n                          Meredith Duxbury\n                          Hot Shots For Her 27th Birthday!!!\n                   ",
    "body": "\n    \n                    \n                          Meredith Duxbury\n                          Hot Shots For Her 27th Birthday!!!\n                      \n                  \n                                                                        Published \n                              January 21, 2026\n                            12:01 AM PST\n                                                                            \n      \n    \n      \n        \n              \n    \n    \n          Meredith Duxbury’s been serving up wildly OTT makeup content for years -- and now it’s time we serve her a major birthday shoutout right back!\n      \n    \n          Yep, for Meredith’s big 2-7, we’ve rounded up her hottest bikini shots from her ultra-glam getaways ... and it’s clear she’s putting that influencer-earned bag to very good use.\n      \n    \n          Can you find the 6 makeup words below:\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          One thing about Meredith? She’s got an unreal body -- and she knows exactly how to work it with those killer poses.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Happy birthday, Meredith!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Hotties & Bodies\n              \n                          \n                Hot Bodies\n              \n                          \n                Birthdays\n              \n                          \n                Photo Galleries\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Meredith Duxbury Hot Shots to Celebrate Her 27th Birthday!",
      "image": [
        "https://imagez.tmz.com/image/31/16by9/2026/01/20/3171206373764dcc9f0c5d0fc2763c47_xl.jpg"
      ],
      "datePublished": "2026-01-21T08:01:32.000Z",
      "dateModified": "2026-01-21T08:01:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]