[
  {
    "title": "YouTube TV and Disney Reach Deal Ending Two-Week Blackout of ESPN, ABC",
    "url": "https://variety.com/2025/tv/news/youtube-tv-disney-blackout-deal-renewal-espn-abc-1236567658/",
    "image": "https://variety.com/wp-content/uploads/2025/11/Dancing-With-the-Stars.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-15T00:40:45.000Z",
    "description": "\n\tESPN, ABC and other Disney TV networks are coming back to YouTube TV. \n\n\tGoogle and Disney finally ended their standoff, announcing a multiyear agre",
    "body": "\n\tESPN, ABC and other Disney TV networks are coming back to YouTube TV. \n\n\tGoogle and Disney finally ended their standoff, announcing a multiyear agreement Friday on pricing and terms for a renewed carriage deal for YouTube TV. Disney’s nets went dark on the internet TV service just before midnight ET on Thursday, Oct. 30, after the two sides remained far apart on a deal before the expiration of the previous contract.\n\n\n\tUnder the new agreement, ESPN’s full lineup of sports — including content from ESPN Unlimited — will be made available on YouTube TV to base-plan subscribers at no additional cost by the end of 2026. In addition, access to a selection of live and on-demand programming from ESPN Unlimited will be available inside YouTube TV.\n\t\n\n\tThe deal also lets YouTube include the Disney+ and Hulu bundle as part of “select YouTube offerings.” According to Disney, “select networks” will be included in various genre-specific packages that YouTube TV expects to launch in the future. \n\n\t“This new agreement reflects our continued commitment to delivering exceptional entertainment and evolving with how audiences choose to watch,’’ Disney Entertainment co-chairmen Alan Bergman and Dana Walden and ESPN chairman Jimmy Pitaro said in a joint statement. “It recognizes the tremendous value of Disney’s programming and provides YouTube TV subscribers with more flexibility and choice. We are pleased that our networks have been restored in time for fans to enjoy the many great programming options this weekend, including college football.”\n\n\tIn a statement, a YouTube spokesperson said Friday, “We’re happy to share that we’ve reached an agreement with Disney that preserves the value of our service for our subscribers and future flexibility in our offers. Subscribers should see channels including ABC, ESPN and FX returning to their service over the course of the day, as well as any recordings that were previously in their Library. We apologize for the disruption and appreciate our subscribers’ patience as we negotiated on their behalf. ”\n\t\n\n\tThe deal supersedes their prior distribution agreement, inked in December 2021 after a two-day blackout.\n\n\tOn Sunday (Nov. 9) YouTube began issuing one-time $20 credits to YouTube TV customers for the loss of Disney’s programming, in the hopes it would help stave off user cancelations.\n\n\tMany YouTube TV subscribers dropped the service in frustration. According to a survey fielded last week, 24% of YouTube TV users said they had canceled or intended to cancel their accounts over the Disney blackout. A YouTube rep said that “while subscriber churn is always regrettable, it’s been manageable and does not align with the findings of this survey.” Disney took a hit, too, losing more than $4 million per day during the blackout, according to an estimate by Morgan Stanley analysts.\n\n\tGoogle had said Disney was asking for an unprecedented fee increase for the full suite of ESPN channels, ABC local stations, FX, Disney Channel, Freeform, Nat Geo and more — while Disney claimed the tech giant was “refusing to pay fair rates for our channels.” According to Google, Disney was trying to “reset” the market pricing for its programming (so it could charge similarly higher rates in upcoming renewals with other pay-TV distributors) and that Disney was insisting YouTube TV take the Mouse House’s full lineup of networks. The negotiating teams were led by Disney Platform Distribution EVP Sean Breen and YouTube chief business officer Mary Ellen Coe.\n\n\tThe removal of Disney’s networks from YouTube TV came a day before a busy Nov. 1 Saturday slate for college football as major marquee teams face pivotal contests, many of them aired on ESPN and ABC. In light of the blackout, ESPN made its “College GameDay” football pregame show available free to watch via a livestream on X. YouTube TV customers also missed two airings of “Monday Night Football” on ABC and ESPN. (YouTube pointed out to users they could catch all of ESPN’s programming on the ESPN Unlimited subscription service.)\n\n\tAlong with Disney’s live channels, YouTube TV customers’ DVR recordings of the media conglomerate’s programming were removed, as is standard in such disputes. With the deal renewal, YouTube TV subscribers will regain access to recordings that were previously in their library, according to YouTube.\n\t\n\n\tOn Thursday, Disney CEO Bob Iger told analysts that the company had been “working tirelessly to close this deal” but said, “It’s also imperative that we make sure that we agree to a deal that reflects the value that we deliver, which both YouTube, by the way, and Alphabet, have told us, is greater than the value of any other provider.”\n\n\tDisney Entertainment’s Walden and Bergman and ESPN’s Pitaro had previously addressed the impasse in several memos to staffers. “YouTube TV and its owner, Google, are not interested in achieving a fair deal with us,” the execs wrote in an Oct. 31 email. “Instead, they want to use their power and extraordinary resources to eliminate competition and devalue the very content that helped them build their service.”\n\n\tMeanwhile, ahead of this year’s Election Night (Nov. 4), Disney asked Google to restore ABC on YouTube TV for one day to serve the “public interest.” Google declined — and instead suggested that Disney allow YouTube TV to make ABC and ESPN available while the two sides continued talks because those are “the channels that people want.” Disney didn’t go for the idea.\n\n\tThe Disney-Google clash became public Oct. 23, when Disney began alerting viewers that its networks could be removed from YouTube TV.\n\n\tDisney has faced other tough negotiations with distributors amid the transition to ESPN Unlimited — the standalone streaming service launched in August that includes everything on the sports programmer’s lineup — and its continued investment in Disney+ and Hulu.\n\n\tIn 2023, Disney’s networks had a 10-day blackout on Charter Communications cable systems in a similar fight over price. To settle the Charter deal, Disney allowed Charter’s high-tier TV subscribers to access Disney+ and the ESPN+ streaming app. In 2024, ESPN and other Disney nets went dark on DirecTV for nearly two weeks before they reached a new deal. In October, Disney and Comcast quietly reached a carriage renewal deal.\n\n\tGoogle has encountered no small amount of friction in deal-renewal talks this year for YouTube TV. Other programmers that have fought with the internet company include Paramount Global (now Paramount Skydance), Fox Corp. and NBCUniversal — each of which reached a new deal without a blackout. At the end of September, YouTube TV dropped Univision, with Google alleging the price increases sought by parent company TelevisaUnivision were drastically out of line with viewership on the platform.\n\t\n\n\tYouTube TV is the biggest internet-TV service in the U.S., estimated to have more than 10 million subscribers. Next is Disney, which last week closed a deal to merge its Hulu + Live TV business with Fubo; together, those have almost 6 million subs in North America. Google had asserted Disney’s hardball tactics over a YouTube TV deal was “benefiting their own live TV products, including Hulu + Live TV and Fubo.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "YouTube TV and Disney Reach Deal Ending Two-Week Blackout of ESPN, ABC",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/Dancing-With-the-Stars.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-15T00:40:45.000Z",
      "dateModified": "2025-11-15T00:40:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Demon Slayer: Infinity Castle’: Crunchyroll Bosses Want Oscar Voters to Consider the ‘Beautiful Art Form’ of Anime",
    "url": "https://variety.com/2025/film/news/demon-slayer-infinity-castle-oscars-1236581665/",
    "image": "https://variety.com/wp-content/uploads/2025/07/Demon-Slayer-poster.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-14T23:11:23.000Z",
    "description": "\n\tIs this the year anime dominates the animated feature race at the Oscars?\n\n\tCrunchyroll’s “Demon Slayer: Infinity Castle” shattered records when it ",
    "body": "\n\tIs this the year anime dominates the animated feature race at the Oscars?\n\n\tCrunchyroll’s “Demon Slayer: Infinity Castle” shattered records when it became the highest-grossing Japanese film of all time, earning $682 million worldwide. The film won fans over, but now Crunchyroll bosses have the Oscars in sight. And rightfully so, the film’s score, production design and craftsmanship are dazzling.\n\n\n\t“Demon Slayer: Infinity Castle” follows Tanjiro Kamado (dubbed by Zachary Aguilar) and the Demon Slayer Corps in a battle against Muzan Kibutsuji and the Upper Moons inside his hideout, known as the Infinity Castle. The Crunchyroll team targeted the demographic of life-long anime fans and newcomers to the artform in rolling out the film.\n\t\n\n\t“We needed to be authentically Crunchyroll [in marketing]. We have a great deep connection with our fan base and a wonderful relationship with them, and we needed to create moments for them to unveil pieces of the movie,” said Mitchel Berger, EVP of Global Commerce during a Variety Screening Series conversation moderated by Variety’s Senior Artisans Editor Jazz Tangcay. “We needed to create experiences [at] San Diego Comic-Con with a booth that we did with a VR experience. [The fans] knew the characters, they knew the story. A lot of them knew what was gonna happen because they had read the manga. It’s drawing them into the world and letting them see what’s there.”\n\n\t“It’s tapping into all the other things that [Crunchyroll] built over the years for this IP. Voice actors are a great example,” revealed Rahul Purini, President of Crunchyroll. “Japanese voice actors are really popular with fans around the world, and so are all the other English or other language actors. Bringing them into the journey with us and to help them connect their fandom and music was a big part. Being able to work with artists like Lisa who perform and using that [opportunity] to connect and talk to the fans around the world. It was all of those things like tapping into every one of those things that makes anime fans of ‘Demon Slayer’ so passionate about this IP.”\n\t\n\n\tAside from the film’s box office success and driving audiences to movie theaters, the company is running a full award season campaign. Both Purini and Berger are hopeful that the anime medium be taken seriously by not only fans, but with Guild and Academy voters.\n\n\tTwo anime films, “Spirited Away” and “The Boy and the Heron,” both by Hayao Miyazaki, have taken home the Oscar for best animated feature. The team stand on Miyazaki’s shoulders and hope voters will consider “Demon Slayer.”\n\n\tPurini said, “We are working on making sure that this new audience that we are talking to with the FYC are part of it.” He went on to say, “It’s important for them to pay attention to and be part of and consider it seriously. But the other thing I will say is, going back to be being in a privileged position, we have some giants that have taken anime to the Oscars that we get to build off of Miyazaki, Makoto Shinkai, with his last movie ‘Suzume.’ We are building on the work of those legends.”\n\n\tBerger added between stop-motion, traditional 2D animation and CG animation, “Anime is one of those ways of telling a story.” He went on to say that being a part of the conversation was a way of elevating the art form.  “It’s a beautiful piece of artwork. The craftsmanship, the care, and the love that goes into this, just to be able to expose people to that, is a wonderful thing.”\n\n\tThe pair also discussed the decision to make “Demon Slayer” into a movie versus releasing another season of the much-loved franchise on the platform.\n\n\tBerger credited Ufotable, the animation company. “What they realized immediately and, and delivered on is, is this is a story that deserves to be told on the biggest stage, the biggest visual with the best sound. It just feels cinematic to begin with. They made the decision, this was the right way to tell the end of the story.” \n\n\tBerger later said watching the series on the platform versus seeing the movie in a theater didn’t need to create conflict. “It’s all about giving people a chance to make an emotional connection with a piece of content in different ways. And there’s ways for it to happen all over the place.”\n\n\tPurini added, “Fans want this theatrical experience. They want to come to theaters, they want to watch these movies on big screen with friends and family. We are committed to bringing them that. We are committed to theatrical experience. We have the connection with fans, and we can bring them to theaters.”\n\t\n\n\t“Infinity Castle” is the first film of a planned trilogy to be released. While they’re “eager to bring” the next two films to fans, no release dates have been set. \n\n\tBerger reflected on the film’s success. “It sounds a little cliche, but it was really a privilege to be a part of this,” he said. “We were able to play a part in bringing something to a global audience that really resonated with a fan base in an incredible way, and the box office shows. There’s no better feeling in the world.”\n\n\tWatch the video above.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Demon Slayer: Infinity Castle’: Crunchyroll Bosses Want Oscar Voters to Consider the ‘Beautiful Art Form’ of Anime",
      "image": [
        "https://variety.com/wp-content/uploads/2025/07/Demon-Slayer-poster.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-14T23:11:23.000Z",
      "dateModified": "2025-11-14T23:11:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "From Cardboard Boxes to AI: Stunt Legends Share Stories, Wisdom at Round Top Film Festival",
    "url": "https://variety.com/2025/film/festivals/cardboard-boxes-ai-stunt-legends-round-top-film-festival-1236582410/",
    "image": "https://variety.com/wp-content/uploads/2025/11/fall-guy.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-15T00:00:00.000Z",
    "description": "\n\tAirbags are fine. But when it comes to high falls, sometimes all you need to land safely is a stack of cardboard boxes.\n\n\tThat was one of the takeaw",
    "body": "\n\tAirbags are fine. But when it comes to high falls, sometimes all you need to land safely is a stack of cardboard boxes.\n\n\tThat was one of the takeaways from the Round Top Film Festival’s “From the Jump: Film and TV Stunt Designers in Conversation” panel in Round Top, Texas on Nov. 9, which featured veteran stunt coordinators and second unit directors Chris O’Hara, recipient of the fest’s Maverick Stunt Award, and Vic Armstrong, who was honored with a Lifetime Achievement Award.\n\t\n\n\t“You can tuck a cardboard box into the little corner over there [if] he’s coming off that deck and landing in the alleyway,” said Armstrong. “You get an airbag, you can’t fit it in there.”\n\n\t“If you hit the edge of an airbag, it’s not good. … You’re going to roll right off to the ground,” added O’Hara. “You can hit the edge of boxes, if you set them up correctly, and it will still kind of slow your fall down and do what it’s supposed to. … The general rule of thumb is one two-foot-by-two-foot box is good for 10 feet [of height].”\n\n\tThe panel also featured Nate Boyer (former Army Green Beret and NFL player turned filmmaker), Shane Habberstad (stunt person, stunt coordinator and second unit director), Crystal Hooks (motorsports expert and precision driver), Noelle Therese Mulligan (stunt person) and Tom Struthers (stunt coordinator and second unit director). It was moderated by Variety editor Todd Longwell.\n\n\tPrior to the panel, O’Hara was honored with the Maverick Stunt Award, presented by Variety. A 25-year industry vet, he earned a Taurus World Stunt Award for best second unit director/stunt coordinator for his work on 2024’s “The Fall Guy,” an action-comedy about a stunt man (Ryan Gosling) who goes in search of a missing movie star.  The presentation was made by last year’s Maverick Stunt Award recipient, RJ Casey (“Inception,” “Dunkirk,” “Extraction 2”).\n\t\n\n\t“‘The Fall Guy’ just crushed it,” enthused Casey. “It’s one of those movies that you just can’t turn off because you can’t wait to see the next sequence, the next stunt. … Everything about that movie was magical.” \n\n\tHe went on to praise O’Hara for his efforts to establish a new Academy Award for stunt design, which will debut in 2028: “A lot of generations of stunt people that have made it possible to get stunts into the Oscars finally, and here’s one of the last guys to get that ball into the end zone.”\n\n\tOn “The Fall Guy,” O’Hara and his stunt team broke a Guinness World Record with an eight-and-a-half-turn car roll, executed by stunt driver Logan Holladay, doubling for Gosling. It bested the previous mark of seven rolls set by Adam Kirley in “Casino Royale.”\n\n\t“I personally didn’t get into this business to break world records. That’s not my goal,” said O’Hara, noting that the number of rolls was written into the script. “I said, ‘If we can achieve it, that would be amazing.’ But I think that on Bond it had the terrain to help it out, to give the rolls. It was downhill so it created more energy for it to keep going. We had to do ours on a beach on flat [ground], so I wasn’t sure if it’d be able to be achieved. … We tested two times on the beach, we shot it once. It didn’t go according to plan. Everybody was safe, but it wasn’t the effect that we were looking for and we had a chance to do another one. So that last one that you see on film was everything coming together.”\n\n\tThe stunt was a “cannon roll,” which uses a pyrotechnic or, in this case, pneumatic device mounted under the chassis, usually near the rear axle. When triggered, it fires into the ground, flipping the vehicle. According to O’Hara, the beach setting for the stunt was a subtle nod to the first on-screen cannon roll, performed by driver Gary McClarty in a climactic beach chase sequence in the 1974 detective movie “McQ,” starring John Wayne.\n\n\tThe cannon roll was developed for “McQ” by stunt coordinator Hal Needham (who went on to direct the first meta stunt movie, 1978’s “Hooper,” starring Burt Reynolds) and stuntman Ronnie Rondell. It was an improvement on the less spectacular ramp flip, in which a vehicle is driven on to hidden, angled ramp and rolled – a technique used since the earliest days of film.\n\t\n\n\tLifetime Achievement Award honoree Armstrong is a 60-year stunt veteran whose credits include doubling Christopher Reeve in “Superman” (1978) and Harrison Ford in “Raiders of the Lost Ark” (1981), along with second unit director gigs on a long list of films, including a trio of James Bond movies, “Tomorrow Never Dies” (1997), “The World Is Not Enough” (1999) and “Die Another Day” (2002). He’s also responsible for an advancement in stunt technology, earning an Academy Award for technical achievement in 1986 for his Fan Descender, a device that uses air resistance to control a stunt performer’s high fall descent speed. \n\n\tIn recent years, much of the new technology used in the stunt realm has come courtesy of visual effects artists, who employ CGI to erase safety wires, composite in dangerous elements like fireballs and, at times, build action sequences almost completely from the whole digital cloth.\n\n\t“I have this love-hate relationship with visual effects,” said Armstrong. “I always equate it to morphine. Morphine in the right dose for the right ailment is an absolute godsend. Used and abused, it’s a killer. And I feel the same way with visual effects. Used in the right way, it’s terrific.”\n\n\tStruthers concurred, but noted that while at times he’s fought against using too much CGI, there are a few stunts where he would’ve been wise to ask for more help from the visual effect department, most notably an aerial sequence in 2012’s ‘The Dark Knight Rises’” in which he had stunt men entering and exiting a plane flying at 6,500 feet.\n\n\t“If I was given that opportunity again, I’d probably do a lot of that digital because of the element of danger of four people [jumping] out the back of a C-130 aircraft at 120 knots,” he said. “I don’t think I would want to have the same heart attack that I had then.”\n\n\tIt’s impossible to have an entertainment industry discussion in 2025 without talking about AI. While many regard it as a digital bogeyman that will usher in he end of times, when the subject was broached during the stunt panel, the reaction was surprisingly sanguine.\n\n\t“At a certain point, there’s not going to be a reason to hit a guy with a car,” said Habberstad, a second-generation stunt pro whose bio notes that he was conceived on a movie set. “There already [are] very few reasons. It has to be a very specific thing to do certain stunts where people can get hurt. And I think at a certain point if the computer can do it better and I don’t have to ask my friend to stand in front of a car, then we’re not going to.”\n\t\n\n\tVariety moderated this conversation in partnership with Round Top Film Festival.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "From Cardboard Boxes to AI: Stunt Legends Share Stories, Wisdom at Round Top Film Festival",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/fall-guy.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-15T00:00:00.000Z",
      "dateModified": "2025-11-15T00:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Keeper’ Ending Explained: What’s Up With Those Monsters in the Creepy Cabin in Osgood Perkins’ Latest Horror?",
    "url": "https://variety.com/2025/film/news/keeper-ending-explained-horror-movie-osgood-perkins-1236581539/",
    "image": "https://variety.com/wp-content/uploads/2025/11/MCDKEEP_EC047.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-15T00:30:00.000Z",
    "description": "\n\tSPOILER ALERT: This article contains major spoilers for Osgood Perkins‘ “Keeper,” now playing in theaters.\n\n\tDirector Osgood Perkins has given us no",
    "body": "\n\tSPOILER ALERT: This article contains major spoilers for Osgood Perkins‘ “Keeper,” now playing in theaters.\n\n\tDirector Osgood Perkins has given us not one, but two twisted horror movies this year that are vastly different but equally chilling: “The Monkey,” a gory Stephen King adaptation that dropped in February, and “Keeper,” a haunted cabin thriller releasing in theaters this weekend.\n\n\n\tMuch like Perkins’ past horror movies “Longlegs” and “The Blackcoat’s Daughter,” there’s more going on in “Keeper” than just a couple camping out in a creepy cabin in the woods. The nature getaway soon takes a terrifying turn for Liz (Tatiana Maslany) and and her boyfriend Malcolm (Rossif Sutherland), as Liz begins seeing visions of undead spirits and Malcolm’s true intentions are revealed.\n\t\n\n\tNear the end of “Keeper,” it’s revealed that Malcolm isn’t actually a hard-working doctor, he’s really an immortal manipulator who lures women to his cabin to sacrifice them in order to prolong his life. In a flashback 200 years ago, a young Malcolm and his cousin capture a mysterious pregnant woman who was trespassing on their land. She turns out to be some kind of witch who gives birth to a horde of monsters. In the years that follow, the creatures grant Malcolm and his cousin eternal life in exchange for the lives of women they bring to the cabin for them to feast on. That explains why Liz sees the visions of undead ghouls roaming the property, like a woman with a bloody bag over her head, a long-necked spirit and a white-faced monster spewing gunk from its mouth.\n\n\tBut Liz doesn’t succumb to Malcolm’s evil plans for her. After revealing his true intentions, he locks her in the basement, where the monsters actually embrace Liz and don’t tear her apart. In a twist, the pregnant woman 200 years earlier looked exactly like Liz, so the creatures view her as their mother. The monster with the bag over her head reveals her creepy face, which has multiple eyes and mouths, and calls herself Liz’s child. \n\t\n\n\tWhen Malcolm wakes up the next morning, he suddenly has aged decades overnight. Liz, with the power of her spooky brood behind her, flips the script and captures him. She ties him upside-down and hangs him by his feet from a tree to dunk his head into a pot of honey. In the final shot, we see Liz’s face, which has the same jet-black eyes as her newfound monster children. In the end, it wasn’t the grotesque ghouls causing harm, it was actually the people inside the cabin.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Keeper’ Ending Explained: What’s Up With Those Monsters in the Creepy Cabin in Osgood Perkins’ Latest Horror?",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/MCDKEEP_EC047.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-15T00:30:00.000Z",
      "dateModified": "2025-11-15T00:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jon Voight Begs Trump to ‘Terminate’ Zohran Mamdani’s NYC Mayor Win: ‘Only He Can Stop This Horror’",
    "url": "https://variety.com/2025/film/news/jon-voight-begs-trump-terminate-zohran-mamdani-nyc-mayor-1236582499/",
    "image": "https://variety.com/wp-content/uploads/2025/11/voight-mamdani.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-14T23:39:20.000Z",
    "description": "\n\tJon Voight has called upon President Trump to “terminate” New York City’s mayoral election of Zohran Mamdani. The 86-year-old Oscar-winner, who was ",
    "body": "\n\tJon Voight has called upon President Trump to “terminate” New York City’s mayoral election of Zohran Mamdani. The 86-year-old Oscar-winner, who was appointed the newly invented title of special ambassador to Hollywood by Trump in the first days of his second term, elected to go public with his plea to the president, posting a two-minute speech on social media with an American flag in the background.\n\n\t“We the people have put our trust in the President of the United States, Donald J. Trump. He, and only he, can stop this horror, as this mayor, Mamdani, will try to destroy New York’s wealth and turn it into a socialist crap city,” Voight said in the video. “Let this be a warning to the people and may God bless.”\n\t\n\n\tVoight, whose primary residence is in Beverly Hills, Calif., centered his speech on Islamophobic rhetoric, claiming that New York would “turn into a virtual refugee shelter for the radical Muslim ideology” and that the days after Mamdani’s election have been “the most dangerous time for our citizens.” He also erroneously deemed the 34-year-old Mamdani a “communist” — a characterization that the mayor-elect has refuted, describing himself as a “democratic socialist.”\n\n\n\tNotably, the office of the president does not have legal authority to directly remove a New York City mayor from office.\n\n\t“This mayor will destroy this city. We are obligated to demand our rights for our private sanctuary, our businesses, our property that we all have worked so hard for. And this 35-year-old mayor has no right dictating the rules of socialism for a city built on our highest principles with brick and stone by hard-working Americans,” Voight continued. “This must be stopped and his mayoralty should be terminated immediately. You — the people of the greatest city, New York — are in danger of losing your city to this communist fool.”\n\t\n\n\tMamdani won the mayoral election in New York with a majority of the vote, beating former New York Gov. Andrew Cuomo, who ran as an Independent after first losing to Mamdani in the Democratic primary. Mamdani will take office on Jan. 1. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jon Voight Begs Trump to ‘Terminate’ Zohran Mamdani’s NYC Mayor Win: ‘Only He Can Stop This Horror’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/voight-mamdani.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-14T23:39:20.000Z",
      "dateModified": "2025-11-14T23:39:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jennifer Lawrence Says ‘It’s Awful’ Working Hard on a Movie Only for the World to Hate It: ‘It’s a Very Scary Few Months’ When You’re Opening a Movie",
    "url": "https://variety.com/2025/film/news/jennifer-lawrence-bad-reviews-1236581425/",
    "image": "https://variety.com/wp-content/uploads/2025/10/P102HK0O.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-14T23:02:01.000Z",
    "description": "\n\tJennifer Lawrence recently told V magazine that releasing a movie can be an “awful” experience for her emotions as the public decides whether or not",
    "body": "\n\tJennifer Lawrence recently told V magazine that releasing a movie can be an “awful” experience for her emotions as the public decides whether or not what she made is good or not.  \n\n\t“The experience only adds to the dread, because I’ve had so many experiences of working so hard on something, loving something so deeply, and then releasing it to the world, and the world just being like, ‘Boo! Hate you!’ It is so awful,” Lawrence said. “And [yet] somehow, I read a script, I meet with the director, we get on set, we start doing it, and somehow I’m able to forget that this part of the process will happen. I mean, I’m very blessed and very lucky. But it’s a very scary few months.”\n\t\n\n\t“My husband was so confused because he doesn’t have as much experience with this stuff,” she continued. “So I was telling him about my anxiety, and he was like, ‘But the movie’s incredible.’ And I was like, ‘I know, but that doesn’t matter. People might not get it.’ And he was like, ‘But they’re wrong.’ Like, as if that was supposed to make me feel better.”\n\n\n\tLawrence has been making the press rounds in recent weeks to support her latest drama, “Die My Love.” She stars in the movie as a new mother who descends into psychosis. Robert Pattinson plays her unhelpful husband. The film is directed by Lynne Ramsay.\n\n\tIn several recent interviews, Lawrence has gotten brutally honest about her anxiety over doing interviews during press tours for her movies. She told Vanity Fair in 2021 that she took a two-year break from Hollywood because “everybody had gotten sick of me. I’d gotten sick of me.” Speaking to The New Yorker last month, Lawrence admitted that she understood why the public “rejected” her personality because she actually was “annoying” in old interviews. \n\t\n\n\t“Well, it is, or it was, my genuine personality, but it was also a defense mechanism,” Lawrence said about being so off the cuff in interviews. “And so it was a defense mechanism, to just be, like, ‘I’m not like that! I poop my pants every day!’ … I look at those interviews, and that person is annoying. I get why seeing that person everywhere would be annoying.”\n\n\t“Die My Love” is now playing in theaters nationwide. Head over to V magazine’s website to read Lawrence’s interview in its entirety.  \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jennifer Lawrence Says ‘It’s Awful’ Working Hard on a Movie Only for the World to Hate It: ‘It’s a Very Scary Few Months’ When You’re Opening a Movie",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/P102HK0O.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-14T23:02:01.000Z",
      "dateModified": "2025-11-14T23:02:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chloé Zhao on Channeling Feminine Power in ‘Hamnet,’ Four-Year Break After ‘Eternals’ and ‘Buffy the Vampire Slayer’ Sequel With ‘OG Characters’",
    "url": "https://variety.com/2025/film/news/chloe-zhao-hamnet-eternals-buffy-og-characters-1236580231/",
    "image": "https://variety.com/wp-content/uploads/2025/11/P10257FA-e1763001234406.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-14T23:37:21.000Z",
    "description": "\n\tChloé Zhao emerges from her cave — her words, not mine — with “Hamnet.” \n\n\tIt’s a film that feels less like a period drama and more like a spiritual",
    "body": "\n\tChloé Zhao emerges from her cave — her words, not mine — with “Hamnet.” \n\n\tIt’s a film that feels less like a period drama and more like a spiritual excavation. The co-writer and director, who spent a decade traversing America for her first three features before winning an Oscar for “Nomadland” (2020), has created something that operates on a frequency beyond traditional narrative filmmaking. It’s a dangerous kind of vulnerability, and Zhao knows it.\n\t\n\n\t“We’re experiencing our tools to bring us to the present moment, moment by moment,” Zhao explains, her words tumbling out in the associative way of someone describing the indescribable. “So it doesn’t feel like we did it because it’s channeled. It came through us.”\n\n\n\tThis channeling required Zhao to confront parts of herself she’d kept carefully contained. For years, the maternal, the deeply feminine, the parts of consciousness that felt unsafe to inhabit fully — these elements were either absent or repressed in her work. “My first three films, if you think about it, the mother characters, the kind of deeply connected to earth, to nature, this kind of powerful feminine energy that almost feels like nature doesn’t coexist—the mothers are either not capable or dead,” she reflects. “I actually wasn’t sure I could handle this character. To direct this character, create this character, I have to bring that part of myself out. And I wasn’t even sure I was ready for that.”\n\n\tThe four years between Marvel’s “Eternals” (2021) and “Hamnet” were not an absence but a necessary metamorphosis. “I think the first three films changed my life — that 10 years of going to different places in America and getting to know America as an Eastern person and as a Chinese person,” Zhao says. “What happened was that kind of pioneering, gathering treasure of the 10 years, making the first three films was bubbling inside of me so much. It was like a volcano, and it erupted, and that eruption was ‘Eternals.'” She needed those four years to cool the lava, excavate the material and reshape it into something that could examine the nature of humanity on her terms.\n\t\n\n\tWorking with Paul Mescal, Jessie Buckley and breakout child actor Jacobi Jupe, Zhao created a container — her preferred word — for audiences to feel together, to watch each other experience grief and transformation. The film’s emotional centerpiece, where Buckley’s character confronts unimaginable loss, required a delicate balance of preparation and surrender. “For Jessie to go into a scene like the death of a child, and to then hold attention of knowing who this character is, but also not knowing, moment by moment, what’s going to come through — only when you hold long enough that ‘to be or not to be’ tension does the answer arrive,” Zhao explains. “And when that arrives in that scream, that’s not just her grief, that’s grief channeled through her, because she had chosen to be a conduit of that.”\n\n\tNature itself became a head of department on “Hamnet.” A void in an ancient forest, discovered during location scouting in Wales, inspired the film’s central metaphor — connecting the Globe Theatre stage to something primordial and eternal. \n\n\tWhat Zhao wants audiences to take away from “Hamnet” isn’t only catharsis, but evidence of the human capacity for transformation. “We are designed to have the chemical capacity to go through metamorphosis at any time, any stage in life,” she says. “When there’s great tragedy, you don’t have to give it a narrative like something’s wrong. You can look at it like it’s winter, fall coming to winter, and the more one can sustain the discomfort of winter, the more beautiful and glorious the summer is going to be.”\n\n\tOn this episode of the Variety Awards Circuit Podcast, Zhao discusses the spiritual dimensions of “Hamnet,” working with child actors and why her upcoming “Buffy the Vampire Slayer” sequel pilot required an entirely different skill set. Listen below!\n\n\tRead excerpts from her interview below, which has been edited and condensed for clarity.\n\t\n\t\tWhat makes “Hamnet” different from your previous work?\t\n\n\tI was different. I was very different. So everything about it is different. But what remains the same is the desire for people to feel, to create a container for people to be together and feel and look at each other, watch each other feel.\n\t\n\t\tThe maternal energy in this film feels very different from your earlier work. Was that a conscious evolution?\t\n\n\tMy first three films, if you think about it, feature mother characters who are deeply connected to the earth and nature, embodying a powerful feminine energy that almost feels like it doesn’t coexist—the mothers are either not capable or dead. The characters in my first three films typically have a repressed feminine side, and they must undergo a journey. Cersei in “Eternals” was my first attempt to bring back that side of feminine consciousness within me that never really felt safe enough to become fully seen and empowered.\n\t\n\n\tI actually wasn’t sure I could handle this character. To direct this character, create this character, I have to bring that part of myself out. And I wasn’t even sure I was ready for that. So that’s why I even hesitated, because there’s a motherload of mother in this one.\n\t\n\t\tYou and Jessie Buckley both discuss not fully understanding how you achieved certain moments. Can you explain that process?\t\n\n\tI think the reason it might sound like we’re being very modest is that there’s a genuine reason. What we are trying to do, what we work really hard for, is to utilize our tools to bring us to the present moment, moment by moment. So it doesn’t feel like we did it because it’s channeled. It comes through us. However, it doesn’t mean that the preparation work doesn’t require a lot of practice. It doesn’t require a lot of commitment, discipline, or sheer energy and physical endurance to stay in a state of consciousness and unconsciousness.\n\n\tIn nature, how nature tells stories, which to me is a spiral, it doesn’t know where it’s going to arrive. It stops when the energy brings it to a state of cohesion. You also have to lead and build from half of the time from consciousness, but the other half from unconsciousness, which means not knowing. That is — while trying to deliver a film that is going to exist and be judged by a world that prefers knowing and control and rationality — a lot of faith from top level, like studio level, down to a PA who doesn’t know what’s going to happen today on set.\n\n\tFor Jessie to go into a scene like the death of a child, and to then hold attention of knowing who this character is, but also not knowing, moment by moment, what’s going to come through — only when you hold long enough that “to be or not to be” tension does the answer arrive. And when that arrives in that scream, that’s not just her grief, that’s grief channeled through her, because she had chosen to be a conduit of that. But to do that is no small matter. But if you ask her how you did do it on the day, I can’t quite tell you — it’s weeks, weeks, months and years of commitment.\n\t\n\t\tWorking with child actor Jacobi Jupe seems to have been remarkable. How did you approach those scenes?\t\n\n\tWhen I met Jacobi, I was stunned by both the raw talent and the ability to stay present, but also the techniques—being able to deliver things over and over again, and understand the subtext, understand the nuance of things on the spot. In that moment when he says, “I’ll be brave, Father, I’ll be brave”—that was not in the script. We did a couple of takes, and then, as I’m watching, he just came to me. I just shouted, “I’ll be brave, Father, I’ll be brave.” And then he goes, “I’ll be brave, Father.” He just acted. I was like, Wow. I thought I would have to cut and go tell him, explain. No, he just did it and the nuance of it when he delivered the lines.\n\t\n\n\tIf children aren’t giving it their first or second try, I don’t have the skills to turn them around, because that means they have to pretend, and my dissonance meter is so high that I won’t be able to handle it. So I’ll take what they give. That’s why casting is everything, and creating the environment and letting them be in the moment, actually feeding these emotions.\n\t\n\t\tCan you discuss finding the tree, with the void, and how nature influenced the film?\t\n\n\tNature is one of — I’ve worked with nature, I consider it a crew member, truly a head of department. Earth is one of my HODs. I was in Ukraine. I was with somebody who was making a documentary set on the front line in a strip of forest. So, he was sending me this stuff, and I was seeing these dugouts, holes, and limelight holes in the ground. And I walk around my forest, and I see these naturally made holes in the ground. I just had such a big emotional reaction because the void is coming from within us, one way or another, and somehow it made me feel like it’s meant to connect us. It doesn’t matter what life’s circumstances are — this is the great equalizer, and it makes us human.\n\n\tIn that darkness, in that void, the composting process happens, and new life comes out of that. It comes out of the battlefield. It originates from an ancient forest. All of us will become compost. So all living things must die, passing through nature to eternity. With everything that’s going on in the world, which feels so impossible, our humanness will somehow connect us in the end.\n\n\tWe were looking for a tree with a void, and we had this crazy idea that we would have “Hamlet” playing on a subsonic level, one that you can’t hear when they meet. So the void actually connects past and future. That void inspired Hamnet to be on the stage. None of that was in the script. Then we realized he’s going to get stuck at the threshold, at the void on the stage, unable to go because his mother is holding him. When I say nature is an HOD, it is because it inspires everything — inspiring the language of the film, the catharsis of the film, and the symbolism that emerges from it.\n\t\n\t\tYou didn’t formally study film until later. What were you supposed to be?\t\n\n\tA manga artist or a private detective. Those were my two career goals. I used to read, in middle school in China, a Japanese manga called “Cat’s Eye,” which is about three sisters. They’re like thieves at night. They own a coffee shop, but they’re like detective thieves, solving stuff at night. They leave behind a small card. It’s this cat’s eye, like a black cat with an eye. And I used to make that and go around my middle school. I’d hand it out and say, Hey, if you need your cheating father to be followed, or if you lost something — no one came to me for anything, but I just wanted to be a detective. That is a storyteller now — you’re trying to find out, trying to make sense of things. Why are things the way they are? You’re trying to investigate.\n\t\n\t\n\t\tWhat films changed your DNA and made you want to become a filmmaker?\t\n\n\tWong Kar-wai’s “Happy Together.” I watched it before I considered being a filmmaker, but I remember thinking, ‘This is something else.’ This is special, this medium. But in terms of probably Terrence Malick’s work and Werner Herzog’s work, both. Werner’s work — how rough and raw and raw is truth, can I be? And then with Terry, how much can my mother embrace me? There’s a very father-mother energy to these two. So I would say the two of them made me go.\n\t\n\t\tThe road to your first film wasn’t easy. What happened?\t\n\n\tIt was rough. It was the financial crisis. So we went into film school believing the myth that you would make a feature and it would premiere at Sundance, and then Focus Features would give you a three-picture deal. But by the time we got out of film school, it was like, you have an elevated genre — that’s the only thing we’ll consider financing. Everywhere we kept losing money last minute.\n\n\tI was conducting camera tests in New Jersey and discovered that the money wasn’t coming through. Went back to our apartment in Bushwick, and we were robbed, and the hard drives that had some of the footage we shot for the film were gone. I sat there and called up Molly, and the three of us kind of went, you know what? I think there’s a message here. Maybe it’s not about raising money to do this. Perhaps it’s about taking our Chris Columbus Grant and our Kickstarter money, and let’s just go do this with what we have. And that led to how we made “Songs My Brothers Taught Me.”\n\t\n\t\tHow did you approach “Hamnet” following the “Eternals,” which some saw as a difficult period for you?\t\n\n\tFirst and foremost, I’m very proud of “Eternals,” and I had a great time working with Marvel, full stop. I love the team there, who really supported me. I think the first three films changed my life — that 10 years of traveling to different places in America and getting to know America as an Eastern person and as a Chinese person, and understanding different cultures, ways of life, spirituality, and nature, opened up many things within me.\n\n\tWhat happened was that, after pioneering and gathering treasure over the past 10 years, making the first three films, the idea was bubbling inside of me so much. It was like a volcano, and it erupted, and that eruption was “Eternals.” The reason I was drawn to “Eternals” is that it provided a container that allowed me to erupt, as it’s a story about a pantheon of gods discussing the nature of humanity. It allows me to digest everything I have learned from the first three films on the canvas.\n\t\n\n\tIt took me four years since that eruption to contain that lava, cool it down, learn a lot of new tools, build a lot of safety structures around it, and go in there, excavate what that material that came out of me. “Hamnet,” I would say, was my first attempt to chip away at a massive chunk and sculpt it, reshape it, and represent it to the world in a way that allowed me to examine the nature of humanity.\n\t\n\t\tWhat do you want audiences to take away from “Hamnet” beyond the obvious emotional response?\t\n\n\tThere’s love, there’s death—two human experiences that we came here for—and then there’s metamorphosis. I underwent a significant transformation over the last four years. That’s the only way I could go back into the lava and do this work. We are designed to have the chemical capacity to go through metamorphosis at any time, any stage in life that can take different shapes and forms. In this case, a play, creativity.\n\n\tIt’s comforting to a certain extent, because then your life doesn’t have to be that black and white. So when there’s a great tragedy, you don’t have to give it a narrative like something’s wrong. You can look at it like it’s winter, fall coming to winter, and the more one can sustain the discomfort of winter, the more beautiful and glorious the summer is going to be in the spring. I hope the film, at least the last 20 minutes or 15 minutes, offers a glimpse of the power of metamorphosis that comes through for the audience. And if that’s the case, we’ve succeeded.\n\t\n\t\tCan you tell us anything about your “Buffy the Vampire Slayer” pilot?\t\n\n\tIt is not a reboot. It’s a sequel. You can never replace these characters. I would never allow that. And Sarah’s back. I love my cast, the new cast. We will bring back OG characters for sure. And it is a show that bridges two generations — it’s not just about the kids. I think the fandom is so important to us. We want the fandom to see themselves mirrored in the original fandom. And of course, we want new fans to join, and it’s very much about both generations.\n\n\tI watched religiously. I was at Mount Holyoke. We would all gather — I think it was every Thursday or Tuesday — and we would watch, because you only get one episode and you’re waiting a week. It’s such a ritual. I remember the last episode finishing, and we sat there; everyone was crying, and we were all holding hands. I remember looking at the screen, tears streaming down my eyes, and I said, “Good luck to you, Buffy Summers, good luck to you.” Seeing Sarah in real life was probably one of the most stressful moments of my life.\n\t\n\n\tAlso on this episode, “One Battle After Another” star Regina Hall. Additionally, the Awards Circuit Roundtable discusses the main contenders for Netflix, the winners of regional festivals, and the dark horses in the Oscar race.\n\n\tVariety’s “Awards Circuit” podcast, hosted by Clayton Davis, Jazz Tangcay, Emily Longeretta, Jenelle Riley and Michael Schneider, who also produces, is your one-stop source for lively conversations about the best in film and television. Each episode, “Awards Circuit” features interviews with top film and TV talent and creatives, discussions and debates about awards races and industry headlines, and much more. Subscribe via Apple Podcasts, Stitcher, Spotify or anywhere you download podcasts. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chloé Zhao on Channeling Feminine Power in ‘Hamnet,’ Four-Year Break After ‘Eternals’ and ‘Buffy the Vampire Slayer’ Sequel With ‘OG Characters’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/P10257FA-e1763001234406.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-14T23:37:21.000Z",
      "dateModified": "2025-11-14T23:37:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kyle Richards on Her ‘Fear-Based’ Decision to Return to ‘The Real Housewives of Beverly Hills,’ Her Current (Not Great!) Status With Dorit and Not Liking Labels",
    "url": "https://variety.com/2025/tv/news/kyle-richards-rhobh-season-15-return-dorit-friendship-1236582456/",
    "image": "https://variety.com/wp-content/uploads/2025/11/KyleRichards-BravoCon.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-14T23:08:34.000Z",
    "description": "\n\tWith Season 15 of “The Real Housewives of Beverly Hills” premiering on Dec. 4, OG cast member Kyle Richards is plenty busy. She’s also started a new",
    "body": "\n\tWith Season 15 of “The Real Housewives of Beverly Hills” premiering on Dec. 4, OG cast member Kyle Richards is plenty busy. She’s also started a new production company, and is working on two shows, one of which is in preproduction.\n\n\tRichards is also promoting the new season of “Beverly Hills” at BravoCon, and in the insanely loud press room, she sat down with two Variety reporters. During the conversation, Richards discussed the new season, where she stands with Dorit Kemsley after their massive falling out last year — and what exactly she meant in the Season 15 trailer when she said to Bozoma Saint John, “I could go Brad, I could go Angelina.” Richards also talked about her tattoos, of which she now has 12 or 13 (she couldn’t remember exactly).\n\t\n\t\n\t\tSo what went into your decision to come back this season after a really difficult Season 14? \t\n\n\tI struggled so much last year, because Mauricio had just moved out, and so did my daughter Alexia. I have a big family. I have seven dogs; I’m used to teenagers there, a full house. And I came home once on Sunday, and it was so quiet. And I was like, oh my God, this is scary for me. \n\n\n\tComing back to the show was also very scary for me, but I was also afraid of change. When that time does come, it’s going to be another loss, because it’s such a part of your life after 15 years. So I was afraid. I was honestly afraid. \n\t\n\t\tWas that the main factor? That it’s part of your life?\t\n\n\tIt’s part of my life. It’s weird — sometimes I don’t want it to be part of my life! Like last year, when I walked off filming. I am someone who is a multitasker, who likes to juggle a lot of things and have a million balls in the air. And that would be a very big piece of my life that would change. So it was fear-based, honestly. \n\t\n\t\n\t\tLast season was a tough one for you and Dorit. How was this season, and where are you now?\t\n\n\tI would say that we have made great progress — and then went backwards again. So you’re going to have to watch the show to see that. I think it’s hard to get to a better place because of what she’s going through? And sometimes, I’m like, “Wait, I’m also going through that.” But hers is a totally different situation than mine. Mine is very peaceful and amicable.  \n\t\n\t\tSwitching topics! In the trailer, when Boz asks you something, you say, “I could go Brad, I could go Angelina” — which people got very excited about. People took it as you coming out as bi. Thoughts?\t\n\n\tI don’t like labels, I guess. Honestly, this is where it stemmed from — I know people the girls are clearly hinting for that heavily. And I was like, just come out and say it. They were like, “Noooo, we were just — ” They all laughed, I laughed. \n\n\tAnd then when I saw it, I said, “Why did I even say that?” I love Jennifer Aniston! I don’t even mean it like that, she’s beautiful, — but I’m her biggest fan. I was like, “Why did I say that?” I said it to make them laugh. I think people can think whatever they want.  \n\n\tI always had a type, tall, dark and handsome, and that’s what I married. I am growing and evolving, and my mind has opened up. So I don’t know. I don’t know what the future holds now, and I’m fine with that.\n\t\n\t\tYou’re talking to two lesbians, so —\t\n\n\tHa! That would never have crossed my mind before, ever in my life — and now I’m like, that’s totally an option. I’m just here to see what life brings me, honestly. I don’t want to be set up with anybody. Whatever happens, happens, and I’m good with that. I like hanging out with myself alone too.\n\t\n\t\tOne thing that happened last season was people were really pressuring you to label yourself. Once you said the Brad and Angelina thing — even if you are Team Jen — did it feel like that lifted a weight off of you? \t\n\n\tYes! I thought, will they just leave me alone now? Because, honestly, it felt like I was really being harassed over that. And it was something that I didn’t even have a clear answer for myself, let alone for them, and I didn’t think that was fair. So I was like, OK, now can you back off? I will fill you in when I have better answers for you.\n\t\n\t\n\t\tIt was bordering on a little bit of outing.\t\n\n\tYeah! Obviously, when I know or come to conclusions myself, I’m going to be happy to share. \n\t\n\t\tThe Season 14 reunion seemed very hard.\t\n\n\tI honestly felt like this is actually not OK, and I would never do that to anyone else. And I just thought it was crossing a line. There’s an expectation to share absolutely every single aspect of your life. And I’ve shared a lot over these years. People have seen my daughter go from diapers in the crib to applying to college now. My husband and I separating, and my sisters and I torn apart. They’ve seen all the drama! But for some of the fans, it’s not enough. When is it crossing a line? It did feel wrong on a lot of levels.\n\t\n\t\tOne of the sources of your fight with Dorit was something that actually had happened at BravoCon — the thing about which Richards sister do she feel closest to. Are you protecting your peace this time? \t\n\n\tOh, well, we’re not speaking, so that’s easy!\n\t\n\t\tThat’s why you guys got moved on the carpet.\t\n\n\tI guess so! We said hi in passing, but things sort of fell apart this season on the show. I hope to get back to a place with her that we once were. And I think once things are better between her and PK, it will be easier to do that.\n\t\n\t\tWho are you closest to this season?\t\n\n\tErika. I’m closest to Erika and Sutton. \n\n\t\n\t\tSutton? Interesting! \t\n\n\tYou never know how the audience will perceive things, which I always think is funny, because Sutton and I are actually close. And I guess they don’t see that. I’m a very early morning person, so she’ll call at like, 7, and I’ve been up for like two hours. We’ll talk for an hour, and we really do share everything. But you don’t see that on the show. \n\n\tThat’s why I was like, why would you do that to me at my dinner table and imply that my husband’s cheating on me when you’re my friend? Like, is that for the show? Why are you doing that to me?\n\n\t\n\t\tYes. It is for the show.\t\n\n\tExactly! That’s what’s so maddening, because in 15 seasons, I’ve never done that. I think I’m an interesting enough person that I don’t need to start fights with people for a TV show. So when I feel that, I feel hurt by that.\n\n\tShe’s very fun. She loves having a good time. I love that about her. She really does make me laugh. The other night, we were, like, OK, we’re single, we need to go out. I felt like a 10th grader who was trying to go out and make it be fun. There was no fun. We went to the first place, like, “This is where people go! There’s nobody here, we hate this. Let’s go to the next place.” The next place, it was so loud — I cannot have loudness like this, and I did not like the crowd. Then we went to another place, and she said, “Nobody cute here.” Then she made me go to a pub. Like, far from our house. I’m at an Irish pub at midnight?! \n\n\tWe did this all wrong. We need to stick with what we know. I cannot be going to pubs.\n\t\n\t\tIt seemed like the trailer was framing Amanda Frances — who bought your old house — as the show’s new villain. \t\n\n\tI think she could maybe be polarizing. At times, I think — definitely. \n\t\n\t\tWhen Garcelle Beauvais was on “Watch What Happens Live” recently, she said that of all the women in the cast, the person she would want to connect with and see would be you. Was that a surprise?\t\n\n\tIt was a surprise. I wish she would have shown me that more in person. Garcelle and I had this thing — we would look at each other, and we had this unspoken language, and we would laugh at the same thing. I love to make her laugh — like, I love a good audience. I know how to make her laugh.  When we left Georgia, we were saying, “Love you, bye” — and I don’t throw the love word around. \n\t\n\n\tWhen she walked off, I was surprised. And then when she said that, I thought, why don’t you act like that? Why don’t you say that to me?\n\t\n\t\tHave you spoken since “Watch What Happens Live”? \t\n\n\tNo. She had unfollowed me on Instagram. I think it’s hard to have friendships on the show, which makes me so grateful for Erika and Teddi, and even Dorit — even though we’re going through this hard time. It really makes you appreciate those friendships.\n\t\n\t\tIs it a good season? What should people be thinking about Season 15?\t\n\n\tIt is a good season. It’s gonna be a fun ride for the audience for sure. Lots of drama, of course, and I think there’s a lot of laughs too.\n\n\tThis interview has been edited and condensed.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kyle Richards on Her ‘Fear-Based’ Decision to Return to ‘The Real Housewives of Beverly Hills,’ Her Current (Not Great!) Status With Dorit and Not Liking Labels",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/KyleRichards-BravoCon.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-14T23:08:34.000Z",
      "dateModified": "2025-11-14T23:08:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Walmart Drops Price of Walmart+ Membership to $49 Ahead of Competitive Black Friday",
    "url": "https://variety.com/2025/shopping/news/best-walmart-plus-deals-streaming-offers-1236040212/",
    "image": "https://variety.com/wp-content/uploads/2024/06/GettyImages-2152961478.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-15T00:38:00.000Z",
    "description": "\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.\n\n\tWalmart i",
    "body": "\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.\n\n\tWalmart is offering up some new deals, discounts and special offers, as the retailer attempts to get a jump on online shoppers ahead of Black Friday.\n\n\tThe latest Walmart deal discounts the price of an annual Walmart+ membership to just $49 — a 50% savings. The limited-time offer runs until December 2, coinciding with the end of Black Friday weekend.\n\n\tIncluded in your Walmart+ membership are perks like unlimited free delivery; free returns from home; early access to sales like Black Friday; exclusive members-only discounts; free tire repair and free road hazard warranty at Walmart Auto Care Centers; and fuel discounts of up to 10¢ per gallon at 13,000+ Exxon, Mobil, Walmart and Murphy USA gas stations. Walmart also recently teamed up with Burger King, to offer Walmart+ members 25% off orders at the fast food chain.\n\n\n\tWhile Walmart doesn’t have its own streaming service — a la Amazon Prime Video — Walmart+ members also get a free subscription to Paramount+, which lets you stream live sports and programming on CBS, in addition to thousands of popular shows and movies like Survivor, Your Honor, Star Trek: Picard and more. Live sports include the NFL on CBS, UEFA Champions League and PGA, among others.\n\n\tTo get your free Paramount+ subscription through Walmart, log into your Walmart+ account and then click “Get Paramount+” in the benefits section.\n\n\tAnd Walmart+ subscribers can also take advantage of new grocery deals (with free home delivery) and travel discounts, including 5% back in Walmart Cash when booking trips with Expedia.\n\n\tRegularly $98, sign up for a Walmart+ membership for just $49 now to take advantage of all the perks. Don’t want to commit just yet? You can also test out the service with a 30-day free trial to Walmart+ here.\n\n\t\n\t\tWhat Are the Best Walmart+ Deals?\t\n\n\tWhether you’re a Walmart+ member or not, the retailer is still offering some of its biggest discounts of the year during its current Black Friday sales event.\n\n\tThe best Walmart+ deals including rollback prices on electronics, gaming, kitchen accessories and fashion. Walmart has also just launched its holiday deals on toys, Christmas decor, home goods and thousands of gifting items.\n\n\tAs of this writing, some of the best Walmart deals include up to 70% off luggage, up to 50% off kitchenware and accessories, up to 50% off vacuums and home appliances, and up to 50% off men’s and women’s fashion.\n\n\tVIP+ Analysis: How Walmart Is Becoming a Streaming Power Player — and True Amazon Rival  \n\n\tName brand electronics like AirPods, MacBooks, Beats headphones and TCL TVs are also down to their lowest prices of the year. While some deals are available to all Walmart shoppers, the biggest discounts are reserved for Walmart+ members, so you’ll want to either sign-up for a membership or the 30-day free trial before you start your shopping.\n\n\tAs with all Walmart deals, the prices could change at any time, so we recommend checking the site and adding your favorite products to your cart while the sale prices are still live. See all the best Walmart deals here.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Walmart Drops Price of Walmart+ Membership to $49 Ahead of Competitive Black Friday",
      "image": [
        "https://variety.com/wp-content/uploads/2024/06/GettyImages-2152961478.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-15T00:38:00.000Z",
      "dateModified": "2025-11-15T00:38:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Stephen Wilson Jr., Best New Artist Nominee for CMA Awards, on Why His Maverick ‘Death Cab for Country’ Approach Found a Home at Big Loud Records",
    "url": "https://variety.com/2025/music/news/stephen-wilson-jr-big-loud-records-country-interview-1236582486/",
    "image": "https://variety.com/wp-content/uploads/2025/11/SWJ_credit-acacia-evans-1-e1763160982557.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-15T00:04:51.000Z",
    "description": "\n\tAmong this year’s CMA Awards nominees, there are a few slightly outside-the-box contenders that may leave the casual listener and maybe even a genre",
    "body": "\n\tAmong this year’s CMA Awards nominees, there are a few slightly outside-the-box contenders that may leave the casual listener and maybe even a genre aficionado wondering: “Wait, are they an outlier, or are they really an in-lier?” That isn’t truer of anybody than Stephen Wilson Jr., a best new artist candidate whose two-year-old Big Loud Records debut still has him on the ascent. On the one hand, he just followed that debut up with an EP of grunge-rock covers, which would indicate a left-of-center lean… and on the other, he insists he’s a hardcore Opry lover who desires nothing greater than to become a staple of country radio.\n\t\n\n\tWilson came up for considerable discussion when Variety engaged Big Loud toppers Seth England, Joey Moi and Craig Wiseman for an extended interview going deep into their history on the occasion of the label’s 10-year anniversary. While plenty of that conversation was devoted to the imprint’s rise — and, inevitably, to Morgan Wallen — it drifted almost that inevitably to Wilson and what he might represent as part of Big Loud’s (and the genre’s) future. In this sidebar, we take a more detailed look at what Wilson and the label might mean to one another.\n\n\n\tThe fact that Big Loud is not just open to rock ‘n’ roll sounds but has an actual sub-label called Big Loud Rock was appealing to Wilson, when he was considering different labels as a place to land “Son of Dad,” a 22-song debut that he recorded on his own. But it was by no means the main reason he was attracted to them.\n\n\tSays Wilson: “It’s obvious there is a rock contingent within our sound — it’s undeniable — and them having a rock label and having artists like Hardy that had successfully pivoted between country and rock ‘n’ roll made it even more like an obvious fit. You know, I’m not some obvious genre artistm and they tend to adopt those kind of, genre rejects of Nashville and really kind of nurture them, and know how to kind of cross all the genres. \n\t\n\n\t“But a big reason why I went with Big Loud was because they are a country label. There’s a lot of rock and Americana labels out there that are just not country labels at all. And I really wanted to start with country first — knowing that the path of most resistance for me (commercially) might be country. I wanted to start there, because I knew this is going to be the hardest mountain for me to climb, and perhaps the other ones will be a little bit more achievable. Just from a challenge standpoint, this genre was my goal. \n\n\t“And I truly believe I am a country artist,” he continues. “I write country songs, whether I sound country enough, which is entirely subjective. What I don’t think is subjective is that I write country songs. I argue that I am a country person and always have been, always will be. I very much grew up in that life — yet my paintbrush has always been a little bit more Seattle than Nashville. In how I paint the songs, it has a little bit more of that edge, mixed with kind of Appalachia bluegrass from where I come from. The sound of the Pacific Northwest somehow really fused into what I like, because I played in an indie rock band, where I was a lead guitar player. A lot of the songs that I would write were always kind of too country. I’d have to write real abstractly for that kind of music, which I always loved, too — it was a fun exercise. But I really always truly wanted to write story songs, but paint them in a kind of indie-rock kind of style of music. \n\n\t“And so that’s why I kind of call it Death Cab for Country, jokingly,” Wilson says, “because that’s the best way I can kind of put what I do. But if I’m Death Cab for Country, I’m definitely a country artist and therefore I need to work within a country label that actually knows how to work country artists, because I see myself on country radio. I know a lot of people probably don’t, but I do, and Big Loud does too as well. I love that they’ve always been willing to shake things up and move the goalposts around the field and stretch the membrane of what is possible in this genre. So I like being just another perhaps experiment of theirs, to see if we can do this. And I think they’re fully equipped, and I think we are fully equipped on our side, and I don’t think we could have a better army of, people trying to accomplish what we’re actually trying to accomplish.”\n\t\n\n\n\n\t\n\n\t\t\t\t\tStephen Wilson Jr.\n\t\t\t\t\t\t\t\t\tAcacia Evans\n\t\n\n\n\n\tWhat Wilson may cite as a Seattle influence on classic country, others may hear as something that echoes the sound or style of, say, early Steve Earle at his loudest. Wherever it came from, it’s working, and Wilson just sold out, for instance, the Wiltern in Los Angeles, playing to what he said was his biggest audience as a headliner to date, though he won’t take long to top that when he goes back out in 2026.\n\n\tBig Loud has high hopes for the further exposure Wilson will get during CMAs week, starting with the ABC telecast itself, where the singer is getting two performance slots — one to sing his cover of Ben E. Lee’s classic “Stand by Me,” the other to join Shaboozey for “Took a Walk,” their theme song from the recent Stephen King-based film “The Long Walk.” Neither one of those is his actual new single, “Gary,” from a sophomore album that will come out next year, but many viewers will catch a broadcast premiere of that tune on late night TV the night before.\n\n\tSays England, “We have big hopes and (are engaging) marketing, promotion and digital and havuing many conversations internally about trying to turn that awards week into Stephen Wilson week. We’ve got two performances on the show, and the night before, he debuts his new single on Kimmel. So we’ve pre-requested that our young digital team is gonna work between 1 and 3 a.m. and hopefully you’re waking up and can’t escape Stephen Wilson that week.”\n\n\tNotes Moi: “Stephen is having an incredibly special moment. I remember when Craig played me the very first Stephen Wilson Jr. demo I ever heard years ago, back when I first started coming to Nashville, and we were all obsessed with his voice back then, when he was just a songwriter figuring stuff out. So, when our new A&R guy, Nate Yetton, came on and he had revealed that Stephen had gone and made a 22-song record, we were just like, ‘Wait, what? He’s an artist now? This is incredible.’ So to see the record take off and do what it’s doing is pretty magical. He is one of the sweetest guys we’ve ever met; he’s insanely humble. Anytime you start talking to him about his career, he kind of wilts into a little shell and he gets so uncomfortable when you talk about how awesome he’s doing, and that makes it even more fun. So we all keep doubling down and complimenting him. But you’re seeing an insanely organic fan base kind of come in and stay. You know, I think he’s got like Dave Matthews potential — he can go on and just release music and be huge forever.”\n\t\n\n\n\n\t\n\n\t\t\t\t\tStephen Wilson Jr., signing photo with Big Loud Records\n\t\t\t\t\t\t\t\t\tBig Loud\n\t\n\n\n\n\tWiseman points out how long many of them have known Wilson, even though he didn’t evidence any aspirations at the time to do anything beyond being a songwriter. “I’ve been writing with Stephen probably since about 2015, 2016. Such a genuine talent, such a great writer and such a great voice. What’s really cool about him, he’s not the sexy Morgan Wallen type guy or whatever who just easily kind of fits that thing, he’s his own guy. And for everybody to start getting that, that makes it so special.”\n\n\tAlthough Wiseman describes Wilson as being a bit of a shrinking violet when too many compliments come his way, he is hardly the shy type when it comes to standing up for his vision of what his own music should be, as opposed to the hundreds of songs he co-wrote for hire. But the “Son of Dad” project was beyond personal to him, so there would be no compromising that when he went label-shopping. The album title gets at — but really just barely begins to get at — how personal the project was for him.\n\n\t“My dad died and he left me this $3,333.33 life insurance check. It’s the only thing I got from him, and a necklace. And I spent every penny recording the first three songs, and then one of those songs blew up online, called ‘Year to Be Young ’94.’ And then I used the money from that, which was seeded from the original life insurance check, to record 19 more songs, and that’s what “Son of Dad” was. It was not about some hit record or getting bops or getting streams or getting playlists. I really just didn’t care about any of that, and I was very vocal about it, even though I wanted it to succeed, because the songs really helped me, as they were.\n\n\t“When my. dad died, it was colossal. It was devastating, to the point where I didn’t even know if I wanted to live anymore. It was completely destructive. And as a scientist — I used to be a scientist in my former life (for a food manufacturer) — I just kind of went into research mode and kind of went to work it. Either that or I’d just wither up and die. So I was going around town showing these people this 22-song record that was seeded by my dad’s death. And I don’t think anybody really got that but Big Loud.\n\n\t“Seth England has been a friend of mine because I had quit my job as a scientist to be a staff writer, and he was hearing a lot of my demos and hearing my voice a lot. He’s familiar with what I do. But when my dad died, everything changed. I think he could see that switch, that there was like a true transformation within me, and I think he recognized it instantly. For Nate Yetton, I was the first artist he signed there, and I was the first artist he brought to them. That meant a lot too, because he saw something very special. He was like, ‘No, this is my flagship artist,’ and I didn’t really have a lot of A&R people doing that with me. I was just maybe this cool artist that they wanted to maybe chat about on the side that definitely wasn’t the ‘Hey, I want to go to war with this guy’ kind of artist. I was just kind of maybe a novelty piece to them, and to Big Loud, I wasn’t a novelty piece. They saw like how important this was to me — it was bigger than me and bigger than Spotify metrics. It was rooted in something very, very, very real. So that’s what sold me on Big Loud. \n\t\n\n\t“There really wasn’t a lot to debate. It was like, no, they truly get it and they want to support that, and that’s what exactly what they did. The story itself and the songs were enough, and what it needed was a good support system to nurture it — not alter it, not make it more consumable. It was already what it was. And everybody else’s mind (at other labels), there was so much to change… short story long.”\n\n\tHe might as well have been signed to the label, he’d already spent so much time there. “I was pitching a lot of songs to their artists, and I think I was in that Big Loud building at least one day a week 52 weeks a year.  It was almost like a second home for me. I knew everybody in that building. So when I walked in there as an artist to be potentially signed, it was almost like you’re coming to a place that is extremely familiar, almost home. And Seth and Joey and Craig have all been big fans of my artistry long before I even knew my artistry existed. It just kind of took time for the whole thing to make sense for them to get behind it. That’s because I had to do my part — I had to take my chance.\n\n\t“I think once they saw that it was more than just a pipe dream or more than just like this guy doing a novelty songwriter record — because that happens all the time where songwriters do a little record, and it does things, but it’s really kind of a vanity piece…  I think they quickly identified, ‘He’s not trying to do that. He’s actually going for it.’ And that’s when I think things started getting very serious.\n\n\t“I’d written probably 30, 40 songs with Craig Wiseman as a staff writer… and this was (starting in) 2016. I did not want to be an artist. It wasn’t even on the table. It’s not that I was anti- being an artist, it just wasn’t even a conversation that was … yeah, it was a non-conversation. … You know, writing with Craig is  its own experience. It’s not like any other writing room. And he truly is a one of a kind and  I’ve learned so much from writing with him. We actually wrote a song on ‘Son of Dad’ called ‘Holler from the Holler’ together, so he got a cut on the record too, I guess you would say. \n\n\t“I kind of went to songwriting school with Craig, because he has his own process. He runs words through a mill in his mind. And I’ve worked with so many other Hall of Fame songwriters and saw how their processes work. So he was just one chapter of the songwriting class that I got for the first five or six years. Craig and I were just trying to get cuts on Blake Shelton or Kenny Chesney. We weren’t trying to get cuts on my record because my artistry didn’t exist. But from day one, literally when I walked in the room, he’d go, ‘All right, man, you’re the artist in the room.’ And I would always be like, ‘What do you mean by that?’ And he’s like, ‘You’re the artist’ — that means we’re gonna write a song and he’s not gonna sing it, I’m gonna sing it. And he sang plenty of demos and he’s great at doing it. But he designates the artist in the room. So I remember when he said that to me; it’s almost like he just planted a seed from day one, and I didn’t even know he did it. It’s like he did it behind my back. And then, you know, 30 songs later of me being the artist in the room, suddenly you start sounding like an artist outside of the room. That’s what Craig did for me.”\n\t\n\n\tOf his nomination for best new artist at the CMAs, Wilson says, “That’s mind blowing in itself, and it’s a testament to the reason why I went the way I went” — signing with Big Loud, that is — “because these are the kinds of lanes that I was trying to get into.” He elaborates. “My grandparents, back to my great-grandparents, my whole family are big Grand Ole Opry people. That stuff is like crazy important to me, the legacy that is country music. And for me to have any kind of impact on that story, from my hometown or my upbringing, and having that generation spoken for in country music, would be a real honor.” \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Stephen Wilson Jr., Best New Artist Nominee for CMA Awards, on Why His Maverick ‘Death Cab for Country’ Approach Found a Home at Big Loud Records",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/SWJ_credit-acacia-evans-1-e1763160982557.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-15T00:04:51.000Z",
      "dateModified": "2025-11-15T00:04:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jimmy Kimmel's Band Leader Cleto Escobedo III Cause of Death Released",
    "url": "https://www.tmz.com/2025/11/14/cleto-escobedo-cause-of-death-jimmy-kimmel/",
    "image": "https://imagez.tmz.com/image/1b/16by9/2025/11/14/1b42243e941a48f1a24a6795d22d02f9_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-15T00:06:37.000Z",
    "description": "\n    \n                    \n                          'Jimmy Kimmel Live!'\n                          Band Leader Cleto Escobedo III Cause of Death Reve",
    "body": "\n    \n                    \n                          'Jimmy Kimmel Live!'\n                          Band Leader Cleto Escobedo III Cause of Death Revealed\n                      \n                  \n                        Published November 14, 2025 4:06 PM PST\n                                                                      |\n                Updated November 14, 2025 5:56 PM PST\n                                    \n      \n    \n          Jimmy Kimmel’s longtime bandleader, Cleto Escobedo III, died because his heart couldn't pump enough blood to keep him alive, TMZ has learned.\n      \n    \n          We obtained Cleto's death certificate and it lists cardiogenic shock as the immediate cause of death ... with vasodilatory shock, disseminated intravascular coagulation and alcoholic cirrhosis of the liver as the underlying causes.\n      \n    \n          The document also says other conditions that contributed to Cleto's death include sepsis, graft versus host disease, immunosuppressed, chronic kidney disease and pneumonia.\n      \n    \n        Waiting for your permission to load the Instagram Media.\n      \n    \n          Cardiogenic shock is a life-threatening condition that happens when the heart suddenly can't pump enough blood to meet the body's needs ... according to the Mayo Clinic.\n      \n\n          The doc says Cleto was cremated and the certificate makes note that he was an entertainer who played music for 40 years.\n      \n    \n          Escobedo had been noticeably absent from \"Jimmy Kimmel Live!\" for months after falling ill -- before Jimmy confirmed his passing in an emotional Instagram tribute.\n      \n    \n          Cleto and Jimmy go way back -- they grew up together in Las Vegas, and when Kimmel landed his late-night gig in 2003, he fought hard to make Cleto the leader of Cleto and the Cletones, saying he didn't have better chemistry with anyone else.\n      \n    \n          Cleto was 59.\n      \n    \n          RIP\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Jimmy Kimmel\n              \n                          \n                RIP\n              \n                          \n                TV\n              \n                          \n                Celebrity Death\n              \n                          \n                Fairly Legal\n              \n                          \n                Health\n              \n                          \n                Late Night\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jimmy Kimmel's Band Leader Cleto Escobedo III Cause of Death Released",
      "image": [
        "https://imagez.tmz.com/image/1b/16by9/2025/11/14/1b42243e941a48f1a24a6795d22d02f9_xl.jpg"
      ],
      "datePublished": "2025-11-15T00:06:37.000Z",
      "dateModified": "2025-11-15T00:06:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Blair Underwood Says He's Raising Bison Herd Like Cattle",
    "url": "https://www.tmz.com/2025/11/14/blair-underwood-raising-bison-herd/",
    "image": "https://imagez.tmz.com/image/93/16by9/2025/11/14/93aadd506b0d4e4cbba3d1ae3da6982a_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-15T01:58:20.000Z",
    "description": "\n    \n                    \n                          Blair Underwood\n                          I Just Invested In Bison Heard ...\n                    ",
    "body": "\n    \n                    \n                          Blair Underwood\n                          I Just Invested In Bison Heard ...\n                          Bison Burgers, Anyone?!?\n                      \n                  \n                        Published November 14, 2025 5:58 PM PST\n                                                                            \n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          Blair Underwood says he's taking his love for bison to a new level ... because he just bought a bison, and he's raising a herd just like cattle.\n      \n    \n          We got the veteran actor at LAX, and our photog asked him about his latest venture.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Blair says he and a couple others have banded together to raise six bison, which he playfully calls his new \"six-pack.\"\n      \n\n          Bison are massive animals, and Blair rattles off all of their desirable characteristics ... some of which ladies, like his wife, find desirable in men.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Blair says the end game here is producing meat for bison burgers ... and he tells us some of the advantages of bison meat.\n      \n    \n          Check out the clip ... it's a lot to chew on.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Celebrity News\n              \n                          \n                Fairly Legal\n              \n                          \n                In The Field\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Blair Underwood Says He's Raising Bison Herd Like Cattle",
      "image": [
        "https://imagez.tmz.com/image/93/16by9/2025/11/14/93aadd506b0d4e4cbba3d1ae3da6982a_xl.jpg"
      ],
      "datePublished": "2025-11-15T01:58:20.000Z",
      "dateModified": "2025-11-15T01:58:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ex-NBA Player Patrick Beverley Arrested for Assault",
    "url": "https://www.tmz.com/2025/11/14/patrick-beverley-arrested-nba/",
    "image": "https://imagez.tmz.com/image/ec/16by9/2025/11/15/eca3a15262034dbabcecfc0830279fdf_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-14T22:06:47.000Z",
    "description": "\n                    \n                          Patrick Beverley\n                          Arrested For Assault\n                          ... Third-De",
    "body": "\n                    \n                          Patrick Beverley\n                          Arrested For Assault\n                          ... Third-Degree Felony\n                      \n                  \n                        Published November 14, 2025 2:06 PM PST\n                                                                      |\n                Updated November 14, 2025 5:59 PM PST\n                                    \n              \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          updates\n  \n    \n          5:15 PM PT -- Patrick Beverley has spoken out since news broke of his arrest, saying via social media ... \"Please don’t believe everything you see on the internet. Hope all is well LUV.\"\n      \n    \n          Letitia Quinones-Hollins, attorney for Patrick, tells TMZ in a statement ... \"Patrick Beverley has no criminal record. He cares deeply about his little sister – a young lady, a minor. Given that, when he unexpectedly found her alone in the home with an 18-year-old man in the middle of the night, he was understandably concerned, as any brother would be about his sister. However, we don’t believe what followed happened the way it’s been described and we look forward to the opportunity to address that in court.\"\n      \n    \n          Ex-NBA player Patrick Beverly has been arrested in Texas for felony assault, TMZ Sports has learned.\n      \n    \n          The 6'2\" point guard was taken into custody on Friday at the Fort Bend County Sheriff's Office in Richmond, Texas.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          According to jail records, the charge against Beverley is Assault on a Family Member/Household Member Impeding Breath or Circulation. It's listed as a third-degree felony.\n      \n\n          His bail was set at $40,000, which he posted. He's expected to be released later in the day.\n      \n    \n          Beverly -- and second-round draft pick -- is a well-known hooper who played for the Rockets, Clippers, Timberwolves, Lakers, Bulls, 76ers, and, most recently, the Bucks.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          He also played pro ball overseas, racking up accolades along the way -- including the UBL Slam Dunk Contest title, the 2011 Russian Cup championship, and the 2012 EuroCup MVP.\n      \n    \n          Most recently, he suited up for the Hapoel Tel Aviv Basketball Club.\n      \n    \n          Beverley has since taken his talents to the microphone ... and even found himself in hot water for a conversation he had with Jason Williams about Megan Thee Stallion and Klay Thompson.\n      \n      ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ex-NBA Player Patrick Beverley Arrested for Assault",
      "image": [
        "https://imagez.tmz.com/image/ec/16by9/2025/11/15/eca3a15262034dbabcecfc0830279fdf_xl.jpg"
      ],
      "datePublished": "2025-11-14T22:06:47.000Z",
      "dateModified": "2025-11-14T22:06:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "TMZ Sports Streaming Live From Newsroom, Join The Conversation!",
    "url": "https://www.tmz.com/2025/11/14/tmz-sports-live-stream/",
    "image": "https://imagez.tmz.com/image/72/16by9/2025/11/14/7258075f21ae4fb7bcd6d19b17ec326c_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-14T20:57:28.000Z",
    "description": "\n    \n                    \n                          TMZ Sports Live Stream\n                          Join The Conversation!!!\n                      \n",
    "body": "\n    \n                    \n                          TMZ Sports Live Stream\n                          Join The Conversation!!!\n                      \n                  \n                        Published November 14, 2025 12:57 PM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          TMZ Sports is going live from the newsroom to discuss the day's biggest stories ... but we don't just want folks to watch and enjoy the conversation, we want y'all to get involved!!\n      \n    \n          Hit the comment section as Babcock, Lucas, Mojo, Luca and the whole crew break down the most important topics of the day ... and we'll be interacting with viewers throughout the program between 1 and 2 PM PT.\n      \n    \n          So tune in, make fun of us, share your two cents, sound off about your favorite team ... nothing is out of bounds.\n      \n    \n          Friday's show will include Cardi B and Stefon Diggs' big news, an interview with Kevin Love, Shohei Ohtani's MVP celebration and much more!!\n      \n      \n              \n          \n                          \n                TMZ Sports\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "TMZ Sports Streaming Live From Newsroom, Join The Conversation!",
      "image": [
        "https://imagez.tmz.com/image/72/16by9/2025/11/14/7258075f21ae4fb7bcd6d19b17ec326c_xl.jpg"
      ],
      "datePublished": "2025-11-14T20:57:28.000Z",
      "dateModified": "2025-11-14T20:57:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Guess The Hollywood Hottie In This Floral Bikini Top!",
    "url": "https://www.tmz.com/2025/11/14/guess-hollywood-hottie-floral-bikini-top/",
    "image": "https://imagez.tmz.com/image/34/16by9/2025/11/14/34873752c94841f4be1a53919fd0b1dd_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-14T22:04:36.000Z",
    "description": "\n    \n                    \n                          Guess Who\n                          Which Sexy Actress Is Rockin’ This Bikini Look?\n             ",
    "body": "\n    \n                    \n                          Guess Who\n                          Which Sexy Actress Is Rockin’ This Bikini Look?\n                      \n                  \n                        Published November 14, 2025 2:04 PM PST\n                                                                            \n      \n    \n      \n        \n              \n    \n    \n          Can you guess who the sexy actress in the bikini top is?!\n      \n    \n          Best known for her role as CeCe Jones in \"Shake It Up\" ... these days, she’s more likely to be found rocking designer 'fits at fashion week or dropping thirst-trap selfies that break the internet.\n      \n    \n          Hit the gallery for the reveal!\n      \n      \n      \n          \n            \n              \n                \n                Share on Facebook\n              \n            \n            \n              \n                \n                Share on X\n              \n            \n                          \n                \n                  \n                \n              \n                      \n        \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Guess Who\n              \n                          \n                Fairly Legal\n              \n                      \n        \n          \n  ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Guess The Hollywood Hottie In This Floral Bikini Top!",
      "image": [
        "https://imagez.tmz.com/image/34/16by9/2025/11/14/34873752c94841f4be1a53919fd0b1dd_xl.jpg"
      ],
      "datePublished": "2025-11-14T22:04:36.000Z",
      "dateModified": "2025-11-14T22:04:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]