[
  {
    "title": "‘In Your Dreams’ Review: A Netflix Animated  Fantasy That Makes Dreamscapes Feel Like Reruns",
    "url": "https://variety.com/2025/film/reviews/in-your-dreams-review-2-1236573171/",
    "image": "https://variety.com/wp-content/uploads/2025/10/MCDINYO_ZX016.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-09T19:05:33.000Z",
    "description": "\n\t“In Your Dreams” was made for Netflix by a team of artists who cut their teeth at Pixar (the director, Alex Woo, was a story artist on films like “R",
    "body": "\n\t“In Your Dreams” was made for Netflix by a team of artists who cut their teeth at Pixar (the director, Alex Woo, was a story artist on films like “Ratatouille,” “WALL-E,” and “Incredibles 2”), and it’s one of those animated movies that keeps reminding you of other animated movies (not all of them Pixar), which even if you like the films in question is not really a good thing. “In Your Dreams” is built around great swirling mounds of imagistic energy, yet it feels secondhand at its core.\n\t\n\n\tStevie (voiced by Jolie Hoang-Rappaport), a precocious 12-year-old, discovers that her parents may be breaking up. They were once a local indie music duo called Hypsonics, but Mom (Crisin Milioti) now wants to move to Duluth to become an assistant professor, while Dad (Simu Liu), a roly-poly slacker, is content to stay planted, whiling away the days diddling with the album he’ll never finish. (Given that they can’t pay the bills, there aren’t really two sides to this rift.) So how will Stevie, who shares a bedroom with her obnoxious little brother, Elliot (Elias Janssen), keep the family together?\n\n\n\tBy escaping into a world of dreams, which sounds fancifully original but translates, at heart, into a knockoff of “Inside Out,” with tween angst trying to work itself out in a lavish alternate cosmos. The way that Elliot’s stuffed giraffe, Baloney Tony, comes to life through the rapid-fire smart-mouth voicing of Craig Robinson feels like an overly pointed gloss on Eddie Murphy’s Donkey in the “Shrek” films. And the fact that Stevie and Elliot zoom around on a possessed bed frame seems to have come right out of the fondly remembered 1971 Disney clunker “Bedknobs and Broomsticks.” Then there’s the Sandman, a kind of Wizard of Oz of the cosmic dunes voiced by the British-born Omid Djalili, who sounds like Jude Law impersonating Santa Claus.\n\t\n\n\tStevie and Elliot discover that they can be inside the same dream at the same time. As the two plunge in and out of dreams, the movie serves up a series of florid set pieces, most of which serve no narrative purpose beyond their eyeball-tickling show-reel dimension. The kids are first dropped into a cardboard-castle land inhabited by walking, talking items of food (donuts, strawberries, avocados, French toast, hard-boiled eggs), which a few minutes later turn moldy and rotten and threatening. And that’s the way it goes with most of these dreams; they become nightmares, which peter out the moment Stevie and Elliot wake up. “Why did I wake up when you woke up?” asks Stevie. Why? Because that’s the arbitrary rules of the movie they’re in. At one point there’s a bad-dream montage, set to (inevitable needle drop #1) “Sweet Dreams (Are Made of This),” and it’s at that point the audience realizes that none of this is actually affecting the characters’ waking lives, so how much investment can we have in it?\n\n\tYou just know that the Sandman, at one point heralded by (inevitable needle drop #2) Metallica’s “Enter Sandman,” is going to turn out to be less nice than he seems. But it’s what he represents that’s the problem. “I want everyone to be happy,” he says, sounding like the spirit of psychotropic big pharma. And when he finally places Stevie and Elliot in a dream that will heal their parents’ split and make everyone’s lives perfect again, that’s the problem: It’s only a dream. Do they want to live inside a feel-good illusion? That should have probably been the film’s premise rather than just another anything-goes gambit. “In Your Dreams,” minus the closing credits, is only 77 minutes long, and it packs in a great deal of frenetic dreamscape pageantry, but I wish there were more of an imaginative heft to it. It’s like the surface of a Pixar movie without the engine of ingenuity.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘In Your Dreams’ Review: A Netflix Animated  Fantasy That Makes Dreamscapes Feel Like Reruns",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/MCDINYO_ZX016.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-09T19:05:33.000Z",
      "dateModified": "2025-11-09T19:05:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chappell Roan Lauds Cyndi Lauper at Rock Hall Induction for ‘Showing Us You Can Be Bold, Quirky, Loud, Glamorous and Have Any Hair Color You Want’",
    "url": "https://variety.com/2025/music/news/chappell-roan-cyndi-lauper-speech-rock-hall-fame-induction-1236573512/",
    "image": "https://variety.com/wp-content/uploads/2025/11/MixCollage-09-Nov-2025-10-37-AM-1587.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-09T19:28:46.000Z",
    "description": "\n\tBefore there was the self-proclaimed Midwest Princess, there was the queen of Queens in New York. They came together in a glittery cosmic convergenc",
    "body": "\n\tBefore there was the self-proclaimed Midwest Princess, there was the queen of Queens in New York. They came together in a glittery cosmic convergence Saturday night at the Rock & Roll Hall of Fame ceremony as Chappell Roan formally inducted Cyndi Lauper, giving an earnest speech that touched on her own adoration for the honoree as a teenager and ongoing respect for her as one of pop’s most longstanding allies to the LGBTQ community.\n\n\n\n\t\n\n\t\t\t\t\tInductee Cyndi Lauper and Chappell Roan speak onstage during the 2025 Rock & Roll Hall of Fame Induction Ceremony at Peacock Theater on November 8, 2025 in Los Angeles, California. \n\t\t\t\t\t\t\t\t\tWireImage\n\t\n\n\n\n\t“Cyndi embodies every quality of an artist that I admire,” Roan said from the stage of L.A.’s Peacock Theatre. “She’s a born performer and a revolutionary songwriter, a forever fashion icon, and a fierce advocate and ally. And from the very beginning, she owned every ounce of who she was — the manic, panicked hair, all of those rad Fingerless gloves and those unbelievably layered, dynamic and one-of-a-kind vocals… Can I hear a little commotion for the vocals?”\n\t\n\n\tRoan looked back to Lauper’s impact at the very start of her nascent career: “One of Cyndi’s most inspiring songs to me personally is ‘True Colors.’ When I was 14 years old, I performed ‘True Colors’ at a talent show in my hometown in Missouri. That was my first time ever winning a competition for singing, and that has been so important to me ever since. ‘True Colors’ has gone on to be an anthem synonymous with love and acceptance in the LGBTQ+ community and beyond — a message that still stands the test of time.”\n\t\n\n\n\tLauper was as truly colorful as ever in that particular regard when she sang “True Colors” as part of a multi-artist performance segment in her honor, pausing the song as a vertical rainbow/pride flag unfurled from the top of the stage behind her, in a striking and pointed camera angle.\n\n\tIn her acceptance speech, Lauper thanked “my badass female band I always dreamed of having” — which, for this occasion, included guest drummer Gina Schock of the Go-Go’s — and then positioned herself as part of a middle generation in the history of women in rock.\n\n\t“So now to make a long story short…” she quipped. “Oops, too late for that. But I just want to say that I know that I stand on the shoulders of the women in the industry that came before me, and my shoulders are broad enough to have the women that come after me stand on mine. And the other thing that I thought was really important, which is why I really came here tonight, is to tell you that the little kid in me still believes that rock ‘n’ roll can save the world.”\n\n\n\n\t\n\n\t\t\t\t\tChappell Roan and Cyndi Lauper arrive at the GBK Brand Bar & Meals On Me Backstage Lounge at the Rock & Roll Hall Of Fame at Peacock Theater on November 8, 2025 in Los Angeles, California. \n\t\t\t\t\t\t\t\t\tGetty Images for GBK Brand Bar L\n\t\n\n\n\n\tRoan began her speech by saying: “I think we can all agree the best art comes from the most authentic people. When artists stay true to themselves, even when some people say they’re too much, too loud, too eccentric, or all of the above, that honesty becomes their greatest strength.” \n\n\tIn an awkward but charming moment, Roan came within an inch of dropping an F-bomb on Disney+ as she realized she was losing her place. “I f…” She stopped herself, explaining, “I messed up so bad by refusing to get contacts. Holy cow.”\n\n\tQuickly regaining her composure amid audience chuckles that will not be heard when an edited version airs on ABC New Year’s Day, Roan continued: \n\n\t“It’s that courage that not only creates incredible art, it gives everyone who experiences it the permission to be themselves. It opens their hearts, it changes their mind, and that is its power. Tonight, we honor a woman who redefined what a pop star could look like, sound like, sing like and be. A music legend whose authenticity has inspired us for the last four decades with her four-octave range, the amazingly fabulous Cyndi Lauper.”\n\t\n\n\n\n\t\n\n\t\t\t\t\tChappell Roan at 2025 Rock & Roll Hall of Fame Induction Ceremony at Peacock Theater on November 08, 2025 in Los Angeles, California.\n\t\t\t\t\t\t\t\t\tGilbert Flores\n\t\n\n\n\n\tAfter extolling her heroine’s vocal prowess, Roan noted that “before the whole world knew that voice, Cyndi spent years singing in cover bands and working random jobs trying to find her way. And it wasn’t until her band Blue Angel that people in the business started to notice her. The band eventually broke up, but Cyndi finally got her much-deserved, well-earned, overdue break in 1983 when she released her debut solo album, ‘She’s So Unusual’,” which she said “marked a cultural shift and earned Cyndi the Grammy for best new artist… ‘Girls Just Want to Have Fun’ was more than a hit. The song became a global feminist anthem, and the video a touchstone for her unmistakable style. ‘Time After Time’ is arguably one of the greatest love ballads to ever exist, and the naughty ‘She Bop’ and her iconic rendition of ‘All Through the Night’ further cemented Cyndi’s status as a global superstar.” \n\n\tContinued Roan, “Over the time of her 12 album releases and more, Cyndi spread her magical musical wings that have her venturing outside of pop and into blues, country, jazz and even Broadway, for which she won a Tony. Some of her incredible accomplishments also happen outside of the studio. They happen when she advocates for gay rights before the U.S. Senate. They happen through her non-profit, True Colors United, fighting to the end — fighting to end homelessness among LGBTQ+ youth. And they happen when she paves the way for artists like me to freely express myself. Cyndi Lauper has shown us that you can be bold, quirky, loud, glamorous and have any hair color you want. She’s empowered generations, opening our hearts, our minds, and broadcasting the beautiful message that we have the power to be who we authentically are.”\n\n\tLauper started her own speech on a more irreverent note: “See what happens when you let the riff-raff in?”\n\n\n\n\t\n\n\t\t\t\t\tCyndi Lauper at 2025 Rock & Roll Hall of Fame Induction Ceremony at Peacock Theater on November 08, 2025 in Los Angeles, California.\n\t\t\t\t\t\t\t\t\tGilbert Flores/Variety\n\t\n\n\n\n\tAmong those Lauper thanked were “my mom, who would’ve liked to be here because she wouldn’t have had to worry if I was gonna win or not,” and “all the record executives and producers that I worked with, and probably drove crazy — just ask them, some of them are sitting there right now — who had faith in me and created it with me.” Her kudos extended to “every band, including the cover band,” and her road crew and “the people that helped me string my dulcimer, which nobody was happy I was playing.”\n\t\n\n\"My shoulders are broad enough to have the women who come after me stand on mine.\" — Cyndi Lauper accepts her 2025 Rock Hall Induction and gives thanks to all the women who came before her.  #RockHall2025 pic.twitter.com/IKrHRSTduF— Rock & Roll Hall of Fame (@rockhall) November 9, 2025\n\n\n\tShe noted that, when she uses the R&R term for herself, she is thinking in terms of the same big tent that the Hall itself has used for years in bringing in acts from different genres under that attitudinal umbrella.\n\n\t“Rock ‘n’ roll is a big, wonderful quilt of a lot of different styles of music. Thank goodness,” she said. “And all of that music has influenced me and my work, and without it, I don’t know what kind of music I’d be making. So I just want to say, now of all times, let’s come together again and do good in the world because it needs us…\n\n\t“You know, I always was part of the rock ‘n’  roll community anyway. You just didn’t wanna talk to me because, you know, they thought I was a little crazy. I don’t know why. Anyway, all kidding aside, I love you. Thank you very much to the Rock Hall of Fame. I’m so happy you’re bringing women back in. There are a lot of us. And long live rock ‘n’ roll.”\n\n\n\tThe performance by Lauper that came near the end of the four-hour-plus proceedings included, besides the aforementioned rendition of “True Colors,” a duet with Raye on “Time After Time” and a climactic “Girls Just Want to Have Fun” that had Avril Lavigne trading lines on the verses and Salt-N-Pepa making a group cameo at the end.\n\n\n\n\t\n\n\t\t\t\t\tCyndi Lauper and Brandi Carlile at 2025 Rock & Roll Hall of Fame Induction Ceremony at Peacock Theater on November 8, 2025 in Los Angeles, California.\n\t\t\t\t\t\t\t\t\tGilbert Flores/Variety\n\t\n\n\n\n\n\n\t\n\n\t\t\t\t\tChappell Roan at 2025 Rock & Roll Hall of Fame Induction Ceremony at Peacock Theater on November 8, 2025 in Los Angeles, California.\n\t\t\t\t\t\t\t\t\tGilbert Flores/Variety\n\t\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chappell Roan Lauds Cyndi Lauper at Rock Hall Induction for ‘Showing Us You Can Be Bold, Quirky, Loud, Glamorous and Have Any Hair Color You Want’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/MixCollage-09-Nov-2025-10-37-AM-1587.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-09T19:28:46.000Z",
      "dateModified": "2025-11-09T19:28:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sudanese Drama ‘Cotton Queen’ Wins Golden Alexander Award at Thessaloniki Film Festival",
    "url": "https://variety.com/2025/film/global/sudanese-drama-cotton-queen-wins-thessaloniki-film-festival-1236573310/",
    "image": "https://variety.com/wp-content/uploads/2025/08/COTTON_QUEEN_3_cFrida-Marzouk_Strange_Bird_2025.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-09T15:13:48.000Z",
    "description": "\n\tSuzannah Mirghani’s Sudanese drama “Cotton Queen” won the top prize Sunday at the Thessaloniki Film Festival, taking home the Golden Alexander for b",
    "body": "\n\tSuzannah Mirghani’s Sudanese drama “Cotton Queen” won the top prize Sunday at the Thessaloniki Film Festival, taking home the Golden Alexander for best feature film.\n\n\tMirghani’s arresting debut — the first-ever feature film shot by a female Sudanese director — wowed the festival jury, which included Match Factory head of sales Τhania Dimitrakopoulou, U.S. cinematographer Frederick Elmes (“Blue Velvet,” “Wild at Heart”) and writer-director Elegance Bratton (“The Inspection”), who said “Cotton Queen” “blew us all away.”\n\t\n\n\t“This film sat with all of us judges from beginning to end,” said Bratton. “As we live in a world consumed by genocide and war, it’s important to remember what we’re all fighting for: our families, ourselves, our friends, our communities. This film…kept us focused on what matters most.”\n\n\n\t“Cotton Queen” follows a young Sudanese woman living in a village on the banks of the Nile River. The granddaughter of the so-called “Cotton Queen,” an elderly woman who’s taken on legendary dimensions due to her resistance against the British and her alleged ability to see the future, Nafisa works in her grandmother’s cotton fields and dreams about the young man she loves. \n\n\tBut the arrival of a wealthy entrepreneur from London upends everything, with her parents, her grandmother and her community planning Nafisa’s future without her knowledge. The film premiered in the Critics’ Week strand at this year’s Venice Film Festival.\n\n\tAccepting the Golden Alexander in Thessaloniki, Mirghani dedicated the award to Sudan, which is now in the grips of a devastating civil war, and to her Sudanese cast and crew, who are clinging to survival and “seeking a way out.”\n\t\n\n\t“In this time of war and of genocide, to make a film with actors who are now all displaced from their homes, all in Egypt where we shot the film, seeking refuge — to show that you can still work, you can still make a film, you can still make art in this time and be recognized for it, is really the most welcome news at this time,” she said.\n\n\tGreek filmmaker Aristotelis Maragkos won the Silver Alexander for best director for his sophomore feature “Beachcomber,” which tells the story of a young man chasing his sailor father’s legacy who is forced to confront the fragile truth of who he really is. The film also took home the Artistic Achievement Award for Best Cinematography for DoP Giorgos Karvelas.\n\n\tElsewhere in the international competition, the best actor award went to Harry Melling for his depiction of a mild-mannered traffic warden exploring his submissive side in Harry Lighton’s queer romance “Pillion,” while best actress honors went to Sabrina Amali, who plays an Egyptian archaeologist whose past catches up to her in Nancy Biniadaki’s “Maysoon.” A Special Award for Best Screenplay, meanwhile, went to writer Yvonne Görlach for Christina Tournatzès’ “Karla.”\n\n\tIn the festival’s Meet the Neighbors+ competition section, which includes debut or sophomore films from the 36 countries of Southeastern Europe, the Mediterranean and the Middle East, the Golden Alexander for best feature went to “The Last One for the Road,” Francesco Sossai’s boozy dramedy about a pair of aging drinking buddies that premiered in the Cannes Film Festival’s Un Certain Regard section. The film also scooped best actor honors for its two leading men, Pierpaolo Capovilla and Sergio Romano.\n\n\tThe section’s Silver Alexander for best director went to Yanis Koussim for the horror film “Roqia,” which follows a young Algerian man tormented by mysterious nighttime visitors after a car crash leaves him with amnesia. The award for best actress in the Meet the Neighbors+ section went to Manuela Martelli for her portrayal of a Chilean widow in Hana Jušić’s “God Will Not Help,” which also won the award for Best Artistic Achievement.\n\n\tIn the Film Forward competition section showcasing innovative filmmaking, the Golden Alexander went to Mehrnoush Alia’s “1,001 Frames,” while the Silver Alexander went to Manoël Dupont for “Before/After,” whose stars Jérémy Lamblot and Baptiste Leclere also earned a Special Mention from the jury. The award for Best Artistic Achievement went to Kristen Stewart’s “The Chronology of Water.”\n\t\n\n\tOther big winners at Sunday’s award ceremony included “Bearcave,” a queer romance by first-time directors Stergios Dinopoulos and Krysianna Papadakis, which premiered in the Venice Days sidebar of the Venice Film Festival and took home seven awards in Thessaloniki, and “Patty Is Such a Girly Name,” by Greek filmmaker Giorgos Georgopoulos, which won five awards following its world premiere this week.\n\n\tThe Thessaloniki Film Festival runs Oct. 30 – Nov. 9.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sudanese Drama ‘Cotton Queen’ Wins Golden Alexander Award at Thessaloniki Film Festival",
      "image": [
        "https://variety.com/wp-content/uploads/2025/08/COTTON_QUEEN_3_cFrida-Marzouk_Strange_Bird_2025.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-09T15:13:48.000Z",
      "dateModified": "2025-11-09T15:13:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chuck Lorre, James Burrows, Glen and Les Charles, Ted Danson Pay Tribute to Bob Broder at Laugh-Filled Memorial Service",
    "url": "https://variety.com/2025/tv/news/chuck-lorre-james-burrows-ted-danson-bob-broder-memorial-1236573213/",
    "image": "https://variety.com/wp-content/uploads/2025/09/Bob-Broder-e1758739776354.jpg?w=1000&h=562&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-09T18:00:00.000Z",
    "description": "\n\tBob Broder was allergic to small talk. In his heyday as one of the industry’s top literary agents, he was known as “Darth Broder.” He loved to ski. ",
    "body": "\n\tBob Broder was allergic to small talk. In his heyday as one of the industry’s top literary agents, he was known as “Darth Broder.” He loved to ski. He loved to play poker, make fig jam and smoke cigars. And he loved his family and his golden retrievers with all his heart.\n\n\tThat is how Broder was remembered Saturday at a memorial service held at the Steven J. Ross Theater on the Warner Bros. lot, where he spent the last dozen years of his career as the business chief of Chuck Lorre Productions. Broder died Sept. 23 at the age of 85. The gathering of several hundred people reflected a who’s who of executives and leaders across the industry as well as longtime friends and family. More than a few rival agents came to pay their respects.\n\t\n\n\tLorre, the prolific showrunner and co-creator of “Two and a Half Men,” “The Big Bang Theory,” “Dharma & Greg” and a host of other shows, followed the powerful opening eulogy delivered by Rabbi Steven Z. Leder of Wilshire Boulevard Temple. With so many comedy writers on the bill, the Broder tribute was no somber affair. It was also full of revealing personal details about a man who was never accused of over-sharing. (Who knew Bob Broder managed snack bars on the beach in Santa Monica while he was in law school at UCLA?). As James Burrows, another longtime client observed, “He knew about the money; I knew about the funny.”\n\n\n\tIn addition to Lorre and Burrows, the other speakers were: Norman Kurland, his longtime business partner at the Broder Kurland agency; younger siblings Madelynn Broder Kopple and Bill Broder; Chris Silbermann of CAA, who reflected the generation of now-senior agents who learned the ropes at Broder Kurland; Eddie Gorodetsky, a writer-producer long associated with Lorre and cigar buddy of Broder; Revata Bowers, former head of UCLA’s Center for Early Education, where Broder served as a trustee and board president; Tom Hoberman, a top entertainment lawyer and longtime friend; and, in closing, the “Cheers” trio of series co-creators Glen Charles and Les Charles, who were longtime Broder clients, and star Ted Danson.\n\t\n\n\tHere is Chuck Lorre’s tribute to Broder in full. His opening line got one of the biggest responses in a memorial full of laughs, because it was so true. “Bob would have gotten me out of this,” he deadpanned.\n\n\tMy name is Chuck Lorre. Bob Broder, aka Darth Boder, was my agent for 25 years, my business partner for 12 and my friend for oh gosh, I gotta say six, seven months…not in a row. Bob liked to tell people that he worked for me, but we both know that wasn’t true. Broder worked for me the same way a zookeeper works for the monkeys.\n\n\tThose of you who know me know I’m somewhat emotional in my behavior, and let’s say anger is my sweet spot, righteous indignation my happy place. And I think we can all agree that Bob Broder was none of those things. He was always calm, judicious, analytical, not to mention ferociously smart. As a result, every time we disagreed on something which happened a lot, I was wrong. I was wrong so often it got to where I knew I was wrong as the words were coming out of my mouth, I could look at Bob and actually see him trying to not roll his eyes. To make matters worse, he’d always let me spin out ranting and raving about some high-class injustice I was forced to suffer, like when we negotiated a new overall deal with Warner Bros. He waited till I was done spewing then slowly and patiently explained why it was wrong for me to call overhead of distribution charges the skim.\n\n\tOne of my fondest memories, I flipped out over profit participation statement. He tried to calm me down by explaining how Warner Bros. and Fox and Disney basically all the production companies played a game called Legally Steal Money from your partners and how it wasn’t his job to stop the game. It was his job to limit the grift to an acceptable number. Or, as he so succinctly put it, Chuck. They’re gonna fuck you. I’m just gonna make sure they bring some lube. His words, not mine. \n\n\tI still argue with Bob, only now the arguments are in here [points to his head], and the results are the same. I’m still wrong. That’s OK. Instead of getting upset, I’ve learned to pause to breathe and ask myself, What would Broder do? And you know what he tells me? In fact, he has been telling me for 25 years, not by lecturing or being pedantic, but by the way he behaved, the way he carried himself, the way he treated people in business. In town dominated by egos he seemingly had none. He always was the grown up in the room which created a safe space for the children. And by children I mean me, and if he smoked enough pot, Jimmy Burrows, I’m sorry. I’m sorry. It was right there. \n\t\n\n\tBob was beloved by all who knew him. He was a wildly successful literary agent, good father, loving husband, trusted friend, tough but fair production executive, great skier and a world class poker player. The only thing he couldn’t do is chit-chat. If, after completing the business of a phone call, I said, “Hey, did you see that episode of ‘Succession’ last night?” His response would be, ‘Goodbye.’ If I felt the need to chit chat, I had to call Peter Roth.\n\n\tI was recently asked by somebody if I plan to replace Bob as the head of my company. My answer was, why would I do that? He’s here and he’s here [points to head and heart]. Thank you.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chuck Lorre, James Burrows, Glen and Les Charles, Ted Danson Pay Tribute to Bob Broder at Laugh-Filled Memorial Service",
      "image": [
        "https://variety.com/wp-content/uploads/2025/09/Bob-Broder-e1758739776354.jpg?w=1000&h=562&crop=1"
      ],
      "datePublished": "2025-11-09T18:00:00.000Z",
      "dateModified": "2025-11-09T18:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "BBC Director General and CEO of News Step Down After Trump Editing Controversy",
    "url": "https://variety.com/2025/tv/news/bbc-director-general-ceo-news-step-down-trump-1236573544/",
    "image": "https://variety.com/wp-content/uploads/2024/01/BBC-logo.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-09T18:53:57.000Z",
    "description": "\n\tBBC’s director general Tim Davie and the CEO of News Deborah Turness both resigned on Sunday. The shock decisions came after the BBC’s flagship docu",
    "body": "\n\tBBC’s director general Tim Davie and the CEO of News Deborah Turness both resigned on Sunday. The shock decisions came after the BBC’s flagship documentary show Panorama was accused of doctoring a Donald Trump speech to make it seem like he encouraged the January 6 Capitol riot.\n\n\t“This is a sad day for the BBC. Tim has been an outstanding Director-General for the last five years. He has propelled the BBC forward with determination, single-mindedness and foresight,” said BBC Chairman Samir Shah. “He has had the full support of me and the Board throughout. However, I understand the continued pressure on him, personally and professionally, which has led him to take this decision today. The whole Board respects the decision and the reasons for it.”\n\t\n\n\tIn an exit statement to BBC staff, Davie wrote, “Like all public organisations, the BBC is not perfect, and we must always be open, transparent and accountable. While not being the only reason, the current debate around BBC News has understandably contributed to my decision. Overall the BBC is delivering well, but there have been some mistakes made and as Director-General I have to take ultimate responsibility.”\n\n\n\tIn her own statement, Turness said she has “taken the difficult decision that it will no longer be my role to lead you in the collective vision that we all have: to pursue the truth with no agenda.”\n\n\tTrouble for the BBC began on Nov. 3, after the Telegraph published details of a 19-page dossier on BBC bias by a former independent external advisor to the BBC’s standards committee. In the report, Panorama was accused of splicing together footage that made Trump “‘say’ things [he] never actually said.” One of the most damning clips shows Trump declaring he would walk with his supporters to the Capitol and “fight like hell,” when he actually encouraged them to “peacefully and patriotically make your voices heard.”\n\t\n\n\tThe dossier also claimed that the BBC’s top brass ignored complaints and suggestions by the standards committee.\n\n\tDavie has faced a number of major scandals since being named director general in 2020, including the resignation of the BBC’s top new anchor Huw Edwards and accusations of bias from both sides over its coverage of the war in Gaza. Earlier this year, the BBC apologised over the documentary “Gaza: How to Survive a Warzone” after it emerged that the 13-year-old narrator’s father held a position in the Hamas-run administration, an omission that regulator Ofcom said was a “serious breach” of broadcasting rules.\n\n\tDavie first joined the BBC in 2005 as director of marketing, communications and audiences. Turness was named CEO of BBC News in 2022 and previously served as president of NBC News.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "BBC Director General and CEO of News Step Down After Trump Editing Controversy",
      "image": [
        "https://variety.com/wp-content/uploads/2024/01/BBC-logo.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-09T18:53:57.000Z",
      "dateModified": "2025-11-09T18:53:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Predator: Badlands’ Sets Franchise Record With $40 Million Debut, Snapping Box Office Cold Streak",
    "url": "https://variety.com/2025/film/box-office/predator-badlands-box-office-opening-weekend-record-1236573309/",
    "image": "https://variety.com/wp-content/uploads/2025/11/PB-FP-0006.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-09T15:48:20.000Z",
    "description": "\n\t“Predator: Badlands” is this weekend’s apex predator at the box office, collecting a better-than-expected $40 million in its domestic debut. \n\n\tThos",
    "body": "\n\t“Predator: Badlands” is this weekend’s apex predator at the box office, collecting a better-than-expected $40 million in its domestic debut. \n\n\tThose ticket sales were enough to cement a franchise record, overtaking 2004’s “Alien vs. Predator” ($38 million, not adjusted for inflation) as the biggest opening weekend in the long-running property. The sci-fi series ignited with 1987’s “Predator,” starring Arnold Schwarzenegger, and extended over the years with sequels, reboots and “Alien” crossover films.\n\t\n\n\t“Badlands” is reviving a moribund box office. With a pileup of painful misfires in October, such as Disney’s “Tron: Ares” and A24’s “The Smashing Machine,” revenues for the month had plunged to a 28-year low. November releases, including “The Running Man,” “Now You See Me 3,” “Wicked: For Good” and “Zootopia 2,” will aim to keep up the momentum. That’s as overall domestic box office returns are pacing roughly 3% ahead of 2024 — a gap that’s been rapidly shrinking since summer, when ticket sales were 25% ahead of last year. Ticket sales remain around 20% behind pre-pandemic times.\n\n\n\t“‘Predator: Badlands’ shows how unpredictable and dynamic the marketplace can be. All it takes is one over-performance to get the industry back on track,” says Comscore’s head of marketplace trends Paul Dergarabedian. “This is a great lead in for what promises to be one of the better months of November for the industry.”\n\n\tHeading into the weekend, Disney and 20th Century’s “Predator: Badlands” was aiming for $25 million to $30 million to start. However, positive reviews and great word-of-mouth, including an “A-” grade on CinemaScore exit polls, helped the newest “Predator” crush initial expectations. “Badlands” also had a broader theatrical reach with its PG-13 rating. (Most of the “Predator” films have been rated R.) Meanwhile, premium large formats like Imax, Dolby and 3D, which cost more than the average ticket, contributed a substantial 59% of the overall domestic tally.\n\t\n\n\t“Predator: Badlands” earned another $40 million at the international box office, bringing its global total to $80 million. That’s a promising start for the $105 million-budgeted tentpole. It’s also a return to form for Disney, which has struggled with recent theatrical releases such as “Tron: Ares” and “Springsteen: Deliver Me From Nowhere.” Now through the end of the year, Disney is poised to dominate at the box office with “Zootopia 2” and “Avatar: Fire and Ash,” both of which could earn $1 billion — and then some.\n\n\tDan Trachtenberg returned to direct “Predator: Badlands” after helming the two most recent franchise entries, 2022’s “Prey” and this June’s animated “Predator: Killer of Killers,” both of which skipped theaters and landed directly on streaming. This standalone story is about an outcast alien hunter (Dimitrius Schuster-Koloamatangi) and his unlikely ally (Elle Fanning), who embark on a dangerous journey to defeat a menacing adversary. Variety’s chief film critic Peter Debruge praised “Badlands” as the “most interesting — and the strongest film with ‘Predator’ in the title since the 1987 original.”\n\n\t“Predator: Badlands” was easily No. 1 over several new releases — including Jennifer Lawrence and Robert Pattinson’s psychodrama “Die My Love,” Rami Malek-led historical drama “Nuremberg,” Sydney Sweeney’s boxing biopic “Christy” and Amazon MGM’s inspirational true story “Sarah’s Oil” — which were mostly catering to older audiences or arthouse crowds. Some of those titles managed to break through more than others.\n\n\t“Sarah’s Oil” enjoyed the best start among newcomers with $4.5 million from 2,410 theaters, enough for fourth place on domestic charts. The feel-good film, about a young Black girl who finds oil on her land and becomes a millionaire at age 11, landed a rare “A+” grade on CinemaScore exit polls. \n\n\t“Nuremberg” wasn’t far behind on box office charts, debuting at No. 5 with $4.1 million from 1,802 venues. Sony Pictures Classics is releasing the film, which follows a psychiatrist (Malek) who has to determine whether the Nazi Hermann Goring (Russell Crowe) is fit to be prosecuted at the Nuremberg trials. Moviegoers were fonder of “Nuremberg” than film reviewers; the film has a 68% average on Rotten Tomatoes from critics and 95% average from audiences.\n\t\n\n\t“Die My Love” stumbled in eighth place with $2.8 million from 1,983 theaters. That’s not a terrible opening except that Mubi reportedly paid $24 million for distribution rights. And “Die My Love,” directed by Lynne Ramsay, isn’t connecting with mainstream audiences. It was saddled with a “D+” grade on CinemaScore exit polls — which isn’t great in terms of word-of-mouth but also isn’t entirely unexpected for a polarizing and deeply unsettling film. Lawrence has been praised for her performance as a new mother who begins to unravel while suffering from postpartum depression.\n\n\t“Christy,” featuring Sweeney as the boxing trailblazer Christy Martin, didn’t benefit from star power, either. The R-rated sports drama, the first theatrical release from Black Bear Pictures, debuted at No. 11 with a paltry $1.3 million from 2,011 theaters.\n\n\tSecond place went to “Regretting You” with $7.1 million from 3,196 locations, a scant 8% decline from the prior weekend. Paramount’s adaptation of the Colleen Hoover novel has demonstrated impressive staying power with $38.5 million domestically and $70.9 million globally after three weekends in theaters.\n\n\t“Black Phone 2” dropped to third place with $5.3 million from 2,943 venues in its third frame, down just 36% from last weekend. So far, Universal and Blumhouse’s scary sequel has grossed $70 million in North America and $120 million worldwide. To compare, the original “Black Phone” earned $90 million domestically and $170 million worldwide by the end of its theatrical run.\n\n\tIn limited release, Neon’s familial drama “Sentimental Value” amassed $200,000 from four theaters in New York and Los Angeles, translating to $50,000 per location. That’s the third-highest screen average of the year and among the top 15 of post-pandemic times, according to Neon. Norwegian filmmaker Joachim Trier (“The Worst Person in the World”) directed “Sentimental Value,” which stars Stellan Skarsgard and Renate Reinsve as father (an eccentric filmmaker) and daughter (a successful actress) who reunite after decades of estrangement.\n\n\t“We’re excited to see this enthusiasm continue to build as we expand through November,” said Neon’s chief distribution officer Elissa Federoff.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Predator: Badlands’ Sets Franchise Record With $40 Million Debut, Snapping Box Office Cold Streak",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/PB-FP-0006.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-09T15:48:20.000Z",
      "dateModified": "2025-11-09T15:48:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "David Letterman Offers a Full Sandwich of a Speech Inducting Warren Zevon Into Rock & Roll Hall of Fame",
    "url": "https://variety.com/2025/music/news/david-letterman-warren-zevon-speech-rock-roll-hall-induct-1236573435/",
    "image": "https://variety.com/wp-content/uploads/2025/11/GettyImages-2245754393.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-09T16:33:07.000Z",
    "description": "\n\tDavid Letterman, who in 2002 hosted Warren Zevon‘s final television appearance before his death, paid tribute to his friend Saturday night with a le",
    "body": "\n\tDavid Letterman, who in 2002 hosted Warren Zevon‘s final television appearance before his death, paid tribute to his friend Saturday night with a lengthy induction speech at the Rock & Roll Hall of Fame that lasted several times as long as the musical salute by the Killers that followed. The former late-night host mixed werewolf jokes with a recollection of breaking down in tears at the end of his final encounter with Zevon.\n\n\tLetterman told the story of having Zevon on his program shortly after the rocker was diagnosed with terminal lung cancer and given only months to live. It was there that Zevon issued his famous “Enjoy every sandwich” advice, and Letterman spoke of following the singer-songwriter to his dressing room. There, he said, Zevon handed him the electric guitar he had used in his many appearances on the show, saying, “Take care of this for me.” “I know what’s supposed to happen now,” Letterman said, “and sure as hell, it did happen. I started to sob uncontrollably.”\n\t\n\n\tLetterman stood beside the guitar in question and said, “For 22 years, I have taken care of the guitar. … By God, tonight it’s going back to work.” To  Dave Keuning, lead guitarist of the Killers, he said, “It’s all yours, sir.” And at that point, it was left to the Killers — with special guest Waddy Wachtel, who played guitar on most of Zevon’s most famous records — to close the tribute out with their version of one of the honoree’s signature songs, “Lawyers, Guns and Money.”\n\n\n\n\tIt was only a one-song tribute, and his most famous song, “Werewolves of London,” did not factor into it — save for a couple of “Ah-oooh!” phrasings that Brandon Flowers worked in near the end of “Lawyers” as a semi-subtle interpolation.\n\t\n\n\n\tRead the entire text of Letterman’s speech, following:\n\n\t“I’m Dave ‘They Call Me the Breeze’ Letterman. I mean, honest to God. How cool is this, folks? How can you not feel a little let down after Salt-N-Pepa? I don’t blame you. Let’s wrap the show up and go home. Now, I can’t tell you how much fun this is for me, one, to just be out of the house, but two, to be here. And I want to thank the people who invited me to be part of this, to represent Warren Zevon, to represent his family, and to represent the people who love Warren’s music.Thank you very much for that.\n\n\t“About a week ago, I talked to Warren’s son, Jordan, and I said, ‘Jordan, first of all, I’m honored beyond belief to be part of this, and thank you again. Are there things you would like me to mention that particular night?’ And Jordan said, ‘Yes. There are three things I want you to mention: When Warren was a kid he studied with Igor Stravinsky, the classical composer.’ ‘Okay,’ I said, ‘I’ll do that.’ I said, ‘By the way, when I was a kid, I had a paper route,’ and we kept going. He said, ‘Also, I want you to mention Stumpy the gangster.’ I said, ‘Okay, got it. Stumpy the Gangster.’ He said, ‘Next, I want you to mention Bev the Mormon.’ ‘Okay. Stumpy the gangster, Bev the Mormon. Got that.’ And I said, ‘By the way, Jordan, those are my two favorite songs.’ He said, ‘Those were his parents, dumbass.’\n\n\t“Oh, by the way, Igor Stravinsky is still waiting for his nomination.\n\n\t“I first knew of Warren Zevon’s music when there was an article in Rolling Stone, a big front-page feature on Warren Zevon. It was called ‘The Crack Up and Resurrection of Warren Zevon.’ That was the title of the article of the story; the subtitle was ‘How he saved himself from a coward’s death.’ Well, then, by God, this got my attention, and so I read the article because I enjoyed the man’s music, and at one point in the article we realized that Warren is having some trouble with addiction. He’s tortured. He has emotional difficulties and he’s addicted and he’s struggling, and we all know that these stories sometimes don’t end well. It turned out at one point, he got very drunk, took a gun and started shooting up his own record albums. Now, at the time I had been a TV weatherman, so this was completely out of my league of experience. But because of that, Warren was able to struggle through with the help of his family, with the help of his friends, and he did save his own life. And I just wonder, is it more difficult to save your own life or save the life of somebody else? Or is that equal? But by God, the fact that Warren existed through this, tortured as he was, and saved his own life, to me, listening to the man’s music, I found it to be even more valuable.\n\t\n\n\t“When I then got to know Warren in person. I used to have a TV show on NBC. Hands if you remember NBC. Warren would be a guest on the program and he often would fill in for our musical director, Paul Shaffer. And it was a delight for me to have these two around, listening to Warren and talking to and getting to know Warren. And I was taken by an album that Warren had done in the ‘70s. It was called ‘Stand in the Fire.’ It was recorded at the Roxy on Sunset Blvd., and it was a live album, and the energy of that album would come off the record in those days and jump on you and knock you down. It was amazing. And I was talking to Warren on the show about that album and I said, ‘Warren, that was so great, “Stand in the Fire.” The music on that live album, I couldn’t get enough of that. It was tremendously dynamic.’ Warren looked at me and he said, ‘Well, you know, honestly, Dave, when it comes to the ‘70s, there’s really not much I can remember,’ kind of explaining his struggle. But then the music that we listened to, Warren playing with our band… and forgive me for this, but being right there in that studio, it was my own version of ‘20 Feet From Stardom.’ It was delightful,\n\n\t“You know, in music, many pretend, but Warren is a poet leaving few of life’s vagaries unaddressed. Warren’s music is dense with historic illusion, love and sadness, tinted with unexpected whimsy. Delivered with third-rail voltage rock ‘n’ roll, or sweet, heartbreaking, lush, symphonic melodies, either version of the man’s music is classic.\n\n\t“Rock ‘n’ roll… Ask any of Warren’s peers — Bruce Springsteen, Don Henley, Jackson Browne, Bob Dylan. Hell, ask Igor Stravinsky. Warren Zevon is in my Rock & Roll Hall of Fame, actually his own wing.\n\n\t“I had an idea; you’re gonna have to bear with me on this. I am so consumed with the work of Warren Zevon that when I was coming over here tonight in the Way-mo, I decided I better make a list of Warren Zevon songs and explain some of these to this audience… And keep in mind, thank you, I’m not a musicologist, I’m not the professor of rock. I’m just Dave. Are you ready for this? Here we go. Now this is not a complete list. And I’ve divided ’em into three categories. \n\n\t“The first category: Warren Zevon, global and personal strife. ‘Roland, the Headless Thompson Gunner’ — we all know that this is about a Norwegian mercenary and Patty Hearst. We know ‘Excitable Boy’ — this is about a boy who gets very excited about pot roast. ‘I’ll Sleep When I’m Dead’ — and boy, if this doesn’t get you in the Hall of Fame, stop trying. \n\t\n\n\t“Category number two: love songs. ‘Mutineer.’ Oh my God, this makes people cry. ‘Reconsider Me.’ This also makes people cry. ‘Searching for a Heart.’ Whenever I listen to this song, it’s always like the first time I’ve heard it and then I start to cry.\n\n\t“Okay, the third category of Warren Zevon songs: Songs about werewolves. That’s right. This is about a werewolf in London, and I don’t know if this is a true story, but there you have it.”\n\n\tA tribute reel followed that featured Bruce Springsteen, Jackson Browne, Don Henley and Jorge Calderon, among other friends and contemporaries, talking about Zevon’s impact, interspersed with performance clips that included Linda Ronstadt doing one of her many covers of his work. Then Letterman returned.\n\n\n\n\t\n\n\t\t\t\t\tDavid Letterman speaks onstage during the 2025 Rock & Roll Hall of Fame Induction Ceremony at Peacock Theater on November 8, 2025 in Los Angeles, California.  \n\t\t\t\t\t\t\t\t\tKevin Mazur/Getty Images for RRH\n\t\n\n\n\n\t“The thing about ‘Enjoy every sandwich’ — you know that that’s easy, but it’s deeply meaningful. And there’s not a person in this room who hasn’t considered that, but nobody can hang on to that on a daily basis. But by God, isn’t that true of life around the planet? Enjoy every sandwich.\n\n\t“I have a joke here I want to try: Oh my God, I’m surrounded by Killers and they’ve captured Waddy Wachtel. Oh, brother.\n\n\t“So that night, with Warren on the show, that was 22 years ago, the last time I saw Warren after the show, Warren goes up to his dressing room and I follow Warren to the dressing room myself. And I’ve been warned never to follow people to the dressing room, but I go up to Warren and we’re in the dressing room and he’s changed his clothes and he’s taking his stuff and he’s putting it away. And he’s got a guitar there that he’s used every time he’s appeared on our show. And as we’re chatting, he picks up the guitar and he puts it in the guitar case. And then he flips up those two little guitar clippies on a guitar case. How long do I need to do this? He closes the guitar case, he hands it to me and he says, ‘Take care of this for me.’ So in my head, I think I’ve seen this movie. I know what’s supposed to happen now, and sure as hell, it did happen. I started to sob uncontrollably. Warren and I hugged and I said, ‘Warren, I just love your music.’\n\t\n\n\t“So for 22 years, I have taken care of the guitar. This is the guitar right here… You know, in a way I’m glad the guitar gets a bigger reaction than the ‘I’m surrounded by Killers’ joke. This is the guitar, and by God, um, tonight it’s going back to work. Dave [Keuning, lead guitarist of the Killers], it’s all yours, sir. So now to put Warren right in the Rock and Roll Hall of Fame, it’s gonna be the Killers. Congratulations, Warren. Thank you for everything. Enjoy every sandwich.”\n\n\tThe Rock & Roll Hall of Fame induction followed by two weeks a far longer tribute to Zevon, the four-hour, 30-song-plus concert “Warren Zevon: Join Me in L.A.,” produced as a benefit by the Wild Honey organization at the United Theatre on Broadway in downtown Los Angeles. Among the performers at that show were his original producer Jackson Browne and longtime co-writer, Calderon, veteran session musicians Rick Marotta, Bob Glaub and Leland Sklar, and admirers such as Dwight Yoakam, Shooter Jennings and Fountains of Wayne. (See a review of that show here and read interviews with Jordan Zevon, Calderon and some of the other participants here.)\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "David Letterman Offers a Full Sandwich of a Speech Inducting Warren Zevon Into Rock & Roll Hall of Fame",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/GettyImages-2245754393.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-09T16:33:07.000Z",
      "dateModified": "2025-11-09T16:33:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Slovenian Director Kukla Readies ‘Good Girl,’ Inspired by Greek Comedy ‘Lysistrata,’ With Lead Actresses From ‘Fantasy’ on Board (EXCLUSIVE)",
    "url": "https://variety.com/2025/film/global/kukla-good-girl-fantasy-1236573286/",
    "image": "https://variety.com/wp-content/uploads/2025/11/Kukla.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-09T13:17:35.000Z",
    "description": "\n\tSlovenian filmmaker Kukla, whose debut feature “Fantasy” premiered at Locarno Film Festival and played this week at Thessaloniki Film Festival, is w",
    "body": "\n\tSlovenian filmmaker Kukla, whose debut feature “Fantasy” premiered at Locarno Film Festival and played this week at Thessaloniki Film Festival, is working on her sophomore feature. The project has been mentioned briefly previously, but Variety has exclusive additional details, including the working title, casting, and Kukla’s sources of inspiration.\n\n\tHer next project, which has the working title “Good Girl,” is a modern take on the Ancient Greek comedy “Lysistrata,” by Aristophanes, in which an Athenian woman advocates that women from warring city states should stop having sex with men until they stop fighting in the war between them, Kukla tells Variety in the Greek coastal city of Thessaloniki, with Mount Olympus visible across the sea.\n\t\n\n\tIn this updated version of “Lysistrata,” a third world war is threatened, and a TikToker “randomly speaks her thoughts out loud that we should stop having sex with men and stop giving birth to their kids if they want to kill them, and she starts a huge movement all over the world,” Kukla says.\n\n\n\tThe film is partly inspired by the Korean 4B Movement, a radical feminist movement that called for a rejection of sex, giving birth, dating and marriage. This started as a response to male violence against women, but broadened out to become a protest against male oppression. It spread to the U.S. following President Trump’s victory last year.\n\n\n\n\n\tThe new film will be set in different territories, including in the Balkans and France, “because I think that female solidarity will save the world, and I really want to show the strength of women everywhere,” Kukla says.\n\t\n\n\tThe lead actresses from “Fantasy,” Sarah Al Saleh, Mina Milovanović and Mia Skrbinac, will also appear in the second feature. Skrbinac is a professional actress but Al Saleh and Milovanović are non-professionals. All three also appeared in Kukla’s 2020 short “Sisters,” which featured the same characters and storyline as “Fantasy,” and won the Grand Prix at Clermont-Ferrand Intl. Short Film Festival.\n\n\n\n\t\n\n\t\t\t\t\tMina Milovanovic, Sarah Al Saleh and Mia Skrbinac in “Fantasy”\n\t\t\t\t\t\t\t\t\tCourtesy of Lazar Bogdanovic\n\t\n\n\n\n\t“Good Girl” is “like an homage to them, because we have been on a long journey together, and we have grown up together as people and as filmmakers as well,” Kukla says.\n\n\tLike “Good Girl,” “Fantasy” also has its roots in Kukla’s interest in patriarchy, gender roles and identity.\n\n\tThe film centers on three tomboys, Mihrije, Sina and Jasna, best friends in Slovenia, who refuse to conform to the conservative norms of their communities, and traditions such as arranged marriages.\n\n\n\n\t\n\n\t\t\t\t\tAlina Juhart and Sarah Al Saleh in “Fantasy”\n\t\t\t\t\t\t\t\t\tCourtesy of Lazar Bogdanovic\n\t\n\n\n\n\tTheir world is turned upside down when they meet Fantasy, a transgender woman, which leads them on a journey of self-discovery in which they explore alternative approaches to gender roles and sexuality.\n\n\tAlina Juhart, who plays Fantasy, is well-known in the Balkans because she took part in a TV talent show. “It’s very interesting how, on the one hand, it’s such a conservative place, but on the other, they’re very welcoming, and that’s where I see the power of pop culture. That’s why the film has a lot of pop culture moments, because I think it’s good to make it approachable for the viewer.”\n\n\n\n\t\n\n\t\t\t\t\t“Fantasy” stars Mina Milovanovic, Mia Skrbinac, Sarah Al Saleh and Alina Juhart\n\t\t\t\t\t\t\t\t\tCourtesy of Lazar Bogdanovic\n\t\n\n\n\n\tRegarding her three young lead actresses, she says: “I really wanted them to be co-creators of the film. In a sense they were co-editing the script with me,” so that it was seen through their eyes. “I really believe I found people who have the essence of the characters in themselves. So, it’s not that they were playing themselves, but some part of themselves. That’s why it was a very transformative process for all of us. They were speaking their words, from their perspective. It was really important to me that this film came from within, that we are represented equally.”\n\t\n\n\tThe idea for the film occurred to Kukla 10 years ago when she became interested in the phenomenon of “sworn virgins,” who were women in the Balkans in times past who took a vow of chastity, and lived and dressed as men, and were considered to belong to a third gender.\n\n\tShe had the idea to transfer this rejection of femininity and traditional gender roles to a contemporary environment, albeit one in which the patriarchy still holds sway. In this social setting, they would be called tomboys, who fight like boys and are fiercely independent.\n\n\t“Then there was a spark of an idea: What would happen if a sworn virgin met a transgender woman in the Balkans?,” she says. “That meeting was a spark that expanded the whole view on femininity in the Balkans. And through that, I came to the core questions like, ‘Am I able to see myself uncontaminated by the male gaze? Or, where is the female eye? Where’s the female voice? And, from there, it goes in so many directions.”\n\n\tKukla lives in Belgrade, Serbia, but grew up in Slovenia, and her parents came from North Macedonia. Her birth name is Katarina Bogdanovic, but Kukla, which means “doll” in Macedonian, was her nickname as a child and stuck.\n\n\t“In the late 90s and early 2000s [Slovenia] was a very xenophobic place,” Kukla says. “My national identity was drowned in shame. I speak perfect Slovenian, but when they heard my mother speaking, there was a lot of bullying. So, we just weren’t accepted as a community.”\n\n\tShe adds: “And then the integration process successfully, let’s say, manifested. And now it has become some sort of a subculture. So it’s a very interesting cultural phenomenon. I’m really interested in those fluidities of identity. So I’m reflecting also on that in the film, because every diaspora is always more conservative than the original country. And also, there’s a mix of a lot of different cultures.”\n\n\tFantasy acts as a catalyst in the film, leading to a questioning of views on identity, including queer identity in the Balkans.\n\n\t“Fantasy is not afraid of her vulnerability, but also not afraid of her power. I wanted to include this Balkan queerness in my film, which is not dependent on Western queerness. I think we have our own version of it,” Kukla says.\n\t\n\n\t“I don’t see her as a passive character at all. I think she’s very active, but she shows the other three girls that with her stance on her identity and with her honesty and courage that there are so many versions of femininity, and that you can live your own truth. And that is something that I was very eager to show in the film, because the Balkans is a very contradictory place. It’s very transphobic, homophobic and misogynistic place, yet her DMs are full of straight men with families. That was the contradiction that I was quite mad at, because there’s a lot of sexual interest in trans women, but no interest in them as normal humans, as equals in society.”\n\n\t“Fantasy” is produced by Lija Pogačnik, Barbara Daljavec and Vlado Bulajić for Slovenia’s December. The film, which also screened in competition at Sarajevo Film Festival, is being sold internationally by Totem Films.\n\n\tThe Hollywood Reporter first reported on Kukla’s second feature.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Slovenian Director Kukla Readies ‘Good Girl,’ Inspired by Greek Comedy ‘Lysistrata,’ With Lead Actresses From ‘Fantasy’ on Board (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/Kukla.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-09T13:17:35.000Z",
      "dateModified": "2025-11-09T13:17:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Box Office: ‘Predator: Badlands’ Ignites to Series-Best $80 Million Globally, ‘One Battle After Another’ Nears $200 Million",
    "url": "https://variety.com/2025/film/box-office/predator-box-office-badlands-global-record-one-battle-after-another-milestone-1236573502/",
    "image": "https://variety.com/wp-content/uploads/2025/11/Predator-Badlands.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-09T18:21:20.000Z",
    "description": "\n\t“Predator: Badlands” clawed its way to $80 million at the global box office, ranking as the biggest debut in the nearly 40-year-old franchise. Direc",
    "body": "\n\t“Predator: Badlands” clawed its way to $80 million at the global box office, ranking as the biggest debut in the nearly 40-year-old franchise. Director Shane Black’s 2018 reboot “The Predator” previously held the record with $73.5 million, not adjusted for inflation. \n\n\tThose ticket sales include $40 million in North America and $40 million in 52 international markets. “Badlands” also overtook the domestic record from 2004’s “Alien vs. Predator” with $38 million, also not adjusted for inflation. Meanwhile, this marks the franchise’s second-best international start after “The Predator” with $48.9 million. Top overseas markets were China with $7.4 million, the United Kingdom with $3.2 million and Mexico with $2.3 million.\n\t\n\n\tDan Trachtenberg directed “Predator: Badlands,” which is the ninth installment in the series and the first theatrical entry since Disney acquired 20th Century Fox. That’s where the franchise began, with 1987’s “Predator,” starring Arnold Schwarzenegger. Trachtenberg returned after helming the two most recent “Predator” adventures, 2022’s “Prey” and this June’s animated “Predator: Killer of Killers,” both of which skipped theaters and landed directly on Hulu. This chapter cost $105 million to produce and follows an outcast alien hunter (Dimitrius Schuster-Koloamatangi) and his unlikely ally (Elle Fanning), who embark on a dangerous journey to defeat a menacing adversary.\n\n\n\t“Badlands” is benefiting from several factors, including solid reviews, stellar word-of-mouth and outsized interest on Imax and other pricier premium-large-format screens. And this film is rated PG-13 (most of the other “Predator” films are rated R), which is broadening its appeal to family crowds rather than just the target demographic of boys and men.\n\t\n\n\t“Predator: Badlands” is reinvigorating the box office after a dismal October. November should remain strong with “Wicked: For Good” and “Zootopia 2” around Thanksgiving, while December offerings like “Five Nights at Freddy’s 2,” Sydney Sweeney’s psychological thriller “The Housemaid” and “Avatar: Fire and Ash” should help end the year on a high. \n\n\tElsewhere at the box office, Paul Thomas Anderson’s “One Battle After Another” is nearing a major milestone. The comedic action thriller, starring Leonardo DiCaprio, has earned $196.8 million globally (including $127.4 million overseas) and will soon surpass the $200 million mark. That’s a notable benchmark for an original, R-rated film that’s nearly three hours long. It’s by far the highest-grossing film of Anderson’s career, overtaking the 2007 Western “There Will Be Blood,” which earned $76.4 million globally. And it’s likely to be a major Oscar player in the new year. However, Warner Bros. spent more than $130 million on the film, and since theater owners get to keep about 50% of ticket sales, “One Battle After Another” is tracking to lose $100 million in its theatrical run.\n\n\tIn another benchmark, Sony’s “Chainsaw Man – the Movie: Reze Arc” has surpassed $150 million worldwide. The anime adventure has grossed $158 million to date, including $121 million internationally and $38 million domestically. “Chainsaw Man” is the second consecutive win for Sony’s Crunchyroll banner following September’s sleeper hit “Demon Slayer: Kimetsu no Yaiba Infinity Castle,” which is the biggest anime film ever with $591 million globally. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Box Office: ‘Predator: Badlands’ Ignites to Series-Best $80 Million Globally, ‘One Battle After Another’ Nears $200 Million",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/Predator-Badlands.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-09T18:21:20.000Z",
      "dateModified": "2025-11-09T18:21:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Demi Lovato, Jessica Alba, Serena Williams and More: Baby2Baby Red Carpet Photos",
    "url": "https://variety.com/gallery/demi-lovato-jessica-alba-serena-williams-and-baby2baby-red-carpet-photos/",
    "image": "https://variety.com/wp-content/uploads/2025/11/MAB_0166-1.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-09T14:54:16.000Z",
    "description": "Demi Lovato, Kerry Washington, Jessica Alba and Ciara were among the bold-faced names who stunned on the red carpet and helped raise more than $18 mil",
    "body": "Demi Lovato, Kerry Washington, Jessica Alba and Ciara were among the bold-faced names who stunned on the red carpet and helped raise more than $18 million Saturday night at the annual Baby2Baby Presented by Paul Mitchell Gala in Los Angeles.\nSerena Williams was presented with this year’s Giving Tree Award, an award given to a “public figure who has demonstrated exceptional commitment to improving the lives of children in need around the world.”\nThe gala, which took place at the Pacific Design Center, raises critical funds to make Baby2Baby’s work of reaching one million children living in poverty each year possible. Founded 14 years ago — Kelly Sawyer Patricof and Norah Weinstein are co-CEOs — Baby2Baby has distributed more than half a billion essential items, including diapers, formula and clothing to children in need. Baby2Baby provides these items to children in homeless shelters, domestic violence programs, foster care agencies, hospitals and school districts, as well as children who have lost everything in the wake of disaster.\nSponsors for the 2025 Baby2Baby Gala included title sponsor Paul Mitchell, as well as Summer Fridays, Merck for Mothers and Dave.\nCheck out all the best red carpet pics below.\n\n\n\n\t\t\t\n\t\t\t\n\tSteve Kazee and Jenna Dewan\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Michael Buckner\t\t\t\n\t\t\t\n\tSteve Kazee and Jenna Dewan at the 2025 Baby2Baby Gala.\n\n\t\t\n\t\t\t\n\t\t\t\n\tDemi Lovato\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Michael Buckner\t\t\t\n\t\t\t\n\tDemi Lovato at the 2025 Baby2Baby Gala.\n\n\t\t\n\t\t\t\n\t\t\t\n\tJessica Alba\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Michael Buckner\t\t\t\n\t\t\t\n\tJessica Alba at the 2025 Baby2Baby Gala.\n\n\t\t\n\t\t\t\n\t\t\t\n\tSimu Liu and Allison Hsu\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Michael Buckner\t\t\t\n\t\t\t\n\tSimu Liu and Allison Hsu at the 2025 Baby2Baby Gala.\n\n\t\t\n\t\t\t\n\t\t\t\n\tRachel Zoe\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Michael Buckner\t\t\t\n\t\t\t\n\tNew “Real Housewives of Beverly Hills” star Rachel Zoe at the 2025 Baby2Baby Gala.\n\n\t\t\n\t\t\t\n\t\t\t\n\tJulianne Hough\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Michael Buckner\t\t\t\n\t\t\t\n\tJulianne Hough at the 2025 Baby2Baby Gala.\n\n\t\t\n\t\t\t\n\t\t\t\n\tMolly Sims\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Michael Buckner\t\t\t\n\t\t\t\n\tMolly Sims at the 2025 Baby2Baby Gala.\n\n\t\t\n\t\t\t\n\t\t\t\n\tKerry Washington\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Michael Buckner\t\t\t\n\t\t\t\n\tKerry Washington at the 2025 Baby2Baby Gala.\n\n\t\t\n\t\t\t\n\t\t\t\n\tCamila Alves McConaughey\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Michael Buckner\t\t\t\n\t\t\t\n\tCamila Alves McConaughey at the 2025 Baby2Baby Gala.\n\n\t\t\n\t\t\t\n\t\t\t\n\tParis Hilton\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Michael Buckner\t\t\t\n\t\t\t\n\tParis Hilton at the 2025 Baby2Baby Gala.\n\n\t\t\n\t\t\t\n\t\t\t\n\tTaylour Paige\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Michael Buckner\t\t\t\n\t\t\t\n\t“It: Welcome to Derry” star Taylour Paige at the 2025 Baby2Baby Gala.\n\n\t\t\n\t\t\t\n\t\t\t\n\tAyesha Curry\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Michael Buckner\t\t\t\n\t\t\t\n\tAyesha Curry at the 2025 Baby2Baby Gala.\n\n\t\t\n\t\t\t\n\t\t\t\n\tElliot Grainge and Sofia Richie\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Michael Buckner\t\t\t\n\t\t\t\n\tElliot Grainge and Sofia Richie at the 2025 Baby2Baby Gala.\n\n\t\t\n\t\t\t\n\t\t\t\n\tCharlie Puth and Brooke Sansone\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Michael Buckner\t\t\t\n\t\t\t\n\tCharlie Puth and Brooke Sansone at the 2025 Baby2Baby Gala.\n\n\t\t\n\t\t\t\n\t\t\t\n\tDanny Ramirez\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Michael Buckner\t\t\t\n\t\t\t\n\tDanny Ramirez at the 2025 Baby2Baby Gala.\n\n\t\t\n\t\t\t\n\t\t\t\n\tShay Mitchell\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Michael Buckner\t\t\t\n\t\t\t\n\tShay Mitchell at the 2025 Baby2Baby Gala.\n\n\t\t\n\t\t\t\n\t\t\t\n\tLauren London\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Michael Buckner\t\t\t\n\t\t\t\n\tLauren London at the 2025 Baby2Baby Gala.\n\n\t\t\n\t\t\t\n\t\t\t\n\tGia Coppola\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Michael Buckner\t\t\t\n\t\t\t\n\tGia Coppola at the 2025 Baby2Baby Gala.\n\n\t\t\n\t\t\t\n\t\t\t\n\tSerena Williams\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Michael Buckner\t\t\t\n\t\t\t\n\tSerena Williams at the 2025 Baby2Baby Gala.\n\n\t\t\n\t\t\t\n\t\t\t\n\tCiara\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Michael Buckner\t\t\t\n\t\t\t\n\tCiara at the 2025 Baby2Baby Gala.\n\n\t\t\n\t\t\t\n\t\t\t\n\tSara Foster and Erin Foster\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Getty Images\t\t\t\n\t\t\t\n\tSara Foster and Erin Foster at the 2025 Baby2Baby Gala.\n\n\t\t\n\t\t\t\n\t\t\t\n\tErin Lim\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Michael Buckner\t\t\t\n\t\t\t\n\tErin Lim at the 2025 Baby2Baby Gala.\n\n\t\t\n\t\t\t\n\t\t\t\n\tKelly Sawyer Patricof and Norah Weinstein\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Michael Buckner\t\t\t\n\t\t\t\n\tBaby2Baby co-CEOs Kelly Sawyer Patricof and Norah Weinstein at the 2025 Baby2Baby Gala.\n\n\t\t\n\t\t\t\n\t\t\t\n\tLizzo and Antwaun Stanley\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Michael Buckner\t\t\t\n\t\t\t\n\tLizzo and Antwaun Stanley at the 2025 Baby2Baby Gala.\n\n\t\t\n\t\t\t\n\t\t\t\n\tKatherine LaNasa and Grant Show\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Michael Buckner\t\t\t\n\t\t\t\n\tKatherine LaNasa and Grant Show at the 2025 Baby2Baby Gala.\n\n\t\t\n\t\t\t\n\t\t\t\n\tAnna Kendrick\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Michael Buckner\t\t\t\n\t\t\t\n\tAnna Kendrick at the 2025 Baby2Baby Gala.\n\n\t\t\n\t\t\t\n\t\t\t\n\tMalin Akerman and Katie Lowes\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Michael Buckner\t\t\t\n\t\t\t\n\t“The Hunting Wives” co-stars Malin Akerman and Katie Lowes at the 2025 Baby2Baby Gala.\n\n\t\t\n\t\t\t\n\t\t\t\n\tMeghan Trainor\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Michael Buckner\t\t\t\n\t\t\t\n\tMeghan Trainor at the 2025 Baby2Baby Gala.\n\n\t\t\n\t\t\t\n\t\t\t\n\tJen Rubio\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Getty Images for Baby2Baby\t\t\t\n\t\t\t\n\tAway co-founder Jen Rubio at the 2025 Baby2Baby Gala.\n\n\t\t\n\t\t\t\n\t\t\t\n\tOlivia Munn\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Michael Buckner\t\t\t\n\t\t\t\n\tOlivia Munn at the 2025 Baby2Baby Gala.\n\n\t\t\n\t\t\t\n\t\t\t\n\tMamie Gummer\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Michael Buckner\t\t\t\n\t\t\t\n\tMamie Gummer at the 2025 Baby2Baby Gala.\n\n\t\t\n\t\t\t\n\t\t\t\n\tViveca Paulin and Will Ferrell\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Michael Buckner\t\t\t\n\t\t\t\n\tViveca Paulin and Will Ferrell at the 2025 Baby2Baby Gala.\n\n\t\t\n\t\t\t\n\t\t\t\n\tJennifer Lucas and Byron Allen\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Michael Buckner\t\t\t\n\t\t\t\n\tJennifer Lucas and Byron Allen at the 2025 Baby2Baby Gala.\n\n\t\t\n\t\t\t\n\t\t\t\n\tLeslie Mann and Judd Apatow\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Michael Buckner\t\t\t\n\t\t\t\n\tLeslie Mann and Judd Apatow at the 2025 Baby2Baby Gala.\n\n\t\t\n\t\t\t\n\t\t\t\n\tLake Bell\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Michael Buckner\t\t\t\n\t\t\t\n\tLake Bell at the 2025 Baby2Baby Gala.\n\n\t\t\n\t\n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Demi Lovato, Jessica Alba, Serena Williams and More: Baby2Baby Red Carpet Photos",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/MAB_0166-1.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-09T14:54:16.000Z",
      "dateModified": "2025-11-09T14:54:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Stars and Scars -- You Be the Judge",
    "url": "https://www.tmz.com/2025/11/08/polls-you-be-the-judge/",
    "image": "https://imagez.tmz.com/image/d4/16by9/2025/11/07/d4f2b2fddcad4b178a070ac598a2c047_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-08T08:25:40.000Z",
    "description": "\n    \n                    \n                          Stars and Scars\n                          You Be the Judge\n                      \n               ",
    "body": "\n    \n                    \n                          Stars and Scars\n                          You Be the Judge\n                      \n                  \n                        Published November 8, 2025 12:25 AM PST\n                                                                            \n      \n    \n          Tom Brady stirred the pot this week by revealing he cloned his late dog, and the blowup over transgender women in the women's locker room at Gold's gym was epic. So we gotta ask ...\n      \n      \n      \n          \n            \n              \n                \n                Share on Facebook\n              \n            \n            \n              \n                \n                Share on X\n              \n            \n                          \n                \n                  \n                \n              \n                      \n        \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Music\n              \n                          \n                Fairly Legal\n              \n                      \n        \n          \n  ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Stars and Scars -- You Be the Judge",
      "image": [
        "https://imagez.tmz.com/image/d4/16by9/2025/11/07/d4f2b2fddcad4b178a070ac598a2c047_xl.jpg"
      ],
      "datePublished": "2025-11-08T08:25:40.000Z",
      "dateModified": "2025-11-08T08:25:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Pete Davidson Returns to 'SNL' to Roast His Staten Island Ferry Fiasco",
    "url": "https://www.tmz.com/2025/11/09/pete-davidson-snl-return-roasts-staten-island-ferry/",
    "image": "https://imagez.tmz.com/image/40/16by9/2025/11/09/40d6d327d9764806aae559be0ced7f74_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-09T15:19:50.000Z",
    "description": "\n    \n                    \n                          Pete Davidson & Colin Jost\n                          Joke They're 'Losing Millions' Over Ferry Fi",
    "body": "\n    \n                    \n                          Pete Davidson & Colin Jost\n                          Joke They're 'Losing Millions' Over Ferry Fiasco\n                      \n                  \n                        Published November 9, 2025 7:19 AM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Pete Davidson and Colin Jost turned their infamous Staten Island Ferry drama into comedy gold on \"Saturday Night Live\" this weekend ... poking fun at the \"money-losing fiasco\" that's been haunting them since 2022.\n      \n    \n          The duo, who bought the decommissioned ferry with plans to turn it into a floating entertainment venue, reunited at the \"Weekend Update\" desk, and Pete wasted no time roasting their investment. \"So yeah, in case you're wondering why I had to do a show in Saudi Arabia ... we're losing millions on this ferry,\" he joked.\n      \n    \n          Pete, who's expecting his first child, added, \"I assume that's what the article says; I can’t spend $5 on a paywall when I got a kid on the way.\" He also quipped, \"I'm just excited to be a dad and give it all the energy and enthusiasm I never had for this show.\"\n      \n\n          Jost chimed in with, \"I will tell you on the other side, I prefer having a kid to the ferry.\" The two revealed they re-named the ship Titanic II. \"We thought the Staten Island Ferry sounded too depressing,\" Pete said.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Still, Colin insisted things are \"going very well,\" while Pete joked, \"If Lorne Michaels has taught us anything, it's that you never, ever give up even if everyone says the time has come and Tina Fey is ready to take over.\"\n      \n    \n          TMZ broke the story ... despite reports Pete and Colin were considering selling the ferry, sources told us no way. We're told their vision is finally taking shape ... with a recent Nike deal and even a Tommy Hilfiger fashion show held on board.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Colin Jost\n              \n                          \n                Pete Davidson\n              \n                          \n                SNL\n              \n                          \n                Viral\n              \n                          \n                Fairly Legal\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Pete Davidson Returns to 'SNL' to Roast His Staten Island Ferry Fiasco",
      "image": [
        "https://imagez.tmz.com/image/40/16by9/2025/11/09/40d6d327d9764806aae559be0ced7f74_xl.jpg"
      ],
      "datePublished": "2025-11-09T15:19:50.000Z",
      "dateModified": "2025-11-09T15:19:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The FBI Launches Probe Into Death of Passenger on Carnival Cruise Ship",
    "url": "https://www.tmz.com/2025/11/09/fbi-carnival-cruise-death-probe/",
    "image": "https://imagez.tmz.com/image/d3/16by9/2025/11/09/d3f59e9fcaa14395adfc0661cdf76fab_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-09T13:52:59.000Z",
    "description": "\n    \n                    \n                          Carnival Cruise\n                          FBI Investigating Dead Body Found On Ship\n             ",
    "body": "\n    \n                    \n                          Carnival Cruise\n                          FBI Investigating Dead Body Found On Ship\n                      \n                  \n                        Published November 9, 2025 5:52 AM PST\n                                                                            \n      \n    \n      \n        \n                    \n                  \n      \n                    X/@fox_sheldon\n          \n    \n          The FBI is probing the death of a passenger aboard a Carnival Cruise Line, according to authorities in Florida.\n      \n    \n          A rep for Carnival Cruise Line tells TMZ … company executives are working with FBI Miami agents to investigate the death of the guest who was traveling on a Carnival Horizon ship.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          The spokesperson also said the ship sailed back to Port Miami as scheduled Saturday morning, but he wouldn't provide further details, citing the ongoing FBI investigation.\n      \n\n          Video posted to X shows investigators wheeling a person in a body bag on a gurney into the back of a van from the Miami-Dade County Medical Examiner's Office parked at a dock next to the cruise ship.\n      \n    \n          Investigators have not yet released the name of the deceased or a cause of death.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                RIP\n              \n                          \n                Travel\n              \n                          \n                Fairly Legal\n              \n                          \n                News\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The FBI Launches Probe Into Death of Passenger on Carnival Cruise Ship",
      "image": [
        "https://imagez.tmz.com/image/d3/16by9/2025/11/09/d3f59e9fcaa14395adfc0661cdf76fab_xl.jpg"
      ],
      "datePublished": "2025-11-09T13:52:59.000Z",
      "dateModified": "2025-11-09T13:52:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Celebs Cuddled Up With Blankets",
    "url": "https://www.tmz.com/2025/11/09/celebrities-in-blankets/",
    "image": "https://imagez.tmz.com/image/f6/16by9/2025/11/05/f6939aa005fc4c41b045121c5f46e460_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-09T15:00:42.000Z",
    "description": "\n    \n                    \n                          Sexy Celebs\n                          Getting All Cuddled Up\n                          In Fuzzy B",
    "body": "\n    \n                    \n                          Sexy Celebs\n                          Getting All Cuddled Up\n                          In Fuzzy Blankets!\n                      \n                  \n                        Published November 9, 2025 7:00 AM PST\n                                                                            \n      \n    \n      \n        \n              \n    \n    \n          We're gonna let you in on a little secret right here ... celebs are just like us, and when it gets cold out there, they take their comfort seriously!\n      \n    \n          Since it's getting chilly, we put together a gallery of some of our favorite stars getting all cuddled up in blankets ... then again, no one needs an excuse to see what Stassie Karanikolaou and Kendall Jenner look like when they're getting cozy!\n      \n    \n          And if you thought that covers it, you're coming up short ... because there are plenty more celebs like Madelaine Petsch and Olivia Culpo in there -- check it out to check them out!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Anastasia Karanikolaou\n              \n                          \n                Kendall Jenner\n              \n                          \n                Hotties & Bodies\n              \n                          \n                Photo Galleries\n              \n                          \n                Models\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Celebs Cuddled Up With Blankets",
      "image": [
        "https://imagez.tmz.com/image/f6/16by9/2025/11/05/f6939aa005fc4c41b045121c5f46e460_xl.jpg"
      ],
      "datePublished": "2025-11-09T15:00:42.000Z",
      "dateModified": "2025-11-09T15:00:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Solange Knowles Spotted on Miami Beach with Boyfriend Gio Escobar",
    "url": "https://www.tmz.com/2025/11/09/solange-knowles-with-gio-escobar-miami/",
    "image": "https://imagez.tmz.com/image/3a/16by9/2025/11/09/3a9f53ae72be4dd995819b006c995b5d_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-09T19:06:15.000Z",
    "description": "\n    \n                    \n                          Solange Knowles\n                          We're a Shore Thing!!!\n                          ... Hi",
    "body": "\n    \n                    \n                          Solange Knowles\n                          We're a Shore Thing!!!\n                          ... Hits the Beach With Boyfriend Gio Escobar\n                      \n                  \n                        Published November 9, 2025 11:06 AM PST\n                                                                      |\n                Updated November 9, 2025 11:49 AM PST\n                                    \n      \n    \n          Vacay baes! Solange Knowles was spotted soaking up the Miami sun over the weekend with boyfriend Gio Escobar.\n      \n    \n          Check out the pics ... Solange smoldered in a teeny tiny black bikini, sipping drinks from a pineapple while Gio reclined with a book in the shade.\n      \n    \n          Solange reportedly began seeing the experimental jazz artist after splitting from her second husband, Alan Ferguson, in 2019 after 5 years of marriage.\n      \n\n                  \n          \n                          \n                \n                                  \n      \n    \n          Before that, Solange was married to Daniel Smith from 2004 to 2007. They share a son, Daniel.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Solange Knowles\n              \n                          \n                Miami\n              \n                          \n                Celebrity News\n              \n                          \n                Relationships\n              \n                          \n                Photo Galleries\n              \n                          \n                Fairly Legal\n              \n                          \n                Vacations\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Solange Knowles Spotted on Miami Beach with Boyfriend Gio Escobar",
      "image": [
        "https://imagez.tmz.com/image/3a/16by9/2025/11/09/3a9f53ae72be4dd995819b006c995b5d_xl.jpg"
      ],
      "datePublished": "2025-11-09T19:06:15.000Z",
      "dateModified": "2025-11-09T19:06:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]