[
  {
    "title": "James Van Der Beek’s Final Movie Revealed: ‘The Gates’ Trailer Shows Late Actor as Evil Pastor",
    "url": "https://variety.com/2026/film/news/james-van-der-beek-last-movie-the-gates-trailer-1236666778/",
    "image": "https://variety.com/wp-content/uploads/2026/02/The-Gates.jpg?w=855&h=493&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-18T20:22:54.000Z",
    "description": "\n\tThe late James Van Der Beek will make his final film appearance in “The Gates,” where he stars as an evil pastor named Jacob, as revealed in the tra",
    "body": "\n\tThe late James Van Der Beek will make his final film appearance in “The Gates,” where he stars as an evil pastor named Jacob, as revealed in the trailer.Directed by John Burr (“Legend of the Muse”), the upcoming thriller will be in theaters March 13. In addition to Van Der Beek, the cast includes Mason Gooding, Algee Smith, Keith Powers, and Brad Leland.“The Gates” tells the story of three friends who witness a murder while driving through a gated community. The trio finds itself targeted by a sinister pastor (Van Der Beek) and must face off against him and the neighborhood’s suspicious residents to survive.In the trailer, Van Der Beek’s character proclaims, “I have been called upon to lead this community, and those boys seek to destroy us. Find them, and let God’s will be done.” Holding the trio at gunpoint, he later adds, “You’ve seen what happens when people get in my way.Best known for his role as the titular protagonist Dawson Leery on “Dawson’s Creek,” Van Der Beek appeared in films like “Varsity Blues,” “The Rules of Attraction” and more. Later in his career, he starred in shows like “Mercy” and “Don’t Trust the B—- in Apt. 23.” Before his death on Feb. 11, Van Der Beek filmed a recurring role for Amazon Prime Video’s upcoming “Legally Blonde” prequel series, “Elle.”In the wake of Van Der Beek’s death, his friends set up a GoFundMe account to support his wife and six children, which has raised over $2.6 million.\n\n\n\tBurr developed “The Gates” from a script he penned. Gary Glushon, Ross Kohn and Nancy Leopardi serve as producers. Watch the trailer below. \n\n\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "James Van Der Beek’s Final Movie Revealed: ‘The Gates’ Trailer Shows Late Actor as Evil Pastor",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/The-Gates.jpg?w=855&h=493&crop=1"
      ],
      "datePublished": "2026-02-18T20:22:54.000Z",
      "dateModified": "2026-02-18T20:22:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Viola Davis Makes Literary Debut With New Courtroom Drama Novel ‘Judge Stone’",
    "url": "https://variety.com/2026/shopping/news/viola-davis-novel-judge-stone-buy-online-1236666722/",
    "image": "https://variety.com/wp-content/uploads/2026/02/viola-davis-novel-judge-stone.png?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-18T19:13:01.000Z",
    "description": "\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.\n\n\tViola Dav",
    "body": "\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.\n\n\tViola Davis is adding novelist to her impressive resume with the upcoming release of “Judge Stone,” a courtroom thriller she co-wrote with perennial bestseller James Patterson. The book — set to hit shelves on March 9 — marks Davis’s first full foray into adult fiction.\n\n\tPublished by Little, Brown and Company, “Judge Stone” centers on Judge Mary Stone, a respected circuit judge in the tiny Alabama town of Union Springs who must navigate a deeply divisive, ethically fraught courtroom battle. When a doctor is charged under draconian abortion laws after performing a procedure on a 13-year-old girl, Stone must balance her devotion to justice, her community and her own reelection prospects. \n\n\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\n\tFor Davis, this literary debut is a bold new chapter. In 2022, she released her memoir “Finding Me,” a deeply personal account of her rise from a tumultuous childhood to become one of the most celebrated actors of her generation; the audiobook narration earned her a Grammy Award in 2023. Following its release, Davis talked extensively about the thereaputic process of writing the memoir. “There’s an unspoken message that the only stories worth telling are the stories that end up in history books. This is not true,” she told Brené Brown during a press tour for the book. “Every story matters. My father’s story matters. We are all worthy of telling our stories and having them heard. We all need to be seen and honored in the same way that we all need to breathe.” \n\n\tThe Oscar-winning actor isn’t letting her new literary endeavors get in the way of her onscreen prowess.  Last April, she led the Amazon Prime Video thriller “G20” as the President of the United States. Looking ahead, she’s attached to the star-studded adaptation of “Children of Blood and Bone,” set for a January 2027 release.\n\n\n\tPre-order Davis’s new book “Judge Stone” here. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Viola Davis Makes Literary Debut With New Courtroom Drama Novel ‘Judge Stone’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/viola-davis-novel-judge-stone.png?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-18T19:13:01.000Z",
      "dateModified": "2026-02-18T19:13:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Elsbeth’ Casts Constance Wu and Anna Camp as Guest Stars (EXCLUSIVE)",
    "url": "https://variety.com/2026/tv/news/elsbeth-constance-wu-anna-camp-guest-stars-1236666008/",
    "image": "https://variety.com/wp-content/uploads/2026/02/MixCollage-17-Feb-2026-04-41-PM-8471-e1771375344917.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-18T20:00:00.000Z",
    "description": "\n\tConstance Wu and Anna Camp are the latest guest stars to join Season 3 of “Elsbeth,” the CBS mystery series starring Carrie Preston as the de facto ",
    "body": "\n\tConstance Wu and Anna Camp are the latest guest stars to join Season 3 of “Elsbeth,” the CBS mystery series starring Carrie Preston as the de facto detective Elsbeth Tascioni. \n\n\tIn the show, a spinoff to “The Good Wife” and “The Good Fight,” Wu will play Dr. Mallory Ryan, a “wealth therapist” helping the super-rich handle the burdens of their privileged existence. Per CBS, “When one patient suspects Mal of using their sessions to gather information for insider trading, Dr. Mal must terminate more than their doctor-patient relationship.”\n\t\n\n\tCamp will play Juliet Woodbent, a “trad wife” who prides herself as being able to do it all for her husband and six children, especially while being filmed by an up-and-coming documentarian. “After an on-camera slip-up in the kitchen that could destroy her public persona, Juliet must whip up something deadly,” according to the character description.\n\n\n\t“Elsbeth” Season 3 premiered on Oct. 12 and has run through the new year. The majority of the show functions as a “howcatchem” mystery, rather than a “whodunit” — in other words, the audience typically knows who the murderer is at the beginning of each episode. The series premiered in February 2024 and kicked off its second season just months after the first season aired. The series is known for its roster of guest stars, including Matthew Broderick, Nathan Lane, Jane Krakowski, David Alan Grier and Mary-Louise Parker, among many others.\n\n\tWu is best known for her role in Jon M. Chu’s blockbuster “Crazy Rich Asians,” and she recently starred alongside Naomi Watts and Bill Murray in “The Friend.” Up next she’ll be seen in Mindy Kaling’s Hulu comedy “Not Suitable for Work” and Season 2 of Amazon’s “The Terminal List.” She is represented by Gersh, Principal and Hansen, Jacobson, Teller, Hoberman, Newman, Warren, Richman, Rush, Kaller, Gellman, Meigs & Fox.\n\t\n\n\tCamp’s credits include Netflix’s “You,” in which she played twins, and the supernatural thriller series “Hysteria” for Peacock. She will next be seen in Paramount’s “Scream 7.” She is repped by Gersh, Authentic Talent and Schreck, Rose, Dapello, Adams, Berlin & Dunham.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Elsbeth’ Casts Constance Wu and Anna Camp as Guest Stars (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/MixCollage-17-Feb-2026-04-41-PM-8471-e1771375344917.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-18T20:00:00.000Z",
      "dateModified": "2026-02-18T20:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Disney Axed ‘Star Wars’ Sequel ‘The Hunt for Ben Solo’ Without Ever Asking About the Budget or Other Details, Says Soderbergh: ‘It’s Insane’ and ‘We Were All Frustrated’",
    "url": "https://variety.com/2026/film/news/disney-hunt-for-ben-solo-budget-star-wars-soderbergh-1236666719/",
    "image": "https://variety.com/wp-content/uploads/2026/02/MCDSTWA_WD067-e1771442130493.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-18T20:05:07.000Z",
    "description": "\n\tSteven Soderbergh is continuing to open about about his Adam Driver-starring scrapped “Star Wars” movie “The Hunt for Ben Solo.” In a new interview ",
    "body": "\n\tSteven Soderbergh is continuing to open about about his Adam Driver-starring scrapped “Star Wars” movie “The Hunt for Ben Solo.” In a new interview with BK Mag, the Oscar-winning filmmaker said “it was no surprise” to read Kathleen Kennedy’s Lucasfilm exit interview and hear about her frustrations over Disney’s axing of “The Rise of Skywalker” follow-up movie, which would’ve brought Driver back as the fan-favorite Kylo Ren/Ben Solo.\n\n\t“We were all frustrated,” Soderbergh said. “You know, that was two and a half years of free work for me and Adam and [writer] Rebecca Blunt. When Adam and I discussed him talking about it publicly, I said, ‘Look, do not editorialize or speculate about the why. Just say what happened, because all we know is what happened.’ The stated reason was, ‘We don’t think Ben Solo could be alive.’ And that was all we were told. And so there’s nothing to do about it, you know, except move on.”\n\t\n\n\t“I’d kind of made the movie in my head, and just felt bad that nobody else was going to get to see it,” the director continued. “I thought the conversation was strictly going to be a practical one—where they go, what is this going to cost? And I had a really good answer for that. But it never even got to that point. It’s insane. We’re all very disappointed.”\n\n\tDriver revealed the existence of “The Hunt for Ben Solo” in an October 2025 interview with the Associated Press, explaining he had been developing a Ben Solo movie for two years with Soderbergh. Then Disney executives pulled the plug on them.\n\n\t“I always was interested in doing another ‘Star Wars,’” Driver said at the time. “I had been talking about doing another one since 2021. Kathleen [Kennedy] had reached out. I always said: ‘With a great director and a great story, I’d be there in a second.’ I loved that character and loved playing him.”\n\t\n\n\tDriver loved “The Hunt for Ben Solo” script, calling it the “standard” of what a “Star Wars” movie “should be” and comparing it to the “handmade and character-driven” feel of “The Empire Strikes Back.” He added that Lucasfilm execs Kennedy, Dave Filoni and Cary Beck backed the project until Disney shut it down.\n\n\t“We presented the script to Lucasfilm. They loved the idea,” Driver recalled. “They totally understood our angle and why we were doing it. We took it to Bob Iger and Alan Bergman, and they said no. They didn’t see how Ben Solo was alive. And that was that.”\n\n\tSoderbergh provided his own POV on the film’s axing soon afterward by writing on BlueSky: “For the record, I did not enjoy lying about the existence of ‘THE HUNT FOR BEN SOLO,’ but it really did need to remain a secret…until now!… Also, in the aftermath of the ‘HFBS’ situation, I asked Kathy Kennedy if LFL had ever turned in a finished movie script for greenlight to Disney and had it rejected. She said no, this was a first.”\n\n\tDriver’s revelation mobilized “Star Wars” fans on social media into calling for Disney to reverse its decision and put “The Hunt for Ben Solo” back in development. A group of “Star Wars” fans even paid for a plane to fly a banner reading “Save ‘The Hunt for Ben Solo’” over Walt Disney Studios in Burbank, Calif. Even Daisy Ridley, who starred opposite Driver as Rey in the most “Star Wars” sequel trilogy, championed fans for their support of “The Hunt for Ben Solo.”\n\n\t“I knew a piece of it. I heard rumblings,” Ridley told IGN. “I have lots of friends who are crew, so things always travel like that. But, whoa! When the story came out, no, I was like, ‘Oh, my God!’ And it was him that said it, right? It was funny because, like, ‘Oh, wow, Adam is saying it,’ and that’s the big surprise of the year.”\n\n\t“I do love when there is a collective of positivity,” Ridley added “The way the internet seems to have rallied to try and get it to happen. It’s fantastic for us all. It’s good for us to all be united about something in a really positive way. Obviously, everyone knows he was a very popular character, but it was also lovely to think, ‘Wow, people really, really care and want this.’ I just… I like it.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Disney Axed ‘Star Wars’ Sequel ‘The Hunt for Ben Solo’ Without Ever Asking About the Budget or Other Details, Says Soderbergh: ‘It’s Insane’ and ‘We Were All Frustrated’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/MCDSTWA_WD067-e1771442130493.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-18T20:05:07.000Z",
      "dateModified": "2026-02-18T20:05:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Devon Sawa Joins Disney Series ‘Coven Academy’",
    "url": "https://variety.com/2026/tv/news/devon-sawa-disney-series-coven-academy-1236666611/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Devon-Sawa-e1771439228260.jpg?w=600&h=360&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-18T19:00:00.000Z",
    "description": "\n\tDevon Sawa is set to guest star in the upcoming Disney series “Coven Academy.” \n\n\tThe show, which was greenlit in August 2025, is expected to debut ",
    "body": "\n\tDevon Sawa is set to guest star in the upcoming Disney series “Coven Academy.” \n\n\tThe show, which was greenlit in August 2025, is expected to debut on Disney Channel and Disney+ sometime in 2026, though an exact premiere date has yet to be set. \n\n\tThe show takes place in New Orleans. Per the official logline, it follows “follows three teenage witches and their dangerously charming warlock peers at an elite magic school where power is currency, secrets are lethal, and attraction is a liability. Caught between ancient supernatural wars and forbidden love interests, the coven must decide how far they’re willing to go to protect their city — and themselves.”\n\t\n\n\tSawa will play Mr. Cole, who is described as “The effortlessly cool teacher who’s tired of watching teenagers mistake talent for readiness. He’s the adult who can clown you and protect you in the same breath. A good man and a brilliant warlock. It’s just another year at Coven Academy until Mr. Cole and the rest of the faculty are rocked by a surprising new student who threatens to upend everything.” \n\n\n\tSawa recently played multiple roles in the popular “Chucky” TV series, which was based on the “Child’s Play” horror film franchise. He has also made appearances on shows like “Twisted Metal” at Peacock and “Hacks” at HBO Max of late. He is best known for his roles in films like “Final Destination,” “SLC Punk,” and “Idle Hands.”  \n\n\tHe is repped by Artists First, Gersh, and Felker Toczek. \n\n\tThe main cast of “Coven Academy” includes Malina Pauli Weissman, Malachi Barton, Jordan Leftwich, Ora Duplass, Louis Thresher, and Tiffani Thiessen. Recurring cast members include Swayam Bhatia, Brendon Tremblay, and Keegan Connor Tracy. \n\t\n\n\tTim Federle created the series and executive produces via Chorus Boy Productions. Darren Swimmer, Todd Slavkin, Amanda Row, and Bronwyn North-Reist also executive produce. Chorus Boy and Disney Branded Television produce. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Devon Sawa Joins Disney Series ‘Coven Academy’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Devon-Sawa-e1771439228260.jpg?w=600&h=360&crop=1"
      ],
      "datePublished": "2026-02-18T19:00:00.000Z",
      "dateModified": "2026-02-18T19:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘The Valley’ Sets Jax Taylor-Less Season 3 Return and Unveils Trailer — Lala Kent and Tom Schwartz Join Cast Full-Time ",
    "url": "https://variety.com/2026/tv/news/the-valley-season-3-trailer-bravo-announces-april-1-premiere-1236666635/",
    "image": "https://variety.com/wp-content/uploads/2026/02/TheValley_S3_MediaVillage_3000x1688_HorizontalKeyArt.jpg?crop=0px%2C0px%2C3000px%2C1688px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-02-18T19:00:00.000Z",
    "description": "\n\tBravoholics rejoice: “The Valley” will return for its third season on April 1. And this time around, fans can expect to see two very familiar full-t",
    "body": "\n\tBravoholics rejoice: “The Valley” will return for its third season on April 1. And this time around, fans can expect to see two very familiar full-time faces on their screens: “Vanderpump Rules” alums Lala Kent and Tom Schwartz. \n\n\tFrom babies to breakups, there’s a whole lot of change — and, as always, drama — going on within this friend group in the forthcoming season. While Danny Booko and Nia Sanchez Booko have done their best to keep their marriage seeming picture-perfect, a fourth child and a recent move to Santa Clarita are making it difficult to keep up; after welcoming a baby of their own, Kristen Doute and Luke Broderick are adjusting to the changes that come with being parents while their relationship takes a backseat. A newly single Brittany Cartwright is working on getting her “sparkle back” (mommy makeover and all), but a reconnection with her old Kentucky flame has those in the group wondering if it’s all happening a little too fast. \n\t\n\n\tSchwartz, who first graced our screens as a male “mactor” (that’s a model and actor) back on Season 1 of “Vanderpump Rules” is returning to Bravo following a tumultuous few years and a divorce from fellow “Vanderpump Rules” original cast member Katie Maloney. Eager to settle down, he’s focused on finding his forever person — even if that means upsetting the balance of the friend group. Kent made her television debut as a fiery hostess on Season 4 of the reality show. Now, she’s focused on being a single mother to her two daughters as she inches toward her seven-year sober anniversary. Both Kent and Schwartz made appearances on Season 2 of “The Valley.”\n\t\n\n\tReturning “Valley” cast members include Jason Caperna, Janet Caperna, Jasmine Goode, Jesse Lally, Michelle Saniei and Zack Wickham.  Goode’s fiancée Melissa Carelli, Wickham’s boyfriend Benji Quach  return to the cast as friends, and Lally’s girlfriend Lacy Nicole will make her first appearance on the show.\n\n\tNotably absent from the cast is Jax Taylor, who Variety previously reported had stepped away from the show in order to focus on his mental health and recovery. (Ahead of the Season 2 premiere, Taylor revealed he’d been addicted to cocaine for more than two decades; in Season 3, he spent 30 days in a mental health facility before returning to the show. Taylor and Cartwright’s storyline in the second season of “The Valley” made for dark television.) \n\n\t“The Valley” was first conceptualized by executive producer Alex Baskin as a “Vanderpump Rules” spinoff series, focusing on previous SUR employees Taylor, Cartwright and Doute alongside a cast of their interconnected friends as they “trade bottle service in West Hollywood for baby bottles in the Valley all while they navigate bustling businesses, rocky relationships and feisty friendships.”\n\n\tEpisodes will air on Bravo at 8 p.m. ET/PT and stream the next day on Peacock. “The Valley” is produced by 32 Flavors and Evolution Media, an Amazon MGM Studios company. Baskin, Jeff Festa, Joe Kingsley and Brian McCarthy executive produce for 32 Flavors Entertainment. Jeremiah Smith, Keith Burke, Lisa Vanderpump, Ken Todd and Ryan Revel also executive produce.  \n\n\tWatch the trailer here.\n\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘The Valley’ Sets Jax Taylor-Less Season 3 Return and Unveils Trailer — Lala Kent and Tom Schwartz Join Cast Full-Time ",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/TheValley_S3_MediaVillage_3000x1688_HorizontalKeyArt.jpg?crop=0px%2C0px%2C3000px%2C1688px&resize=1000%2C563"
      ],
      "datePublished": "2026-02-18T19:00:00.000Z",
      "dateModified": "2026-02-18T19:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Train Dreams’ Pop-Up Gallery Curated by Clint Bentley and Cinematographer Adolpho Veloso Opens in Los Angeles (EXCLUSIVE)",
    "url": "https://variety.com/2026/artisans/news/train-dreams-pop-up-gallery-los-angeles-1236666396/",
    "image": "https://variety.com/wp-content/uploads/2024/12/Train-Dreams-2.jpg?crop=0px%2C94px%2C900px%2C506px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-02-18T18:30:00.000Z",
    "description": "\n\tA pop-up gallery offering a behind-the-scenes look at Netflix’s “Train Dreams” is set to open next week in Los Angeles.\n\n\tThe gallery exhibition, ti",
    "body": "\n\tA pop-up gallery offering a behind-the-scenes look at Netflix’s “Train Dreams” is set to open next week in Los Angeles.\n\n\tThe gallery exhibition, titled “Train Dreams: The Visual Journey,” will feature art and stills curated by the film’s director Clint Bentley and cinematographer Adolpho Veloso. It will also feature an immersive projection experience featuring unseen footage set to the soundtrack of the audio experience released in partnership with Calm earlier this year. Visitors are invited to step inside the sweeping landscapes and intimate moments that define “Train Dreams” and experience its visual language beyond the screen.\n\t\n\n\t“Train Dreams” stars Joel Edgerton as Robert Grainier, a logger and railroad worker living in the Pacific Northwest. Set in the late 1960s, Bentley called on Veloso to be the film’s cinematographer.\n\n\n\tThe images are lush. The tall green trees pop against the clear blue sky, until a wildfire ravages the forest and changes Grainger’s life. Suddenly, the palette is ash and grey reflecting the aftermath. Veloso’s imagery is one that lingers long after the film credits have rolled. In one scene, it’s a grand moment, as the tall trees get sawed down all in the name of progress. \n\n\tLast year, Veloso sat down with Variety for Inside the Frame and said, “For 99% of the movie, we used natural light.”\n\n\tIn a statement, Bentley said, “I’m really excited people will be able to experience the world of the film this way. Adolpho and I put a ton of thought and care into how to translate the world and images from the screenplay to the screen. A big part of that was trying to show the evocative world of Washington state from a fresh perspective. To have ‘Train Dreams’ displayed in a gallery like this should be a really special experience for anyone who can make it out.” \n\t\n\n\tVeloso said, “It’s actually amazing, and nothing short of fulfilling, to have a gallery of stills from the movie because we really shot this film with still photography in mind. We wanted it to feel like you were looking through someone’s life photographs, almost like you had found a box full of pictures and were trying to figure out who that person was through those images. All of our visual choices and our entire visual language came from that idea, trying to evoke the feeling that you are studying those photographs in an intimate way.” He added, “So it’s really amazing to take some of those images from the film and put them in a gallery, bringing it back to the initial idea. Hopefully, it becomes a similar experience to watching the movie, where you are piecing together who that person was through the pictures.”\n\n\t“Train Dreams: The Visual Journey” will open on Feb. 25 at 8250 Melrose Ave, Los Angeles, CA 90046, for a private preview event with filmmakers. It will open to the public on Feb. 26 from 11 a.m. to 6 p.m. The event will be free and tickets can be reserved here. The first 100 visitors will receive an exclusive 35mm poster signed by Bentley and Veloso, and other merchandise will be available throughout the day.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Train Dreams’ Pop-Up Gallery Curated by Clint Bentley and Cinematographer Adolpho Veloso Opens in Los Angeles (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2024/12/Train-Dreams-2.jpg?crop=0px%2C94px%2C900px%2C506px&resize=1000%2C563"
      ],
      "datePublished": "2026-02-18T18:30:00.000Z",
      "dateModified": "2026-02-18T18:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Academy Sci-Tech Awards Announce 27 Recipients From DreamWorks to Sony Pictures Innovators",
    "url": "https://variety.com/2026/film/awards/academy-scitech-awards-recipients-2026-1236666627/",
    "image": "https://variety.com/wp-content/uploads/2021/11/Oscars-Statue-Placeholder.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-18T19:00:21.000Z",
    "description": "\n\tThe Academy of Motion Picture Arts and Sciences announced that 15 scientific and technical achievements, represented by 27 individual recipients, wi",
    "body": "\n\tThe Academy of Motion Picture Arts and Sciences announced that 15 scientific and technical achievements, represented by 27 individual recipients, will be honored at its annual Scientific and Technical Awards ceremony April 28 at the Academy Museum of Motion Pictures.\n\n\tDevelopers behind advancements ranging from safer practical effects and layered shading systems to dialogue restoration and high dynamic range lighting will receive Technical Achievement Awards. Innovators behind three major breakthroughs will accept Scientific and Engineering Awards.\n\t\n\n\t“Their innovation, dedication and technical excellence continue to shape the art and craft of filmmaking,” said Academy CEO Bill Kramer and President Lynette Howell Taylor.\n\n\n\tTechnical Achievement Awards will be presented to Brent Bell, Josef Köhler and Ian Medwell for developing lead-free pyrotechnic devices used in practical bullet effects, a safer and more environmentally conscious alternative for on-set stunts. Andrea Weidlich and Luca Fascione are being recognized for their work on layered material systems in Wētā FX’s Manuka renderer, which has improved the realism and flexibility of visual effects workflows. Vincent Dedun, Emmanuel Turquin and Jonathan Moulin will be honored for “Lama,” Industrial Light & Magic’s layered shading system that enables artists to create complex, physically plausible appearances without writing shader code.\n\n\tAdditional honorees include Josh Bainbridge and Nathan Walster for Framestore’s layered shading system. Bret St. Clair, Marc-Andre Davignon, Pav Grochola and Edmond Boulet-Gilly will be honored for animation linework and brushing tools at Sony Pictures Imageworks, expanding creative possibilities for large-scale animated productions. Baptiste Van Opstal, Jeff Budsberg, Michael Losure, John Lanz and Eszter Offertaler are being recognized for DreamWorks Animation’s stylized animation toolset, a suite of tools that allows for painterly effects and diverse art styles.\n\t\n\n\tOther Technical Achievement Award recipients include Benjamin Graf for the dxRevive Pro dialogue restoration system, which preserves the emotional fidelity of on-set performances; John Ellwood and Jeff Bloom for Titan auto-assembly software that streamlines digital audio alignment; Marc Joel Specter for the Kraken Dialogue Editors Toolkit, which facilitates precise audio assembly; and Justin Webster for Matchbox, a system for rapid audio-video reconform. Paul Debevec also is being recognized for pioneering high dynamic range, image-based lighting techniques that have transformed computer-generated imagery in feature films.\n\n\tJamie Caliri and Dyami Caliri will receive a Scientific and Engineering Award for the design, engineering and ongoing development of “Dragonframe” software, which has transformed stop-motion animation workflows.\n\n\t“Whether through enhancing the safety of practical effects with lead-free bullet hits or pushing the limits of stop-motion animation and sound restoration, these technologies are now fundamental to the craft. We are honored to recognize the brilliant minds behind these tools, which continue to elevate the moviegoing experience,” said Darin Grant and Rachel Rose, co-chairs of the Academy’s Scientific and Technical Awards Committee.\n\n\tThe final Oscar voting for this year’s 98th nominations will take place from Feb. 26 to March 5. The Oscars will be held March 15 and will air on ABC, hosted by Conan O’Brien.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Academy Sci-Tech Awards Announce 27 Recipients From DreamWorks to Sony Pictures Innovators",
      "image": [
        "https://variety.com/wp-content/uploads/2021/11/Oscars-Statue-Placeholder.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-18T19:00:21.000Z",
      "dateModified": "2026-02-18T19:00:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jason Concepcion Hosts ‘Wait a Second…’ Video Podcast From Spotify’s The Ringer About Conspiracy Theories, True Crime and More: ‘Stories That Make You Say What the F—‘",
    "url": "https://variety.com/2026/digital/news/jason-concepcion-wait-a-second-podcast-spotify-the-ringer-conspiracy-theories-1236666636/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Jason-Concepcion-Wait-a-Second.png?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-18T18:40:12.000Z",
    "description": "\n\tSpotify’s The Ringer is taking a deep dive into tinfoil-hat territory with “Wait a Second…,” a new video podcast hosted by writer and podcaster Jaso",
    "body": "\n\tSpotify’s The Ringer is taking a deep dive into tinfoil-hat territory with “Wait a Second…,” a new video podcast hosted by writer and podcaster Jason Concepcion and featuring The Ringer’s Tyler Parker as co-host.\n\n\t“Wait a Second…” premieres Feb. 19 on Spotify, Apple Podcasts, YouTube and other platforms. It will be released weekly on Thursdays. In each episode, Concepcion and Parker will unpack a bizarre news item or conspiracy theory that “we can’t stop talking about” and unpack “what actually happened, why it captured public attention and what it reveals about the society we live in,” per The Ringer. “The show treats these stories with genuine curiosity and intellectual rigor, while also embracing the absurdity and accidental comedy that make them spread in the first place.”\n\t\n\n\tConcepcion and Parker will be joined by a rotating group of personalities from The Ringer, along with occasional outside experts and “oddballs.” Topics on “Wait a Second…” are set to include the Louvre heist, developments in the Jeffrey Epstein files release, unexplained radio signals coming from beneath the Antarctic ice, historical deep dives on stories like the JFK assassination and government coverups, and more.\n\n\n\t“It’s a dark and twisted world, and we’re here to try and make sense of it,” Concepcion says in the podcast’s trailer. “We’re exploring the grim rabbit holes and weird webs that connect our modern world. Each week, my co-host Tyler Parker and will tackle the kind of stories that make you say ‘What the fuck?!'”\n\n\tSpotify has a licensing deal with Netflix for video versions of a range of original podcasts, but currently “Wait a Second…” is not slated for the Netflix queue.\n\t\n\n\tThe “Wait a Second…” podcast is Concepcion’s first project with Bill Simmons’ The Ringer, which was acquired by Spotify in 2020, in five years.\n\n\tConcepcion is a screenwriter and pop culture and sports commentator. He is the co-producer and co-host of “The Official Game of Thrones Podcast: House of the Dragon” with Greta Johnson for HBO, and hosts weekly pop-culture show “X-Ray Vision” with Rosie Knight. He has also hosted official companion podcasts for “Foundation” (Apple TV) and “3 Body Problem” (Netflix). Previously a senior creative at The Ringer, Concepcion co-hosted podcasts “Talk the Thrones” and “Binge Mode.” In 2019, he won a Sports Emmy for digital series “NBA Desktop.”\n\n\tParker, a staff writer at The Ringer, co-created series including “Takehunter” and “The Parker Tyles Show.” He also has been a regular contributor to podcasts such as “The Ringer NBA Show” and “The Hottest Take.”\n\n\tWatch the trailer for “Wait a Second…”:\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jason Concepcion Hosts ‘Wait a Second…’ Video Podcast From Spotify’s The Ringer About Conspiracy Theories, True Crime and More: ‘Stories That Make You Say What the F—‘",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Jason-Concepcion-Wait-a-Second.png?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-18T18:40:12.000Z",
      "dateModified": "2026-02-18T18:40:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘A New Dawn’: Director Yoshitoshi Shinomiya Talks About His One-of-a-Kind Japanese-French Anime Berlin Golden Bear Contender",
    "url": "https://variety.com/2026/film/global/a-new-dawn-yoshitoshi-shinomiya-japanese-french-anime-1236666669/",
    "image": "https://variety.com/wp-content/uploads/2026/02/202602554_1.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-18T18:41:01.000Z",
    "description": "\n\tIt all starts with a line. In “A New Dawn,” Yoshitoshi Shinomiya’s directorial debut feature world premiering at the Berlinale as part of the main c",
    "body": "\n\tIt all starts with a line. In “A New Dawn,” Yoshitoshi Shinomiya’s directorial debut feature world premiering at the Berlinale as part of the main competition, animation is born out of its very essence: swift lines and bold brush strokes leaping through the screen, echoing the fireworks that Obinata firework factory created for decades. \n\n\tNow set for an administrative shutdown tomorrow as a major road is planned to be extended directly through the premises, the house located in a lush forest is the main stage of this coming-of-age tale of three childhood friends. A story rooted deep in Japanese culture with a universal appeal, tackling themes of family legacy, childhood bonds and the impact of climate change and untamed urban development against nature and culture. \n\t\n\n\tAhead of the film’s premiere, Variety spoke with Shinomiya about what it meant for him to be present at this global event. \n\n\n\tTrained as a painter in the traditional Japanese style, Shynomiya started his career in animation collaborating on films including Makoto Shinkai’s “Your Name” and Sunao Katabuchi’s “In This Corner of the World,” as well as anime project “Tokino Crossing” and the music video “Adventure Squad: Mori no Yusha”.\n\n\tAll these experiences are vividly present in this first feature, which brings animation back in the Berlinale competition. “To be frank, I wasn’t sure that we would finish the movie in time,” confessed Shinomiya. “but I am delighted to be in Berlin, and to be able to present the film at the festival. I was told it’s very rare to have an animated feature selected here [the previous occurrence was Liu Jian’s chinese animated feature ‘Art College 1994’ in 2023], and I would be very happy if we can, in some way, lay the groundwork for more animation creators.” \n\t\n\n\tCrafted by a (very) small team of artists, “A New Dawn”is also singular as one of the few Japanese-French animated co-productions, brought forth by French indie animation powerhouse Studio Miyu, involved in so much of the great animation coming out of Europe. \n\n\t“It was an interesting collaboration, because the French teams have a very different way of working, or a different approach to animation than the Japanese teams.” Miyu worked on the stop motion animation scenes, and although there were some differences, Shinomiya underlined that the French side had a very good or deep understanding of Japanese culture, which they managed to skilfully insert in the behavior of the characters in that specific sequence. “Of course, working on such a co-production brings a level of uncontrollability. But I would say that through this uncontrollability, we were able to broaden our horizons as well.” \n\n\tExpanding one’s perspective is also at the heart of Shinomiya’s story, set in a picturesque town not unlike the one the artist grew up in. “My hometown in Kanagawa Prefecture was very close to the sea, but due to land reformation, parts of the sea were destroyed. We also had this traditional fireworks festival in our hometown, which also stopped at some point due to financial reasons. And finally, I was also not able to continue the profession or the work that my parents and also the generations before that had preserved.” \n\n\n\n\t\n\n\t\t\t\t\tYoshitoshi Shinomiya\n\t\t\t\t\t\t\t\t\tCourtesy: Youji Shimizu\n\t\n\n\n\n\tAs the artist (who has been painting since his early age and holds a doctorate in Japanese painting from the Tokyo Graduate School of Fine Arts) became a father himself, he decided it was time to face this past and engage with this story. “It seemed to be the right time for me, to put this emphasis on the past and to focus on people who still try to pass on traditions and unique craftsmanship today, but are prevented from doing that. Even though the protagonists of this movie are quite young, I wanted to bring up these topics through their story because I think that future generations will have to deal more with those issues. Not only energetic or environmental crises, but also the loss of community.”\n\n\tIn luxuriant landscapes, Shinomiya’s trio (voiced by Riku Hagiwara, Kotone Furukawa and Miyu Irino) throw lines at each other with strong alchemy. “It was my first experience directing a voice cast, so I was a bit unsure how it would come out. But I’m glad to hear the result is appreciated and that their relationship translates well on screen. The two actors from the trio were also making their debut as voice actors, but they were very professional and learned very quickly.” \n\t\n\n\tFrom backgrounds to lighting, “A New Dawn” is a subtly grounded film with bursts of visual splendor in which our three main characters Keitaro, Chicchi and Kaoru navigate in quick, poetic and stylish movements. “For animation we took this unique approach of keeping the protagonists or the characters as simple as possible”, explained Shinomiya. “Through very simple lines and colors. So that no matter where you’re from, you can understand the emotions that are conveyed in a very universal way. This choice also refers to traditional East Asian art, and it allowed our small team to focus on more detailed backgrounds.”\n\n\tThe director, who blended animation and live-action before doing commissioned work, also underlined the importance of blending techniques in his own artistic practice. “To me, it’s like a painting that you create with different kinds of ingredients. As an artist who’s not originally an animator. I find it a strength to be able to bring along external elements not directly linked with anime.” \n\n\tOne of those key elements that blends visual techniques as well as a deeper meaning is the ‘Shuhari’, a magnificent almost legendary firework that Keitaro tries to create as the firework’s factory’s swan song. “In Japanese, ‘Shuhari’ refers to the growth of a human being and reflects the philosophy of life and death itself. Our three protagonists are going through these steps in order to move forward. They protect, they break, and then they transcend and decide to start something new. But it also tells about the people who stayed in these small towns, or people who moved to the city. All these different paths are symbolized with the ‘Shuhari’ firework, and how the characters evolve with it. I think everyone can relate to that.” \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘A New Dawn’: Director Yoshitoshi Shinomiya Talks About His One-of-a-Kind Japanese-French Anime Berlin Golden Bear Contender",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/202602554_1.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-18T18:41:01.000Z",
      "dateModified": "2026-02-18T18:41:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "TMZ Streaming Live, Come Into Our Newsroom and Watch Things Happen!",
    "url": "https://www.tmz.com/2026/02/18/watch-tmz-live-today/",
    "image": "https://imagez.tmz.com/image/70/16by9/2026/02/18/70c98161fd6946d4a67bc21580a69f58_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-18T18:00:42.000Z",
    "description": "\n    \n                    \n                          TMZ Live Stream\n                          Come Into Our Office and Watch News Happen!!!\n         ",
    "body": "\n    \n                    \n                          TMZ Live Stream\n                          Come Into Our Office and Watch News Happen!!!\n                      \n                  \n                                                                        Published \n                              February 18, 2026\n                            10:00 AM PST\n                                                                      |\n                                                                Updated \n                                  February 18, 2026\n                                12:15 PM PST\n                                    \n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          We want you to be a part of TMZ, so every weekday, between 9:30 AM and 11:30 AM PT, we take you inside our newsroom via live stream.\n      \n    \n          You never know what you're gonna get ... a big story that breaks, an argument erupts in the room, or someone's just joking around.\n      \n    \n          Your comments are a big part of the stream, and the staff spends a lot of time speaking directly to you. Every day is different!\n      \n    \n          We also use our live stream to produce our \"TMZ Live\" TV show.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Live Stream\n              \n                          \n                TMZ Live\n              \n                          \n                Viral\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "TMZ Streaming Live, Come Into Our Newsroom and Watch Things Happen!",
      "image": [
        "https://imagez.tmz.com/image/70/16by9/2026/02/18/70c98161fd6946d4a67bc21580a69f58_xl.jpg"
      ],
      "datePublished": "2026-02-18T18:00:42.000Z",
      "dateModified": "2026-02-18T18:00:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'Robocop 2' Actor Tom Noonan Dead at 74",
    "url": "https://www.tmz.com/2026/02/18/actor-tom-noonan-dead/",
    "image": "https://imagez.tmz.com/image/79/16by9/2026/02/18/79a856539adc49ea9be31cc681b958eb_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-18T16:45:39.000Z",
    "description": "\n    \n                    \n                          'Last Action Hero' Tom Noonan\n                          Actor Dead At 74\n                      \n ",
    "body": "\n    \n                    \n                          'Last Action Hero' Tom Noonan\n                          Actor Dead At 74\n                      \n                  \n                                                                        Published \n                              February 18, 2026\n                            8:45 AM PST\n                                                                            \n      \n    \n          Tom Noonan -- the longtime actor best known for his roles in \"Last Action Hero\" and \"Robocop 2\" -- has died, TMZ has learned.\n      \n    \n          Noonan died last Saturday, and his death was confirmed by director Fred Dekker, who wrote on Facebook, \"It’s with great sadness that I share the passing of Tom Noonan … Tom’s indelible performance as Frankenstein in THE MONSTER SQUAD is a highlight of my modest filmography, doubtless aided by the masterful make-up designed by Stan Winston, sculpted by Tom Woodruff Jr., and applied by Zoltan Elek.\"\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Dekker's lengthy statement also included some memories from their time working on \"The Monster Squad\" ... before ending with, \"he was the proverbial gentleman and scholar, and the world has lost a great talent. R.I.P. Tom. Thanks for the great work.\"\n      \n\n          His cause of death has not been released.\n      \n    \n          In 1980, Noonan launched his film acting career in the romantic comedy \"Willie & Phil,\" playing a small role as Man In Park. After that, he took on mainly villainous roles because of his imposing figure, standing 6-foot-5. \n      \n    \n          Noonan played Cain in \"RoboCop2,\" Ripper in \"Last Action Hero,\" Francis Dollarhyde in \"Manhunter,\" and Gary Jackson in \"The Pledge\" ... to name just a few of his wicked parts.\n      \n    \n          He also played Kelso in \"Heat,\" Mr. Ulman in \"The House of the Devil,\" Ray Gullikson in \"The Alphabet Killer,\" and Sammy Barnathan in \"Synecdoche, New York.\"\n      \n    \n          Furthermore, Noonan starred in several notable TV series, including \"The X-Files,\" \"Law & Order: Criminal Intent,\" \"Tales From The Darkside,\" and \"CSI: Crime Scene Investigation.\"\n      \n    \n          Tom was 74.\n      \n    \n          RIP\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Movies\n              \n                          \n                Celebrity Death\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Robocop 2' Actor Tom Noonan Dead at 74",
      "image": [
        "https://imagez.tmz.com/image/79/16by9/2026/02/18/79a856539adc49ea9be31cc681b958eb_xl.jpg"
      ],
      "datePublished": "2026-02-18T16:45:39.000Z",
      "dateModified": "2026-02-18T16:45:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kylie Jenner & Timothée Chalamet Kiss During Intimate Pizza Date",
    "url": "https://www.tmz.com/2026/02/18/kylie-jenner-and-timothee-chalamet-kiss-over-pizza/",
    "image": "https://imagez.tmz.com/image/a3/16by9/2026/02/18/a3f99706bcf544e6b2b3334c1ba28b0b_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-18T20:15:12.000Z",
    "description": "\n    \n                    \n                          Kylie Jenner & Timothée Chalamet\n                          Love at First Bite!!!\n                ",
    "body": "\n    \n                    \n                          Kylie Jenner & Timothée Chalamet\n                          Love at First Bite!!!\n                      \n                  \n                                                                        Published \n                              February 18, 2026\n                            12:15 PM PST\n                                                                            \n      \n    \n          Timothée Chalamet and Kylie Jenner were like high school sweethearts Tuesday night ... we got shots of them making out during a pizza date in L.A.\n      \n    \n          Check out the pics ... the couple got shelter from the Southern California rain inside a pizzeria ... and we're told the spot locked its doors to all other customers.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          The two looked so in love as they sat at the counter devouring some 'za ... and each other!\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Photogs were able to grab some pretty steamy shots of the pair locking lips.\n      \n    \n          It's winter in L.A., but these two know how to keep it hot ... That's amore!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Timothee Chalamet\n              \n                          \n                Kylie Jenner\n              \n                          \n                Celebrity News\n              \n                          \n                Relationships\n              \n                          \n                PDA\n              \n                          \n                The Kardashians\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kylie Jenner & Timothée Chalamet Kiss During Intimate Pizza Date",
      "image": [
        "https://imagez.tmz.com/image/a3/16by9/2026/02/18/a3f99706bcf544e6b2b3334c1ba28b0b_xl.jpg"
      ],
      "datePublished": "2026-02-18T20:15:12.000Z",
      "dateModified": "2026-02-18T20:15:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bryan Kohberger's Murder Scene: See the Victims' Possessions",
    "url": "https://www.tmz.com/2026/02/18/bryan-kohberger-murder-scene-photos-of-victims-possessions/",
    "image": "https://imagez.tmz.com/image/88/16by9/2026/02/18/88f9ad992515493788abac3ac76ede4f_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-18T19:07:46.000Z",
    "description": "\n    \n                    \n                          Bryan Kohberger\n                          Slaughter House Pics Show Victims' Undisturbed Possessi",
    "body": "\n    \n                    \n                          Bryan Kohberger\n                          Slaughter House Pics Show Victims' Undisturbed Possessions\n                      \n                  \n                                                                        Published \n                              February 18, 2026\n                            11:07 AM PST\n                                                                            \n      \n    \n          The 4 University of Idaho students slaughtered by Bryan Kohberger left behind almost everything they owned inside their house ... and now we're seeing haunting images of their possessions -- seemingly undisturbed -- in the hours after they were slain.\n      \n    \n          Tuesday, Idaho State Police released more than 2,000 photos related to the murder case, showing the crime scene after investigators arrived at the house in Moscow, Idaho, where the 4 students were butchered by a knife-wielding Kohberger in September 2022. Madison Mogen, Kaylee Goncalves, Ethan Chapin, and Xana Kernodle were all found stabbed to death in bedrooms.\n      \n    \n          As part of the photo dump, investigators snapped pics of the victims' everyday stuff, such as ID, credit cards, clothes, books, silverware, shoes, backpacks, medications, hair products, picture frames, card holder and much more.\n      \n\n                  \n          \n                          \n                \n                  \n      \n    \n          It's all very haunting in the context of what happened to these 4 young souls at the hands of Kohberger. Even more chilling ... we can all identify with every one of these everyday items, which makes it hit too close to home.\n      \n    \n          In July 2025, Kohberger pleaded guilty to murdering each of the victims under a plea deal that took the death penalty off the table and sent him to prison for the rest of his life.\n      \n    \n          Good riddance!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Bryan Kohberger\n              \n                          \n                Crime\n              \n                          \n                News\n              \n                          \n                True Crime\n              \n                          \n                Bryan Kohberger Trial\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bryan Kohberger's Murder Scene: See the Victims' Possessions",
      "image": [
        "https://imagez.tmz.com/image/88/16by9/2026/02/18/88f9ad992515493788abac3ac76ede4f_xl.jpg"
      ],
      "datePublished": "2026-02-18T19:07:46.000Z",
      "dateModified": "2026-02-18T19:07:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'TMZ After Dark': Shelby Carter, Jerrie Johnson Host Double Valentine's Buses",
    "url": "https://www.tmz.com/2026/02/18/after-dark-valentines-day-shelby-carter-jerrie-johnson-host/",
    "image": "https://imagez.tmz.com/image/5f/16by9/2026/02/16/5fbd35f221924de48764e2363f2d2698_xl.png",
    "tag": "Entertainment",
    "date": "2026-02-18T18:27:22.000Z",
    "description": "\n                            \n                          'TMZ After Dark'\n                          Double the Trouble, Double the Love!!!\n            ",
    "body": "\n                            \n                          'TMZ After Dark'\n                          Double the Trouble, Double the Love!!!\n                      \n                  \n                                                                        Published \n                              February 18, 2026\n                            10:27 AM PST\n                                                                            \n              \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          \"TMZ After Dark\" kept the love buzz rolling deep into the night ... doubling the trouble with two party buses taking over Hollywood Saturday, led by actress Jerrie Johnson on one and singer Shelby Carter on the other!\n      \n    \n          Catch the clip -- 'cause this wasn’t just any ol' Valentine's Day ride, it was a rolling party ... with DJ Coach West blasting nonstop heat that kept the energy sky-high whether you showed boo'd up or flew solo.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Jerrie’s bus pulled up to hot spots like Power House and Beaches WeHo -- and she wasn’t just hosting -- she was dancing, vibing, and turning the whole thing into her personal dance floor with fans along for the ride.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Over on Shelby’s bus, she brought the full star treatment -- paps onboard, red-carpet vibes, and stops at The Burgundy Room, Rainbow Bar & Grill, and Sunset speakeasy, Puzzle ... where she gave a private performance of her new single \"Roses,\" all while Smashburger kept everyone fed.\n      \n\n                  \n          \n                          \n                \n                                  \n      \n    \n          Holding down the sound for Shelby’s takeover for the evening was the amazingly talented DJ Teo -- so if you want a similar experience, grab your \"TMZ After Dark\" tickets here!\n      \n      ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'TMZ After Dark': Shelby Carter, Jerrie Johnson Host Double Valentine's Buses",
      "image": [
        "https://imagez.tmz.com/image/5f/16by9/2026/02/16/5fbd35f221924de48764e2363f2d2698_xl.png"
      ],
      "datePublished": "2026-02-18T18:27:22.000Z",
      "dateModified": "2026-02-18T18:27:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]