[
  {
    "title": "‘Succession’ Star Hiam Abbass Says Making Movies Like ‘Palestine 36’ Is ‘More Than an Artistic Choice’ — ‘It’s a Duty’",
    "url": "https://variety.com/2026/film/global/succession-hiam-abbass-palestine-36-rotterdam-1236648437/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Hiam-Abbass.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-01T20:08:02.000Z",
    "description": "\n\tPalestinian actor Hiam Abbass spoke about the “duty” of starring in films such as Annemarie Jacir’s “Palestine 36” during an in-depth career talk al",
    "body": "\n\tPalestinian actor Hiam Abbass spoke about the “duty” of starring in films such as Annemarie Jacir’s “Palestine 36” during an in-depth career talk alongside Italian actor Valelria Golino (“Rain Man”) at the International Film Festival Rotterdam on Sunday. The “Succession” star said being a part of the historical film felt like “a duty” when “Palestinian history every day is threatened to be erased and forgotten.”\n\n\t“When you are born in a struggle, sometimes you don’t make the difference between the artistic and the duty in a way. And [‘Palestine 36’] is one of the examples.” Abbass brought up another recent example in “Bye Bye Tiberias,” directed by her daughter, Lina Soualem, and examining Abbass’s life following her departure from Palestine. “Both movies for me are almost a visit into the history that I inherited.”\n\t\n\n\t“Palestine 36” premiered at the Toronto Film Festival last year and is set in the year 1936 in a Palestinian village that revolts against British colonial rule. In his Variety review, Murtada Elfadl praised the historical epic: “It’s grand in scale, ambitious in storytelling and balanced in the way it pays equal attention to historical scope and detailed characterization. Palestine’s entry to the Oscars has a lot of story to tell, but still manages to singularly draw its many characters and to give specificity to its different locations.”\n\n\n\tAbbass met Jacir on the set of “Ramy,” adding that the two “enjoyed each other’s creativity.” When the director expressed a desire to work together, the actor was very quick to say she was up for whatever she brought to her table. \n\t\n\n\t“Just the participation in that movie was important for all of us [who were a part of it],” she went on, talking about “Palestine 36.” “Registering the archives of Palestinian history forever into a movie that will become a future archive in a way was really important.” \n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tCourtesy Toronto Film Festival\n\t\n\n\n\n\tThe film was a notoriously difficult production. Jacir and her team had built a sprawling, complex set to shoot in Palestine, with photography scheduled to begin on October 14, 2023. Obviously, once the war broke out on October 7, production was halted, going on to be postponed several times before eventually relocating to Jordan, where they shot the film at the end of 2024.\n\n\t“We were like: what do we do? We wait one day, two days, three days, two weeks… No one knows what’s happening,” recalls Abbass. “They decided to push for a month or two, and it became worse and worse. The village they had built became a target of the settlers in the West Bank, and it became too risky to bring people back. It was impossible, even insurance-wise.”\n\n\tThe actor relayed the logistical nightmare of trying to fly from her home in Paris to Jordan for the shoot, especially as tensions increased in the region. For months, Abbass would get ready to shoot, just to find out it would not be possible. “I fought to be on set. It was a victory to finally be able to do this movie. Suddenly, you find everybody involved in that movie just thinking and feeling the same way. [I had] never experienced such a victory in [my] artistic life or any works I’ve been involved in. This one is an example of how to survive, basically. It’s more than an artistic choice when it comes to that kind of movie.”\n\n\tElsewhere in the conversation, Abbass spoke about her directorial career, which started in 2001 with the short film “Le Pain.” Her 2012 directorial debut, “Inheritance,” played in Venice, and she went on to direct for television with “Ramy.”\n\n\t“It came to be by some kind of necessity,” she said of the impulse to direct. “I moved out of Palestine, went to London and settled in Paris because of a love story. Then I became a mother, because it was very important to me to give time to that as well. I really thought as a mother, as a woman, I really have things to say. How long can you sit and wait for the part to come to you when you have so much to say about life?”\n\t\n\n\tTo this day, Abbass has only directed one feature film. Does she have any future plans for a sophomore effort? “I don’t have the time,” she said. “Acting didn’t give me the possibility of sitting and writing and creating, and I didn’t want to just do it to do it. I have a few stories lined up but I’m not in a rush.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Succession’ Star Hiam Abbass Says Making Movies Like ‘Palestine 36’ Is ‘More Than an Artistic Choice’ — ‘It’s a Duty’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Hiam-Abbass.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-01T20:08:02.000Z",
      "dateModified": "2026-02-01T20:08:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NHL Stadium Series 2026 Livestream: How to Watch Boston Bruins vs. Tampa Bay Lightning Online Without Cable for Free",
    "url": "https://variety.com/2026/shopping/news/how-to-watch-nhl-stadium-series-online-livestream-1236319901/",
    "image": "https://variety.com/wp-content/uploads/2025/03/NFL-Boston-Bruins-vs.-Tampa-Bay-Lightning-VR-Featured.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-01T20:00:14.000Z",
    "description": "\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.\n\n\tThe NHL S",
    "body": "\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.\n\n\tThe NHL Stadium Series 2026 features two NHL Atlantic Division rivals battling for ice cold glory on Sunday, Feb. 1.\n\n\tThe outdoor pro hockey game has the Boston Bruins (32-20-3) taking on the Tampa Bay Lightning (34-14-4) at Raymond James Stadium in Tampa, Florida. Puck drop is at 6:30 p.m. ET/3:30 p.m. PT.\n\n\tAlthough Tampa Bay is at the top of the conference, Boston is on the hunt for a wild card spot for the playoffs this season. The Bruins hope to play spoiler to a top-seeded team, while the Lightning are looking to add another Stanley Cup to their collection. The 2025-26 season is probably the best chance for the Lightning to return to the finals since 2022. Look for Tampa Bay to bring the heat on the ice against the Bruins for this game, especially since it’s at home and it’s a special outdoor game.\n\n\n\tThe NHL Stadium Series broadcasts live on ESPN, as well as livestreams simultaneously on ESPN Unlimited for subscribers only?\n\n\tNot a subscriber? Sign up now for ESPN Unlimited for just $29.99/month and get instant access to watch the pro hockey game live online from home. Aside from NHL Stadium Series, ESPN Unlimited is home to all things ESPN with access to all of its networks and streaming services, like ESPN, ESPN2, ESPN3, ESPNU, ESPNEWS, ESPN on ABC, ESPN Deportes, ESPN+, SECN, ACCN, SECN+ and ACCNX.\n\n\t\t\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\t\t\t\tESPN\n\t\n\t\t\t\t\t\n\t\t\n\n\t\t\t\t\tESPN Unlimited\t\t\n\n\t\n\t\tESPN Unlimited includes everything ESPN has to offer, such as ESPN, ESPN on ABC, ESPN2, ESPN3, ESPNU, ESPNEWS and much more.\t\n\t\t\n\t\n\n\tMeanwhile, starting at $35.99/month, you can go with a subscription to the Disney Bundle — which includes ESPN Unlimited, Hulu and Disney+ for one price.\n\n\tCord-cutters can watch the game with any web-based live TV streaming service that carries ESPN, such as DirecTV, Hulu + Live TV, Fubo and Sling TV. Additionally, DirecTV, Fubo and Hulu + Live TV offer free trials, while Sling TV does not.\n\n\n\t\t\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\t\t\t\tDirecTV\n\t\n\t\t\t\t\t\n\t\t\n\n\t\t\t\t\tDirecTV \t\t\n\n\t\n\t\tDirecTV is one of the best ways for cable-cutters to access live sports and TV from home. \t\n\t\t\n\t\n\n\tStarting at $69.99/month, you get access to the streamer’s “MySports” package for NHL Stadium Series on ESPN, as well as more than 20 other sports channels, like FOX, ABC, CBS, NBC, FOX Sports, TNT and others. The package even comes ESPN Unlimited too.\n\n\t\t\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\t\t\t\tSling TV\n\t\n\t\t\t\t\t\n\t\t\n\n\t\t\t\t\tSling TV\t\t\n\n\t\n\t\tSling is one of the best options for affordable live streaming with the Sling Orange package going for $45.99 per month. \t\n\t\t\n\t\n\n\tThe package includes ESPN. Please note: Pricing and channel availability are subject to your local TV market.\n\n\t\t\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\t\t\t\tFubo\n\t\n\t\t\t\t\t\n\t\t\n\n\t\t\t\t\tFubo\t\t\n\n\t\n\t\tFubo is one of the best options for streaming NHL Stadium Series online, while the service features ESPN.\t\n\t\t\n\t\n\n\tIt even has more than 200 live TV channels for cable-free streaming. The streamer offers a 5-day free trial to try out the service before you commit.\n\n\t\t\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\t\t\t\tHulu\n\t\n\t\t\t\t\t\n\t\t\n\n\t\t\t\t\tHulu + Live TV\t\t\n\n\t\n\t\tPlans start at $89.99/month.\t\n\t\t\n\t\n\n\tHulu + Live TV is a great option for live channel streaming NHL Stadium Series with access to ESPN, along with more than 95 other channels, as well as access to hit originals on Disney+, Hulu and ESPN Unlimited.\n\n\tLast-minute tickets to the game are still available on TicketNetwork, VividSeats and SeatGeek. In fact, you can save $150 off when you spend $500 with promo code VARIETY150, or $300 off when you spend $1,000 with promo code VARIETY300 at TicketNetwork.com.\n\n\tYou can use code VAR30 to take $20 off your ticket purchase at VividSeats.com, or you can use promo code VARIETY10 to save $10 at SeatGeek.com.\n\n\tThe 2026 NHL Stadium Series: Boston Bruins vs. Tampa Bay Lightning game is live from Raymond James Stadium in Tampa, Florida and broadcasts on ESPN starting at 6:30 p.m. ET/3:30 p.m. PT.\n\n\tThe best ways to watch the game online without cable is with ESPN Unlimited and DirecTV.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NHL Stadium Series 2026 Livestream: How to Watch Boston Bruins vs. Tampa Bay Lightning Online Without Cable for Free",
      "image": [
        "https://variety.com/wp-content/uploads/2025/03/NFL-Boston-Bruins-vs.-Tampa-Bay-Lightning-VR-Featured.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-01T20:00:14.000Z",
      "dateModified": "2026-02-01T20:00:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Grammys Winners 2026 (Updating Live)",
    "url": "https://variety.com/2026/music/awards/grammys-winners-list-1236642224/",
    "image": "https://variety.com/wp-content/uploads/2020/01/grammy-2.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-01T20:00:00.000Z",
    "description": "\n\tThe music industry’s biggest night is underway, as the 2026 Grammys are awarding the top songs and artists of the year. This year, the Recording Aca",
    "body": "\n\tThe music industry’s biggest night is underway, as the 2026 Grammys are awarding the top songs and artists of the year. This year, the Recording Academy is presenting trophies in 95 categories. Only nine of those are expected to awarded on the prime-time telecast, which begins at 8 p.m. ET/5 PT. The other 86 are being given out in the pre-telecast “premiere ceremony,” which begins at 3:30 ET/12:30 PT and is expected to last for about three and a half hours.\n\t\n\n\tVariety will update all the winners in both the afternoon and evening ceremonies. Scroll down for a complete list of the nominees in this year’s 95 categories, with the winners marked in bold as they are announced.\n\n\n\tKendrick Lamar leads the way with nine nominations for his hit album “GNX” and song “Luther.” He’s posed to surpass Jay-Z as the most-awarded rapper in Grammys history if he takes home four awards. With her “Mayhem” album and “Abracadabra” single, Lady Gaga follows with seven nominations, tied with producers Jack Antonoff and Cirkut.\n\n\n\tBest new artist nominee Leon Thomas scored six nods, and he’s up against Olivia Dean, Katseye, the Marias, Addison Rae, Sombr, Alex Warren and Lola Young in the category. Bad Bunny, who’s set to perform at the Super Bowl halftime show next week, and Sabrina Carpenter are also nominated for six awards. They’re both up for the top three categories — album, record and song of the year — alongside Lamar and Gaga.\n\n\tTrevor Noah is hosting the ceremony for the sixth and final time. The Grammys will air on CBS and Paramount+ with a live broadcast and stream starting at 8 p.m. ET/5 PT.\n\t\n\n\tRecord of the Year\n\n\t“DtMF” – Bad Bunny“Manchild” – Sabrina Carpenter“Anxiety” – Doechii“Wildflower” – Billie Eilish“Abracadabra” – Lady Gaga“Luther” – Kendrick Lamar With SZA“The Subway” – Chappell Roan“APT.” – Rosé, Bruno Mars\n\n\tAlbum of the Year\n\n\tDebí Tirar Más Fotos – Bad BunnySwag – Justin BieberMan’s Best Friend – Sabrina CarpenterLet God Sort Em Out – Clipse, Pusha T & MaliceMayhem – Lady GagaGNX – Kendrick LamarMutt – Leon ThomasChromakopia – Tyler, the Creator\n\n\tSong of the Year\n\n\t“Abracadabra” – Lady Gaga, Henry Walter & Andrew Watt, songwriters (Lady Gaga)“Anxiety” – Jaylah Hickmon, songwriter (Doechii)“APT.” – Amy Allen, Christopher Brody Brown, Rogét Chahayed, Omer Fedi, Philip Lawrence, Bruno Mars, Chae Young Park, Theron Thomas & Henry Walter, songwriters (Rosé, Bruno Mars)“DtMF” – Marco Daniel Borrero, Scott Dittrich, Benjamin Falik, Benito Antonio Martínez Ocasio, Hugo René Sención Sanabria, Tyler Thomas Spry & Roberto José Rosado Torres, songwriters (Bad Bunny)“Golden [From “KPop Demon Hunters”]” – EJAE & Mark Sonnenblick, songwriters (HUNTR/X: EJAE, Audrey Nuna, Rei Ami)“Luther” – Jack Antonoff, Roshwita Larisha Bacha, Matthew Bernard, Scott Bridgeway, Sam Dew, Ink, Kendrick Lamar, Solána Rowe, Mark Anthony Spears & Kamasi Washington, songwriters (Kendrick Lamar With SZA)“Manchild” – Amy Allen, Jack Antonoff & Sabrina Carpenter, songwriters (Sabrina Carpenter)“Wildflower” – Billie Eilish O’Connell & Finneas O’Connell, songwriters (Billie Eilish)\n\n\tBest New Artist\n\n\tOlivia DeanKatseyeThe MariasAddison RaeSombrLeon ThomasAlex WarrenLola Young\n\n\tProducer of the Year, Non-Classical\n\n\tDan AuerbachCirkutDijonBlake MillsSounwave\n\n\tSongwriter of the Year, Non-Classical\n\n\tAmy AllenEdgar BarreraJessie Jo DillonTobias Jesso Jr.Laura Veltz\n\n\tBest Pop Solo Performance\n\n\t“Daisies” — Justin Bieber“Manchild” — Sabrina Carpenter“Disease” — Lady Gaga“The Subway” — Chappell Roan“Messy” — Lola Young\n\n\tBest Pop Duo/Group Performance\n\n\t“Defying Gravity” – Cynthia Erivo & Ariana Grande“Golden [From “KPop Demon Hunters”]” – HUNTR/X: EJAE, Audrey Nuna, Rei Ami“Gabriela” – Katseye“APT.” – Rosé, Bruno Mars“30 for 30” – SZA With Kendrick Lamar\n\t\n\n\tBest Pop Vocal Album\n\n\tSwag – Justin BieberMan’s Best Friend – Sabrina CarpenterSomething Beautiful – Miley CyrusMayhem – Lady GagaI’ve Tried Everything But Therapy (Part 2) – Teddy Swims\n\n\tBest Dance/Electronic Recording\n\n\t“No Cap” — Disclosure & Anderson .Paak“Victory Lap” — Fred Again.., Skepta, & PlaqueBoyMax“Space Invader” — Kaytranada“Voltage” — Skrillex“End of Summer” — Tame Impala\n\n\tBest Dance Pop Recording\n\n\t“Bluest Flame” – Selena Gomez & Benny Blanco“Abracadabra” — Lady Gaga“Midnight Sun” – Zara Larsson“Just Keep Watching (From “F1 The Movie”)”“Illegal” – PinkPantheress\n\n\tBest Dance/Electronic Album‘Eusexua — FKA TwigsTen Days — Fred Again..Fancy That — PinkPantheressInhale / Exhale — Rüfüs Du SolF*** U Skrillex You Think Ur Andy Warhol But Ur Not!! <3 — Skrillex\n\n\tBest Remixed Recording\n\n\t“Abracadabra (Gesaffelstein Remix)” — Gesaffelstein, remixer (Lady Gaga, Gesaffelstein)“Don’t Forget About Us” — Kaytranada, remixer (Mariah Carey & Kaytranada)“A Dreams A Dream – Ron Trent Remix” — Ron Trent, remixer (Soul II Soul)“Galvanize” — Chris Lake, remixer (The Chemical Brothers & Chris Lake)“Golden – David Guetta REM/X” — David Guetta, remixer (HUNTR/X: EJAE, AudreyNuna, Rei Ami)\n\n\tBest Rock Performance\n\n\t“U Should Not Be Doing That” — Amyl and the Sniffers“The Emptiness Machine” — Linkin Park“Never Enough” — Turnstile“Mirtazapine” — Hayley Williams“Changes (Live From Villa Park) Back to the Beginning” — Yungblud Featuring Nuno Bettencourt, Frank Bello, Adam Wakeman, II\n\n\tBest Metal Performance\n\n\t“Night Terror” — Dream Theater“Lachryma” — Ghost“Emergence” — Sleep Token“Soft Spine” —Spiritbox“Birds” — Turnstile\n\n\tBest Rock Song\n\n\t“As Alive as You Need Me to Be” – Trent Reznor & Atticus Ross, songwriters (Nine Inch Nails)“Caramel” – Vessel1 & Vessel2, songwriters (Sleep Token)“Glum” – Daniel James & Hayley Williams, songwriters (Hayley Williams)“Never Enough” – Daniel Fang, Franz Lyons, Pat McCrory, Meg Mills & Brendan Yates, songwriters (Turnstile)“Zombie” – Dominic Harrison & Matt Schwartz, songwriters (Yungblud)\n\t\n\n\tBest Rock Album\n\n\tPrivate Music — DeftonesI Quit — HaimFrom Zero — Linkin ParkNever Enough — TurnstileIdols — Yungblud\n\n\tBest Alternative Music Performance\n\n\t“Everything Is Peaceful Love” — Bon Iver“Alone” — The Cure“Seein’ Stars” —Turnstile“Mangetout” — Wet Leg“Parachute” — Hayley Williams\n\n\tBest Alternative Music Album\n\n\tSable, Fable – Bon IverSongs of a Lost World – The CureDon’t Tap the Glass – Tyler, the CreatorMoisturizer – Wet LegEgo Death at a Bachelorette Party – Hayley Williams\n\n\tBest R&B Performance\n\n\t“Yukon” – Justin Bieber“It Depends” – Chris Brown Featuring Bryson Tiller“Folded” – Kehlani“Mutt (Live From NPR’s Tiny Desk)” – Leon Thomas“Heart of a Woman” – Summer Walker\n\n\tBest Traditional R&B Performance\n\n\t“Here We Are” — Durand Bernarr“Uptown” — Lalah Hathaway“Love You Too” — Ledisi“Crybaby” — SZA“Vibes Don’t Lie” — Leon Thomas\n\n\tBest R&B Song\n\n\t“Folded” — Darius Dixson, Andre Harris, Kehlani Parrish, Donovan Knight, Don Mills, Khris Riddick-Tynes & Dawit Kamal Wilson, songwriters (Kehlani)“Heart of a Woman” — David Bishop & Summer Walker, songwriters (Summer Walker)“It Depends” — Nico Baran, Chris Brown, Ant Clemons, Ephrem Lopez Jr., Ryan Press, Bryson Tiller, Elliott Trent & Dewain Whitmore Jr., songwriters (Chris Brown FeaturingBryson Tiller)“Overqualified” — James John Abrahart Jr & Durand Bernarr, songwriters (Durand Bernarr)“Yes It Is” — Jariuce Banks, Lazaro Andres Camejo, Mike Hector, Peter Lee Johnson, Rodney Jones Jr., Ali Prawl & Leon Thomas, songwriters (Leon Thomas)\n\n\tBest Progressive R&B Album\n\n\tBloom — Durand BernarrAdjust Brightness — BilalLove on Digital — Destin ConradAccess All Areas — FloCome as You Are — Terrace Martin & Kenyon Dixon\n\n\tBest R&B Album\n\n\tBeloved— GiveonWhy Not More? — Coco JonesThe Crown — LedisiEscape Room — Teyana TaylorMur — Leon Thomas\n\n\tBest Rap Performance\n\n\t“Outside” — Cardi B“Chains & Whips” — Clipse, Pusha T & Malice Featuring Kendrick Lamar &Pharrell Williams“Anxiety” — Doechii“TV Off” — Kendrick Lamar Featuring Lefty Gunplay“Darling, I” — Tyler, the Creator Featuring Teezo Touchdown\n\t\n\n\tBest Melodic Rap Performance\n\n\t“Proud of Me” — Fridayy Featuring Meek Mill“Wholeheartedly” — JID Featuring Ty Dolla $ign & 6Lack“Luther” — Kendrick Lamar With SZA“WeMaj” — Terrace Martin & Kenyon Dixon Featuring Rapsody“Somebody Loves Me” — Partynextdoor & Drake\n\n\tBest Rap Song\n\n\t“Anxiety” — Jaylah Hickmon, songwriter (Doechii)“The Birds Don’t Sing” — Gene Elliott Thornton Jr., Terrence Thornton, PharrellWilliams & Stevie Wonder, songwriters (Clipse, Pusha T & Malice Featuring John Legend & Voices of Fire)“Sticky” — Aaron Bolton, Dudley Alexander Duverne, Gloria Woods, Dwayne Carter, Jr., Janae Wherry, Tyler Okonma & Rex Zamor, songwriters (Tyler, the Creator Featuring GloRilla, Sexyy Red & Lil Wayne)“TGIF” — Lucas Alegria, Dillon Brophy, Yakki Davis, Gloria Woods, Jess Jackson, Ronnie Jackson, Mario Mims & Jorge M. Taveras, songwriters (GloRilla)“TV Off” —Jack Antonoff, Larry Jayy, Kendrick Lamar, Dijon McFarlane, Sean Momberger, Mark Anthony Spears & Kamasi Washington, songwriters (Kendrick LamarFeaturing Lefty Gunplay)\n\n\tBest Rap Album\n\n\tLet God Sort Em Out – Clipse, Pusha T & MaliceGlorious – GloRillaGod Does Like Ugly – JIDGNX – Kendrick LamarChromakopia – Tyler, the Creator\n\n\tBest Spoken Word Poetry Album\n\n\tA Hurricane in Heels: healed people don’t act like that (partially recorded live @City Winery & other places) — Queen ShebaBlack Shaman — Marc MarcelPages — Omari Hardwick & Anthony HamiltonSaul Williams meets Carlos Niño & Friends at Treepeople — Saul Williams, Carlos Niño & FriendsWords for Days Vol. 1 — Mad Skillz\n\n\tBest Jazz Performance\n\n\t“Noble Rise” — Lakecia Benjamin Featuring Immanuel Wilkins & Mark Whitfield“Windows – Live” — Chick Corea, Christian McBride & Brian Blade“Peace of Mind / Dreams Come True” — Samara Joy“Four” — Michael Mayo“All Stars Lead to You – Live” — Nicole Zuraitis, Dan Pugach, Tom Scott, Idan Morim,Keyon Harrold & Rachel Eckroth\n\n\tBest Jazz Vocal Album\n\n\tElemental — Dee Dee Bridgewater & Bill CharlapWe Insist 2025! — Terri Lyne Carrington & Christie DashiellPortrait — Samara JoyFly — Michael MayoLive at Vic’s Las Vegas — Nicole Zuraitis, Dan Pugach, Tom Scott, Idan Morim,Keyon Harrold & Rachel Eckroth\n\t\n\n\tBest Jazz Instrumental Album\n\n\tTrilogy 3 (Live) — Chick Corea, Christian McBride & Brian BladeSouthern Nights — Sullivan Fortner Featuring Peter Washington & Marcus GilmoreBelonging — Branford Marsalis QuartetSpirit Fall — John Patitucci Featuring Chris Potter & Brian BladeFasten Up — Yellowjackets\n\n\tBest Large Jazz Ensemble Album\n\n\tOrchestrator Emulator — The 8-Bit Big BandWithout Further Ado, Vol 1 — Christian McBride Big BandLumen — Danilo Pérez & Bohuslän Big BandBasie Rocks! — Deborah Silver & The Count Basie OrchestraLights on a Satellite — Sun Ra ArkestraSome Days Are Better: The Lost Scores — Kenny Wheeler Legacy Featuring the Royal Academy of Music Jazz Orchestra & Frost Jazz Orchestra\n\n\tBest Latin Jazz Album\n\n\tLa Fleur de Cayenne — Paquito D’Rivera & Madrid-New York Connection BandThe Original Influencers: Dizzy, Chano & Chico — Arturo O’Farrill & the Afro Latin Jazz Orchestra Featuring Pedrito Martinez, Daymé Arocena, Jon Faddis, Donald Harrison & Melvis SantaMundoagua – Celebrating Carla Bley — Arturo O’Farrill & the Afro Latin Jazz OrchestraA Tribute to Benny Moré and Nat King Cole — Gonzalo Rubalcaba, Yainer Horta & Joey CalveiroVanguardia Subterránea: Live at The Village Vanguard — Miguel Zenón Quartet\n\n\tBest Alternative Jazz Album\n\n\tHoney From a Winter Stone — Ambrose AkinmusireKeys to the City Volume One — Robert GlasperRide into the Sun — Brad MehldauLive-Action — Nate SmithBlues Blood — Immanuel Wilkins\n\n\tBest Traditional Pop Vocal Album\n\n\tWintersongs — Laila BialiThe Gift of Love — Jennifer HudsonWho Believes in Angels? — Elton John & Brandi CarlileHarlequin — Lady GagaA Matter of Time — LaufeyThe Secret Of Life: Partners, Volume 2 — Barbra Streisand\n\n\tBest Contemporary Instrumental Album\n\n\tBrightside — ARKAIOnes & Twos — Gerald ClaytonBEATrio — Béla Fleck, Edmar Castañeda, Antonio SánchezJust Us — Bob James & Dave KozShayan —Charu Suri\n\n\tBest Musical Theater Album\n\n\tBuena Vista Social ClubDeath Becomes HerGypsyJust In TimeMaybe Happy Ending\n\n\tBest Country Solo Performance\n\n\t“Nose on the Grindstone” – Tyler Childers“Good News” – Shaboozey“Bad as I Used to Be [From “F1 The Movie”]”“I Never Lie” – Zach Top“Somewhere Over Laredo” – Lainey Wilson\n\t\n\n\tBest Country Duo/Group Performance\n\n\t“A Song to Sing” — Miranda Lambert And Chris Stapleton“Trailblazer” — Reba McEntire, Miranda Lambert, Lainey Wilson“Love Me Like You Used to Do” — Margo Price & Tyler Childers“Amen” — Shaboozey & Jelly Roll“Honky Tonk Hall of Fame” — George Strait, Chris Stapleton\n\n\tBest Country Song\n\n\t“Bitin’ List” — Tyler Childers, songwriter (Tyler Childers)“Good News” — Michael Ross Pollack, Sam Elliot Roman & Jacob Torrey, songwriters (Shaboozey)“I Never Lie” — Carson Chamberlain, Tim Nichols & Zach Top, songwriters (Zach Top)“Somewhere Over Laredo” — Andy Albert, Trannie Anderson, Dallas Wilson & Lainey Wilson, songwriters (Lainey Wilson)“A Song to Sing” — Jenee Fleenor, Jesse Frasure, Miranda Lambert & Chris Stapleton, songwriters (Miranda Lambert and Chris Stapleton)\n\n\tBest Traditional Country Album\n\n\tDollar a Day — Charley CrockettAmerican Romance — Lukas NelsonOh What a Beautiful World — Willie NelsonHard Headed Woman — Margo PriceAin’t in It for My Health — Zach Top\n\n\tBest Contemporary Country Album\n\n\tPatterns — Kelsea BalleriniSnipe Hunter — Tyler ChildersEvangeline vs. the Machine — Eric ChurchBeautifully Broken — Jelly RollPostcards From Texas — Miranda Lambert\n\n\tBest American Roots Performance\n\n\t“Lonely Avenue” — Jon Batiste Featuring Randy Newman“Ancient Light” — I’m With Her“Crimson and Clay” — Jason Isbell“Richmond on the James” — Alison Krauss & Union Station“Beautiful Strangers” — Mavis Staples\n\n\tBest Americana Performance\n\n\t“Boom” — Sierra Hull“Poison in My Well” — Maggie Rose & Grace Potter“Godspeed” — Mavis Staples“That’s Gonna Leave a Mark” — Molly Tuttle“Horses” — Jesse Welles\n\n\tBest American Roots Song\n\n\t“Ancient Light” — Sarah Jarosz, Aoife O’Donovan & Sara Watkins, songwriters (I’m With Her)“Big Money” — Jon Batiste, Mike Elizondo & Steve McEwan, songwriters (Jon Batiste)“Foxes in the Snow” — Jason Isbell, songwriter (Jason Isbell)“Middle” — Jesse Welles, songwriter (Jesse Welles)“Spitfire” — Sierra Hull, songwriter (Sierra Hull)\n\n\tBest Americana Album\n\n\tBig Money – Jon BatisteBloom – Larkin PoeLast Leaf on the Tree – Willie NelsonSo Long Little Miss Sunshine – Molly TuttleMiddle – Jesse Welles\n\t\n\n\tBest Bluegrass Album\n\n\tCarter & Cleveland — Michael Cleveland & Jason CarterA Tip Toe High Wire — Sierra HullArcadia — Alison Krauss & Union StationOutrun —The SteeldriversHighway Prayers — Billy Strings\n\n\tBest Traditional Blues Album\n\n\tAin’t Done With the Blues — Buddy GuyRoom on the Porch — Taj Mahal & Keb’ Mo’One Hour Mama: The Blues of Victoria Spivey — Maria MuldaurLook Out Highway — Charlie MusselwhiteYoung Fashioned Ways — Kenny Wayne Shepherd & Bobby Rush\n\n\tBest Contemporary Blues Album\n\n\tBreakthrough — Joe BonamassaPaper Doll — Samantha FishA Tribute to LJK — Eric GalesPreacher Kids — Robert RandolphFamily — Southern Avenue\n\n\tBest Folk Album\n\n\tWhat Did the Blackbird Say to the Crow — Rhiannon Giddens & Justin RobinsonCrown of Roses — Patty GriffinWild and Clear and Blue — I’m With HerFoxes in the Snow — Jason IsbellUnder the Powerlines (April 24 – September 24) — Jesse Welles\n\n\tBest Regional Roots Music Album\n\n\tLive at Vaughan’s — Corey Henry & the Treme FunktetFor Fat Man — Preservation Brass & Preservation Hall Jazz BandChurch of New Orleans — Kyle RousselSecond Line Sunday — Trombone Shorty and New Breed Brass BandA Tribute to the King of Zydeco (Various Artists)\n\n\tBest Gospel Performance/Song\n\n\t“Do It Again” — Kirk Franklin; Kirk Franklin, songwriter“Church” — Tasha Cobbs Leonard, John Legend; Anthony S. Brown, Brunes Charles, Annatoria Chitapa, Kenneth Leonard, Jr., Tasha Cobbs Leonard & Jonas Myrin,songwriters“Still (Live)” — Jonathan McReynolds & Jamal Roberts; Britney Delagraentiss, Jonathan McReynolds, David Lamar Outing III, Orlando Joel Palmer & Terrell DemetriusWilson, songwriters“Amen” — Pastor Mike Jr.; Adia Andrews, Michael McClure Jr., David Lamar Outing II & Terrell Anthony Pettus, songwriters“Come Jesus Come” — Cece Winans Featuring Shirley Caesar\n\n\tBest Contemporary Christian Music Performance/Song\n\n\t“I Know a Name” — Elevation Worship, Chris Brown, Brandon Lake; Hank Bentley, Steven Furtick, Brandon Lake & Jacob Sooter, songwriters“Your Way’s Better” — Forrest Frank; Forrest Frank & Pera, songwriters“Hard Fought Hallelujah” — Brandon Lake With Jelly Roll; Chris Brown, Steven Furtick, Benjamin William Hastings, Jason Bradley Deford & Brandon Lake, songwriters“Headphones” — Lecrae, Killer Mike, T.I.; Tyshane Thompson, Bongo ByTheWay, Michael Render, Lecrae Moore, William Roderick Miller & Clifford Harris, songwriters“Amazing” — Darrel Walls, PJ Morton; PJ Morton & Darrel Walls, songwriters\n\t\n\n\tBest Gospel Album\n\n\tSunny Days — Yolanda AdamsTasha — Tasha Cobbs LeonardLive Breathe Fight — Tamela MannOnly On The Road (Live) — Tye TribbettHeart Of Mine — Darrel Walls, PJ Morton\n\n\tBest Contemporary Christian Music Album\n\n\tChild of God II — Forrest FrankCoritos Vol. 1 — Israel & New BreedKing Of Hearts — Brandon LakeReconstruction — LecraeLet The Church Sing — Tauren Wells\n\n\tBest Roots Gospel Album\n\n\tI Will Not Be Moved (Live) — The Brooklyn Tabernacle ChoirThen Came The Morning — Gaither Vocal BandPraise & Worship: More Than a Hollow Hallelujah — The IsaacsGood Answers — Karen Peck & New RiverBack To My Roots — Candi Staton\n\n\tBest Latin Pop Album\n\n\tCosa Nuestra – Rauw AlejandroBogotá (Deluxe) – Andrés CepedaTropicoqueta – Karol GCancionera – Natalia Lafourcade¿Y ahora qué? – Alejandro Sanz\n\n\tBest Música Urbana Album\n\n\tDeBÍ TiRAR MáS FOToS — Bad BunnyMixteip — J BalvinFERXXO VOL X: Sagrado — FeidNAIKI — Nicki NicoleEUB DELUXE — TruenoSINFÓNICO (En Vivo) —Yandel\n\n\tBest Latin Rock or Alternative Album\n\n\tGenes Rebeldes — AterciopeladosASTROPICAL — Bomba Estéreo, Rawayana, ASTROPICALPAPOTA — CA7RIEL & Paco AmorosoALGORHYTHM — Los WizzardsNovela — Fito Paez\n\n\tBest Música Mexicana Album (Including Tejano)\n\n\tMALA MÍA — Fuerza Regida, Grupo FronteraY Lo Que Viene — Grupo FronteraSin Rodeos — Paola JaraPalabra De To’s (Seca) — Carín LeónBobby Pulido & Friends Una Tuya Y Una Mía – Por La Puerta Grande (En Vivo) — Bobby Pulido\n\n\tBest Tropical Latin Album\n\n\tFotografías — Rubén Blades, Roberto Delgado & OrquestaRaíces — Gloria EstefanClásicos 1.0 — Grupo NicheBingo — Alain PérezDebut y Segunda Tanda, Vol. 2 — Gilberto Santa Rosa\n\n\tBest Global Music Performance\n\n\tEoO — Bad BunnyCantando en el Camino — Ciro HurtadoJERUSALEMA — Angélique KidjoInmigrante Y Que? — Yeisy RojasShrini’s Dream (Live) — ShaktiDaybreak — Anoushka Shankar Featuring Alam Khan & Sarathy Korwar\n\n\tBest African Music Performance\n\n\t“Love” — Burna Boy“With You” — Davido Featuring Omah Lay“Hope & Love” — Eddy Kenzo & Mehran Matin“Gimme Dat” — Ayra Starr Featuring Wizkid“Push 2 Start” — Tyla\n\t\n\n\tBest Global Music Album\n\n\tSounds Of Kumbha — Siddhant BhatiaNo Sign of Weakness — Burna BoyEclairer le monde – Light the World — Youssou N’DourMind Explosion (50th Anniversary Tour Live) — ShaktiChapter III: We Return to Light — Anoushka Shankar Featuring Alam Khan & SarathyKorwarCaetano e Bethânia Ao Vivo — Caetano Veloso and Maria Bethânia\n\n\tBest Reggae Album\n\n\tTreasure Self Love — Lila IkéHeart & Soul — Vybz KartelBLXXD & FYAH — KeznamdiFrom Within — MortimerNo Place Like Home — Jesse Royal\n\n\tBest New Age, Ambient, or Chant Album\n\n\tKuruvinda — Kirsten Agresta-CopelyAccording To The Moon — Cheryl B. Engelhardt, GEM, Dallas String QuartetInto The Forest — Jahnavi HarrisonNomadica — Carla Patullo Featuring The Scorchio Quartet & TonalityThe Colors In My Mind — Chris Redding\n\n\tBest Children’s Music Album\n\n\tAgeless: 100 Years Young — Joanie Leeds & JoyaBuddy’s Magic Tree House — Mega RanHarmony — FYÜTCH & Aura VHerstory — Flor BromleyThe Music of Tori and the Muses — Tori Amos\n\n\tBest Comedy Album\n\n\tDrop Dead Years — Bill BurrPostMortem — Sarah SilvermanSingle Lady — Ali WongWhat Had Happened Was… — Jamie FoxxYour Friend, Nate Bargatze — Nate Bargatze\n\n\tBest Audio Book, Narration, and Storytelling Recording\n\n\tElvis, Rocky & Me: The Carol Connors Story — Kathy GarverInto the Uncut Grass — Trevor NoahLovely One: A Memoir — Ketanji Brown JacksonMeditations: The Reflections of His Holiness the Dalai Lama — Dalai LamaYou Know It’s True: The Real Story of Milli Vanilli — Fab Morvan\n\n\tBest Compilation Soundtrack for Visual Media\n\n\tA Complete Unknown – Timothée ChalametF1 The Album – Various ArtistsKpop Demon Hunters – Various ArtistsSinners – Various ArtistsWicked – Various Artists\n\n\tBest Score Soundtrack For Visual Media (Includes Film and Television)\n\n\tHow to Train Your Dragon – John Powell, composerSeverance: Season 2 – Theodore Shapiro, composerSinners – Ludwig Göransson, composerWicked – John Powell & Stephen Schwartz, composersThe Wild Robot – Kris Bowers, composer\n\n\tBest Score Soundtrack for Video Games and Other Interactive Media\n\n\tAvatar: Frontiers of Pandora – Secrets of the Spires — Pinar Toprak, composerHelldivers 2 — Wilbert Roget, II, composerIndiana Jones and the Great Circle — Gordy Haab, composerStar Wars Outlaws: Wild Card & a Pirate’s Fortune — Cody Matthew Johnson & Wilbert Roget, II, composersSword of the Sea — Austin Wintory, composer\n\t\n\n\tBest Song Written for Visual Media\n\n\t“As Alive as You Need Me to Be” [From “Tron: Ares”] — Trent Reznor & Atticus Ross, songwriters (Nine Inch Nails)“Golden” [From “KPop Demon Hunters”] — EJAE & Mark Sonnenblick, songwriters (HUNTR/X: EJAE, Audrey Nuna, Rei Ami)“I Lied to You” [From “Sinners”] — Ludwig Göransson & Raphael Saadiq, songwriters(Miles Caton)“Never Too Late” [From “Elton John: Never Too Late”] — Brandi Carlile, Elton John, Bernie Taupin & Andrew Watt, songwriters (Elton John, Brandi Carlile)“Pale, Pale Moon” [From “Sinners”] — Ludwig Göransson & Brittany Howard, songwriters (Jayme Lawson)“Sinners” [From “Sinners”] — Leonard Denisenko, Rodarius Green, TravisHarrington, Tarkan Kozluklu, Kyris Mingo & Darius Povilinus, songwriters (Rod Wave)\n\n\tBest Music Video\n\n\t“Young Lion” — SadeSophie Muller, video director; Sade & Aaron Taylor Dean, video producers“Manchild” — Sabrina CarpenterVania Heymann & Gal Muggia, video directors; Aiden Magarian, Nathan Scherrer & Natan Schottenfels, video producers“So Be It” — ClipseProducer Hannan Hussain, video director; Daniel Order, video“Anxiety” — DoechiiJames Mackel, video director; Pablo Feldman, Jolene Mendes & Sophia Sabella, video producers“Love” — OK GoAaron Duffy, Miguel Espada & Damian Kulash Jr., video directors; Petra Ahmann, video producer\n\n\tBest Music Film\n\n\tDevo — DevoChris Smith, video director; Danny Gabai, Anita Greenspan, Chris Holmes & Chris Smith, video producersLive at the Royal Albert Hall — RayePaul Dugdale, video director; Stefan Demetriou & Amy James, video producersRelentless — Diane WarrenBess Kargman, video director; Peggy Drexler, Michele Farinola & Kat Nguyen, video producersMusic by John Williams — John WilliamsLaurent Bouzereau, video director; Sara Bernstein, Laurent Bouzereau, Justin Falvey, Darryl Frank, Brian Grazer, Ron Howard, Meredith Kaulfers, Kathleen Kennedy, Frank Marshall, Steven Spielberg & Justin Wilkes, video producersPiece by Piece — Pharrell WilliamsMorgan Neville, video director; Morgan Neville, Caitrin Rogers, Mimi Valdes & Pharrell Williams, video producers\n\n\tBest Recording Package\n\n\tAnd The Adjacent Possible — Hà Trinh Quoc Bao, Damian Kulash, Jr., Claudio Ripol, Wombi Rose & Yuri Suzuki, art directors (OK Go)Balloonerism — Bráulio Amado & Alim Smith, art directors (Mac Miller)Danse Macabre: De Luxe — Rory McCartney, art director (Duran Duran)Loud Is As — Farbod Kokabi & Emily Sneddon, art directors (Tsunami)Sequoia — Tim Breen & Ken Shipley, art directors (Various Artists)The Spins (Picture Disc Vinyl) — Miller McCormick, art director (Mac Miller)Tracks II: The Lost Albums — Meghan Foley & Michelle Holme, art directors (BruceSpringsteen)\n\t\n\n\tBest Album Cover\n\n\tChromakopia — Shaun Llewellyn & Luis “Panch” Perez, art directors (Tyler, the Creator)The Crux — William Wesley II, art director (Djo)Debí Tirar Más Fotos — Benito Antonio Martinez Ocasio, art director (Bad Bunny)Glory — Cody Critcheloe & Andrew J.S., art directors (Perfume Genius)Moisturizer — Hester Chambers, Ellis Durand, Henry Holmes, Matt de Jong, Jamie-James Medina, Joshua Mobaraki & Rhian Teasdale, art directors (Wet Leg)\n\n\tBest Album Notes\n\n\tAdios, Farewell, Goodbye, Good Luck, So Long: On Stage 1964-1974 — Scott B. Bomar, album notes writer (Buck Owens And His Buckaroos)After the Last Sky — Adam Shatz, album notes writer (Anouar Brahem, Anja Lechner, Django Bates, Dave Holland)Árabe — Amanda Ekery, album notes writer (Amanda Ekery)The First Family: Live At Winchester Cathedral 1967 — Alec Palao, album notes writer (Sly & The Family Stone)A Ghost Is Born (20th Anniversary Deluxe Edition) — Bob Mehr, album notes writer (Wilco)Miles ’55: The Prestige Recordings — Ashley Kahn, album notes writer (Miles Davis)\n\n\tBest Historical Album\n\n\tJoni Mitchell Archives – Volume 4: The Asylum Years (1976-1980) — Patrick Milligan & Joni Mitchell, compilation producers; Bernie Grundman, mastering engineer (Joni Mitchell)The Making Of Five Leaves Left — Cally Callomon & Johnny Chandler, compilationproducers; Simon Heyworth & John Wood, mastering engineers (Nick Drake)Roots Rocking Zimbabwe – The Modern Sound Of Harare’ Townships 1975-1980 (Analog Africa No.41) — Samy Ben Redjeb, compilation producer; Michael Graves, mastering engineer (Various Artists)Super Disco Pirata – De Tepito Para El Mundo 1965-1980 (Analog Africa No. 39) — Samy Ben Redjeb, compilation producer; Michael Graves, mastering engineer (Various Artists)You Can’t Hip A Square: The Doc Pomus Songwriting Demos — Will Bratton, Sharyn Felder & Cheryl Pawelski, compilation producers; Michael Graves, mastering engineer (Doc Pomus)\n\n\tBest Engineered Album, Non-Classical\n\n\tAll Things Light — Jesse Brock, Jon Castelli, Tyler Johnson, Nick Lobel, Simon Maartensson, Lawrence “Boo” Mitchell, Anders Mouridsen, Ryan Nasci, Ernesto Olivera-Lapier, Ethan Schneiderman & Owen Stoutt, engineers; Dale Becker, mastering engineer (Cam)Arcadia — Neal Cappellino & Gary Paczosa, engineers; Brad Blackwood, mastering engineer (Alison Krauss & Union Station)For Melancholy Brunettes (& sad women) — Joseph Lorge, Blake Mills & Sebastian Reunert, engineers; Patricia Sullivan, mastering engineer (Japanese Breakfast)That Wasn’t A Dream — Joseph Lorge & Blake Mills, engineers; Patricia Sullivan,mastering engineer (Pino Palladino, Blake Mills)\n\t\n\n\tBest Engineered Album, Classical\n\n\tCerrone: Don’t Look Down — Mike Tierney, engineer; Alan Silverman, masteringengineer (Sandbox Percussion)Eastman: Symphony No. 2; Tchaikovsky: Symphony No. 2 — Gintas Norvila, engineer; Jennifer Nulsen, mastering engineer (Franz Welser-Möst & The Cleveland Orchestra)Shostakovich: Lady Macbeth Of The Mtsensk District — Shawn Murphy & Nick Squire, engineers; Tim Martyn, mastering engineer (Andris Nelsons, Kristine Opolais,Günther Groissböck, Peter Hoare, Brenden Gunnell & Boston Symphony Orchestra)Standard Stoppages — Sean Connors, Robert Dillon, Peter Martin, Bill Maylone, Judith Sherman & David Skidmore, engineers; Joe Lambert, mastering engineer (Third Coast Percussion)Yule — Morten Lindberg, engineer; Morten Lindberg,mastering engineer (Trio Mediæval)\n\n\tProducer Of The Year, Classical\n\n\tBlanton AlspaughSergei KvitkoMorten LindbergDmitriy LipayElaine Martone\n\n\tBest Immersive Audio Album\n\n\tAll American F***boy — Andrew Law, immersive mix engineer (Duckwrth)Immersed — Justin Gray, immersive mix engineer; Michael Romanowski, immersive mastering engineer; Justin Gray, Drew Jurecka & Morten Lindberg, immersiveproducers (Justin Gray)An Immersive Tribute To Astor Piazzolla (Live) — Andrés Mayo & Martín Muscatello, immersive mix engineers; Andrés Mayo & Martín Muscatello, immersive producers (Various Artists)Tearjerkers — Hans-Martin Buff, immersive mix engineer; Hans-Martin Buff, immersive producer (Tearjerkers)Yule — Morten Lindberg, immersive mix engineer; Morten Lindberg, immersive mastering engineer; Arve Henriksen & Morten Lindberg, immersive producers (Trio Mediæval)\n\n\tBest Instrumental Composition\n\n\t“First Snow” — Remy Le Boeuf, composer (Nordkraft Big Band, Remy Le Boeuf & Danielle Wertz)“Live Life This Day: Movement I” — Miho Hazama, composer (Miho Hazama, Danish Radio Big Band & Danish National Symphony Orchestra)“Lord, That’s A Long Way” — Sierra Hull, composer (Sierra Hull)“Openin”g — Zain Effendi, composer (Zain Effendi)“Train To Emerald City” — John Powell & Stephen Schwartz, composers (John Powell & Stephen Schwartz)“Why You Here / Before The Sun Went Down” — Ludwig Göransson, composer (Ludwig Göransson Featuring Miles Caton)\n\t\n\n\tBest Arrangement, Instrumental or A Cappella\n\n\t“Be Okay” — Cynthia Erivo, arranger (Cynthia Erivo)“A Child Is Born” — Remy Le Boeuf, arranger (Nordkraft Big Band & Remy Le Boeuf)“Fight On” — Andy Clausen, Addison Maye-Saxon, Riley Mulherkar & Chloe Rowlands, arrangers (The Westerlies)“Super Mario Praise Break” — Bryan Carter, Charlie Rosen & Matthew Whitaker,arrangers (The 8-Bit Big Band)\n\n\tBest Arrangement, Instruments and Vocals\n\n\t“Big Fish” — Erin Bentlage, Sara Gazarek, Johnaye Kendrick, Nate Smith & Amanda Taylor, arrangers (Nate Smith Featuring säje)“How Did She Look?” — Nelson Riddle, arranger (Seth MacFarlane)“Keep An Eye On Summer” — Jacob Collier, arranger (Jacob Collier)“Something In The Water (Acoustic-Ish)” — Clyde Lawrence, Gracie Lawrence & Linus Lawrence, arrangers (Lawrence)“What A Wonderful World” — Cody Fry, arranger (Cody Fry)\n\n\tBest Orchestral Performance\n\n\tColeridge-Taylor: Toussaint L’Ouverture; Ballade Op. 4; Suites From ’24 Negro Melodies’ — Michael Repper, conductor (National Philharmonic)Messiaen: Turangalîla-Symphonie — Andris Nelsons, conductor (Boston SymphonyOrchestra)Ravel: Boléro, M. 81 — Gustavo Dudamel, conductor (Simón Bolívar SymphonyOrchestra Of Venezuela)Still & Bonds — Yannick Nézet-Séguin, conductor (The Philadelphia Orchestra)Stravinsky: Symphony In Three Movements — Esa-Pekka Salonen, conductor (San Francisco Symphony)\n\n\tBest Opera Recording\n\n\tHeggie: Intelligence — Kwamé Ryan, conductor; Jamie Barton, J’Nai Bridges& Janai Brugger; Blanton Alspaugh, producer (Houston Grand Opera; Gene Scheer)Huang Ruo: An American Soldier — Carolyn Kuan, conductor; Hannah Cho, Alex DeSocio, Nina Yoshida Nelsen & Brian Vu; Adam Abeshouse, Silas Brown & Doron Schachter, producers (American Composers Orchestra; David Henry Hwang)Kouyoumdjian: Adoration — Alan Pierson, conductor; Miriam Khalil, MarcKudisch, David Adam Moore, Omar Najmi, Naomi Louisa O’Connell & Karim Sulayman; Mary Kouyoumdjian, producer (Silvana Quartet; The Choir Of Trinity Wall Street)O’Halloran: Trade & Mary Motorhead — Elaine Kelly, conductor; Oisín Ó Dálaigh & John Molloy; Alex Dowling & Emma O’Halloran, producers (Irish National Opera Orchestra; Mark O’Halloran)Tesori: Grounded — Yannick Nézet-Séguin, conductor; Ben Bliss, EmilyD’Angelo, Greer Grimsley & Kyle Miller; David Frost, producer (The Metropolitan Opera Orchestra; The Metropolitan Opera Chorus; George Brant)\n\t\n\n\tBest Choral Performance\n\n\tAdvena – Liturgies For A Broken World — Craig Hella Johnson, conductor (Simon Barrad, Emily Yocum Black & Michael Hawes; Conspirare)Childs: In The Arms Of The Beloved — Grant Gershon, conductor (Billy Childs, DanChmlellnskl, Christian Euman, Larry Koonse, Lyris Quartet, Anne Akiko Meyers, Carol Robbins & Luciana Souza; Los Angeles Master Chorale)Lang: Poor Hymnal — Donald Nally, conductor (Steven Bradshaw, MichaelHawes, Lauren Kelly, Rebecca Siler & Elisa Sutherland; The Crossing)Ortiz: Yanga — Gustavo Dudamel, conductor; Grant Gershon, chorusmaster (Los Angeles Philharmonic & Tambuco Percussion Ensemble; Los Angeles Master Chorale)Requiem Of Light —Steven Fox, conductor; Emily Drennan & Patti Drennan, chorus masters (Brian Giebler & Sangeeta Kaur; The Clarion Choir)\n\n\tBest Chamber Music/Small Ensemble Performance\n\n\tDennehy: Land Of Winter — Alan Pierson & Alarm Will SoundLa Mer – French Piano Trios — Neave TrioLullabies For The Brokenhearted — Lili Haydn & Paul CantelonSlavic Sessions — Mak Grgić & Mateusz KowalskiStandard Stoppages — Third Coast Percussion\n\n\tBest Classical Instrumental Solo\n\n\tColeridge-Taylor: 3 Selections From ’24 Negro Melodies’ — Curtis Stewart; Michael Repper, conductor (National Philharmonic)Hope Orchestrated — Mary Dawood Catlin; Jesús David Medina & Raniero Palm, conductors (Venezuela Strings Recording Ensemble)Inheritances — Adam TendlerPrice: Piano Concerto In One Movement In D Minor — Han Chen; John Jeter, conductor (Malmö Opera Orchestra)Shostakovich: The Cello Concertos — Yo-Yo Ma; Andris Nelsons, conductor (BostonSymphony Orchestra)Shostakovich: The Piano Concertos; Solo Works — Yuja Wang; Andris Nelsons, conductor (Boston Symphony Orchestra)\n\n\tBest Classical Solo Vocal Album\n\n\tAlike – My Mother’s Dream — Allison Charney, soloist; Benjamin Loeb, conductor (National Symphonia Orchestra)Black Pierrot — Sidney Outlaw, soloist; Warren Jones, pianistIn This Short Life — Devony Smith, soloist; Danny Zelibor, pianist; Michael Nicolas, accompanistKurtág: Kafka Fragments — Susan Narucki, soloist; Curtis Macomber, accompanistSchubert Beatles — Theo Hoffman, soloist; Steven Blier, pianist (Rupert Boyd, Julia Bullock, Alex Levine, Andrew Owens, Rubén Rengel & Sam Weber)Telemann: Ino – Opera Arias For Soprano — Amanda Forsythe, soloist; Robert Mealy, Paul O’Dette & Stephen Stubbs, conductors (Boston Early Music Festival Orchestra)\n\t\n\n\tBest Classical Compendium\n\n\tCerrone: Don’t Look Down — Sandbox Percussion; Jonathan Allen, Victor Caccese,Christopher Cerrone, Ian Rosenbaum, Terry Sweeney & Mike Tierney, producersThe Dunbar/Moore Sessions, Vol. II — Will Liverman; Jonathan Estabrooks, producerOrtiz: Yanga — Gustavo Dudamel, conductor; Dmitriy Lipay, producerSeven Seasons — Janai Brugger, Isolde Fair, MB Gordy & Starr Parodi; Nicholas Dodd, conductor; Jeff Fair, Starr Parodi & Kitt Wakeley, producersTombeaux — Christina Sandsengen; Shaun Drew & Christina Sandsengen, producers\n\n\tBest Contemporary Classical Composition\n\n\tCerrone: Don’t Look Down — Christopher Cerrone, composer (Conor Hanick & Sandbox Percussion)Dennehy: Land Of Winter — Donnacha Dennehy, composer (Alan Pierson & Alarm Will Sound)León: Raíces (Origins) — Tania León, composer (Edward Gardner & London Philharmonic Orchestra)Okpebholo: Songs In Flight — Shawn E. Okpebholo, composer (Will Liverman, Paul Sánchez & Various Artists)Ortiz: Dzonot — Gabriela Ortiz, composer (Alisa Weilerstein, Gustavo Dudamel & Los Angeles Philharmonic)\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Grammys Winners 2026 (Updating Live)",
      "image": [
        "https://variety.com/wp-content/uploads/2020/01/grammy-2.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-01T20:00:00.000Z",
      "dateModified": "2026-02-01T20:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Romería’ Director Carla Simón Announces ‘Flamenco’ Short Film in Partnership With Audiovisual From Spain",
    "url": "https://variety.com/2026/film/global/carla-simon-flamenco-short-film-audiovisual-from-spain-1236648347/",
    "image": "https://variety.com/wp-content/uploads/2025/05/Carla-Simon.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-01T19:49:58.000Z",
    "description": "\n\tGolden Bear-winning director Carla Simón (“Alcarràs”) is set to direct a short film titled “Flamenco” as part of the Where Talent Ignites campaign o",
    "body": "\n\tGolden Bear-winning director Carla Simón (“Alcarràs”) is set to direct a short film titled “Flamenco” as part of the Where Talent Ignites campaign organized by Audiovisual From Spain, the international promotion brand of the Spanish audiovisual sector. \n\n\tThe short film was announced during a showcase for the campaign at the International Film Festival Rotterdam, where Simón is also presenting her Cannes competition title “Romería.”\n\t\n\n\t“Flamenco,” the first of three new pieces commissioned by the campaign, will “offer a contemporary and deeply cinematic perspective on flamenco as a living cultural expression, shaped by the tension between tradition and change,” said one description.  Speaking at the event, Simón said that after making three “super personal films” with “Summer 1993,” “Alcarràs” and “Romería,” she wanted to go into “new territory.”\n\n\n\t“Flamenco has this emotional connection with the audience that is so immediate and powerful,” she added. “It’s been explored in cinema, but it has also been a while. There are a lot of documentaries about flamenco, but when we think about flamenco music in cinema, it seems a bit conservative because [those films] were made during the Franco dictatorship. I think it’s interesting to rethink it in a contemporary way.”\n\n\tSimón’s short film is part of a deeper, larger research on the flamenco tradition, which will also inform her next feature, currently described only as a “flamenco musical.” The feature is currently in early stages of development, while the short film is expected to premiere at the Cannes Festival’s Marché du Film  in May.\n\t\n\n\t“I am starting to prepare a film that has to do with [how] flamenco has evolved a lot in terms of music, but in terms of cinema not so much,” she said about the future. “When I got this opportunity to make a film to promote Spain, I thought about exploring flamenco because it is alive between tradition and change. I am interested in this tension I feel other countries also have with their cultural elements, where they think some people might be making it too modern, or that it will disappear [entirely]. I feel flamenco has all of this inside it.”\n\n\tOn the production of the short, Simón said she and her team are currently casting the flamenco artists who will be part of the film. “Contemporary artists take so much from traditional flamenco, so it’s a theme that is not black or white; it is very complex. The script is currently too long, I’m trying to make it short but it’s difficult,” she said, laughing. \n\n\n\n\t\n\n\t\t\t\t\t‘Romería,’ the third part of Carla Simón’s ‘super personal’ film trilogy\n\t\n\n\n\n\tThe director also briefly took the temperature of her national film industry, saying she feels “very fortunate to be part of this moment in Spanish cinema.” Spain is currently in the running for this year’s International Feature Oscar with Oliver Laxe’s “Sirāt,” which also played the 2025 Cannes competition alongside “Romería.”\n\n\t“There is a whole new generation speaking with their own voices,” said Simón of this new wave of Spanish cinema. “All of us are doing different searches. I feel we are trying things out, experimenting and taking risks with our films.”\n\n\tThe filmmaker said that Spanish cinema now has something that “had been missing for a while,” which is “a bit of a spotlight.” “Our films are travelling to festivals now. I remember presenting ‘Alcarràs’ in Berlin and thinking: This isn’t something that will only happen once. Since then, it has not stopped. There are new directors coming up every year and it’s very exciting to see it happen.”\n\n\tAs for the rise in Spanish co-productions, Simón said it is great to finally have a sense of “reciprocity” within the national industry. “I remember that, at the time of ‘Summer 1993,’ we didn’t have many co-productions in Spain. It wasn’t a country that had this exchange. It has changed a lot now. We are also helping films from other countries get made and it’s a very rich exchange.” Co-productions, she concluded, are also essential in getting Spanish films to “travel and get sold.” \n\t\n\n\tThere is a significant Spanish presence at Rotterdam this year, including Gala Hernández López’s “Like Moths to the Light,” Carlos Casas “Krakatoa” and Lois Patiño’s latest project “Adarna” as part of Cinemart. \n\n\tProduced by Iván Miñambres and Chelo Loureiro and featuring fully embroidered backgrounds and digitally animated characters, there’s also a strong buzz on “El Cuerpo de Cristo,” Bea Lema’s animation debut, which bowed over the weekend at Rotterdam in its short and mid-length section, its sales handled by Miyu Distribution.  \n\n\tThe International Film Festival Rotterdam runs between Jan. 29 – Feb. 8.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Romería’ Director Carla Simón Announces ‘Flamenco’ Short Film in Partnership With Audiovisual From Spain",
      "image": [
        "https://variety.com/wp-content/uploads/2025/05/Carla-Simon.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-01T19:49:58.000Z",
      "dateModified": "2026-02-01T19:49:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Elon Musk Says Christopher Nolan Has ‘Lost His Integrity’ With ‘The Odyssey’ If Lupita Nyong’o Is Playing Helen of Troy",
    "url": "https://variety.com/2026/film/news/elon-musk-christopher-nolan-odyssey-lupita-nyongo-1236648435/",
    "image": "https://variety.com/wp-content/uploads/2026/02/MixCollage-01-Feb-2026-11-00-AM-7239.jpg?crop=16px%2C21px%2C1169px%2C656px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-02-01T19:27:30.000Z",
    "description": "\n\tElon Musk took to X on Sunday to claim two-time Oscar-winning director Christopher Nolan “has lost his integrity” while debating Lupita Nyong’o’s sp",
    "body": "\n\tElon Musk took to X on Sunday to claim two-time Oscar-winning director Christopher Nolan “has lost his integrity” while debating Lupita Nyong’o’s speculated role in “The Odyssey,” Helen of Troy.\n\n\tOn Sunday morning, one X user claimed that if Nyong’o plays Helen of Troy, it is “an insult” to the Greek poet Homer, who wrote “The Odyssey” around 700 BCE, because he originally described the fictonal character as “fair skinned, blonde, and ‘the face that launched a thousand ships’ because she was so beautiful that men started a war over her.” Musk later commented on the post, “Chris Nolan has lost his integrity.”\n\t\n\n\tVariety reported a Nyong’o and Nolan team-up back in November 2024, but it wasn’t until the following December that the project was revealed to be “The Odyssey.” Nyong’o’s role in the film has yet to be confirmed. Other cast members include Matt Damon, Tom Holland, Anne Hathaway, Robert Pattinson, Zendaya, Charlize Theron, Jon Bernthal, Benny Safdie and Elliot Page.\n\n\n\tThe latest addition to “The Odyssey” cast is 10-time Grammy nominee Travis Scott. His role was revealed in a TV spot that aired during Fox’s broadcast of the NFL AFC Championship game. In the teaser, Scott stands on top of a table and demands the attention of a room full of soldiers, which includes Holland’s Telemachus and Benthal’s Menelaus.\n\n\tUniversal declined Variety’s request for comment on Scott’s casting.\n\n\t“The Odyssey” is the first narrative feature shot entirely with Imax cameras. The technical feat was previously impossible because the Imax cameras were too noisy, making quiet, intimate scenes unshootable. However, thanks to a new film casing called a “blimp,” the noise can be significantly reduced.\n\t\n\n\t“The blimp system is a game-changer,” Nolan told Empire Magazine. “You can be shooting a foot from [an actor’s] face while they’re whispering and get usable sound. What that opens up are intimate moments of performance on the world’s most beautiful format.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Elon Musk Says Christopher Nolan Has ‘Lost His Integrity’ With ‘The Odyssey’ If Lupita Nyong’o Is Playing Helen of Troy",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/MixCollage-01-Feb-2026-11-00-AM-7239.jpg?crop=16px%2C21px%2C1169px%2C656px&resize=1000%2C563"
      ],
      "datePublished": "2026-02-01T19:27:30.000Z",
      "dateModified": "2026-02-01T19:27:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘One Battle After Another’ Wins Top Honor at London Critics’ Circle Film Awards as Timothée Chalamet Is Named Best Actor",
    "url": "https://variety.com/2026/film/awards/london-critics-circle-film-awards-2026-winners-1236647096/",
    "image": "https://variety.com/wp-content/uploads/2026/01/battle-supreme.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-01T19:15:00.000Z",
    "description": "\n\t“One Battle After Another” added to its growing haul of statuettes on Sunday night in London, where it won four honors at the 46th annual London Cri",
    "body": "\n\t“One Battle After Another” added to its growing haul of statuettes on Sunday night in London, where it won four honors at the 46th annual London Critics Circle film awards. \n\n\tAlongside the top film of the Year award, Paul Thomas Anderson was named director of the year and screenwriter of the year, while Sean Penn won the supporting actor gong. \n\n\tTimothée Chalamet, meanwhile, chose the perfect weekend to stop by the British capital to give a couple of Q&As for “Marty Supreme,” winning actor of the year (which he last won in 2018 for “Call Me By Your Name”). Jessie Buckley claimed the top actress award for “Hamnet.” \n\t\n\n\tElsewhere, Amy Madigan landed the best supporting actress award for “Weapons” while Netflix’ megahit “Kpop Demon Hunters,” ineligible for the BAFTAs, claimed perhaps his only honor on British soil.\n\n\n\tAlongside the main winners, Cynthia Erivo received the Derek Malcolm Award for Innovation, in honor of a career spanning film such as “Widows,” “Harriet,” “Bad Times at the El Royale” and the “Wicked” films, while Guillermo del Toro was honored with the  Dilys Powell Award for Excellence in Film. \n\n\tThe London Critics’ Circle Film Awards were voted for by the 207 members of the Film Section of the Critics’ Circle, the U.K.’s longest-standing and most prestigious critics’ organisation.\n\n\tSee the full list of winners below\n\n\tFILM OF THE YEAR“Hamnet”“Marty Supreme”“The Mastermind”“One Battle After Another” (WINNER)“Sentimental Value”“Sinners”“Sirāt”“Sorry, Baby”“Train Dreams”“Weapons”\n\t\n\n\tDIRECTOR OF THE YEARPaul Thomas Anderson – “One Battle After Another” (WINNER)Ryan Coogler – “Sinners”Óliver Laxe – “Sirāt”Josh Safdie – “Marty Supreme”Chloé Zhao – “Hamnet”\n\n\tACTOR OF THE YEARTimothée Chalamet – “Marty Supreme” (WINNER)Leonardo DiCaprio – “One Battle After Another”Ethan Hawke – “Blue Moon”Wagner Moura – “The Secret Agent“Josh O’Connor – “The Mastermind”\n\n\tACTRESS OF THE YEARJessie Buckley – “Hamnet” (WINNER)Rose Byrne – “If I Had Legs I’d Kick You”Jennifer Lawrence – “Die My Love”Renate Reinsve – “Sentimental Value”Eva Victor – “Sorry, Baby”\n\n\tSUPPORTING ACTOR OF THE YEARBenicio del Toro – “One Battle After Another”Jacob Elordi – “Frankenstein”Delroy Lindo – “Sinners”Sean Penn – “One Battle After Another” (WINNER)Alexander Skarsgård – “Pillion”\n\n\tSUPPORTING ACTRESS OF THE YEAROdessa A’zion – “Marty Supreme”Inga Ibsdotter Lilleaas – “Sentimental Value”Amy Madigan – “Weapons” (WINNER)Wunmi Mosaku – “Sinners”Teyana Taylor – “One Battle After Another”\n\n\tSCREENWRITER OF THE YEARPaul Thomas Anderson – “One Battle After Another” (WINNER)Ryan Coogler – “Sinners”Josh Safdie & Ronald Bronstein – “Marty Supreme”Eva Victor – “Sorry, Baby”Chloé Zhao & Maggie O’Farrell – “Hamnet”\n\n\tBRITISH/IRISH FILM OF THE YEAR“The Ballad of Wallis Island”“Bugonia”“Hamnet”“I Swear”“Pillion” (WINNER)\n\n\tFOREIGN LANGUAGE FILM OF THE YEAR“It Was Just an Accident”“No Other Choice”“The Secret Agent”“Sentimental Value” (WINNER)“Sirāt”\n\n\tDOCUMENTARY OF THE YEAR“Cover-Up”“One to One: John & Yoko”“Orwell: 2+2=5”“The Perfect Neighbor” (WINNER)“Riefenstahl”\n\n\tANIMATED FEATURE OF THE YEAR“Arco”“Elio”“KPop Demon Hunters” (WINNER)“Little Amélie or the Character of Rain”“Zootopia 2”\n\n\tBRITISH/IRISH PERFORMER OF THE YEARNaomi Ackie – “Sorry, Baby”/”Mickey 17″/”The Thursday Murder Club”Robert Aramayo – “I Swear”/”Palestine 36”Jessie Buckley – “Hamnet”David Jonsson – “Wasteman”/”The Long Walk”Josh O’Connor – “The Mastermind/”The History of Sound”/”Wake Up Dead Man: A Knives Out Mystery” (WINNER)\n\t\n\n\tBREAKTHROUGH PERFORMER OF THE YEARRobert Aramayo – “I Swear/Palestine 36″ (WINNER)Miles Caton – “Sinners”Frank Dillane – “Urchin/Harvest”Chase Infiniti – “One Battle After Another”Eva Victor – “Sorry, Baby”\n\n\tBREAKTHROUGH BRITISH/IRISH FILMMAKER OF THE YEARTom Basden & Tim Key – “The Ballad of Wallis Island”Laura Carreira – “On Falling”Akinola Davies Jr. – “My Father’s Shadow”Harris Dickinson – “Urchin”Harry Lighton – “Pillion” (WINNER)\n\n\tYOUNG BRITISH/IRISH PERFORMER OF THE YEARScott Ellis Watson – “I Swear”Ebada Hassan – “Brides”Jacobi Jupe – “Hamnet”Noah Jupe – “Hamnet”/”The Carpenter’s Son”Alfie Williams – “28 Years Later” (WINNER)\n\n\tTECHNICAL ACHIEVEMENT AWARD“Die My Love” – Editing, Toni Froschhamer“The Ice Tower” – Production Design, Julia Irribarria“Marty Supreme” – Casting, Jennifer Venditti“The Mastermind” – Music, Rob Mazurek“One Battle After Another” – Editing, Andy Jurgensen“Sinners” – Music, Ludwig Göransson (WINNER)“Sirāt” – Sound design, Laia Casanovas“Sound of Falling” – Costume Design, Sabrina Krämer“Train Dreams” – Cinematography, Adolpho Veloso“Weapons” – Makeup and Hairstyling, Leo Satkovich, Melizah Wheat and Jason Collins\n\n\tBRITISH/IRISH SHORT FILM OF THE YEAR“Two Black Boys In Paradise” – Directed by Baz Sells“Leaving Ikordoru in 1999” – Directed by Rashida Seriki“I Saw The Face Of God In The Jet Wash” – Directed by Mark Jenkin“Neil Armstrong and the Langholmites” – Directed by Duncan Cowles (WINNER)“Milk” – Directed by Naomi Waring\n\n\tDilys Powell Award for Excellence in FilmGuillermo del Toro\n\n\tDerek Malcolm Award for InnovationCynthia Erivo\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘One Battle After Another’ Wins Top Honor at London Critics’ Circle Film Awards as Timothée Chalamet Is Named Best Actor",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/battle-supreme.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-01T19:15:00.000Z",
      "dateModified": "2026-02-01T19:15:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Nuisance Bear’ Review: While Remarkable Footage of a Rare Bear Is Sure to Awe, the Sundance Winner’s Themes Prove a Bit More Muddled",
    "url": "https://variety.com/2026/film/reviews/nuisance-bear-review-1236647526/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Nuisance_Bear-Still_1.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-01T20:00:00.000Z",
    "description": "\n\tPolar bears are growing increasingly comfortable around people, and that’s a problem. One can see the tension between these natural hunters and thos",
    "body": "\n\tPolar bears are growing increasingly comfortable around people, and that’s a problem. One can see the tension between these natural hunters and those who hunt them — whether that happens with telephoto lenses or high-powered rifles — in Churchill, Manitoba, self-proclaimed “polar bear capital of the world,” where tourists flock when the magnificent animals migrate in order to catch a glimpse of the threatened (but still quite lethal) species.\n\t\n\n\tIn their Sundance-winning feature doc “Nuisance Bear,” filmmakers Gabriela Osio Vanden and Jack Weisman spend nearly as much time observing the observers as they do the ice-white creature described in their title — a mama polar bear who walks right up to human-populated buildings in its search for food — zooming out to contextualize the phenomenon. As Inuit narrator Mike Tunalaaq Gibbons lays out in minimal words, the situation is infinitely more complex than it looks, touching on everything from colonialism to climate change, wildlife management to race relations.\n\n\n\tSundance godfather Robert Redford would have been proud: The eco-minded, Indigenous-supportive film festival he built serves as the perfect platform for a project of this nature. What began as a 14-minute documentary short for The New Yorker Studios landed top honors from The New Yorker film critic Justin Chang and his two fellow jurors at this year’s indie fest.\n\n\n\tIt’s easy to see why the visually stunning, ideologically understated project might stand out: Shot in gorgeous widescreen (an unusual format for documentaries), the movie catalogs all the way people behave around what appears to be a single bear, first seen dozing with her two cubs. The helmers include several human-free montages, where the bear hunts and swims as it normally would, but mostly they show how its life has been impacted by homo sapiens, including a tense scene where the bear appears in a hunter’s sights (all of it accompanied by a mischievous, obviously “The White Lotus”-inspired score from Cristobal Tapia de Veer).\n\t\n\n\tFor all its richness, “Nuisance Bear” doesn’t necessarily enunciate its themes. Instead, the directors trust audiences to extrapolate from Gibbons’ ruminative voiceover, which builds to the line, “They don’t see the harm they are causing when they try to control the bears.” Vanden and Weisman do their best to show what Gibbons means, even as they withhold a key piece of information — that the narrator lost his son in a polar bear attack, which might not have happened if the white men south of Arviat weren’t driving the bears in their direction. (To make matters worse, the animals are adapting to be less fearful of people before they reach the Inuit community.)\n\n\tEarly on, the doc shows crowds flocking to Churchill to see the bears, much as they might go whale watching or hoping to spot lions on safari — except, in this case, civilization is just a stone’s throw away. Human faces, when they do appear, are observed mostly at a distance, in much the same way animals are shown in traditional nature docs. “Nuisance Bear” isn’t about them — at least, not directly. A tour guide warns that the bears’ hearing is so sensitive, the slightest sound can disturb them. But that’s contradicted later on, when we realize that the animals are adjusting to the noise of their human neighbors, becoming emboldened by proximity.\n\n\tIn Churchill, the trash sites have all been bear-proofed (enclosed so the animals can’t graze among the garbage), but not so in Arviat, where Inuit enforcers show up in their buggies to honk loudly and chase the bears away from open-air landfills. A generation ago, the bears didn’t spend nearly as much time waiting for ice to form. The film doesn’t call out climate change directly, but the implication is clear: Shifting environmental conditions are changing the bears’ behavior. “The longer they stay on land, the more dangerous they become,” Gibbons explains.\n\n\tDown in Churchill, when bears start to be a “nuisance” — that is, poking around where they’re not welcome — any number of strategies have been put into practice, from scaring them off to locking them up. Yes, such a thing exists as “polar bear prison,” and the documentary shows this system in action: The animals are caught and contained, then tranquilized and air-lifted by helicopter far enough north that the bears are now somebody else’s problem. What will become of the avinnaarjuk, as Gibbons refers to the nuisance bear? She’s tagged and marked with bright green dye, making her easy to identify from a distance — whether by drone or down the barrel of Inuit’s rifle (in both cases, the film offers views earlier docs couldn’t).\n\t\n\n\tThe hunting policies are different for the disparate human populations: White Canadians are only allowed to kill a few bears each year, whereas the Inuit act according to tradition (the movie doesn’t mention the market for the rare pelts, though it does show Native women skinning and stretching at least one hide). Halfway through, the doc shifts focus to the Inuit community, complicating matters as it delves into issues such as forced assimilation through residential schools. Somewhat unexpectedly, the film evolves into being an essay on how the “outsiders” deal with nature and Natives, as the encroaching world endangers what The New Yorker would call “preëxisting” ways of life.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Nuisance Bear’ Review: While Remarkable Footage of a Rare Bear Is Sure to Awe, the Sundance Winner’s Themes Prove a Bit More Muddled",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Nuisance_Bear-Still_1.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-01T20:00:00.000Z",
      "dateModified": "2026-02-01T20:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Timothée Chalamet Says He ‘Spent Six Figures Out of My Pocket’ on ‘SNL’ Musical Performance and Press Tour Stunts Aren’t a ‘Gimmick’: ‘I Don’t Want to Be in the Pretentious In-Crowd’",
    "url": "https://variety.com/2026/film/global/timothee-chalamet-spent-six-figures-snl-press-tours-not-gimmick-1236648224/",
    "image": "https://variety.com/wp-content/uploads/2026/02/timmy.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-01T18:42:30.000Z",
    "description": "\n\tTimothée Chalamet’s unconventional press tours, starting with Bob Dylan biopic “A Complete Unknown” and continuing to this year’s buzzy “Marty Supre",
    "body": "\n\tTimothée Chalamet’s unconventional press tours, starting with Bob Dylan biopic “A Complete Unknown” and continuing to this year’s buzzy “Marty Supreme,” have become a hot topic of internet discourse — and the Oscar-nominated actor wants you to know that it’s not a gimmick. \n\n\tDuring a packed Q&A at London’s Prince Charles Cinema on Sunday, Chalamet — in conversation with “Love Actually” filmmaker Richard Curtis — went deep on why he doesn’t consider moves like turning the Las Vegas sphere into a ping-pong ball or staging an unhinged Zoom meeting as strictly PR. \n\t\n\n\t“Here’s the thing — this risks killing any mystery around it, but I really don’t look at it as promotion or marketing. I see myself as an artist expanding,” Chalamet said. “And certainly the Zoom had a little bit of satire to it, but the initial video in the glass box, those [ping-pong ball] heads, I feel like I’m expressing myself. You know, a lot of people want to be told what to say, how to say it and where to stand — I’m talking on the acting front. Also, people don’t want to misstep. I feel like I’ve got the keys, I’ve got the right attitude, I’ve got the juice.”\n\n\n\tThe 30-year-old reflected on how his press tour style started with “A Complete Unknown,” which saw him lip-sync to “Visions of Johanna” on a New York City pier and perform some Dylan deep cuts on “Saturday Night Live.” During the Q&A, Chalamet revealed that pulling double-duty on “SNL” actually took some convincing. \n\n\t“I spent over six figures out of my pocket to do the ‘SNL’ performance,” Chalamet said. “Lorne Michaels said, ‘Hey, do you want to host “SNL”?’ I said, ‘Yeah, can I do the music?’ He’s like, ‘No.’ I said, ‘Alright, I’m not doing it.’ He said, ‘OK, do the music.’ But I refused to take no for an answer.”\n\t\n\n\tHe continued: “This is the new way of doing stuff. I’m trying to reach audiences, you know. I don’t want to be in the pretentious in-crowd. ‘Marty Supreme’ in America had the least frequent moviegoing audience this year — people that weren’t going to see everything. That’s my favorite feedback on the movie. So the most pretentious answer I could give you, which I actually honestly feel, is that it’s not marketing or promotion. That sounds like a gimmick, and this is not a gimmick. This is coming from my heart and my soul.”\n\n\tChalamet has a similar philosophy when it comes to preparing for roles. “I feel like Method energy, that’s kind of my thing,” he said. “So that just means being in the tone of the film … I think anything too calculated — some actors are like that, that’s not really my style.”\n\n\tChalamet is about to see if his efforts for “Marty Supreme” will pay off, as he’s once again up for a best actor Oscar after losing the trophy last year to Adrien Brody for “The Brutalist.” When asked bluntly by Curtis if he wants the Oscar, Chalamet blushed and stuttered, choosing his words carefully.\n\n\t“Listen, yes. But I want to give you context for that, because sometimes I feel like I’ve been misinterpreted in my quest,” Chalamet said. “All these award things, they supplement the movie. I’m not going to turn this into a monologue about the crisis of theaters and stuff, but when you go to an awards show, everyone’s participating in an advertisement for each other — in the best sense of the word, I’m not saying that in a malicious way. I’m supporting ‘Hamnet’ and ‘One Battle After Another’ the way anyone in those movies is supporting ‘Marty Supreme.’ So anything else, yes, it helps to feed into the narrative … everyone’s pursuing it, you know?”\n\n\tChalamet quickly admitted that he “didn’t explain myself well there,” adding: “I don’t want it to be misinterpreted that the world is in the condition it’s in and I’m going to bed like, ‘Fuck man, I need that [Oscar].’ You know, I’m living on planet Earth.”\n\n\tOn a lighter note, Curtis asked Chalamet a series of rapid-fire questions that got the audience and Chalamet giggling, including if the actor — who is currently dating Kylie Jenner — will ever get married.\n\n\t“Wow, that’s so personal,” Chalamet answered, stalling. “Yeah, no — you’re going to get me in trouble, man.”\n\t\n\n\tCurtis ended the conversation by asking Chalamet what he wants to be remembered for and what he thinks his purpose is, something that was top-of-mind for Marty in the film. “These days, it’s paying it forward,” Chalamet answered.\n\n\t“When you’re young, you need things to believe in — narratives to believe in, stories to believe in. Particularly if you grew up like Marty, particularly if you grew up like me, you believe in figures that make you dream,” he sad. “Virgil Abloh, the late fashion designer, he had a great quote: He said he was living his 17-year-old dream, or something to that extent. I feel like right now I’m in a position where I’m doing it.”\n\n\tHe concluded: “That’s why I try to own it. I’m not shying away from it, I’m not being fake humble where I don’t feel it. And equally, I’m leaving it behind for someone that I hope I’m inspiring. So if they’ve got a fucked up life, they can go, ‘Man, but he’s fucking doing it. And I want to do it like that.'”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Timothée Chalamet Says He ‘Spent Six Figures Out of My Pocket’ on ‘SNL’ Musical Performance and Press Tour Stunts Aren’t a ‘Gimmick’: ‘I Don’t Want to Be in the Pretentious In-Crowd’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/timmy.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-01T18:42:30.000Z",
      "dateModified": "2026-02-01T18:42:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Olivia Dean, Clipse, Ozzy Osbourne Tribute and a Message From Barack Obama Light Up Clive Davis Pre-Grammy Party",
    "url": "https://variety.com/2026/music/news/olivia-dean-ozzy-osbourne-tribute-clive-davis-pre-grammy-1236648432/",
    "image": "https://variety.com/wp-content/uploads/2026/02/GettyImages-2258750185-e1769972682580.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-01T19:09:05.000Z",
    "description": "\n\tAfter 51 years, after unique duets featuring Aretha Franklin and Alicia Keys, Whitney Houston and Natalie Cole, Lou Reed and Rod Stewart and so many",
    "body": "\n\tAfter 51 years, after unique duets featuring Aretha Franklin and Alicia Keys, Whitney Houston and Natalie Cole, Lou Reed and Rod Stewart and so many more, how could the Clive Davis Pre-Grammy Gala top its past years? It can’t be expected to, but it remains the absolute best party in the music industry, with an eye-popping assemblage of talent and attendees across music, film and politics.\n\n\tLet’s just say that the tables in the front of the Beverly Hilton ballroom were occupied by Joni Mitchell and Brandi Carlile at one; Lana Del Rey, Jack Antonoff, Rachel Sennot, Hayley Williams and Kendrick Lamar producer Sounwave at another; and sprinkled throughout the room were Teyana Taylor, Laufey, Shaboozey (rocking a sleeveless shirt), Berry Gordy and Smokey Robinson, Nancy Pelosi, Karol G, Sharon and Jack Osbourne, Colman Domingo, Dave Grohl and daughter Violet, Lil Jon, Ne-Yo, Weird Al Yankovic, Yungblud, Dave Grohl, Becky G, Rufus Wainwright, New Radicals’ Gregg Alexander and so many others. \n\t\n\n\tAlso in attendance were most of the very top executives in the music industry — far too many to list, but the evening’s top honorees were Republic Records founders Monte and Avery Lipman (who have also won Variety’s Hitmakers label of the year honor six out of nine years). There’s absolutely no other room like it, and it’s hard to imagine the Grammy Awards without it — and even though he wasn’t in the room, former President Barack Obama addressed Clive and the audience via video.\n\n\n\n\t\n\n\t\t\t\t\tClipse’ Pusha T and John Legend (Photo by Patrick T. Fallon / AFP via Getty Images)\n\t\t\t\t\t\t\t\t\tAFP via Getty Images\n\t\n\n\n\n\tAs always, the evening was a showcase for rising stars. Grammy best new artist nominees Olivia Dean, Sombr (who has vastly improved as a performer since last fall’s tour) and Alex Warren delivered a sultry “Man I Need,” “12 to 12,” and of course “Ordinary,” respectively — and Sombr was rocking to Dean’s performance in the front row (at 6’7″, he’s hard to miss). \n\t\n\n\n\n\t\n\n\t\t\t\t\tSombr(Photo by Patrick T. Fallon / AFP via Getty Images)\n\t\t\t\t\t\t\t\t\tAFP via Getty Images\n\t\n\n\n\n\tMGK and a svelte Jelly Roll performed a tag-team Ozzy Osbourne tribute of “I Don’t Wanna Stop” and “Mama I’m Coming Home.”\n\n\t“Rest in Peace to the Prince of Darkness… to a great husband, a great father, a great musician… Ozzy Osbourne!,” Jelly said at the end of his performance, and walked offstage to receive a long hug from Sharon.\n\n\n\n\t\n\n\t\t\t\t\tJelly Roll (Photo by Patrick T. Fallon / AFP via Getty Images)\n\t\t\t\t\t\t\t\t\tAFP via Getty Images\n\t\n\n\n\n\tLaufey and Darren Criss duetted on Elton John and Kiki Dee’s 1976 chart-topper “Don’t Go Breaking My Heart” in homage to lyricist Bernie Taupin, who was in attendance. Clipse teamed up with John Legend for an emotional “The Birds Don’t Sing.” Jennifer Hudson proved yet again that she has one of the most powerful voices in contemporary music with a cover of “The First Time Ever I Saw Your Face” in tribute to the late Roberta Flack. And the three women of Huntr/x from “KPop Demon Hunters” — who are up for four Grammys — soared through “Golden,” with Ejae proving that yes, she really can hit those insanely high notes.\n\n\n\n\t\n\n\t\t\t\t\tDarren Criss and Laufey (Photo by Patrick T. Fallon / AFP via Getty Images)\n\t\t\t\t\t\t\t\t\tAFP via Getty Images\n\t\n\n\n\n\tIn a buzz-worthy kickoff, Gayle King gave an introduction to a recorded video from President Barack Obama, who championed Davis for his contributions to the music industry. “I appreciate the opportunity to introduce my friend and your host, the one and only Clive Davis,” said Obama. “You know Clive isn’t just a legendary music man. He is a force of nature. Clive’s talent has always been seeing and hearing what other people don’t. Janis Joplin, Bruce Springsteen, Whitney Houston. Clive recognized their potential just before anyone else, and then helped them to reach it.” Obama did not touch on politics in the message and there was little mention of it all evening — it’s possible everyone was relieved to have a break from the avalanche of bad news outside the room. \n\n\n\n\t\n\n\t\t\t\t\t Eaje of Huntr/X and Clive Davis  (Photo by Frazer Harrison/Getty Images)\n\t\t\t\t\t\t\t\t\tGetty Images\n\t\n\n\n\n\tLater in the program, Dan + Shay paid tribute to Art Garfunkel with two covers — “All I Know” and “Mrs. Robinson” — before bringing out Garfunkel himself to close the evening with a gentle, goosebumps-inducing version of “Bridge Over Troubled Water.” Obviously, at 84, Garfunkel’s voice is not the powerhouse it was when the song was recorded 55 years ago, but he retains the full measure of his legendary nuance, and the gentle, spare arrangement of this version — primarily piano, with a synthesizer covering the song’s soaring string arrangement — combined with his soft delivery to create an intimacy that the mighty original version does not possess.\n\t\n\n\tThe song — one of the longest and most unorthodox tracks ever to become a No. 1 single — is a milestone in Davis’ unparalleled career, as he was the one who fought for it to be released as a single. It was a fitting and full-circle conclusion of the evening.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Olivia Dean, Clipse, Ozzy Osbourne Tribute and a Message From Barack Obama Light Up Clive Davis Pre-Grammy Party",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/GettyImages-2258750185-e1769972682580.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-01T19:09:05.000Z",
      "dateModified": "2026-02-01T19:09:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘To Hold a Mountain’ Review: Sundance Award Winner Reveals the Strength and Beauty of Observational Nonfiction",
    "url": "https://variety.com/2026/film/reviews/to-hold-a-mountain-review-1236646563/",
    "image": "https://variety.com/wp-content/uploads/2026/01/To-Hold-a-Mountain.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-01T19:55:00.000Z",
    "description": "\n\tFilmmakers Biljana Tutorov and Petar Glomazić pull off a miraculous trick with “To Hold a Mountain.” What begins as a slow-burn observational docume",
    "body": "\n\tFilmmakers Biljana Tutorov and Petar Glomazić pull off a miraculous trick with “To Hold a Mountain.” What begins as a slow-burn observational documentary gradually reveals itself as an emotionally shattering meditation on grief and perseverance. Gorgeously shot with a quiet, deliberate rhythm, it’s the kind of film that entrances its audience without them noticing. Only at the end does the audience fully grasp the magnitude of the story it chronicles and the natural beauty of the images they have been witnessing all along. \n\t\n\n\tFilmed in the summer months in the remote highlands of Montenegro’s Sinjajevina plateau, “Hold a Mountain” follows middle-aged animal herder and farmer Gara. She lives a busy life on the mountain, full of constant, tiresome work on the terrain with the animals. Her 13-year-old daughter Nada spends some of the summer with her, but also has to leave for school for part of the time, leaving Gara lonely. \n\n\n\tThis intimate and tactile relationship between mother and daughter gives the film its gravitational center. The two are so close to one another, they even sleep on the same small bed. Gara is needy for Nada’s love and appreciation, always asking her to verbally confirm her love. A violent act in their past cemented their connection and Gara’s desperate but gentle need for constant validation from her daughter. “To Hold a Mountain” reveals this as softly and lovingly as Gara takes care of Nada. Their grief is rendered with the utmost sensitivity that the audience has no recourse but to share it with them. \n\n\tWhile Gara and Nada’s bond forms the main narrative thread, “To Hold a Mountain” follows a few others. Gara is shown tending to friendships with the other women in this community as lovingly as she tends to Nada. There are scenes of shared laughter while they wash, dye and brush each other’s hair or milk cows and make cheese. These scenes unfold naturally without voiceover or intertiles to introduce these people, just a compassionate camera and filmmakers following Gara as she goes about her day. \n\t\n\n\tAnother thread that could have formed the bulk of the story — or another film entirely — is about Gara becoming an advocate for this highland community in the media and against the Montenegrin government. The army starts disrupting this tranquil life by conducting NATO-backed military training in the midst of this serene landscape. Gara naturally takes to the cause and emerges as first among equals. \n\n\tThe same tenacity she has for the arduous farmwork she applies here, rallying people for this just cause. But a film about a raucous activist would have had to be a rousing story, and “To Hold a Mountain” is too tender for that. Instead, Tutorov and Glomazić apply their same light touch to these sequences, making them fit well within the precise rhythm of Gara’s story. Being a leader in the larger world is as significant as her taking care of the animals. \n\n\tIn fact, the most thrilling scene in “To Hold a Mountain” is one where Gara and Nada carry a hurt baby calf downhill on a wheelbarrow. As they slowly descend, with the calf’s mother walking in tow, the audience realizes their connection to the land, to the animals and to each other. It isn’t romanticized at all; this is a hard job and it shows. Gara and Nada keep sniping at each other, but ultimately they get the job done in unison, as a family and as the rightful inhabitants of this land. The filmmakers capture all of this with such beauty and empathy, this exhausting undertaking appears lyrical on screen. \n\n\t“To Hold a Mountain” doesn’t just capture the beautiful land and the sun rays on the mountaintops. Eva Kraljević’s camera is also attuned to the hands and arms as they work the land, and to the lined faces as they wince from the hard labor and smile as they enjoy camaraderie. The sound mix takes in the breath of animals and the heavy footsteps on the ground as if “To Hold a Mountain” was a big, thrilling movie and these were its very special effects. The end result is comparable: a captivated and moved audience. \n\n\t“To Hold a Mountain” is quiet in its storytelling and appears small in its ambitions, but ultimately feels volcanic in the emotions it stirs.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘To Hold a Mountain’ Review: Sundance Award Winner Reveals the Strength and Beauty of Observational Nonfiction",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/To-Hold-a-Mountain.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-01T19:55:00.000Z",
      "dateModified": "2026-02-01T19:55:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Who'd You Rather?! Icons At The Grammys Edition!",
    "url": "https://www.tmz.com/2026/02/01/whod-you-rather-grammys/",
    "image": "https://imagez.tmz.com/image/58/16by9/2025/01/31/58ee806df476432496514a1057286efa_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-01T08:45:53.000Z",
    "description": "\n    \n      \n        \n        \n          Launch Gallery\n        \n                  Getty/TMZ Composite\n              \n    \n    \n          Grammys Sund",
    "body": "\n    \n      \n        \n        \n          Launch Gallery\n        \n                  Getty/TMZ Composite\n              \n    \n    \n          Grammys Sunday is officially here, and we're kickin' things off with a too-hot-to-handle game of .... Who'd You Rather?! Grammys Edition!\n      \n    \n          Reminisce on the most iconic moments over the years and cast your faves 😘!\n      \n    \n          And the winner is ....\n      \n    \n          CLICK TO VOTE NOW!\n      \n      ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Who'd You Rather?! Icons At The Grammys Edition!",
      "image": [
        "https://imagez.tmz.com/image/58/16by9/2025/01/31/58ee806df476432496514a1057286efa_xl.jpg"
      ],
      "datePublished": "2026-02-01T08:45:53.000Z",
      "dateModified": "2026-02-01T08:45:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jarrell \"Big Baby\" Miller Loses Toupee Mid-Fight",
    "url": "https://www.tmz.com/2026/02/01/jarrell-miller-loses-hairpiece-mid-fight/",
    "image": "https://imagez.tmz.com/image/f4/16by9/2026/02/01/f4dd4b6a401342b99a3ed3d418f4ad3d_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-01T17:48:01.000Z",
    "description": "\n    \n                    \n                          Jarrell \"Big Baby\" Miller\n                          Loses Hairpiece Mid-Fight!!!\n                ",
    "body": "\n    \n                    \n                          Jarrell \"Big Baby\" Miller\n                          Loses Hairpiece Mid-Fight!!!\n                      \n                  \n                                                                        Published \n                              February 1, 2026\n                            9:48 AM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Jarrell \"Big Baby\" Miller delivered one of the wildest moments boxing fans have seen in a while Saturday night ... and it had nothing to do with a knockout.\n      \n    \n          Miller earned a split decision win over Kingsley Ibeh at Madison Square Garden, but the fight went viral in Round 2 when Ibeh landed a right uppercut that sent Miller's toupee flying off his head.\n      \n    \n          The crowd was stunned as the hairpiece popped loose and, instead of trying to hide it, Miller owned the moment. Before round 3 even began, Big Baby ripped off the toupee himself and threw it into the stands, where it was grabbed by heavyweight champ Fabio Wardley.\n      \n\n          After the fight, Miller explained the bizarre situation, saying he’d only gotten the hairpiece days earlier after a grooming mishap.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Miller said he lost his hair two days ago, claiming he accidentally washed his hair with ammonia bleach instead of shampoo. \"I'm a comedian,\" he added. \"You have to make fun of yourself.\"\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Jarrell Miller\n              \n                          \n                Celebrity News\n              \n                          \n                Boxing\n              \n                          \n                TMZ Sports\n              \n                          \n                Viral\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jarrell \"Big Baby\" Miller Loses Toupee Mid-Fight",
      "image": [
        "https://imagez.tmz.com/image/f4/16by9/2026/02/01/f4dd4b6a401342b99a3ed3d418f4ad3d_xl.jpg"
      ],
      "datePublished": "2026-02-01T17:48:01.000Z",
      "dateModified": "2026-02-01T17:48:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Snoop Dogg's 10-Month-Old Granddaughter Codi Dies",
    "url": "https://www.tmz.com/2026/01/31/snoop-doggs-infant-granddaughter-dies/",
    "image": "https://imagez.tmz.com/image/c8/16by9/2026/02/01/c89c776d464545f5b7c527ed0fa1b869_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-01T00:40:42.000Z",
    "description": "\n    \n                    \n                          Snoop Dogg\n                          Daughter Cori Announces Death of Her 10-Month-Old Daughter\n ",
    "body": "\n    \n                    \n                          Snoop Dogg\n                          Daughter Cori Announces Death of Her 10-Month-Old Daughter\n                      \n                  \n                                                                        Published \n                              January 31, 2026\n                            4:40 PM PST\n                                                                      |\n                                                                Updated \n                                  January 31, 2026\n                                5:21 PM PST\n                                    \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Snoop Dogg's 10-month-old granddaughter Codi has passed away ... this according to his only daughter, Cori Broadus.\n      \n    \n          Cori announced the news Saturday afternoon ... sharing a black-and-white photo where she's grinning and lovingly holding Codi in her arms.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          She writes that Codi -- the \"love of her life\" -- passed away Monday ... adding an angel wing emoji to the post.\n      \n\n          Codi was born three months premature, Broadus revealed in February of last year ... and Codi spent most of the next 10 months in the neonatal intensive care unit or NICU.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          However, just three weeks ago, Broadus shared a photo of her and Codi at relaxing in bed together ... telling her followers God heard all their prayers.\n      \n    \n          Codi's father, Wayne Deuce, also shared a heartfelt tribute to his daughter ... writing on social media that he will always be with her.\n      \n    \n          RIP\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Snoop Dogg\n              \n                          \n                RIP\n              \n                          \n                Family\n              \n                          \n                Hip Hop\n              \n                          \n                celebrity kids\n              \n                          \n                Music\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Snoop Dogg's 10-Month-Old Granddaughter Codi Dies",
      "image": [
        "https://imagez.tmz.com/image/c8/16by9/2026/02/01/c89c776d464545f5b7c527ed0fa1b869_xl.jpg"
      ],
      "datePublished": "2026-02-01T00:40:42.000Z",
      "dateModified": "2026-02-01T00:40:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Travis Scott Hosts Epic Birthday Party for Stormi & Aire, Kylie Jenner Attends",
    "url": "https://www.tmz.com/2026/02/01/travis-scott-kylie-jenner-celebrate-stormi-aire-birthday/",
    "image": "https://imagez.tmz.com/image/9e/16by9/2026/02/01/9e1069100c314052b508bad5082f0eaf_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-01T13:58:45.000Z",
    "description": "\n    \n                    \n                          Travis Scott\n                          Throws Epic B-Day for Stormi and Aire!!!\n                 ",
    "body": "\n    \n                    \n                          Travis Scott\n                          Throws Epic B-Day for Stormi and Aire!!!\n                          ... Kylie Attends\n                      \n                  \n                                                                        Published \n                              February 1, 2026\n                            5:58 AM PST\n                                                                      |\n                                                                Updated \n                                  February 1, 2026\n                                8:09 AM PST\n                                    \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Travis Scott was the man behind the magic when it came to Stormi and Aire's over-the-top birthday celebration with Kylie Jenner on hand to help celebrate.\n      \n    \n          Videos shared on social media show Kylie and Travis singing \"Happy Birthday\" to Stormi, who turned 8, and Aire, who is turning 4, inside a massive event space transformed into a desert-themed wonderland. The elaborate setup featured towering faux mountains, oversized rocks, and palm trees lining the space, creating a cinematic backdrop for the celebration.\n      \n    \n        Waiting for your permission to load the Instagram Media.\n      \n    \n          And that was just the beginning. The party also included full-on carnival rides set up indoors, giving the kids and guests plenty to do beyond cake and candles. Custom signs reading \"Stormi World\" and \"Planet Aire\" were spotted throughout the venue, making it clear each child had their own universe inside the larger-than-life bash.\n      \n\n          Other clips from the party show Stormi skating around a roller rink built inside the event space, with Travis right by her side. The rapper could be seen holding Stormi's hand and helping her stay steady as she rolled around the rink, clearly in full dad mode.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Notably absent from the festivities was Timothée Chalamet -- Kylie's current boyfriend -- who didn't appear in any of the videos or photos shared from the party.\n      \n    \n          Both parents were super hands-on throughout the day. While the former couple keeps their personal relationship mostly private, they appeared completely united when it came to celebrating their kids in a big way.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Kylie and Travis dated on and off for about six years, first getting together in 2017 before ultimately calling it quits in 2023.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Kylie Jenner\n              \n                          \n                Stormi Webster\n              \n                          \n                Travis Scott\n              \n                          \n                Social Media\n              \n                          \n                Celebrity News\n              \n                          \n                Family\n              \n                          \n                celebrity kids\n              \n                          \n                Birthdays\n              \n                          \n                The Kardashians\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Travis Scott Hosts Epic Birthday Party for Stormi & Aire, Kylie Jenner Attends",
      "image": [
        "https://imagez.tmz.com/image/9e/16by9/2026/02/01/9e1069100c314052b508bad5082f0eaf_xl.jpg"
      ],
      "datePublished": "2026-02-01T13:58:45.000Z",
      "dateModified": "2026-02-01T13:58:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Melania Trump Documentary Earns $7 Million Opening Weekend",
    "url": "https://www.tmz.com/2026/02/01/melania-trump-documentary-earns-millions-opening-weekend/",
    "image": "https://imagez.tmz.com/image/97/16by9/2026/02/01/97182ac6c05f4b8280fab7f9845a4602_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-01T19:14:05.000Z",
    "description": "\n    \n                    \n                          Melania Trump\n                          Doc Scores $7 Million Debut!!!\n                      \n   ",
    "body": "\n    \n                    \n                          Melania Trump\n                          Doc Scores $7 Million Debut!!!\n                      \n                  \n                                                                        Published \n                              February 1, 2026\n                            11:14 AM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Melania Trump is making serious noise at the box office.\n      \n    \n          The First Lady's big budget documentary, \"Melania,\" pulled in $7.04 million during its opening weekend, easily beating expectations and marking the largest opening for a non-fiction film in the past decade, according to Deadline.\n      \n    \n          The debut topped the previous record holder, 2023's \"After Death,\" which opened to $5 million. What makes the win even bigger -- early projections were far more modest. Pre-release estimates had the film opening between $3 million and $5 million, while some analysts predicted an even smaller turnout.\n      \n\n          \"Melania\" premiered Thursday at the newly rebranded Kennedy Center, ahead of its global theatrical release on Friday. The film is backed by a reported $40 million deal with Amazon MGM Studios, along with a hefty $35 million marketing campaign.\n      \n    \n          The doc offers selective glimpses into Melania's life in the weeks leading up to President Donald Trump's second inauguration in January 2025.\n      \n    \n          The film marks director Brett Ratner's return to the big screen after years away following multiple sexual misconduct allegations during the #MeToo movement. No criminal charges were filed against him.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Melania Trump\n              \n                          \n                Donald Trump\n              \n                          \n                Brett Ratner\n              \n                          \n                President Trump\n              \n                          \n                Celebrity News\n              \n                          \n                Money\n              \n                          \n                Movies\n              \n                          \n                Politics\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Melania Trump Documentary Earns $7 Million Opening Weekend",
      "image": [
        "https://imagez.tmz.com/image/97/16by9/2026/02/01/97182ac6c05f4b8280fab7f9845a4602_xl.jpg"
      ],
      "datePublished": "2026-02-01T19:14:05.000Z",
      "dateModified": "2026-02-01T19:14:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]