[
  {
    "title": "Simu Liu and Fala Chen to Co-Chair Unforgettable Awards Ceremony",
    "url": "https://variety.com/2025/awards/news/simu-liu-fala-chen-co-chair-unforgettable-awards-1236591146/",
    "image": "https://variety.com/wp-content/uploads/2025/11/GettyImages-2241657414-1.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-25T16:17:00.000Z",
    "description": "\n\tSimu Liu and Fala Chen will co-chair the 2026 Unforgettable Awards, taking place on March 7, 2026, at the Fairmont Century Plaza in Los Angeles. The",
    "body": "\n\tSimu Liu and Fala Chen will co-chair the 2026 Unforgettable Awards, taking place on March 7, 2026, at the Fairmont Century Plaza in Los Angeles. The ceremony honors artists, visionaries and leaders in film, television, music and culture.\n\n\tPresented by GoldenTV and Character Media, the evening will feature live performances, tributes and award presentations recognizing pioneers and trailblazers across entertainment, fashion and culture.\n\t\n\n\t“Simu and Fala represent the global excellence and creative influence that Unforgettable was created to honor,” Takashi Cheng, CEO of GoldenTV, said in a statement. “Their leadership and visibility continue to pave the way for countless others in the entertainment industry.”\n\n\n\tAs co-chairs, Liu and Chen will oversee the selection committee responsible for reviewing and voting on this year’s nominees. The duo will also deliver a keynote address during the awards dinner. \n\n\tThey join a roster of past co-chairs that includes Daniel Dae Kim, Destin Daniel Cretton, Adele Lim and Lisa Ling.\n\n\t“Working with Fala on ‘Shang-Chi’ was such a formative experience,” Liu said. “I have always admired her artistry and grace, and I am thrilled to be co-chairing Unforgettable together this year. Representation is not just about being seen; it is about belonging, and I am honored to celebrate that with her.”\n\n\tThe two stars previously worked together on Marvel’s ‘Shang-Chi’ and the Legend of the Ten Rings.’ Additionally, Chen presented Liu with the Breakout in Film Award in 2021.\n\n\t“It is truly special to come full circle,” Chen added. “I still remember handing Simu his award at Unforgettable in 2021, and now we are co-chairing this incredible celebration together. The show has always been about recognizing how far we have come and how much further we can go as a community.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Simu Liu and Fala Chen to Co-Chair Unforgettable Awards Ceremony",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/GettyImages-2241657414-1.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-25T16:17:00.000Z",
      "dateModified": "2025-11-25T16:17:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Star Search’ Netflix Reboot Taps Anthony Anderson to Host, Sets January Release Date (EXCLUSIVE)",
    "url": "https://variety.com/2025/tv/news/star-search-netflix-anthony-anderson-host-release-date-1236591589/",
    "image": "https://variety.com/wp-content/uploads/2025/11/Star-Search-Anthony-Anderson-e1764081827542.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-25T15:30:00.000Z",
    "description": "\n\tNetflix‘s upcoming reboot of “Star Search” has named Anthony Anderson as its new host, Variety has learned exclusively. \n\n\tThe new iteration of the ",
    "body": "\n\tNetflix‘s upcoming reboot of “Star Search” has named Anthony Anderson as its new host, Variety has learned exclusively. \n\n\tThe new iteration of the talent competition series will premiere on the streamer on Jan. 13, 2026, with episodes airing live Tuesdays and Wednesdays at 9 p.m. ET/6 p.m. PT. Episodes will include real-time voting for viewers to help pick which contestants advance in the competition. \n\n\n\tNetflix has also released a new teaser for the series, which can be seen below. \n\t\n\n\tThis will not be Anderson’s first hosting gig. He has previously guest hosted shows like “Jimmy Kimmel Live,” “Entertainment Tonight,” and “The Late Late Show,” as well as leading award shows like the Emmys in 2024, the NAACP Image Awards for nearly a decade, and his own Food Network show “Eating America with Anthony Anderson,” among many others. As an actor, Anderson is known for starring in the hit ABC sitcom “Black-ish,” for which he received seven Emmy nominations and two Golden Globe nominations for best actor in a comedy series. His film roles include the “Barbershop” franchise, “Hustle & Flow,” and “The Departed.” \n\n\tHe is repped by UTA, Artists First, and Goodman Genow.\n\n\tThe official logline for “Star Search” states, “The talent is bigger, the stakes are higher, and the format is more interactive than ever. Each episode will spotlight the best up-and-coming performers across numerous categories – music, dance, variety, comedy, magic and juniors – as they compete head to head for their shot at stardom. With an arced competition structure and weekly eliminations with real-time global voting, the series builds dramatic momentum, making every live episode an unmissable event.” \n\t\n\n\tJason Raff and David Friedman serve as showrunners on the new “Star Search.” Jesse Collins Entertainment is producing, with Collins, Dionne Harmon, Madison Merritt, and Elaine Metaxas executive producing. \n\n\t“Star Search” originally aired in syndication from 1983-1995 with host Ed McMahon, who was later joined by co-host Martha Quinn late in the show’s original run. It served as an early showcase for future stars like Beyoncé, Justin Timberlake, Dave Chappelle, Adam Sandler, Britney Spears, and many more. The show was also briefly rebooted at CBS in 2003 for one season. \n\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Star Search’ Netflix Reboot Taps Anthony Anderson to Host, Sets January Release Date (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/Star-Search-Anthony-Anderson-e1764081827542.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-25T15:30:00.000Z",
      "dateModified": "2025-11-25T15:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Elton John Is Still Standing: The Legend on Performing Plans, Loving Chappell Roan and His Legacy of Raising $650 Million for HIV/AIDS",
    "url": "https://variety.com/2025/music/features/elton-john-retirement-new-music-aids-foundation-1236591288/",
    "image": "https://variety.com/wp-content/uploads/2025/11/Elton-John-Variety.jpg?crop=0px%2C86px%2C1500px%2C843px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-11-25T16:00:00.000Z",
    "description": "\n\tThe artwork Elton John has displayed on the walls of his home in the Hollywood Hills wasn’t necessarily intended to reinforce a running theme. Yet y",
    "body": "\n\tThe artwork Elton John has displayed on the walls of his home in the Hollywood Hills wasn’t necessarily intended to reinforce a running theme. Yet you can’t help noticing how some of the paintings suggest a preoccupation that has consumed him through nearly four decades. On the wall nearest the picture window overlooking the Los Angeles Basin is one of Andy Warhol’s blazingly chromatic 1960s portraits of Elizabeth Taylor. And in the small dinette off the foyer where we will have an audience with John, there is a Keith Haring original. \n\t\n\n\tThe latter is a painting by a famous figure in the art world who died of AIDS. The other, a loving rendering of an actress who was among the first beloved celebrities bold enough to dedicate herself to the fight against AIDS when the public and government were still largely washing their hands of a “gay plague.” \n\n\n\n\t\n\n\t\n\n\n\n\tSir Elton was not so very far behind Dame Elizabeth when the HIV crisis was at its height, publicly befriending the terminally afflicted teenage victim Ryan White and then, in 1991, establishing the Elton John AIDS Foundation — the entertainment world’s foremost charity devoted to the cause, and the fifth largest HIV philanthropic funder in the world. \n\n\tJohn splits his time between his homes in London and Los Angeles, where he lives with his husband, David Furnish, and their two children, Zachary, 14, and Elijah, 12. In recent years, Furnish has joined John in interviews, partly because they work together as collaborators in addition to being spouses… and because, as chairman of the EJAF, he is the keeper of those facts and figures… and, incidentally, also is the keeper of the app that controls John’s hearing devices. (“I’m too loud now, I’m feeding back,” John tells Furnish. “I’m like Pete Townshend!”) \n\t\n\n\tWhen I arrive at their Los Angeles home, Furnish warmly greets me, and we have a preamble discussion about his and John’s decades of fundraising, before John appears at the table in the kind of sudden, magical, slightly stealthy way that has tended to occur since he was beset by vision problems in the past couple years. As it happens, John is in a jovial mood — except for when we pick up the discussion of factors that have stifled a once-stated mission to eradicate new HIV cases worldwide by 2030. \n\n\tWhen it comes to those roadblocks, the bitch is back.\n\n\t“I just am enraged by it,” John says, talking about goalposts shifting in the U.S. and globally. “It’s very frustrating when you’ve got the tools in your hand to end it, and then you find that countries in Africa, Russia, the Middle East and Eastern Europe won’t help.” \n\n\tThat forces the U.S. to do even more, except the trend is toward budget cutbacks at a time when there is no momentum to ramp up funding associated with the LGBTQ+ community. \n\n\t“You know, there’s a big war that’s being settled, hopefully,” John says, referring to Gaza. “But there’s a war with even more people involved, people who are suffering from HIV and AIDS that should be able to get their medicine but can’t, because governments won’t let them. It’s inhumane. So my big beef at the moment is, yes, thank God, maybe there’s peace, after more things are sorted out. But there are crimes against many millions more people that are happening because of governments and stigma and hate. It’s so frustrating when you have the medicine, you have prep, you have the antiretrovirals. We can stop the spread of AIDS, if people just got off their backsides and treated human beings in a Christian kind of way.” \n\n\t“Elton’s a little blunter than me,” whispers Furnish, chuckling approvingly at how the 20 minutes of numbers crunching and policy wonkdom he just provided have been supplanted by his husband’s display of passion. \n\n\n\n\t\n\n\t\t\t\t\tElton John and Chappell Roan perform onstage at Elton John AIDS Foundation’s 33rd Annual Academy Awards Viewing Party\n\t\t\t\t\t\t\t\t\tMichael Kovac/Getty Images for E\n\t\n\n\n\n\tTwo years ago, John says, they took a trip with a U.S. delegation to South Africa to look at efforts there, and “Lindsey Graham said it was the best bang for your buck you could possibly get.” He likes to point out Republican support like that, past or present, in the instances in which he’s able. “The bipartisan thing makes common sense. To see us come so far with the medical and scientific advances, and to think this is the only disease that can be completely cured in one’s lifetime. President Trump has maybe solved the peace problem. If he wants to go down as one of the greatest presidents in history … if he ended AIDS, that would really be a feather in his cap.” This is John the businessman talking. Although he politely declined to perform at Trump’s 2016 inauguration, John has a long history of knowing the president, and he understands that speaking in superlatives might possibly move the needle for his cause.\n\t\n\n\tBut couldn’t he just call the president on the phone, the way he does Keir Starmer or Emmanuel Macron? Here, Furnish steps in to answer, saying they have had very positive conversations with representatives in Washington. \n\n\tSitting at this table, John recalls how, in 1991, they gathered around another kitchen table, at their former home in Atlanta, and began mapping out the Elton John AIDS Foundation, in part as a response to what he saw as more wasteful charities. \n\n\t“People trust us because they see the results,” he says. “It’s quite extraordinary what’s happened from that little kitchen table. We’ve now raised over $650 million, but with matching grants, we’re over a billion dollars. But there’s so much more to be doing there. If there’s no dialogue, it may take much longer than we hope it will. You can’t walk away after coming so far. And sometimes you feel like beating your head against a brick wall, but that doesn’t do any good to the people that are suffering.”\n\n\tJohn can relate to suffering right about now. In the summer of 2024, vacationing in France, he contracted an eye infection, with seemingly permanent effects on both eyes, one more drastic than the other. (He’s blind in his right eye.) He does not whitewash the emotional as well as physical effects. But, he says, “I’m really, really lucky. And this helps me, the AIDS Foundation, because when you think, ‘Oh, I’m really feeling sorry for myself,’ and you think of these [AIDS-stricken] people and how much work we’ve gotta do, you soon come out of it.”\n\n\n\tAfter all these decades in music, John is still standing, even if he can’t see much. Sight has not been part of the deal in the arc of Elton John’s ongoing survival story.\n\n\tAny time he makes an appearance these days, he is posed already seated, or seems to have just arrived by magic, as he did today; there is no desire to have his public — or a reporter — see him being led around. Yet, at the same time, it’s as if he has no vanity about it after all, when he candidly discusses where he is with the severity of his vision problems. He is even the first to bring it up.\n\n\n\n\t\n\n\t\t\t\t\tPrince Harry, Duke of Sussex, Sir Elton John, and Ndaba Mandela alongside coalition partners and youth activists at the Launch of the Menstar Coalition To Promote HIV Testing & Treatment of Men\n\t\t\t\t\t\t\t\t\tMichael Kovac/Getty Images for E\n\t\n\n\n\n\t“It’s been devastating,” he says. “Because I lost my right eye and my left eye’s not so good, the last 15 months have been challenging for me because I haven’t been able to see anything, watch anything, read anything. \n\n\t“I’ve had the most incredible life, and there is hope,” he believes. “I’ve just gotta be patient that someday science will help me with this one. Once they help me with this one, I’ll be fine. It’s exactly like the AIDS situation. You mustn’t give up hope, you must be stoic, you must be strong and you must always try and batter the door down to try and improve things.”\n\t\n\n\tFurnish elaborates on where things stand. “We’ve been doing some treatments and there’s been some improvements in his left eye, which is really good, and we’re continuing to explore and getting a lot of outreach from a lot of doctors who want to help and support. Because there’s damage to the retina in his right eye, retinas don’t heal naturally, so it’s an area of emerging science. But things are changing really quickly. What AI is doing for medicine and science alone is astonishing. And there’s all kinds of interesting new theories and breakthroughs, and they can process the data and do the trials a lot more quickly than they could before.”\n\n\tThere is an “on the other hand” for John, amid these trials.\n\n\t“On the other hand, I’ve still been able to play. I’m still singing. We did the Singapore Grand Prix the other day with the band, which was wonderful. I mean, you just have to grin and bear it. It does get me down sometimes. But on the whole, I’ve got a wonderful family; I have two great kids; I have him” — he indicates the oft-beaming Furnish by his side. “Paul McCartney FaceTimes me to see how I’m doing. It’s really beautiful. The love I’ve received from him and from Pete Townshend and Mick Jagger and people like that have been amazing. Or you get an email from Keith Richards saying, ‘Hello, darling, how you doing? You know we love you,’ and that’s it, but it just makes my day.”\n\n\tJohn returns the favor, especially when it comes to playing electronic pen pal to the younger singers he mostly prefers listening to over old favorites. “If you support and you love artists, you keep in touch,” he says. But there’s an extra rationale. “The thing with my iPad is, I can actually see someone close-up. So I often call Chappell, and of course I always call Brandi because she’s one of my best friends. But it’s a way of me staying in communication with people.”\n\n\tNone of John’s maladies are evident as he meets you, seemingly eye to eye, in person. Once in place, he could pass for perfectly sighted.\n\t\n\n\tFurnish says that they have come up with a giant-type computer screen that allows John to do at least a little bit of reading now, with his less compromised eye. John was motivated, his husband notes with perhaps a bit of amusement, by his intense desire to be able to see and keep track of the midweek charts. Once a music geek, always a music geek.\n\n\t“It’s tough to go and see a show,” John admits, “because I saw Chappell out in the desert [at Coachella] and I saw Brandi at the Albert Hall, and they were both incredible shows. But I can’t really see what’s going on.” \n\n\tFurnish has an asterisk for that. “Yeah, but you were giving Brandi lighting notes,” he points out as they both erupt in laughter. “You were in the back of the box at the other end of the Albert Hall, and you were giving her lighting notes! Which I just love.”\n\n\t“I was,” agrees John sheepishly. “At least I can do that.” This could be a sign of the slight improvement in the left eye, Furnish suggests. Or, you know, it may just be Elton John being a boss.\n\n\n\n\n\t\n\n\t\t\t\t\tElton John performs at his farewell tour at Dodger Stadium\n\t\t\t\t\t\t\t\t\tLos Angeles Times via Getty Imag\n\t\n\n\n\n\tThe annual Oscar-viewing parties held by the Elton John AIDS Foundation are another joy in John’s life. Much of what the EJAF does these days is behind the scenes, except for this. “We don’t do many fundraisers now,” John says. “We used to do a white-tie-and-tiara at our house in Windsor every summer, which was incredible. But the Oscar party is now the thing” as the public and media face of the foundation. And it’s grown and grown and grown.\n\n\t“We’re so lucky to have our party as the only charity event on Oscar night,” says Furnish. “Actually, it was Patrick Lippert [a political activist who died in 1993] who put his flag in the soil years ago and then gave the night to EJAF. But we have the largest entertainment charity event of the year, which the whole world is plugged into, and that’s a really great thing. We get tremendous media coverage. And just keeping HIV/AIDS in the dialogue is really important, because the medicines are so successful that people aren’t seeing people still sick and dying from AIDS the way they used to.”\n\n\t“And people really have fun at our Oscar party,” John adds, “and I think they get big bang for their buck, as Lindsey Graham would say.” For one thing, he notes, it’s loose enough that “you can boo the winners. Which I do on a regular basis.” \n\n\tThis past winter, John and Furnish were latecomers to the party, coming by after losing the best song nod they shared with Brandi Carlile; no catcalling occurred. Quite unlike any other Oscar party, stage rushing is a factor toward the end of any EJAF night, especially in a year like this one, when Roan did a headlining set in front of a small but frenzied audience of just under 1,000 partygoers, after not having played in L.A. since rising to stardom. And as Carlile says, “It was great seeing Elton sing ‘Pink Pony Club’ with her. It was perfect when she put the pink cowboy hat on him. Even though I didn’t win an Oscar that night, I saw Elton in a cowboy hat.”\n\t\n\n\tIndeed, when Roan placed the pink totem upon his head, John could not have looked any more like a giddy schoolboy if he were a kid in the front row of “The Eras Tour” being gifted Taylor Swift’s “22” hat. At this late stage in his life, John takes on the role of both mentor to young artists and, in his glee, pure fanboy. He thinks he was among the first to play “Pink Pony Club” on his “Rocket Hour” Apple radio show, and having seen Roan subsequently, he appreciates how the band is “just three girls, no bells and whistles, no dancers, just a really fucking great rock band. And her stagecraft and her way of performing a set, spacing it and everything like that … she’s an old soul. Olivia Dean, Lola Young, same thing — it’s great to see these girls. They’re ready for it.”\n\n\tCarlile and Roan represent almost flip sides of John’s split musical personalities over the decades — Carlile is his early singer-songwriter Honky Chateau side, with a touch of glam-rock; Roan is the flashier Ms. Captain Fantastic, but heavy on the singer-songwriter tip herself. When the two women had a joint conversation at the Grammy Museum early this year, on some level it felt like a gathering of John’s daughters. And they shared with the audience what it is like to get random FaceTime visits from John, with Roan telling how she would be clothes shopping in a thrift store and get a call from John lasting just long enough to make a catty remark about her hair color before hanging up.\n\n\tEd Sheeran has similar Bluetooth convos with John that have nothing to do with music. “He’s obviously got a very funny sense of humor,” Sheeran says. “He’s always, always got some opinion, usually football based. He’ll usually ring me and just swear about some player.” \n\n\tOn a more serious level, Sheeran has an assessment of where John’s legacy lies. “I love his passion for younger artists, and I love his musical journey. I think it’s important for artists like me to see how his career persists and isn’t just uphill or downhill — it traverses.” \n\t\n\n\tReferring to the Elton John AIDS Foundation and his related consciousness raising, Sheeran notes: “I think that, even more than his music, in some ways, will be his legacy.”\n\n\tEven as he struggles to see, John won’t exactly be mistaken for a shut-in, even with a far less busy schedule on the heels of his much-celebrated retirement from touring, which included a series of 2022 U.S. farewell shows at Dodger Stadium, before his farewell tour finally tapered off in Europe the following year. In fact, he remains a semi-active performer, and a galvanizing one. Fans got a glimpse of that when he recently did “Saturday Night Live” and a TV special filmed at the London Palladium to promote the collaborative album he released with Carlile earlier in 2025, “Who Believes in Angels?” On top of that, he does one-off gigs, many of them private acoustic shows-for-hire for 200 to 300 people, and a few of them public, like a San Diego stadium show he did with his band a few months ago as a benefit for a hearing foundation. \n\n\tAnyone who has seen him in recent years, before or after the supposed retirement, knows he remains in top musical form. He may need to be led to the piano before the lights come up, but once there — to quote a song he once sang — “he’s got crazy flipper fingers, never seen him fail.” The voice: still utterly there too.\n\n\tFor anyone unclear on the concept of why John is still at it: “Elton always said he was retiring from touring, not retiring from working,” Furnish says.\n\n\tJohn says: “I’ll have done 11 private shows by the end of the year, which I’ve never done in my life — some solo, some with the band. And it’s been fun, because I was terrified I wouldn’t be able to see the piano keys or the microphone. And I can see, because everything’s so close up. What I can’t see when I’m playing with the band is the band, which is a bit of a nightmare. I can’t see Nigel [Olsson], the drummer, so I have to have Davey [Johnstone, John’s lead guitarist] or somebody say, ‘OK, this is where it ends,’ and make sure we’re in sync. \n\n\t“But I tell you what, I’m singing better than I’ve ever done before, and I’m playing really well, and I’m enjoying it, and that is helping me a lot. Music has been my whole life and has given me so much and takes me on journeys that I never thought I would ever go on — and it’s still doing that. I just like doing the odd thing. It pays the rent very well, and it keeps me musical. I just can’t wait to go into the studio now and write some new songs and go from there.”\n\n\tWill he be able to read Bernie Taupin’s lyrics, to write music from? Yes, says Furnish. “This is where we’re getting encouraging little baby steps, going in the right direction, which is really good. We [found] a teleprompter with a green typeface, which is easier for him to read. And we got the font size great, and we just put that in front of him when he’s writing at the piano. It’s just like having Bernie’s handwritten sheet of lyrics in the ’70s.” \n\t\n\n\tJohn says, “I’ve got seven new lyrics from Bernie, and David read them to me the other night and they’re really, really good, so I can’t wait to go in the studio with Andrew [Watt, his recent favorite producer] and just write and see what happens.”\n\n\tHe is currently up for two Grammys for “Who Believes in Angels?,” his collaborative album with Brandi Carlile, recorded in late 2023 and released early this year — best traditional pop vocal album, and best song written for visual media (for “Never Too Late”). It was predicted to get an album of the year nomination but missed out there, with veterans typically left in the lurch in today’s Grammys — although John notes that even in his commercial heyday it was not happening. “I’ve never been a favorite of the Grammys, I have to say. It’s been very rare that I’ve won anything,” he notes. “I won something for ‘The Lion King,” he points out (that marked the first time he won anything for a solo vocal recording). Furnish is slightly flabbergasted: “Elton and Bernie have never won a Grammy — can you believe that? — as a pair of songwriters.” So if he and Taupin pick up the award for song for visual media, that will, bizarrely, mark a first.\n\n\tJohn remains extremely proud of this year’s release with Carlile, which debuted at No. 1 in the U.K. and in the top 10 in the U.S. “When I did the record with Brandi, I said, ‘You’re established in America, but I want this record to establish you in other places,’ and that was one of the main reasons to do it.’ After we did the Palladium together, she did the Albert Hall; she has a huge following now, there, and a following in Australia, and she just went back to England to do promotions (for her own solo album, “Returning to Myself”), and I can’t believe how many people turned up. I wanted her to become an international artist, and  that album has pushed her into the fore in those countries. So it did the job. …. (An award) would be nice because I believe in the album and it didn’t sell as well as we hoped it would, but of course it’s a different ballgame now. I follow the charts every week. It’s not that kind of album.” \n\n\tThe next project won’t be as retro/early-‘70s-redolent an album as “Who Believes in Angels?” “The album with Brandi, it’s a timeless record, but it’s not of its time. We just wanted to make a record that we loved, with great songs. That was a yesterday record, and it was fantastic. But there is a part of me that wants to do a much more commercial record and do more Bernie Taupin songs that are more of today than yesterday.”\n\n\tHe’s grateful he quit the road when he did, partly to go out as a regular tourer still at the top of his abilities, largely to spend more time with his and Furnish’s boys. A song that Carlile wrote for the duo album about the slow emotional separation of parents and children, “You Without Me,” meant a lot to Elton, as someone about to experience more of that as the kids go through their teen years. “We kind of went through that with our eldest son going to boarding school, and our other son will be joining him next September, and then we’ll be alone in their house until they come home every third weekend. So, yes, it’s happening to us as it was happening to Brandi, although her kids haven’t gone away yet. But yes, we’re so close to our children, as they are to theirs, that it’s gonna have an effect on us.”\n\t\n\n\tBut the prospect of not having the kids at home full-time as of next fall doesn’t mean that he’ll get bored and renege on his vow to leave the road in the dust.  \n\n\t“Touring is verboten,” he declares. “When I did the ‘Spinal Tap’ film and we drove into the Coliseum in New Orleans, I went, ‘David, I’m having hives. I’m backstage, and I don’t want to ever be in a place like this ever again!”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Elton John Is Still Standing: The Legend on Performing Plans, Loving Chappell Roan and His Legacy of Raising $650 Million for HIV/AIDS",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/Elton-John-Variety.jpg?crop=0px%2C86px%2C1500px%2C843px&resize=1000%2C563"
      ],
      "datePublished": "2025-11-25T16:00:00.000Z",
      "dateModified": "2025-11-25T16:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Riverdale’ Star Madelaine Petsch, ‘Summer I Turned Pretty’s’ Gavin Casalegno to Lead Wattpad Adaptation ‘Chasing Red’",
    "url": "https://variety.com/2025/film/global/madelaine-petsch-gavin-casalegno-chasing-red-movie-1236591536/",
    "image": "https://variety.com/wp-content/uploads/2025/11/petsch-caselegno.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-25T16:00:00.000Z",
    "description": "\n\tThe movie adaptation of Isabelle Robin’s young adult romance “Chasing Red,” which became major hit on online platform Wattpad, is taking shape, with",
    "body": "\n\tThe movie adaptation of Isabelle Robin’s young adult romance “Chasing Red,” which became major hit on online platform Wattpad, is taking shape, with its two central lovebirds now found and a shoot set for next year.\n\n\tMadelaine Petsch (“The Strangers”) and Gavin Casalegno (“The Summer I Turned Pretty”) will star in the feature, with Mackenzie Munro directing from a screenplay by Lauren Schacher (“Hooking Up”). Munro directed Wattpad’s first independently financed romantic comedy feature based on its popular story “Boot Camp.” \n\t\n\n\t“Chasing Red” follows straight-A student Veronica (Petsch), who refuses to be college heartthrob Caleb’s (Casalegno) next “conquest,” even after a chance encounter sparks an undeniable attraction between them. On the run from a painful past and with nowhere to go, Veronica ends up under Caleb’s roof. As their chemistry turns electric and secrets unravel, love and betrayal collide in this addictive, slow-burn romance.\n\n\n\tThe film is produced by Greg Silverman and Grant Torre of Stampede Ventures (“Motor City”) and David Madden and Jason Goldberg of Webtoon Productions (the “After” franchise). Production is due to kick off in early 2026 in Saudi Arabia’s AlUla region. \n\n\tWattpad is the publisher of the “After” romance series, which went on to make $168M at the global box office. “Chasing Red” is Wattpad’s 2nd most popular English-language title, with 261 million reads online. It has already been adapted into a hit Webtoon webcomic with 24 million views, and published as a print novel from Sourcebooks and a graphic novel from Webtoon Unscrolled.\n\t\n\n\tMister Smith Entertainment (MSE) are handling international sales and has completed a raft of deals with Amazon’s Prime Video in the U.K., Canada, Australia/New Zealand, France and Benelux. Other territory sales include Capelight in Germany; Leone Film Group in Italy; Sun/Diamond in Latin America, Spain, Portugal and South Africa; Svensk in Scandinavia; Front Row Filmed Entertainment in the Middle East; Ascot Elite in Switzerland; Monolith in Poland; Vertical Distribution in Romania, Hungary and Bulgaria; AQS in Czech Republic and Slovakia; Blitz Film in Ex-Yugoslavia; Green Light Films in Ukraine; United King in Israel; The Film Group in Greece; TME in Turkey; and Star Entertainment in India. \n\n\t“Mackenzie brings such an elevated, romantic vision to Isabelle Ronin’s captivating love story that developed an astounding following on Wattpad, and Madelaine and Gavin are the perfect actors to finally bring Veronica and Caleb’s story to audiences around the world,” said Stampede Ventures’ founder and CEO Greg Silverman.\n\n\t“With compelling romance, high emotional stakes, and a massive built-in fanbase, this is a surefire opportunity for international buyers looking to tap into the same global audience that propelled franchises like ‘After,'” added Mister Smith Entertainment’s senior vice president of international sales & acquisitions Shane Kelly.\n\n\t“With a passionate fanbase and incredible cast, Chasing Red is one of the hottest packages on the market,” said David Madden, President of Webtoon Productions.\n\n\tPetsch is represented by CAA, Mosaic, The Lede Company and Goodman, Genow, Schenkman, Smelkinson & Christopher. Casalegno is represented by Bold Agency, UTA, Luber Roklin Entertainment, Vision PR and Skrzyniarz & Mallean. Munro is represented by Sugar23 and Goodman, Genow, Schenkman, Smelkinson + Christopher, LLP.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Riverdale’ Star Madelaine Petsch, ‘Summer I Turned Pretty’s’ Gavin Casalegno to Lead Wattpad Adaptation ‘Chasing Red’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/petsch-caselegno.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-25T16:00:00.000Z",
      "dateModified": "2025-11-25T16:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Wicked’ Sequels Being Figured Out at Universal Pictures: ‘Things Are Underway’ to See How ‘We Can Continue in This Universe’",
    "url": "https://variety.com/2025/film/news/wicked-for-good-sequel-universal-continue-franchise-1236591573/",
    "image": "https://variety.com/wp-content/uploads/2024/11/wicked_da2de8.png?crop=0px%2C78px%2C2572px%2C1447px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-11-25T15:04:10.000Z",
    "description": "\n\tAfter “Wicked: For Good’s” record-breaking start at the box office, Universal Pictures is ready for more stories set in the Land of Oz. Michael Mose",
    "body": "\n\tAfter “Wicked: For Good’s” record-breaking start at the box office, Universal Pictures is ready for more stories set in the Land of Oz. Michael Moses, the studio’s chief marketing officer, told Vulture that “things” are “underway” to continue the “Wicked” franchise on screen. Whether that means a new movie or a television series remains to be seen, but Universal is clearly interested in expanding the world of “Wicked” and keeping the franchise very much alive.\n\t\n\n\t“Because of ‘Wicked’s’ success but also the fanship, we have almost a responsibility to figure out how we can continue in this universe,” Moses said. “Have we figured it out yet? No. But there are things underway.”\n\n\n\tMoses’ comment follows a recent revelation from Stephen Schwartz, who wrote and composed all of the “Wicked” songs for the musical. He told The Ankler that he already has an idea for a new “Wicked”-related project based on an idea he’s been cooking up with the musical’s book writer Winnie Holzman.\n\n\t“I think the Glinda and Elphaba story feels complete — but there are other aspects that could be explored,” Schwartz said. “Gregory Maguire, the original ‘Wicked’ novelist, has several books, for example. But there’s another idea that Winnie and I are discussing: not a sequel, but an adjunct. Let me put it that way.”\n\n\t“Wicked” is based on Gregory Maguire’s 1995 novel “Wicked: The Life and Times of the Wicked Witch of the West.” To Schwartz’s point, Maguire has written eight sequel novels, so there’s no shortage of material to pull from for a potential new movie. Maguire’s most recent novel was published this year and was an Elphaba prequel story titled “Elphie: A Wicked Childhood.” News broke shortly after “Wicked: For Good” opened in theaters that Maguire is set to release a Glinda prequel story, “Galinda: A Charmed Childhood,” in 2026.\n\t\n\n\tWhether or not Universal plans to have Cynthia Erivo and Ariana Grande back as Elphaba and Glinda remains a question mark, although that seems unlikely if Schwartz feels “the Glinda and Elphaba story feels complete.” The fan adoration for the two actors in these roles has propelled the “Wicked” movies to box office highs, with “Wicked: For Good” setting a new opening record for a Broadway adaptation with $147 million at the domestic box office. The movie opened to $223 million worldwide. The two films are now guaranteed to cross the $1 billion mark during “For Good’s” second weekend in theaters. It’s been an extraordinary success for Universal, which spent roughly $550 million to produce and market both movies.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Wicked’ Sequels Being Figured Out at Universal Pictures: ‘Things Are Underway’ to See How ‘We Can Continue in This Universe’",
      "image": [
        "https://variety.com/wp-content/uploads/2024/11/wicked_da2de8.png?crop=0px%2C78px%2C2572px%2C1447px&resize=1000%2C563"
      ],
      "datePublished": "2025-11-25T15:04:10.000Z",
      "dateModified": "2025-11-25T15:04:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Rainbow Project Launches Archive to Chronicle LGBTQ Representation in Children’s Television and Film (EXCLUSIVE)",
    "url": "https://variety.com/2025/film/columns/rainbow-project-archive-lgbtq-representation-in-childrens-television-and-film-exclusive-1236591135/",
    "image": "https://variety.com/wp-content/uploads/2020/03/steven-universe-series-finale.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-25T16:05:00.000Z",
    "description": "\n\tLGBTQ media advocacy organization The Rainbow Project has launched an archive dedicated to chronicling queer storylines in children’s film and telev",
    "body": "\n\tLGBTQ media advocacy organization The Rainbow Project has launched an archive dedicated to chronicling queer storylines in children’s film and television programming.\n\n\tThe archive features video, audio and written first-person accounts by creatives detailing how they got their projects made, overcoming obstacles and more.\n\n\tThe two-year-old not-for-profit Rainbow Project launched last year with the inaugural Velma Awards to spotlight and honor positive LGBTQ+ representation in kids and family programming.\n\t\n\n\t“This year, The Rainbow Project isn’t just important — it’s essential,” Kristi Reed, who co-founded the organization with Jeremy Blacklow and Chris Nee, said in a statement Tuesday. “We’re watching LGBTQ+ stories quietly disappear from children’s content, and that loss has real impact on young viewers. Our mission is to safeguard visibility, belonging, and truth in the stories that shape kids’ lives. No child should ever have their story erased.”\n\n\n\tThe Rainbow Project founders point to studies that show LGBTQ+ representation in children’s programming has been steadily decreasing since the 2024 presidential election. “It’s an exciting time for the entertainment industry, but it’s also quite a transitional and scary time,” Blacklow said. “Since the beginning of this year with this current administration, we have witnessed a pullback on queer stories and characters on television and streaming services. Whereas in 2024 we had a plethora of honorees, this year we find our numbers basically cut in half. Rather than retreat, we need to push forward and remind the industry not to be scared of great LGBTQ+ characters and storytelling.”\n\t\n\n\n\n\t\n\n\t\n\n\n\n\tThe 2025 Velma categories and winners will be announced in early December. At the moment, the winners total 8, down 40 percent from 2024’s 14 winners.\n\n\tLast year’s honorees included “Fraggle Rock: Back to the Rock,” “Jurassic World: Chaos Theory!,” “Heartstopper,” “Moon Girl and Devil Dinosaur,” “Danny Joe’s Tree House,” “Firebuds,” “The Dragon Prince: Mystery of Aaravos,” “Queer Kid Stuff,” “Let’s Go Bananas,” “Monster High,” “Primos,” “The Fairy Odd Parents: A New Wish” and “The Bravest Knight.” The Legacy Award was presented to “Steven Universe.”\n\n\t“We know that every storyline you see with an LGBTQ+ positive narrative for kids is the end result of a battle that someone waged on behalf of the queer youth under attack in this country,” Nee said. “It was always hard to get these storylines on the air, but now it’s near impossible. It only happens when someone behind the scenes has passionately championed it. The Velmas were created to passionately champion all of those brave creators fighting this fight, and remind them that what they’re doing is making a difference.”\n\n\tFor more information about The Rainbow Project and The Velmas, visit www.therainbowproject.tv.\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Rainbow Project Launches Archive to Chronicle LGBTQ Representation in Children’s Television and Film (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2020/03/steven-universe-series-finale.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-25T16:05:00.000Z",
      "dateModified": "2025-11-25T16:05:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Fantasy Drama Series ‘All Heroes Are Bastards’ Acquired by Global Constellation (EXCLUSIVE)",
    "url": "https://variety.com/2025/tv/global/all-heroes-are-bastards-global-constellation-1236591597/",
    "image": "https://variety.com/wp-content/uploads/2025/11/All-Heroes-Are-Bastards.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-25T14:54:39.000Z",
    "description": "\n\tGlobal Constellation has acquired the global distribution rights to the fantasy drama series “All Heroes Are Bastards.”\n\n\tThe six-part German show, ",
    "body": "\n\tGlobal Constellation has acquired the global distribution rights to the fantasy drama series “All Heroes Are Bastards.”\n\n\tThe six-part German show, written and directed by Esra and Patrick Phul, is in post-production and is set to be delivered at the end of next year.\n\n\tThe series, set in a radically divided Cologne, with deepening social division that targets migrant communities, tells the story of Malik, Dina and Hamza, three unlikely heroes who discover a mysterious artefact that grants them extraordinary powers.\n\t\n\n\n\n\t\n\n\t\t\t\t\t“All Heroes Are Bastards”\n\t\t\t\t\t\t\t\t\tCourtesy of Picture Me Rollin\n\t\n\n\n\n\tWhen children are suddenly taken from their neighborhood and separated from their families, the trio join forces to find and rescue them. At the same time they are forced to confront systemic oppression – and choose between personal revenge or becoming the last hope for a community fighting a corrupt regime.\n\n\n\t“All Heroes Are Bastards” stars Kebir Sargin (also known as Sero El Mero) in his debut acting role, alongside David Mayonga (“Girl You Know It’s True,” “Wholetrain”), Funda Bostanlik (“Cinayet-I Ask,” “Siginak”), and Pegah Ferydoni (“A Murder at the End of the World,” “Turkish for Beginners”).\n\n\tThe series is produced by Picture Me Rollin and Bildundtonfabrik for ARD Degeto Film in Germany with the support of Film- und Medienstiftung NRW and the German Motion Picture Fund.\n\n\tEsra and Patrick Phul, founders of Picture Me Rollin, created, directed, wrote and executive produced the series, alongside executive producers Philipp Käßbohrer and Matthias Murmann from production company Bildundtonfabrik (“How to Sell Drugs Online (Fast),” “King of Stonks,” “Pauline”).\n\t\n\n\tEsra and Patrick Phul said: “Our goal was to open up a new space for German genre storytelling – bold, character-driven and internationally relevant. The themes we address in ‘All Heroes Are Bastards’ are both universal and socially urgent, yet told in a way that hasn’t been seen before. We’re excited to bring this vision to audiences around the world.”\n\n\tUlrike Schröder, managing director of TV at Global Constellation, said: “ ‘All Heroes Are Bastards’ exemplifies the sort of daring, market-aligned and commercially responsive storytelling that defines Global Constellation’s slate. Esra and Patrick Phul, and the rest of the team behind this are all extraordinary creators, and we are proud to help bring their compelling vision to audiences worldwide, and the bold voices and stories that truly resonate across borders.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Fantasy Drama Series ‘All Heroes Are Bastards’ Acquired by Global Constellation (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/All-Heroes-Are-Bastards.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-25T14:54:39.000Z",
      "dateModified": "2025-11-25T14:54:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "It’s About Time Spotify Raised Subscription Prices in the U.S. (Opinion)",
    "url": "https://variety.com/2025/digital/news/spotify-raise-subscription-prices-in-united-states-1236591637/",
    "image": "https://variety.com/wp-content/uploads/2025/11/GettyImages-1553084854.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-25T16:00:58.000Z",
    "description": "\n\tIn this economy, how many worthwhile things can you buy for $11.99 or less? A couple of cans of unhealthy soda, maybe a quarter tank of gas, a slice",
    "body": "\n\tIn this economy, how many worthwhile things can you buy for $11.99 or less? A couple of cans of unhealthy soda, maybe a quarter tank of gas, a slice of pizza, four rides on the New York City subway, an extortionately priced cup of fancy coffee… or a month-long subscription to the biggest (licensed) music library in the world.\n\n\tWhich is the best deal by far? Music might not prevent you from starving from hunger, but it will keep you alive in other ways. And the long-rumored news that Spotify will soon raise subscription prices in the U.S. by a whopping dollar per month to $12.99 could not be more welcome for the music economy — as long as that estimated $500 million lift in annual revenue is being used in a way that helps musicians and songwriters as well as music companies, Spotify and its investors.\n\t\n\n\tThe gramophone, the transistor radio, the cassette player, MTV, the Walkman and discman, the iPod and Spotify — those are the greatest inventions in the past century of music listening, because they revolutionized how and where we listen and they enabled us to customize our experience. And in the case of Spotify, it was the consummation of music geeks’ wildest dream: a literally unlimited supply of nearly everything (everything legal, anyway) you could possibly want to listen to. Back when you had to pay for music, $11.99 bought an old, discounted CD, and if you didn’t like it, you had to try to find something wrong with it so you could (hopefully) exchange it for something else, or just suck it up. I can remember being a kid, fantasizing about being able to listen to every record in my local record store.\n\t\n\n\tAnd suddenly, in 2011, I could.\n\n\tSpotify’s true genius wasn’t only in ubiquity and providing a nearly limitless library of music — it convinced a generation that was used to getting music for free, via illegal downloading, that it was worth paying for. It singlehandedly saved a music industry that had been in freefall — that literally lost half of its value, falling from $14 billion to $7 billion in a handful of years — and within three years, profits were rising again. Musicians and songwriters who had been losing money by releasing music began making at least something rather than nothing, even if it was literally a fraction of what they’d been making from CD or vinyl sales — but the major music companies and Spotify were living off the fat of the land again.\n\n\tAnd therein lies the problem with streaming: With an average of $0.003 to $0.004 generated per stream, only the top-streamed artists can make a living; and with approximately 25% of that $0.003 to $0.004 going to the song’s (usually) multiple songwriters and publishers, they make dramatically less. So where is your $11.99 going?\n\n\tIf you look at Spotify, it’s easy to think that it’s going into the pockets of investors and the purported evil genius behind the company, co-founder and chairman Daniel Ek, whose estimated net worth is $8.5 billion. The company throws lavish parties with lots of free stuff, it has grandiose offices, it inexplicably spent $300 million on sponsoring Barcelona’s soccer team (claiming that there was value in having its logo and artists’ names on the players’ uniforms and other signage), it even spends exorbitant sums on things that are extremely cool but fiscally indefensible, like renting out all of the advertising space in the Broadway-Lafayette subway station in New York to create a month-long mini-David Bowie museum. Ek’s Silicon Valley mentality, obsession with market share and frequent foot-in-mouth statements have contributed vastly to the company’s image problems.\n\n\tYet much of what people consider “evil” about Spotify is actually the fault of the major music companies. In most cases, that’s who Spotify actually pays, and that’s who determines just how much of that $0.003 to $0.004 the artists are getting. In an even more flawed system, publishing and songwriter earnings are set by the government. And although the National Music Publishers Association and pro-songwriter organizations like Songwriters of North America and Nashville Songwriters Assn. International have done a herculean job of lobbying to raise the paltry rates that songwriters receive, it’s still nowhere near enough.\n\t\n\n\tDespite its size and might, Spotify has little leverage over music companies — Ek had to give them shares in the company in order to launch in the U.S. (resulting in a massive profit when the Spotify went public in 2018 that some majors eventually, grudgingly shared with artists once they got called out), and they own or distribute most of the music that Spotify is nothing without.\n\n\tSo despite Spotify’s flamboyant spending and efforts to save money through bait-and-switch tactics like automatically granting audiobook access that few people want in an effort to diminish the royalties they pay to music companies and musicians, this terminally unfair streaming economy is not its fault, although the company is rarely making it better. After all, Spotify paid out $10 billion to the music industry in 2024, and $60 billion since 2008. Musicians and songwriters may well be wondering where their share of that $60 billion went.\n\n\tThe entire streaming economy needs to be reinvented.\n\n\tStreaming payments, including Spotify’s, are based on an artist or song’s percentage of Spotify’s total global streams, which is why it favors superstars so disproportionately. Countless alternate methods have been proposed — most often, the “per user” model, whereby you pay only for what you listen to — but have not been adopted, because they’re flawed or impractical or too easy to game, as if the current system isn’t rife with scammers. (These are vast oversimplifications, but largely accurate.) Something has to change.\n\n\tThe music companies claim, often convincingly, that they’re working on a more equitable solution for musicians, songwriters and themselves, and point to the streaming companies or the government as the culprit. But the current system is too weighted in their favor for them to work hard to make it more equitable who make the product — yes, product — that they sell.\n\n\tMeanwhile, Spotify itself fights to prove that it can be a profitable business. The other top services, Apple, Amazon and YouTube, have core non-music core businesses that generate unimaginable profits, so they can afford to lose money on music. Spotify doesn’t have anything else except podcasts and audiobooks.\n\n\tSo Spotify, please raise subscription prices in the U.S. Just make sure that as much of that extra revenue as possible is going to the people without whom you are nothing — musicians and songwriters.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "It’s About Time Spotify Raised Subscription Prices in the U.S. (Opinion)",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/GettyImages-1553084854.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-25T16:00:58.000Z",
      "dateModified": "2025-11-25T16:00:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Dhafer L’Abidine on ‘Palestine 36’ and Upcoming Directorial Effort ‘Sophia’: ‘I Wanted Something That Anyone Could Relate to, Whether They’re Western or Middle Eastern’",
    "url": "https://variety.com/2025/film/global/dhafer-labidine-palestine-36-sophia-1236590008/",
    "image": "https://variety.com/wp-content/uploads/2025/11/Dhafer-Labidine.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-25T14:48:23.000Z",
    "description": "\n\tLondon-based Tunisian actor, director and former professional soccer player Dhafer L’Abidine has long been active in the film and TV spheres of both",
    "body": "\n\tLondon-based Tunisian actor, director and former professional soccer player Dhafer L’Abidine has long been active in the film and TV spheres of both the Arab and Western worlds. He played the lead in hit Tunisian TV series “Maktoub” and has also made appearances in Alfonso Cuaron’s “Children of Men,” “Sex and the City 2” and Damien Chazelle’s French Netflix series “The Eddy.”\n\n\tL’Abidine is currently at the inaugural Doha Film Festival in Qatar, serving as a competition jury member and attending as part of the cast of Annemarie Jacir’s historical drama “Palestine 36,” which is playing as a special screening. In “Palestine 36,” L’Abidine plays a wealthy newspaper publisher named Amir who is navigating escalating tensions caused by increasing Jewish immigration to Palestine in 1936 — tensions that sparked a massive revolt against British colonial rule there.\n\t\n\n\tBelow, L’Abidine speaks to Variety about being in Doha and also his latest directorial effort, “Sophia” —following “Ghodwa” and “To My Son” — in which he stars opposite Jessica Brown Findlay (“Downton Abbey”).\n\n\t\n\t\tTell me about being part of “Palestine 36” which, of course, is such a timely film.\t\n\n\tI feel privileged about being invited to be part it because it’s a Palestinian film and I’m Tunisian. It’s a story that affected the future of of Palestine, but also the whole region. Not a lot of people know about what happened between 1936 and 1939. You don’t learn about it in history classes in the West, or even in the Middle East. We all watch the news and we see what’s happening, but a film like “Palestine 36” creates empathy, a connection with what happened there. That’s the importance of this film.\n\t\n\t\n\t\tWhat do you think “Palestine 36” audiences are going to connect with the most?\t\n\n\tSome people might think that this was a land without people. No. The Palestinians have lived there for thousands of years. This was a flourishing land where you had agriculture and rich people. In the film you see the Palestinian upper class, the middle class, the working class and a massive culture that’s been there for centuries. So it’s only the beginning of that story. But I think it’s crucial that this film got made.\n\t\n\t\tTalk to me about begin selected to be part of the inaugural Doha Film Festival jury.\t\n\n\tWhen the Doha/Tribeca film festival started years ago, it was such a breath of fresh air for the region, because it brought quality and big ambition. Then it ended. And now I’m so happy and proud that a [full-fledged Doha festival] is back again. The truth is that the Doha Film Institute (DFI) continued even when its initial festival ended. They have been behind so many films that have gone to festivals and backed new talent. But now I think the DFI also needs this platform and I’m really proud to be part it and to be one of the first members of this first edition’s jury. As for Qatar, it has been a voice of peace and has been trying to resolve so many types of conflicts happening around the world — of course the Palestine issue, but also Ukraine. Similarly, I think the festival’s ambition is also a human one. It’s not just about business. It’s about understanding understand each other and opening channels, culturally, where we can understand each other between East and West.\n\t\n\t\tSpeaking of which, you’ve just directed your third feature, titled “Sophia,” that aims to do just that. Am I right?\t\n\n\tYes. “Sophia” is a story that happens between the U.K. and Tunisia. It’s about an estranged mixed couple who have a small daughter and haven’t seen each other for over six years. When Emily, the wife, arrives in Tunisia to introduce the daughter to her father, the girl disappears. The story starts there. It’s a thriller. I wanted something that anyone could relate to, whether they’re Western or Middle Eastern, Christian or Muslim. I wanted a human story. I’ve tried to make a thriller with a heart. There are other things you discover about them, about their cultures, about misunderstanding, about prejudice. I think it was so important for me, in my third film, to actually cross that bridge. Myself being married to British woman, I’ve lived in the U.K. for many years. I thought there are so many untold stories that could make us sit in a cinema and all feel connected the same way.\n\t\n\n\tThis interview has been edited and condensed for clarity.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Dhafer L’Abidine on ‘Palestine 36’ and Upcoming Directorial Effort ‘Sophia’: ‘I Wanted Something That Anyone Could Relate to, Whether They’re Western or Middle Eastern’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/Dhafer-Labidine.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-25T14:48:23.000Z",
      "dateModified": "2025-11-25T14:48:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘The Voice of Hind Rajab’ Trailer: Volunteers Fight to Save a Young Girl Trapped in Gaza",
    "url": "https://variety.com/2025/film/news/the-voice-of-hind-rajab-trailer-young-girl-trapped-gaza-1236591272/",
    "image": "https://variety.com/wp-content/uploads/2025/11/MixCollage-24-Nov-2025-04-32-PM-569.jpg?crop=0px%2C0px%2C1200px%2C675px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-11-25T15:00:00.000Z",
    "description": "\n\tWilla has released the trailer for “The Voice of Hind Rajab,” one of 2025’s most celebrated international films.\n\n\tWritten and directed by two-time ",
    "body": "\n\tWilla has released the trailer for “The Voice of Hind Rajab,” one of 2025’s most celebrated international films.\n\n\tWritten and directed by two-time Oscar nominee Kaouther Ben Hania, “The Voice of Hind Rajab” won the Silver Lion Grand Jury Prize at the Venice Film Festival, where it reportedly received the longest standing ovation in the festival’s history. The film also received honors at the San Sebastián Film Festival, setting a new record for the festival’s highest score, the Middleburg Film Festival and the Chicago Film Festival.\n\t\n\n\tInspired by real-life events, the film follows Red Crescent volunteers as they fight to rescue a six-year-old girl trapped in a car under fire in Gaza. Cast members include Saja Kilani, Motaz Malhees, Clara Khoury and Amer Hlehel.\n\n\n\tProducers include Nadim Cheikhrouha, Oscar winner Odessa Rae and James Wilson. Brad Pitt, Dede Gardner, Jeremy Kleiner, Rooney Mara, Joaquin Phoenix, Alfonso Cuarón and Jonathan Glazer serve as executive producers. “The Voice of Hind Rajab” is Tunisia’s official submission for the 98th Academy Awards.\n\n\tWilla is a production and distribution company that works to amplify films of cultural and social importance. Its recent projects include Alonso Ruizpalacios’ “La Cocina,” the Sofia Coppola-produced “Fairyland,” “Another Body,” Fawzia Mirza’s “The Queen of My Dreams” and “You Resemble Me,” executive produced by Claire Denis, Spike Lee, Spike Jonze, Riz Ahmed and Alma Har’el. Along with “The Voice of Hind Rajab,” Willa’s upcoming slate includes Denis’ “The Fence.”\n\t\n\n\t“The Voice of Hind Rajab” opens in New York and Los Angeles on Dec. 17 before expanding worldwide. Check out the trailer below.\n\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘The Voice of Hind Rajab’ Trailer: Volunteers Fight to Save a Young Girl Trapped in Gaza",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/MixCollage-24-Nov-2025-04-32-PM-569.jpg?crop=0px%2C0px%2C1200px%2C675px&resize=1000%2C563"
      ],
      "datePublished": "2025-11-25T15:00:00.000Z",
      "dateModified": "2025-11-25T15:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Singer DELAROSA Shot Dead in Parked Car in L.A., Suspects at Large",
    "url": "https://www.tmz.com/2025/11/24/delarosa-killed-la-shooting/",
    "image": "https://imagez.tmz.com/image/f9/16by9/2025/11/24/f938e3ca32c74cb0844fd581ee40ccf6_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-24T23:28:30.000Z",
    "description": "\n    \n                    \n                          Singer DELAROSA\n                          Shot to Death in Parked Car ...\n                       ",
    "body": "\n    \n                    \n                          Singer DELAROSA\n                          Shot to Death in Parked Car ...\n                          Suspects on the Loose\n                      \n                  \n                        Published November 24, 2025 3:28 PM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          A young woman who was shot dead in Northridge, Los Angeles has been identified as Maria De La Rosa, a singer who went by the name DELAROSA.\n      \n    \n          The 22-year-old Latin artist was struck by gunfire in what was described as an \"ambush-style\" killing and died later at the hospital, according to KTLA-TV.\n      \n    \n          LAPD officials told the outlet Monday ... witnesses saw two males run up to a parked vehicle and fired multiple rounds, hitting three people sitting in the car.\n      \n\n                  \n          \n                          \n                \n                                  \n      \n    \n          De La Rosa was rushed to a hospital, where she was pronounced dead. Two other victims in the car were listed in critical condition this weekend.\n      \n    \n          DELAROSA was known for her song \"No Me Llames,\" just released in August.\n      \n    \n          The motive of the shooting is still unknown and the investigation was ongoing.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Fairly Legal\n              \n                          \n                Shootings\n              \n                          \n                News\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Singer DELAROSA Shot Dead in Parked Car in L.A., Suspects at Large",
      "image": [
        "https://imagez.tmz.com/image/f9/16by9/2025/11/24/f938e3ca32c74cb0844fd581ee40ccf6_xl.jpg"
      ],
      "datePublished": "2025-11-24T23:28:30.000Z",
      "dateModified": "2025-11-24T23:28:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'Golden State Killer' Says Split Personality Made Him Murder, Prosecutor Writes",
    "url": "https://www.tmz.com/2025/11/25/golden-state-killer-split-personality-claim/",
    "image": "https://imagez.tmz.com/image/cb/16by9/2025/11/25/cba4d9d4b468464c9d3f894ee09dd58f_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-25T15:32:06.000Z",
    "description": "\n    \n                    \n                          'Golden State Killer'\n                          Split Personality Claim Is Still a Confession ...",
    "body": "\n    \n                    \n                          'Golden State Killer'\n                          Split Personality Claim Is Still a Confession ...\n                          Prosecutor's Book Breaks Down Defense\n                      \n                  \n                        Published November 25, 2025 7:32 AM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          \"Golden State Killer\" Joseph DeAngelo reportedly tried to blame his gruesome murders on having a split personality named Jerry, who \"made\" him commit crimes against his will ... the problem is that actually hurts your case in California.\n      \n    \n          This is according to a new book -- \"The People vs. the Golden State Killer\" -- by Sacramento County District Attorney Thien Ho.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Ho writes DeAngelo muttered to himself in interrogations, saying things like, “I did all that ... I didn’t have the strength to push him out. He made me. He went with me. It was like, in my head, I mean, he’s a part of me. I didn’t want to do those things. I pushed Jerry out and had a happy life. I did all those things. I’ve destroyed all their lives ... I raped. So now I gotta pay the price.\"\n      \n\n          As a former police officer who must have known a little about the law, DeAngelo presumably said these things to lay the groundwork for an insanity defense. But he didn't know enough about the law, because in California that's just a confession.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Ho, who was the lead prosecutor in the case, explained ... \"He tried to establish this split personality defense, but he did it in such an amateurish way that he defeated his insanity defense because insanity in the State of California, you only get it if you don't understand the nature of the wrongfulness of your crimes.”\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Serial killer David Berkowitz -- AKA the \"Son of Sam\" -- tried a similarly ham-fisted move when he initially blamed his murders on his neighbor's dog, Harvey. Berkowitz claimed there was a demon speaking through the Labrador who commanded him to kill. He later admitted he had made the whole thing up, hoping it would help him score an insanity defense.\n      \n    \n          DeAngelo, 80, was taken into custody April 24, 2018 for killings and rapes committed in the 1970s and '80s. He's now incarcerated at California State Prison - Corcoran, serving multiple consecutive life sentences without the possibility of parole.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          We told you about Thien's new book last month ... the prosecutor describes a significant identifying factor in the capture of the serial killer as DeAngelo's microscopic manhood.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Crime & Arrests\n              \n                          \n                Fairly Legal\n              \n                          \n                True Crime\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Golden State Killer' Says Split Personality Made Him Murder, Prosecutor Writes",
      "image": [
        "https://imagez.tmz.com/image/cb/16by9/2025/11/25/cba4d9d4b468464c9d3f894ee09dd58f_xl.jpg"
      ],
      "datePublished": "2025-11-25T15:32:06.000Z",
      "dateModified": "2025-11-25T15:32:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Guess Who This Adorable Baby Turned Into!",
    "url": "https://www.tmz.com/2025/11/25/guess-who-adorable-baby/",
    "image": "https://imagez.tmz.com/image/ac/16by9/2025/11/19/ac05b4f69e4a4e378ca1eb1ec43debb4_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-25T08:45:06.000Z",
    "description": "\n    \n                    \n                          Guess Who This\n                          Adorable Baby\n                          Turned Into!\n   ",
    "body": "\n    \n                    \n                          Guess Who This\n                          Adorable Baby\n                          Turned Into!\n                      \n                  \n                        Published November 25, 2025 12:45 AM PST\n                                                                            \n      \n    \n      \n        \n              \n    \n    \n          Before this baby with adorable rolls turned into a handsome actor, he was just a cool kid in Connecticut, strumming his guitar and playing the piano.\n      \n    \n          He rose to stardom playing \"John Tucker\" and played Eva Longoria's gardener.\n      \n    \n          Can you guess who he is?\n      \n      \n      \n          \n            \n              \n                \n                Share on Facebook\n              \n            \n            \n              \n                \n                Share on X\n              \n            \n                          \n                \n                  \n                \n              \n                      \n        \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Movies\n              \n                          \n                Guess Who\n              \n                          \n                Kids\n              \n                          \n                celebrity kids\n              \n                          \n                Photo Galleries\n              \n                      \n        \n          \n  ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Guess Who This Adorable Baby Turned Into!",
      "image": [
        "https://imagez.tmz.com/image/ac/16by9/2025/11/19/ac05b4f69e4a4e378ca1eb1ec43debb4_xl.jpg"
      ],
      "datePublished": "2025-11-25T08:45:06.000Z",
      "dateModified": "2025-11-25T08:45:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Justin Bieber's 1968 Cadillac Used In 'Peaches' Video Hits Auction",
    "url": "https://www.tmz.com/2025/11/25/justin-bieber-peaches-cadillac-auction/",
    "image": "https://imagez.tmz.com/image/90/16by9/2025/11/24/90aba36d58d24fbe80a8d6657a5d9527_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-25T09:00:16.000Z",
    "description": "\n    \n                    \n                          Justin Bieber\n                          'Peaches' Ride Goes to Auction ...\n                      ",
    "body": "\n    \n                    \n                          Justin Bieber\n                          'Peaches' Ride Goes to Auction ...\n                          Sweet Deal If You Can Afford It!!!\n                      \n                  \n                        Published November 25, 2025 1:00 AM PST\n                                                                      |\n                Updated November 25, 2025 7:55 AM PST\n                                    \n      \n    \n          Justin Bieber’s ride from his smash-hit \"Peaches\" music video -- the 1968 Cadillac Coupe DeVille -- is hittin' the auction block ... and it sure ain’t cheap.\n      \n    \n          The iconic whip is up on Gotta Have Rock & Roll with a minimum bid of $110K -- and the auction runs till Dec. 5 ... peachy perfect if your wallet can keep up!\n      \n    \n          The car was featured all over Bieber's vid where he drove it and danced on it -- racking up 826M views and almost 2B streams. Impressive.\n      \n\n          On top of that, it's in great condition with a fresh paint job, giving it a brand-new feel, and only 30K miles ... making it a must-have for any serious collector.\n      \n    \n          The consignor says proceeds go to charity ... turning this peachy ride into a good-deed machine!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Justin Bieber\n              \n                          \n                Celebrity News\n              \n                          \n                Cars\n              \n                          \n                Music\n              \n                          \n                Fairly Legal\n              \n                          \n                Music Videos\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Justin Bieber's 1968 Cadillac Used In 'Peaches' Video Hits Auction",
      "image": [
        "https://imagez.tmz.com/image/90/16by9/2025/11/24/90aba36d58d24fbe80a8d6657a5d9527_xl.jpg"
      ],
      "datePublished": "2025-11-25T09:00:16.000Z",
      "dateModified": "2025-11-25T09:00:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'Dancing With The Stars' Season 34 Behind The Scenes",
    "url": "https://www.tmz.com/2025/11/25/dancing-with-the-stars-backstage/",
    "image": "https://imagez.tmz.com/image/0a/16by9/2025/11/18/0adcfeb08e654046a93b0820cb80d413_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-25T08:01:43.000Z",
    "description": "\n    \n                    \n                          'DWTS' Season 34\n                          Go Behind The Scenes ...\n                          Bef",
    "body": "\n    \n                    \n                          'DWTS' Season 34\n                          Go Behind The Scenes ...\n                          Before The Finale!!!\n                      \n                  \n                        Published November 25, 2025 12:01 AM PST\n                                                                            \n      \n    \n      \n        \n              \n    \n    \n          A new \"Dancing with the Stars\" champion will be crowned tonight ... and we're going behind the scenes on the dancing competition show before the big finale.\n      \n    \n          Season 34 wraps tonight with a 3-hour event as the finalists dance it out for the Mirrorball Trophy.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Olympian Jordan Chiles, social media star Alix Earle, actor Dylan Efron, actress Elaine Hendrix, and wildlife conservationist Robert Irwin are still in the running ... but before we get a champ, let's take a peek behind the scenes at what's been another entertaining season.\n      \n\n                  \n          \n                          \n                \n                                  \n      \n    \n          Click through the gallery to see this year's stars and their dance partners cheesing when the cameras weren't rolling ... they're working hard and having fun in the studio, backstage, in their trailers, on set and more!!!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Robert Irwin\n              \n                          \n                Alix Earle\n              \n                          \n                Dylan Efron\n              \n                          \n                Reality TV\n              \n                          \n                Photo Galleries\n              \n                          \n                Fairly Legal\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Dancing With The Stars' Season 34 Behind The Scenes",
      "image": [
        "https://imagez.tmz.com/image/0a/16by9/2025/11/18/0adcfeb08e654046a93b0820cb80d413_xl.jpg"
      ],
      "datePublished": "2025-11-25T08:01:43.000Z",
      "dateModified": "2025-11-25T08:01:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]