[
  {
    "title": "Robert Duvall Remembered by Adam Sandler, Viola Davis, Michael Keaton and More: ‘He Was Greatness Personified as an Actor’",
    "url": "https://variety.com/2026/film/news/robert-duvall-tributes-adam-sandler-viola-davis-1236664773/",
    "image": "https://variety.com/wp-content/uploads/2026/02/GettyImages-542334696.jpg?crop=0px%2C85px%2C5109px%2C2874px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-02-16T20:19:48.000Z",
    "description": "\n\tHollywood tributes are pouring out for Robert Duvall, who died on Monday at the age of 95.\n\n\tDuvall’s death was announced on Facebook via a statemen",
    "body": "\n\tHollywood tributes are pouring out for Robert Duvall, who died on Monday at the age of 95.\n\n\tDuvall’s death was announced on Facebook via a statement from his wife, Luciana Duvall.\n\n\tAdam Sandler, who appeared alongside Duvall in the 2022 film “Hustle,” shared a heartfelt remembrance on Instagram. He wrote that the Hollywood icon was “one of the greatest actors we ever had.” \n\n\n\t“Such a great man to talk to and laugh with,” Sandler wrote. “Loved him so much. We all did. So many movies to choose from that were legendary. Watch them when you can. Sending his wife Luciana and all his family and friends our condolences.”\n\t\n\n\tViola Davis wrote on Instagram Threads that it was an “honor” to appear alongside Duvall in the 2018 thriller “Windows.”\n\n\t“I was in awe,” Davis added, “I’ve always been in awe of your towering portrayals of men who were both quiet and dominating in their humanness. You were a giant… an icon… ‘Apocalypse Now,’ ‘The Godfather,’ ‘To Kill a Mockingbird,’ ‘Tender Mercies,’ ‘The Apostle,’ ‘Lonesome Dove’… etc… Greatness never dies. It stays… as a gift. Rest well, sir. Your name will be spoken… May flights of angels sing thee to thy rest.”\n\n\tMichael Keaton, who starred with Duvall in Ron Howard’s 1994 workplace comedy “The Paper,” shared a portrait of the “Tender Mercies” star on Instagram with the caption, “Another friend goes down. Acted with and became friends. Shared a great afternoon on my front porch talking about horses. He was greatness personified as an actor. RIP RD.”\n\n\t“Fallout” star Walton Goggins, who appeared in a small role in 1997’s “The Apostle,” which Duvall directed and starred in, wrote on Instagram in a lengthy tribute, “The celestial light just lost its glow..It certainly did for me. Bobby Duvall, the greatest storyteller of all time just left us.He was my friend. My mentor. I’ve had these photos with me for 30 years. They were taken by the still photographer on the set of THE APOSTLE, the movie he wrote and directed. I was 24. The privilege of getting to work with this man, to know this man is still the most important experience of my life. He was my North Star, my hero.”\n\t\n\n\tScott Cooper, who directed Duvall in “Crazy Heart” and his final film “The Pale Blue Heart,” said in a statement that he considered “The Godfather” star his “most important artistic mentor.”\n\n\t“He produced and acted in my first film, ‘Crazy Heart,’ and from that moment forward, read nearly every screenplay I wrote, offering his quiet wisdom and unwavering belief in me,” Cooper said. “He was my fiercest supporter—not with grand gestures, but with honesty, rigor, and love for the work itself. His legacy as one of the true giants of acting is secure, but what I will carry with me most is his generosity, his humility, and the example he set of a life devoted entirely to truth. I would not be the filmmaker—or the man—I am without him.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Robert Duvall Remembered by Adam Sandler, Viola Davis, Michael Keaton and More: ‘He Was Greatness Personified as an Actor’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/GettyImages-542334696.jpg?crop=0px%2C85px%2C5109px%2C2874px&resize=1000%2C563"
      ],
      "datePublished": "2026-02-16T20:19:48.000Z",
      "dateModified": "2026-02-16T20:19:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sam Mendes, Chloé Zhao Confront the ‘Emotional Cost’ of Directing: ‘You Soak Up Other People’s Energy, Their Concerns, Their Anxiety, Their Paranoia’",
    "url": "https://variety.com/2026/film/global/sam-mendes-chloe-zhao-emotional-cost-directing-hamnet-1236664653/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Sam-Mendes-Chloe-Zhao.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-16T17:22:38.000Z",
    "description": "\n\tSam Mendes and Chloe Zhao shared an emotional moment after a screening of “Hamnet” in London on Sunday evening after confronting the “emotional cost",
    "body": "\n\tSam Mendes and Chloe Zhao shared an emotional moment after a screening of “Hamnet” in London on Sunday evening after confronting the “emotional cost” of being a director.\n\n\tMendes is one of the producers on “Hamnet,” which has been nominated for eight Oscars and eleven BAFTAs, including for best picture and best director. The film stars Paul Mescal as William Shakespeare and Jessie Buckley as his wife Agnes, following the couple as they endure the loss of their only son.\n\t\n\n\tMendes, who is currently in the middle of shooting his four-film “Beatles” extravaganza, which also stars Mescal as Paul McCartney, interviewed Zhao after the screening, during which he was equally candid about his own experiences as a director.\n\n\n\tOne of the most “tricky” parts of the job, Mendes confessed, was “dealing with other people’s energy and their needs. You soak up a lot of other people’s energy, their concerns, their anxiety, their paranoia, just fear. And you have to soak it up, you have to project an image of calm even when you don’t feel it necessarily. That is the job of a director in many ways.”\n\n\tMendes then asked Zhao directly: “What does it cost you? Because it’s hard and it takes a lot out of you, and how long does it take you to recover? Have you recovered?”\n\n\tZhao took a long pause before replying, “It’s quite an emotional thing you’re saying and I know you feel that too. It does cost something. And only now in my 40s, I’ve come to terms [with it], to say ‘That’s okay.’ Before, I used to hate that, and I would read as many self-help books as possible and go like, ‘I must fix this!’ But alchemy costs things. You can’t transform without letting something die.”\n\t\n\n\t“There’s a certain kind of life that I might have to give up,” the Oscar-nominated director continued. “Certain things that I grew up watching in movies and I’m like, ‘Oh, I wish I had that. It seems so safe and cozy.’ It isn’t going to be like that.”\n\n\t“I used to think that you can have it all. You know, that you could be summer all the time. I hate winter — things die and compost. But now I realize, no, you have to let something die. And as we were talking about earlier, and in the film we tried to talk about, we live in a culture that didn’t teach us how to let go of things and how to let things die. So it feels like the shame – there’s something wrong with me that I can’t make certain parts of my life work, you know, like, why don’t I have this? Why don’t I have that? You know, I don’t have children. I really want to, but I started to wonder if that was [ever] going to come.”\n\n\tMendes then moved the topic onto another difficult – if at least fulfilling – aspect of directing, which is not being able to express emotions when capturing the perfect shot. “You’re rolling a camera and there’s an actor giving something amazing, and you feel triumph and excitement and the heart starts to beat faster, or whatever it is, however you manifest your moment of creativity and discovery, but you can’t say anything because you’ll ruin it, you’ll fuck up the take,” Mendes said, adding that he recently experienced such a moment on the “Beatles” films (although he didn’t share any further details).\n\n\t“I found myself the other day, [going] “Aargh!” like this,” Mendes revealed. “You can’t make any noise and only when your script supervisor sees you punch the air or slap the chair, like ‘Yeah!’ or whatever it is. But they’re pretty great moments, but it’s a very odd art, craft, whatever you want to call it, that won’t allow you to just shout. The problem with directing, in many ways, is there is no outlet. You cannot shout. You know, the actor gets to shout. And I don’t mean like literally shout, I just mean express.”\n\n\tIn response Zhao admitted that she does often cry out with excitement on set. When Mendes asked if that distracted people, she replied “Oh yeah. But then I know that the technology has gotten so much better they can actually remove my voice.”\n\t\n\n\t“So when I say ‘Cut!’ … it’s the loudest scream, running across the room, waving my arm, just like losing it. Paul [Mescal] would say, ‘If I don’t get that, does that mean it’s not good?’”\n\n\tWhen asked to share which was the most exciting such moment she experienced on set during the making of “Hamnet,” Zhao replied that there were many but the scene where Agnes gives birth to the twins was probably the most memorable for her. In the scene Buckley, who is holding a real baby for the shot, thinks her daughter is stillborn before realizing a few minutes later that she’s breathing. “Magically that baby, in the perfect moment, started to move and even make this little noise. We’re all making the same [emotional] expression as Jessie. And then Emily Watson [and the rest of the actors playing midwives] all run over, and the camera operator’s crying, shaking. It’s just moments like that you feel like the universe is with you.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sam Mendes, Chloé Zhao Confront the ‘Emotional Cost’ of Directing: ‘You Soak Up Other People’s Energy, Their Concerns, Their Anxiety, Their Paranoia’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Sam-Mendes-Chloe-Zhao.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-16T17:22:38.000Z",
      "dateModified": "2026-02-16T17:22:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Apple Podcasts Is Launching New Video Features, Looking to Keep Pace With YouTube and Spotify",
    "url": "https://variety.com/2026/digital/news/apple-podcasts-video-launch-dynamic-ads-1236664629/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Apple-Podcasts-video.png?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-16T18:18:25.000Z",
    "description": "\n\tApple Podcasts is finally giving video a full embrace.\n\n\tThe tech giant, which pioneered the podcast audio format and helped popularize it, has face",
    "body": "\n\tApple Podcasts is finally giving video a full embrace.\n\n\tThe tech giant, which pioneered the podcast audio format and helped popularize it, has faced stepped-up competition from video podcast viewing on YouTube and Spotify.\n\n\tOn Monday, Apple said it will bring “advanced video capabilities” to Apple Podcasts this spring. Those will be available on iPhone, iPad and Apple Vision Pro, as well as via Apple Podcasts on the web. \n\n\n\tIn the Apple Podcasts app, for shows with video, users will be able to switch between watching and listening to shows. You’ll be able to watch video from within the app and move to horizontal full display, as well as download videos to watch offline. Video episodes will be integrated with existing Apple Podcasts features, including personalized recommendations and editorial curation on the “New” tab and in Category pages.\n\t\n\n\tApple has supported video formats for podcasts since 2005. However, until now, the Apple Podcasts app has distributed video podcasts using RSS. If you wanted to have both audio-only and video versions of a podcast, that has required two separate show entries in Apple Podcasts. \n\n\tThe enhanced video podcast experience in Apple Podcasts uses the Apple-developed HTTP Live Streaming (HLS) protocol. That provides adaptive streaming features, to automatically adjust bandwidth usage depending on network connectivity. And, for the first time, the addition of HLS support will let creators dynamically insert video ads — including host-read spots — into their podcasts.\n\n\tAs of Monday (Feb. 16), HLS video in Apple Podcasts is available for testing in developer beta versions of iOS 26.4, iPadOS 26.4 and visionOS 26.4.\n\t\n\n\tEddy Cue, Apple SVP of Services, said in a statement, “Twenty years ago, Apple helped take podcasting mainstream by adding podcasts to iTunes, and more than a decade ago, we introduced the dedicated Apple Podcasts app. Today marks a defining milestone in that journey. By bringing a category-leading video experience to Apple Podcasts, we’re putting creators in full control of their content and how they build their businesses, while making it easier than ever for audiences to listen to or watch podcasts.”\n\n\n\n\t\n\n\t\n\n\n\n\tCreators will be distribute video podcasts on Apple Podcasts through participating hosting providers and ad networks. The four companies initially supporting HLS video in Apple Podcasts are: Acast; Amazon’s ART19; Triton Digital’s Omny Studio (part of iHeartMedia); and SiriusXM’s SiriusXM Media, AdsWizz and Simplecast, are supporting HLS video at launch, with additional providers to join in the future.\n\n\tApple does not charge hosting providers or creators to distribute podcasts on Apple Podcasts, whether via traditional RSS/MP3 or HLS video. The company said it will charge participating ad networks an impression-based fee for the delivery of dynamic ads in HLS video on Apple Podcasts starting later in 2026.\n\n\t“Podcasting has evolved leaps and bounds over the past decade, and this innovation from Apple helps to keep the integrity of what makes the medium so special, while enhancing video and audio with new capabilities as the two formats continue to converge,” Scott Walker, SiriusXM’s chief advertising revenue officer, said in a statement.\n\n\t“Video is the next chapter for podcasting,” ART19 CEO Geoff Mattei added. “Simplifying audio distribution and empowering creators with flexible monetization solutions are what ART19 was built on, and now video deserves that same experience.”\n\n\tAcast CEO Greg Glenday commented that its integration with Apple Podcasts’ new video features “reinforces our position as a vital growth engine for modern podcast businesses. We’re ensuring that no creator or advertiser leaves revenue or reach on the table.” And Sharon Taylor, Triton Digital’s chief revenue officer, commented on Apple’s expanded move into video: “An open approach that enables publishers to retain control over their audiences, advertising, and measurement — while expanding access to content across formats — supports long-term growth and greater choice for listeners.”\n\t\n\n\tApple Podcasts provides access to millions of shows across hundreds of categories in 170-plus countries and territories. The app supports premium subscriptions, allowing creators and publishers to provide subscribers with benefits like exclusive content and ad-free listening.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Apple Podcasts Is Launching New Video Features, Looking to Keep Pace With YouTube and Spotify",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Apple-Podcasts-video.png?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-16T18:18:25.000Z",
      "dateModified": "2026-02-16T18:18:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Box Office: ‘Wuthering Heights’ Opens to $38 Million in North America, $83 Million Globally Over Presidents’ Day Weekend",
    "url": "https://variety.com/2026/film/box-office/wuthering-heights-box-office-opening-weekend-beats-expectations-margot-robbie-1236664623/",
    "image": "https://variety.com/wp-content/uploads/2026/02/MCDWUHE_WB038-e1771256038737.jpg?w=1000&h=562&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-16T16:18:10.000Z",
    "description": "\n\t“Wuthering Heights” is the new box office queen. \n\n\tDirector Emerald Fennell’s bold take on the classic novel has collected $38 million over the Pre",
    "body": "\n\t“Wuthering Heights” is the new box office queen. \n\n\tDirector Emerald Fennell’s bold take on the classic novel has collected $38 million over the Presidents’ Day holiday weekend in North America and a promising $45 million internationally, delivering a global tally of $83 million. Those ticket sales are slightly above Sunday’s estimate of $82 million worldwide.\n\n\tAlthough the domestic figure is below projections (which Warner Bros. placed around $40 million for the four days), “Wuthering Heights” enjoyed a bigger-than-expected start at the international box office. With the softer turnout in North America, the R-rated film might just rely on international crowds for staying power. Warner Bros. spent $80 million to produce “Wuthering Heights,” not including the tens of millions for the global promotional tour.\n\t\n\n\tMargot Robbie and Jacob Elordi star as toxic lovers Catherine Earnshaw and Heathcliff in the remake of Emily Brontë’s romantic drama. Unsurprisingly, “Wuthering Heights” was the de facto choice for women around Valentine’s Day on Saturday, with females representing more than 75% of opening weekend crowds. \n\n\n\tThis marks the ninth consecutive No. 1 debut for Warner Bros. following a slew of 2025 theatrical winners such as “A Minecraft Movie,” “Sinners,” “Final Destination Bloodlines” and “Weapons.” Back in 2024, Netflix (which is currently fighting with Paramount to buy Warner Bros.) had offered a hefty $150 million for Fennell to make “Wuthering Heights” for the streamer. However the director and Robbie, who produced the film with MRC, opted for a smaller budget from Warner Bros. in exchange for a theatrical release and full-scale marketing campaign.\n\t\n\n\tDuring the Valentine’s Day and Presidents’ Day weekend, “Wuthering Heights” was easily No. 1 in North America over two fellow newcomers, Sony’s original animated sports adventure “GOAT” and the Chris Hemsworth and Mark Ruffalo-led heist thriller “Crime 101.”\n\n\t“GOAT” impressed in second place with $35 million over the four-day frame, including $27.2 million over the traditional weekend. Those ticket sales mark the biggest debut for an original animated film since Pixar’s 2023 film “Elemental.” That movie, which debuted to $29 million over the traditional weekend, became a slow-and-steady box office hit and eventually powered to $496 million globally. Since “GOAT” carries an $80 million production budget, Sony Pictures Animation is hoping the kid-friendly film about an aspiring roarball champion (it’s like basketball, but different) enjoys a similar endurance at the box office. Audiences, most of whom were families, gave the movie an “A” grade on CinemaScore exit polls, which bodes well for staying power. Overseas, “GOAT” earned $15.6 million for a better-than-projected worldwide tally of $50.6 million.\n\n\t“Crime 101” arrived behind expectations with $16.3 million through the holiday frame, including $14.2 million over the traditional weekend. Those ticket sales were enough for third place on domestic charts. Internationally, the movie collected $12 million from 60 territories for a global total of $28.3 million. While a decent start for an R-rated movie aimed at older audiences, it’s less encouraging knowing that Amazon MGM spent $90 million to produce the film. Since theater owners keep about 50% of ticket sales, “Crime 101” needs a long theatrical life to justify that price tag. Although reviews were positive, moviegoers were mixed, as evidenced by the “B” grade on CinemaScore. Bart Layton (“American Animals”) directed “Crime 101,” which stars Hemsworth as an elusive jewel thief who plots high-stake heists across the Los Angeles freeway.\n\n\tOverall, the box office is 8% ahead of last year’s total, according to Comscore. That year-over-year percentage has been shrinking because, although this weekend was solid for counter-programming, attendence levels didn’t compare to 2025’s Presidents’ Day holiday weekend when Marvel’s “Captain America: Brave New World” launched to $100 million. The next major studio release is Paramount’s “Scream 7” on Feb. 27. Until then, movie theater operators are banking on “Wuthering Heights” and “GOAT” to keep heating up the box office.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Box Office: ‘Wuthering Heights’ Opens to $38 Million in North America, $83 Million Globally Over Presidents’ Day Weekend",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/MCDWUHE_WB038-e1771256038737.jpg?w=1000&h=562&crop=1"
      ],
      "datePublished": "2026-02-16T16:18:10.000Z",
      "dateModified": "2026-02-16T16:18:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Watch ‘Dead Grandma,’ the Haunting 80-Second Slamdance Horror Film From ‘It Doesn’t Get Any Better Than This’ Directors (EXCLUSIVE)",
    "url": "https://variety.com/2026/film/news/watch-dead-grandma-80-second-horror-film-1236658244/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Dead-Grandma-Poster-Slamdance.jpeg?crop=0px%2C466px%2C2000px%2C1124px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-02-16T16:30:00.000Z",
    "description": "\n\tThe shortest, scariest movie of the year has arrived — and you can watch it right now.\n\n\t“Dead Grandma,” which is written and directed by Rachel Kem",
    "body": "\n\tThe shortest, scariest movie of the year has arrived — and you can watch it right now.\n\n\t“Dead Grandma,” which is written and directed by Rachel Kempf and Nick Toti, is set to debut at the 2026 Slamdance Film Festival in Los Angeles — but Variety readers can get a sneak peek of the short below.\n\n\tKempf and Toti delivered a viral horror sensation last year with their indie film “It Doesn’t Get Any Better Than This.” The pair promised that, despite a rousing reaction during festival slots and independent screenings, it would never be made available for home viewing.\n\t\n\n\tThe idea for “Dead Grandma” came from Toti’s 2015 day job as a preschool teacher, which inspired darkly comedic thoughts.\n\n\n\t“I was working 6–8 hours a day in a nursery with all these infants crawling around me,” Toti said in a statement. “One day, I had the urge to lie down on the floor as if I were dead, just to see what the babies would do. This idea made me laugh at the time, and I thought it would make a good short film.”\n\n\t“There’s this famous legend about Ernest Hemingway,” Kempf said in a statement. “Supposedly, somebody bet that he couldn’t write a short story using only six words. In response, Hemingway wrote: ‘For sale: baby shoes, never worn.’ We tried to match the spirit of this story with our film, but with an even darker sense of gallows humor and appreciation for the macabre.”\n\n\tThe short is set to debut as part of Slamdance’s 99 Special program, which takes place Sun., Feb 22.\n\n\t“Inspired by Slamdance’s $99 Special, our new 99 Special program embraces affordable technology, apps and DIY filmmaking methods to unleash your imagination into 99-second (and under) moving image gems,” Anna Lee Lawson, the Slamdance film festival & screenplay competition manager, said in a statement. “99 Special is geared toward accessible filmmaking and serves to break down the cost barrier of production.” \n\t\n\n\t“Dead Grandma” has already made some fans in other filmmakers. Director Uwe Boll praised the work, saying, “I thought it was a photo, not a film. But then it ended up surprisingly…and dark.”\n\n\tDirector Alex Ross Perry said, “It’s an entire saga of humor, dread, and discomfort somehow squeezed into the length of a commercial. The final reveal is a real gut punch.”\n\n\tBeyond the premiere of “Dead Grandma,” Kempf and Toti are starting production on their newest film, “Scary New Year.” The Kempf-scripted project is produced by Liane Cunje and Divide/Conquer, and stars Lauren Viteri, Sam Hook, Amelia Ann, Beck Nolan and Zach Schnitzer. Adam J. Minnick is set to be the cinematographer.\n\n\tWatch “Dead Grandma” below.\n\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Watch ‘Dead Grandma,’ the Haunting 80-Second Slamdance Horror Film From ‘It Doesn’t Get Any Better Than This’ Directors (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Dead-Grandma-Poster-Slamdance.jpeg?crop=0px%2C466px%2C2000px%2C1124px&resize=1000%2C563"
      ],
      "datePublished": "2026-02-16T16:30:00.000Z",
      "dateModified": "2026-02-16T16:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘At the Sea’ Review: Amy Adams’ Commitment Can’t Save a Recovery Drama as Immediately Forgettable as Its Title",
    "url": "https://variety.com/2026/film/news/at-the-sea-review-amy-adams-1236664522/",
    "image": "https://variety.com/wp-content/uploads/2026/01/AT-THE-SEA.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-16T18:15:00.000Z",
    "description": "\n\tDrop the definite article and you have a more apt title for “At the Sea,” a drab and laborious recovery drama with a mystifying amount of major-leag",
    "body": "\n\tDrop the definite article and you have a more apt title for “At the Sea,” a drab and laborious recovery drama with a mystifying amount of major-league talent behind it. The second English-language feature from Hungarian virtuoso Kornél Mundruczó, it promises on paper a similarly potent female character study to his first: 2020’s “Pieces of a Woman,” a harrowing but humane study of trauma from stillbirth that handed the role of a lifetime to Vanessa Kirby, who duly picked up an Oscar nomination for her wrenching turn. Based on that film alone, one can see why any A-list actress would take a meeting with Mundruczó, and so it is that Amy Adams headlines this story of a wealthy mother, wife and artist struggling to regain control of her life after six months in rehab for alcoholism. \n\t\n\n\tFor 20-odd years, Adams has been one of Hollywood’s most reliably committed and conscientious performers. That reputation takes no hit in “At the Sea,” which she approaches with more seriousness and brittle, tremulous vulnerability than the thin, superficial script (by Mundruczó’s personal and professional partner Kata Wéber) strictly merits. But she can’t find or conjure much vital inner life in her character Laura Baum, a celebrated dancer and choreographer whom addiction has distanced from her family and artistry alike, but whose turmoil the film prefers to articulate through thudding dialogue and wispy, oblique flashbacks rather than any more searching physical study. Shot in mid-2024, the film has the air of having been chopped and changed several times over toward its final unwieldy form, premiering in competition at this year’s Berlinale.\n\t\n\n\tSupplemented by such familiar faces as Dan Levy, Brett Goldstein and Jenny Slate in the ensemble, Adams’ presence here may be enough to secure interest in “At the Sea” from indie distributors or streaming platforms. It’s hard, however, to imagine much of an audience turning out for a film both this familiar and this emotionally gauzy — even Adams’ last vehicle, the little-seen Searchlight/Hulu release “Nightbitch,” had a more compelling commercial hook. (That generic title doesn’t help, given we’ve also seen “By the Sea” and “On the Sea” in recent years: We may be running out of fresh prepositions for this particular formulation.)\n\n\tThe sea in question laps whisperingly onto Cape Cod, beigely shot by Yorick Le Saux, where Laura and her painter husband Martin (Murray Bartlett) own a sprawling, gorgeously appointed summer estate inherited from her late father Ivan — himself a renowned choreographer who founded the world-famous dance company that she now directs. Or did, until a DUI car accident with her young son Felix (Redding L. Munsell) in the vehicle forced her to reckon with her drinking problem, and check into a remote recovery facility for half a year. That left Martin and their teenage daughter Josie (Chloe East) to hold down the fort in her absence, while colleagues and board members were given only a vague explanation regarding her sudden hiatus. \n\n\tOn Laura’s later-than-promised return, Josie is unsurprisingly embittered and Felix (shaken but uninjured in the crash) nervously distant, while the cracks that were already present in her marriage when she left have only widened. There’s dramatic promise in this nervy, walking-on-eggshells domestic setup, but “At the Sea” is frequently waylaid by far less interesting tensions in Laura’s social and professional life — with her douchebag chief investor George (Rainn Wilson) threatening to withdraw his funding, her neurotic assistant Peter (Levy) desperate to bring her back to work, and her best friend, George’s ex-wife Debby (Slate, wasted in a flimsy part), reclaiming her life after beating cancer.\n\n\tAt best, this is the stuff of primetime soap opera, written and played in a broad, banal register a world apart from the intense, stricken disorientation that Adams brings to her character. Alcoholism is not in itself a rich person’s problem, even if six months of luxury rehab is very much a rich person’s solution — there’s plenty to sympathize with in Laura’s plight, and in Adams’ withdrawn performance. \n\t\n\n\tBut “At the Sea” struggles mightily to make us care about the future of her dance company, or indeed the potential sale of her enviable beach house, while more high-stakes shards of narrative backstory — in particular, what appears to have been an abusive relationship with her father — are gestured at only in short, angular flashes to the past, resting heavily on the solemnly anguished expression of Laura’s childhood self (silently played by the director’s own daughter).\n\n\tSometimes spliced into proceedings by editors Dávid Jancsó and Ilka Janka Nagy with blink-like brevity, these flashbacks seemingly connote the intrusive thoughts and blackouts of an addled, recuperating mind. As such, they’re one of the few striking formal gambits in an otherwise surprisingly prosaic outing from Mundruczó, a long way from the kinetic stylings of “White God,” or even the breathless, pressurized atmosphere of “Pieces of a Woman.” The most poetic flourish here, meanwhile, is a whiff: an intuitive, interpretive mother-daughter dance sequence on the beach that prompts more cringe than catharsis. At one point, Slate’s character offers a curious toast “to temporary beauty and new starts”: Mundruczó has created some enduring beauty in his career, so needn’t drink to the temporary stuff, but a fresh start would be a fine idea.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘At the Sea’ Review: Amy Adams’ Commitment Can’t Save a Recovery Drama as Immediately Forgettable as Its Title",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/AT-THE-SEA.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-16T18:15:00.000Z",
      "dateModified": "2026-02-16T18:15:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Faraz Shariat’s Thriller ‘Prosecution’ Sells to Memento in France Following World Premiere in the Berlinale’s Panorama Section (EXCLUSIVE)",
    "url": "https://variety.com/2026/film/global/faraz-shariat-prosecution-memento-berlinale-1236664740/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Prosecution.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-16T18:04:35.000Z",
    "description": "\n\tFaraz Shariat’s thriller “Prosecution,” which had its world premiere in the Berlinale’s Panorama section, has been sold to Memento in France. New Eu",
    "body": "\n\tFaraz Shariat’s thriller “Prosecution,” which had its world premiere in the Berlinale’s Panorama section, has been sold to Memento in France. New Europe Film Sales is handling world sales.\n\n\tThe film centers on young prosecutor Seyo Kim, who is determined to confront far-right violence in eastern Germany. But when she herself becomes a target – surviving a racist attack on her life – Seyo decides to investigate on her own, defying explicit orders from her superiors and putting her life and career at risk.\n\t\n\n\tWhen she finally brings one of the attackers to trial, Seyo fights to expose him as part of a wider right-wing network: digging deep into her office’s archives, reopening long-closed “isolated cases,” and maneuvring witnesses into revealing the justice system’s ties – not only to the network, but to the attack on her own life.\n\n\n\tThe cast is led by Chen Emilie Yan, Julia Jentsch, Alev Irmak, Arnd Klawitter and Sebastian Urzendowsky. The screenwriter is Claudia Schaefer, and the producers are Paulina Lorenz, Jorgo Narjes and Shariat for Jünglinge Film.\n\n\tShariat is a German-Iranian filmmaker, whose coming-of-age feature debut “Futur Drei” premiered at Berlinale in 2020, and won the festival’s Teddy Award for Best Queer Film. Partly autobiographical, “Futur Drei” is the story of a confidently “out” second-generation German-born Iranian who falls for an Iranian refugee who has recently arrived in the West.\n\n\tSince then, Faraz has directed episodes for the series “Druck,” as well as for the British high-end horror comedy “The Baby” for HBO/Sky, and German true crime anthology series “Zeit Verbrechen” (Paramount+). He executive produced “Schwarze Früchte” (ARD), a dramedy that premiered at the Tribeca Film Festival in June 2024 and was released to critical acclaim in Germany in October 2024.\n\t\n\n\tShariat is a fellow of Villa Aurora in Los Angeles and is currently developing his English-language debut “The Beach Boy,” together with Ottessa Moshfegh.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Faraz Shariat’s Thriller ‘Prosecution’ Sells to Memento in France Following World Premiere in the Berlinale’s Panorama Section (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Prosecution.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-16T18:04:35.000Z",
      "dateModified": "2026-02-16T18:04:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Robert Duvall, Star of ‘The Godfather’ and ‘The Great Santini,’ Dies at 95",
    "url": "https://variety.com/2026/film/news/robert-duvall-dead-godfather-the-great-santini-1236664754/",
    "image": "https://variety.com/wp-content/uploads/2014/09/GettyImages-52255606-1.jpg?crop=0px%2C0px%2C1280px%2C720px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-02-16T18:07:13.000Z",
    "description": "\n\tRobert Duvall, who won an Oscar for “Tender Mercies” and was nominated for his roles in films including “The Godfather,” “Apocalypse Now,” and “The ",
    "body": "\n\tRobert Duvall, who won an Oscar for “Tender Mercies” and was nominated for his roles in films including “The Godfather,” “Apocalypse Now,” and “The Great Santini,” has died. He was 95.\n\n\tDuvall’s death was announced on Facebook via a statement from his wife, Luciana Duvall.\n\n\t“Yesterday we said goodbye to my beloved husband, cherished friend, and one of the greatest actors of our time,” she wrote. “Bob passed away peacefully at home, surrounded by love and comfort. To the world, he was an Academy Award-winning actor, a director, a storyteller. To me, he was simply everything.”\n\t\n\n\tShe continued, “His passion for his craft was matched only by his deep love for characters, a great meal, and holding court. For each of his many roles, Bob gave everything to his characters and to the truth of the human spirit they represented. In doing so, he leaves something lasting and unforgettable to us all. Thank you for the years of support you showed Bob and for giving us this time and privacy to celebrate the memories he leaves behind.”\n\n\tDuvall’s gruff naturalism came to define the acting style of a generation that included Robert De Niro, Dustin Hoffman and Gene Hackman in such films as “Network” and “The Apostle,” which he also directed.\n\n\tAnd while he may never have been as big a star as DeNiro, his unshowy ability to fully embrace the characters he played earned him respect both from his peers and from critics. As Francis Ford Coppola once told the New York Times, at a certain point, it’s “hard to say the difference between leading men and great character actors.”\n\t\n\n\tHe was an actor’s actor who drew seven Oscar nominations but also found time to shine in TV vehicles such as “Lonesome Dove” and “Broken Trail,” drawing a total of five Emmy nominations and winning twice.\n\n\tHis first big-screen role, and one of his most memorable, was the scary Boo Radley in 1962’s “To Kill a Mockingbird.” While Duvall’s career took some time to get off the ground despite the strong start, by the early to mid-’70s he had come into his own, combining the abilities for seamless character acting with occasional strong forays into larger roles.\n\n\tIn 1969, he paired with a young director, Francis Ford Coppola, onthe  intimate drama “The Rain People,” and the next year got the juicy role of Frank Burns in Robert Altman’s “MASH.” He also starred in George Lucas’ experimental “THX 1138.” And the actor was doing interesting work onstage.\n\n\tBut the movie that turned it all around was 1972’s “The Godfather,” in which he played the patient and sly consigliere Tom Hagen, the role that brought him his first Oscar nomination. He reprised his role as Hagen in “The Godfather: Part II” in 1974. He also appeared in Coppola’s “The Conversation” and as Dr. Watson in Herbert Ross’ “The Seven-Per-Cent Solution.”\n\n\tIn 1976, he had a memorable role as a ruthless television executive in “Network,” and three years later, as Colonel Kilgore, he uttered the memorable “I love the smell of napalm in the morning” line in Coppola’s “Apocalypse Now,” walking off with a second Oscar nomination.\n\n\tIn 1977, he and Ulu Grosbard paired to bring David Mamet’s “American Buffalo” to Broadway to mixed notices. The same year he made a rural documentary called “We’re Not Jet Set” and in the early ’80s directed the small, finely observed “Angelo, My Love.”\n\n\tIt was not, however, until “The Great Santini,” in which he played the title character, a blustery, militaristic father, that he established his leading man credentials on film, garnering his first Oscar nomination as best actor in 1980. The following year, he won kudos at the Venice Film Festival opposite Robert De Niro in “True Confessions.”\n\n\tThen, in 1984, his quiet, detailed performance in “Tender Mercies,” written by Horton Foote and directed by Bruce Beresford, brought him the Oscar as best actor.\n\t\n\n\tThereafter, however, he often received top billing for secondary or co-lead roles, as in “The Natural,” “Colors,” “Days of Thunder,” “Rambling Rose,” “Geronimo: An American Legend” and “Deep Impact.”\n\n\tDuvall received considerable attention for his 1997 film “The Apostle,” which he directed and toplined. He was Oscar nominated for best actor for his role as a womanizing Texas preacher who must start again after committing an act of violence. At the Independent Spirit Awards, “The Apostle” took best picture and twin nods for Duvall as actor and director.\n\n\tDuvall drew an Oscar nomination for supporting actor the following year for his role as a brilliant but eccentric lawyer who is attorney John Travolta’s nemesis in the courtroom drama “A Civic Action.”\n\n\tOther efforts included the Nicolas Cage actioner “Gone in Sixty Seconds” and Arnold Schwarzenegger sci-fi thriller “The Sixth Day”; sports pic “A Shot at Glory” in which he tried a Scottish brogue and hostage drama “John Q.”\n\n\tDuvall wrote, directed and starred in the enigmatic 2003 film “Assassination Tango,” about a hitman with obsessive tendencies who’s sent to Argentina and becomes involved with a dancer.\n\n\tHe returned to the Western genre in Kevin Costner’s 2003 film “Open Range,” then the actor portrayed Gen. Robert E. Lee in “Gods and Generals,” and starred in “Secondhand Lions,” a small film in which he and Michael Caine got to riff off each other as a pair of eccentric great-uncles to young Haley Joel Osment.\n\n\tDuvall was a crusty cop in James Gray’s “We Own the Night,” but the actor had some fun lampooning his notoriously crusty characters in small roles in “Four Christmases” and the 2005 satire “Thank You for Smoking.”\n\n\tThe actor did not slow down as he neared his 80th birthday: In 2009 he appeared in John Hillcoat’s “The Road”; starred in the small but well-liked “Get Low,” in which he played a bearded hermit who is, to use Roger Ebert’s phrase, “a sly old twinkler”; and did a supporting turn in and produced “Crazy Heart,” which reminded many of Duvall’s “Tender Mercies.”\n\n\tThe actor reunited with “Lonesome Dove” screenwriter Bill Wittliff for 2014’s “A Night in Old Mexico” and the same year starred in “The Judge” as a jurist accused of a hit-and-run murder and defended by the son (Robert Downey Jr.) who represents everything he despises about the law. The film, said Variety, “pivots on a simple yet inspired stroke of casting, pitting Duvall’s iconic gravitas against Downey’s razor-sharp wit, and then supplying no shortage of opportunities for both men to chew the scenery.”\n\t\n\n\tDuvall drew his seventh Oscar nomination for his work in the film.\n\n\tIn 2015, the actor’s first directorial effort since 2002’s “Assassination Tango,” the ambitious indie feature “Wild Horses,” premiered at SXSW.\n\n\tOne of his final screen roles came in Scott Cooper’s “The Pale Blue Eye” in 2022.\n\n\tBorn in San Diego, Duvall was the son of a Navy rear admiral and grew up in various parts of the country, but especially Annapolis, Md., site of the U.S Naval Academy. It was actually at the insistence of his parents and teachers that Duvall began to study drama. After graduating from Principia College and the completion of his military service, Duvall studied under Sanford Meisner at New York’s Neighborhood Playhouse.\n\n\tHe hung out with friends like Robert Morse, Hackman and Hoffman. A one-night only performance of Arthur Miller’s “A View From the Bridge” in 1957 directed by Grosbard led to television work on “Naked City” and guest appearances on “The Defenders,” “Armstrong Circle Theater,” “The FBI” and other shows.\n\n\tThrough the ’60s, even after the enormous success of “To Kill a Mockingbird,” he subsisted on character roles in films including “Captain Newman M.D.,” “The Chase,” “The Detective,” “True Grit” and “Bullitt.” And he was a staple in Westerns such as “Lawman,” “The Great Northfield Minnesota Raid” and “Joe Kidd.”\n\n\tBut he was also doing fine work in the theater in “Mrs. Warren’s Profession,” “Call Me by My Rightful Name,” “The Days and Nights of Beebee Fenstermaker” and a full-fledged Off Broadway production of “A View From the Bridge” in 1965, co-starring Jon Voight and Susan Anspach.\n\n\tUrban crime dramas were his other staple along with Westerns. They included, during the 1970s, “Badge 373,” “Breakout” and Sam Peckinpah’s “The Killer Elite.”\n\n\tTV occasionally offered the actor a juicy, fully dimensional role. In 1979, he starred in the TV movie “Ike” as General Dwight D. Eisenhower. Ten years later, he starred in the highly praised CBS miniseries “Lonesome Dove,” picking up an Emmy nomination. He starred as the Soviet dictator in the 1992 HBO film “Stalin,” for which he earned a second Emmy nom. In 1997, he drew an Emmy nomination for his role as the title Nazi in “The Man Who Captured Eichmann”; and in 2006, he not only toplined but also exec produced the miniseries “Broken Trail,” whose success put cabler AMC on the map as a producer of original content — and earned Duvall two Emmys, one for his performance and another, shared with the other producers, for outstanding miniseries. For HBO, he appeared in the 2012 telepic “Hemingway and Gelhorn,” in which he played a Russian general.\n\t\n\n\tHe is survived by his fourth wife, Luciana Pedraza, with whom he starred in “Assassination Tango.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Robert Duvall, Star of ‘The Godfather’ and ‘The Great Santini,’ Dies at 95",
      "image": [
        "https://variety.com/wp-content/uploads/2014/09/GettyImages-52255606-1.jpg?crop=0px%2C0px%2C1280px%2C720px&resize=1000%2C563"
      ],
      "datePublished": "2026-02-16T18:07:13.000Z",
      "dateModified": "2026-02-16T18:07:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Joe’s College Road Trip’ Review: Tyler Perry Lets Out His Inner Bad Grandpa in a Hilariously Profane Buddy Comedy",
    "url": "https://variety.com/2026/film/reviews/joes-college-road-trip-review-tyler-perry-1236663621/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Joes_College_Road_Trip_n_00_57_09_21_R.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-16T17:32:06.000Z",
    "description": "\n\tIn “Joe’s College Road Trip,” Tyler Perry doesn’t just let his hair down, he isn’t just having down-and-dirty fun — he’s wildly, deliriously profane",
    "body": "\n\tIn “Joe’s College Road Trip,” Tyler Perry doesn’t just let his hair down, he isn’t just having down-and-dirty fun — he’s wildly, deliriously profane. The movie is a rude and rollicking lark, which makes it an anomaly in the Perry canon; even the Madea films are attached to some earnest swatches of domestic soap opera. But “Joe’s College Road Trip” is built around a character who makes Madea, in her hectoring brashness, look prim and responsible. That would be Madea’s brother, Joseph “KP” Simmons, a long-standing member of the Perry stock company of old-school cranks (he’s played, as always, under pounds of makeup, by Perry himself).\n\t\n\n\tThe film opens with a mock 1950s educational documentary that’s basically a satirical trigger warning. Joe, as the mock doc informs us, was born in 1937 and is 89 years old. “He is what one might call an endangered Negro species.” Joe was once a pimp, and we’re told that in the movie we’re about to see, he uses the word “motherfucker” 76 times, the N-word 74 times, and “throws in an occasional ‘bitch’ and ‘ho’ at random, for good measure.” And so, the narrator concludes, “If you’re sensitive to these types of words, you might want to turn to more wholesome programming.”\n\n\n\tJoe more than lives up to that billing. It’s not just the words, it’s the attitude — the way he believes in those words and delivers them with a pimp’s lack of mercy. Joe, with his thatchy white hair and eyebrows and mustache, eyes peering from behind tortoise-shell glasses, barks out every line in the voice of an ancient street hustler. You can feel how he’s linked, in spirit, to characters like Richard Pryor’s Mudbone or some of Eddie Murphy’s pricklier impersonations in “Norbit” and the “Nutty Professor” films. But Perry, tapping back into his Chitlin’ Circuit roots, pushes all of this a notch further. His Joe is a creaky old man who’s an anarchic, hellbent hooligan. He’s irascible, nearly sociopathic in his lack of concern for anyone but himself.Yet that means that as a movie character, he possesses the courage of his own craziness. Perry’s performance is a spectacular piece of high-wire burlesque. There’s an extraordinary spontaneity to it. The outrages just keep spilling of him, to the point that you realize this is Tyler Perry’s id run wild. He never lets up, never softens the character, never backs down from Joe’s commitment to his mad-dog pimp’s vision of the world.\n\t\n\n\tIt’s the film’s inspiration to pair this proudly obscene and toxic old player with a teenage paragon of the new safe-space mentality — Joe’s grandson, B.J. (Jermaine Harris), a hyperintelligent supergeek who’s all restrictions and phobias and enlightened progressive oversensitivity. B.J. is a vegan, he takes a fistful of vitamins and antihistamines every day, and when he hears Leon Haywood’s 1975 slow-jam groove “I Want’a Do Something Freaky to You,” he says, “You think these are real lyrics? These are criminally sexist and misogynistic. Disgusting!” He sounds like a walking joke, but the key to Jermaine Harris’s canny performance is that he doesn’t condescend to the character or make him a cartoon. He’s a virtue-addicted Urkel played straight, and Harris shows you the inner anxiety — the quality that’s going to drive Joe nuts. There two, in mindset, seem so many generations apart that the movie could almost be a time-travel comedy. “I’m gonna kill yer daddy!” says Joe. “He’s responsible for this mutant ninja motherfucker I’m lookin’ at right here!”\n\n\tB.J.’s daddy, Brian, also played by Perry, wants him to go to the venerable historically Black Morehouse College. But B.J. has been raised in what he sees as a post-racial world. (Joe’s going to set him straight on that.) His high-school pals are white, and he wants to go to Pepperdine University in Los Angeles. So it’s arranged, for no good reason beyond the essential requirement of a high-concept road-trip movie, that Joe will drive B.J. from Atlanta to California.\n\n\tThe two climb into Joe’s cherry-red 1970s Buick Electra 225 convertible and embark on a 1980s-style romp through the Deep South, replete with all the corn-dog road-trip plot twists you’d expect: clashes over analog-vs.-digital technology (Joe tosses B.J.’s cell phone out of the car and mocks his “Tik-taco” fixations), a visit to a brothel, a pit stop at a Confederate biker bar, where B.J. is so oblivious that he makes his way through the gray-bearded rednecks without registering that there might be any danger. (This is one of two scenes that leap into fantasy, as Joe beats everyone to a pulp with his walking cane, brandishing an attitude we might call Pimp Superhero as he does the crane kick in bullet time.) At the brothel, they stow away a sex worker named Destiny (Amber Reign Smith), so that Joe’s plan for B.J. to lose his virginity comes true, despite the kid’s initial fearful resistance. (He’s the one teenage movie virgin who wants to stay that way.) And, of course, there’s the moment when Joe and B.J.’s ongoing war becomes so explosive that Joe orders him to get out of the car in the middle of nowhere.\n\n\tJoe’s pitiless quality does have its instructional aspect. He’s trying to show the overprivileged B.J. the world that Black Americans came from; his scandalous personality is encoded with the harshness of that history. But that just makes “Joe’s College Road Trip” a movie that has its educational piety and eats it too. The film’s real lesson is embedded in Tyler Perry’s performance, which says, “Look out! Whatever box you think I belong in, I’m going to bust right out of it.” He makes this cussed old crank hilariously free.\n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Joe’s College Road Trip’ Review: Tyler Perry Lets Out His Inner Bad Grandpa in a Hilariously Profane Buddy Comedy",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Joes_College_Road_Trip_n_00_57_09_21_R.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-16T17:32:06.000Z",
      "dateModified": "2026-02-16T17:32:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘America’s Next Top Model’ Netflix Doc: An On-Camera Sexual Assault, Tyra Banks Firing Her Cast, Miss J’s Stroke — and Everything Else We Learned",
    "url": "https://variety.com/lists/americas-next-top-model-netflix-doc-miss-j-stroke-shandi-sexual-assault/",
    "image": "https://variety.com/wp-content/uploads/2026/02/ANTM-MAIN.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-16T17:30:00.000Z",
    "description": "\n\t\n\t\t\t\n\t\t\t\t\n\t\n\n\t\n\tFeb 16, 2026 9:30am PT\t\n\t\n\n\t\n\t\t‘America’s Next Top Model’ Netflix Doc: An On-Camera Sexual Assault, Tyra Banks Firing Her Cast, Miss",
    "body": "\n\t\n\t\t\t\n\t\t\t\t\n\t\n\n\t\n\tFeb 16, 2026 9:30am PT\t\n\t\n\n\t\n\t\t‘America’s Next Top Model’ Netflix Doc: An On-Camera Sexual Assault, Tyra Banks Firing Her Cast, Miss J’s Stroke — and Everything Else We Learned\n\t\n\t\n\t\t\t\n\n\n\t\t\t\n\t\t\t\n\t\n\n\t\t\t\t\t\t\t\t\t©CW Network/Courtesy Everett Collection\n\t\n\n\t\t\n\t\n\t\t\t\t\n\n\t“America’s Next Top Model,” created by supermodel Tyra Banks, premiered in May 2003, and ran for 24 seasons on three different networks. Banks’ initial conception — as recounted in “Reality Check: Inside America’s Next Top Model,” a three-part docuseries streaming on Netflix on Feb. 16 — was for the competition aspect of “American Idol” to be mated with the communal living documentary treatment of “The Real World,” set within the world of fashion. She developed the series with showrunner Ken Mok and took it out to pitch: Every network said no, except for UPN, the least-watched of the broadcasters.\n\n\tThere, “America’s Next Top Model” became a watercooler, word-of-mouth hit, and a must-watch for the younger viewers UPN sought. Banks’ term “smize” entered the lexicon and even if the show never launched an actual supermodel into the world (more on that later), it did provide early opportunities for model Winnie Harlow (who’s said publicly the show did nothing for her career), Yaya DaCosta (who transitioned to acting), Eva Marcille (later on “The Real Housewives of Atlanta”), Nyle DiMarco (who won both “ANTM” and “Dancing With the Stars”), Molly O’Connell (currently on Bravo’s “Southern Charm”) and several others.\n\n\tDuring the lockdown period of COVID in 2020 — when many people were bored at home and looking for shows to watch — “America’s Next Top Model” once again became a zeitgeist topic. This time, however, viewers were watching the show through the lens of the post-George Floyd reckoning on race, and time has not been kind to “ANTM.” The way the judges would so casually and often cruelly critique the young women’s bodies was one matter of contention; photoshoot themes of crime scenes and race-swapping (resulting in Blackface) were another.\n\n\tBanks is interviewed for “Reality Check: Inside America’s Next Top Model,” and even though she says at the start, “I haven’t really said much. But now it’s time,” she doesn’t take accountability for much. By the end of the third episode, she tells the audience she hopes that they’re as open to being called out as she is: “Because that day will come,” she says, affecting the stilted-sounding delivery she uses throughout the series. It’s a moment of fabricated wisdom from Banks that’s immediately undermined by the documentarians — directors Mor Loushy and Daniel Sivan — who cut to “ANTM” Cycle 6 winner Danielle Evans, who says, “Girl, that is absolutely ridiculous. Perfect time to stop.” (Evans, whose harrowing account of Banks forcing her to get the gap in her teeth closed, or she’d be cut from the competition, emerges from “Reality Check” as a voice of reason, and its most charismatic pundit.)  \n\n\tAlso prominently featured in the docuseries are Jay Manuel, Banks’ former makeup artist and the creative director on “ANTM”; photographer and judge Nigel Barker; and runway coach and judge J. Alexander. Miss J and Mr. J, as they were called, along with Barker, have clearly done a lot of processing about their time on the show and their relationships (or lack thereof) with Banks, adding insightful commentary into the show’s beginning, middle and end. But “Reality Check” saves its biggest shock — that Miss J had a debilitating stroke in December 2022 — for the final act of its third episode, when viewers see that he’s in a wheelchair (and has a moving reunion with Manuel and Barker).\n\n\tFrom the aftermath of Miss J’s stroke and how he’s recovering, to the show’s most cringeworthy photoshoots, to how Banks feels now about losing it on Tiffany Richardson (“We were all rooting for you!”), there is much to dissect in “Reality Check: Inside America’s Next Top Model.”\n\n\n\t\t\t\n\t\t\t\n\tThe origins of “ANTM” — and early bumps in the road\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Courtesy of Netflix\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\tSeason 1 of “America’s Next Top Model” had such a low budget that the whole season was shot in a hotel in New York City, where the cast also lived. Before they got there, though, executive producer Ken Mok recounts the difficulties the show had with the network, which he says pushed back against the diversity of the show’s cast. Both Mok and Banks tell the story of wanting to cast a particular woman who was Latina, but Leslie Moonves, the head of CBS (who in 2018 would be ousted because of allegations of sexual misconduct), vetoed her casting. “I lost it,” Banks says. Mok says Moonves and Banks argued to the point where “it almost got physical.” Mok remembers begging Banks: “It’s Les Moonves. Let’s not torpedo the show before we even get it on the air.”\n\n\tThe cast’s inclusiveness also extended to sexuality. Season 1 contestant Ebony Haith was queer, which was rare on television at the time. In an interview for the docuseries, Haith claims Banks outed her on camera, as a clip plays in which Banks says: “We know you’re a lesbian. How do you feel about expressing that on national television?” Haith ended up being fine with being out on the show, and says she’s glad they showed her with her partner. But what she wasn’t fine with was her flop makeover that left her with three bald spots. After Haith protested, Banks called her, and instead of offering support, Haith says she said, “You’ve been showing up ashy every day.”\n\n\tIt got worse from there. The judges called Haith “old,” “aggressive and angry” and “harsh.” She breaks down during the interview. “My heart was breaking, as I’m on this national show, thinking the world would be proud of me,” she says. When Haith was eliminated, Banks told her that she’d had a “chip on her shoulder” which made her “difficult to work with.” (When Haith posted about “Reality Check” on Instagram, the comments were supportive, such as: “Sorry for the racism you dealt with on that show!!” and “I watched your season recently and you are a favorite now. They were so mean to you. I’m so sorry that happened. I’m so glad you did come out on top! Go Ebony!”)\n\n\tAs we all know, “America’s Next Top Model” became a hit, and Jay Manuel tells the story of one early fan: Iman called Manuel after the series premiere, and handed the phone to her husband, David Bowie. “You found the place where you need to be,” Manuel remembers him saying.\n\n\t\t\n\t\t\t\n\t\t\t\n\tCycle 2’s Shandi Sullivan has sex during production when she’s blackout drunk\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Getty Images\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\tThe final moments of Episode 1 of “Reality Check” preview the docuseries’ darkest story: the on-camera blackout sex Shandi Sullivan had in Milan during the show’s second season.\n\n\tAfter Season 1 was a hit, “ANTM” got a bigger budget for the next cycle, leading to the first international trip for the remaining cast. Once in Milan, Sullivan — an awkward, gawky young woman who’d been a clerk at Walgreens — seemed to blossom, and all the judges were gushing about her transformation (and her photoshoot). During a competition when they went on go-sees, the contestants were driven around on Vespas by young men, whom they then invited back to where they were staying. Does Banks remember what happened to Shandi, an off-camera voice asks her. Banks hesitates: “Um…” So ends Episode 1.\n\n\tThe second episode picks up from there, with Sullivan sharing her story. “I think I had two bottles of wine by myself,” she says, and had not eaten all day. She was in a hot tub with one of the guys, and they began kissing. “I was blacked out for a lot of it,” she says. “I didn’t even feel sex happening, I just knew it was happening. And then I just passed out.” She woke up the next morning and cried hysterically, she says.\n\n\tThe event became a storyline in a way that’s shocking in 2026. The show framed it as if she had cheated on her longtime boyfriend, Eric, and Banks even had a sisterly talk with Sullivan on camera about the perils of infidelity in relationships. (When asked about the ethics of what happened to Sullivan, Banks says she didn’t have anything to do with production.) Sullivan wanted to go home, and she wanted to talk to Eric on the phone. Production filmed her calling him — recording his side of the conversation, too — and confessing, “I did the worst possible thing I could do.” What unfolded is an indelible memory to anyone who saw this scene. “You had sex?” Eric screeched at her. “You stupid bitch!”\n\n\tSullivan says there were only two members of the crew with her during the scene, a camera operator and a sound guy. “We’re really, really sorry that we had to film that,” she remembers them saying to her afterward. “They just knew this isn’t right — why are we filming this?”\n\n\tMok says the cast knew the show was filmed like a documentary, without interference. But Sullivan says she would have wanted someone to intervene when she was wasted, describing what she wishes the show’s crew had thought that night: “This has gone too far — we gotta pull her out of this.” The show also filmed her later asking the man she’d been with whether they’d used protection, and whether he had any STDs. As for the final product, Mok says, “We scaled back that scene in a significant way.”\n\n\tSullivan appeared on Banks’ self-named talk show before Cycle 5 of “ANTM,” and had told them that she’d never watched what happened to her. But Banks played it anyway during Sullivan’s appearance, and she turned her eyes away so she didn’t have to see it. Speaking in the docuseries, Sullivan says: “I literally told you behind the scenes, I’ve never seen it, I don’t want to see it — don’t show it. You didn’t respect that. At all.” \n\n\t“Her behavior doesn’t change,” Sullivan says.\n\n\t\t\n\t\t\t\n\t\t\t\n\tThe ill-conceived photoshoots of ‘America’s Next Top Model’\n\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\n\n\tAs “ANTM” created more and more drama out of its photoshoots, the show really had some doozies. There was the one when they had to wear meat; there was another in which they had to pose as homeless women, with actual unhoused people. In another setup, they showed the negative impacts of smoking in which they were posed in front of a mirror with a beauty shot — then the reflected image showed them prematurely aged, or with tumors, or rotted teeth or baldness as a result of chemotherapy. Barker says that, for the most part, no one noticed that these were strange ideas for a show that was meant to project glamour: “For some reason, no one really seemed to see it.”\n\n\tIn Cycle 8, the contestants posed as crime-scene victims, dead bodies in various poses. One of them was Dionne Walters, pictured above, whose mother had actually been shot and was paralyzed and in a wheelchair. Producers knew what happened because it was in her application. “I thought it was a coincidence at the time,” Walters says. “But I don’t think it was.” During the shoot, Manuel tells her, “I love it because your ankle looks broken.”\n\n\tToday, Mok regrets this concept and says it was a mistake. He tells himself, “You were an idiot.”\n\n\tAnd then there were the show’s infamous race-swapping photoshoots — yes, two of them. In Cycle 4, Manuel was directed to switch up the models’ races and then have them pose with a child of that race. A white woman poses as a Black woman wearing Blackface and a wig — and so on. Manuel says he was uncomfortable about it from the beginning, and knew the implications (his parents are both South African). “You can see it on my face,” he says. Banks assured him she’d take the lead, because she “didn’t think it was controversial.”\n\n\tIn Cycle 13, there was a similarly themed challenge, and Banks yells encouragement to a contestant: “Think about Egypt, the people, what they’ve been through!”\n\n\t“Looking at the show now, through the 2020 lens — it’s an issue, and I understand 100% why,” Banks says about the race-swapping concepts.\n\n\t\t\n\t\t\t\n\t\t\t\n\t‘We were all rooting for you!’\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Courtesy of YouTube\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\tEpisode 3 of “Reality Check” is titled “Rooting for You,” named after the most famous, most GIF’d, most quoted scene in the history of “America’s Next Top Model.” It’s a reference to the ending of the Season 4 episode “The Girl Who Pushes Tyra Over the Edge” when Banks fully lost her shit on eliminated contestant Tiffany Richardson. \n\n\tWhen asked at the top of Episode 3 what her toughest moment on the show had been, Banks thinks about it. “Tiffany, maybe?” she’s prompted. The blowup occurred after Richardson had flunked a challenge in which they were supposed to be presenters — “None of you girls can read,” judge Janice Dickinson tells them. Richardson had been a semi-finalist the previous season, but got into a fight with a stranger at Barney’s Beanery, who poured beer on her head. You can see this melée in the premiere of Cycle 3, in which Richardson says, “Bitch poured beer on my weave!” — but she had to be eliminated after the public fight. (For a full recounting of Richardson’s “ANTM” experience from her perspective, read Michael Blackmon’s BuzzFeed profile of her from December 2017.)\n\n\tWhen Banks brought Richardson back the next season, she wanted the contestant to rise to the challenge. But after eliminating Richardson, Banks, according to Manuel, was “feeling like Tiffany’s mocking this.” Banks then laid into Richardson, shouting (in part), “When my mother yells like this, it’s because she loves me. I was rooting for you! We were all rooting for you!” It was shocking.\n\n\t“Tyra really scared all of us,” Barker says, remembering how it felt. “We literally jumped out of our seats: ‘What is happening right now?’” Mok agrees: “It was ugly,” and Manuel says that production came and “took Tyra off the set.”\n\n\tBanks reflects on what happened in “Reality Check,” saying: “I went too far. You know, I lost it. It was probably bigger than her.” \n\n\tShe continues: “I think all that was in that moment. That’s some Black girl stuff that goes real deep inside of me. But I knew I went too far.” Manuel recalls that the dressing-down was even worse than what was shown on television, saying there were things the audience didn’t see that “were not well-intentioned” — and he’ll “probably never repeat” what was said that day. Nolé Marin, a judge that season, says, “All I know is, next week, we had all the lawyers on set.” \n\n\t“People have tried to make it something funny,” Manuel says, bringing the segment to an end. “But it really wasn’t.” \n\n\n\t\t\n\t\t\t\n\t\t\t\n\tDisordered eating and fat-shaming\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: CBS via Getty Images\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\tThe modeling business is rife with eating disorders and body-shaming, and “America’s Next Top Model” was no different — despite Banks’ stated intentions. Season 1 contestant Giselle Samson tells the “Reality Check” team that the judges’ assessment of her — that she had a “wide ass” and “needed to tighten up” — haunts her still. Those comments have “stayed with me forever,” she says. “‘Why does my ass need to be so wide?’ That’s how I talk to myself — to this day.”\n\n\tFor Keenyah Hill, the Season 4 contestant pictured above, her weight was a theme of the season. During a Seven Deadly Sins challenge, she represented gluttony. When they traveled to South Africa and did an animal challenge, she was cast as an elephant. Janice Dickinson is shown saying, “Keenyah needs to lose weight. Keenyah needs to lose weight. Keenyah needs to lose weight,” and Manuel asks her on camera whether she’s gained weight. Banks says to her, “If you don’t fit the clothes, you don’t work.”\n\n\tIn Season 10, Whitney Thompson entered at a size 6. In “Reality Check,” she says she learned from the mistake Season 3 contestant Toccara Jones had made, when she complained that none of the clothes fit her, and then was eliminated that week. “If they see weakness, you’re gone,” Thompson says. She went on to win that season, and weighing 115 pounds at 5’10, is the first “plus-sized” contestant to win “ANTM.”\n\n\t\t\n\t\t\t\n\t\t\t\n\t‘They just threw me to the wolves’\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Coutesy of Tracy Bayne/CBS Photo Archive via Getty Images)\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\tHow ill-equipped “America’s Next Top Model” was to discover America’s actual next top model is illustrated throughout “Reality Check.” But it’s winner Danielle Evans who describes exactly what happened to her after she won the sixth season. \n\n\tEvans had come from an impoverished background in Little Rock, Arkansas, and the show represented her big chance. So when Banks told her she needed to get the gap in her teeth closed, or she’d be sent home — Evans agreed, even though she felt like it detracted from her signature look. (Evans was one of two contestants that season forced to fix her teeth: Joannie Dodds, the runner-up, spent 18 hours in a dentist’s chair, and reports in “Reality Check” that she still has dental problems to this day.)\n\n\tAfter Evans won, and received her cash prize and contract with Ford Models, she moved to New York City, straight into a model apartment. “They just threw me to the wolves,” Evans says. Living with other models, she watched them come and go all day, going on castings and booking jobs. The then-up-and-coming model Chanel Iman was one of Evans’ roommates, and Iman asked their mutual agent why Evans was never sent on castings: “We have to treat Dani differently because she came from ‘Top Model,'” the agent said, according to Evans’ recollection. “That was a hard, hard pill to swallow.”\n\n\tIn the pre-influencer world, as it turned out, designers didn’t want Evans (or any “Top Model” graduates) to overshadow their collections. “I knew from very early on, ‘Oh, “Top Model” has a stigma.'”\n\n\tBanks, according to Evans, told her years later that she knew she’d been struggling — and she did nothing about it. “’Don’t see me in my suffering and just walk past me,'” Evans says through tears. “That’s so fucked up! They built a whole empire, a multi-million dollar brand known as ‘America’s Next Top Model,’ off the backs of every girl’s dream that did that show. And it never became realized.”\n\n\t\t\n\t\t\t\n\t\t\t\n\tThe firings of Miss J, Mr. J and Nigel\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Getty Images\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\tAfter 18 seasons, all shows’ audiences erode — and “ANTM” was no different. It was 2012, and Banks tells the story of the new head of The CW, Mark Pedowitz, calling her repeatedly, and her avoiding his calls. When they finally spoke, he told her that the show’s ratings were dipping, they needed to make a change — “and there are no sacred cows,” she says. He told her to fire Mr. J, Miss J and Barker. \n\n\tOnce they learned the news, they all agreed that there would be a joint press release announcing their departures, but before that happened, Manuel says, there was a “leak” to Page Six that Tyra had fired them. Manuel had wanted to quit after Cycle 8, even putting in his notice to Banks, who wrote back, “I am disappointed.” He returned to the series under the threat of being blackballed, he says, and his power ebbed with each season. “When I wanted to leave, I wasn’t afforded that,” Manuel says. “I work on the show from Cycles 10 through 18 — I made so many concessions. That’s the part that’s the most hurtful.”\n\n\tMiss J and Barker also felt betrayed. “I was the spine of the show,” Miss J says. Barker adds, “That was really tough. It was somewhat mercenary.”\n\n\t“I cried myself to sleep that night,” Banks says. “Bosses have bosses. And the big boss was very clear — there were no sacred cows.”\n\n\tThe ratings continued to decrease, even as the show amped up its gimmicks: a college edition, Americans v. Brits, adding male models. Eventually, Banks herself was replaced by Rita Ora (who?!).\n\n\t“They replaced Tyra,” Mok says mournfully. \n\n\tEarlier in the episode, Manuel describes how having given notice changed his relationship with Banks — they had been so close, but she froze him out after that. “It was like psychological torture,” he says. During her sit-down interview, when Banks is asked whether she wants to offer her side of that story, she says, “Nah,” and scrunches her face. “I’d prefer — I should just call Jay. I don’t want to do this here. He’s a special man.” \n\n\tAccording to a recent interview with Manuel in Interview Magazine, Banks has not called him. \n\n\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Courtesy of Netflix\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\tAfter Miss J was fired, he continued working in the extended “ANTM” world —even returning to the “America’s Next Top Model” mothership as a judge for Cycle 22 in 2015, and appearing on the China and Russia editions of the show. He also worked at the Savannah College of Art and Design, having started coaching students there through Vogue’s André Leon Talley beginning in 2003.\n\n\tBut on Dec. 27, 2022, as revealed in “Reality Check,” Miss J had a stroke. “I spent five weeks in a coma,” he says. “I couldn’t walk. I couldn’t talk.” Miss J is an interview subject throughout the docuseries, with no visible evidence of his condition, and this reveal — which has never been public until today (in fact, Netflix embargoed it until the premiere date) — packs an emotional wallop. \n\n\tBarker and Manuel tell the story of when they first visited Miss J in the hospital. “That was just such a terrible shock,” Barker says. “And really upsetting and horrifying and scary,” adding, “I held him.” Miss J says, “I cried, because I just miss them so much.”\n\n\t“Reality Check” then gathers the three of them together on a set — and Miss J is in a wheelchair. Manuel says to him, “You’re speaking so much better now.” Barker addresses him, too, saying: “When we first saw you in the hospital, you could hardly move, hardly talk. And now you’re sitting up doing an interview — chatting, talking, rolling your eyes, making us laugh.” Miss J’s face crumples in tears, and Barker puts his arm around him.\n\n\t“I taught models how to walk. And now I can’t walk,” Miss J says, and then pauses. “Not yet. Not yet!” They all take a selfie, their first one since 2019. \n\n\tAnd no, though he’s heard from Banks, she hasn’t visited him. “No, not yet,” Miss J says, “Not yet,” and then lowers his head, and looks over his glasses, in one of his signature shady moves.  \n\n\tAs for Banks, she lives in Australia now — she doesn’t say why or what brought her there. “I feel like my work is not done,” she says. \n\n\tAnd in a manner that almost sounds like a threat, Banks says: “You have no idea what we have planned for Cycle 25.”  \n\n\t\t\n\t\n\t\n\n\n\t\n\t\tMore from Variety\n\t\n\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\n\n\t\t\n\n\t\n\t\tMore From Our Brands\n\t\n\t\n\t\t\n\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\n\tRolling Stone\n\n\t\t\t\t\tRobert Duvall, Oscar-Winning Giant of New Hollywood Era, Dead at 95\t\t\n\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\n\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\n\tRobb Report\n\n\t\t\t\t\tItaly’s First Luxury Train Takes You to the Medieval City of Siena\t\t\n\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\n\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\n\tSportico\n\n\t\t\t\t\tMilan Cortina’s Spread-Out Games Signal a New Era for Global Sports\t\t\n\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\n\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\n\tWWD\n\n\t\t\t\t\tKeke Palmer Adds to Her Winter Vintage Dior Streak in Galliano-era Skirt Set at the Independent Spirit Awards\t\t\n\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\n\t\t\n\t\n\t\n\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘America’s Next Top Model’ Netflix Doc: An On-Camera Sexual Assault, Tyra Banks Firing Her Cast, Miss J’s Stroke — and Everything Else We Learned",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/ANTM-MAIN.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-16T17:30:00.000Z",
      "dateModified": "2026-02-16T17:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "TMZ Streaming Live, Come Into Our Newsroom and Watch Things Happen!",
    "url": "https://www.tmz.com/2026/02/16/watch-tmz-live-today/",
    "image": "https://imagez.tmz.com/image/8e/16by9/2026/02/16/8e4aff4948eb4bc889442b5485689ab6_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-16T17:46:33.000Z",
    "description": "\n    \n                    \n                          TMZ Live Stream\n                          Come Into Our Office and Watch News Happen!!!\n         ",
    "body": "\n    \n                    \n                          TMZ Live Stream\n                          Come Into Our Office and Watch News Happen!!!\n                      \n                  \n                                                                        Published \n                              February 16, 2026\n                            9:46 AM PST\n                                                                      |\n                                                                Updated \n                                  February 16, 2026\n                                12:13 PM PST\n                                    \n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          We want you to be a part of TMZ, so every weekday, between 9:30 AM and 11:30 AM PT, we take you inside our newsroom via live stream.\n      \n    \n          You never know what you're gonna get ... a big story that breaks, an argument erupts in the room, or someone's just joking around.\n      \n    \n          Your comments are a big part of the stream, and the staff spends a lot of time speaking directly to you. Every day is different!\n      \n    \n          We also use our live stream to produce our \"TMZ Live\" TV show.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Live Stream\n              \n                          \n                Streaming\n              \n                          \n                TMZ Live\n              \n                          \n                Viral\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "TMZ Streaming Live, Come Into Our Newsroom and Watch Things Happen!",
      "image": [
        "https://imagez.tmz.com/image/8e/16by9/2026/02/16/8e4aff4948eb4bc889442b5485689ab6_xl.jpg"
      ],
      "datePublished": "2026-02-16T17:46:33.000Z",
      "dateModified": "2026-02-16T17:46:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cardi B Fiercely Strums Her Privates on Stage During Sold-Out Show in L.A.",
    "url": "https://www.tmz.com/2026/02/16/cardi-b-rubs-vagina-on-stage/",
    "image": "https://imagez.tmz.com/image/71/16by9/2026/02/16/71d50e029f794ec6a484abe63c150295_xl.png",
    "tag": "Entertainment",
    "date": "2026-02-16T17:25:45.000Z",
    "description": "\n    \n                    \n                          Cardi B\n                          Wailing on Crotch Guitar at Concert!!!\n                      \n ",
    "body": "\n    \n                    \n                          Cardi B\n                          Wailing on Crotch Guitar at Concert!!!\n                      \n                  \n                                                                        Published \n                              February 16, 2026\n                            9:25 AM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Your move Jimi Hendrix! Cardi B went to a place no guitarist has gone before ... when she played with her privates like she was shredding a solo during a concert over the weekend.\n      \n    \n          It's unclear if she intended it to look like she was playing air guitar on her crotch -- maybe she was just really enjoying the music -- but the crowd went nuts!\n      \n    \n        Waiting for your permission to load the Instagram Media.\n      \n    \n          Watch the video ... while a guitar solo blasts in the background, Cardi goes to town on herself in front of the screaming sold-out crowd.\n      \n\n          As you know ... the rapper sparked rumors of a breakup from boyfriend Stefon Diggs when they unfollowed each other on Instagram earlier this month.\n      \n    \n          The potential split sent shockwaves online because of the timing ... it follows Stefon's disappointing Super Bowl loss, and the recent birth of their newborn baby boy.\n      \n    \n          The rumors haven't affected her career though! Cardi's \"Little Miss Drama\" tour has been off to an incredible start with packed-out shows on the West Coast ... Minus that chair slip in Vegas.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Cardi B\n              \n                          \n                Stefon Diggs\n              \n                          \n                Jimi Hendrix\n              \n                          \n                TMZ Sports\n              \n                          \n                Controversial S#!T\n              \n                          \n                Music\n              \n                          \n                Concerts and Tours\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cardi B Fiercely Strums Her Privates on Stage During Sold-Out Show in L.A.",
      "image": [
        "https://imagez.tmz.com/image/71/16by9/2026/02/16/71d50e029f794ec6a484abe63c150295_xl.png"
      ],
      "datePublished": "2026-02-16T17:25:45.000Z",
      "dateModified": "2026-02-16T17:25:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cheerleader & Her Mother Found Dead in Las Vegas Hotel Murder-Suicide",
    "url": "https://www.tmz.com/2026/02/16/mother-cheerleader-daughter-murder-suicide-las-vegas-hotel/",
    "image": "https://imagez.tmz.com/image/11/16by9/2026/02/16/1199495ff2b84c4890735b6edb408042_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-16T16:37:47.000Z",
    "description": "\n    \n                    \n                          Las Vegas\n                          Cheerleader, Mom Dead in Hotel Murder-Suicide\n               ",
    "body": "\n    \n                    \n                          Las Vegas\n                          Cheerleader, Mom Dead in Hotel Murder-Suicide\n                      \n                  \n                                                                        Published \n                              February 16, 2026\n                            8:37 AM PST\n                                                                      |\n                                                                Updated \n                                  February 16, 2026\n                                12:11 PM PST\n                                    \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Tragedy in Las Vegas ... a mother allegedly shot and killed her 11-year-old cheerleader daughter before turning the gun on herself in a suspected murder-suicide.\n      \n    \n          Cops say 38-year-old Tawnia McGeehan and her daughter, Addi Smith, were found dead Sunday in a room at the Rio Hotel & Casino, with what appeared to be a suicide note left behind.\n      \n    \n        Waiting for your permission to load the Instagram Media.\n      \n    \n          The Utah mom and daughter were in town for a cheer competition ... but when they didn’t show, their team, Utah Xtreme Cheer, sounded the alarm on social media, asking for help finding them.\n      \n\n          After the devastating discovery, the team shared a photo of Addi, writing ... \"We are completely heartbroken. No words do the situation justice. She was so beyond loved.\"\n      \n    \n          Police believe Tawnia shot Addi late Saturday before taking her own life. The investigation was ongoing.\n      \n    \n          If you or someone you know is struggling or in crisis, help is available. Call or text 988 or chat 988lifeline.org.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Crime & Arrests\n              \n                          \n                Family\n              \n                          \n                TMZ Sports\n              \n                          \n                Crime\n              \n                          \n                News\n              \n                          \n                Police\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cheerleader & Her Mother Found Dead in Las Vegas Hotel Murder-Suicide",
      "image": [
        "https://imagez.tmz.com/image/11/16by9/2026/02/16/1199495ff2b84c4890735b6edb408042_xl.jpg"
      ],
      "datePublished": "2026-02-16T16:37:47.000Z",
      "dateModified": "2026-02-16T16:37:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "David Archuleta Says He Found Peace After His Dad Accepted His Sexuality",
    "url": "https://www.tmz.com/2026/02/16/david-archuleta-says-dad-accepted-his-sexuality/",
    "image": "https://imagez.tmz.com/image/f0/16by9/2026/02/16/f0ab7c1f234b4589adc4e0ecd75190a4_xl.png",
    "tag": "Entertainment",
    "date": "2026-02-16T17:48:26.000Z",
    "description": "\n    \n                    \n                          David Archuleta\n                          My Dad's Acceptance of My Sexuality Healed Me\n         ",
    "body": "\n    \n                    \n                          David Archuleta\n                          My Dad's Acceptance of My Sexuality Healed Me\n                      \n                  \n                                                                        Published \n                              February 16, 2026\n                            9:48 AM PST\n                                                                            \n      \n    \n      \n        \n                    \n                  \n      \n                    ABC\n          \n    \n          David Archuleta is opening up about the emotional minefield that was his relationship with his father Jeff ... admitting for years he saw him as a threat to his peace while battling his sexuality within the strict confines of the Mormon Church.\n      \n    \n          Speaking on \"GMA\" Monday while promoting his new memoir \"Devout: Losing My Faith to Find Myself,\" out Feb. 17, the 35-year-old said he’d been viewing everything through the lens of his terrified younger self ... until he reclaimed his voice by redirecting years of bottled-up anger toward his dad into something healthier.\n      \n    \n      \n        \n              \n    \n    \n          David revealed ... the moment he came out to his dad, he stunned him with acceptance, telling him how proud he was -- a response he says brought him deep healing.\n      \n\n          The former \"American Idol\" alum also addressed his break from the Mormon church, saying he no longer considers himself religious ... explaining if God operates in a way that doesn’t accept him fully, it’s not something he wants in his life.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          As for the memoir, David says it’s his way of finally connecting the dots ... putting his pain, faith crisis, and self-discovery on the record for anyone ready to learn the full story.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                David Archuleta\n              \n                          \n                Celebrity News\n              \n                          \n                American Idol\n              \n                          \n                Books\n              \n                          \n                Music\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "David Archuleta Says He Found Peace After His Dad Accepted His Sexuality",
      "image": [
        "https://imagez.tmz.com/image/f0/16by9/2026/02/16/f0ab7c1f234b4589adc4e0ecd75190a4_xl.png"
      ],
      "datePublished": "2026-02-16T17:48:26.000Z",
      "dateModified": "2026-02-16T17:48:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sydney Sweeney and Scooter Braun Seen Getting Close at Santa Barbara Lunch",
    "url": "https://www.tmz.com/2026/02/16/sydney-sweeney-scooter-braun-intimate-santa-barbara-lunch/",
    "image": "https://imagez.tmz.com/image/cf/16by9/2026/02/16/cf0a3d0b017c421d98e3ba395eebeb37_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-16T18:00:43.000Z",
    "description": "\n    \n                    \n                          Sydney Sweeney & Scooter Braun\n                          Burger She Wrote\n                       ",
    "body": "\n    \n                    \n                          Sydney Sweeney & Scooter Braun\n                          Burger She Wrote\n                          ... Get Close at Santa Barbara Outing\n                      \n                  \n                                                                        Published \n                              February 16, 2026\n                            10:00 AM PST\n                                                                      |\n                                                                Updated \n                                  February 16, 2026\n                                10:41 AM PST\n                                    \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Sydney Sweeney and Scooter Braun weren’t shy about spending big during a cozy lunch outing ... and apparently they made sure everyone around them ate well, too.\n      \n    \n          The power couple were seen Sunday at Cold Spring Tavern in Santa Barbara, California ... where they were hanging with a group of friends and ordering enough food to feed an army.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          An eyewitness tells us they actually benefitted from Scooter and Sydney over-ordering ... claiming the couple offered them untouched plates of burgers, fries, onion rings, and nachos -- as seen in this photo obtained by TMZ.\n      \n    \n          Sydney was looking chic in a tan jacket over a white skirt, paired with cowboy boots ... while Scooter kept it casual in a crewneck with \"Beach\" written across the front.\n      \n\n      \n        \n              \n    \n    \n          The two also weren’t shy about showing some PDA ... with the eyewitness telling us Sydney was sitting on Scooter’s lap at one point during the outing.\n      \n    \n          And when it was time to pick up the check, we’re told Scooter handled it all -- treating the entire group.\n      \n    \n          Not a bad way to spend a Sunday afternoon!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Scooter Braun\n              \n                          \n                Sydney Sweeney\n              \n                          \n                Celebrity News\n              \n                          \n                TV\n              \n                          \n                Relationships\n              \n                          \n                Movies\n              \n                          \n                Couples\n              \n                          \n                Exclusive\n              \n                          \n                Music\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sydney Sweeney and Scooter Braun Seen Getting Close at Santa Barbara Lunch",
      "image": [
        "https://imagez.tmz.com/image/cf/16by9/2026/02/16/cf0a3d0b017c421d98e3ba395eebeb37_xl.jpg"
      ],
      "datePublished": "2026-02-16T18:00:43.000Z",
      "dateModified": "2026-02-16T18:00:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]