[
  {
    "title": "‘The Masked Singer’ Reveals the Identities of Handyman and Scarab: Here Are the Celebrities Under the Costumes",
    "url": "https://variety.com/2026/tv/news/the-masked-singer-season-14-episode-3-recap-handyman-scarab-1236636437/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Handyman-Scarab-Masked-Singer.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-22T02:00:00.000Z",
    "description": "\n\tSPOILER ALERT: Details follow for Season 14, Episode 3 of “The Masked Singer,” “Clueless Night,” which aired Jan. 21 on Fox.\n\n\tAs if! “The Masked Si",
    "body": "\n\tSPOILER ALERT: Details follow for Season 14, Episode 3 of “The Masked Singer,” “Clueless Night,” which aired Jan. 21 on Fox.\n\n\tAs if! “The Masked Singer” sent home two celebrities on Wednesday during “Clueless night” Whatever. Unmasked on the episode were “Wild Thing” rapper Tone Loc as Handyman, and Oscar-nominated actress Taraji P. Henson as Scarab.\n\n\tEliminated first was Handyman. Panelist Robin Thicke got it right with Tone Loc. Jenny McCarthy-Wahlberg guessed Chuck D, Ken Jeong thought it was Mr. T and Rita Ora went with Ice-T.\n\t\n\n\n\n\n\tLater, Scarab was the second contestant eliminated. Ora got it right with Taraji P. Henson. Thicke thought it was Regina King, McCarthy-Wahlberg went with Angela Bassett and Jeong guessed Cynthia Erivo.\n\n\n\n\n\n\tTone Loc told Variety that he agreed to appear on “The Masked Singer” after his friends dared him to do the show. “They didn’t think that I would,” he said. “Probably because I have this macho type of image or something like that. Like, ‘you would not get up on here, put a costume on and go dance and do whatever at this age.”\n\n\tBut he did, and he’s glad he said yes. “It was fun,” the “Funky Cold Media” star said. “I mean, it was real secretive, like some FBI-type stuff. They cover you up from head to toe and put you in your dressing room immediately… of course, part of my voice is a dead giveaway.”\n\n\t“Clueless Night” opened with Snow Cone, Scarab, Handyman and Pugcasso singing “Kids In America,” the song that also opens 1996’s “Clueless” film.\n\t\n\n\tPugcasso, Snow Cone and Crane move on from this round. Still waiting their turn: High Voltage, Calla Lily, Owl, Eggplant, Galaxy Girl, Stingray, Cat Witch, and Queen Corgi, along with another wild card.\n\n\tTaraji P. Henson (Scarab) and Tone Loc (Handyman) join Tiffany Haddish (Le Who Who), Todd and Julie Chrisley (Croissants) and David “Big Papi” Ortiz (Googly Eyes) as the celebrities unmasked so far on “The Masked Singer” Season 14.\n\n\tBack for Season 14 are host Nick Cannon, alongside panelists McCarthy Wahlberg, Jeong, Ora and Thicke.\n\n\tNew this season is “America’s Insider,” in which singer, dancer and social media personality Kylie Cantrall will share behind-the-scenes hints and clues for viewers. The twist: Cantrall is in costume as Cat Witch, but will only unmask for viewers — so the audience knows who she is, but the panelists don’t.\n\n\t“The Masked Singer” Season 14 themed episodes include a tribute to “Star Trek,” the ‘90s comedy “Clueless,” the comic franchise “Teenage Mutant Ninja Turtles” and the blockbuster “Twilight Saga” films. Also Fox’s new “Fear Factor” reboot will feature host Johnny Knoxville in a “Fear Factor: House of Fear Night,” and an “Ozzfest Night” honors late rocker Ozzy Osbourne, including a special tribute by “Masked Singer” alum Kelly Osbourne (Season 2’s Ladybug) saluting her father’s musical influence.\n\n\tThe 18 Masked contestants in Season 14 include Eggplant, Pugcasso, Queen Corgi, the Croissants, Owl, 14 Karat Carrot, Snow Cone, Galaxy Girl, High Voltage, Googly Eyes, Scarab, Handyman, Crane, Le Who Who, Pangolin, Stingray, Cat Witch and Calla Lily.\n\n\tPer the show, the Season 14 contestants have sold a combined 94 million records, received 47 Teen Choice Award nominations, 12 Emmy nominations, two stars on the Hollywood Walk of Fame, one Tony Award win and one Academy Award nomination.\n\n\tHere were the performances on Wednesday’s episode.\n\n\n\n\t\n\n\t\t\t\t\tNick Cannon and Snow Cone, “The Masked Singer”\n\t\n\n\n\t\n\t\tSnow Cone\t\n\n\tSong: “Stronger,” by Britney Spears\n\n\tPrevious song: “When I Grow Up,” by the Pussycat Dolls\n\n\tClueless clue: “Rebooting.” “Life had taken everything away from me so many times. But I keep getting up for my family and my kids. Because Snow Cone is bright and beautiful on the outside and he gives me the confidence to feel that way on the inside.”\n\t\n\n\tPanel guesses: Avril Lavigne, Paris Hilton, Mandy Moore\n\n\tPrevious panel guesses: Mischa Barton, Nicole Richie, Taylor Momsen\n\n\tSnow Cone voiceover: “If you’re a fan of the iconic ‘Clueless’ soundtrack, you’re guaranteed to love the hottest CD of the summer. Snow Cone. And let me tell you, there’s one album that everybody needs. Mine! (“Snow Real.”) I poured everything I had into it. Even turned down a record deal with David Foster. But when I released it, nobody bought it. For years, I was devastated. But when I was at my lowest point, everyone rallied behind me. Fans started buying my music again. And this once again album became No. 1. (“Only $19.84”) So, hurry up and get your copy. Operators are standing by.”\n\n\n\n\t\n\n\t\t\t\t\tNick Cannon and Scarab, “The Masked Singer”\n\t\n\n\n\n\tSong: “Girls Just Want to Have Fun,” by Cyndi Lauper\n\n\tPrevious song: “Set Fire to the Rain,” by Adele\n\n\tClueless clue: Cookie dough. “I love baking under pressure to get where I am.”\n\n\tPanel guesses: Cynthia Erivo, Angela Bassett\n\n\tPrevious panel guesses: Whoopi Goldberg, Viola Davis, Sheryl Lee Ralph\n\n\tScarab voiceover: “In ‘Clueless,’ Cher’s dad was always there for her. And I know the support of a parent means everything. My dad saw it first. He told me I was going to be a huge star, and that I might be nominated for an Oscar. My mom was a little more hesitant. A single mother who didn’t want me to struggle like she did. That all changed when she saw me on stage. And all of dad’s predictions came true. Even that nomination. (“Most Influential.”) But when it came time for Hollywood’s biggest night, my dad wasn’t there. Sadly, he passed away a week prior. It was hard to smile in those photos that night. But mom and I made the most of it. He would have loved it. I am equal parts my mom and dad. Smart like my mom, strong like my dad. And one hell of a dreamer.”\n\n\n\n\t\n\n\t\t\t\t\tHandyman, “The Masked Singer”\n\t\n\n\n\t\n\t\tHandyman\t\n\n\tSong: “Can I Kick It?,” by A Tribe Called Quest\n\n\tPrevious song: “Shake Your Groove Thing,” by Peaches & Herb\n\n\tClueless clue: Candy wrappers. “I always have had a sweet flow.”\n\n\tPanel guesses: Vanilla Ice, Ice-T, Mr. T\n\n\tPrevious panel guesses: Idris Elba, Tone Loc, Vin Diesel\n\n\tHandyman voiceover: “Clueless was one of a kind. The music, outfits, everything made it stand out in the 90s. And to tell you the truth, I’ve been known to stand out too. But, it wasn’t all perfect. And without warning, a painful accident. Changed my voice overnight. But, I didn’t let that hold me back. And you know what? My voice got people’s attention. And suddenly you could hear me everywhere. The radio, movies, even kids shows. The very thing I thought was too different turned out to be the thing that made me stand out.”\n\t\n\n\n\n\t\n\n\t\t\t\t\tNick Cannon and Pugcasso, “The Masked Singer”\n\t\n\n\n\t\n\t\tPugcasso\t\n\n\tSong: “Fake Plastic Trees,” by Radiohead\n\n\tPrevious song: “Ordinary,” by Alex Warren\n\n\tClueless clue: Aloha shirt. “I like the beach, and I like cameras.”\n\n\tPanel guesses: Jack Johnson, Rob Thomas\n\n\tPrevious panel guesses: Dan Reynolds, Darren Criss, Ryan Tedder\n\n\tPugcasso voiceover: “Coming from a small town, I thought I knew everybody. And then I saw her. Instantly my heart went boom. A few weeks later, I saw her again. Life was trying to tell me something, so I took my shot. And that was it. It was like a real life romcom. Cue the montage, guys. We were so in love. Until, I was asked to hit the road, and worse, to live a world away from my girl. Fast forward to when I got to the airport and there she was, with a suitcase in hand. And ever since then, when fame feels superficial, she keeps me grounded..”\n\n\n\n\t\n\n\t\t\t\t\tCrane, “The Masked Singer”\n\t\n\n\n\t\n\t\tWild Card: Crane\t\n\n\tSong: “It’s Not Right But It’s Okay,” by Whitney Houston\n\n\tClueless clue: Ballet shoes. “I’m not the one to shy away from center stage.”\n\n\tPanel guesses: Misty Copeland, Mya, Ashanti\n\n\tCrane voiceover: “It’s seamless for me to make my Masked Singer debut on Clueless night. Because the 90s literally represent everything that I did. And I do it all. Whether it’s primetime, film or billions of streams. I’ve brushed wings with Janet, Michelle and even Angelina’s a fan. But, I’ve had to work ten times harder just to be seen. And at times, yeah, my confidence has been shattered. So I’ve spent many transformative moments taking control over my destiny. I’m proud to say it’s my own wings that got me to climb this high. But I’m not done yet. And any chance I get to go for gold, I take it.”\n\n\tPast “The Masked Singer” winners include T-Pain as Monster (Season 1), Wayne Brady as Fox (Season 2), Kandi Burruss as Night Angel (Season 3), LeAnn Rimes as Sun (Season 4), Nick Lachey as Piglet (Season 5), Jewel as Queen of Hearts (Season 6), Teyana Taylor as Firefly (Season 7), Amber Riley as Harp (Season 8), Bishop Briggs as Medusa (Season 9), Ne-Yo as Cow (Season 10), Vanessa Hudgens as Goldfish (Season 11), Boyz II Men as Buffalos (Season 12) and Gretchen Wilson as Pearl (Season 13).\n\t\n\n\t“The Masked Singer” comes from Fox Alternative Entertainment. Rosie Seitchik, Craig Plestis and Cannon are executive producers, while Seitchik serves as showrunner. The series is based on the South Korean format created by Mun Hwa Broadcasting Corp.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘The Masked Singer’ Reveals the Identities of Handyman and Scarab: Here Are the Celebrities Under the Costumes",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Handyman-Scarab-Masked-Singer.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-22T02:00:00.000Z",
      "dateModified": "2026-01-22T02:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Labubu Makers POP MART Drop 'Zootopia 2' Character Blind Boxes Online",
    "url": "https://variety.com/2026/shopping/news/pop-mart-zootopia-2-character-blind-box-keychains-dolls-buy-1236637273/",
    "image": "https://variety.com/wp-content/uploads/2026/01/zootopia-2-labubu-popmart-e1769035510841.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-21T23:31:51.000Z",
    "description": "\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.\n\n\tHot off t",
    "body": "\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.\n\n\tHot off the hype of its Labubu dolls last year, accessories brand POP MART has unveiled a new collaboration with Disney’s “Zootopia 2,” with the release of four keychain figurines inspired by the characters in the film. \n\n\tThe POP MART “Molly” Zootopia 2 series features variations of Nick and Judy, the film’s main characters, along with Gary De’Snake and Clawhauser, the ZPD’s resident cheetah. There is also a “secret-edition” Nibbles Maplestick doll among the batch, with shoppers having a 1 in 48 chance of pulling the new beaver character from the box, according to POP MART.\n\t\n\n\t\t\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\t\t\n\n\t\t\t\t\t\t\t\t\t\tLIMITED-EDITION RELEASE\t\t\t\t\t\t\n\n\t\t\t\t\tPOP MART Molly ‘Zootopia 2’ Series\t\t\n\n\t\n\t\tFirst released during the holidays, the “Zootopia 2” POP MART dolls quickly sold out but are back in stock now on Amazon.\t\n\t\t\n\t\n\n\tThe animated characters are reimagined in 5-inch form, with removable parts, interchangeable outfits (sold separately) and a carabiner-style hanging ring on the top.  As with the viral Labubu keychains, the figures are “hidden” and randomized in a blind box, and the character you receive isn’t revealed until you open the box.\n\n\n\tEach of the figurines are crafted from PVC plastic with a felt “hat” accessory. This is an officially-licensed collaboration between Disney and POP MART and part of the film’s big brand licensing rollout, which also includes product from Jazwares, Squishmellows, Crocs and more.\n\n\tAs with the Labubu dolls, this “Zootopia 2” x POP MART collaboration is expected to be a big collector’s item so it’s worth picking up online while Amazon still has the keychains in stock. POP MART is also no doubt hoping for another viral hit, after Labubus reportedly made the Chinese company more than one billion dollars. A Labubu movie is also reportedly in the works.\n\n\tShop the blind boxes and see more POP MART releases here.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Labubu Makers POP MART Drop 'Zootopia 2' Character Blind Boxes Online",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/zootopia-2-labubu-popmart-e1769035510841.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-21T23:31:51.000Z",
      "dateModified": "2026-01-21T23:31:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bruce Bilson, Emmy-Winning Director on ‘Get Smart’ and ‘The Odd Couple,’ Dies at 97",
    "url": "https://variety.com/2026/tv/news/bruce-bilson-dead-get-smart-director-1236637044/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Bruce-Bilson-Obit-Dead.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-21T22:39:48.000Z",
    "description": "\n\tBruce Bilson, who won an Emmy for directing “Get Smart” and directed hundreds of TV episodes, died on Jan. 16 in Los Angeles. He was 97.\n\n\tBilson wa",
    "body": "\n\tBruce Bilson, who won an Emmy for directing “Get Smart” and directed hundreds of TV episodes, died on Jan. 16 in Los Angeles. He was 97.\n\n\tBilson was best known for directing the secret agent sitcom parody “Get Smart,” for which he won a Primetime Emmy Award for Outstanding Directing for a Comedy Series in 1968. Over the span of his decades-long career, Bilson directed over 400 episodes of television, including episodes of “The Odd Couple,” “Hogan’s Heroes,” “The Patty Duke Show,” “The Mary Tyler Moore Show,” “MASH,” “Hawaii 5-0,” “The Flash,” “Viper” and “Dinosaurs.”\n\t\n\n\tBilson graduated from UCLA in 1946, part of the institution’s first film school graduating class. After serving in the Air Force, Bilson became an assistant editor on Groucho Marx’s “You Bet Your Life,” and later an assistant director on “Wyatt Earp” and “The Andy Griffith Show.” \n\n\n\tBilson was born on May 19, 1928, in Brooklyn, N.Y., to Hattie Bilson, a screen and magazine writer, and George Bilson, a producer at Warner Brothers and RKO.\n\n\tBilson married Mona Whiteman in 1955, with whom he had two children. In 1984, he married actress Renne Jarrett, who he was married to until his death.\n\n\tHe is survived by his wife, his children, Danny Bilson, Julie Bilson Ahlberg, and his stepson, Drew Stauffer (Liz), in addition to his grandchildren, Rachel, Hattie, and Rosemary Bilson, John Pierce (Courtney), Sidney and Suki Sekula, Bowie Stauffer, and great-grandchildren Briar Christensen and Everly Pierce.\n\n\tA memorial service for Bilson will be held at Hillside Memorial Park in Los Angeles on Jan. 25 at 2 p.m.\n\t\n\n\tDonations in his name may be made to casala.org. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bruce Bilson, Emmy-Winning Director on ‘Get Smart’ and ‘The Odd Couple,’ Dies at 97",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Bruce-Bilson-Obit-Dead.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-21T22:39:48.000Z",
      "dateModified": "2026-01-21T22:39:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Molly Ringwald, Danielle Brooks, Ali Ahn, Rain Spencer and Dawn Porter Join Variety Culture & Storytelling Panel at Sundance Film Festival",
    "url": "https://variety.com/2026/biz/news/molly-ringwald-variety-panel-sundance-film-festival-1236637381/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Molly-Ringwald-Danielle-Brooks-Ali-Ahn-Rain-Spencer-Dawn-Porter-2.jpg?crop=0px%2C1px%2C1000px%2C562px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-01-22T00:59:04.000Z",
    "description": "\n\tVariety will host a Culture & Storytelling conversation exploring the role of cultural experiences in shaping creative work, presented by World of H",
    "body": "\n\tVariety will host a Culture & Storytelling conversation exploring the role of cultural experiences in shaping creative work, presented by World of Hyatt, on Jan. 25 at the Sundance Film Festival.  \n\n\tPanelists include Molly Ringwald (“Run Amok”), Danielle Brooks (“If I Go Will They Miss Me”), Ali Ahn (“Take Me Home”), Rain Spencer (“Big Girls Don’t Cry”) and Dawn Porter (“When a Witness Recants”). These creatives will share firsthand insights into how cultural immersion influences their approach to character, narrative and production design, offering audiences a rare glimpse into the ways that environment and culture shape the art of storytelling.\n\t\n\n\tThe conversation will be moderated by Matt Donnelly, Senior Entertainment & Media Writer at Variety, who will guide the discussion through thought-provoking questions about creativity, authenticity and the intersection of culture and craft. \n\n\n\tThe panel will examine how immersing oneself in different locations and cultures on set influences not only the direction of a project but also the broader understanding of the world around us.  “Our collaboration with Variety at the Sundance Film Festival reflects World of Hyatt’s deep commitment to supporting creativity, storytelling, and the communities that bring culture to life,” said Katie Casey, AVP of global marketing, Hyatt. “The Sundance Film Festival is a powerful platform for diverse voices, and we’re proud to work with Variety to help celebrate filmmakers and create meaningful experiences at the intersection of hospitality and entertainment.” \n\t\n\n\tRequest an invite at the following link here.  \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Molly Ringwald, Danielle Brooks, Ali Ahn, Rain Spencer and Dawn Porter Join Variety Culture & Storytelling Panel at Sundance Film Festival",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Molly-Ringwald-Danielle-Brooks-Ali-Ahn-Rain-Spencer-Dawn-Porter-2.jpg?crop=0px%2C1px%2C1000px%2C562px&resize=1000%2C563"
      ],
      "datePublished": "2026-01-22T00:59:04.000Z",
      "dateModified": "2026-01-22T00:59:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "FCC Takes Aim at Political Interviews on Late-Night and Daytime Shows",
    "url": "https://variety.com/2026/tv/news/fcc-late-night-daytime-equal-time-rule-1236637214/",
    "image": "https://variety.com/wp-content/uploads/2025/10/FCC-Chairman-Brendan-Carr.jpg?crop=0px%2C15px%2C4995px%2C2812px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-01-21T23:42:32.000Z",
    "description": "\n\tWith election season around the corner, the Federal Communications Commission issued a broadside on Wednesday aimed at late-night and daytime shows ",
    "body": "\n\tWith election season around the corner, the Federal Communications Commission issued a broadside on Wednesday aimed at late-night and daytime shows that air political interviews.\n\n\tThe agency stated that shows like “The View” and “The Tonight Show” may not be considered “bona fide” news programs, and thus could be forced to parcel out airtime evenly to opposing candidates.\n\n\t“The FCC has not been presented with any evidence that the interview portion of any late night or daytime television talk show program on air presently would qualify for the bona fide news exemption,” the FCC’s media bureau stated on Wednesday.\n\t\n\n\tAnna Gomez, the sole Democratic member of the commission, called the guidance “an escalation in this FCC’s ongoing campaign to censor and control speech.” She urged broadcasters not to self-censor out of fear of government intimidation.\n\n\n\tFCC Chairman Brendan Carr has previously warned the agency will not allow late-night to become a “narrow partisan circus.” In September, he famously threatened action in the wake of a controversial Jimmy Kimmel monologue, which led Disney to suspend Kimmel’s show. At the time, Carr also suggested that “The View,” ABC’s left-leaning daytime show, may not be exempt from the FCC’s equal time rule.\n\n\tThe Media Research Center, a conservative watchdog group, has found that since 2022, 97% of political guests on late-night shows have been on the left. A recent report cited 35 interviews with Democratic officials in the last six months — including several Democratic senators and governors — and zero with Republicans.\n\t\n\n\tThe FCC’s equal time rule is intended to ensure that the public airwaves are not captive to partisan motives. Kamala Harris appeared on “SNL” on the final weekend before the 2024 election, prompting NBC to grant equal time to the Trump campaign to run an advertisement. \n\n\tBut the rule includes an exception for news interviews. That exception was initially limited to programs like “Meet the Press” and “Face the Nation,” but was later extended in a series of commission decisions to daytime and late-night shows, starting with “Donahue” in 1984. \n\n\tIn 2006, the FCC ruled that an interview on “The Tonight Show with Jay Leno” with Gov. Arnold Schwarzenegger — then a candidate for re-election — was bona fide news programming, and that NBC affiliates did not owe equal time to his Democratic opponent. The commission ruled that interviews on “The Tonight Show” were “based on the producers’ independent news judgment as to the participant’s newsworthiness and not motivated by partisan purposes.”\n\n\tIn its guidance on Wednesday, the FCC’s media bureau signaled that times have changed, noting in a footnote that Leno no longer hosts the show. \n\n\tThe agency warned that there is no blanket exception for all late-night and daytime shows, and that such determinations are made case-by-case. The bureau also encouraged broadcasters to file a formal petition for a declaratory ruling if they are in any doubt as to whether the rule applies.\n\n\tIn her response, Gomez stated that the FCC’s policies have not changed and that daytime and late-night shows are entitled to exercise their news judgment.\n\n\t“The First Amendment does not yield to government intimidation,” she said.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "FCC Takes Aim at Political Interviews on Late-Night and Daytime Shows",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/FCC-Chairman-Brendan-Carr.jpg?crop=0px%2C15px%2C4995px%2C2812px&resize=1000%2C563"
      ],
      "datePublished": "2026-01-21T23:42:32.000Z",
      "dateModified": "2026-01-21T23:42:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "David Siegel, Veteran Producer and Production Manager on ‘The Hangover’ Trilogy and ‘Crazy, Stupid, Love,’ Dies at 70",
    "url": "https://variety.com/2026/film/news/david-siegel-dead-the-hangover-crazy-stupid-love-1236637104/",
    "image": "https://variety.com/wp-content/uploads/2026/01/David-Siegel-photo-by-Robert-Staad.jpg?crop=0px%2C1876px%2C7189px%2C4048px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-01-21T22:37:07.000Z",
    "description": "\n\tDavid Siegel, a veteran producer who worked on films including “The Hangover” trilogy, “Crazy, Stupid, Love” and more, died on Jan. 8 in Los Angeles",
    "body": "\n\tDavid Siegel, a veteran producer who worked on films including “The Hangover” trilogy, “Crazy, Stupid, Love” and more, died on Jan. 8 in Los Angeles. He was 70 years old.\n\n\tOver the last four decades, Siegel contributed to a number of the most enduring studio films, collaborating with filmmakers including Kevin Costner, Todd Phillips, Rob Reiner, Penny Marshall and David Lester. As a production manager and line producer, Siegel was a part of the creation of beloved movies including “Dances with Wolves,” “Gravity,” “The Pursuit of Happyness,” “The LEGO Movie,” “War Dogs,” “Serenity,” “Holes,” “Air Force One” and “Bull Durham,” among many others. On “Final Destination: Bloodlines,” his final project, Siegel served as the executive producer. \n\t\n\n\tSiegel was highly adept at handling the challenges that came with bringing movies to life and was widely regarded as a problem-solver and outside-the-box thinker, both of which contributed to his successful producing career. He also collaborated with studios including Warner Bros., Disney, Universal, New Line Cinema, Columbia Pictures, Touchstone Pictures and Paramount. \n\n\n\tBefore Siegel moved into producing, he started his career in Washington, D.C., co-founding a location services company. He worked as a motion picture transportation coordinator for more than a decade, which provided him with the strong foundational knowledge required to flourish in Hollywood and to bring a film to screen. Siegel was a member of the DGA, PGA, SAG-AFTRA and the Teamsters union. \n\n\tColleagues often remarked the ease at which Siegel could connect with a crew, which was one of his key characteristics. On every set he worked on, he was invaluable not only for his role as a producer but as a human presence, frequently mentoring individuals during productions and giving opportunities to hard-workers who were curious about getting involved. \n\t\n\n\tSiegel is survived by his wife, Janet Siegel, and his daughters, Emma Sandler (Yoni) and Mollie Ennis (Sawyer). He is also survived by his sister, Judy Siegel Schmauss, and his grandchildren, Maya, Logan and Indigo. A memorial for family and friends will be held on Jan. 25.\n\n\tDonations to honor Siegel can be made to Wags & Walks and Entertainment Community Fund.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "David Siegel, Veteran Producer and Production Manager on ‘The Hangover’ Trilogy and ‘Crazy, Stupid, Love,’ Dies at 70",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/David-Siegel-photo-by-Robert-Staad.jpg?crop=0px%2C1876px%2C7189px%2C4048px&resize=1000%2C563"
      ],
      "datePublished": "2026-01-21T22:37:07.000Z",
      "dateModified": "2026-01-21T22:37:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Elizabeth Banks Heads Back to College to Produce Feature Comedy ‘Betas’ for Universal (EXCLUSIVE)",
    "url": "https://variety.com/2026/film/news/elizabeth-banks-sorority-rush-movie-betas-1236637287/",
    "image": "https://variety.com/wp-content/uploads/2026/01/MixCollage-21-Jan-2026-02-49-PM-7914.jpg?crop=26px%2C28px%2C1158px%2C652px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-01-21T23:47:17.000Z",
    "description": "\n\tElizabeth Banks is returning to the stomping grounds that cemented her as a career producer and box office draw: the rowdy college comedy.\n\n\tBanks’ ",
    "body": "\n\tElizabeth Banks is returning to the stomping grounds that cemented her as a career producer and box office draw: the rowdy college comedy.\n\n\tBanks’ Brownstone Productions will mount “Betas,” a film set in the viral world of sorority rush culture. Sammi Cohen (“You’re So Not Invited to My Bat Mitzvah”) will direct the project from a script by Ilana Wolpert (“Anyone But You”).\n\n\n\tBanks, whose “Pitch Perfect” franchise revitalized the campus genre and scored close to $600 million at the worldwide box office, was the rush chair for her own sorority (Tri Delta) at the University of Pennsylvania.\n\t\n\n\tBanks, Max Handelman and Alison Small will produce via Brownstone. Kimberly Carver (HBO Max’s “Julia”) will executive produce. The distributor and production timeline are still unknown.\n\n\n\tBrownstone enjoys first-look deals at both Universal Pictures and Universal Television. Earlier this year, Variety reported that Banks and Handelman will produce “Pitch Perfect: K-Pop Idols” for Peacock, yet another spinoff from the a capella world. Brownstone is also developing the series “Crush” from writer and executive producer Addison McQuigg at Peacock. The show is said to be inspired by the 1995 episode of “The Jenny Jones Show” titled “Revealing Same-Sex Secret Crushes.” The logline states that it is “set within the insane world of tabloid talk shows, weaving together a poignant tale of ambition, heartbreak and murder.” The company previously produced Banks’ 2019 take on “Charlie’s Angels,” the gonzo horror hit “Cocaine Bear” and series like Aidy Bryant’s “Shrill” for Hulu.\n\t\n\n\tScreenwriter Wolpert is repped at UTA and Ginsburg Daniels Kallis LLP. Cohen is repped at UTA, Range and Jackoway Austen. Carver is with Myman, Greenspan, Fox. Brownstone is repped by UTA, Untitled Entertainment and Johnson Shapiro Slewett & Kole.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Elizabeth Banks Heads Back to College to Produce Feature Comedy ‘Betas’ for Universal (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/MixCollage-21-Jan-2026-02-49-PM-7914.jpg?crop=26px%2C28px%2C1158px%2C652px&resize=1000%2C563"
      ],
      "datePublished": "2026-01-21T23:47:17.000Z",
      "dateModified": "2026-01-21T23:47:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Percy Jackson’ EP and Courtney B. Vance Explain the Big Twist in the Season 2 Finale: ‘Thalia Has Real Beef With Zeus. It’s Not Theoretical’",
    "url": "https://variety.com/2026/tv/news/percy-jackson-courtney-b-vance-season-2-finale-twist-book-1236635713/",
    "image": "https://variety.com/wp-content/uploads/2026/01/175477_0328.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-22T00:39:35.000Z",
    "description": "\n\tSPOILER ALERT: This story contains spoilers for the Season 2 finale of “Percy Jackson and the Olympians.”\n\n\tThe Disney+ adaptation of “Percy Jackson",
    "body": "\n\tSPOILER ALERT: This story contains spoilers for the Season 2 finale of “Percy Jackson and the Olympians.”\n\n\tThe Disney+ adaptation of “Percy Jackson and the Olympians” just took a major step away from the books.\n\n\tOr at least it looks that way at first. If you ask executive producer Craig Silverstein, though, that big twist in the Season 2 finale was just a way to truthfully advance what “Percy Jackson” — both on the page and the screen — has always been about: kids (or in this case, demigods) standing up for themselves when they’re neglected by their parents (all-powerful Olympians).\n\t\n\n\tThroughout Season 2, based on Rick Riordan’s book “The Sea of Monsters,” Thalia Grace (Tamara Smart) is introduced in a series of flashbacks. A daughter of Zeus (Courtney B. Vance), it was Thalia who first led Annabeth (Leah Sava Jeffries) and Luke (Charlie Bushnell) to safety at Camp Half-Blood after a difficult journey plagued by constant monster fights. It’s revealed in the books that Thalia never became a camper herself because the Furies attacked before she could enter. She saved her companions, but almost lost her life in the process — until Zeus stepped in, transforming her dying body into a magical pine tree with the power to protect the camp from monsters. In the TV series, however, that story turns out to be a lie: The Furies never touched Thalia. Sent by Hades (Jay Duplass) to turn her against her father, they told her of the Great Prophecy, which decrees that a child of the “big three” (Zeus, Hades and Poseidon) will make a decision that either saves the gods or destroys them, and explain that Zeus plans to use her as a weapon. Thalia is enraged, since Zeus has never been a present parent, and she tells him as much when he spontaneously shows up to sway her. So he turns her into the tree as punishment, and to prevent her from ruining the reign of Olympus. It’s not exactly an act of fatherly love.\n\t\n\n\t“Zeus is saying, ‘There’s this thing I was going to tell you about. Now I have to,'” Silverstein says. “‘You’re on the cusp of becoming super relevant to it. You’re going to turn 16 really, really soon. But good news: You’re going to be the princess of Olympus! I’m going to elevate you to be over everybody else.’ He just hasn’t been paying attention to her, and does not know that that’s not how you sell Thalia.”\n\n\n\n\t\n\n\t\t\t\t\tTamara Smart as Thalia\n\t\n\n\n\n\tSilverstein says the “Percy Jackson” writers had the idea for that twist about halfway through writing Season 2, but initially “held it at arm’s length.” By the time they were writing the finale, however, they realized those earlier flashbacks of Thalia lent themselves to a darker version of her final conversation with Zeus. “You see her and how she was the leader of this group that didn’t want anything to do with her father’s world,” Silverstein says. “Even before she got turned into a tree, she had a grudge against Zeus, the flames of which are fanned by Luke, who’s got issues with his dad, Hermes.”\n\n\tSilverstein adds, “At the same time, these characters are heroes who care about each other. ‘We take care of our own’ is that trio’s motto.” In other words, Thalia’s feud with Zeus doesn’t mean she’s on the same path as Luke, who betrayed Annabeth and other campers by joining Kronos’ fight to overthrow the gods. “All of this is in service of activating the last line of Rick’s book, which is Percy looking at Thalia Grace and saying, ‘I had a feeling that this person could be my best friend or my worst enemy.'” \n\n\tVance was cast as Zeus following the death of Lance Reddick, who played the sky god in Season 1. Like the writers, he approaches “Percy Jackson” first and foremost as a family story. Calling Reddick a “dear friend,” Vance started his time on the show by addressing the painful elephant in the room. “People didn’t want to impact my experience by talking about Lance, so they didn’t quite know what to do or say,” he says. “So I asked for a moment of silence for folks to honor him. I can’t Bogart my way in — transitions take time. I said I’m grateful that I’m here, and acknowledged that Lance was the man. Folks were appreciative of the time to breathe.”\n\n\tFrom there, Vance zoned in on the interpersonal dynamics between Zeus and Thalia. He says he wasn’t thinking about Greek mythology “at all. The focus was a father and a daughter falling out.” So he pulled from his own experience; with his wife, Angela Bassett, he has 19-year-old twins. When he and his children disagree, he says, sometimes “you go, ‘OK, let me see if I can just switch some things around.’ But every now and then, it ain’t happening. ‘But I don’t understand why!’ ‘You don’t have to understand why on this one. It ain’t happening.‘”\n\t\n\n\tThat’s the kind of stubborn, unresolvable conflict Thalia and Zeus were having, and it allows “Percy Jackson” to put Zeus’ poor parenting on screen in a way it hasn’t been before. “She called him out, and he made a decision to Zeus her instead of to father her,” Vance says. Yes, in this show, that means weaponizing his godly powers to essentially paralyze her for years — but Vance focused on Zeus’ actions as a manifestation of an adult’s unfair rage toward a child who simply expressed their feelings. “And what does that mean when you Zeus your daughter? What does that mean about your relationship and her life?”\n\n\tIt means “existential stakes” are coming, Silverstein says, explaining that the shift in Thalia’s backstory is intended to “bring the Great Prophecy forward in the show. The gods are being jerks — who are immortal, so they don’t care. But the Prophecy means that the Olympians can fall the way the Titans did before them. They can no longer rely on just being immortal.” \n\n\n\n\t\n\n\t\t\t\t\tToby Stephens as Poseidon, left, Walker Scobell as Percy Jackson\n\t\n\n\n\n\tIt all goes back to the show’s aim to bring Mount Olympus down to a more grounded place, making it possible to explore fraught, messy familial relationships. “Poseidon [Toby Stephens] says the greatest fear the gods ever had was that their fate would rest in the hands of their children. That means the Olympians are feeling a little more human,” Silverstein says. “Because at some point, we get old. Unlike the gods, we have to depend on our family and kids to take care of us. That’s a scary thing for immortals.”\n\n\tIn Season 3, which Disney+ announced on Wednesday will premiere later this year, Percy will have to work alongside Thalia while worrying that she could be the subject of the Great Prophecy — and that she’ll make the wrong decision. That tension already existed in Riordan’s third “Percy Jackson” book, “The Titan’s Curse,” so adding the twist to the Season 2 finale helps set up what’s coming next. “Rick understood how it made the stakes for the next season real. Thalia has real beef with Zeus. It’s not theoretical, like, ‘Oh, maybe something will happen to make her [turn against the gods].’ Because otherwise, her father saved her, right? Then she’d be kind of a brat for being angry.”\n\n\tThe twist also sets new stakes for camp director Chiron (Glynn Turman) heading into Season 3. He originally lied to the campers to protect Zeus’ image, but he’s the one who reveals the truth in the Season 2 finale. “If you look closely at the books, Chiron’s kind of shady. He does a lot of things where he’s like, ‘Oh, I would go myself, but that’s risking me.’ There’s some questionable stuff,” Silverstein says. “Our Chiron is a rule follower, and the rules that he has to follow are very tough. He’s bonding with these kids, but he’s preparing them to die fighting monsters for the glory of the gods. There’s a bit of a conflict there.”\n\t\n\n\tIn the finale, Chiron says to Percy, Annabeth and Grover (Aryan Simhadri): “I’ve always tried to heed the will of the gods, and to be an example for the demigods I train and care for. I can no longer do both.” With that line, Silverstein says, Chiron is realizing he can’t focus anymore on the consequences he may face for defying the gods: “Because he’s already dealt with consequences. In Zeus’ paranoia, he was dismissed [from camp earlier in the season]. You can follow all the rules and still get fired from your job. Everything’s changing. The primacy of Olympus is in question. Everyone who is unchanging because they’re immortal, now, at the time of the Great Prophecy, is going through all kinds of changes. That opens up some good stuff for Chiron.”\n\n\n\n\t\n\n\t\t\t\t\tGlynn Turman as Chiron\n\t\t\t\t\t\t\t\t\tDisney/David Bukach\n\t\n\n\n\n\t“Percy Jackson” fans are notoriously protective of Riordan’s original text. But with the new ending for “The Sea of Monsters,” Silverstein says, “Hopefully they’ll see that what seems like a humongous departure is actually not that big of a departure. I’ve always said this change is not as big as the change in Episode 3, where Percy learns about the Great Prophecy, the stakes of the Great Prophecy now get balanced against — and are maybe in conflict with — whatever the season prophecy is. That thing that’s just in the background while waiting for the fifth book is now very active.”\n\n\tVance, who is not only part of the twist but working to fill the Olympian shoes Reddick left behind, laughs as he wonders how the finale will be received. “I’m just trying to be mindful and gentle with with respect to  the fandom, because they they don’t play. I hear they’re the Real Deal Holyfield. So I’m just saying, ‘Let me in, y’all. Give me a little time.'”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Percy Jackson’ EP and Courtney B. Vance Explain the Big Twist in the Season 2 Finale: ‘Thalia Has Real Beef With Zeus. It’s Not Theoretical’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/175477_0328.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-22T00:39:35.000Z",
      "dateModified": "2026-01-22T00:39:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "AI Creator Behind Viral ‘Deadpool,’ ‘Harry Potter’ Christmas Clip Made His Film in a Ukrainian Bomb Shelter: ‘We Find Sanctuary’ While ‘Life Hangs by a Thread’",
    "url": "https://variety.com/2026/digital/news/ai-video-deadpool-harry-potter-andrii-daniels-1236624632/",
    "image": "https://variety.com/wp-content/uploads/2026/01/christmas-trap.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-22T00:12:06.000Z",
    "description": "\n\tIt’s the night before Christmas, and it’s time to build a snowman. But the participants in this activity aren’t just any schoolchildren — a cameras ",
    "body": "\n\tIt’s the night before Christmas, and it’s time to build a snowman. But the participants in this activity aren’t just any schoolchildren — a cameras pans to Hogwarts’ finest: Harry, Hermione Ron. That’s not all. \n\n\tRyan Reynolds’ Deadpool is there, as is Kevin McCallister (Macauley Culkin in his star-making role from “Home Alone”). A muscle car revs down the lane, and inside is Keanu Reeves’ John Wick. After an off-color joke, he peels off and in comes Vin Diesel’s Dominic Toretto from the “Fast and Furious” franchise. Our scene ends with all parties riding shotgun with Diesel, sipping from Corona bottles and driving into the wintry night.This is not some unprecedented multiverse sequel designed to earn $1 billion in box office. It was a scene created by AI and disseminated wide across the internet nearly a month ago. For some, it demonstrated the novelty of AI tools and how they might mash up beloved characters. For others, particularly in the industry, it demonstrated the fight ahead to protect intellectual property as tech moves miles faster than policy.\n\t\n\n\tIn his first interview, the clip’s creator Andrii Daniels estimates nearly 5 million people watched his two-part fantasia, titled “Harry Potter and the Christmas Trap,” on Instagram alone. His recent work has received nearly 17 million views across platforms including X, according to data he shared with Variety.\n\n\n\tWhat viewers didn’t see was the 40 hours Daniels spent laboring on the project from inside a bomb shelter during a 2025 missile attack in Kyiv. The Ukrainian filmmaker has been creating “fan tributes,” as he called them, under a blanket of explosions since 2022. His work has never reached the kind of audiences it did over the most recent holiday break. As a non-English speaker, Daniels preferred to be interviewed via email (though Variety did confirm his identity via Zoom). Here, we discuss his work as an escape from the horrors of war and the remarkable reach of “Christmas Trap.” \n\n\n\n\t\n\n\t\t\t\t\tAI filmmaker Andrii Daniels\n\t\t\t\t\t\t\t\t\tMade with Google AI\n\t\n\n\n\t\n\t\tHow did you get started in entertainment and media? \t\n\n\tI’ve always had two passions: films and writing. The movie industry is notoriously tough to break into, so I decided to pursue writing instead. I started freelancing and landed a gig with OK! Magazine and Radar Online, as well as other publications. As AI became more advanced, the demand for freelance writing services decreased tremendously. But instead of giving up and blaming AI for taking my job, I decided to master the tools myself. When I started, my sister was already well-versed in AI technology, so she helped me cut through the ‘information overload’ of the AI landscape in just a few weeks. When working with AI, you need to know exactly which tools work and which don’t for your specific goals.\n\t\n\t\n\t\tWhat drew you to cinema?\t\n\n\tI grew up captivated by the movie magic of the big screen. For years, I studied and analyzed movies, but as an independent creator, I was limited by the “physics” of traditional production.  That changed in the summer of 2025. I started experimenting with generative AI tools and realized they were a new kind of lens. For the first time, I could direct scenes that were previously only possible with a million-dollar studio budget. AI finally allowed my technical skills in cinematography to catch up with the scale of my imagination. High costs of traditional production are a barrier to entry for independent creators. What I love most about AI filmmaking is the democratization of the craft. \n\t\n\t\tDid you expect your Christmas clip to hit the way it did? \t\n\n\tI honestly didn’t expect it to reach millions. My videos usually average around 2,000 views. There were moments when I felt truly discouraged and asked myself, “Why am I even doing this?” Imagine my surprise when my video got 500,000 views overnight. When I woke up and saw the numbers, I couldn’t believe my eyes. This viral moment taught me that creative success isn’t about the first attempt. It’s about refusing to give up when it seems that no one is watching your content.  For me, this project was a transformative fan tribute, a way to explore how these different worlds could collide in a festive, unexpected setting and to give cinema lovers like me a Christmas gift by imagining this bizarre multiverse mashup of characters. \n\t\n\t\tHow long did it take you to complete that clip? \t\n\n\tThe project took approximately 40 hours of intensive work from the initial concept to the final export. But those hours represented much more than just a production timeline. I live in Ukraine, and for me, filmmaking has become a vital sanctuary. In a reality where we face constant missile attacks, the hum of drones and power outages that last 12-18 hours a day, immersion in this digital world is my way of escaping the horrors of war. Orchestrating the scenes in my AI films allows me to reclaim a sense of control and beauty when the world outside feels like the opposite. This is part of our collective resilience here in Ukraine. Millions of Ukrainians have learned to find a sanctuary in our work and our passions while life hangs by a thread. \n\t\n\t\n\t\tDid you write the script copy, stage direction and the jokes yourself, or did your AI software generate those elements? \t\n\n\tEvery word of the script, every joke, and every beat of the stage direction came directly from me. I’ve had this specific concept in my mind for a long time, well before AI tools even existed. I was always fascinated by how these different cinematic worlds would clash if they were forced into the same room. For years, it was just an idea in my notebook. With AI tools, I could finally bridge the gap between my imagination and the screen. \n\t\n\t\tThere’s a lot of talk in Hollywood now about AI and copyright violations, were you nervous about making this featuring characters from massive intellectual property? \t\n\n\tI am aware of those conversations, and I have a deep respect for the studios and creators who built these worlds. I wasn’t nervous in a traditional sense because my intentions were always clear: this is a transformative work of parody and social commentary. \n\n\tIt is distinctly not a market substitute. No one would watch a two-minute festive parody instead of the original feature-length films. It exists as a separate artistic commentary. I have a deep respect for the copyright holders, which is why I included a clear disclaimer stating this is a 100% independent, non-commercial fan project. \n\n\tIn the legal world, there is a long history of fans creating tributes to the stories they love. I view my film as a modern evolution of that tradition. Especially given my current situation in Ukraine, working on this for 40 hours during blackouts and air raid alerts was my way of finding a sanctuary in the stories that have shaped my life. It was a labor of love, meant to celebrate these icons — not to compete with them.  \n\t\n\t\tTalk about the response to the clip, good and bad. \t\n\n\tThe response has been a fascinating look at how audiences perceive AI filmmaking at this point. The good was seeing the audience engage with the script and the humor. Seeing the global response to my specific stage direction and script was incredibly rewarding. I spent three days straight just trying to sort through my DMs. I think I finally understand what content creators with thousands of followers go through now. Beyond the praise, the most surprising thing was how many people reached out asking for my AI courses and tutorials.\n\t\n\n\tThere has also been a fair share of inevitable skepticism that comes with AI technology. Some commenters referred to it as “AI slop,” a term used for low-effort, mass-produced AI visuals. I don’t take the negative comments personally because every transformative technology in cinema has been met with similar labels.\n\t\n\t\tHave you heard from any of the studios or content owners involved in the characters you’ve used? \t\n\n\tNo, I haven’t had any direct communication from the studios or intellectual property owners. In the creative industry, high-quality fan tributes are a testament to the enduring cultural impact of these franchises. I think the industry generally understands the value of fan engagement, especially when it’s handled with the level of respect and transparency I’ve included in my disclaimer. \n\t\n\t\tShould Hollywood be embracing work like yours, that joins and celebrates characters from different worlds?\t\n\n\tI believe there is a tremendous opportunity for the industry to explore the spirit of innovation that AI tools offer. My work isn’t a replacement for the massive, coordinated efforts of major studios. It’s a transformative exploration of what’s possible. The industry could embrace this as a new form of cultural engagement. My work isn’t a challenge to Hollywood’s business model — it’s a collaborative signal because it shows exactly what makes fans excited. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "AI Creator Behind Viral ‘Deadpool,’ ‘Harry Potter’ Christmas Clip Made His Film in a Ukrainian Bomb Shelter: ‘We Find Sanctuary’ While ‘Life Hangs by a Thread’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/christmas-trap.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-22T00:12:06.000Z",
      "dateModified": "2026-01-22T00:12:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Hanging By a Wire’ Director on Dramatic Attempt to Rescue 8 People Trapped in a Cable Car Dangling Above a Valley",
    "url": "https://variety.com/2026/film/news/hanging-by-a-wire-director-rescue-cable-car-pakistan-sundance-1236637094/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Hanging_by_a_Wire-Still_3.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-22T00:01:20.000Z",
    "description": "\n\tIn a remote part of Pakistan, villagers routinely take rickety cable cars across the canyons that cut through the Himalayan foothills. But in August",
    "body": "\n\tIn a remote part of Pakistan, villagers routinely take rickety cable cars across the canyons that cut through the Himalayan foothills. But in August 2023, the unthinkable happened when a wire snapped, leaving six children and two adults hanging 900 feet above a ravine.\n\n\tMohammed Ali Naqvi, a Pakistani filmmaker, watched along with the rest of the world as authorities and volunteers rushed to save the stranded passengers. But the dramatic rescue effort, one that involved army helicopters, makeshift chairlifts and ziplines, might not have happened without some social media-savvy community members, who used cellphones and drones to capture the harrowing ordeal and spur the government into action.\n\t\n\n\t“TikTok changed that game,” Naqvi says. “They knew: ‘Don’t call the police. Post these stories on Instagram.'”\n\n\n\tAfter 14 hours suspended between life and death, all of the passengers were saved. More than two years later, their ordeal and the rescue workers’ heroic race against time inspired a new film, “Hanging by a Wire,” that premieres on the opening day of the Sundance Film Festival. Naqvi, who combed through hours of archival footage, directs the propulsive documentary, which he likens to “The Goonies” or “Cliffhanger.”\n\n\t“This is like a full-on, Hollywood-style action thriller,” Naqvi says. \n\n\t“Hanging By a Wire” not only follows the kids and adults as they wait desperately for help to arrive, but it also profiles the government officials and good samaritans scrambling to find a way to reach the trapped villagers. They include Sahib Khan, a local cable car expert dubbed the “sky pirate,” who worked with zipline expert Muhammad Ali Swati to set up a system of pulleys that helped rescue the passengers. There’s also Sonia Shamroz Khan, a district police officer, who helped oversee the operation. All of them share their reflections on the dramatic events, which often had them risking their own lives.\n\t\n\n\t“So many of the films that come from this region are framed through the lens of victimhood, of helplessness, of poverty and poverty porn,” Naqvi says. “I did not want to do that. I wanted to be deliberately subversive with this one. I wanted to show these people as resilient, as having agency. I wanted to show them as heroes.”\n\n\t“Hanging By a Wire” includes some reenactments because some of the rescues took place at night, making it hard to find suitable archival material. But it was the actual rescuers and the rescued villagers who were acting out the ordeal for the cameras.\n\n\t“I know some documentary filmmakers shy away from reenactments, but to me they were showing me what happened to them,” Naqvi says. “They were filling in the gaps. In a way, they were co-authoring their own story.”\n\n\tNaqvi hopes that the film draws attention to the Battagram district where the accident happened. It’s a region that lacks good roads, and one desperately in need of better infrastructure. It was something Naqvi experienced firsthand when he journeyed to the area to interview the people involved with the rescue operation.\n\n\t“It’s the craziest, bumpiest ride,” Naqvi says. “You’re going up the Himalayan Mountains. It’s so narrow and you’re in this Jeep. One false move and you fall to your death.” \n\n\tAt one point, he decided to ride in one of the cable cars. \n\n\t“I was doing some location scouting, and I convinced myself it would be fine,” Naqvi says. “It’s petrifying. About halfway across, I thought, never again!”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Hanging By a Wire’ Director on Dramatic Attempt to Rescue 8 People Trapped in a Cable Car Dangling Above a Valley",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Hanging_by_a_Wire-Still_3.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-22T00:01:20.000Z",
      "dateModified": "2026-01-22T00:01:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Beverly Crusher In 'Star Trek: The Next Generation' 'Memba Her?!",
    "url": "https://www.tmz.com/2026/01/22/beverly-crusher-star-trek-the-next-generation-memba-her/",
    "image": "https://imagez.tmz.com/image/9b/16by9/2026/01/08/9be05af6d4464b65bd51093193d90b52_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-22T08:01:22.000Z",
    "description": "\n    \n                    \n                          Beverly Crusher In\n                          'Star Trek: The Next Gen'\n                          ",
    "body": "\n    \n                    \n                          Beverly Crusher In\n                          'Star Trek: The Next Gen'\n                          'Memba Her?!\n                      \n                  \n                                                                        Published \n                              January 22, 2026\n                            12:01 AM PST\n                                                                            \n      \n    \n          American actress Gates McFadden is best known for playing the chief medical officer -- and hot redhead -- Dr. Beverly Crusher in the long-running sci-fi show \"Star Trek: The Next Generation\" ... back in 1987.\n      \n    \n          While you're here, can you solve the \"Star Trek\" trivia below:\n      \n    \n          McFadden was part of an ensemble cast, including Jonathan Frakes, Patrick Stewart and Michael Dorn.\n      \n    \n          Guess what she looks like now in her 70s!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Star Trek\n              \n                          \n                TV\n              \n                          \n                Memba Them\n              \n                          \n                Photo Galleries\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Beverly Crusher In 'Star Trek: The Next Generation' 'Memba Her?!",
      "image": [
        "https://imagez.tmz.com/image/9b/16by9/2026/01/08/9be05af6d4464b65bd51093193d90b52_xl.jpg"
      ],
      "datePublished": "2026-01-22T08:01:22.000Z",
      "dateModified": "2026-01-22T08:01:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bryan Kohberger New Crime Scene Photos Show Bloody Aftermath Inside Murder Home",
    "url": "https://www.tmz.com/2026/01/21/bryan-kohberger-crime-scene-photos-bloody-house/",
    "image": "https://imagez.tmz.com/image/ec/16by9/2026/01/22/ec2c3883d5654f1a94ced58c6ea2081f_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-22T02:06:10.000Z",
    "description": "\n    \n                    \n                          Bryan Kohberger\n                          Inside The Ghastly Bedroom Murders\n                    ",
    "body": "\n    \n                    \n                          Bryan Kohberger\n                          Inside The Ghastly Bedroom Murders\n                      \n                  \n                                                                        Published \n                              January 21, 2026\n                            6:06 PM PST\n                                                                            \n      \n    \n          Bryan Kohberger's killing spree in Idaho left a blood-soaked mess behind ... and newly released photos from the crime scene show just how gory this quadruple murder really was.\n      \n    \n          Idaho State Police released the photos from the November 2022 murders ... and you see blood all over the rooms of the home shared by Kohberger's victims, who were students at the University of Idaho.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Blood is splattered all over the place ... on sheets, mattresses, walls, furniture, doors, walls, floors and household items.\n      \n\n          There's even blood-soaked belongings ... including computers, clothes, shoes and cellphones ... and the bedrooms look like a bomb went off.\n      \n    \n          Perhaps the most chilling photo ... bloody handprints on a nightstand.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          This is the first time we are seeing such graphic photos from the crime scene ... images had been released from inside the home before this, but nothing with this much blood.\n      \n    \n          Kohberger is spending the rest of his life in an Idaho prison after copping a plea deal in July that took the death penalty off the table before his trial.\n      \n    \n      \n        \n              \n    \n    \n          He still has not explained why he butchered Xana Kernodle, Kaylee Goncalves, Madison Mogen, and Ethan Chapin in their off-campus house.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Bryan Kohberger\n              \n                          \n                News\n              \n                          \n                True Crime\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bryan Kohberger New Crime Scene Photos Show Bloody Aftermath Inside Murder Home",
      "image": [
        "https://imagez.tmz.com/image/ec/16by9/2026/01/22/ec2c3883d5654f1a94ced58c6ea2081f_xl.jpg"
      ],
      "datePublished": "2026-01-22T02:06:10.000Z",
      "dateModified": "2026-01-22T02:06:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Danielle Brooks Predicts 'Sinners' Will Sweep Oscar Nominations",
    "url": "https://www.tmz.com/2026/01/21/danielle-brooks-oscar-nominations-sinners-prediction/",
    "image": "https://imagez.tmz.com/image/cc/16by9/2026/01/21/ccedc6a2c08c48368cf50bf031f7f0de_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-22T01:00:11.000Z",
    "description": "\n    \n                    \n                          Danielle Brooks\n                          Calling it Now... 'Sinners' For Best Pic Oscar!!!\n     ",
    "body": "\n    \n                    \n                          Danielle Brooks\n                          Calling it Now... 'Sinners' For Best Pic Oscar!!!\n                      \n                  \n                                                                        Published \n                              January 21, 2026\n                            5:00 PM PST\n                                                                            \n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          Danielle Brooks is about to be up at the crack of dawn announcing those Oscar nominations ... and she’s already got some very strong opinions on who’s about to clean up!\n      \n    \n          We caught up with the actress at LAX Wednesday, and she made it clear her pick to dominate this year is \"Sinners\" ... saying she thinks the film could have its own \"Moonlight\" moment with a surprise Best Picture win.\n      \n    \n          You gotta catch the full clip ... Danielle goes hard for \"Sinners,\" but she also name-checks another major contender that’s high on her list too.\n      \n\n          Danielle -- who was nominated for an Oscar for \"The Color Purple\" in 2024 -- even had some real talk for anyone bracing for a snub, stressing that awards are ultimately about personal opinion ... and sometimes, it’s just not your year.\n      \n    \n          Either way, she’s wishing all the hopefuls the best of luck! And we're wishing you luck on this Oscars trivia quiz below:\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Danielle Brooks\n              \n                          \n                Celebrity News\n              \n                          \n                Movies\n              \n                          \n                Exclusive\n              \n                          \n                The Oscars\n              \n                          \n                In The Field\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Danielle Brooks Predicts 'Sinners' Will Sweep Oscar Nominations",
      "image": [
        "https://imagez.tmz.com/image/cc/16by9/2026/01/21/ccedc6a2c08c48368cf50bf031f7f0de_xl.jpg"
      ],
      "datePublished": "2026-01-22T01:00:11.000Z",
      "dateModified": "2026-01-22T01:00:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'Two Ways With Erica Mena' Contestant Pee Wee Dead at 23, Man Charged With Murder",
    "url": "https://www.tmz.com/2026/01/21/pee-wee-two-ways-with-erica-mena-contestant-murdered/",
    "image": "https://imagez.tmz.com/image/ac/16by9/2026/01/21/ac59844b31cc4e6da088e0315e8ed7fd_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-22T00:30:54.000Z",
    "description": "\n    \n                    \n                          'Two Ways With Erica Mena' Pee Wee\n                          Dead at 23, Gunned Down In St. Louis",
    "body": "\n    \n                    \n                          'Two Ways With Erica Mena' Pee Wee\n                          Dead at 23, Gunned Down In St. Louis\n                      \n                  \n                                                                        Published \n                              January 21, 2026\n                            4:30 PM PST\n                                                                      |\n                                                                Updated \n                                  January 21, 2026\n                                6:25 PM PST\n                                    \n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          A contestant on Erica Mena's reality dating show was fatally shot in St. Louis ... and prosecutors have already charged a man with murder in connection with the death.\n      \n    \n          \"Two Ways With Erica Mena\" contestant Pee Wee was found shot early Wednesday morning and he died at the scene ... according to the St. Louis Metropolitan Police Department.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Pee Wee -- government name Jardyn Walker -- had been reported missing Tuesday night and was last seen delivering packages for his job in the University City area ... according to the University City Police Department.\n      \n\n          UCPD says Pee Wee was supposed to meet his sister at the Amazon Hazelwood plant for a ride home, but he never showed up ... leading to an investigation.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Law enforcement says Pee Wee was found in an alley near where his cell phone was pinging in the city's Central West End ... and police connected the shooting to an earlier call for shots fired.\n      \n    \n          Police say when they responded to the shots fired call Tuesday night, they saw a car quickly leaving the area ... officers stopped the car and found 27-year-old Jamaal Jones inside the car, armed with a weapon ... and he was arrested.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Prosecutors have since charged Jones with first-degree murder, armed criminal action and tampering with evidence in connection to Pee Wee's death ... and we have obtained his mug shot.\n      \n    \n          Pee Wee competed for Erica's love on her Zeus Network reality dating show ... and Erica is taking to Instagram to remember him.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          She posted several Instagram Stories with photos of Pee Wee along with emojis of broken hearts and doves ... she also wrote, \"I'm so sorry\" and \"Crushed.\"\n      \n    \n          His costar Celina Powell tells TMZ ... \"Peewee was genuinely such a light on the show, kept everyone laughing & really kept in touch with everyone once filming wrapped. He was always meant to be a star, my heart really goes out to his family and loved ones 💔\"\n      \n    \n          Pee Wee was just 23.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          RIP\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Erica Mena\n              \n                          \n                RIP\n              \n                          \n                Reality TV\n              \n                          \n                News\n              \n                          \n                True Crime\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Two Ways With Erica Mena' Contestant Pee Wee Dead at 23, Man Charged With Murder",
      "image": [
        "https://imagez.tmz.com/image/ac/16by9/2026/01/21/ac59844b31cc4e6da088e0315e8ed7fd_xl.jpg"
      ],
      "datePublished": "2026-01-22T00:30:54.000Z",
      "dateModified": "2026-01-22T00:30:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Mitt Romney's Sister-in-Law Left Suicide Note In Book of Mormon, Had Xanax In System",
    "url": "https://www.tmz.com/2026/01/21/mitt-romney-sister-in-law-left-suicide-note-inside-book-of-mormon/",
    "image": "https://imagez.tmz.com/image/e6/16by9/2026/01/22/e63994445f0b41658e438cf7400001bb_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-22T02:24:32.000Z",
    "description": "\n    \n                    \n                          Mitt Romney's Sister-In-Law\n                          Suicide Note In Book of Mormon, Xanax In Sy",
    "body": "\n    \n                    \n                          Mitt Romney's Sister-In-Law\n                          Suicide Note In Book of Mormon, Xanax In System\n                      \n                  \n                                                                        Published \n                              January 21, 2026\n                            6:24 PM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Mitt Romney's sister-in-law left a handwritten suicide note tucked inside a Book of Mormon and had Xanax in her system when she died ... according to the L.A. County Medical Examiner.\n      \n    \n          The ME's report says detectives discovered a Book of Mormon on the front passenger seat of Carrie's car. In the final pages of the book, authorities say Carrie left a handwritten suicide note. Medications were also found inside the vehicle.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          The report states Carrie had 6.3 ng/mL of Xanax in her system at the time of her death. A witness told first responders Carrie was seen pacing on the top level of the parking structure, watching security cameras, and looking over the edge of the parapet. The report also states surveillance footage captured her final moments.\n      \n\n          The medical examiner's findings note the injury occurred when she fell backward from a seated position on the rooftop parapet.\n      \n    \n          As we reported ... Carrie died from blunt traumatic injuries after falling from the rooftop of a parking structure in Valencia, California, back in October.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Carrie's husband, Scott Romney -- Mitt's brother -- had reported her missing to the Sheriff's Department. He told authorities she previously drove her car off a cliff two years earlier and had struggled with anxiety, per the report.\n      \n    \n          At the time of her death, Carrie was also in the middle of a divorce. Scott filed in June, citing \"irreconcilable differences.\" The couple married in 2016, and Carrie was Scott's third wife.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Carrie Elizabeth Romney\n              \n                          \n                Mitt Romney\n              \n                          \n                RIP\n              \n                          \n                Drugs & Alcohol\n              \n                          \n                Politics\n              \n                          \n                News\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Mitt Romney's Sister-in-Law Left Suicide Note In Book of Mormon, Had Xanax In System",
      "image": [
        "https://imagez.tmz.com/image/e6/16by9/2026/01/22/e63994445f0b41658e438cf7400001bb_xl.jpg"
      ],
      "datePublished": "2026-01-22T02:24:32.000Z",
      "dateModified": "2026-01-22T02:24:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]