[
  {
    "title": "European Film Market Chief Tanja Meissner on How the Event Has Evolved to Adjust to Showbiz Changes",
    "url": "https://variety.com/2026/film/news/european-film-market-tanja-meissner-2026-1236665100/",
    "image": "https://variety.com/wp-content/uploads/2025/02/Tanja-Meissner.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-17T08:20:27.000Z",
    "description": "\n\tTanja Meissner, director of Berlinale Pro, a role that includes management of the European Film Market, points to a number of highlights in this yea",
    "body": "\n\tTanja Meissner, director of Berlinale Pro, a role that includes management of the European Film Market, points to a number of highlights in this year’s event, which wraps Wednesday.\n\n\tFirst, is the Animation Days initiative, which was introduced this year. “We wanted to support the independent animation industry, since it’s a difficult context for them. Animation is a genre in which Europe really truly excels, and Germany is a very strong exporter of animation fare,” she says.\n\t\n\n\t“The export numbers are really high for family entertainment, which you don’t see in festivals, but it’s a very dynamic industry with a high-end expertise and world-class production facilities. And we have a lot of sales companies in the market who sell independent animation, and we want to support them by giving this a broader appeal, and I think animation needs to be highlighted in this difficult context, in a market like ours.”\n\n\n\tReferring to difficulties in the market for animation, she adds, “A lot of the platforms don’t commission animation anymore, and that’s really weird, because children determine the choices that people make when they subscribe to platforms. There is less public [funding] support for animation, and we have a lot of policymakers who attend the market, so by highlighting animation in this context is our way to try to give it a bigger stage, and really support it by putting it in a bigger context.”\n\n\tThe second thing that EFM is focusing on is genre filmmaking, she says. “Genre movies have much more broad recognition. They are getting more critical acclaim, and they have more prestige in festivals like Berlinale than before, and our industry invests differently in that now. Genre projects are increasingly being positioned as prestige cinema rather than B movies, and they attract top talent, and they attract bigger budgets, and many filmmakers are blending horror and sci-fi with drama and with art-house sensibilities. And I love that.\n\t\n\n\n\n\t\n\n\t\t\t\t\tEuropean Film Market\n\t\t\t\t\t\t\t\t\tCredit: European Film Market / Juliane Eirich\n\t\n\n\n\n\t“And now we are working with Frontières festival, which has created this work-in-progress showcase for us because I wanted to give them the credit for what they are doing. Frontières is such a strong brand, and what they have achieved I really think is worth recognizing. It’s great what they do and the way they build this brand. So, this is something I didn’t want to reinvent from scratch when they do it already very well. So we collaborate here with them.”\n\n\tA third focus is on gaming and XR. “The idea here is to connect new, different players to the traditional ones that come to our market, to renew creative energies and everything that could also be a potential growth driver in terms of business for the traditional film industry. Everything we do at EFM is really about creating new business opportunities. It’s not about expanding, it’s about really complementing something that could be interesting to the traditional linear content development, or content economy. So that’s what EFM Beyond is about.\n\n\t“Beyond is a term that evokes everything that goes maybe beyond the common ground that is very familiar to us, but it could be a potential growth driver and creating the space for new groups of people, for bringing new players with different equity, with different funding, that can add value, I think, to what we do and can create additional revenue streams for independent IP from neighboring creative industries.”\n\n\tShe adds, “We take a close look at monetizing strategies to unlock traditional IP in transmedia formats, from film to gaming. We have one session, for example, where there’s 10 game developers who pitch their projects that are suitable for adaptation into web series, into animation, into location-based entertainment, into traditional film and to XR, as we have all those in place to make this a viable business model. And I think integration of new participant groups is vital for a market like ours, also in terms of younger perspectives, in terms of different views on projects, of how storytelling reflects realities of younger people. And in this way, we want to deepen existing partnerships, but also initiate new collaboration.\n\n\t“So this is where the games accelerator comes into place, where we have traditional producers who want to have strong IP, independent IP, who wish to acquire fundamental skills to adapt those IPs into complementary formats.\n\t\n\n\t“What we need is an understanding that the film industry does not operate in a comfort zone. It’s a very dynamic environment, and markets are really evolving. And I can see that everywhere. I believe that it should be a mission for film markets to pick up on trends and on challenges. It’s not expanding for the sake of expanding, it’s really trying to see the needs of the independent sector to stay competitive and where we must invest in innovation.\n\n\t“The MEDIA report pointed out that the growth, and not just in Europe, is increasingly driven by digital innovation and consumer-centric approaches, such as mobile engagement, and so we have invested in the Innovation Hub. I think it’s important for us to create a space to experiment with new forms of storytelling and to invest in an innovative mindset. Because not all the Europeans do. And, innovation is not just technology. It’s also about tackling new business opportunities and cultural relevance also. That’s what the creative industries are about. We evolve constantly.\n\n\t“The good thing is that we build on very solid foundations. We are the service platform for rights trading, and it’s in the heart of the market, but maybe we have to be more than this. We have to do something else, and producers require, increasingly, skills that go far beyond traditional filmmaking. In order to stay competitive, they also need to have data literacy. They have to know about audience engagement. They have to have an IP strategy, like going away from the single IP development to a slate portfolio kind of development. They need to be savvy with AI tools and marketing and cross-sector collaboration.”\n\n\tAnother focal point is increasing networking opportunities for producers. Meissner says, “The biggest asset of every producer is the address book, and probably not just of the producer, but of everybody who works in the creative industry. So this is why we are constantly trying to increase the possibility of networking formats, because serendipity is very important in what we do to meet people and to get new business partnerships. And so we are investing a lot in driving that and finding innovative business strategies.\n\n\t“And also we focus on cross-sector collaboration. We connect, for example, documentary film producers with animation studios in matchmaking sessions because they don’t necessarily know eachother, and when they go to only documentary film markets or only animation film events they won’t necessarily connect. So I believe what we can do here is spark new relationships. And Berlin is very compact, and very accessible also, because you can fly easily to Berlin, and you have this great setting that we have.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "European Film Market Chief Tanja Meissner on How the Event Has Evolved to Adjust to Showbiz Changes",
      "image": [
        "https://variety.com/wp-content/uploads/2025/02/Tanja-Meissner.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-17T08:20:27.000Z",
      "dateModified": "2026-02-17T08:20:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Berlin Panorama Pic ‘A Russian Winter’ Probes War and Extremism With a Twist: ‘The Key Was to Make It as Universal as Possible’",
    "url": "https://variety.com/2026/film/news/berlin-panorama-russian-winter-1236663784/",
    "image": "https://variety.com/wp-content/uploads/2026/02/11_UnHiverRusse_Stills_250325_1.144.1.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-17T06:55:00.000Z",
    "description": "\n\tby Gregg Goldstein\n\n\tAmidst all the chaos and destruction since Russia launched a full-scale invasion of Ukraine, one important part of the picture ",
    "body": "\n\tby Gregg Goldstein\n\n\tAmidst all the chaos and destruction since Russia launched a full-scale invasion of Ukraine, one important part of the picture is often overlooked: some 900,000 exiles who left Russia to avoid prison or being drafted into a war that’s created hundreds of thousands of casualties. A handful of their stories are explored in Patric Chiha’s documentary “A Russian Winter” (“Un Hiver Russe”), which has its world premiere Feb. 17 in the Berlin Film Festival‘s Panorama section.\n\t\n\n\tThe feature plays out in the style of Richard Linklater’s fictional “Before” trilogy, following a pair of artist friends, Margarita and Yuri, as they wander around Paris discussing their situation and the existential questions it inspires.\n\n\n\t“The day I watched the news in September 2022, there were images of young men crossing the Georgian border, fleeing on foot, by bicycle, by car,” the French writer-director Chiha recalls. “While they were experiencing a situation unimaginable to me, their faces seemed to speak in a very profound way about our world, its fragility, its violence and its cause.”\n\n\tMost chronicles of the war have focused on Ukraine’s destruction and the death of civilians and soldiers on both sides of the fight. But this film’s more personal focus serves to examine a much larger subject.\n\n\t“Since the start of the war in Ukraine in 2014, or maybe the invasion in 2022, we have had the feeling that the semblance of peace in which we lead our Western lives could slip away from us at any moment,” Chiha says. “Some may wonder why I didn’t shoot in Ukraine, where people are obviously suffering more, and more violently. I have friends there, and I went to Kviv for a festival in April 2024, where I had the chance to meet Ukrainian film directors. I understood that it’s up to them to tell their story.” So instead, Chiha sought to get the perspective of Russians who could offer specific insights into how they feel about the war, why they are against their homeland’s regime and what daily life under its oppressive government is like.\n\t\n\n\tKatia Khazak, who produced the feature with fellow Aurora Films exec Charlotte Vincent, has worked with Chiha on narrative and doc projects for some 20 years. She helped enlist Le Fresnoy – Studio national des arts contemporains as its co-producer, and obtained additional funding from the French nation cinema body CNC, Région Île-de-France and Image/Mouvement du Centre National des Arts Plastiques.\n\n\tBrussels-based Best Friend Forever, which is handling international sales on “Winter,” has already secured two distributors — Léopard Films in France and Filmgarten in Austria — both of which will give the feature a theatrical release.\n\n\t“The idea [with “Winter”] is to speak about what a lot of countries are going through right now where extreme regimes are rising,” Khazak says. “The key was to make it as universal as possible.” This was partly accomplished by shooting in nondescript parts of Paris, which also helped preserve the anonymity of the film’s subjects. But visual effects that “paint” the buildings in different colors, mirroring a party that the main protagonists attend with fellow artists, help to keep the film visually interesting.\n\n\tChiha feels that “Winter” will also have a special resonance for people in the U.S. today. “In France, we demonstrate a lot. But in the last three years, I’ve had such a big feeling that this doesn’t change anything anymore,” he says. “What can we do? What is this feeling of powerlessness? So I think this is a film about all of us.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Berlin Panorama Pic ‘A Russian Winter’ Probes War and Extremism With a Twist: ‘The Key Was to Make It as Universal as Possible’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/11_UnHiverRusse_Stills_250325_1.144.1.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-17T06:55:00.000Z",
      "dateModified": "2026-02-17T06:55:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nippon TV Launches Viral Pocket Division to Expand Into Microdrama Market – Global Bulletin",
    "url": "https://variety.com/2026/tv/news/nippon-tv-viral-pocket-microdramas-1236665094/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Viral-Pocket.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-17T07:06:57.000Z",
    "description": "\n\t\tVERTICAL VANGUARD\t\n\n\tJapanese broadcaster Nippon TV has launched Viral Pocket, a new vertical video division aimed at the fast-growing microdrama s",
    "body": "\n\t\tVERTICAL VANGUARD\t\n\n\tJapanese broadcaster Nippon TV has launched Viral Pocket, a new vertical video division aimed at the fast-growing microdrama space.\n\n\tThe division draws on the success of Nippon TV’s short-form drama “We are Coy Every Day,” which has amassed over 2.6 billion organic views since its March 2023 debut. A third title, “The Final Lesson – Only Survivors Graduate,” recently won at the inaugural Asia Short-Form Drama Awards.\n\t\n\n\tViral Pocket will operate across three areas: original IP development, end-to-end vertical production, and KPI-driven marketing support for brands and agencies. The division has already partnered with Japanese food company Nissui, generating over 10 million organic views in two weeks with branded content centered on food allergies.\n\n\n\t“Through Viral Pocket, we will further invest in developing emerging creators and new content formats,” said Hirofumi Tanaka, Nippon TV’s president of content strategy.\n\t\n\t\tAI ARTISANS\t\n\n\tEros Innovation has launched Eros Universe, an AI-powered creator economy app built on what the company calls Large Cultural Models (LCMs), at the India AI Impact Summit.\n\n\tDeveloped by its ErosGenAI division, the LCM framework is designed to embed cultural context, narrative structure and regional storytelling into AI systems, trained on over 1.5 trillion rights-cleared tokens drawn from five decades of licensed cinematic and musical assets. The platform draws on a library of more than 12,000 films and 100,000 characters.\n\n\tEros also announced a $5 million Global Creator Acceleration Program supporting AI-native films, series and music projects. Founder Kishore Lulla said the platform enables creators to participate directly in the digital economy while protecting the cultural value of Indian storytelling.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nippon TV Launches Viral Pocket Division to Expand Into Microdrama Market – Global Bulletin",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Viral-Pocket.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-17T07:06:57.000Z",
      "dateModified": "2026-02-17T07:06:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Priya Mani, Mohit Raina to Star in Indo-U.S. Immigrant Family Drama for Red Bison, Azure Entertainment (EXCLUSIVE)",
    "url": "https://variety.com/2026/film/news/priya-mani-mohit-raina-indo-us-immigrant-family-drama-1236664500/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Azure-Red-Bison.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-17T05:00:00.000Z",
    "description": "\n\tU.S.-based Red Bison Productions has partnered with Mumbai’s Azure Entertainment on a cross-border feature film marking the Indian company’s inaugur",
    "body": "\n\tU.S.-based Red Bison Productions has partnered with Mumbai’s Azure Entertainment on a cross-border feature film marking the Indian company’s inaugural Hollywood collaboration.\n\n\tHarsh Mahadeshwar is writing and directing the currently untitled project, which centers on the true story of an immigrant family’s experience navigating cultural identity and belonging in America. Indian National Film Award-winning actor Priya Mani (“Paruthiveeran,” “The Family Man”) and Mohit Raina (“The Freelancer”) are attached to star.\n\t\n\n\tPrincipal photography is set to commence in April, with filming planned across New York and New Jersey, as well as Delhi and Jammu-Kashmir in India.\n\n\n\t“This project is very close to my heart because it explores identity and belonging in a deeply honest way,” Raina said. “Being part of Azure Entertainment and Red Bison Productions’ first Indo-Hollywood collaboration makes it even more special, as it represents a meaningful step toward global storytelling.”\n\n\tMani added: “What drew me to this film instantly was the emotional truth of the story. I’m grateful to be part of a project that brings together such committed collaborators to tell a story that will connect with audiences across borders.”\n\n\tRomila Saraf Bhat, founder of Red Bison Productions, said: “From its inception, this story demanded a global voice and an honest cinematic treatment. With Priya Mani and Mohit Raina leading the cast, and an inspiring narrative that spans continents, we are creating cinema that is deeply personal yet universally resonant.”\n\n\tPrashant Ramesh Mishra, CEO and co-founder of Azure Entertainment, described the venture as pivotal for his company’s expansion strategy. “This film represents a defining moment for Azure Entertainment as we step into global cinema for the first time,” Mishra said. “This story goes beyond borders and beyond the idea of the American Dream, reflecting on to the shared human experience of aspiration, loss, and resilience.”\n\t\n\n\tAzure Entertainment previously produced “Rocky Handsome,” “Badla” and “Kesari.” Red Bison’s credits include “Bhaag Bawre Aandhi Aayi.” \n\n\tAdditional casting details and the film’s title will be revealed at a later date. The film was previously launched with a different title and cast in 2023 and has since been revamped and redesigned. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Priya Mani, Mohit Raina to Star in Indo-U.S. Immigrant Family Drama for Red Bison, Azure Entertainment (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Azure-Red-Bison.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-17T05:00:00.000Z",
      "dateModified": "2026-02-17T05:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Oscar-Winning ‘No Other Land’ Co-Director Hamdan Ballal Denounces New Attack by Israeli Settlers, Says Brother Hospitalized, Family Members Arrested",
    "url": "https://variety.com/2026/film/global/oscar-no-other-land-director-hamdan-ballal-attack-israeli-1236665106/",
    "image": "https://variety.com/wp-content/uploads/2025/07/No-Other-Land_Still_04.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-17T08:18:34.000Z",
    "description": "\n\tHamdan Ballal, co-director of Oscar-winning documentary “No Other Land” has sounded an alarm saying his family has been attacked again by the same I",
    "body": "\n\tHamdan Ballal, co-director of Oscar-winning documentary “No Other Land” has sounded an alarm saying his family has been attacked again by the same Israeli settlers who targeted him shortly after his Oscar win in March 2025. \n\n\tThe new attack has caused one of his brothers to be hospitalised, while four members of his family have been arrested, according to a statement posted by Balal on social media.\n\n\n\t“Two weeks ago we managed to get a decision from the Israeli court that the area around my home is closed to non-residents, but the settlers break that order and still come with their flocks almost every day,” Balal said in a post on X. \n\t\n\n\t“We call the police, they do nothing. The army comes, they do nothing. Today, Shem Tov Lusky—the settler who attacked me in my home shortly after I won the Oscar last year—came with his flock to my home. My brother called the police to report the incursion. The army came first and immediately raided our house, attacking everyone inside.”\n\n\tA few weeks after “No Other Land” won the best documentary Oscar on March 2, 2025, Ballal suffered a violent attack by Israeli settlers near his home in the West Bank village of Susiya. He was reportedly assaulted and then taken from an ambulance by Israeli soldiers. Ballal said he was zip-tied and blindfolded and held for 24 hours at an Israeli army base before being released. \n\n\tAt the time the Academy of Motion Picture Arts and Sciences came under fire for initially failing to publicly support Ballal, though they subsequently issued a follow-up letter explicitly naming Ballal and apologizing for omitting both him and the film from an earlier statement.\n\t\n\n\tThe Oscar-winning “No Other Land” was made by an Israeli-Palestinian team including Abraham, Ballal, Basel Adra and Rachel Szor and chronicles the fight of a Palestinian community in the West Bank facing displacement by Israeli forces. The film premiered at the 2023 Berlin Film Festival, winning both the documentary jury prize and the audience award. Despite widespread acclaim on the festival circuit, it was self-released in the U.S. after distributors declined to pick it up.\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Oscar-Winning ‘No Other Land’ Co-Director Hamdan Ballal Denounces New Attack by Israeli Settlers, Says Brother Hospitalized, Family Members Arrested",
      "image": [
        "https://variety.com/wp-content/uploads/2025/07/No-Other-Land_Still_04.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-17T08:18:34.000Z",
      "dateModified": "2026-02-17T08:18:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "ZDF Studios, Talpa Network Seal Free-TV Deal for 250 ‘SOKO’ Episodes (EXCLUSIVE)",
    "url": "https://variety.com/2026/tv/global/zdf-studios-talpa-network-soko-kijk-1236665109/",
    "image": "https://variety.com/wp-content/uploads/2026/02/SOKO-Koln.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-17T08:00:21.000Z",
    "description": "\n\tZDF Studios has closed a new volume deal with Dutch commercial group Talpa Network, granting Talpa free-TV rights to roughly 250 episodes drawn from",
    "body": "\n\tZDF Studios has closed a new volume deal with Dutch commercial group Talpa Network, granting Talpa free-TV rights to roughly 250 episodes drawn from multiple instalments of the long-running German crime franchise “SOKO.”\n\n\tThe agreement — the third between the two companies — spans “SOKO Potsdam,” “SOKO Hamburg,” “SOKO Köln” and “SOKO Wismar.” \n\n\tFounded in 2017 by John de Mol, Talpa’s portfolio includes major Dutch channels SBS6, NET5 and Veronica, alongside ad-supported streaming platform KIJK.\n\t\n\n\t“SOKO” – short for Sonderkommission or “special investigation unit” – is structured as a collection of locally rooted, case-driven procedurals, each following a dedicated investigative team in a specific German city or region. That modular design has helped the brand sustain long runs while offering variation across settings and ensembles.\n\n\n\tZDF Studios emphasized the franchise’s international footprint, noting that the “SOKO” brand has been sold broadly over the years to partners and platforms across multiple territories, including the U.S., Canada, Finland, Hong Kong, Nigeria, the Netherlands, Italy, Japan, France, Spain, Bulgaria, Slovakia and the Czech Republic, among others.\n\n\tThe distributor also pointed to the franchise’s industry recognition across its history, with nominations and awards spanning Germany’s top TV honors and international festival accolades such as the German Television Award, German Screen Actors Awards and Monte Carlo TV Festival’s Golden Nymph Awards.\n\n\t“We are delighted to expand our partnership with Talpa Network through this significant new deal,” said Tim Gerhartz, ZDF Studios’ chief commercial officer, arguing that “SOKO” continues to resonate through “compelling storytelling, relatable characters, and high production values.” Gerhartz added that the agreement should further strengthen the companies’ collaboration as the episodes reach audiences in the Netherlands.\n\t\n\n\tTalpa Network head of TV Network Bastiaan van Dalen said the broadcaster is “thrilled” to deepen ties with ZDF Studios and bring the package to its viewers, adding that the franchise’s mix of “engaging cases and character-driven narratives” should be a strong fit locally.\n\n\tFor ZDF Studios — the commercial arm of German public broadcaster ZDF — the Talpa agreement reflects a core export strategy: leveraging a deep German-language library and proven brands to deepen partnerships across key European markets.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "ZDF Studios, Talpa Network Seal Free-TV Deal for 250 ‘SOKO’ Episodes (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/SOKO-Koln.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-17T08:00:21.000Z",
      "dateModified": "2026-02-17T08:00:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Baltics Biz Hits France Amid ‘Growing Curiosity’ Toward the Region: ‘We Are Stronger Together’",
    "url": "https://variety.com/2026/film/global/the-baltics-france-anna-hints-cnc-1236656744/",
    "image": "https://variety.com/wp-content/uploads/2026/02/MixCollage-09-Feb-2026-12-57-PM-6551.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-17T06:45:00.000Z",
    "description": "\n\tFrance is ready for the Baltics, and the rest of the world may follow suit. \n\n\tFrom CinéBaltique festival in Paris, dedicated to Estonian, Latvian a",
    "body": "\n\tFrance is ready for the Baltics, and the rest of the world may follow suit. \n\n\tFrom CinéBaltique festival in Paris, dedicated to Estonian, Latvian and Lithuanian films — and including a tribute to Estonian filmmaker Leida Laius — to the nearly three-month program dedicated to Baltic documentary films at the Centre Pompidou, local audiences get to discover films that haven’t always been in the spotlight. \n\n\n\t“Times are changing. The industry is changing. The needs in Europe are changing. Industries that were previously considered small or peripheral are gaining attention because audiences are actively looking for something unusual, unknown and very different,” says Edith Sepp, CEO of the Estonian Film Foundation. “The Baltic countries have very distinct cinematic languages and because of recent investments in our industries, we are moving into the center of attention. Not in spite of our size, but because of it.”\n\t\n\n\tAnother important initiative? The very first France Baltic Film Meetings, a co-production workshop held by the France’s National Film Board (CNC) in Paris on Feb. 5 and 6. Apart from focusing on the Latvian smash “Flow,” which allowed producers Matīss Kaža and Ron Dyens to revisit the Oscar-winning animation, the teams behind nine selected feature projects met with French producers. \n\n\tThis included Latvia’s “Hungry Street” by Velta Emīlija Platupe, produced by Rija Films’ Vilnis Kalnaellis; “Wagner and Satan” directed by brothers Lauris and Raitis Abele, the latter producing for Tritone Studio; and “She-Devil” by Dāvis Sīmanis, produced by Gints Grūbe for Mistrus Media.\n\t\n\n\t“Our collaboration with France has been marked by close work on screenwriting, while joint film productions have resulted in outstanding cinematic works. In recent years, this partnership has gained new momentum through the development of series within the framework of the Series Mania initiatives and the co-production of ‘Flow’,” says Grūbe.\n\n\t“Latvia is now preparing to sign a bilateral co-production agreement with France, which would represent a symbolic and strategic step toward deeper and broader collaboration.”\n\n\tLithuania presented Birutė Kapustinskaitė’s “Beginners,” produced by Smart Casual’s Rūta Petronytė, “Breadcrumbs in the Snow” (Skirmanta Jakaitė, Art Shot’s Agnė Adomėnė) and “Call Me Salvador” (Titas Laucius and Afterschool’s Klementina Remeikaitė). \n\n\tRemeikaitė says she was “impressed” by the French producers’ desire to learn more about Lithuania and Baltic projects. \n\n\t“In recent years, the Baltic States have proven that winning major awards at A-list festivals, and even an Oscar for ‘Flow’, is a reality, not a dream. I want to believe this is just the beginning.” \n\n\tThe selection from Estonia included Anna Hints’ highly anticipated body horror musical “Black Hairy Beast,” produced by Johanna Maria Tamm and Evelin Penttilä for Stellar Film.\n\n\t“We’ve seen several Baltic films gain international recognition in recent years. From the outside, I sense a growing curiosity toward Baltic cinema as a region,” says Hints, also behind award-winning doc “Smoke Sauna Sisterhood.” \n\n\t“From my personal experience, ‘Smoke Sauna Sisterhood’ opened many people’s eyes to the fact that something very specific, deeply local and culturally rooted can also be profoundly universal.”\n\n\tShe adds: “The understanding that we are all connected feels especially important in the chaotic, unstable reality of filmmaking. Every film that travels internationally helps raise curiosity and attention toward the region as a whole. In that sense, each success belongs not only to one film or one country, but also to the shared cinematic space of the Baltics.”\n\n\tWitnessing the interest in “Black Hairy Beast” in Paris has been “encouraging,” she says. \n\t\n\n\t“Recognition may carry weight within the industry, but the act of creation itself still demands vulnerability, trust and faith. In that sense, each film asks you to risk yourself anew.”\n\n\t“Building on Anna’s and Stellar Film’s ongoing relationship with French audiences and partners, ‘Black Hairy Beast’ represents a natural continuation of this collaboration. Its universal themes and bold artistic approach resonate internationally,” added the producers in a statement. \n\n\tAlso presented were Elisabeth Kužovnik’s “The Bicycle Thief,” autobiographical coming-of-age story set in an Estonian-Russian family in the 2000s produced by Laura Raud (Nafta Film), and Liina Trishkina-Vanhatalo’s “First Love,” overseen by Ivo Felt at Allfilm and focusing on menopause. \n\n\t“Estonian young talent is all female-led,” noted Sepp, admitting she’s been hoping to create direct, one-on-one encounters between Estonian and French producers and sales companies for a while now. \n\n\t“As the geopolitical situation in Europe changes, interest in the Baltics has clearly grown. After all, we share the same European identity, understanding of society and goals,” she says, mentioning CNC president Gaëtan Bruel, who added in a statement: “Thanks to the co-production that France wishes to develop with Estonia, Latvia and Lithuania, the range of quality cinema on offer will also be enriched with films eagerly awaited by cinema-going audiences.”\n\n\t“He has a vision that reaches far beyond the traditional understanding of the film industry, and he approaches cooperation with openness and mutual respect. I have great hopes for the beginning of a new era for Baltic–French co-productions,” she notes.\n\n\tIn Estonia, the expansion of infrastructure  “We have two soundstages ready this summer and three more to be added by 2028”; encouragement of co-productions and the planned increase in the country’s cash rebate to 40% might further enable international collaboration. \n\n\t“We believe in partnerships, not opportunism,” says Sepp. “When democracy is under pressure, size no longer matters. Small or big, we need to stick together to survive. In the Baltics, we know very well what resistance and survival mean.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Baltics Biz Hits France Amid ‘Growing Curiosity’ Toward the Region: ‘We Are Stronger Together’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/MixCollage-09-Feb-2026-12-57-PM-6551.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-17T06:45:00.000Z",
      "dateModified": "2026-02-17T06:45:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Keshet to Launch ‘Reset,’ Dark Comedy About Mistaken Terminal Diagnoses, at London Screenings (EXCLUSIVE)",
    "url": "https://variety.com/2026/tv/global/keshet-reset-adir-miller-london-screenings-1236664481/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Reset-Keshet.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-17T08:01:00.000Z",
    "description": "\n\tKeshet International is set to launch its highly-adaptable comedy drama “Reset” at London Screenings.\n\n\tAdir Miller writes, directs and stars in “Re",
    "body": "\n\tKeshet International is set to launch its highly-adaptable comedy drama “Reset” at London Screenings.\n\n\tAdir Miller writes, directs and stars in “Reset,” a dark comedy about a man mistakenly told he has a terminal diagnosis, for Keshet International.\n\n\tThe eight-episode comedy-drama sees Emmy-winner Miller (“Traffic Light”) star as Gidi, a 50-year-old man who is given the devastating news his time is running out. Believing he is going to die, Gidi turns his life upside down: he chucks in his job, marriage and relationships. But when the diagnosis turns out to be a mistake, Gidi must reckon with the wreckage of his life.\n\t\n\n\tThe show’s exportable format has been specially designed to travel in local markets. Each episode is 60 minutes. Its launch in Israel saw it premiere as the country’s highest-rated drama premiere in five years.\n\n\n\t“Reset” is produced by Artza Productions for Keshet 12. Keshet International are repping global sales.\n\n\t“I always write about situations I know from my own life,” said Miller. “I’m 50 now, which means a midlife crisis is no longer a theory — it’s a fact. I started asking myself: if I thought I was about to die, would I finally do everything I want? And if I had to keep living, would I regret it? It’s a very serious question — which is exactly why it’s so funny. ‘Reset’ is personal, but I believe it’s also universal. We all dream about starting over… until we realize we actually have to deal with the consequences.”\n\n\tKelly Wright, MD of distribution at Keshet International, said: “In classic Adir Miller fashion, ‘Rese’ combines a universally relatable life crisis with a bold comedic engine that feels fresh and highly adaptable. Turning big emotional truths into comedy gold is exactly why Miller’s work has resonated globally for nearly two decades — and why ‘Reset’ is such a compelling opportunity for international buyers.”\n\t\n\n\tKeshet International will present “Reset” at London Screenings during its scriped showcase on Feb. 24.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Keshet to Launch ‘Reset,’ Dark Comedy About Mistaken Terminal Diagnoses, at London Screenings (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Reset-Keshet.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-17T08:01:00.000Z",
      "dateModified": "2026-02-17T08:01:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Erik Barmack, Hernán Caffiero Talk ‘Raza Brava,’ Football Fandom, Colo Colo, Soccer as Much More Than Just Spectacle",
    "url": "https://variety.com/2026/tv/global/hernan-caffiero-erik-barmack-raza-brava-the-mediapro-studio-1236664676/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Raza-Brava-Courtesy-of-The-Mediapro-Studio.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-17T06:51:23.000Z",
    "description": "\n\tThe 2026 FIFA World Cup, the biggest event in the biggest sport worldwide, will unspool June 11-July 19. It will be made memorable no doubt by not o",
    "body": "\n\tThe 2026 FIFA World Cup, the biggest event in the biggest sport worldwide, will unspool June 11-July 19. It will be made memorable no doubt by not only some matches but its fans. Few movies or series look likely to explain the fan phenomenon with a larger dramatic intensity or social nuance than “Raza Brava.” \n\n\tCreated, written and directed by International Emmy winner Hernán Caffiero (“The Suspended Mourning”), co-produced by former Netflix international chief Erik Barmack at Wild sheep Content and sold by The Mediapro Studio Distribution, “Raza Brava” was inspired by an image which went round the world: of a man in Colo-Colo’s football stadium drenched in the blood of his best friend whom he has just stabbed. The series asks how that could come about, says Caffiero.\n\t\n\n\tBased on true events, begins in 2000 with Carlos standing drenched in blood in a police cell. Cut to 1981, in a dirt-poor neighbourhood of Santiago de Chile, an adolescent Carlos gets his sneakers stolen by another kid, Clavo. “He’s got to learn to defend himself,” older brother Vladi tells his father. \n\n\n\tSet between 1981 and 2000, and narrated by Carlos, “Raza Brava” charts Carlos’ education in violence, a visceral anti-authority mind-set and love for Colo Colo, the soccer team of Chile’s humblest classes. \n\n\t“My father was intelligent but poor and to be poor with a conscience makes you lives between helplessness and bitterness. Football was his only space of freedom,” Carlos relates. Joining the White Claw, Colo Colo’s ferocious hard core supporters, “for the first time, a space belonged to me, I felt respected,” he adds. “We were no longer invisible outcasts.” Colo Colo’s also the source of larger dreams. Winning in 1991, the Copa de Libertadores. Latin America’s club championship,“was seen as a milestone that this town might recover its identity with the definitive sign that ties could change,” Carlos remembers.\n\t\n\n\tThey do, but not as Carlos imagines. In the 1990s, as mass worker protests in Chile are diluted by a burgeoning consumer society and Carlos and Clavo rise to become leaders of White Claw by 1996, when the club gives Carlos 2,000 tickets a match to use or sell, it becomes a business with records, magazines, concerts and tickets sales. White Claw’s sense of brotherhood is replaced by a struggle for power, money and prominence. For Carlos it becomes a prison. Despite alienating his wife and baby daughter, it’s one from which it seems he cannot escape.\n\n\n\n\t\n\n\t\t\t\t\tRaza Brava\n\t\t\t\t\t\t\t\t\tCourtesy of Mediapro\n\t\n\n\n\n\t“The series works on several levels,” comments Javier Esteban, The Mediapro Studio International Director, “There’s a historical part of Chile under and emerging from dictatorship, the union of two of the world’s biggest global passions, as Erik comments, and it’s a series which talks about soccer, but also political transition and family. Another key feature of this series is its realism and authenticity, including the characters.” \n\n\tVariety talked to Caffiero and Barmack and in the run-up to the Berlinale Series Market Selects, a 20-series strand at the Berlin Film Festival where “Raza Brava” will make its market debut.\n\n\tYour series bows in a year of a FIFA World Cup, which is much more than just set of matches…\n\n\tHernán Caffiero: Yes, it mixes soccer, social issues and politics. To treat soccer as just spectacle doesn’t really get at its true dimension, what it means in the past and for the world now: the projection of a team’s triumph, the sense of belonging. The quantity of fans who will arrive in the U.S from countries around the world will make them one of its talking points, most surely.\n\n\t“Raza Brava” captures very well the confluence of personal, the club and even Chile when it comes to Colo Colo. When Colo Colo plays Boca in the 1991 Copa de Libertadores, Latin America’s club championship, “Raza Brava” shows its fans sensing or hoping this could be the the beginning of a new era…\n\n\tCaffiero: “After Pinochet left power, although the violent repression against the Chilean people came to an end, the sense of a new spring never really reached most people, or the closest they got was with Colo Colo: The triumph of the people, embodied in a football team which for the first time in its history was the best in something so popular and massive as football.”\n\t\n\n\tA victory which was so important because of what happened in 1973…. \n\n\tCaffiero: In 1973, Colo Colo got to the final and lost the second play off, where they were robbed, which opened the doors to the darkest part of what happened three months later in Chile. Since that defeat, there’s a permanent link between soccer, society, politics, violence and marginalization, which is found not just in Chile but in South America and places where there’s more poverty and marginalization, such as Morocco or Turkey, Algeria and Naples in Italy. The series turns on that.\n\n\tYou’ve said, Erik, that “Raza Brava” unites the two biggest passions in the world, football and entertainment.… \n\n\tErik Barmack: The world is becoming more global. I can wake up and watch series and a hundred different football matches from a hundred different parts of the world – there’s more noise and more content on YouTube than ever. But when you look at clubs like Colo-Colo, the passion is authentic and global in nature. More than 20 million people watch Colo-Colo or feel some association with the club, and that kind of connection can’t be faked. In a world where there are more and more deep fakes and questions about what content represents, this project – and football itself – taps into something real. It’s one of the few things that truly cuts through on a global level.\n\n\tOne way that series can connect globally is via genre, another by depicting universal emotions. They’re caught in an extraordinarily singular reality in “Raza Brava”…..\n\n\tCaffiero: Most film, TV soccer titles turn on competition, with winning a title or the life of a specific player but “Raza Brava” turns on social, political identity, a social phenomenon found over the world.\n\n\tBarmack: Professional football emerged in industrial England, shaped by working-class communities and factory towns. From the beginning, the story of football has been intertwined with social struggle. It looks different today, but that relationship (born out of industrialization) has never disappeared. What Hernán does in “Raza Brava” is something closer to “City of God.” We’ve all seen docuseries about football teams that feel flat because they isolate the club from the social forces around it, and you can’t have one without the other.\n\n\n\n\t\n\n\t\t\t\t\tRaza Brava\n\t\t\t\t\t\t\t\t\tCourtesy of Mediapro\n\t\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Erik Barmack, Hernán Caffiero Talk ‘Raza Brava,’ Football Fandom, Colo Colo, Soccer as Much More Than Just Spectacle",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Raza-Brava-Courtesy-of-The-Mediapro-Studio.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-17T06:51:23.000Z",
      "dateModified": "2026-02-17T06:51:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "BAFTA Chair Sara Putt Joins International Jury for FFC Bulgaria €50,000 Prize",
    "url": "https://variety.com/2026/film/global/sara-putt-international-jury-ffc-bulgaria-prize-1236664915/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Sara-Putt.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-17T06:00:00.000Z",
    "description": "\n\tInternational Film Festival Glasgow, First Draft and Female Film Club have revealed the international jury for the FFC Bulgaria €50,000 prize in par",
    "body": "\n\tInternational Film Festival Glasgow, First Draft and Female Film Club have revealed the international jury for the FFC Bulgaria €50,000 prize in partnership with Film Forge.\n\n\tThe jury was announced Monday at a reception event, in partnership with Variety and the Female Film Club, which took place at The Social Hub Berlin.\n\n\tFFC Bulgaria, the Bulgarian chapter of Female Film Club – an initiative of First Draft Productions, IFFG and the Female Film Club – launched the prize at their inaugural event in Sofia, Bulgaria, during the CineLibri Intl. Film Festival.\n\t\n\n\tThe jury will have from Feb. 22, the closing date for the competition, and the beginning of May to decide on the winner, who will be announced at an event on May 18 during the Cannes Film Festival.\n\n\n\tBoth short and feature length projects of any genre are accepted and must have a Bulgarian co-producer and intend to utilize the studio space and equipment offered on the ground at Nu Boyana Studios in their Sofia facilities. All submitters must be first members of FFC Bulgaria.\n\n\tIFFG festival director and chair, Martin I. Petrov, said: “It is really heartwarming to welcome so many women and gender expansive creators to the IFFG family, through our work with the Female Film Club, and our Bulgarian partners. Film production in Eastern Europe is blooming and the generous support of Film Forge and Boyana show the high level and professionalism all young filmmakers deserve to be greeted with for their first projects.”\n\n\tFFC creators Liza Van Der Smissen and Nicole Lieberman said: “We are delighted to bring together a dynamic jury that truly cares about the filmmaking process, each having an expertise in a different area. FFC is excited that the work from our members will be seen by these industry leaders.”\n\t\n\n\tKrassimira Belev, co-creator of FFC Bulgaria and producer (First Draft), said: “For many filmmakers – especially women and non-binary creators working outside major markets – the biggest barrier is not talent but access to professional resources. Through Female Film Club Bulgaria, our aim is to support diverse voices and make the industry feel possible, not distant. We’re deeply grateful to Film Forge for this collaboration and for investing in storytellers and their future.”\n\n\tThe international jury members are:Sara PuttPutt established Sara Putt Associates in 1989 and has worked here as M.D. and agent ever since. In 2021 The Partnership Group was formed between Sara Putt Associates, Sayle Screen and The Artists Partnership to maximise opportunities for all of their clients. Putt is chair of BAFTA where she has been a trustee since 2014. Putt is also a trustee of the Film and TV Charity and sits on the advisory board of the British Film Commission. She was previously deputy chair of Women in Film and Television where she served on the board for eight years. Putt has also produced a number of short films including the BAFTA nominated “Tattoo.”\n\n\tJacqueline WagensteinWagenstein is a film festival director, film producer and distributor, and entrepreneur. She holds a degree from the New York Film Academy in Florence and a PhD in humanities from Paris. She is the founder and director of the Cinelibri Intl. Film Festival, an event that showcases films based on or inspired by literary works. Cinelibri has become one of the most prestigious international film forums in Bulgaria. Wagenstein is also the creator of BOB (Based-on-Books), an international cinema industry forum. As a producer, her work includes 10 short films, two documentaries, and more than 20 commercials and music videos.\n\n\tVanessa HannemanHenneman studied drama in Guildford and Film, Television Sciences at the London Institute and law at the University of Amsterdam where she specialized in entertainment law. In 2005, Henneman founded her own company, Henneman Agency, which has since become one of the leading talent management agencies in the Benelux, representing over 200 prominent actors, writers, directors, and other creative talents. Henneman Agency plays a key strategic role in the Benelux entertainment industry. In addition to the standard services as agency, Henneman Agency initiates new TV, film and theater projects.\n\t\n\n\tNina BlagoevaSince 2003, Blagoeva has been a member of the team at Alexandra Films, the longest-established film distribution company operating in the Bulgarian market. Alexandra Films is recognized as the most successful distributor of Bulgarian films, and has been a licensee of 20th Century Fox, Sony Pictures and Warner Bros, as well as of numerous independent U.S. and European film companies.\n\n\tMorgan Cano LongCano Long is a producer and development executive with over a decade of experience building premium film and television projects across scripted and unscripted, studio and independent spaces. She has worked extensively in early-stage development, shepherding projects from concept through packaging and financing, with a particular focus on complex, character-driven stories that sit at the intersection of culture, environment and social impact. Based in London with U.S. and LatAm industry roots, Cano Long brings a cross-border perspective to development and production. Cano Long is the founder of Spiral Shell, a hybrid commercial and impact-oriented storytelling studio focused on early-stage development, supporting diverse voices.\n\n\tLisa ColeCole is a writer/director whose work is shaped by living with 201 host families across 12 countries. Her global perspective is evident in her 2024 Oscar-shortlisted short film, “Bienvenidos a Los Angeles,” inspired by a true immigration story. Selected for the 2025 Alliance of Women Director’s Rising Director Fellowship, Cole specializes in adapting true stories that champion female liberation. Current projects include “Diamond Girls,” a feature film with Selena Gomez and producer Laura Bickford, and “Filthy,” a Sundance Development Lab Finalist. Her portfolio includes documentaries for Viacom, A&E, & BET, and films for The Gates Foundation and Sundance Institute, focusing on women’s health and safety in Kenya and DR Congo.\n\n\tMariana Conde-GrantConde-Grant is a creative producer and director shaped by a multicultural identity. With over 20 years’ experience across short film, commercials, branded content, documentary and animation, she has produced work for clients including Apple, Disney and Google, and brings a strong, practical understanding of both creative development and production.\n\n\tHer short film C.T.R.L. screened at close to one hundred international festivals, including the BFI London Film Festival, and received multiple awards. She is currently developing “Mar Sin Leat,” a character-driven short exploring identity, grief and belonging.\n\t\n\n\tIn addition, the jury will be joined by a representative from each of the organizations involved in creating FFC Bulgaria and from Film Forge: Krassimira Belev, Martin I. Petrov, Liza Van Der Smissen, Nicole Lieberman and Jasmine Becker Williams.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "BAFTA Chair Sara Putt Joins International Jury for FFC Bulgaria €50,000 Prize",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Sara-Putt.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-17T06:00:00.000Z",
      "dateModified": "2026-02-17T06:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nicki Minaj Posts Pics Of Herself With A.I.-Generated Donald Trump",
    "url": "https://www.tmz.com/2026/02/16/nicki-minaj-posts-ai-pic-with-trump/",
    "image": "https://imagez.tmz.com/image/20/16by9/2026/02/17/200dde1004f644759b52a9f1a6295680_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-17T02:23:58.000Z",
    "description": "\n    \n                    \n                          Nicki Minaj\n                          Gives Trump A.I. Makeover for Presidents' Day\n             ",
    "body": "\n    \n                    \n                          Nicki Minaj\n                          Gives Trump A.I. Makeover for Presidents' Day\n                      \n                  \n                                                                        Published \n                              February 16, 2026\n                            6:23 PM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          ChatDJT has entered the chat .... Nicki Minaj honored her new favorite POTUS this Presidents' Day with A.I.-generated photos of Donald J. Trump riding shotgun with her.\n      \n    \n          Check out the pics ... the fake DJT is swagged out in gear fit for a Barbz -- pink jacket and bedazzled jeans with a lot of bling hanging from his neck.\n      \n    \n          If you look closely, you can see that the original image appears to have featured Nicki's husband, Kenneth Petty. A reflection that looks a lot like Kenneth is seen in the window behind the A.I. Trump's head.\n      \n\n          Looks like even Nicki's hubby is taking a backseat to Trump these days. Sorry, Kenny!\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          As we reported ... Nicki referred to herself as probably Trump's biggest fan last month and -- wouldn't you know it -- the next day she revealed she was gifted a \"free\" Trump Gold Card, giving her a fast pass to citizenship.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Nicki Minaj\n              \n                          \n                Donald Trump\n              \n                          \n                Kenneth Petty\n              \n                          \n                Social Media\n              \n                          \n                Celebrity News\n              \n                          \n                Artificial Intelligence\n              \n                          \n                Hip Hop\n              \n                          \n                Politics\n              \n                          \n                Holidays\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nicki Minaj Posts Pics Of Herself With A.I.-Generated Donald Trump",
      "image": [
        "https://imagez.tmz.com/image/20/16by9/2026/02/17/200dde1004f644759b52a9f1a6295680_xl.jpg"
      ],
      "datePublished": "2026-02-17T02:23:58.000Z",
      "dateModified": "2026-02-17T02:23:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Quinton Aaron Focused on Recovery, Sad 'Wife' Is Married to Another Man",
    "url": "https://www.tmz.com/2026/02/16/quinton-aaron-recovery-focused-disappointed-wife-married-another-man/",
    "image": "https://imagez.tmz.com/image/03/16by9/2026/02/16/03ab109e99ce4d0383965e5ef63c4170_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-17T00:17:27.000Z",
    "description": "\n    \n                    \n                          Quinton Aaron\n                          Awake & Fully Alert...\n                          But Disa",
    "body": "\n    \n                    \n                          Quinton Aaron\n                          Awake & Fully Alert...\n                          But Disappointed 'Wife' Is Married to Another Man\n                      \n                  \n                                                                        Published \n                              February 16, 2026\n                            4:17 PM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Good news for Quinton Aaron ... the actor's family tells us he is making huge progress on his road to recovering from a spinal stroke, even though he'll be traveling that road without the woman who falsely claimed to be his wife.\n      \n    \n          Quinton's family tells TMZ in a statement ... \"The Blind Side\" star is awake, fully alert and successfully doing things like practicing writing, solving puzzles and even has feeling in his legs again!\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          We're told Quinton is interacting with his family and approved visitors, but he's expressed multiple times, \"I do NOT want to see Margaret at all.\"\n      \n\n          As we reported ... Margarita Aaron is the woman who has been by his side in the hospital, allegedly misrepresenting herself as Quinton's legal wife to the medical staff and helping make medical decisions.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Margarita told us she and Quinton \"got spiritually married,\" but the family says Quinton confirms they did no such thing.\n      \n    \n          According to the family, they have shared with Quinton that Margarita is actually married to another man, which disappointed Quinton, but we're told he still feels supported by his family.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Now knowing he was never legally married to Margarita, Quinton says at some point he will explain \"in full detail\" everything he went through.\n      \n    \n          For now, the family issued an apology for not taking action on the red flags sooner, but Quinton is focused on recovering.\n      \n    \n          We're rooting for you, Quinton!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Quinton Aaron\n              \n                          \n                Family\n              \n                          \n                Movies\n              \n                          \n                Exclusive\n              \n                          \n                Health\n              \n                          \n                News\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Quinton Aaron Focused on Recovery, Sad 'Wife' Is Married to Another Man",
      "image": [
        "https://imagez.tmz.com/image/03/16by9/2026/02/16/03ab109e99ce4d0383965e5ef63c4170_xl.jpg"
      ],
      "datePublished": "2026-02-17T00:17:27.000Z",
      "dateModified": "2026-02-17T00:17:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Shia LaBeouf Celebrates Lundi Gras in New Orleans",
    "url": "https://www.tmz.com/2026/02/16/shia-labeouf-celebrating-lundi-gras/",
    "image": "https://imagez.tmz.com/image/e3/16by9/2026/02/17/e35083b2d298444f91d36e4524eb1fc1_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-17T03:30:44.000Z",
    "description": "\n    \n                    \n                          Shia LaBeouf\n                          Goes Full Big Easy for Fat Monday!!!\n                     ",
    "body": "\n    \n                    \n                          Shia LaBeouf\n                          Goes Full Big Easy for Fat Monday!!!\n                      \n                  \n                                                                        Published \n                              February 16, 2026\n                            7:30 PM PST\n                                                                            \n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          Shia LaBeouf is fully embracing the Big Easy energy and he did it by turning all the way up for Fat Monday!\n      \n    \n          TMZ has obtained video and photos of Shia dancing and partying Monday afternoon at and around R Bar, a popular dive bar in New Orleans' French Quarter, where he appeared to be soaking up post-Lundi Gras (Fat Monday) parade fun.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Shia rocked a bold red embellished top hat decked out with beads and trinkets, layered scarves, a sleeveless vest over a graphic tee, dark pants and boots ... keeping a beer in hand as he leaned into the festive vibe.\n      \n\n          We're told Shia arrived solo around 2:30 to 3 PM and grabbed a spot in the middle of the bar before the crowd really built up. As parade goers from the Krewe of Red Beans celebration filtered through the area, more people gathered and Shia didn't shy away from the attention.\n      \n    \n          Witnesses tell us he was friendly and animated, chatting with patrons, posing for photos and he even helped organize a loose line outside at one point so fans could snap pictures with him. He was seen laughing, dancing and mingling as the afternoon rolled on.\n      \n    \n          At one moment, Shia interacted closely with a small group while talking and gesturing as music and street noise filled the background, adding to the lively atmosphere.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Shia LaBeouf\n              \n                          \n                Celebrity News\n              \n                          \n                Movies\n              \n                          \n                Party All The Time\n              \n                          \n                Exclusive\n              \n                          \n                Vacations\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Shia LaBeouf Celebrates Lundi Gras in New Orleans",
      "image": [
        "https://imagez.tmz.com/image/e3/16by9/2026/02/17/e35083b2d298444f91d36e4524eb1fc1_xl.jpg"
      ],
      "datePublished": "2026-02-17T03:30:44.000Z",
      "dateModified": "2026-02-17T03:30:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cheer Mom Who Allegedly Killed Daughter in Murder-Suicide Had Past Custody Issues",
    "url": "https://www.tmz.com/2026/02/16/cheer-mom-custody-issues-before-daughter-murder/",
    "image": "https://imagez.tmz.com/image/7b/16by9/2026/02/16/7bee4d02f03c4cfab3452a1d3af79bf8_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-17T00:00:37.000Z",
    "description": "\n    \n                    \n                          Cheer Mom\n                          History of Custody Issues Preceded Apparent Murder-Suicide\n  ",
    "body": "\n    \n                    \n                          Cheer Mom\n                          History of Custody Issues Preceded Apparent Murder-Suicide\n                      \n                  \n                                                                        Published \n                              February 16, 2026\n                            4:00 PM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Tawnia McGeehan -- the mom who allegedly killed her teen daughter Addi Smith and then herself in a Las Vegas hotel room over the weekend -- had a custody battle for her daughter, which lasted 9 years ... according to court documents obtained by TMZ.\n      \n    \n          The papers show multiple instances where Tawnia was accused of custodial interference, but the charges were later dismissed.\n      \n    \n          In the original temporary orders from 2015, Tawnia and her ex, Bradley Smith, agreed that Addi would live with Tawnia as her primary residence, but that Bradley was to be granted parent time and joint custody.\n      \n\n                  \n          \n                          \n                \n                  \n      \n    \n          But in 2020, there was a temporary order in which Tawnia was accused of subjecting Addi to \"behavior on the spectrum of parental alienation.\" The papers also allege Tawnia committed domestic abuse in front of the child.\n      \n    \n          This 2020 order determined Bradley would have temporary sole custody of Addi, having \"demonstrated a better understanding of the child's needs.\"\n      \n    \n          Then in 2021, Tawnia filed a temporary restraining order and alleged she was being recorded by Addi's stepmom during their parent-time exchanges.\n      \n    \n        Waiting for your permission to load the Instagram Media.\n      \n    \n          In the end, Tawnia and Bradley were awarded joint legal and physical custody of Addi with one week on and one week off in 2024.\n      \n    \n          As we reported ... Tawnia and Addi traveled from Utah to Las Vegas for a cheer competition they never showed up for. Police believe Tawnia shot Addi late Saturday at the Rio Hotel & Casino before turning the gun on herself.\n      \n    \n          If you or someone you know is struggling or in crisis, help is available. Call or text 988 or chat 988lifeline.org.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Exclusive Details\n              \n                          \n                TMZ Sports\n              \n                          \n                Crime\n              \n                          \n                Health\n              \n                          \n                News\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cheer Mom Who Allegedly Killed Daughter in Murder-Suicide Had Past Custody Issues",
      "image": [
        "https://imagez.tmz.com/image/7b/16by9/2026/02/16/7bee4d02f03c4cfab3452a1d3af79bf8_xl.jpg"
      ],
      "datePublished": "2026-02-17T00:00:37.000Z",
      "dateModified": "2026-02-17T00:00:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "TMZ Receives 4th Nancy Guthrie Demand Email, Come Forward and Tell Us",
    "url": "https://www.tmz.com/2026/02/16/tmz-4th-nancy-guthrie-bitcoin-demand-email/",
    "image": "https://imagez.tmz.com/image/56/16by9/2026/02/16/56393dec289249daa378030e459f3648_xl.png",
    "tag": "Entertainment",
    "date": "2026-02-16T16:18:28.000Z",
    "description": "\n    \n                    \n                          Nancy Guthrie\n                          TMZ Receives 4th Email Demanding Money\n                  ",
    "body": "\n    \n                    \n                          Nancy Guthrie\n                          TMZ Receives 4th Email Demanding Money\n                          ... Come Forward and Tell Us Now\n                      \n                  \n                                                                        Published \n                              \n                February 16, 2026\n                \n                            8:18 AM PST\n                                                                      |\n                                                                Updated \n                                  February 16, 2026\n                                3:37 PM PST\n                                    \n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          TMZ has received a 4th email from the man claiming to know who kidnapped Nancy Guthrie and where she is ... and we have a proposition for that person.\n      \n    \n          The email -- with the same bitcoin account as the other 3 notes -- says in part, \"I know what I saw 5 days ago south of the border and I was told to shut up so I know who he is and that was definitely Nancy with them.\"\n      \n    \n        \n                    \n                  \n      \n    \n          This is the second reference he's made to there being more than one person involved in the purported abduction. In the third letter, received by TMZ on Friday, he said, \"... be prepared to go International.\"\n      \n\n          The man says he has a burglary on his record from 10 years ago, so he's scared to come forward, presumably fearing he'd be implicated.\n      \n    \n          He is again demanding $50,000 in bitcoin up front in return for the information.\n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          If the individual who is writing us these emails is reading this ... if you are for real, send us the information regarding the whereabouts of Nancy and her kidnappers. We will immediately forward the information to the FBI. If it leads to finding Nancy and/or the kidnappers, you then have a public record that you are the one responsible, thus ensuring you will get the reward. The FBI is aware we are making this overture.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Nancy Guthrie\n              \n                          \n                Crime\n              \n                          \n                Exclusive\n              \n                          \n                Nancy Guthrie Case\n              \n                          \n                News\n              \n                          \n                Police\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "TMZ Receives 4th Nancy Guthrie Demand Email, Come Forward and Tell Us",
      "image": [
        "https://imagez.tmz.com/image/56/16by9/2026/02/16/56393dec289249daa378030e459f3648_xl.png"
      ],
      "datePublished": "2026-02-16T16:18:28.000Z",
      "dateModified": "2026-02-16T16:18:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]