[
  {
    "title": "‘The Shitheads’ Review: Dave Franco and O’Shea Jackson Jr. are Losers on a Mission in a Broad Comedy Tinged with Viciousness",
    "url": "https://variety.com/2026/film/reviews/the-shitheads-review-1236640351/",
    "image": "https://variety.com/wp-content/uploads/2026/01/6v6ywdkxeThe_Shitheads-Still_1.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-25T10:16:19.000Z",
    "description": "\n\tThere’s an instance of unforeseen violence a third of the way into “The Shitheads,” Macon Blair’s latest blood-soaked tragicomedy, that could almost",
    "body": "\n\tThere’s an instance of unforeseen violence a third of the way into “The Shitheads,” Macon Blair’s latest blood-soaked tragicomedy, that could almost lose the audience given the starkness of the tonal shift. A well-timed deadpan line delivery brings the mood back to laughter, but the back-and-forth between the two modes will become more pronounced as the plot collects complications along the treacherous way. \n\tUp to that point, this road movie involving two down-on-their-luck screw-ups hired to drive a rich teenager to rehab feels reminiscent of the bromantic, drug-laced, gross-out comedies of the 2000s and early 2010s, some of which starred James Franco (“Pineapple Express,” “This is the End”). His still bankable younger brother, Dave, stars here as Mark, a foul-mouthed loser who thinks too much of himself while actively hitting rock bottom. The other half of this amateurish operation, Davis (O’Shea Jackson Jr.), is a devout Christian whose search for validation costs him a job tied to his faith. The pair desperately needs things to go smoothly. They certainly won’t.Their precious cargo, Sheridan (Mason Thames), first comes off as a typically defiant adolescent before he feigns vulnerability to gain his guardians’ trust. But after the aforementioned, unexpected misconduct, this boy on the cusp of adulthood reveals himself to be a menace with no moral compass, who rejoices in using and belittling others. \n\t\n\tWhen Mark and Davis realize who they are facing, their initial disdain for each other turns into a life-saving alliance. Played by Thames with an irritating smirk that tests his caretakers’ patience, Sheridan has attained fame for all the wrong reasons. He behaves like someone who knows that money will save him from any consequence, no matter his actions. And it’s exactly that immunity that attracts people of all ages — as his online following attests.That Blair opens the film with a comic scene revolving around Lars von Trier’s “Antichrist” deserves commendation. It’s a cinephile-friendly reference that general viewers might not fully grasp but immediately announces the offbeat wavelength of the story at hand. “The Shitheads,” however, is best described as a broad comedy that occasionally veers into viciousness — as opposed to Blair’s previous films (including 2017 Sundance winner “I Don’t Feel at Home in This World Anymore”), where seriousness is the dominant tone with splashes of dark humor.The measurements in that blend for “The Shitheads” are a bit off, however, making for a jarring viewing experience with laugh-out-loud moments that will likely shock and resonate with audiences, and tense dramatic situations that pull the characters from larger-than-life escapades right into the gutter of despair, as they confront the possibility of death. Sure, the case can be made for this contrast between scatological humor and serious insight working as a mirror for how quickly a person’s reality can shift from joy to sorrow, but the overall effect is puzzling. That said, the film’s commercial prospects seem high, considering the palatable edginess on display and the names involved.One low point comes when a pack of rogue criminals in a van intercepts Mark and Davis’ vehicle to “rescue” Sheridan, after the latter sends out an S.O.S. on social media claiming he’s been kidnapped. This particular set of “wild” cartoonish characters, salivating for a monetary reward, feels nonsensical even within the context of this absurdist narrative. Peter Dinklage’s appearance as the ringleader is more a forgettable cameo than a notable role, while Nicholas Braun as an aspiring rapper enamored of Sheridan’s public persona is a bad cliché rather than a smart parody.Conversely, a refreshing spin on the now commonplace bad-drug-trip sequence in comedies of this type features Jackson Jr. reinterpreting the hallucinations as a spiritual epiphany: Davis thinks he’s spoken to God. The actor’s performance helps ground some the emotional swings, given that pathos and comedy often inhabit his scenes simultaneously.Through it all, as physical altercations escalate thanks to Sheridan’s malice, Blair is determined not to disclose or discuss how any of the many working-class characters that populate “The Shitheads,’ Davis and Mark included, ended up in their current circumstances. Among them is a singer (Kiernan Shipka) making a living as an exotic dancer, who, after becoming Sheridan’s victim, joins them in their battle to rein in the young deviant. There’s also the hotel clerk who Davis feels guilty about upsetting, and a homeless person whose resentment towards Sheridan can’t be defused with cash.By not making the viewer privy to what caused each of them to fall on hard times, the filmmaker signals that anybody, no matter their attributes or intentions, can make a wrong turn and feel trapped, while someone like Sheridan gets to coast without having earned it. Under such an unfair system, the only choice is to concentrate on what’s in one’s control. Yet instead of exploring that socially conscious subtext digging into his characters’ past, Blair forces them into a proactive approach, imagining how these average people pushed to their limit will survive his brutal antics.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘The Shitheads’ Review: Dave Franco and O’Shea Jackson Jr. are Losers on a Mission in a Broad Comedy Tinged with Viciousness",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/6v6ywdkxeThe_Shitheads-Still_1.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-25T10:16:19.000Z",
      "dateModified": "2026-01-25T10:16:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘The Gallerist’ Review: Natalie Portman Plays a Desperate Miami Art Dealer Whose Latest Show Is About to Make a Killing",
    "url": "https://variety.com/2026/film/reviews/the-gallerist-review-natalie-portman-1236640337/",
    "image": "https://variety.com/wp-content/uploads/2026/01/The_Gallerist-Still_1.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-25T09:45:26.000Z",
    "description": "\n\tHow can you tell if an art show is a success? If a piece sells, the curator typically places a little red dot beside it, letting collectors know tha",
    "body": "\n\tHow can you tell if an art show is a success? If a piece sells, the curator typically places a little red dot beside it, letting collectors know that work is no longer available. By the end of director Cathy Yan‘s facile but fun art-world satire “The Gallerist,” there are little red dots all over Miami’s struggling Polinski Mayer Gallery. In theory, that would be any dealer’s dream, except in this case, they’re mostly concentrated in a puddle of blood beneath a human corpse.\n\t\n\n\tThe joke, such as it is, of “The Gallerist” is that most people wouldn’t know great art if it stabbed them in the heart — which is precisely what happens to Zach Galifianakis’ insufferable art influencer Dalton Hardberry when he swings by the gallery for an early peek, before the hoi polloi arrive, the week of Art Basel. Polina Polinski (the high-strung title character, whom Natalie Portman plays with nearly the same intensity she brought to “Black Swan”) has been collecting art for years, mostly with her ex-husband’s money. But now that they’re divorced, she sinks her share into transforming a defunct Jiffy Lube into a showcase for uncompromising artists.\n\n\n\tDalton sees right through her, suggesting that her taste in art doesn’t matter. According to him, Polina’s just a gold-digging dilettante who had fun buying art back when she was married, and doesn’t know the first thing about how to sell work to others. Dalton’s words are cruel and uncalled for, though it feels like a cop-out to have him slip on a patch of water collecting beneath the building’s broken AC, fatally impaling himself on an ultra-sharp, 10-foot emasculator (the same tool veterinarians use to castrate livestock, blown up to Jeff Koons proportions). Wouldn’t murder have made for a more satisfying starting point to Yan’s cynical chamber drama?\n\t\n\n\tPolina’s freaked-out assistant Kiki (Jenna Ortega) wants to call the police, but her boss knows that doing so would end her career, so she spins the incident into a publicity opportunity. At this point, “The Gallerist” feels like something David Mamet might have written (then shoved in a drawer), or else, a fairly obvious follow-up to an earlier Sundance movie, the straight-to-Netflix farce “Velvet Buzzsaw.” But there’s a bigger problem with Yan and co-writer James Pedersen’s script: It’s not like the world isn’t going to notice the sudden disappearance of a social-media D-bag with 2 million followers.\n\n\tIf we’re meant to admire Polina’s capacity to improvise — which is presumably a sign of both her intelligence and her survival instinct — then why make everyone else so darn stupid? If anything, the gallerist is the dum-dum here, believing that by surrounding the crime scene with bright orange pylons, no one will examine the sculpture close enough to realize that it’s a real body bleeding out before their eyes.\n\n\tThe intermittently clever movie is full of art-world in-jokes, but seems oblivious to its many plot holes, which are more conspicuous than the slashes in one of Lucio Fontana’s “Spatial Concept” canvases. “The Gallerist” likely wouldn’t exist if it weren’t for Maurizio Cattelan’s “Comedian,” the ripe banana taped to a blank wall at Art Basel in 2019, which later sold for $120,000 (not an unreasonable price, seeing as how it’s become a symbol for the commodification of art). That stunt made a point, whereas the way people respond to a dead body here doesn’t really make sense, beyond setting up a situation in which a handful of independent-minded women manage to think on their feet, turning a fatal accident into an unlikely succès de scandale.\n\n\tIn addition to Polina and Kiki, who keep rushing back into the gallery’s fancy bathroom to refine their plans, there is Kiki’s aunt Marianne (Catherine Zeta-Jones, whose cool-under-pressure energy helps to balance Portman’s slow-motion meltdown), freshly out of prison, and the artist herself, Stella Burgess (Da’Vine Joy Randolph), whom Polina inexplicably convinces not to disown the work, despite its intention shifting completely when Dalton went and speared himself on it. Described as a “shark,” the scene-stealing Marianne thinks she might be able to interest one of her rich buyers in the “ultrarealistic” piece, estimating a high-six-figure sales price.\n\t\n\n\tFor some reason, Polina keeps claiming that the corpse is made of PVC, which she presumably does to deflect suspicion. But the work is only really provocative if the body is real — and then “The Gallerist” might be saying something ethically interesting. By the time Kiki initiates an auction to see how much it’s really “worth,” it’s not clear what the bidders see in it. (One of the easier things to skewer here is how one’s response to art can be so subjective, Polina can spin practically any interpretation to make the sculpture seem legit.) As the turmoil intensifies, Yan’s camerawork gets increasingly agitated, passing through windows and walls, then weaving throughout the space like a drunken hornet.\n\n\tThe movie is full of art-world in-jokes, but breezes right past its many plot holes, which are more conspicuous than the slashes in Lucio Fontana’s “Spatial Concept” canvases. Personally, I’ve only once been to Art Basel, and I can distinctly remember the South Florida dude sitting beside me on the flight telling me how much he preferred Los Angeles (from which we were coming) to Miami: “The people are so much less superficial and shallow there,” he told me, which didn’t quite parse at the time, since those are exactly the words most people use to describe L.A. But then I stepped off the plane and quickly discovered what he meant.\n\n\tMiami is a place where everything seems fake, which presumably explains Portman’s weird Andy Warhol wig (plus the decision to shoot nearly everything in Paris, passing it off as the Florida hot spot). Scaling back after her misbegotten DC movie “Birds of Prey,” visionary “Dead Pigs” director Yan has assembled a handful of unconvincing supporting actors to round out the cast, from Daniel Brühl as a nepo baby with millions to waste on art he might never look at again to Charli xcx as the only person willing to call this emperor naked. Not everyone makes art hoping to get rich, though the movie raises an uncomfortable question: What’s the point, if we don’t buy it?\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘The Gallerist’ Review: Natalie Portman Plays a Desperate Miami Art Dealer Whose Latest Show Is About to Make a Killing",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/The_Gallerist-Still_1.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-25T09:45:26.000Z",
      "dateModified": "2026-01-25T09:45:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "JioHotstar’s ‘Special Ops’ Season 2 Tops 2025 India Streaming Charts as Netflix Leads Overall With 20 Entries in Top 50",
    "url": "https://variety.com/2026/tv/news/jiohotstar-special-ops-2025-india-streaming-charts-1236640353/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Special-Ops-season-2.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-25T09:30:29.000Z",
    "description": "\n\tEspionage thriller “Special Ops” Season 2 emerged as India’s most-watched streaming original in 2025, drawing 29.6 million viewers on JioHotstar, ac",
    "body": "\n\tEspionage thriller “Special Ops” Season 2 emerged as India’s most-watched streaming original in 2025, drawing 29.6 million viewers on JioHotstar, according to Ormax Media’s annual audience measurement report.\n\n\tFriday Storytellers’ spy drama topped a competitive field that saw JioHotstar claim three of the top 10 positions and four of the top 11, demonstrating the platform’s dominance in India’s streaming wars. Netflix led overall with 20 entries in the top 50, while Prime Video and Amazon MX Player proved formidable competitors across both premium and ad-supported tiers.\n\t\n\n\tJioHotstar secured the second position with legal drama “Criminal Justice: A Family Matter” (27.7 million viewers) from Applause Entertainment and BBC Studios India. Amazon MX Player’s “Ek Badnaam Aashram” Season 3 Part 2 from Prakash Jha Productions landed at No. 3 with 27.1 million viewers, demonstrating the growing clout of free ad-supported platforms.\n\n\n\tPrime Video’s marquee titles performed strongly, with D2R Films’ “The Family Man” Season 3 drawing 24.6 million viewers at No. 4 and TVF’s “Panchayat” Season 4 attracting 23.8 million at No. 5. The platform’s “Paatal Lok” Season 2 from Clean Slate Filmz and Eunoia Films pulled 16.8 million viewers.\n\n\tJioHotstar’s reality juggernaut “Bigg Boss (Hindi)” Season 19 commanded 20 million viewers, produced by EndemolShine India and Banijay Asia. The platform also scored with Graphic India’s animated series “The Legend of Hanuman” Season 6 (16.2 million viewers) and Dashami Creations’ “The Secret of the Shiledars” (14.5 million viewers).\n\n\tNetflix maintained premium positioning with Red Chillies Entertainment’s “The Ba***ds of Bollywood” (16.7 million viewers) and Pritish Nandy Communications’ “The Royals” (15.5 million viewers). The streamer’s international properties continued strong India performance, with “Squid Game” Season 3 drawing 16.5 million viewers, “Stranger Things” Season 5 attracting 16.4 million, “Wednesday” Season 2 pulling 10 million and “Adolescence” 8.7 million. \n\t\n\n\tSonyLIV entered the rankings with Kangra Talkies’ political drama “Maharani” Season 4 (10.6 million viewers) and StudioNEXT’s “Shark Tank India” Season 4 (10.3 million viewers).\n\n\tNetflix’s film slate performed solidly, with Marflix Pictures’ “Jewel Thief – The Heist Begins” drawing 13.1 million viewers, Jio Studios and B62 Studios’ “Dhoom Dhaam” attracting 12.1 million, and Dharmatic Entertainment’s “Aap Jaisa Koi” pulling 9.7 million.\n\n\tAmazon MX Player demonstrated scale in reality programming with Banijay Asia’s “Rise and Fall” (12 million viewers), Frames Production Company’s “Hip Hop India” Season 2 (11.1 million viewers), and Rusk Media’s “Battleground” (9.2 million viewers).\n\n\tThe report employs weekly primary research across India and languages, measuring individuals who watched properties for at least 30 minutes. The methodology counts actual viewers rather than account users, includes all language versions and dubbed feeds, but restricts estimates to the Indian market, excluding overseas viewership. Some December 2025 launches remain in tracking with projected complete-run estimates.\n\n\tThe rankings represent the final standalone originals report from Ormax Media, which will launch Ormax StreamView in early 2026. The new unified framework will track long-form content across streaming originals, general entertainment channel programming, theatrical films, non-fiction, sports, and news without distinguishing between original and non-original content.\n\n\t“From 2026, the distinction between originals and non-originals has ceased to exist in our reporting, as audience behavior on streaming platforms increasingly transcends such classifications,” stated Shailesh Kapoor, founder and CEO of Ormax Media. “For 18 years, Ormax Media has continuously adapted its research frameworks to remain aligned with changing audience consumption patterns. Ormax StreamView is a natural extension of that philosophy.”\n\n\tThe shift follows Ormax’s phased expansion from Hindi-language originals tracking in 2022 to all major languages in 2024, with theatrical films and reality shows added in 2025.\n\n\tTOP 50 STREAMING ORIGINALS IN INDIA – 2025\n\n\n“Special Ops” Season 2 – 29.6 million (JioHotstar)\n“Criminal Justice: A Family Matter” – 27.7 million (JioHotstar)\n“Ek Badnaam Aashram” Season 3 Part 2 – 27.1 million (Amazon MX Player)\n“The Family Man” Season 3 – 24.6 million (Amazon Prime Video)\n“Panchayat” Season 4 – 23.8 million (Amazon Prime Video)\n“Bigg Boss (Hindi)” Season 19 – 20 million (JioHotstar)\n“Paatal Lok” Season 2 – 16.8 million (Amazon Prime Video)\n“The Ba***ds of Bollywood” – 16.7 million (Netflix)\n“Squid Game” Season 3 – 16.5 million (Netflix)\n“Stranger Things” Season 5 – 16.4 million (Netflix)\n“The Legend of Hanuman” Season 6 – 16.2 million (JioHotstar)\n“The Royals” – 15.5 million (Netflix)\n“The Secret of the Shiledars” – 14.5 million (JioHotstar)\n“Chidiya Udd” – 13.7 million (Amazon MX Player)\n“Jewel Thief – The Heist Begins” – 13.1 million (Netflix)\n“Bhay: The Gaurav Tiwari Mystery” – 13 million (Amazon MX Player)\n“Dabba Cartel” – 12.8 million (Netflix)\n“Delhi Crime” Season 3 – 12.5 million (Netflix)\n“Mandala Murders” – 12.3 million (Netflix)\n“Dhoom Dhaam” – 12.1 million (Netflix)\n“Rise and Fall” – 12 million (Amazon MX Player)\n“Gram Chikitsalay” – 11.8 million (Amazon Prime Video)\n“Sarzameen” – 11.5 million (JioHotstar)\n“Khakee: The Bengal Chapter” – 11.4 million (Netflix)\n“Laughter Chefs” Season 3 – 11.2 million (JioHotstar)\n“Hip Hop India” Season 2 – 11.1 million (Amazon MX Player)\n“The Great Indian Kapil Show” Season 3 – 10.9 million (Netflix)\n“Single Papa” – 10.8 million (Netflix)\n“Maharani” Season 4 – 10.6 million (Sony LIV)\n“Saare Jahan Se Accha” – 10.5 million (Netflix)\n“Kull: The Legacy of the Raisingghs” – 10.4 million (JioHotstar)\n“Shark Tank India” Season 4 – 10.3 million (Sony LIV)\n“Salakaar” – 10.2 million (JioHotstar)\n“Dupahiya” – 10.1 million (Amazon Prime Video)\n“Wednesday” Season 2 – 10 million (Netflix)\n“Mrs. Deshpande” – 9.9 million (JioHotstar)\n“Black Warrant” – 9.8 million (Netflix)\n“Aap Jaisa Koi” – 9.7 million (Netflix)\n“Kanneda” – 9.6 million (JioHotstar)\n“Rana Naidu” Season 2 – 9.5 million (Netflix)\n“Power of Paanch” – 9.4 million (JioHotstar)\n“The Traitors” – 9.3 million (Amazon Prime Video)\n“Battleground” – 9.2 million (Amazon MX Player)\n“Khauf” – 9.0 million (Amazon Prime Video)\n“Nadaaniyan” – 8.9 million (Netflix)\n“Baramulla” – 8.8 million (Netflix)\n“Adolescence” – 8.7 million (Netflix)\n“First Copy” Season 2 – 8.6 million (Amazon MX Player)\n“Hai Junoon! Dream. Dare. Dominate.” – 8.5 million (JioHotstar)\n“Suzhal – The Vortex” Season 2 – 8.3 million (Amazon Prime Video)\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "JioHotstar’s ‘Special Ops’ Season 2 Tops 2025 India Streaming Charts as Netflix Leads Overall With 20 Entries in Top 50",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Special-Ops-season-2.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-25T09:30:29.000Z",
      "dateModified": "2026-01-25T09:30:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Zi’ Review: Kogonada Changes Course for a Small, Slight, Beautiful Journey",
    "url": "https://variety.com/2026/film/reviews/zi-review-1236640186/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Zi.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-25T09:02:59.000Z",
    "description": "\n\tLight and shimmery and intricately formed as a dandelion clock, Kogonada‘s 2017 debut “Columbus” walked a fine tonal line between poetic and prosaic",
    "body": "\n\tLight and shimmery and intricately formed as a dandelion clock, Kogonada‘s 2017 debut “Columbus” walked a fine tonal line between poetic and prosaic, intellect and feeling, all without slipping into preciousness. That balance can be hard to maintain when budgets get bigger and concepts higher: The director’s sci-fi follow-up “After Yang” was handsome, ambitious and a bit fey, but still preferable to the gloopy tweeness of last year’s Margot Robbie-Colin Farrell dud “A Big Bold Beautiful Journey.” Coming swiftly on that film’s heels, Kogonoda’s fourth feature “Zi” feels a clear attempt at course-correction: a jagged, mood-driven miniature, sharing his debut’s fascination with urban geography and loudly ambient silence, and reuniting him with “Columbus” star Haley Lu Richardson to boot. \n\t\n\n\t“Zi,” too, is not the film that “Columbus” is, but it represents a more fruitful creative direction for its helmer — whose odd, ruminative worldview appears to be better served by free-range independent production than high-gloss studio cinema. Shot in just three weeks in Hong Kong, taking an off-the-cuff approach in line with the unmoored wanderings of its characters, this translucent study of a mentally addled young woman finding an unlikely ally in an American outsider begins promisingly, mixing everyday city portraiture with glitchy flashes of uncanny psychodrama. \n\n\n\tYet the many small, darting ideas in Kogonoda’s script never quite add up to a big one. “Zi’s” chief pleasures are ambient, whether capturing the fluorescent glare and sonic bustle of a night market, or the hard, still sweep of an empty concrete walkway. Premiering in Sundance’s more experimentally-oriented Next section, the film is too wispy to be more than a fringe arthouse prospect, though its rich visual and sonic textures will be best served by theatrical showings.\n\t\n\n\tAs the film introduces young concert violinist Zi (Michelle Mao) in a state of disarray, pacing the sidewalks and cemeteries and back alleys of Hong Kong, it takes some time for her fragments of anguish to coalesce into something resembling a narrative. We learn that her parents have passed away, though it’s not clear how recently. At their graveside, she frets aloud that their faces might slip her faltering memory, and she won’t recognize them in the afterlife. Such mortal concerns aren’t just in her head, or rather, they’re very literally in her head: She’s recently been diagnosed with a potential brain tumor, while her neurological ailments may account for the unnerving out-of-body visions she keeps having of her future self.\n\n\tWhen she’s approached in the street by kindly, concerned American stranger Elle (Richardson), Zi is convinced they’ve already met, at least in her time-scrambled consciousness. Kogonada’s slender script, too, implies something cosmically fated about this apparent chance encounter, a not-quite-coincidence also tangled up in Elle’s relationship with her estranged fiancé Min (Jin Ha) — who’s stalking both women unbeknownst to them, and also works at the neurological clinic that Zi is scheduled to visit the next day. There’s some initial intrigue in these cryptic, temporally out-of-sync connections, teasing a lo-fi supernatural shift that never takes flight, before Kogonada moves onto his next airily philosophical tangent.\n\n\t“Zi” is most rewarding, however, at its least complicated, as it tracks a fast-building kinship between two young women feeling alone and unsettled in a city that buzzes unfeelingly around them. Elle, clearly carrying her own damage beneath a crinkly smile and a yellow dime-store wig, insists on spending the day with the agitated Zi, cuing a directionless walking tour of bustling city-centre hotspots and abandoned passageways, al fresco noodle shops and shabby karaoke bars. All are shot with unprettified but tactile warmth and, later, a muted nighttime glow by cinematographer Benjamin Loeb, picking out small pools of color (Zi’s cherry-red shoulder bag, intrusions of verdant foliage) in the urban grayscale.\n\n\tMuch of the bonding here is tacit, which is for the best when Kogonada’s dialogue can veer into banal overstatement. “I’ve always felt untethered, detached, floating in this world,” Zi says somewhat unnecessarily, given how the filmmaking language has already established that sense of anxious drift. Mao is sympathetic in a largely reactive role, conveying interior crisis through brittle body language and a deep, distracted gaze. While the reliably charismatic Richardson is a welcome animating force, the character of Elle is even more sketchily conceived, down to a hobby — the recording and collection of city sounds — that feels more an extension of the director’s interests than anything else.\n\t\n\n\tOn the plus side, those sounds are most vibrantly collected. “Zi” thrums with with the oceanic rush of traffic, the patter and chatter of pedestrians, the delicate assertions of nature and weather against a wall of man-made noise — all jostling for our ears’ attention with Kogonoda’s typically elegant musical selections, which run the gamut from liquid piano pieces by the late Ryuichi Sakamoto (to whom the film is dedicated) to bristling electronica to Richardson’s tipsy, spirited wailing of Alanis Morissette’s “One Hand in My Pocket.” If the film weren’t so arresting to look at, it could often be absorbed with eyes closed: If its larger message is elusive, “Zi” advocates for taking the world in at your own sensory pace. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Zi’ Review: Kogonada Changes Course for a Small, Slight, Beautiful Journey",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Zi.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-25T09:02:59.000Z",
      "dateModified": "2026-01-25T09:02:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Dragon Ball Super: Beerus’ Enhanced Anime Series Set for Fall Launch, Trailer Unveiled",
    "url": "https://variety.com/2026/tv/news/dragon-ball-super-beerus-enhanced-anime-series-fall-launch-trailer-1236640345/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Dragon-Ball-Super-Beerus.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-25T08:47:44.000Z",
    "description": "\n\tAn extensively remastered version of the popular anime series “Dragon Ball Super” will premiere in fall 2026 under the new title “Dragon Ball Super:",
    "body": "\n\tAn extensively remastered version of the popular anime series “Dragon Ball Super” will premiere in fall 2026 under the new title “Dragon Ball Super: Beerus,” the franchise announced at the Dragon Ball Genkidamatsuri event in Japan.\n\n\tThe enhanced edition features comprehensive visual upgrades including new animation cuts, revised sequences, complete re-rendering of all footage, freshly recorded voice acting, and an overhauled musical score and sound design. The project, which commenced several years ago, aims to deliver a more faithful adaptation of creator Akira Toriyama’s original work through cutting-edge visual techniques.\n\t\n\n\tThe announcement was made during a live stage presentation at Makuhari Messe, with voice actors Masako Nozawa (Son Goku) and Koichi Yamadera (God of Destruction Beerus) appearing alongside executive producer Akio Iyoku. \n\n\n\tA launch trailer and key visual were unveiled at the event, showcasing the enhanced production values. The narrative follows the God of Destruction Beerus awakening from a prolonged sleep and targeting Earth after hearing about a Saiyan who defeated Frieza, setting up a confrontation with Goku and his allies.\n\n\tThe enhanced series represents a complete reconstruction of the original “Dragon Ball Super” television anime, which featured Toriyama’s original work, story concepts and character designs. The production promises heightened visual immersion, particularly in battle sequences.\n\n\tThe same event also revealed “Dragon Ball Super: The Galactic Patrol,” a separate new anime series that continues the storyline following the “Universe Survival Arc” from the 2015-2018 broadcast run.\n\t\n\n\tThe Dragon Ball franchise, which originated in Shueisha’s Weekly Shonen Jump in 1984, remains a global entertainment property spanning animation, films, gaming and merchandise. The franchise launched “Dragon Ball Daima” in 2024 to mark the 40th anniversary of the original manga’s serialization.\n\n\tWatch the launch trailer of “Dragon Ball Super: Beerus” here:\n\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Dragon Ball Super: Beerus’ Enhanced Anime Series Set for Fall Launch, Trailer Unveiled",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Dragon-Ball-Super-Beerus.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-25T08:47:44.000Z",
      "dateModified": "2026-01-25T08:47:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘SNL’ Takes Aim at ICE During ‘Weekend Update’ After I.C.U. Nurse Is Killed in Minnesota",
    "url": "https://variety.com/2026/tv/news/snl-slams-ice-weekend-update-1236640253/",
    "image": "https://variety.com/wp-content/uploads/2026/01/SNL-Che.png?w=1000&h=558&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-25T05:48:46.000Z",
    "description": "\n\t“Saturday Night Live” lightly took on ICE during “Weekend Update,” hours after a 37-year-old Minneapolis intensive care nurse was killed by Border P",
    "body": "\n\t“Saturday Night Live” lightly took on ICE during “Weekend Update,” hours after a 37-year-old Minneapolis intensive care nurse was killed by Border Patrol agents.\n\n\t“Vice President J.D. Vance criticized protesters confronting ICE Officers, saying they should instead write an op-ed or argue about it on social media. You know, just like these young scholars did on January 6th,” Michael Che said during the January 24 episode, motioning to a photo of the attack at the Capitol in 2021.\n\t\n\n\tHe continued, “I get that ICE agents are people, allegedly, and they have a job to do. But at some point while you’re pepper-spraying old ladies or shooting at a nurse, do you ever stop to ask yourself, ‘Are we dicks?'”\n\n\n\tThe cold open on “SNL” was directed at Donald Trump with a spoof on awards shows, featuring Michael Myers returning as Elon Musk, who joked, “After what all my little freaks and psychos in ICE have been doing, I need more distractions.”\n\n\tEarlier in the day on Saturday, Natalie Portman spoke out against ICE at Variety‘s Sundance Studio, wearing “ICE Out” and “Be Good” pins, the latter referencing Renée Good, a woman who was killed by ICE earlier this month.\n\n\t“We’re also at a moment in our country’s history that is quite devastating,” Portman said. “It’s really impossible not to talk about what is happening right now and the brutality of ICE and how it has to stop immediately. But also, there’s a beautiful community that Americans are showing right now. They’re showing up for each other, protecting each other and fighting for their freedom. It’s a bittersweet moment to celebrate something we’re so proud of on the backdrop of our nation in pain.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘SNL’ Takes Aim at ICE During ‘Weekend Update’ After I.C.U. Nurse Is Killed in Minnesota",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/SNL-Che.png?w=1000&h=558&crop=1"
      ],
      "datePublished": "2026-01-25T05:48:46.000Z",
      "dateModified": "2026-01-25T05:48:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘The Invite’ Review: Olivia Wilde Directs and Stars in a Bravura Dinner-Party Dramedy That’s like ‘Who’s Afraid of Virginia Woolf?’ Redone as Vintage Woody Allen",
    "url": "https://variety.com/2026/film/reviews/the-invite-review-olivia-wilde-seth-rogen-1236640161/",
    "image": "https://variety.com/wp-content/uploads/2026/01/The_Invite-Still_1.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-25T05:06:02.000Z",
    "description": "\n\tWhen you go into a movie knowing that it’s about two couples who get together for a dinner party, there are certain expectations about what’s going ",
    "body": "\n\tWhen you go into a movie knowing that it’s about two couples who get together for a dinner party, there are certain expectations about what’s going to happen that are just about wired into our moviegoing DNA. You expect that the dialogue, for a while, is going to be light, funny, brittle, caustic. You expect that as the evening wears on, the masks of civility will come off, revealing something more painful and maybe brutal under the surface. You expect that there might be serious flirtation (between the people who aren’t partners), and that the whole thing will wind up structured as a kind of truth game. And you expect that by the end, there will be wreckage…but maybe, in that destruction, a kind of healing.    \n\t\n\n\t“The Invite,” directed by Olivia Wilde (“Don’t Worry Darling”) from a script by Will McCormack and Rashida Jones, starring Wilde and Seth Rogen as a grousing, long-married San Francisco couple who have their upstairs neighbors over to dinner, is a movie that lives up to every one of those expectations. Yet it does so in a way that’s so original, so brimming with surprise, so fresh and up-to-the-minute in its perceptions of how relationships work (or don’t), that you watch it in a state of rapt immersion and delight.\n\n\n\tPart of what’s novel about the movie is its tone, which is bitterly funny yet sneakily serious. It’s as if we’re watching “Who’s Afraid of Virginia Woolf?” remade by the Woody Allen of “Husbands and Wives.” The Allen connection is there, most prominently, in the characterization of Joe (Rogen), a former indie-rock musician who is now an associate professor at a music conservatory near Berkeley (he’s haunted by the fact that it’s not nearly as good), and Angela (Wilde), who graduated from art school but never followed it up, except for the loving eye with which she has furnished and renovated their apartment. She’s a high-strung bundle of nerve endings, while Joe is a wisecracking curmudgeon in the tradition of Allen and Larry David, though he’s so down on everything that his jokes emit a hint of toxic despair.\n\t\n\n\tThe two have a 12-year-old daughter, who’s away at a sleepover, and they live in a spacious, cozy apartment that Joe inherited from his parents, which makes him feel like a failure. So does the fact that after one album with a small hit, his indie-rock dreams fizzled. As soon as Joe arrives home, and Angela informs him that the neighbors are coming over that night, the two begin to bicker (about whether she told him this already, about Joe scarfing a pickle off her appetizer plate, about the rug she just bought, about the fold-up bicycle that hurts his back and that he can’t seem to fold up, about the fact that he didn’t buy a bottle of wine). It doesn’t take us long to see that these two will fight about anything under the sun, no matter how small, because that’s now their way of connecting.\n\n\tYet for all the controlled rancor on display, what draws us into “The Invite” is the remarkable flow of the dialogue, the characters often talking over each other in a lifelike way, with just enough witty one-upmanship to make even domestic anger, presented as authentically as it is here, a pleasure to behold. It’s the sound of two people who don’t like each anymore, but it’s also the sound of a communication that’s so spiked with downbeat emotion it plays like jazz. (The film opens with an image collage scored to a jazzy version of “Isn’t It Romantic?,” and yes, the use of that song is ironic in the extreme.)\n\n\tThen the other couple comes over. Pína (Penélope Cruz) and Hawk (Edward Norton) are everything Joe and Angela are not: mellow, glamorous, harmonious. She’s a psychotherapist and sexologist, he’s a retired fire fighter (though he acts more like a West Coast guru), and we know that they enjoy a robust sex life, because it has already been the subject of a major disagreement: They make so much “animal” noise at night that Joe wants to complain to them about it, whereas Angela, a compulsive people-pleaser, is horrified at the prospect that bringing that up could interfere with another woman’s orgasms. (At least that’s her rationale; you also get the feeling that she’s simply too timid to want to raise the issue.)\n\n\tAs soon as these two show up, Joe starts baiting Hawk, because that’s just his way, and we start to pick up on the subtlety with which these four are going to interlock. Joe has no filter, but Hawk says that’s what he likes about him. (He sounds sarcastic, until we realize he means it.) Pína, who is from Spain, keeps the conversation earnest (if not quite honest), while Angela is an ebullient nervous wreck whose instinct is to cover everything up.\n\t\n\n\tI can’t discuss what happens in “The Invite” without giving a little bit away, so here goes. The issue of that overly noisy sex is something Pína and Hawk bring up all by themselves, which defuses the tension over it for about a minute. But then they reveal why their sex is so noisy: They’re what used to be called swingers, only these two now present themselves as “enlightened” New Age addicts of group sex. The dialogue that emerges out of this is almost shocking in its casually explicit hilarity, because McCormack and Jones, in a brilliant act of screenwriting, have imagined this couple’s erotic encounters in a nearly cinematic fashion, as expressions of their character. The movie asks us to laugh at sexual folly and adventure without reducing it to a joke. And that’s before Pína and Hawk make the movie’s real invite: Do Joe and Angela want to join them in a foursome?\n\n\tThat sounds like the premise of a certain kind of Sundance movie — let’s call it kinky-cute. But “The Invite” is blessedly not that movie. Wilde, as a director, shoots it with an astonishing feeling of lived-in experience. The apartment where the entire film takes place looks real, with a history; it’s lit just right. And Joe and Angela’s reaction to their neighbors’ invitation isn’t reduced to one thing. Their response unfolds like a flower. It’s about horniness and loneliness and possibility, about the reasons they might actually want to have an orgy, and about how the movie is going to take this situation and run with it, neither playing it safe nor making it too easy.\n\n\tAll four of the actors are amazing. Rogen, while rooted in his vintage persona of crusty rationality, has never explored it this deeply. Wilde, who’s a spectacular actor, imbues Angela with so many frazzled shades of desire and unhappiness and dreams she’s still clinging to that her performance is like a blur that gradually comes into beautiful focus. Norton gets us giggling at Hawk’s Zen cowboy certitude, until we hear his own backstory, in a monologue you listen to in a spellbound hush. And Cruz, whose Pína is the catalyst of all this, projects an erotic life force that comes with its own gamesmanship. It’s Pína who says, in essence, that some relationships need to die so they can come to life again as something else. “The Invite” is marvelously entertaining, but part of the reason for that is that I think a lot of people are going to see themselves mirrored in this movie, which for all its sharp-tongued bravura is humane enough to play a truth game that rings true.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘The Invite’ Review: Olivia Wilde Directs and Stars in a Bravura Dinner-Party Dramedy That’s like ‘Who’s Afraid of Virginia Woolf?’ Redone as Vintage Woody Allen",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/The_Invite-Still_1.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-25T05:06:02.000Z",
      "dateModified": "2026-01-25T05:06:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘SNL’ Cold Open Sees Mike Myers Return as Elon Musk at Trump Awards Show: ‘I Feel So Emotionless to Be Here’",
    "url": "https://variety.com/2026/tv/news/snl-cold-open-mike-myers-elon-musk-trump-awards-1236640258/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Mike-Meyers-SNL.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-25T04:55:58.000Z",
    "description": "\n\tThis week’s “Saturday Night Live” featured a surprise cameo from series alum Mike Myers, who returned to the long-running NBC sketch comedy show to ",
    "body": "\n\tThis week’s “Saturday Night Live” featured a surprise cameo from series alum Mike Myers, who returned to the long-running NBC sketch comedy show to once again spoof Elon Musk. \n\n\tThe cold open took place during The Trumps, an award show meant to honor “the best in being or succumbing to President Donald Trump.” Trump (James Austin Johnson) invited his “close ex-friend” Musk to the stage to accept the “lifetime achievement award for comedy, even though he might not always intend it.” \n\t\n\n\tMusk then took the stage, vacilating between hyperactive and completely stoic, telling the crowd “I feel so emotionless to be here.” \n\n\n\t“If anyone knows humor, it’s me,” he continued. “No tariffs on humor!” \n\n\tEarlier in the sketch, Trump told the crowd, “It truly is an honor to be here hosting The Turmps. After that lady, whose name I already forget, gave me her Nobel Prize, I thought ‘I need more awards!’ And after what all my little freaks and psychos in ICE have been doing, I need more distractions.” \n\n\tTrump then accepted the award for the best picture of himself from Vice President J.D. Vance (Jeremy Culhane), whom Trump naturally insulted every chance he got. Vance returned later as a nominee alongside Kristi Noem (Ashley Padilla) as nominees for best kiss, both getting nommed for kissing “Trump’s ass.” Even though they were up against Trump (for kissing “Putin’s ass”), Noem ended up winning, but Trump still managed to snag the award from her. \n\n\tWatch the full cold open below. \n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘SNL’ Cold Open Sees Mike Myers Return as Elon Musk at Trump Awards Show: ‘I Feel So Emotionless to Be Here’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Mike-Meyers-SNL.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-25T04:55:58.000Z",
      "dateModified": "2026-01-25T04:55:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Political Leaders React to Hate Crime Against Maxwell Frost at Sundance: ‘Political Violence Has No Place In Our Country’",
    "url": "https://variety.com/2026/film/news/sundance-maxwell-frost-hate-crime-political-leaders-respond-1236640238/",
    "image": "https://variety.com/wp-content/uploads/2026/01/2256128792.jpg?crop=0px%2C0px%2C5587px%2C3143px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-01-25T04:57:00.000Z",
    "description": "\n\tAfter Florida Congressman Maxwell Alejandro Frost revealed on Saturday that he was the victim of a racially motivated assault in Park City the night",
    "body": "\n\tAfter Florida Congressman Maxwell Alejandro Frost revealed on Saturday that he was the victim of a racially motivated assault in Park City the night before, several of his fellow politicians have offered support and lamented a culture of anti-immigrant rhetoric that spurred the assault.\n\n\tAmong those who took to X included Washington Rep. Pramila Jayapal, who wrote, “I’m so grateful that @MaxwellFrost is ok, but this kind of violence is encouraged and inflamed by the violent and anti-immigrant, anti-Black rhetoric and action perpetrated by Trump and other Administration officials. This has to stop.”\n\t\n\n\tSeveral other politicians sounded off below.\n\n\nI am grateful that you are ok @MaxwellFrostFL, but you should have never been in harms way. This is incredibly troubling and I’m pissed off with and for you!— Rep. Malcolm Kenyatta (@malcolmkenyatta) January 25, 2026\n\n\nMy friend, I’m relieved you are okay and the assailant has been arrested.Our country is at a painful crossroads. We’re long past time for people of good will to reject the racism and vitriol that is eating away at our country before it completely destroys all of us. https://t.co/5cD7k3cgUX— Rep. Veronica Escobar (@RepEscobar) January 25, 2026\n\n\nI'm so grateful that @MaxwellFrost is ok, but this kind of violence is encouraged and inflamed by the violent and anti-immigrant, anti-Black rhetoric and action perpetrated by Trump and other Administration officials. This has to stop. https://t.co/5yxgmWCJfS— Rep. Pramila Jayapal (@RepJayapal) January 25, 2026\n\n\n\nI am horrified by the attack on Congressman Maxwell Frost.Grateful that he is okay, but appalled that this terrifying assault took place. The perpetrator must be aggressively prosecuted.Hate and political violence has no place in our country, and the entire House Democratic… https://t.co/QjAwE7x0Ao— Hakeem Jeffries (@RepJeffries) January 25, 2026\n\n\n\tFrost confirmed he was the victim of the attack on X, writing, “Last night, I was assaulted by a man at Sundance Festival who told me that Trump was going to deport me before he punched me in the face. He was heard screaming racist remarks as he drunkenly ran off. The individual was arrested and I am okay.” \n\n\tHe later added on X, “I am okay. Thank you for all the well wishes. We are in scary times. Please stay sae and do not let these people silence you. Onwards.”\n\n\tAs reported by Variety, Frost was at Park City’s High West Saloon attending CAA‘s Sundance Film Festival party when the assault took place. The Caucasian perpetrator was detained and then arrested. His identity has not been revealed yet.\n\t\n\n\tThe Sundance Film Festival released a statement condemning the violence, saying, “We strongly condemn last night’s assault and abhor any form of violence, harassment, and hate speech.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Political Leaders React to Hate Crime Against Maxwell Frost at Sundance: ‘Political Violence Has No Place In Our Country’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/2256128792.jpg?crop=0px%2C0px%2C5587px%2C3143px&resize=1000%2C563"
      ],
      "datePublished": "2026-01-25T04:57:00.000Z",
      "dateModified": "2026-01-25T04:57:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘The Friend’s House Is Here’ Review: A Touching Tale of Sisterhood Defiantly Celebrates Tehran’s Underground Artists",
    "url": "https://variety.com/2026/film/reviews/the-friends-house-is-here-review-1236639864/",
    "image": "https://variety.com/wp-content/uploads/2026/01/FriendsHouse.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-25T05:45:00.000Z",
    "description": "\n\tArtists create not because they’ve been given permission to do so, but simply because they must. This certainty illuminates filmmaking duo Hossein K",
    "body": "\n\tArtists create not because they’ve been given permission to do so, but simply because they must. This certainty illuminates filmmaking duo Hossein Keshavarz and Maryam Ataei’s Tehran-set drama “The Friend’s House Is Here,” a sophisticated and heroic celebration both of Iran’s brave communities of underground artists who boldly express themselves despite their autocratic government’s attempts to muzzle them, and of the country’s resilient women who recently led the pivotal “Woman, Life, Freedom” movement.\n\t\n\n\tShot entirely (and perilously) in secret, much like the recent, genre-defying work of Jafar Panahi (including the Oscar-nominated “It Was Just An Accident”), and completed in the aftermath of the June War, “The Friend’s House Is Here” was reportedly smuggled out of the country once the ongoing protests, with thousands of confirmed deaths, erupted. In that regard, Keshavarz and Ataei’s spirited effort feels like a modern-day heir to virtuosos like Panahi, as well as Abbas Kiarostami, whose 1987 masterpiece “Where is the Friend’s House?” is proudly honored by this film’s title. Like the essence of the masters it channels, “The Friend’s House Is Here” is defined not by the many constraints that it battled during its production, but by the artistic vision of the resulting work.\n\n\n\tMore importantly, the film is energized by a gentle and joyous quality throughout, with Keshavarz and Ataei refusing to succumb to a doom-and-gloom disposition in following their protagonists: Pari (Mahshad Bahraminejad) and Hanna (Hana Mana), two rebellious artists and best friends in contemporary Tehran. Like Bahraminejad, Pari is an underground theater artist of inventive performance pieces that challenge the status quo. It’s not exactly legal to perform works of art without governmental permission, but like the resourceful artists who stood against tyranny throughout history, Pari does so anyway, and always with an engaged audience. \n\t\n\n\tMeanwhile Hanna, like Mana, is an improvisational dancer with a popular Instagram account where she courageously posts her dance routines (again, deemed illegal by the government) in front of recognizable historical landmarks. Like many women in Iran these days (as we see in the background across Tehran), Pari and Hanna stroll the streets unveiled, and present themselves with idiosyncratic fashion choices, including hats and T-shirts adorned with Rumi’s poetry. Through a patient, observational aesthetic, the directors immerse us in the pair’s friendship, organically capturing the enviable ease and trust between these two women.\n\n\tOn that note, “The Friend’s House Is Here” is also a film about life-defining friendships, along with the healing properties of sisterhood. Not only do Hanna and Pari depend on each other as friends, roommates, and allies, but they are also sustained by a supportive ecosystem of fellow artists and theater troop members, the closest being Hanna’s best friend Ali (Farzad Karen).\n\n\tWith cinematographer Ali Ehsani’s meticulously choreographed but unfussy long takes and Arian Saleh’s understated score, we breathe in the kind of jubilant, unflappable atmosphere that perhaps only chosen families can conjure. This blissful mood is felt everywhere, from the ensemble’s good-humored bickering over the city’s rooftops, singing and dancing sessions at home, and dinner parties where hearty servings of tahdig are cheered on.\n\n\tThe movie never loses this upbeat air, though it turns quieter when we find ourselves in one of Pari’s performance art sessions. (For a while, thanks to clever camerawork, we can’t even tell that we’re inside a theatrical construction.) The short play is evidently about Hanna, whose relaxed attitude has at times clashed with Pari’s relative strictness. She is wondering about the whereabouts of her friend, who, in reality, is preparing for a life-changing trip abroad to advance her art. Has she been kidnapped by the government after posting one of her viral dance videos? Has anyone seen her? The feelings we sit with in the immediate aftermath of Pari’s performance are so powerful that we don’t suspect the intentions of the man who approaches her with compliments. But his praise quickly takes an aggressive turn, before we start to grasp his true identity. Soon after, the realization sinks in that the play has just ingeniously foreshadowed some imminent dark developments in the women’s lives. \n\n\tIt wouldn’t be fair to spoil further details of this narrative shift, but rest assured that Keshavarz and Ataei maintain their positive tone — they’re determined not to compromise on their defiant ambitions. But that hardly makes “The Friend’s House Is Here” a toothless fantasy. At every turn and with every dignified conversation between concerned people who are just trying to exist in peace — one between Pari’s mother and the selfless Hanna is especially heart-swelling — the directors acknowledge the stakes involved, and the high price that artists pay to claim their freedom and humanity against the odds. Their film feels like a compassionate gift, given in gratitude to all artists who refuse to be silenced.\n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘The Friend’s House Is Here’ Review: A Touching Tale of Sisterhood Defiantly Celebrates Tehran’s Underground Artists",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/FriendsHouse.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-25T05:45:00.000Z",
      "dateModified": "2026-01-25T05:45:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Celebrity Scramble -- Guess The Shirtless Stud!",
    "url": "https://www.tmz.com/2026/01/25/celebrity-scramble-guess-who/",
    "image": "https://imagez.tmz.com/image/20/16by9/2026/01/19/208f8348821d403fb42313be79e9e0a6_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-25T08:45:51.000Z",
    "description": "\n    \n                    \n                          Celebrity Scramble ...\n                          Guess the\n                          Shirtless 'B",
    "body": "\n    \n                    \n                          Celebrity Scramble ...\n                          Guess the\n                          Shirtless 'Big Brother!'\n                      \n                  \n                                                                        Published \n                              January 25, 2026\n                            12:45 AM PST\n                                                                            \n      \n    \n          All mixed up inside this mashed-up photo is a celeb who turned 43 years old this weekend ... given the clues, can you put a name to the shirtless stud in question?!\n      \n    \n          He was on the TV show \"Big Brother\" ... and his lil' sister is wickedly talented!\n      \n    \n          Before he hits the stage, slide into the gallery for the reveal!\n      \n      \n      \n          \n            \n              \n                \n                Share on Facebook\n              \n            \n            \n              \n                \n                Share on X\n              \n            \n                          \n                \n                  \n                \n              \n                      \n        \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Ariana Grande\n              \n                          \n                Celebrity Scramble\n              \n                          \n                Guess Who\n              \n                          \n                Photo Galleries\n              \n                      \n        \n          \n  ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Celebrity Scramble -- Guess The Shirtless Stud!",
      "image": [
        "https://imagez.tmz.com/image/20/16by9/2026/01/19/208f8348821d403fb42313be79e9e0a6_xl.jpg"
      ],
      "datePublished": "2026-01-25T08:45:51.000Z",
      "dateModified": "2026-01-25T08:45:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Guess Who This Former Male Stripper Is!",
    "url": "https://www.tmz.com/2026/01/24/guess-who-former-male-stripper/",
    "image": "https://imagez.tmz.com/image/05/16by9/2026/01/19/05b24938babf405ead79e9e82a50e8e8_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-25T00:00:53.000Z",
    "description": "\n    \n                    \n                          Guess Who\n                          This Former Male Stripper Is!\n                      \n        ",
    "body": "\n    \n                    \n                          Guess Who\n                          This Former Male Stripper Is!\n                      \n                  \n                                                                        Published \n                              January 24, 2026\n                            4:00 PM PST\n                                                                            \n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          Lots of celebs had funky jobs before they made it big in the 'biz ... can you guess who this former male stripper is?\n      \n    \n          We ran into this star while he was leaving LAX back in 2015 and asked him what his favorite song to dance to was ... but we guess some things are better kept secret.\n      \n    \n          Oh, and speaking of secrets, this guy also kept quiet about how he felt about filming a sex scene with a liquored-up \"J Law\" -- Jennifer Lawrence -- hey, they're professionals, so don't get any ideas about them!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Movies\n              \n                          \n                Guess Who\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Guess Who This Former Male Stripper Is!",
      "image": [
        "https://imagez.tmz.com/image/05/16by9/2026/01/19/05b24938babf405ead79e9e82a50e8e8_xl.jpg"
      ],
      "datePublished": "2026-01-25T00:00:53.000Z",
      "dateModified": "2026-01-25T00:00:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Stars In Uggs Guess Who... Ugg-ly And They Know It!",
    "url": "https://www.tmz.com/2026/01/25/stars-in-uggs-guess-who/",
    "image": "https://imagez.tmz.com/image/1b/16by9/2026/01/20/1b9dd55c8c8141bfb179a01a53207bf1_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-25T08:01:04.000Z",
    "description": "\n    \n                    \n                          Stars In Uggs\n                          Guess Who ...\n                          Ugg-ly And They K",
    "body": "\n    \n                    \n                          Stars In Uggs\n                          Guess Who ...\n                          Ugg-ly And They Know It!\n                      \n                  \n                                                                        Published \n                              January 25, 2026\n                            12:01 AM PST\n                                                                            \n      \n    \n          For the celebs, UGGs are always in-style, but winter is calling its fave fashion staple, so we whipped up a fun game of Guess Who! Can you guess the famous stems rockin' these UGG boots?!\n      \n    \n          From Ashley Tisdale to Emily Ratajkowski, these stars are UGG and SNUG! And keep an eye out for British singer PinkPantheress who slayed a slipper rendition of the classic UGG ... and topped off the look with a short skirt ... SAY LESS!\n      \n    \n          We've got zero F's UGGs left to give! Slide into the gallery and see if you can score!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Emily Ratajkowski\n              \n                          \n                Ashley Tisdale\n              \n                          \n                Hotties & Bodies\n              \n                          \n                Hot Bodies\n              \n                          \n                Guess Who\n              \n                          \n                Photo Galleries\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Stars In Uggs Guess Who... Ugg-ly And They Know It!",
      "image": [
        "https://imagez.tmz.com/image/1b/16by9/2026/01/20/1b9dd55c8c8141bfb179a01a53207bf1_xl.jpg"
      ],
      "datePublished": "2026-01-25T08:01:04.000Z",
      "dateModified": "2026-01-25T08:01:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Alicia Keys Hot Shots to Slay Her 45th Birthday ... This Girl Is On Fire!",
    "url": "https://www.tmz.com/2026/01/25/alicia-keys-birthday-hot-shots/",
    "image": "https://imagez.tmz.com/image/31/16by9/2026/01/19/31f10f42403e4f75b4e982aef510e4cb_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-25T09:00:36.000Z",
    "description": "\n    \n                    \n                          Alicia Keys'\n                          Hottest Shots\n                          To Slay Her 45th B",
    "body": "\n    \n                    \n                          Alicia Keys'\n                          Hottest Shots\n                          To Slay Her 45th Birthday!\n                      \n                  \n                                                                        Published \n                              January 25, 2026\n                            1:00 AM PST\n                                                                            \n      \n    \n          In case you didn't know, it's Alicia Keys' 45th birthday on Sunday ... but you already know we were fallin' for her way back in the day!\n      \n    \n          This songstress has every reason to go big this weekend, and to be honest, you do too -- because we've put together this sizzling gallery of her hottest shots just for you!\n      \n    \n          One recommendation, though ... keep some water somewhere close when you're going through this gallery, because this girl is on fire!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Alicia Keys\n              \n                          \n                Hotties & Bodies\n              \n                          \n                Birthdays\n              \n                          \n                Photo Galleries\n              \n                          \n                Music\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Alicia Keys Hot Shots to Slay Her 45th Birthday ... This Girl Is On Fire!",
      "image": [
        "https://imagez.tmz.com/image/31/16by9/2026/01/19/31f10f42403e4f75b4e982aef510e4cb_xl.jpg"
      ],
      "datePublished": "2026-01-25T09:00:36.000Z",
      "dateModified": "2026-01-25T09:00:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ben Affleck and Brooks Nader Not Hooking Up Despite Reports",
    "url": "https://www.tmz.com/2026/01/24/ben-affleck-brooks-nader-not-hooking-up-despite-reports/",
    "image": "https://imagez.tmz.com/image/ba/16by9/2026/01/24/ba25bd1ba7524894999c835952b59090_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-24T23:52:04.000Z",
    "description": "\n    \n                    \n                          Ben Affleck & Brooks Nader\n                          We're Not Hitting 'The Town' Together!!!\n   ",
    "body": "\n    \n                    \n                          Ben Affleck & Brooks Nader\n                          We're Not Hitting 'The Town' Together!!!\n                      \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Ben Affleck and Brooks Nader aren't Hollywood's newest celebrity couple ... in fact, Brooks says the two have never even met!\n      \n    \n          Here's the deal ... reports surfaced earlier today claiming the actor and the model had started up a romance -- which would've marked Ben's first big relationship since divorcing Jennifer Lopez.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          However, Brooks took to social media to shut down the rumors ... writing on Instagram, \"Haven't met him in my life.\" We've also spoken to sources who confirm Nader's comment ... so, conspiracy theorists shouldn't think she's trying to run cover on some secret romance.\n      \n\n          While Ben's stayed out of the dating spotlight since his marriage to Lopez ended, Brooks has been connected to a series of famous faces over the last couple years.\n      \n    \n      \n        \n              \n    \n    \n          Of course, everyone knows about Nader's passionate and ill-fated romance with \"Dancing with the Stars\" pro Gleb Savchenko ... but, Nader's also been linked to tennis stars like Carlos Alcaraz and Jannik Sinner since quitting her dance partner.\n      \n    \n          Turns out she's not flying high with Batfleck though.\n      \n      \n              \n          \n                          \n                Brooks Nader\n              \n                          \n                Ben Affleck\n              \n                          \n                Reality TV\n              \n                          \n                Relationships\n              \n                          \n                Movies\n              \n                          \n                Couples\n              \n                          \n                Gossip / Rumors\n              \n                          \n                Models\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ben Affleck and Brooks Nader Not Hooking Up Despite Reports",
      "image": [
        "https://imagez.tmz.com/image/ba/16by9/2026/01/24/ba25bd1ba7524894999c835952b59090_xl.jpg"
      ],
      "datePublished": "2026-01-24T23:52:04.000Z",
      "dateModified": "2026-01-24T23:52:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]