[
  {
    "title": "‘Twilight of the Warriors: Walled In’ Sequel Sets 2026 Shoot, Director Soi Cheang Reveals in Tokyo",
    "url": "https://variety.com/2025/film/festivals/twilight-of-the-warriors-walled-in-sequel-2026-shoot-soi-cheang-1236564149/",
    "image": "https://variety.com/wp-content/uploads/2025/10/Soi-Cheang.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-29T01:34:59.000Z",
    "description": "\n\tThe sequel to hit Hong Kong period action film “Twilight of the Warriors: Walled In” will start shooting in March next year, revealed its director S",
    "body": "\n\tThe sequel to hit Hong Kong period action film “Twilight of the Warriors: Walled In” will start shooting in March next year, revealed its director Soi Cheang at the Tokyo International Film Festival.\n\n\tSpeaking at a Q&A session for a screening of the first movie, Cheang also mentioned that the prequel will be shot immediately after, although the producers have not determined the release dates for either. Both prequel and sequel will be based on the novel “City Of Darkness” by Yuyi.\n\t\n\n\t“Twilight of the Warriors: Walled In” grossed some $111 million on a $39 million budget, a critical and commercial hit for a Hong Kong cinema industry that has seen little of either in recent years. The film followed Chan Lok-kwun (Raymond Lam), a mainland refugee trying to pay his way to a fake ID by winning bare-knuckle brawls. When he ends up double crossed by remorseless triad leader Mr. Big (Sammo Hung), the desperate outsider steals a satchel of the head honcho’s cocaine and makes a run for Hong Kong’s Walled City, a darkened citadel, hostile to anyone who approaches. Lok-kwun may be safe from Mr. Big’s cronies, who know better than to step into enemy territory, but he soon has to deal with the city’s own martial law, courtesy of the enigmatic crime boss Cyclone (Louis Koo),\n\n\n\tCheang’s own critical and commercial hits (and misses) were also up for discussion in the freewheeling discussion on his career, as were his experiences with mentors like Hong Kong luminary Johnnie To, who gave him his first directorial starts under his Milkyway Image banner, with films like the 2012 car chase action film “Motorway.”\n\t\n\n\t“’Motorway’ was another disaster of mine.” said Cheang. “It was the first time I had shot a racing film, and I had no budget to shoot the cars going fast. When I saw the assembly cut, my first reaction was to smash the television.”\n\n\t“I had to go back and ask Mr. To for money to do reshoots. I asked for 16 days of reshoots. At the end of the day, he used his own money to help fund the reshoots, so that I could recover the movie.”  \n\n\tThe director was surprisingly candid about other ups and downs of his career, and how he retreated to his indie roots after experiences with big budget filmmaking, such as the three-film, 3D fantasy series, “The Monkey King,” starring Donnie Yen.\n\n\t“The “Monkey King” [movie series] helped me in my career, perhaps not creatively, it didn’t have a great impact on my creativity, but it gave me the experience of working on a large scale film, with personnel from all around the world,” said Cheang. “But by the end of the experience I was feeling very lost, and that’s why I went back to shoot ‘Limbo,’ a more personal film.”\n\n\t“When you make a personal film, you end up slowly rediscovering the reasons why you started making films in the first place.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Twilight of the Warriors: Walled In’ Sequel Sets 2026 Shoot, Director Soi Cheang Reveals in Tokyo",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/Soi-Cheang.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-29T01:34:59.000Z",
      "dateModified": "2025-10-29T01:34:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Konbini’ Bridges Cultures at Tokyo Gap-Financing Market",
    "url": "https://variety.com/2025/film/markets-festivals/japan-elderly-crime-crisis-spanish-japanese-film-konbini-1236564157/",
    "image": "https://variety.com/wp-content/uploads/2025/10/Konbini.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-29T02:00:14.000Z",
    "description": "\n\tA Spanish director is bringing a distinctly Japanese story to the screen with “Konbini,” a humanistic drama about an elderly man who deliberately sh",
    "body": "\n\tA Spanish director is bringing a distinctly Japanese story to the screen with “Konbini,” a humanistic drama about an elderly man who deliberately shoplifts to get arrested and the convenience store worker who derails his plan.\n\n\tThe project, selected for the Tokyo Gap-Financing Market, follows Kisayo, a struggling sound artist working night shifts at a Tokyo convenience store, who thwarts an old man’s blatant attempt to get himself jailed through shoplifting. An unlikely friendship forms between the two, bridging their very different worlds.\n\t\n\n\tDirector Pedro Collantes (Venice selection “The Art of Return”) was drawn to the material after learning about a disturbing trend in Japan: an increasing number of elderly people committing petty crimes with the goal of imprisonment. “What kind of person chooses to go to prison on purpose? What emotions and circumstances lead to such a desperate decision?” Collantes asks. “It is a terrible irony that some people feel more a part of a community being in jail, than free in society.”\n\n\n\tWhile rooted in Japanese social reality, Collantes believes the film’s themes resonate globally. “The reflection on the place to which we, as societies, relegate people who reach old age resonates beyond the specific cultural context of Japan to a global audience,” he says. “The intention is to emphasize the universal value of human dignity and the need for empathy and intergenerational connection.”\n\n\tMaking a Japanese-language film in Japan as a foreign director presents unique challenges. “It constantly tests my sensitivity to culture, language, and nuance,” Collantes admits. Though his wife is Japanese and he’s spent extended periods in the country, he describes building a bridge between two creative worlds as “a delicate, humbling task.”\n\t\n\n\tThe production has already achieved significant milestones, winning the Tsutaya Creators’ Program and securing support from Japanese co-producers Culture Entertainment. “Among the highlights, winning the Tsutaya Creators’ Program was a true turning point,” Collantes says. The director is currently scouting locations and casting in Tokyo.\n\n\tProducer Pedro Hernandez Santos of Spain’s Aquí y Allí Films (“La deuda”) sees the Tokyo Gap-Financing Market as an opportunity to expand the project’s European footprint. “We already have a solid project in collaboration with Culture Entertainment, our Japanese co-producers, but we believe there’s room to bring in an additional European partner,” he says. The team is also focused on securing international sales following early interest.\n\n\tThe film represents groundbreaking territory as the first Spanish-Japanese co-production directed by a Spanish filmmaker but shot entirely in Japanese. Spanish and European funds have already backed the project, reinforcing its cross-cultural ambitions. “That pioneering aspect is precisely what makes the journey so special and challenging at the same time,” Hernandez Santos notes.\n\n\tProduction is scheduled for next summer, with delivery targeted for 2027. “We believe we have a unique, beautiful, and tender film that can perform very well in theaters worldwide,” the producer says.\n\n\tAfter completing “Konbini,” Collantes plans to continue exploring cross-cultural narratives with a project examining the encounter between France and Spain.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Konbini’ Bridges Cultures at Tokyo Gap-Financing Market",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/Konbini.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-29T02:00:14.000Z",
      "dateModified": "2025-10-29T02:00:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Heidi Gardner and Ego Nwodim Discuss ‘Challenging’ Environment at ‘SNL’ After Exiting Show: ‘Not the Easiest Place to Work’",
    "url": "https://variety.com/2025/tv/news/heidi-gardner-ego-nwodim-not-easy-snl-exit-1236564160/",
    "image": "https://variety.com/wp-content/uploads/2025/10/MixCollage-28-Oct-2025-06-56-PM-1774.jpg?crop=20px%2C19px%2C1166px%2C656px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-10-29T02:32:44.000Z",
    "description": "\n\tAfter leaving “Saturday Night Live” before Season 51, Heidi Gardner and Ego Nwodim got candid about the work culture at the iconic late-night sketch",
    "body": "\n\tAfter leaving “Saturday Night Live” before Season 51, Heidi Gardner and Ego Nwodim got candid about the work culture at the iconic late-night sketch show.\n\n\tWhile hosting Gardner on her “Thanks Dad” podcast, Nwodim said the “SNL” cast has to spend a lot of “intimate” time together writing and rehearsing, which can either bring everyone together or breed contempt within the group.\n\n\t“To have to share such an intimate space together for hours on end on Saturdays and Thursdays and Fridays, whenever we were rehearsing, yeah, it made us close quick,” Nwodim explained. “But it doesn’t have to work that way. It could also not make you close. It can make you not like each other. It can make you feel whatever mutually, ‘I’m sharing a space with this person.’ But I’m so grateful we got so close.”\n\t\n\n\tGardner added that she was grateful for the friendship she and Nwodim built while on the show and was thankful that egos never got in the way.\n\n\t“I’m so honored that we worked so hard there, and then we also worked on our friendship so hard, which wasn’t hard, by the way,” Gardner said. “I just mean we’re human, so we have egos, we want things for ourselves, we want to succeed. There weren’t a lot of times we were able to succeed the way we wanted at the exact same time.”\n\n\tLater in the discussion, Nwodim said it can be challenging to feel like the “SNL” cast is “winning together,” which, among other reasons, makes the show “not the easiest place to work.” However, she praised Gardner for being “such a light in what can be such a challenging place.”\n\n\tShe added, “But I’m like, if you can leave — in a place where it can get so competitive and you can become so self involved, if you can leave and be still remarkably lovely and such a light and still pouring into other people like you, I think you succeeded.”\n\t\n\n\tGardner unveiled her exit from “SNL” on Aug. 28 after being on the show for eight seasons, while Nwodim left on Sept. 12 after her seventh. The “SNL” cast experienced a major shakeup before Season 51, with Devon Walker, Emil Wakim and Michael Longfellow all leaving the show. Please Don’t Destroy member Ben Marshall was pulled up to the main cast, while Martin Herlihy moved to the writing staff and John Higgins left the show.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Heidi Gardner and Ego Nwodim Discuss ‘Challenging’ Environment at ‘SNL’ After Exiting Show: ‘Not the Easiest Place to Work’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/MixCollage-28-Oct-2025-06-56-PM-1774.jpg?crop=20px%2C19px%2C1166px%2C656px&resize=1000%2C563"
      ],
      "datePublished": "2025-10-29T02:32:44.000Z",
      "dateModified": "2025-10-29T02:32:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Psychological Thriller ‘The Sleepless Girl’ Bows at Tokyo Gap-Financing Market",
    "url": "https://variety.com/2025/film/markets-festivals/psychological-thriller-sleepless-girl-tokyo-gap-financing-market-1236564180/",
    "image": "https://variety.com/wp-content/uploads/2025/10/The-Sleepless-Girl-concept-art.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-29T03:03:12.000Z",
    "description": "\n\tProducer Patrick Mao Huang (Cannes winner “Tiger Stripes”) of Taiwan’s Flash Forward Entertainment is presenting psychological thriller “The Sleeple",
    "body": "\n\tProducer Patrick Mao Huang (Cannes winner “Tiger Stripes”) of Taiwan’s Flash Forward Entertainment is presenting psychological thriller “The Sleepless Girl” at the Tokyo Gap-Financing Market, looking to connect with international partners for the co-production that blurs the boundaries between dreams and reality.\n\n\t“The Sleepless Girl” follows Fan, a Taiwanese man who awakens with no memory except for a compelling urge to find a Japanese girl named Hitomi. When he finally meets her, he is drawn into a chain of surreal events that force them to live on the run.\n\t\n\n\tThe twist: Fan examines Hitomi’s mind and discovers he exists only as a figure created inside her dream. In Hitomi’s real life, they once shared a deep bond – he was her favorite singer who took his own life after being replaced by an AI-generated virtual idol. Now the girl lies in a deep coma, refusing to wake up in a world where he no longer exists.\n\n\n\tBut when Hitomi learns the truth, she refuses to return to her lonely reality. Her grief transforms into destructive power, turning her into a monster. Fan must find a way to wake her before they are both trapped in this nightmare forever.\n\n\tDirector François Chang, who is adapting the feature from his own 2017 short film, says he wanted to explore the boundaries between dreams and reality, and more importantly, between being seen and being heard.\n\n\t“The film follows a mute girl, Hitomi, who is eager to communicate through music, and a virtual idol she once loved, Fan, who now only lives in her dream,” Chang explains. “Their encounter inside her collapsing dream world becomes a metaphor for the loneliness of a generation that lives between social media and the real world.”\n\t\n\n\tThe director adds that the story is also about how memory, guilt, and projection shape relationships with those who can no longer be reached. “I wanted to create an emotional space where the invisible pain becomes visible, where illusion becomes both a bridge and a barrier.”\n\n\tThe production journey has involved balancing the original promise of the short film while creating an engaging genre piece. “The story deals with fragmented memories, language barriers, and digital reincarnation, so we needed to ensure that audiences still feel emotionally anchored even when the logic bends,” Chang says.\n\n\tThe project has built momentum over the past two years through participation in major development platforms, including Frontières at Fantasia International Film Festival in Canada, the Sundance Asia Pitching Forum, and the TAICCA x AFiS Development Lab. Chang was also selected for Talents Tokyo last year.\n\n\t“These milestones have allowed the project to grow substantially – expanding its world-building while refining its internal logic to remain emotionally accessible,” says producer Huang. “Our creative focus remains on developing strong characters and deepening the emotional resonance with contemporary young audiences.”\n\n\tThe project has already secured around 50% of its investment commitment from Taiwan and is moving forward with positive momentum. “The main challenge has been maintaining balance between conceptual ambition and human intimacy, but that has also been the most fulfilling part of the creative process,” Huang notes.\n\n\tAt the Tokyo Gap-Financing Market, Huang hopes to connect with international partners who share the vision for the project. “The project has already received strong attention from Asia and Europe, and the Tokyo Gap-Financing Forum is the ideal platform to complete financing and secure key creative collaborators – especially since almost the entire film takes place in Japan,” he says. The team aims to strengthen ties with Japanese producers and start early conversations with distributors and sales agents who value visually ambitious, emotionally grounded genre films.\n\n\tFlash Forward Entertainment plans to complete financing by mid-2026 and begin principal photography in Japan by late 2026, with post-production based in Taiwan. The target is a late-2027 world premiere at a major international festival, followed by a coordinated global festival circuit and theatrical rollout.\n\t\n\n\tBeyond the feature, “The Sleepless Girl” holds strong potential for sequels, remakes, and a game adaptation, extending its universe across different formats and cultures. “The story’s central question – what happens when dreams begin to overwrite reality – offers a timeless foundation for reinterpretation and creative expansion,” Huang says.\n\n\tChang is already developing his next project, “Millennium Town,” a mystery/sci-fi series set in a small town trapped in the year 1999 after the Y2K bug. “Like ‘The Sleepless Girl,’ it deals with time, memory, and identity – but through another fresh and exciting story,” he says.\n\n\tIf “The Sleepless Girl” is about inner silence, “Millennium Town” is about a collective sense of being “born in the wrong time,” Chang explains. “How people always long for the past or the future, but nobody cherishes the present. Both stories belong to the same emotional universe: how to live a truthful, meaningful life in this more and more surreal, crazy world.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Psychological Thriller ‘The Sleepless Girl’ Bows at Tokyo Gap-Financing Market",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/The-Sleepless-Girl-concept-art.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-29T03:03:12.000Z",
      "dateModified": "2025-10-29T03:03:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ben Stiller Says the Term ‘Nepo Baby’ Is a ‘Selling Point’: ‘Kind of Like That Brat Pack Thing’",
    "url": "https://variety.com/2025/film/news/ben-stiller-nepo-baby-selling-point-1236564206/",
    "image": "https://variety.com/wp-content/uploads/2025/10/GettyImages-2239413239.jpg?crop=0px%2C298px%2C5000px%2C2812px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-10-29T03:32:53.000Z",
    "description": "\n\tDuring a recent appearance on “The Howard Stern Show,” Ben Stiller gave his thoughts on the term “nepo baby,” which describes children of celebrity ",
    "body": "\n\tDuring a recent appearance on “The Howard Stern Show,” Ben Stiller gave his thoughts on the term “nepo baby,” which describes children of celebrity parents who become famous themselves. Stiller, who recently immortalized the life of his own famous parents in his documentary “Stiller & Meara: Nothing Is Lost,” said he considers the moniker more of a “selling point” than a put-down.\n\n\t“I think it’s kind of like that Brat Pack thing, right? New York Magazine, they coined a phrase, and then it just became a thing,” Stiller said. “But it’s always been what it is, in humanity and life. It’s like, you buy a violin, a Stradivarius or whatever, it’s been in the family for hundreds of years. That’s a selling point.”\n\t\n\n\tStiller added that he does understand there are “other arguments to be made about access and all those things.” However, he also pointed out that when he was growing up in the industry, he also saw the less glamorous sides of Hollywood.\n\n\n\tStiller explained, “For me, I think growing up around it, we’re talking about all these things that I saw with my parents, you actually, as a kid, see the dark underside of it. The stress, the effects it has on relationships. You see that up close as a kid, and then you still wanna go into it.”\n\n\tThe “Zoolander” star recalled that his first acting job was an off-Broadway production of “House of Blue Leaves.” He said he got the final call back as “a favor” from his mom after he “couldn’t get in because the casting director didn’t want to see me.”\n\n\t“If you have the passion, you do it,” he added. “You go for it.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ben Stiller Says the Term ‘Nepo Baby’ Is a ‘Selling Point’: ‘Kind of Like That Brat Pack Thing’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/GettyImages-2239413239.jpg?crop=0px%2C298px%2C5000px%2C2812px&resize=1000%2C563"
      ],
      "datePublished": "2025-10-29T03:32:53.000Z",
      "dateModified": "2025-10-29T03:32:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Liberation’ Broadway Review: An Impressive Memory Play That Delivers a Fresh and Frank Take on the Women’s Rights Movement ",
    "url": "https://variety.com/2025/legit/reviews/liberation-review-broadway-1236562420/",
    "image": "https://variety.com/wp-content/uploads/2025/10/1766-Betsy-Aidem-Kristolyn-Lloyd-Irene-Sofia-Lucio-Adina-Verson-Audrey-Corsa-and-Susannah-Flood-in-the-Broadway-production-of-Liberation-by-Bess-Wohl-directed-by-Whitney-White-Little-Fang.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-29T02:00:00.000Z",
    "description": "\n\tIt can be challenging to deliver something fresh and unique to the memory play genre. However, in writer Bess Wohl‘s new Broadway show, “Liberation,",
    "body": "\n\tIt can be challenging to deliver something fresh and unique to the memory play genre. However, in writer Bess Wohl‘s new Broadway show, “Liberation,” she manages to do just that.\n\n\tDirected by Whitney White, “Liberation” is set in the 1970s and in the present. In the years following the Civil Rights Movement, shepherded by Black Americans, women were fighting to find an equal place in society. Now, a half-century later, the American government is clawing back several hard-earned wins. Bridging the time periods, “Liberation” addresses what was and who we’ve become as a society. \n\t\n\n\tThe play opens in the present day. A woman (Susannah Flood) is grieving the loss of her mom, Lizzie (also portrayed by Flood), while trying to reconcile the traditional wife and mother she knew with the young, ambitious journalist who started a women’s consciousness group in 1970. Weaving back and forth between the present and the past, we are introduced to Lizzie and her five friends, who desired so much more than what the world was willing to offer them. \n\n\n\tDesigned by David Zinn, “Liberation” is set in a musty and nostalgic basement basketball gym in Ohio. Lizzie is a University of Chicago-educated journalist who finds herself assigned to the obituary and wedding sections at her newspaper job. Feeling stilted, she forms a weekly women’s group that draws in several different women from various walks of life. \n\n\tDora (Audrey Corsa) is a doe-eyed blonde, stuck in a dull and loveless relationship. She desperately wants to turn her fledgling job at a spirits brand into a full-on career. Her polar opposite, Isidora (Irene Sofia Lucia), is a fiery Italian desperate to take on the world, but tethered to her marriage because of her immigration status. The group also welcomes Margie (Betsy Aidem), a middle-aged housewife determined to escape her recently retired husband and the endless monotony of her life. Meanwhile, Susie (Adina Verson), an out lesbian, is fighting burnout from the cause but still clinging to her last bit of hope. Finally, there is Celeste (Kristolyn Lloyd), a Black woman who was forced to leave New York to come home and care for her ailing mother, but still dreams of writing and making a difference. \n\t\n\n\tAs “Liberation” presses forward with tons of humor, anguish, and candor, audiences learn a great deal about these characters —who they became even after the group disbanded — and why certain choices were made. While some dreams are realized, others are stifled or pushed aside altogether. Through Wohl’s sharp writing, the play explores frank themes, including what it truly takes to be a revolutionary and why self-sacrifice is often not something people are willing to engage in. Moreover, it highlights why people decide to veer in one direction or another, especially when it might serve them over others.  \n\n\tSome of the most compelling aspects of “Liberation” happen in the second half.  Leaping ahead to 1973, all of the women, including Lizzie, are in very different places. The second act begins with an explosion of vulnerability: Inspired by an article in Ms. Magazine, the ladies barricade themselves in the gym and strip naked. Going around, they each share one aspect of their body they love and one they hate. It’s a bold and daring scene, shepherded by intimacy director Kelsey Rainwater, that’s less about the nudity and more about the sisterhood and bond the women form to hold space for each other, even amid disagreements. \n\n\tLater in the act, Joanne (Kayla Davion), a Black woman, stumbles into the gym in search of her son’s lost bookbag. Sitting in on the group meeting, she questions them about excluding mothers who can’t meet on a school night at six o’clock. Additionally, she questions Celeste’s presence as a Black woman, reminding her (as we’ve seen most recently in the 2024 U.S. Presidential Election),  there is no “we.” White women and Black women often vote, live and experience the world very differently. As Lizzie’s daughter grapples with this sequence, Celeste tells her to stick to her own story. It’s a bold reminder of how race and racism profoundly shape who we are and our varied perspectives. \n\n\t“Liberation” is a brilliant, well-acted, and sobering account of the women’s rights movement, complicity, and the lens through which we view our caretakers — namely, our mothers. Though it does lean toward melodrama, dragging just a bit in the final moments for a shaky ending, the core of the play is resounding, reminding us all that freedom in a patriarchal and white supremacist-led nation is a constant and continual fight. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Liberation’ Broadway Review: An Impressive Memory Play That Delivers a Fresh and Frank Take on the Women’s Rights Movement ",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/1766-Betsy-Aidem-Kristolyn-Lloyd-Irene-Sofia-Lucio-Adina-Verson-Audrey-Corsa-and-Susannah-Flood-in-the-Broadway-production-of-Liberation-by-Bess-Wohl-directed-by-Whitney-White-Little-Fang.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-29T02:00:00.000Z",
      "dateModified": "2025-10-29T02:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘ChaO’ Review: Mermaids and Humans Try to Coexist in Singularly Stylized Anime Romantic Comedy",
    "url": "https://variety.com/2025/film/reviews/chao-review-1236564250/",
    "image": "https://variety.com/wp-content/uploads/2025/10/ChaO.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-29T05:35:51.000Z",
    "description": "\n\tWithout having to give up her voice to a sea witch, the titular mermaid princess in the Japanese animated dramedy “ChaO” gets the husband of her dre",
    "body": "\n\tWithout having to give up her voice to a sea witch, the titular mermaid princess in the Japanese animated dramedy “ChaO” gets the husband of her dreams. Still, their seemingly fated bond doesn’t immediately manifest as an idealized romance. Instead, it starts out mimicking an outdated arranged marriage to secure prosperous relationships between humans and merpeople, then develops into a tale of coexistence and life-career balance. While hardly original in concept — Hayao Miyazaki’s “Ponyo” or Masaaki Yuasa’s “Lu Over the Wall” and “Ride Your Wave” come to mind — Yasuhiro Aoki’s debut feature sets itself apart by way of its singularly stylized, lively visual panache.\n\t\n\n\tNot set in Japan, but in the Chinese city of Shanghai, the story of this union across kingdoms is framed via an interview that a young journalist from a near future is doing with a mysterious Stephan (Oji Suzuka), ChaO’s human mate, to debunk the accounts of history books in this reality on how their connection happened. In the opening scene, the vibrant production design reveals the densely populated city has been retrofitted to accommodate water dwellers into a diverse society. But how did they achieve this inclusive utopia?\n\n\n\tBacktrack to a younger Stephan, a more frantic and ambitious engineer than the one telling the tale from years ahead. He works at a ship manufacturing company, which finds itself at a political crossroads: King Neptunus (Kenta Miyake), ruler of the ocean, threatens to cease relations with humanity if something isn’t done about the screw propellers on commercial vessels that harm merkind. And though Stephan has been working on an air jet that would prevent these injuries, his boss has little interest in hearing his costly idea. That changes when ChaO (Anna Yamada) comes across him at sea and implies she’s loved him for as long as she can remember. For the collective benefit, Stephan agrees to marry her in exchange for resources to develop his vision.\n\t\n\n\tBackgrounds in “ChaO” are laden with rich detail, reflecting the visual saturation of a crowded metropolis like Shanghai. The visual uniqueness of this fantastical depiction extends to the character design, which one can instantly identify as distinct from that of most anime, whether features or series. The eyes on Stephan and most characters, for example, are minimalist and sketch-like, rather than enlarged and elaborate. In contrast to those restrained facial features, there are those who sport oversized heads or oval-shaped bodies. And the aesthetic extravagance appears even more pronounced in the merpeople, all of whom take on a humanoid form on land and live as sea creatures underwater. It’s only once the merperson trusts a human that they can keep their anthropomorphic bodies.\n\n\tEnter ChaO, who herself looks to have been crafted with the intention to maximize her adorableness in fish form. Her rotund shape, bright salmon colored skin, big widely spaced eyes and foam-like hair make for a disarmingly lovable presence. Underwater, ChaO’s appearance transforms into that of a mermaid one might more easily recognize, but with a bluish hair. \n\n\tOff to a rocky start, ChaO and Stephan move into his minuscule apartment, an adjustment for the former who ignores how everyday life operates for humans. Endearing comedy is mined from her impromptu education about what Stephan likes to eat or even what fireworks are and whether one can deploy them indoors. Stephan’s friends, scientist Robelt (Yuichiro Umehara) and Mybae (Kavka Shishido), step in to sort of parent ChaO, as Stephan turns dismissive toward what feels like an imposed partner.\n\n\tThe artists behind “ChaO,” in particular character designer and supervising animation director Hirokazu Kojima, decidedly crafted a universe with a cast of characters whose personalities resonate as memorable as their eclectic configuration — consider the enormous baby that casually wanders Stephan’s street, presumably at the same time everyday. There are sequences that dazzle for the kinetic vibrancy of the animation: a music-driven moment that sees ChaO dancing inside a fountain as she manipulates water around her or an aerial sequence involving one of Robelt’s robots are standouts.\n\n\tWhen ChaO vanishes after angering Stephan, the latter must return to the trauma of his childhood to understand his deep ties to his would-be wife and reconsider his future. Hanasaki Kino’s screenplay may be overstuffed with creativity, which matches the movie’s other maximalist qualities, but it’s Stephan’s evolution into maturity that eventually surfaces as the key theme. His pursuit of professional greatness becomes secondary to his appreciation for more essential fulfilment: namely, a family of his own. Whether visually or emotionally, that journey makes for a delightfully offbeat experience.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘ChaO’ Review: Mermaids and Humans Try to Coexist in Singularly Stylized Anime Romantic Comedy",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/ChaO.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-29T05:35:51.000Z",
      "dateModified": "2025-10-29T05:35:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Brad Paisley on Singing the Anthem Before the Only Two 18-Inning Games in World Series History: ‘I Had No Idea There Would Be Major Cosmic Ramifications’",
    "url": "https://variety.com/2025/music/news/brad-paisley-world-series-national-anthem-dodgers-longest-games-1236564088/",
    "image": "https://variety.com/wp-content/uploads/2025/10/GettyImages-2243319294.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-29T00:57:26.000Z",
    "description": "\n\tSomebody up there who likes epic baseball games also likes Brad Paisley. \n\n\t“I would like to be called Mr. More Baseball,” the country star tells Va",
    "body": "\n\tSomebody up there who likes epic baseball games also likes Brad Paisley. \n\n\t“I would like to be called Mr. More Baseball,” the country star tells Variety, the day after singing the National Anthem at a World Series game that went to a record-tying 18th inning. “If you’d like more baseball, I’m your guy.”\n\n\tIt’s not that this was an isolated occurrence. The previous time a World Series game went to an 18th inning, back in 2018, Paisley also happened to be singing “The Star-Spangled Banner.” In fact, all four times he has sung the anthem before a Series game, it has gone into extra innings, although not always as radically as these two instances.\n\t\n\n\tA few wags have wondered if this is “the Brad Paisley curse,” but most baseball fans would be more likely to qualify as something like “the Brad Paisley blessing.” Rather than become bored by the lengthy standoff, many were agreeing with the sportcasters who called Monday’s game one of the most thrilling in the history of the sport, even though (maybe especially though) it went to almost seven hours.\n\n\n\tSo many people have credited him as the charm that made that possible again, he’d like to put himself up for more such possibly crowd-pleasing opportunities to usher in a two-for-the-price-of-one game.\n\n\t“I’m available also for football,” Paisley points out. “I’d like to see that go into more quarters, as well.”\n\n\tPaisley did an interview for an MLB program before his performance and was asked, presumably jokingly, if he could foresee something similar happening as went down in 2018. He brushed it off.\n\n\t“It’s statistically impossible. I don’t understand,” says the country star. “I was like, I just want to get the words right. I had no idea that there would be major cosmic ramifications.”\n\t\n\n\tAs another point of coincidence, his birthday is Tuesday. “Here’s the fun fact: On the east coast, they won this on my birthday. They almost won it on my birthday on the west coast. If they win tonight, I get two wins on my birthday. Wouldn’t that be nice? That’s all I want. I can’t think of anything stranger, first of all,” than the Dodgers winning two on his big day without there being a double-header.\n\nLet him sing it tonight, I want 6 more hours of Baseball— JumpyYaNub (@JumpyYaNub) October 28, 2025\n\n\n\tHe won’t really take any credit for Monday’s seeming serendipity. “I definitely don’t think it had anything to do with me,” the Dodgers megafan says. “I did start to wonder what we were headed for in the ninth. I was like, ‘Please God, let’s win this now.’ And then I thought, ‘Okay, please God, let’s win this now in the 10th.’ And then last year the walk-off was in the 11th with Freddy Freeman, and that was a grand slam, and I’m like, ‘That’d be fine. Let’s do that. Yeah, that’d be a fun stat — do that twice!’ Nope. And then it was like, oh no… But it was one of the best-played baseball games of all time. I mean, the defense that both teams showed, the way they kept the score tied, and then the pitching… I just don’t even know what we just watched. It really was one of the most exhausting sporting events that you could ever see. Anybody who’s on the fence about what it’s like to be a baseball fan…”\n\n\t“Last night when that was happening, it was the same exact feeling when I was waiting on that in 2018. Just every inning, a pitcher just absolutely out-dueling the other, and then some close calls and then, I mean, none of us could believe what we were seeing, and I thought, who’s gonna end this? And then all of a sudden, here comes Freddy, which is also poetic. He did it two years in a row. It’s crazy.”\n\n\n\tPaisley is a friend of the Dodgers, literally, and is closest to the legendary pitcher who came into the game for just one out, at a point when the bases were loaded, with a serious threat to see the Blue Jays finish the home team off and change the momentum of the series.\n\n\t“My favorite moment was with my dear friend Clayton Kershaw, who’s my favorite player of all time, and not just because we’re friends. I think he’s the exemplary baseball player of our generation,” Paisley says. “And for him to go in there… I couldn’t believe the situation he was asked to perform in last night. Never in history, going in an extra inning, ever, and then goes in an extra inning with bases loaded and doesn’t give up. To me, that’s just the beautiful thing about this game. They cut to Ellen, his wife, in the stands, and she’s crying when he gets that.” Paisley had chatted with him before the game. “He said it last night. ‘He’s like, ‘Four more games at most, and then I’m done.’ And it’s like, whoa. And then to see this play out, it’s like Brad Pitt said in ‘Moneyball’: ‘How can you not be romantic about baseball?'”\n\t\n\n\tSome thought that was a risky move on manager Dave Roberts’ part that could have had fans feeling sorry for the nearly-retired Kershaw if things had not gone his way. “That’s foremost on Dave’s mind,” Paisley says. “He must have really, really felt like that was the best shot at that moment. He needed that out, and he needed it from somebody that’s not gonna buckle. Clayton is the fiercest competitor you will ever meet. In the case of Dave, they’re very mindful of the fact that his legacy needs to be one of his entire incredible, massive career being this major accomplishment. And you don’t want that footnote at the end (if winning runs are batted in on Kershaw’s watch). I was really praying at that moment, but it worked out. And I think that somehow that was meant to be.”\n\n\tPaisley talks about the slow evolution of his relationship with the Dodgers before he became known as one of the most reliable musical faces in Chavez Ravine.\n\n\t“It goes back to when Kim (actress Kimberly Williams-Paisley) and I got married in 2003 and started living out there part-time in Santa Monica. We bought our first house, which was in the Palisades, which is one of my houses that burned down (this year). I didn’t own it anymore, but it’s a tragedy; it was a beautiful old place, built in 1922, and the first house we ever bought together. Just like everything else in that area, it’s gone. But around that time, my kids started to be of the age where they need to go to baseball games. I mean, that’s a rite of passage. And so I started to fall in love with the Dodgers as a team and got to know guys like Clayton and Justin Turner, and became good friends with Dave Roberts and Andrew Friedman and these folks. It kinda helps, too, that Nashville doesn’t have anything like that, other than the Sounds, who aren’t competing in that category. But it’s a really neat organization and I just love the sport.”\n\n\n\n\t\n\n\t\t\t\t\tBrad Paisley, Jason Bateman, and Sean Hayes pose for a photo prior to Game Three of the 2025 World Series presented by Capital One between the Toronto Blue Jays and the Los Angeles Dodgers at Dodger Stadium on Monday, October 27, 2025 in Los Angeles, California. \n\t\t\t\t\t\t\t\t\tMLB Photos via Getty Images\n\t\n\n\n\n\tHe didn’t grow up obsessed with the game. “I grew up kind of half-watching baseball. In the years where the Pirates were good when I was growing up, my dad for some reason was a Cleveland Indians fan, instead of the Pirates, probably from his dad. But we just didn’t go to many games or anything like that and I just wasn’t invested.”\n\t\n\n\tWhen he was asked to do his first performance of the National Anthem for the Dodgers in 2000, it planted a seed. “That first anthem was interesting. It was a middle of the day, hot L.A.-sun-type sun game, and you sing and they give you the jersey and tickets and you have a hot dog and call itan accomplishment.” But eventually it got to be personal, not just a gig, with Paisley.\n\n\t“One of the more memorable ones I ever did was what they called opening day 2.0, I think — the opening day of fans being allowed back in ‘21, after that whole year of just our cardboard cutouts sitting in the stands over there. I sang that day and that was really emotional — I mean, it just felt like the world was right when people were allowed to watch this game again in person. I loved it. And that one was hard to get through; it felt like a cathartic thing.”\n\n\n\n\t\n\n\t\t\t\t\tBrad Paisley, Kimberly Williams-Paisley, Ellen Kershaw, and Clayton Kershaw attend Clayton Kershaw’s 7th Annual Ping Pong 4 Purpose at Dodger Stadium on August 8, 2019 in Los Angeles, California. \n\t\t\t\t\t\t\t\t\tGetty Images\n\t\n\n\n\n\tNow, “I think if you want more baseball, call me.  I would like to think it’s the blessing, being that my team won; I guess it would be a curse if every time I sang it went long and the team I was rooting for lost. But I love being some part” of the lore, he says. “Because look, I’m never gonna swing a bat or be anywhere near the real sport itself, and then, to see these articles today” on sports sites and in other news stories, “there’s so much fun to read mentions that are like, ‘Did you know he did this and this and this?’ It’s really mind-blowing to even be mentioned in the course of some baseball statistic, for a guy who loves the sport…\n\n\t“It’s my one historic contribution to mankind,” he cheerfully decides.\n\nIf Brad Paisley sings the national anthem at a World Series game, they should sell alcohol at least until the second 7th inning stretch.— Fantasy Beasts and Where to Find Them (@FantasyBeastsFF) October 28, 2025\n\n\n\tNext up for Paisley is a Christmas album he’s soon putting out, “Snow Globe Town” — and it’s hard to think about yuletide cheer being night when the boys of summer are still at it in the L.A. sun. But he’s ready for the transition, with or without a rocking holiday collection to soon promote. “That’s why you turn Hallmark on in November. Well, I do. It’s like, ‘Let’s leave this channel on for the next two months.'”\n\n\tPaisley is sticking around to attend Tuesday’s Game 4, naturally. From the stands. “Whatever happens tonight ain’t my fault,” he says.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Brad Paisley on Singing the Anthem Before the Only Two 18-Inning Games in World Series History: ‘I Had No Idea There Would Be Major Cosmic Ramifications’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/GettyImages-2243319294.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-29T00:57:26.000Z",
      "dateModified": "2025-10-29T00:57:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Elvis’ Producer Schuyler Weiss Champions Gold Coast as Global Production Hub at Tokyo Film Festival",
    "url": "https://variety.com/2025/film/festivals/elvis-producer-australia-incentives-tokyo-film-festival-1236564272/",
    "image": "https://variety.com/wp-content/uploads/2023/03/Elvis.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-29T08:16:28.000Z",
    "description": "\n\tSchuyler Weiss, producer of Baz Luhrmann’s “Elvis,” made a compelling case for Australia’s film ecosystem at an MPA seminar during the Tokyo Interna",
    "body": "\n\tSchuyler Weiss, producer of Baz Luhrmann’s “Elvis,” made a compelling case for Australia’s film ecosystem at an MPA seminar during the Tokyo International Film Festival, speaking from his unique position as both a local Australian producer and facilitator of major Hollywood productions.\n\n\tWeiss, who has worked with Luhrmann for approximately 20 years on productions including “Australia,” “The Great Gatsby” and “Elvis,” outlined how sophisticated production incentives have helped transform the Gold Coast into one of the country’s fastest-growing film centers.\n\t\n\n\t“I stand here, on the one hand, as a local Australian film producer who is as concerned as anyone with the health, the growth, the future of our domestic production industry, but I also spend a big part of my day actively bringing large scale Hollywood backed global productions to Australia,” Weiss said, noting his upcoming work on Luhrmann’s “Joan of Arc.”\n\n\n\tAustralia’s multi-tiered incentive system features a 30% production attraction rebate for international productions, standalone post-production incentives, and various programs specifically for Australian producers at the federal level. Individual states add their own incentives, creating what Weiss described as a “co-opetition” that spreads work around the country while avoiding bottlenecks in Sydney or Melbourne.\n\n\tEven local governments participate — the Gold Coast city council offers municipal-level incentives. “You can coordinate all the levels of government to be the wind in the sails of your production,” Weiss explained.\n\n\tHe emphasized that incentives must be clear and accessible for quick decision-making, noting he’s “seen the spreadsheets in the corridors of power and big movie studios in Hollywood, where without great regard to what the content is going on screen, they’re just looking at whether they should shoot in London or the Gold Coast or Bratislava, as if those things are interchangeable.”\n\t\n\n\tWorking with the MPA, Australia recently strengthened and clarified the 30% location attraction rebate, replacing what Weiss called “something that was just, frankly, kind of unwieldy and confusing.” The incentives operate on a rolling basis to accommodate the industry’s unpredictable timelines.\n\n\tWeiss stressed that government incentives represent an investment rather than a gift, with returns of four to five times every dollar spent. The economic impact extends beyond industry payroll to rental cars, hotels, meals and other services. “The penetration goes so deeply into the economy when big film productions come to town that the incentives offer a tremendous return on investment, but it’s also an investment in the future,” he said.\n\n\tScreen Australia serves as the interface between the industry and government, with Weiss praising the agency’s clear governance structure. The incentive system has enjoyed bipartisan political support for 18 years, providing the reliability necessary for infrastructure investment.\n\n\tOver two decades, Australia has hosted dozens of major movies and international productions, elevating filmmakers like George Miller and Luhrmann to the highest levels while they continued working domestically. “Elvis” featured 100% Australian visual effects work, with so many shots that Weiss joked the VFX team were “victims of their own success” because the recreations of Memphis locations like Beale Street looked so authentic that visitors from Tennessee believed they had filmed on location.\n\n\tIn reality, the production built a five-block backlot set of Memphis on a former city dump on the Gold Coast that had been grassed over.\n\n\tWeiss highlighted the skills transfer between large international productions and local films. After “Elvis” wrapped, he produced a smaller Australian film, “How to Make Gravy,” for the local market, giving department members from the big production their first head-of-department roles on a feature. “That hand in hand between the international industry and the local industry is really, really gratifying to be a part of,” he said.\n\n\tAustralia now has world-class production facilities in Sydney, Melbourne and the Gold Coast, with emerging centers in South Australia and Western Australia. However, the industry faces capacity constraints — even director Ron Howard couldn’t secure soundstage bookings for two back-to-back Gold Coast productions, per Weiss.\n\t\n\n\tWeiss identified post-production and visual effects as “the next big frontier” for Australian industry growth. The country offers a 30% PDV (post-production, digital and visual effects) rebate nationally, with Queensland adding an extra 15%. “We want people who shoot their movie anywhere, shoot their movie in Japan, shoot their movie in Thailand, shoot their movie in Canada, or maybe even actually in Hollywood, to feel like they would do post production in Australia regardless of where the movie is shot,” Weiss said.\n\n\tHe noted that a company recently committed to moving 100 employees from Sydney to the Gold Coast, with plans to grow to 300-500 positions within a few years, attracted by the rebate structure. International production location incentives now include mandates for skills development spending, which Weiss applauded for training young technicians.\n\n\tWeiss noted that production company Bazmark, is partnering with multiple levels of Australian government to develop the Miami Arts Depot (MAD), a permanent integrated creative community on 35,000 square meters of former municipal land on the Gold Coast, approximately one kilometer from the beach. The facility will house post-production, visual effects, technology companies, production companies and industry organizations.\n\n\t“We want to create a hub there that will offer the best in class vendors and facilities for our industry to use, and also for the benefit of our international productions and partners,” Weiss said. The project aims to foster intersection between film, technology and design while maintaining physical space for creative collaboration. “At the end of the day, our industry, the movie business, is the most collaborative art form ever devised,” he noted.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Elvis’ Producer Schuyler Weiss Champions Gold Coast as Global Production Hub at Tokyo Film Festival",
      "image": [
        "https://variety.com/wp-content/uploads/2023/03/Elvis.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-29T08:16:28.000Z",
      "dateModified": "2025-10-29T08:16:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ayushmann Khurrana Celebrates Box Office Triumph of Maddock Horror Comedy Universe Film ‘Thamma’: ‘All My Dreams Come True as an Entertainer’ (EXCLUSIVE)",
    "url": "https://variety.com/2025/film/news/ayushmann-khurrana-box-office-thamma-1236564169/",
    "image": "https://variety.com/wp-content/uploads/2025/10/Thamma.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-29T05:30:00.000Z",
    "description": "\n\tBollywood star Ayushmann Khurrana has scored his fifth century at the Indian box office with the Diwali blockbuster “Thamma,” which has crossed the ",
    "body": "\n\tBollywood star Ayushmann Khurrana has scored his fifth century at the Indian box office with the Diwali blockbuster “Thamma,” which has crossed the INR100 crore mark ($11.3 million) and is poised to become the highest-grossing origin film in the Maddock Horror Comedy Universe.\n\n\tThe supernatural horror-comedy, directed by Aditya Sarpotdar and produced by Dinesh Vijan and Amar Kaushik, stars Khurrana alongside Rashmika Mandanna, Nawazuddin Siddiqui, and Paresh Rawal in the fifth installment of the expanding universe.\n\t\n\n\tThe film follows Alok Goyal, a journalist who transforms into a vampiric creature called Betal after encountering a mysterious woman, and must save humanity from the bloodlust of an ancient evil.\n\n\n\tThe INR100 crore number has long been considered a yardstick of box office success in India. “Thamma” has collected INR123 crore ($13.9 million) so far, joining Khurrana’s roster of century club hits. They include “Dream Girl” ($22.6 million), “Dream Girl 2” ($15.8 million), “Badhaai Ho” ($25 million), and “Bala” ($19.4 million).\n\n\tKhurrana has launched several franchises, including “Dream Girl,” “Badhaai Ho,” “Shubh Mangal Saavdhaan,” “Thamma,” and “Andha Dhun,” the latter of which teased a sequel in its climax.\n\n\t“The public validation is the biggest validation for any artiste,” Khurrana tells Variety. “Maddock Horror Comedy Universe has an amazing legacy of hits and as an origin film, ‘Thamma,’ has registered the best opening of any MHCU’s first film. It is also going to become the highest grossing origin film within MHCU which again is a big feat. So, I’m very happy and I thank the audience for this love.”\n\t\n\n\tThe supernatural comedy represents Khurrana’s first major Diwali holiday frame release and his second post-pandemic century at the box office after “Dream Girl 2.”\n\n\t“I always wanted to do a big film that becomes a festival release and entertains the whole of India,” Khurrana said. “‘Thamma’ has made all my dreams come true as an entertainer.”\n\n\tThe actor expressed particular satisfaction that “Thamma” has broadened his demographic appeal beyond his usual audience base.\n\n\t“The best part is that kids loved this film, my earlier films have been for a mature audience, but ‘Thamma,’ kids really enjoyed it. I’m very happy about this.” he said. “Every year during Diwali we used to go to watch films of big stars in cinemas. I used to always wish that my film too releases in this massive holiday and people enjoy it. It means a lot to me to see that the audience have gone to watch my film this time with their entire family and are having a lovely time.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ayushmann Khurrana Celebrates Box Office Triumph of Maddock Horror Comedy Universe Film ‘Thamma’: ‘All My Dreams Come True as an Entertainer’ (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/Thamma.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-29T05:30:00.000Z",
      "dateModified": "2025-10-29T05:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Guess Who This Lil' Kid In Orange Turned Into!",
    "url": "https://www.tmz.com/2025/10/29/guess-who-this-lil-kid-in-orange-turned-into-scream-queens/",
    "image": "https://imagez.tmz.com/image/71/16by9/2025/10/14/71e65c386d5b4e7ca4b1785ce63044c4_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-29T07:01:13.000Z",
    "description": "\n    \n                    \n                          Guess Who This\n                          Lil' Kiddo In Orange\n                          Turned In",
    "body": "\n    \n                    \n                          Guess Who This\n                          Lil' Kiddo In Orange\n                          Turned Into!\n                      \n                  \n                        Published October 29, 2025 12:01 AM PDT\n                                                                            \n      \n    \n          Before this lil' cutie turned into an American actress, she was just growing up in sunny L.A. with her neighborhood bestie, Frances Bean Cobain.\n      \n    \n          She starred in the horror comedy series \"Scream Queens.\"\n      \n    \n          Can you guess who she is?\n      \n      \n      \n          \n            \n              \n                \n                Share on Facebook\n              \n            \n            \n              \n                \n                Share on X\n              \n            \n                          \n                \n                  \n                \n              \n                      \n        \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Guess Who\n              \n                          \n                Kids\n              \n                          \n                celebrity kids\n              \n                          \n                Photo Galleries\n              \n                      \n        \n          \n  ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Guess Who This Lil' Kid In Orange Turned Into!",
      "image": [
        "https://imagez.tmz.com/image/71/16by9/2025/10/14/71e65c386d5b4e7ca4b1785ce63044c4_xl.jpg"
      ],
      "datePublished": "2025-10-29T07:01:13.000Z",
      "dateModified": "2025-10-29T07:01:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Celebrity Black Cats To Celebrate National Cat Day ... Meooow!",
    "url": "https://www.tmz.com/2025/10/29/celebrity-black-cats-to-celebrate-national-cat-day-meooow/",
    "image": "https://imagez.tmz.com/image/a0/16by9/2023/10/06/a05f7b009b854138b69ec803921211f4_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-29T07:30:57.000Z",
    "description": "\n    \n                    \n                          Celebrity Black Cats To\n                          Celebrate National Cat Day\n                    ",
    "body": "\n    \n                    \n                          Celebrity Black Cats To\n                          Celebrate National Cat Day\n                          Meow Ow!!!\n                      \n                  \n                        Published October 29, 2025 12:30 AM PDT\n                                                                            \n      \n    \n          In honor of National Cat Day, stretch into these scary-hot shots of celebs dressed as cats! Sexy stars like Kara Del Toro, Jessica Burciaga and Vivica A. Fox are pawsitively slaying their cat costumes.\n      \n    \n          It's meow or never, dive into our gallery and see more black cat costumes, like Khloe Kardashian -- whose kitty glam is on fleek!\n      \n      \n              \n          \n                          \n                Vivica A. Fox\n              \n                          \n                Hotties & Bodies\n              \n                          \n                Hot Bodies\n              \n                          \n                Photo Galleries\n              \n                          \n                Halloween\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Celebrity Black Cats To Celebrate National Cat Day ... Meooow!",
      "image": [
        "https://imagez.tmz.com/image/a0/16by9/2023/10/06/a05f7b009b854138b69ec803921211f4_xl.jpg"
      ],
      "datePublished": "2025-10-29T07:30:57.000Z",
      "dateModified": "2025-10-29T07:30:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Late TikTok Star Ben Bader Was Found Not Breathing",
    "url": "https://www.tmz.com/2025/10/28/tiktok-star-ben-bader-found-not-breathing/",
    "image": "https://imagez.tmz.com/image/d4/16by9/2025/10/28/d4ac27311aa04be2b8ddcd7ab487d025_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-28T19:35:32.000Z",
    "description": "\n    \n                    \n                          Late TikTok Star Ben Bader\n                          Stopped Breathing, Life-Saving Measures Fail",
    "body": "\n    \n                    \n                          Late TikTok Star Ben Bader\n                          Stopped Breathing, Life-Saving Measures Failed\n                      \n                  \n                        Published October 28, 2025 12:35 PM PDT\n                                                                      |\n                Updated October 28, 2025 3:40 PM PDT\n                                    \n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Following the mysterious and untimely death of TikTok star Ben Bader, we now have more info as to how he passed -- and the details are disturbing.\n      \n    \n          Shawn Reed, a rep for the Jupiter Police Department in Florida, tells TMZ ... Bader was discovered by neighbors and appeared \"not to be breathing.\"\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          The spokesperson also said first responders performed life-saving measures on Bader, and continued when medical personnel arrived. Reed added Bader was eventually taken to a hospital, where he was pronounced dead.\n      \n\n          The Palm Beach County Medical Examiner will determine the final cause of death, but as of now, authorities haven't ruled out anything -- and that includes foul play.\n      \n    \n          As you know ... the content creator tragically passed away October 23. His girlfriend, Reem, shared the sad news in an emotional tribute to Ben, saying, \"Ben was the kindest, most caring, most generous person I have ever met in my entire life ... He genuinely loved every single person that he met and he was so positive all the time.\"\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          According to Reem, the death was \"extremely sudden.\"\n      \n    \n          In a statement to TMZ ... the Upham and Bader family remember him as a \"visionary who led with love, lived with intention, and turned his passions into helping others.\"\n      \n    \n          He was 25.\n      \n    \n          RIP\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                RIP\n              \n                          \n                TikTok\n              \n                          \n                Fairly Legal\n              \n                          \n                Influencers\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Late TikTok Star Ben Bader Was Found Not Breathing",
      "image": [
        "https://imagez.tmz.com/image/d4/16by9/2025/10/28/d4ac27311aa04be2b8ddcd7ab487d025_xl.jpg"
      ],
      "datePublished": "2025-10-28T19:35:32.000Z",
      "dateModified": "2025-10-28T19:35:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Hurricane Melissa Rips Roof Off Hospital, Causes Devastation in Jamaica",
    "url": "https://www.tmz.com/2025/10/28/hurricane-melissa-jamaica-roof-hospital/",
    "image": "https://imagez.tmz.com/image/31/16by9/2025/10/28/3107cb27f937455689ada2b384898fd3_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-28T20:45:42.000Z",
    "description": "\n    \n                    \n                          Hurricane Melissa\n                          Roofs Ripped Off Hospitals, Flash Floods, Power Outag",
    "body": "\n    \n                    \n                          Hurricane Melissa\n                          Roofs Ripped Off Hospitals, Flash Floods, Power Outages\n                      \n                  \n                        Published October 28, 2025 1:45 PM PDT\n                                                                            \n      \n    \n          Hurricane Melissa made landfall in Jamaica a couple of hours ago ... and the Category 5 storm was immediately wreaking havoc on the island.\n      \n    \n          The massive storm is causing roads to flood -- in some areas, flash flooding pushed water high enough to engulf a car -- and major power outages across the country are occurring ... with CNN reporting nearly 250,000 are impacted.\n      \n    \n      \n      The roof of a section of the Savanna La Mar Hospital has been peeled off by strong winds from Hurricane Melissa.A section of the roof of the Black River Hospital has also been destroyed.Images of devastation are emerging from western Jamaica. pic.twitter.com/Qet7Rf7Tfy— Nationwide90FM (@NationwideRadio) October 28, 2025\n              @NationwideRadio\n          \n  \n    \n          In harrowing videos shared by local radio news station Nationwide90FM ... Melissa's winds were so furious, reaching 185 MPH ... they ripped a portion of the roof off Savanna La Mar Hospital. Another hospital was also damaged, per the station.\n      \n\n      \n      Cars were submerged, and powerful wind gusts hit Mandeville, Jamaica, as Hurricane Melissa made landfall on Tuesday. pic.twitter.com/vID5OqJ0jm— AccuWeather (@accuweather) October 28, 2025\n              @accuweather\n          \n  \n    \n          Just before Melissa made landfall ... the National Hurricane Center issued a stark warning to Jamaicans ... \"To protect yourself from wind, the best thing you can do is put as many walls as possible between you and the outside. An interior room without windows, ideally one where you can also avoid falling trees, is the safest place you can be in a building. You can cover yourself with a mattress and wear a helmet for added protection.\"\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Weather\n              \n                          \n                Fairly Legal\n              \n                          \n                News\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Hurricane Melissa Rips Roof Off Hospital, Causes Devastation in Jamaica",
      "image": [
        "https://imagez.tmz.com/image/31/16by9/2025/10/28/3107cb27f937455689ada2b384898fd3_xl.jpg"
      ],
      "datePublished": "2025-10-28T20:45:42.000Z",
      "dateModified": "2025-10-28T20:45:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chris Evans and Wife Alba Baptista Welcome Baby Girl",
    "url": "https://www.tmz.com/2025/10/28/chris-evans-alba-baptista-first-baby/",
    "image": "https://imagez.tmz.com/image/7a/16by9/2025/10/27/7a7f4f3eec244f2fbb383f34b3d78c0d_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-28T14:54:45.000Z",
    "description": "\n                    \n                          Chris Evans\n                          I'm A Dad!!!\n                          First Baby With Wife Alba",
    "body": "\n                    \n                          Chris Evans\n                          I'm A Dad!!!\n                          First Baby With Wife Alba\n                      \n                  \n                        Published October 28, 2025 7:54 AM PDT\n                                                                      |\n                Updated October 28, 2025 3:11 PM PDT\n                                    \n              \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Update\n  \n    \n          9:35 AM PT -- We just found out Chris and Alba had a baby girl, and named her Alma Grace. She's taking both Mom and Dad's last names ... Baptista Evans, and she arrived at 1:27 PM.\n      \n    \n          Chris Evans has something new to \"Marvel\" at ... TMZ has learned the \"Captain America\" star and his wife, Alba Baptista, just had their first baby!\n      \n    \n          Records indicate they welcomed their first child Friday in Massachusetts. So far no word on name or gender.\n      \n    \n      \n        \n              \n    \n    \n          The new parents -- Chris, 44, and Alba, 28 -- wed September 9, 2023, during a private ceremony on Cape Cod after first going Instagram official with their relationship 9 months earlier.\n      \n\n          Rumors started swirling over the summer when a fan account for the couple posted a Father's Day tribute, tagging both Alba and Chris' respective fathers. Luiz Baptista, Alba's dad, left a sweet comment saying, \"Many thanks dear Chris. Your turn is coming! 🥰\"\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    Fans took this as Luiz alluding to the lovebirds possibly becoming a family of 3 soon, and they were right.Reps for the couple could not be reached for comment.\n\n          Alba, who is Portuguese, first met Chris in Europe and, according to People, friends called it \"love at first sight.\"\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          As we reported back in May, Chris put his Hollywood Hills mansion on the market for $7 million. A source told us he was ditching the beautiful pad to move closer to family back east.\n      \n    \n          Now, that fam's expanded ... congrats to the happy couple!\n      \n      ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chris Evans and Wife Alba Baptista Welcome Baby Girl",
      "image": [
        "https://imagez.tmz.com/image/7a/16by9/2025/10/27/7a7f4f3eec244f2fbb383f34b3d78c0d_xl.jpg"
      ],
      "datePublished": "2025-10-28T14:54:45.000Z",
      "dateModified": "2025-10-28T14:54:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]