[
  {
    "title": "‘Last Week Tonight With John Oliver’ Pays Tribute to Late ‘Jimmy Kimmel Live’ Bandleader Cleto Escobedo III",
    "url": "https://variety.com/2025/tv/news/last-week-tonight-john-oliver-tribute-cleto-escobedo-iii-1236583402/",
    "image": "https://variety.com/wp-content/uploads/2025/11/Cleto-Escobedo-III.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-17T07:39:06.000Z",
    "description": "\n\t“Jimmy Kimmel Live” bandleader Cleto Escobedo III, who died last week at 59, was honored on Sunday night during the opening credits of “Last Week To",
    "body": "\n\t“Jimmy Kimmel Live” bandleader Cleto Escobedo III, who died last week at 59, was honored on Sunday night during the opening credits of “Last Week Tonight With John Oliver“: A photo of Escobedo, with his saxophone, was spotted under the word “maestro.” \n\n\tOliver and team frequently use the last image in their credits before cutting to the host behind his desk to honor a newsmaker from the previous week — and given the tight camaraderie that exists among the late night shows, it’s probably no surprise that “Last Week Tonight” would want to recognize a fallen colleague. \n\t\n\n\tKimmel announced Escobedo’s passing on Tuesday via an Instagram post, and on that night’s episode, he shared the news and some of his memories of his childhood best friend. “To say that we are heartbroken is an understatement,” Kimmel wrote in his Tuesday post. “Cleto and I have been inseparable since I was 9 years old. The fact that we got to work together every day is a dream neither of us could ever have imagined would come true. Cherish your friends and please keep Cleto’s wife, children and parents in your prayers.”\n\n\n\tOn Friday, Kimmel announced that he and the show had launched fundraisers for UCLA Medical Center and Las Vegas’ Animal Foundation in memory of Escobedo. “Cleto was always kind and eager to help others. As we mourn his loss, we have started two fundraisers to celebrate his life and give back. The first is for UCLA Medical Center where he received such incredible care. Together we can help vulnerable patients and families in need of financial assistance during hard times. And to honor his love of animals, the The Animal Foundation in our hometown of Las Vegas.”\n\t\n\n\tThe UCLA Medical Center fundraiser noted, “In memory of our friend Cleto, we’d like to thank all the hardworking specialists, doctors, and nurses at UCLA. They worked tirelessly and generously to give him the best care. Cleto was always kind and eager to help others. To honor his generous spirit, we’d like to help vulnerable patients and families in need of financial assistance during hard times. Let’s help others in Cleto’s name.”\n\n\tAnd at The Animal Foundation, the fundraiser noted, “Cleto was a beloved friend, father, and animal lover whose heart was always open to pets in need. His family shares this message: ‘Cleto was a  compassionate animal lover. He loved each of his rescue dogs like they were family. Please consider making a donation to The Animal Foundation in his hometown of Las Vegas. Cleto would have loved his friends and family helping to provide safety, healing and homes for pets in need.’ In honor of Cleto’s lifelong love for animals, gifts made through this page will support The Animal Foundation’s work to save and care for vulnerable pets right here in Las Vegas.”\n\n\tAccording to People magazine, which credited TMZ with first receiving Escobedo’s death certificate, “cardiogenic shock is listed as the immediate cause of death. Vasodilatory shock, disseminated intravascular coagulation and alcoholic cirrhosis of the liver are listed as underlying causes.” \n\n\tEscobedo played the alto, tenor and soprano saxophones and also sang as part of the Cleto and the Cletones house band. Outside of performing on Kimmel’s show, Escobedo toured with Paula Abdul, Marc Anthony and Earth, Wind & Fire’s Phillip Bailey.\n\n\tWhen Kimmel launched “Jimmy Kimmel Live!” on ABC in 2003, he asked Escobedo to lead the house band. “I always thank him for this gig because he could have tried to get somebody that was established and would help the show more, being a bigger name or whatever,” Escobedo told ABC7 in a 2013 interview. “But he trusted me with this job, and I’ve tried to do the best I can.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Last Week Tonight With John Oliver’ Pays Tribute to Late ‘Jimmy Kimmel Live’ Bandleader Cleto Escobedo III",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/Cleto-Escobedo-III.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-17T07:39:06.000Z",
      "dateModified": "2025-11-17T07:39:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Man Who Grabbed Ariana Grande at ‘Wicked: For Good’ Singapore Premiere Sentenced to Nine Days in Prison",
    "url": "https://variety.com/2025/film/global/ariana-grande-man-who-grabbed-wicked-premiere-prison-time-1236583470/",
    "image": "https://variety.com/wp-content/uploads/2025/11/GettyImages-2246093962_f090ca.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-17T11:51:06.000Z",
    "description": "\n\tA man who grabbed Ariana Grande at the premiere of “Wicked: For Good” in Singapore last week has been sentenced to nine days in prison.\n\n\tBBC News r",
    "body": "\n\tA man who grabbed Ariana Grande at the premiere of “Wicked: For Good” in Singapore last week has been sentenced to nine days in prison.\n\n\tBBC News reported that Johnson Wen was found guilty of being a public nuisance in a Singapore court on Monday. As shown in a viral video, the 26-year-old Australian jumped over a barricade at the musical sequel’s Asian premiere on Thursday and rushed at Grande, who was protected by her co-star Cynthia Erivo. \n\t\n\n\tAccording to local media, Wen pleaded guilty to the incident. The court heard on Monday that Wen attempted to intrude on the red carpet twice — once when he charged at Grande and another time after he was escorted out by security. Wen told the judge that he would “not do it again.” \n\n\n\tWen often posts on social media about getting close to celebrities at events and premieres. He has previously found his way on stage at the concerts of Katy Perry, the Weeknd, the Chainsmokers and others. On his Instagram story the day after the “Wicked: For Good” premiere, Wen posted that he was “free after being arrested.”\n\n\tThough Grande has not publicly commented on the incident, Erivo alluded to it during a screening in Los Angeles over the weekend. “We have come through some shit,” Erivo said about the film’s press tour. “I mean, fuck, even this last week, let’s be honest.”\n\n\tGrande, Erivo and the rest of the “Wicked: For Good” cast will make their final stop in New York City on Monday night before the film opens in theaters Nov. 21. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Man Who Grabbed Ariana Grande at ‘Wicked: For Good’ Singapore Premiere Sentenced to Nine Days in Prison",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/GettyImages-2246093962_f090ca.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-17T11:51:06.000Z",
      "dateModified": "2025-11-17T11:51:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tom Cruise Accepts Honorary Oscar With Emotional Speech at Governors Awards: ‘Making Films Is Not What I Do, It Is Who I Am’",
    "url": "https://variety.com/2025/awards/news/tom-cruise-honorary-oscar-speech-1236583348/",
    "image": "https://variety.com/wp-content/uploads/2025/11/P1032VVG.jpg?crop=0px%2C61px%2C2000px%2C1125px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-11-17T05:40:19.000Z",
    "description": "\n\tTom Cruise was presented with an Academy Honorary Award during the Nov. 16 Governors Awards, and it’s no surprise that the larger-than-life movie st",
    "body": "\n\tTom Cruise was presented with an Academy Honorary Award during the Nov. 16 Governors Awards, and it’s no surprise that the larger-than-life movie star had a blockbuster acceptance speech.\n\n\tThe award was presented by Alejandro G. Iñárritu, who is directing Cruise in an upcoming, as-yet-untitled film set to be released in Oct. 2026.\n\n\tUpon accepting the award, Cruise gave an emotional speech paying tribute to all of the people who make films possible, as well as the unifying power of cinema.\n\t\n\n\t“The cinema, it takes me around the world,” Cruise said. “It helps me to appreciate and respect differences. It shows me also our shared humanity, how alike we are in so, so many ways. And no matter where we come from, in that theater, we laugh together, we feel together, we hope together, and that is the power of this art form. And that is why it matters, that is why it matters to me. So making films is not what I do, it is who I am.”\n\n\n\tCruise also spoke about the genesis of his film fandom.\n\n\t“My love for cinema began at a very early age, as early as I can remember,” he said. “I was just a little kid in a darkened theater, and I remember that beam of light just cut across the room, and I remember looking up, and it seemed to be just exploded on the screen. Suddenly, the world was so much larger than the one that I knew. And entire cultures and lives and landscapes all unfolded in front of me, and it sparked something. It sparked a hunger for adventure, a hunger for knowledge, a hunger to understand humanity, to create characters, to tell a story, to see the world. It opened my eyes. It opened my imagination to the possibility that life could expand far beyond the boundaries that I then perceived in my own life. And that beam of light opened a desire to open the world, and I have been following it ever since.”\n\t\n\n\tCruise has been nominated for four Oscars in the past: Best actor for “Born on the Fourth of July” and “Jerry Maguire,” best supporting actor for “Magnolia” and best picture for his role as a producer on “Top Gun: Maverick.”\n\n\tEarlier in the ceremony, Cynthia Erivo presented choreographer Debbie Allen with an honorary Oscar. Production designer Wynn Thomas also received a statue celebrating his lifetime of work. The Jean Hersholt Humanitarian Award was presented to Dolly Parton, who wasn’t able to attend the show in person because of health concerns, so she sent a pre-taped speech.\n\n\tThe Governors Awards red carpet drew scores of actors eager to join the awards season race this year, including Jennifer Lawrence, Michael B. Jordan, Sydney Sweeney, Leonardo DiCaprio, Dwayne Johnson, Emma Stone and many more.\n\n\tWatch some of Cruise’s speech below.\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tom Cruise Accepts Honorary Oscar With Emotional Speech at Governors Awards: ‘Making Films Is Not What I Do, It Is Who I Am’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/P1032VVG.jpg?crop=0px%2C61px%2C2000px%2C1125px&resize=1000%2C563"
      ],
      "datePublished": "2025-11-17T05:40:19.000Z",
      "dateModified": "2025-11-17T05:40:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Love Island’ Host Maya Jama Launches Mentorship Program for Marginalized Women in Creative Industries",
    "url": "https://variety.com/2025/tv/global/love-island-maya-jama-mentorship-program-women-1236583427/",
    "image": "https://variety.com/wp-content/uploads/2025/11/Credit_-Hollie-Molloy.jpg.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-17T10:00:00.000Z",
    "description": "\n\t“Love Island” host Maya Jama is partnering with social enterprise Creative Access to launch a new mentorship program for marginalized women in the U",
    "body": "\n\t“Love Island” host Maya Jama is partnering with social enterprise Creative Access to launch a new mentorship program for marginalized women in the U.K. creative industries.\n\n\tThe six-month program will connect eight emerging creatives with powerhouse mentors from Jama’s own professional network who will offer guidance, insight and support in areas including TV production, broadcasting, fashion, communications, marketing and talent management. The program is aimed at women in the U.K. from underserved communities who are at the entry-level career stage and will also include a visit to a London school and an event for early-career professionals.\n\t\n\n\tThe eight mentors in Jama’s program include broadcaster and entrepreneur Julie Adenuga; Janine Fernandes, VP of global brand marketing at Coty; Issy Lloyd, director of entertainment at Insanity Talent Management; ITV commissioning editor of reality and entertainment Amanda Stavri; Francesca Hayward, senior culture and entertainment manager at Diageo; freelance comedy executive producer Carol Baffour-Awuah; Financial Times’ HTSI editor Jo Ellison; and Priya Ahluwalia, fashion designer and founder of the brand Ahluwalia. \n\n\n\t“This mentorship program is something I have always wanted to do,” Jama said in a statment. “I’m incredibly excited to be partnering with Creative Access to connect talented young women with eight industry pros who will nurture and guide their careers.”\n\n\tJosie Dobrin, executive chair of Creative Access, said the organization is “proud to partner with the brilliant Maya Jama on this impactful mentorship program, which will provide a vital stepping-stone for eight talented aspiring creatives.”\n\t\n\n\tAdded Dobirn: “It is more important than ever to commit to upskilling the next generation of diverse talent, and through mentorship in flagship creative sectors, eight women will gain the support, guidance and access they need to thrive. Without programs like this, the industry risks missing out on the voices and visions that will shape its future.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Love Island’ Host Maya Jama Launches Mentorship Program for Marginalized Women in Creative Industries",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/Credit_-Hollie-Molloy.jpg.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-17T10:00:00.000Z",
      "dateModified": "2025-11-17T10:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Demon Slayer: Infinity Castle’ Opens at No. 1 in China",
    "url": "https://variety.com/2025/film/box-office/demon-slayer-infinity-castle-china-box-office-1236583392/",
    "image": "https://variety.com/wp-content/uploads/2025/09/demon-slayer-kimetsu.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-17T07:00:57.000Z",
    "description": "\n\t“Demon Slayer: Kimetsu no Yaiba – The Movie: Infinity Castle” powered China’s box office over the Nov. 14–16 frame, debuting with RMB354.2 million (",
    "body": "\n\t“Demon Slayer: Kimetsu no Yaiba – The Movie: Infinity Castle” powered China’s box office over the Nov. 14–16 frame, debuting with RMB354.2 million ($49.9 million), according to Artisan Gateway.\n\n\tThe Aniplex release, directed by Sotozaki Haruo and produced by ufotable, adapts the climactic final arc of Gotouge Koyoharu’s blockbuster manga. Returning voice cast members include Hanae Natsuki, Kitō Akari, Shimono Hiro, and Matsuoka Yoshitsugu. The film follows the Demon Slayer Corps’ all-out assault on Kibutsuji Muzan’s stronghold in a bid to end the war between humans and demons. \n\t\n\n\tAfter its first three days, it has reached $52.5 million, of which Imax accounted for $12.3 million. \n\n\n\tLionsgate’s “Now You See Me: Now You Don’t” bowed in second place with $21.6 million. \n\n\tLocal crime drama “Family at Large,” released by Hehe Pictures, opened in third with $1.9 million. Directed by Kang Bo, the film stars Hu Ge as an estranged father nicknamed Reindeer who is drawn into a gruelling human-trafficking run on China’s northeastern border, escorting a young pregnant woman and a boy who has previously been kidnapped. The cast also includes Wen Qi, Yan Ni, Song Jia, Gao Ye and Ou Hao.  \n\n\t“Predator: Badlands” placed fourth with $1.8 million, lifting its total to $12.6 million.\n\n\tShanghai Film Group’s “Shanghai Wonton” rounded out the top five with a $900,000 weekend and a cumulative $1.7 million. Directed by Wu Tiange, the film follows Wang, a retired engineer who cooks wontons every Saturday while worrying about his unmarried son. He heads to the city’s park dating corner to look for a match and falls in with a group of parents in similar situations. The ensemble cast includes Zhou Yemang, Pan Hong, Mao Shanyu, Wang Lin, Chen Guoqing and Xu Xiang.  \n\t\n\n\tWeekend box office surged to $79.7 million – compared to a couple of dismal $21 million frames – bringing China’s 2025 total to $6.41 billion, up 16% year-on-year.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Demon Slayer: Infinity Castle’ Opens at No. 1 in China",
      "image": [
        "https://variety.com/wp-content/uploads/2025/09/demon-slayer-kimetsu.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-17T07:00:57.000Z",
      "dateModified": "2025-11-17T07:00:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Now You See Me: Now You Don’t’ Debuts Atop Korea Box Office",
    "url": "https://variety.com/2025/film/box-office/now-you-see-me-now-you-dont-korea-box-office-1236583399/",
    "image": "https://variety.com/wp-content/uploads/2025/11/nomad-unit-241005-00054rc-crop.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-17T07:25:55.000Z",
    "description": "\n\t“Now You See Me: Now You Don’t” debuted at the top of the Korean box office with $2.8 million from 435,288 admissions over Nov. 12–16. \n\n\tAccording ",
    "body": "\n\t“Now You See Me: Now You Don’t” debuted at the top of the Korean box office with $2.8 million from 435,288 admissions over Nov. 12–16. \n\n\tAccording to KOBIS, the tracking service operated by the Korean Film Council, the film played on 1,352 screens for a 49.31% revenue share and has earned $3.8 million including previews.\n\n\t“Chainsaw Man The Movie: Reze Arc” ranked second with $838,963 (14.3% share), lifting its cumulative to $22.8 million. The film adapts the “Reze” arc of Tatsuki Fujimoto’s hit manga. Directed by Tatsuya Yoshihara with a screenplay by Hiroshi Seko, the movie follows Denji as his encounter with café worker Reze leads to a clash between intimate connection and bloody chaos. Voice cast includes Reina Ueda, Fairouz Ai, Tomori Kusunoki, and Maaya Uchida. Sony/Crunchyroll are handling distribution in the market.\n\t\n\n\t“Predator: Badlands” took third, earning $532,814 (9.1% share) for a $2.5 million total.\n\n\n\tKorean road-trip comedy “The First Ride” placed fourth on $356,238 (6.1% share), pushing its running total to $4.39 million. Directed by Nam Dae-joong (“The Great Battle”), the film follows a group of childhood friends whose long-awaited trip to Thailand quickly spirals into chaotic mishaps. The ensemble cast includes Kang Ha-neul, Cha Eun-woo, Kim Young-kwang, Kang Young-suk and Han Seon-hwa.\n\n\tJapanese thriller “The Exit 8” followed with $140,595 (2.4% share) and now stands at $2.9 million. Directed by Kawamura Genki, the film stars Ninomiya Kazunari as a man trapped in a seemingly endless subway corridor where he must detect minute anomalies to escape.\n\t\n\n\t“Demon Slayer: Kimetsu no Yaiba – The Movie: Infinity Castle” added $123,751 (2.1% share) for a $41.6 million cume. Family animation “Tafiti – Across the Desert” bowed at $72,148 (1.2% share). “Bugonia” grossed $81,301 (1.3% share) for $418,884 to date, while “Coraline” earned $71,680 (1.2% share) for a $2.30 million reissue total. Korea’s “The World of Love” rounded out the top 10 with $65,830 (1.1% share), reaching $718,843 cumulatively.\n\n\tThe top 10 films collectively grossed $5.1 million, an improvement over last weekend’s $3.8 million.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Now You See Me: Now You Don’t’ Debuts Atop Korea Box Office",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/nomad-unit-241005-00054rc-crop.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-17T07:25:55.000Z",
      "dateModified": "2025-11-17T07:25:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "John Oliver Launches ‘Last Week Tonight’ Auction, Including an Original Bob Ross Painting, to Support Public Broadcasting",
    "url": "https://variety.com/2025/tv/news/john-oliver-last-week-tonight-auction-public-broadcasting-1236583389/",
    "image": "https://variety.com/wp-content/uploads/2025/11/IMG_3415-e1763361133923.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-17T07:10:53.000Z",
    "description": "\n\tJohn Oliver tackled the Trump Administration’s defunding of public media for his final “Last Week Tonight” episode of 2025, detailing how the decisi",
    "body": "\n\tJohn Oliver tackled the Trump Administration’s defunding of public media for his final “Last Week Tonight” episode of 2025, detailing how the decision to eliminate $1.1 billion from the Corporation for Public Broadcasting earlier this year has severely impacted radio and TV stations, particularly in rural areas. So Oliver and “Last Week Tonight” are doing their part to help: The show has launched an auction website, John Oliver’s Junk, where 65 items are currently up for bid — including an original 1987 painting by late PBS icon Bob Ross, “Cabin at Sunset,” which at press time was fetching $51,000.\n\t\n\n\tThe idea for the auction actually came from the Bob Ross estate, which recently sold three Ross original paintings at auction to support public broadcasting, raising $662,000.\n\n\n\tOliver announced the “John Oliver’s Junk” auction on Sunday’s show, and said the auction would continue through Nov. 24. “We’ve actually accumulated a bunch of weird artifacts on this show over the years that we could definitely auction off to raise some much needed money,” Oliver said. “I am proud to announce last week tonight’s first ever auction in aid of public media. This is real!” Proceeds go to the Public Media Bridge Fund, which is assisting local public broadcasters in temporarily finding new funds in the wake of the CPB closure.\n\n\tRELATED: PBS CEO Reveals Plan to Save Stations and Programming After Trump Killed Funding, Admits There’s No ‘White Knight That Will Save Us’\n\n\tFans of “Last Week Tonight” will recognize several of the items being auctioned: Among them, Russell Crowe’s jock strap (“worn by Russell Crowe in the major motion picture Cinderella Man and later purchased by ‘Last Week Tonight with John Oliver,’ during season 5 of the show, as part of Crowe’s ‘Art of Divorce; auction in which Crowe sold his personal belongings to pay for his divorce”), and “Mrs. Cabbage Oliver” (“John Oliver’s on-screen wife, married during an on-screen wedding officiated by Steve Buscemi. Part of ‘Last Week Tonight’s’ season 9 segment on AI-generated art in which John marries a cabbage in the studio”).\n\t\n\n\n\n\t\n\n\t\n\n\n\n\tAlso: A large, gold-plated re-creation of President Lyndon B. Johnson’s balls (“Sculpture of President Lyndon B. Johnson’s scrotum, part of the season 12 segment on presidential libraries”), five wax Presidents of the United States, golden Adidas sneakers (“Gold sneakers John Oliver promised to wear in a season 2 episode of ‘Last Week Tonight with John Oliver’ if scandal-ridden FIFA President Sepp Blatter stepped down”).\n\n\tAmong other items: A trip to New York to meet Oliver; “a case of Cabernet SauvignJohn, a wine years in the making by ‘Last Week Tonight with John Oliver,'” and a chance to appear in a photo over Oliver’s shoulder during an episode — along with two VIP tickets to a live taping of the show.\n\n\tOliver’s “Community” colleague Joel McHale also appeared in the episode, which featured a flashback to when McHale hosted a pledge drive for Seattle’s PBS station in 1999 — and couldn’t stop talking about “Mr. Bean.” To commemorate that, McHale has signed a DVD set of “Mr. Bean” episodes, which is also being auctioned.\n\n\tOliver spent much of Sunday’s episode discussing public broadcasting’s predicament: “Public media has been truly innovative in reaching underserved audiences. It was public TV station that first invented closed captioning in the 1970s. Stations around the country offer programming in Haitian, Creole, Navajo, Vietnamese and many other languages. But as you undoubtedly know, it is now facing a serious threat, as over the summer, Congress decided to eliminate $1.1 billion that have been allocated to fund public broadcasting for the next two years.”\n\n\tOliver took on how Republicans have attacked public media since almost the moment that President Johnson first signed the law putting the CPB into existence, and he explained how criticism of a “liberal bias” inside public media is really about something else: “there can be a good faith debate over bias in the media, liberal or otherwise, but I’ll point out that a lot of the time, what conservatives claim as ‘liberal bias’ is often just things like showing there’s a long history of racism in America, or that gay people exist — making it hard to interpret those criticisms as anything other than bigotry. And yet, arguments like those just got used to justify zeroing out the entire budget of the CPB.”\n\t\n\n\tOliver also noted the irony that by cutting budgets, local stations will now have to rely more on national content coming out of major markets like New York, instead of producing vital local community programming. “The irony is, the more local stations budgets are slashed, the more they may come to rely on programming produced in those urban echo chambers. As the executive director of a station in California said, the local stuff that’s so important to people is probably the stuff that will go away.”\n\n\tOliver noted that public radio and TV stations have been behind vital local investigative reporting in areas where there are few other media outlets. And “Last Week Tonight” has relied on public reporting for pieces it has done on subjects such as HOAs, juvenile justice and lethal injection.\n\n\t“Public Media can be how critical information gets disseminated in communities with limited broadband or cell service,” he said. “Public Radio may be the only way to distribute missing and endangered persons alerts. It can also be crucial during an emergency like a hurricane.\n\n\t“Frankly, it’s always been a bit weird how little we fund public media, given how vital it can be. Here in the U.S., public media is a global outlier in how little federal funding it receives. Even before these cuts, federal spending amounted to less than $1.60 per capita — compared to countries like Norway, Sweden and the UK, which devote nearly $100 or more,” he added. “And research shows a positive correlation between the strength of public media systems and the health of democracies…. We’d ideally work on a long term fix for the way the CPB is funded. And instead of giving Congress the power to take its money away every two years, we’d institute some kind of tax or licensing fee that could reliably fund it. That is something people have been recommending since the CPB was first created. Sadly, we do not live in that universe right now and until we do, public media is in a dire situation now.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "John Oliver Launches ‘Last Week Tonight’ Auction, Including an Original Bob Ross Painting, to Support Public Broadcasting",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/IMG_3415-e1763361133923.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-17T07:10:53.000Z",
      "dateModified": "2025-11-17T07:10:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Inside the Governors Awards: Ariana Grande Meets EJAE, Tom Cruise Leaves Sydney Sweeney Speechless and Lily Tomlin Pays Tribute to Dolly Parton",
    "url": "https://variety.com/2025/film/awards/governors-awards-tom-cruise-sydney-sweeney-ariana-grande-1236583184/",
    "image": "https://variety.com/wp-content/uploads/2025/11/P1032VWD.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-17T08:04:15.000Z",
    "description": "\n\tThe Academy of Motion Picture Arts and Sciences presented Honorary Oscars to actor and producer Tom Cruise, choreographer and actor Debbie Allen and",
    "body": "\n\tThe Academy of Motion Picture Arts and Sciences presented Honorary Oscars to actor and producer Tom Cruise, choreographer and actor Debbie Allen and production designer Wynn Thomas at the 16th Governors Awards on Sunday at the Ray Dolby Ballroom in Hollywood.\n\n\tMusic icon and philanthropist Dolly Parton received the Jean Hersholt Humanitarian Award, which she accepted via a pre-recorded message.\n\n\n\tThe annual event, produced by Jennifer Fox, drew numerous filmmakers, stars and Oscar hopefuls. Director Guillermo del Toro attended alongside his “Frankenstein” cast members Jacob Elordi, Oscar Isaac and Mia Goth, as well as costume designer Kate Hawley and composer Alexandre Desplat. \n\t\n\n\tOther notable attendees I spotted included Noah Baumbach and Adam Sandler from “Jay Kelly,” Edward Berger and Colin Farrell from “Ballad of a Small Player,” and Kate Winslet with writer Joe Anders from “Goodbye June.” Directors Clint Bentley, Richard Linklater and Rian Johnson were present with cast members from their respective films “Train Dreams,” “Nouvelle Vague” and “Wake Up Dead Man.” “Wicked: For Good” stars Ariana Grande and Cynthia Erivo also charmed the room, along with Ethan Hawke from “Blue Moon” and Chloé Zhao from “Hamnet.”\n\n\tNotable absences included Timothée Chalamet from “Marty Supreme,” Paul Mescal from “Hamnet” and Russell Crowe from “Nuremberg.”\n\n\tLegendary production designer Wynn Thomas received his first Oscar, presented by Octavia Spencer. Widely recognized as the first African American production designer in film history, Thomas has worked with directors including Spike Lee, Tim Burton and Ron Howard on films such as “Do the Right Thing,” “Malcolm X,” “Hidden Figures” and “A Beautiful Mind.” He was also the first African American to join the Art Directors Guild and be nominated for an Art Directors Guild award.\n\t\n\n\tIn his acceptance speech, Thomas reflected on growing up poor and Black in Philadelphia, finding escape and purpose in books. He delivered the night’s biggest laugh with this line: “The local gangs looked down on me and called me a sissy. But that sissy grew up to work with some great filmmakers!”\n\n\t“Wicked for Good” star Cynthia Erivo had the honor of presenting an Honorary Oscar to choreographer and actor Debbie Allen, whom she affectionately calls, “Auntie.”\n\n\tAllen spotted Cruise in the audience and couldn’t resist a playful nod to his iconic “Risky Business” moment. “Honey,” she teased, “we loved when you slid out in those tightie-whities.” The crowd roared as Allen leaned into the nostalgia, reminding everyone why Cruise remains one of Hollywood’s most enduring showmen.\n\n\tThe Honorary Award, according to the Academy, is given “to honor extraordinary distinction in lifetime achievement, exceptional contributions to the state of motion picture arts and sciences, or outstanding service to the Academy.”\n\n\tThe Jean Hersholt Humanitarian Award, also an Oscar statuette, is awarded to “an individual in the motion picture arts and sciences whose humanitarian efforts have brought credit to the industry by promoting human welfare and contributing to rectifying inequities.”\n\n\tThe 2024 Governors Awards ceremony honored Quincy Jones (posthumously), the first Black producer to be nominated for best picture; legendary casting director Juliet Taylor; screenwriter and director Richard Curtis; and longtime James Bond producers Michael G. Wilson and Barbara Broccoli.\n\n\tAs usual, the un-televised ceremony delivered a mix of heartfelt speeches, star-studded reunions and candid moments that viewers at home will never see. Here are the 10 most memorable highlights from inside the room.\n\n\tAriana Grande Takes a Photo with EJAE, the Voice Behind “Golden”\n\n\tAriana Grande had one of the night’s most charming cross-generational interactions when she took a photo with EJAE, the singer behind “Golden,” the biggest hit of the year and a leading contender in the original song race. She also posed with singer-songwriter Aiyana-Lee, who sings and appears in Spike Lee’s “Highest 2 Lowest.” The exchange delighted nearby attendees — and showed how the Governors Awards uniquely blends music, film and rising talent.\n\t\n\n\tTom Cruise’s Honorary Oscar — and the Moment Sydney Sweeney Froze\n\n\tTwo-time best director winner Alejandro González Iñárritu presented Tom Cruise with his Honorary Oscar, calling him an “Amores Perros” superfan and praising him as “the embodiment of movies.” Iñárritu is directing Cruise in an as-yet-untitled Warner Bros. film slated for 2026.\n\n\tWatching Cruise at that moment, I couldn’t help but think of Paul Newman’s trajectory — when he received an Honorary Oscar and then won competitively the following year for “The Color of Money” (1986), which co-starred a young Cruise.\n\n\tEarlier, Sydney Sweeney experienced her own movie-star shockwave. When Cruise approached, she froze.\n\n\t“Have you ever met him?” I asked.\n\n\t“No, never,” she said.\n\n\t“Go say hi.”\n\n\t“I don’t even know what to say.”\n\n\tEarlier in the evening, Andra Day — a clear Cruise superfan — adjusted his undone button mid-conversation. The movie-star aura remains undefeated.\n\n\tWill Arnett Kicks Things Off, Andra Day Brings the House Down\n\n\tWill Arnett, star of Bradley Cooper’s third feature as a director, “Is This Thing On?,” set the tone with a loose, deadpan introduction: “You might know me from my storied film career — and the story is thanks to Bradley Cooper, he finally made a good one, huh?” Arnett then handed things over to co-star Andra Day, who performed a soulful cover of Dolly Parton’s “Jolene” immediately after Parton’s pre-recorded acceptance speech, earning huge applause from the room.\n\n\tAustin Butler Chats With Jacob Elordi and Walks With Josh O’Connor\n\n\tBetween greetings and photo ops, Austin Butler found himself playing unofficial usher. The “Elvis” actor appeared to point “Wake Up Dead Man” star Josh O’Connor to his seat before chatting with Jacob Elordi. The “Frankenstein” star also squeezed in conversations with Jennifer Lopez, there to support her film “Kiss of the Spider Woman,” and the cast of Cannes darling “Sentimental Value,” including Renate Reinsve, Elle Fanning and Inga Ibsdotter Lilleaas.\n\n\tTom Cruise’s Speech Leaves Wagner Moura Ready to Shoot\n\n\t“The Secret Agent” star Wagner Moura was deeply moved by Tom Cruise’s career reel and speech.“I really want to go make a movie right now,” he told me afterward, calling Cruise’s tribute “pure fuel.”\n\t\n\n\tThe Room So Star-Packed You Couldn’t Walk Straight\n\n\tAt one point, I found myself surrounded by Leonardo DiCaprio, Regina Hall, Benicio Del Toro, Jennifer Lopez, Ted Sarandos, Hailee Steinfeld, Rian Johnson, Mark Hamill, Sydney Sweeney — and Cruise himself. Navigating the room became an Olympic sport but what a room to be in.\n\n\tLily Tomlin’s Wild and Wonderful Dolly Parton Tribute\n\n\tComedy legend Lily Tomlin received a standing ovation before launching into a hilariously meandering, heavily improvised 15-minute introduction for Dolly Parton. After sharing that she has double-vision issues, she reminisced about pajama-party sleepovers with Jane Fonda and Parton while making their 1980 comedy classic “9 to 5,” joking, “Can you picture Brando inviting Pacino and Duvall over for a sleepover?”\n\n\tHalfway through, producers tried to roll Parton’s pre-taped speech — prompting Tomlin to pause and ask whether she was being gently nudged offstage.\n\n\tAn “Uncut Gems” Reunion\n\n\tAdam Sandler caught up with his “Uncut Gems” directors Benny and Josh Safdie, who were supporting their respective new films as individual directors: “The Smashing Machine” and “Marty Supreme.” The moment prompted a flurry of table-hopping from filmmakers eager to greet them.\n\n\tLooking Forward to “Project Hail Mary”\n\n\tPhil Lord and Christopher Miller don’t have a movie this year, and were at the Governors Awards as guests. Still, they teased scarce details of their Ryan Gosling sci-fi adventure, “Project Hail Mary,” set for release in March. “Ryan is very emotional in it. Surprisingly emotional,” Miller said. Rumors have been making their way around the town that the film is excellent, but the pair aren’t “picture locked” yet.\n\n\tA Menu for the Stars\n\n\tGuests dined on smoked salmon Oscar matzahs; aged Parmesan; beet and truffle mushroom hummus; avocado purée with house-made lavosh; steak frites with roasted filet mignon; Café de Paris butter; French fries; and roasted Brussels sprouts. Dessert featured an espresso chocolate bonbon, raspberry linzer cookie and caramelized lemon tart, paired with La Clarté de Haut-Brion 2021, Le Clarence de Haut-Brion 2015 and Champagne Lallier R.021.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Inside the Governors Awards: Ariana Grande Meets EJAE, Tom Cruise Leaves Sydney Sweeney Speechless and Lily Tomlin Pays Tribute to Dolly Parton",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/P1032VWD.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-17T08:04:15.000Z",
      "dateModified": "2025-11-17T08:04:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘We Believe You’ Sweeps Seville European Film Festival as ‘DJ Ahmet,’ ‘All That’s Left of You’ Also Score Major Wins",
    "url": "https://variety.com/2025/film/global/we-believe-you-seville-european-film-festival-awards-2025-1236583454/",
    "image": "https://variety.com/wp-content/uploads/2025/11/WE-BELIEVE-YOU.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-17T10:49:04.000Z",
    "description": "\n\tBelgian courtroom drama “We Believe You” swept the 22nd Seville European Film Festival, taking the Golden Giraldillo for best film plus two further ",
    "body": "\n\tBelgian courtroom drama “We Believe You” swept the 22nd Seville European Film Festival, taking the Golden Giraldillo for best film plus two further Official Selection prizes as the Andalusian event wrapped its Nov. 7-15 edition.\n\n\tThe debut feature by co-directors Charlotte Devillers and Arnaud Dufeys which bowed in the Berlinale’s new Perspectives strand – also scooped best screenplay and best actress for Myriem Akheddiou, confirming its status as one of the year’s European discoveries.\n\t\n\n\tSet almost entirely inside a Belgian courthouse and anchored by a near hour-long custody hearing played in real time, the film centers on Alice, a mother fighting to protect her children from their father in a system that keeps shifting scrutiny back onto her.\n\n\n\tSold by The Party Film Sales\n\n\tProduced by Belgium’s Makintosh Films, “We Believe You” is handled worldwide by Paris-based The Party Film Sales, which is aiming to parlay its Berlin and Seville profile into an autumn festival and awards run. In Spain, it will be co-distributed by arthouse labels Filmin and Karma Films.\n\n\tThe Seville jury – presided over by veteran producer and former Edinburgh Film Festival head Lynda Myles and including U.S. executive Bonnie Voland, Spanish writer-director Laura Hojman and exhibitor Nacho Martínez-Useros – hailed the film’s courage in turning a procedural custody hearing into a collective reckoning. Devillers and Dufeys’ script was also praised for building tension from minute gestures and silences while gradually exposing the weight of the trauma behind the case. Akheddiou’s performance as Alice was cited for its blend of restraint and raw emotion, with the jury singling out a turn that “clings” to the viewer and carries the film.\n\t\n\n\t“We Believe You” also shared Seville’s Aamma Women in Focus Award, handed out by Spain’s association of women in the audiovisual sector, in a tie with “The Girls We Want,” French filmmaker Prïncia Car’s Marseille-set summer-camp drama, which played in Seville’s Alumbramiento sidebar after a Directors’ Fortnight premiere at Cannes.\n\n\t“DJ Ahmet”: a coming-of-age dramedy\n\n\tProduced by After Hours Production and sold by France’s SND, Car’s debut uses a mostly non-professional teen cast to explore desire, power and masculinity in a working-class neighborhood.The festival’s Grand Jury Prize went to “DJ Ahmet,” the feature debut of North Macedonian director Georgi M. Unkovski.\n\n\tA European co-production handled by Lyon and Berlin-based Films Boutique, the coming-of-age dramedy follows a 15-year-old boy in a conservative rural community who discovers electronic music. Seville also handed “DJ Ahmet” the best actor award for newcomer Arif Jakup, praised for a fresh, unforced performance that balances awkwardness and budding self-confidence.\n\n\tBest director honors went to U.S. filmmaker Cherien Dabis, of Palestinian descent, for “All That’s Left of You,” a decades-spanning saga that she writes, directs and co-stars in. Handled internationally by The Match Factory, the film follows three generations of a Palestinian family from 1948 to 2022. The jury lauded Dabis’ “ambitious direction” and “sensitive gaze on trauma.”\n\n\tOn the craft side, Daniel Vidal Toche’s debut “The Anatomy of the Horses” (“La anatomía de los caballos”) – a co-production with Andalusian outfit Playa Chica – scored a double win, taking best cinematography for Angello Faccini and best production design for Juan Pablo Garay.\n\n\tA time-bending exploration of revolution and a modern equivalent, the film drew plaudits for dense, poetic imagery and a ritual-inflected visual universe that links landscape, myth and memory.\n\n\tSwiss hospital thriller “Late Shift,” written and directed by Petra Volpe, took the editing award for Hansjörg Weissbrich. Switzerland’s submission for the international feature Oscar, the film uses long takes and tight cutting to maintain tension while preserving a human core, according to reviews.\n\t\n\n\n\n\t\n\n\t\t\t\t\tDJ Ahmet\n\t\t\t\t\t\t\t\t\t“DJ Ahmet” (Courtesy of Cinema Futura)\n\t\n\n\n\n\tPuerta América encouraging international feature race\n\n\tIn Seville’s Puerta América Award, which spotlights titles representing their countries in the international feature race, the jury opted for Joachim Trier’s Norwegian family drama “Sentimental Value.”\n\n\tWinner of this year’s Cannes Grand Prix, produced by Mer Film and sold internationally by MK2 Films, the movie follows two sisters reconnecting with their estranged, once-feted filmmaker father as he attempts a late-career comeback.  \n\n\tBeyond Seville’s main competition, in the Embrujo sidebar (formerly Las Nuevas Olas), Franco-Egyptian filmmaker Namir Abdel Messeeh’s autofiction “Life After Siham,” which offers a film-buff journey through memory, took best film.\n\n\tMeanwhile, the European Film Academy selection’s Audience Award went to French-Belgian drama “Little Amélie,” adapted from Amélie Nothomb’s childhood-in-Japan memoir “The Character of Rain.”\n\n\n\n\t\n\n\t\t\t\t\t‘Sentimental Value’\n\t\t\t\t\t\t\t\t\tKasper Tuxen / Mubi\n\t\n\n\n\n\tUnderlining Seville’s ambitions\n\n\tThis year’s Giraldillos of Honor, the event’s tribute, underlined Seville’s ambition to sit at the crossroads of European film history and its present. The festival paid tribute to four heavyweights: Juliette Binoche, Costa-Gavras, Jim Sheridan and local hero Alberto Rodríguez. \n\n\tRodríguez took a front-row role at this year’s edition, receiving his Giraldillo of Honor in the opening-night gala – a tribute not just to his own career but to the generation that kick-started the so-called Nuevo Cine Andaluz. The director of “Marshland,” “Grupo 7” and “Prison 77″ framed the accolade as a “collective” award for the filmmakers who began shooting in the ‘90s on the periphery of the Spanish industry and turned Seville into a production hub. \n\n\tThe festival doubled down on that salute by showcasing his new thriller “Los tigres” and part of his Movistar Plus+ Original series “The Anatomy of a Moment” in Special Screenings, underlining Rodríguez’s status as the city’s most influential contemporary filmmaker and a key bridge between local talent and Spain’s national industry.\n\n\tThat role is shared with legacy with Rafael Cobos, Rodríguez’s long-time co-writer, now on the ground in Seville with his feature directing debut, “Golpes.” Backed by Galicia’s Vaca Films and co-produced with France’s Playtime, the 1980s-set thriller world-premiered in competition at Valladolid’s Seminci before bowing at Seville, the film walking off at Seville with the Juan Antonio Bermúdez Award for best fiction feature in Panorama Andaluz sidebar.\n\t\n\n\tSeville’s Industry Edge\n\n\tOn the industry side, Seville built on this star momentum with a reinforced Frame Sevilla program that helped turn the event into a genuine fall market-magnet. Frame hosted more than 30 activities – roundtables, masterclasses, pitching sessions, workshops and targeted networking – pulling in a broad mix of producers, sales agents, broadcasters and streamers from across Europe.\n\n\tTeaming with the European Film Promotion, Seville hosted Future Frames, giving four emerging directors a second platform after Karlovy Vary. The festival also sealed a strategic alliance with RTVE as its public broadcaster partner. \n\n\tThat professional footprint will extend beyond the closing night: Seville now rolls straight into the return of the European Film Academy nominations ceremony at the Real Alcázar on Nov. 18, cementing the city’s repositioning as a key European hub where red-carpet prestige, talent discovery and dealmaking happen within the same landscape.\n\n\tA full list of winners at the 22th Seville European Film Festival: \n\n\tOFFICIAL SELECTION\n\n\tGiraldillo de Oro Award for Best Film\n\n\t“We Believe You,”  Charlotte Devillers, Arnaud Dufeys\n\n\tGrand Jury Award\n\n\t“DJ Ahmet,” Georgi M. Unkovski\n\n\tPuerta América Award\n\n\t “Sentimental Value,” Joachim Trier\n\n\tDirection\n\n\tCherien Dabis, “All That’s Left of You”\n\n\tScreenplay Charlotte Devillers, Arnaud Dufeys, “We Believe You”\n\n\tActress\n\n\t Myriem Akeddiou, “We Believe You”\n\n\tActor\n\n\tArif Jakup, “DJ Ahmet”\n\n\tEditing\n\n\tHansjörg Weißbrich, “Late Shift”\n\n\tCinematography\n\n\tAngello Faccini, “La anatomía de los caballos”\n\n\tArt Direction\n\n\tJuan Pablo Garay, “La anatomía de los caballos”\n\n\tOFFICIAL SELECTION SHORT FILMS\n\n\tLive Action\n\n\t“In Her Arms,”  Roman Volosevych\n\n\tAnimation\n\n\t“The Bird from Within,” Laura Anahory\n\n\tEMBRUJO\n\n\tBest Film Award\n\n\t“Life After Siham,” Namir Abdel Messeeh \n\n\tRAMPA\n\n\tBest Film Award\n\n\t“My Father’s Shadow,” Akinola Davies Jr.\n\n\tALUMBRAMIENTO\n\n\tBest Film Award\n\n\t“Renovation,” Gabriele Urbonaitè \n\n\tPANORAMA ANDALUZ\n\n\tJuan Antonio Bermúdez Best Film Award\n\t\n\n\t“Golpes,” Rafael Cobos\n\n\tBest Documentary Award\n\n\t“Tiempo entre olivos,” Fany de la Chica\n\n\tJury Special Mention\n\n\t“No sea tu falta,” Moisés Salama\n\n\tRosario Valpuesta Best Short\n\n\t“Allí, lejos de aquí,” Pedro Gondi\n\n\tRosario Valpuesta Special Award for Artistic Contribution\n\n\t“Las desqueridas,” Charlie García Villalba, Gonzalo Ruiz Esteban\n\n\tOTHER PRIZES\n\n\tASECAN JURY\n\n\tBest Screenplay for feature film (Ex aequo)\n\n\tFernando Navarro, Rafael Cobos, “Golpes”\n\n\tMauricio Angulo, Julio Muñoz, “Los pinceles de la baronesa”  \n\n\tBest Screenplay for short film (Ex aequo)\n\n\tPablo Cueto, “Acción, figuración”\n\n\tÁlvaro Amate, Jaime Tigeras, “Discordia”\n\n\tAC/E Best Director of a Spanish Feature\n\n\t“Els mals noms,” Marc Ortiz \n\n\tAAMMA Women in Focus Award (Ex aequo)\n\n\t“We Believe You,” Charlotte Devillers, Arnaud Dufeys “The Girls We Want,” Prïncia Car\n\n\tQueer Ocaña Award\n\n\t“Els mals noms,” Marc Ortiz\n\n\tCinéfilos del Futuro Award\n\n\t“Bella,” Manuel H. Martín, Amparo Martínez Barco\n\n\tEuropa Júnior Award\n\n\t“Falcon Express,” Benoît Daffis, Jean-Christian Tassy\n\n\tUNIVERSITY OF SEVILLE EUROPEAN FICTION FILM-SCREENWRITING AWARDS\n\n\tFirst Prize\n\n\t“El infinito tiene hambre,” Alejandro Ruiz Padín\n\n\tSecond Prize\n\n\t“Nadie quiere enterrarte,” Matías García Martín\n\n\tAudience Award for Best Film in the EFA Selection\n\n\t“Little Amélie,” Maïlys Vallade, Liane-Cho Han\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘We Believe You’ Sweeps Seville European Film Festival as ‘DJ Ahmet,’ ‘All That’s Left of You’ Also Score Major Wins",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/WE-BELIEVE-YOU.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-17T10:49:04.000Z",
      "dateModified": "2025-11-17T10:49:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Easy Girl’: Hille Norden’s Buzzy Debut, on Trauma and Friendship, Competes at Tallinn Black Nights",
    "url": "https://variety.com/2025/film/global/easy-girl-hille-hille-norden-tallinn-black-nights-afm-1236583439/",
    "image": "https://variety.com/wp-content/uploads/2025/11/EASY-GIRL.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-17T10:11:34.000Z",
    "description": "\n\tGerman writer-director Hille Norden makes her debut with “Easy Girl,” a candy-colored, flamboyant and deeply personal film about trauma, friendship ",
    "body": "\n\tGerman writer-director Hille Norden makes her debut with “Easy Girl,” a candy-colored, flamboyant and deeply personal film about trauma, friendship and survival. Its international sales repped by Reason8 at the American Film Market, the film will have its international premiere in the First Feature section at Tallinn Black Nights Film Festival (PÖFF). \n\n\tWritten and directed by Norden, whose screenplay was shortlisted for the German Script Award in 2022, “Easy Girl” follows the story of Nore, a free-spirited femme fatale in her mid-twenties who was the victim of sexual assault as a girl. When she reunites with childhood schoolmate Jonna a decade later, their friendship becomes a journey through desire, pain and healing.   \n\t\n\n\tNewcomer Dana Herfurth (“The Disappearance of Josef Mengele”) stars as Nore, with Luna Jordan (“Euphorie”) playing the reserved medical student Jonna. \n\n\n\tWhat begins as a haze of alcohol, cigarette-fuelled hedonistic parties gradually shifts into a painful excavation of memory, as Jonna starts to see through Nore’s confident surface and uncovers the wounds that fuel her reckless pursuit of sex. \n\n\tNorden’s palette is playful and bright, the lavish, sexy dresses which Nore sews for their nights out reflecting both her vitality and her vulnerability.   \n\n\tHer goal, she tells Variety, is to show that beauty, pain and humor can coexist in stories about survival and self-definition.  \n\n\t“I wanted to make a film that, wherever there is space for it, is fun and entertaining, so that, even though the topic is sinister, it is wrapped in something nice. \n\t\n\n\t“I don’t believe you can turn shit into gold,” she adds. “If you look at gruesomeness and paint it with glitter, the gruesomeness doesn’t disappear. But you added something beautiful. And that makes it a little bit easier to deal with it. This is what I did in my life. And this is what I did in my movie.”\n\n\tThat balance between beauty and brutality runs through the film. “Beauty is next to the abyss,” Norden reflects. “And violence is very close to happiness. This is also why Nore [as a survivor of trauma] continues mixing things up: she constantly confuses love with violence. Both of those things are very close: it’s a survival mechanism.” \n\n\t“Easy Girl” revisits the “Lolita” archetype from a distinctly female perspective, reframing the notions of desire, consent and agency, leaving no doubt that for her sex with a female child, whatever the circumstances, is abuse.   \n\n\tMirroring the messy, non-linear process of healing, the film moves back and forth between past and present, between reality and Nore’s memories, highlighting the grey zones of trauma and recovery.   \n\n\t“I wanted to show that you can talk about it and nothing happens: You can have a boyfriend, you can work, you can be a filmmaker. You can be anything. And there’s no shame in having survived sexual violence,” she says. “I know how it feels to be so very ashamed of it. But it actually makes no sense. And I believe that the shame that I used to feel was the shame of the perpetrator.” \n\n\tThat theme of self-acceptance lies at the film’s emotional core, an inner reckoning that marks the turning point when Nore starts to love herself and allows others to love her. “We [survivors] believe that it’s very hard for others to love us with the traces of abuse on us.  \n\n\t“The last thing you want to do is say, ‘Yeah, I’m good the way I am because I’m shaped by somebody breaking my will,’” she says. “But eventually you realize you’re not so much shaped by that incident, but by your choices. And it’s just very hard to unlearn that violence is not love. But it is possible. Those wounds can surely be healed.” \n\n\tLooking ahead, Norden is developing two fiction projects: one exploring how love and intimacy have evolved over the past two decades amid shifting gender dynamics, and another born of her collaboration with the German military, aimed at bridging the divide between civilian and military perspectives in Germany. \n\t\n\n\t“Easy Girl,” which bowed at Filmfest Hamburg in September under the title “Smalltown Girl,” is produced by Leitwolf Filmproduktion and Kinescope Film, with ZDF/Das Kleine Fernsehspiel as co-producer.\n\n\tThe film has its international premiere at Tallinn Black Nights on Nov. 18.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Easy Girl’: Hille Norden’s Buzzy Debut, on Trauma and Friendship, Competes at Tallinn Black Nights",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/EASY-GIRL.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-17T10:11:34.000Z",
      "dateModified": "2025-11-17T10:11:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Justin Bieber Hurts Ribs in Electric Skateboard Fail",
    "url": "https://www.tmz.com/2025/11/16/justin-bieber-skateboard-injury/",
    "image": "https://imagez.tmz.com/image/8e/16by9/2025/11/16/8e9a988f186a418fb9cbd335357eaeba_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-17T00:09:22.000Z",
    "description": "\n    \n                    \n                          Justin Bieber\n                          From Dropping Hits to Hips\n                          ... ",
    "body": "\n    \n                    \n                          Justin Bieber\n                          From Dropping Hits to Hips\n                          ... Singer Wipes Out on Skateboard\n                      \n                  \n                        Published November 16, 2025 4:09 PM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Old man Bieber? Justin's age may finally be catching up to him ... he revealed a wipeout on his skateboard left him in serious pain.\n      \n    \n          The 31-year-old pop star complained, \"My ribs hurt so f***ing bad, bro,\" during a 4-hour Twitch livestream Thursday, where he explained he had a rough landing on his hip after tumbling from his Onewheel electric skateboard.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          He added, \"That s***, bro, is hurting me bad, bro. I'm trying to play it cool, bro. This s*** is f***ing with me.\"\n      \n\n          According to the \"Peaches\" singer, he can't do hardly anything without feeling pain from the injury -- that includes singing, and even laughing.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          But he's a trooper! He pushed through a live rehearsal for the 2026 Coachella Music Festival regardless.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Thankfully the festival isn't until April, so he should be all healed up by then.\n      \n    \n          Feel better, Justin!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Justin Bieber\n              \n                          \n                Celebrity News\n              \n                          \n                Music\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Justin Bieber Hurts Ribs in Electric Skateboard Fail",
      "image": [
        "https://imagez.tmz.com/image/8e/16by9/2025/11/16/8e9a988f186a418fb9cbd335357eaeba_xl.jpg"
      ],
      "datePublished": "2025-11-17T00:09:22.000Z",
      "dateModified": "2025-11-17T00:09:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Guess Who This Hard-Working Actor Is!",
    "url": "https://www.tmz.com/2025/11/16/guess-who-hard-working-actor/",
    "image": "https://imagez.tmz.com/image/72/16by9/2025/11/12/72b220e44a5748ceae4b57c6afd041e9_xl.png",
    "tag": "Entertainment",
    "date": "2025-11-16T20:00:29.000Z",
    "description": "\n    \n                    \n                          Guess Who\n                          This Hard-Working Actor Is!\n                      \n          ",
    "body": "\n    \n                    \n                          Guess Who\n                          This Hard-Working Actor Is!\n                      \n                  \n                        Published November 16, 2025 12:00 PM PST\n                                                                            \n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          Some of the biggest celebs out there really give 110% to their projects ... can you guess who this hard-working actor is?\n      \n    \n          We caught up with this guy while he was signing autographs for a bunch of his adoring fans in New York City, and he dished about linking up with Patrick Mahomes' coach while preparing to star in a show about a football player ... any guess which \"Powers\"-ful character it is?\n      \n    \n          If we could offer him any advice about looking like a legit NFL star -- we'd just tell him to keep running, man!\n      \n      \n              \n          \n                          \n                Guess Who\n              \n                          \n                TMZ Sports\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Guess Who This Hard-Working Actor Is!",
      "image": [
        "https://imagez.tmz.com/image/72/16by9/2025/11/12/72b220e44a5748ceae4b57c6afd041e9_xl.png"
      ],
      "datePublished": "2025-11-16T20:00:29.000Z",
      "dateModified": "2025-11-16T20:00:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sophie Grégoire Seemingly Reacts to Ex Justin Trudeau’s Katy Perry Romance",
    "url": "https://www.tmz.com/2025/11/16/sophie-gregoire-talks-justin-trudeau-and-katy-perry/",
    "image": "https://imagez.tmz.com/image/8a/16by9/2025/11/16/8a2de49c45164fcea8ecc42c71c114c6_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-16T23:32:01.000Z",
    "description": "\n    \n                    \n                          Sophie Grégoire\n                          Seemingly Breaks Silence On Ex Justin Trudeau\n         ",
    "body": "\n    \n                    \n                          Sophie Grégoire\n                          Seemingly Breaks Silence On Ex Justin Trudeau\n                          ... And His New Love, Katy Perry\n                      \n                  \n                        Published November 16, 2025 3:32 PM PST\n                                                                            \n      \n    \n      \n        \n                    \n                  \n      \n                    Arlene Is Alone\n          \n    \n          Sophie Grégoire kept it classy and cordial when asked about her ex Justin Trudeau and his new love Katy Perry ... suggesting while she might be hurt, she's not putting her feelings over her family.\n      \n    \n          She told Arlene Dickinson on the \"Arlene Is Alone\" podcast, \"We're all human beings and stuff affects us,\" admitting she allows herself to feel all the normal emotions that may crop up when things don't go her way, but ultimately she decides how she responds to those emotions.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          She explained, \"The woman I want to become through this is my decision.”\n      \n\n          Sophie added, \"We have separate lives, but we have one family life.\"\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          The former TV host and the former Prime Minister of Canada have 3 children together -- 18-year-old Xavier, 16-year-old Ella-Grace, and 11-year-old Hadrien.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Two years after her split from Justin, 53, he started seeing Katy, 41. The new power couple made their relationship official at the pop singer's 41st birthday in October.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Katy Perry\n              \n                          \n                Justin Trudeau\n              \n                          \n                Celebrity News\n              \n                          \n                Relationships\n              \n                          \n                Dating\n              \n                          \n                Music\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sophie Grégoire Seemingly Reacts to Ex Justin Trudeau’s Katy Perry Romance",
      "image": [
        "https://imagez.tmz.com/image/8a/16by9/2025/11/16/8a2de49c45164fcea8ecc42c71c114c6_xl.jpg"
      ],
      "datePublished": "2025-11-16T23:32:01.000Z",
      "dateModified": "2025-11-16T23:32:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jeffrey Epstein's Brother Says 'Bubba' From Trump Email Isn't Bill Clinton",
    "url": "https://www.tmz.com/2025/11/16/jeffrey-epstein-brother-bubba-not-bill-clinton/",
    "image": "https://imagez.tmz.com/image/bb/16by9/2025/11/16/bbf45efd47a840ca849a2221fb1fe4a5_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-17T01:33:04.000Z",
    "description": "\n    \n                    \n                          Jeffrey Epstein's Brother\n                          Bubba Wasn't Bill Clinton!!!\n                ",
    "body": "\n    \n                    \n                          Jeffrey Epstein's Brother\n                          Bubba Wasn't Bill Clinton!!!\n                          It's Another Guy\n                      \n                  \n                        Published November 16, 2025 5:33 PM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Mark Epstein, Jeffrey Epstein's brother, is clarifying remarks he made about photos of Donald Trump \"blowing Bubba\" in a released email, saying they had nothing to do with Bill Clinton.\n      \n    \n          He told The Advocate, “The reference to ‘Bubba’ in this correspondence is not, in any way, a reference to former President Bill Clinton.\"\n      \n    \n          He went on to describe the infamous \"Bubba\" as “a private individual who is not a public figure.\"\n      \n\n          Furthermore, Mark told the outlet the attention surrounding the emails is unwarranted, as \"they were simply part of a humorous private exchange between two brothers and were never meant for public release or to be interpreted as serious remarks.”\n      \n    \n          Regardless, House Republican leaders are reportedly planning to vote on legislating the full release of the Justice Department's files on Jeffrey, according to CBS.\n      \n    \n      \n        \n                    \n                  \n      \n                    2 Angry Men Podcast\n          \n    \n          On Harvey Levin's \"2 Angry Men\" podcast with Mark Geragos, the co-hosts suggested Trump is ruining his legacy with his reluctance to release the files. They -- like many people -- think his resistance makes it look like POTUS has something to hide.\n      \n    \n          Click here to listen to the full episode of the \"2 Angry Men\" podcast.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Jeffrey Epstein\n              \n                          \n                Donald Trump\n              \n                          \n                Mark Geragos\n              \n                          \n                Bill Clinton\n              \n                          \n                Harvey Levin\n              \n                          \n                Celebrity News\n              \n                          \n                Reality TV\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jeffrey Epstein's Brother Says 'Bubba' From Trump Email Isn't Bill Clinton",
      "image": [
        "https://imagez.tmz.com/image/bb/16by9/2025/11/16/bbf45efd47a840ca849a2221fb1fe4a5_xl.jpg"
      ],
      "datePublished": "2025-11-17T01:33:04.000Z",
      "dateModified": "2025-11-17T01:33:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'Law & Order' Actor George Pogatsia's Intense 911 Call After Stopping Abduction",
    "url": "https://www.tmz.com/2025/11/16/911-call-law-and-order-george-pogatsia/",
    "image": "https://imagez.tmz.com/image/a5/16by9/2025/11/16/a58db2c8d1d9412ebe8cf4df5569dbd3_xl.png",
    "tag": "Entertainment",
    "date": "2025-11-16T22:14:40.000Z",
    "description": "\n    \n                    \n                          'Law & Order' George Pogatsia\n                          Intense 911 Call of Real Life Attempted A",
    "body": "\n    \n                    \n                          'Law & Order' George Pogatsia\n                          Intense 911 Call of Real Life Attempted Abduction\n                      \n                  \n                        Published November 16, 2025 2:14 PM PST\n                                                                            \n      \n    \n      \n        \n                    \n                  \n      \n                    George Pogatsia\n          \n    \n          George Pogatsia's 911 call while chasing a suspected kidnapper is pure chaos ... he's panting, yelling, and feeding dispatch a real-time play-by-play of the unfolding incident.\n      \n    \n          TMZ, through George, obtained the audio from the November 1 scare in Jersey City Heights, NJ, and the urgency is immediate. Within seconds, the \"Law & Order\" actor can be heard mid-sprint shouting, \"Where you going, motherf****r!\"\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Between gasps, George tells the operator he saw a strange man lift a visibly intoxicated woman over his shoulder and try to walk off with her. He says he and his wife had just pulled up from dinner when they witnessed the disturbing scene outside their building.\n      \n\n          George says he ran toward them, yelling, \"Put her the f*** down!\" and according to him, that was enough to make the guy drop the woman and bolt into the night.\n      \n    \n          The call captures George trying to keep track of everyone as cops rush to the scene. He explains the woman is shaken but now with a male friend who arrived moments later, while emphasizing the suspect is still somewhere nearby.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          At one point, George makes it clear he's not going anywhere, telling dispatch, \"I'll wait here,\" so officers could pinpoint exactly where the confrontation took place.\n      \n    \n          We broke the story ... George later told us he just hopes the woman is okay and is grateful he happened to be there, and the newly surfaced 911 audio shows just how intense that moment really was.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                911 Call\n              \n                          \n                Celebrity News\n              \n                          \n                Fairly Legal\n              \n                          \n                Law & Order: Special Victims Unit\n              \n                          \n                Police\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Law & Order' Actor George Pogatsia's Intense 911 Call After Stopping Abduction",
      "image": [
        "https://imagez.tmz.com/image/a5/16by9/2025/11/16/a58db2c8d1d9412ebe8cf4df5569dbd3_xl.png"
      ],
      "datePublished": "2025-11-16T22:14:40.000Z",
      "dateModified": "2025-11-16T22:14:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]