[
  {
    "title": "Con Pederson, ‘2001: A Space Odyssey’ Special Effects Supervisor, Dies at 91",
    "url": "https://variety.com/2026/film/news/con-pederson-dead-2001-a-space-odyssey-1236624108/",
    "image": "https://variety.com/wp-content/uploads/2026/01/IMG_4827-e1767657684561.jpeg?crop=0px%2C93px%2C1491px%2C840px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-01-06T00:44:54.000Z",
    "description": "\n\tCon Pederson, one of four special effects supervisors on “2001: A Space Odyssey,” died Friday at the MPTF residence in Woodland Hills following comp",
    "body": "\n\tCon Pederson, one of four special effects supervisors on “2001: A Space Odyssey,” died Friday at the MPTF residence in Woodland Hills following complications from Alzheimer’s. He was 91. \n\n\tPederson was a fixture in the field of science fiction filmmaking, particularly thanks to his involvement on Stanley Kubrick’s “2001: A Space Odyssey” in 1968. Alongside three other special effects supervisors including Douglas Trumbull, Wally Veevers and Tom Howard, Pederson’s work led the director to his Oscar win for best visual effects in 1969. On set, Pederson ran the “war room,” where the VFX shots were planned, scheduled, tracked and evaluated. For each shot, anywhere from eight to ten elements were added to the original camera negative, an intricate process that took months.\n\t\n\n\tIn Michael Benson’s 2018 book “Space Odyssey,” the author quotes Trumbull as saying, “The film’s post-production process was epic in its complexity and Con was the smartest guy in the room.” He added that “‘2001’ absolutely would not have happened without Con.”\n\n\n\tAfter working on the film, Pederson went on to co-found pioneering computer animation company Robert Abel and Associates, where he worked as an animator and programmer alongside Bob Abel. Following the company’s closing, he continued as a creative lead at Metrolight Studios alongside Tim McGovern. \n\n\t“Con was a constant source of wisdom and knowledge,” said John Nelson, who met Pederson during his time at Robert Abel and Associates. “He was a Renaissance man who was both an artist and a technician. He could animate by hand or write computer programs to generate animations. Several people from Robert Abel’s went on to win Oscars for Visual Effects. I was lucky enough to be one of them.” \n\t\n\n\tBefore Pederson began his career in the film industry, he attended UCLA, where he majored in art and anthropology. During his time there, Pederson was hired at Disney after making student films. He was then drafted into the U.S. Army, where he worked with Wernher von Braun on rocket projects. Pederson went on to work at Graphic Films following his time, where he wrote and directed the 1964 film “To The Moon And Beyond” for the world’s fair. Kubrick saw the film, and thus hired Pederson to work on “2001: A Space Odyssey.”  \n\n\tOutside of work, he created crossword puzzles that were published across the New York Times, the Wall St. Journal and the Washington Post, and loved science fiction, hiking, sailing and collecting and building things with bricks he had collected from all over the country.\n\n\tPederson is survived by his wife Carole and his son Eric, stepchildren Tracey and Morgan and grandchildren Alex and Vivi.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Con Pederson, ‘2001: A Space Odyssey’ Special Effects Supervisor, Dies at 91",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/IMG_4827-e1767657684561.jpeg?crop=0px%2C93px%2C1491px%2C840px&resize=1000%2C563"
      ],
      "datePublished": "2026-01-06T00:44:54.000Z",
      "dateModified": "2026-01-06T00:44:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Oscar Predictions: Film Editing — Why This Category Remains Best Picture’s Strongest Tell",
    "url": "https://variety.com/lists/2026-oscars-best-film-editing-predictions/",
    "image": "https://variety.com/wp-content/uploads/2024/12/Benicio-del-Toro-One-Battle-After-Another.jpg?crop=0px%2C35px%2C900px%2C506px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-01-05T23:42:22.000Z",
    "description": "\n\t\t\n\n\t\n\tJan 5, 2026 3:42pm PT\t\n\t\n\n\t\n\tOscar Predictions: Film Editing — Why This Category Remains Best Picture’s Strongest Tell\n\t\n\n\n\n\t\t\t\n\t\t\t\n\t\n\t\t\t\t\t\t\n\n",
    "body": "\n\t\t\n\n\t\n\tJan 5, 2026 3:42pm PT\t\n\t\n\n\t\n\tOscar Predictions: Film Editing — Why This Category Remains Best Picture’s Strongest Tell\n\t\n\n\n\n\t\t\t\n\t\t\t\n\t\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t©Warner Bros/Courtesy Everett C\n\t\n\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\n\t\t\n\n\tVariety Awards Circuit section is the home for all awards news and related content throughout the year, featuring the following: the official predictions for the upcoming Oscars, Emmys, Grammys and Tony Awards ceremonies, curated by Variety chief awards editor Clayton Davis. The prediction pages reflect the current standings in the race and do not reflect personal preferences for any individual contender. As other formal (and informal) polls suggest, competitions are fluid and subject to change based on buzz and events. Predictions are updated every Thursday.\n\n\n\n\t\n\n\t\t\t\t\tGwyneth Paltrow in ‘Marty Supreme’\n\t\n\n\n\n\tOscars Best Film Editing Commentary (Updated Jan. 5, 2026): Since film editing became an Oscar category in 1934, its connection to the best picture race has been unmistakable. From 1981 through 2013, every best picture winner was also nominated for film editing, a remarkable 33-year streak that helped cement the category as one of the Academy’s most reliable predictors. Roughly two-thirds of best picture winners have gone on to win the editing Oscar.\n\n\tThat pattern has cracked only twice in the expanded best picture era. “Birdman” (2014) and “CODA” (2021) both won best picture without editing nominations.\n\n\tThis year’s editing race showcases radically different philosophies of cinematic rhythm. \n\n\t“Hamnet” and “Marty Supreme” represent one of the season’s most intriguing case studies, particularly because of the filmmakers’ hands-on approach. Josh Safdie and Chloé Zhao co-editing their own films places them in exceedingly rare company. Only three directors have ever won the Oscar for film editing — James Cameron for “Titanic,” Alfonso Cuarón for “Gravity” and Sean Baker for “Anora.” Others, including David Lean, the Coen brothers (working under the alias Roderick Jaynes) and Zhao herself, have previously earned editing nominations for films they directed.\n\n\tAnother crucial factor shaping the race is the long-standing bond between film editing and sound. Since 2013, no two Oscar categories have demonstrated a stronger statistical relationship, regardless of whether sound was split into editing and mixing or combined into a single award. During the split-sound era, films such as “Gravity,” “Mad Max: Fury Road,” “Dunkirk” and “Bohemian Rhapsody” swept both editing and sound. Even when the overlap was partial, the connection held. “Hacksaw Ridge” won editing and sound mixing in 2016, while “Ford v Ferrari” took editing and sound editing in 2019.\n\n\tThat relationship has loosened in recent years. “Everything Everywhere All at Once” (2022) won editing without a sound nom. “Oppenheimer” (2023) claimed editing but lost sound to “The Zone of Interest.” Last year, “Anora” won editing without a sound nod, while “Dune: Part Two” took home the statue.\n\n\tAgainst that backdrop, “F1” vrooms into the conversation as a potential disruptor. Fresh off a Critics Choice Award win for editing and powered by its commercial success and broad appeal, the high-octane racing drama has been registering beyond the craft branches. If its momentum carries through the guild phase, “F1” could position itself as a film testing the edges of a best picture nom as well.\n\n\tNOTE: All titles, release dates, studios and listed and credited artisans are subject to change, and are ultimately determined by the Academy.\n\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Neon\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\nwindow.addEventListener(\"message\",function(a){if(void 0!==a.data[\"datawrapper-height\"]){var e=document.querySelectorAll(\"iframe\");for(var t in a.data[\"datawrapper-height\"])for(var r,i=0;r=e[i];i++)if(r.contentWindow===a.source){var d=a.data[\"datawrapper-height\"][t]+\"px\";r.style.height=d}}});\n\n\n\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: 20th Century Studios\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\nwindow.addEventListener(\"message\",function(a){if(void 0!==a.data[\"datawrapper-height\"]){var e=document.querySelectorAll(\"iframe\");for(var t in a.data[\"datawrapper-height\"])for(var r,i=0;r=e[i];i++)if(r.contentWindow===a.source){var d=a.data[\"datawrapper-height\"][t]+\"px\";r.style.height=d}}});\n\n\n\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Eros Hoagland/Netflix\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\nwindow.addEventListener(\"message\",function(a){if(void 0!==a.data[\"datawrapper-height\"]){var e=document.querySelectorAll(\"iframe\");for(var t in a.data[\"datawrapper-height\"])for(var r,i=0;r=e[i];i++)if(r.contentWindow===a.source){var d=a.data[\"datawrapper-height\"][t]+\"px\";r.style.height=d}}});\n\n\n\t\t\n\t\n\t\n\n\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Oscar Predictions: Film Editing — Why This Category Remains Best Picture’s Strongest Tell",
      "image": [
        "https://variety.com/wp-content/uploads/2024/12/Benicio-del-Toro-One-Battle-After-Another.jpg?crop=0px%2C35px%2C900px%2C506px&resize=1000%2C563"
      ],
      "datePublished": "2026-01-05T23:42:22.000Z",
      "dateModified": "2026-01-05T23:42:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Oscar Predictions: Costume Design — The Memorable Fits of ‘Sinners’ and ‘Frankenstein’ Are Pulling Ahead in the Race",
    "url": "https://variety.com/lists/2026-oscars-best-costume-design-predictions/",
    "image": "https://variety.com/wp-content/uploads/2024/12/Sinners-Hair-and-Makeup.jpg?w=900&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-05T22:03:08.000Z",
    "description": "\n\t\t\n\n\t\n\tJan 5, 2026 2:03pm PT\t\n\t\n\n\t\n\tOscar Predictions: Costume Design — The Memorable Fits of ‘Sinners’ and ‘Frankenstein’ Are Pulling Ahead in the R",
    "body": "\n\t\t\n\n\t\n\tJan 5, 2026 2:03pm PT\t\n\t\n\n\t\n\tOscar Predictions: Costume Design — The Memorable Fits of ‘Sinners’ and ‘Frankenstein’ Are Pulling Ahead in the Race\n\t\n\n\n\n\t\t\t\n\t\t\t\n\t\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\tWarner Bros.\n\t\n\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\n\t\t\n\n\tVariety Awards Circuit section is the home for all awards news and related content throughout the year, featuring the following: the official predictions for the upcoming Oscars, Emmys, Grammys and Tony Awards ceremonies, curated by Variety chief awards editor Clayton Davis. The prediction pages reflect the current standings in the race and do not reflect personal preferences for any individual contender. As other formal (and informal) polls suggest, competitions are fluid and subject to change based on buzz and events. Predictions are updated every Thursday.\n\n\n\n\t\n\n\t\t\t\t\tFRANKENSTEIN. Mia Goth as Elizabeth in Frankenstein. Cr. Ken Woroner/Netflix © 2025.\n\t\t\t\t\t\t\t\t\tKen Woroner/Netflix\n\t\n\n\n\n\tOscars Best Costume Design Commentary (Updated Jan. 5, 2026): The best costume design race is beginning to crystallize, with a small cluster of films emerging as clear favorites among the Academy’s Costume Designers Branch. \n\n\tAt the moment, Critics Choice winner “Frankenstein” (Kate Hawley), “Sinners” (two-time winner Ruth E. Carter) and “Wicked: For Good” (last year’s winner Paul Tazewell) look like the safest bets, joined by “Hamnet” (Malgosia Turzanska, who also has “Train Dreams”), which continues to climb the charts as its overall profile strengthens. Each offers a distinct but branch-friendly appeal. Some from gothic re-imaginings and mythic world-building while others have meticulously rendered period detail, which is the kind of work costume designers have historically rallied behind.\n\n\tWith the BAFTA longlist set to be unveiled on Jan. 9 (which will include 10 titles), the assumption is that at least four of those titles will hold firm. That likely leaves only one or two nomination slots in play, setting up a familiar awards-season dilemma: legacy versus global sensibility. A legend like Colleen Atwood remains a presence, particularly with two high-profile contenders in “One Battle After Another” and “Kiss of the Spider Woman,” either of which could benefit from name recognition and career-long goodwill. On the international front, “Downton Abbey: The Grand Finale,” with costumes by Anna Mary Scott Robbins, represents the kind of refined, period-authentic craftsmanship BAFTA voters often embrace, while Consolata Boyle’s work on the period drama “Blue Moon” could appeal to Academy voters looking to honor classical elegance executed at the highest level.\n\n\tIn other news, the 28th Costume Designers Guild Awards added another data point to the conversation. Titles such as “One Battle After Another,” “Weapons,” “Avatar: Fire and Ash” and “Bugonia” all landed noms. Notably absent, however, was “The Testament of Ann Lee,” a reminder that CDG recognition, while influential, is not a prerequisite for Oscar success. The Academy has a long history of singling out a film that failed to register with the guild or didn’t get seen in time. \n\n\tNOTE: All titles, release dates, studios and listed and credited artisans are subject to change and are ultimately determined by the Academy.\n\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Universal Pictures\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\nwindow.addEventListener(\"message\",function(a){if(void 0!==a.data[\"datawrapper-height\"]){var e=document.querySelectorAll(\"iframe\");for(var t in a.data[\"datawrapper-height\"])for(var r,i=0;r=e[i];i++)if(r.contentWindow===a.source){var d=a.data[\"datawrapper-height\"][t]+\"px\";r.style.height=d}}});\n\n\n\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Searchlight Pictures\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\nwindow.addEventListener(\"message\",function(a){if(void 0!==a.data[\"datawrapper-height\"]){var e=document.querySelectorAll(\"iframe\");for(var t in a.data[\"datawrapper-height\"])for(var r,i=0;r=e[i];i++)if(r.contentWindow===a.source){var d=a.data[\"datawrapper-height\"][t]+\"px\";r.style.height=d}}});\n\n\n\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: ©Sony Pictures/Courtesy Everett\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\nwindow.addEventListener(\"message\",function(a){if(void 0!==a.data[\"datawrapper-height\"]){var e=document.querySelectorAll(\"iframe\");for(var t in a.data[\"datawrapper-height\"])for(var r,i=0;r=e[i];i++)if(r.contentWindow===a.source){var d=a.data[\"datawrapper-height\"][t]+\"px\";r.style.height=d}}});\n\n\n\t\t\n\t\n\t\n\n\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Oscar Predictions: Costume Design — The Memorable Fits of ‘Sinners’ and ‘Frankenstein’ Are Pulling Ahead in the Race",
      "image": [
        "https://variety.com/wp-content/uploads/2024/12/Sinners-Hair-and-Makeup.jpg?w=900&h=563&crop=1"
      ],
      "datePublished": "2026-01-05T22:03:08.000Z",
      "dateModified": "2026-01-05T22:03:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Emily in Paris’ Renewed for Season 6 at Netflix",
    "url": "https://variety.com/2026/tv/news/emily-in-paris-season-6-renewal-netflix-1236623844/",
    "image": "https://variety.com/wp-content/uploads/2026/01/EIP_501_UNIT_00468R.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-05T21:00:00.000Z",
    "description": "\n\tNetflix has renewed “Emily in Paris” for a sixth season.\n\n\tThe series stars Lily Collins as Emily Cooper, a marketing professional from the U.S. who",
    "body": "\n\tNetflix has renewed “Emily in Paris” for a sixth season.\n\n\tThe series stars Lily Collins as Emily Cooper, a marketing professional from the U.S. who moves to Paris for a new job opportunity — which eventually also moves her to Italy. The synopsis for Season 5, which premiered in December, reads, “Now the head of Agence Grateau Rome, Emily faces professional and romantic challenges as she adapts to life in a new city. But just as everything falls into place, a work idea backfires, and the fallout cascades into heartbreak and career setbacks. Seeking stability, Emily leans into her French lifestyle, until a big secret threatens one of her closest relationships. Tackling conflict with honesty, Emily emerges with deeper connections, renewed clarity, and a readiness to embrace new possibilities.”\n\t\n\n\tAlong with Collins, the cast includes Philippine Leroy-Beaulieu, Ashley Park, Lucas Bravo, Samuel Arnold, Bruno Gouery, William Abadie, Lucien Laviscount, Eugenio Franceschini, Thalia Besson, Paul Forman, Arnaud Binard, Minnie Driver, Bryan Greenberg and Michèle Laroque.\n\n\n\tSeason 5 debuted on the Netflix Top 10 in the No. 2 position with 13.5 milliion views in its first four days of streaming and held onto second place with 13.3 million views the following week.\n\n\t“Emily in Paris” was created by Darren Star, who serves as executive producer alongside Tony Hernandez, Lilly Burns, Andrew Fleming, Stephen Brown, Alison Brown, Robin Schiff, Grant Sloss and Joe Murphy. Collins is a producer. The series hails from Paramount Television Studios, Darren Star Productions and Jax Media.\n\t\n\n\tSee Netflix’s announcement of the Season 6 renewal below.\n\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Emily in Paris’ Renewed for Season 6 at Netflix",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/EIP_501_UNIT_00468R.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-05T21:00:00.000Z",
      "dateModified": "2026-01-05T21:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jack Black Regrets Turning Down ‘The Incredibles’; Rejected Offer to Voice Syndrome After Asking the Director for Rewrites: ‘Why Was I Being So Difficult?’",
    "url": "https://variety.com/2026/film/news/jack-black-rejected-the-incredibles-offer-syndrome-regrets-1236623756/",
    "image": "https://variety.com/wp-content/uploads/2026/01/jack.png?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-05T21:38:26.000Z",
    "description": "\n\tJack Black revealed during a Capital FM interview that turning down Pixar’s “The Incredibles” is the biggest regret of his acting career. The comedi",
    "body": "\n\tJack Black revealed during a Capital FM interview that turning down Pixar’s “The Incredibles” is the biggest regret of his acting career. The comedian was offered the chance to voice the movie’s villain role, Syndrome, but passed because he had never heard of director Brad Bird (his only previous credit at the time was 1999’s “The Iron Giant”) and wanted script rewrites. Black now counts “The Incredibles” among his favorite movies.\n\t\n\n\t“I was offered, and I do regret it, saying no… I was offered Syndrome in that fantastic movie ‘The Incredibles’ — one of my favorites of all time, by the way,” Black said. “And I said no because I was like, ‘Uhhh, [director] Brad Bird? Never heard of him!’ [I said to him], ‘This character that you’re offering me is like a villain, but he’s kinda one-dimensional. I’m interested but I’d like to see a rewrite. Will you add some dimensions to this character?’ And he was like, ‘Yeah, you’re done.'”\n\n\n\t“I learned a valuable lesson because when that movie came out, it was one of the best movies ever made,” Black added. “I was like, ‘Why was I being so difficult?'”\n\n\t“My Name Is Earl” star Jason Lee went on to voice Syndrome in “The Incredibles,” which won the Oscar for best animated feature and became one of Pixar’s most iconic originals. A sequel, “Incredibles 2,” opened in 2018 and grossed $1.2 billion at the worldwide box office. A third movie is now in development. \n\n\tBlack, meanwhile, would find his own animated movie success by voicing the lead role in DreamWorks Animations’ “Kung Fu Panda” and Bowser in the billion-dollar grossing “The Super Mario Bros. Movie.” The comedian is back as Bowser in the latter film’s sequel, “The Super Mario Galaxy Movie,” in theaters April 3.\n\t\n\n\tWatch Black’s full interview with Capital FM in the video below.\n\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jack Black Regrets Turning Down ‘The Incredibles’; Rejected Offer to Voice Syndrome After Asking the Director for Rewrites: ‘Why Was I Being So Difficult?’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/jack.png?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-05T21:38:26.000Z",
      "dateModified": "2026-01-05T21:38:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Women Cinematographers From ‘Sinners,’ ‘Song Sung Blue’ and ‘Wicked: For Good’ Could Make Oscar History",
    "url": "https://variety.com/2026/artisans/news/female-cinematographers-oscars-shortlist-1236623966/",
    "image": "https://variety.com/wp-content/uploads/2026/01/IMG_4014.jpeg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-05T23:54:00.000Z",
    "description": "\n\tThis is the first year that cinematography has been included in the Oscar shortlist, and on the list are such familiar names as Dan Laustsen, Guille",
    "body": "\n\tThis is the first year that cinematography has been included in the Oscar shortlist, and on the list are such familiar names as Dan Laustsen, Guillermo del Toro’s go-to DP, and Robbie Ryan, who works regularly with Yorgos Lanthimos.\n\n\tBut there’s a trend: three women made the cut, Autumn Durald Arkapaw (“Sinners”), Alice Brooks (“Wicked: For Good”) and Amy Vincent (“Song Sung Blue”).\n\n\n\tIn the history of the category, no woman has ever won the Oscar for cinematography, and only three women have ever been nominated: Rachel Morrison in 2018 for “Mudbound,” Ari Wegner in 2021 for “The Power of the Dog” and Mandy Walker in 2022 for “Elvis.”\n\t\n\n\tThis year, Arkapaw made history as the first female cinematographer to shoot on Imax 65mm and Ultra Panavision for “Sinners,” and looks like a front-runner. With a win, she would not only be the first womanto win the category, she would also be the first Filipina/African American to win an Oscar for cinematography.\n\n\tArkapaw and Coogler went out to the desert near Lancaster, Calif., and tested IMAX 35mm and 65mm, with Coogler showing a keen interest in showcasing the landscape — an idea inspired by Quentin Tarantino‘s “The Hateful Eight,” which was shot on 65mm film using Ultra Panavision 70mm. “We screened those tests at FotoKem and the headquarters of IMAX. After you see what you created, you can’t unsee that stuff,” Arkapaw said.\n\n\tEmotions were key to “Wicked” and its conclusion, “Wicked: For Good.” “The first movie would live in this effervescent daylight and the second film would be steeped in maturity and density and have a weight to it,” Brooks says. “As we were designing it, ‘Wicked: For Good’ has this handmade feel to it, but it also feels textured and raw and edgy.”\n\t\n\n\tBrooks used every color of the rainbow to light the movie. Each scene, color meant something. “Red is when you make the wrong choice. You see that in a lot in the governor’s mansion. Orange is the color of Elphaba’s transformation, and you see it with the flames and with ‘No Dood Deed.'” And blue, Brooks says is the color of love between the two. You first see in the Ozdust Ballroom surrounding and then you see it for the color of the moonlight in ‘For Good.”\n\n\tBut, it’s going to be a tough choice for voters to whittle down the field, given the levels of achievement on display. Among the familiar artisans on the shortlist are two-time Oscar nominee Seamus McGarvey for “Die My Love”; Łukasz Żal, also a two-time nominee, for “Hamnet”; Darius Khondji returns to the race looking for a third nomination with “Marty Supreme”; “One Battle After Another’s” Michael Bauman, who looks to be a front-runner for a nom, as does Oscar-winner Claudio Miranda for his work on “F1.” “All Quiet on the Western Front” Oscar-winner James Friend returns to the race with “Ballad of a Small Player.”\n\n\tNew to the Oscar campaign are David Chambille, who shot “Nouvelle Vague” in black and white on the streets of Paris; Kasper Tuxen’s interiors for “Sentimental Value,” which added to the secrets and untold emotions of the film’s main family; “Sirât,” in which Mauro Herce shot raves and majestic landscapes in the North African desert; Fabian Gamper’s work on “Sound of Falling,” which translates the generational trauma in the film; and “Train Dreams,” in which Adolpho Veloso, who just won the Critics Choice Award for best cinematography, let the magnificent landscape of the Pacific Northwest speak for itself.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Women Cinematographers From ‘Sinners,’ ‘Song Sung Blue’ and ‘Wicked: For Good’ Could Make Oscar History",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/IMG_4014.jpeg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-05T23:54:00.000Z",
      "dateModified": "2026-01-05T23:54:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Marketecture Media Raises $1 Million in Seed Funding From Top Ad-Biz Execs",
    "url": "https://variety.com/2026/digital/news/marketecture-media-raises-seed-funding-1236623993/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Marketecture-Media.png?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-05T22:03:49.000Z",
    "description": "\n\tMarketecture Media, a business-to-business podcasting, content, community and events firm covering advertising and marketing, announced $1 million i",
    "body": "\n\tMarketecture Media, a business-to-business podcasting, content, community and events firm covering advertising and marketing, announced $1 million in funding from top industry execs. \n\n\tExisting and new investors in Marketecture are David Rosenblatt, Rob Norman, Phil Fresen, David Hertog, Scott Messer, Breakpoint Capital’s Jim Payne, Aperiam Ventures and Momentum. \n\n\tNew York-based Marketecture said the funding will be used for organic growth and potential acquisitions. Founded in 2022, the company said last year marked its transition “from a niche podcasting operation to a multifaceted B2B powerhouse.” In 2025, Marketecture completed six M&A transactions of content and community sites, including Adland.tv’s archive of TV spots and the Serial Marketers community of brand and agency executives. The company also hosted two sold-out Marketecture Live conferences.\n\t\n\n\tThe company’s podcast lineup includes “The Marketecture Podcast” and “AdTechGod,” and its newsletters include “The Refresh,” “Monopoly Report” and “Marketecture.”\n\n\n\tIn 2026, the company plans to host the third edition of its flagship conference, Marketecture Live III, March 10-11 in New York City. The event, expected to attracted 1,000 industry professionals, is produced in partnership with Adweek and TVREV; more info is available at marketecturemedia.com. \n\n\t“Marketecture was built on the premise that true experts are best placed to explain new concepts, new companies, and new ways of doing business,” Jeremy Bloom, co-founder and CEO of Marketecture, said in a statement. “We started by doing this in podcasts and have since expanded to newsletters, video series, digital communities, and live events. It’s a rare combination of high-quality content, industry expertise, and human connection that is of clear value to the marketing and tech communities.”\n\t\n\n\tCompany co-fonder Ari Paparo, who is the host of “The Marketecture Podcast,” added, “Instead of defending legacy ways, Marketecture is leaning into the shifts — deeply covering pressing industry issues through its AI Marketers Guild community, policy wonk pod and newsletter ‘The Monopoly Report,’ and the AI-powered news reader Maddb.ai. We’re in the business of educating the industry and talking to people who are actively making the advertising world better.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Marketecture Media Raises $1 Million in Seed Funding From Top Ad-Biz Execs",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Marketecture-Media.png?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-05T22:03:49.000Z",
      "dateModified": "2026-01-05T22:03:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Winona Ryder Says Beheading Vecna With an Ax in the ‘Stranger Things’ Finale Took Only Two Takes: ‘You Can’t Rehearse a Scene Like That’",
    "url": "https://variety.com/2026/tv/news/winona-ryder-stranger-things-finale-joyce-ax-vecna-1236623664/",
    "image": "https://variety.com/wp-content/uploads/2026/01/610834495_1332426108926353_7159536611661358162_n.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-05T22:48:41.000Z",
    "description": "\n\tWinona Ryder recently revealed to Netflix’s Tudum that she only filmed the climactic moment in which Joyce beheads Vecna with an ax in the “Stranger",
    "body": "\n\tWinona Ryder recently revealed to Netflix’s Tudum that she only filmed the climactic moment in which Joyce beheads Vecna with an ax in the “Stranger Things” series finale two times. The scene marked Ryder’s last one with Vecna actor Jamie Campbell Bower. \n\n\t“I love Jamie so much,” Ryder said. “I remember when he was in that position and we were talking about bands, and he’s the most lovely person. I came in that day just for that. You can’t rehearse a scene like that. You just have to sort of save it for the take. I think I only did it twice.”\n\t\n\n\tThe beheading occurs right after Joyce tells Vecna: “You fucked with the wrong family.” The iconic lines marks the rare uses of the F-word in “Stranger Things'” history.\n\n\t“We haven’t used the F-word in the show, and we’ve been looking for a moment for it,” series co-creator Matt Duffer told Tudum. “I think Dacre [Montgomery, who played Billy] muttered it without us wanting him to in Season 3’s ‘The Sauna Test’ [Episode 4]. So I guess this technically doesn’t count as the first time, but we were looking for a real moment that would deserve stronger language and we’ve been saving it and felt like, well, if we’re going to go there, this is the moment for it. Let’s give it to Winona.”\n\n\tRoss Duffer said in an interview with Variety that the “Stranger Things” writers room debated which character should get the final blow on Vecna and having Joyce behead the villain “felt right for a lot of reasons.” \n\n\t“She is sort of the mother of this group, the protector,” Ross said. “And also, we never got to see her hit anything with that ax, so that felt like such a satisfying way to deliver the final blow to Vecna. But it was in editorial really, where, as we were working on it, that we had the initial flashbacks to her remembering back to Bob, and building up that anger. It felt right that it’s just not just a ‘fuck yeah’ moment. It was also, in a way, a cathartic moment for our characters, who are purging all this trauma that’s been caused here. It’s not just a stand-up and cheer moment. It’s remembering that this evil has caused them so much pain.”\n\t\n\n\tMatt Duffer added: I remember working with our editor and our composer and just talking to them and going, ‘Let’s make this the most emotional decapitation in history.’ That was the goal.”\n\n\t“Stranger Things 5” is streaming in its entirety on Netflix.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Winona Ryder Says Beheading Vecna With an Ax in the ‘Stranger Things’ Finale Took Only Two Takes: ‘You Can’t Rehearse a Scene Like That’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/610834495_1332426108926353_7159536611661358162_n.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-05T22:48:41.000Z",
      "dateModified": "2026-01-05T22:48:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tony Dokoupil’s ‘CBS Evening News’ Debut Is an Inauspicious Sign of Where CBS News Is Headed",
    "url": "https://variety.com/2026/tv/columns/tony-dokoupil-cbs-evening-news-1236624122/",
    "image": "https://variety.com/wp-content/uploads/2026/01/GettyImages-2237752280.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-06T00:39:38.000Z",
    "description": "\n\tTony Dokoupil’s debut as the anchor of the “CBS Evening News” came widely heralded — by Tony Dokoupil.\n\n\tThe broadcast journalist, who since 2019 ha",
    "body": "\n\tTony Dokoupil’s debut as the anchor of the “CBS Evening News” came widely heralded — by Tony Dokoupil.\n\n\tThe broadcast journalist, who since 2019 had been CBS’ morning show co-anchor, came into the seat once held by Walter Cronkite, Dan Rather and Katie Couric with plenty of attitude, saying in a recent social-media comment that he would be “more accountable and more transparent” than had been legendary anchor Cronkite and, on New Year’s Day, sharing a video in which he declared his broadcast had often “missed the story” by privileging “the perspective of advocates and not the average American.” \n\t\n\n\tAll of which conveniently mirrored the career-long attitude of Dokoupil’s new boss; Bari Weiss, the opinion journalist brought in last year as CBS News’ editor-in-chief by new Paramount leader David Ellison, has long evinced a relentless focus on presenting her perspective as that of the common man, no matter how many of her fellow Sun Valley attendees may coincidentally share it. \n\n\n\tDokoupil carried out the brief. On a his hurriedly moved-up debut Saturday night, before his official start date, the anchor covered the U.S. capture of Venezuelan president Nicolás Maduro almost exclusively through a lengthy but unchallenging interview of U.S. defense secretary Pete Hegseth, one in which the administration’s perspective was aired so thoroughly as to raise the question of when an interview becomes a press release. (In this aspect, Dokoupil’s work certainly suited the Weiss doctrine: The news chief’s first big scandal on the job arose right before Christmas when she held a “60 Minutes” segment over its not sufficiently representing the side of the administration, who had declined comment in the first place. For Weiss, it may not be news if the nation’s current leadership doesn’t get an unchallenged say.) \n\t\n\n\tAnd in his official first broadcast on Jan. 5, Dokoupil betrayed a Weissian willingness to bulldoze past that which might seem too untidy for whatever hypothetical viewer he and his editor have in mind. Dokoupil blandly stated to the camera that a Russian-Chinese-Iranian base of influence in Venezuela will be destabilized by the U.S. military action, without citing any source or consulting any guest; a brief interview with a financial expert about how the events in the Southern Hemisphere will affect the price of gasoline never broached the notion of whether the U.S. extracting Venezuelan petroleum is legal. Perhaps that might have constituted consulting advocates, and not the average American. But it would have been part of telling the whole story. \n\n\tNot that that seems to be Dokoupil’s strong suit, or his interest. Elsewhere, in a segment about health and human services secretary Robert F. Kennedy Jr.’s newly announced and seismic shifts to the recommended vaccine schedule for children, Dokoupil began an interview with a CBS News medical journalist by asking what this expert would say to “parents out there who are celebrating,” because they thought their kids were obliged to be injected with too many vaccines. He ended the segment by declaring “So, parents are going to have some options for themselves!” when, to a large portion of the audience, the precise opposite is true — they’ll now need a physician consult to obtain a vaccine for their child that was once more easily obtained. Dokoupil thanked his guest and announced, brashly, “You clarified it for us.” The guest could be said to have tried his best, despite Dokoupil. \n\n\tWeiss has been reported to have pursued Fox’s Bret Baier and CNN’s Anderson Cooper for this role, but after both stars wisely chose to keep their sinecures, she likely had to choose from among the army she had — but Dokoupil lacks the charisma and aptitude to turn the “Evening News” into whatever it is she may want. He babbled confusedly, then fell silent, when a segment about Sen. Mark Kelly jumped ahead of a segment about Gov. Tim Walz in the lineup — the kind of shift an anchor is supposed to be able to handle without painfully long seconds of dead air. “First day, big problems here,” Dokoupil said with evident frustration.\n\t\n\n\tAnd an newscast-ending segment about a small town in Oregon raising funds by selling a nude calendar of senior citizens felt neither like the news (the movie “Calendar Girls,” about a similar real-life case in the U.K., is more than 20 years old) nor conveyed with wit, elan — or even access. Weiss’ journalism, through her career, has many things that distinguish it, but it fundamentally lacks sensibility. Why was just broadcasting a bunch of nude photos of senior citizens a story? So that Dokoupil could giggle through it. \n\n\tThankfully, just like parents, viewers have some options for themselves — and few, it seems likely, will choose this reboot. The hypothetical viewer who wishes their news were pitched at a more conservative tenor is super-served by Fox News and Newsmax; evening newscast viewership has been dropping across the board, and, in terms of comfort in the chair and ability to convey thought, Dokoupil has a way to go and will likely move in the wrong direction. Say this much, though: Weiss’ management of “60 Minutes” has so far been a tragedy, in that it is shattering the credibility and prestige of what remains to this day one of the signature, and most popular, programs of any type in American television. The “Evening News” has been ebbing into irrelevance for years for reasons entirely beyond political slant. Perhaps sequestering Dokoupil there might contain the damage that might be done by an anchor whose ambitious ability to see which way the wind blows has so far outstripped his broadcasting talent.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tony Dokoupil’s ‘CBS Evening News’ Debut Is an Inauspicious Sign of Where CBS News Is Headed",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/GettyImages-2237752280.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-06T00:39:38.000Z",
      "dateModified": "2026-01-06T00:39:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Oscar Predictions: Clear Front-Runners With Plenty of Room for Chaos",
    "url": "https://variety.com/lists/2026-oscars-predictions/",
    "image": "https://variety.com/wp-content/uploads/2025/12/sinners-one-battle-accident-split.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-05T22:40:00.000Z",
    "description": "\n\t\t\n\n\t\n\tJan 5, 2026 2:40pm PT\t\n\t\n\n\t\n\tOscar Predictions: Clear Front-Runners With Plenty of Room for Chaos\n\t\n\n\n\n\t\t\t\n\t\t\t\n\t\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\tCourtesy of ",
    "body": "\n\t\t\n\n\t\n\tJan 5, 2026 2:40pm PT\t\n\t\n\n\t\n\tOscar Predictions: Clear Front-Runners With Plenty of Room for Chaos\n\t\n\n\n\n\t\t\t\n\t\t\t\n\t\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\tCourtesy of Everett Collection\n\t\n\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\n\t\t\n\n\tVariety Awards Circuit section is the home for all awards news and related content throughout the year, featuring the following: the official predictions for the upcoming Oscars, Emmys, Grammys and Tony Awards ceremonies, curated by Variety chief awards editor Clayton Davis. The prediction pages reflect the current standings in the race and do not reflect personal preferences for any individual contender. As other formal (and informal) polls suggest, competitions are fluid and subject to change based on buzz and events. Predictions are updated every Thursday.\n\n\n\n\t\n\n\t\t\t\t\tFRANKENSTEIN, Jacob Elordi as The Monster, 2025. ph: Ken Woroner / © Netflix / courtesy Everett Collection\n\t\t\t\t\t\t\t\t\t©Netflix/Courtesy Everett Collection\n\t\n\n\n\n\tOscars Commentary (Updated: Jan. 5, 2026): Happy New Year! \n\n\tWe’re back, and it’s already hot on the awards circuit. As the phase one period for Oscar nominations enters its final, volatile stretch, a few unexpected titles are beginning to press against what once looked like a locked best picture lineup. \n\n\tRichard Linklater’s “Blue Moon” from Sony Pictures Classics continues to build serious word of mouth and is quietly building a deep bench of admirers behind the scenes. To the point that a surprise best picture nomination no longer feels far-fetched. The film’s quiet momentum — the kind that grows through admiration rather than spectacle — is exactly how late-breaking contenders have slipped into the lineup in the past.\n\n\tJoseph Kosinski’s “F1,” fresh off two major wins at the Critics Choice Awards, is also testing the edges of the race. There is almost always room for what might be called a “normal people” movie — accessible, star-driven and emotionally legible — in the best picture field. Think “The Blind Side” or “Top Gun: Maverick.” The Apple studios high-octane racing drama starring Brad Pitt fits that mold, but its viability likely hinges on securing a nomination from the Producers Guild of America, which announces Friday.\n\n\tHow many international feature films will be in best picture remains another open question, particularly among Neon’s contenders. Joachim Trier’s Norwegian drama “Sentimental Value” feels solidly positioned, but whether the Academy embraces more than one non-English-language film is still unclear. Kleber Mendonça Filho’s Brazilian thriller and Critics Choice winner “The Secret Agent,” alongside Jafar Panahi’s “It Was Just an Accident,” are both in play, though space feels very limited.\n\n\tElsewhere, Guillermo del Toro’s “Frankenstein” is gathering momentum across categories. Jacob Elordi’s surprise Critics Choice win for supporting actor as the Creature has helped reposition the film as more than a technical showcase, giving it renewed credibility in the above-the-line conversations.\n\n\tOver the weekend, the Palm Springs International Film Awards gala delivered its annual blend of star power. Next on the awards docket are SAG noms on Wednesday, Golden Globes Awards arriving Sunday night and Oscar nomination voting opening Monday morning.\n\n\tAt the Critics Choice Awards, Paul Thomas Anderson’s “One Battle After Another” swept best picture, director and adapted screenplay. The acting winners included Timothee Chalamet (“Marty Supreme”), Jessie Buckley (“Hamnet”), Elordi and Amy Madigan (“Weapons”). Whether or not they can all translate remains to be seen.\n\n\tStill, the race is far from unsettled. Ryan Coogler’s “Sinners,” which co-led all films with four wins at CCA, could be a late-breaking spoiler, if the coalition remains intact.\n\n\tThis week’s updated predictions are below.\n\n\tTop 5 projected Oscar nomination leaders (films): \n\n\tTop 5 projected Oscar nomination leaders (studios): \n\n\t*** = PREDICTED WINNER(All predicted nominees listed below are in alphabetical order)\n\n\n\t\t\t\n\t\t\t\n\tBest Picture\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Credit: Sabrina Lantos\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\t“Blue Moon” (Sony Pictures Classics)“F1” (Apple Original Films/Warner Bros.)“Frankenstein” (Netflix)“Hamnet” (Focus Features) “It Was Just an Accident” (Neon)“Marty Supreme” (A24)“One Battle After Another” (Warner Bros.) ***“Sentimental Value” (Neon)“Sinners” (Warner Bros.)“Train Dreams” (Netflix)\n\n\tOscar category page with rankings>>>\n\n\t\t\n\t\t\t\n\t\t\t\n\tDirector\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Ken Woroner/Netflix\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\tPaul Thomas Anderson ***“One Battle After Another” (Warner Bros.)Ryan Coogler“Sinners” (Warner Bros.)Guillermo Del Toro“Frankenstein” (Netflix)Jafar Panahi“It Was Just an Accident” (Neon)Chloé Zhao“Hamnet” (Focus Features)\n\n\tOscar category page with rankings>>>\n\n\t\t\n\t\t\t\n\t\t\t\n\tActor\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Courtesy Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\tTimothée Chalamet “Marty Supreme” (A24)Leonardo DiCaprio “One Battle After Another” (Warner Bros.)Ethan Hawke ***“Blue Moon” (Sony Pictures Classics)Michael B. Jordan“Sinners” (Warner Bros.)Wagner Moura “The Secret Agent” (Neon)\n\n\tOscar category page with rankings>>>\n\n\t\t\n\t\t\t\n\t\t\t\n\tActress\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Courtesy of Focus Features\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\tJessie Buckley ***“Hamnet” (Focus Features)Rose Byrne“If I Had Legs I’d Kick You” (A24)Kate Hudson“Song Sung Blue” (Focus Features)Chase Infiniti“One Battle After Another” (Warner Bros.)Renate Reinsve“Sentimental Value” (Neon)\n\n\tOscar category page with rankings>>>\n\n\t\t\n\t\t\t\n\t\t\t\n\tSupporting Actor\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Focus Features\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\tBenicio Del Toro “One Battle After Another” (Warner Bros.)Jacob Elordi“Frankenstein” (Netflix)Paul Mescal“Hamnet” (Focus Features)Sean Penn “One Battle After Another” (Warner Bros.)Stellan Skarsgård ***“Sentimental Value” (Neon)\n\n\tOscar category page with rankings>>>\n\n\t\t\n\t\t\t\n\t\t\t\n\tSupporting Actress\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Quantrell Colbert\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\tElle Fanning“Sentimental Value” (Neon)Ariana Grande “Wicked: For Good” (Universal Pictures)Inga Ibsdotter Lilleaas ***“Sentimental Value” (Neon)Amy Madigan “Weapons” (Warner Bros.)Teyana Taylor“One Battle After Another” (Warner Bros.)\n\n\tOscar category page with rankings>>>\n\n\t\t\n\t\t\t\n\t\t\t\n\tOriginal Screenplay\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Courtesy of Warner Bros. Picture\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\t“Blue Moon” (Sony Pictures Classics)Robert Kaplow“It Was Just an Accident” (Neon)Jafar Panahi“Marty Supreme” (A24)Ronald Bronstein and Josh Safdie“Sentimental Value” (Neon) Joachim Trier and Eskil Vogt“Sinners” (Warner Bros.) ***Ryan Coogler\n\n\tOscar category page with rankings>>>\n\n\t\t\n\t\t\t\n\t\t\t\n\tAdapted Screenplay\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Courtesy of Netflix\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\t“Bugonia” (Focus Features)Will Tracy“Frankenstein” (Netflix)Guillermo Del Toro“Hamnet” (Focus Features) Maggie O’Farrell and Chloé Zhao“One Battle After Another” (Warner Bros.) ***Paul Thomas Anderson“Train Dreams” (Netflix) Clint Bentley and Greg Kwedar\n\n\tOscar category page with rankings>>>\n\n\t\t\n\t\t\t\n\t\t\t\n\tCasting\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Neon\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\t“Hamnet” (Focus Features)Nina Gold“One Battle After Another” (Warner Bros.)Cassandra Kulukundis“Sentimental Value” (Neon)Yngvill Kolset Haga and Avy Kaufman“Sirât” (Neon) Nadia Acimi, Luis Bertolo and Erika Boulic“Sinners” (Warner Bros.) ***Francine Maisler\n\n\tOscar category page with rankings>>>\n\n\t\t\n\t\t\t\n\t\t\t\n\tAnimated Feature\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Netflix\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\t“Arco” (Neon)Ugo Bienvenu, Félix de Givry, Sophia Mas, Natalie Portman“Elio” (Pixar)Mary Alice Drumm, Adrian Molina, Madelina Sharafian, Domee Shi“KPop Demon Hunters” (Netflix) ***Chris Appelhans, Maggie Kang, Michelle L.M. Wong“Little Amélie or the Character of Rain” (GKids) Claire LaCombe, Edwina Liard, Henri Magalon, Nidia Santiago, Maïlys Vallade“Zootopia 2” (Walt Disney Pictures) Jared Bush, Byron Howard, Yvett Merino\n\n\tOscar category page with rankings>>>\n\n\t\t\n\t\t\t\n\t\t\t\n\tProduction Design\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Giles Keyte/Universal Pictures\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\t“Frankenstein” (Netflix) ***Tamara Deverell, Shane Vieau“Hamnet” (Focus Features)Fiona Crombie, Alice Felton“Marty Supreme” (A24)Jack Fisk, Adam Willis“Sinners” (Warner Bros.)Hannah Bleachler, Monique Champagne“Wicked: For Good” (Universal Pictures) Nathan Crowley, Lee Sandales\n\n\tOscar category page with rankings>>>\n\n\t\t\n\t\t\t\n\t\t\t\n\tCinematography\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Courtesy of Warner Bros. Pictures\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\t“F1” (Apple Original Films/Warner Bros.)Claudio Miranda“Hamnet” (Focus Features)Łukasz Żal“One Battle After Another” (Warner Bros.)Michael Bauman“Sinners” (Warner Bros.) ***Autumn Durald Arkapaw“Train Dreams” (Netflix)Adolpho Veloso\n\n\tOscar category page with rankings>>>\n\n\t\t\n\t\t\t\n\t\t\t\n\tCostume Design\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Focus Features\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\t“Downton Abbey: The Grand Finale” (Focus Features)Anna Mary Scott Robbins“Frankenstein” (Netflix) ***Kate Hawley“Hamnet” (Focus Features)Malgosia Turzanska“Sinners” (Warner Bros.)Ruth E. Carter“Wicked: For Good” (Universal Pictures)Paul Tazewell\n\n\tOscar category page with rankings>>>\n\n\t\t\n\t\t\t\n\t\t\t\n\tFilm Editing\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: ©Warner Bros/Courtesy Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\t“F1” (Apple Original Films/Warner Bros.)Stephen Mirrione“Hamnet” (Focus Features)Affonso Gonçalves and Chloé Zhao“One Battle After Another” (Warner Bros.) ***Andy Jurgensen“Sentimental Value” (Neon)Olivier Bugge Coutté“Sinners” (Warner Bros.)Michael P. Shawver\n\n\tOscar category page with rankings>>>\n\n\t\t\n\t\t\t\n\t\t\t\n\tMakeup and Hairstyling\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Courtesy of Warner Bros\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\t“The Alto Knights” (Warner Bros.) Lori Hicks, Richard Redlefsen“Frankenstein” (Netflix) ***Cliona Furey, Mike Hill, Jordan Samuel“The Smashing Machine” (A24) Felix Fox, Kazu Hiro, Mia Neal“The Ugly Stepsister” (IFC) Thomas Foldberg, Anne Cathrine Sauerberg“Wicked: For Good” (Universal Pictures) Laura Blount, Mark Coulier, Frances Hannon\n\n\tOscar category page with rankings>>>Coming Soon\n\n\t\t\n\t\t\t\n\t\t\t\n\tSound\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Warner Bros.\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\t“F1” (Apple Original Films/Warner Bros.)“One Battle After Another” (Warner Bros.) ***“Sinners” (Warner Bros.)“Sirât” (Neon)“Wicked: For Good” (Universal Pictures)\n\n\tOscar category page with rankings>>>\n\n\t\t\n\t\t\t\n\t\t\t\n\tVisual Effects\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: ©20th Century Studios/Courtesy Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\t“Avatar: Fire and Ash” (20th Century Studios) ***“F1” (Apple Original Films/Warner Bros.)“Superman” (Warner Bros.)“Tron: Ares” (20th Century Studios)“Wicked: For Good” (Universal Pictures)\n\n\tOscar category page with rankings>>>Coming Soon\n\n\t\t\n\t\t\t\n\t\t\t\n\tOriginal Score\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Courtesy Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\t“Frankenstein” (Netflix)Alexandre Desplat“Hamnet” (Focus Features)Max Richter“One Battle After Another” (Warner Bros.)Jonny Greenwood“Sinners” (Warner Bros.) ***Ludwig Göransson“Sirāt” (Neon) Kangding Ray\n\n\tOscar category page with rankings>>>\n\n\t\t\n\t\t\t\n\t\t\t\n\tOriginal Song\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: ©Apple TV/Courtesy Everett Coll\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\t“Come See Me in the Good Light” (Apple Original Films)“Salt Then Sour Then Sweet” by Sara Bareilles, Brandi Carlile and Andrea Gibson“Diane Warren: Relentless” (Greenwich Entertainment)“Dear Me” by Diane Warren“KPop Demon Hunters” (Netflix) ***“Golden” by EJAE and Mark Sonnenblick“Sinners” (Warner Bros.)“I Lied to You” by Ludwig Göransson and Raphael Saadiq“Wicked: For Good” (Universal Pictures)“The Girl in the Bubble” by Stephen Schwartz\n\n\tOscar category page with rankings>>>\n\n\t\t\n\t\t\t\n\t\t\t\n\tDocumentary Feature\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Brittany Shyne\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\t“The Alabama Solution” (HBO Documentary Films)Andrew Jarecki, Charlotte Kaufman, Page Marsella“Cutting Through Rocks” (Autlook Films)Mohammadreza Eyni, Sara Khaki“The Perfect Neighbor” (Netflix) ***Sam Bisbeem Geeta Gandbhir, Alisa Payne“Seeds” (Interior Films)Brittany Shyne, Sabrina Schmidt Gordon, Danielle Varga“2000 Meters to Andriivka” (PBS)Raney Aronson, Mstyslav Chernov, Michelle Mizner\n\n\tOscar category page with rankings>>>\n\n\t\t\n\t\t\t\n\t\t\t\n\tInternational Feature\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Courtesy Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\t“It Was Just an Accident” from France (Neon) dir. Jafar Panahi“The Secret Agent” from Brazil (Neon)dir. Kleber Mendonça Filho“Sentimental Value” from Norway (Neon) ***dir. Joachim Trier“Sirāt” from Spain (Neon)dir. Oliver Laxe“The Voice of Hind Rajab” from Tunisia (Willa)dir. Kaouther Ben Hania\n\n\tOscar category page with rankings>>>\n\n\t\t\n\t\t\t\n\t\t\t\n\tAnimated Short\n\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\n\n\t“Cardboard” (Locksmith Animation)  “Éiru” (GKids) ***“Hurikán” (AEON Production) “The Night Boots” (Am Stram Gram)“The Quinta’s Ghost” (Illusorium Films) \n\n\tOscar category page with rankings>>>Coming Soon\n\n\t\t\n\t\t\t\n\t\t\t\n\tDocumentary Short\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: ©Netflix/Courtesy Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\t“All the Empty Rooms” (Netflix) ***“All the Walls Came Down” (Interloper Films) “Armed Only with a Camera: The Life and Death of Brent Renaud” (HBO Documentary Films) “Chasing Time” (Exposure Labs)“The Devil is Busy” (HBO Documentary Films)\n\n\tOscar category page with rankings>>>Coming Soon\n\n\t\t\n\t\t\t\n\t\t\t\n\tLive Action Short\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: The New Yorker\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\t“The Boy with White Skin” (Manifest)“Extremist” (The New Yorker)“Rock, Paper, Scissors” (National Film and Television School)“The Singers” (Highway West Entertainment)“Two People Exchanging Saliva” (The New Yorker) ***\n\n\tOscar category page with rankings>>>Coming Soon\n\n\t\t\n\t\n\t\n\n\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Oscar Predictions: Clear Front-Runners With Plenty of Room for Chaos",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/sinners-one-battle-accident-split.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-05T22:40:00.000Z",
      "dateModified": "2026-01-05T22:40:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Skateboarder Terry Kennedy Released From Prison Years After Fatal Incident",
    "url": "https://www.tmz.com/2026/01/05/terry-kennedy-skateboard-released-prison-parole/",
    "image": "https://imagez.tmz.com/image/e6/16by9/2026/01/05/e60251a6fe0f4bfeae9bd3dd086bcaf2_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-05T18:08:50.000Z",
    "description": "\n    \n                    \n                          Skateboarder Terry Kennedy\n                          Released From Prison\n                       ",
    "body": "\n    \n                    \n                          Skateboarder Terry Kennedy\n                          Released From Prison\n                          Paroled 4+ Years After Skater's Death\n                      \n                  \n                                                                        Published \n                              \n                January 5, 2026\n                \n                            10:08 AM PST\n                                                                      |\n                                                                Updated \n                                  January 5, 2026\n                                11:26 AM PST\n                                    \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Terry Kennedy is officially a free man ... the famed skateboarder is out on parole just over three years after he was convicted of assaulting a fellow skater -- an incident that led to the man's death.\n      \n    \n          TMZ Sports broke the story last month ... the Illinois Department of Corrections told us Kennedy -- known by fans as \"Compton-Ass Terry\" -- was eligible for parole and set to be released on New Year's Eve.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          True to the plan, Kennedy, according to inmate records, was released from custody on December 31.\n      \n\n          Kennedy was found guilty of two counts of aggravated battery and sentenced to five years in prison in late 2022 for his role in a violent July 2021 altercation that ultimately claimed the life of skater Josiah Kassahun.\n      \n    \n          Terry was also charged with first-degree murder, but was acquitted by the judge during his bench trial.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Kennedy -- who competed in the X Games and Malook Money Cup -- isn't totally free and clear ... he's still on parole until June 30, which was initially set to be his release date.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                TMZ Sports\n              \n                          \n                Crime\n              \n                          \n                Exclusive\n              \n                          \n                Fairly Legal\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Skateboarder Terry Kennedy Released From Prison Years After Fatal Incident",
      "image": [
        "https://imagez.tmz.com/image/e6/16by9/2026/01/05/e60251a6fe0f4bfeae9bd3dd086bcaf2_xl.jpg"
      ],
      "datePublished": "2026-01-05T18:08:50.000Z",
      "dateModified": "2026-01-05T18:08:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "DeRay Davis Jokes Thieves Who Stole From Merch Table Got Him For $100M",
    "url": "https://www.tmz.com/2026/01/05/deray-davis-merch-theft-jokes/",
    "image": "https://imagez.tmz.com/image/97/16by9/2026/01/05/970633a235d848a89a644e6ee1387565_xl.png",
    "tag": "Entertainment",
    "date": "2026-01-05T22:25:41.000Z",
    "description": "\n    \n                    \n                          DeRay Davis\n                          Thieves Robbed My Merch Table...\n                          ",
    "body": "\n    \n                    \n                          DeRay Davis\n                          Thieves Robbed My Merch Table...\n                          Somebody Check My Exes' Locations!!!\n                      \n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          DeRay Davis has a message for the fans who stole from his merch table at a recent show ... something's already missing from your house!\n      \n    \n          The comedian joked with our cameraperson at LAX Monday that he had already exacted retribution from the thieves after they were caught on camera.\n      \n    \n          He kidded, \"I know it's one of my ex-girlfriends sent them. It felt too calculated.\"\n      \n\n          But in all seriousness, DeRay reasoned that the only reason someone would steal t-shirts with his face on them is if they were in dire straits.\n      \n    \n        \n                    \n                  \n      \n    \n          He told us, \"I think we're living in times where you have to find humor in it, because at the end of the day, if they didn't need them, they probably wouldn't have took them.\"\n      \n    \n          He added, \"Their kids are at home with my shirts on!\"\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                DeRay Davis\n              \n                          \n                Celebrity News\n              \n                          \n                Comedy\n              \n                          \n                Exclusive\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "DeRay Davis Jokes Thieves Who Stole From Merch Table Got Him For $100M",
      "image": [
        "https://imagez.tmz.com/image/97/16by9/2026/01/05/970633a235d848a89a644e6ee1387565_xl.png"
      ],
      "datePublished": "2026-01-05T22:25:41.000Z",
      "dateModified": "2026-01-05T22:25:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ashley Tisdale's Article Not About Celeb Group, Denies Being Republican",
    "url": "https://www.tmz.com/2026/01/05/ashley-tisdale-responds-mom-article-drama-republican/",
    "image": "https://imagez.tmz.com/image/b9/16by9/2026/01/05/b90fb62bb4624a10b67b30c59a82d907_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-05T23:18:53.000Z",
    "description": "\n    \n                    \n                          Ashley Tisdale\n                          Puts Internet in Time-Out...\n                          W",
    "body": "\n    \n                    \n                          Ashley Tisdale\n                          Puts Internet in Time-Out...\n                          Wrong Mom Group, Wrong Politics!!!\n                      \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Ashley Tisdale’s spicy \"toxic mom group\" exposé sent the internet into full spiral mode -- but TMZ has learned the wild theory that it involved certain celebs or had anything to do with politics is totally off-base... especially since Ashley isn’t even a Republican.\n      \n    \n          A rep for Ashley tells TMZ it’s unfortunate her \"The Cut\" essay -- meant to spotlight her experience with a toxic mom group -- is getting twisted into clickbait... adding there’s zero truth to what online \"detectives\" think they’ve cracked, especially since the piece wasn’t even about Mandy Moore, Hilary Duff or Meghan Trainor like they're assuming.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          If that wasn't enough, folks jumped to the conclusion that Ashley’s fallout was tied to her being some hardcore MAGA type -- but her rep shuts that down hard, stressing to TMZ it’s completely false, especially since she’s a registered Democrat.\n      \n\n                  \n          \n                          \n                \n                                  \n      \n    \n          Lastly, they add Ashley penned a beautiful, meaningful essay on a very real issue in mom circles -- pulling from her own experience of being shut out of social hangs so hard from a completely different group of friends, it made her feel like she was right back in high school.\n      \n    \n          Bottom line, this whole thing got blown way out of proportion... and Ashley’s already putting a lid on it, making it clear this was never about Mandy, Hilary, Meghan, or politics -- full stop!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Ashley Tisdale\n              \n                          \n                Hilary Duff\n              \n                          \n                Mandy Moore\n              \n                          \n                Meghan Trainor\n              \n                          \n                Celebrity News\n              \n                          \n                Family\n              \n                          \n                Relationships\n              \n                          \n                Movies\n              \n                          \n                Politix\n              \n                          \n                Exclusive\n              \n                          \n                Music\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ashley Tisdale's Article Not About Celeb Group, Denies Being Republican",
      "image": [
        "https://imagez.tmz.com/image/b9/16by9/2026/01/05/b90fb62bb4624a10b67b30c59a82d907_xl.jpg"
      ],
      "datePublished": "2026-01-05T23:18:53.000Z",
      "dateModified": "2026-01-05T23:18:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bodybuilder Jayne Trcka Who Played Miss Mann in 'Scary Movie' Dead at 62",
    "url": "https://www.tmz.com/2026/01/05/jayne-trcka-dead/",
    "image": "https://imagez.tmz.com/image/ca/16by9/2026/01/05/cac0d35912094983964bce9e1766a514_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-05T19:21:26.000Z",
    "description": "\n    \n                    \n                          'Scary Movie' Star Jayne Trcka\n                          Dead at 62\n                      \n      ",
    "body": "\n    \n                    \n                          'Scary Movie' Star Jayne Trcka\n                          Dead at 62\n                      \n                  \n                                                                        Published \n                              \n                January 5, 2026\n                \n                            11:21 AM PST\n                                                                      |\n                                                                Updated \n                                  January 5, 2026\n                                12:16 PM PST\n                                    \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Update\n  \n    \n          12:07 PM PT -- Law enforcement sources tell TMZ ... Jayne Trcka's friend called her several times days before her body was found, but no one picked up. The friend got worried and went to Jayne's home to check on her -- finding her unresponsive in the kitchen. After the friend called 911, first responders arrived on scene and pronounced Jayne dead.\n      \n    \n          Bodybuilder Jayne Trcka -- who played Miss Mann in \"Scary Movie\" -- has died, TMZ has learned.\n      \n    \n          Jayne's son tells TMZ ... Jayne passed away December 12 in San Diego.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          The San Diego medical examiner also confirmed her death, telling us her cause of death is pending.\n      \n\n          Jayne's son was not aware of any medical condition or sickness that would have caused her death.\n      \n    \n          Jayne competed in bodybuilding shows in the '80s before she landed her first acting role in 2000, with \"Scary Movie.\"\n      \n    \n          Her memorable role led to more gigs -- such as \"The Drew Carey Show\" and \"Whose Line is it Anyway?\" -- but she also reportedly worked as a California realtor.\n      \n    \n      \n        \n                    \n                      MAY 2011\n                  \n      \n                    TMZ.com\n          \n    \n          She also appeared in many fitness magazines, including Flex, MuscleMag International, and Women's Physique World.\n      \n    \n          Jayne was 62.\n      \n    \n          RIP\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                RIP\n              \n                          \n                Movies\n              \n                          \n                Celebrity Death\n              \n                          \n                TMZ Sports\n              \n                          \n                Exclusive\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bodybuilder Jayne Trcka Who Played Miss Mann in 'Scary Movie' Dead at 62",
      "image": [
        "https://imagez.tmz.com/image/ca/16by9/2026/01/05/cac0d35912094983964bce9e1766a514_xl.jpg"
      ],
      "datePublished": "2026-01-05T19:21:26.000Z",
      "dateModified": "2026-01-05T19:21:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Kennedy Family Attends Funeral Of Tatiana Schlossberg",
    "url": "https://www.tmz.com/2026/01/05/kennedy-family-attends-tatiana-schlossberg-funeral/",
    "image": "https://imagez.tmz.com/image/af/16by9/2026/01/05/af3364ae091b403d99ebc9f2c4ad0e4c_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-05T19:49:28.000Z",
    "description": "\n    \n                    \n                          Tatiana Schlossberg's Funeral\n                          Kennedy Family Pays Their Final Respects\n",
    "body": "\n    \n                    \n                          Tatiana Schlossberg's Funeral\n                          Kennedy Family Pays Their Final Respects\n                      \n      \n    \n          Tatiana Schlossberg -- the late daughter of Caroline Kennedy and designer Edwin Schlossberg -- is being honored in NYC today ... and we have the somber shots of the family and friends making their way to her funeral.\n      \n    \n          The Kennedys gathered to mourn Tatiana at the St. Ignatius Loyola Church on NYC's Upper East Side -- the same church that hosted the funeral for Tatiana's grandmother, Jackie Kennedy.\n      \n    \n          As we reported ... Tatiana tragically passed away December 30 after reportedly being diagnosed with leukemia in 2024. She was just 35.\n      \n\n          The journalist's parents, Caroline and Edwin, were seen filling into the church, as well as her younger brother, Jack Schlossberg.\n      \n    \n          Other notable attendees reportedly included extended family members Kerry Kennedy and Joe Kennedy III, as well as sister Rose, husband Dr. George Moran, and their two young children, son Edwin and daughter Josephine.\n      \n    \n          It's unclear if Tatiana's first cousin once removed, Robert F. Kennedy Jr., showed up at the funeral ... as you know, Tatiana and Trump's Health and Human Services Secretary had a rocky relationship over his cuts to medical research and promoting anti-vaccine views.\n      \n    \n        Waiting for your permission to load the Instagram Media.\n      \n    \n          The JFK Library Foundation confirmed Tatiana's passing last week in an Instagram post, writing, \"Our beautiful Tatiana passed away this morning. She will always be in our hearts.\"\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Tatiana Schlossberg\n              \n                          \n                Robert F. Kennedy Jr.\n              \n                          \n                Edwin Schlossberg\n              \n                          \n                Jack Schlossberg\n              \n                          \n                Kerry Kennedy\n              \n                          \n                Caroline Kennedy\n              \n                          \n                Jackie Kennedy Onassis\n              \n                          \n                Celebrity News\n              \n                          \n                RIP\n              \n                          \n                Politix\n              \n                          \n                Photo Galleries\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Kennedy Family Attends Funeral Of Tatiana Schlossberg",
      "image": [
        "https://imagez.tmz.com/image/af/16by9/2026/01/05/af3364ae091b403d99ebc9f2c4ad0e4c_xl.jpg"
      ],
      "datePublished": "2026-01-05T19:49:28.000Z",
      "dateModified": "2026-01-05T19:49:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]