[
  {
    "title": "Indian Oscar Contender ‘Homebound’ to Open Dharamshala International Film Festival, Venice Winner ‘Songs of Forgotten Trees’ to Close",
    "url": "https://variety.com/2025/film/festivals/india-oscar-homebound-dharamshala-film-festival-1236558518/",
    "image": "https://variety.com/wp-content/uploads/2025/05/Homebound.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-22T08:11:18.000Z",
    "description": "\n\tIndia’s Dharamshala International Film Festival will return to the Himalayan foothills for its 14th edition, opening with Neeraj Ghaywan’s “Homeboun",
    "body": "\n\tIndia’s Dharamshala International Film Festival will return to the Himalayan foothills for its 14th edition, opening with Neeraj Ghaywan’s “Homebound” and closing with Anuparna Roy’s Venice prizewinner “Songs of Forgotten Trees.”\n\n\tRunning from Oct. 30 to Nov. 2 at the Tibetan Children’s Village in Upper Dharamshala, DIFF has established itself as one of India’s premier showcases for independent cinema, drawing global filmmakers and audiences to its non-competitive platform.\n\t\n\n\tGhaywan’s “Homebound,” adapted from a 2020 New York Times article by Basharat Peer, follows two childhood friends from a North Indian village who aspire to become police officers. The film, which debuted at Cannes, explores how mounting pressures strain their friendship as they pursue respect and opportunity.\n\n\n\tThe festival continues its partnership with Sydney Film Festival, welcoming two Australian films and their filmmakers: Emma Hough Hobbs and Leela Varghese’s queer sci-fi “Lesbian Space Princess” and Gabrielle Brady’s “The Wolves Always Come at Night,” Australia’s Oscar submission.\n\n\tProgramming highlights include Bhutan’s Oscar entry “I, The Song” by Dechen Roder; Rohan Parashuram Kanawade’s Sundance Grand Jury Prize winner “Cactus Pears”; Rich Peppiatt’s Irish-language “Kneecap“; and Raoul Peck’s documentary “Orwell 2+2=5.”\n\n\tThe lineup also features Spanish director Carla Simón’s “Romeria”; Hlynur Pálmason’s Cannes entry “The Love That Remains”; Sara Khaki and Mohammadreza Eyni’s “Cutting Through Rocks”; Prabhash Chandra’s “Alaav”; and Kunsang Kyirong’s “100 Sunset.”\n\t\n\n\tThe festival will host a masterclass with acclaimed Indian filmmaker Kiran Rao.\n\n\tClosing night belongs to Anuparna Roy’s “Songs of Forgotten Trees,” which won the Horizons award for best director at the Venice Film Festival earlier this year. The Mumbai-set drama follows a migrant actor and sex worker who sublets her apartment to a call-center worker, forming a fragile bond.\n\n\tProgramming director Bina Paul has curated a lineup that includes Andrey Tarkovsky’s son presenting the documentary “Andrey Tarkovsky: A Cinema Prayer” in person, featuring rare archival footage of the legendary Russian filmmaker.\n\n\tDharamshala is best known internationally as the seat of the Dalai Lama, who has been based there since being exiled from Tibet in 1959. The festival directors Ritu Sarin and Tenzing Sonam are filmmakers in their own right. Their chronicles of the Tibetan condition including 2005’s “Dreaming Lhasa,” 2010’s “The Sun Behind the Clouds: Tibet’s Struggle for Freedom” and 2018’s “The Sweet Requiem” have received considerable festival play, including at Toronto and San Sebastian. The pair’s last venture, one of the shorts in Tibetan anthology film “State of Statelessness,” premiered at Busan in 2024.\n\n\t“We never set out to become one of the most prominent independent festivals in the country. We simply believed that meaningful cinema deserved a home in the mountains,” say Sarin and Sonam. “DIFF has grown organically over 14 years — not through flash or hype, but through the passion of filmmakers, the trust of our audiences, and the community that returns year after year.”\n\n\tDIFF remains deliberately non-competitive, prioritizing dialogue over awards. The festival credits tech partner PictureTime’s inflatable digital theaters with bringing independent cinema to the remote mountain location.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Indian Oscar Contender ‘Homebound’ to Open Dharamshala International Film Festival, Venice Winner ‘Songs of Forgotten Trees’ to Close",
      "image": [
        "https://variety.com/wp-content/uploads/2025/05/Homebound.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-22T08:11:18.000Z",
      "dateModified": "2025-10-22T08:11:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "ABC News Sets ‘Springsteen: Deliver Me From Nowhere’ Special With Cast, Bruce Springsteen (TV News Roundup)",
    "url": "https://variety.com/2025/music/news/tv-news-roundup-oct-20-2025-1236557222/",
    "image": "https://variety.com/wp-content/uploads/2025/08/deliver-me-from-nowhere.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-21T22:29:05.000Z",
    "description": "\n\tABC News Live will premiere “Springsteen: Deliver Me from Nowhere – A Conversation with the Cast,” hosted by Good Morning co-anchor George Stephanop",
    "body": "\n\tABC News Live will premiere “Springsteen: Deliver Me from Nowhere – A Conversation with the Cast,” hosted by Good Morning co-anchor George Stephanopoulos, on Oct. 21 at 8:30 p.m. ET/PT. The conversation will include singer Bruce Springsteen, who will talk about the behind the scenes of the biopic. \n\n\tThe special will be the only on-camera sit down with Springsteen and the team behind the film to discuss the production of the movie, doing live performances, and more. \n\t\n\n\t“Springsteen: Deliver Me from Nowhere” stars Jeremy Allen White, Jeremy Strong, Stephen Graham, Odessa Young, Johnny Cannizzaro, Grace Gummer, Gaby Hoffmann and Paul Walter Hauser. \n\n\n\tWatch an exclusive clip from the special below. \n\n\t\n\t\tRELEASE DATES\t\n\n\t“Surviving Mormonism with Heather Gay” will premiere Nov. 11 on Bravo, with all three parts dropping on Peacock on Nov. 12. The series premiere will follow after an episode of “The Real Housewives of Salt Lake City.”\n\n\tThe limited series will “fracture the church’s seemingly perfect veneer to expose the secrets that have been kept behind closed doors.”\n\n\tEach episode will follow Gay as she uncovers the truth from abuse survivors, ex-Mormons, and former LDS church leaders while reflecting on her departure from the church. The series will delve into the church’s practices, and allow victims to come forward with their experiences to bring further awareness.\n\t\n\t\tPROGRAMMING\t\n\n\tGreat American Media has greenlit Season 2 of “Crossroad Springs” as well as the musical holiday special, “Crossroad Springs Christmas.”\n\t\n\n\t“Crossroads Springs” is an original faith-based drama series from Great American Media. The second season will premiere in 2026 across Great American Pure Flix, Great American Family and GFAM+. The “Crossroad Springs Christmas” will air this December as part of the studio’s fifth anniversary of Great American Christmas. The one-hour special will feature original musical performances from “Crossroads Springs” stars Jonathan Stoddard and Jillian Cardarelli.\n\n\tThe series also stars Emily Alatalo, Brittney Underwood, Shaun Johnston, Kate Drummond, Jesse Hutch, Erin Agostino and Jon McLaren. It was developed by Nicely Entertainment and Brain Power Studios, and is executive produced Vanessa Shapiro and Beth Stevenson.\n\t\n\t\tDEVELOPMENT/PRODUCTION\t\n\n\tCas Anvar has joined “S.W.A.T Exiles” in a guest starring role, starring opposite Shemar Moore, Jay Harrington and Patrick St. Esprit. \n\n\tHe will portray Monte Barzarian, who is described as “tough as nails, intimidating and physically strong, running a family business with an iron hand that is a front for a drug empire for years,” according to the release. \n\n\tThe spinoff series, which came from the 2017 CBS drama, follows a “last-chance experimental SWAT unit” that’s “made up of untested, unpredictable young recruits.” After one of their high-profile missions goes sideways and Daniel “Hondo” Harrison (Moore) gets pulled out of a forced retirement to lead this new team,” per the release. \n\n\tAnvar’s guest star role marks his return to TV after appearing in several films this year. His film and TV credits include “Doin’ It,” “The Expanse,” “How to Get Away with Murder,” “Cardinal,” among others. \n\n\n\n\t\n\n\t\t\t\t\tCourtesy of Monique Moss\n\t\n\n\n\t\n\t\tAWARDS\t\n\n\tThe Movies for Grownups Awards with AARP will take place on Jan. 10 at the Beverly Wilshire in Beverly Hills, CA. This year’s ceremony will be hosted by Alan Cumming, who currently serves as the host of Peacock’s “The Traitors.”\n\n\tFor over two decades, Movies for Grownups with AARP has spotlighted age-positive storytelling, honoring and celebrating the contributions of 50-plus talent across film and television. \n\n\tThe 2025 Movies for Grownups Awards with AARP will celebrate actors in categories such as Best Actor & Actress, Best Movie for Grownups, Best TV or Limited Series, Best Director, and more. \n\t\n\n\tThe ceremony will honor one recipient with the Career Achievement Award, celebrating their impact in the entertainment industry throughout various performances.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "ABC News Sets ‘Springsteen: Deliver Me From Nowhere’ Special With Cast, Bruce Springsteen (TV News Roundup)",
      "image": [
        "https://variety.com/wp-content/uploads/2025/08/deliver-me-from-nowhere.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-21T22:29:05.000Z",
      "dateModified": "2025-10-21T22:29:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kevin O’Leary Suggests Using AI Extras Instead of Humans ‘Could Save Millions’ for Movies Like ‘Marty Supreme’: ‘Just Put 100 Norwell Tillies in There’",
    "url": "https://variety.com/2025/film/news/kevin-oleary-marty-supreme-save-millions-ai-extras-1236558434/",
    "image": "https://variety.com/wp-content/uploads/2025/10/kevin-o-leary-marty-supreme.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-22T01:19:03.000Z",
    "description": "\n\tKevin O’Leary delivered one of his first promotional plugs for A24’s “Marty Supreme” in typically business-minded fashion. The investor and “Shark T",
    "body": "\n\tKevin O’Leary delivered one of his first promotional plugs for A24’s “Marty Supreme” in typically business-minded fashion. The investor and “Shark Tank” host, who gives his debut feature film acting performance in the upcoming Timothée Chalamet vehicle, suggested that movies like his own could “save millions of dollars” by replacing background actors with AI-generated stand-ins.\n\n\tIn an interview on the Oct. 16 episode of The Hill’s “World of Travel: The Podcast,” O’Leary discussed his own investments in AI and used “Marty Supreme” as an example to discuss the technology’s potential implementation in the film industry.\n\t\n\n\t“Almost every scene had as many as 150 extras. Now, those people have to stay awake for 18 hours, be completely dressed in the background. [They’re] not necessarily in the movie, but they’re necessary to be there moving around. And yet, it costs millions of dollars to do that,” O’Leary said. “Why couldn’t you simply put AI agents in their place? Because they’re not the main actors. They’re only in the story visually. [You could] save millions of dollars, so more movies could be made. The same director, instead of spending $90 million or whatever he spent, could’ve spent $35 million and made two movies.”\n\n\n\tO’Leary also brought up the topic of Tilly Norwood, an AI “actress” unveiled via a comedic sketch at the Zurich Summit in September, with claims that Hollywood agencies were seeking to sign it. SAG-AFTRA swiftly issued a statement condemning the nascent product, saying it is “jeopardizing performer livelihoods and devaluing human artistry.”\n\t\n\n\tIn his comments to The Hill, O’Leary erroneously referred to Tilly Norwood as “Tilly Norwell.”\n\n\t“She’s 100% AI. She doesn’t exist. But she’s a great actress. She can come in any age you want. She doesn’t need to eat, so she works 24 hours a day. The union is going out of their mind,” O’Leary said.\n\n\tO’Leary continued by bringing up The Velvet Sundown, a moniker that releases AI-generated music. Again, O’Leary made an erroneous reference, calling the fictitious band “Velvet Sunset.”\n\n\t“Velvet Sunset is a band that’s on the top 10% of all downloads right now. And it’s complete BS. They don’t exist. It’s just AI music,” O’Leary continued. “It’s coming. You can’t stop the advancement of technology, so I’m spending a lot of time investing.”\n\n\t“Marty Supreme” carries a production budget north of $60 million, making it A24’s most expensive feature ever. The film is a 1950s period piece that stars Chalamet as a rising, unshakably ambitious ping-pong prodigy. Gwyneth Paltrow plays his love interest, while O’Leary plays the husband to Paltrow’s character. It releases in theaters on Christmas Day.\n\n\t“I’d argue, for the sake of the art, you should allow [AI] in certain cases. An extra is a really good case, because you can’t tell the difference,” O’Leary continued. “You just put 100 Norwell Tillies in there and you’re good.”\n\n\tO’Leary also noted that he is using AI to make a facsimile of himself, and that he is seeking full citizenship in the United Arab Emirates as the industry grows abroad.\n\n\t“We’ve got AI Kevin now and we did it in Abu Dhabi. I’m going back there in a couple weeks. I’m going to train the model even more,” O’Leary said. “The challenges with AI is most people can distinguish now between what’s fake and what’s real, because of the voice. But there’s another iteration of the model coming in about a week — that’s how fast it’s advancing. This next AI Kevin, you will not be able to tell the difference.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kevin O’Leary Suggests Using AI Extras Instead of Humans ‘Could Save Millions’ for Movies Like ‘Marty Supreme’: ‘Just Put 100 Norwell Tillies in There’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/kevin-o-leary-marty-supreme.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-22T01:19:03.000Z",
      "dateModified": "2025-10-22T01:19:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Josh Groban, Jamie Lee Curtis Among Stars to Appear on PBS SoCal Telethon Supporting Public TV In Wake of Trump’s Elimination of Funding",
    "url": "https://variety.com/2025/tv/news/pbs-socal-telethon-trump-public-broadcasting-cuts-1236558432/",
    "image": "https://variety.com/wp-content/uploads/2025/10/PBS-SoCal-Telethon.jpg?w=804&h=452&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-22T00:13:40.000Z",
    "description": "\n\tIn the wake of the Trump administration’s defunding of public broadcasting, local stations PBS SoCal (KOCE and KCET) are planning a telethon next we",
    "body": "\n\tIn the wake of the Trump administration’s defunding of public broadcasting, local stations PBS SoCal (KOCE and KCET) are planning a telethon next week from the PBS outfit’s Burbank Studios home. “We ❤ Public Television!” is billed as a live, three hour telethon “honoring 55 remarkable years of public television – America’s trusted, free public media service that reaches every city, town and rural community across the nation.​.. This program celebrates the extraordinary musical artists and personalities who have graced PBS stages and screens, showcasing the cultural richness that public media and local PBS stations offer all Americans.”\n\t\n\n\tSet to take place on Saturday, Nov, 8 at 4 p.m. PT, Rickey Minor will serve as music director for the telecast. Guests right now are scheduled to include Josh Groban, Jamie Lee Curtis, Ken Burns, Ziggy Marley, Lily Tomlin, Henry Louis Gates, Jr., Marlee Matlin, Nicholas Ralph, Noel Paul Stookey, Rick Steves, David Foster and Katharine McPhee, Adam Arkin, Courtney Vance, Martha Plimpton, Joe Bonamassa, Sheléa, Jesse Cook, Judy Blume, Celtic Woman, Sarah Silverman, Mychal the Librarian, Lindsey Stirling and more. \n\n\n\tThe telethon will also feature performances from Nashville PBS including Kathy Mattea, Sierra Hull, Molly Tuttle and Ketch Secor.  \n\n\tAfter its initial broadcast on PBS SoCal, “We ❤ Public Television” will air on PBS stations across the country on Thursday, Nov. 27 (Thanksgiving night). It will also be available on the PBS app from Nov. 27 to Dec. 24. Additionally, PBS SoCal will rebroadcast the event on Thanksgiving night at 7 p.m. PT.\n\t\n\n\t“This telethon is going to be a giant lovefest celebrating public television,” said Maura Daly Phinney, who is serving as exec producer of the telethon for PBS SoCal. “We will feature great music, some classic clips from viewers’ favorite PBS series and a few surprises. Every contribution that viewers make will go to their local public television station and help them fill the gap created by the loss of our federal funding.”\n\n\tBesides the live musical performances and celebrity appearances, “We ❤ Public Television!” will include viewer testimonials and archival material from public television shows including “Masterpiece,” “Austin City Limits,” “Great Performances” and “Sesame Street.” \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Josh Groban, Jamie Lee Curtis Among Stars to Appear on PBS SoCal Telethon Supporting Public TV In Wake of Trump’s Elimination of Funding",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/PBS-SoCal-Telethon.jpg?w=804&h=452&crop=1"
      ],
      "datePublished": "2025-10-22T00:13:40.000Z",
      "dateModified": "2025-10-22T00:13:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Yamada Yoji to Receive Lifetime Achievement Award at Tokyo Film Festival",
    "url": "https://variety.com/2025/film/festivals/yamada-yoji-lifetime-achievement-award-tokyo-film-festival-1236557566/",
    "image": "https://variety.com/wp-content/uploads/2025/10/Yamada-Yoji.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-21T23:00:00.000Z",
    "description": "\n\tThe Tokyo International Film Festival has revealed that veteran Japanese director Yamada Yoji will receive the Lifetime Achievement Award at its 38t",
    "body": "\n\tThe Tokyo International Film Festival has revealed that veteran Japanese director Yamada Yoji will receive the Lifetime Achievement Award at its 38th edition, recognizing a career spanning more than 60 years and 91 films.\n\n\tYamada’s latest work, “Tokyo Taxi,” starring Baisho Chieko and Kimura Takuya, based on the 2023 French film “Driving Madeleine,” will screen as this year’s TIFF Centerpiece and receive theatrical release on Nov. 21. The director will also participate in a talk session with “Kokuho” director Lee Sang-il at the TIFF Lounge.\n\t\n\n\tAs previously announced, legendary Japanese actor Yoshinaga Sayuri will also be honored with the Lifetime Achievement Award. \n\n\n\tSince his 1961 directorial debut with “Nikai no tanin,” Yamada has created films deeply rooted in Japanese culture and everyday life. His most celebrated work remains the “Tora-san” series (“Tora-san, Our Lovable Tramp”), which ran to 50 films beginning in 1969 and earned Guinness World Records recognition. \n\n\tThe director shifted to period films in the 2000s with significant international success. “The Twilight Samurai” (2002) swept 15 categories at the Japan Academy Film Prizes and earned an Oscar nomination for best foreign language film, as the category was known then. “The Hidden Blade” (2004) competed at Berlin and won top honors at the Zimbabwe International Film Festival, while “The Little House” (2014) took home the Silver Bear at the Berlinale.\n\n\tYamada’s recent work includes “Tora-san, Wish You Were Here” (2019), which marked the series’ 50th anniversary, followed by “It’s A Flickering Life” (2021) and “Mom, Is That You?!” (2023).\n\t\n\n\t“Yamada Yoji has long observed the realities of Japanese society with a discerning yet compassionate eye, crystallizing them into numerous cinematic masterpieces over the decades,” said TIFF chair Ando Hiroyasu in a statement. He noted Yamada’s support of the festival since its inception and his recent service as chair of the Kurosawa Akira Award Jury.\n\n\tThe director’s honors include Japan’s Order of Culture (2012), recognition as a Person of Cultural Merit (2004), and designation as an Honorary Citizen of Tokyo (2014).\n\n\tThe 38th Tokyo International Film Festival runs Oct. 27-Nov. 5 in the Hibiya-Yurakucho-Marunouchi-Ginza area.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Yamada Yoji to Receive Lifetime Achievement Award at Tokyo Film Festival",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/Yamada-Yoji.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-21T23:00:00.000Z",
      "dateModified": "2025-10-21T23:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Mariska Hargitay Auditioned for ‘Friends’ and ‘Tested So Many Times’; She Only Wanted to Do Comedy Until a Psychic Said It Wouldn’t Make Her Famous: ‘Six Months Later’ I Got ‘SVU’",
    "url": "https://variety.com/2025/tv/news/mariska-hargitay-friends-audition-comedy-1236557977/",
    "image": "https://variety.com/wp-content/uploads/2025/10/P1027ZS9.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-21T22:34:54.000Z",
    "description": "\n\tMariska Hargitay appeared on Amy Poehler’s “Good Hang” podcast and revealed she auditioned and screen tested many times for “Friends” a few years be",
    "body": "\n\tMariska Hargitay appeared on Amy Poehler’s “Good Hang” podcast and revealed she auditioned and screen tested many times for “Friends” a few years before landing the role of Olivia Benson on “Law & Order: Special Victims Unit.” Both shows are NBC staples.\n\n\t“I did a lot of comedy auditions,” Hargitay told Poehler (via The Daily Beast). “I did ‘Seinfeld’ and I did ‘Single Guy,’ and I tested for ‘Friends’ so many times. I think for Monica. I always thought I would end up being on a sitcom or doing comedy.” \n\t\n\n\tEven when more dramatic roles came her way, Hargitay said: “I was like, I want to do drama but it has to be funny because that’s what I felt like my gifts were… [I would tell people], ‘I’m going to be a comedian because I’m funny and I’m pretty.’”\n\n\n\tHargitay’s reveal may surprise some. The actor has been playing Olivia Benson on “SVU” for more than 25 years, which makes her the longest-running character in live-action primetime TV history. It wasn’t until Hargitay consulted with a psychic that she was confronted with the possibility that comedy might not work out.\n\n\t“I’m in L.A., [a] struggling actor [wondering] what am I going to do?” Hargitay said. “I came to New York, which I did three times a year to see theater. And then I met with this psychic. Everyone said to me, ‘Oh my gosh, Mariska, you have to meet with this psychic. He’s amazing.’ … I drove out somewhere on Long Island to this man and I went there and he started saying all this amazing stuff to me.”\n\n\t“I was listening to him really intently like this. He said to me… ‘You see that face you’re doing right now? You see that face?’ I said, ‘Yeah.’ He goes, ‘You’re going to be famous for that face. You’re moving to New York and you’re gonna be famous for that face,’” Hargitay continued, noting she still wanted to land a network sitcom role at the time. “I said, ‘Uh, no.’ I live in L.A. and I’m going to be a comedian. Six months later, swear to God… I got ‘SVU.’”\n\t\n\n\tWatch Hargitay’s full interview on the “Good Hang” podcast in the video below.\n\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Mariska Hargitay Auditioned for ‘Friends’ and ‘Tested So Many Times’; She Only Wanted to Do Comedy Until a Psychic Said It Wouldn’t Make Her Famous: ‘Six Months Later’ I Got ‘SVU’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/P1027ZS9.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-21T22:34:54.000Z",
      "dateModified": "2025-10-21T22:34:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ben Stiller Donates Stiller and Meara Archive to National Comedy Center as Apple TV Documentary ‘Nothing Is Lost’ Premieres",
    "url": "https://variety.com/2025/tv/news/ben-stiller-meara-archive-comedy-center-apple-documentary-1236558414/",
    "image": "https://variety.com/wp-content/uploads/2025/10/Stiller__Meara_Nothing_is_Lost_Poster_0101.jpg?w=692&h=390&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-22T01:04:30.000Z",
    "description": "\n\tBefore Ben Stiller made his mark on film, television and comedy, his parents, Jerry Stiller and Anne Meara, were an unstoppably uproarious duo. Over",
    "body": "\n\tBefore Ben Stiller made his mark on film, television and comedy, his parents, Jerry Stiller and Anne Meara, were an unstoppably uproarious duo. Over a joint career that spanned five decades, Stiller and Meara collaborated on several television shows, TV specials and recordings, making America laugh up until their respective deaths in 2020 and 2015. Now, Ben Stiller is further cementing their legacy by donating their career archive to the National Comedy Center ahead of the release of his documentary film “Stiller & Meara: Nothing Is Lost” on Apple TV.\n\t\n\n\tStiller and Meara curated the archive themselves, preserving public and personal artifacts from their long careers and private lives. It contains artifacts from early improv sessions at Chicago’s Compass Players, love letters that they exchanged while dating, and handwritten drafts of iconic sketches that made it onto world famous stages, among them “The Ed Sullivan Show,” “The Tonight Show Starring Johnny Carson” and “The Carol Burnett Show.”\n\n\n\t“Knowing my parents’ body of work is preserved at the National Comedy Center means a great deal, because the material they left behind was not just a gift for my family, but for anyone who wants to understand comedy as a creative process,” Stiller said of the donation. “They would have been very proud to know that the National Comedy Center is bringing their archive to life in a way that can inspire and educate future generations.”\n\n\tHead of the National Comedy Center’s archive Dr. Laura LaPlaca adds, “Stiller and Meara’s archive contains tens of thousands of pages spanning a remarkable body of work. Their comedy was crafted to feel organic, but they were serial editors – sometimes carrying a single sketch across decades of iteration and refinement.”\n\t\n\n\tThe donation comes in tandem with the release of “Stiller & Meara: Nothing Is Lost.” Directed and produced by Ben Stiller, the doc chronicles his parent’s personal, professional and creative partnership and the lasting impact they had on American comedy. The film premiered at the New York Film Festival on Oct. 5 and releases on Apple TV on Oct. 26.\n\n\tSelect pieces of the Stiller & Meara archive will be on display at the National Comedy Center’s facility in Jamestown, N.Y.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ben Stiller Donates Stiller and Meara Archive to National Comedy Center as Apple TV Documentary ‘Nothing Is Lost’ Premieres",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/Stiller__Meara_Nothing_is_Lost_Poster_0101.jpg?w=692&h=390&crop=1"
      ],
      "datePublished": "2025-10-22T01:04:30.000Z",
      "dateModified": "2025-10-22T01:04:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Indonesia’s JAFF Future Project Unveils 10 Asia-Pacific Titles, Renews Adelaide Partnership",
    "url": "https://variety.com/2025/film/markets-festivals/jaff-future-project-asia-pacific-titles-1236558502/",
    "image": "https://variety.com/wp-content/uploads/2025/10/Our-Son.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-22T07:00:00.000Z",
    "description": "\n\tJAFF Market 2025 has unveiled its second edition lineup for the JAFF Future Project, featuring 10 fiction and documentary titles spanning the Asia-P",
    "body": "\n\tJAFF Market 2025 has unveiled its second edition lineup for the JAFF Future Project, featuring 10 fiction and documentary titles spanning the Asia-Pacific region. The selection showcases a roster of established and emerging filmmakers whose works reflect the region’s evolving narratives and cross-border collaboration potential.\n\n\tSet to run Nov. 29-Dec. 1 at the Jogja Expo Center in Yogyakarta, Indonesia, the initiative is part of the broader 20th-anniversary celebration of the Jogja-Netpac Asian Film Festival (JAFF). The Future Project functions as both a development platform and co-production hub, designed to advance independent works toward completion and distribution.\n\t\n\n\tAmong the notable names in this year’s lineup are acclaimed Korean director Park Kiyong, who returns to filmmaking with “Ghost Island,” produced by Ho Yuhang. Ho’s own project “The Silent Village” captured two prizes at last year’s Future Project. Indonesian filmmaker Eddie Cahyono follows up his award-winning feature “Siti,” which screened at Telluride, with “My Mother.” Australian director Aaron Wilson, whose films “Canopy” and “Little Tornadoes” played the international festival circuit, presents “Under the Banyan Moon.”\n\n\n\tThe selection process drew from an open call held Aug. 1-Sept. 1, attracting submissions from across the region. A selection committee comprising filmmaker-comedian Ernest Prakasa, producers Fauzan Zidni and Tia Hasibuan evaluated projects based on storytelling strength, creative vision, feasibility and market readiness.\n\n\tFor the second consecutive year, JAFF Future Project has renewed its partnership with the Adelaide Film Festival and Mylab, extending pathways for creative exchange between Asia and Australia.\n\t\n\n\t“In this second-year partnership, we continue to open pathways for filmmakers across Asia and Australia to engage in meaningful exchange in sustaining the region’s independent film ecosystem,” said Mat Kesting, chief executive and creative director of the Adelaide Film Festival.\n\n\tLorna Tee, JAFF Market advisor and Mylab curator, added: “Together with JAFF Market’s commitment to supporting early-stage projects, we are helping build a more connected creative landscape across the Asia-Pacific.”\n\n\tThroughout the three-day market, participating filmmakers will present their works in curated pitching sessions and one-on-one meetings with producers, investors and industry partners. \n\n\tSelected participants will compete for awards totaling more than $74,000 in cash and production support. Cash prizes include the Visinema Awards ($3,000 for two projects) and The United Team of Arts Awards ($6,000 for one project). Production and post-production packages include the Brandlink Awards ($30,000 in equipment facilities for two projects), Kongchak Awards (sound design facility valued at $10,000), White Light Awards (color grading and mastering valued at $15,000) and Prodigihouse Ecosystem Awards (editing and color grading valued at $10,000).\n\n\t“Our selection process goes beyond curating stories,” said Linda Gozali, market director of JAFF Market. “It’s about identifying creators who can inspire new partnerships and push their projects toward realization. Through JAFF Future Project, we see this as a long-term investment in creative infrastructure, one that connects filmmakers to international networks, development labs and co-production partners, ensuring that promising ideas don’t remain on paper but evolve into impactful works.”\n\n\tThe initiative’s impact is already visible in its alumni success. “Pangku” (On Your Lap), the directorial debut of Indonesian actor Reza Rahadian, emerged from last year’s Future Project after winning the White Light Post-Production Award. The film was selected for HAF Goes to Cannes at the Marché du Film and earned four major awards at the 2025 Busan International Film Festival.\n\n\tJAFF Market 2025 is powered by Amar Bank. The Jogja-Netpac Asian Film Festival runs Nov. 29-Dec. 6.\n\n\tJAFF FUTURE PROJECT 2025 – FULL PROJECT LINEUP\n\t\n\n\t“A Life Full of Holes” (Development)\n\n\tA teenage girl travels abroad to reunite with her mother, a migrant worker, only to discover she has died and left behind a child from a troubled relationship.\n\n\tCountry: Indonesia | Director: Loeloe Hendra Komara | Producers: Indra Yudhitya, Dewi Umaya, Loeloe Hendra Komara | Production Company: Onomastika Films\n\n\t“Evil Underground” (Development)\n\n\tTwo estranged sisters must overcome their fractured bond to escape shape-shifting entities in the basement of an old trade center after performing a deadly ritual.\n\n\tCountry: Indonesia | Director: Adriyanto Dewo | Producers: Perlita Desiani, Tina Arwin | Production Company: Relate Films\n\n\t“Ghost Island” (Development)\n\n\tWhen her husband disappears during their honeymoon on Jeju Island, an Indonesian woman’s search uncovers parallel Cold War massacres in Korea and Bali.\n\n\tCountries: South Korea, Malaysia, Indonesia | Director: Park Kiyong | Producers: Park Kiyong, Ho Yuhang | Production Company: Paperheart Sdn Bhd\n\n\t“Ibu” (Development)\n\n\tAn unfulfilled filmmaker returns from Los Angeles to Yogyakarta after her stepfather’s death, where clashing with her domineering mother forces her to confront the silence in her marriage.\n\n\tCountries: Indonesia, United States | Director: Kanya Iwana | Producer: Zack Rice | Production Company: Feed You Films\n\n\t“Rose Pandanwangi” (Development)\n\n\tA gifted Indonesian soprano returns home in the 1950s to start over, but as her marriage falters and unrest grows, she must choose between family, true love and her musical ambitions.\n\n\tCountries: Indonesia, Philippines | Director: Razka Robby Ertanto | Producers: Razka Robby Ertanto, Kristine de Leon, Chelsea Islan | Production Company: Summerland\n\n\t“To My Dearest, My Dear…” (Development)\n\n\tAfter his cancer returns, Adam discovers a way to travel through time to meet the daughter he never lived to see, attempting to heal old wounds before time slips away.\n\n\tCountry: Indonesia | Director: Netanya Yemima | Producers: Bela Nabila, Bayu Arief | Production Company: Doa Ibu Frameworks\n\n\t“Under the Banyan Moon” (Development)\n\n\tAn Australian schoolteacher journeys to Indonesia after ending her engagement, where a reunion with her first love and connection with his enigmatic best friend force her to choose between nostalgia and a new future.\n\t\n\n\tCountries: Australia, Indonesia | Director: Aaron Wilson | Producer: Aaron Wilson | Production Company: Left-Handed Productions\n\n\t“Aluk” (Work-in-Progress)\n\n\tAn observational documentary traces three generations of a family in Tana Toraja over seven years as they reckon with the loss of their patriarch and their community’s uncertain future amid rapid transformation.\n\n\tCountries: Australia, Indonesia | Director: Chris C.F | Producers: Sam Hewison, Wahyu Al Mardhani | Production Company: Cut By Dog Production\n\n\t“My Mother” (Work-in-Progress)\n\n\tA widow wants to meet her daughter who has been sentenced to death in Saudi Arabia for murdering her employer, but the daughter refuses, having never forgiven her mother for past betrayals.\n\n\tCountry: Indonesia | Director: Eddie Cahyono | Producers: Tika Bravani, Eddie Cahyono, Isabelle Glachant | Production Companies: ANP Talenta Media, Memorieslight Pictures, Yasa Buana Film, Knockonwood.inc, Sasha & Co Production\n\n\t“Our Son” (Work-in-Progress)\n\n\tTwo childless married couples raise an unexpected son from an illicit affair between the two households, and amidst the chaos of a paternity reveal, the two wives take parenting into their own hands.\n\n\tCountry: Indonesia | Director: Luhki Herwanayogi | Producer: Iqbal Mohammad Hamdan | Production Company: Catchlight Pictures\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Indonesia’s JAFF Future Project Unveils 10 Asia-Pacific Titles, Renews Adelaide Partnership",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/Our-Son.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-22T07:00:00.000Z",
      "dateModified": "2025-10-22T07:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘The Hand That Rocks The Cradle’ Review: A Thriller Remake That Makes Promises It Can’t Keep",
    "url": "https://variety.com/2025/film/reviews/the-hand-that-rocks-the-cradle-review-hulu-remake-1236557979/",
    "image": "https://variety.com/wp-content/uploads/2025/10/hand-rocks-cradle.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-22T05:30:00.000Z",
    "description": "\n\tWith a near-total re-imagining of its source material, Michelle Garza Cervera’s “The Hand That Rocks The Cradle” layers contemporary political theme",
    "body": "\n\tWith a near-total re-imagining of its source material, Michelle Garza Cervera’s “The Hand That Rocks The Cradle” layers contemporary political themes atop Curtis Hanson’s original 1992 domestic thriller, about an uncanny nanny invading the sanctity of the American home. The remake, releasing directly to Hulu, turns the structure of Amanda Silver’s original screenplay inside out, introducing a mystery element to its antagonist’s motives and imbuing the eerie saga with sensibilities that threaten to blossom into delightfully lurid camp. Unfortunately, the piece ends up laid low by a climax that peters out by taking itself too seriously, but the film’s totality is still made worthwhile by its central performances.\n\t\n\n\tPenned by Micah Bloomberg, the 2025 version opens with a harrowing flashback of a young blonde girl watching a housefire ravage a family, before the movie hard-cuts to two blonde adults in the modern day, racking focus between them but obscuring the exact connection between past and present. Unlike the original, which had its inciting incident take place during the story’s telling, Garza Cervera’s version plants the seeds for a much deeper connection between the desperate au pair Polly (Maika Monroe) and the pregnant corporate lawyer whose pro bono help she seeks for a landlord dispute, Caitlyn Morales (Mary Elizabeth Winstead). Polly, who drops hints about her past work raising children, harbors a discomforting, subdued melancholy beneath her personable demeanor, which tipping off viewers to the fact that her intentions may not be all that they seem.\n\t\n\n\tMonths later, after Caitlyn has given birth to her second child, a seemingly chance encounter at a farmer’s market leads to her hiring Polly as a nanny. Polly is charged with caring for Caitlyn’s new baby, Josie, and her ten-year-old daughter Emma (Mileiah Vega), as the husband Miguel (Raúl Castillo) is distracted with various meetings. Polly seems like the perfect fit, firmly on the same page as Caitlyn when it comes to her distinctly modern parenting idiosyncrasies about trans fat and the likes. In fact, she’s too good to be true — a fantasy that slowly unravels in ways that make Caitlyn question her sanity.\n\n\tAs in Hanson’s original, the camera makes us privy to the various methods by which Polly subtly gaslights Caitlyn, exerting an increasing amount of control as she worms her way into her life (and her sleek modernist home) while earning Emma and Miguel’s trust. The major difference, however, is that the “why” of it all is something we’re left to unravel alongside Caitlyn, as well her bougie best friend Stewart (Martin Starr) who tries to protect her.\n\n\tThis simmering plot is made all the more magnetic by a brand-new queer subtext. On one hand, Polly tries to lure Caitlyn’s gaze, making her wonder if she’s happy in her heterosexual marriage; both women are out of the closet, but the target in turn becomes Caitlyn’s relatively traditional domesticity. On the other hand, and in tandem with the aforementioned advances, Polly also leads Caitlyn to believe she might be having inappropriate conversations — or something more sinister — with her eldest daughter, who boldly expresses burgeoning questions about her gender and sexuality, thus inducing conservative fears of LGBTQ predation (a similarly conservative fear of Black men as predators was a key point in the original). This makes for a wildly alluring and distinctly charged flip to the original story, and helps induce more subtle horrors for Caitlyn; she’s left to interpret things, rather than discover them, sending her tumbling into a grey area of uncertainty.\n\n\tWinstead’s overly cautious mother fights to maintain the lavish façade she’s created with her husband — which plays into themes of how wealth protects people, granting the destitute Polly an empathetic class position even before we know her story. Until that point, Monroe carries her character with a festering sadness, making Polly all the more interesting to watch as she subtly manipulates Caitlyn from the shadows. \n\t\n\n\tAlso, it must be said that Vega turns in remarkable work as a bitter adolescent who doesn’t receive the attention she wants (or needs) from her mother at a time in her life when she most needs it. It’s a performance that might bring to mind a young Jenna Ortega. The cast is phenomenal, and Garza Cervera (thanks to Jo Willems’ focused cinematography) captures them through refractions and reflections throughout the setting’s glass exteriors, making them feel discombobulated in service of crafting psychological tension and a suitably gloomy atmosphere.\n\n\tWith all these pieces in play, the result ought to be a surefire hit, but there’s also a hesitancy to “The Hand That Rocks The Cradle” that prevents it from going full-tilt. The fears with which it toys are, eventually, dropped onto the premise in the form of enormous reveals expressed not through action, but thuddingly literal dialogue. Although Winstead and Monroe are immensely capable at making exposition intriguing, the nature of the film’s final act lets the air out at least a little (despite plentiful bloodshed), leading to a conclusion that cuts off right as things begin to escalate. It’s a fantastic build without much by way of release — whether delicious or cathartic — which can’t help but point toward creative hesitancy.\n\n\tThe film’s various social themes are serious, or important, or insert-your-own-buzzy-label-here. But for the most part, they fuel a pulpy melodrama about “a woman gone mad” (i.e. a woman made to question her sanity). This premise certainly walks a retrograde line, but it ends up pulled from the brink — not by thoughtful subversion or some unique formalism from a more enlightened perspective, but rather by pumping the brakes and explaining the story’s most unpleasant aspects in words. It’s the morally correct view on the vicious immoralities the story reveals. But gosh, the movie’s final act is just no fun to watch, despite its promising operatic delights.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘The Hand That Rocks The Cradle’ Review: A Thriller Remake That Makes Promises It Can’t Keep",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/hand-rocks-cradle.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-22T05:30:00.000Z",
      "dateModified": "2025-10-22T05:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Dancing With the Stars’ Wicked Night: Emotional Routines Lead to First 10s of the Season",
    "url": "https://variety.com/2025/tv/news/dancing-with-the-stars-scott-hoying-eliminated-wicked-night-1236558064/",
    "image": "https://variety.com/wp-content/uploads/2025/10/568173022_18548032318048977_8656344671555023256_n.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-22T01:59:30.000Z",
    "description": "\n\tOne couple was changed for good during “Dancing With the Stars” Wicked Night.\n\n\tThe Oct. 21 episode welcomed director John M. Chu as the guest judge",
    "body": "\n\tOne couple was changed for good during “Dancing With the Stars” Wicked Night.\n\n\tThe Oct. 21 episode welcomed director John M. Chu as the guest judge as pairs danced to hit songs from “Wicked” — with some taking on Elphaba and some taking Glinda.\n\n\tThis week’s scores were combined with last week’s dedication night. Last week, Carrie Ann Inaba recieved a bit of backlash for her criticism on certain pairs, but this week, she gave the first 10 of the season. The score came for Whitney Leavitt and Mark Ballas’ quickstep. The other judges, with the exception of Derek Hough who went with a 9, agreed with Inaba. At the end of the night, Jordan Chiles and Ezra Sousa also received three 10s and one nine — Hough is saving his 10 paddle — for their stunning rumba.\n\t\n\n\tHough pointed out after Andy Richter and Emma Slater’s jazz routine that it’s the last week, “so we’ll see,” and ultimately gave him a 6. The other judges, however, were more impressed, with the rest giving him 7s.\n\n\n\tLast week, Inaba told Danielle Fishel and Pasha Pashkov that their dances were starting to look the same. This week, she applauded Fishel’s courage and said this was her breakthrough dance. Bruno Tonioli said it was “the most difficult song to choregraph” and Hough complimented the difficulty of the routine, calling it “magnificent.” The scores of four 9s gave them a huge boost on the leaderboard. \n\n\tBut it was Elaine Hendrix and Alan Bersten’s contemporary routine to “Defying Gravity” that left everyone (including Bersten) in tears and on their feet. “I am 54, I am injured and I just did that,” she said after the dance through tears. She landed four 9s for the powerful routine.\n\t\n\n\tAfter all the dances and the scores combined from the last two weeks, Richter remained on the bottom of the leaderboard, with Leavitt returning to the top. Once the votes were added in — the show hit 100 million votes over the last two weeks —  Scott Hoying was sent home.\n\n\tHere’s a full list of scores from Wicked Night:\n\n\tScott Hoying and partner Rylee ArnoldDance: Contemporary to “The Wizard And I”Score: 28/40\n\n\tAlix Earle and partner Val ChmerkovskiyDance: Jazz to “What Is This Feeling?”Score: 35/40\n\n\tRobert Irwin and partner Witney CarsonDance: Jazz to “Dancing Through Life”Score: 36/40\n\n\tWhitney Leavitt and partner Mark BallasDance: Quickstep to “Popular”Score: 39/40\n\n\tDylan Efron and partner Daniella KaragachDance: Rumba to “I’m Not That Girl”Score: 32/40\n\n\tAndy Richter and partner Emma SlaterDance: Jazz to “One Short Day”Score: 27/40\n\n\tElaine Hendrix and partner Alan BerstenDance: Contemporary to “Defying Gravity ”Score: 36/40\n\n\tJen Affleck and partner Jan RavnikDance: Foxtrot to “As Long as You’re Mine”Score: 32/40\n\n\tDanielle Fishel and partner Pasha PashkovDance: Argentine Tango to “No Good Deed”Score: 36/40\n\n\tJordan Chiles and partner Ezra SosaDance: Rumba to “For Good”Score: 39/40\n\n\tThe next “Dancing With the Stars” episode will be Halloween night, airing Oct. 28 at 8 p.m. ET on ABC and Disney+, streaming the next day on Hulu.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Dancing With the Stars’ Wicked Night: Emotional Routines Lead to First 10s of the Season",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/568173022_18548032318048977_8656344671555023256_n.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-22T01:59:30.000Z",
      "dateModified": "2025-10-22T01:59:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bryant Gumbel Hospitalized, Taken by Ambulance From NYC Home",
    "url": "https://www.tmz.com/2025/10/21/bryant-gumbel-hospitalized-nyc/",
    "image": "https://imagez.tmz.com/image/35/16by9/2025/10/21/35d331c4c12b498abae431ef5e245d83_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-21T19:56:38.000Z",
    "description": "\n    \n                    \n                          Bryant Gumbel\n                          Hospitalized in NYC\n                      \n              ",
    "body": "\n    \n                    \n                          Bryant Gumbel\n                          Hospitalized in NYC\n                      \n                  \n                        Published October 21, 2025 12:56 PM PDT\n                                                                      |\n                Updated October 21, 2025 3:47 PM PDT\n                                    \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Bryant Gumbel is currently hospitalized in NYC after some sort of \"medical emergency\" ... TMZ has learned.\n      \n    \n          Sources with direct knowledge tell us, the former \"Today\" cohost was transported Monday, just after 9 PM, from his Manhattan apartment building.\n      \n    \n          We're told first responders had Bryant on a gurney, as they left the building and took him to a nearby hospital where he remains as of Tuesday afternoon.\n      \n\n                  \n          \n                          \n                \n                  \n      \n    \n          It's unclear what happened to the 77-year-old broadcasting legend, but we know he is still getting treatment. We've reached out to his reps for comment ... so far, no word back.\n      \n    \n          We spoke to a family member, who told us Bryant is \"okay,\" but wouldn't reveal any further detail about his condition.\n      \n    \n          Bryant formerly served as cohost of NBC's long-running morning show for 15 years -- first with Jane Pauley and Katie Couric. He was also a sportscaster and host of HBO's acclaimed investigative series \"Real Sports with Bryant Gumbel\".\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          His older brother, Greg -- who was also a broadcaster, primarily in sports -- died last year at 78.\n      \n    \n          Story developing ...\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Today Show\n              \n                          \n                TMZ Sports\n              \n                          \n                Nurse!\n              \n                          \n                Fairly Legal\n              \n                          \n                Health\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bryant Gumbel Hospitalized, Taken by Ambulance From NYC Home",
      "image": [
        "https://imagez.tmz.com/image/35/16by9/2025/10/21/35d331c4c12b498abae431ef5e245d83_xl.jpg"
      ],
      "datePublished": "2025-10-21T19:56:38.000Z",
      "dateModified": "2025-10-21T19:56:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Slasher World In West Hollywood -- Spooky For Halloween!",
    "url": "https://www.tmz.com/2025/10/22/slasher-world-in-west-hollywood-spooky-for-halloween/",
    "image": "https://imagez.tmz.com/image/88/16by9/2025/10/20/88e0624547324ac596a6236bce7001f9_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-22T07:15:31.000Z",
    "description": "\n    \n                    \n                          Halloween\n                          Slasher World Scares Up a Killer Good Time\n                  ",
    "body": "\n    \n                    \n                          Halloween\n                          Slasher World Scares Up a Killer Good Time\n                          ... In West Hollywood\n                      \n                  \n                        Published October 22, 2025 12:15 AM PDT\n                                                                            \n      \n    \n          Halloween is right around the corner, and it's always a scary good time at L.A.'s Slasher World.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Check out the pics ... the West Hollywood hotspot is bustin' out all the classics for All Hallows' Eve.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          The horror immersive retail and events space puts you right in the kitchen with the Ghostface Killer from \"Scream\" or on a brisk night walk on Elm Street with Freddy Krueger.\n      \n\n                  \n          \n                          \n                \n                  \n      \n    \n          While you're there, you can also stop by their horror VHS immersive exhibit, Slashback Video!\n      \n    \n          Slash into our gallery above and see all the thrills!\n      \n      \n              \n          \n                          \n                Halloween\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Slasher World In West Hollywood -- Spooky For Halloween!",
      "image": [
        "https://imagez.tmz.com/image/88/16by9/2025/10/20/88e0624547324ac596a6236bce7001f9_xl.jpg"
      ],
      "datePublished": "2025-10-22T07:15:31.000Z",
      "dateModified": "2025-10-22T07:15:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Celebrity Butts -- Guess The Sandy Beach Buns!",
    "url": "https://www.tmz.com/2025/10/22/celebrity-butts-guess-whose-sandy-beach-buns/",
    "image": "https://imagez.tmz.com/image/01/16by9/2025/10/21/018c3dc875d54144a6c5a2dddf0561f5_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-22T07:30:58.000Z",
    "description": "\n    \n                    \n                          Celebrity Butts ...\n                          Guess The\n                          Sandy Beach Bun",
    "body": "\n    \n                    \n                          Celebrity Butts ...\n                          Guess The\n                          Sandy Beach Buns!\n                      \n                  \n                        Published October 22, 2025 12:30 AM PDT\n                                                                            \n      \n    \n          We've got a mid-week treat for you to uncover ... Can you guess which Hollywood hottie put her sandy buns on display in this eye-popping shot?! Here's a couple clues for you:\n      \n    \n          She played herself on HBO's hit show \"Entourage,\" and her breakthrough movie role was in the movie \"Honey.\"\n      \n    \n          To be quite honest, you should know who this brunette babe is ... Hit up the gallery for the reveal!\n      \n      \n              \n          \n                          \n                Summer/Beach\n              \n                          \n                Hotties & Bodies\n              \n                          \n                Hot Bodies\n              \n                          \n                Guess Who\n              \n                          \n                Photo Galleries\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Celebrity Butts -- Guess The Sandy Beach Buns!",
      "image": [
        "https://imagez.tmz.com/image/01/16by9/2025/10/21/018c3dc875d54144a6c5a2dddf0561f5_xl.jpg"
      ],
      "datePublished": "2025-10-22T07:30:58.000Z",
      "dateModified": "2025-10-22T07:30:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Guess The A-List Celebrity In This Shredded Shirtless Shot!",
    "url": "https://www.tmz.com/2025/10/21/guess-the-a-list-celebrity-in-this-shredded-shirtless-shot/",
    "image": "https://imagez.tmz.com/image/32/16by9/2025/10/21/326217bdd1eb434090d8807f66d5d35a_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-21T20:45:42.000Z",
    "description": "\n    \n                    \n                          A-List Celeb ...\n                          Shredded Shirtless Shot\n                          Gues",
    "body": "\n    \n                    \n                          A-List Celeb ...\n                          Shredded Shirtless Shot\n                          Guess Who!\n                      \n                  \n                        Published October 21, 2025 1:45 PM PDT\n                                                                            \n      \n    \n          Can you guess which famous rapper put his washboard abs on full display in this eye-popping shot?! Y'all should get this easy peasy ...\n      \n    \n          TMZ Sports covered his watch party during last night's Game 7 win, but if that's not clocking for you ... the hunk flashing his toned tummy is from Toronto!\n      \n    \n          Slide into the gallery for the reveal!\n      \n      \n      \n          \n            \n              \n                \n                Share on Facebook\n              \n            \n            \n              \n                \n                Share on X\n              \n            \n                          \n                \n                  \n                \n              \n                      \n        \n              \n          \n                          \n                Hotties & Bodies\n              \n                          \n                Hot Bodies\n              \n                          \n                Hip Hop\n              \n                          \n                Guess Who\n              \n                          \n                Photo Galleries\n              \n                          \n                Music\n              \n                      \n        \n          \n  ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Guess The A-List Celebrity In This Shredded Shirtless Shot!",
      "image": [
        "https://imagez.tmz.com/image/32/16by9/2025/10/21/326217bdd1eb434090d8807f66d5d35a_xl.jpg"
      ],
      "datePublished": "2025-10-21T20:45:42.000Z",
      "dateModified": "2025-10-21T20:45:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Lizzo Sued for Copyright Infringement",
    "url": "https://www.tmz.com/2025/10/21/lizzo-sued-for-copyright-infringement/",
    "image": "https://imagez.tmz.com/image/a5/16by9/2025/04/23/a55f9121be6942f3b394447b6af3152c_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-22T02:54:25.000Z",
    "description": "\n    \n                    \n                          Lizzo\n                          Sued for Copyright Infringement ...\n                          But",
    "body": "\n    \n                    \n                          Lizzo\n                          Sued for Copyright Infringement ...\n                          But Song Never Commercially Released\n                      \n                  \n                        Published October 21, 2025 7:54 PM PDT\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Lizzo is facing a new legal battle ... she's being sued for allegedly ripping off another artist's song for one of her latest tracks that blew up on social media.\n      \n    \n          According to a new lawsuit, obtained by TMZ, the GRC Trust is going after Lizzo and her label, Atlantic Records, claiming the singer sampled and copied parts of an original composition, \"Win or Lose (We Tried)\" it owns without permission.\n      \n    \n          Waiting for your permission to load TikTok Post.\n      \n    \n          GRC claims Lizzo's 2025 release \"I'm Goin' In Till October,\" also known as \"Good Jeans,\" dropped on TikTok and Instagram earlier this year and they claim lifts both instrumental and vocal elements from their copyrighted work.\n      \n    \n          A rep for Lizzi tells TMZ ... \"We are surprised that The GRC Trust filed this lawsuit. To be clear, the song has never been commercially released or monetized, and no decision has been made at this time regarding any future commercial release of the song.\"\n      \n\n          The lawsuit goes on to claim the parties tried to reach a deal to sample the work but never reached an agreement.\n      \n    \n          The trust is suing Lizzo and her label for copyright infringement, saying they knowingly used the composition for commercial gain without paying for a license. The trust wants damages and an injunction blocking the exploitation of its song.\n      \n    \n          It’s not the first song controversy for Lizzo … her 2019 hit \"Truth Hurts\" sparked a dispute after the producers claimed they co-wrote the song, while singer Mina Lioness said Lizzo lifted its viral \"100% that b*tch\" lyric from her 2017 tweet. Lizzo ultimately credited Mina.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Lizzo\n              \n                          \n                Hip Hop\n              \n                          \n                Music\n              \n                          \n                Fairly Legal\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lizzo Sued for Copyright Infringement",
      "image": [
        "https://imagez.tmz.com/image/a5/16by9/2025/04/23/a55f9121be6942f3b394447b6af3152c_xl.jpg"
      ],
      "datePublished": "2025-10-22T02:54:25.000Z",
      "dateModified": "2025-10-22T02:54:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]