[
  {
    "title": "Korean Film ‘The World of Love’ Secures Rare Chinese Distribution Deal (EXCLUSIVE)",
    "url": "https://variety.com/2025/film/news/korean-film-the-world-of-love-chinese-distribution-deal-1236556064/",
    "image": "https://variety.com/wp-content/uploads/2025/10/World-of-Love.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-20T00:00:00.000Z",
    "description": "\n\tKorean film “The World of Love” has secured a Chinese distribution deal with Light Films Limited, marking a significant breakthrough in a market tha",
    "body": "\n\tKorean film “The World of Love” has secured a Chinese distribution deal with Light Films Limited, marking a significant breakthrough in a market that has been largely closed to Korean cinema for nearly a decade.\n\n\tThe acquisition by Light Films Limited represents a rare achievement in the current landscape, as “Oh! My Gran” was the only Korean film to receive an official Chinese theatrical release in the past 10 years, when it opened in 2021.\n\t\n\n\tThe Chinese distributor specializes in arthouse cinema, with a track record of curating international film festival standouts. Its notable acquisitions include Kim Do-young’s “Kim Ji-Young: Born 1982,” Kore-eda Hirokazu’s “Nobody Knows,” and Bong Joon Ho’s “Parasite.”\n\n\n\t“The perspective of this feminist film is refreshingly new,” said Li Na, CEO of Light Films. “While it explores trauma and its lasting impact, its underlying tone is warm and uplifting, which makes it all the more moving and encouraging.”\n\n\tDirected by Yoon Ga-eun, acclaimed for “The World of Us” (Berlinale 2016) and “The House of Us” (BFI London 2019), the drama centers on 17-year-old Lee Jooin (Seo Su-bin), an unpredictable high school student whose angry outburst creates ripple effects throughout her world.\n\n\tThe film world premiered at the Toronto Film Festival and took home both the Roberto Rossellini Awards Jury Prize and the People’s Choice Award in the Pingyao International Film Festival‘s Crouching Tigers section. Chinese interest surged following the festival’s Asian premiere, with strong buzz and reviews from local audiences on platforms including Douban.\n\t\n\n\tThe film is produced by Semosi and Vol Media, with Barunson E&A — the South Korean studio behind Oscar-winning “Parasite” and Kim Jee-woon’s Cannes title “Cobweb” — serving as both presenting studio and sales agent.\n\n\tThe Chinese deal joins previously announced distribution agreements with veteran Japanese distributor Bitters End, Hong Kong’s Edko Films, and Taiwan’s Andrews Film across key Asian territories.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Korean Film ‘The World of Love’ Secures Rare Chinese Distribution Deal (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/World-of-Love.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-20T00:00:00.000Z",
      "dateModified": "2025-10-20T00:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘The Choral’ Review: Ralph Fiennes Conducts a Sweet-Sounding but Gently Rebellious Anti-War Oratorio",
    "url": "https://variety.com/2025/film/news/the-choral-review-ralph-fiennes-1236556557/",
    "image": "https://variety.com/wp-content/uploads/2025/10/the-choral-01.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-19T20:19:07.000Z",
    "description": "\n\t“God Save the King” has never been the loveliest or most melodic of national anthems, and its somewhat chiding, aggressive tenor is brought to the f",
    "body": "\n\t“God Save the King” has never been the loveliest or most melodic of national anthems, and its somewhat chiding, aggressive tenor is brought to the fore early in “The Choral.” Upon delivery of some good news from the front in the grim midst of the First World War, an English village choir’s lusty, spontaneous rendition of the song disrupts their rather shabbier rehearsal of Edward Elgar’s complex, haunting oratorio “The Dream of Gerontius,” prompting refined choirmaster Dr. Henry Guthrie (Ralph Fiennes) to roll his eyes to the back of his head. “If only you sang Elgar with the confidence you sing the national anthem,” he mutters. Art counts for a lot more than patriotism to Guthrie, and the happy surprise of Nicholas Hytner‘s film — despite its twee, veddy English trappings — is that it largely takes his side.\n\t\n\n\tPerhaps that’s not such a surprise. “The Choral” is, after all, the first original screenplay in over 40 years by Alan Bennett, a 91-year-old national treasure whose place in the British cultural firmament has never been tidily defined: A queer, agnostic, working-class Northerner, he’s a staunch royalist who declined a knighthood, and whose politics have traveled along a spectrum he once described as “conservative socialism.” Many of those contrasts and conflicts are present in “The Choral” — some for better, some for worse, but quite interestingly in all cases — even if Hytner, the director who previously filmed Bennett’s scripts for “The Madness of King George,” “The History Boys” and “The Lady in the Van,” gives the overall package a deceptively buttery gloss of tea-and-crumpets nostalgia.\n\t\n\n\tAt first glance, the film seems a twinkly fusion of two brands of British feelgood crowdpleaser: the keep-calm-and-carry-on portrait of wartime resilience, and the let’s-put-on-a-show underdog story, like “The Full Monty” with the radio dial tuned to “Land of Hope and Glory” rather than “You Sexy Thing.” The year is 1916, the setting the picturesque (and fictional) Yorkshire mill town of Ramsden — the rolling hills and cobbled, honey-filtered streets of which seem safely sheltered from the war raging over on the Continent, but for its depleting effect on the town’s young menfolk. With each wave of conscription, they depart from the town’s quaint train station, bright-eyed and crisply uniformed, only to return embittered and incomplete, if at all.\n\n\tUntil his own name is called, 17-year-old postboy Lofty (Oliver Briscombe) spends his days delivering messages of tragedy to newly bereaved women around Ramsden, though his randy pal Ellis (Taylor Uttley) looks on the bright side: “Grief, it’s an opportunity,” he says cheerily. There’s an opportunity for the boys, too, in the village chorus, sorely deprived by the draft of male voices — and soon its young choirmaster too. Enter Guthrie, an urbane, prodigious conductor formerly of some renown, though much disapproved of by the locals on several counts, not least among them the fact that he spent several years living and studying in Germany. His unapologetic atheism doesn’t help; nor do further “peculiarities” that nobody precisely wants to name. “Let’s just say I’d prefer a family man,” says priggish board member Duxbury (Roger Allam), and leaves it at that.\n\n\tGuthrie’s gayness remains more or less covert throughout Bennett’s script, though Fiennes plays him with a typically graceful, understated air of melancholy, his mourning turned inward for loves and lovers he can never name. There are unanswered overtures from the choir’s pianist Horner (Robert Emms), a soft, vulnerable young man whose conscientious-objector status renders him a fellow outsider. But “The Choral” is more preoccupied with the romantic lives of its younger characters, as Ellis, Lofty and their fellow teen soldiers-to-be desperately seek to lose their virginities before potentially losing their lives. Those in their sights include Mary (Amara Okereke), a golden-voiced Salvation Army officer yet to loosen so much as one button, and Bella (Emily Fairn), a pluckier sort anxiously awaiting the return of her wounded boyfriend Clyde (heartbreaking ensemble standout Jacob Dudman), though perhaps not equipped to nurse his trauma. \n\t\n\n\tBennett’s script flits inconsistently between generations, foregrounding certain perspectives before they suddenly recede, though the film is never less than diverting — with Guthrie’s ambitious plan to stage Elgar’s elevated work (with an off-key choir and a three-person orchestra) lending proceedings a satisfying narrative thrust. If it doesn’t culminate in the against-the-odds artistic triumph you might expect, there’s a more nuanced, honest moral here in favor of artistic aspiration, integrity and compromise all at once, via a hilariously deflating, supercilious cameo from Simon Russell Beale as Elgar himself.\n\n\tBut then the film is best when it chafes quietly against our expectations of gentle British comfort viewing, whether sharing in Guthrie’s dry exasperation at demonstrations of national pride, or eschewing dewy romanticism for its sole, unlikely sex scene: a passionless, reluctant handjob on the moors, discreetly depicted but tenderly illustrative of bodies and souls broken by war and English reserve. There are ugly open wounds in “The Choral,” even if they’ve been carefully and handsomely dressed by Mike Eley’s pristine, wheaty lensing, George Fenton’s luxurious scoring and Jenny Beavan’s perfectly pressed costumes. At its best, Bennett’s writing cuts through the gauze.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘The Choral’ Review: Ralph Fiennes Conducts a Sweet-Sounding but Gently Rebellious Anti-War Oratorio",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/the-choral-01.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-19T20:19:07.000Z",
      "dateModified": "2025-10-19T20:19:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Box Office: ‘Black Phone 2’ Collects $42 Million Globally, ‘Tron: Ares’ Hits $100 Million But Struggling Against Big Budget",
    "url": "https://variety.com/2025/film/box-office/black-phone-2-leads-global-box-office-tron-crosses-100-million-1236556535/",
    "image": "https://variety.com/wp-content/uploads/2025/10/black-phone.jpg?w=1000&h=562&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-19T17:43:10.000Z",
    "description": "\n\t“Black Phone 2,” a sequel to Universal and Blumhouse’s 2022 hit slasher film, scared up $42 million at the global box office in its first weekend of",
    "body": "\n\t“Black Phone 2,” a sequel to Universal and Blumhouse’s 2022 hit slasher film, scared up $42 million at the global box office in its first weekend of release.\n\n\tThose ticket sales included a softer $15.5 million from 71 international territories as well as a leading $26.5 million in the United States and Canada. Top overseas openings were Mexico with $4.3 million, the United Kingdom and Ireland with $1.4 million and Brazil with $1.2 million.\n\t\n\n\tDirected by Scott Derrickson, “The Black Phone 2” follows the return of the deranged serial killer known as the Grabber (Ethan Hawke). Initial ticket sales for the second film were slightly ahead of its predecessor, which launched to $13 million overseas and $35.8 million worldwide in 2022. The first “Black Phone,” which cost $18 million, became a sleeper hit with $161 million globally. The sequel, which carries a larger $30 million price tag, shouldn’t have trouble justifying its budget. However, it needs to stick around on the big screen beyond opening weekend to count as a major comeback for Blumhouse. The horror empire has struggled in 2025 with a string of flops, including “Wolf Man” and “M3GAN 2.0.” Another sequel, “Five Nights at Freddy’s 2,” is scheduled for December.\n\n\n\t“Black Phone 2” was this weekend’s only major newcomer at the international box office. Elsewhere, Disney’s sci-fi sequel “Tron: Ares” earned $14.1 million from 52 markets, declining about 50% from its debut. So far, the film has grossed $48.4 million overseas and $103 million globally after two weekends of release. That’s a decent tally, especially for a franchise in its fifth decade — except that Disney spent $180 million to produce and many millions to promote the sequel, so “Tron: Ares” is shaping up to become a major money loser for the studio.\n\t\n\n\tAnother expensive film, Paul Thomas Anderson and Leonardo DiCaprio’s “One Battle After Another” added $11.8 million overseas, impressively down just 21% from the prior weekend. The Warner Bros. release has generated $100 million internationally and $162.5 million globally. It’s an impressive result for the original, R-rated action comedy (one that’s likely to find itself in the awards race). However, it’s likely to end its theatrical run in the red for Warner Bros., which spent more than $130 million on production and $70 million on promotional efforts.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Box Office: ‘Black Phone 2’ Collects $42 Million Globally, ‘Tron: Ares’ Hits $100 Million But Struggling Against Big Budget",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/black-phone.jpg?w=1000&h=562&crop=1"
      ],
      "datePublished": "2025-10-19T17:43:10.000Z",
      "dateModified": "2025-10-19T17:43:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Taylor Swift’s ‘Showgirl’ Stays at No. 1 in Week 2 With 338,000 Units, the Fifth-Best Weekly Tally for Any Album This Year",
    "url": "https://variety.com/2025/music/news/taylor-swift-stays-number-1-week-2-billboard-album-chart-1236556554/",
    "image": "https://variety.com/wp-content/uploads/2025/10/Album-Cover-Treatment-4.jpg?w=1000&h=562&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-19T19:24:57.000Z",
    "description": "\n\tNo one would have expected Taylor Swift‘s “The Life of a Showgirl” to lose its grip on the album chart in week 2, and it indeed held on at the top o",
    "body": "\n\tNo one would have expected Taylor Swift‘s “The Life of a Showgirl” to lose its grip on the album chart in week 2, and it indeed held on at the top of the Billboard 200, with 338,000 equivalent album units in its second week out. \n\n\tLast week, Swift set a record in the Luminate/Soundscan-era data-keeping books with 4.002 million units. Although this week’s figure marked a predictably significant drop-off from that record-buster, even the second week for “Showgirl” ranked as the fifth best week for any album this year, per Billboard and Luminate. The only albums that had a higher number than 338,000 units in a single frame this year were first-week figures for releases from Wallen (who opened with 493,000), the Weeknd (who started with 490,000), Sabrina Carpenter (which started with 366K) and, of course, Swift’s own debut tally.\n\t\n\n\tBreaking down that 338K figure for Swift’s second week, 101,000 of those units came in the form of pure album sales, Billboard reported. That sales figure represented the biggest drop for “Showgirl” in week 2, down 97%, after a first week that included all the pre-sales for the album, plus a number of release-week-only variants. Nonetheless, 101,000 is a pure-sales figure that few contemporary albums ever reach in a week, and “Showgirl” had little competition in easily standing atop Billboard’s separate Top Album Sales chart for a second week. \n\n\n\tStreaming had a stronger hold, down from the juggernaut first-week figure by only 55%. The album’s tracks picked up a still-staggering 307.59 million on-demand official streams, which calculated out in the chart formula to 236,000 SEA (streaming equivalent album) units. Needless to say, “Showgirl” didn’t have any challengers in returning to No. 1 on Billboard’s Top Streaming Albums chart.\n\t\n\n\tWallen’s “I’m the Problem” spent a dozen nonconsecutive weeks at No. 1 this year. That’s a run at the top of the Billboard 200 that Swift will no doubt be hoping to match in the coming months. Looking at the release schedule, it appears as if there won’t be a lot standing in the way of an extended reign, as there are no further obvious pop blockbusters currently scheduled to come out between now and the end of 2025, barring any last-minute surprises from a superstar.\n\n\tWith no music stars interested in putting albums out right now in Swift’s shadow, there were no new entries in the top 10 of the Billboard 200 for the week ending Oct. 10.\n\n\tThe only relatively fresh blood on the chart is in Olivia Dean’s “The Art of Loving,” which debuted at No. 8 two weeks ago, then rose one spot to No. 7 last week, and is up yet one more spot to No. 6 in week 3. The latest weekly tally for the album is 36,000 equivalent album units, up 5% from the previous week.\n\n\tEverything else in the top 10 is very familiar fare — perhaps overly familiar, for some tastes. Following Swift near the top of the list are the “KPop Demon Hunters” soundtrack at No. 2 (104,000 units), Wallen’s “I’m the Problem” at No. 3 (79,000 units), Cardi B’s “Am I the Drama?” in fourth place (50,000) and Sabrina Carpenter’s “Man’s Best Friend” in the No. 5 spot (45,000)\n\n\tFollowing Dean at No. 6 are Bad Bunny’s “DeBÍ TiRAR MáS FOToS” in seventh place (33,000 units), SZA’s “SOS” at No. 8 (32,000), Alex Warren’s “You’ll Be Alright, Kid” — not to be confused with Swift’s “You’re on Your Own, Kid,” of course — at No. 9 (32,000) and, finally, a second Wallen mega-seller, “One Thing at a Time,” in 10th place (31,000).\n\n\tResults for the Hot 100 will come in Monday, with Swift’s “The Fate of Ophelia” expected to repeat at the top there as well.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Taylor Swift’s ‘Showgirl’ Stays at No. 1 in Week 2 With 338,000 Units, the Fifth-Best Weekly Tally for Any Album This Year",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/Album-Cover-Treatment-4.jpg?w=1000&h=562&crop=1"
      ],
      "datePublished": "2025-10-19T19:24:57.000Z",
      "dateModified": "2025-10-19T19:24:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jacob Elordi Teases ‘Euphoria’ Season 3 as ‘Incredibly Clever and Cinematic’: ‘It Was…Liberating’",
    "url": "https://variety.com/2025/tv/columns/jacob-elordi-euphoria-season-3-1236556445/",
    "image": "https://variety.com/wp-content/uploads/2025/10/GettyImages-2241625147.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-19T15:49:05.000Z",
    "description": "\n\tJacob Elordi is teasing the highly anticipated third season of “Euphoria.”\n\n\t“It was incredible, man,” the actor told me Saturday on the Academy Mus",
    "body": "\n\tJacob Elordi is teasing the highly anticipated third season of “Euphoria.”\n\n\t“It was incredible, man,” the actor told me Saturday on the Academy Museum Gala red carpet. “It was incredibly liberating. I got to play something so sort of far out from what I’ve done before.”\n\n\tHe said that series creator Sam Levinson “constructed something that’s incredibly clever and cinematic. I think people are really going to like it.”\n\t\n\n\tHowever, Elordi insists he doesn’t actually know exactly what happens in Season 3.\n\n\t“Everybody shoots at different storylines,” Elordi said. “I don’t know what anyone else is doing. I had a really singular storyline. You don’t know what the other story lines are. It’s like FBI files. So it’s great because I’ll get to consume the show the same way that everybody else does as a fan, which I haven’t been able to do before. I’m really excited.”\n\n\tElordi also wanted to clear up a news story that reported he said that Season 3 was entirely shot in VistaVision. “I did not say that, that is not true,” he said, adding, “It’s shot on a lot of different kinds of film and it’s beautiful.”\n\n\tReps at Warner Bros. did not respond to Variety‘s request for comment regarding the use of VistaVision. \n\n\t“Euphoria” follows a group of high school students who orbit around Rue (Zendaya), a drug-addicted teenager who must navigate intense social dynamics, family drama and staying clean after rehabilitation. Season 2 aired in 2022. Across its first two seasons, the show received 25 Emmy nominations and won nine awards.\n\t\n\n\tIn addition to Elordi, returning cast members include Zendaya, Hunter Schafer, Eric Dane, Sydney Sweeney, Alexa Demie, Maude Apatow, Martha Kelly, Chloe Cherry, Dominic Fike, Colman Domingo and Kika King.\n\n\tTrisha Paytas, Natasha Lyonne, Danielle Deadwyler and Eli Roth have joined for Season 3, as have Bella Podaras, Bill Bodner, Cailyn Rice, Colleen Camp, Gideon Adlon, Hemky Madera, Homer Gere, Jack Topalian, Jessica Blair Herman, Kwame Patterson, Madison Thompson, Matthew Willig, Rebecca Pidgeon and Sam Trammell.\n\n\tElordi is currently in the midst of a promotional and awards campaign blitz for Guillermo del Toro’s “Frankenstein.” Elordi stars in the Netflix film as the monster alongside Oscar Isaac as Victor Frankenstein.\n\n\t“[Netflix CEO] Ted Sarandos said to me before I started the film, ‘You’re so lucky you’re going to get to work with a kind genius and that’s a rare thing,’” Elordi recalled. “A kind genius is a rare thing. He is the kindest of geniuses.”\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jacob Elordi Teases ‘Euphoria’ Season 3 as ‘Incredibly Clever and Cinematic’: ‘It Was…Liberating’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/GettyImages-2241625147.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-19T15:49:05.000Z",
      "dateModified": "2025-10-19T15:49:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ina Garten’s ‘Be My Guest’ Returns This Sunday: Here’s How to Stream Season 7 Online",
    "url": "https://variety.com/2025/shopping/news/how-to-watch-ina-garten-be-my-guest-online-streaming-1236555749/",
    "image": "https://variety.com/wp-content/uploads/2025/09/Tina-Fey-on-Be-My-Guest-with-Ina-Garten.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-19T19:00:00.000Z",
    "description": "\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.\n\n\tIna Garte",
    "body": "\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.\n\n\tIna Garten’s “Be My Guest” returns this Sunday with an all-star lineup and the kind of cozy, conversational charm that made the series a daytime staple. The seventh season premieres Oct. 19 at 11 a.m. ET on Food Network, with new episodes featuring Tina Fey, “Gilded Age” star Christine Baranski, violin virtuoso Itzhak Perlman and fashion designer Daniel Roseberry.\n\n\tFor fans looking to stream the new season, the best option is DIRECTV, which offers access to Food Network’s live broadcast and HBO Max, where new episodes become available on demand. DIRECTV’s PREMIER package includes HBO Max at no additional cost, while other DIRECTV streaming and satellite TV plans let subscribers add it for $16.99 a month and they get the first 3 months included at no extra cost. DIRECTV offers three months of HBO Max and along with other premium channels — like Paramount+ with Showtime, Cinemax and STARZ — when signing up for select packages.1\n\t\n\n\tPer Food Network’s description for “Be My Guest” Season 7, “In the season premiere, Ina knows Tina Fey loves custard desserts – so she greets her with Breakfast Panna Cotta.  Tina then shares childhood revelations, standout standup moments and stories about life on the road with her best friend Amy Poehler.  Finally, the duo team up in the kitchen to make a dream dinner of Tina’s Greek Lemon Potatoes served with Ina’s Chicken Thighs with Creamy Mustard Sauce.”\n\n\n\tLater in the season, Baranski will stop by for Maple-Oatmeal Scones, Perlman will try Potato Galette with Smoked Salmon and Roseberry will try Tri-Berry Ricotta Cake.\n\t\n\n\tSince premiering in 2022, “Be My Guest” has helped Garten transcend her Food Network roots to become a full-fledged lifestyle and entertainment figure, blurring the line between culinary television and celebrity interview. The show’s relaxed format — equal parts chat, cooking demo and introspective sit-down interview — has drawn comparisons to longform celebrity conversations like “My Next Guest Needs No Introduction” and “Hot Ones,” positioning Garten as a kind of Hamptons-set cultural interviewer.\n\n\tStream “Be My Guest” Season 7 on DIRECTV here.2\n*w/eligible pkg. Must select offers. Premiums included for first 3 mos., then auto-renew monthly at then-prevailing rates unless canceled (curr. $16.99/mo. for HBO Max, $12.99/mo. for Paramount+ with SHOWTIME, $10.99/mo. each for STARZ and Cinemax, and $7.99/mo. for MGM+). Cancel anytime. Offer subj. to change. ↩︎Access HBO Max only on HBO Max app or hbomax.com. Paramount+ with SHOWTIME subscription incl. access to Paramount+ with SHOWTIME streaming plan, avail. on Paramount+ app or paramountplus.com/link. Online acct. reg. may be req’d. Offer not avail. to existing DIRECTV or U-verse TV customers. New approved residential customers only. Service renews monthly unless you cancel. Cancel anytime. Add’l fees may apply to non-qualified customers. Device subject to Equipment Lease agmt. Add’l fee(s) may apply if equip. not returned. Credit card req’d. Restr’s apply. For full details, go to directv.com/affiliates/stream. ↩︎\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ina Garten’s ‘Be My Guest’ Returns This Sunday: Here’s How to Stream Season 7 Online",
      "image": [
        "https://variety.com/wp-content/uploads/2025/09/Tina-Fey-on-Be-My-Guest-with-Ina-Garten.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-19T19:00:00.000Z",
      "dateModified": "2025-10-19T19:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Box Office: ‘Black Phone 2’ Grabs $26.5 Million in Otherwise Muted October Weekend",
    "url": "https://variety.com/2025/film/box-office/black-phone-2-box-office-opening-weekend-slow-good-fortune-misses-1236556444/",
    "image": "https://variety.com/wp-content/uploads/2025/10/bp2.jpg?w=958&h=539&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-19T14:41:11.000Z",
    "description": "\n\tUniversal and Blumhouse’s horror sequel “Black Phone 2” kicked off spooky season with $26.5 million from 3,411 North American theaters. Those ticket",
    "body": "\n\tUniversal and Blumhouse’s horror sequel “Black Phone 2” kicked off spooky season with $26.5 million from 3,411 North American theaters. Those ticket sales were enough to lead an otherwise sleepy weekend at the domestic box office.\n\n\t“Black Phone 2” opened in line with expectations and slightly ahead of its predecessor. The original “Black Phone” launched with $23 million in 2022 as cinemas were only starting to recover from COVID. Just to give a sense of the vastly different box office landscape between the first and second film: With similar ticket sales, “Black Phone” opened in fourth place behind “Elvis,” “Top Gun: Maverick” and “Jurassic World: Dominion” in the height of summer movie season.\n\t\n\n\tIn contrast, the “Black Phone” follow-up had a sluggish October weekend mostly to itself. This weekend’s other newcomer, Lionsgate’s R-rated comedy “Good Fortune,” opened at No. 3 with just $6.2 million from 2,990 venues. Second place went to Disney’s sci-fi sequel “Tron: Ares” with $11.1 million from 4,000 screens, representing a steep 66% decline from its first outing. Right now, the October box office is down 11% from the same point in 2024, according to Comscore. Meanwhile the overall box office is 4% above last year but more than 20% below pre-pandemic times.\n\n\n\t“Black Phone 2” also collected $15.5 million at the international box office for a global tally of $42 million. Though a promising result, Universal and Blumhouse spent more to bring back Ethan Hawke as the serial killer known as the Grabber. The sequel cost $30 million compared to the first film’s $18 million price tag. “Black Phone 2” has decent reviews but wasn’t received as fondly as the original by moviegoers; this film earned a “B” grade on CinemaScore exit polls while the first landed a “B+” grade. \n\t\n\n\t“We’ve seen word-of-mouth grow over the weekend,” says Universal’s president of domestic distribution Jim Orr. “The reasons are simple: Blumhouse and director Scott Derrickson have crafted something that’s terrifying, with a great cast. It’s just what audiences want to see in theaters.”\n\n\tSince ticket sales are split roughly 50-50 between studios and movie theaters, “Black Phone 2” needs to stick around to count as a major comeback for Blumhouse. The low-budget horror empire, responsible for “Paranormal Activity,” “The Purge,” “Get Out” “Halloween” and other franchises with scary-good profit margins, has long been one of Hollywood’s most consistent hitmakers. However the company’s fortunes have shifted over the past year with one dud after another including “Wolf Man” and “M3GAN 2.0.” Blumhouse has another sequel, “Five Nights at Freddy’s 2,” on the calendar in December.\n\n\t“Good Fortune” has the good fortune of respectable reviews (78% on Rotten Tomatoes) and audience scores (a “B+” grade on CinemaScore). The trouble is that not enough people were incentivized to buy tickets for the $30 million-budgeted film. Aziz Ansari directed in his feature debut and stars in “Good Fortune,” which revolves around a good-intentioned but inept angel (Keanu Reeves) who facilitates a body swap between a struggling gig worker (Ansari) and a wealthy venture capitalist (Seth Rogen).\n\n\t“This is a fair opening for an original character-driven comedy,” says David A. Gross, who runs the movie consulting firm Franchise Entertainment Research. However “even with Keanu Reeves helping ancillary business, the movie is unlikely to recoup its costs.”\n\n\tAnother film that’ll struggle to get out of the red is “Tron: Ares.” So far the futuristic film has earned $54.6 million domestically and $103 million worldwide after two weekends of release. Although the $100 million mark is notable, Disney spent $180 million to produce and many millions to promote the sequel, so “Tron: Ares” requires substantial staying power to justify those costs.\n\n\tChanning Tatum’s dramedy “Roofman” and Leonardo DiCaprio’s action comedy “One Battle After Another” rounded out the top of box office charts.\n\n\t“Roofman” earned $3.7 million from 3,370 theaters in its second weekend, marking a 55% decline from its debut. So far the film has generated $15.5 million and $16.4 million worldwide, a paltry total albiet against a modest $18 million budget.\n\t\n\n\t“One Battle After Another” collected $3.75 million from 2,532 locations in its fourth outing, bringing its domestic total to $61 million. The Warner Bros. film, directed by Paul Thomas Anderson, has been a steady performer overseas with $100 million to date, bringing the global total to $162.5 million. That’s an impressive figure for an original, R-rated film that’s nearly three hours long. \n\n\tHowever the studio spent more than $130 million to produce and roughly $70 million to promote “One Battle,” which requires about $300 million to break even. At this rate, the movie is tracking to lose $100 million in its theatrical run, according to studio executives with knowledge of the economics of similar-sized films. (Warner Bros. refutes those estimates.) “One Battle After Another” is, however, expected to be a major Oscar player, which makes it valuable to the company in ways beyond the balance sheet. \n\n\tAnother new release, the Angel Studios drama “Truth and Treason” took sixth place with a tepid $2.7 million from 2,106 theaters. The World War II-set story follows a teenage resistance fighter who opposed the Nazi regime in Germany. Audiences awarded the film an “A” grade on CinemaScore exit polls.\n\n\tElsewhere, director Luca Guadagnino’s #MeToo-inspired thriller “After the Hunt” failed to sustain any traction while expanding nationwide. At No. 7, the movie brought in $1.56 million from 1,238 theaters. After one weekend in limited release, “After the Hunt” has amassed just $1.77 million, a dispiriting result for something led by major stars including Julia Roberts, Ayo Edebiri and Andrew Garfield.\n\n\tIn limited release, Iranian director Jafar Panahi’s Palme d’Or winner “It Was Just an Accident” scored $68,000 from three venues in New York City and Los Angeles, averaging $22,000 per location. The film, released by Neon and expected to be an awards contender, has grossed $115,000 since Wednesday. \n\n\tRichard Linklater’s dramedy “Blue Moon” didn’t fare as well among speciality titles. The movie earned $67,060 from five locations, averaging $13,412 per screen. Hawke also stars in “Blue Moon” (in a very different role from “Black Phone 2”) as songwriter Lorenz Hart as he reflects on the opening night of “Oklahoma,” a new musical by his former collaborator Richard Rodgers.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Box Office: ‘Black Phone 2’ Grabs $26.5 Million in Otherwise Muted October Weekend",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/bp2.jpg?w=958&h=539&crop=1"
      ],
      "datePublished": "2025-10-19T14:41:11.000Z",
      "dateModified": "2025-10-19T14:41:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Robert De Niro Says ‘We Can’t Let Up’ the Fight Against Trump Because ‘He Does Not Want to Leave the White House’: ‘There’s No Other Way to Face a Bully’",
    "url": "https://variety.com/2025/film/news/robert-de-niro-trump-no-kings-protests-1236556575/",
    "image": "https://variety.com/wp-content/uploads/2025/09/Robert-De-Niro.jpg?crop=26px%2C24px%2C950px%2C535px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-10-19T18:10:56.000Z",
    "description": "\n\tRobert De Niro is telling Americans to keep protesting against Donald Trump.\n\n\tAfter Saturday’s nationwide No Kings protests, De Niro told MSNBC tha",
    "body": "\n\tRobert De Niro is telling Americans to keep protesting against Donald Trump.\n\n\tAfter Saturday’s nationwide No Kings protests, De Niro told MSNBC that the country needs to show “much more” resistance, because that’s “the only thing the politicians are going to recognize.” He added that we need to make lawmakers “more afraid of the wrath of the people” than the “wrath of Trump.”\n\n\t“We can’t let up,” De Niro said. “Cannot let up on him because he is not going to leave the White House. He does not want to leave the White House. He will not leave the White House. Anybody thinks he, oh, he’ll do this, he’ll do that, it’s just deluding themselves.”\n\t\n\n\tHe added, “The Republicans, most of all, because they know, but they’re going along with it. It’s a classic bully situation. We see it, and there’s no other way to face a bully. You have to face him and fight it out and back them off and back him down. That’s the only way this is going to work.”\n\n\tThe Oct. 18 No Kings protests were joined by nearly 7 million people, according to MSNBC. ICE’s aggressive immigration crackdown remains a key issue in the nationwide demonstrations, as they were during the first No Kings protests in June. National Guard presence in major cities and sweeping cuts to federal programs were also major motivators for participants. \n\n\tDe Niro was one of the many Hollywood mainstays to speak out in support of the No Kings movement. On Oct. 9, he appeared in a video on the TikTok account of political activist group Indivisible to encourage people to attend the No Kings protests.\n\t\n\n\t“The original No Kings protest was 250 years ago,” De Niro said. “Americans decided they didn’t want to live under the rule of King George III. They declared their independence and fought a bloody war for democracy. We’ve had two and a half centuries of democracy since then. Often challenging, sometimes messy, always essential.”\n\n\tHe continued, “Now we have a would-be king who wants to take it away: King Donald the First. Fuck that. We’re rising up again, this time, nonviolently raising our voices to declare: No Kings.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Robert De Niro Says ‘We Can’t Let Up’ the Fight Against Trump Because ‘He Does Not Want to Leave the White House’: ‘There’s No Other Way to Face a Bully’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/09/Robert-De-Niro.jpg?crop=26px%2C24px%2C950px%2C535px&resize=1000%2C563"
      ],
      "datePublished": "2025-10-19T18:10:56.000Z",
      "dateModified": "2025-10-19T18:10:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "No, ‘One Battle After Another’ Is Not a ‘Left-Wing’ Movie",
    "url": "https://variety.com/2025/film/columns/no-one-battle-after-another-is-not-a-left-wing-film-1236556461/",
    "image": "https://variety.com/wp-content/uploads/2025/09/MCDONBA_WB015.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-19T17:03:54.000Z",
    "description": "\n\tIt’s no big shock to see that commentators on the right, the far right, and the extreme alt-right (I think that covers the waterfront), from Ben Sha",
    "body": "\n\tIt’s no big shock to see that commentators on the right, the far right, and the extreme alt-right (I think that covers the waterfront), from Ben Shapiro to film critic Armond White, have pounced on “One Battle After Another,” accusing it of being a “left-wing” movie made for left-wing elites sitting in their left-wing bubble. The forces on the right, led by President Trump, will now say that about almost anything. They treated yesterday’s No Kings protest, with its massive surge of outraged citizens, as if it were some lunatic-fringe collection of hippie terrorists.\n\t\n\n\tIt was a tad more surprising to see the same criticism of “One Battle After Another” made by Bret Easton Ellis, who thinks that reviewers have hailed Paul Thomas Anderson’s film, and overpraised it, “because it really aligns with this kind of leftist sensibility.” Ellis later added on his podcast, “You have the left and the entertainment press propping this movie up to such an absurd degree that it felt unnatural.” I consider myself a fan of Ellis’s (I was a guest on his podcast once), and relish the independence of his voice, so the fact that he isn’t wild about “One Battle After Another” is fine with me. I’m all for debate. But I think that tagging the film with the “leftist” label feeds into the very same cliché mindset that Ellis thinks he’s fighting.\n\n\n\tWhat’s more, if you believe, as I do, that part of the power of “One Battle After Another” is that it is not, in fact, a left-wing movie, it’s important to recognize how that misperception has been fed by a lot of people…on the left. The movie, which is set in an authoritarian America that resembles the one we could be heading toward (it anticipates what the country might start to look like if Trump invokes the Insurrection Act), is centered, for a while, on a ragtag band of revolutionary guerrillas. And since the movie is certainly on their side, I think a lot of the attitude of the entertainment media has been to reflexively treat “One Battle After Another” as if the film itself were raising a revolutionary fist — and as if there were something “left-wing” about attacking authoritarianism. There is not.\n\t\n\n\tThis isn’t merely a matter of semantics. In a strange way, the lionization of “One Battle After Another” as a cinematic manifesto, a movie that sees itself as part of “the resistance” and tips its hat to the glory of being a “radical,” has fed directly into the skewed right-wing view of the film. At times, it’s almost as if the right and the left agree on what “OBAA” is: a romantic salute to revolution. They just don’t agree on where they come down on it.\n\n\tBut see, that word “revolution” is more loaded than people think. And so is “left-wing.” They may just be words, but they have helped to create the lens through which “One Battle After Another” is being viewed. As someone who loved the film, and found it to be a potent statement, but does not consider it a “left-wing” vision, I thought I would try to clarify why “One Battle After Another” should really escape that label, regardless of which side is doing the labeling. Here’s why. \n\n\tThe film borrows the iconography of late ’60s/early ’70s “revolutionaries.” But that world, and the movie’s world, could not be more different. In the film’s opening section, the underground rebels, known as the French 75, are characterized in a way that nods to the counterculture radicals of 55 years ago. One of the film’s most indelible images is that of Perfidia Beverly Hills (Teyana Taylor), in her khakis and boots and open plaid shirt and wool cap, firing a machine gun balanced on her pregnant belly — an image that looks like a Black Panther/Symbionese Liberation Army fever dream. The French 75 launch their insurrectionary acts (bombings, bank robberies, breaking into an immigration-detention facility to free the prisoners) with an overthrow-the-system bravura that nods to that earlier time.\n\n\tBut here’s the difference. The Black Panthers fought for Civil Rights, but by the late ’60s and early ’70s many of the radicals of the counterculture had the stated goal of overthrowing, you know…America. At the time, this was regarded by the overwhelming majority of Americans, including liberals, as an extreme and even crackpot idea. By the time of the rise of the Weather Underground (whose great achievement was accidentally blowing up a Greenwich Village townhouse, killing three of their own members), many of the radicals of the era were starting to look not just extreme but scurrilous.\n\t\n\n\tSo why does “One Battle After Another” pay homage to them? Because they possessed a militant impulse that struck a chord in the popular imagination. Yet the two situations could hardly be more different. At the end of the ’60s, America was not an authoritarian regime. “One Battle After Another,” by contrast, takes place in a police state where the cops and the military have joined forces to patrol an autocratic society, with basic rights stripped away. That is what the French 75 are rebelling against. Does that make them “left-wing”? No, it makes them freedom fighters who are trying to crack a fascist nation back open.\n\n\tHow could anyone think the film starts in 2008? The timeline of “One Battle After Another” might be a little confusing, for several reasons. The film is loosely based on the Thomas Pynchon novel “Vineland,” which is set in the Reagan ’80s; Anderson, looking ahead (the film was shot last year), reconfigured the book into a dystopian projection of what a Trump regime might look like. But a host of progressive critics and writers, obsessed with the idea that the movie is about what’s going on right now, man, have stated that the heart of the action is set quite specifically in the present day. That would mean that the opening 45 minutes, which is set 16 years before that (when the French 75 are going wild), would take place in 2008. But the vision of oppression the movie conjures has nothing to do with the vibe of 2008 (the start of the Obama era). And the power of “OBAA” is that it’s not a literal vision of today. It’s a spiritual projection of where we could land.\n\n\tThe film’s ragtag band of radicals are not glorified. On the contrary, they’re shown to be deeply flawed. This, I think, gets to the heart of why Paul Thomas Anderson has made a movie about radicals that is not, in itself, a piece of firebrand “radicalism.” How imperfect are the French 75? In many ways, the film’s key character is Perfidia Beverly Hills, who’s portrayed as a ruthlessly charismatic rebel leader, until she has her baby (the secret father is Sean Penn’s ramrod-rigid Col. Lockjaw), at which point her lover and partner, Bob Herbert (Leonardo DiCaprio), says: We’re a family now. Our priorities have to pivot away from revolution. Anderson, who has four children with Maya Rudolph, stages this moment with notable conviction. It’s the first thing that makes us take notice of DiCaprio’s character as a morally complex being. But Perfidia is having none of it. She’s placed (by Lockjaw) in the Witness Protection Program, and then hustles over the border to Mexico, leaving the revolution — and, more to the point, her child — behind. The movie does not respect this.\n\t\n\n\tCut to 16 years later. The revolution is in tatters, and Bob is a stoner sitting around in his bathrobe. He is still, in his way, a devoted father, but apart from that he’s blitzed, navel-gazing, dissipated. This is not a revolutionary we can exactly salute. What’s more, the film’s funniest joke has been widely misinterpreted by media progressives. When Bob calls the French 75 headquarters and keeps failing to remember the proper espionage code phrase (the answer to the question “What time is it?”), many have interpreted this to simply be a sign of how fried his brain is. But that wouldn’t be a funny joke. DiCaprio’s acting in this section — his steam-out-the-ears frustration at the fact that the operator won’t give him a pass on remembering the damn code — is brilliant, and puts the audience right on his side. The bureaucratic fussiness of the operator is clearly meant to be a satire of doctrinaire left-wing rigidity.\n\n\tThe attack on “OBAA” for being “left-wing” could almost be an early salvo in the Oscar race. Speaking of battles, the Academy Awards already look like they’re shaping up to be a four-way war: “One Battle After Another” vs. “Hamnet,” with “Sinners” and “Marty Supreme” coming up on the side. Attacking “OBAA” on ideological grounds sounds like something right out of the anti-“Green Book” playbook. I don’t think that’s where the argument ultimately came from, but it’s one that could easily be exploited by opposing forces.     \n\n\tWhat Is “One Battle After Another” Actually About? It’s the Authoritarianism, Stupid. If you scanned the media coverage of it, you might think “One Battle After Another” was the story of a revolution. It is (sort of). But not really. For 45 minutes or so, it looks like that. But the guerrilla rebellion fails, and while Bob is helped out by Sensei Sergio St. Carlos (Benicio del Toro), the leader of an underground railroad for immigrants, the revolution comes down to a father rescuing his daughter. That’s emotionally powerful, but the portrayal of “resistance” is less potent than the film’s portrayal of authoritarianism itself, and of how directly that connects with what’s happening in America today. The real revolution going on in this country now is the Christian nationalist revolution — an attempt to upend the American Dream and replace it with a theocracy. And the film dares to unveil that; its portrait of the Christmas Adventurers is a chilling vision of hate. That’s all the message the movie needs: that this is happening, that the right-wing revolution is on. And that there are people in America who still want to stop it. To suggest that portraying all that is “left-wing,” even if that’s the side you think you’re on, is to play right into the propaganda. It’s to win the battle of self-righteousness and lose the war.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "No, ‘One Battle After Another’ Is Not a ‘Left-Wing’ Movie",
      "image": [
        "https://variety.com/wp-content/uploads/2025/09/MCDONBA_WB015.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-19T17:03:54.000Z",
      "dateModified": "2025-10-19T17:03:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Academy Museum Gala 2025 Red Carpet: Charli xcx, Kim Kardashian, Jacob Elordi and More",
    "url": "https://variety.com/gallery/academy-gala-2025-red-carpet-arrivals/",
    "image": "https://variety.com/wp-content/uploads/2025/10/MixCollage-19-Oct-2025-12-29-PM-8477.jpg?crop=25px%2C25px%2C1148px%2C645px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-10-19T19:37:18.000Z",
    "description": "The Academy Museum of Motion Pictures hosted its fifth annual gala at the Academy Museum in Los Angeles last night in support of the museum’s educatio",
    "body": "The Academy Museum of Motion Pictures hosted its fifth annual gala at the Academy Museum in Los Angeles last night in support of the museum’s education initiatives, public programming and future exhibitions. This year’s Gala raised over $12 million in donations for the general public and the local community of Los Angeles. \nThe gala was presented in partnership with Rolex, a founding supporter and official watch partner of the Academy Museum. The gala was co-chaired by Jon M. Chu, Common, Viola Davis, Julius Tennon, Robert Downey Jr., Susan Downey, Jennifer Hudson and Academy Museum Trustee Alejandro Ramírez Magaña.\nThe event honored four important voices in the entertainment industry for their contributions to film, both past and present. The first presenter of the night was Wim Wenders, who presented director Walter Salles with the Luminary Award. The Vantage Award was presented by Jon M. Chu to actor and comedian Bowen Yang, alongside Zoe Saldaña, who presented the Icon Award to actress Penélope Cruz during the night. The final award, the inaugural Legacy Award, was presented by Martin Scorsese to musician Bruce Springsteen. \nGeorge Clooney introduced a musical performance by Bruce Springsteen, where he closed out the event singing “Streets of Philadelphia,” “Atlantic City” and “Land of Hope and Dreams.”\nThe Icon, Legacy, Luminary and Vantage Awards were designed by the Haas Brothers and fabricated by UAP. The awards are solid cast bronze, hand-polished, hand-stamped and triple plated in nickel, copper and 24k gold.  \nThe event design was conceived by Keith Baptista, with talent relations overseen by Special Projects. \nSee the best looks from the 2025 Academy Gala below.\n\n\n\t\t\t\n\t\t\t\n\tCharli xcx\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Gilbert Flores/Variety\t\t\t\n\t\t\t\n\tCharli xcx wears YSL.\n\n\t\t\n\t\t\t\n\t\t\t\n\tKim Kardashian\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Gilbert Flores/Variety\t\t\t\n\t\t\t\n\tKim Kardashian wears Maison Margiela by Glenn Marten.\n\n\t\t\n\t\t\t\n\t\t\t\n\tJacob Elordi\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Gilbert Flores/Variety\t\t\t\n\t\t\t\n\tJacob Elordi wears Bottega Veneta.\n\n\t\t\n\t\t\t\n\t\t\t\n\tOlivia Rodrigo\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Gilbert Flores/Variety\t\t\t\n\t\t\t\n\tOlivia Rodrigo wears Armani Privé.\n\n\t\t\n\t\t\t\n\t\t\t\n\tSelena Gomez\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Gilbert Flores/Variety\t\t\t\n\t\t\t\n\tSelena Gomez attends the Fifth Annual Academy Museum Gala.\n\n\t\t\n\t\t\t\n\t\t\t\n\tJenna Ortega\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Gilbert Flores/Variety\t\t\t\n\t\t\t\n\tJenna Ortega wears Grace Ling.\n\n\t\t\n\t\t\t\n\t\t\t\n\tRachel Zegler\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Gilbert Flores/Variety\t\t\t\n\t\t\t\n\tRachel Zegler wears Tamara Ralph.\n\n\t\t\n\t\t\t\n\t\t\t\n\tDamson Idris\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Michael Buckner/WWD\t\t\t\n\t\t\t\n\tDamson Idris wears DIDRIS Jewelry at the Fifth Annual Academy Museum Gala.\n\n\t\t\n\t\t\t\n\t\t\t\n\tRachel Sennott\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Gilbert Flores/Variety\t\t\t\n\t\t\t\n\tRachel Sennott wears Balenciaga.\n\n\t\t\n\t\t\t\n\t\t\t\n\tAyo Edebiri\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Gilbert Flores/Variety\t\t\t\n\t\t\t\n\tAyo Edebiri wears Chanel.\n\n\t\t\n\t\t\t\n\t\t\t\n\tElle Fanning\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Michael Buckner/WWD\t\t\t\n\t\t\t\n\tElle Fanning wears Balenciaga.\n\n\t\t\n\t\t\t\n\t\t\t\n\tHailey Bieber\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Gilbert Flores/Variety\t\t\t\n\t\t\t\n\tHailey Bieber wears Schiaparelli.\n\n\t\t\n\t\t\t\n\t\t\t\n\tViola Davis\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Michael Buckner/WWD\t\t\t\n\t\t\t\n\tViola Davis wears Gucci.\n\n\t\t\n\t\t\t\n\t\t\t\n\tGreta Lee\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Michael Buckner/WWD\t\t\t\n\t\t\t\n\tGreta Lee wears Dior.\n\n\t\t\n\t\t\t\n\t\t\t\n\tDemi Moore and Lucy Liu\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Gilbert Flores/Variety\t\t\t\n\t\t\t\n\tDemi Moore and Lucy Liu attend the Fifth Annual Academy Museum Gala.\n\n\t\t\n\t\t\t\n\t\t\t\n\tMilly Alcock\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Gilbert Flores/Variety\t\t\t\n\t\t\t\n\tMilly Alcock wears Harris Reed.\n\n\t\t\n\t\t\t\n\t\t\t\n\tMikey Madison\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Michael Buckner/WWD\t\t\t\n\t\t\t\n\tMikey Madison wears Dior.\n\n\t\t\n\t\t\t\n\t\t\t\n\tMartin and Francesca Scorsese\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Gilbert Flores/Variety\t\t\t\n\t\t\t\n\tMartin and Francesca Scorsese attend the Fifth Annual Academy Museum Gala.\n\n\t\t\n\t\t\t\n\t\t\t\n\tSydney Sweeney\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Gilbert Flores/Variety\t\t\t\n\t\t\t\n\tSydney Sweeney wears Giorgio Armani.\n\n\t\t\n\t\t\t\n\t\t\t\n\tSeth Rogen and Lauren Miller Rogen\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Gilbert Flores/Variety\t\t\t\n\t\t\t\n\tSeth Rogen and Lauren Miller Rogen attend the Fifth Annual Academy Museum Gala.\n\n\t\t\n\t\n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Academy Museum Gala 2025 Red Carpet: Charli xcx, Kim Kardashian, Jacob Elordi and More",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/MixCollage-19-Oct-2025-12-29-PM-8477.jpg?crop=25px%2C25px%2C1148px%2C645px&resize=1000%2C563"
      ],
      "datePublished": "2025-10-19T19:37:18.000Z",
      "dateModified": "2025-10-19T19:37:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Guess Who This Fast-Moving Star Is!",
    "url": "https://www.tmz.com/2025/10/19/guess-who-fast-moving-star/",
    "image": "https://imagez.tmz.com/image/e7/16by9/2025/10/16/e7f734e65e8841b2a02a0b11b46dbfdd_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-19T23:00:50.000Z",
    "description": "\n    \n                    \n                          Guess Who\n                          This Fast-Moving Star Is!\n                      \n            ",
    "body": "\n    \n                    \n                          Guess Who\n                          This Fast-Moving Star Is!\n                      \n                  \n                        Published October 19, 2025 4:00 PM PDT\n                                                                            \n      \n    \n      \n        \n                    \n                      MARCH 2019\n                  \n      \n                    TMZ.com\n          \n    \n          We all know celebrities have got some pretty crazy schedules ... and we wanna see if you can guess who this fast-moving star is!\n      \n    \n          We ran into this film and TV star when he was out in L.A. ... and although we had plenty of questions for him, he obviously had things to do and places to be!\n      \n    \n          Still, we managed to get a few answers out of him as he strolled down one of the city's sunny streets ... and he seemed a lot more easygoing than the character he's set to play in \"Frankenstein.\"\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Movies\n              \n                          \n                Guess Who\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Guess Who This Fast-Moving Star Is!",
      "image": [
        "https://imagez.tmz.com/image/e7/16by9/2025/10/16/e7f734e65e8841b2a02a0b11b46dbfdd_xl.jpg"
      ],
      "datePublished": "2025-10-19T23:00:50.000Z",
      "dateModified": "2025-10-19T23:00:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kevin Federline Money Grab, Taylor Swift Greedy, Cancel Wendy Osefo? You Decide!",
    "url": "https://www.tmz.com/2025/10/18/trending-entertainment-polls/",
    "image": "https://imagez.tmz.com/image/0f/16by9/2025/10/17/0f734321d7fd4b2b9894cf44b60b2a00_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-18T07:45:07.000Z",
    "description": "\n    \n                    \n                          Stars and Scars\n                          You Be the Judge\n                      \n               ",
    "body": "\n    \n                    \n                          Stars and Scars\n                          You Be the Judge\n                      \n                  \n                        Published October 18, 2025 12:45 AM PDT\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Kevin Federline has gone scorched earth on Britney in his new memoir, and Taylor Swift is getting unusual blowback for hyper-marketing her new album. So we gotta ask ...\n      \n      \n      \n          \n            \n              \n                \n                Share on Facebook\n              \n            \n            \n              \n                \n                Share on X\n              \n            \n                          \n                \n                  \n                \n              \n                      \n        \n              \n          \n                          \n                Stars and Scars\n              \n                      \n        \n          \n  ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kevin Federline Money Grab, Taylor Swift Greedy, Cancel Wendy Osefo? You Decide!",
      "image": [
        "https://imagez.tmz.com/image/0f/16by9/2025/10/17/0f734321d7fd4b2b9894cf44b60b2a00_xl.jpg"
      ],
      "datePublished": "2025-10-18T07:45:07.000Z",
      "dateModified": "2025-10-18T07:45:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Guess Who This On-The-Go Star Is!",
    "url": "https://www.tmz.com/2025/10/19/guess-who-on-the-go-star/",
    "image": "https://imagez.tmz.com/image/d2/16by9/2025/10/15/d2d14747b3824ae1bdc6f442d585363d_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-19T19:00:56.000Z",
    "description": "\n    \n                    \n                          Guess Who This\n                          On-The-Go Star Is!\n                      \n              ",
    "body": "\n    \n                    \n                          Guess Who This\n                          On-The-Go Star Is!\n                      \n                  \n                        Published October 19, 2025 12:00 PM PDT\n                                                                            \n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          Hollywood's a fickle business, and you gotta learn how to move fast if you wanna dodge the crowds -- so we wanna see if you can guess who this on-the-go star is!\n      \n    \n          We ran into this actor -- for all of a few seconds -- on the streets of Manhattan a few years back, when he was signing a few autographs for some lucky fans ... but he ended up being pulled away after putting his signature on a handful of photos.\n      \n    \n          Hey, we're sure his fans had the best time -- well, 20 seconds or so -- when he was around!\n      \n      \n              \n          \n                          \n                Guess Who\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Guess Who This On-The-Go Star Is!",
      "image": [
        "https://imagez.tmz.com/image/d2/16by9/2025/10/15/d2d14747b3824ae1bdc6f442d585363d_xl.jpg"
      ],
      "datePublished": "2025-10-19T19:00:56.000Z",
      "dateModified": "2025-10-19T19:00:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sexy Stars Decked Out in Disney Costumes",
    "url": "https://www.tmz.com/2025/10/19/sexy-stars-decked-out-in-disney-costumes/",
    "image": "https://imagez.tmz.com/image/f9/16by9/2025/10/14/f91e9f1442fe4488a230d02b4dea4841_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-19T14:00:32.000Z",
    "description": "\n    \n                    \n                          Sexy Stars\n                          All Decked Out\n                          In Disney Costumes!",
    "body": "\n    \n                    \n                          Sexy Stars\n                          All Decked Out\n                          In Disney Costumes!\n                      \n                  \n                        Published October 19, 2025 7:00 AM PDT\n                                                                            \n      \n    \n          Halloween's just around the corner, folks, and we figured we'd get into the swing of things ... with a gallery of sexy celebs wearing Disney costumes!\n      \n    \n          It's just a little something-something to get you in the spirit of the season, and if we can't do it for ya ... maybe Bernice Burgos, Alix Earle, and Kendall Jenner all decked out like characters from the House of Mouse will!\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          If there's anyone you're trying to impress, maybe take after Casey Boonstra and dress up like Ariel ... we're sure that special someone will wanna be \"Part of Your World!\"\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Or, you can keep it classic, just like Milania Giudice, who we think was the Belle of the ball while wearing her Disney costume!\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Oh, and here's a little tip ... DIY costumes can be way cooler than store-bought ones, and we included a shot of Dixie D'Amelio all dressed up like the Queen of Hearts in case you needed a little inspiration!\n      \n      \n              \n          \n                          \n                Disney\n              \n                          \n                Halloween\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sexy Stars Decked Out in Disney Costumes",
      "image": [
        "https://imagez.tmz.com/image/f9/16by9/2025/10/14/f91e9f1442fe4488a230d02b4dea4841_xl.jpg"
      ],
      "datePublished": "2025-10-19T14:00:32.000Z",
      "dateModified": "2025-10-19T14:00:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jonathan Davino Out with Group of Women After Sydney Sweeney Split",
    "url": "https://www.tmz.com/2025/10/19/jonathan-davino-steps-out-group-women-after-split/",
    "image": "https://imagez.tmz.com/image/c3/16by9/2025/10/19/c3c6db4f9fd54ff9803daaf893568d06_xl.png",
    "tag": "Entertainment",
    "date": "2025-10-20T00:18:38.000Z",
    "description": "\n    \n                    \n                          Jonathan Davino\n                          Hangs with Group of Ladies After SNL ...\n              ",
    "body": "\n    \n                    \n                          Jonathan Davino\n                          Hangs with Group of Ladies After SNL ...\n                          Not Dating Any of Them!!!\n                      \n                  \n                        Published October 19, 2025 5:18 PM PDT\n                                                                            \n      \n    \n      \n        \n                    \n                  \n      \n                    BACKGRID\n          \n    \n          Jonathan Davino hasn't been seen around many women since his relationship with Sydney Sweeney ended ... and, though he was spotted with a famous TikToker Saturday night, he's defintely not dating her.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Here's the deal ... Davino -- seen here in a white shirt and blue pants -- attended the Saturday Night Live after-party where he was spotted speaking with Morgan Cohen and a mystery brunette.\n      \n    \n          Photogs captured him walking swiftly toward a car with the group ... though he didn't stop and take questions -- which made some wonder what his relationship to these ladies might be.\n      \n\n          Sources close to Jonathan shut down any notion of romance with Morgan or anyone else though ... telling us he's not dating anyone these days -- and, he's not looking either.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          That's in sharp contrast to his ex-fiancée -- from whom he split earlier this year -- who has been spotted all over Los Angeles with her new boyfriend, Scooter Braun.\n      \n    \n          As we told you ... the two were first linked romantically at the beginning of September -- though we were initially told it was casual. After a month of dinner dates and an excursion to Universal Studios with Sweeney's parents, it seems it might be more serious than originally thought.\n      \n    \n          Davino's certainly not in a serious relationship though ... 'cause he's not in anything at all!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Sydney Sweeney\n              \n                          \n                Exclusive Details\n              \n                          \n                Hollywood Exes\n              \n                          \n                Gossip / Rumors\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jonathan Davino Out with Group of Women After Sydney Sweeney Split",
      "image": [
        "https://imagez.tmz.com/image/c3/16by9/2025/10/19/c3c6db4f9fd54ff9803daaf893568d06_xl.png"
      ],
      "datePublished": "2025-10-20T00:18:38.000Z",
      "dateModified": "2025-10-20T00:18:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]