[
  {
    "title": "Eddie Murphy Left 2007 Oscars After Losing Best Supporting Actor Because He Didn’t Want to Be ‘The Sympathy Guy All Night’",
    "url": "https://variety.com/2026/film/news/eddie-murphy-2007-oscars-dreamgirls-sympathy-guy-1236622941/",
    "image": "https://variety.com/wp-content/uploads/2026/01/MixCollage-03-Jan-2026-11-55-AM-2272.jpg?crop=0px%2C23px%2C1200px%2C675px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-01-03T20:15:11.000Z",
    "description": "\n\tEddie Murphy famously left the 2007 Academy Awards after he lost the best supporting actor award for his role as James “Thunder” Early in “Dreamgirl",
    "body": "\n\tEddie Murphy famously left the 2007 Academy Awards after he lost the best supporting actor award for his role as James “Thunder” Early in “Dreamgirls.” However, the premature exit wasn’t out of spite. In a recent interview with Entertainment Weekly, the “Trading Places” star said it was because several of his fellow attendees felt bad for him, and he didn’t want to be “the sympathy guy all night.”\n\n\t“What happened was I was at the Oscars, I had lost, and then people kept coming over to me and kept [patting] me on the shoulder,” Murphy said. “Clint Eastwood came and rubbed my shoulder. And I was like, ‘Oh, no, no, I’m not gonna be this guy all night. Let’s just leave.’ I didn’t storm out. I was like, ‘I’m not gonna be the sympathy guy all night.'”\n\t\n\n\tOther best supporting actor nominees that year included Mark Wahlberg for “The Departed,” Alan Arkin for “Little Miss Sunshine,” Jackie Earle Haley for “Little Children” and Djimon Hounsou for “Blood Diamond.” Arkin walked away with the win.\n\n\tMurphy recalled seeing an early screening of “Little Miss Sunshine.” He said he was extremely impressed with Arkin’s performance and predicted his Oscar win.\n\n\t“Jeff Katzenberg invited me over to see ‘Little Miss Sunshine’ six months before it came out in the theaters, and I literally watched the movie and I watched Alan — and I hadn’t been nominated or anything yet — and I watched the movie and I turned to Jeff afterwards and I said, ‘Now that performance right there is one of those performances that will steal somebody’s Oscar.’ I said those exact words,” Murphy said. “I was like, ‘He could steal somebody’s Oscar,’ then he stole mine.”\n\t\n\n\tHe added with a laugh, “No, I don’t feel like he stole mine.”\n\n\t“Dreamgirls” was nominated in eight categories at the 2007 Academy Awards. It won for best achievement and sound mixing, and best supporting actress for Jennifer Hudson.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Eddie Murphy Left 2007 Oscars After Losing Best Supporting Actor Because He Didn’t Want to Be ‘The Sympathy Guy All Night’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/MixCollage-03-Jan-2026-11-55-AM-2272.jpg?crop=0px%2C23px%2C1200px%2C675px&resize=1000%2C563"
      ],
      "datePublished": "2026-01-03T20:15:11.000Z",
      "dateModified": "2026-01-03T20:15:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Guillermo del Toro on Fulfilling His Dream of Making ‘Frankenstein’: ‘All My Life, I’ve Been Aiming Towards This Movie’",
    "url": "https://variety.com/2026/awards/news/guillermo-del-toro-dream-making-frankenstein-palm-springs-1236622500/",
    "image": "https://variety.com/wp-content/uploads/2025/12/LAB_Batteries_1_Guillermo_DelToro_0001_R.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-03T18:30:00.000Z",
    "description": "\n\tThe Palm Springs International Film Festival is all in on “Frankenstein”: director Guillermo del Toro and the film’s cast Jacob Elordi, Oscar Issac ",
    "body": "\n\tThe Palm Springs International Film Festival is all in on “Frankenstein”: director Guillermo del Toro and the film’s cast Jacob Elordi, Oscar Issac and Mia Goth are set to receive the 2026 Visionary Award  at the Palm Springs International Film Awards on Jan. 3. The Visionary Award, which honors boundary-breaking cinema. The award is being presented jointly to a director and cast for the first time in recognition of their exceptional collaboration.\n\t\n\n\tThe following day on Jan. 4, del Toro will receive the Creative Impact in Directing Award at a special brunch.\n\n\n\tBringing “Frankenstein” to the big screen has been a lifelong dream for the filmmaker, who has had a deep connection with the story ever since he read Mary Shelley’s classic at the age of 11.\n\n\tSpeaking recently in conversation with director Jason Reitman, del Toro said, “All my life, I’ve been aiming towards this movie. All 50 years of craft, thought, thematic pondering — everything. It is a fusion of the book, my life and what I know about the Romantic movement.”\n\n\tThe signs of his connection to “Frankenstein” are evident in his filmmaking, with elements of the story present in his films “Cronos” and “Pinocchio.” In his own words, the 2016 gothic romance “Crimson Peak” was a “dress rehearsal” for “Frankenstein.”\n\n\tWith his story, del Toro deconstructs the myth of “Frankenstein” and, rather than portraying the creature as a monster of horror, as other filmmakers have done before him, he creates a gentle, innocent and pure being played by Elordi. Isaac takes on the role of Dr. Victor Frankenstein, the scientist who becomes obsessed with conquering death. In the film, Victor constructs a large lab and builds his creature using parts from dead soldiers.\n\t\n\n\tThroughout “Frankenstein,” del Toro employs various motifs. Religion plays a significant role in the film, asking the question: Can man play God? Visually, del Toro uses a circular design to symbolize the circular narrative. Color also plays a key role in the film, with red, white and blue being the dominant choices.\n\n\t“We follow Victor’s experiments in the lab, which have the language of red and reflect the brutality of Victor as an artist whose musical notes happen to be anatomical,” del Toro told Variety. “Victor and Elizabeth [Goth] are the only ones who will wear red because Elizabeth is the mother figure, in a sense, and Victor is on a quest for eternal life because his mother died,” he adds. “All these elements come into play with the color and art direction.”\n\n\tAs Victor constructs his lab and assembles the Creature, the various stages of its creation are meticulously portrayed.\n\n\tSeamless stitching and different coloration on the Creature’s body reflect how Victor has pieced it together from body parts found on the battlefield. “By the time the Creature is revealed, [the audience] will have already seen the things that make him unique,” del Toro says. “He looks like a newborn, not like an ICU victim. And that’s important.”\n\n\tdel Toro’s “Frankenstein” is anything but a horror story. It raises questions and ends on a note of forgiveness.\n\n\t“The question of the book is: What makes us human, and why are we here?” del Toro explains. Forgiveness and acceptance, he says, are values that we are losing everyday. “The movie hopes to provoke emotion from a text that is 200 years old because it’s telling us we should know better,” he adds.\n\n\tAs for the Creature’s poignant line, “I forgive you,” del Toro reflects: “It’s the one we don’t hear often enough.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Guillermo del Toro on Fulfilling His Dream of Making ‘Frankenstein’: ‘All My Life, I’ve Been Aiming Towards This Movie’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/LAB_Batteries_1_Guillermo_DelToro_0001_R.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-03T18:30:00.000Z",
      "dateModified": "2026-01-03T18:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Billy Joel Takes Stage With Tribute Band for Two Songs, Performing Publicly for First Time Since Brain Disorder Diagnosis",
    "url": "https://variety.com/2026/music/news/billy-joel-performs-tribute-band-first-time-since-diagnosis-1236622912/",
    "image": "https://variety.com/wp-content/uploads/2026/01/GettyImages-2183985178-e1767465642705.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-03T19:34:51.000Z",
    "description": "\n\tBilly Joel proved that his performing days are not entirely behind him Friday night, taking the stage for two songs with a tribute band at an outdoo",
    "body": "\n\tBilly Joel proved that his performing days are not entirely behind him Friday night, taking the stage for two songs with a tribute band at an outdoor show in Florida’s Palm Beach County, his first time singing in front of a crowd since his touring was called off in May due to a brain disorder diagnosis affecting his balance.\n\n\tBundled up in a black cap and a winter vest, Joel got up on stage with the group Turnstiles to sing and play piano on a pair of his major hits, “Big Shot” and “We Didn’t Start the Fire.” He was joined on stage by his wife, Alexis Roderick, and introduced two young daughters, Della and Remy, who improvised dance routines throughout the crowd-rousing 12-minute cameo.\n\t\n\n\tJoel reportedly asked permission to come up to join the group that is named after one of his most popular 1970s albums. “I wasn’t planning on working tonight,” he told the crowd, laughing, before launching into the first number, as seen in fan-filmed video. \n\n\n\n\n\n\tThe occasion was a concert celebrating the 30th anniversary of the incorporation of the village of Wellington, Florida at the town’s amphitheater. Joel has a home in the area and owns nearby Middlesea Farms.\n\n\n\n\n\tJoel walked with the aid of a cane in taking the stage. “You want to sing it or am I gonna sing it?” the Turnstiles frontman asked as Joel sat at the keyboard.\n\n\t“What are we doing?” Joel asked, making it clear he was up for handling the vocals as well as piano.\n\n\t“A Billy Joel song, how about?” suggested the band member, playfully.\n\t\n\n\t“I can give it a try. I know the guy who wrote it,” Joel said with a laugh, as they launched into “We Didn’t Start the Fire.” At one point, the star needed a cue in remembering some of the legendarily voluminous lyrics, somewhere around the “Reagan… Palestine” part of the historical listmaking, but the band member obliged with a reminder, and Joel was able to continue with the tune from memory.\n\n\tAfter a huddle on stage about what to do as a followup, the performance continued with “Big Shot.”\n\n\t“I have to be dreaming this,” said the group’s usual singer, as Joel exited the stage with his family. “I’m gonna pinch myself. It had to happen sooner or later, right?… We wanna see you on stage soon.”\n\n\tJoel’s May exit from touring was tied to a buildup of fluid on his brain, with a diagnosis of normal pressure hydrocephalus (NPH), for which he said he would be seeking physical therapy as well as canceling all shows indefinitely. In a July interview with Bill Maher, he affirmed that he felt fine apart from difficulty keeping his balance, something that had become apparent when he had a fall on stage in February.\n\n\tEven without fulfilling a planned run of arena shows, Joel had a big public profile in 2025, thanks to the release in the summer of an acclaimed two-part HBO documentary “Billy Joel: And So It Goes,” which managed to captivate a large audience of non-fans as well as the Joel faithful.\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Billy Joel Takes Stage With Tribute Band for Two Songs, Performing Publicly for First Time Since Brain Disorder Diagnosis",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/GettyImages-2183985178-e1767465642705.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-03T19:34:51.000Z",
      "dateModified": "2026-01-03T19:34:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The People Who Say Timothée Chalamet’s ‘Marty Supreme’ Character Isn’t ‘Likable’ Sound Like Corrupt Studio Executives",
    "url": "https://variety.com/2026/film/columns/is-timothee-chalamets-marty-supreme-character-likable-1236622841/",
    "image": "https://variety.com/wp-content/uploads/2024/12/Marty-Supreme-1.jpg?w=800&h=533&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-03T18:58:00.000Z",
    "description": "\n\tIs the hero of “Marty Supreme” likable? I think he is, and for reasons that include the fact that he’s a scoundrel. (Has there ever been a likable s",
    "body": "\n\tIs the hero of “Marty Supreme” likable? I think he is, and for reasons that include the fact that he’s a scoundrel. (Has there ever been a likable scoundrel in movies? No! Not Once!) The number-one reason we like — or, at least, I like — Marty Mauser is, of course, that he’s played by Timothée Chalamet, the most charismatic movie star of his generation. Chalamet, like Dustin Hoffman or Julia Roberts or Brad Pitt, has the X factor, a quality that draws us to him regardless of what he does. (Just look at some of those outfits he wore on the red carpet when he was becoming a star. Without the X factor, those clothes would have looked postmodern gaudy ridiculous; with the X factor, they still sometimes did, but they became…defining. In sporting those clothes, he shifted the whole culture.)\n\t\n\n\tIn “Marty Supreme,” Chalamet’s Marty is a 23-year-old Ping-Pong wizard who’s a total selfish monomaniac, and not without good cause. The year is 1952, and Marty thinks he’s the greatest table-tennis player in the world. From what we can see, he may well be. The Ping-Pong matches in “Marty Supreme” are more exciting than the car races in “F1” or the fight scenes in 49 out of 50 boxing movies. They’re existential ballets of whirling spinning back-and-forth high-flying no-he-didn’t-just-do-that! action. The challenge that confronts Marty is this: How can he get the world to witness his skill? He keeps having to scrape up money to attend international tournaments, and since he has no money, that means that he has to lie, cheat, steal, gamble, hustle, seduce, manipulate, and at one point find the will to endure a heavy round of corporal-punishment-by-Ping-Pong-paddle. Through all of this, he treats everyone around him, including his pregnant girlfriend, like they don’t matter. He acts like a textbook sociopath, and maybe he is one.\n\t\n\n\tBut if that’s the case, he’s a sociopath with a dream. Marty doesn’t merely want to succeed; he doesn’t just want to win. He wants to change the karma of his life, which means building a castle in the air atop the rickety-to-nonexistent foundation of his background as a poor Jewish kid from the Lower East Side. The way Chalamet plays Marty, with a come-hither smirk, eyes that are clear and fun-loving and burningly alive, and a motormouth that won’t quit, he’s a kid who never stops hustling and deceiving, but all because he knows that his hustles are going to add up to something greater than the sum of their deceptions. They’re going to take him to the next level. They’re going to allow him to transcend.\n\n\tAnd here’s the point. Unless he does all this, he will not transcend. He will fail. So it’s not just that he’s a charming duplicitous hustler sociopath. It’s that life has called upon him to be a charming duplicitous hustler sociopath. He fulfills his destiny by making it up as he goes along, and by being utterly ruthless in the journey.\n\n\tMarty is what we used to call an antihero: a character we identify with and root for, even though he has many qualities that are less than heroic. You remember antiheroes, don’t you? They were at the center of so many of those movies from the 1970s that everyone says they love so much — the movies “you couldn’t make today.” But that morally ambiguous good-bad quality of Marty Mauser has ruffled some feathers in our age of holier-if-not-hipper-than-thou puritanical judgment, where everyone is so busy trying to righteously one-up everyone else. Marty has been declared, within a certain swath of social media, to be a poor role model. He’s too selfish, too aggro, too entitled, too toxic…too dislikable. Is this an organic expression of distaste, or is it part of the movie’s Oscar Take-Down Campaign? Maybe both. Either way, it’s enough to make you wonder if we’re witnessing a 21st-century revival of the Legion of Decency.\n\n\tOr maybe it’s a revival of that fabled Hollywood figure: the corrupt 1980s studio executive, the one who was so wired into test screenings that he couldn’t let a moment of bad behavior slide by without asking, “But will the audience like that?” Have we completely forgotten that movies — and movie heroes — aren’t always supposed to be likable or nice, that they’re supposed to have rough edges and sometimes look as flawed as most of us are? Or even more so?\n\t\n\n\tThat dynamic has always been an integral part of movies, and that’s why movies have always been controversial. They don’t just depict sin — they celebrate it. The gangster films of the early ’30s, like “The Public Enemy” and “Scarface,” asked people to identity with depraved killers, which was quite a radical stance for the early 20th century. But audiences were ready to embrace something radical, because they had been disillusioned by life (the Depression was all around them), and Hollywood, from the start, was about giving voice to the inner urges of the dispossessed. Was it “responsible” to ask viewers to identity with James Cagney, in “The Public Enemy,” smooshing a grapefruit into Mae Clarke’s face, or Paul Muni in “Scarface” shooting up the works with a Thompson submachine gun? The question answers itself. Of course it wasn’t. But it was liberating, precisely because it wasn’t responsible. That’s why movies are such a beautifully dangerous art form.\n\n\tSo here we are 100 years later, living in a culture that’s more liberated and unhinged than anything the citizens of the 1930s could have dreamed of. We’re now a nation of addicts and sensationalists; our mainstream entertainment (the extreme horror films, the TikTok fashion-porn videos) flirts, on a daily basis, with depravity. And here is Josh Safdie, the brilliant director of “Marty Supreme,” making a movie that’s linked in many ways to “Uncut Gems,” the landmark 2019 thriller he co-directed with his brother Benny, starring Adam Sandler as a degenerate gambler (a character all but ruled by his dislikable qualities). “Marty Supreme” is like “Uncut Gems” remade as a follow-your-dream crowd-pleaser. Yet this is a movie, and a movie hero, that the forces of performative virtue have somehow deemed…not moral and upstanding enough!\n\n\tIf you look closely, though, he really is. That’s the film’s — and Chalamet’s — extraordinary triumph. A movie star’s charisma is more than magnetism or sex appeal or “likability.” It’s a kind of spiritual-moral power, a force that bends those of us in the audience toward the actor who has it. Staring up at the big screen, we chime with that person, responding to their very being. We’re drawn into the flow of their action and motivation, into the essential trigger of why they do what they do. In “Marty Supreme,” Timothée Chalamet doesn’t just play a sociopathic scoundrel. He shows us what it looks like when you’ve steeled yourself to triumph over a life that’s going to throw you another stumbling block every minute, that’s going to make you jump through hoops to find your new self. And when Marty finally does, collapsing on the floor in exhilarated exhaustion after a table-tennis showdown because he has finally turned destiny around, you want to applaud how much this devotedly selfish, spectacularly flawed character has become all of us, because all he really wanted was to be happy. To be the supreme version of himself.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The People Who Say Timothée Chalamet’s ‘Marty Supreme’ Character Isn’t ‘Likable’ Sound Like Corrupt Studio Executives",
      "image": [
        "https://variety.com/wp-content/uploads/2024/12/Marty-Supreme-1.jpg?w=800&h=533&crop=1"
      ],
      "datePublished": "2026-01-03T18:58:00.000Z",
      "dateModified": "2026-01-03T18:58:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tony Dokoupil’s ‘CBS Evening News’ Run to Start Early Amid Venezuela Chaos",
    "url": "https://variety.com/2026/tv/news/tony-dokoupil-cbs-evening-news-early-venezuela-1236622872/",
    "image": "https://variety.com/wp-content/uploads/2022/06/117862_2409b.jpg?crop=0px%2C108px%2C3000px%2C1688px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-01-03T17:58:39.000Z",
    "description": "\n\tTony Dokoupil is going to have some explaining to do.\n\n\tDokoupil will start his run on the “CBS Evening News” two days earlier than expected, accord",
    "body": "\n\tTony Dokoupil is going to have some explaining to do.\n\n\tDokoupil will start his run on the “CBS Evening News” two days earlier than expected, according to two people familiar with the matter, taking the anchor desk from San Francisco Saturday night as the nation seeks news and information about the U.S. decision to launch military strikes on Venezuela and capture leader  Nicolás Maduro. \n\n\n\tCBS News declined to make executives available to discuss coverage plans. \n\t\n\n\tThe anchor’s debut appearance on “CBS Evening News” may come with some challenges. In recent days, both Dokoupil and CBS News have made statements on social media that defy some journalistic norms. Dokoupil appeared in a promo, for example, alleging that legacy media outlets have not covered past events well “because we’ve taken into account the perspective of advocates and not the average American. Or we put too much weight in the analysis of academics or elites, and not enough on you.” CBS News said Friday that one of its new principles was “We love America. And we make no apologies for saying so.” But taking such a stance could undermine the operation’s newsgathering, particularly on a day when President Trump declared that the U.S. would “run” Venezuela after capturing its president.\n\n\tWill CBS take a pro-government stance or follow facts where they lead? The Paramount Skydance’s recent statements cast fog around the issue. Followers of Dokoupil’s Instagram account raised similar questions in recent days, and Dokoupil responded to some, noting that he had written the words to his recent promo and urged people to “Hold me to them.”\n\t\n\n\tCBS News is being recalibrated by its new editor in chief, Bari Weiss, an opinion provocateur who previously led The Free Press, a site that made plain its support of an anti-woke stance as well as of Israel. Paramount bought the outlet for a reported $150 million earlier this year and installed Weiss as head of CBS News’ editorial operations, alongside president Tom Cibrowski. Since her arrival, Weiss, who has no experience managing a large traditional media operation, has drawn increasing scrutiny. She set up a new series of town hall discussions and debates, chastised the newsroom and other traditional media organizations and, most recently, spurred controversy by calling for a fully vetted and reported “60 Minutes” segment to be held.\n\n\tDokoupil was to have launched his “Evening News” tenure on Monday, kicking off an effort to report from various U.S. cities and towns. Now, plans have changed. While he will hold forth Saturday night at San Francisco’s KPIX, his journey across America has been put on hold, according to a person familiar with the matter. Dokoupil will return to New York to continue his “Evening News” duties, this person said.\n\n\tOther top anchors were called in Saturday to handle the breaking news. Bret Baier, who typically anchors a weekday program on Fox News Channel, was spotted on air Saturday. Rachel Maddow, who normally leads an hour a week on MS NOW, appeared on camera Saturday alongside regular anchor Ali Velshi. Erin Burnett and Wolf Blitzer were called in to help  anchor Saturday on CNN.\n\n\tMore moves may be afoot. Tom Llamas is expected to anchor Saturday’s broadcast of “NBC Nightly News,” according to a person familiar with the matter.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tony Dokoupil’s ‘CBS Evening News’ Run to Start Early Amid Venezuela Chaos",
      "image": [
        "https://variety.com/wp-content/uploads/2022/06/117862_2409b.jpg?crop=0px%2C108px%2C3000px%2C1688px&resize=1000%2C563"
      ],
      "datePublished": "2026-01-03T17:58:39.000Z",
      "dateModified": "2026-01-03T17:58:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Dwayne Johnson on Surviving His Dysfunctional Childhood and Shedding ‘The Responsibility of Making the Audience Feel Good’",
    "url": "https://variety.com/2026/film/features/dwayne-johnson-abusive-childhood-audiences-1236622553/",
    "image": "https://variety.com/wp-content/uploads/2025/12/Dwayne-Johnson-Variety-CNN-Actors-on-Actors.jpg?crop=0px%2C307px%2C1200px%2C675px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-01-03T18:00:00.000Z",
    "description": "\n\tAs an adolescent, Dwayne Johnson and his family bounced around the country, from urban North Carolina to suburban Connecticut. But there was one con",
    "body": "\n\tAs an adolescent, Dwayne Johnson and his family bounced around the country, from urban North Carolina to suburban Connecticut. But there was one constant: the dysfunction.\n\n\t“My own mom and dad had an explosive and volcanic relationship,” he recalls. “My dad was a pro wrestler at a time when it was the Wild West. There wasn’t million-dollar contracts. It was paycheck to paycheck and just trying to survive. And my dad struggled with his addictions and focused on his career and himself, while my mom was at home, raising me. She had to give up her own dreams and support the man that she loves. All she wanted was to be seen, and she was never seen. And I grew up watching that kind of decline in a relationship when a man battles his own demons. I watched their fights. I heard their fights, which is even worse.”\n\t\n\n\tFor the 26-year span of his acting career, Johnson compartmentalized the pain and instead focused on breezy tough-guy roles in such billion-dollar-plus juggernauts as “Jumanji: Welcome to the Jungle” and “Furious 7.”\n\n\n\t“For years, I didn’t know that could actually serve as a landing place for me to be able to put all this trauma you go through into my work,” he explains. “I was probably scared to go there.”\n\n\tBut in 2017, he felt the courage to plumb the past and began pursuing the life rights of MMA fighter Mark Kerr, whose drug addiction fettered his career as a two-time UFC heavyweight champ in the late ’90s. The result is A24’s “The Smashing Machine,” a career pinnacle for Johnson, who sinks so thoroughly into a protagonist both bruising and bruised that he is unrecognizable. \n\t\n\n\tVariety will celebrate Johnson with the Creative Impact in Acting Award at the 2026 Palm Springs International Film Festival. The superstar, who received his first-ever Golden Globe nomination for his work in “Smashing Machine,” is set to receive the honor on Jan. 4 during Variety’s annual brunch.\n\n\tWith the role, he didn’t merely confront his own rocky past. Johnson, who parlayed his own professional wrestling stardom into movie A-lister, follows on the heels of several recent actresses long been defined by their bodies rather than their bodies of work who delivered revelatory performances including Demi Moore (“The Substance”), Nicole Scherzinger (“Sunset Boulevard”) and Pamela Anderson (“The Last Showgirl”). For actors, that opportunity and feat is even rarer. But when Johnson first approached Benny Safdie in 2019 with the idea of bringing Kerr’s story to the big screen, the director recognized Johnson’s potential.\n\n\t“He said, ‘I want to make this film with you. I know how to make it. I’m going to write the script on spec,’” Johnson says of Safdie, who had worked exclusively with his brother Josh in the past on such acclaimed indies as the Adam Sandler starrer “Uncut Gems” and the Robert Pattinson star vehicle “Good Times.” Johnson met with both brothers but says “Smashing Machine” was always developed as a solo effort by Benny.\n\n\t“After ‘Uncut Gems,’ I felt like they were probably having their conversations about going in different directions,” he says.\n\n\tThe director and actor’s vision quickly dovetailed thanks to their shared experience of being in the destructive orbit of substance abuse.\n\n\t“I realized how much we had in common. I said, ‘Benny, I’ve lost 15 friends to addiction and suicide. Perhaps this could serve as a beacon or lighthouse to people who are struggling with addiction,” Johnson remembers. “And Benny began sharing with me everything that he had experienced with his own family members and addictions.”\n\n\tIn fact, Safdie’s experiences shaped a riveting eight-minute scene near the end of “Smashing Machine,” in which Johnson and co-star Emily Blunt, who portrays Kerr’s girlfriend Dawn Staples, play out the culmination of their co-dependent spiral.\n\n\t“Benny goes, ‘If you guys could wind up on the floor, that would really mean a lot to me,’” Johnson says of the bathroom scene. “And I said to him, ‘Why the floor?’ And he paused and said, ‘Well, I’ve been through that. I know what it’s like to hold someone while they’re kicking and screaming. You don’t want to let go.’ And then I realized that’s why the story connected so deeply with us.”\n\t\n\n\tJohnson says it was a first for him — to have an opportunity to sit in his pain along with the audience. “It was the most freeing I have ever felt in my entire career,” he says. “When you make these blockbuster films, you have the responsibility of making the audience feel good and the choices you make [are dictated by] the character’s likability. And for the first time, every shot, every day, regardless of the scene, that never crossed my mind.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Dwayne Johnson on Surviving His Dysfunctional Childhood and Shedding ‘The Responsibility of Making the Audience Feel Good’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/Dwayne-Johnson-Variety-CNN-Actors-on-Actors.jpg?crop=0px%2C307px%2C1200px%2C675px&resize=1000%2C563"
      ],
      "datePublished": "2026-01-03T18:00:00.000Z",
      "dateModified": "2026-01-03T18:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Post New Year’s Box Office: ‘Avatar: Fire and Ash’ Holds Strong with $14 Million on Friday; ‘Zootopia 2’ Earns $7.1 Million for Second Place",
    "url": "https://variety.com/2026/film/news/post-new-years-box-office-avatar-fire-and-ash-zootopia-2-1236621631/",
    "image": "https://variety.com/wp-content/uploads/2026/01/MixCollage-03-Jan-2026-08-22-AM-3282.jpg?crop=14px%2C19px%2C1174px%2C660px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-01-03T16:39:34.000Z",
    "description": "\n\t“Avatar: Fire and Ash” took an early lead at the post-New Year’s box office, marking its third Friday at the top of the charts.\n\n\tJames Cameron’s th",
    "body": "\n\t“Avatar: Fire and Ash” took an early lead at the post-New Year’s box office, marking its third Friday at the top of the charts.\n\n\tJames Cameron’s third “Avatar” installment earned $14 million on Friday, holding strong with just a 38% decline from this time last week. The sci-fi epic is expected to gross $36 million by Sunday, bringing the domestic total to roughly $302 million.\n\n\n\tBringing up the rear was a batch of holdovers, including “Marty Supreme,” “Zootopia 2,” “Anaconda” and “The Housemaid.”\n\t\n\n\t“Zootopia 2” once again cracked the top five on Friday, earning $7.1 million for a second-place finish. That’s about a 6% higher gross than last Friday. An impressive feat, given Disney’s animated adventure first hit theaters over a month ago. Kids are still out of school for winter break, which no doubt spurred the late-stage boost. The film looks to gross $18 million by Sunday, bringing the domestic total to $362 million.\n\n\n\t“Zootopia 2” recently became Walt Disney Animation’s highest-grossing movie of all time with $1.46 billion at the global box office. The film surpassed another animated sequel, “Frozen 2,” which earned $1.45 billion in 2019.\n\n\t“The Housemaid” took third place with $5.2 million on Friday, impressively mirroring earnings from this time last week. The Lionsgate thriller, starring Sydney Sweeney as a live-in maid with a dark past, looks to add $13.8 million by Sunday for a domestic total of $74.6 million.\n\n\tRounding out the top five on Friday were A24’s ping pong drama “Marty Supreme” and Sony’s adventure comedy “Anaconda.” “Marty Supreme” took fourth with $4.6 million, marking a 32% decline from last Friday. The film is projected to gross around $11 million by Sunday for a domestic total of $55 million. “Anaconda” landed at No. 5 with $3.5 million, representing about a 34% decline. The film should make $9.2 million by Sunday, bringing the domestic total to $45 million.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Post New Year’s Box Office: ‘Avatar: Fire and Ash’ Holds Strong with $14 Million on Friday; ‘Zootopia 2’ Earns $7.1 Million for Second Place",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/MixCollage-03-Jan-2026-08-22-AM-3282.jpg?crop=14px%2C19px%2C1174px%2C660px&resize=1000%2C563"
      ],
      "datePublished": "2026-01-03T16:39:34.000Z",
      "dateModified": "2026-01-03T16:39:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump Shares Photo of Nicolás Maduro in Custody After Venezuela Strikes, Calls Military Operation ‘An Assault Like People Had Not Seen Since World War II’",
    "url": "https://variety.com/2026/global/news/trump-photo-nicolas-maduro-venezuela-strikes-1236622866/",
    "image": "https://variety.com/wp-content/uploads/2026/01/GettyImages-2254498929.jpg?crop=0px%2C32px%2C5393px%2C3033px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-01-03T17:30:48.000Z",
    "description": "\n\tDonald Trump took to Truth Social early Saturday to share a photo of Venezuelan President Nicolás Maduro in custody after the United States conducte",
    "body": "\n\tDonald Trump took to Truth Social early Saturday to share a photo of Venezuelan President Nicolás Maduro in custody after the United States conducted air strikes against Caracas, Venezuela’s capital, late Friday and into Saturday.\n\n\tTrump confirmed the strikes were a U.S. operation in a Truth Social post on Saturday morning. He wrote, “The United States of America has successfully carried out a large scale strike against Venezuela and its leader, President Nicolas Maduro, who has been, along with his wife, captured and flown out of the Country. This operation was done in conjunction with U.S. Law Enforcement. Details to follow. There will be a News Conference today at 11 A.M., at Mar-a-Lago. Thank you for your attention to this matter! President DONALD J. TRUMP.”\n\t\n\n\tIn the opening of the conference, Trump called the strikes a “spectacular assault” at a level that “people had not seen since World War II.” The president also said that Maduro’s wife, Cila Flores, was also captured, adding that they both have been indicted in the Southern District of New York “for their campaign of deadly narco-terrorism against the United States and its citizens.”\n\n\n\tTrump claimed that “not a single American service member was killed” during the operation. According to The New York Times, there is no indication that the U.S. military is currently in Venezuela.\n\n\tThe president said that the United States is going to “run” the country until a “safe, proper and judicious transition” of power can be facilitated. Trump added that he hopes for “peace, liberty and Justice for the great people of Venezuela.” No details were given as to how the U.S. plans to govern Venezuela.\n\t\n\n\tTrump also promised that United States oil companies will spend “billions of dollars” to help fix Venezuela’s “badly broken” oil infrastructure and start “making money for the country.”\n\n\tPer Reuters, a spokesperson for United Nations Secretary-General Antonio Guterres said that the U.S. strikes against Venezuela set “a dangerous precedent.” Venezuela and Colombia have requested a 15-member Security Council meeting to discuss the matter. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump Shares Photo of Nicolás Maduro in Custody After Venezuela Strikes, Calls Military Operation ‘An Assault Like People Had Not Seen Since World War II’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/GettyImages-2254498929.jpg?crop=0px%2C32px%2C5393px%2C3033px&resize=1000%2C563"
      ],
      "datePublished": "2026-01-03T17:30:48.000Z",
      "dateModified": "2026-01-03T17:30:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Critics Choice Winner Predictions: Timothée Chalamet, Jessie Buckley and a Close Race Between ‘Sinners’ and ‘One Battle After Another’",
    "url": "https://variety.com/2026/film/awards/critics-choice-predictions-one-battle-sinners-1236622810/",
    "image": "https://variety.com/wp-content/uploads/2025/12/Hamnet-One-Battle-After-Another-Frankenstein-Marty-Supreme-Sinners.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-03T16:00:00.000Z",
    "description": "\n\t\n\t\t\t\n\t\t\t\t\n\t\n\n\t\n\tJan 3, 2026 8:00am PT\t\n\t\n\n\t\n\t\tCritics Choice Winner Predictions: Timothée Chalamet, Jessie Buckley and a Close Race Between ‘Sinners",
    "body": "\n\t\n\t\t\t\n\t\t\t\t\n\t\n\n\t\n\tJan 3, 2026 8:00am PT\t\n\t\n\n\t\n\t\tCritics Choice Winner Predictions: Timothée Chalamet, Jessie Buckley and a Close Race Between ‘Sinners’ and ‘One Battle After Another’\n\t\n\t\n\t\t\t\n\n\n\t\t\t\n\t\t\t\n\t\n\n\t\t\t\t\t\t\t\t\tFocus Features / Warner Bros. / Netflix / A24\n\t\n\n\t\t\n\t\n\t\t\t\t\n\tThe 31st Critics Choice Awards arrive Sunday with Chelsea Handler set to return as host. This year, Ryan Coogler’s “Sinners” leads the nomination tally at 17 nods, but Variety is projecting a big night for Paul Thomas Anderson’s “One Battle After Another” when winners are announced live on E!\n\n\t“One Battle” is projected to take best picture, director and adapted screenplay. However, we are also forecasting that “Sinners,” the vampire-tinged epic will take home the most trophies with six including original screenplay for Coogler. \n\t\n\n\n\n\t\n\n\t\t\t\t\tMARTY SUPREME, Timothee Chalamet, 2025. © A24 / Courtesy Everett Collection\n\t\t\t\t\t\t\t\t\tCourtesy Everett Collection\n\t\n\n\n\n\tThe current expectation for the acting races suggest a strong night for a quartet of performances tied to four different films: Timothée Chalamet for “Marty Supreme,” Jessie Buckley for “Hamnet,” Benicio del Toro for “One Battle After Another” and Amy Madigan for “Weapons.” If that quartet holds, it would signal a more fluid and wide open race and reflecting broad enthusiasm across the top tier rather than turning the ceremony into a single-movie coronation.\n\n\n\tStill, the acting races are where the upsets tend to live. Best actor has two obvious alternatives with win-worthy narratives and passionate pockets of support: Leonardo DiCaprio for “One Battle” and Ethan Hawke for “Blue Moon.” Best actress is similarly primed for a late surge, with Rose Byrne in “If I Had Legs I’d Kick You” representing the kind of critics-forward pick that can surprise if the vote splinters. \n\n\tSupporting actor has its own volatility, with Stellan Skarsgård for “Sentimental Value” and Sean Penn for “One Battle After Another” both positioned as credible spoilers. And supporting actress may be the flashpoint category of the night, with Ariana Grande for “Wicked: For Good” and Teyana Taylor for “One Battle After Another” standing as the most headline-ready threats to any presumed frontrunner. Even Inga Ibsdotter Lilleaas has the chance to spoil.\n\t\n\n\tThe Critics Choice Association, comprising of roughly 575 voting members, has historically served as a reliable barometer for Oscar momentum. Last year’s best picture winner “Anora” used its CCA victory to reassert itself in the race after Golden Globe and SAG Awards shutouts, ultimately carrying that momentum to Academy Awards glory. However, this is a different time as this marks the first major awards ceremony of the year, and Oscar voting set to begin on Jan. 12. A great speech and a huge victory can be a game-changer in a race this tight.\n\n\tBelow are category the predicted winners.\n\t\n\t\tFilm\t\n\n\nBest Picture: “One Battle After Another” (Alternate: “Sinners”)\nBest Director: Paul Thomas Anderson, “One Battle After Another” (Alternate: Ryan Coogler, “Sinners”)\nBest Actor: Timothée Chalamet, “Marty Supreme” (Alternate: Leonardo DiCaprio, “One Battle After Another”)\nBest Actress: Jessie Buckley, “Hamnet” (Alternate: Rose Byrne, “If I Had Legs I’d Kick You”)\nBest Supporting Actor: Benicio del Toro, “One Battle After Another” (Alternate: Stellan Skarsgård, “Sentimental Value”)\nBest Supporting Actress: Amy Madigan, “Weapons” (Alternate: Ariana Grande, “Wicked: For Good”)\nBest Original Screenplay: Ryan Coogler, “Sinners” (Alternate: Ronald Bronstein and Josh Safdie, “Marty Supreme”)\nBest Adapted Screenplay: Paul Thomas Anderson, “One Battle After Another” (Alternate: Chloé Zhao and Maggie O’Farrell, “Hamnet”)\nBest Young Performer: Miles Caton, “Sinners” (Alternate: Jacobi Jupe, “Hamnet”)\nBest Casting and Ensemble: “Sinners” (Alternate: “Hamnet”)\nBest Comedy: “The Naked Gun” (Alternate: “The Phoenician Scheme”)\nBest Animated Feature: “KPop Demon Hunters” (Alternate: “Zootopia 2”)\nBest Production Design: “Frankenstein ” (Alternate: “Sinners”)\nBest Cinematography: “Sinners” (Alternate: “One Battle After Another”)\nBest Costume Design: “Wicked: For Good” (Alternate: “Sinners”)\nBest Editing: “Marty Supreme” (Alternate: “One Battle After Another”)\nBest Hair and Makeup: “Weapons” (Alternate: “Wicked: For Good”)\nBest Sound: “Sinners” (Alternate: “F1”)\nBest Visual Effects: “Avatar: Fire and Ash” (Alternate: “F1”)\nBest Score: “Sinners” (Alternate: “One Battle After Another”)\nBest Song: “Golden” from “KPop Demon Hunters” (Alternate: “The Girl in the Bubble,” “Wicked: For Good”)\nBest Foreign Language Film: “It Was Just an Accident” (Alternate: “The Secret Agent”)\n\n\n\t\n\t\tTelevision\t\n\n\nBest Drama Series: “The Pitt” (Alternate: “Severance”)\nBest Comedy Series: “The Studio” (Alternate: “Abbott Elementary”)\nBest Limited Series: “Adolescence” (Alternate: “Dope Thief”)\nBest Movie Made for Television: “Mountainhead” (Alternate: “Bridget Jones: Mad About the Boy”)\nBest Actor in a Drama Series: Noah Wyle, “The Pitt” (Alternate: Diego Luna, “Andor”)\nBest Actress in a Drama Series: Rhea Seehorn, “Pluribus” (Alternate: Britt Lower, “Severance”)\nBest Actor in a Comedy Series: Seth Rogen, “The Studio” (Alternate: Danny McBride, “The Righteous Gemstones”)\nBest Actress in a Comedy Series: Jean Smart, “Hacks” (Alternate: Kristen Bell, “Nobody Wants This”)\nBest Actor in a Limited Series or Movie Made for Television: Stephen Graham, “Adolescence” (Alternate: Brian Tyree Henry, “Dope Thief”)\nBest Actress in a Limited Series or Movie Made for Television: Michelle Williams, “Dying for Sex” (Alternate: Sarah Snook, “All Her Fault”)\nBest Supporting Actor in a Drama Series: Tramell Tillman, “Severance” (Alternate: Billy Crudup, “The Morning Show”)\nBest Supporting Actress in a Drama Series: Allison Janney, “The Diplomat” (Alternate: Greta Lee, “The Morning Show”)\nBest Supporting Actor in a Comedy Series: Ike Barinholtz, “The Studio” (Alternate: Chris Perfetti, “Abbott Elementary”)\nBest Supporting Actress in a Comedy Series: Hannah Einbinder, “Hacks” (Alternate: Janelle James, “Abbott Elementary”)\nBest Supporting Actor in a Limited Series or Movie Made for Television: Owen Cooper, “Adolescence” (Alternate: Wagner Moura, “Dope Thief”)\nBest Supporting Actress in a Limited Series or Movie Made for Television: Erin Doherty, “Adolescence” (Alternate: Julianne Moore, “Sirens”)\nBest Animated Series: “South Park” (Alternate: “Harley Quinn”)\nBest Foreign Language Series: “Squid Game” (Alternate: “When No One Sees Us”)\nBest Talk Show: “The Late Show With Stephen Colbert” (Alternate: “Last Week Tonight With John Oliver”)\nBest Comedy Special: “Marc Maron: Panicked” (Alternate: “Sarah Silverman: PostMortem”)\nBest Variety Series: “Saturday Night Live” (Alternate: “Conan O’Brien Must Go”)\n\n\n\n\n\t\n\t\tMore from Variety\n\t\n\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\n\n\t\t\n\n\t\n\t\tMore From Our Brands\n\t\n\t\n\t\t\n\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\n\tRolling Stone\n\n\t\t\t\t\tThe U.S. Captured Venezuelan President Nicolás Maduro. Here’s What We Know\t\t\n\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\n\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\n\tRobb Report\n\n\t\t\t\t\tWhy the Porsche 964 Is Still the Best Version of the 911 Ever Made\t\t\n\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\n\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\n\tSportico\n\n\t\t\t\t\tAmazon vs. YouTube, Other Tech Battles Reshaping Sports in 2026\t\t\n\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\n\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\n\tWWD\n\n\t\t\t\t\tRachel Zoe Bundles Up in a Furry Jacket for a Night Out in Aspen\t\t\n\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\n\t\t\n\t\n\t\n\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Critics Choice Winner Predictions: Timothée Chalamet, Jessie Buckley and a Close Race Between ‘Sinners’ and ‘One Battle After Another’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/Hamnet-One-Battle-After-Another-Frankenstein-Marty-Supreme-Sinners.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-03T16:00:00.000Z",
      "dateModified": "2026-01-03T16:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Teyana Taylor on Being Open to a ‘One Battle After Another’ Sequel or Releasing Extra Scenes: ‘Drop It Like a Mixtape!’",
    "url": "https://variety.com/2026/film/features/teyana-taylor-one-battle-after-another-sequel-1236622251/",
    "image": "https://variety.com/wp-content/uploads/2026/01/rev-1-OBAA-DUS-250113-0005-4_High_Res_JPEG.jpeg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-03T16:30:00.000Z",
    "description": "\n\tTeyana Taylor is a singer, songwriter, choreographer, actor and director who is also currently in culinary school and designs graphic T-shirts and m",
    "body": "\n\tTeyana Taylor is a singer, songwriter, choreographer, actor and director who is also currently in culinary school and designs graphic T-shirts and merchandise. And she doesn’t just dabble in these fields — she excels. So, it begs the question: is there anything she’s bad at? “I hate being cold,” Taylor reveals. “The cold is going to conquer me every single time. I can’t even fake it. If I had to audition for a winter movie — nope.”Fortunately, the temperatures should be balmy in January when she receives the Creative Impact in Breakthrough Performance Award at a special brunch Jan. 4 at the Palm Springs International Film Awards for her role in Paul Thomas Anderson’s “One Battle After Another.” She plays Perfidia Beverly Hills, a member of a resistance group who gives birth to — then abandons — her daughter, Willa. Sixteen years later, Willa finds herself at the center of a massive conspiracy that brings some of her mother’s old allies out of hiding. And Taylor is a force — driven, determined, sexy, smart. She more than holds her own opposite Oscar-winners Leonardo DiCaprio and Sean Penn.The two worked together to build the role. That included Perfidia’s battle with postpartum depression, something the mother of two understands personally. In fact, she improvised several lines about “the feeling of not feeling seen and not feeling beautiful, not feeling heard and just not being able for the baby to latch on.” She was grateful Anderson chose to include it. “I feel like it’s a topic that’s not spoken about enough. I was anxious and excited to start getting into those layers.”Taylor previously earned raves for her performance in the 2023 Sundance winner “A Thousand and One,” where she played another complicated mother who kidnaps her own child out of foster care. She has no qualms about taking on a role that some audience members might judge.“[Perfidia] makes decisions that we may not all agree with, but we can all agree on the fact that she’s unapologetically herself and stands 10 toes down on a lot of things that we probably wouldn’t have been able to do at one point,” she notes. “Especially as a woman, we’re told we’re too confident, we got to tone it down. Here we see this woman. It’s like ‘No, you won’t quiet me. You won’t set me down. I won’t play house with you.’”The character is so fascinating and complex, Taylor wouldn’t hesitate to play her again. Noting that Perfidia disappears from the film for 16 years only to be heard from in a letter at the end, she would love to know more about her life. So she’s open to a sequel or a companion piece — suggest the “Perfidia Beverly Hills Expanded Universe,” and she says to tell Anderson: “He could have pulled a ‘Wicked!’ He could have shot all of it and broken it in two because it’s so much story.” She even suggests making a spinoff utilizing footage that didn’t make the final cut and new scenes. “You could literally merge the other pieces, get a few new scenes with me — and then drop it, drop it like a mixtape!”\n\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Teyana Taylor on Being Open to a ‘One Battle After Another’ Sequel or Releasing Extra Scenes: ‘Drop It Like a Mixtape!’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/rev-1-OBAA-DUS-250113-0005-4_High_Res_JPEG.jpeg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-03T16:30:00.000Z",
      "dateModified": "2026-01-03T16:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Possible Suicide Being Investigated at Disney World",
    "url": "https://www.tmz.com/2026/01/03/disney-world-possible-suicide-dead-body-found/",
    "image": "https://imagez.tmz.com/image/33/16by9/2026/01/03/331696cf8033449d923d91b6478f71fb_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-03T15:18:59.000Z",
    "description": "\n    \n                    \n                          Disney World\n                          Death Toll Rises ...\n                          Cops Probe ",
    "body": "\n    \n                    \n                          Disney World\n                          Death Toll Rises ...\n                          Cops Probe Possible Suicide\n                      \n                  \n                                                                        Published \n                              January 3, 2026\n                            7:18 AM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Police are investigating a possible suicide at Disney World after a body was found on resort property.\n      \n    \n          Florida's Orange County Sheriff's Office tells TMZ ... deputies responded to the Disney Springs Orange Garage on East Buena Vista Drive at approximately 9 PM Friday evening and discovered a man who was deceased.\n      \n    \n          They tell us the incident is being investigated as a possible suicide. No further details are currently available.\n      \n\n                  \n          \n                          \n                \n                  \n      \n    \n          As you know, there has been a wave of deaths at \"The Most Magical Place on Earth\" as of late. There were 5 reported on resort property within a month between October and November 2025 -- 2 of them were confirmed as suicides.\n      \n    \n          Plus, a 73-year-old man went missing after falling overboard off a Disney Wonder cruise between Australia and New Zealand in November as well ... with authorities believing he jumped off the ship.\n      \n    \n          Waiting for your permission to load TikTok Post.\n      \n    \n          And just this week, there was a close call when a massive prop boulder injured a worker when it went rogue at the Indiana Jones Epic Stunt Spectacular at Disney's Hollywood Studios in Florida. While the cast member lost some blood during the incident, a WDW spokesperson confirmed they are recovering.\n      \n    \n          If you or someone you know is struggling or in crisis, help is available. Call or text 988 or chat 988lifeline.org.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Disney World\n              \n                          \n                News\n              \n                          \n                Disney\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Possible Suicide Being Investigated at Disney World",
      "image": [
        "https://imagez.tmz.com/image/33/16by9/2026/01/03/331696cf8033449d923d91b6478f71fb_xl.jpg"
      ],
      "datePublished": "2026-01-03T15:18:59.000Z",
      "dateModified": "2026-01-03T15:18:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Stars and Scars -- You Be the Judge",
    "url": "https://www.tmz.com/2026/01/03/polls-you-be-the-judge/",
    "image": "https://imagez.tmz.com/image/1c/16by9/2026/01/01/1cbb561775424dd1b49a01742ce53e03_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-03T08:25:59.000Z",
    "description": "\n    \n                    \n                          Stars & Scars\n                          You Be the Judge\n                      \n                 ",
    "body": "\n    \n                    \n                          Stars & Scars\n                          You Be the Judge\n                      \n                  \n                                                                        Published \n                              January 3, 2026\n                            12:25 AM PST\n                                                                            \n      \n    \n          Cardi B's man's in hot water over his chef, J Lo insists her body's too hot for clothes ... while Zach Bryan ties the knot with a familiar face, and Beyonce enters Taylor's very expensive turf! So, we gotta ask ...\n      \n      \n      \n          \n            \n              \n                \n                Share on Facebook\n              \n            \n            \n              \n                \n                Share on X\n              \n            \n                          \n                \n                  \n                \n              \n                      \n        \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Celebrity News\n              \n                          \n                TV\n              \n                          \n                Movies\n              \n                          \n                Politix\n              \n                          \n                Music\n              \n                          \n                News\n              \n                      \n        \n          \n  ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Stars and Scars -- You Be the Judge",
      "image": [
        "https://imagez.tmz.com/image/1c/16by9/2026/01/01/1cbb561775424dd1b49a01742ce53e03_xl.jpg"
      ],
      "datePublished": "2026-01-03T08:25:59.000Z",
      "dateModified": "2026-01-03T08:25:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Barry Manilow Shares Update After Lung Cancer Diagnosis",
    "url": "https://www.tmz.com/2026/01/03/barry-manilow-update-lung-cancer/",
    "image": "https://imagez.tmz.com/image/3c/16by9/2026/01/03/3c4ae366248949998c25c63def54c658_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-03T15:36:40.000Z",
    "description": "\n    \n                    \n                          Barry Manilow\n                          Doing 'Better' After Lung Cancer Diagnosis ...\n          ",
    "body": "\n    \n                    \n                          Barry Manilow\n                          Doing 'Better' After Lung Cancer Diagnosis ...\n                          And Here's a Selfie to Prove it!\n                      \n                  \n                                                                        Published \n                              January 3, 2026\n                            7:36 AM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Barry Manilow is sharing a positive update about 2 weeks after he revealed his lung cancer diagnosis.\n      \n    \n          The \"Copacabana\" hitmaker took to Instagram Friday to share a selfie of what appears to be him lying in a hospital bed and wearing a provided gown. He looks happy in the photo ... flashing a positive grin at the camera. The snap appears to be texted from a phone, as there's a grey text bubble that reads \"Better Today!\" below it.\n      \n    \n          As we reported, Barry revealed in December \"a cancerous spot\" was found on his left lung during an MRI ordered by his doctor. At the time, he had been battling bronchitis for more than 2 months.\n      \n    \n          He then told fans he would need to go under the knife to have the cancer removed ... and would consequently be rescheduling his January shows.\n      \n    \n          He's still got some recovering to do ... but we're certainly glad to hear the good news!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Barry Manilow\n              \n                          \n                Music\n              \n                          \n                Health\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Barry Manilow Shares Update After Lung Cancer Diagnosis",
      "image": [
        "https://imagez.tmz.com/image/3c/16by9/2026/01/03/3c4ae366248949998c25c63def54c658_xl.jpg"
      ],
      "datePublished": "2026-01-03T15:36:40.000Z",
      "dateModified": "2026-01-03T15:36:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Lizzo Shows Off Weight Loss in White Bikini",
    "url": "https://www.tmz.com/2026/01/03/lizzo-bikini-weight-loss/",
    "image": "https://imagez.tmz.com/image/e1/16by9/2026/01/03/e1356c4797e2493b8b2a81a9005aaeb1_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-03T18:09:36.000Z",
    "description": "\n    \n                    \n                          Lizzo\n                          New Year, Same Thirst Traps ...\n                          Flaunts",
    "body": "\n    \n                    \n                          Lizzo\n                          New Year, Same Thirst Traps ...\n                          Flaunts Figure in Tiny Bikini\n                      \n                  \n                                                                        Published \n                              January 3, 2026\n                            10:09 AM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Lizzo's got summer on her mind in her first IG post of 2026 ... showing off her weight loss in a tiny bikini and form-fitting bodysuit!\n      \n    \n          Check out her latest thirst trap on Instagram -- the \"Truth Hurts\" hitmaker is flaunting her curves in a teeny white 'kini seemingly from her YITTY line while posing for the camera. In a second pic, she covers up in a curve-hugging, colorful one-piece that fits her body like a glove.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          She references Alabama Barker's viral \"nasty\" TikTok sound in her caption, penning ... \"YITTY & a Pucci fit… nastyyyyy 😜.\" It may be a new year, but it's the same Lizzo feelin' \"Good as Hell!\"\n      \n\n          As you know, the singer was all about flaunting her bod in 2025 ... revealing in January that she had reached her weight loss goals and had even shedded 16% of her bodyfat. She spent the rest of the year opening up about her health and fitness journey - even revealing she had been suicidal when she began taking her weight loss seriously.\n      \n    \n          Remember ... around the time she started transforming her body, she was hit with a sexual and racial harassment lawsuit by former backup dancers.\n      \n    \n          She had a major victory in December 2025 when her accusers dropped their claims that Lizzo fat-shamed them, though the rest of the case is moving forward. She spoke out days after the news ... saying while she's thankful the truth is out, she's still very much involved in the lawsuit -- and will continue her fight against what she says are false allegations.\n      \n    \n          If you or someone you know is struggling or in crisis, help is available. Call or text 988 or chat 988lifeline.org.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Lizzo\n              \n                          \n                Social Media\n              \n                          \n                Hot Bodies\n              \n                          \n                Hip Hop\n              \n                          \n                Music\n              \n                          \n                Weight Loss & Weight Gain\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lizzo Shows Off Weight Loss in White Bikini",
      "image": [
        "https://imagez.tmz.com/image/e1/16by9/2026/01/03/e1356c4797e2493b8b2a81a9005aaeb1_xl.jpg"
      ],
      "datePublished": "2026-01-03T18:09:36.000Z",
      "dateModified": "2026-01-03T18:09:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Florence Pugh's Hottest Shots To Slay Her Dirty 30!",
    "url": "https://www.tmz.com/2026/01/03/florence-pugh-hot-shots-birthday/",
    "image": "https://imagez.tmz.com/image/a3/16by9/2025/11/11/a3ec8ff7656b42ffbe66e041625b6af1_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-03T09:00:41.000Z",
    "description": "\n    \n                    \n                          Florence Pugh's\n                          Hottest Shots\n                          To Slay Her Dir",
    "body": "\n    \n                    \n                          Florence Pugh's\n                          Hottest Shots\n                          To Slay Her Dirty 30!\n                      \n                  \n                                                                        Published \n                              January 3, 2026\n                            1:00 AM PST\n                                                                      |\n                                                                Updated \n                                  January 3, 2026\n                                6:00 AM PST\n                                    \n      \n    \n      \n        \n              \n    \n    \n          Florence Pugh's hit plenty of milestones throughout her career, but this Saturday's gonna mark a big one for her ... because she's hitting her dirty 30!\n      \n    \n          And any big day for Florence is a big day for us ... so we're sharing some of the actress' hottest shots to look back at some of her sexiest snaps from her 20s!\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          And hey, even though the sun's setting on one part of her life, we're sure she's gonna be showing off even more sultry shots throughout her 30s -- and we'll be here for all of them!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Florence Pugh\n              \n                          \n                Hotties & Bodies\n              \n                          \n                Hot Bodies\n              \n                          \n                Birthdays\n              \n                          \n                Photo Galleries\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Florence Pugh's Hottest Shots To Slay Her Dirty 30!",
      "image": [
        "https://imagez.tmz.com/image/a3/16by9/2025/11/11/a3ec8ff7656b42ffbe66e041625b6af1_xl.jpg"
      ],
      "datePublished": "2026-01-03T09:00:41.000Z",
      "dateModified": "2026-01-03T09:00:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]