[
  {
    "title": "‘Send Help’ Launches Atop U.K. and Ireland Box Office",
    "url": "https://variety.com/2026/film/news/send-help-uk-ireland-box-office-1236657797/",
    "image": "https://variety.com/wp-content/uploads/2026/01/MCDSEHE_H3009-e1769610275829.jpg?crop=0px%2C19px%2C1000px%2C562px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-02-10T12:29:40.000Z",
    "description": "\n\tDisney’s “Send Help” launched atop the U.K. and Ireland box office with £1.5 million ($2.2 million), according to Comscore, delivering the strongest",
    "body": "\n\tDisney’s “Send Help” launched atop the U.K. and Ireland box office with £1.5 million ($2.2 million), according to Comscore, delivering the strongest opening of the weekend.\n\n\tUniversal’s concert feature “Stray Kids: The Dominate Experience” bowed in second place, grossing $1.5 million from its debut frame.\n\n\tLionsgate U.K.’s “The Housemaid” moved to third in its seventh weekend, adding $1.3 million and pushing its cumulative total to $40.9 million. Universal’s “Hamnet” followed in fourth, earning $1.1 million in its fifth outing for a running total of $22.6 million.\n\t\n\n\tDisney’s “Zootopia 2” rounded out the top five with $821,000 in its 11th weekend, lifting its cumulative gross to $45.3 million.\n\n\n\tFurther down the chart, Black Bear’s “Shelter” placed sixth with $653,000, bringing its total to $2.6 million. Entertainment Film Distributors’ “Marty Supreme” took $587,000 in seventh place, reaching £$21.2 million after seven weeks on release.\n\n\tDisney’s “Avatar: Fire and Ash” continued its long run in eighth, adding $514,000 for a robust $57 million cumulative total. “Iron Lung,” from Iron Lung Inc., followed closely behind with $492,000, taking its total to $2.3 million.\n\n\tRounding out the top 10, Sony’s “28 Years Later: The Bone Temple” collected $346,000 in its fourth weekend, pushing its total to $10.1 million.\n\n\tThe Valentine’s corridor brings a crowded, eclectic slate led by Warner Bros.’ wide launch of “Wuthering Heights,” which rolls out across 300-plus locations. The latest screen take on Emily Brontë’s novel, starring Jacob Elordi and Margot Robbie, arrives as the clear commercial anchor of the week, joined in the wide-release bracket by Sony’s “Crime 101,” Bart Layton’s crime thriller starring Chris Hemsworth, Mark Ruffalo and Barry Keoghan.\n\t\n\n\tFamily audiences are well served, with Kazoo Films opening the animated “Stitch Head” nationwide, while Vertigo Releasing counters with another major animation play in “Looney Tunes: The Day the Earth Blew Up,” directed by Peter Browngardt and voiced by Eric Bauza and Candi Milo. Sony Pictures also adds the family-friendly “Goat,” while Vue Lumière releases “Little Amélie” across 100-plus sites.\n\n\tGenre fans get a strong showing too. Black Bear releases the horror title “Whistle,” directed by Corin Hardy and starring Dafne Keen and Sophie Nélisse, while Netflix platforms “The Swedish Connection” in a limited theatrical run ahead of streaming. Curzon opens the Iraqi-set drama “The President’s Cake,” and Bakrania Media adds Bollywood film “O’ Romeo.”\n\n\tEvent cinema also plays a role this week. Trafalgar Releasing brings ballet audiences back to cinemas with “Woolf Works – ROH, London 2026,” while music fans are targeted with “It’s Never Over, Jeff Buckley” from Piece of Magic Entertainment. The week rounds out with Telugu-language releases from Dreamz Entertainment, including “Funky” and “Seetha Payanam.” \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Send Help’ Launches Atop U.K. and Ireland Box Office",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/MCDSEHE_H3009-e1769610275829.jpg?crop=0px%2C19px%2C1000px%2C562px&resize=1000%2C563"
      ],
      "datePublished": "2026-02-10T12:29:40.000Z",
      "dateModified": "2026-02-10T12:29:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Rosebush Pruning’ Director Karim Aïnouz on His Twisted, Star-Studded Family Satire: ‘The Way That Patriarchy Has Been Naturalized’ Is ‘Something We Need to Deal With’ (EXCLUSIVE)",
    "url": "https://variety.com/2026/film/festivals/rosebush-pruning-director-family-satire-callum-turner-elle-fanning-1236656725/",
    "image": "https://variety.com/wp-content/uploads/2026/02/MD_Maria-Lobo.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-10T12:00:00.000Z",
    "description": "\n\tFor Karim Aïnouz, making “Rosebush Pruning” was uncharted territory.\n\n\tThe film marks the first foray of the Brazilian auteur — known for his contri",
    "body": "\n\tFor Karim Aïnouz, making “Rosebush Pruning” was uncharted territory.\n\n\tThe film marks the first foray of the Brazilian auteur — known for his contributions to queer cinema (“Futuro Beach,” “Motel Destino”) and uniquely moving dramas (“The Invisible Life of Eurídice Gusmão,” “Firebrand”) — into the genre of satire. But as the world locked down during the COVID-19 pandemic in 2020, Aïnouz found himself itching to try something new for his 14th film. Especially if there was a chance it could be his last.\n\t\n\n\t“It’s funny, everybody was thinking they were going to die and I was like, ‘I need to make this movie before I go,'” Aïnouz tells Variety over Zoom from his Berlin home in between drags of a cigarette.\n\n\n\tPremiering in competition at Berlin Film Festival this weekend, “Rosebush Pruning” follows an American family that has relocated to Spain, where they wallow in isolation, boredom and stupendous wealth. Following the mysterious death of their mother, adult siblings Jack, Ed, Anna and Robert look after their blind father until Jack announces his intention to move in with his girlfriend, Martha. “Blood ties are severed and Ed is forced to uncover the truth surrounding their mother’s death,” the film’s synopsis reads. “Generational lies begin to unravel, and the fabric of this family slowly begins to disintegrate.”\n\n\tThe cast is Aïnouz’s starriest to date: the siblings are played by Jamie Bell (Jack), Callum Turner (Ed), Riley Keough (Anna) and Lukas Gage (Robert). Tracy Letts is phenomenal as the family’s ridiculous patriarch, Pamela Anderson appears as his late wife and the recently Oscar-nominated Elle Fanning is the perfect foil as Martha.\n\t\n\n\tWith a script from frequent Yorgos Lanthimos collaborator Efthimis Filippou (“Dogtooth,” “The Lobster,” “The Killing of a Sacred Deer,” “Kinds of Kindness”), “Rosebush Pruning” doesn’t shy away from the absurd and taboo, tackling topics including incest, sexual abuse and murder with a tongue-in-cheek style.\n\n\t“When we started casting, I have to tell you that I did talk to other actors, and everybody was really excited. And then when they read the script, they were like, ‘Oh, I’m not sure,'” Aïnouz says of the film’s dark themes. “Ultimately, I was really interested in actors who were not judging these characters.”\n\n\t“Rosebush Pruning” is loosely based on Marco Bellocchio’s 1965 film “Fists in the Pocket,” which follows a young man suffering from epilepsy as he plots the murders of his family members. Watching the film during the lockdown, Aïnouz saw it as “a great blueprint” to discuss the topics of isolation and privilege in the present day.\n\n\t“I thought it would be really interesting to do something which was quite electric and exciting and fun — and yet critical of the times we’re living in — with a very classic, clear storyline,” he says. “The more time passed, the more the film and the story seemed to relate to the world today … There is this sense of absurdity when one wakes up in the morning, particularly the last couple of years.”\n\n\tHe and Filippou connected over Zoom and it was “love at first sight,” Aïnouz says. “It was such a beautiful encounter. There was a sense of humor and, at the same time, a sense of love in our exchanges — love for the world, but also love for characters … For me, it was really important that these are not caricatures, they’re people.”\n\n\tFilippou’s finished script was the first Aïnouz had read where he didn’t change a single line and had “so few notes,” the director says. “But it’s tricky, because then how do you inject life?”\n\n\n\n\t\n\n\t\t\t\t\tElle Fanning, Jamie Bell, Callum Turner, Lukas Gage, Riley Keough and Tracy Letts in “Rosebush Pruning.”\n\t\t\t\t\t\t\t\t\tFelix Dickinson\n\t\n\n\n\n\tEnter the ensemble. The first puzzle piece that fell into place was Tony and Pulitzer winner Letts, who was on Aïnouz’s mind during pre-production as he revisited his 2011 film “Killer Joe,” which Letts adapted from his play of the same name. Aïnouz says Letts was not at all put off by the father’s less-than-favorable personality and decreased moral compass — often a source of the film’s dark humor — which may have been inspired by a certain American politician.\n\t\n\n\t“What he actually told me the first time we met was, ‘Do you mind if I don’t know how to ride a horse?’ That was his first question,” Aïnouz recalls, laughing. “And then I immediately understood that he actually got the character, he got the script and also that he could bring something to that character. It’s so strange because he is hateable, yet there’s something there that is totally palpable.”\n\n\tTurner’s Ed serves as the film’s narrator, a Holden Caulfield-esque vagabond who refuses to engage with the written word and instead records his thoughts each day. Aïnouz was “really excited” when they first met, but could tell that Turner “wasn’t really sure.”\n\n\t“Then we had a second meeting and he really brought something to this character which is extraordinary: a sense of danger,” he says. “He’s unpredictable, and I think you cannot have Ed in a different way. And physically, there was something there that was very imposing yet quite awkward.”\n\n\tGetting Anderson, who is experiencing something of a career renaissance after “The Last Showgirl” and “The Naked Gun,” as the family’s late matriarch was also a coup. “I really wanted to have a woman of that age who is adventurous as an actor, who has nothing to lose,” he says. “Pamela, I think she is a young actor. There’s something really beautiful about that and there’s this freedom. You know, I get the goosebumps.”\n\n\tBut Fanning as Martha, a quiet-natured and sweet music student who takes Jack away from the family, is what made it all come together. “This is a very spoken film, and I think Elle has something which is a masterful way of acting through very specific but very subtle gestures,” Aïnouz says. “There’s a scene where she doesn’t say anything, but what she does is incredible. It’s this sense of eloquence through silence.”\n\n\tAïnouz isn’t a stranger to working with Hollywood stars, but he is finding that more and more American and English actors are yearning to work with international directors. “There is a freedom that we can bring to English-spoken cinema that I think is attractive to actors that are working within a format which sometimes is a bit too industrial,” he says. “I think risk-taking is something every actor wants to do. Every actor wants to be challenged, every actor wants to be not in their comfort zone.”\n\t\n\n\tBut perhaps the most difficult part of all these bold-faced names was aligning their schedules for a two-week rehearsal period as well as seven-and-a-half weeks of shooting on location in Catalonia. That came with some changes — Kristen Stewart and Josh O’Connor were originally attached to the project, but had to drop out due to conflicts — but for Aïnouz time spent together was key to establishing the family’s dynamic.\n\n\t“It was a mixture between finding actors that could bring this diversity and these different energies, but yet that were curious,” he says. “There was a huge trust from the cast to understand that yes, they’re great, but they need to be great together.”\n\n\tWhen “Rosebush Pruning” premieres at Berlin, it’s almost certain to be divisive — but equally as thought-provoking. Aïnouz is prepared for potential backlash, but thinks it could start conversations that need to be had in the current times.\n\n\t“Only through absurdity can you perhaps touch certain issues,” he says. “I think it’s important to know and to discuss and to understand that sometimes the biggest amount of violence comes from within the family. The way that patriarchy has been naturalized, it’s really something that we need to deal with. There’s a cycle of violence, and perhaps violence is the only way to break that cycle.”\n\n\tHe adds, “I think laughing is a really interesting way of dealing with this. It’s about being uncomfortable. You can’t just be comfortable about the things we’re reading on the news these days, you know? We need to create a lack of comfort.”\n\n\tThe director, who has often competed at Cannes Film Festival, was also intentional about bringing “Rosebush Pruning” to his home of Berlin. “One of the reasons I live here is that there’s a sense of irreverence and freedom and wildness and humor that I think is so much in tune with the DNA of the film,” he says.\n\n\t“Let’s see what happens, but I do think it’s a place that has a lot to do with the movie. It’s very free, it’s very open — it’s also looking for an identity that’s not there yet. I do think it speaks to the soul of the city.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Rosebush Pruning’ Director Karim Aïnouz on His Twisted, Star-Studded Family Satire: ‘The Way That Patriarchy Has Been Naturalized’ Is ‘Something We Need to Deal With’ (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/MD_Maria-Lobo.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-10T12:00:00.000Z",
      "dateModified": "2026-02-10T12:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Harry Potter’ Series Will Take Viewers Inside Malfoy Manor, Says New Draco Actor: ‘You Get an Insight Into How He Is’",
    "url": "https://variety.com/2026/tv/global/harry-potter-series-draco-home-malfoy-manor-1236657920/",
    "image": "https://variety.com/wp-content/uploads/2025/06/draco-3.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-10T10:57:52.000Z",
    "description": "\n\tProducers of the upcoming “Harry Potter” series on HBO Max have long promised the show, which is set to span seven series, will give fans a more tho",
    "body": "\n\tProducers of the upcoming “Harry Potter” series on HBO Max have long promised the show, which is set to span seven series, will give fans a more thorough look at the wizarding world than the movies.\n\n\tAccording to Lox Pratt, who has been cast as Potter’s nemesis Draco Malfoy, one way in which the series will do that is by following some of the more peripheral characters into their individual spaces. “You get to see all the teachers in their little rooms. You get to see Draco at home. I won’t spoil too much about that, but there are some brilliant scenes at home where you start to get an insight into how he is,” said Pratt, who is currently starring in the BBC’s adaptation of “Lord of the Flies.”\n\t\n\n\tThe HBO series, which will launch in 2027, is directed by “Succession” director Mark Mylod and written by “His Dark Materials” scribe Francesca Gardiner.\n\n\n\t“I think with this adaptation, you get to see so much more than the books,” Pratt told magazine 1883. “[The books] are very much over Harry’s shoulder, which is great, and that’s how they played the film as well. And I think Francesca and Mark have been audible about this in their interviews, there’s just so much more that you get to see.”\n\n\tPratt also implied that as well as a closer look inside the walls of Malfoy Manor, viewers would get to see a more rounded version of Draco. “Similar to ‘Flies,’ I was grateful that we had the same freedom to explore these characters,” said Pratt. “Because in the films, Draco is sort of 2D; he is the sneery villain. I feel like there’s so much more – you need to understand why. And you see little glints of it in the film with Lucius and stuff. I think [the series] is really brilliant. I can’t wait to bring it to the screen.”\n\t\n\n\tHBO Max execs are also eager to bring the series to screens, with Warner Bros. Discovery’s streaming boss JB Perrette already calling it the “streaming event of the decade.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Harry Potter’ Series Will Take Viewers Inside Malfoy Manor, Says New Draco Actor: ‘You Get an Insight Into How He Is’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/06/draco-3.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-10T10:57:52.000Z",
      "dateModified": "2026-02-10T10:57:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Joko Anwar on Using Horror-Comedy to Expose Systemic Rot in Berlin-Bound ‘Ghost in the Cell’: ‘Laughter Should Come With Discomfort’",
    "url": "https://variety.com/2026/film/news/joko-anwar-horror-comedy-expose-corruption-ghost-in-the-cell-1236657011/",
    "image": "https://variety.com/wp-content/uploads/2025/08/Ghost-in-the-Cell.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-10T08:00:00.000Z",
    "description": "\n\tThe ghost in Joko Anwar‘s “Ghost in the Cell” doesn’t haunt – it holds accountable.\n\n\tIndonesian filmmaker Anwar used his Berlinale Forum entry “Gho",
    "body": "\n\tThe ghost in Joko Anwar‘s “Ghost in the Cell” doesn’t haunt – it holds accountable.\n\n\tIndonesian filmmaker Anwar used his Berlinale Forum entry “Ghost in the Cell” to channel societal anxieties about systemic corruption and environmental destruction through supernatural horror, creating a prison-set thriller that treats its genre elements as political instruments rather than escapist entertainment.\n\n\n\tThe film centers on inmates at an Indonesian correctional facility whose fragile power structures fracture when a new prisoner arrives with a vengeful supernatural entity that hunts those with the darkest aura. As the body count rises, survival depends on collective action among the incarcerated population.\n\t\n\n\tFor Anwar, the prison setting provided a concentrated laboratory for exploring societal hierarchies. “A prison is like a miniature of the society and it mirrors hierarchy, power dynamics in it, also fear, violence, morality all compressed in one confined space with politeness stripped out,” the director explains. “Inside a prison, the consequences are immediate. However, while everyone is trapped in the same system, not everyone faces equal consequences including punishment.”\n\n\tThe filmmaker deliberately wove environmental destruction and judicial inequality into the narrative fabric rather than treating them as background decoration. “The environmental and political realities have always been the origin of horror, not only as a sideshow,” Anwar says. “I let the ghost carry the truth that the system made by humans refuses to articulate.”\n\t\n\n\tCentral to the film’s approach is treating the supernatural presence as an active agent rather than pure metaphor. “The ghost was never meant to represent an idea. It has intent, intelligence, and limits. It chooses its victims,” Anwar notes. “So the ghost isn’t a metaphor and becomes an actual character, shaped by trauma and injustice. It doesn’t deliver moral comfort. It delivers consequences.”\n\n\tManaging the large ensemble within the volatile prison environment required extensive preparation. Anwar developed detailed backstories for every character, including day players, and conducted group rehearsals that mirrored the film’s factional dynamics. “I let every actor have other character’s sheet in their group and left other characters from different groups as a mystery so they can feel the danger, suspicion, coming from other groups of inmates,” he explains.\n\n\tThe tonal balancing act proved crucial, mixing violence, satire and uncomfortable humor. “Humor in the film doesn’t release tension, it sharpens it,” Anwar says. “Laughter should come with discomfort. If the audience laughs and then immediately questions why they did, the tone is working.”\n\n\tLanding in Forum, known for championing formally ambitious and politically challenging cinema, aligned with Anwar’s intentions. “Forum is a section where films are allowed to be uncomfortable and unresolved,” he observes, hoping international audiences recognize the systems portrayed as uncomfortably familiar rather than exotic.\n\n\tThe director wants viewers to leave questioning institutional complicity. “I hope they ask themselves who the system is actually designed to protect,” he says. “The film isn’t asking whether corruption or destruction exists, we all know it does. It’s asking why we’re so comfortable letting them become normal.“​​​​​​​​​​​​​​​​\n\n\tThe production represents another collaboration between Anwar and producer Tia Hasibuan through their Jakarta-based Come and See Pictures, alongside Rapi Films, South Korea’s Barunson E&A – the studio behind Bong Joon Ho’s Oscar-winning “Parasite” – and Legacy Pictures. The ensemble cast features Abimana Aryasatya, Lukman Sardi, Bront Palarae, Aming, Rio Dewanto, Morgan Oey and Tora Sudiro.\n\t\n\n\tBarunson E&A is handling worldwide sales on the project as part of a two-year agreement with Come and See Pictures.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Joko Anwar on Using Horror-Comedy to Expose Systemic Rot in Berlin-Bound ‘Ghost in the Cell’: ‘Laughter Should Come With Discomfort’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/08/Ghost-in-the-Cell.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-10T08:00:00.000Z",
      "dateModified": "2026-02-10T08:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Formula 1 Podcast ‘Up to Speed’ Gets in Gear With Hosts Will Buxton, Naomi Schiff, David Coulthard and Jolie Sharpe",
    "url": "https://variety.com/2026/digital/news/formula-1-podcast-up-to-speed-will-buxton-naomi-schiff-david-coulthard-jolie-sharpe-1236657270/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Up-To-Speed-Jolie-Sharpe-Will-Buxton-Naomi-Schiff-David-Coulthard.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-10T09:31:00.000Z",
    "description": "\n\tU.K. media and entertainment company Global has lined up an all-star quartet of hosts for “Up to Speed,” its new Formula 1 racing podcast: Will Buxt",
    "body": "\n\tU.K. media and entertainment company Global has lined up an all-star quartet of hosts for “Up to Speed,” its new Formula 1 racing podcast: Will Buxton, “Drive to Survive” star and F1 journalist; driver-turned-broadcaster Naomi Schiff; 13-time Grand Prix winner David Coulthard; and F1 presenter and content creator Jolie Sharpe.\n\n\t“Up to Speed” will launch on Monday, Feb. 16. The podcast, which Global promises will give F1 fans “VIP access to the fastest sport in the world,” will be available on the company’s Global Player, as well as YouTube, Spotify, Apple Podcasts and other audio platforms.\n\t\n\n\tThe show’s hosts will deliver “razor-sharp race reactions, behind-the-scenes insight, and the stories everyone’s talking about,” both on and off the track, according to Global. “From the sport’s biggest moments and fiercest rivalries to the iconic scenes that define Formula 1, ‘Up to Speed’ puts fans at the heart of the action.” (Listen to the trailer below.)\n\n\n\tNew episodes of the podcast will be released twice weekly. Monday episodes will offer reactive analysis following the past weekend’s race drama, while Thursday episodes will dive deep into the biggest story of the week alongside interviews with big names on the F1 circuit. The company says fans will be invited to send in their burning questions for the presenters to tackle each week.\n\n\tWill Buxton said in a statement, “Formula 1 isn’t just about what happens on the track, it’s about the drama, the personalities, the moments you don’t see, and the questions fans are desperate to ask. Launching this podcast show with Naomi, David and Jolie felt like the perfect way to open the doors a little wider. Between us we’ve lived and breathed this sport for years, and ‘Up to Speed’ gives us the chance to react fast, go behind the scenes and have the kind of honest, opinionated conversations that we hope the fans will love!”\n\t\n\n\tNaomi Schiff commented, “Being at races week in, week out gives us a real sense of what’s happening beyond the headlines. This podcast is about sharing those conversations, moments, and perspectives with fans, and exploring what matters on and off the track. It’s honest, engaging and focused on the stories, questions and topics fans care about.”\n\n\tDavid Coulthard said that as Formula 1’s audience continues to grow every year, “this feels like the perfect time to launch a podcast show like this. It’s a huge season for Formula 1, and we want to bring fans right into the heart of it. Expect big interviews, sharp analysis and above all a genuine passion and love for racing. We can’t wait to get started and for you to join us!”\n\n\tJolie Sharpe added: “Formula 1 has been part of my life for as long as I can remember, and this podcast is a chance to turn that into something fans can really be part of. I want people to come away with a deeper connection to the sport, from the conversations you don’t hear elsewhere to the atmosphere and moments that make race weekends so special. Sharing that experience with fans each week is what I’m most excited about.”\n\n\t“Up to Speed” is produced by Global Studios, described by the company as a one-stop-shop for podcast creators.\n\n\tListen to the trailer:\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Formula 1 Podcast ‘Up to Speed’ Gets in Gear With Hosts Will Buxton, Naomi Schiff, David Coulthard and Jolie Sharpe",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Up-To-Speed-Jolie-Sharpe-Will-Buxton-Naomi-Schiff-David-Coulthard.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-10T09:31:00.000Z",
      "dateModified": "2026-02-10T09:31:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Weydemann Bros. Ramps Up International Operations With Addition of Thorsten Ritter to Producing Team",
    "url": "https://variety.com/2026/film/global/thorsten-ritter-weydemann-bros-1236657927/",
    "image": "https://variety.com/wp-content/uploads/2025/10/Thorsten-Ritter.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-10T10:49:24.000Z",
    "description": "\n\tWeydemann Bros. is expanding their international footprint and have appointed Thorsten Ritter, formerly at Beta Cinema, to establish and lead the co",
    "body": "\n\tWeydemann Bros. is expanding their international footprint and have appointed Thorsten Ritter, formerly at Beta Cinema, to establish and lead the company’s new Munich office.\n\n\tAs a producer, Ritter will focus on strengthening and growing Weydemann Bros.’ international production and co-production activities. The company has a 10-year history of delivering acclaimed films, with recent international titles including Chile’s Academy Awards entry “The Mysterious Gaze of the Flamingo” (2025), Nora Fingscheidt’s “The Outrun” (2024), and Cannes’ Critics’ Week winner “Tiger Stripes” (2023) by Amanda Nell Eu.\n\t\n\n\tRitter previously served as executive vice president at Beta Cinema (2012–2025), overseeing a slate of celebrated films such as “System Crasher,” “Amrum,” “From Hilde, With Love,” “The Happy Prince,” “Nowhere Special,” “Calibre” and “Woman at War.” He is co-founder of the Oldenburg International Film Festival and former head of Bavaria Film International, where he helped bring landmark titles including “Good Bye, Lenin!,” “Sophie Scholl,” “The Man Without a Past,” “Head-On” and “Let the Right One In” to global attention.\n\n\n\tJonas Weydemann said: “Thorsten Ritter and we have a long history together, not just since his successful international marketing of ‘System Crasher.’ His vast experience, creativity and commitment to film convinced us to bring him on board as a producer, especially to further develop our international production and co-production activities, with a focus on the U.K. and English-language films in general. At Weydemann Bros, it’s all about the team, and we are delighted to welcome Thorsten to join us.”\n\t\n\n\tRitter said: “Working with Jonas, Jakob, and the team at Weydemann Bros. is a dream come true. They are as passionate as they are sharp, always finding opportunity in every challenge. I’m excited to contribute my U.K. contacts and sales perspective, enabling us to discover inspired talents together and collaborate with established filmmakers across a wide range of projects – from films that dare to challenge us, move us, and shift the way we see the world to films that simply put a smile on our face. As long as they’re never trivial and paint-by-numbers – always made with conviction and a soul. Ideally, nothing less than the kind of films we never want to end.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Weydemann Bros. Ramps Up International Operations With Addition of Thorsten Ritter to Producing Team",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/Thorsten-Ritter.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-10T10:49:24.000Z",
      "dateModified": "2026-02-10T10:49:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Flix Brewhouse Buys Four Alamo Drafthouse Franchisee Locations in Texas (EXCLUSIVE)",
    "url": "https://variety.com/2026/film/news/flix-brewhouse-buys-four-alamo-drafthouse-theaters-texas-1236657040/",
    "image": "https://variety.com/wp-content/uploads/2023/03/flix-brewhouse.png?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-10T12:00:00.000Z",
    "description": "\n\tFlix Brewhouse, a Texas-based movie theater circuit that’s billed as the “only first-run cinema brewery,” has acquired four Alamo Drafthouse franchi",
    "body": "\n\tFlix Brewhouse, a Texas-based movie theater circuit that’s billed as the “only first-run cinema brewery,” has acquired four Alamo Drafthouse franchisee locations in the Lone Star State.\n\n\tThose venues, stretching from El Paso to Katy, were operated by Triple Tap Ventures, a Houston-headquartered developer, licensee and franchisee of brands including Alamo Drafthouse. Flix Brewhouse will assume ownership and operations of the following venues: Montecillo in West El Paso, East El Paso, LaCenterra in Katy (Cinco Ranch), and Lubbock. This transaction increases Flix Brewhouse’s national footprint from 11 to 15 locations, with 129 screens across six states.\n\t\n\n\t“This acquisition is a natural extension of who we are and what we believe in,” said Flix Brewhouse’s chief executive officer, Chance Robertson. “Cinema success today means creating better experiences. We’re grateful to the Triple Tap team for their work in cultivating these moviegoing communities, and we’re honored to carry that legacy forward.”\n\n\n\tTriple Tap Ventures is offloading the venues as the company transitions out of the dine-in cinema space. Flix Brewhouse, founded in Round Rock in 2011, boasts a thorough craft beer menu and full-service kitchen to accompany the moviegoing experience. That makes the chain a natural fit to take over the space that was occupied by Alamo Drafthouse, a beloved circuit that popularized in-theater dining.\n\n\t“When our company decided to focus on other hospitality concepts, it was mandatory to ensure our audiences had a seamless transition to a dine-in concept that shared our core values of compelling programming, continuous innovation, genuine hospitality, and operational excellence,” Billingsley-Michaelsen said. “After evaluating numerous alternatives, it was clear that the guests’ first culture of Flix Brewhouse truly stood out. We’re profoundly grateful for the loyalty of all our Alamo guests and confident they are in good hands with Flix.”\n\t\n\n\tFlix Brewhouse will briefly close the newly acquired cinemas to rebrand before reopening them on Feb. 23 in time for “Scream 7” and early March offerings such as Pixar’s “Hoppers” and director Maggie Gyllenhaal’s “Frankenstein” adaptation “The Bride!”\n\n\t“As the industry continues to evolve, Flix Brewhouse remains focused on thoughtful, strategic growth and delivering a distinctly different experience for moviegoers,” Robertson said. “The path forward in exhibition isn’t one size fits all. Innovation at Flix means staying true to what sets us apart: our craft and constant drive to raise the bar on quality, service, and community.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Flix Brewhouse Buys Four Alamo Drafthouse Franchisee Locations in Texas (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2023/03/flix-brewhouse.png?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-10T12:00:00.000Z",
      "dateModified": "2026-02-10T12:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Spotify Adds Record Monthly Users and Hits 290 Million Paid Subscribers in Q4, New Co-CEO Says 2026 Will Be ‘Year of Raising Ambition’",
    "url": "https://variety.com/2026/digital/news/spotify-q4-2025-earnings-record-monthly-users-year-of-raising-ambition-1236657863/",
    "image": "https://variety.com/wp-content/uploads/2022/07/Spotify-Earnings.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-10T11:01:00.000Z",
    "description": "\n\tSpotify racked up its highest quarterly net adds of monthly users to date in Q4 2025 — reaching a total of 751 million monthly active users, a gain ",
    "body": "\n\tSpotify racked up its highest quarterly net adds of monthly users to date in Q4 2025 — reaching a total of 751 million monthly active users, a gain of 38 million in the period. Its paid-subscriber count grew 10% year over year to 290 million, a pickup of 9 million sequentially.\n\n\tRevenue of €4.53 billion in the year-end quarter was up 7% (or 13% on a constant-currency basis), in line with forecasts. Gross margin improved to 33.1% (vs. 32.2% in the year-earlier period) and operating income rose 47% to €701 million, beating expectations.\n\t\n\n\tFor Q1, Spotify is expecting more moderate users gains. It forecast total MAUs hitting 759 million, which would be a net gain of 8 million. Premium subs are expected to reach 293 million (a net add of 3 million), coming as it has raised subscription prices in the U.S., marking its third price hike in four years. The company projected total Q1 2026 revenue of €4.5 billion (implying growth of 7%), gross margin of 32.8% and operating income of €660 million.\n\n\n\tSpotify started 2026 with a change in the C-suite: Founder Daniel Ek stepped aside as CEO to become executive chairman and as of Jan. 1, the company is led by two co-CEOs: Gustav Söderström, former co-president and chief product and technology officer, and Alex Norström, previously co-president and chief business officer.\n\n\tNorström, in prepared remarks, said Spotify is “framing 2026 as the Year of Raising Ambition,” after closing out what it had dubbed the “Year of Accelerated Execution.” \n\n\t“It’s incredible to think that we now serve over three quarters of a billion people around the world,” Norström said. Commenting on the year ahead, he said, “We were founded to solve what felt like the impossible, and ambition has been the driving force behind our success from our earliest days. And ambition will be a guiding principle of our next chapter.”\n\t\n\n\tEk, in prepared remarks with the Q4 earnings announcement, said Spotify has effectively built “a technology platform for audio — and increasingly, for all the ways creators connect with audiences.” He said the company will “keep building the technology” for “the hard problems ahead,” citing major tech shifts like AI and wearables.\n\n\tSöderström added in a statement: “We consider ourselves the R&D department for the music industry. Our job is to understand new technologies quickly and capture their potential, which we’ve done time and again. The entire industry stands to benefit from this [AI] paradigm shift but we believe those who embrace this change and move fast, will benefit the most.”\n\n\tSpotify’s R&D spending for full-year 2025 was down 6%, to €1.39 billion.\n\n\tIn an interview Tuesday, the co-CEOs wouldn’t specify exactly what the “Year of Raising Ambition” means in terms of product road map or partnerships. Söderström said that “what is happening with AI” represents “an enormous opportunity” for Spotify “to become something more for our consumers.”\n\n\tIn Q4 2025, subscription revenue increased 8% to €4.01 billion, offsetting a 4% decline in advertising revenue. On a constant-currency basis, ad sales increased 4% the company as music advertising was driven by growth in impressions sold partially offset by “softness in pricing.” Growth in podcasting ad revenue was led by sponsorship gains, partially offset by “optimization of our podcasting inventory” in Spotify’s owned and licensed portfolio.\n\n\tIn Q4, Spotify began rolling out music videos in beta in the U.S. and Canada; the company says music videos are now available to Premium customers in 111 markets. In October, Spotify announced the extension of its sponsorship pact with La Liga pro soccer club FC Barcelona through 2030.\n\n\tIn announcing earnings, Spotify boasted that its 2025 Wrapped year-end marketing campaign was its biggest ever, with more than 300 million users making more than 630 million shares on social media worldwide in 56 languages.\n\n\tAs previously announced, Spotify in 2025 paid out more than $11 billion to the music industry, which the company said is the largest annual payment to music creators “from any retailer in history,” with independent artists and labels accounting for half of all royalties. Spotify also claimed it has helped artists generate more than $1 billion in ticket sales to date.\n\t\n\n\tMeanwhile, last week Spotify launched Page Match, a new feature that lets users can scan a page of a printed book or ebook and continue the story in the audiobook on Spotify at the moment they left off. Later this spring, users in the U.S. and U.K. will be able to buy physical books through the Spotify app via a new partnership with Bookshop.org, which supports independent local bookstores.\n\n\tAt the end of Q4, Spotify had 7,323 full-time employees globally. That was up just a hair from 7,261 a year earlier.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Spotify Adds Record Monthly Users and Hits 290 Million Paid Subscribers in Q4, New Co-CEO Says 2026 Will Be ‘Year of Raising Ambition’",
      "image": [
        "https://variety.com/wp-content/uploads/2022/07/Spotify-Earnings.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-10T11:01:00.000Z",
      "dateModified": "2026-02-10T11:01:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Brunello Cucinelli Docufilm ‘The Gracious Visionary’ Set for North American Release via Blue Fox Entertainment (EXCLUSIVE)",
    "url": "https://variety.com/2026/film/global/brunello-cucinelli-doc-gracious-visionary-us-release-1236657922/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Brunello-Cucinelli-Poster.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-10T12:00:00.000Z",
    "description": "\n\tOscar-winning director Giuseppe Tornatore‘s docufilm “Brunello: The Gracious Visionary” — about Brunello Cucinelli, the fashion designer known as It",
    "body": "\n\tOscar-winning director Giuseppe Tornatore‘s docufilm “Brunello: The Gracious Visionary” — about Brunello Cucinelli, the fashion designer known as Italy’s “King of Cashmere” — has been acquired for North American distribution by Blue Fox Entertainment. A U.S. premiere is planned in New York on April 14.\n\n\t“Brunello: The Gracious Visionary” chronicles Cucinelli’s rise from being a farmer’s son to becoming the creative director and executive chairman of a global luxury lifestyle brand with a market capitalization of more than $7.8 billion. The elegant film stars “Love & Gelato” breakout Saul Nanni as a younger version of Cucinelli and features a score by Oscar-winning composer Nicola Piovani (“Life Is Beautiful”).\n\t\n\n\t “The Gracious Visionary” interweaves documentary and reenacted components to tell the story of how his mindset was shaped by learning philosophy, playing cards and the generosity of others.\n\n\n\tCucinelli, who was born in the ancient Umbrian hamlet of Castel Rigone in 1953, founded his company in 1978 and became successful by dyeing cashmere in “pop colors” at a time when, as he has put it, there was no colored cashmere for women. The docufilm, which was shot in Umbria, depicts key moments in his career, showcasing his passion for Italian craftsmanship and commitment to a concept he calls “humanistic capitalism,” under which every stitch of clothing his company creates is made in Italy and mostly in the area where he comes from. Cucinelli also makes sure his factory workers are paid fair wages and feel like family. He has completely renovated the Italian village of Solomeo that is home to his headquarters.\n\t\n\n\tIn an interview with Variety, Cucinelli — who mostly self-financed the $17 million docufilm — said he had hoped to share his life story while he was still around to see its ripple effects. “These documentaries are made after people have died. Some of the ones I’ve seen are of people that I have known — I don’t like them very much,” Cucinelli said. “They are not as profound as the value of the human being.”\n\n\tThe docufilm is produced by Brunello Cucinelli S.p.A. and MasiFilm in collaboration with RAI Cinema.\n\n\t“The Gracious Visionary” opened in Italy on Dec. 9 via RAI Cinema’s 01 Distribution and did brisk business at the box office, scoring more than $1 million during its limited seven-day run. The Italian release of “The Gracious Visionary” was preceded by a star-studded gala at Rome’s Cinecittà Studios that drew some of the biggest names in cinema, including Jessica Chastain, Jonathan Bailey,  Ava DuVernay, Jeff Goldblum, Chris Pine, Édgar Ramírez and Kyle MacLachlan. \n\n\tIt will be interesting to see the star power on display on the red carpet at the April 14 U.S. premiere of “Brunello: The Gracious Visionary” in New York, to be followed by its release across more than 100 screens throughout North America later that spring. \n\n\t“We are thrilled to partner with Blue Fox Entertainment for the North American release of ‘Brunello: The Gracious Visionary,'” said Edoardo Bussi, founder and CEO at Twenty-Nine Palms Entertainment, which is handling sales on the film. Bussi added that as a distributor, “Blue Fox stood out for their unique ability to bridge the gap between high-calibre cinematic storytelling and a broad commercial audience.”\n\n\tHe added, “Their expertise in managing carefully-timed theatrical windows and their deep understanding of the North American market make them the perfect fit to bring Giuseppe Tornatore’s masterful vision of Brunello Cucinelli’s life to the States.”\n\n\tBussi, who soft-launched sales on “Brunello: The Gracious Visionary” in Toronto, will now be selling the docufilm in earnest at the upcoming European Film Market in Berlin. \n\n\tCommented Blue Fox Entertainment’s Lisa Gutberlet and David Hudakoc: “We are honored to partner with the filmmakers of ‘Brunello: The Gracious Visionary’ to bring this remarkable work to audiences across North America. The film transcends traditional documentary form, offering a cinematic exploration of humanism, craftsmanship and enduring beauty — values that sit at the very heart of cultural and creative excellence.”\n\t\n\n\tBlue Fox Entertainment’s recent U.S. releases include German animated feature “Tahiti: Across the Desert,” the sci-fi adventure “Xeno” produced by Kevin Hart and survival drama “Lost on a Mountain in Maine” produced by Sylvester Stallone.\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tFilmitalia\n\t\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Brunello Cucinelli Docufilm ‘The Gracious Visionary’ Set for North American Release via Blue Fox Entertainment (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Brunello-Cucinelli-Poster.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-10T12:00:00.000Z",
      "dateModified": "2026-02-10T12:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Olympic Skier Hunter Hess Responds to Trump Slamming Him for Having ‘Mixed Feelings’ About Representing the U.S.: ‘There Are Always Things That Could Be Better’ About America",
    "url": "https://variety.com/2026/sports/global/us-olympic-skier-hunter-hess-responds-donald-trump-1236657838/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Hunter-Hess.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-10T09:31:57.000Z",
    "description": "\n\tU.S. Olympic skier Hunter Hess has responded to President Donald Trump blasting him for saying he had “mixed feelings” about representing the U.S. a",
    "body": "\n\tU.S. Olympic skier Hunter Hess has responded to President Donald Trump blasting him for saying he had “mixed feelings” about representing the U.S. at the winter games.\n\n\tThe freestyle skier had said during a press conference on Saturday that representing the United States brings up “mixed emotions,” and that if he wins a medal, it would be more for his “family and the people that support me getting here” than his home country.\n\t\n\n\tThat, in turn prompted the POTUS to call him a “real loser” on social media.\n\n\n\t“I love my country,” Hess said in a social media post Monday. “There is so much that is great about America, but there are always things that could be better. One of the many things that makes this country so amazing is that we have the right and the freedom to point that out.”\n\n\t“The best part of the Olympics is that it brings people together, and when so many of us are divided we need that more than ever,” Hess added. “I cannot wait to represent Team USA next week when I compete. Thanks to everyone for their support.”\n\n\tU.S. snowboarders at the Olympics also weighed in on the polemics with the U.S. president. \n\n\tWomen’s halfpipe champion Maddie Maestro, who is well positioned to earn her first Olympic medal, said she was proud to represent the U.S. but she’s “also saddened with what’s happening at home.”\n\n\t“It’s really tough,” she added. “I feel like we can’t turn a blind eye to that. But at the same time, I represent a country that has the same values as mine, of kindness and compassion. And we come together in times of injustice.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Olympic Skier Hunter Hess Responds to Trump Slamming Him for Having ‘Mixed Feelings’ About Representing the U.S.: ‘There Are Always Things That Could Be Better’ About America",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Hunter-Hess.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-10T09:31:57.000Z",
      "dateModified": "2026-02-10T09:31:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Products to Reduce Stress, Boost Energy",
    "url": "https://www.tmz.com/2026/02/10/products-to-reduce-stress-boost-energy/",
    "image": "https://imagez.tmz.com/image/93/16by9/2026/02/04/9350e24221de425891d6308ec7d19629_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-10T08:05:12.000Z",
    "description": "\n                    \n                          Raw-Dogging Reality Ain't Working\n                          So Tired It's Starting to Feel Personal?\n ",
    "body": "\n                    \n                          Raw-Dogging Reality Ain't Working\n                          So Tired It's Starting to Feel Personal?\n                          Here's Some Simple Fixes 😉\n                      \n                  \n                                                                        Published \n                              February 10, 2026\n                            12:05 AM PST\n                                                                            \n              \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          TMZ may collect a share of sales or other compensation from links on this page.\n      \n    \n          Life's a frickin' grind.\n      \n    \n          No wonder you're tired all the time ... We get it, we really do.\n      \n    \n          And to show we care, here's a list of things that could help you max out on your rest periods. You can thank us later.\n      \n    \n          TMZ CHEATSHEET: THINGS FOR WHEN YOU REALIZE YOU'RE ALWAYS FREAKIN' TIRED\n  \n\n          Actually-Comfortable Sleep Masks (Not the Cheap Hotel Ones): $15Weighted Blanket: $52Vitamin B-12 Supplements: $9Blue Blockers: $16Massager: $38\n      \n    \n              \n      Actually-Comfortable Sleep Masks (Not the Cheap Hotel Ones)\n      \n        \n    \n                    \n                          \n                                  \n      \n        \n    \n          The best way to rejuvenate is the old-fashioned way ... get some deep sleep!\n      \n    \n          And here's where these sleep masks come in -- these things are so genuinely comfy, you won't even notice them when you're laying your head on the pillow, shutting things down in your head, and getting some decent rest.\n      \n    \n              \n      Weighted Blanket\n      \n        \n    \n                    \n                          \n                                  \n      \n        \n    \n          Sometimes it's hard to just settle down and not feel restless ... even when chilling on the couch or laying in bed.\n      \n    \n          Let us introduce you to the weighted blanket ... it's like a whole body hug and a great way to really decompress.\n      \n    \n          This one here weighs 15lbs and by the time you get it on top of you -- well, you've had your workout for the day and truly earned that RnR.\n      \n    \n              \n      Vitamin B-12 Supplements\n      \n        \n    \n                    \n                          \n                                  \n      \n        \n    \n          There are people who swear by B-12 supplements ... and claim it gives you all the energy you need without the caffeine jitters.\n      \n    \n          The ones listed above, from Nature's Bounty, have great customer reviews on Amazon.\n      \n    \n          In fact, one five star review gushed: \"I definitely have been feeling better after taking this for a few weeks. One dropper full each day under the tongue and it tastes nice, not bad in the slightest bit! If you want to try some B12, this is your brand.\"\n      \n    \n              \n      Blue Blockers\n      \n        \n    \n                    \n                          \n                                  \n      \n        \n    \n          Screen fatigue ain't no joke ... and it can wear on not just your eyes but also your soul.\n      \n    \n          Enter these blue blockers -- these bad boys block out all that gnarly blue light from your screens and will keep you going all through the workday hopefully feeling that much sharper.\n      \n    \n              \n      Massager\n      \n        \n    \n                    \n                          \n                                  \n      \n        \n    \n          Okay, time to break out the big guns ... this massager's always gonna be there for those days where that stress really burrows its way down into your muscles and needs to be gently -- or roughly, whatever your style is -- coaxed out of your body.\n      \n    \n          Pop this sucker on, hit start, and let all that tension out of your body get pounded into nothingness ... leaving nothing but pure chill left.\n      \n    \n          All prices and availability subject to change.\n      \n      ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Products to Reduce Stress, Boost Energy",
      "image": [
        "https://imagez.tmz.com/image/93/16by9/2026/02/04/9350e24221de425891d6308ec7d19629_xl.jpg"
      ],
      "datePublished": "2026-02-10T08:05:12.000Z",
      "dateModified": "2026-02-10T08:05:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Elizabeth Warren Says She's The Fastest Senator",
    "url": "https://www.tmz.com/2026/02/10/elizabeth-warren-fastest-senator/",
    "image": "https://imagez.tmz.com/image/f9/16by9/2026/02/05/f96921f45f9947a8a6d56ae0051a1e6a_xl.png",
    "tag": "Entertainment",
    "date": "2026-02-10T09:00:35.000Z",
    "description": "\n                            \n                          Elizabeth Warren\n                          I'm The Fastest Senator!!!\n                      \n ",
    "body": "\n                            \n                          Elizabeth Warren\n                          I'm The Fastest Senator!!!\n                      \n                  \n                                                                        Published \n                              February 10, 2026\n                            1:00 AM PST\n                                                                            \n              \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          Elizabeth Warren doesn't need to track her step count or run a stopwatch on her 40-yard dash to know she's the fastest Senator ... and she may very well be right, because our photog had a tough time keeping up with her.\n      \n    \n          We got the Democratic Senator from Massachusetts in the underground tunnel system under the Capitol and she made our camera man Charlie Cotton work hard to go step-for-step.\n      \n    \n          Liz was on her way to the Senate for a speech about ICE funding when we chopped it up with her about a ton of topics ... including footwear.\n      \n\n          The Senator says she doesn't wear heels because she walks around all day ... and jokes she wears a good pair of sneakers to keep in \"fighting shape.\"\n      \n    \n          Liz also tells us the secret to her speed-walking and explains why her dog and her husband keep her chugging along in a ruthless town.\n      \n    \n          Charlie's accustomed to walk and talks with celebs at LAX, but Liz is giving him a run for his money here ... literally.\n      \n      ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Elizabeth Warren Says She's The Fastest Senator",
      "image": [
        "https://imagez.tmz.com/image/f9/16by9/2026/02/05/f96921f45f9947a8a6d56ae0051a1e6a_xl.png"
      ],
      "datePublished": "2026-02-10T09:00:35.000Z",
      "dateModified": "2026-02-10T09:00:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tracy Scroggins, Longtime NFL Player, Dead At 56",
    "url": "https://www.tmz.com/2026/02/09/tracy-scroggins-dead-nfl-player-detroit-lions/",
    "image": "https://imagez.tmz.com/image/88/16by9/2026/02/09/88a64c86bd324587a4ac3b4ea8fad8a8_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-09T23:43:20.000Z",
    "description": "\n    \n                    \n                          Tracy Scroggins\n                          Dead At 56\n                          ... Longtime NFL P",
    "body": "\n    \n                    \n                          Tracy Scroggins\n                          Dead At 56\n                          ... Longtime NFL Player\n                      \n                  \n                                                                        Published \n                              \n                February 9, 2026\n                \n                            3:43 PM PST\n                                                                      |\n                                                                Updated \n                                  February 9, 2026\n                                4:25 PM PST\n                                    \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Tracy Scroggins, who spent all 10 seasons of his career as a member of the Detroit Lions, has died at 56 years old, TMZ Sports has learned.\n      \n    \n          \"It is with profound sadness that we announce the passing of our beloved Tracy Scroggins,\" the Scroggins family said in a statement sent to us.\n      \n    \n          \"Tracy was a devoted father, cherished family member, and loyal friend whose life was marked by remarkable strength and perseverance. While many knew him for his career as a professional football player in the NFL, those closest to him knew him as a kind-hearted and generous man who cared deeply for his family and friends.\"\n      \n\n          The family continued ... \"Playing in the NFL gave Tracy the opportunity to pursue his lifelong dream and to rise from poverty. However, unfortunately, the NFL was also ultimately the cause of his untimely demise. Tracy spent every moment of retirement courageously battling the devastating effects of CTE. While our hearts are heavy, we find comfort in knowing that he is finally at peace.\"\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Back in 1992, Scroggins, a linebacker and defensive end, was a 2nd round draft pick out of Tulsa, where he went 53rd overall.\n      \n    \n          Over the course of his time in the National Football League, he accumulated 321 tackles and 60.5 sacks. He also had one interception.\n      \n    \n          Scroggins retired from football in 2001 after 142 games played.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          In 2016, he filed a lawsuit against the NFL, alleging CTE.\n      \n    \n          The cause and circumstances surrounding Scroggins' death aren't clear.\n      \n    \n          Story developing ...\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                RIP\n              \n                          \n                TMZ Sports\n              \n                          \n                Exclusive\n              \n                          \n                NFL\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tracy Scroggins, Longtime NFL Player, Dead At 56",
      "image": [
        "https://imagez.tmz.com/image/88/16by9/2026/02/09/88a64c86bd324587a4ac3b4ea8fad8a8_xl.jpg"
      ],
      "datePublished": "2026-02-09T23:43:20.000Z",
      "dateModified": "2026-02-09T23:43:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "FBI Unaware of Continued Contact Between Guthries and Suspected Kidnappers",
    "url": "https://www.tmz.com/2026/02/09/fbi-unaware-contact-between-guthrie-family-and-suspected-kidnappers/",
    "image": "https://imagez.tmz.com/image/78/16by9/2026/02/10/78851e513f4444669a675cc9e8683cc7_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-10T02:26:53.000Z",
    "description": "\n    \n                    \n                          Savannah Guthrie's Missing Mom\n                          FBI Unaware of Contact Between Family an",
    "body": "\n    \n                    \n                          Savannah Guthrie's Missing Mom\n                          FBI Unaware of Contact Between Family and Kidnappers\n                      \n                  \n                                                                        Published \n                              February 9, 2026\n                            6:26 PM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          The FBI says it has no knowledge of any continued communication between Savannah Guthrie's family and anyone believed to have kidnapped her mother, despite a massive, around-the-clock federal search now stretching into a second week.\n      \n    \n          In a new statement released Monday, the FBI said agents, analysts and crisis management experts have been working nonstop to reunite 84-year-old Nancy Guthrie with her family, but investigators remain in the dark when it comes to ransom-related contact.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          \"The FBI is not aware of any continued communication between the Guthrie family and suspected kidnappers,\" the agency said, adding it has not identified a suspect or person of interest at this time.\n      \n\n          Federal officials revealed they are now operating a 24-hour command post in Tucson, pulling in additional personnel from FBI field offices across the country. The operation includes crisis negotiators, analytic teams and investigators following up on tips.\n      \n    \n      \n        \n                    \n                  \n      \n                    Instagram/@savannahguthrie\n          \n    \n          On Monday, Savannah posted to Instagram saying she and her family are not giving up hope Nancy is alive and says they're desperately asking for the public's help in locating their mom.\n      \n    \n          The final deadline to pay the alleged ransom in the kidnapping expired at 5 PM Arizona time Monday. Nancy and her siblings said they would pay the $6 million bitcoin ransom ... so far, there hasn't been any movement on the bitcoin account.\n      \n    \n          Nancy was abducted early in the morning of Feb. 1 ... she went out to dinner Saturday night, but missed church the next morning.\n      \n    \n      \n        \n                    \n                  \n      \n                    Instagram/@savannahguthrie\n          \n    \n          Two days ago, Savannah Guthrie and her siblings, Annie and Camron, shared another Instagram video, agreeing to pay the ransom demands to bring their mother home.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Savannah Guthrie\n              \n                          \n                Nancy Guthrie\n              \n                          \n                Celebrity News\n              \n                          \n                Today Show\n              \n                          \n                Nancy Guthrie Case\n              \n                          \n                True Crime\n              \n                          \n                Police\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "FBI Unaware of Continued Contact Between Guthries and Suspected Kidnappers",
      "image": [
        "https://imagez.tmz.com/image/78/16by9/2026/02/10/78851e513f4444669a675cc9e8683cc7_xl.jpg"
      ],
      "datePublished": "2026-02-10T02:26:53.000Z",
      "dateModified": "2026-02-10T02:26:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bad Bunny Dancer Pulls Back Curtain On Super Bowl Takeover",
    "url": "https://www.tmz.com/2026/02/10/bad-bunny-dancer-talks-super-bowl-halftime-show/",
    "image": "https://imagez.tmz.com/image/55/16by9/2026/02/09/5524d5882ca243179a93b2eba36229fa_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-10T08:30:16.000Z",
    "description": "\n                    \n                          Bad Bunny\n                          Crew Pulls Back Curtain On Halftime Show\n                         ",
    "body": "\n                    \n                          Bad Bunny\n                          Crew Pulls Back Curtain On Halftime Show\n                          ... Was Love Letter To Puerto Rico\n                      \n                  \n                                                                        Published \n                              February 10, 2026\n                            12:30 AM PST\n                                                                            \n              \n    \n      \n        \n                    \n                  \n      \n                    TMZSports.com\n          \n    \n          Bad Bunny used the Super Bowl stage to tell a story about his culture -- and his crew says the message was loud and clear!\n      \n    \n          TMZ Sports caught up with members of the global superstar’s cast at LAX on Monday after their big halftime performance ... and they say their focus wasn’t just about putting on a show, it was about putting Puerto Rican culture front and center on the world’s biggest stage.\n      \n    \n          \"I was blown away myself,\" one of his backup dancers, Chris, told us.\n      \n    \n          \"I feel like it’s such a monumental moment culturally. I was born and raised in Puerto Rico and everything they did culturally, I feel like they tapped in perfectly.\"\n      \n\n                  \n          \n                          \n                \n                  \n      \n    \n          He continued, saying the performance perfectly tapped into both the struggle and the beauty of growing up on the island.\n      \n    \n          And, Bad Bunny didn't just show up and perform ... he was deeply involved in building the show from the ground up. In fact, the dancer says Benito stayed hands-on throughout rehearsals ... constantly weighing in on creative ideas and making sure every detail matched his vision.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          \"Doing this was beyond me,\" Chris said. \"I was fortunate enough to be a part of this and it’ll be part of history forever. To all those people that wanna do stuff after me, I feel like this was a stamp from time to know that you can do that.\"\n      \n    \n      \n        \n                    \n                  \n      \n                    TMZSports.com\n          \n    \n          We also caught up with Victor Villa -- owner of Villa’s Tacos in Los Angeles -- who snagged a surprise spotlight during the halftime opener, “Tití Me Preguntó.”\n      \n    \n          During the performance, Bad Bunny bursts out from the sugar cane fields, grabs a shaved ice from a street vendor … then turns and hands it off to Villa, who was working a taco cart onstage.\n      \n    \n        Waiting for your permission to load the Instagram Media.\n      \n    \n          \"I thank Benito for that, for bringing all the Latinos together and really giving us a platform to not only share our craft but to meet other amazing people who made an amazing show,\" Villa said.\n      \n    \n          He added that business is booming since the performance, but Villa's main takeaway was about Benito as a person, describing him as \"a man of so much love.\"\n      \n    \n          Halftime wasn’t just a concert … it was a statement.\n      \n      ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bad Bunny Dancer Pulls Back Curtain On Super Bowl Takeover",
      "image": [
        "https://imagez.tmz.com/image/55/16by9/2026/02/09/5524d5882ca243179a93b2eba36229fa_xl.jpg"
      ],
      "datePublished": "2026-02-10T08:30:16.000Z",
      "dateModified": "2026-02-10T08:30:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]