[
  {
    "title": "Brian Grazer Talks AI, ‘8 Mile,’ ‘Splash,’ Revving His ‘Engine of Curiosity’ and Why Flat Salaries for Artists  are ‘Disincentivizing’",
    "url": "https://variety.com/2026/film/news/brian-grazer-ai-8-mile-splash-mary-parent-paley-center-1236669400/",
    "image": "https://variety.com/wp-content/uploads/2026/02/149A4375-e1771724627811.jpg?w=1000&h=561&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-22T16:01:00.000Z",
    "description": "\n\tAs a young producer, Brian Grazer wouldn’t stop selling his mermaid movie no matter how many times he heard “no.” It turned out to be the hit – 1984",
    "body": "\n\tAs a young producer, Brian Grazer wouldn’t stop selling his mermaid movie no matter how many times he heard “no.” It turned out to be the hit – 1984’s “Splash” — that set off his career.\n\n\tHe wasn’t sure if he should make 2002’s “8 Mile” with Eminem. A conversation over dinner with Tom Hanks made Grazer confident to pursue the movie that won an Oscar for best song.\n\n\n\tThe Imagine Entertainment chief shared stories from his early career and observations about the future of film and television during a wide-ranging conversation hosted Feb. 19 in Beverly Hills by the Paley Center for Media as part of its Paley Media Council series. Mary Parent, chairman of worldwide production for Legendary Entertainment, conducted the Q&A with her longtime industry associate. (Parent, an alumnus of Universal Pictures, reminded Grazer that the first Imagine project that she worked on as a film executive of 1999’s “Bowfinger.”)\n\t\n\n\tGrazer, who has enjoyed a 40-year partnership in Imagine Entertainment with director Ron Howard, credits his longevity to his natural curiosity and drive to learn more about the world.\n\n\n\t“This engine of curiosity drives many of the movies, television shows, documentaries that I do. The engine of curiosity drives me to find ways to be in all different genres and all sizes, shapes and forms,” Grazer told Parent during the early evening gathering at the Beverly Wilshire Hotel. “And so it’s helped quite a bit. I happen to just like to wake up every day wanting to solve a puzzle. Movies are puzzles. They’re cinematic puzzles to me, and documentaries are kind of like that. But they’re more like equations to me. And you postulate a point of view, and then you try to see if that equation works, and if it doesn’t, then you readjust.”\n\t\n\n\tA producer’s fate rises and falls on the strength of the material and the creative partners chosen. After decades of experience, Grazer has developmed clear guidelines for himself. \n\n\t“Is the idea compressible into a sentence, and is it sexy? Is it provocative? Does it make you curious? Does it activate you? And then for me, usually it’s a character that I can root for because they’re in pursuit of something that that has nobility to it. There’s a noble goal” at the end, Grazer says, pointing to such titles as 1991’s “Backdraft” and “8 Mile.”\n\n\tParent pressed Grazer on how he has adapted to new technologies and platforms. He was candid about his experimentation with AI tools to facilitate brainstorming and pre-visualization development.\n\n\t“It’s very, very, very helpful tool. It’s essential. It’s very, very helpful to me, because you get to collaborate with AI. I often just lay down on my couch in my office, I put it on my phone, on my chest, and I just have these long conversations, right where I do endless ‘what ifs’ and just build stories,” Grazer said. “And you get to test them and you model them, and it’s like spectacular. And there are efficiencies to AI, because it’s very good in pre-production. It’s very good in pre-visualization. It’s great, It’s very helpful. The things I don’t want it to do — or the things that everybody doesn’t want to do — is to replace human beings.”\n\n\tGrazer and Parent compared notes on the vast changes in the film and TV landscape in recent years, particularly when it comes to how creative talent gets compensated in success. The shifts in dealmaking has taken away the jackpot potential of a huge windfall for writers, directors, actors, producers and others if a movie or TV show is a bona fide hit. Now, even pop culture buzz doesn’t translate to syndication and international licensing revenue because those rights are frequently bought out upfront by the streaming platform. Artists, Grazer, asserted, tend to thrive with the element of risk.\n\n\t“Artists are paid a flat salary in streaming. Now the salary can be really great [but], I find it very dis-incentivizing. Artists are special people that do oddly special things beyond just the art form itself. They like to bet on themselves, because most artists come from a really hard place where they’re nobody, and they feel the nobody-ness, and it’s indelible,” Grazer said. “So they want to be extra special. And so being extra special is betting on yourself. So you get to walk across that tight high wire. And if you get across and it works, you get a lot of money and a lot of love and a lot of appreciation. And if you don’t, you fall but it’s kind of the fun of it, I think. It makes you really motivated.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Brian Grazer Talks AI, ‘8 Mile,’ ‘Splash,’ Revving His ‘Engine of Curiosity’ and Why Flat Salaries for Artists  are ‘Disincentivizing’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/149A4375-e1771724627811.jpg?w=1000&h=561&crop=1"
      ],
      "datePublished": "2026-02-22T16:01:00.000Z",
      "dateModified": "2026-02-22T16:01:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "BAFTA Film Awards 2026 Red Carpet Arrivals: Timothée Chalamet, Paul Mescal and Gracie Abrams, Emma Stone and More",
    "url": "https://variety.com/gallery/bafta-film-awards-2026-red-carpet-arrivals-photos/",
    "image": "https://variety.com/wp-content/uploads/2026/02/bafta-gallery-2.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-22T15:07:51.000Z",
    "description": "The biggest stars from the U.K. and beyond are arriving to the 2026 BAFTA Film Awards in style.\nThe awards ceremony, which is often a key predictor of",
    "body": "The biggest stars from the U.K. and beyond are arriving to the 2026 BAFTA Film Awards in style.\nThe awards ceremony, which is often a key predictor of the Oscars race, is taking place at London’s Royal Festival Hall with “The Traitors” star Alan Cumming on hosting duties.\nBAFTA nominees Chase Infiniti and Odessa A’zion were among the first arrivals, with Infiniti rocking a red strapless gown with a flared-out hem and A’zion wearing a black off-the-shoulder lace dress. “Hamnet” stars and brothers Jacobi and Noah Jupe also walked the carpet together, posing arm in arm. Emma Stone and Cillian Murphy then brought more star power, with Stone turning heads in a sleek cut-out dress and Murphy looking dashing in a double-breasted suit. Timothée Chalamet, Leonardo DiCaprio, Paul Mescal and Gracie Abrams followed as the ceremony drew closer, generating screams from fans hoping for a selfie or autograph from the stars.\nThis year’s nominations are led by Paul Thomas Anderson’s action thriller “One Battle After Another,” which has 14 nominations, alongside Ryan Coogler’s vampire horror “Sinners” with 13. Both movies were nominated for best film, alongside Chloé Zhao’s “Hamnet,” Josh Safdie’s “Marty Supreme” and Joachim Trier’s “Sentimental Value.”\nBelow, see all the best looks from this year’s BAFTAs red carpet.\n\n\n\t\t\t\n\t\t\t\n\tTimothée Chalamet\n\t\n\t\t\t\n\tTimothée Chalamet at the BAFTA Film Awards.\n\n\t\t\n\t\t\t\n\t\t\t\n\tLeonardo DiCaprio\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Getty Images for BAFTA\t\t\t\n\t\t\t\n\tLeonardo DiCaprio at the BAFTA Film Awards.\n\n\t\t\n\t\t\t\n\t\t\t\n\tPaul Mescal and Gracie Abrams\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Max Cisotti/Dave Benett/Getty Im\t\t\t\n\t\t\t\n\tPaul Mescal and Gracie Abrams share a sweet moment at the BAFTA Film Awards.\n\n\t\t\n\t\t\t\n\t\t\t\n\tChase Infiniti\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Getty Images for BAFTA\t\t\t\n\t\t\t\n\tChase Infiniti arrives to the BAFTA Film Awards.\n\n\t\t\n\t\t\t\n\t\t\t\n\tRenate Reinsve\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Max Cisotti/Dave Benett/Getty Im\t\t\t\n\t\t\t\n\tRenate Reinsve on the BAFTA Film Awards red carpet.\n\n\t\t\n\t\t\t\n\t\t\t\n\tCillian Murphy\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Gareth Cattermole/BAFTA/Getty Im\t\t\t\n\t\t\t\n\tCillian Murphy at the BAFTA Film Awards.\n\n\t\t\n\t\t\t\n\t\t\t\n\tEmma Stone\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Getty Images for BAFTA\t\t\t\n\t\t\t\n\tEmma Stone at the BAFTA Film Awards.\n\n\t\t\n\t\t\t\n\t\t\t\n\tOdessa A’zion\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Getty Images for BAFTA\t\t\t\n\t\t\t\n\tOdessa A’zion at the BAFTA Film Awards.\n\n\t\t\n\t\t\t\n\t\t\t\n\tPaul Mescal and Jessie Buckley\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Getty Images for BAFTA\t\t\t\n\t\t\t\n\tPaul Mescal and Jessie Buckley at the BAFTA Film Awards.\n\n\t\t\n\t\t\t\n\t\t\t\n\tRei Ami, EJAE and Audrey Nuna\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Getty Images for BAFTA\t\t\t\n\t\t\t\n\t“KPop Demon Hunters” stars Rei Ami, EJAE and Audrey Nuna at the BAFTA Film Awards.\n\n\t\t\n\t\t\t\n\t\t\t\n\tJoe Alwyn\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Max Cisotti/Dave Benett/Getty Im\t\t\t\n\t\t\t\n\tJoe Alwyn at the BAFTA Film Awards.\n\n\t\t\n\t\t\t\n\t\t\t\n\tStellan Skarsgård\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Getty Images\t\t\t\n\t\t\t\n\tStellan Skarsgård strikes a pose at the BAFTA Film Awards.\n\n\t\t\n\t\t\t\n\t\t\t\n\tGillian Anderson\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Gareth Cattermole/BAFTA/Getty Im\t\t\t\n\t\t\t\n\tGillian Anderson at the BAFTA Film Awards. \n\n\t\t\n\t\t\t\n\t\t\t\n\tWagner Moura\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Getty Images\t\t\t\n\t\t\t\n\t“The Secret Agent” Wagner Moura at the BAFTA Film Awards.\n\n\t\t\n\t\t\t\n\t\t\t\n\tJacobi and Noah Jupe\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Gareth Cattermole/BAFTA/Getty Im\t\t\t\n\t\t\t\n\tJacobi Jupe and Noah Jupe at the BAFTA Film Awards.\n\n\t\t\n\t\t\t\n\t\t\t\n\tKate Hudson\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Gareth Cattermole/BAFTA/Getty Im\t\t\t\n\t\t\t\n\tKate Hudson at the BAFTA Film Awards.\n\n\t\t\n\t\t\t\n\t\t\t\n\tEmily Watson\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: PA Images via Getty Images\t\t\t\n\t\t\t\n\tEmily Watson at the BAFTA Film Awards.\n\n\t\t\n\t\t\t\n\t\t\t\n\tHarry Melling\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Getty Images\t\t\t\n\t\t\t\n\tHarry Melling at the BAFTA Film Awards\n\n\t\t\n\t\t\t\n\t\t\t\n\tRose Byrne\n\t\n\t\t\t\n\tRose Byrne at the BAFTA Film Awards\n\n\t\t\n\t\t\t\n\t\t\t\n\tKathryn Hahn\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Getty Images\t\t\t\n\t\t\t\n\tKathryn Hahn at the BAFTA Film Awards.\n\n\t\t\n\t\t\t\n\t\t\t\n\tKerry Washington\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Getty Images\t\t\t\n\t\t\t\n\tKerry Washington at the BAFTA Film Awards.\n\n\t\t\n\t\t\t\n\t\t\t\n\tRiz Ahmed\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Getty Images\t\t\t\n\t\t\t\n\tRiz Ahmed at the BAFTA Film Awards.\n\n\t\t\n\t\t\t\n\t\t\t\n\tRegé-Jean Page\n\t\n\t\t\t\n\tRegé-Jean Page at the BAFTA Film Awards.\n\n\t\t\n\t\t\t\n\t\t\t\n\tArchie Madekwe\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Getty Images\t\t\t\n\t\t\t\n\tArchie Madekwe on the BAFTA Film Awards red carpet.\n\n\t\t\n\t\t\t\n\t\t\t\n\tSadie Sink\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Gareth Cattermole/BAFTA/Getty Im\t\t\t\n\t\t\t\n\tSadie Sink at the BAFTA Film Awards.\n\n\t\t\n\t\t\t\n\t\t\t\n\tCarey Mulligan\n\t\n\t\t\t\n\tCarey Mulligan attends the BAFTA Film Awards.\n\n\t\t\n\t\t\t\n\t\t\t\n\tAlan Cumming\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Getty Images\t\t\t\n\t\t\t\n\tHost Alan Cumming at the BAFTA Film Awards.\n\n\t\t\n\t\t\t\n\t\t\t\n\tTed Sarandos\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Getty Images\t\t\t\n\t\t\t\n\tNetflix CEO Ted Sarandos at the BAFTA Film Awards.\n\n\t\t\n\t\t\t\n\t\t\t\n\tOliver Laxe\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Getty Images\t\t\t\n\t\t\t\n\t“Sirat” director Oliver Laxe at the BAFTA Film Awards.\n\n\t\t\n\t\t\t\n\t\t\t\n\tGugu Mbatha-Raw\n\t\n\t\t\t\n\tGugu Mbatha-Raw at the BAFTA Film Awards\n\n\t\t\n\t\t\t\n\t\t\t\n\tWumni Mosaku\n\t\n\t\t\t\n\t“Sinners” star Wumni Mosaku at the BAFTA Film Awards.\n\n\t\t\n\t\t\t\n\t\t\t\n\tJafar Panahi\n\t\n\t\t\t\n\t“It Was Just an Accident” director Jafar Panahi at the BAFTA Film Awards\n\n\t\t\n\t\t\t\n\t\t\t\n\tRobert Aramayo\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Getty Images for BAFTA\t\t\t\n\t\t\t\n\t“I Swear” star Robert Aramayo at the BAFTA Film Awards\n\n\t\t\n\t\t\t\n\t\t\t\n\tMaggie Gyllenhaal\n\t\n\t\t\t\n\tMaggie Gyllenhaal at the BAFTA Film Awards.\n\n\t\t\n\t\t\t\n\t\t\t\n\tErin Doherty\n\t\n\t\t\t\n\t“Adolescence” star Erin Doherty at the BAFTA Film Awards.\n\n\t\t\n\t\t\t\n\t\t\t\n\tGlenn Close\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Mike Marsland/WireImage\t\t\t\n\t\t\t\n\tGlenn Close at the BAFTA Film Awards.\n\n\t\t\n\t\n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "BAFTA Film Awards 2026 Red Carpet Arrivals: Timothée Chalamet, Paul Mescal and Gracie Abrams, Emma Stone and More",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/bafta-gallery-2.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-22T15:07:51.000Z",
      "dateModified": "2026-02-22T15:07:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How to Watch the 2026 BAFTA Film Awards Online",
    "url": "https://variety.com/2026/awards/news/2026-bafta-film-awards-online-1236669364/",
    "image": "https://variety.com/wp-content/uploads/2025/05/bafta-award-placeholder.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-22T11:00:00.000Z",
    "description": "\n\tThe BAFTA Film Awards will be held on Sunday at London’s Royal Festival Hall. U.S. viewers can watch the red carpet and award ceremony on E!, while ",
    "body": "\n\tThe BAFTA Film Awards will be held on Sunday at London’s Royal Festival Hall. U.S. viewers can watch the red carpet and award ceremony on E!, while U.K. viewers can watch the awards on BBC One and iPlayer. \n\n\tThe BAFTA Awards will be broadcast at 7 p.m. GMT, or 2 p.m. ET/11 a.m. PT. Dedicated to celebrating the best in British and global film, “The Traitors” star Alan Cumming will host the awards. \n\n\n\tPaul Thomas Anderson’s “One Battle After Another” leads the 2026 nominees with 14 nods, including for best film, director, leading actress, leading actor and more. Ryan Coogler’s “Sinners” trails just behind with 13 nominations, with nods for best film, original screenplay, director and more. The full best picture lineup also includes Chloe Zhao’s “Hamnet,” Josh Safdie’s “Marty Supreme” and Joachim Trier’s “Sentimental Value.” \n\t\n\n\tThe director race includes Zhao, Safdie, Anderson, Coogler, Trier and Yorgos Lanthimos for “Bugonia.” Zhao’s recent nod raises her BAFTA nominations tally to seven, with two wins under her belt for best film and best director for “Nomadland” in 2021. With 11 nominations, the director made history this year as “Hamnet” became the BAFTA’s most-nominated film by a female director. (Zhao is also the only female director to be nominated this year.) \n\n\tJesse Plemons (“Bugonia”), Robert Aramayo (“I Swear”), Timothée Chalamet (“Marty Supreme”), Leonardo DiCaprio (“One Battle After Another”), Ethan Hawke (“Blue Moon”) and Michael B. Jordan (“Sinners”) all received leading actor nominations, with Jessie Buckley (“Hamnet”), Rose Byrne (“If I Had Legs I’d Kick You”), Kate Hudson (“Song Sung Blue”), Chase Infiniti (“One Battle After Another”) Renate Reinsve (“Sentimental Value”) and Emma Stone (“Bugonia”) earning leading actress nods. \n\t\n\n\tBritbox previously had the broadcast rights to the BAFTAs in the States in years past. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How to Watch the 2026 BAFTA Film Awards Online",
      "image": [
        "https://variety.com/wp-content/uploads/2025/05/bafta-award-placeholder.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-22T11:00:00.000Z",
      "dateModified": "2026-02-22T11:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘One Battle After Another,’ ‘Hamnet’ and ‘Frankenstein’ Among Set Decorators Society of America Winners",
    "url": "https://variety.com/2026/artisans/news/set-decorators-society-of-america-winners-2026-full-list-1236669437/",
    "image": "https://variety.com/wp-content/uploads/2025/12/MCDONBA_WB040.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-22T09:27:12.000Z",
    "description": "\n\t“One Battle After Another” led the winners at the Set Decorators Society of America awards.\n\n\tThe set decorator,  Anthony Carlino, with production d",
    "body": "\n\t“One Battle After Another” led the winners at the Set Decorators Society of America awards.\n\n\tThe set decorator,  Anthony Carlino, with production design by Florencia Martin, behind the film took home two awards for Best Achievement In Décor/Design Of A Contemporary Feature Film and Best Picture for Paul Thomas Anderson.\n\n\tElsewhere, Best Achievement in Décor/Design of a Fantasy or Science Fiction Film an International Organization went to the “Frankenstein” team (set decoration by Shane Vieau with production design by Tamara Deverell), and Best Achievement in Décor/Design of a Period Feature Film went to the team behind “Hamnet.” (Set Decoration by Alice Felton with Production Design by Fiona Crombie).\n\t\n\n\tBest Achievement in Décor / Design of a Comedy or Musical Feature Film went to the team behind “Wicked: For Good” (set decoration by Lee Sandales with production design by Nathan Crowley).\n\n\n\tIn the past few years, the SDSA winners have gone on to win the production design Oscar. The set decorators and production design teams for “Frankenstein,” “One Battle After Another” and “Hamnet” all landed Oscar nominations.\n\n\tGuillermo del Toro called on Deverell and Vieau to work on “Frankenstein,” and one thing was clear: there would be no green screen; everything would be handmade from scratch. “We had 20 sculptors at any given moment working,” Deverell says, as she worked with the film’s set decorator Shane Vieau to ensure the authenticity of the film’s look.\n\n\tCrombie and Felton worked together to bring Chloe Zhao’s “Hamnet” to life. Part of their challenge was creating London’s Globe Theatre in the late 1500s. It was a big moment for the duo as the set dominates the film’s third act. For Felton, the glove workshop was also a small but important detail in the Shakespeare household.\n\t\n\n\tFor “One Battle After Another,” Willa’s bedroom was built onto the small house, the cottage was dressed to show the accumulation of the years the father and daughter had lived there. Carlino and Martin had a lot of artwork from Anderson’s kids, while Chase Infiniti provided childhood photos for Carlino to decorate the house.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘One Battle After Another,’ ‘Hamnet’ and ‘Frankenstein’ Among Set Decorators Society of America Winners",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/MCDONBA_WB040.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-22T09:27:12.000Z",
      "dateModified": "2026-02-22T09:27:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘KPop Demon Hunters’ Dominates at Annie Awards: Full Winners List",
    "url": "https://variety.com/2026/film/news/annie-awards-winners-kpop-demon-hunters-1236669259/",
    "image": "https://variety.com/wp-content/uploads/2024/12/Kpop-Demon-Hunters.jpg?w=900&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-22T06:00:00.000Z",
    "description": "\n\t“KPop Demon Hunters” led with 10 wins at the 53rd Annie Awards, taking home trophies for best feature, character animation, direction and production",
    "body": "\n\t“KPop Demon Hunters” led with 10 wins at the 53rd Annie Awards, taking home trophies for best feature, character animation, direction and production design, among others. The awards, considered animation’s highest honor, were presented at UCLA’s Royce Hall in Los Angeles on Saturday.  \n\n\tDirector Ugo Bienvenu’s “Arco” won best independent feature, while Adult Swim’s “Common Side Effects” and Netflix’ “Love, Death + Robots” led in the television categories with four and three wins, respectively. “Common Side Effects” claimed the titles of best editorial, best writing, best mature TV/media and best direction, with “Love, Death + Robots” securing wins for best character design, best production design and best storyboarding. \n\t\n\n\tJuried awards were also presented, including the Winsor McCay Award to Michaël Dudok de Wit, Christopher Miller, Phil Lord and Chris Sanders and the June Foray Award to Sandy Rabins. The Ub Iwerks Award for technical advancement affecting the animation industry was presented to Wacom and the Special Achievement Award was presented to LightBox Expo. ASIFA-Hollywood Merit Award was presented to Jeffrey New and Haley Mirren Douthit\n\n\n\tEach year, the Annie Awards celebrate excellence in animation, awarding individual artists and the animation industry as a whole for their outstanding achievements. \n\n\tSee the full list of winners below. \n\n\tBEST FEATURE\n\n\tKPop Demon Hunters, Sony Pictures Animation for Netflix\n\n\tBEST FEATURE – INDEPENDENT\n\n\tArco, Remembers, MountainA France, France 3 Cinéma\n\t\n\n\tBEST SPECIAL PRODUCTION\n\n\tSnoopy Presents: A Summer Musical, WildBrain Studios in association with Apple\n\n\tBEST SHORT SUBJECT\n\n\tSnow Bear, The Art of Aaron Blaise\n\n\tBEST SPONSORED\n\n\tOlipop Yeti, Screen Novelties & Passion Pictures\n\n\tBEST TV/MEDIA – PRESCHOOL\n\n\tWow Lisa, Episode: Rainy Day, Punkrobot\n\n\tBEST TV/MEDIA – CHILDREN\n\n\tThe Wonderfully Weird World of Gumball, Episode: The Rewrite, Hanna-Barbera Studios Europe\n\n\tBEST TV/MEDIA – MATURE\n\n\tCommon Side Effects, Episode: Pilot, Green Street Pictures, Bandera Entertainment and Williams Street Productions\n\n\tBEST TV/MEDIA – LIMITED SERIES\n\n\tWin Or Lose, Episode: Home, Pixar Animation Studios\n\n\tBEST STUDENT FILM\n\n\tA Sparrow’s Song, Tobias Eckerlin, Filmakademie Baden-Württemberg GmbH\n\n\tBEST FX – TV/MEDIA\n\n\tPrehistoric Planet: Ice Age, Episode: The Big Freeze, BBC Studios Natural History Unit, FX: Framestore, Edward Ferrysienanda, Kevin Christensen, Guy Schuleman, Benedikt Roettger, Kevin Tarpinian\n\n\tBEST FX – FEATURE\n\n\tKPop Demon Hunters, Filippo Macari, Nicola Finizio, Simon Corbaux, Naoki Kato, Daniel La Chapelle, Sony Pictures Animation for Netflix, FX: Sony Pictures Imageworks\n\n\tBEST CHARACTER ANIMATION – TV/MEDIA\n\n\tWin Or Lose, Alli Sadegiani, Pixar Animation Studios\n\n\tBEST CHARACTER ANIMATION – FEATURE\n\n\tKPop Demon Hunters, Ryusuke Furuya, Sony Pictures Animation, Netflix\n\n\tBEST CHARACTER ANIMATION – LIVE ACTION\n\n\tHow To Train Your Dragon, Kayn Garcia, Jean-Denis Haas, Meena Ibrahim, Nathan McConnel, Nick Tripodi, DreamWorks Animation, FX: Framestore\n\n\tBEST CHARACTER ANIMATION – VIDEO GAME\n\n\tSouth of Midnight, Mike Jungbluth, Sebastien Dussault, Vincent Schneider, Remi Edmond, Compulsion Games\n\n\tBEST CHARACTER DESIGN – TV/MEDIA\n\n\tLove, Death + Robots, Episode: 400 Boys, Robert Valley, Blur Studio for Netflix\n\n\tBEST CHARACTER DESIGN – FEATURE\n\n\tKPop Demon Hunters, Scott Watanabe, Ami Thompson, Sony Pictures Animation for Netflix\n\n\tBEST DIRECTION – TV/MEDIA\n\n\tCommon Side Effects, Vincent Tsui, Episode: Cliff’s Edge Productions\n\n\tBEST DIRECTION – FEATURE\n\n\tKPop Demon Hunters, Maggie Kang, Chris Appelhans, Sony Pictures Animation for Netflix\n\n\tBEST MUSIC – TV/MEDIA\n\n\tWin Or Lose, Episode: Episode 6, Mixed Signals, Ramin Djawadi, Shane Eli, Johnny Pakfar, Pixar Animation Studios\n\t\n\n\tBEST MUSIC – FEATURE\n\n\tKPop Demon Hunters, KPop Demon Hunters Music Team, Sony Pictures Animation for Netflix\n\n\tBEST PRODUCTION DESIGN – TV/MEDIA\n\n\tLove, Death + Robots, Episode: How Zeke Got Religion, Gigi Cavenago, Blur Studio for Netflix\n\n\tBEST PRODUCTION DESIGN – FEATURE\n\n\tKPop Demon Hunters, Helen Chen, Dave Bleich, Wendell Dalit, Scott Watanabe, Celine Kim, Sony Pictures Animation for Netflix\n\n\tBEST STORYBOARDING – TV/MEDIA\n\n\tLove, Death + Robots, Episode: How Zeke Got Religion, Edgar Martins, Blur Studio for Netflix\n\n\tBEST STORYBOARDING – FEATURE\n\n\tThe Bad Guys 2, Anthony Holden, Young Ki Yoon, DreamWorks Animation\n\n\tBEST VOICE ACTING – TV/MEDIA\n\n\tDan Mintz (as Tina Belcher), Bob’s Burgers, Episode: Don’t Worry Be Hoopy, 20th Television Animation\n\n\tBEST VOICE ACTING – FEATURE\n\n\tArden Cho (as Rumi), KPop Demon Hunters, Sony Pictures Animation for Netflix\n\n\tBEST WRITING – TV/MEDIA\n\n\tCommon Side Effects, Joe Bennett, Steve Hely, Episode: Pilot, Green Street Pictures, Bandera Entertainment, and Williams Street Productions \n\n\tBEST WRITING – FEATURE\n\n\tKPop Demon Hunters, Danya Jimenez, Hannah McMechan, Maggie Kang, Chris Appelhans, Sony Pictures Animation for Netflix\n\n\tBEST EDITORIAL – TV/MEDIA\n\n\tCommon Side Effects, Episode: Raid, Tony Christopherson, Joie Lim, Green Street Pictures, Bandera Entertainment, and Williams Street Productions \n\n\tBEST EDITORIAL – FEATURE\n\n\tKPop Demon Hunters, KPop Demon Hunters Editorial Team, Sony Pictures Animation for Netflix\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘KPop Demon Hunters’ Dominates at Annie Awards: Full Winners List",
      "image": [
        "https://variety.com/wp-content/uploads/2024/12/Kpop-Demon-Hunters.jpg?w=900&h=563&crop=1"
      ],
      "datePublished": "2026-02-22T06:00:00.000Z",
      "dateModified": "2026-02-22T06:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Forest High’ Review: Three Women Escape the Noise in a Beguiling Mountain Retreat of a Movie",
    "url": "https://variety.com/2026/film/reviews/forest-high-review-1236669061/",
    "image": "https://variety.com/wp-content/uploads/2026/02/202605344_1_ORG.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-22T09:00:36.000Z",
    "description": "\n\tThere are no luxuries and only the most essential comforts on offer at the remote Alpine refuge where “Forest High” is set: Hot water runs just a co",
    "body": "\n\tThere are no luxuries and only the most essential comforts on offer at the remote Alpine refuge where “Forest High” is set: Hot water runs just a couple of hours a day, the soup served for dinner is thin and blandly nourishing, and don’t ask where to charge your phone, because you’ll be met with a polite but firm refusal. It’s a place for passing hikers to rest, not to vacation — though for the women who run the place, across different seasons and weathers, it’s somewhere to stay and hit pause on life, and perhaps to finally hear yourself in the silence. Manon Coubia‘s gorgeous, whispering first feature is therefore not a film of major dramatic incidents and revelations, though its payoff is clear and cleansing as a mountain spring.\n\t\n\n\t“Forest High” is inspired by Coubia’s own ten years of experience as a warden at a mountain refuge: The Alpine landscape so ravishingly explored here has previously been integral to her short film work, notably the 2016 Locarno winner “The Fullness of Time.” Though a lightly scripted narrative is woven through proceedings here — particularly in its third and final section, an intimate two-hander — the film is chiefly attuned with documentary-like specificity to environmental details and textures. \n\n\n\tShot over four seasons of real-life activity at a working refuge, with Coubia’s actors interacting with actual hikers passing through the place, it’s a bracing and singular work: While its triptych structure and shifting focus on different shapes and stages of female identity most easily invite comparisons with Kelly Reichardt’s “Certain Women,” there’s nothing quite like it in the arthouse market. \n\t\n\n\tSpecialist distributors may be emboldened by the film’s special jury mention following its premiere in Berlin’s Perspectives competition for first features. (Rai Cinema International Distribution is handling sales.) Despite its modesty of scale, the deliberate, spell-casting rhythm and sensory density of “Forest High” demand theatrical exhibition, as do its ruggedly spectacular mountainscapes, shot on tactile 16mm film by DP Robin Fresson — it’s hard to imagine the film having quite the same strangely enveloping quality on streaming platforms.\n\n\tSet in the crisp first flush of spring, the film’s opening third is centered on Anna (Salomé Richard, star of Coubia’s 2023 short “Full Night”), a thirtysomething local who has done several stints at the refuge, and to whom this breathtaking region is merely home. With that familiarity has come a certain restlessness: She intends for this to be her last season doing the job, though a light dalliance with handsome traveling birdwatcher Antoine (Arthur Marbaix) keeps things interesting. He’s on the lookout for the capercaillie, a rare kind of grouse rapidly disappearing from the region, and a quasi-mythical motif running through the film — a symbol of a natural but increasingly threatened way of life.\n\n\tWith summer comes the older, more careworn Hélène (Aurélia Petit) to take over the job in brisk, practised fashion learned from decades of temporary menial work. But there’s pleasure in it too. This is the shelter’s busiest season, making for the film’s most vibrant, chattering section, and Hélène adapts well to the rhythm and volume of whatever company rolls in, while occasionally retreating to the woods for some respite. Coubia’s dramatic emphases are generally unexpected — the mystery of what happened to one booked-in family of hikers that never shows up amid a heavy rainstorm is left hanging — while lower-stakes scenes are followed through to rewarding, observational conclusions. One lovely sequence sees an outdoor lunch at the lodge turn into an impromptu dance party with a live musician singing some cheerfully inauthentic bossa nova.\n\n\tFinally, as the shelter empties out for winter, outsider Suzanne (Anne Cousens) arrives to mind it in the off-season. Like Hélène, she’s in her fifties, though her background is very different: Once a well-to-do wife and mother, now single and empty-nested, she’s living life on her own terms for the first time. The alone-but-not-loneliness afforded by the small, snow-licked hut is thus exactly what she’s after: As she contentedly tends the fireplace, reads her book and snuggles into bed with her puffer coat on, “Forest High” emerges as a kind of anti-“Shining,” a testament to the healing benefits of female solitude. It can’t last, of course, as a single male guest turns up at the shelter — a young army deserter, in his own way calmly adrift in life — but a gentle, reserved connection sparks between them.\n\t\n\n\tAll the while, “Forest High” feels happily haunted by the souls of those who have passed through its humble timber location, which remains unchanging and indifferent to modern developments and pressures in the lives escaped down below. Assisted by the serene control of Fresson’s camera, the patience and invisible economy of Théophile Gay-Mazas’s editing and the glassy, wind-brushed echoes of François Chamaraux’s score, the assured light touch of Coubia’s filmmaking maintains an atmosphere of tranquil but unromanticized remove from the world — as if there’s just an extra hour or two in the day, and no great need to fill the time.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Forest High’ Review: Three Women Escape the Noise in a Beguiling Mountain Retreat of a Movie",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/202605344_1_ORG.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-22T09:00:36.000Z",
      "dateModified": "2026-02-22T09:00:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kid Rock Predicts God Will ‘Cut Down’ Journalists for Reporting (Accurately) That He’s Charging Up to $5,000 for Tour Tickets",
    "url": "https://variety.com/2026/music/news/kid-rock-slams-journalists-5000-dollar-tour-tickets-1236669404/",
    "image": "https://variety.com/wp-content/uploads/2026/02/GettyImages-2258731182-e1771736823788.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-22T05:14:36.000Z",
    "description": "\n\tKid Rock wasn’t kidding around when sang a song about finding Jesus to conclude the recent Turning Point USA alternative halftime show. He got relig",
    "body": "\n\tKid Rock wasn’t kidding around when sang a song about finding Jesus to conclude the recent Turning Point USA alternative halftime show. He got religious again on social media Friday, although this time the musician was speaking about divine judgment — which he suggested God may enact on journalists who reported on the price of his premium concert tickets.\n\n\tThe singer-rapper said that he will pray for members of the media who made headlines out of the $5,000 top cost for “first class tickets” to his Freedom 250 Tour. But, he added, the Almighty will have the last word on their fate.\n\t\n\n\t“I WILL pray for them, but I know that sooner or later God will cut ‘em down,” Rock said, referring to members of the media who reported on his ticket prices.\n\n\n\t“The fake liberal media says I’m charging $5,000 for front-row tickets,” he wrote in his message — before going on to confirm that $5K is indeed what he is charging for the top face-value tickets to his upcoming shows. \n\n\tThe issue, he said, was context. “They know damn well that’s not the full story.” \n\n\t“Instead of reporting facts or that lawn seats are only 50 bucks or how we are cutting out the scalpers, they twist it for headlines/clicks and to attack me — nothing new here.”\n\n\tHe explained how many he has set aside 20 “first class” tickets for each show, in the $1000-5000 range: “Those are extremely limited First Class seats like I explained  — FOUR tickets per row, first five rows only (5k per seat row 1, 4k row 2, 3k row 3, 2k row 4, 1k row 5) — Again ONLY 4 seats in rows 1 through 5 (20 ‘first class’ seats in venues that hold 15k to 25k people).”\n\t\n\n\tAlthough there are only 20 seats per show in that premium class, if he sells them all, it will add a significant amount to his nightly tally. Other seats in the first nine or 10 rows at Rock’s upcoming tour are priced at $500. So if he sells those 20 seats for the advertised $1000-5000 prices, that will provide a bump of $50,000 per night above and beyond what he would have brought in pricing them at $500 like other nearby seats. \n\n\tNo additional VIP perks are being offered for the “first class” seats, beyond their centrality and proximity to the stage.\n\nHere we go again. The fake liberal media says I’m charging $5,000 for front-row tickets.They know damn well that’s not the full story.Those are extremely limited First Class seats like I explained  — FOUR tickets per row, first five rows only (5k per seat row 1, 4k row 2,… pic.twitter.com/Dgc9wp8sWq— KidRock (@KidRock) February 20, 2026\n\n\n\tThe $50 lawn seats for the tour do offer an affordable alternative to the fixed seats, which (the first class offering aside) are priced at $500, $200 and, for the last rows, a bottom rate of $100.\n\n\tIs anybody biting… or are fans content to settle for second- or third-class status?\n\n\tEarly results indicate mixed response to the gambit. On the tour’s opening night in Dallas, set for May 1, none of the $5,000 tickets had sold, as of this writing. But it did appear he has sold two of the $4,000 seats, three of the $3,000 tickets, two of the $2,000 ducats and three of the $1,000 seats in Dallas.\n\n\tFurther down the road, May 8 in Raleigh, NC, none of the $5,000, $4,000 or $3,000 seats in the first three rows has yet sold. But two of the four $2,000 first class seats in the fourth row have been snapped up, and all four $1,000 tickets in the fifth row have been claimed. At the non-premium level, in Raleigh, large blue swaths of $500 remain available. But $200 seems to be the price that is right for many fans, as a good number of rows in the front section at that price point have completely sold through.\n\n\tKid Rock’s irritation with members of the media comes despite him already having worked off some steam recently. The MAGA rocker appeared in a shirtless workout video this week with Health and Human Services Secretary Robert F. Kennedy Jr., giving a middle finger to the camera during a stationary cycling segment before joining Kennedy in the sauna, all in the promotion of the Trump administration’s “Make America Healthy” campaign.\n\n\tIn other Kid Rock news, and speaking of God (again), it was announced Friday that the artist has topped Billboard’s Hot Christian Songs chart for the first time. He achieved it with his studio recording of “‘Til You Can’t,” the Cody Johnson country hit he sang on the TPUSA show. Rock gets a co-writing credit on the tune now after contributing a new last verse telling listeners they “can give your life to Jesus / And he’ll give you a second chance / ‘Til you can’t.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kid Rock Predicts God Will ‘Cut Down’ Journalists for Reporting (Accurately) That He’s Charging Up to $5,000 for Tour Tickets",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/GettyImages-2258731182-e1771736823788.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-22T05:14:36.000Z",
      "dateModified": "2026-02-22T05:14:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Box Office: ‘GOAT’ Unseats ‘Wuthering Heights’ After Close Race for No. 1 in Glacial Weekend",
    "url": "https://variety.com/2026/film/box-office/box-office-goat-beats-wuthering-heights-quiet-weekend-1236669470/",
    "image": "https://variety.com/wp-content/uploads/2026/02/MV5BZGZkMTYyNmUtNDMwMi00NzBiLTk5OGItYjc0NWM5NWQ4M2M2XkEyXkFqcGdeQWFybm8@._V1_.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-22T16:04:48.000Z",
    "description": "\n\t“GOAT,” an original animated film about an animal who dreams of athletic greatness, trounced the box office competition in yet another glacial winte",
    "body": "\n\t“GOAT,” an original animated film about an animal who dreams of athletic greatness, trounced the box office competition in yet another glacial winter weekend. \n\n\tHeading into the late-February frame, “GOAT” and “Wuthering Heights” were closely contending for the No. 1 spot in North America. However, “GOAT” pulled ahead with $17 million from 3,863 theaters, declining just 36% from its debut. “Wuthering Heights” wasn’t far behind with $14.2 million from 3,682 venues, dropping 57% from its opening weekend. A first-place finish for “GOAT” over the starry gothic romantic drama, featuring A-listers Margot Robbie and Jacob Elordi, underscores the importance of family films for cinema operators at a time when the box office hasn’t yet regained its pre-pandemic strength. In 2025, PG offerings like “Lilo & Stitch,” “Zootopia 2” and “A Minecraft Movie” showed impressive endurance and ranked among the year’s highest-grossing releases.\n\t\n\n\tSo far, “GOAT” has earned $58.3 million domestically. Since “GOAT” carries an $80 million production budget, Sony Pictures Animation is hoping the kid-friendly film enjoys a similar endurance to recent original animated films like “Elemental,” “The Wild Robot” and “Migration,” all of which managed to stick around in theaters for weeks after their debuts.\n\n\n\t“Wuthering Heights” has generated $59.5 million in North America. Director Emerald Fennel’s adaptation has been a bigger draw overseas with $91.7 million for a global tally of $151.7 million. Warner Bros. spent $80 million to produce “Wuthering Heights,” not including the tens of millions for the global promotional tour.\n\t\n\n\tThose films towered over three newcomers, including Lionsgate’s faith-based “I Can Only Imagine 2,” Disney’s road-trip thriller “Psycho Killer” and A24’s black comedy “How to Make a Killing” with Glen Powell. \n\n\t“I Can Only Imagine 2” captured the No. 3 spot with $8 million from 3,105 venues. Those ticket sales are dramatically behind its predecessor, 2018’s surprise hit “I Can Only Imagine,” which ignited to $17 million in North America. And although the sequel was twice as expensive at $18 million, it’s still a modest price tag that won’t be difficult for the studio to recoup during its big-screen run. Plus, audiences awarded the film, a sequel to the story about the musical artist who wrote the best-selling Christian song of all time, a rare “A+” grade on CinemaScore exit polls. The original movie, which also scored an “A+” grade, became a breakout for Lionsgate with $86 million worldwide against a $7 million budget.\n\n\t“How to Make a Killing” debuted outside the top five — in sixth place with $3.5 million — however, the R-rated comedic thriller is playing on just 1,600 screens. Directed by John Patton Ford (“Emily the Criminal”), the film stars Powell as a man who is disowned at birth by his obscenely wealthy family and will stop at nothing to reclaim his $28 billion inheritance. There’s no audience score, but critics did not like “How to Make a Killing,” which holds a 47% on Rotten Tomatoes.\n\n\tAt No. 11, “Psycho Killer” cratered with $1.6 million from 1,100 theaters in its first weekend of release. The film, which hails from Disney’s 20th Century and New Regency labels, landed behind “Avatar: Fire and Ash,” which earned $1.7 million in its 10th weekend on the big screen. “Psycho Killer,” which doesn’t have an audience score either but was saddled with a 33% Rotten Tomatoes average, cost under $10 million to produce. Directed by Gavin Polone in his feature debut, the movie follows a police officer (Georgina Campbell) on her mission to take down the serial killer known as the Satanic Slasher after he brutally murdered her state trooper husband.\n\n\tNeon’s concert film “EPiC: Elvis Presley in Concert” debuted well above “Psycho Killer,” in seventh place with $3.2 million, during its limited release on 325 Imax screens. Director Baz Luhrmann crafted the film from never-before-seen footage of the King of Rock and Roll that he discovered while making the 2022 Austin Butler-led “Elvis” biopic. “EPiC,” which will expand in the coming weeks, is the only film in the top 10 that’s playing on less than 1,000 screens.\n\t\n\n\t“We’re excited to see audiences connecting with ‘EPiC.’ It’s a powerful testament to the enduring impact of the King,” said Neon’s chief distribution officer Elissa Federoff. She pointed to the studio’s partners, including Sony Music Vision and Imax, who “helped deliver something deeply personal and undeniably cinematic — Elvis at his best, on the biggest screens possible.”\n\n\tMore to come…\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Box Office: ‘GOAT’ Unseats ‘Wuthering Heights’ After Close Race for No. 1 in Glacial Weekend",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/MV5BZGZkMTYyNmUtNDMwMi00NzBiLTk5OGItYjc0NWM5NWQ4M2M2XkEyXkFqcGdeQWFybm8@._V1_.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-22T16:04:48.000Z",
      "dateModified": "2026-02-22T16:04:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘A Child of My Own’ Review: Stylized Drama and Documentary Scrap Over the Truth In an Unhappy Maternity Tale",
    "url": "https://variety.com/2026/film/news/a-child-of-my-own-review-1236669438/",
    "image": "https://variety.com/wp-content/uploads/2026/02/MaiteAlberdi.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-22T11:35:05.000Z",
    "description": "\n\tFollowing an awkward transition into narrative filmmaking with 2024’s fact-inspired but melodrama-leaning “In Her Place,” “A Child of My Own” sees C",
    "body": "\n\tFollowing an awkward transition into narrative filmmaking with 2024’s fact-inspired but melodrama-leaning “In Her Place,” “A Child of My Own” sees Chilean director Maite Alberdi returning to documentary cinema — albeit of the same fuzzily defined, playfully genre-infused variety that scored her an Oscar nomination for “The Mole Agent.” Based on the case of a Mexican nurse incarcerated for abducting another woman’s baby from the hospital where she worked, the film devotes much of its running time to a bright, stylized dramatization of events from the perpetrator’s perspective, casting her actions in a very different light from how they appear in cold black and white. Once documentary framing takes over in the film’s second half, so do manifold uncertainties and ambiguities.\n\t\n\n\tHumanizing a tale that was sordid tabloid fodder in Mexico for a short time, the film’s compassionate approach comes as no surprise from Alberdi — a delicate, feeling-forward documentarian who also scored a second Oscar nod for her lyrical Alzheimer’s study “The Eternal Memory.” But something in her candy-hued, semi-comic foregrounding of her protagonist’s account rankles in “A Child of My Own,” which presents the stark legal facts of the case as a kind of twist, with the audience given only limited access to modifying perspectives. As the film works toward a concluding note of uplift that brings as many questions as answers, one wonders if a straighter documentary telling would be more rewarding.\n\n\n\tAfter “In Her Place” was released worldwide by Netflix, “A Child of My Own” continues Alberdi’s relationship with the streamer — an association that seems almost like an ironic in-joke given how the film plays on a practically patented Netflix true-crime format, with carefully staggered talking heads giving way to slick reconstructions. Here, however, the dramatizations are so glossy — relentlessy color-coded in bubblegum hues by DP Sergio Armstrong and production designer Estefania Larran de la Cerda — as to tilt away from realism entirely, and into the possibly fantasist headspace of protagonist Alejandra, appearing as her middle-aged self in interviews and played as a young woman by the appealingly wide-eyed Ana Celeste.\n\t\n\n\tWhen she’s married at just 17 to the oafish but loving Arturo (Armando Espitia) — we see both grainy real-life video footage and a rose-tinted replica of their first dance to “Unchained Melody” — Alejandra is already beamingly pregnant, though she’s soon jolted by a miscarriage that turns out to be the first of three. The third time, she can no longer face the disappointment of her husband or the reproaches of her in-laws, who make no bones about their belief that a childless wife is an invalid one. By then working as a hospital nurse, she strikes up a chance connection in the waiting room with Mayra, a young, unhappily pregnant woman with no desire to keep her baby, and has a brainwave: She can secretly take Mayra’s child as her own once it is delivered, maintaining the illusion of her pregnancy until then. And so the women make a deal.\n\n\tOr do they? The plan is so riddled with flaws — played very nearly for farce in some scenes, as when Alejandra somehow fakes her way through an ultrasound scan — that viewers may wonder if it’s entirely fictional,. Yet the film’s documentary components prove that she did indeed convince everyone of her pregnancy until the day of Mayra’s delivery, where everything went woefully wrong. From this point, conflicting narratives cut harshly into the story as played thus far, though the real-life Alejandra insists to this day on the truth of her far-fetched testimony. She’s a sympathetic figure in either event, and the film’s heart sticks with her even as her perspective is undermined. Some of the strongest footage here shows her everyday life and sisterly relationships built in the prison where she was confined for 14 years after the whole unfortunate affair.\n\n\tStill, it’s hard not to feel that other, equally compelling points of view — not least that of Mayra’s real-life counterpart — are given shorter shrift in “A Child of My Own,” in part to maintain the film’s poignant mystery and its investment in Alejandra as a tragic naif. The film’s final passage, however, is affecting as the real-life Arturo admits his own sense of emotional culpability — if not legal complicity — in Alejandra’s crime, as he retracts his younger self’s cruel, heedless statement that he couldn’t love an adopted child. The wound at the heart of their relationship reaches a roundabout sort of closure in the film’s coda, though as with much in “A Child of My Own,” one senses untold narratives beneath the surface.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘A Child of My Own’ Review: Stylized Drama and Documentary Scrap Over the Truth In an Unhappy Maternity Tale",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/MaiteAlberdi.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-22T11:35:05.000Z",
      "dateModified": "2026-02-22T11:35:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "BAFTA Film Awards 2026 Winners List (Updating Live)",
    "url": "https://variety.com/lists/bafta-film-awards-2026-winners-list/",
    "image": "https://variety.com/wp-content/uploads/2025/12/Alan-Cumming-BAFTA.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-22T12:00:00.000Z",
    "description": "\n\t\n\t\t\t\n\t\t\t\t\n\t\n\n\t\n\tFeb 22, 2026 4:00am PT\t\n\t\n\n\t\n\t\tBAFTA Film Awards 2026 Winners List (Updating Live)\n\t\n\t\n\t\t\t\n\n\n\t\t\t\n\t\t\t\n\t\n\n\t\t\t\t\t\t\t\t\tBAFTA/Charlie Clift",
    "body": "\n\t\n\t\t\t\n\t\t\t\t\n\t\n\n\t\n\tFeb 22, 2026 4:00am PT\t\n\t\n\n\t\n\t\tBAFTA Film Awards 2026 Winners List (Updating Live)\n\t\n\t\n\t\t\t\n\n\n\t\t\t\n\t\t\t\n\t\n\n\t\t\t\t\t\t\t\t\tBAFTA/Charlie Clift\n\t\n\n\t\t\n\t\n\t\t\t\t\n\n\tThe 79th BAFTA Film Awards ceremony is here.\n\n\tThe biggest night for movies in the U.K. — and one of the biggest globally — is set to kick off at the Royal Festival Hall at London’s Southbank Centre, where the winners of some of the most coveted prizes in the industry will soon be unveiled.\n\n\tHosted by “The Traitors” favorite Alan Cumming, this year’s awards seems to be more of an open field than previous editions, without a clear juggernaut expected to sweep the board.\n\n\tPaul Thomas Anderson’s “One Battle After Another” leads the pack with 14 nominations — just short of the record of 16 set by “Gandhi” — closely followed by Ryan Coogler’s “Sinners” with 13. But just behind, both Chloé Zhao’s “Hamnet” and Josh Safdie’s “Marty Supreme” have 11. Several pundits are suggesting it could be a three-way race between “One Battle,” “Sinners” and “Hamnet” for the top best film award.\n\n\tBut even before the awards have been handed out, this year’s BAFTAs has already broken records. “Hamnet” is the most nominated film from a female director, while “Sinners is the most nominated film from a Black director. Meanwhile, Leonardo DiCaprio has become the youngest star to reach a record-equalling seven leading actor nominations, having done so at the age of 51.\n\n\tAside from the awards, the BAFTA ceremony will also include a performance of the chart-topping “Golden” from Netflix’s smash-hit animation “Kpop Demon Hunters,” sung by Jae, Audrey Nuna and Rei Ami.\n\n\tSee the 2026 BAFTA Film Award winners below, as they’re announced.\n\n\n\t\t\t\n\t\t\t\n\tBest Film\n\t\t\t\t\n\n\t“Hamnet” — Liza Marshall, Pippa Harris, Nicolas Gonda, Steven Spielberg, Sam Mendes \n\n\t“Marty Supreme” — Timothée Chalamet, Anthony Katagas, Eli Bush, Ronald Bronstein, Josh Safdie \n\n\t“One Battle After Another” — Adam Somner, Sara Murphy, Paul Thomas Anderson \n\n\t“Sentimental Value” — Maria Ekerhovd, Andrea Berentsen Ottmar \n\n\t“Sinners” — Zinzi Coogler, Sev Ohanian, Ryan Coogler \n\n\t\t\n\t\t\t\n\t\t\t\n\tBest Director\n\t\t\t\t\n\n\tYorgos Lanthimos, “Bugonia”\n\n\tChloé Zhao, “Hamnet”\n\n\tJosh Safdie, “Marty Supreme”\n\n\tPaul Thomas Anderson, “One Battle After Another”\n\n\tJoachim Trier, “Sentimental Value”\n\n\tRyan Coogler, “Sinners”\n\n\t\t\n\t\t\t\n\t\t\t\n\tLeading Actress\n\t\t\t\t\n\n\tJessie Buckley, “Hamnet” \n\n\tRose Byrne, “If I Had Legs I’d Kick You” \n\n\tKate Hudson, “Song Sung Blue” \n\n\tChase Infiniti, “One Battle After Another” \n\n\tRenate Reinsve, “Sentimental Value” \n\n\tEmma Stone, “Bugonia” \n\n\t\t\n\t\t\t\n\t\t\t\n\tLeading Actor\n\t\t\t\t\n\n\tRobert Aramayo, “I Swear” \n\n\tTimothée Chalamet, “Marty Supreme” \n\n\tLeonardo DiCaprio, “One Battle After Another” \n\n\tEthan Hawke, “Blue Moon” \n\n\tMichael B. Jordan, “Sinners” \n\n\tJesse Plemons, “Bugonia” \n\n\t\t\n\t\t\t\n\t\t\t\n\tSupporting Actress\n\t\t\t\t\n\n\tOdessa A’zion, “Marty Supreme” \n\n\tInga Ibsdotter Lilleaas, “Sentimental Value” \n\n\tWunmi Mosaku, “Sinners” \n\n\tCarey Mulligan, “The Ballad of Wallis Island” \n\n\tTeyana Taylor, “One Battle After Another” \n\n\tEmily Watson, “Hamnet” \n\n\t\t\n\t\t\t\n\t\t\t\n\tSupporting Actor\n\t\t\t\t\n\n\tBenicio del Toro, “One Battle After Another” \n\n\tJacob Elordi, “Frankenstein” \n\n\tPaul Mescal, “Hamnet” \n\n\tPeter Mullan, “I Swear” \n\n\tSean Penn, “One Battle After Another” \n\n\tStellan Skarsgård, “Sentimental Value”\n\n\t\t\n\t\t\t\n\t\t\t\n\tOutstanding British Film\n\t\t\t\t\n\n\t“28 Years Later” — Danny Boyle, Andrew Macdonald, Peter Rice, Bernard Bellew, Alex Garland \n\n\t“The Ballad of Wallis Island” — James Griffiths, Rupert Majendie, Tom Basden, Tim Key  \n\n\t“Bridget Jones: Mad About the Boy” — Michael Morris, Tim Bevan, Eric Fellner, Jo Wallett, Helen Fielding, Dan Mazer, Abi Morgan \n\n\t“Die My Love” — Lynne Ramsay, Martin Scorsese, Jennifer Lawrence, Justine Ciarrocchi, Andrea Calderwood, Enda Walsh, Alice Birch \n\n\t“H Is for Hawk” — Philippa Lowthorpe, Dede Gardner, Jeremy Kleiner, Emma Donoghue \n\n\t“Hamnet” — Chloé Zhao, Liza Marshall, Pippa Harris, Nicolas Gonda, Steven Speilberg, Sam Mendes, Maggie O’Farrell \n\n\t“I Swear” — Kirk Jones, Georgia Bayliff, Piers Tempest \n\n\t“Mr. Burton” — Marc Evans, Ed Talfan, Josh Hyams, Hannah Thomas, Trevor Matthews, Tom Bullough \n\n\t“Pillion” — Harry Lighton, Emma Norton, Lee Groombridge, Ed Guiney, Andrew Lowe \n\n\t“Steve” — Tim Mielants, Alan Moloney, Cillian Murphy, Max Porter \n\n\t\t\n\t\t\t\n\t\t\t\n\tOutstanding Debut by a British Writer, Director or Producer\n\t\t\t\t\n\n\t“The Ceremony” — Jack King (Director, Writer), Hollie Bryan (Producer), Lucy Meer (Producer) \n\n\t“My Father’s Shadow” — Akinola Davies Jr. (Director), Wale Davies (Writer) \n\n\t“Pillion” — Harry Lighton (Director, Writer)  \n\n\t“A Want in Her” — Myrid Carten (Director) \n\n\t“Wasteman” — Cal McMau (Director), Hunter Andrews (Writer), Eoin Doran (Writer) \n\n\t\t\n\t\t\t\n\t\t\t\n\tAdapted Screenplay\n\t\t\t\t\n\n\t“The Ballad of Wallis Island,” Tom Basden and Tim Key \n\n\t“Bugonia,” Will Tracy \n\n\t“Hamnet,” Chloé Zhao and Maggie O’Farrell \n\n\t“One Battle After Another,” Paul Thomas Anderson \n\n\t“Pillion,” Harry Lighton \n\n\t\t\n\t\t\t\n\t\t\t\n\tOriginal Screenplay\n\t\t\t\t\n\n\t“I Swear,” Kirk Jones \n\n\t“Marty Supreme,” Ronald Bronstein, Josh Safdie \n\n\t“The Secret Agent,” Kleber Mendonça Filho  \n\n\t“Sentimental Value,” Eskil Vogt and Joachim Trier \n\n\t“Sinners,” Ryan Coogler\n\n\t\t\n\t\t\t\n\t\t\t\n\tChildren’s & Family Film\n\t\t\t\t\n\n\t“Arco” — Ugo Bienvenu, Félix De Givry, Sophie Mas, Natalie Portman \n\n\t“Boong” — Lakshmipriya Devi, Ritesh Sidhwani \n\n\t“Lilo & Stitch” — Dean Fleischer Camp, Jonathan Eirich \n\n\t“Zootropolis 2” — Jared Bush, Byron Howard, Yvett Merino \n\n\t\t\n\t\t\t\n\t\t\t\n\tFilm Not in the English Language\n\t\t\t\t\n\n\t“It Was Just an Accident” — Jafar Panahi, Philippe Martin  \n\n\t“The Secret Agent” — Kleber Mendonça Filho, Emilie Lesclaux \n\n\t“Sentimental Value” — Joachim Trier, Maria Ekerhovd, Andrea Berentsen Ottmar \n\n\t“Sirât” — Oliver Laxe, Domingo Corral \n\n\t“The Voice of Hind Rajab” — Kaouther Ben Hania, Nadim Cheikhrouha \n\n\t\t\n\t\t\t\n\t\t\t\n\tCostume Design\n\t\t\t\t\n\n\t“Frankenstein,” Kate Hawley \n\n\t“Hamnet,” Malgosia Turzanska \n\n\t“Marty Supreme,” Miyako Bellizzi \n\n\t“Sinners,” Ruth E. Carter \n\n\t“Wicked: For Good,” Paul Tazewell \n\n\t\t\n\t\t\t\n\t\t\t\n\tSpecial Visual Effects\n\t\t\t\t\n\n\t“Avatar: Fire and Ash” — Joe Letteri, Richard Baneham, Daniel Barrett, Eric Saindon  \n\n\t“F1” — Ryan Tudhope, Keith Alfred Dawson, Nicolas Chevallier, Robert Harrington \n\n\t“Frankenstein” — Dennis Berardi, Ayo Burgess, Ivan Busquets, José Granell \n\n\t“How to Train Your Dragon” — Christian Mänz, Francois Lambert, Glen McIntosh, Terry Palmer \n\n\t“The Lost Bus” — Charlie Noble, Brandon K. McLaughlin, David Zaretti \n\n\t\t\n\t\t\t\n\t\t\t\n\tDocumentary\n\t\t\t\t\n\n\t“2,000 Meters to Andriivka” — Mstyslav Chernov, Michelle Mizner, Raney Aronson-Rath \n\n\t“Apocalypse in the Tropics” — Petra Costa, Alessandra Orofino \n\n\t“Cover-Up” — Laura Poitras, Mark Obenhaus, Olivia Streisand, Yoni Golijev \n\n\t“Mr. Nobody Against Putin” — David Borenstein, Helle Faber, Radovan Síbrt, Alžběta Karásková \n\n\t“The Perfect Neighbor” — Geeta Gandbhir, Alisa Payne, Nikon Kwantu, Sam Bisbee\n\n\t\t\n\t\t\t\n\t\t\t\n\tAnimated Film\n\t\t\t\t\n\n\t“Elio” — Madeline Sharafian, Domee Shi, Adrian Molina, Mary Alice Drumm \n\n\t“Little Amélie” — Mailys Vallade, Liane-Cho Han, Nidia Santiago, Edwina Liard, Claire Le Combe, Henri Magalon \n\n\t“Zootropolis 2” — Jared Bush, Byron Howard, Yvett Merino \n\n\t\t\n\t\t\t\n\t\t\t\n\tCasting\n\t\t\t\t\n\n\t“I Swear,” Lauren Evans \n\n\t“Marty Supreme,” Jennifer Venditti \n\n\t“One Battle After Another,” Cassandra Kulukundis \n\n\t“Sentimental Value,” Yngvill Kolset Haga and Avy Kaufman \n\n\t“Sinners,” Francine Maisler \n\n\t\t\n\t\t\t\n\t\t\t\n\tCinematography\n\t\t\t\t\n\n\t“Frankenstein,” Dan Laustsen \n\n\t“Marty Supreme,” Darius Khondji \n\n\t“One Battle After Another,” Michael Bauman \n\n\t“Sinners,” Autumn Durald Arkapaw \n\n\t“Train Dreams,” Adolpho Veloso \n\n\t\t\n\t\t\t\n\t\t\t\n\tEditing\n\t\t\t\t\n\n\t“F1,” Stephen Mirrione \n\n\t“A House of Dynamite,” Kirk Baxter \n\n\t“Marty Supreme,” Ronald Bronstein and Josh Safdie \n\n\t“One Battle After Another,” Andy Jurgensen \n\n\t“Sinners,” Michael P. Shawver \n\n\t\t\n\t\t\t\n\t\t\t\n\tMake-Up & Hair\n\t\t\t\t\n\n\t“Frankenstein” — Jordan Samuel, Cliona Furey, Mike Hill, Megan Many \n\n\t“Hamnet” — Nicole Stafford \n\n\t“Marty Supreme” — Kyra Panchenko, Kay Georgiou, Mike Fontaine \n\n\t“Sinners” — Siân Richards, Shunika Terry, Ken Diaz, Mike Fontaine \n\n\t“Wicked: For Good” — Frances Hannon, Laura Blount, Mark Coulier, Sarah Nuth \n\n\t\t\n\t\t\t\n\t\t\t\n\tOriginal Score\n\t\t\t\t\n\n\t“Bugonia,” Jerskin Fendrix \n\n\t“Frankenstein,” Alexandre Desplat \n\n\t“Hamnet,” Max Richter \n\n\t“One Battle After Another,” Jonny Greenwood \n\n\t“Sinners,” Ludwig Göransson \n\n\t\t\n\t\t\t\n\t\t\t\n\tProduction Design\n\t\t\t\t\n\n\t“Frankenstein,” Tamara Deverell and Shane Vieau \n\n\t“Hamnet,” Fiona Crombie and Alice Felton \n\n\t“Marty Supreme,” Jack Fisk and Adam Willis  \n\n\t“One Battle After Another,” Florencia Martin and Anthony Carlino \n\n\t“Sinners,” Hannah Beachler and Monique Champagne \n\n\t\t\n\t\t\t\n\t\t\t\n\tSound\n\t\t\t\t\n\n\t“F1” — Gareth John, Al Nelson, Gwendolyn Yates Whittle, Gary A. Rizzo, Juan Peralta \n\n\t“Frankenstein” — Greg Chapman, Nathan Robitallie, Nelson Ferreira, Christian Cooke, Brad Zoem \n\n\t“One Battle Afte Another” — Jose Antonio Garcia, Christopher Scarabosio, Tony Villaflor \n\n\t“Sinners” — Chris Welcker, Benny Burtt, Brandon Proctor, Steve Boeddeker, Felipe Pacheco  \n\n\t“Warfare” — Mitch Low, Ben Barker, Howard Bargroff, Richard Spooner, Glenn Freemantle \n\n\t\t\n\t\t\t\n\t\t\t\n\tBritish Short Animation\n\t\t\t\t\n\n\t“Cardboard” — J.P. Vine, Michaela Manas Malina \n\n\t“Solstice” — Luke Angus \n\n\t“Two Black Boys in Paradise” — Baz Sells, Dean Atta, Ben Jackson  \n\n\t\t\n\t\t\t\n\t\t\t\n\tBritish Short Film\n\t\t\t\t\n\n\t“Magid/Zafar” — Luis Hindman, Sufiyaan Salam, Aidan Robert Brooks \n\n\t“Nostalgie” — Kathryn Ferguson, Stacey Gregg, Marc Robinson, Kath Mattock \n\n\t“Terence” — Edem Kelman, Noah Reich \n\n\t“This Is Endometriosis” — Georgie Wileman, Matt Houghton, Harriette Wright \n\n\t“Welcome Home Freckles” — Huiju Park, Nathan Hendren \n\n\t\t\n\t\t\t\n\t\t\t\n\tEE Rising Star Award (voted on by the public)\n\t\t\t\t\n\n\tRobert Aramayo \n\n\tMiles Caton  \n\n\tChase Infiniti  \n\n\tArchie Madekwe \n\n\tPosy Sterling \n\n\t\t\n\t\n\t\n\n\n\t\n\t\tMore from Variety\n\t\n\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\n\n\t\t\n\n\t\n\t\tMore From Our Brands\n\t\n\t\n\t\t\n\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\n\tRolling Stone\n\n\t\t\t\t\tMumford and Sons Stomp Along Sensitively on ‘Prizefighter’\t\t\n\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\n\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\n\tRobb Report\n\n\t\t\t\t\tHow to Make a Gin-Gin Mule, the Ginger-Lime Cocktail That Helped People Fall in Love With Gin Again\t\t\n\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\n\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\n\tSportico\n\n\t\t\t\t\tU.S.-Canada Title Rematch Sets Table for NHL-Owned World Cup\t\t\n\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\n\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\n\tWWD\n\n\t\t\t\t\tHow to Watch the 2026 Winter Olympics Closing Ceremony Online Without Cable\t\t\n\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\n\t\t\n\t\n\t\n\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "BAFTA Film Awards 2026 Winners List (Updating Live)",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/Alan-Cumming-BAFTA.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-22T12:00:00.000Z",
      "dateModified": "2026-02-22T12:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Guess This Famous Horror Director!",
    "url": "https://www.tmz.com/2026/02/21/guess-who-horror-director/",
    "image": "https://imagez.tmz.com/image/e9/16by9/2026/02/18/e9f331aaf7cb49008805a06466fbfc52_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-22T00:00:38.000Z",
    "description": "\n    \n                    \n                          Guess Who\n                          This Iconic Horror Director Is!!!\n                      \n    ",
    "body": "\n    \n                    \n                          Guess Who\n                          This Iconic Horror Director Is!!!\n                      \n                  \n                                                                        Published \n                              February 21, 2026\n                            4:00 PM PST\n                                                                            \n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          This famous horror director once made audiences bust up laughing ... then switched genres to fill movie-goers with anxiety!\n      \n    \n          This guy broke into the horror scene in 2017 and ended up with an Oscar for best original screenplay ... on his first try!\n      \n    \n          We caught up with him back in 2019 ... and he was all smiles when talking about how exciting it was to watch his follow up film with fellow fright fans ... Can you guess who it is?!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Jordan Peele\n              \n                          \n                Movie Stars\n              \n                          \n                Movies\n              \n                          \n                Guess Who\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Guess This Famous Horror Director!",
      "image": [
        "https://imagez.tmz.com/image/e9/16by9/2026/02/18/e9f331aaf7cb49008805a06466fbfc52_xl.jpg"
      ],
      "datePublished": "2026-02-22T00:00:38.000Z",
      "dateModified": "2026-02-22T00:00:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Vikings' WR Rondale Moore Died From Suspected Self-Inflicted Gunshot Wound",
    "url": "https://www.tmz.com/2026/02/22/rondale-moore-vikings-wr-died-suspected-self-inflicted-gunshot/",
    "image": "https://imagez.tmz.com/image/3c/16by9/2026/02/22/3c06b92a45cf42dfab49fe9d83a5d838_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-22T13:46:01.000Z",
    "description": "\n    \n                    \n                          Vikings' Rondale Moore\n                          Died From Suspected Self-Inflicted Gunshot Wound",
    "body": "\n    \n                    \n                          Vikings' Rondale Moore\n                          Died From Suspected Self-Inflicted Gunshot Wound\n                      \n                  \n                                                                        Published \n                              February 22, 2026\n                            5:46 AM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Rondale Moore died from a suspected self-inflicted gunshot wound ... TMZ Sports has confirmed.\n      \n    \n          Chief Todd Bailey of the New Albany, IN Police Department tells TMZ Sports ... the 25-year-old was \"found deceased in the garage of the property of a suspected self-inflicted gunshot wound.\"\n      \n    \n          Bailey says the investigation remains ongoing and, due to its active status, no additional information will be released at this time.\n      \n\n                  \n          \n                          \n                \n                  \n      \n    \n          Moore's death has sent shockwaves through the NFL community. Moore, a former Purdue standout, was drafted in the second round of the 2021 NFL Draft and most recently signed with the Minnesota Vikings.\n      \n    \n          In a statement following news of his passing, the Vikings said they were \"deeply saddened\" and extended condolences to his family, adding, \"We have also been in communication with our players, coaches, and staff, and will make counseling and emotional support resources available to anyone in need.\"\n      \n    \n          Moore was drafted by the Arizona Cardinals with the 49th overall pick in 2021 and played three seasons in Arizona. In 2024, he was traded to Atlanta but did not appear in any games for the Falcons after sustaining an injury during training camp.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Prior to last season, Rondale signed a one-year deal with the Vikings, but again suffered a season-ending injury.\n      \n    \n          As a freshman at Purdue, he won the Paul Hornung Award, given to the most versatile player in the nation, and the Paul Warfield Trophy, awarded to the country’s top receiver. He was also named Big Ten Receiver of the Year and Freshman of the Year.\n      \n    \n          If you or someone you know is struggling or in crisis, help is available. Call or text 988 or chat 988lifeline.org.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Sports\n              \n                          \n                RIP\n              \n                          \n                Weapons & Guns\n              \n                          \n                TMZ Sports\n              \n                          \n                Minnesota Vikings\n              \n                          \n                NFL\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Vikings' WR Rondale Moore Died From Suspected Self-Inflicted Gunshot Wound",
      "image": [
        "https://imagez.tmz.com/image/3c/16by9/2026/02/22/3c06b92a45cf42dfab49fe9d83a5d838_xl.jpg"
      ],
      "datePublished": "2026-02-22T13:46:01.000Z",
      "dateModified": "2026-02-22T13:46:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Corey Feldman Performs 'Jessie's Girl' at Las Vegas Club, on Video",
    "url": "https://www.tmz.com/2026/02/21/corey-feldman-sings-jessies-girl-in-las-vegas/",
    "image": "https://imagez.tmz.com/image/8f/16by9/2026/02/21/8fc7859c844844d78fc7ac598bbacd61_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-22T01:07:43.000Z",
    "description": "\n    \n                    \n                          Corey Feldman\n                          I'm the Emperor of Caesars Palace ...\n                   ",
    "body": "\n    \n                    \n                          Corey Feldman\n                          I'm the Emperor of Caesars Palace ...\n                          Crashes Club, Performs 'Jessie's Girl'\n                      \n                  \n                                                                        Published \n                              February 21, 2026\n                            5:07 PM PST\n                                                                            \n      \n    \n        \n                    \n                  \n      \n    \n          Jessie had better watch it because Corey Feldman's coming for his girl -- the star sang all about it after crashing a show in Las Vegas Friday night!\n      \n    \n          The actor pulled up to Caspian's Rock & Roe, a speakeasy-style rock lounge inside Caesars Palace ... where he jumped onstage and belted out Rick Springfield's hit song \"Jessie's Girl.\"\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Feldman kicks off his appearance by saying he can't believe he got talked into performing ... before calling Springfield a friend and singing his dang heart out.\n      \n\n          At the end, CF jokingly asks for tips ... cradling a bucket with the word painted on the side.\n      \n    \n          Feldman pulled up to the spot with his girlfriend Adrien Skye and Caesars executive Justen Crews before playing with the house band.\n      \n    \n                    \n                          \n                                  \n      \n        \n    \n          Caspian's is a hit spot in Vegas BTW ... Macy Gray has performed in the joint -- while Van Halen star Sammy Hagar christened the venue at its opening.\n      \n    \n          First Rick Springfield, now Corey Feldman ... man, Jessie can't catch a break!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Corey Feldman\n              \n                          \n                Movie Stars\n              \n                          \n                Insane Videos\n              \n                          \n                Exclusive\n              \n                          \n                Music\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Corey Feldman Performs 'Jessie's Girl' at Las Vegas Club, on Video",
      "image": [
        "https://imagez.tmz.com/image/8f/16by9/2026/02/21/8fc7859c844844d78fc7ac598bbacd61_xl.jpg"
      ],
      "datePublished": "2026-02-22T01:07:43.000Z",
      "dateModified": "2026-02-22T01:07:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ex-Prince Andrew Could Be Removed From Line of Royal Succession",
    "url": "https://www.tmz.com/2026/02/22/prince-andrew-possible-removal-royal-succession-line/",
    "image": "https://imagez.tmz.com/image/bf/16by9/2026/02/22/bfcc3d1275ff4a1caabf6297055c4c08_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-22T13:17:40.000Z",
    "description": "\n    \n                    \n                          Former Prince Andrew\n                          Don't Even Think About Being King!!!\n             ",
    "body": "\n    \n                    \n                          Former Prince Andrew\n                          Don't Even Think About Being King!!!\n                      \n                  \n                                                                        Published \n                              February 22, 2026\n                            5:17 AM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          The hits just keep coming for former Prince Andrew … In his latest public shaming, the British government is reportedly considering erasing him from the line of succession to the monarchy after his much-publicized arrest last week.\n      \n    \n          The BBC reports members of Parliament are now mulling bringing forth legislation that -- if passed -- would prevent Andrew Mountbatten-Windsor from ever becoming King ... a position currently held by his older brother, Charles.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Luke Pollard -- the British Defense Minister -- spoke with the BBC, saying the legislation would be the \"right thing to do\" no matter what the outcome is of the police investigation into Andrew.\n      \n\n          As you know, Andrew was arrested Thursday on his 66th birthday at his home in Sandringham, England. British authorities have accused Andrew of suspicion of misconduct in public office, which is tied to his relationship with the late pedophile Jeffrey Epstein. Andrew reportedly shared confidential information with Epstein when he was the United Kingdom’s trade envoy between 2001 and 2011.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Last October, King Charles stripped Andrew of his royal titles and released a statement siding with the authorities after his younger brother was arrested Thursday morning.\n      \n    \n          In 2021, Virginia Giuffre filed a lawsuit against Andrew for allegedly raping her when she was a teenager being sex trafficked by Epstein. Andrew later paid out an undisclosed sum to Guiffre to settle the suit.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                King Charles III\n              \n                          \n                Andrew Mountbatten-Windsor\n              \n                          \n                Jeffrey Epstein\n              \n                          \n                Royal Family\n              \n                          \n                Crime\n              \n                          \n                Epstein Files\n              \n                          \n                News\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ex-Prince Andrew Could Be Removed From Line of Royal Succession",
      "image": [
        "https://imagez.tmz.com/image/bf/16by9/2026/02/22/bfcc3d1275ff4a1caabf6297055c4c08_xl.jpg"
      ],
      "datePublished": "2026-02-22T13:17:40.000Z",
      "dateModified": "2026-02-22T13:17:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Hailey Bieber Donates $20K to Eric Dane's GoFundMe After ALS Death",
    "url": "https://www.tmz.com/2026/02/22/hailey-bieber-donates-eric-dane-gofundme/",
    "image": "https://imagez.tmz.com/image/ce/16by9/2026/02/22/ce7187328961485699232b54a5641f04_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-22T15:45:46.000Z",
    "description": "\n    \n                    \n                          Hailey Bieber\n                          $20K Donation To Eric Dane's GoFundMe As Hollywood Rallie",
    "body": "\n    \n                    \n                          Hailey Bieber\n                          $20K Donation To Eric Dane's GoFundMe As Hollywood Rallies\n                      \n                  \n                                                                        Published \n                              February 22, 2026\n                            7:45 AM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Hollywood continues to rally around Eric Dane's family in a major way following his death and Hailey Bieber just made one of the biggest moves.\n      \n    \n          The model and beauty mogul quietly dropped $20K into a GoFundMe set up to support Dane's loved ones following his death after a battle with ALS.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Hailey isn't the only high-profile name stepping up financially. Gwyneth Paltrow's husband, Brad Falchuk, donated $10K. Madonna's longtime manager Guy Oseary contributed $5K, while Disney president Dana Walden also gave $5K. Producer Randall Emmett, known for his past relationship with Lala Kent, matched Falchuk with a $10K donation.\n      \n\n          Dane died Thursday after fighting the progressive neurodegenerative disease. In a statement released by his family, they said he passed peacefully, surrounded by those closest to him, including his wife Rebecca Gayheart and two daughters, Billie and Georgia.\n      \n    \n          During his battle, Dane became vocal about ALS awareness and research, using his platform to shine a light on the disease and advocate for those facing similar diagnoses.\n      \n    \n          The wave of support underscores just how respected and connected Dane was in the industry. From A-list actors to top executives, friends and colleagues are putting real money behind their condolences -- helping ensure his family feels the love in a tangible way.\n      \n    \n          Dane was 53.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Eric Dane\n              \n                          \n                Hailey Bieber\n              \n                          \n                Madonna\n              \n                          \n                Brad Falchuk\n              \n                          \n                Lala Kent\n              \n                          \n                Gwyneth Paltrow\n              \n                          \n                Rebecca Gayheart\n              \n                          \n                Celebrity News\n              \n                          \n                RIP\n              \n                          \n                Money\n              \n                          \n                Charity\n              \n                          \n                Business\n              \n                          \n                Celebrity Health\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Hailey Bieber Donates $20K to Eric Dane's GoFundMe After ALS Death",
      "image": [
        "https://imagez.tmz.com/image/ce/16by9/2026/02/22/ce7187328961485699232b54a5641f04_xl.jpg"
      ],
      "datePublished": "2026-02-22T15:45:46.000Z",
      "dateModified": "2026-02-22T15:45:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]