[
  {
    "title": "How to Watch the 2026 Puppy Bowl Online Without Cable for Free",
    "url": "https://variety.com/2026/shopping/news/how-to-watch-puppy-bowl-2026-online-free-1235901521/",
    "image": "https://variety.com/wp-content/uploads/2024/02/Puppy-Bowl-Buck-Getty-VR-Featured.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-08T15:01:38.000Z",
    "description": "\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.\n\n\tWith Supe",
    "body": "\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.\n\n\tWith Super Bowl LX at Levi’s Stadium in Santa Clara kicking off later today, there’s counter-programming for those who are fans of cute puppies and football with Puppy Bowl XXII.\n\n\tAlthough the Puppy Bowl is a chance for viewers to watch Team Ruff take on Team Fluff in an adorable battle for gridiron glory, it’s also an adoption event to showcase rescue dogs looking for a new home. In fact, last year’s event drew in nearly 13 million viewers, as it was the highest rated broadcast in Puppy Bowl history. Warner Bros. Discovery, who owns the event, is hoping for more viewers in 2026.\n\n\n\tAiring on Sunday, Feb. 8, Puppy Bowl XXII kickoffs at 2 p.m. ET/11 a.m. PT, while preshow coverage begins at 1 p.m. ET/10 a.m. PT. It broadcasts across cable networks, including Animal Planet, Discovery Channel, TBS and truTV, as it livestreams on HBO Max (via Hulu and Disney+ Bundle).\n\t\n\t\tHow to Watch Puppy Bowl 2026 Online: Livestream Without Cable\t\n\n\tIf you don’t have cable, the best ways to stream online, especially for free, is with DirecTV. Right now, the cable alternative is offering a 5-day free trial, so you can watch the game for free. \n\n\tMeanwhile, the Puppy Bowl is streamable with Sling and Hulu + Live TV — all of which offer Animal Planet, Discovery Channel, TBS and truTV.\n\n\tWant to watch online? Check out the best ways to stream Puppy Bowl XXII, below:\n\n\t\t\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\t\t\t\tDirecTV\n\t\n\t\t\t\t\t\n\t\t\n\n\t\t\t\t\tDirecTV \t\t\n\n\t\n\t\tDirecTV is one of the best ways for cable-cutters to access live TV from home.\t\n\t\t\n\t\n\n\tStarting at $49.99 for the first month of service ($89.99/month afterwards), you get access to the streaming service’s “Entertainment” package for Puppy Bowl XXII on Animal Planet, Discovery Channel, TBS and truTV. It includes NBC, ABC, CBS, ESPN and other networks — more than 90 channels, in total.\n\n\n\t\t\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\t\t\t\tHBO Max\n\t\n\t\t\t\t\t\n\t\t\n\n\t\t\t\t\tHBO Max\t\t\n\n\t\n\t\tThe streaming service starts at $9.99/month for the ad-supported plan\t\n\t\t\n\t\n\n\tWhile HBO Max doesn’t offer a free trial, you can bundle HBO Max with Hulu and Disney+ starting at $16.99/month.\n\n\tAdditionally, you can get HBO Max through Prime Video as a channel add-on starting at $9.99/month. Not an Amazon Prime member? Sign up for a 30-day free trial to take advantage of all that Amazon Prime has to offer, including access to Prime Video and Prime Gaming; fast free shipping in less than two days; in-store discounts at Whole Foods Market, access to exclusive shopping events — like Prime Day and Black Friday — and more.\n\n\tSign up to watch Puppy Bowl XXII online, along with other TV shows, like “Hacks,” and “Curb Your Enthusiasm” and hit movies, like “Barbie,” “Wonka” and “Priscilla.” You can access live sports for pro leagues, like the NHL, MLB and MotoGP, as well as live news from CNN.\n\n\t\t\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\t\t\t\tSling TV\n\t\n\t\t\t\t\t\n\t\t\n\n\t\t\t\t\tSling TV\t\t\n\n\t\n\t\tSling is one of the best options for affordable live streaming \t\n\t\t\n\t\n\n\tThe Sling Orange + Blue package, which includes Discovery Channel, TBS and truTV, goes for $45.99/month. Additionally, you can add Discovery+, which comes with Animal Planet, for an extra $5.99/month. Please note: Pricing and channel availability are subject to your local TV market.\n\n\t\t\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\t\t\t\tHulu\n\t\n\t\t\t\t\t\n\t\t\n\n\t\t\t\t\tHulu + Live TV\t\t\n\n\t\n\t\tPrices start at $89.99/month.\t\n\t\t\n\t\n\n\tFor another great option, check out Hulu + Live TV for live channel streaming Puppy Bowl XXII with access to Animal Planet, Discovery Channel, TBS and truTV. It has more than 95 other channels, as well as access to hit originals on Disney+, Hulu and ESPN Unlimited.\n\n\tThe Puppy Bowl 2026 broadcasts across Animal Planet, Discovery Channel, TBS and truTV, with a start time of 2 p.m. ET/11 a.m. PT. The best ways to watch online without cable is with DirecTV, which is currently offering a 5-day free trial.\n\n\tIn the meantime, watch the Puppy Bowl XXII starting lineup in action, below:\n\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How to Watch the 2026 Puppy Bowl Online Without Cable for Free",
      "image": [
        "https://variety.com/wp-content/uploads/2024/02/Puppy-Bowl-Buck-Getty-VR-Featured.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-08T15:01:38.000Z",
      "dateModified": "2026-02-08T15:01:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Lindsey Vonn Suffers Crash at Winter Olympics and Is Flown Away by Helicopter, Dashing Comeback Hopes",
    "url": "https://variety.com/2026/tv/global/lindsey-vonn-crash-olympics-helicopter-comeback-1236656133/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Lindsay-Vonn.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-08T15:42:14.000Z",
    "description": "\n\tOlympic skier Lindsey Vonn suffered a bad crash in the women’s downhill race on Sunday at the Winter Olympics in Cortina where she was flown away by",
    "body": "\n\tOlympic skier Lindsey Vonn suffered a bad crash in the women’s downhill race on Sunday at the Winter Olympics in Cortina where she was flown away by a helicopter, dashing her highly anticipated hopes of a comeback and possibly ending her storied career. \n\n\tThe 41-year-old U.S. ski legend lost control after cutting the line of the opening traverse too tight. She was seen spinning around in the air and subsequently heard screaming that she wasn’t able to remove her skis. Vonn was immediately surrounded by medical personnel before being strapped to a gurney and flown away by  helicopter. The stunnned crowd watched in silence.\n\t\n\n\tAccording to the Associated Press a mandatory safety air bag inflated under Vonn’s racing suit during the crash, which may have softened her fall. After the crash, Vonn could be heard screaming that she wasn’t able to remove her skis.\n\n\n\tVonn had ruptured the anterior cruciate ligament in her left knee just nine days ago during her final World Cup downhill race Friday in Crans-Montana, Switzerland.\n\n\tThe Women’s Downhill then resumed and was won by U.S. teammate Breezy Johnson, who is the reigning world champion. “I hope it’s not as bad as it looked,” Johnson said about Vonn’s crash.\n\n\t “Sometimes, because you love this course so much, when you crash on it and hurts you like that, it hurts that much worse. My heart just goes out to her,” Johnson added. \n\n\tVonn’s return from retirement has been one of the marquee storylines for the U.S. Olympic team heading into the Games. \n\n\tThe skiing legend initially retired in 2019 after persistent knee injuries but announced her return in 2024, undergoing a partial knee replacement to extend her career. She ranks second all-time in World Cup victories with 84 wins, trailing only fellow American Shiffrin’s record 108.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lindsey Vonn Suffers Crash at Winter Olympics and Is Flown Away by Helicopter, Dashing Comeback Hopes",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Lindsay-Vonn.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-08T15:42:14.000Z",
      "dateModified": "2026-02-08T15:42:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ted Sarandos Isn’t Worried About Trump’s Involvement in Netflix-Warner Bros. Merger, Says President Won’t Be Involved in Any Way That’s ‘Improper’",
    "url": "https://variety.com/2026/film/news/ted-sarandos-trump-netflix-warner-deal-1236655948/",
    "image": "https://variety.com/wp-content/uploads/2026/02/P1040SE5.jpg?crop=0px%2C20px%2C2000px%2C1125px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-02-08T03:14:15.000Z",
    "description": "\n\tOn the red carpet for the DGA Awards Saturday night, Netflix co-CEO Ted Sarandos addressed the proposed Netflix-Warner Bros. merger and President Do",
    "body": "\n\tOn the red carpet for the DGA Awards Saturday night, Netflix co-CEO Ted Sarandos addressed the proposed Netflix-Warner Bros. merger and President Donald Trump’s possible role in the deal. \n\n\tAsked by Variety‘s Marc Malkin if it makes him nervous when the president says he’s watching the deal, Sarandos answered, “Look, I think he has a keen interest in the entertainment business.”\n\n\t“He knows about the entertainment business, and he really does care about the health of the industry, the American industry generally, but I think particularly the entertainment industry,” Sarandos continued. \n\t\n\n\tHowever, Sarandos said on the carpet, “He’s made no indication that he’s going to do anything or be involved in any way that’s improper. This is the DOJ’s deal.”\n\n\n\tTrump, in an interview with NBC News this week, said he will not be personally involved in reviewing the Netflix-WB deal (after previously saying he would be). “I’ve decided I shouldn’t be involved,” Trump told NBC News. “The Justice Department will handle it.”\n\n\tSarandos testified before a Senate subcommittee on Tuesday, and was adamant in his testimony that the deal would be good for consumers.\n\n\t“Maybe, folks don’t quite understand is just how competitive the marketplace is, for where to put your project or where consumers are gonna watch it, and it’s never been more competitive.\n\n\t“It’s a really Wild West landscape right now, and this idea that there’s this concentration risk in our deal is ludicrous when you’ve got one player, YouTube, which is already 15% of TV time and growing.”\n\n\tHe characterized it as “fantasy world” to not consider YouTube as a major TV competitor. “We are 9% of the TV business,” he said, referring to Netflix. “We get HBO and we grow to 10%. That is not an antitrust problem.”\n\t\n\n\tSarandos continues to insist that Netflix intends to preserve a robust theatrical window for Warner Bros. films. “We’re going to nurture Warner Brothers and HBO and Warner Brothers Television and make those great brands even better for the next century,” he told Variety.\n\n\tThe Netflix chief called it “ludicrous” that one senator claimed that 50% of the children’s content on Netflix had “trans ideology.” Netflix has something for everybody, Sarandos said, and viewers can block any content that offends them by title, which he says is unique to the streamer. \n\n\tWhen asked if there was any truth to the idea that the Department of War had an influence on the cancelation of Netflix’s “Boots,” Sarandos said “Absolutely not.”\n\n\t“These are all business decisions based on audience relative to the cost of the show. Do the people who push play watch it to the end? Do they give it a couple of thumbs up? Does it keep growing? All of those,” Sarandos explained.\n\n\t“That’s the best part about the internet, about our business, is that people really love the product and it’s heartbreaking to cancel any show ever, particularly a show that Norman Lear brought to me. It was his last show. I’m a fan,” said Sarandos.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ted Sarandos Isn’t Worried About Trump’s Involvement in Netflix-Warner Bros. Merger, Says President Won’t Be Involved in Any Way That’s ‘Improper’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/P1040SE5.jpg?crop=0px%2C20px%2C2000px%2C1125px&resize=1000%2C563"
      ],
      "datePublished": "2026-02-08T03:14:15.000Z",
      "dateModified": "2026-02-08T03:14:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Box Office: ‘Melania’ Plunges 67% to Ninth Place, ‘Send Help’ Remains No. 1 in Glacial Super Bowl Weekend",
    "url": "https://variety.com/2026/film/box-office/melania-box-office-plunges-send-help-stays-first-slow-super-bowl-1236656120/",
    "image": "https://variety.com/wp-content/uploads/2026/01/MCDSEHE_H3009-e1769610275829.jpg?crop=0px%2C19px%2C1000px%2C562px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-02-08T16:05:22.000Z",
    "description": "\n\tFootball festivities and frigid temperatures around the East Coast kept moviegoers on the couch and contributed to a glacial Super Bowl weekend at t",
    "body": "\n\tFootball festivities and frigid temperatures around the East Coast kept moviegoers on the couch and contributed to a glacial Super Bowl weekend at the box office.\n\n\tWithout any new releases from the major studios, Sam Raimi’s survival thriller “Send Help” remained in first place with $10 million from 3,475 North American venues, a 47% drop from its $19.1 million debut. Meanwhile “Melania,” a documentary about the first lady of the United States, plunged to the No. 9 spot with $2.37 million from 2,003 theaters, representing a steep 67% decline in ticket sales.\n\t\n\n\tThe Super Bowl, the biggest TV event of the year, almost always brings the box office to a halt. This year’s revenues topped out with roughly $60 million, according to Comscore. That’s not the worst Super Bowl haul of all time — that record belongs to 2024’s dismal $38.9 million showing, led by “Argylle” and “Lisa Frankenstein” — but turnout is far behind the pre-pandemic era. Back then, the weekend that coincides with the big game could at least be counted on to bring in $75 million to $85 million across all titles. \n\n\n\t“Send Help” has grossed $35.8 million domestically and $17.9 million overseas, bringing its global total to $53.7 million. Horror films are infamous for major second weekend declines, but the Rachel McAdams and Dylan O’Brien-led movie is benefitting from great word-of-mouth. However the R-rated release cost $40 million to produce, so Disney is counting on the film to stick around on the big screen through the winter.\n\n\t“Melania” has earned $13.35 million domestically after two weekends of release, a notable tally for a documentary that isn’t about nature or music. However, “Melania” cost more than just about any documentary in history. Amazon MGM spent a staggering sum of money, acquiring the film and an accompanying straight-to-streaming docu-series for $40 million and then shelling out $35 million on the theatrical marketing spend. Those are unprecedented costs considering documentaries aren’t traditionally a driver of big box office dollars. (Amazon MGM’s lavish spend has prompted others in the industry to speculate whether the doc is the studio’s attempt to cozy up to the current administration.) Since theater owners keep about half of ticket sales, it’ll be difficult to justify the cost of “Melania.” In an unusual move, though, Amazon MGM released a statement to defend the second weekend results.\n\t\n\n\t“‘Melania’s’ strong theatrical performance is a critical first moment that validates our wholistic distribution strategy, building awareness, engagement, and provides momentum ahead of the film’s eventual debut on Prime Video,” said Amazon MGM’s head of domestic theatrical distribution Kevin Wilson. “Together, theatrical and streaming represent two distinct value creating moments that amplify the film’s overall impact. Audience response is already validating this approach, with exit data showing strong intent to rewatch on Prime Video and meaningful interest in the forthcoming docuseries.”\n\n\tAmazon MGM, a deep-pocketed company that’s newer to exhibition compared to rivals like Disney and Universal, has said the company the theatrical window as an “important first step in […] a long-tail lifecycle.”\n\n\t“That interest is further amplified by the theatrical marketing halo we consistently see drive increased awareness and viewership once films launch on Prime Video, reinforcing long-term value across the movie’s entire lifecycle,” Wilson concluded.\n\n\t“Iron Lung,” a very indie effort from the YouTube creator known as Markiplier, slid to third place with $6.2 million from 2,930 theaters. Although those ticket sales mark a steep 66% decline from its debut, “Iron Lung” reportedly cost $3 million and has exceeded all expectations with $31.2 million to date, so it’s a massive commercial success for Markiplier (whose real name is Mark Fischback). He self-financed and distributed “Iron Lung” in addition to writing, directing and starring in the film. The gory, R-rated adventure is based on a post-apocalyptic 2022 video game about a fugitive who has to scavenge natural resources in an ocean of blood after a rapture. \n\n\tSecond place went to the Angel Studios rom-com “Solo Mio” with $7.2 million from 3,052 venues, on par with expectations. The PG film, which landed an “A-” grade on CinemaScore exit polls and 81% Rotten Tomatoes average, stars Kevin James as a man who goes on his honeymoon alone after getting left at the alter.\n\n\tIn fourth place, the K-pop documentary “Stray Kids: The Dominate Experience” opened to a solid $5.5 million from 1,724 theaters. Bleecker Street is releasing the film, which captures the music group’s world tour and sold-out performance at L.A.’s SoFi Stadium.\n\t\n\n\tDirector Luc Besson’s “Dracula” remake rounded out the top five with $4.5 million from 2,050 theaters. Those ticket sales mark the largest opening weekend to date for newer distributor Vertical, besting the recent debut of January’s “We Bury the Dead” with $2.5 million.\n\n\t“Vertical is thrilled to have landed in the top 5 this weekend for the first time with ‘Dracula,” said  president of theatrical distribution Steve Bunnell. “It is an astounding and romantic cinematic thrill ride arriving just in time for Valentine’s Day.”\n\n\tA final newcomer, Lionsgate’s “The Strangers: Chapter 3” crash-landed at No. 7 with $3.4 million from 2,565 locations.\n\n\tMore to come…\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Box Office: ‘Melania’ Plunges 67% to Ninth Place, ‘Send Help’ Remains No. 1 in Glacial Super Bowl Weekend",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/MCDSEHE_H3009-e1769610275829.jpg?crop=0px%2C19px%2C1000px%2C562px&resize=1000%2C563"
      ],
      "datePublished": "2026-02-08T16:05:22.000Z",
      "dateModified": "2026-02-08T16:05:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Keke Palmer Is Brilliant in Peacock’s Chaotically Fun Horror Comedy ‘The ‘Burbs’: TV Review",
    "url": "https://variety.com/2026/tv/reviews/the-burbs-review-peacock-1236642526/",
    "image": "https://variety.com/wp-content/uploads/2026/01/NUP_207122_00328.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-08T15:30:00.000Z",
    "description": "\n\tInspired by the 1989 film of the same name starring Tom Hanks, Peacock’s latest horror comedy, “The ‘Burbs,” created by Celeste Hughey, is a fun and",
    "body": "\n\tInspired by the 1989 film of the same name starring Tom Hanks, Peacock’s latest horror comedy, “The ‘Burbs,” created by Celeste Hughey, is a fun and terrifying series highlighting secrets, how little we really know our neighbors and the horrors of suburbia. The show follows married couple Samira (an exceptional Keke Palmer) and Rob (Jack Whitehall), who reluctantly leave the city and move to Hinkley Hills with their newborn son, Miles, to take up residence in Rob’s childhood home. Mostly sequestered in the cul-de-sac during her maternity leave, Samira becomes increasingly curious about the creepy, abandoned old Victorian sitting directly across the street. What she uncovers is a two-decades-long secret that forces her to question her new neighborhood and who exactly she’s married to. Dark, hilariously funny and totally bizarre, “The ‘Burbs” is an entertaining blend of genres that keeps viewers guessing until the very end.​“The ‘Burbs” opens in the early evening hours on Ashfield Place. Samira and Rob take a walk, chatting about their fast-paced romance, having Rob’s parents as landlords and how Samira will spend the rest of her maternity leave. However, the couple’s carefree conversation is suddenly interrupted by the loud caws of a murder of crows who have landed on the towering, dilapidated pink Victorian. The Hinkley House, as it’s called, looks comically out of place from the rest of the homes on the picturesque street, and it immediately skeeves Samira out.​Still, Samira, a civil litigation lawyer, is determined to put her best foot forward in her new environment. With Rob and his best friend Naveeen (Kapil Talwalkar) headed to the city for work the next day, she begins carving out a routine for herself through the exhaustion of motherhood and the isolation of her new life which includes folding laundry, explaining the Kendrick Lamar x Drake beef to Miles, taking hot girl night walks and listening to Juvenile’s “Back That Azz Up” on repeat. However, after meeting her new neighbors, the recently widowed Lynn (Julia Duffy), former Marine, Dana (Paul Pell) and oddball Tod (Mark Proksch), Samira realizes that Rob knows much more about the old pink house and what happened to the girl who used to live there than he’s letting on.​Throughout the eight-episode first season, with the trio of new neighbors at her side, Samira puts on her attorney hat. She begins digging through the history of the Hinkley House, Rob’s teen years and why the Victorian’s new owner, Gary (Justin Kirk), has suddenly appeared out of the blue. In addition to Samria and Rob, viewers also get further insight into the inner workings of Hinkley Hills, and its vicious HOA President, Agnes (Danielle Kennedy), who keeps the neighborhood running by wielding a binder full of rules and the threat of her dog Darla’s massive poops on residents’ perfectly manicured lawns.​Episode 4, “A Nine on the Tension Scale,” is especially exciting. Content to focus on her time with her son instead of being so fixated on Hinkley House, Samira tries to enjoy the neighborhood’s annual block party. However, after gathering additional information from unsuspecting neighbors, she quickly realizes she was on the right track with her theories all along, and she’s emboldened to keep digging, desperate to uncover the truth.​“The ‘Burbs’” is brilliantly written, with the racial tension and psychological unease throughout echo the themes presented in Jordan Peele’s Oscar-winning “Get Out.” Not only are all the hodgepodge characters living and puttering around Ashfield Place strange and interesting, but Hughey also grounds Samira’s experience not just as a young mother experiencing the ups and downs of postpartum, but as a Black woman navigating a white space where she is immediately othered. So often, television tries to erase and sugarcoat the experiences of Black people in white-majority environments, but in Hinkley Hills, Samira faces overt racism and microaggressions, creating a level of fear even from her own husband, whom she grows increasingly suspicious of. These nuanced plot choices make for richer storytelling and elevate the horror already permeating throughout the season.​In the end, a lot is happening in “The ‘Burbs.” There are revelations regarding Rob’s past, which he has so carefully kept secret, the mystery of the Hinkley House and even the conundrums that lie hidden just behind those unassuming front doors on the black of Ashfield Place. The show is a series of puzzle pieces bolstered by engaging performances that showcase how far some people are willing to go for the illusion of perfection.\n\t\n\n\tAll eight episodes of “The ‘Burbs” premiere Feb. 8 on Peacock.\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Keke Palmer Is Brilliant in Peacock’s Chaotically Fun Horror Comedy ‘The ‘Burbs’: TV Review",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/NUP_207122_00328.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-08T15:30:00.000Z",
      "dateModified": "2026-02-08T15:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kumail Nanjiani Opens Directors Guild Awards With Jokes About Epstein Files, Long Movies, ‘Sinners’ and D.W. Griffith",
    "url": "https://variety.com/2026/biz/news/kumail-nanjiani-christopher-nolan-directors-guild-awards-1236655887/",
    "image": "https://variety.com/wp-content/uploads/2026/02/GettyImages-2260460445.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-08T03:25:24.000Z",
    "description": "\n\tKumail Nanjiani gently skewered a room full of Hollywood heavyweights in his opening monologue at the Directors Guild Awards, taking aim at the Epst",
    "body": "\n\tKumail Nanjiani gently skewered a room full of Hollywood heavyweights in his opening monologue at the Directors Guild Awards, taking aim at the Epstein files, runaway production, the extended running times of many movies and the fact that the guild’s top award was named in honor of director D.W. Griffith until 1999.\n\n\tHe quipped that the DGA kudos, which are part of a marathon of industry precursor awards events leading up to the March 15 Academy Awards, represents “Hollywood’s biggest night — Excuse me, Vancouver, Budapest and sometimes Atlanta,” he said. Looking out at the ballroom at the Beverly Hilton, with tables packed with directors and their teams of assistant directors and unit production managers, Nanjiani observed, “It’s like if a movie was just the credits.”\n\t\n\n\tNanjiani noted that as a native of Karachi, Pakistan, his gig as host marked a first for the Directors Guild Awards: “You don’t have to know where I’m from to know I’m the first person from there to host this show,” he said.\n\n\n\tNanjiani delivered a 20-minute opening in front of a room that included DGA president Christopher Nolan, Steven Spielberg and DGA nominees Ryan Coogler, Paul Thomas Anderson, Chloe Zhao and Josh Safdie. He closed on a heartfelt note that was then punctuated with a final joke about Griffith, whose 1915 film “The Birth of a Nation” presents an abjectly racist vision of post-Civil War America, with the Klu Klux Klan presented as a heroic organization. \n\n\tNanjiani lauded “the power of filmmaking” and told a story about the first movie he saw in a theater as a kid growing up in Pakistan: Spielberg’s 1993 smash “Jurassic Park.” Nodding to the director, who is a DGA board members, Nanjiani stated, “You made an audience of people on the other side of the world explode with laughter.” He made oblique references to DGA nominees “Sinners,” “The Pitt” and “Marty Supreme.”\n\t\n\n\t“This is why what you all do is so important right now. We are in a moment where people are focused on the differences between us, but your beautiful art reminds us that we have all have much more in common than we don’t,” Nanjiani said. “I can watch your work and know what it feels like to be in a juke joint in the Mississippi Delta or to try to patch up people in an ER in Pittsburgh. You even made me give a shit about ping pong. I’m kidding. I’m Asian. I have always given a shit about ping pong.\n\n\t“In this challenging moment is more important than ever, and I genuinely, sincerely thank you for doing it. You remind us of our shared humanity while also celebrating our differences, because our commonality may make us human, but our differences make us beautiful — and that is what D. W. Griffith represents,” Nanjiani said.\n\n\tAmong Nanjiani’s other zingers: \n\n\t“I’d ask you to keep your speeches short but I’ve seen your movies we all know that’s not going to happen.”\n\n\t“Every bad guy in ‘Sinners’ is a white person, which makes it the most realistic movie of the year. No offense to almost everyone here. No film has so effectively captured the true horror of white people dancing.”\n\n\tNanjiani riffed on the fact that “Sinners” star Michael B. Jordan shares a first and last name with the NBA legend: ” ‘Sinners’ starred Michael B. Jordan and his brother Scottie B. Pippen. For those who don’t know, Michael Jordan was a basketball player, and Scottie Pippen did as much work as he did for a fraction of the praise and money. He was like his first AD.”\n\n\tNanjiani returned his focus to Spielberg when he noted that the filmmaker has made films in the past (2002’s “Minority Report,” 1993’s “Schindler’s List” and 1982’s “ET the Extra-Terrestrial”) that have predicted the tumult and technological and societal disruption of modern times. He also worked in a jab at President Trump, albeit not by name.\n\n\tSpielberg “is not only perhaps the greatest filmmaker of all time, he’s also clairvoyant. He’s made movies about everything we’re talking about right now: AI, Nazis, the government coming after harmless aliens. It’s like you’ve predicted the last 10 years of our lives. Steven, can your next movie be about an 80-year-old on the Epstein list who gets shot into space?”\n\t\n\n\tNolan, the most prominent director brand in Hollywood today, addressed the challenges that Hollywood’s creative community is facing amid the great contraction in film and TV and consolidation among its largest players. Hollywood’s three key creative unions — SAG-AFTRA, Writers Guild of America and DGA — are heading into a new contract negotiation cycle that begins Feb. 9 when SAG-AFTRA sits down with the Alliance of Motion Picture and Television Producers.\n\n\t“In 2024 our employment was down about 40% and that was followed by another decline in 2025,” Nolan said. “The complicated part of this is that we as directors have to talk to our employers, talk to the people who run our business, and really get to grips with that the amount of money that people spend on our work, on entertainment, is very, very steady. Audiences are invested in us. We have to be sure that we are able to repay that investment.”\n\n\tNolan continued, “We are the storytellers. We are the people who have to innovate on the screen. And it’s very, very important that as our industry progresses, new technologies and new forms of distribution come along that we are always sensitive to. How are our voices being put across? How can we get our messages across? How can we engage with that audience and repay that investment that they continue to give us?”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kumail Nanjiani Opens Directors Guild Awards With Jokes About Epstein Files, Long Movies, ‘Sinners’ and D.W. Griffith",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/GettyImages-2260460445.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-08T03:25:24.000Z",
      "dateModified": "2026-02-08T03:25:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Channel 5 Aims for Super Bowl Touch Down in the U.K. as NFL Grows International Audience: ‘Taylor Swift Definitely Has Helped Plant the Seed’",
    "url": "https://variety.com/2026/tv/global/channel-5-super-bowl-nfl-uk-audience-1236651946/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Super-Bowl-UK.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-08T10:38:40.000Z",
    "description": "\n\tLast summer the NFL made a groundbreaking free-to-air broadcast deal with British broadcaster Channel 5 (a subsidiary of Skydance-owned Paramount) w",
    "body": "\n\tLast summer the NFL made a groundbreaking free-to-air broadcast deal with British broadcaster Channel 5 (a subsidiary of Skydance-owned Paramount) with the aim of growing interest in the sport across the pond.\n\n\tHosted by Dermot O’Leary, Sam Quek and Osi Umenyiora and produced by Hungry Bear Media, the first season has seen a typical NFL game interspersed with punditry, quizzes and audience games to appeal to families as well as longtime fans. While the response has been mixed (“the initial reaction from hardcore NFL fans was very much split,” admits Hungry Bear exec producer Luke Shiach) viewers have warmed up as the season has worn on, spurred partly by an understanding that the format needs to be family-friendly to attract U.K. audiences – something Taylor Swift has helped with too, incidentally.\n\t\n\n\tAhead of Channel 5’s “NFL: Big Game Night,” which will broadcast the Super Bowl LX live from San Fancisco from 10.30pm U.K. time on Sunday Feb. 8, Shiach sat down with Variety to talk about what it’s been like to bring the NFL to the U.K., what the team has planned for Sunday and, of course, the Swift effect.\n\n\t\n\t\tWhat has the response been from U.K. viewers so far?\t\n\n\tThe big problem for the NFL gaining traction in the U.K. is it’s very stop-starty with ad breaks built into the actual game mechanics for the U.S. TV market. So across a game, I think it’s like 28 or 30 ad breaks. We don’t have as many ad break requirements on British TV — in fact, we’re not allowed them — so rather than filling those ad breaks with regular punditry, [we thought] what if you kept the audience entertained with a studio game show entertainment format. We piloted it, it went well. [The NFL] loved the craziness of it, the zaniness… and so that’s what we’ve done for the whole season. The initial reaction from hardcore NFL fans was very much split between “Brilliant, we’ve got free games to watch” but they hated the [studio] games — they felt patronized — whereas very, very quickly we got really good feedback from families, parents. Dads who would sneak off and watch it previously on their own were suddenly finding that their kids would watch it. But slowly the NFL chat rooms and Reddit groups became a little bit more positive. And then as we got more towards the business end of the season, we slightly toned down the games and the zaniness and the competitions.\n\t\n\t\n\t\tGiven the play can stop at any point, what is that like from a production perspective?\t\n\n\tDuring the season, it’s been unbelievable. We never know when there’s going to be a break, because it’s dictated by the match. We’re in the gallery listening to the U.S. gallery, because we take the U.S. feed. Often that’s chaos. Sometimes they’re fighting about whether they’re going to a break or staying on the field. We’re following them. We’ve got Dermot on the floor going, “Are we coming to the studio, or are we going to punditry, or are we going to a break? What are we doing?” And we’ll sometimes have no notice, and literally, we’ll say, “Dermot coming to you in 10 seconds and you’ve got a minute to fill,” or “We’ve got a highlight or a replay, let’s talk about that.” And then he’s got stats to get through and guests to bring in and then we’ve got to shut it down and get back to the play before we miss a snap, because we were told if you missed the beginning of a play, people get furious. So it’s been an unbelievable process.\n\t\n\t\tWhat do you have planned for Super Bowl Sunday?\t\n\n\tIf everything goes to plan, it’s going to be amazing. We’re in San Fran at the moment, shooting VTs. We’ve got Sam Quek with us, we had access to the Pro Bowl. The [gameshow] game we’ve played in every episode is called “NFL or…?” NFL players have unbelievable names. Americans have unbelievable names. And we found out that you can play a game called “NFL or…?” anything. So the first one we did was “NFL [player] or rapper?” But what we found out was it was even better when you did “NFL player or British [gas] station?” or “NFL player or Shakespeare character?” or “NFL player or paint color?” So that has become our sort of signature game. And so we played it with these absolute superstars like Dak Prescott and Cameron Dicker and Brandon Aubrey. We did “NFL or Britain?” So Gretna Green, is he an NFL player or a place in Britain?\n\t\n\t\tThe Super Bowl is such a huge cultural moment in the U.S. Do you think you can turn it into something similar for the U.K.?\t\n\n\tListen, I don’t know if we’ll ever get to the American level, because it’s taken 100 years or whatever, but definitely the aspiration is to move it from being a niche cultural event that’s quite interesting to becoming something where people put it in their calendar and go [to a] Super Bowl watch party.\n\t\n\n\tIn terms of trying to grow the British interest, this year we’ve been given a really, really helpful calling card, which is that the defensive coordinator for the Seahawks is a Brit, Adam Durde. We got a sit-down interview with him on Monday with Sam, so that will feature in our run up. He’s such a lovely guy.\n\n\tThe other thing that I think is quite good for a British audience is seeing themselves in the broadcast. So we’ve got the NFL official watch party in Walthamstow […] and we’ll try and drop that in so during a break in play Dermot will go, “What a touchdown! Let’s see how it was celebrated back in London.” So we’ll get a shot of, hopefully, people throwing their beer in the air.\n\t\n\t\tHow helpful has Taylor Swift been in expanding the NFL audience in the U.K.?\t\n\n\tIt’s such a process to try and introduce a new culture to an existing culture and we’ve got so many big sports in the U.K. Taylor Swift definitely has helped plant the seed of NFL, anecdotally. We tried to cotton on to the Taylor Swift effect. We had a Kansas City Chiefs game, so we got a Taylor Swift lookalike booked, and we planted her in a special part of the audience. We had a little allusion to her at the end of the show. We never named her. We just sort of subtly said, “Ooh, a big Travis Kelsey fan.” We hoped we’d get a few Swifties joining us — I don’t know if it worked!\n\n\tThis interview has been edited and condensed for space and clarity.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Channel 5 Aims for Super Bowl Touch Down in the U.K. as NFL Grows International Audience: ‘Taylor Swift Definitely Has Helped Plant the Seed’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Super-Bowl-UK.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-08T10:38:40.000Z",
      "dateModified": "2026-02-08T10:38:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Seth Rogen Pays Tribute to Catherine O’Hara at DGA Awards: Hails ‘Studio’ Co-Star as ‘Utter Genius’ and ‘Nicest Person’",
    "url": "https://variety.com/2026/tv/news/seth-rogen-catherine-ohara-the-studio-directors-guild-1236656056/",
    "image": "https://variety.com/wp-content/uploads/2026/02/GettyImages-2260469575-e1770530974349.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-08T06:40:50.000Z",
    "description": "\n\t“The Studio” team of Seth Rogen and Evan Goldberg took time to pay tribute to their late co-star Catherine O’Hara on Saturday as the pair picked up ",
    "body": "\n\t“The Studio” team of Seth Rogen and Evan Goldberg took time to pay tribute to their late co-star Catherine O’Hara on Saturday as the pair picked up more awards for their Apple TV series “The Studio.”\n\n\tO’Hara died Jan. 30 at the age of 71. On “The Studio,” O’Hara played Patty Leigh, a high-powered executive. Th show skewers in the inner-workings of Hollywood. O’Hara earned an Emmy nomination last year for supporting comedy actress for the show’s freshman season. \n\t\n\n\tWhile accepting the best comedy series kudo at Saturday’s Directors Guild Awards at the Beverly Hilton, Rogen and his longtime writing, directing and producing partner Evan Goldberg reflected on what it meant to have O’Hara take part in their audacious series that was crowned best comedy at the Emmy Awards last September.\n\n\n\tRogen and Goldberg called O’Hara “our idol since we were children.” Both were big fans of her work in the 1990 smash “Home Alone,” and that made for some amusing moments during the filming of Season 1 of “The Studio.” They shared a story about working with her on the set of “The Studio.”\n\n\t” ‘Home Alone’  honestly is like the movie that made me wanna make movies in a lot of ways,” Rogen explained to the starry room. “In that movie she’s always yelling ‘Kevin, Kevin,’ and on set she would always be yelling, ‘Evan, Evan,’ and every time she did it we were like, It’s like ‘Home Alone.’ “\n\n\tO’Hara was a beloved figure in comedy, in part because of her reputation for being a great colleague on  a movie or TV set. Her presence alone made the pair want to make “The Studio” a worthy effort for their esteemed co-star.\n\t\n\n\t“The best part of her is she showed that you can be an utter genius and also the nicest person in the entire world,” Rogen said. “Every day we work very hard to make the show good enough to warrant her time and her presence. So ultimately we would like to thank the DGA for this, but we would mostly like to thank Catherine O’Hara.”\n\n\t(Pictured: ‘The Studio’ creators and exec producers Evan Goldberg and Seth Rogen)\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Seth Rogen Pays Tribute to Catherine O’Hara at DGA Awards: Hails ‘Studio’ Co-Star as ‘Utter Genius’ and ‘Nicest Person’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/GettyImages-2260469575-e1770530974349.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-08T06:40:50.000Z",
      "dateModified": "2026-02-08T06:40:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newsom Declares Super Bowl Sunday to Be ‘Bad Bunny Day’ in California, Trolls Kid Rock for Being ‘Banned’ in State",
    "url": "https://variety.com/2026/music/news/newsom-bad-bunny-day-california-super-bowl-kid-rock-banned-1236656103/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Bad-Bunny-Gavin-Newsom-Kid-Rock.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-08T14:02:15.000Z",
    "description": "\n\tThis year’s Super Bowl halftime show has become a political football — and California Gov. Gavin Newsom is all too happy to pick it up and run with ",
    "body": "\n\tThis year’s Super Bowl halftime show has become a political football — and California Gov. Gavin Newsom is all too happy to pick it up and run with it.\n\n\tNewsom, who is widely expected to run for president in 2028, announced that Sunday, Feb. 8, will be “Bad Bunny Day” in California, praising the singer’s “soothing, beautiful voice” and “his very nice looks.” Newsom also took a shot at Kid Rock, the MAGA-backer who will headline Charlie Kirk’s Turning Point USA rival show during Super Bowl LX’s halftime, needling him after artists have pulled out of Kid Rock’s Rock the Country festival and reprising the running gag that he has been “banned” in the Golden State.\n\t\n\n\t“As many people know, I am a tremendous lover of ‘The Spanish,'” according to a post Saturday by Newsom’s official press office account on X — in all caps, mocking Donald Trump’s famous social media style. Spanish “is a beautiful language spoken by many beautiful people in the great State of California and across the world.”\n\n\n\tNewsom’s post continued, “I am also a huge fan of Puerrrrrrrto Rico,” the U.S. territory where Bad Bunny lives. “That is why I am declaring tomorrow in California as ‘Bad Bunny Day’ when Bad Bunny performs at the big game in the Golden State.”\n\n\tThe post added, “We love Bad Bunny! He is nearly as ‘hot’ as me, which is a big compliment, because there is nobody ‘hotter.’ Happy Bad Bunny Day, America. Enjoy!! — Governor GCN.”\n\n\tThe NFL’s selection of Bad Bunny as this year’s Super Bowl halftime act made many MAGA supporters unhappy, because he sings in Spanish and because he has spoken out against the Trump administration’s brutal ICE immigration crackdown. After the Puerto Rican superstar was announced as the halftime performer, Trump claimed that “I’ve never heard of him” and “I think it’s absolutely ridiculous.”\n\t\n\n\tIn a counterprogramming move, conservative group Turning Point USA is staging “The All-American Halftime Show,” which will be livestreamed online Sunday at the same time Bad Bunny will take the field at Levi’s Stadium in Santa Clara at the Super Bowl. Kid Rock is the headliner of the TPUSA concert.\n\n\tNewsom’s press office, in a separate post Saturday, cited the cancellation of Kid Rock’s Rock the Country performances in South Carolina this summer after Shinedown became the fourth artist to bail on the event. “Kid Rock is banned from California. And now he is being banned in more places,” the governor’s office said. “Terrible music. Why is he so angry?” (Kid Rock is not actually banned from performing in California.)\n\n\tBad Bunny, the most-streamed artist on Spotify globally in 2025, made history at the 2026 Grammys as the first Spanish-language artist to win album of the year for his hit album “Debí Tirar Más Fotos.”\n\n\tIn an interview this past week on Apple Music ahead of the Super Bowl, Bad Bunny said the halftime performance is “going to be a huge party.” \n\n\tThe Latino superstar, when he hosted “Saturday Night Live” in October, had joked that people have “four months to learn Spanish.” This week, he said, “I know that I told them that they had four months to learn Spanish. They don’t even have to learn Spanish. It’s better if they learn to dance. There’s no better dance than the one that comes from the heart, the heartbeat dance, that’s the only thing they need to worry about and enjoy. And of course choose your team at the game.” \n\nAS MANY PEOPLE KNOW, I AM A TREMENDOUS LOVER OF “THE SPANISH.” IT IS A BEAUTIFUL LANGUAGE SPOKEN BY MANY BEAUTIFUL PEOPLE IN THE GREAT STATE OF CALIFORNIA AND ACROSS THE WORLD. I AM ALSO A HUGE FAN OF PUERRRRRRRTO RICO. THAT IS WHY I AM DECLARING TOMORROW IN CALIFORNIA AS “BAD…— Governor Newsom Press Office (@GovPressOffice) February 7, 2026\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newsom Declares Super Bowl Sunday to Be ‘Bad Bunny Day’ in California, Trolls Kid Rock for Being ‘Banned’ in State",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Bad-Bunny-Gavin-Newsom-Kid-Rock.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-08T14:02:15.000Z",
      "dateModified": "2026-02-08T14:02:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Super Bowl Party Photos: Teyana Taylor, François Arnaud, Cardi B and More",
    "url": "https://variety.com/gallery/2026-super-bowl-lx-celebrity-photos/",
    "image": "https://variety.com/wp-content/uploads/2026/02/IMG_0887.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-08T15:04:41.000Z",
    "description": "Hollywood has jetted into San Francisco for Super Bowl LX.\nIn the days and nights leading up to the big showdown between the New England Patriots and ",
    "body": "Hollywood has jetted into San Francisco for Super Bowl LX.\nIn the days and nights leading up to the big showdown between the New England Patriots and the Seattle Seahawks, celebs like Teyana Taylor, Cardi B and “Heated Rivalry”’ star François Arnaud were getting their party on throughout the city.\nCheck out the best photos of Super Bowl-celebrating celebrities below.\n\n\n\n\t\t\t\n\t\t\t\n\tCardi B\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Getty Images\t\t\t\n\t\t\t\n\tCardi B attends the 2026 Fanatics Super Bowl Party.\n\n\t\t\n\t\t\t\n\t\t\t\n\tBad Bunny\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Christopher Polk\t\t\t\n\t\t\t\n\tBad Bunny makes his first appearance in the Bay Area ahead of Super Bowl LX for the Apple Music Halftime Show Press Conference on Feb. 5.\n\n\t\t\n\t\t\t\n\t\t\t\n\tShaquille O’Neal and Tiffany Haddish\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Medium Rare\t\t\t\n\t\t\t\n\tShaquille O’Neal and Tiffany Haddish enjoying Shaq’s Fun House Presented By Credit One Bank on Feb. 6.\n\n\t\t\n\t\t\t\n\t\t\t\n\tAriana Madix\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Josh Brasted/Medium Rare\t\t\t\n\t\t\t\n\tAriana Madix at Shaq’s Fun House Presented By Credit One Bank.\n\n\t\t\n\t\t\t\n\t\t\t\n\tBillie Joe Armstrong\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Getty Images for FanDuel & Spotify\t\t\t\n\t\t\t\n\tBillie Joe Armstrong of Green Day performs onstage during The FanDuel Party Powered by Spotify on Feb. 6.\n\n\t\t\n\t\t\t\n\t\t\t\n\tTyra Banks\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Getty Images for FanDuel & Spotify\t\t\t\n\t\t\t\n\tTyra Banks poses on the blue carpet ahead of The FanDuel Party Powered by Spotify.\n\n\t\t\n\t\t\t\n\t\t\t\n\tFrançois Arnaud and Joshua Hong\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Chad Salvador\t\t\t\n\t\t\t\n\tFrançois Arnaud and Joshua Hong at the GQ Bowl, presenting the Thom Browne Fall 2026 collection on Feb. 6.\n\n\t\t\n\t\t\t\n\t\t\t\n\tQueen Latifah\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Chad Salvador\t\t\t\n\t\t\t\n\tQueen Latifah at the GQ Bowl, presenting the Thom Browne Fall 2026 collection.\n\n\t\t\n\t\t\t\n\t\t\t\n\tTeyana Taylor\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Chad Salvador\t\t\t\n\t\t\t\n\tTeyana Taylor at the GQ Bowl.\n\n\t\t\n\t\t\t\n\t\t\t\n\tCardi B\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Getty & UVT Agency\t\t\t\n\t\t\t\n\tCardi B gets guests “Ready Pa’lShow” with a surprise performance at Tequila Don Julio’s Super Bowl celebration on Feb. 6.\n\n\t\t\n\t\t\t\n\t\t\t\n\tDurand Bernarr\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Christopher Polk\t\t\t\n\t\t\t\n\tDurand Bernarr performs onstage at NFL’s 5th Annual “A Night of Pride with GLAAD” held at the NFL Culture Club on Feb. 06.\n\n\t\t\n\t\t\t\n\t\t\t\n\tBecky G and J Balvin\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Christopher Polk\t\t\t\n\t\t\t\n\tBecky G and J Balvin at the Apple Music Super Bowl Halftime Show Celebration held at Apple Union Square on Feb. 6.\n\n\t\t\n\t\t\t\n\t\t\t\n\tTim Cook and Coco Jones\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Christopher Polk\t\t\t\n\t\t\t\n\tTim Cook and Coco Jones at the Apple Music Super Bowl Halftime Show Celebration.\n\n\t\t\n\t\t\t\n\t\t\t\n\tCharlie Puth, Coco Jones and Brandi Carlile\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Christopher Polk\t\t\t\n\t\t\t\n\tCharlie Puth, Coco Jones and Brandi Carlile at the Super Bowl LX Pregame and Apple Music Halftime Show Press Conference.\n\n\t\t\n\t\t\t\n\t\t\t\n\tMatthew Stafford\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Raising Cane's\t\t\t\n\t\t\t\n\tMatthew Stafford and his family celebrate his MVP Award with Raising Cane’s.\n\n\t\t\n\t\t\t\n\t\t\t\n\tRussell Wilson and Ciara\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Christopher Polk\t\t\t\n\t\t\t\n\tRussell Wilson and Ciara at the 15th Annual NFL Honors held at the Palace of Fine Arts on Feb. 5.\n\n\t\t\n\t\t\t\n\t\t\t\n\tGayle King\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Christopher Polk\t\t\t\n\t\t\t\n\tGayle King at the 15th Annual NFL Honors.\n\n\t\t\n\t\t\t\n\t\t\t\n\tJon Hamm and Anna Osceola\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Christopher Polk\t\t\t\n\t\t\t\n\tJon Hamm and Anna Osceola at the 15th Annual NFL Honors.\n\n\t\t\n\t\t\t\n\t\t\t\n\tFall Out Boy\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Letlove Photography\t\t\t\n\t\t\t\n\tFall Out Boy headline at The Regency Ballroom as a part of Wells Fargo’s Autograph Card Exclusives series.\n\n\t\t\n\t\t\t\n\t\t\t\n\tIlona Maher\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Christopher Polk\t\t\t\n\t\t\t\n\tIlona Maher at the “Tight Ends & Friends” event held at Public Works on Feb. 5.\n\n\t\t\n\t\t\t\n\t\t\t\n\tAdam Devine\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Christopher Polk\t\t\t\n\t\t\t\n\tAdam Devine poses at the “Tight Ends & Friends” event.\n\n\t\t\n\t\t\t\n\t\t\t\n\tJason Kelce and Travis Kelce\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Getty Images\t\t\t\n\t\t\t\n\tJason Kelce and Travis Kelce attend The New Heights Party with Jason & Travis Kelce at the Thriller Country Club.\n\n\t\t\n\t\t\t\n\t\t\t\n\tOctavia Spencer and Jacob Hester\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Getty Images for SiriusXM\t\t\t\n\t\t\t\n\tOctavia Spencer visits with Jacob Hester at SiriusXM on Radio Row at Super Bowl LX.\n\n\t\t\n\t\t\t\n\t\t\t\n\tJimmy Butler\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Yuxi Liu/BACARDÍ\t\t\t\n\t\t\t\n\tJimmy Butler and his coffee brand BIGFACE, alongside BACARDÍ Rum, bring the first-ever San Francisco Rum Room Domino Club to Starlite in the Bay Area.\n\n\t\t\n\t\n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Super Bowl Party Photos: Teyana Taylor, François Arnaud, Cardi B and More",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/IMG_0887.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-08T15:04:41.000Z",
      "dateModified": "2026-02-08T15:04:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Travis Scott Pulverizes Sign on Video During Pre-Super Bowl Performance",
    "url": "https://www.tmz.com/2026/02/08/travis-scott-pulverizes-sign-pre-super-bowl-performance/",
    "image": "https://imagez.tmz.com/image/ca/16by9/2026/02/08/ca2f3ae7bb2f4cf794a8882d685a4961_xl.png",
    "tag": "Entertainment",
    "date": "2026-02-08T14:26:56.000Z",
    "description": "\n                    \n                          Travis Scott\n                          Beats The Crap Out Of A Sign During Pre-Super Bowl Show\n       ",
    "body": "\n                    \n                          Travis Scott\n                          Beats The Crap Out Of A Sign During Pre-Super Bowl Show\n                      \n                  \n                                                                        Published \n                              February 8, 2026\n                            6:26 AM PST\n                                                                      |\n                                                                Updated \n                                  February 8, 2026\n                                7:17 AM PST\n                                    \n              \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          Travis Scott blew off some major steam during his Saturday night performance at the Fanatics Super Bowl Party, destroying a sign with his very own fist!\n      \n    \n          Check out video, obtained by TMZ ... the rapper is getting all hyped up as he drops bars during his show on Pier 48 near Oracle Park in San Francisco.\n      \n    \n          Then, all of a sudden, Travis goes berserk, turning to the Fanatics sign on a wall behind him and smashing the hell out of the letter \"N\" until it falls to the floor. Then Travis goes to town on the letter \"A\" ... Watch the full clip to see if that piece of signage can withstand his powerful blows.\n      \n    \n          Meanwhile, a slew of other A-listers also attended Fanatics CEO Michael Rubin's soiree, namely Cardi B, Tom Brady, Justin and Hailey Bieber, Ice Spice, Kim and Khloe Kardashian, Kendall Jenner, Leonardo DiCaprio and Jelly Roll.\n      \n    \n          Other big-name stars who were there included Kevin Hart, Paul Rudd, Tiffany Haddish, Keegan-Michael Key, Lil Baby, Peyton Manning, Pete Davidson, Odell Beckham Jr., Maxx Crosby, and Russell Wilson.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Of course, Super Bowl LV kicks off later on today between the Seattle Seahawks and the New England Patriots at Levi Stadium in Santa Clara, CA. And you can bet the celebs will be out in force there, too.\n      \n      ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Travis Scott Pulverizes Sign on Video During Pre-Super Bowl Performance",
      "image": [
        "https://imagez.tmz.com/image/ca/16by9/2026/02/08/ca2f3ae7bb2f4cf794a8882d685a4961_xl.png"
      ],
      "datePublished": "2026-02-08T14:26:56.000Z",
      "dateModified": "2026-02-08T14:26:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Suede Brooks Hot Shots to Kick Off Her 25th Birthday!",
    "url": "https://www.tmz.com/2026/02/08/suede-brooks-hot-shots-to-kick-off-her-25th-birthday/",
    "image": "https://imagez.tmz.com/image/9e/16by9/2026/02/03/9ed3aa60bab546e3891f6697232c972a_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-08T09:00:39.000Z",
    "description": "\n    \n                    \n                          Suede Brooks'\n                          Sexiest Snaps\n                          To Celebrate Her ",
    "body": "\n    \n                    \n                          Suede Brooks'\n                          Sexiest Snaps\n                          To Celebrate Her 25th Birthday!\n                      \n                  \n                                                                        Published \n                              February 8, 2026\n                            1:00 AM PST\n                                                                            \n      \n    \n      \n        \n              \n    \n    \n          Temperatures are dropping, and we know you could use some extra heat this weekend ... it's Suede Brooks' 25th birthday -- so it's time for some hot shots!\n      \n    \n          Check out a selection of the influencer's sexiest photos ... the fashion and beauty icon specializes in fiery 'fits, so dive in and warm up!\n      \n    \n          Happy Birthday Suede!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Social Media\n              \n                          \n                Hotties & Bodies\n              \n                          \n                Hot Bodies\n              \n                          \n                Birthdays\n              \n                          \n                Photo Galleries\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Suede Brooks Hot Shots to Kick Off Her 25th Birthday!",
      "image": [
        "https://imagez.tmz.com/image/9e/16by9/2026/02/03/9ed3aa60bab546e3891f6697232c972a_xl.jpg"
      ],
      "datePublished": "2026-02-08T09:00:39.000Z",
      "dateModified": "2026-02-08T09:00:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Guess Who This A-List Comedian Is!",
    "url": "https://www.tmz.com/2026/02/07/guess-who-a-list-comedian/",
    "image": "https://imagez.tmz.com/image/34/16by9/2026/02/05/3406b525b0a74195a2504d86147668a3_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-08T03:00:19.000Z",
    "description": "\n    \n                    \n                          Guess Who\n                          This A-List Comedian Is!\n                      \n             ",
    "body": "\n    \n                    \n                          Guess Who\n                          This A-List Comedian Is!\n                      \n                  \n                                                                        Published \n                              February 7, 2026\n                            7:00 PM PST\n                                                                            \n      \n    \n        \n                    \n                  \n      \n    \n          Lots of comedians make their way in bars and smoky clubs, but some shoot right to the top with movies and arena tours, and stay there ... can you guess who this A-list comedian is?\n      \n    \n          We ran into this funnyman in 2024 in L.A. ... he must've had something really important come up ... because he kept his phone glued to his ear!\n      \n    \n          Still, we managed to get his attention, and he cracked a smile for us ... no wonder everybody loves him!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Guess Who\n              \n                          \n                Comedy\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Guess Who This A-List Comedian Is!",
      "image": [
        "https://imagez.tmz.com/image/34/16by9/2026/02/05/3406b525b0a74195a2504d86147668a3_xl.jpg"
      ],
      "datePublished": "2026-02-08T03:00:19.000Z",
      "dateModified": "2026-02-08T03:00:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Robert F. Kennedy Jr. Went Dinosaur Bone Hunting with Jeffrey Epstein, Ghislaine Maxwell",
    "url": "https://www.tmz.com/2026/02/07/robert-f-kennedy-jeffrey-epstein-ghislaine-maxwell-went-dinosaur-bone-hunting/",
    "image": "https://imagez.tmz.com/image/c6/16by9/2026/02/07/c65b457f0d0b4bcf9f012759d4df8e2f_xl.png",
    "tag": "Entertainment",
    "date": "2026-02-08T00:28:25.000Z",
    "description": "\n    \n                    \n                          RFK Jr.\n                          Epstein & I Looked For T-Rexs Together!!!\n                     ",
    "body": "\n    \n                    \n                          RFK Jr.\n                          Epstein & I Looked For T-Rexs Together!!!\n                      \n                  \n                                                                        Published \n                              February 7, 2026\n                            4:28 PM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Robert F. Kennedy Jr. certainly has some interesting hobbies ... including dinosaur bone hunting -- which he allegedly did with Jeffrey Epstein back in the day.\n      \n    \n          Among the numerous documents released by the Department of Justice related to the notorious pedophile recently were emails sent between Epstein and Ghislaine Maxwell ... in which he said he went dinosaur and fossile hunting with renowned paleontologist Jack Horner on a ranch.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Maxwell then asked Epstein, \"Didn't we go fossil hunting with him and Bobby Kennedy in N Dakota?\" to which he replied yes.\n      \n\n          It's worth noting, this isn't the first we've heard about the trip ... Maxwell mentioned it when the DOJ interviewed her back in July -- though she said she doesn't remember Kennedy ever flying with them.\n      \n    \n          Kennedy also previously admitted he'd been on the trip with Epstein ... revealing on Fox News in 2023 he flew on Epstein's jet three times -- including once with his then-wife Mary Richardson Kennedy and their four children to go \"fossil hunting for a weekend.\" He made it clear he never flew on the jet without his family.\n      \n    \n          Kennedy is far from the only celebrity mentioned in the most recent release of the so-called \"Epstein Files\" ... with President Donald Trump, Jay-Z, Brett Ratner, Prince Andrew and more receiving mentions in the documents.\n      \n    \n          To be clear, Kennedy has not been accused of any wrongdoing in connection to Epstein ... he was just an excited excavator!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Jeffrey Epstein\n              \n                          \n                Robert F. Kennedy Jr.\n              \n                          \n                Ghislaine Maxwell\n              \n                          \n                Animals\n              \n                          \n                Crime\n              \n                          \n                Viral\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Robert F. Kennedy Jr. Went Dinosaur Bone Hunting with Jeffrey Epstein, Ghislaine Maxwell",
      "image": [
        "https://imagez.tmz.com/image/c6/16by9/2026/02/07/c65b457f0d0b4bcf9f012759d4df8e2f_xl.png"
      ],
      "datePublished": "2026-02-08T00:28:25.000Z",
      "dateModified": "2026-02-08T00:28:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Lindsey Vonn Airlifted After Olympic Ski Crash",
    "url": "https://www.tmz.com/2026/02/08/lindsey-vonn-airlifted-olympic-crash/",
    "image": "https://imagez.tmz.com/image/91/16by9/2026/02/08/91fec1228cec4d7eacda28b59644ac5c_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-08T13:36:20.000Z",
    "description": "\n    \n                    \n                          Lindsey Vonn\n                          Airlifted Off Mountain After Olympic Crash\n               ",
    "body": "\n    \n                    \n                          Lindsey Vonn\n                          Airlifted Off Mountain After Olympic Crash\n                      \n                  \n                                                                        Published \n                              February 8, 2026\n                            5:36 AM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Lindsey Vonn's Olympic run ended in terrifying fashion Sunday after the skiing legend crashed hard during the downhill and was airlifted off the mountain by helicopter following medical treatment on the snow.\n      \n    \n          The American, racing despite a badly injured left knee, lost control early in her run after cutting the opening traverse too tight. Vonn was spun around in the air before slamming down and witnesses say she could be heard screaming in pain as ski patrol and medical personnel rushed to her side.\n      \n    \n      \n      🚨 BREAKING: U.S. skiing legend Lindsey Vonn has crashed during competition at the Winter Olympics and was medevac’d by helicopter from the course.Wishing her a full recovery — sending strength and support to Team USA. pic.twitter.com/IJIQPpX87j— Brian Allen (@allenanalysis) February 8, 2026\n              @allenanalysis\n          \n  \n    \n          The race was immediately put on hold as Vonn was surrounded by doctors, strapped to a gurney and flown off the course.\n      \n\n          Vonn's teammate Breezy Johnson held the early lead, but competition became secondary as attention turned to the fallen star. Family members were visible in the stands, including her father, Alan Kildow, who watched while his daughter was being treated.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Others in attendance, including Snoop Dogg, watched in stunned silence as Vonn was taken away from the same course where she built so many career-defining moments.\n      \n    \n          \"That definitely was the last thing we wanted to see,\" Vonn's sister, Karin Kildow, said in an interview on Peacock. \"She always goes 110 percent, there's never anything less, so I know she put her whole heart into it and sometimes things happen. It's a very dangerous sport.\"\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Kildow said Vonn is being evaluated and the family plans to meet her at the hospital.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Lindsey Vonn\n              \n                          \n                Celebrity News\n              \n                          \n                Olympics\n              \n                          \n                Family\n              \n                          \n                TMZ Sports\n              \n                          \n                Health\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lindsey Vonn Airlifted After Olympic Ski Crash",
      "image": [
        "https://imagez.tmz.com/image/91/16by9/2026/02/08/91fec1228cec4d7eacda28b59644ac5c_xl.jpg"
      ],
      "datePublished": "2026-02-08T13:36:20.000Z",
      "dateModified": "2026-02-08T13:36:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]