[
  {
    "title": "Alexander Skarsgård on Joking About a ‘Smear’ Oscar Campaign Against His Dad and the Risk of ‘Pillion’: ‘This Could Be a Career Killer, or Incredible’",
    "url": "https://variety.com/2026/film/awards/alexander-skarsgard-smear-oscars-stellan-pillion-1236625654/",
    "image": "https://variety.com/wp-content/uploads/2026/01/P1032VSR.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-09T20:01:16.000Z",
    "description": "\n\tIn the carefully calibrated economy of Alexander Skarsgård’s filmography, “Pillion” arrives as something of a quiet revelation — a film that asks on",
    "body": "\n\tIn the carefully calibrated economy of Alexander Skarsgård’s filmography, “Pillion” arrives as something of a quiet revelation — a film that asks one of contemporary cinema’s most physically imposing leading men to communicate not through brute force or spectacle, but through the eloquence of restraint.\n\n\tWritten and directed by Harry Lighton and adapted from Adam Mars-Jones’ 2020 novel “Box Hill,” the A24 black comedy centers on Colin (Harry Melling), a timid gay man who enters a BDSM relationship with Ray (Skarsgård), an enigmatic biker whose emotional opacity is as defining as his dominance. Premiering in the Un Certain Regard section of the Cannes Film Festival, the film announced itself as a critical standout, winning the section’s best screenplay prize.\n\t\n\n\tFor much of his career, Skarsgård has gravitated toward characters who weaponize physical presence — Vikings, tech titans and mythic brutes whose power is immediately legible. “Pillion,” by contrast, arrived without fanfare, buried in an email alongside projects typically flagged for likely rejection. But something about Lighton’s vision stopped him short. “There was something about this that really got me curious — a love story set in the world of kinky gay bikers,” Skarsgård says with a laugh. “And then as soon as I started reading it, it was just a phenomenal script. I was surprised by how sweet, tender, funny and awkward it was.”\n\n\n\tShot on a modest budget in South London in August 2024, “Pillion” required Skarsgård to recalibrate his approach to character construction. Ray is dominant, laconic and emotionally sealed off, yet the performance hinges on suggestion rather than declaration — containing vulnerability without ever surrendering control. “The challenge was making sure Ray didn’t come across as flat,” Skarsgård explains. “If that happens, it’s uninteresting. I thought it was important for the audience to believe that maybe there’s a future for this couple.”\n\t\n\n\tAs the A24 film continues its process of discovery, Skarsgård finds himself in a rare and resonant moment: earning widespread acclaim for a daring performance in a small British independent film tackling subject matter most studios would avoid, while his father, Stellan Skarsgård, simultaneously generates Oscar buzz for “Sentimental Value.” It’s a convergence that feels both improbable and inevitable for an actor who once spent years trying to avoid following in his father’s footsteps.\n\n\tOn this episode of the Variety Awards Circuit Podcast, Skarsgård discusses the intimate challenges of making a BDSM rom-com, what lies ahead in the next season of “Murderbot,” the surreal joy of watching his father’s awards-season resurgence — and why, at heart, he still considers himself a competitor. Listen below!\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tCourtesy of A24\n\t\n\n\n\n\tRead excerpts from her interview below, which has been edited and condensed for clarity.\n\t\n\t\tYou mentioned that when “Pillion” came through, it wasn’t presented as a major opportunity. Walk us through that discovery process.\t\n\n\tIt came to me in a very unceremonious way. It wasn’t like my agents called and said, “Oh my God, you have to read this.” Sometimes you’ll just get an email with a bunch of scripts attached — incoming offers. Legally, agents have to tell you if you have an offer; they can’t simply pass on things. If they dismiss something they think is nothing and it turns out to be an incredible film, they’re in trouble. So they’ll send an email listing a handful of projects, often saying, “We recommend a pass, we recommend a pass.” But if you want to take a look, you can.\n\n\tI always take a look. I’ll read up on who’s involved and try to get at least four or five pages into a script. With this one, something immediately caught my attention. As soon as I started reading, it was clear how phenomenal the script was. I got on a call with Harry Lighton, who wrote and directed it, and was incredibly impressed by his vision for how he wanted to tell this story.\n\n\tThe film wasn’t financed at that point. It was a very small British project that hadn’t come together yet, but I didn’t hesitate. Between the strength of the script and my belief in Harry as a filmmaker, it felt easy. Ray is such an enigmatic, fun character. It didn’t feel like a brave choice or a scary one. I thought it was so good that saying yes was simple.\n\t\n\t\n\t\tThe film and the performance are quite physical. What were the most challenging scenes to shoot from that standpoint?\t\n\n\tThe wrestling scene was one of the first scenes we shot. In fact, rehearsing it two days before filming was the first time Harry and I met, so we didn’t have much preparation time. I came in about a week into production because I was shooting “Murderbot” in Toronto.\n\n\tThe story is very much a journey of discovery for Colin, Harry Melling’s character — figuring out the rules of this sub-dom relationship and what Ray is asking of him. I talked a lot with Harry Lighton beforehand, but I felt it might be more interesting to let that exploration happen on camera rather than fully rehearsed with Harry Melling. I had no idea how he was going to play Colin or how he viewed the relationship.\n\n\tWe showed up, started wrestling, and we were off to the races. It was really exciting. I came in with ideas about how the relationship might play out, but then you’re reacting to Harry — his energy, his instincts, his choices. He responded to things in ways I didn’t expect, and suddenly the scene would take a turn that felt alive and surprising.\n\t\n\t\tYou play Ray as enigmatic and dominant, but there’s tenderness there too. How did you find that balance?\t\n\n\tRay is very clearly an alpha — the dominant in this sub-dom relationship — and he dictates the rules while propelling things forward. At the same time, he reveals nothing about himself. He’s quite laconic. The challenge was making sure he didn’t come across as flat, because that would be uninteresting.\n\n\tIt was important for the audience to have moments where they might think, “Maybe there’s a future here. Maybe these two are good for each other. Maybe this is love. Maybe Ray is falling for Colin the way Colin is falling for Ray.” If Ray is dismissed early on as just a cold, domineering asshole, there’s no film. That journey isn’t compelling.\n\n\tWhen we shot the first hookup scene — the blowjob in the back alley on their first date — we initially did a version where Ray was more forceful, more domineering. It felt too dark. It lost its playfulness. We wanted the audience, and Colin, to come away thinking a second date could actually be fun. If Ray crossed into being too aggressive, it would border on abuse, and then you’re no longer rooting for them. You’d be thinking, “Colin, get out of there.” It was important to feel excitement when Ray calls for the second date — that there’s potential for something to grow.\n\t\n\t\n\t\tThere’s a pivotal scene after the wrestling in the park where you don’t have any dialogue, just looking at Harry. What were you thinking in that moment?\t\n\n\tIt wasn’t spelled out in the script, and I’m not even sure I know exactly where Ray is in that moment. We’ve been to several festivals now and talked to people after screenings, and it’s been fascinating to hear how differently audiences interpret that sequence — particularly Ray’s motivation for giving Colin this almost classic rom-com day.\n\n\tWhat’s interesting is that it happens at the end of the movie rather than earlier on. You see a completely different side of Ray. Interpretations run the gamut — from “that was sadistic, he did it to punish Colin” to something almost altruistic, like “he’s trying to show Colin they’re not compatible to soften the blow when he leaves,” to “maybe he’s genuinely surprising himself because he’s falling in love and it terrifies him.”\n\n\tI’ve been very conscious about not locking it down into one explanation. I don’t want to say, “This is exactly how I played it.” I think it’s far more interesting to leave those doors open. I can say that my understanding of the moment shifted between planning it in my head and actually shooting it with Harry — the dynamic between us changed things in ways I hadn’t anticipated.\n\t\n\t\tYou’ve mentioned trying to avoid following in your father’s footsteps. What changed?\t\n\n\tI didn’t want to be an actor when I was a kid. I tried very hard to avoid it — and in some ways, I still do. I was a contrarian. I think because people assumed I’d want to follow my father into acting, I instinctively pushed against it.\n\n\tI did a few things as a child actor almost by accident. A friend of my dad’s — a Swedish director — needed a seven-year-old boy, and I happened to be seven. I worked a bit in Sweden between the ages of seven and 13, but never with the intention of it becoming a career. It felt like a novelty. Craft service had Cinnabons — that was exciting.\n\n\tI quit when I was 13 after doing a made-for-television movie in Sweden. At the time there were only two TV channels, so a huge portion of the population watched whatever was on. I started being recognized in public, and at 13 — already an incredibly awkward age — that was overwhelming. Being in the spotlight on top of that wasn’t healthy for me. I hated it. So I stopped acting for eight years and was determined to do something else. I failed miserably. And here we are.\n\t\n\t\n\t\tWhat attracts you to a role these days? Are you looking for anything specific?\t\n\n\tI’m not chasing a specific genre or type of character. Looking at the projects I’ve gravitated toward recently, they all feel very original and distinct — which is rare. So many scripts, even well-written ones, feel derivative. You read them and think, “I’ve seen this movie before.”\n\n\tI get excited when something surprises me, like “Pillion,” or “The Moment,” which I did earlier this year with Charlie McDowell. That script felt tonally unique. “Wicker,” another film I did last year, excited me because I honestly didn’t know if it would work — and that felt invigorating.\n\n\tThey all take big swings. There’s a risk in that — this could be a career killer — but it could also be incredible. That’s what draws me in.\n\t\n\t\tYour father is having a major awards moment with “Sentimental Value.” What’s that been like?\t\n\n\tWe were joking the other day about orchestrating a massive smear campaign against him — no, but truly, it’s been such a joy. We’ve been going to the same festivals, hanging out, partying together. I get to see him in this moment where he’s just glowing.\n\n\tHe’s so proud of the film and so happy. He loves Joachim Trier, who directed it, and his co-stars. He’s spoken publicly about having a stroke a few years ago, and there was a real moment where he wasn’t sure he’d be able to work again. For someone who’s been an actor for 60 years and identifies so deeply with the work, that was an existential crisis.\n\n\tTo then make this film — to feel safe, supported, creatively fulfilled — and to have it embraced the way it has, has been extraordinary. Being around him as he travels, receives praise, and truly enjoys it has been incredibly moving. It’s been really, really beautiful.\n\n\tVariety’s “Awards Circuit” podcast, hosted by Clayton Davis, Jazz Tangcay, Emily Longeretta, Jenelle Riley and Michael Schneider, who also produces, is your one-stop source for lively conversations about the best in film and television. Each episode, “Awards Circuit” features interviews with top film and TV talent and creatives, discussions and debates about awards races and industry headlines, and much more. Subscribe via Apple Podcasts, Stitcher, Spotify or anywhere you download podcasts.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Alexander Skarsgård on Joking About a ‘Smear’ Oscar Campaign Against His Dad and the Risk of ‘Pillion’: ‘This Could Be a Career Killer, or Incredible’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/P1032VSR.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-09T20:01:16.000Z",
      "dateModified": "2026-01-09T20:01:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jennifer Lawrence Says Doing a Sex Scene ‘With a Stranger Is Preferable’: ‘It’s Weirder’ With Co-Stars You Know",
    "url": "https://variety.com/2026/film/news/jennifer-lawrence-sex-scenes-stranger-1236627176/",
    "image": "https://variety.com/wp-content/uploads/2026/01/P1032VVY.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-09T20:04:31.000Z",
    "description": "\n\tJennifer Lawrence said during a live recording of the “Happy Sad Confused” podcast (via People) that acting in sex scenes with strangers is “prefera",
    "body": "\n\tJennifer Lawrence said during a live recording of the “Happy Sad Confused” podcast (via People) that acting in sex scenes with strangers is “preferable” because things are way less awkward when you have to get intimate with a co-star who is not a friend. As an example, the Oscar winner compared stripping down with “Die My Love” co-star Robert Pattinson, who she didn’t know before filming, to kissing “Hunger Games” co-star Josh Hutcherson in the later films after the two were already close friends.\n\t\n\n\tLawrence and Pattinson filmed a nude scene together on the first day of shooting “Die My Love,” Lynne Ramsay’s psychodrama about a new mother fighting through psychosis. \n\n\n\t“It was actually easier that way because Rob and I did not know each other, which is kind of better, you know?,” Lawrence said  “Like in ‘Hunger Games,’  me and Josh Hutcherson would have to kiss and that’s like… Imagine it. You know, it’s weirder and so yeah, doing it with a stranger is preferable.”\n\n\tWhile “Die My Love” employed an intimacy coordinator to worth with Lawrence and Pattinson on their sex and nude scenes, Lawrence revealed last year that the duo didn’t really need one on set.\n\n\t“We did not have [an intimacy coordinator], or maybe we did but we didn’t really… I felt really safe with Rob,” Lawrence said on the “Las Culturistas” podcast. “He is not pervy and very in love with [partner] Suki Waterhouse. We mostly were just talking about our kids and relationships. There was never any weird like, ‘Does he think I like him?’ If there was a little bit of that I would probably have an intimacy coordinator. A lot of male actors get offended if you don’t want to fuck them, and then the punishment starts. He was not like that.”\n\t\n\n\tLawrence said in a separate interview that she allowed herself to be naked on camera without giving any thought to how she might look. This was a change of pace from when she went full frontal in the R-rated comedy “No Hard Feelings” and exercised hard before filming.\n\n\t“I don’t care about nudity. I’m not sensitive about it,” Lawrence said. “I wanted Lynne to have total freedom artistically… I think being pregnant took a lot of, like, vanity anxiety away. Before ‘No Hard Feelings,’ I was dieting and not eating carbs and working out. I was pregnant [for ‘Die My Love’]. Like, what was I gonna do? Not eat? I was working 15 hours a day. I was just tired… I remember, like, them sending over a close-up of cellulite and being like, ‘Do you want us to touch this up?’ And I was like, ‘No. That’s an ass.’”\n\n\t“Die My Love” is now available to stream on Mubi.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jennifer Lawrence Says Doing a Sex Scene ‘With a Stranger Is Preferable’: ‘It’s Weirder’ With Co-Stars You Know",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/P1032VVY.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-09T20:04:31.000Z",
      "dateModified": "2026-01-09T20:04:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Hamnet’ Team on Chloé Zhao’s Directing, Leadership and Her Cameo During the Final Globe Theater Scene",
    "url": "https://variety.com/2026/artisans/news/hamnet-artisans-chloe-zhao-final-scene-1236627354/",
    "image": "https://variety.com/wp-content/uploads/2024/12/Chloe-Zhao-Hamnet.jpg?w=900&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-09T20:16:11.000Z",
    "description": "\n\tThe creative team behind Chloé Zhao’s “Hamnet” gathered for a panel discussion as part of the Variety Screening Series to reveal the collaborative p",
    "body": "\n\tThe creative team behind Chloé Zhao’s “Hamnet” gathered for a panel discussion as part of the Variety Screening Series to reveal the collaborative process that brought Maggie O’Farrell’s novel to life on screen.\n\n\tThe film follows Agnes (Jessie Buckley), the wife of a young William Shakespeare (Paul Mescal), as she navigates motherhood in Stratford-upon-Avon while her husband pursues his theatrical ambitions in London. When their son Hamnet falls ill, the family faces devastating loss that inspires Shakespeare’s greatest work, “Hamlet.”\n\t\n\n\tOne theme surfaced repeatedly throughout the panel: Chloe Zhao’s directing style and leadership, which set the tone for the production from its earliest stages. “She’s so devoid of ego or any sense that she’s the boss and she’s in charge,” said casting director Nina Gold, who earned a shortlist nomination for her work. Gold was joined by the film’s costume designer Malgosia Turzanska, cinematographer Łukasz Żal and set decorator Alice Felton. Gold went on to say, “While she obviously has a kind of genius master plan, she’s so collaborative and inclusive — you just talk and really, really work on it together.”\n\n\tZal also praised Zhao’s instinctual approach to filmmaking. “She was sometimes coming for a short moment and just making very, very good and very quick decisions,” he said. “She just really just makes decisions with her body, with her heart less than with her mind.”\n\n\tGold described the intensive process of casting the children, particularly Jacobi Jupe, who was 10 years old when he landed the title role. Jupe was someone who had been on her radar and had wanted to cast him for “The Roses,” but at the time, he was not the right age. After auditioning him “probably eight times,” Gold said she was no longer surprised by his performance, particularly what he brought to the death scene. “Seeing this incredible kind of access to his emotions in such an unfettered way and a willingness to just leap in there and keep doing it was kind of amazing,” she said.\n\t\n\n\tTurzanska highlighted a serendipitous research discovery when London rental house Cosprop found a box unopened for 100 years containing fancy Victorian ball costumes. Among them, an authentic Elizabethan doublet. “I lost it and cried, and it was just magnificent,” she said. “There’s so few garments that are not kind of royal and noble that have been preserved. And this was a simple garment, which was just so beautiful to be able to see.” The discovery inspired her doublet designs for Will’s character. \n\n\tTurzanska traced Agnes’ emotional journey through color, particularly red. “She is such a vibrant, undeniably living creature,” the designer said. “There was always the conversation about this pumping blood and life.” Over the course of the film color evolves from vibrancy through rust tones during motherhood to “this grayish, purplish scab” after her son’s death, before regaining life force in the finale.\n\n\tFelton detailed the intricate glove workshop set that was needed because Will’s father is a glover. She described the space as oppresive. “It’s somewhere that he gets hurt and threatened. Will doesn’t want to be there. He doesn’t want to follow in his father’s footsteps, but he’s forced to be there. So there’s objects in it that are quite sharp and threatening as well as just beautiful objects.”\n\n\tFelton continued, “We had a whole team of leather workers and we, you could go in there and you could, you could choose your gloves.”\n\n\tAs part of her research, Felton went to London’s Victoria and Albert Museum and copied gloves from the era. “We found beautiful old gloves from the period and had them remade, and we made them at different stages.” Even though, it was background dressing, it informed Will’s oppressive environment as an aspiring writer.\n\n\tZal complimented Felton’s work and explained how he visually captured Will’s emotional confinement before meeting Agnes through restrictive framing. “We wanted to build a contrast between them,” he said. “He’s somehow trapped with his thoughts in what he has in his head … The ceiling is pressing him, there are divisions in this house, everything very structured and compositions are somehow closed.”\n\n\tFelton also talked about the progression of the children’s bedroom. She explained, how it starts with two beds “which we handmade.” Felton said, “Then obviously two became one, and then when they cleared out and the space was empty.”\n\t\n\n\tColor was equally as important for Felton and the film’s production designer. The palette of the house is very much blues, grays, creams and darkwood with hardly any color. The bed drapes in Will and Agnes’ room are made, and have an orangey red color. After Hamnet dies, all color is stripped from that room.\n\n\tIn the film’s final scene where audiences watch the first performance of “Hamlet,” at the Globe Theatre, Gold cast over 350 extras. In her search, she sought “interesting non-modern faces”\n\n\tAll had to be dressed by Turzanska and her team. The costume designer revealed that Zhao herself appears in the Globe scene during the film’s finale, reaching out her hand from the center balcony—a hidden cameo for those who look closely.\n\n\n\t“I feel ownership of the movie, of the whole movie more than I have ever felt because of the way she led us,” Turzanska said. \n\n\tWatch the video above.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Hamnet’ Team on Chloé Zhao’s Directing, Leadership and Her Cameo During the Final Globe Theater Scene",
      "image": [
        "https://variety.com/wp-content/uploads/2024/12/Chloe-Zhao-Hamnet.jpg?w=900&h=563&crop=1"
      ],
      "datePublished": "2026-01-09T20:16:11.000Z",
      "dateModified": "2026-01-09T20:16:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Oscar Predictions: Best Director — Can International Filmmakers Crack the Final Five?",
    "url": "https://variety.com/lists/2026-oscars-best-director-predictions/",
    "image": "https://variety.com/wp-content/uploads/2025/12/Renata-Reinsve-Sentimental-Value.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-09T20:15:00.000Z",
    "description": "\n\t\t\n\n\t\n\tJan 9, 2026 12:15pm PT\t\n\t\n\n\t\n\tOscar Predictions: Best Director — Can International Filmmakers Crack the Final Five?\n\t\n\n\n\n\t\t\t\n\t\t\t\n\t\n\t\t\t\t\t\t\n\n\t\t\t",
    "body": "\n\t\t\n\n\t\n\tJan 9, 2026 12:15pm PT\t\n\t\n\n\t\n\tOscar Predictions: Best Director — Can International Filmmakers Crack the Final Five?\n\t\n\n\n\n\t\t\t\n\t\t\t\n\t\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\tMubi\n\t\n\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\n\t\t\n\n\tVariety Awards Circuit section is the home for all awards news and related content throughout the year, featuring the following: the official predictions for the upcoming Oscars, Emmys, Grammys and Tony Awards ceremonies, curated by Variety chief awards editor Clayton Davis. The prediction pages reflect the current standings in the race and do not reflect personal preferences for any individual contender. As other formal (and informal) polls suggest, competitions are fluid and subject to change based on buzz and events. Predictions are updated every Thursday.\n\n\n\n\t\n\n\t\t\t\t\tTHE SECRET AGENT, (aka O AGENTE SECRETO)\n\t\t\t\t\t\t\t\t\tCourtesy Everett Collection\n\t\n\n\n\n\tOscars Best Director Commentary (Updated Jan. 9, 2026): The Directors Guild of America unveiled its nominees for the DGA Awards with recognition for: Paul Thomas Anderson (“One Battle After Another”), Ryan Coogler (“Sinners”), Guillermo Del Toro (“Frankenstein”), Joachim Trier (“Sentimental Value”) and Chloé Zhao (“Hamnet”).\n\n\tCoogler becomes only the fifth Black director ever recognized by the DGA and the first since Spike Lee earned a nomination for “BlacKkKlansman” (2018). Previous Black nominees include Jordan Peele (“Get Out”), Barry Jenkins (“Moonlight”) and Lee Daniels (“Precious”). Notably, no Black filmmaker has ever won the DGA’s top directing prize.\n\n\tZhao, meanwhile, continues to make her own history. The Oscar winner for “Nomadland” (2020) became the third woman — and the first Asian woman — to win the DGA Award and now joins Jane Campion, Kathryn Bigelow and Greta Gerwig as the only women to earn multiple DGA nominations. In total, just 12 women have ever been nominated in the category. Zhao is also the first female POC to be nominated a second time.\n\n\tA key question looming over the best director race is how many filmmakers behind non-English language films will ultimately make the Academy’s final five. In each of the past five years, the Oscars have included at least one director of a predominantly non-English language title, from Jacques Audiard for “Emilia Perez” and Jonathan Glazer for “The Zone of Interest” to Justine Triet for “Anatomy of a Fall,” Ryusuke Hamaguchi for “Drive My Car” and Thomas Vinterberg for “Another Round.” \n\n\tBoth SAG-AFTRA and the Directors Guild of America shut out international cinema entirely in their top categories. Are they splitting the votes? \n\n\tThe British Academy of Film and Television Arts longlist for best director includes Yorgos Lanthimos for “Bugonia,” Lynne Ramsay for “Die My Love,” Chloé Zhao for “Hamnet,” Kathryn Bigelow for “A House of Dynamite,” Josh Safdie for “Marty Supreme,” Paul Thomas Anderson for “One Battle After Another,” Hikari for “Rental Family,” Joachim Trier for “Sentimental Value,” Ryan Coogler for “Sinners” and Kaouther Ben Hania for “The Voice of Hind Rajab.” Six filmmakers will ultimately be nominated, but those won’t be known until Jan. 27, five days after the Oscar nominations are announced.\n\n\tAt the Critics Choice Awards, Anderson claimed the best director prize, prevailing over fellow nominees Coogler, del Toro, Safdie, Trier and Zhao.\n\n\tNominations voting will begin Monday, Jan. 12, and conclude Friday, Jan. 16. Official nominations for the 98th Academy Awards will be revealed Thursday, Jan. 22. The 98th Academy Awards will take place Sunday, March 15, at the Dolby Theatre and will be televised live on ABC in more than 200 territories worldwide.\n\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Ken Woroner/Netflix\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n!function(){\"use strict\";window.addEventListener(\"message\",function(a){if(void 0!==a.data[\"datawrapper-height\"]){var e=document.querySelectorAll(\"iframe\");for(var t in a.data[\"datawrapper-height\"])for(var r,i=0;r=e[i];i++)if(r.contentWindow===a.source){var d=a.data[\"datawrapper-height\"][t]+\"px\";r.style.height=d}}})}();\n\n\n\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: ©Focus Features/Courtesy Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n!function(){\"use strict\";window.addEventListener(\"message\",function(a){if(void 0!==a.data[\"datawrapper-height\"]){var e=document.querySelectorAll(\"iframe\");for(var t in a.data[\"datawrapper-height\"])for(var r,i=0;r=e[i];i++)if(r.contentWindow===a.source){var d=a.data[\"datawrapper-height\"][t]+\"px\";r.style.height=d}}})}();\n\n\n\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: ©Netflix/Courtesy Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n!function(){\"use strict\";window.addEventListener(\"message\",function(a){if(void 0!==a.data[\"datawrapper-height\"]){var e=document.querySelectorAll(\"iframe\");for(var t in a.data[\"datawrapper-height\"])for(var r,i=0;r=e[i];i++)if(r.contentWindow===a.source){var d=a.data[\"datawrapper-height\"][t]+\"px\";r.style.height=d}}})}();\n\n\n\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: ©Sony Pictures/Courtesy Everett\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n!function(){\"use strict\";window.addEventListener(\"message\",function(a){if(void 0!==a.data[\"datawrapper-height\"]){var e=document.querySelectorAll(\"iframe\");for(var t in a.data[\"datawrapper-height\"])for(var r,i=0;r=e[i];i++)if(r.contentWindow===a.source){var d=a.data[\"datawrapper-height\"][t]+\"px\";r.style.height=d}}})}();\n\n\n\t\t\n\t\t\t\n\t\t\t\n\tEligible Directors\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Willa\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n!function(){\"use strict\";window.addEventListener(\"message\",function(a){if(void 0!==a.data[\"datawrapper-height\"]){var e=document.querySelectorAll(\"iframe\");for(var t in a.data[\"datawrapper-height\"])for(var r,i=0;r=e[i];i++)if(r.contentWindow===a.source){var d=a.data[\"datawrapper-height\"][t]+\"px\";r.style.height=d}}})}();\n\n\n\t\t\n\t\n\t\n\n\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Oscar Predictions: Best Director — Can International Filmmakers Crack the Final Five?",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/Renata-Reinsve-Sentimental-Value.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-09T20:15:00.000Z",
      "dateModified": "2026-01-09T20:15:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Oscar Predictions: Best Picture — Are ‘One Battle After Another’ and ‘Sinners’ Headed for a Showdown?",
    "url": "https://variety.com/lists/2026-oscars-best-picture-predictions/",
    "image": "https://variety.com/wp-content/uploads/2025/12/Sinners-One-Battle-After-Another.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-09T19:50:00.000Z",
    "description": "\n\t\t\n\n\t\n\tJan 9, 2026 11:50am PT\t\n\t\n\n\t\n\tOscar Predictions: Best Picture — Are ‘One Battle After Another’ and ‘Sinners’ Headed for a Showdown?\n\t\n\n\n\n\t\t\t\n\t",
    "body": "\n\t\t\n\n\t\n\tJan 9, 2026 11:50am PT\t\n\t\n\n\t\n\tOscar Predictions: Best Picture — Are ‘One Battle After Another’ and ‘Sinners’ Headed for a Showdown?\n\t\n\n\n\n\t\t\t\n\t\t\t\n\t\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\tWarner Bros.\n\t\n\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\n\t\t\n\n\tVariety Awards Circuit section is the home for all awards news and related content throughout the year, featuring the following: the official predictions for the upcoming Oscars, Emmys, Grammys and Tony Awards ceremonies, curated by Variety chief awards editor Clayton Davis. The prediction pages reflect the current standings in the race and do not reflect personal preferences for any individual contender. As other formal (and informal) polls suggest, competitions are fluid and subject to change based on buzz and events. Predictions are updated every Thursday.\n\n\n\n\t\n\n\t\t\t\t\t“Sentimental Value” (Neon)\n\t\n\n\n\n\tOscars Best Picture Commentary (Updated Jan. 9, 2026): The Academy of Motion Picture Arts and Sciences announced Tuesday that 317 feature films are eligible for consideration at the 98th Academy Awards, including 201 titles that qualify for the best picture race.\n\n\tHere are the British Academy of Film and Television Arts (BAFTA) longlist 10 for best film: “The Ballad of Wallis Island”; “Bugonia”; “Frankenstein”; “Hamnet”; “I Swear”; “Marty Supreme”; “Nuremberg”; “One Battle After Another”; “Sentimental Value” and “Sinners.”\n\n\tHere are the Producers Guild of America (PGA) nominations for best picture: “Bugonia,” “F1,” “Frankenstein,” “Hamnet,” “Marty Supreme,” “One Battle After Another,” “Sentimental Value,” “Sinners,” “Train Dreams” and “Weapons.”\n\n\tThe Golden Globes are on Sunday, where the nominees in the drama and comedy/musical categories are: “Frankenstein,” “Hamnet,” “It Was Just an Accident,” “The Secret Agent,” “Sentimental Value” and “Sinners” in drama; and “Blue Moon,” “Bugonia,” “Marty Supreme,” “No Other Choice,” “Nouvelle Vague” and “One Battle After Another” in comedy.\n\n\tThe Actor Awards nominated “Frankenstein,” “Hamnet,” “Marty Supreme,” “One Battle After Another” and “Sinners” for best cast ensemble.\n\n\tNominations voting will begin Monday, Jan. 12, and conclude Friday, Jan. 16. Official nominations for the 98th Academy Awards will be revealed Thursday, Jan. 22. The 98th Academy Awards will take place Sunday, March 15, at the Dolby Theatre and will be televised live on ABC in more than 200 territories worldwide.\n\n\tNOTE: All credited producers are subject to change.\n\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Agata Grzybowska\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n!function(){\"use strict\";window.addEventListener(\"message\",(function(a){if(void 0!==a.data[\"datawrapper-height\"]){var e=document.querySelectorAll(\"iframe\");for(var t in a.data[\"datawrapper-height\"])for(var r,i=0;r=e[i];i++)if(r.contentWindow===a.source){var d=a.data[\"datawrapper-height\"][t]+\"px\";r.style.height=d}}}))}();\n\n\n\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Warner Bros.\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n!function(){\"use strict\";window.addEventListener(\"message\",(function(a){if(void 0!==a.data[\"datawrapper-height\"]){var e=document.querySelectorAll(\"iframe\");for(var t in a.data[\"datawrapper-height\"])for(var r,i=0;r=e[i];i++)if(r.contentWindow===a.source){var d=a.data[\"datawrapper-height\"][t]+\"px\";r.style.height=d}}}))}();\n\n\n\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: 20th Century Studios\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n!function(){\"use strict\";window.addEventListener(\"message\",(function(a){if(void 0!==a.data[\"datawrapper-height\"]){var e=document.querySelectorAll(\"iframe\");for(var t in a.data[\"datawrapper-height\"])for(var r,i=0;r=e[i];i++)if(r.contentWindow===a.source){var d=a.data[\"datawrapper-height\"][t]+\"px\";r.style.height=d}}}))}();\n\n\n\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: ©Mubi/Courtesy Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n!function(){\"use strict\";window.addEventListener(\"message\",(function(a){if(void 0!==a.data[\"datawrapper-height\"]){var e=document.querySelectorAll(\"iframe\");for(var t in a.data[\"datawrapper-height\"])for(var r,i=0;r=e[i];i++)if(r.contentWindow===a.source){var d=a.data[\"datawrapper-height\"][t]+\"px\";r.style.height=d}}}))}();\n\n\n\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit:  Jean-Philippe Baltel courtesy of \t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n!function(){\"use strict\";window.addEventListener(\"message\",(function(a){if(void 0!==a.data[\"datawrapper-height\"]){var e=document.querySelectorAll(\"iframe\");for(var t in a.data[\"datawrapper-height\"])for(var r,i=0;r=e[i];i++)if(r.contentWindow===a.source){var d=a.data[\"datawrapper-height\"][t]+\"px\";r.style.height=d}}}))}();\n\n\n\t\t\n\t\t\t\n\t\t\t\n\tEligible Titles (Best Picture)\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Miya Mizuno\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n!function(){\"use strict\";window.addEventListener(\"message\",(function(a){if(void 0!==a.data[\"datawrapper-height\"]){var e=document.querySelectorAll(\"iframe\");for(var t in a.data[\"datawrapper-height\"])for(var r,i=0;r=e[i];i++)if(r.contentWindow===a.source){var d=a.data[\"datawrapper-height\"][t]+\"px\";r.style.height=d}}}))}();\n\n\n\t\t\n\t\n\t\n\n\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Oscar Predictions: Best Picture — Are ‘One Battle After Another’ and ‘Sinners’ Headed for a Showdown?",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/Sinners-One-Battle-After-Another.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-09T19:50:00.000Z",
      "dateModified": "2026-01-09T19:50:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Alamo Drafthouse Goes Mobile, Getting Rid of Pen-and-Paper Food Orders to ‘Protect the Moviegoing Experience’ (EXCLUSIVE)",
    "url": "https://variety.com/2026/film/news/alamo-drafthouse-mobile-ordering-food-moviegoing-experience-1236626623/",
    "image": "https://variety.com/wp-content/uploads/2026/01/thumbnail_1.-ADSouthLamar_Exterior_Heather-Kennedy.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-09T18:30:00.000Z",
    "description": "\n\tAlamo Drafthouse, the dine-in theater chain that’s popular among cinephiles, is trying to reduce distractions at the movies.\n\n\tSo the Texas-based ci",
    "body": "\n\tAlamo Drafthouse, the dine-in theater chain that’s popular among cinephiles, is trying to reduce distractions at the movies.\n\n\tSo the Texas-based cinema company is introducing a new mobile ordering service that will replace the traditional mode of pen-and-paper at the hands of servers. Starting in February, Alamo Drafthouse locations will utilize a digital system that will let the guests browse the menu, order prior to and during the film, and pay directly from their phones. The custom-built, dark-screen system is designed to minimize interruptions that currently take place as guests are placing orders and paying their checks while the movie is playing. Despite the necessity of phone usage for any hungry audience members, Alamo Drafthouse maintains that its famous “no talking, no texting” policy will remain in place and enforceable by employees.\n\t\n\n\t“Alamo Drafthouse’s new approach aims to improve efficiency while continuing to protect what makes the brand special: an elevated, immersive, and a more distraction-free way to enjoy movies,” the company noted in a press release.\n\n\n\tAlthough the ordering is all digital, food and drinks will still be delivered to guests by servers. There will be newly structured roles for hourly staff at theaters, but this switch to mobile won’t take away any jobs. Alamo isn’t implementing any layoffs and all base wages will remain the same. \n\n\tThe mobile ordering, which has already been tested and evaluated in select markets, will expand at certain theaters in January, with plans to roll out across all their theaters throughout the year.\n\t\n\n\t“We continue to evolve, as we must, to protect the Alamo movie-going experience as the entertainment landscape shifts around us, without ever losing sight of who we are,” said Michael Kustermann, CEO of Alamo Drafthouse Cinema. “Putting ordering control directly in our guests’ hands allows us to move faster and more efficiently, creating a smoother, more responsive experience without added distraction. This new service model is a custom, smart, and flexible way to strengthen our long-term health, protect our future, and ensure we can continue serving our guests, supporting our team, and reaffirming our love of cinema for years to come, no matter what’s happening around us.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Alamo Drafthouse Goes Mobile, Getting Rid of Pen-and-Paper Food Orders to ‘Protect the Moviegoing Experience’ (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/thumbnail_1.-ADSouthLamar_Exterior_Heather-Kennedy.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-09T18:30:00.000Z",
      "dateModified": "2026-01-09T18:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘The White Lotus’ Season 4 to Shoot at 19th-Century Castle Hotel in Saint-Tropez (EXCLUSIVE)",
    "url": "https://variety.com/2026/tv/global/white-lotus-season-4-location-saint-tropez-hotel-1236627285/",
    "image": "https://variety.com/wp-content/uploads/2025/03/TheWhiteLotus-Episode6-JasonIsaacs-ParkerPosey.1.jpg?crop=0px%2C36px%2C1200px%2C675px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-01-09T18:45:00.000Z",
    "description": "\n\tAs Mike White is still in the in the midst of writing the anticipated Season 4 of “The White Lotus,” Variety has learned that the hit anthology will",
    "body": "\n\tAs Mike White is still in the in the midst of writing the anticipated Season 4 of “The White Lotus,” Variety has learned that the hit anthology will shoot at a 19th-century palace-turned-luxury hotel called the Château de La Messardière in Saint-Tropez on the Côte d’Azur.\n\n\tThe Château de La Messardière, which is set within 32 acres of parasol pines, cypress trees and jasmine, is part of Airelles Collection, a group of five-star hotels owned by Stephane Courbit, who is also the founder and chairman of Banijay Group (“Survivor,” “Peaky Blinders”). HBO did not have a comment.\n\t\n\n\tSuites at the luxury property run from $3,000 to $8,000 (and up) per night, and the hotel includes a spa, beach access by Rolls-Royce transfer, restaurants, sports activities and a children’s camp.\n\n\n\tFilming of Season 4 will begin at the end of April and continue through the end of October, Variety has also learned. As with other seasons, this one will not shoot entirely in a single property as White is meticulous about crafting unique backdrops that combine different venues. As such, the Château de La Messardière is one of several places that will host the HBO production. The story will unfold along the French Riviera, with some scenes also filmed at a Paris hotel.\n\n\tThe plot remains tightly under wraps — besides HBO confirming that it will once again follow of group of hotel guests and employees over the course of a week — but sources say that the Cannes Film Festival could be part of the storyline. Considering that the show will lens on the Riviera during the festival, which runs May 13-26, it certainly sounds plausible.\n\t\n\n\tCasting is underway for Season 4 and a large number of French actors have auditioned for it. As Variety reported last month, Alexander Ludwig (“Earth Abides,” “Vikings”) and AJ Michalka (The Goldbergs, Super 8″) are the first new cast members announced for the show. So far, only three cast members have appeared in more than one season: Jennifer Coolidge, who played Tanya McQuoid in Seasons 1 and 2; Natasha Rothwell, who played Belinda Lindsey in Seasons 1 and 3; and Jon Gries, who has played Greg Hunt in all three seasons. \n\n\tThe Thailand-set Season 3, which also starred Walton Goggins, Michelle Monaghan, Carrie Coon, Sam Rockwell, Jason Isaacs, Parker Posey, Aimee Lou Wood, Sam Nivola and Patrick Schwarzenegger, earned eight acting Emmy nominations. “The White Lotus” is executive produced by White, David Bernad and Mark Kamine. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘The White Lotus’ Season 4 to Shoot at 19th-Century Castle Hotel in Saint-Tropez (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2025/03/TheWhiteLotus-Episode6-JasonIsaacs-ParkerPosey.1.jpg?crop=0px%2C36px%2C1200px%2C675px&resize=1000%2C563"
      ],
      "datePublished": "2026-01-09T18:45:00.000Z",
      "dateModified": "2026-01-09T18:45:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Noah Wyle Says ‘The Pitt’ Season 3 Will ‘Probably Not’ Take Place on a Holiday, Time Jump Will Be Shorter Than Season 2",
    "url": "https://variety.com/2026/scene/columns/noah-wyle-the-pitt-season-3-no-holiday-time-jump-shorter-1236627297/",
    "image": "https://variety.com/wp-content/uploads/2026/01/JG1_5162.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-09T18:27:26.000Z",
    "description": "\n\tHBO Max announced on Wednesday that the award-winning “The Pitt” has been picked up for a third season — and star Noah Wyle says the team is already",
    "body": "\n\tHBO Max announced on Wednesday that the award-winning “The Pitt” has been picked up for a third season — and star Noah Wyle says the team is already mapping out ideas. \n\n\tWhile Season 2 — which premiered Thursday — takes place over July 4th weekend, Wyle doesn’t think next season will include a holiday. \n\n\t“Probably not,” he told me on the Season 2 premiere red carpet at the DGA Theater Complex in L.A. on Wednesday. “Although we might not push it so far into the future this time — 10 months was a long jump. I don’t think we need to make that long of a jump next time.”\n\t\n\n\tEarlier on the carpet, showrunner R. Scott Gemmill joked that next season will happen on Halloween — at least I thought he was joking.\n\n\t“He’s just giving — ask a Canadian a question and they answer. It’s unbelievable,” Wyle said with a smile in response to Gemmill’s Halloween comment. “He’s got this Krampus costume he wants to wear on set.”\n\n\t“The Pitt” takes places inside a Pittsburgh emergency room over the course of 15 episodes. So far, each season has unfolded over the course of a single shift, with each episode covering an hour of that shift.\n\n\tCasey Bloys, HBO and HBO Max Content chairman and CEO, revealed to the audience at the Season 2 premiere that the show was renewed for a third season.\n\n\t“The Pitt” goes into the Golden Globes with two nominations for best television series – drama and best performance by a male actor in a television series – drama for Wyle. “I don’t even know how to describe it other than to say I didn’t think lightning would strike twice like this in my life 30 years apart,” Wyle said of the show’s success. “Being invited to all these lovely events once again with a little wisdom and perspective to really understand how special and rare it is, is like the greatest gift.”\n\t\n\nNoah Wyle on the success of #ThePitt and what he would tell his younger self: \"Don't worry so much. It's going to work out okay.\"\"I didn't think lighting would strike twice like this in my life, 30 years apart… it's the greatest gift.\" pic.twitter.com/tNgGI3utZ4— Variety (@Variety) January 8, 2026\n\n\n\tIn addition to Wyle, the Season 2 cast includes Patrick Ball, Katherine LaNasa, Supriya Ganesh, Fiona Dourif, Taylor Dearden, Isa Briones, Gerran Howell, Shabana Azeez and Sepideh Moafi.\n\n\tGemmill created “The Pitt” and executive produces the series alongside John Wells, Wyle, JWP’s Erin Jontow, Joe Sachs, Simran Baidwan and Michael Hissrich.\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Noah Wyle Says ‘The Pitt’ Season 3 Will ‘Probably Not’ Take Place on a Holiday, Time Jump Will Be Shorter Than Season 2",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/JG1_5162.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-09T18:27:26.000Z",
      "dateModified": "2026-01-09T18:27:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘The President’s Cake’ Director Hasan Hadi’s Makes History With First-Ever Iraqi Title to Land on the International Feature Oscar Shortlist",
    "url": "https://variety.com/2026/film/awards/presidents-cake-hasan-hadis-iraqi-director-oscar-shortlist-1236622658/",
    "image": "https://variety.com/wp-content/uploads/2026/01/HR_GettyImages-2215062326.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-09T18:30:00.000Z",
    "description": "\n\tWhen Iraqi helmer-writer Hasan Hadi nabbed the Golden Camera for best first feature at the 2025 Cannes Film Festival with “The President’s Cake,” Ir",
    "body": "\n\tWhen Iraqi helmer-writer Hasan Hadi nabbed the Golden Camera for best first feature at the 2025 Cannes Film Festival with “The President’s Cake,” Iranian director Jafar Panahi, winner of the main competition, offered some advice. “Be careful,” he said, “I got that award 30 years ago and it raised expectations for the second feature. Just make it and don’t worry about it.”\n\n\tSince “The President’s Cake” became the first-ever Iraqi title to land on the international feature Oscar shortlist, Baghdad-based Hadi finds the expectations around his feature debut higher than ever. Discussing the “incredible honor,” he marvels, “For the first time, I feel like a film is being treated like a football team. Now we are in the World Cup. … It’s the first time [the audience] feels like they’re involved, have something to cheer for. … It puts responsibility on you.”\n\t\n\n\tFor Hadi, one of the most rewarding aspects of the film’s success is seeing it renew the faith of Iraqi artists and create new opportunities for them. He is overwhelmed with emails and texts from the people he inspired. After the head of France’s national film organization CNC saw “Cake” in Cannes, he asked Hadi how his organization could support Iraq’s film industry. The two kept in touch, and in early November, the governments of France and Iraq signed a cinematic cooperation agreement designed to strengthen cultural and artistic collaborations through the exchange of expertise, capacity-building and the development of policies that support the Iraqi film industry.\n\t\n\n\tOf course, “The President’s Cake” already contributed to that capacity-building. Although the film would have been far easier to finance if the production took place in another country, Hadi was adamant about shooting in his homeland. Even though he had to bring in some international heads of departments, he insisted that other positions be reserved for Iraqis, so that they could learn and develop.\n\n\n\n\t\n\n\t\t\t\t\t“The President’s Cake” got a boost from Eric Roth and Marielle Heller at the Sundance Institute.\n\t\n\n\n\n\tA U.S.-Qatar-Iraq co-production, the film also boasts a number of top Romanian talents including cinematographer Tudor Vladimir Panduru and editor Andu Radu, both associates of Cristian Mungiu, one of the country’s most recognizable filmmakers. Hadi, a fan of Panduru’s shooting style, says, “He spoke about the story and script in a way that I immediately knew that he understands what I want to achieve here.” Another affinity between the Romanians and the Iraqis lay in the fact that both knew the difficulties of living under a dictatorship.\n\n\tFor Hadi, the Sundance Institute proved fundamental to the creation of “The President’s Cake.” First, he attended the Screenwriters Lab where he met Eric Roth and Marielle Heller, who both boarded the film as executive producers. He was also accepted into the Directors Lab. There, notes the MFA graduate of NYU’s filmmaking program, “having the opportunity to test the visual language, the tone of the film and the structure of the scenes was extremely important.”\n\n\tQatar’s contribution came through Doha Film Institute funding. (Remarkably, the institution funded three other projects on this year’s international feature shortlist: Cherien Dabis’ Jordanian entry “All That’s Left of You,” Annemarie Jacir’s Palestinian entry “Palestine 36” and Kaouther Ben Hania’s Tunisian entry “The Voice of Hind Rajab.”) In addition, while at Doha’s 2025 Qumra festival, Hadi acquired an international sales agent and learned about the film’s acceptance into Cannes’ Directors’ Fortnight, where it went on to win the section’s Audience Award.\n\n\tWhen the promotional whirlwind finishes, what’s next for Hadi? Panahi need not worry — Hadi already has another project in mind, although not yet solidified, on which he will work again with producer Leah Chen Baker, a former NYU classmate. “It’s another Iraqi project, taking place during another period that isn’t well known, also from a personal perspective,” he says.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘The President’s Cake’ Director Hasan Hadi’s Makes History With First-Ever Iraqi Title to Land on the International Feature Oscar Shortlist",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/HR_GettyImages-2215062326.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-09T18:30:00.000Z",
      "dateModified": "2026-01-09T18:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Key Takeaways From Variety’s Business of Creators Summit at CES 2026",
    "url": "https://variety.com/2026/digital/news/ces-business-of-creators-summit-2026-key-takeaways-1236627004/",
    "image": "https://variety.com/wp-content/uploads/2026/01/BHO_1299.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-09T18:56:25.000Z",
    "description": "\n\tThe bustling and booming creator economy was in the spotlight at the first-ever Variety Business of Creators Summit presented by Samsung Ads at CES.",
    "body": "\n\tThe bustling and booming creator economy was in the spotlight at the first-ever Variety Business of Creators Summit presented by Samsung Ads at CES.\n\n\tThe half-day program on Thursday, Jan. 8, featured a lineup of top Hollywood and media leaders, brand execs, creators, marketers and agencies unpacking the latest trends at the intersection of creators and entertainment. The Business of Creators Summit followed the previous day’s Variety Entertainment Summit at CES, held at the Aria resort and casino in Las Vegas.\n\t\n\n\tHere are key takeaways from the event.\n\n\tCreators Are Redefining Entertainment — and Giving Brands New Opportunities\n\n\tKicking off the event was Kerry Nelson, head of brand marketing at Samsung Ads, who told the audience that creators “are revolutionizing how stories are told, how communities form, how audiences connect and how brands show up in those moments. It’s a redefinition of what entertainment can be and who gets to shape it.” In that context, she highlighted Samsung TV Plus, the company’s free, ad-supported television (FAST) streaming service. Samsung TV Plus, which counts more than 88 million monthly active users, features a lineup of creator-driven channels, including those from to YouTube creator MrBeast (aka Jimmy Donaldson), Dhar Mann, Michelle Khare and the Try Guys. Nelson concluded: “For advertisers, the opportunity is huge: premium, brand-safe environments paired with authentic storytelling and measurable outcomes, all in one place.”\n\n\tBeing a Full-Time Creator Is Exhausting, but Fans Crave Authentic Voices\n\n\tOn the “Masters of the Creator-Verse” panel, top digital creator Hannah Stocking — who double-majored in biology and chemistry in college and did embryonic stem-cell research — explained how she caught the bug making funny six-second Vine videos. Now, 13 years into her career, she said the job can be all-consuming. “It really is, at least for me, a rat race. It’s a 24/7 job. I think consistency is key in this space. I think if you do take some time off, your engagement takes a severe hit, and then when you need to come back, you need to make sure you come back with a banger video,” said Stocking. “I say 24/7 because even if I’m having a conversation with someone, I’m still thinking of ideas for how can I elevate myself and create more IP and all of that.” Stocking added, “My dad’s still confused at what I do.”\n\t\n\n\tSo-called AI “virtual influencers” have already cropped up on the internet. But Aleen Dreksler, founder and CEO of digital media company Betches, said a world saturated with AI-generated content could benefit human creators. “I do think that audiences might get sick of [AI video] and will want to go back to finding real human connection, whether that online and offline,” said Dreksler. “Trust is going to be the No. 1 form of currency for brands to reach audiences [and] for creators to reach their own audiences.”\n\n\tWatch the full panel discussion:\n\n\tNew Hollywood Power Players: The Rise of Creators on TV\n\n\tNot every YouTuber is going to be right for television, said Takashi Nakano, VP of content and programming for Samsung TV Plus. Those who do make the leap are those “who create content in a prolific manner, who are engaged with the data, who can adapt and change quickly and produce relatively inexpensively in this new world and put stuff on TV and that have people come and watch it,” Nakano said. One of the creators Samsung has teamed with is Mark Rober, a former NASA engineer who specializes in science-related videos.\n\n\tRishita Patel, head of media, for Rober’s CrunchLabs, explained the rationale for doing a FAST deal with Samsung: “Mark has grown this incredibly authentic and organic audience, but it is a co-viewing audience. It’s a family audience. And being present in the living room and expanding our audience that way made a ton of strategic sense for us.” She added, “The idea that it is lean back [viewing], but there’s so many opportunities to still make it lean-forward and expand.”\n\n\tWatch the full panel discussion:\n\n\tThe Creator Personality Type\n\n\tAre creators just… born with je ne sais quoi that lets them aggregate a fanbase? Raina Penchansky, CEO and co-founder of influencer management agency DBA and co-head of UTA Creators, shared some thoughts. “Something sort of interesting about the creator economy is, we all know those people, whether it was, like, in high school or present day, who have that sort of personality where they’re oversharers,” she said. Penchansky continued, “Whether or not Instagram existed, this was going to happen” — in living rooms, on a group chat, wherever. “That’s the sort of essence, I think, of the most successful creators.”\n\t\n\n\tAnd, maybe it goes without saying, it’s helpful to have an irrational exuberance about the work. Appearing on the panel with Penchansky were Clea Shearer and Joanna Teplin, co-founders of lifestyle brand The Home Edit, which is part of Reese Witherspoon’s Hello Sunshine media company — both of whom said Monday is their favorite day of the week because they get to work. “We just love the excitement of like, ‘We now have five days to create,'” Shearer said. “We have like five full days of like emails and business to happen.” Added Teplin, “Things are happening. The weekends just suck!”\n\n\tWatch the full panel discussion:\n\n\tThe ‘Affinity Economy’?\n\n\tMetrics used to track the influence of digital creators have been an amalgam of followers, comments, shares and “likes.” Evan Shapiro, a veteran producer and entertainment industry exec who now calls himself a “media cartographer,” says that “we need to move to what I call the affinity economy built around key passion indices.” For example, he said: How quickly does a fan go from “first view” to “buying a T-shirt”? “You can measure that shit,” according to Shapiro. “BBC Studios does it all the time with ‘Bluey.’ ITV does it all the time with ‘Love Island.'” His point: “You don’t need scale for scale’s sake.” Once you build an audience, “you’ll also be able to monetize it in a way where you and your fans are in agreement,” he said.\n\n\tA Power Combo: Bringing Live Shopping Into the Creator Era\n\n\tSandie Hawkins previously led the launch of TikTok’s live shopping business in North America. Now she’s one month into the job as CEO of TalkShopLive, which provides a platform to let brands and creators host livestreamed entertainment events — that are designed to, of course, sell you stuff. Live shopping has been huge in Asia. Why not the U.S.? “The problem that I saw with live shopping [in North America] is the way it works right now is when you go live, you’re stuck on one platform,” she said. “And what TalkShopLive really helps to do is as a creator, as somebody who’s making content, you can free that content now through TalkShopLive, so you can publish that content and syndicate it out to any publisher and to a lot of different platforms from one place.” \n\n\tFor live shopping, the key is to have a highly energetic, “big personality” — and someone who can sustain that for upwards of 60 minutes, Hawkins said. “When you’re going live, that personality has to go from a 10 to 100, and you have to be constantly engaging,” she said.\n\t\n\n\tWatch the full discussion with TalkShopLive’s Hawkins:\n\n\tEmpowering Voices From Across the Spectrum\n\n\tSubstack, the newsletter and podcasting publishing platform, has garnered attention as a place where some big-name journalists have set up shop after leaving their outlets, including Paul Krugman (ex-New York Times), Jim Acosta (ex-CNN) and Mehdi Hasan (ex-MSNBC). “All that sort of stuff gets a lot of attention and we love it,” said Hamish McKenzie, co-founder of Substack. “But what we’re most excited about is a new generation of voices that can succeed now in the media ecosystem because there are no barriers to starting and there’s this really simple, transparent business model that actually works and can help them sustain their work.” Substack has a number of rivals, of course, like Patreon and Beehiiv. But McKenzie argued that Substack “is much more like YouTube. It’s a place you can go as a publisher to create and distribute your work and find an audience and monetize all in the same place.”\n\n\tWatch the full discussion:\n\n\tWhy Marriott Sees Creators as Key to Breaking Through Clutter\n\n\tPeggy Roe, chief customer officer at Marriott International, said the hotel operator wants to move “social first” in its marketing “because it is such a platform to tell the story in different ways and even from different perspectives… The same hotel and the same experience can come to life in multiple different ways.” But there’s a lot of noise. Behnaz Ghahramani, Marriott’s SVP of marketing, noted that “we’re not just competing with other brands on social. We’re competing with everyone who’s posting about your cousin and, you know, your favorite dog and all the AI content that’s now flooding our feeds. And we want to be able to cut through in a really meaningful way. And we need creators at the heart of that to be telling our stories in an authentic way across all the platforms.”\n\n\tWatch the full discussion:\n\n\tAudiences Unlocked: The Future of Creator Marketing\n\n\tIn the event’s final panel, industry experts discussed best practices and go-forward trends for brands in working with creators as an integral part of their marketing strategies. Cameron Curtis, EVP of global digital marketing at Warner Bros. Studio Group, said his team approaches the relationship with creators as “co-authorship”: “That’s probably the biggest change for us, is that we work with creators at every step of our campaigns… We bring creators into the fold and we want them to be part of the storytelling, you know?” Dara Treseder, CMO of Autodesk, noted: “I think the biggest change is that creator marketing is now a core part of the go-to-market launch plan. So gone are the days where this is like an afterthought.”\n\t\n\n\tWhat’s critical is ensuring the goals for brands and creators are aligned, said Jared Shulman, SVP, head of strategy and creator marketing, CAA Brand Consulting. “This is a really a relationship business, right?” he said. “We have the relationship with our own agents at CAA, relationships with managers and relationships with creators themselves, and we build these relationships very early on with brands.”\n\n\tWatch the full panel discussion:\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Key Takeaways From Variety’s Business of Creators Summit at CES 2026",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/BHO_1299.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-09T18:56:25.000Z",
      "dateModified": "2026-01-09T18:56:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Abella Danger Goes Wild After Miami Beats Ole Miss, We're Going To The Natty!",
    "url": "https://www.tmz.com/2026/01/09/abella-danger-miami-national-championship/",
    "image": "https://imagez.tmz.com/image/91/16by9/2026/01/09/911e7280093741f28b9d50b3011fdcaf_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-09T16:10:09.000Z",
    "description": "\n    \n                    \n                          Abella Danger\n                          We're Going To The Natty!!!\n                          ...",
    "body": "\n    \n                    \n                          Abella Danger\n                          We're Going To The Natty!!!\n                          ... Goes Nuts For Miami\n                      \n                  \n                                                                        Published \n                              January 9, 2026\n                            8:10 AM PST\n                                                                      |\n                                                                Updated \n                                  January 9, 2026\n                                8:47 AM PST\n                                    \n      \n    \n      \n        \n                    \n                  \n      \n                    Threads/@dangershewrote\n          \n    \n          The Miami Hurricanes are one win from being national champions ... and outside of Michael Irvin, there's no one more excited than adult film star Abella Danger!!\n      \n    \n      \n        \n              \n    \n    \n          30-year-old Danger -- who has dominated the AVN Awards with consecutive wins in the \"Most Amazing Ass\" and \"Most Epic Ass\" categories since 2019 -- was present at State Farm Stadium in Glendale for the thrilling 31-27 victory over Ole Miss ... and as soon as the 'Canes secured the dub, it was time to celebrate.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Danger -- who attended UMiami -- shared a video from her lower bowl seats as the orange and green confetti fell from the rafters ... and since the clip was muted, we're just gonna assume she said something along the lines of \"woo\" and \"yay!!\"\n      \n\n          She also put her school pride on display ... rocking a team-themed outfit that featured tiny shorts and a belly shirt.\n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          Danger went to Threads to write her reaction as well ... saying, \"THE U IS GOING TO THE NATTY!!!!!!!!!!!!!!!!!!!!!!!!!! I CANNOT BREATHE I AM SO HAPPY FOR THIS TEAM THAT HAS WORKED SO HARD ALL SEASON, YOU ARE ALL LEGENDS!!!!! 💚🧡🙌🏼\"\n      \n    \n      \n      HAD TO DO ANOTHER BTA pic.twitter.com/a2aqao438A— Michael Irvin (@michaelirvin88) January 9, 2026\n              @michaelirvin88\n          \n  \n    \n          As for Irvin, 59, the Hurricanes legend was a bit more covered up ... but he did take off his belt for his signature \"BTA\" celebration -- which consisted of whipping a water cooler draped in Ole Miss gear.\n      \n    \n          Safe to say Danger and Irvin will be at the natty as Carson Beck and Co. go up against either Oregon or Indiana ... after all, it's in Miami, so it's basically a home game!!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Abella Danger\n              \n                          \n                Michael Irvin\n              \n                          \n                Carson Beck\n              \n                          \n                College Football\n              \n                          \n                Sex\n              \n                          \n                TMZ Sports\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Abella Danger Goes Wild After Miami Beats Ole Miss, We're Going To The Natty!",
      "image": [
        "https://imagez.tmz.com/image/91/16by9/2026/01/09/911e7280093741f28b9d50b3011fdcaf_xl.jpg"
      ],
      "datePublished": "2026-01-09T16:10:09.000Z",
      "dateModified": "2026-01-09T16:10:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Aubrey Plaza Relists Marital Home After Husband Jeff Baena's Death",
    "url": "https://www.tmz.com/2026/01/09/aubrey-plaza-relists-marital-home-after-husband-death/",
    "image": "https://imagez.tmz.com/image/4b/16by9/2026/01/09/4b623c8dbd5e417fb19a9e9da35b7920_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-09T17:33:26.000Z",
    "description": "\n    \n                    \n                          Aubrey Plaza\n                          Relists Marital Home A Year After Husband's Death\n        ",
    "body": "\n    \n                    \n                          Aubrey Plaza\n                          Relists Marital Home A Year After Husband's Death\n                      \n                  \n                                                                        Published \n                              January 9, 2026\n                            9:33 AM PST\n                                                                      |\n                                                                Updated \n                                  January 9, 2026\n                                11:01 AM PST\n                                    \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Aubrey Plaza has quietly put her marital home back on the market, slashing the price months after listing it ... following the death of her husband, Jeff Baena.\n      \n    \n          The Los Feliz Oaks property, which originally hit the market for $6.5 million last year, is now listed at $5,750,000 -- a sizable price cut after the home was pulled just days before Christmas.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          The 4-bedroom, 6-bathroom private compound was the home Aubrey and her husband Jeff shared after buying it in October 2022 for $4.7 million.\n      \n\n          The Spanish compound is a double lot and comes with a wine cellar, pool, steam room and screening room.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Jeff tragically died there by suicide in January last year -- making it understandable that Aubrey would want to move on from the property, even if it means taking a price cut ... though she’s still likely to walk away with a solid profit.\n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          As we reported, Aubrey and Jeff were separated at the time of his death, having begun taking time apart in September 2024.\n      \n    \n          Bryce Pennel from Douglas Elliman holds the listing.\n      \n    \n          If you or someone you know is struggling or in crisis, help is available. Call or text 988 or chat 988lifeline.org.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Aubrey Plaza\n              \n                          \n                RIP\n              \n                          \n                Celebrity Death\n              \n                          \n                Exclusive\n              \n                          \n                Celebrity Homes\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Aubrey Plaza Relists Marital Home After Husband Jeff Baena's Death",
      "image": [
        "https://imagez.tmz.com/image/4b/16by9/2026/01/09/4b623c8dbd5e417fb19a9e9da35b7920_xl.jpg"
      ],
      "datePublished": "2026-01-09T17:33:26.000Z",
      "dateModified": "2026-01-09T17:33:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "TMZ Streaming Live, Come Into Our Newsroom and Watch Things Happen!",
    "url": "https://www.tmz.com/2026/01/09/watch-tmz-live-today/",
    "image": "https://imagez.tmz.com/image/3b/16by9/2026/01/09/3bcd106112084cb1b3232327058731e1_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-09T17:41:04.000Z",
    "description": "\n    \n                    \n                          TMZ Live Stream\n                          Come Into Our Office and Watch News Happen!!!\n         ",
    "body": "\n    \n                    \n                          TMZ Live Stream\n                          Come Into Our Office and Watch News Happen!!!\n                      \n                  \n                                                                        Published \n                              January 9, 2026\n                            9:41 AM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          We want you to be a part of TMZ, so every weekday, between 9:30 AM and 11:30 AM PT, we take you inside our newsroom via live stream.\n      \n    \n          You never know what you're gonna get ... a big story that breaks, an argument erupts in the room, or someone's just joking around.\n      \n    \n          Your comments are a big part of the stream, and the staff spends a lot of time speaking directly to you. Every day is different!\n      \n    \n          We also use our live stream to produce our \"TMZ Live\" TV show.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Live Stream\n              \n                          \n                Streaming\n              \n                          \n                TMZ Live\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "TMZ Streaming Live, Come Into Our Newsroom and Watch Things Happen!",
      "image": [
        "https://imagez.tmz.com/image/3b/16by9/2026/01/09/3bcd106112084cb1b3232327058731e1_xl.jpg"
      ],
      "datePublished": "2026-01-09T17:41:04.000Z",
      "dateModified": "2026-01-09T17:41:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Zach Bryan Takes Aim at Ex Brianna 'Chickenfry' LaPaglia in New Diss Tracks",
    "url": "https://www.tmz.com/2026/01/09/zach-bryan-disses-brianna-chickenfry-lapaglia-album/",
    "image": "https://imagez.tmz.com/image/6b/16by9/2026/01/09/6b28111c511e4752af231f0ae1420cce_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-09T19:01:16.000Z",
    "description": "\n                    \n                          Zach Bryan\n                          Deep-Fries 'Chickenfry' In Diss Tracks!!!🫢\n                     ",
    "body": "\n                    \n                          Zach Bryan\n                          Deep-Fries 'Chickenfry' In Diss Tracks!!!🫢\n                      \n                  \n                                                                        Published \n                              January 9, 2026\n                            11:01 AM PST\n                                                                            \n              \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Brianna \"Chickenfry\" LaPaglia just got torched by her ex Zach Bryan -- 'cause his new album is packed with scathing diss tracks ... and it’s painfully clear they’re aimed at one person and one person only!\n      \n    \n          On the track \"Skin\" from his sixth studio album released Friday, the Grammy winner got brutally graphic about taking a \"blade to my old tattoos\" to \"drain the blood between me and you,\" even singing about dragging the blade across his own skin before declaring, \"I ain’t ever touching yours again.\"\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Back when they were still an item, Brianna inked her arm with the words, \"How lucky are we?\" which is the same lyric in a 2024 Bryan song \"28.\" Bryan reportedly got a similar tattoo to match Brianna's.\n      \n    \n          On \"Plastic Cigarette,\" Bryan croons about crossing paths with someone \"evil\" in Queens, New York -- and it’s worth noting he and Brianna first sparked their romance in 2023 after she attended his concert at Queens’ Forest Hills Stadium.\n      \n\n                  \n          \n                          \n                \n                                  \n      \n    \n          Another track, \"With Heaven on Top,\" includes the lyrics \"Used to know some folks who put it all online, but you paint landscapes in the evening time\" -- a pretty obvious diss, seemingly comparing his ex to his new love, Samantha Leonard.\n      \n    \n          Nothing’s been officially confirmed, but all signs point to the lyrics taking aim at his messy split from Brianna ... who previously claimed Zach slapped a $12-mil NDA in front of her, which she refused to sign.\n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          The exes called it quits in October 2024, and in the fallout, Barstool Sports’ Brianna accused him of emotional abuse and infidelity.\n      \n    \n          As for Zach, he’s clearly turned the page -- recently marrying Leonard and also shouting her out in his new album ... but in a much sweeter way, proving his new chapter's already underway!\n      \n      ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Zach Bryan Takes Aim at Ex Brianna 'Chickenfry' LaPaglia in New Diss Tracks",
      "image": [
        "https://imagez.tmz.com/image/6b/16by9/2026/01/09/6b28111c511e4752af231f0ae1420cce_xl.jpg"
      ],
      "datePublished": "2026-01-09T19:01:16.000Z",
      "dateModified": "2026-01-09T19:01:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Minneapolis ICE Shooting Video From Agent's POV",
    "url": "https://www.tmz.com/2026/01/09/new-video-shows-ice-shooting-in-minneapolis/",
    "image": "https://imagez.tmz.com/image/be/16by9/2026/01/09/be849dccdead414486cdd4bbf2c61a3b_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-09T18:14:41.000Z",
    "description": "\n    \n                    \n                          Minnesota ICE Shooting\n                          New Video Shows Fatal Interaction\n              ",
    "body": "\n    \n                    \n                          Minnesota ICE Shooting\n                          New Video Shows Fatal Interaction\n                          From Agent's POV\n                      \n                  \n                                                                        Published \n                              January 9, 2026\n                            10:14 AM PST\n                                                                      |\n                                                                Updated \n                                  January 9, 2026\n                                11:36 AM PST\n                                    \n      \n    \n      \n        \n                    \n                  \n      \n                    Alpha News\n          \n    \n          Here's a new angle of the ICE shooting in Minnesota ... and it's intense.\n      \n    \n          The video shows ICE agents approaching the Honda Pilot Renee Good was driving on a Minneapolis street Wednesday morning, as her wife gives the feds a hard time, tensions flaring with neighbors gathering nearby to record the scene.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          ICE agents tell Renee to get out of the car, and then she appears to reverse, then put her vehicle in drive and move forward as gunshots ring out. Profanity can be heard directly after the shots are fired, just before the Pilot crashes into a parked car on the street.\n      \n    \n          The video -- originally obtained by Alpha News -- appears to have been recorded by the agent who pulled the trigger.\n      \n\n      \n        \n                    \n                  \n      \n                    CNN\n          \n    \n          Video from another angle shows ICE officers getting out of a large SUV in front of Good's Honda Pilot, and you can see the shooter circling Good's vehicle, which appears to line up with this latest footage.\n      \n    \n          Before the shooting, you hear Renee's wife, Becca Good, state she's a U.S. citizen and a veteran ... and you see neighbors standing on the sidewalk watching everything play out.\n      \n    \n        \n                    \n                      1/7/26\n                  \n      \n    \n          DHS says Renee was trying to run over the ICE agents when he shot her Wednesday morning ... though local officials have disputed that claim.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          The shooting has sparked protests in Minneapolis and other cities across the country.\n      \n      \n              \n          \n                          \n                ICE\n              \n                          \n                News\n              \n                          \n                Police\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Minneapolis ICE Shooting Video From Agent's POV",
      "image": [
        "https://imagez.tmz.com/image/be/16by9/2026/01/09/be849dccdead414486cdd4bbf2c61a3b_xl.jpg"
      ],
      "datePublished": "2026-01-09T18:14:41.000Z",
      "dateModified": "2026-01-09T18:14:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]