[
  {
    "title": "Ricky Gervais Reveals the Jason Momoa and Peter Dinklage D— Joke He Cut From the Golden Globes",
    "url": "https://variety.com/2025/awards/news/ricky-gervais-jason-momoa-dick-joke-golden-globes-1236620291/",
    "image": "https://variety.com/wp-content/uploads/2025/12/RickyGervais_Mortality_236_RT.png?crop=0px%2C0px%2C1260px%2C709px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-12-30T15:59:44.000Z",
    "description": "\n\tRicky Gervais has hosted the Golden Globes five times, making Hollywood sweat with his take-no-prisoners approach to jokes mocking showbiz.\n\n\tIn his",
    "body": "\n\tRicky Gervais has hosted the Golden Globes five times, making Hollywood sweat with his take-no-prisoners approach to jokes mocking showbiz.\n\n\tIn his new Netflix stand-up special “Mortality,” which was released Tuesday, the comedian reveals that while the awards ceremony never nixed any of his material, he actually scratched one joke himself. He then proceeded to share it near the end of his special.\n\n\n\t“I said earlier, I’ve never had a joke stopped by the Golden Globes, and that is absolutely true,” Gervais said. “But I’ve just remembered the joke that I stopped myself, ’cause I bottled it a bit, and I think I was being over-cautious. I want to share it with you. So I’ve got the chance to introduce Jason Momoa. So I thought the meta joke would be to show my hypocrisy and my cowardice. I’m OK to slag off actors — who’s scared of actors? — but when it comes to a big dude, right, I’m not so brave.\n\t\n\n\t“So I was going to go, ‘I’ve got nothing bad to say about our next presenter, because he’s got a cock like a baby’s arm,’ right?” he continued. “And I told my mate I was gonna do that, and my mate went, ‘Do you think people will think that’s racist?’ I was like, ‘Why is it racist?’ ‘Well, because he’s a person of color.’ And I went, ‘No, it’s nothing to do with that. It’s to do with the fact that he’s so big that he’d probably have a cock like a baby’s arm, right?’ So I didn’t do it. And I had a great follow-up, so I’ll tell you the whole thing. This is the whole thing. What I was gonna do: I’ll go out and go, ‘I’ve got nothing bad to say about our next presenter, because he’s got a cock like a baby’s arm — unlike Peter Dinklage, who’s got an arm like a baby’s cock.'” \n\t\n\n\tNikki Glaser is set to host this year’s Golden Globes for the second consecutive time. The ceremony takes place on Jan. 11.\n\n\tVariety parent company PMC owns Dick Clark Prods. in a joint venture with Eldridge.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ricky Gervais Reveals the Jason Momoa and Peter Dinklage D— Joke He Cut From the Golden Globes",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/RickyGervais_Mortality_236_RT.png?crop=0px%2C0px%2C1260px%2C709px&resize=1000%2C563"
      ],
      "datePublished": "2025-12-30T15:59:44.000Z",
      "dateModified": "2025-12-30T15:59:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘KPop Demon Hunters’ Voice Actors for Rumi and Jinu Set First Joint Interview on ‘Tonight Show With Jimmy Fallon’",
    "url": "https://variety.com/2025/film/news/kpop-demon-hunters-rumi-jinu-interview-jimmy-fallon-1236620268/",
    "image": "https://variety.com/wp-content/uploads/2025/12/KpopDemonHunters_ProRes422HQ_SDR_2ch_20250424.00_32_09_00.jpg?crop=383px%2C60px%2C1098px%2C619px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-12-30T16:00:00.000Z",
    "description": "\n\t\t\t\n\t\t\t\t\n\t\n\n\t\n\tDec 30, 2025 8:00am PT\t\n\t\n\n\t\n\t\t‘KPop Demon Hunters’ Voice Actors for Rumi and Jinu Set First Joint Interview on ‘Tonight Show With Jim",
    "body": "\n\t\t\t\n\t\t\t\t\n\t\n\n\t\n\tDec 30, 2025 8:00am PT\t\n\t\n\n\t\n\t\t‘KPop Demon Hunters’ Voice Actors for Rumi and Jinu Set First Joint Interview on ‘Tonight Show With Jimmy Fallon’\n\t\n\t\n\t\t\t\n\n\n\t\t\t\n\t\t\t\n\t\n\n\t\t\t\t\t\t\t\t\tNetflix\n\t\n\n\t\t\n\t\n\t\t\t\t\n\tArden Cho and Ahn Hyo-seop, the voice actors who play love interests Rumi and Jinu in “KPop Demon Hunters,” will do their first-ever joint interview on “The Tonight Show With Jimmy Fallon.”\n\n\tThe episode will air on Jan. 12 at 11:35 p.m. on NBC before streaming on Peacock the next day. News of Cho and Hyo-seop’s sit-down with Fallon was announced in a teaser video NBC released on social media. In the video, a young girl approaches Fallon with a piece of paper, saying, “Excuse me, mister, I made this for you.” He takes the paper and sees a drawing of Rumi and Jinu with the actors’ names and the date of the episode written on it.\n\t\n\n\tThis isn’t the first time Fallon’s show has been the platform for a “KPop Demon Hunters” star. In October, the singing voices behind Rumi (Ejae), Mira (Nuna) and Zoey (Rei Ami) performed the song “Golden” on “The Tonight Show” and joined Fallon on the couch. The Oct. 7 episode was originally set to be their first-ever televised appearance and live performance — before they made a surprise cameo in an episode of “Saturday Night Live” hosted by Bad Bunny on Oct. 4.\n\n\n\tBesides Cho and Hyo-seop, “The Tonight Show” will also feature guests Kristen Wiig and Ashton Kutcher and a musical performance by Ty Meyers on Jan. 12.\n\n\t“KPop Demon Hunters” premiered on Netflix on June 20 and quickly became the streamer’s most popular English-language film of all time. Since then it has accrued more than 500 million views worldwide.\n\n\tSee the “Tonight Show” teaser below. \n\n\t\n\n\n\t\n\t\tMore from Variety\n\t\n\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘KPop Demon Hunters’ Voice Actors for Rumi and Jinu Set First Joint Interview on ‘Tonight Show With Jimmy Fallon’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/KpopDemonHunters_ProRes422HQ_SDR_2ch_20250424.00_32_09_00.jpg?crop=383px%2C60px%2C1098px%2C619px&resize=1000%2C563"
      ],
      "datePublished": "2025-12-30T16:00:00.000Z",
      "dateModified": "2025-12-30T16:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "George Clooney on Crying While Watching Himself in ‘Jay Kelly,’ Rebooting ‘Oceans’ and Why News Networks Should Tell Trump to ‘Go F— Yourself’",
    "url": "https://variety.com/2025/film/features/george-clooney-oceans-reboot-jay-kelly-trump-1236618393/",
    "image": "https://variety.com/wp-content/uploads/2025/12/George-Clooney-Variety-Cover-Story-3.jpg?crop=0px%2C103px%2C1156px%2C650px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-12-30T16:00:00.000Z",
    "description": "\n\tGeorge Clooney has a cold.\n\n\tOther A-listers would call in sick, but Clooney, who is on his second round of steroids, is powering through. “My body ",
    "body": "\n\tGeorge Clooney has a cold.\n\n\tOther A-listers would call in sick, but Clooney, who is on his second round of steroids, is powering through. “My body isn’t up for a fight like it was when I was younger,” he says.\n\n\tWe’re sitting in an empty lounge at Ludlow House in downtown Manhattan to talk about his new movie, “Jay Kelly,” and the Oscar-winning star of “Michael Clayton,” “Up in the Air” and three “Ocean’s” films is sifting through a small fridge in search of sparkling water. His hair is mostly gray, his face slightly lined, but at 64, he’s still incandescently handsome in that effortless, Cary Grant-like way.\n\t\n\n\t“My kids get sick with something; they’re fine in three days.” Clooney finds the water, pops it open and takes a swig. “I’m an old shit — it takes me forever!” He chuckles with that wry laugh we’ve heard for four decades. “I’d been traveling for work, and I got home and my son, Alexander” — who is 8 — “came running up to me saying, ‘Papa, Papa, I don’t feel well,’ and he sneezed in my mouth. I’ve been sick as a dog.”\n\n\tDoes that sound like a movie star to you? Clooney has been deeply enmeshed in the public consciousness for so long — since he became a phenom with “ER” in the ’90s — that he’s shaped our idea of celebrity as something not only glamorous, but good. He’s used his fame to draw attention to causes from Darfur to gun control while defending the role of a free press (he grew up the son of broadcast journalist Nick Clooney in Kentucky). At the same time, he’s become Hollywood’s eternal prankster, pulling one over on Brad Pitt, Matt Damon and his other big-name buddies with elaborate gags that make him more relatable.\n\t\n\n\tHe was also committed to bachelorhood — that is, until he married human rights attorney Amal Alamuddin in 2014. Now a family man with two children, he’s ready for his next era, showing an industry obsessed with youth how to age gracefully on-screen. “If you’re trying to hold on to being a romantic leading man at my age, it gets sad,” Clooney says. “I don’t want to be pathetic.”\n\n\tUnlike his other big-screen contemporaries, you won’t find him clinging to the side of a plane or romancing starlets long after he’s qualified for AARP membership. Instead, he’s stretching himself artistically. Clooney made his Broadway debut this year in a stage version of “Good Night, and Good Luck,” the 2005 film about journalist Edward R. Murrow he co-wrote, directed and appeared in. He followed that up by playing a movie star past his matinee idol prime in “Jay Kelly.” The complex character study pushed him in new directions as a performer, reigniting his creative spark and allowing him to dig deeper.\n\n\t“I got my groove back as an actor,” Clooney says. “I rediscovered why I love this profession. It’s not that I wasn’t challenging myself on my last few films, but I knew how to play those parts.” He’s referring to “Ticket to Paradise,” which saw him in rom-com mode opposite Julia Roberts, and “Wolfs,” an action comedy about roguish fixers that reteamed him with Pitt. “With this one, I felt like I did when I started acting and was trying to figure it out,” Clooney says. “You’re thinking, ‘Am I a fraud? Am I going to be found out?’ It’s a really good place to be, to feel off your game.”\n\n\tClooney needn’t have worried. Not only did he score his best reviews in years, but he also earned a Golden Globe nomination for best actor in a musical or comedy and is in the thick of the Oscar race. \n\n\t“Jay Kelly” is kicking off Clooney’s career pivot — even though, on paper, playing a movie star doesn’t sound like much of a stretch. But the A-lister he embodies in “Jay Kelly” is a self-absorbed, career-obsessed performer. He may be beloved by fans around the world, but he’s estranged from his family and doesn’t have any friends. When Jay accepts a lifetime achievement award in Tuscany, the only person who shows up is his long-suffering manager (Adam Sandler). Everyone else has other plans. \n\t\n\n\t“When I watched it, I kept thinking, ‘Thank God George’s life is the complete opposite of this,” says Roberts, a friend and frequent co-star. “You’d be sending people away if there was a George Clooney tribute. The event would be standing room only.”\n\n\t“Jay Kelly” follows its title character as he treks across Italy, flanked by publicists and stylists, trying to meet up with his daughter, who is backpacking through Europe. She resents him, as does the army of handlers he pays to airbrush his image. Clooney initially worried that Noah Baumbach, who co-wrote and directed the film, had the wrong idea about him.\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tRichard Phibbs for Variety\n\t\n\n\n\n\t“I read the script, and there was a part of me that went, ‘Does he think this is who I am?’” Clooney says. “Because I knew Noah a little bit, and this character’s deeply unhappy and kind of a jerk. But then I thought it might be fun to play someone who thinks he’s a good guy, but everything he touches, he destroys.”\n\n\tAs they worked on the film, Baumbach sprinkled more details from Clooney’s life into the script, enjoying the meta-ness of the story. Like Clooney, Jay is from Kentucky, and the film includes a moment where one of the actor’s fans urges him to run for president, pressure Clooney often receives from disaffected liberals.\n\n\t“The illusion, of course, is that George is somehow playing his alter ego,” says Baumbach. “If George was playing a dentist, nobody would be asking about similarities. But because movie stars are reflections back at us, and we all have these histories with them, it feels more intense. They are kind of avatars for our hopes and dreams.”\n\n\tClooney, unlike his character, doesn’t stay cloistered in a celebrity bubble, untouchable and inaccessible. He acts like the mayor of any movie set, getting to know everyone by name and refusing to retreat to his trailer between scenes. “Jay Kelly” was no exception. Clooney and Sandler spent their downtime playing basketball, inviting everyone to shoot hoops with them.\n\n\t“Anybody could walk up, and he’d throw them a ball,” Sandler says. “Because it’s Europe, where it’s more about football than basketball, George would show them the proper form and how to shoot. He turned about 20 Italian crew members into real hoops players.”\n\t\n\n\tClooney fosters an easygoing work environment, partly so he can be loose when the cameras are ready to roll. “I grew up in the Spencer Tracy school,” he says, “which is, you know, come in, be prepared, know what your character wants in the scene. Then, when they say, ‘Cut and print,’ you get on with your life.” \n\n\tPulling pranks is all part of the Clooney package; it helps keep things light and shows he doesn’t take celebrity too seriously. Friends say he spends years finding ways to catch them by surprise.\n\n\t“He’s very patient, which makes him lethal when it comes to pranks,” Steven Soderbergh says. “He had one teed up for [producer] Jerry Weintraub that was jaw-dropping that he never even used. He’d somehow gotten ahold of Jerry’s golf clubs, and [when Jerry was napping] he took some very compromising photographs of them arranged in a way that clubs should not be arranged. It would have been seismic.”\n\n\tWhile making 2014’s “The Monuments Men,” Clooney had the wardrobe department take in the waist of Damon’s costumes by an eighth of an inch every day.\n\n\t“I was in my early 40s at the time, and worried about going to seed,” Damon says. “He just delighted in messing with me. Long after that happened, I came home from making another movie and put on a suit that was too tight. My first thought was that George had gotten into my closet.”\n\n\n\tIn 1998, Clooney was shooting his final season of “ER” on the Warner Bros. lot in Burbank when he heard that Paul Newman was a few soundstages away working on “Message in a Bottle.” He grabbed a golf cart and set out to meet one of his idols. He found Newman sitting outside, drinking beer and smoking cigarettes. At this point, “ER” was one of the most popular shows on TV, commanding roughly 30 million viewers an episode.\n\n\t“I pulled up and I go, ‘Hey, Mr. Newman,’” Clooney recalls. “And he clearly had no clue who I was. But he was friendly and we started talking. People would drive by going, ‘George!’ ‘Hey, George!’ ‘Hey, man!’ Bit by bit, he figured out that I was well known in some way. And as I started to leave, he goes, ‘Don’t let them keep you inside.’”\n\n\tIt took Clooney a while to appreciate what Newman meant, but gradually his warning became clear. “What he was talking about was fame, and the tendency to surround yourself with managers and PR people who build these walls of security so that you don’t get caught doing something stupid,” Clooney says. “But what happens is you can divorce yourself from what’s really going on out there. You need people in your life that tell you the truth.”\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tRichard Phibbs for Variety\n\t\n\n\n\n\tHe thinks the character Jay liked staying in a self-congratulatory cocoon, a predilection that was exacerbated by his early superstardom. “I feel like Jay Kelly got famous young, and I don’t know how young people handle fame,” Clooney says. “There’s too much attention on you. You believe too much about how great you are. Some actors can deal with it when they’re young — Timothée Chalamet seems to — but I don’t think I would have been one of those people.”\n\t\n\n\tIn contrast, Clooney spent years as a journeyman actor, shuffling through bit parts on “Roseanne” and “The Facts of Life.” (“I have probably the best mullet of all time” is Clooney’s assessment of his sitcom work.) It was his performance as a womanizing pediatrician on “ER” that made him a household name when the show premiered in 1994. By that point, Clooney was 33. “I’d failed a lot,” he says. “I’d been rejected a lot. And so I was better prepared for success.”\n\n\tIt helped that he knew how fleeting fame can be, having watched his aunt Rosemary Clooney go from chart-topping singer and actress to cautionary tale as she struggled with drugs and lost opportunities. “She did everything wrong — there was booze and pills. You name it,” he says. “I was a kid in Kentucky, but when I did get to know her, the career was long gone. She wasn’t the beautiful blond from ‘White Christmas’ — she was trying to sing in clubs and having a real bad time.”\n\n\tClooney has been called “the last movie star,” and it is true that he has a kind of elegance and charm that seems increasingly rare. But he doesn’t totally buy it. He thinks there’s a rising crop of actors who are ready to take up the mantle, rattling off the names of Chalamet and Glen Powell as younger performers who impress him. He also praises Zendaya, calling her “an exceptional talent.” But he does acknowledge that they’re inheriting a fractured entertainment landscape. He came of age in the monoculture — when hit shows like “ER” or movies like “Ocean’s Eleven” commanded the entire public’s attention. That all changed as TikTok and YouTube made it easier than ever for anyone to achieve their 15 minutes of fame. \n\n\t “The thing where you put someone’s name above the title and you go see a movie because they’re in it has ended,” Clooney says. “And I’m part of the last generation of stars who were a beneficiary of a studio really investing in them. When I was on ‘ER,’ Bob Daly and Terry Semel, who were running Warner Bros. at the time, brought me in and gave me a five-picture deal. Because their company had produced my show, they wanted to be in business with me for the long haul.”\n\n\tThey also were patient with their investment. When Val Kilmer dropped out as Batman, Clooney was hired to wear the cape and cowl. He assumed the superhero movie would prove his bankability. Instead, when “Batman & Robin” came out in 1997, it was a campy disaster that nearly killed the franchise and Clooney’s movie career.\n\t\n\n\t“It was a very painful suit, and you couldn’t move,” Clooney remembers. “I would be laying on a board, and Joel Schumacher would direct you with a giant speaker, and he would go, ‘OK, George, and here we go. And ready? Your parents are dead. You have nothing to live for. And — action!’ And then they’d just prop me up and I go, ‘I’m Batman,’ and they go, ‘And cut.’ And they drop me back down, and then they carry me out on the board.”\n\n\tClooney regained his stride with 1998’s “Out of Sight,” a romantic thriller in which he smoldered alongside Jennifer Lopez in a sexually charged game of cops and robbers. It also kicked off his long association with Soderbergh. Critics embraced the film, and the response taught Clooney something valuable about believing your own hype.\n\n\t“I got destroyed for ‘Batman & Robin,’ and fair enough — I’m terrible and it’s a bad film,” he says. “The next film I do is ‘Out of Sight.’ It’s one of the best films I’ve ever been in. I’m good in it because it’s well written and has a great director and cast. I didn’t learn how to act any better in those six months between projects. I was protected by the talent around me.”\n\n\tGoing forward, Clooney made a point of surrounding himself with visionary filmmakers like Soderbergh, Alexander Payne (“The Descendants”) and the Coen brothers (“O Brother, Where Art Thou?”), who made challenging stories mostly aimed at adults. And he largely steered clear of franchises that offered mega-paydays but would have locked him to a certain genre or a signature part.\n\n\t“Most of my successes were middle-of-the-road hits,” Clooney says. “And that’s lucky, because I was never typecast. I could do all kinds of things. I could do movies that were very serious, like ‘Michael Clayton,’ and then do something wild like ‘Burn After Reading.’ It meant that once I couldn’t kiss the girl anymore, I could still have a career.”\n\n\n\tLong before he was famous, Clooney learned about morality from his father, with whom he remains close. Clooney’s dad’s career in journalism inspired him to be an engaged citizen and led to his interest in the story of “Good Night, and Good Luck,” a drama about how CBS News stood up to Joseph McCarthy. When the film was released, Clooney intended to draw parallels between Murrow and how the media was covering the lead-up to the Iraq War. Two decades later, with Donald Trump in office, it hits differently. When Clooney played Murrow last spring, CBS News was settling a frivolous lawsuit with Trump so that he’d approve the sale of its parent company, Paramount, to Skydance. That enraged Clooney, as did ABC News’ similar settlement with the president over a defamation claim.\n\t\n\n\t“If CBS and ABC had challenged those lawsuits and said, ‘Go fuck yourself,’ we wouldn’t be where we are in the country,” Clooney says. “That’s simply the truth.”\n\n\tHe’s only grown more alarmed as David Ellison, Paramount’s new owner, has reshaped CBS News’ coverage in a more MAGA-friendly way by installing conservative commentator Bari Weiss as editor-in-chief. “Bari Weiss is dismantling CBS News as we speak,” Clooney says. “I’m worried about how we inform ourselves and how we’re going to discern reality without a functioning press.”\n\n\tClooney, who always seems to run cool, grows animated discussing how certain members of that profession have abandoned journalism’s mission to hold the powerful to account. It makes him think about something Murrow says in both the film and the play. “‘Let’s not confuse dissent with disloyalty,’” Clooney says. “I mean, what a beautiful, important statement about who we are at our best. But all too often we fall short.”\n\n\n\n\t\n\n\t\t\t\t\tOn the set of “Jay Kelly” in Italy\n\t\t\t\t\t\t\t\t\tPeter Mountain/Netflix\n\t\n\n\n\n\tClooney has long been one of the entertainment industry’s most outspoken liberals, so it’s no surprise to hear that he believes President Trump’s behavior flies in the face of Murrow’s ideals. “It’s a very trying time,” Clooney says. “It can depress you or make you very angry. But you have to find the most positive way through it. You have to put your head down and keep moving forward because quitting isn’t an option.”\n\n\tWhat is surprising, though, is that before Trump set the country on a MAGA course, Clooney and the reality-TV star were friendly. “I knew him very well,” Clooney says. “He used to call me a lot, and he tried to help me get into a hospital once to see a back surgeon. I’d see him out at clubs and at restaurants. He’s a big goofball. Well, he was. That all changed.”\n\n\tIn 2024, Clooney made a big political stir, not by criticizing Trump, but for a New York Times op-ed he wrote urging Joe Biden to drop out of the race following his debate meltdown. Many Democrats were relieved that someone was taking a stand that might save the country from Trump, but the Biden family has continued to criticize Clooney for being disloyal.\n\t\n\n\tSoderbergh says, “I thought, ‘Holy shit.’ It’s classic George. He knows there are going to be so many people pissed at him, but if something is wrong, he’s going to speak out. Somebody had to say it.” \n\n\n\tClooney wants to model his next phase as an actor on Newman, who he considers the gold standard in how to transition to elder statesman status. Instead of clinging to his heartthrob past, Newman focused on enriching the parts he played as he got older. \n\n\t“He went from performing love scenes in ‘Absence of Malice’ to doing shattering work — and looking his age — in ‘The Verdict,’” Clooney says. “And it was seamless.”\n\n\tNext up for Clooney is “In Love,” a low-budget drama in which he will appear opposite Annette Bening as a man with Alzheimer’s. It’s indicative of the more personal projects he hopes to make. \n\n\t “I’m not going to be doing a whole lot of major studio kinds of films,” Clooney says. “The films that I’m going to be working on for the most part are going to be smaller. If I’m going to go off and do something and be away from my kids, there has to be a real creative reason for it. Money isn’t an issue for me anymore.”\n\n\tBut there’s one franchise Clooney plans to revive — “Ocean’s Eleven.” Although instead of a nostalgia play, he wants to explore what it’s like to pull off a heist when you’re no longer young and spry. He was inspired by the movie “Going in Style,” a ’70s comedy about a group of aging criminals, and he’s enlisted Roberts, Damon, Pitt and Don Cheadle to return as an older, but wiser gang. They are scouting locations and hope to start shooting next October.\n\n\t“There was something about the idea that we’re too old to do what we used to do, but we’re still smart enough to know how to get away with something, that just appeals to me,” Clooney says. “They’ve lost a step, and they need to find a way to work around their limitations.”\n\n\tPersonally, Clooney says he’s happier than ever. He has a large network of friends, and makes a point of planning boys’ trips and keeping in touch with people through chat groups. He and Damon are part of a Wordle network that Clooney has dubbed “Nerdle” because of its intricacy — they do three puzzles every day, add up the scores and the winner gets to choose the word they start with the next morning. “George is frustratingly good at it,” Damon says.\n\n\tHe also has loved having a family, brightening when he talks about becoming a dad to twins in his 50s. \n\t\n\n\t“This chapter of George’s life fills me with so much joy,” Roberts says. “Amal is an absolute rock star. I could never conjure up a dream girl like this for George, and to watch him with his kids is so special.”\n\n\t“Jay Kelly,” with its portrait of a stultifying form of celebrity, may be very different from the way that Clooney operates on and off screen. However, Clooney’s art and life do converge at the end of the film as Jay sits in a theater watching clips of his performances. The scenes Baumbach splices together are all drawn from Clooney’s films — there he is, saving the world in “The Peacemaker,” working all the angles as an operator in “Michael Clayton” and sipping a scotch while playing a smooth criminal in “Out of Sight.”\n\n\tIt’s impossible not to be moved by the sheer weight of the filmography, as well as to feel that the period of cinema he represents, one in which star power was the biggest special effect of all, is slipping away. “When we shot it, all I had told him was that I wanted to show him something,” Baumbach says. “He didn’t question it. He just remained open to what I was going to do.”\n\n\tThe take Baumbach ended up using, one in which Clooney’s eyes begin to well with emotion, was the first one he shot.\n\n\t“When you’re young you’re desperately figuring out a way to cry,” Clooney says. “You’re pulling out nose hairs and pinching yourself. But the older you get, the faster the emotions bubble up. I have no trouble tearing up now.”\n\n\tSome things do improve with age. \n\n\t\n\t\tLocation: Ludlow House\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "George Clooney on Crying While Watching Himself in ‘Jay Kelly,’ Rebooting ‘Oceans’ and Why News Networks Should Tell Trump to ‘Go F— Yourself’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/George-Clooney-Variety-Cover-Story-3.jpg?crop=0px%2C103px%2C1156px%2C650px&resize=1000%2C563"
      ],
      "datePublished": "2025-12-30T16:00:00.000Z",
      "dateModified": "2025-12-30T16:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Best Documentaries of 2025",
    "url": "https://variety.com/lists/best-documentaries-2025/",
    "image": "https://variety.com/wp-content/uploads/2025/12/FotoJet-72.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-30T15:30:00.000Z",
    "description": "\n\tThe way we see it, there’s a yin and yang to documentaries. They’ve always had the potential to be deadly serious — now maybe more than ever, as a w",
    "body": "\n\tThe way we see it, there’s a yin and yang to documentaries. They’ve always had the potential to be deadly serious — now maybe more than ever, as a world awash in chaos spotlights such topics as the rise of autocracy, the war in Ukraine, and the state of political cover-up that’s threatening to become the new normal. But documentaries, precisely at a moment as sobering as this one, also have a unique ability to enchant and uplift. Variety’s list of the best documentaries of 2025 includes a number of profiles of artists and musicians, and that’s because films like “Sly Lives!” and “Mr. Scorsese” are portraits of genius that lift you up (and are not without their dark sides). Documentaries can be so many things — diaries, exposés, tragedies, biographies, love letters. That’s why our list touches so many bases. These movies often struggle to be widely seen, so consider this a scroll of the highest standards that is also a consumer guide of enlightened pleasure.          \n\n\t\t\t\n\t\t\t\n\tThe Alabama Solution\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Courtesy of Sundance Film Festival\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tAndrew Jarecki’s most powerful film since “Capturing the Friedmans” is an exposé of the systemic inhumanity of the American prison system. Filmed over five years, in and around the Easterling Correctional Facility in Southeast Alabama, it’s a scalding portrait of life on the inside that becomes a muckraking murder mystery. Following in the incendiary footsteps of films like “Attica,” “13th,” and “The Farm: Angola, USA,” Jarecki reveals a culture of sanctified lawlessness, much of it chronicled by the prisoners on contraband cell phones. And the way the movie peels off layers of a cover-up becomes as dramatic as the crimes it’s about. —Owen Gleiberman   \n\t\t\n\t\t\t\n\t\t\t\n\tApocalypse in the Tropics\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Courtesy of Francisco Proner\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tFive years after her superb “The Edge of Democracy,” director Petra Costa takes stock of the far-right era of former Brazilian president Jair Bolsonaro. But this sobering and impassioned look at the evangelical age of Brazilian politics resonates far beyond Brazil. Costa may be glad to speak of Bolsonaro’s tenure in the past tense, but she is not done analyzing its origins and implications. The film’s key person of interest is the Pentecostal televangelist Silas Malafaia, a self-styled political puppeteer with rigid right-wing beliefs who is presented as the charismatic crux figure of Brazil’s new populist politics — more influential than the individuals he endorses. The film’s startling, climactic depiction of the January 2023 riots by incensed Bolsonaro voters that followed his electoral defeat offers a striking parallel to the Trumpist storming of the Capitol two years before. —Guy Lodge\n\t\t\n\t\t\t\n\t\t\t\n\tArt for Everybody\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Courtesy of Fourth Act Films\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tIn the 1990s, Thomas Kinkade, painter of utopian pastoral settings, ornate Christmas country cottages that glow from within, and (peering through it all) pastel magic-hour sunbeams that look an awful lot like the light of God, became the most successful commercial artist of his time; he was like Norman Rockwell, Bob Ross, and Andy Warhol rolled into one. Miranda Yousef’s fascinating documentary is a study of Kinkade’s aesthetic sincerity, his commercial voraciousness, and the dark side he kept under wraps. His art had a cozy splendor that Middle Americans cherished and that the chattering classes dismissed as kitsch. It was more than kitsch, though. Kinkade painted life as an earthly daydream blessed, in a nearly tactile way, by a wholesome higher power. Yet he had to repress part of who he was to do it, and as the film traces his rise and fall, which includes his alcoholic descent and the disturbed private paintings he kept hidden in a vault, it makes his contradictions tantalizing in part because it never fully penetrates them. —OG\n\t\t\n\t\t\t\n\t\t\t\n\tBarbara Walters: Tell Me Everything\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Courtesy of Hulu\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tJackie Jesko’s portrait of the legendary, groundbreaking television icon is a lot like its subject. It’s sharp and inquiring in a playful way. It asks friendly questions but knows when to toss in a tough one. It sizes up important people with worldly perception, but it’s also enthralled by the seductions of fame and money and power. The movie delivers Walters’ story in all its tasty fascination and significance (for the first 15 years of her career, she was smashing glass ceilings with every new TV role she took), capturing the fusion of politics and entertainment she was instrumental in forging. —OG\n\t\t\n\t\t\t\n\t\t\t\n\tBelow the Clouds\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Courtesy of Venice Film Festival\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tThere are many ways to live around an active volcano, and Gianfranco Rosi’s humming, keen-eyed study of those who live in the shadow of Mount Vesuvius is interested in all of them. The Italian filmmaker spent three years filming in and around Naples to create this layered and rewarding study of modern living amid remnants of ancient history. Near Vesuvius, fumaroles release pale breaths of volcanic gas and steam, but there’s man-made smoke, too, of the type that provides steady work for the members of Naples’ put-upon fire department. They’re the most prominently featured of several municipal bodies surveyed here, in a way that lends “Below the Clouds” something of Frederick Wiseman’s inside-out interest in how cities tick. —GL\n\t\t\n\t\t\t\n\t\t\t\n\tBilly Joel: And So It Goes\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Art Maillett/Sony Music Archives/Courtesy HBO\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tSusan Lacy and Jessica Levin’s luscious longform movie traces its subject’s life and career with disarming candor, testifying to the contradictions that fueled Billy Joel’s incandescent pop. What takes you by surprise is the film’s emotional gravity. “And So It Goes” is not a once-over-lightly, papering-over-the-valleys portrait of a pop star. It includes plenty of warts, but more than that it shows you how Joel’s complicated and not always happy life was poured into his irresistible and in many ways deceptively buoyant pop. The movie pays tribute to how Joel fused the confessional vibe of the early-’70s singer-songwriter boom with the musical architecture of Tin Pan Alley, and it captures how he arrived as a romantic pop star who remained, to a fault, a pugnacious fighter. —OG  \n\t\t\n\t\t\t\n\t\t\t\n\tBLACKNWS: Terms & Conditions\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Courtesy of BLKNWS™\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tDirector Kahlil Joseph radically reimagines the world through a Black lens, while self-reflexively observing the difficulties of doing so. His film is a pulsing, essayistic docu-fiction that defies categorization. It unfolds partially on a futuristic, polygonal transatlantic vessel, but this is merely the anchor for an elliptical collage of personal and political history. Among the film’s touchstones is techno music, a genre whose Black origins are often obscured, but which Joseph deploys to tremendous effect, turning the sounds of Detroit first-wave artists into guiding tempos that take on the ebb and flow of a carefully curated album. From academic talks to viral videos to debates on modern museums, all merged with the audio-visual mischief of late-period Godard, “BLKNWS” combines footage from a vast spectrum of experience and influence, and the effect is at once thought-provoking and soul-stirring. —Siddhant Adlakha\n\t\t\n\t\t\t\n\t\t\t\n\tCheech & Chong’s Last Movie\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Courtesy of Keep Smokin'\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tThe fabled stoner comedy duo get their own documentary, and it’s good enough to give you a contact high. We learn about their life stories (Chong was an accomplished musician in a group signed by Motown; Cheech was passionate about being a potter), their beyond-random meet-up, the way they invented a vibe of comedy that’s now as mainstream as the cannabis outlet down the block…and, tying the film together in a rather delightful way, we get the two of them today, driving through the desert in a Rolls Royce with a marijuana-leaf hood ornament, still smokin’ and still at war. Getting high was once thought of as a revolutionary activity, a path to freeing your mind from excessive, conventional rationality. Before long, though, it had become just another zoned-out hedonistic middle-class pastime. “Cheech & Chong’s Last Movie” celebrates how Cheech and Chong made comic gold out of the pivot point between those two things. They made us laugh at how we’d all learned to stop worrying and love the bong. —OG\n\t\t\n\t\t\t\n\t\t\t\n\tCome See Me in the Good light\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Brandon Somerhalder\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tA luminous portrait of two poets navigating an incurable diagnosis. Director Ryan White has made a movie that mirrors how he felt when he first arrived at the home of spoken word artist Andrea Gibson, who had been diagnosed with incurable ovarian cancer, and their spouse, poet Megan Falley. One could chalk up the film’s intimacy to good old-fashioned vérité, but there’s something more lyrical at work. Gibson and Falley don’t pretend that White and his crew aren’t in their home. On the contrary, they treat the filmmakers — and therefore us — with amity. And in the midst of it all, poetry proves essential. Through their words and deeds, Gibson offers gentle tutorials of language, meaning, hurt, redemption. The film invites us to ask: What is poetry? How does it make its meaning? Why does it offer solace like so few other art forms? —Lisa Kennedy   \n\t\t\n\t\t\t\n\t\t\t\n\tCover-Up\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: The New York Times/Redux\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tLaura Poitris’s enthralling portrait of Seymour Hersh is a movie that makes you ask: Where have all the investigative reporters gone? Fifty years later, the stories that Hersh reported — like the My Lai massacre — are now iconic. Yet in charting the evolution of his career, the documentary captures how uncovering corruption is the opposite of automatic; it’s always a mountain to climb. Terse, buttoned-down, owlishly inquiring behind his horn-rims, with a clean-cut Middle American conventionality, Hersh was, and is, a spiky customer, but he wasn’t a pie-in-the-sky purist agitator. He was a regular guy who simply wanted the truth to get out there. The key lesson of “Cover-Up” is that when it comes to crucial stories of corruption, just about every situation is layered, booby-trapped, woven with deception. The true reporters, like Hersh, are those who dare to expose what they’re told not to. —OG\n\t\t\n\t\t\t\n\t\t\t\n\tDevo\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Janet Macoska\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tChris Smith’s film about the jump-suited robo-rock avatars of de-evolution is as much fun as its subject. It’s 90 minutes of dazzlingly edited surrealist audio-visual candy, as it traces Devo’s music and videos, their roots in the embers of the counterculture, their freak success, and their big message, which remains prophetic and often misunderstood. The band’s leaders, Mark Mothersbaugh and Gerald Casale, had a major insight: that in the new America, rebellion had become part of The System, so that even “progressive” people were now living in a world of cookie-cutter orthodoxy, of obedience. The band’s real theme wasn’t “de-evolution” — it was fascism. Yet the documentary captures how this once-and-still-subversive message was embodied in songs of extraordinary catchy power, from “Come Back Jonee” to “Beautiful World,” a gripping goose-step anthem that haunts you with its irony. —OG  \n\t\t\n\t\t\t\n\t\t\t\n\tDrop Dead City\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Courtesy of DOC NYC\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tPeter Yost and Michael Rohatyn’s riveting look at how New York City nearly went bankrupt in 1975: a cataclysm that echoes into the current moment. The film’s archival footage, dominated by politicians and bankers and city officials, is a saga of bad ties, bad shirts, bad haircuts, and bad lighting — the real-life New York caught by the Sidney Lumet of “Serpico” and “Dog Day Afternoon.” And that’s not to mention the bad money. There was a level of fiscal irresponsibility that had gone for far too long (records stuffed into a thousand different drawers, no bookkeeping). Yet the underlying problem was that New York was still a place that believed in however much government it took to help its citizens succeed. It was going to help its workers and residents, even if it couldn’t afford to do so. “Drop Dead City” unfolds like a thriller, but it’s also a wonkish and fascinating glimpse into how the city’s legendary crisis revealed a crack in the liberal dream. —OG\n\t\t\n\t\t\t\n\t\t\t\n\tIt’s Never Over, Jeff Buckley\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Courtesy of Sundance Film Festival\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tAmy Berg’s film reverently captures the late rocker who sang like Nina Simone crossed with Robert Plant crossed with the voice of an angel. He had a singular gift (it’s as if he’d been given a different instrument from everyone else in pop). Yet Jeff Buckley, for all his cult mystique, was as much a rock ‘n’ roller as he was a hipster chanteuse, and watching the movie, it’s clear that had he lived he could have been a staggeringly huge star. Skinny and raw-boned, with dark eyes and a razory grin, he was a real James Dean: the kind of glamorously tousled rock star they don’t make anymore. And Berg colors in the underpinnings of his life that lent it a nearly mythological aura. Buckley’s father was Tim Buckley, the late-’60s folk rocker who ditched Jeff before he was even born. Jeff’s death, in 1997, was a tragic accident, but what he did in the end was to mirror his father’s abandonment — of the world, and of Jeff. —OG\n\t\t\n\t\t\t\n\t\t\t\n\tThe Makings of Curtis Mayfield\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Courtesy of SXSW\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tH.E.R., the 27-year-old R&B pop star, directed this irresistible celebration of the ’70s funk-soul legend, and it’s not like other music docs. It’s structured as a series of conversations between H.E.R. and a handful of the musicians who bear the influence of Mayfield’s bravura (Dr. Dre, Maxwell, Mary J. Blige, John Legend); they take you from the incandescent “Move On Up” through his soundtrack to “Super Fly” (like the music for “Saturday Night Fever,” practically a movie unto itself) through his incalculable influence on the social-protest soul music of the ’70s. The film includes plenty of archival footage of Mayfield: concert clips, performances on “Soul Train” and “Hullabaloo,” interviews. And what comes across is the fascinating way that his persona simply didn’t fit the image of the revolutionary music star he was. He was short, with a rabbity grin and small rectangular-wire-framed glasses, and his look didn’t match the voice that came out of it. Yet that voice soared to the heavens. And no artist of the time ever plugged you more beautifully into what’s going on. —OG \n\t\t\n\t\t\t\n\t\t\t\n\tMr. Nobody Against Putin\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Courtesy of Sundance Film Festival\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tA powerful and poignant film that chronicles the disturbing militarization of Russian schools in the wake of the war in Ukraine. Working from Pavel “Pasha” Talankin’s first-hand footage, director David Borenstein exposes the extreme tactics employed by the Russian government to indoctrinate students. With the snappy casualness of a day-in-the-life vlog, Pasha, a charismatic Russian teacher who serves as planner and videographer for all his school’s events, introduces his peculiar small town: Karabash, known as one of most toxic places on Earth due to a copper smelting plant, but a place where Pasha has built a safe haven within his classroom. Yet when Putin passes a law that will sentence anyone deemed a “traitor to the motherland” to life in prison, the stakes of his ongoing vérité diary gain alarming significance. —Carlos Aguilar\n\t\t\n\t\t\t\n\t\t\t\n\tMr. Scorsese\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Courtesy of Apple\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tRebecca Miller’s five-part portrait of Martin Scorsese is one of the most electrifying movies about a movie director ever made. It burns the Scorsese mythology down to essential moments — of invention and audacity, of addiction and career death (which happened to him twice), of survival and triumph fueled by genius. And it teems with extraordinary stories that make you feel like you’re seeing all of this for the first time. Miller hunts down and interviews the gangster who was the model for Robert De Niro’s Johnny Boy in “Mean Streets.” She captures, with unprecedented candor, how Scorsese’s descent into cocaine fever in the mid-to-late ’70s nearly killed him; how De Niro convinced him to make “Raging Bull” to save him (the film was about Jake LaMotta’s lack of faith, the very quality that had fueled Scorsese’s addiction); how Scorsese carried around so much rage that during his marriage to Isabella Rossellini, he would trash entire rooms; how he shot “The Last Temptation of Christ” on no budget doing 25 set-ups a day; and on and on in a roller-coaster of sin and despair and creativity and redemption. What’s special about the documentary is that Scorsese’s relationship to his own film protagonists has always been so personal (every one of them…is him) that “Mr. Scorsese” achieves the intensity of a Scorsese film, only with Marty himself as the hungry, tormented, high-flying hero. —OG  \n\t\t\n\t\t\t\n\t\t\t\n\tMy Undesirable Friends — Part 1: Last Air in Moscow\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Courtesy of New York Film Festival \t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tAt nearly five-and-a-half hours (divided into five chapters), Julia Loktev’s film is less typical docu-journalism and more akin to “War and Peace.” What starts off as a look at Loktev’s friends and colleagues being branded “foreign agents” by the Russian state evolves in real time, as Russia invades Ukraine and Loktev winds up shooting much of the movie on her outdated iPhone X, yielding stark realistic hues and an intimacy seldom seen in political documentaries. The journalists’ camaraderie takes center stage in the film’s second half, which builds to stunning climactic moments of the “I can’t quite believe this was captured on camera” variety. Loktev’s immersion in the action provides a pulse-pounding quality when things come crumbling down, resulting in an intimate, enormous, and urgent political portrait of speaking truth to power, and speaking it together. —SA\n\t\t\n\t\t\t\n\t\t\t\n\tThe New Yorker at 100\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Courtesy of Telluride Film Festival\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tA nimble and infectious portrait of the quintessential magazine. In just 96 minutes, Marshall Curry’s film brings off a trick more challenging than it looks (in that way, it’s a lot like the magazine). It lays out the fabled history of The New Yorker and colors in its larger cultural significance. It gives us a close-up, between-the-lines portrait of how The New Yorker gets put together each week and folds all this into the enticing story of the magazine’s vibe and aesthetic: the way its commitment to truth and beauty are flip sides of the same coin, and how its manner of looking at the world, while up-to-the-minute and fully alive, is slyly rooted in the analog sanity of an earlier time. And it shows us David Remnick, the magazine’s editor since 1998, doing his daily two-step of menschy straightforwardness and Machiavellian demand. It also spotlights those moments (John Hersey’s “Hiroshima,” Rachel Carson’s “Silent Spring,” Truman Capote’s “In Cold Blood”) when the magazine shifted the culture and altered the essence of journalism. The film shows us that we might need The New Yorker now more than ever, even as the magazine undergoes the ultimate stress test: Is there a place in our fractious civilization for a publication this civilized? —OG  \n\t\t\n\t\t\t\n\t\t\t\n\tOne to One: John & Yoko\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Courtesy of Venice Film Festival \t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tA revelatory inside look at John Lennon, in concert and in the world. It deals with the period just before the Lost Weekend, starting in August 1971, when John and Yoko moved from their country estate outside London to New York City, where they spent 18 months living in a small apartment in the West Village (where they spent most of their time watching television). The film takes its title from a pair of 1972 benefit concerts Lennon gave at Madison Square Garden with the Plastic Ono Elephant’s Memory Band, and what’s staggering, seeing it now, is what a powerful kick the music delivers; it gives the film shape and propulsion. But so does the way that director Kevin Macdonald, keying off Lennon’s TV habit, presents images of the period as a heady channel-surfing montage. He also allows us to listen in on Lennon’s private phone calls, giving us a sense of the former Beatle in all his contradictions: a radical who was also a TV couch potato; a powerful rock star who devoted himself to pleasing his avant-garde wife, even as he held onto his libertine edge; a dyed-in-the-wool Brit who became the ultimate New Yorker. —OG\n\t\t\n\t\t\t\n\t\t\t\n\tOrwell: 2+2 = 5\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Courtesy of Neon\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tNot as great as many have said, but still good, Raoul Peck’s meditation on George Orwell and “Nineteen Eighty-Four” makes a central point of how timely Orwell’s message is now. That might seem a vital and inevitable thing to say in 2025, as the spirit of totalitarianism rises around the globe, most dramatically in the United States. Yet even as the film highlights the relevance of Orwell’s vision of oppression, it gives short shrift to what was most brilliant and indelible about “Nineteen Eighty-Four” — its deconstruction of totalitarianism’s mental strategy, its way of breaking people down through the acrobatics of mass insanity. (The book is a head trip about fascist head-tripping.) That said, “Orwell: 2+2 = 5,” while it doesn’t attain the rich depths of Peck’s “I Am Not Your Negro,” offers a soulful portrait of Orwell’s tumultuous life, and an instructive look at how his sinister fantasia of existence in a prison society emerged from it. —OG\n\t\t\n\t\t\t\n\t\t\t\n\tPee-wee as Himself\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Michael Ochs Archives/Getty Images\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tThe late Paul Reubens opens up — when he doesn’t close up — in an expansive portrait. Matt Wolf’s two-part documentary gives the man behind Pee-wee Herman a platform to come out of the closet, but it doesn’t mask the tension between a filmmaker and a subject who has understandable trust issues. At 200 minutes carved from over 40 hours of interviews, “Pee-wee as Himself” is the last word on a life and career that retained secrets and mysteries even after attaining an invasive degree of celebrity. The film does justice to its subject’s sui generis artistry — a blend of experimental performance, broad comedy and high queer camp that caught imaginations of all ages — while giving scrutiny to the offscreen legal troubles that unfairly threw his career off-course. Reubens is a generous, engaging raconteur on all such matters, while allowing himself to be drawn halfway out on a personal life he kept close to his chest up until his death. But it’s the brittle, unsettled dynamic of the interview footage that makes the film unusual and engrossing, as Wolf and Reubens grapple for control of a story that each wants to tell very differently. —GL \n\t\t\n\t\t\t\n\t\t\t\n\tThe Perfect Neighbor\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Courtesy of Netflix\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tReconstructing an escalating dispute from video recordings made by 911 responders, director Geeta Gandbhir reveals how white citizens attempt to leverage the police against people of color. Her film focuses on the shocking case of a local Florida grouch, Susan Lorincz, who went all Clint Eastwood on a trespasser. That’s an admittedly flip way to describe a real-life tragedy that resulted in the death of an African American single mom like “AJ” Owens. Then again, movies like “Gran Torino” have a way of encouraging violent solutions. Both formally innovative and philosophically necessary, “The Perfect Neighbor” is a true-crime documentary that tensely recreates this dispute — from the first 911 call to the final courtroom verdict — almost entirely from official footage, most of it taken from police bodycams. The police come off here looking like the good guys, doing their best to defuse the situation. If only Owens had been the one to call them, things might have turned out differently. —Peter Debruge\n\t\t\n\t\t\t\n\t\t\t\n\tPredators\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Courtesy of Sundance Film Festival\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tDavid Osit’s quietly trenchant film examines the ghoulish NBC hit “To Catch a Predator” and its cultural legacy over two decades, querying the show’s ethics, its insight, and its effectiveness as an instrument of justice. The premise was so simple — naive, even — that it’s surprising “To Catch a Predator” worked for as long as it did. The producers would identify men seeking sex with minors in online chatrooms, using decoy actors to lure them to a secretly camera-rigged house where they would be ambushed by host Chris Hansen and, later, local law enforcement. Psychological probing was never on the agenda. The slick, righteous pull of the episodes stands in stark contrast to remarkable, untelevised raw footage that Osit has uncovered of police rather more temperately interrogating the show’s targets. Dehumanization was the easier, grabbier approach — at least, until the infamous incident where a botched sting culminated in the suicide of the perpetrator. “Predators” is slow to condemn but precise and insistent in its moral inquiry of what the show has wrought — and its lingering impact on participants, viewers, and abuse survivors. —GL\n\t\t\n\t\t\t\n\t\t\t\n\tRiefenstahl\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: ©Kino International/Courtesy Ev\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tA valuable and arresting portrait of Leni Riefenstahl that looks closer at the question: Was the infamous, virtuosic Nazi filmmaker complicit in Nazi crimes? Riefenstahl made her films for Hitler, who she was personally chummy with, so there’s no doubt that on some level she made a deal with the devil. But what was the deal? What, exactly, did she know? Andres Veiel, the director of “Riefenstahl,” was given access to the archives of the Riefenstahl estate, and this allows him to showcase a great deal of material that has never been seen in public before: photographs, diaries, tape recordings of Riefenstahl’s phone conversations. Here are images of Reifenstahl in the company of Hitler, the two smiling and clasping hands. Here’s a record of her relationship with Joseph Goebbels, the Nazi Minister of Propaganda who wooed her and tried, in his apartment, to sexually assault her. “Riefenstahl” presents more evidence than we’ve seen up until now that Riefenstahl was embedded in the regime. Yet the evidence remains circumstantial. And what is perhaps most telling about the film is that in its indictment of Riefenstahl, it insists, as Susan Sontag did, in using her work as a transcendent expression of her guilt. —OG\n\t\t\n\t\t\t\n\t\t\t\n\tA Simple Soldier\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Courtesy of TIFF\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\t“Should I fight or should I film?” When the war in Ukraine began, Artem Ryzhykov made a decision: He would fight and he would film. He became a Ukrainian filmmaker soldier, steeped in the trenches but relentlessly holding his camera, carving out the existential historical record of what went on. The images in “A Simple Soldier” are open-eyed, harrowing, indelible. We’re right there in the middle of the chaos and the national breakdown. The film colors in much of what we’ve heard and read and seen about the war in Ukraine, only this one captures a slice of war that’s almost vividly ordinary. The film’s most haunting comment comes from a woman who says, “I don’t know why we were torn out of ordinary life. None of us have a spare life.” And that’s the film’s wrenching upshot. We’re watching a citizen record a life that has been subsumed in the totality of war. Near the end, when Artem lets out a scream, it’s like hearing the inner anguish of Ukraine, a nation that has been torn out of the very life it’s fighting for. —OG\n\t\t\n\t\t\t\n\t\t\t\n\tSly Lives! (aka The Burden of Black Genius)\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Courtesy of Sundance Film Festival\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tAmir “Questlove” Thompson’s dazzling documentary levels up from “Summer of Soul,” exploring the life and legacy of Sly Stone in a kaleidoscopic and profound way. You can feel Questlove working furiously to get it all in — the story of how Sly became the rock star of his moment, smashing through boundaries of sound and image, scaling the peak of a new kind of Black fame, to the point that he had nowhere to go but down. As sexual as Mick Jagger, he took the bottom-heavy, on-the-beat DNA invented by James Brown and gave it wings, elevating funk by fusing it with pop and rock ‘n’ roll, until it was more thrilling than the sum of its parts. For all the grit of his aesthetic, he had a joy he elevated into an ideology. But then he destroyed his success with drugs; after a while, he seemed to vanish. And it’s one of the headier themes of the movie that Sly, having changed an art form by inventing the template for so much of the music of the ’70s, was made vulnerable by his success in a way that (the film suggests) a white pop star would not have been. Without making any excuses for him, the movie explores the war in his soul. —OG\n\t\t\n\t\t\t\n\t\t\t\n\tStiller & Meara: Nothing Is Lost \n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Courtesy of Apple TV+\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tBen Stiller directs an unexpectedly moving documentary about his famous comedian parents. It’s a portrait of Jerry Stiller and Anne Meara, the husband-and-wife comedy team who first came to prominence on “The Ed Sullivan Show” (they made their debut appearance there in 1963) and then became a popular nightclub and TV-variety-show staple in the ’60s and ’70s. There was an edge of conviction to their act, because they drew it from their own lives, and their love and (at times) acrimony would spill right onto the stage. The movie, after a while, begins to morph from a likable entertainment-world profile into something more resonant — a nearly novelistic portrait of Jerry Stiller and Anne Meara’s life-and-art marriage. —OG\n\t\t\n\t\t\t\n\t\t\t\n\tThe Stringer\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Courtesy of Sundance Film Festival\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tConspiracies are a dime a dozen in dramatic features, but when a documentary unravels a conspiracy, it can take on the kind of hushed suspense that those films used to have and rarely do anymore. Bao Nguyen’s riveting film is framed as a mystery: an inquiry into the true authorship of the famous Vietnam War photograph, taken on June 8, 1972, in the town of Trảng Bàng, that showed the aftermath of a napalm attack — a 9-year-old girl named Phan Thį Kim Phúc running, naked, toward the camera, her arms outstretched like broken wings, her mouth open in a scream of agony. Who took the historic photo known as “Napalm Girl”? Was it Nick Út, who the photo was credited to and who won the Pulitzer Prize for it? Or was it Nguyen Thanh Nghe, a freelance photographer who was there that day as well? “The Stringer” is rapt, urgent, and absorbing, a potent human story of daunting cultural resonance. And at the climax, when the filmmakers hand over their evidence to a group of forensic experts in Paris, who do a meticulous computer-based analysis of which figures stood precisely where and when during those crucial few minutes in Trảng Bàng, it really is like combing through the Zapruder film, looking for that crucial visual detail that will bring the hidden reality into focus. —OG\n\t\t\n\t\t\t\n\t\t\t\n\t2000 Meters to Andriivka\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Courtesy of Cinetic\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tA shattering expedition to the frontline of the war in Ukraine. The Oscar-winning Mstyslav Chernov follows up 2023’s “20 Days in Mariupol” with another full-tilt, you-are-there plunge into the living hell of war, this time from the perspective of Ukrainian soldiers. Like its predecessor, this is an angry, viscerally illustrative film — but it’s a weary one too. Some of the soldiers Chernov follows into battle remain gung-ho about defeating the enemy; others, like the filmmaker himself, voice fears that there’s no end in sight. Amid the turmoil, Chernov’s camera captures small, poignant character sketches of the Ukrainian men putting their lives on the line to potentially win back one patch of land. “Andriivka” is less tersely journalistic and more pensively devastating than “Mariupol” — a film of its moment, and an agonizingly extended moment at that.  —GL \n\t\t\n\t\n\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Best Documentaries of 2025",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/FotoJet-72.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-30T15:30:00.000Z",
      "dateModified": "2025-12-30T15:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Stranger Things’ Play Breaks Broadway House Record With $2.5 Million Over Christmas",
    "url": "https://variety.com/2025/theater/news/stranger-things-play-broadway-box-office-record-1236619506/",
    "image": "https://variety.com/wp-content/uploads/2025/12/14_STRANGER_THINGS_BROADWAY_S_0378_PJZEDIT_v002.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-30T15:00:00.000Z",
    "description": "\n\tThe release of the fifth and final season of “Stranger Things” seems to have given a boost to “Stranger Things: The First Shadow,” the Broadway play",
    "body": "\n\tThe release of the fifth and final season of “Stranger Things” seems to have given a boost to “Stranger Things: The First Shadow,” the Broadway play that serves as a prequel to the Netflix sci-fi series.\n\n\t“Stranger Things: The First Shadow” grossed $2,510,948 at the box office across nine shows during the week ending with Dec. 28, marking the highest nine-show total ever achieved at the Marquis Theater, where the play has been open since April.\n\t\n\n\tAmid the debut of “Stranger Things” Season 5 — with four episodes on Thanksgiving, three on Christmas and the series finale yet to come on New Year’s Day — ticket sales have reached their highest point the production first launched. The same is true of the “First Shadow” production running in London’s West End, where the play had its world premiere in 2023.\n\n\n\t“Stranger Things: The First Shadow” is set in Hawkins, Ind. in 1959, when “the Creel family seeks a fresh start, especially their teenage son Henry, who is eager to escape his troubled past,” according to the play’s official description, which continues: “Initially, things go well — he finds friendship and joins the school play. But when a wave of shocking crimes strikes the town, Henry is forced to confront a terrifying truth: is there something inside him that connects him to the horrors unfolding around him?”\n\n\tJamie Campbell Bower, who plays Henry Creel aka Vecna in the TV series, appeared in a recent performance of “Stranger Things: The First Shadow” for the final scene in celebration of “Stranger Things” Season 5. (His cameo took place on Dec. 19, before the window that achieved the Marquis Theatre box office record.)\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Stranger Things’ Play Breaks Broadway House Record With $2.5 Million Over Christmas",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/14_STRANGER_THINGS_BROADWAY_S_0378_PJZEDIT_v002.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-30T15:00:00.000Z",
      "dateModified": "2025-12-30T15:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Shrinking’ Season 3 Trailer: Michael J. Fox Returns to Acting, Joking About Parkinson’s Alongside Harrison Ford",
    "url": "https://variety.com/2025/tv/news/michael-j-fox-shrinking-season-3-trailer-1236620277/",
    "image": "https://variety.com/wp-content/uploads/2025/12/Screenshot-2025-12-30-at-9.04.25-AM.png?crop=40px%2C0px%2C1488px%2C836px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-12-30T15:12:17.000Z",
    "description": "\n\tThe Season 3 trailer for the Apple TV+ comedy “Shrinking” teases Michael J. Fox’s return to acting after stepping away from his career in 2020 due t",
    "body": "\n\tThe Season 3 trailer for the Apple TV+ comedy “Shrinking” teases Michael J. Fox’s return to acting after stepping away from his career in 2020 due to speech issues associated with his Parkinson’s diagnosis.\n\n\tIn the trailer, he’s shown in the waiting room of a medical facility sitting near Dr. Paul Rhoades (Harrison Ford).\n\n\t“What are you in for?” asks Fox’s character, whose name is not yet known. “Parkinson’s. You?” Paul responds. Dryly, Fox says, “Just a haircut,” and they both laugh.\n\t\n\n\tFord’s character in “Shrinking” has had Parkinson’s since Season 1, though he initially tries to conceal it and the severity of his symptoms before being forced to tackle the disease head-on over time.\n\n\n\tFox’s casting in “Shrinking,” which was announced in May, reunites him with series co-creator Bill Lawrence, as Fox was the star of Lawrence’s ABC sitcom “Spin City” for four seasons until departing in 2000 because of Parkinson’s-related issues. Additionally, Fox had a memorable guest arc on “Scrubs,” also created by Lawrence.\n\n\tThe trailer also builds on the reunion between series co-creator and star Jason Segel and his “How I Met Your Mother” co-star Cobie Smulders, who plays Jimmy’s (Segel) new love interest, Sofi. Smulders first joined the series for a brief guest appearance in Season 2. In the new trailer, after Sofi swings by Jimmy’s house then says goodbye, Liz (Christa Miller), Derek (Ted McGinley) and Sean (Luke Tennie) chide him for not asking her out. Also in the trailer, Jimmy deals with his emotions as his daughter, Alice (Lukita Maxwell) prepares to leave for college.\n\t\n\n\tSee the trailer below.\n\n\n\n\n\tMore to come…\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Shrinking’ Season 3 Trailer: Michael J. Fox Returns to Acting, Joking About Parkinson’s Alongside Harrison Ford",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/Screenshot-2025-12-30-at-9.04.25-AM.png?crop=40px%2C0px%2C1488px%2C836px&resize=1000%2C563"
      ],
      "datePublished": "2025-12-30T15:12:17.000Z",
      "dateModified": "2025-12-30T15:12:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chris Hemsworth’s Thor Stars in Second ‘Avengers: Doomsday’ Teaser, Praying for Daughter’s Safety Before One More Battle",
    "url": "https://variety.com/2025/film/news/thor-avengers-doomsday-teaser-chris-hemsworth-1236617295/",
    "image": "https://variety.com/wp-content/uploads/2025/12/Thor.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-30T14:05:22.000Z",
    "description": "\n\tThe second “Avengers: Doomsday” teaser trailer has been released, and this time it focuses on Chris Hemsworth‘s Thor.\n\n\tThe new teaser comes a week ",
    "body": "\n\tThe second “Avengers: Doomsday” teaser trailer has been released, and this time it focuses on Chris Hemsworth‘s Thor.\n\n\tThe new teaser comes a week after Chris Evans’ Captain America was featured in the first “Doomsday” trailer that played during the previews of “Avatar: Fire and Ash” screenings. That first teaser revealed that Cap would return for “Doomsday” and that he surprisingly has a child. Similarly, the Thor teaser revolves around him praying to keep his adopted daughter, Love (who was introduced in 2022’s “Thor: Love and Thunder”), safe as he once again answers the call to battle.\n\t\n\n\tThe teaser starts out in a sunny, calm forest, similar to the idyllic farmhouse of the Captain America teaser. Thor prays to his late father, the Norse god Odin, for the strength to keep his new daughter safe as he presumably prepares to join the Avengers to take on Robert Downey Jr.’s Doctor Doom in “Doomsday.” The teaser shows a brief glimpse of Love, who’s grown up a bit from “Love and Thunder.” Thor, dressed in casual clothes, kisses her on the forehead while she lays in bed and his serious narration continues playing.\n\n\n\tLove (played by Hemsworth’s real-life daughter India) is actually the child of the villain Gorr the God Butcher (Christian Bale). In “Love and Thunder,” Gorr seeks out revenge on every god after his prayers to save his late daughter were left unanswered. In the end, however, Gorr gives up his vengeful quest and manages to resurrect Love before he dies. In his final moments, Gorr makes Thor promise to raise Love as if she were his own daughter. Love then joins Thor on his ensuing adventures and wields his Stormbreaker hammer.\n\t\n\n\tHemsworth had already been announced to star in “Avengers: Doomsday,” alongside many other Marvel actors, earlier this year. He’ll take on Doctor Doom with help from Evans, Anthony Mackie, Danny Ramirez, Sebastian Stan, Paul Rudd, Tom Hiddleston, Letitia Wright, Winston Duke and Simu Liu. “Doomsday” will bring together not only the Avengers, but “Fantastic Four” stars Pedro Pascal, Vanessa Kirby, Joseph Quinn and Ebon Moss-Bachrach, plus the “Thunderbolts” cast Florence Pugh, David Harbour, Wyatt Russell, Hannah John-Kamen and Lewis Pullman. Jumping from Fox’s “X-Men” universe, the ultimate team-up movie will also feature Patrick Stewart, Ian McKellen, Kelsey Grammer, Alan Cumming, James Marsden, Channing Tatum and Rebecca Romijn.\n\n\tWatch the teaser below:\n\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chris Hemsworth’s Thor Stars in Second ‘Avengers: Doomsday’ Teaser, Praying for Daughter’s Safety Before One More Battle",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/Thor.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-30T14:05:22.000Z",
      "dateModified": "2025-12-30T14:05:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Stranger Things 5’ Finale Trailer: Eleven Prepares for the Final Fight Against Venca as Netflix Series Ends With Two Hour-Plus Last Episode",
    "url": "https://variety.com/2025/tv/news/stranger-things-5-finale-trailer-eleven-vecna-1236617683/",
    "image": "https://variety.com/wp-content/uploads/2025/12/stranger.png?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-30T14:02:00.000Z",
    "description": "\n\tNetflix has released the trailer for the “Stranger Things 5″ finale, which debuts in theaters and on the streamer Dec. 31.\n\n\tTitled “The Rightside U",
    "body": "\n\tNetflix has released the trailer for the “Stranger Things 5″ finale, which debuts in theaters and on the streamer Dec. 31.\n\n\tTitled “The Rightside Up,” the finale is the eighth episode in the show’s fifth and final season. Netflix released the first four episodes of Season 5 on Thanksgiving Day as “Stranger Things 5: Volume 1″ and then the subsequent three episodes on Christmas as “Volume 2.”\n\n\n\tVolume 2 concluded with Episode 7, where Max (Sadie Sink), successfully brought back to consciousness, reveals archvillain Vecna’s plan to merge the world with a parallel dimension on the other side of the Upside Down, dubbed the Abyss. The characters devise a plan to enter the Abyss, rescue Vecna’s kidnapped children and destroy it with a bomb. In the final scene, Vecna— still disguised as the human Henry Creel—has his brainwashed victims join hands in a spellbinding séance as they are transported to the Abyss. \n\t\n\n\tMatt and Ross Duffer created “Stranger Things” nearly a decade ago, and Netflix released the first season in July 2016. The paranormal mystery became an instant phenomenon, and Seasons 2 and 3 were released in 2017 and 2019, respectively. Like Season 5, Season 4 was released in two separate volumes in May and July of 2022. The series has also spawned a stageplay, “Stranger Things: First Shadow,” which premiered on London’s West End in 2023 and is currently playing on Broadway.\n\n\tIn a recent interview with Variety, the Duffers said one of the big outstanding questions for the finale is “how can there be a happy ending” for Eleven, given she will still be hunted by the military even if she manages to save the world? They explained that on a thematic level, Eleven’s arc is a push and pull between Mike’s idealist outlook and Kali’s cynical worldview.\n\t\n\n\t“There is the supernatural threat, which is represented by Vecna this season. But the military has always posed a threat, from Season 1 on. Even when Brenner is gone, he gets continually replaced by someone else. In this case, in Season 5, by Kay,” said Ross Duffer. “So we needed Kali to represent maybe a more pessimistic, but perhaps realistic, version, compared to Mike’s worldview of we’re gonna have butterflies and rainbows. And Kali’s going, ‘How is this going to work? And what is the solution here, that you can live a normal life?’ That’s really a huge part of Eleven’s journey this season.”\n\n\t“Stranger Things” is one of Netflix’s most popular shows of all time, and it recently surpassed 1.2 billion total views on the streamer. \n\n\tThe finale has a runtime of two hours and five minutes and will be the franchise’s first big-screen outing, playing in more than 500 theaters across the United States and Canada. The first screenings will begin on New Year’s Eve at 5 p.m P.T., coinciding with the episode’s release on Netflix. It will play in theaters through Jan. 1. According to Ross Duffer, 1.1 million people have RSVP’d to experience the “Stranger Things 5” finale in theaters. He also claimed that 3,500 showtimes in more than 620 theaters are sold out.\n\n\tCheck out the trailer below. \n\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Stranger Things 5’ Finale Trailer: Eleven Prepares for the Final Fight Against Venca as Netflix Series Ends With Two Hour-Plus Last Episode",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/stranger.png?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-30T14:02:00.000Z",
      "dateModified": "2025-12-30T14:02:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Spain’s Atresmedia Cine Unveils 2026 Releases Including Santiago Segura’s ‘Torrente Presidente’ and Los Javis’ ‘La Bola Negra’ ",
    "url": "https://variety.com/2025/film/global/atresmedia-cine-torrente-presidente-la-bola-negra-1236620242/",
    "image": "https://variety.com/wp-content/uploads/2025/12/Father-There-Is-Only-One-5.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-30T13:40:41.000Z",
    "description": "\n\tAtresmedia Cine, the production powerhouse of Spanish broadcast network Atresmedia, has unveiled its 2026 release slate and plans to shoots 10 movie",
    "body": "\n\tAtresmedia Cine, the production powerhouse of Spanish broadcast network Atresmedia, has unveiled its 2026 release slate and plans to shoots 10 movies over next year. \n\n\tThat matters. Since 2001 when Spain first obliged local networks to invest 5% of revenues in European films and 60% of that in national productions, its two free-to-air TV operators, Atresmedia and Mediaset España, have not only become major production partners on a substantial number of the most significant films made this century in Spain via Atresmedia Cine and Telecinco Cinema but their network parents have put their weighty marketing muscle behind the movies. \n\t\n\n\tThe result has been to update for the better Spanish audiences’ view of local movies, dismissed since the Spanish Civil War through the ‘60s as “españoladas” – movies whose local reference and relevance did not compensate for second-rate production standards.\n\n\n\tEven in a streaming service world, broadcast networks’ investment and marketing punch still count. Over 2025, Atresmedia Cine productions punched €25 million ($29.5 million) at Spain’s box office, accounting for an over 30% share of Spanish films’ total annual theatrical gross, it announced Dec. 24. \n\n\tThat’s thanks in large part to an ongoing production alliance with Bowfinger International Pictures, headed by Santiago Segura and producer María Luisa Gutiérrez, behind “Father There Is Only One 5,” which scored €13.4 million ($15.8 million) for distributor Sony in 2025 in Spain, by far the biggest box office trawl for any Spanish film. \n\t\n\n\tThe final instalment of the numerous family saga co-written and directed by and starring Segura as a hapless father, in “Father There Is Only One 5”  he now confronts the opposite of an empty nest syndrome – a full nest of six children, his oldest daughter’s boyfriend, his father and wife’s mother and other in-laws. And nobody seems to be thinking about leaving. \n\n\tTiming is all, Gutiérrez explained in an on-stage conversation with Variety at this month’s Ventana Sur in Buenos Aires.  \n\n\tIn 2024, Sony asked Bowfinger to produce a Spanish version of “Death at a Funeral” to release Easter Week of 2025: a tight turnaround. Gutiérrez realized, however, that some of Spain’s top actors would be available in the summer, since on holiday. Released on time and co-produced with Atresmedia Cine, “Un funeral de locos” took €3.0 million ($3.5 million) at the Spanish box office, ranking No. 7 among 2025 local bows. \n\n\t“Torrente President”: Spain’s Biggest Box Office Bet\n\n\tAmong Atresmedia Cine’s next year Spanish premieres, bets are off as to which will make most money. \n\n\tEarly December, Segura confirmed a March 13 date for “Torrente Presidente,” the sixth part of a movie franchise which began in 1998 with “Torrente, the Dumb Arm of the Law,” hailed by Variety as “deliriously non p.c.” and “a tremendously enjoyable comedy-thriller” dominated by the kind of character – a perpetually inebriated, self-centered sexist, racist scumbag and blow-hard throw-back – which Spaniards had spent democracy disavowing as not representative of themselves nor modern Spain.\n\n\tDating “Torrente President’s” release, Segura said little about its plot-line. It will open, however, in the long run-up to general elections in Spain, which have to take place by August 2027, with one big question whether Spain’s far-right Vox will end up forming part of coalition governments at federal, regional or municipal levels. \n\n\tOne of “Torrente’s” most extraordinary achievements down he year’s has been to appeal across Spain’s bitter political divide. It remains to be seen if the saga’s sixth iteration’s satire still does so, or savages Vox. One scene leaked online shows Torrente addressing a crowd of followers from a balcony above a canvas banner for his party, Nox. “I have my bags ready to leave Spain on March 14,” Segura joked on Spanish comedy chat show “El Hormiguero.” \n\t\n\n\n\n\t\n\n\t\t\t\t\tLa Bola Negra Credit: Carla Oset\n\t\n\n\n\n\t‘La Bola Negra,’ Another 2026 Highlight \n\n\tIn all, Atresmedia Cine will see over 10 of its movies released in Spain next year. Its other most anticipated is “La Bola Negra,” written and directed by Javier Ambrossi and Javier Calvo, behind HBO Max U.S. pick-up “Veneno”  and Arte France hit “La Mesías,” which burnished their credentials as one of the most exciting young film-TV creative duos in Europe. \n\n\tProduced by Movistar Plus+, Suma Content Films, France’s Le Pacte and Atresmedia Cine, distributed by Elástica Films in Spain and sold internationally by Goodfellas, “La Bola Negra” co-stars Penelope Cruz and Glenn Close in a large cast. It interweaves the interconnected lives of three men in three different eras, depicting lives intimately linked by sexuality and desire, pain and legacy. The film also incorporates and is partly inspired by Spanish poet and playwright Federico García Lorca’s unfinished novel of the same title, his first work with an explicitly gay protagonist. Set in 1932, during Spain’s Republic and in 1937, when gay men were imprisoned and executed by Francisco Franco’s forces, such as Lorca himself, and in 2017, “La Bola Negra” comes in at Spanish history from a little-explored angle of queer legacy. It also has a large Spanish choral cast of little known actors newcomers; which could be two reasons for the release date, Oct. 2, just after the San Sebastián Festival, a platform for both the film’s focus and cast. \n\n\tWhat Atresmedia Cine’s Slate of 2026 Releases Says About Current Spanish Cinema\n\n\t“Father There Is Only One” topped Spanish film box office charts for five of the last seven years. Not surprisingly, seven of the 12 titles confirmed by Atresmedia Cine to open in cinemas in 2026, or at least shoot next year, are comedies. \n\n\tThey’re carefully set apart, however. Two play off strong IP: “A Little Something Extra,” one 2026 shoot, adapts France’s 2024 No. 1 movie, beating out all Hollywood blockbusters, selling more than 10.8 million admissions – the equivalent of an around $80 million gross. Not for nothing, in 2023, one year when there was no “Father,” the highest-grossing Spanish film of the year was Javier Fesser’s “Championext,” another comedy starring non-professional actors with disabilities, which scored €11.9 million ($14.0 million).\n\t\n\n\tAnother Atresmedia Cine title set for 2026, “Beneton Family +2,” is a sequel to a 2024 original, which scored €4.1 million ($4.8 million) at the Spanish box office. \n\n\n\n\t\n\n\t\t\t\t\tBeneton Family+2 Credit: Marina Caputo\n\t\n\n\n\n\tTwo other Atresmedia Cine slate titles could be described as family comedies: “Abuela tremenda,” toplining Elena Irureta (“Patria”) as a battling grannie, targeting mature audiences, and “Tres de más,” a parenting farce with Kira Miró (“Alpha Males”), made for a younger crowd. \n\n\tSocial satire “Torrente Presidente” has the broadest of audiences. “La Roja,” another 2026 shoot and a title to follow, targets an adult audience in a movie about Spain’s cricket team, made up largely of players of foreign origin. A kind of “Full Monty” about integration, director Marcel Barrena has said, it promises the same mix of finally uplifting real-life social observance which he delivered so well in “The 47,” a film that shared a best picture Spanish Academy Goya this year, while hitting €4.0 million ($4.7 million) at Spanish theaters. \n\n\tBilled as black comedy, “Cada día nace un listo,” a painting heist  caper, reps the latest from Arantxa Echevarría, whose ETA infiltration thriller “Undercover” shared this year’s best picture Goya and made a remarkable breakout €9.7 million ($11.4 million) in Spain off a 2024 bow. \n\n\n\n\t\n\n\t\t\t\t\tKarateca. Credit: Lander Larranaga\n\t\n\n\n\n\tElsewhere, given the uncertainties of Spain’s theatrical market, Atresmedia is hedging its bets, producing a real life sports bio, “Karateca,” a Spanish wingsuit BASE jumping adventure starring Carlos Cuevas (“Merlí”), Miguel Bernardeau (“Elite”) and Miguel Ángel Silvestre (“30 Coins”), teen musical “A Fuego” and “Viaje al país de los blancos,”  a biopic of human rights activist Ousman Umar. \n\n\n\n\t\n\n\t\t\t\t\tViaje al país de los blancos Credit: Lander Larranaga\n\t\t\t\t\t\t\t\t\tLANDER LARRANAGA\n\t\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Spain’s Atresmedia Cine Unveils 2026 Releases Including Santiago Segura’s ‘Torrente Presidente’ and Los Javis’ ‘La Bola Negra’ ",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/Father-There-Is-Only-One-5.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-30T13:40:41.000Z",
      "dateModified": "2025-12-30T13:40:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Dandelion’s Odyssey’ Review: A Dialogue-Free Animated Epic Journey Floats With Wondrous Inventiveness",
    "url": "https://variety.com/2025/film/reviews/dandelions-odyssey-review-planetes-1236620200/",
    "image": "https://variety.com/wp-content/uploads/2025/11/DANDELIONS-ODYSSEY.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-30T13:30:00.000Z",
    "description": "\n\tAdrift in the wind, the protagonists of Japanese director Momoko Seto’s French-produced 3D animated curio “Dandelion’s Odyssey” embark on an epic bo",
    "body": "\n\tAdrift in the wind, the protagonists of Japanese director Momoko Seto’s French-produced 3D animated curio “Dandelion’s Odyssey” embark on an epic botanical journey into outer space and away from the tranquility of a planet that strongly resembles the Earth we know. After traveling through a black hole, they arrive on a different floating rock, where they face harsh elements and unexpected predators in order to resettle. The catch is that these cosmonauts landing in an undiscovered world are dandelion seeds tethered to delicate, umbrella-like structures, or pappi, comprised of numerous, fuzzy bristles.\n\t\n\n\tTestament to the ingenious character design and astute writing behind the peculiar project (the screenplay is by Seto and Alain Layrac) is that the faceless heroes emote far more than one would ever expect from inanimate vegetation. Imbued with distinct physical attributes, the four seeds exhibit enough personality for audiences to understand their role in the group. One of them is heftier in size, while another appears almost frazzled, having lost most of its bristles. The other pair, including one with a bent stem or beak, resembles a romantic duo.\n\n\n\tEach time they survive a seemingly insurmountable ordeal, the four of them hug and giggle — yes, they make sounds. Despite there being no dialogue, in Seto’s universe, plants produce noises that communicate their emotional state. While the seed itself is presumably the most important part in their taxonomy, the way they move and interact with one another and their surroundings implies that their “faces” are in the middle of the bristles. Seto and the animation team have conceived endearing figures from their limited features.\n\t\n\n\tImpressive photorealistic details in certain textures, especially in the closeups of some of the creatures the roaming seeds encounter on this planet that closely resembles Earth and its flora and fauna. Early on, a frog defrosted from its sleep looks so lifelike that one might make the honest mistake of thinking it was a real animal filmed in the wild. Later, a pair of slugs that help the seed cross an arid landscape, like camels in the desert, glisten vividly.\n\n\tThat level of eye-deceiving detail falters in wide shots, however, some of which suffer from unflattering flat lighting that in certain instances recall computer screensavers of yore, given their colorful artificiality. Similarly, as the four seeds float across the land, the integration between them and the environment occasionally reads visually clunky in its execution, making the viewer aware of the compositing.\n\n\tIn watching “Dandelion’s Odyssey,” audiences might find easy comparisons to Gints Zilbalodis’ Oscar-winning “Flow,” not only because they are both entirely dialogue-free, but also because their narratives follow a similar arc. That said, Seto’s film aims for a more realistic aesthetic. “Dandelion’s Odyssey” also resembles 2016’s “Minuscule: Valley of the Lost Ants,” another French nature-based animated adventure, in which cartoonishly stylized bugs interact with natural environments. \n\n\tWhile Seto’s debut fits within this subset of wordless, observational exploits, the inventiveness and scientific research likely involved to envision obstacles and situations for the dandelion seeds to construct a high-stakes, compelling epic merits praise, even if the visuals can be uneven at times. Seto’s vision for the foreign planet, where the seeds search for a suitable locale for life to thrive, differs from Earth in notable ways. On this new home, life evolves at incredible speed (a frog’s eggs become tadpoles with the ability to float within seconds), and there are toxic liquids that threaten the seeds’ viability for fulfilling their biological purpose, as well as a sky with multiple moons and Saturn-like rings. \n\n\tAfter seeing the heroes fend for themselves, the resolution feels every bit as emotional as those in Don Bluth’s “The Land Before Time” or Disney’s “Dinosaur,” achieved with a fraction of the resources.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Dandelion’s Odyssey’ Review: A Dialogue-Free Animated Epic Journey Floats With Wondrous Inventiveness",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/DANDELIONS-ODYSSEY.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-30T13:30:00.000Z",
      "dateModified": "2025-12-30T13:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Guess Who This Kid With Presents Turned Into!",
    "url": "https://www.tmz.com/2025/12/30/guess-who-kid-presents/",
    "image": "https://imagez.tmz.com/image/ed/16by9/2025/12/15/ed594c40ee17492780d193321bb8fa67_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-12-30T08:10:28.000Z",
    "description": "\n    \n                    \n                          Guess Who This\n                          Kid With Presents\n                          Turned Into!",
    "body": "\n    \n                    \n                          Guess Who This\n                          Kid With Presents\n                          Turned Into!\n                      \n                  \n                                                                        Published \n                              December 30, 2025\n                            12:10 AM PST\n                                                                      |\n                                                                Updated \n                                  December 30, 2025\n                                7:17 AM PST\n                                    \n      \n    \n          Before this kiddo with Christmas presents turned into a musician, he was just growing up in the cold, posting covers on Vine, and started playing guitar at 13 years old.\n      \n    \n          He can definitely hold his own, but he's collaborated with music's biggest stars like Justin Bieber and Camila Cabello. When he's not in the studio, catch him hiking with his shirt off!\n      \n    \n          \"I love it when you call me Señorita!\"\n      \n    \n          Do you 'wonder' who this singer from Canada is? \n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Guess Who\n              \n                          \n                Kids\n              \n                          \n                celebrity kids\n              \n                          \n                Photo Galleries\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Guess Who This Kid With Presents Turned Into!",
      "image": [
        "https://imagez.tmz.com/image/ed/16by9/2025/12/15/ed594c40ee17492780d193321bb8fa67_xl.jpg"
      ],
      "datePublished": "2025-12-30T08:10:28.000Z",
      "dateModified": "2025-12-30T08:10:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Police Say They Can't Force Tylor Chase Into Treatment Because of the Laws",
    "url": "https://www.tmz.com/2025/12/30/police-say-laws-prevent-forcing-tylor-chase-into-treatment/",
    "image": "https://imagez.tmz.com/image/3b/16by9/2025/12/30/3bdd8f566359419d8d8d03cf170dec76_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-12-30T09:00:58.000Z",
    "description": "\n    \n                    \n                          Tylor Chase\n                          Cops Say They Can't Help Him ...\n                          ",
    "body": "\n    \n                    \n                          Tylor Chase\n                          Cops Say They Can't Help Him ...\n                          Their Hands Are Tied by Law\n                      \n                  \n                                                                        Published \n                              December 30, 2025\n                            1:00 AM PST\n                                                                      |\n                                                                Updated \n                                  December 30, 2025\n                                7:14 AM PST\n                                    \n      \n    \n      \n        \n                    \n                  \n      \n                    BACKGRID\n          \n    \n          Tylor Chase is back sleeping on the streets of Riverside, and there's nothing police can do to help the former child actor because of California laws, TMZ has learned.\n      \n    \n          Riverside Police Department spokesman Ryan Railsback tells us ... the former 'Ned's Declassified' actor is desperately in need of long-term care, but the penal laws prevent cops from forcing Tylor into a mental health or substance abuse treatment facility.\n      \n    \n          \"Mighty Ducks\" star Shaun Weiss -- a major advocate for Tylor -- says a mental health crisis team recently placed Tylor in a 72-hour involuntary psychiatric hold, but then released him back to his homeless existence. TMZ obtained video of Tylor taking a nap Monday on a stoop in front of a building.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Railsback tells us police can't help Tylor -- legally speaking -- because he's not considered gravely disabled or a danger to himself and others. That's why they could only hold him for the 72 hours.\n      \n    \n          Not only that, but Railsback points out Tylor politely declines all efforts by the authorities to get him off the streets and into a facility, explaining that homelessness is not a crime.\n      \n\n          And get this ... Railsback says even if police arrested Tylor for possessing certain narcotics or drug paraphernalia, the charges would be misdemeanors and he would be released soon after receiving a summons.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          As we reported ... Tylor has been a transient in Southern California for quite some time while allegedly struggling with meth addiction.\n      \n    \n          Railsback says police are doing everything they can for Tylor within the laws, but they have no leverage, stating, \"We can't kidnap him.\"\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Tylor Chase\n              \n                          \n                Exclusive\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Police Say They Can't Force Tylor Chase Into Treatment Because of the Laws",
      "image": [
        "https://imagez.tmz.com/image/3b/16by9/2025/12/30/3bdd8f566359419d8d8d03cf170dec76_xl.jpg"
      ],
      "datePublished": "2025-12-30T09:00:58.000Z",
      "dateModified": "2025-12-30T09:00:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Taylor Swift Fan Frames Portion of $600 Tip From Chiefs Game",
    "url": "https://www.tmz.com/2025/12/29/taylor-swift-fan-frames-tip-from-chiefs-game/",
    "image": "https://imagez.tmz.com/image/f1/16by9/2025/12/29/f192406c236c4d6f92035fe098978111_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-12-29T23:10:48.000Z",
    "description": "\n    \n                    \n                          Taylor Swift\n                          Tip of the Arrowhead ....\n                          Fan Fr",
    "body": "\n    \n                    \n                          Taylor Swift\n                          Tip of the Arrowhead ....\n                          Fan Frames Giant Gratuity From Chiefs Game\n                      \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          A worker at Arrowhead Stadium on Christmas got the shock of her lifetime when Taylor Swift dropped a massive tip ... a gesture so shocking, the suite staffer had to frame one of the six fresh Benjamins.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          TMZ has learned a viral Facebook post from a stadium employee named Robyn Gentry talking about the superstar's Xmas generosity is legit ... TS indeed tipped $600 to the unsuspecting worker.\n      \n    \n          As Robyn tells it ... TS was at the Christmas game to watch fiancé Travis Kelce play maybe his last NFL game ... and superstar was so appreciative of staff working on the holiday, she was handing out her own gifts ... that being cold hard cash.\n      \n\n                  \n          \n                          \n                \n                                  \n      \n    \n          Robyn explained the money was her “whole paycheck for two weeks\" and she was so touched, she had to frame one of the bills. Although as of her Sunday post ... she still had not spent any of the $600.\n      \n    \n          Needless to say ... it didn't take long for Swifties to see the post -- and make it go viral with shares and comments.\n      \n    \n          We reached for a rep for TS for comment ... so far, no word back.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Taylor Swift\n              \n                          \n                Travis Kelce\n              \n                          \n                Celebrity News\n              \n                          \n                Money\n              \n                          \n                Kansas City Chiefs\n              \n                          \n                TMZ Sports\n              \n                          \n                Music\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Taylor Swift Fan Frames Portion of $600 Tip From Chiefs Game",
      "image": [
        "https://imagez.tmz.com/image/f1/16by9/2025/12/29/f192406c236c4d6f92035fe098978111_xl.jpg"
      ],
      "datePublished": "2025-12-29T23:10:48.000Z",
      "dateModified": "2025-12-29T23:10:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Alabama Barker Claps Back at Critics of Travis' Lingerie Christmas Gifts",
    "url": "https://www.tmz.com/2025/12/30/alabama-barker-responds-critics-travis-barker-lingerie/",
    "image": "https://imagez.tmz.com/image/e2/16by9/2025/12/30/e2efdafbdad341a79b84d70c6666b6ac_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-12-30T15:46:33.000Z",
    "description": "\n    \n                    \n                          Alabama Barker\n                          My Lingerie Ain't From My Dad's Sleigh, Weirdos!!!\n     ",
    "body": "\n    \n                    \n                          Alabama Barker\n                          My Lingerie Ain't From My Dad's Sleigh, Weirdos!!!\n                      \n                  \n                                                                        Published \n                              December 30, 2025\n                            7:46 AM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Alabama Barker is definitely all out of Christmas spirit ... 'cause she just torched people giving her grief over gifts she got from her fam ... which included lots of lingerie.\n      \n    \n          Here's the deal ... Alabama did an Xmas \"haul\" on TikTok -- showing off all her gifts -- and among the goodies was lingerie ... which she said her father Travis Barker got for her. And of course there were plenty of people who said that's freaking weird.\n      \n    \n        \n                    \n                  \n      \n    \n          Obviously, Alabama had to clap back ... explaining that while the lingerie was technically from Dad, it was her stepmom Kourtney who picked it out -- so, haters need to STFU.\n      \n\n          And there must have been a decent amount of trash-talk ... 'cause as you can see from her second post, Alabama is pretty pissed she even needs to address the matter.\n      \n    \n        \n                    \n                  \n      \n    \n          Bottom line ... Alabama made clear she is well aware the difference between the naughty list ... and the yuck list.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Kourtney Kardashian\n              \n                          \n                Travis Barker\n              \n                          \n                Alabama Barker\n              \n                          \n                TV\n              \n                          \n                Family\n              \n                          \n                Reality TV\n              \n                          \n                Fashion\n              \n                          \n                The Kardashians\n              \n                          \n                Christmas\n              \n                          \n                Holidays\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Alabama Barker Claps Back at Critics of Travis' Lingerie Christmas Gifts",
      "image": [
        "https://imagez.tmz.com/image/e2/16by9/2025/12/30/e2efdafbdad341a79b84d70c6666b6ac_xl.jpg"
      ],
      "datePublished": "2025-12-30T15:46:33.000Z",
      "dateModified": "2025-12-30T15:46:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cinnabon Employee Tells Cop Why She Used N-Word, Police Body Cam Video Shows",
    "url": "https://www.tmz.com/2025/12/29/racist-cinnabon-employee-bodycam/",
    "image": "https://imagez.tmz.com/image/fa/16by9/2025/12/29/fab1580a56124aee81a2dc0701598b51_xl.png",
    "tag": "Entertainment",
    "date": "2025-12-29T23:55:54.000Z",
    "description": "\n                    \n                          Cinnabon Employee\n                          I Know I'm Racist ... But I Have PTSD!!!\n                 ",
    "body": "\n                    \n                          Cinnabon Employee\n                          I Know I'm Racist ... But I Have PTSD!!!\n                      \n                  \n                                                                        Published \n                              \n                December 29, 2025\n                \n                            3:55 PM PST\n                                                                      |\n                                                                Updated \n                                  December 30, 2025\n                                7:47 AM PST\n                                    \n              \n    \n      \n        \n                    \n                  \n      \n                    Ashwaubenon Dept. of Public Safety\n          \n    \n          A Cinnabon employee in Wisconsin was fired after using hate speech against customers ... and now we have the police body cam footage of her attempting to explain her actions to an officer.\n      \n    \n          Watch the video ... As the officer approaches, he says matter-of-factly, \"Bet you know why I'm here ...\"\n      \n    \n      \n        \n                    \n                  \n      \n                    Ashwaubenon Dept. of Public Safety\n          \n    \n          When she acts aloof, the officer explained it was because of the video he had just seen of her getting belligerent with two customers.\n      \n    \n          She gives her side of the story, claiming ... \"They came here and harassed me. I have PTSD. They knew exactly that I was ill. This is not the first time.\" But when pressed on what they did to her, she says, \"I don't know. They started threatening me. I don't know. I have no idea.\"\n      \n\n          What's even more bizarre ... when asked how they threatened her, she claimed she also didn't know. Then, the officer -- just as confused as all of us -- pleads with her to cooperate so he doesn't have to arrest her for disorderly conduct.\n      \n    \n      \n        \n                    \n                  \n      \n                    Ashwaubenon Dept. of Public Safety\n          \n    \n          While she gives him her name and information, she gets testy with the officer, again, and accuses him of being sent there by someone the officer has clearly never heard of.\n      \n    \n          Check out the second video ... the couple in question details the interaction from their point of view after the cop's back and forth with the employee.\n      \n    \n          As you may recall  ... the employee was recorded using the n-word multiple times at the couple while also proudly proclaiming herself a racist -- speaking directly to the camera and saying she doesn't care if the whole world knows it, and making lewd gestures. No surprise -- she was subsequently fired.\n      \n    \n          Check out the audio of the man calling police to report the situation.\n      \n    \n          The nature of the woman's PTSD is unclear, or how that prompted their exchange ... after all, it appears they just wanted a snack.\n      \n      ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cinnabon Employee Tells Cop Why She Used N-Word, Police Body Cam Video Shows",
      "image": [
        "https://imagez.tmz.com/image/fa/16by9/2025/12/29/fab1580a56124aee81a2dc0701598b51_xl.png"
      ],
      "datePublished": "2025-12-29T23:55:54.000Z",
      "dateModified": "2025-12-29T23:55:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]