[
  {
    "title": "Max Minghella on Playing the Big Bad of ‘Industry’ Season 4: “I Would Almost Black Out Shooting the Show”",
    "url": "https://variety.com/2026/tv/news/industry-season-4-episode-7-max-minghella-interview-1236668640/",
    "image": "https://variety.com/wp-content/uploads/2026/02/max-minghella_1.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-23T03:00:00.000Z",
    "description": "\n\n\tSPOILER ALERT: The following story contains plot details from “Points of Emphasis,” Season 4, Episode 7 of “Industry,” now streaming on HBO Max.\n\n\t",
    "body": "\n\n\tSPOILER ALERT: The following story contains plot details from “Points of Emphasis,” Season 4, Episode 7 of “Industry,” now streaming on HBO Max.\n\n\tWhitney Halberstram (Max Minghella) is in the wind. Thanks to the tireless efforts of Harper Stern (Myha’la) and her fellow short sellers, Whitney’s fraudulent financial startup Tender has collapsed in on itself, leaving puppet CEO Henry Muck (Kit Harington) holding the bag. (Whitney and Harper had previously hooked up in an encounter that revealed his preference for, uh, penetrating interactions.) But before Whitney skips town, leaving his phone behind in an ominous sign of total abandonment, he tries one last audacious play: acquiring Pierpoint, the bank where HBO drama “Industry” — created by former bankers Mickey Down and Konrad Kay — first established itself before the entire institution collapsed in Season 3.\n\n\tWhitney co-founded Tender with his Stanford buddy Jonah (Kal Penn), whom he pushed out of the company in the Season 4 premiere. Ever since, the entrepreneur has been on a mission to fake it until he makes it, covering the company’s fraudulent balance sheet with inflated acquisitions in Africa and attempting to pivot a payment processor for pornography sites into a mainstream bank. Taking a run at Pierpoint is one last, desperate attempt at distraction from increasingly loud calls for an audit, and Whitney sells the hell out of it. “We want speed. We want scale. We want certainty. We want America,” he tells a room of rapt shareholders. It’s almost enough to convince them, and us, that Tender can survive through sheer bravado.\n\n\tBut in the end, Whitney can’t escape his fate, at least while staying in the spotlight. He may put on a brave face, but behind the scenes, he’s being threatened by faceless Russian backers via his deputy Ferdinand (Nico Rogner), who tries to tell him running isn’t an option. Whitney chooses to risk it anyway, abandoning both Tender and his obvious infatuation with the aristocratic Henry. The mix of aspirational invention and forbidden same-sex attraction puts Whitney in the same lineage as other fictional antiheroes like Patricia Highsmith’s Tom Ripley — which is fitting, because Minghella’s late father Anthony directed the 1999 adaptation of “The Talented Mr. Ripley.”\n\n\tMinghella arrived on “Industry” as a newly minted fan of the show, after nearly a decade on “The Handmaid’s Tale,” a radically different (though in some ways, equally dystopian) series. Minghella has the perfect background for a story populated by American strivers — including Whitney, Harper and Harper’s mentor Eric Tao (Ken Leung) — trying to make it in the London financial scene. A native Londoner who now lives in the States, where he spoke to Variety about his time on “Industry” from his home, Minghella has spent time on both sides of the Atlantic. He applied that perspective to a performance he characterizes as spontaneous and ambiguous in a conversation that touches on Minghella’s inspiration, technique and approach to playing a fundamentally mysterious character.\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tCourtesy of HBO\n\t\n\n\n\n\t\n\t\tYou’ve said you weren’t familiar with the show before you became involved with it, but once you did become acquainted, what made you excited to enter this world?\t\n\n\tI knew a lot about the show, because truly all of my closest friends — people whose taste I trust — it’s their favorite show. They had, like, a weekly screening of the show, and they watched together, and they loved it. I felt intimidated by that, that people I cared about were invested in it. I was also conscious of the fact that the season was going to be quite different. I view it almost like a reboot of the show in a way, so I felt tremendous responsibility.\n\n\tBut Mickey and Konrad, from reading the scripts and then watching the series and talking to them, I truly thought I was interacting with generational talents. They’re amazing, and they’re operating at such a high level, and the writing was so to my taste. I’ve since learned, having worked with them, that we really do share very specifically the same taste, and it’s a joy when you get to work with people who share your taste. It’s a very rare thing. It’s a lovely thing when it happens, because it leads to a sense of joy and excitement in the process. \n\n\t\n\t\tBefore this role, you were coming off of “The Handmaid’s Tale,” which you were on for eight years. What was it like for you to shift gears between these two shows?\t\n\n\tThey’re very different in style, and so my approach was radically different to each part. I always viewed, correctly or incorrectly, Nick Blaine as a sort of archetypal character. That show was very heavy, and I always — maybe this is an incorrect perception of what his purpose was in the show — but I felt like his narrative was there to provide a sense of relief and melodrama and break from the more intellectual aspects of the show. And so I didn’t approach that part as naturalistically. I always saw it in a very specific way: embedded in a Brontë-esque literary history, something larger than life. I never approached it with naturalism. I always approached it within that context of something very heightened and almost like a soap opera, if I’m being honest. And I really enjoyed that, but that was very much the approach for that.\n\t\n\n\tThen for this, it’s obviously something hyper-real. And so it was much less methodical. I would say it was much more about — I would almost black out shooting the show, because I would just let anything happen. I didn’t go in with any kind of plan or agenda of how I wanted anything to go. I would just let each take happen, and whatever happened in that take happened, for better or worse. It was very freeing and very different. It felt right for what the material was, and also the character, who I wanted to feel dynamic and unconstrained. I didn’t want him to feel like somebody who was deciding when to sit and when to pick up his mug.\n\t\n\t\n\t\tThis character, for obvious reasons, is fuzzy and unreliable in terms of what his background is. In your head, do you have a more definitive backstory, or did you prefer to keep it ambiguous on your end as well?\t\n\n\tIt’s a really relevant question, I think, to this character and to our process. I tried to be as honest as I could in the scenes themselves and at the same time, when I look back on it now with time, I lean probably a little bit towards the manipulation over the authenticity, or any kind of earnestness in his emotional state. My understanding, especially in how things come together in the edit and all of that, it gives you a new perspective on things. And with some distance, I consider him somebody so purely Machiavellian in his intent. But that could be wrong! That’s a Mickey and Kon question for sure. \n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tCourtesy of HBO\n\t\n\n\n\t\n\t\tI feel like whenever there’s a con man who’s sexually obsessed with his mark, the spirit of Tom Ripley has entered the room. Were there any influences like that that you were looking to when you were formulating who this person is?\t\n\n\tObviously, I noticed that. And there’s other characters — Steve Jobs in the Aaron Sorkin movie — that Whitney sort of resembles. Tom Ripley is tricky, because Tom Ripley doesn’t share any of the personality traits of Whitney. Tom is, in such a beautiful way, so openly sensitive and vulnerable and fragile. Whitney is the opposite of that. Thematically, I love those kinds of stories. I’ve always been drawn to those kinds of stories, for obvious reasons, I suppose. I don’t know how applicable that is to Whitney. \n\n\tThere were real people in the world, pretty inside baseball people, I guess, that we talked about. But they articulated on the page such a clear person and such an extraordinary role to get to play. I was very conscious the whole time of how unique it was to get to say these words and play somebody this multifaceted and complicated. It’s just very rare, and so I will endlessly be grateful to them for giving me this chance.\n\t\n\t\tBefore Whitney and Harper are set on this collision course with each other, they have a sexual encounter where you learn about Whitney’s proclivities. What do you think that scene, which is intimate on multiple levels, reveals about who Whitney is?\t\n\n\tI would lean on there being some honesty there in that scene. If only because of the scene that happens later in Episode 6, where he says to Harper, “I wonder if that’s why I showed you so much of myself so quickly.” Which is alluding to that. To me, that feels like an admission of sorts. Because it could be interpreted easily that he’s planted that [strap-on] there to give Harper this moment of empowerment. Maybe he could subconsciously read whatever Freudian desire that she’d been harboring, that she sort of actually states earlier in that episode. It could be that. \n\t\n\n\tWhat I like about these questions about Whitney is, I actually don’t know the answers. Really. And I didn’t find that prohibitive in playing him, because he is somebody who, however you interpret him, is a performer. That was enough for me to go off.\n\t\n\t\tWatching Episode 7, it really hit home for me just how much the Whitney-Henry relationship is kind of this bizarro version of the Harper-Yasmin relationship. How did you and Kit Harington work together, and work out this dynamic between these two very different people? \t\n\n\tI think it was different for both of us. First of all, I’d say that Kit was just a really important person to me in this whole process. He’s just so good, really lifts you up as an actor, but he’s an incredibly kind person and generous person. I was very nervous, intimidated by the whole thing, and kind of out of my depth, I think. And then he made me feel so safe. He was so supportive. It was unbelievable. I couldn’t have done it without him. So I was endlessly grateful to him on a personal level.\n\n\tOn the approach, the character dynamics, I’ll say this. I think, not to speak for [Kit], that [Henry] very much saw Whitney as a father figure, as a paternal figure, and leaned into that a lot in his thinking. For me, I related to Henry more than any other character in the show, in a kind of profound way. I found Henry so close to where I was at in my life, doing the show, going into it.\n\t\n\n\tThat was so great for me, because obviously Whitney, whether it’s authentic or not, is interested in this person. That was so easy for me, because I felt he found him so relatable. And that was really great. \n\n\tBecause Whitney, in many ways, possesses tributes I don’t have, and wish I did. But he’s so far away from who I am as a person. He’s got this confidence that’s amazing, this articulation that’s so impressive. It’s fun to pretend to be somebody who could do things you can’t. But at the same time, I was very grateful for how much I connected to Henry, who’s much more of a fool.\n\t\n\t\tWithout getting too personal, what did you find relatable about Henry as a character — who is in life circumstances I think most people do not find relatable? \t\n\n\tIn the broadest terms, I think he’s a very stunted person, and I consider myself, openly, a very stunted person. I don’t know if I dislike that about myself, but I would say I’m definitely frozen a bit in time. I’m not much different talking to you now than I would have been 22 years ago. There’s something interesting about that to me, in the character, that I really identified with. There’s other more personal things I identify with, but it was lovely. And also part of what I loved about this season. Episode 2, which I wasn’t really in, that’s my favorite episode of the season. It’s very much focused on Henry, and I was amazed by what the boys came up with on that one. \n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tCourtesy of HBO\n\t\n\n\n\t\n\t\tThis is also a great episode in terms of the sexual interest that Whitney takes in Henry. Do you read that as Whitney letting the facade slip, or do you see it as another manipulation tactic?\t\n\n\tMy answer to all these is, I don’t fully know! I think that was very much the initial intent. I could say that. When we first were talking about this and we first started shooting the show, I think it was completely intended to be authentic. I do think things have changed as we shot it. That’s now become much more opaque in a really interesting way. A lot of these things that in the script are maybe a little bit more prescriptive became much more ambiguous. That’s another thing I share with Mickey and Kon is an interest in stuff that’s not didactic. So every time there was a shift towards ambiguity, it was always delightful to me. \n\t\n\t\n\t\tMaybe authenticity isn’t the right framing. Whitney is clearly interested in Henry in that way. What do you think draws him to this person who he can clearly see the failings in, but is also pulled toward?\t\n\n\tWe don’t know the reality of Whitney’s story, but I know that he is not to the manner born at all. He’s an autodidact. He taught himself everything. So I think that’s what it is, you know? He wishes that he had that confidence, the actual innate confidence or comfort of somebody who had a silver spoon in their mouth, even if it was a toxic one. He probably finds even the toxicity rather glamorous and unattainable. \n\t\n\t\tThis episode, you also get the car confrontation scene, which unlocks aspects to Whitney we haven’t seen before. It’s the first time we’ve seen him backed into a corner and panicked and not sure what to do. What was it like to play the character in that mode after him being relatively in control for most of the season?\t\n\n\tIt was really fun. It was all really fun to me. But again, my approach was so consistent, which was, whatever happens in this space is going to happen in this space. And it felt very freeing to approach it like that. It was all quite exciting and unpredictable and also scary, because I didn’t feel a tremendous amount of control over the performance. It sort of felt like it was controlling me a bit. That was nerve wracking, I suppose, but I really enjoy doing that. \n\n\tI also found it funny. I found it funny when he was so pathetic and I didn’t really know what he was doing. Every time I watched it, I was like, “Oh, that’s what he was doing in that scene!”, if that makes sense. When I saw how pathetic he is when he gets out of the car, he just looks so vulnerable and fragile in a way that I found just very humorous.\n\t\n\t\tYou’ve played American characters before, and you live in America. But Whitney is an ultra-American archetype, which plays into his whole Pierpoint spiel and certain things he says in the premiere. As someone who didn’t grow up here, was it interesting for you to step into that kind of person? \t\n\n\tWell, I don’t know that Whitney is American.\n\t\n\t\tThat’s a good point!\t\n\n\tSo I didn’t necessarily treat it that way. I treated it as somebody who’s pretending to be something he’s not. And inherently, by me not sounding like me, that’s a very easy way to immediately be like him, right? We don’t know if he might be from Lithuania or somewhere else. We don’t know anything about him. That just never becomes explicit, anyway. So I just assumed he might not be. There’s even little, very subtle things I try to do with the accent to maybe raise that question. Probably in a way that just causes confusion more than anything else! But\n\t\n\n\tI just thought he should have an undefined accent. It should maybe sometimes slip between regions in a way that’s a bit confusing. That was something I thought could be interesting.\n\n\tThis interview has been edited and condensed.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Max Minghella on Playing the Big Bad of ‘Industry’ Season 4: “I Would Almost Black Out Shooting the Show”",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/max-minghella_1.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-23T03:00:00.000Z",
      "dateModified": "2026-02-23T03:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Knight of the Seven Kingdoms’ Creator Explains That Finale Title Change, Going to Dorne in Season 2 and Which Targaryens Will ‘Probably’ Return",
    "url": "https://variety.com/2026/tv/news/knight-seven-kingdoms-finale-title-change-dorne-explained-1236667797/",
    "image": "https://variety.com/wp-content/uploads/2026/02/peter-claffey_8.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-23T03:30:00.000Z",
    "description": "\n\tSPOILER ALERT: This article contains spoilers for the Season 1 finale of “A Knight of the Seven Kingdoms,” now streaming on HBO Max.\n\n\tThe dust has ",
    "body": "\n\tSPOILER ALERT: This article contains spoilers for the Season 1 finale of “A Knight of the Seven Kingdoms,” now streaming on HBO Max.\n\n\tThe dust has settled from the trial of the seven, the wounded are patching up their injuries and “A Knight of the Seven Kingdoms” Season 1 has come to an end.\n\n\tDunk (Peter Claffey) is pretty banged up after his knights won in their down-and-dirty fight against Aerion Targaryen’s (Finn Bennet) team. Even though Dunk was victorious, he feels guilty after Baelor Targaryen (Bertie Carvel), his teammate and heir to the Iron Throne, died after an accidentally fatal mace to the head from Baelor’s own brother Maekar (Sam Spruell). \n\t\n\n\tAfter Baelor’s funeral, Maekar asks Dunk to serve under him and take his son Egg (Dexter Sol Ansell) as his squire, but Dunk says he’s done with princes after all this. As the tourney wraps up and he’s visited by the ghost of his mentor Ser Arlan of Pennytree (Danny Webb), Dunk soon reconsiders and decides to take Egg away from the malevolent influence of his Targaryen family. Against Maekar’s wishes, Dunk and Egg ride away together as knight and squire. Dunk honors Ser Arlan’s tradition by nailing a penny to a tree before they depart, and Arlan’s ghost rides with him then sets off on his own path.\n\n\n\tOn their new journey, Dunk and Egg discuss heading to Dorne, the southern, desert-covered region of Westeros. In the final scene, Maekar searches for Egg as his wagons take off — hinting that there may be some Targaryen crossover next season. \n\n\tSpeaking with Variety, co-creator and showrunner Ira Parker reveals that Season 2 will cover George R.R. Martin’s second “Dunk and Egg” novella “The Mystery Knight,” why Martin shot down one of the original titles of the show — and more.\n\t\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tSteffan Hill\n\t\n\n\n\t\n\t\tTo start off, what’s up with the “A Knight of the Nine Kingdoms” title at the end?\t\n\n\tThat’s maybe me getting a little too jokey. People may hate it or crucify me for that, but there’s a bit of a lighter touch to these shows. And I’m going to learn some things. People are going to have a reaction to it, and and I’m going to have a reaction to it after not seeing it for a few months. And we’ll see. I like it. Enough of the wonderful creatives that I worked with liked it, too. It came from an honest place. It’s all true. It’s nine kingdoms at that point. We want to make Westeros a fun place to hang out, even when terrible, terrible things are happening and everyone’s sad, just like real life. You can still make jokes at a shiva, and it’s OK. We need that relief. So even in a bad spot, Dunk and Egg are still Dunk and Egg again.\n\t\n\t\tSpeaking of titles, was the show ever going to be called “The Tales of Dunk and Egg” like the novellas?\t\n\n\tEarly on, George was like, “Just don’t call it ‘Dunk & Egg’ — it sounds like ‘Laverne & Shirley.’ It sounds like a sitcom.” I said, “Oh, absolutely fine.” As it got really late in the game when we were putting the final touches in the post-production process, I did sort of waver a little bit. I said, “Everyone’s just gonna call it ‘Dunk & Egg,’ so why don’t we call it that?” Then I was talked down by my assistant that it wasn’t a wise idea. And I agree. It’s nice to see a show called “A Knight of the Seven Kingdoms,” and come there to find out that it is just a little lighter and has some fun, rather than setting people up with “Dunk & Egg” and you sort of know what you’re gonna get. I hope.\n\t\n\t\tAre Dunk and Egg going to Dorne in Season 2?\t\n\n\tThey do go to Dorne. How much of that we cover, I’ll leave up to people to tune in for Season 2. I don’t know if I’m supposed to talk about it yet. For the most part, we’re following the books. So Season 1 was “The Hedge Knight.” Season 2 is “The Sworn Sword.” Hopefully, if we get to Season 3 it’ll be “The Mystery Knight.”\n\t\n\t\tThe novellas are each their own separate story, but will we see any of the Season 1 characters returning for Season 2? It looks like Aerion and Maekar could be looking for Egg at the end.\t\n\n\tThe one thing about this show, the nobles, the kings and queens are all terribly interesting. So many times you want to go and write for them, but the truth is that’s not what this show is. There are a lot of shows, within this world and other worlds, that definitely cover that part. And we’re not that. We are bottom-up. We are in Dunk’s POV. Even minor lords and ladies, we don’t allow ourselves to go behind the scenes in their POVs. For better or for worse, that is the storytelling lens that we have set up for this show. Whether or not somebody will come in and out of Dunk’s world again, I would say probably. Westeros is a — yeah. Yes. That’s all I’ll say. Yes.\n\t\n\t\n\t\tWill Season 2 also be six episodes?\t\n\n\tYeah. It really was the perfect amount for us. Honestly, HBO was wonderful. They said anywhere between 30 minutes and 60 minutes is fine, which gives us a very large target to hit. We could let them be what they needed to be based on the source material.\n\n\t\n\t\tHow much of the Blackfyre Rebellions will we learn about in Season 2?\t\n\n\tThe Blackfyre Rebellions are in and out of their lives for Dunk and Egg, all the way up until pretty late I’d say. The Second Blackfyre Rebellion factors in pretty heavily into one of the books, and obviously we make a few mentions to it in Season 1. But I’d say it’s important background and informs a lot of the characters that they come in contact with. Essentially, we are 15 years outside of a massive civil war, and so there’s still a lot of those lingering resentments. There are certainly a lot of open wounds left. One of the promises I made to George very early on is that I really wouldn’t create story. We are adding to the character and the world. We’re writing this TV show as if George had written a novel instead of a novella. So we’re just filling out things that he naturally probably would have done. \n\n\tBut we don’t send people on any side quests, and we try not to get too bogged down in history. These are nice, little contained journeys. It’s an action adventure series, almost. It’s Dunk and his squire having fun and adventures, getting into trouble. Even if we do take two years between seasons, there are no cliffhangers. We’ve told a story and wrapped it up. Hopefully you’ve enjoyed it, and you can come back and see their journey next time.\n\n\n\tThis interview was edited and condensed for clarity.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Knight of the Seven Kingdoms’ Creator Explains That Finale Title Change, Going to Dorne in Season 2 and Which Targaryens Will ‘Probably’ Return",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/peter-claffey_8.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-23T03:30:00.000Z",
      "dateModified": "2026-02-23T03:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Viva Baz Vegas! Baz Luhrmann on the Burning Love That Went Into ‘EPiC’: ‘We Are Giving Elvis the World Tour He Dreamed Of, Playing on the World’s Biggest Screens’",
    "url": "https://variety.com/2026/music/news/baz-luhrmann-epic-elvis-presley-in-concert-imax-interview-1236669914/",
    "image": "https://variety.com/wp-content/uploads/2026/02/MixCollage-22-Feb-2026-05-42-PM-2046.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-23T02:13:09.000Z",
    "description": "\n\tBaz Luhrmann is about to dive back into his long-aborning Joan of Arc movie. But before he does, he had to return to the Elvis well, and the King’s ",
    "body": "\n\tBaz Luhrmann is about to dive back into his long-aborning Joan of Arc movie. But before he does, he had to return to the Elvis well, and the King’s new and returning subjects are glad he did. “EPiC: Elvis Presley in Concert” opened exclusively in Imax theaters this weekend before going wider to slightly smaller screens on Friday.  there was little doubt the audience for Presley is still there, or at least for an Elvis seen through the eyes of one of contemporary cinema’s biggest name-brand directors. \n\t\n\n\t“EPiC: Elvis Presley in Concert” may not make it to the $151 million domestic gross achieved by the director’s 2022 biopic “Elvis” in 2022, but weekend results were strong in the initial 325 Imax theaters that played it this weekend, with a $10,000-per-screen average, the highest of any film on the chart. So Luhrmann can already claim victory in his crusade to immerse contemporary audiences in what he considers to have actually been Presley’s peak period as a performer, when he first started playing Las Vegas at the very end of the ’60s and beginning of the ’70s. Critics as well as the Elvis flock have taken to it: Variety‘s review, by Owen Gleiberman out of its Toronto premiere, called it “one of the most exciting concert films you’ve ever seen.”\n\n\n\tPrior to his personally touring a series of international Imax unveilingss, Variety spoke with Luhrmann over Zoom at his compound in Australia, where he carefully maneuvered the camera to not reveal any “Jehanne d’Arc” spoilers plastered across nearby walls. But there’s nothing to spoil about his contention that, in his mind, Elvis Presley is America… at any size, but preferably at about 45 feet tall, enshrined in full motion in Hollywood Blvd.’s vaunted Chinese Theatre.\n\t\n\n\tFirst off, how are you?\n\n\tI am extraordinarily absorbed and busy, and it’s just been my nature since childhood. I’m just always making things and doing things. And I’m deeply absorbed in my big movie, “Jehanne d’Arc,” which is driving ahead. But now I take a moment for this completely different work, which is trying to get as many people — fans and new audiences — to see “EPiC” on the biggest screen possible. I have to pause and shout out John O. Redmond, my editor of at least 20 years, who’s the creative partner in this and drove it as much as I did. Our big focus is to make a theatrical cinematic experience, and to make it feel as much as possible like you’re actually in the audience and your experience of Elvis is kind of unfiltered. So part of that is me going out and encouraging people to not wait to stream it, to get out and be part of a theatrical experience. Bluntly, it’s a passion of mine.\n\n\tPutting it on Imax screens exclusively for one week before it goes wider is one way of getting that messaging across. And personal appearances you’re making at some Imax screenings.\n\n\tAbsolutely, man. I’ve been actually in the Gold Coast, where I have my creative facility, then I go to Sydney, which is an outdoor experience with thousands of people, and then that night to the biggest Imax screen in the world, which ia Melbourne. Then I go directly out the back door of that to London, then to L.A. We are doing it at the TCL, the old Mann’s Chinese, in Imax, and I’m thrilled about L.A. because of the memory I have of coming out of COVID.\n\n\tQuick side story. After being locked down for two years and working in Australia on “Elvis,” the movie, I was finally able to leave and I came to the U.S., landed, and the first thing we said we would do — with masks on and all of that — was “Let’s go down to see a movie.” I walked into TCL and “Dune” was on, which I didn’t want to see on streaming, in thistheater I dearly love. I saw the opening night of “Titanic” there with Leonardo. So I walk up the stairs, thinking, “Oh God, what’s it gonna be like — will there be anyone here? Iit a good idea to go to the theater?” And as I go up the stairs, I can see the screen., and I just stood there and looked at the vast image and the sound, and I just went, “I’m home. I am home.” So the idea that something the whole team has toiled so passionately on is gonna be seen at the TCL, I think for me, that’ll be a historic moment in my journey.\n\t\n\n\tThis includes footage that was shot for a couple of Elvis concert films in the early ‘70s. I liked those films, but I admit I haven’t seen either of them since I had them on laserdisc in the ‘90s… which is similar to a lot of people’s experience, except maybe minus the laserdisc part. So for those of us without a clear memory of those films, how much of them might be carrying over into what you have in your film, albeit with a big upgrade?\n\n\tYeah, I can tell you. Look, I loved them too. I really did. But the quick narrative is: I’m making “Elvis,” and I hear from John that there might be these lost reels. He said, “Look, if you’re able to get the funds, maybe try and find these reels.” And Ernst Jorgenson, who is probably the premium expert on Elvis in the world, says to me, “Try and get the funds.” And I go, “OK, maybe we can use some of these extra reels,” as supplementary footage of the (Las Vegas) showroom, which I didn’t have in the film at that point. So we got the funds, we go looking, and to our surprise, we find 69 boxes. I didn’t go there, but it’s literally in the salt mines in Kansas City where the negatives of the whole MGM collection are kept so that they don’t rot. When the guys find it, they start sending pictures — boxes everywhere, some are mislabeled, some stuff missing, some not. Wow. So we bring it out and we print some of it. I go, “Look, this is too big a job right now. I’m gonna build the showroom (as a practical set). We’re not gonna use it.”\n\n\tBut now we have 59 hours of not just “That’s the Way It Is,” but “Elvis on Tour,” and some 8mm. And most tellingly, we have this audio — about 50 minutes of it — of Elvis just talking about his life in a way in which you really never hear him talk. So all the way through making “Elvis,” we said, “We’ve got to do something.” And the Elvis fans got wind of it, and it was a bit like, “Release the video! Release the footage!” Like, “Release the files! — the Elvis Files.” And I contemplated: Do we just kind of do a reboot of “That’s the Way It Is” and “Elvis on Tour”? But then we also had this 8mm that was extraordinary, and we had this audio, and we also got things like the full Hampton Road concert (shot on 1972 at the Hampton Roads Coliseum in Virginia for “Elvis on Tour”). But we only had negatives and we didn’t have the sound.\n\t\n\n\tI was so lucky to work with Peter Jackson and his remarkable team at his studio, because you know how Peter had done refurbed the Beatles (for the “Get Back” docuseries). And Park Road have a particular gift for (upgrading) 35mm anamorphic. MGM shot in 35mm anamorphic for “That’s the Way It Is.” Then you had 16 and you had 8. I wanted to bring it all up to Imax quality, so that’s expensive. And then we spent two years trying to find the sound. The mag tape wasn’t there, so we had to find audio. Sometimes we had people in car parks in the middle of the night trading bootleg stuff. I mean, the bootleg industry for Elvis is gargantuan.But the concept becomes: Why don’t we do something that never really happens when it comes to either an Elvis doc or even a concert film, and just let Elvis tell his story — sing it and tell it to you — almost like in a dreamscape?\n\n\n\n\t\n\n\t\t\t\t\t‘EPiC: Elvis Presley in Concert’\n\t\t\t\t\t\t\t\t\tNeon\n\t\n\n\n\n\tNow, John O. Redmond will be able tell you what’s in this exactly frame by frame. [For more of that, look to a separate interview with Redmond about making the film, coming up in Variety.] There are some bits that are in “That’s the Way It Is,” and there are some bits that look like they’re in “That’s the Way It Is,” but actually aren’t; it’s a different night, or a different angle. Then there is a significant percentage of the footage which is material that just simply has not been seen. Or maybe some seconds or some minutes have been bootlegged.\n\n\tI’ll give you an example. There’s an amazing bit I love where Elvis was just sitting with the guitar and he is doing “Little Sister,” and he segueways into “Get Back.” Now, there’s pirated black-and-white stuff out there, but through Park Road we were able to print it and bring it back into a colorscape. Or, when he sings “How Great Thou Art” in the gospel section, 16mm, that’s just never been released. Some of it you would’ve seen in very scratchy bootleg versions. But even if you’ve seen some of it in “That’s the Way It Is,” you’ve never seen it like this… In our movie you see Sammy Davis Jr. and Cary Grant backstage, and we’ve been able to dig back the sound. You’ve seen that footage occasionally, pirated, but we found the sound of what they actually say.\n\n\tAnd we had the original Elvis voice, we have the band, but sometimes I’m going from him singing on stage to him talking. Or we’ve done these DNAs where we’ve kind of made new Elvis songs. So it’s meant to be a dreamscape, and that distinguishes it from “That’s the Way It Is.” But what I do want to say is, even in Toronto (it premiered at the Toronto International Film Festival), people were geeking out about the quality. The image is three times the size of my building I’m in, if you’re in a big Imax. But what we really did was make it sound and feel like you’re actually there.\n\t\n\n\tFor a lot of us who grew up after the main Elvis era, we go through a journey where we come to worship the Sun Sessions of the ‘60s, and things like the ’68 comeback special, but generally, Elvis later on represents something to us that is spoiled or gone to seed. And so there’s this dichotomy: Black Leather Elvis, cool. White Suit Elvis, not cool. And the average person almost has to put some effort into listening to the boxed sets RCA has put out over the years from the late ‘60s and early ‘70s to discover how much of value is there. There’s still this fallacy we have to get over that Las Vegas was just, in its entirety, not a great period.\n\n\tYeah. A thousand percent. You’re dead right — the black leather, cool, but the white jumpsuit, because it’s associated with his extremely fast decline at such a young, young age… And with Las Vebgas… He does it once and twice, and then he does the 15 cities/15-day tour, great. Then does it again, and then does it again, and then does it again, and then does it again. He doesn’t quite know, like a bird hitting a glass window, why the hell he can’t go and do the world tour that he so desperately wants to do. And then as with all of those artists that are beyond music but are actually cultural icons, all of the corruptive things come, and the body becomes corrupted. So what we remember is the Halloween costume — the cheesy white jumpsuit that people wear at Halloween with the glasses, or the wedding chapel send-up guy or the impersonators.\n\n\tAnd what gets lost is that when he first did that show, everyone expected him to do a nostalgia show, but he was totally on the cutting edge. And the big sound, like taking “Bridge Over Troubled Water” and turning it into this giant gospel power ballad … I spoke to Clive Davis, and he said, “I was there opening night, and you know what? I still to this day have never seen a night like that,” talking about the opening night, the ‘69 show. The white suit doesn’t come till 1970, because that’s when they film it. But he said, “They had to stop him from doing cartwheels.” The energy on stage was just on another level.\n\n\tSo what has been forgotten is that his absolute pinnacle, his true pinnacle, are those very early Vegas shows. The other thing I think is worth taking into account is that the critics were all flown in by Colonel Parker, and it was a time of the counterculture and the Beatles were breaking up. They came basically with an attitude of like, “This is gonna be a bit of a joke,” and they were utterly blown away by the artistry and the sheer stage power. One thing that I love in the film, for me, personally, is when he is covering the Beatles or doing a Bob Dylan song. Bob Dylan actually said, “The highlight of my career, that’s easy, Elvis recording one of my songs.”\n\t\n\n\tI mean, even the white jumpsuit, by the way: If you look at Mick Jagger and Freddie Mercury, the jumpsuit becomes this huge rock ‘n’ roll iconic thing. Mick wore it, Freddie wore it. But it comes from Elvis.\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tNeon\n\t\n\n\n\n\tOne thing not everyone will be aware of before seeing this is how great the TCB Band is, with some of the greatest players in the world, on their game.\n\n\tWhat do you think the privilege is like to be able to work with this stuff? I’ve produced a lot of music; I’ve been working with RCA for, like, 15 years;I’ve had a label with them. But to be able to isolate just Ronnie Tutt’s drumming… the Tuttster’s drumming… He’s surrounded by the best. And when you see Elvis rehearsing, he sings the top lines — like, he sings the orchestrations — and he’ll go, “No, no, no, let’s go up here.” It’s in his head. And I think what gets lost again in the whole white jumpsuit kind of Halloween costume smoke is what an awesome and profoundly gifted musician he was. He’d just pick up and sing anything. By the way, think of the voice. So, he’s starting as a high tenor in the ‘50s. But he’s so obsessed with Mario Lanza and opera singers, and he says in our film, “I listen to everything,” and he’s always working on his voice. By the end of it, he’s truly got operatic tone.\n\n\tYou have some augmented or drastically remixed tracks in the film and on the soundtrack.\n\n\tWorking with Jamieson Shaw, we started doing this on “Elvis” the movie, thinking, instead of just having score all the time — although we do have score in this —sometimes we go, “Well, why don’t we just make a new Elvis track?” … We have this small section of Elvis singing “Oh, Happy Day” with the Sweets [the Sweet Inspirations]. We started the movie with him singing that, but he always dreamed of singing with really giant Black gospel choirs, because as you know, he would go when he was a kid and see people like Mahalia Jackson. Elvis was always mixing white and Black gospel. So we have him singing with the Sweets, but then we also recorded choirs in churches in the South, so that we could realize slightly the dream, in this dreamscape, of Elvis singing “Happy Day” with a giant gospel choir. And a big shout-out to our lovely friends in the South who recorded that for us. It’s just going like, well, what if… wouldn’t it be amazing… we’re always asking the question, what would Elvis do?\n\t\n\n\tIf you read reviews of the comeback special, some of the (critics) said, “Once again, Elvis is selling sex, but really can’t sing.” I mean, I work in opera. I’ve worked with the greatest singers in the world. And he’s almost like Orpheus, he’s so gifted. I’ve heard the raw vocals. He never recorded in studios with a drop mic; he always had a handheld. So when he’s on stage, the clarity and the evenness of the vocal, even with a pretty crap sound system, is so great. That’s because he’s basically mixing it himself, by mic technique. Which is a thing you just learn — when you bring it in and out, basically, you’re balancing yourself. I’ve heard raw tracks of all sorts of icons, and he has the greatest mic technique of any vocal artist that ever existed.\n\n\tDo you have a favorite performance of his that’s in the film?\n\n\tWell, I always avoid doing lists. But, I really lock in every single time when he does “Polk Salad Annie,” because it’s so random. When he goes into the onomatopoeia…I don’t wanna be the world’s biggest name dropper, but a famous, famous, iconic singer of a famous band who I dearly love as a friend said to me, “Oh, the thing about us is, we rehearse, but Elvis never rehearsed moves. It’s a bit like he’s in a spiritual state. He just kind of felt it.” And you see it in “Polk Salad,” him just feeling the music and doing the scat, and then the movement, and then what he does at the end — he’s not so much making it up as he’s going along as just feeling it and passing it on to the audience. And I think that’s why he’s so enigmatic on stage, is that not only does the audience not know what he’s gonna do, the band didn’t know what he was gonna do. Ronnie Tutt said, “We had to glue our eyes to him because we were like, what’s he gonna do next?” That’s why he’s so remarkable as a live performer, because he is literally like a live wire. For a person who’s so uncomfortable off-stage, he’s so comfortable on stage. It’s like you’re in his lounge room, hanging out.\n\n\tSpeaking of iconic singers of famous bands. Bono has been very interested in Elvis all along, even writing a song on “The Unforgettable Fire” that is essentially his poem about Elvis. Here, you have Bono delivering another poem speaking at the end of the movie. How did that come about?\n\t\n\n\tIf you saw the show the guys did in Vegas in the Sphere, there’s a lot of Elvis in that, you know? Bono is a real friend, and we’ve collaborated way back in “Moulin Rouge,” and he was such a help on this, just as a cheerleader. I was in the South of France where he lives, and he said, “Look, I’ve written a poem about Elvis,” and he read it to me. John O. and I were thinking, how do we end this? You can’t wrap it up with a comment. Is it another song? And John O. put the poem in, and it seemed to be a great way, with a film that is really, I think in itself, a poem, to end poetically. So I rang Bono, and he said, “Absolutely, I’m honored that you would use it.”\n\n\n\n\t\n\n\t\t\t\t\tBaz Luhrmann and Austin Butler at Baz Luhrmann’s “EPiC: Elvis Presley in Concert” Los Angeles Premiere held at the TCL Chinese Theatre on February 18, 2026 in Los Angeles, California.\n\t\t\t\t\t\t\t\t\tJC Olivera\n\t\n\n\n\n\tYou’ve been on such a mission with Elvis, so you must feel gratified that, with the previous film, the world kind of came along with your vision. There has been a fear among some Elvis fans that his core audience will die off, and even the next generations, over time, so will people still be going to Graceland in 50 or 75 years? You forestalled that, to a degree, or at least gave him a major cultural turbo boost. Even though the feature film will probably always be the biggest thing you do for Elvis, it looks like this is going to be kind of a continuum through your life.\n\n\tLook, it wasn’t planned that way. I mean, I was affected by Elvis as a child, but I also went on to other artists as I grew up — Bowie and Michael Jackson and Elton John, for sure, who I love and work with. But Elvis was always there, more than just as a musician or even a pop icon. He was America in so many ways, through the ‘50s, ‘60s and ‘70s — the incredible rebellious energy, the kind of cool family part, but also then almost rising up like a god, and then the descent. And even in his most corrupted bodily state at the end of his life, he sings “Unchained Melody” with probably the best voice he’s ever had.\n\n\tI did not intend to become this enmeshed in the curation of Elvis. But to your question, the gratification for me — and it’s a little bit unexpected — was to give Elvis a fair voice. It’s not particularly my vision. Of course, any storytelling is somebody’s storytelling. But when I spent all that time in the South, I found Sam Bell —  very hard to find him, actually; an older gentleman of color who, when Elvis lived in one of the very few white houses in the Black community, told the story about how they grew up. And I really realized at that point the impact of Elvis… and you can’t extract him from the story of America. He’s that central to so many key things.\n\t\n\n\tI think about what’s going on in America right now. And if you want to know what Elvis might think — and I’m not gonna answer for him; he didn’t often use words — it’s in the song choices. I’m so happy we’ve got “Walk a Mile in My Shoes” or “In the Ghetto” in this show. And people did not want him to record those songs… Now we know through the data that not only have we picked up a truly surprising percentage of young audience that have discovered audience Elvis anew, but even little kids jump up and down in front of the television watching the “Elvis” movie. It’s Elvis’ energy. It moves through time and geography.\n\n\tMore than gratified, I feel privileged to have been the curator to help it be guided away from what I consider to be an ossification — not malicious or on purpose, but an unfair unfair rusting, an untruthful summation, turning Elvis into a trope. It happens. And I wanted to take the trope, shake off the rust and help guide and reveal Elvis for the artist that he is, but also most importantly, the impact that he had on culture and on America as a whole. And the world. And the world — that’s the thing. We know why he didn’t have the world tour [as explored in the earlier “Elvis” film: Colonel Tom Parker had his sway]. And honestly, we are going to give Elvis the world tour he dreamed of. Because he’s gonna be playing on the biggest screens in the world. In Toronto, people actually came up to me and said, “I couldn’t work out whether I was in the audience or not. It felt like I was at the show.”\n\n\tAre you still thinking about doing a stage-musical adaptation of the Elvis story?\n\n\tYeah, actually… I don’t know if it’s announced; I’ll get in trouble. But definitely… Let us put it this way: serious work is being done on the Elvis stage show, based on the movie.\n\n\tGood enough. And then to ask briefly about the Joan of Arc film’s progress…\n\n\tI’m so deep in it. The reason I’m shooting this corner of my atelier [on a Zoom call] is because the rest of it is just plastered with story structure and script. We have this extraordinarily gifted, gifted, gifted young actor (Isla Johnston) who’s quietly doing all it’s gonna take. Because it’s gonna take time. I always take time. But I am building medieval France! You know, there’s not a lot of medieval France hanging around ready to be photographed. So it’s not quick, but I’m deep in it. As soon as I finish the tour of Elvis, I’m back to “Jehanne d’Arc,” and that will be my next journey. And yet another character who has actually been kind of relegated to a bit of a trope and a little bit forgotten. I like to be involved in those iconic characters from the past who you sort of wish their power and their guidance and their light was around today. Who, in different ways, were the most surprising candidate to have so much of an effect on the world.\n\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Viva Baz Vegas! Baz Luhrmann on the Burning Love That Went Into ‘EPiC’: ‘We Are Giving Elvis the World Tour He Dreamed Of, Playing on the World’s Biggest Screens’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/MixCollage-22-Feb-2026-05-42-PM-2046.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-23T02:13:09.000Z",
      "dateModified": "2026-02-23T02:13:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Keith Urban Manager Gary Borman Retires After 50 Years in Business; ‘I’ll Forever Be Grateful,’ Country Star Says",
    "url": "https://variety.com/2026/music/news/keith-urban-manager-gary-borman-retires-1236669895/",
    "image": "https://variety.com/wp-content/uploads/2024/09/urban-GettyImages-1730771589-e1727470461261.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-22T22:28:39.000Z",
    "description": "\n\tVeteran artist manager Gary Borman has retired, he announced on Sunday, and will be shuttering the doors of his namesake company 50 years after its ",
    "body": "\n\tVeteran artist manager Gary Borman has retired, he announced on Sunday, and will be shuttering the doors of his namesake company 50 years after its inception. \n\n\tHis client of 25 years, Keith Urban, will be moving to a new firm although a rep tells Variety there is no announcement to be made yet. The news was first reported by the New York Post. \n\n\tOver the years Borman Entertainment has worked closely with such artists as the Yellowjackets, the Bee Gees, James Taylor, the Violent Femmes, Dwight Yoakam, Faith Hill and along with Steve Moir, the Rolling Stones and Natalie Cole. \n\t\n\n\n\n\t\n\n\t\t\t\t\tBorman, far left, with Urban, second from right, in 2006 (Photo by Rick Diamond/WireImage)\n\t\t\t\t\t\t\t\t\tWireImage\n\t\n\n\n\n\tBorman said, “To say I’ve been lucky to have spent my time doing what I’ve loved, would be an understatement. I’ve worked side by side with some of the most gifted artists.  I’m grateful beyond words to all the teachers, artists, colleagues, collaborators, supporters, Lady Luck, as well as the adversaries and turbulent moments that sharpened his resolve and taught him how to manage emotion and life.”\n\n\tUrban says, “I’m so grateful to Gary (and my entire Borman Nashville family) for the most incredible and successful time together. It was extraordinary – what we were able to accomplish together – and I’ll forever be grateful for the creative and collaborative spirit we were all a part of for so long.  I wish Gary and everyone at Borman Entertainment the very best journey ahead and look forward to what the future holds for all of us.”\n\n\tBorman added, “Keith and I shared a journey not unlike brothers. The place that I have in my heart will remain warm and my mind filled with wonderful memories. I have been and will remain a fan.”\n\t\n\n\tVariety will have more on the situation as it develops.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Keith Urban Manager Gary Borman Retires After 50 Years in Business; ‘I’ll Forever Be Grateful,’ Country Star Says",
      "image": [
        "https://variety.com/wp-content/uploads/2024/09/urban-GettyImages-1730771589-e1727470461261.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-22T22:28:39.000Z",
      "dateModified": "2026-02-22T22:28:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘I Swear’ Star Robert Aramayo in Shock After Being Named BAFTA Best Actor Over Leonardo DiCaprio and Timothée Chalamet: ‘I Honestly Can’t Believe I Won’",
    "url": "https://variety.com/2026/film/news/i-swear-robert-aramayo-leading-actor-bafta-1236668243/",
    "image": "https://variety.com/wp-content/uploads/2026/02/robert-3.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-22T20:19:08.000Z",
    "description": "\n\tRobert Aramayo pulled off one of the all-time BAFTA upsets on Sunday night when he beat a line-up of Hollywood all-stars — Leonardo DiCaprio, Ethan ",
    "body": "\n\tRobert Aramayo pulled off one of the all-time BAFTA upsets on Sunday night when he beat a line-up of Hollywood all-stars — Leonardo DiCaprio, Ethan Hawke, Timothée Chalamet, Jesse Plemons and Michael B. Jordan — to take home the leading actor award for his performance as real-life Tourette syndrome campaigner John Davidson in Kirk Jones’ “I Swear.”\n\n\t“I absolutely can’t believe it, I can’t believe that I’m looking at people like you, in the same category as you, never mind that I’m stood here,” the tearful actor, who also stars as Elrond in Prime Video’s “Lord of the Rings: The Rings of Power,” said to his fellow nominees. “I honestly cannot believe that I have won this award. I really, really cannot. Everyone in this category blows me away.”\n\t\n\n\tAramayo went on to thank a number of people including director and writer Jones as well as Davidson, before sharing an anecdote about Hawke from his schooldays. “When I was in school, Ethan Hawke came in to speak to us at Juilliard and he gave an amazing talk on longevity as an actor, about protecting your instrument and avoiding self destructive behaviors,” the younger actor recalled. “And it had a really great impact on everyone in that room. So to be in this category with you tonight is incredible. Thank you Ethan.”\n\n\n\tStill in shock, he wrapped with: “OK I’m going to stop talking now. Thank you so so so so much.”\n\n\tEarlier in the evening Aramayo also won the EE Rising Star Award while “I Swear” casting director Lauren Evans won the casting award. Co-star Peter Mullan was nominated for supporting actor while the film was nominated for outstanding British film although it lost out in the category to “Hamnet.”\n\t\n\n\tSet in 1980s Scotland, “I Swear” follows John Davidson, a young man with severe Tourette syndrome, which can present with tics and outbursts involving cursing, as he navigates rejection from his family and society at a time when the condition was barely understood, and his eventual emergence as a national advocate for the disorder. \n\n\tDavidson was present during the first half of the BAFTA ceremony, where the audience included William and Catherine, the Prince and Princess of Wales, but after a number of involuntary outbursts he left midway through. BAFTAs host Alan Cumming apologized to anyone who was offended and thanked the audience for their understanding.\n\n\tPrior to the BAFTAs, Emma McNally, CEO of support and research charity Tourettes Action, told Variety: “Historically, portrayals of Tourette’s in the media have tended to focus on shock value or reduce the condition to a punchline. ‘I Swear’ is very different. It focuses on resilience, the challenges people face, and the everyday realities of living with Tourette’s, rather than relying on stereotypes or sensationalism. It’s such a powerful, compassionate film that has opened up meaningful conversations.”\n\n\tThe BAFTA win marks Aramayo’s first BAFTA Film Award nomination. Aramayo had already won the British Independent Film Award for best lead performance and the ALFS Breakthrough Performer of the Year at the London Critics Circle Film Awards ahead of the BAFTA ceremony.\n\n\t“I Swear” will be eligible for the Oscars next year after only getting a U.S. release recently. After premiering at TIFF last September it got a U.K. release in Oct. 2025.\n\n\tFor his BAFTA leading actor victory, Aramayo beat out Chalamet in “Marty Supreme,” DiCaprio in “One Battle After Another,” Hawke in “Blue Moon,” Jordan in “Sinners” and Plemons in “Bugonia.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘I Swear’ Star Robert Aramayo in Shock After Being Named BAFTA Best Actor Over Leonardo DiCaprio and Timothée Chalamet: ‘I Honestly Can’t Believe I Won’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/robert-3.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-22T20:19:08.000Z",
      "dateModified": "2026-02-22T20:19:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Paul Thomas Anderson on ‘One Battle After Another’ Winning Best Film at the BAFTAs: ‘Anybody That Says Movies Aren’t Any Good Anymore Should Piss Right Off’",
    "url": "https://variety.com/2026/film/awards/paul-thomas-anderson-piss-off-if-think-new-movies-arent-good-1236669078/",
    "image": "https://variety.com/wp-content/uploads/2026/02/pta-3.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-22T20:44:38.000Z",
    "description": "\n\tAfter “One Battle After Another” claimed the BAFTA for best film on Sunday night, director Paul Thomas Anderson had a simple message for critics of ",
    "body": "\n\tAfter “One Battle After Another” claimed the BAFTA for best film on Sunday night, director Paul Thomas Anderson had a simple message for critics of modern cinema.\n\n\t“Anybody that says movies aren’t any good anymore should piss right off,” Anderson, who both wrote and directed the action thriller, said to cheers and laughter. “I want to say thank you, and I know that there’s a bar somewhere. I think we should all go there. It’s been a long evening, but we have so much to celebrate.”\n\t\n\n\tAnderson ended his speech by sharing a quote from pianist, singer and activist Nina Simone that he admitted “we stole in our film.”\n\n\n\t“She says, ‘I know what freedom is, it’s no fear,'” Anderson said. “So let’s keep making things without fear. It’s a good idea. See ya at the bar!”\n\n\tAsked backstage if the world needs another revolution, Anderson replied: “Well yeah, sure, we do. We always do. We just need to conduct a revolution, hopefully without violence, and do it properly … Unfortunately, the title makes sense. It just does start to seem like one battle after another these days.”\n\n\tLoosely inspired by Thomas Pynchon’s novel “Vineland,” “One Battle After Another” follows ex-revolutionaries reuniting to rescue a comrade’s daughter after an old enemy resurfaces. The ensemble cast is stacked with award winners in Leonardo DiCaprio, Sean Penn, Benicio Del Toro and Regina Hall plus Teyana Taylor and breakout Chase Infiniti. On Sunday, “One Battle After Another” took home the most BAFTA Awards, including best director and adapted screenplay for Anderson and best supporting actor for Penn.\n\t\n\n\tFor Anderson, one of contemporary cinema’s most critically-acclaimed directors, “One Battle After Another” marks his first major awards contender and his first time winning BAFTA’s top prize. Both “There Will Be Blood” and “Licorice Pizza” were nominated for best film but lost out. Across eight previous nominations, he’s only had one win, when “Licorice Pizza” won best original screenplay in 2022.\n\n\t“One Battle After Another,” which has 13 Oscar nominations, went into the BAFTA Film Awards leading the pack with 14 nominations, just two short of the record set by “Gandhi.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Paul Thomas Anderson on ‘One Battle After Another’ Winning Best Film at the BAFTAs: ‘Anybody That Says Movies Aren’t Any Good Anymore Should Piss Right Off’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/pta-3.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-22T20:44:38.000Z",
      "dateModified": "2026-02-22T20:44:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How to Watch Claressa Shields vs. Franchon Crews-Dezurn 2 Boxing Live Online",
    "url": "https://variety.com/2026/shopping/news/how-to-watch-shields-vs-crews-dezurn-2-boxing-live-online-1236667288/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Boxing-Claressa-Shields-Getty-VR-Featured.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-22T22:00:00.000Z",
    "description": "\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.\n\n\tAfter fac",
    "body": "\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.\n\n\tAfter facing off against each other back in 2016, Michigan fighter Claressa Shields defeated Virginia Beach boxer Franchon Crews-Dezurn in an unanimous decision to kickstart both of their professional careers in the ring. And now, undisputed heavyweight champion Shields, defense her IBF, WBA, WBC and WBO titles against Crews-Dezurn in a 10-round bout in a highly-anticipated rematch 10 years later.\n\n\tOn Sunday, Feb. 22, Shields (17-0-0) vs. Crews-Dezurn (10-2-0) takes place at Little Caesar’s Arena in Detroit, Michigan with a start time of 8 p.m. ET/5 p.m. PT. Ringwalk for the main event is expected around 11 p.m. ET/8 p.m. PT.\n\n\n\tShields vs. Crews-Dezurn 2 is available as a premium live boxing event, so it’s free to watch for DAZN subscribers.\n\n\tNot a DAZN subscriber? Right now, you can purchase access to the event starting at $20.99/month. Additionally, DAZN’s “Ultimate Tier” plan goes for just $44.99/month to get access to this PPV event, as well as 11 other PPV events throughout the year at no extra cost. It’s just a flat monthly subscription price. The plan also have access to more than 100 live fights all year long, as well as fight replays, highlights and documentaries.\n\n\tThe fights during the Shields vs. Crews-Dezurn 2 event are free to watch for subscribers.\n\t\n\t\tClaressa Shields vs. Franchon Crews-Dezurn 2 Odds & Predictions\t\n\n\tFor the main event, Shields is the strong favorite to win against Crews-Dezurn. Oddsmakers give Claressa Shields a -2,400 moneyline, while Franchon Crews-Dezurn received a line of +1,140, as the underdog. Want more odds? Check out the complete odds and wagers at BetMGM.com online here.\n\n\n\tTaking place on Sunday, Feb. 22, Claressa Shields vs. Franchon Crews-Dezurn 2 is available to livestream on DAZN for subscribers starting at 8 p.m. ET/5 p.m. PT.\n\n\tMain Card\n\n\nWomen’s Heavyweight: Claressa Shields (champion) vs. Franchon Crews-Dezurn — Main Event, Undisputed Title Fight\nLight Heavyweight: Atif Oberlton vs. Joseph George\nWomen’s Light Heavyweight: Che Kenneally (champion) vs. Danielle Perkins — WBA Title Fight\nHeavyweight: Pryce Taylor vs. James Evans\n\n\n\n\tFan of world sports? DAZN is the home to global sports, including FIFA, BKFC, National League, UEFA Women’s Championship League, ERC and WRC racing, Riyadh Season boxing, NFL Game Pass International and other American and international sports leagues. Learn more about DAZN and its programming here.\n\t\n\t\tGambling problem? Call 1-800-GAMBLER (Available in the US)Call 877-8-HOPENY or text HOPENY (467369) (NY)Call 1-800-327-5050 (MA)21+ only. Please Gamble Responsibly. Call 1-800-NEXT-STEP (AZ), 1-800-BETS-OFF (IA), 1-800-981-0023 (PR). Visit www.1800gambler.net (WV). First Bet Offer for new customers only (if applicable). Subject to eligibility requirements. Bonus bets are non-withdrawable. In partnership with Kansas Crossing Casino and Hotel.See BetMGM.com for Terms. US promotional offers not available in DC, Mississippi, New York, Nevada, Ontario, or Puerto Rico.\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How to Watch Claressa Shields vs. Franchon Crews-Dezurn 2 Boxing Live Online",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Boxing-Claressa-Shields-Getty-VR-Featured.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-22T22:00:00.000Z",
      "dateModified": "2026-02-22T22:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Prince William Awards ‘Exceptional’ NBCUniversal Chief Donna Langley Highest BAFTA Honor: ‘She Is a Shining Light’",
    "url": "https://variety.com/2026/film/awards/prince-william-donna-langley-nbcuniversal-bafta-awards-1236669830/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Donna-Langley-Prince-William-BAFTAs.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-22T20:54:01.000Z",
    "description": "\n\tPrince William paid tribute to NBCUniversal chair Donna Langley as he awarded her BAFTA’s highest honor, the BAFTA Fellowship during the film awards",
    "body": "\n\tPrince William paid tribute to NBCUniversal chair Donna Langley as he awarded her BAFTA’s highest honor, the BAFTA Fellowship during the film awards on Sunday night, calling the British-born studio head a “shining light.”\n\n\t“The path to fellowship is an honor given in recognition of an exceptional contribution to film,” he told the audience, which included many of Langley’s colleagues and collaborators, including Leonardo DiCaprio, Renée Zellweger and Emma Stone. “And tonight’s recipient is quite simply that – exceptional.”\n\t\n\n\tHe went on to cite Langley’s “determination,” “commitment,” “transformative leadership” and “unwavering commitment to creative partnership” among other characteristics.\n\n\n\tHe also praised Langley, who was awarded one of the U.K.’s highest royal honors, a Damehood, by Queen Elizabeth II in 2020, for advocating “tireless[ly]” for British talent abroad.\n\n\t“Dame Donna’s impact at NBC Universal and on the film industry is significant,” William said. “She is a shining light to all those starting out in the creative industries, showing that anything is possible.”\n\n\tHe then introduced a VT that included tributes from many of Langley’s colleagues including Christopher Nolan, who is currently putting the finishing touches to upcoming Universal Pictures film “The Odyssey,” Steven Spielberg, Eric Fellner, Judy Craymer and Emma Thompson.\n\n\t“Her patience is kind of like the bonding agent,” Spielberg said. “It makes us all feel like, in a way, she’s our security blanket.”\n\n\tAs the audience at the Royal Festival Hall rose to give Langley a standing ovation, William’s wife Catherine, who was sitting next to the NBCUniversal chief in the front row, gave her a warm smile before Langley made her way to the stage to accept her fellowship.\n\t\n\n\t“As my career has progressed, I’ve come to believe that the most meaningful part of what we do is the people we choose to support along the way,” Langley told the audience. “The voices we encourage. And the talent we protect…long enough for them to find their feet. And the doors we remember to open.”\n\n\t“We are also facing moments of change and disruption today. And my hope is that those of us who help tell stories for a living continue to find inspiration to make popular art that carries over into people’s everyday lives – that helps us understand the world a bit better and to see each other a little more clearly…and reminds us that decency is a superpower.”\n\n\tWilliam and Catherine’s presence at the ceremony on Sunday night was a closely guarded secret, with neither BAFTA nor Kensington Palace giving any hint the couple planned to attend. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Prince William Awards ‘Exceptional’ NBCUniversal Chief Donna Langley Highest BAFTA Honor: ‘She Is a Shining Light’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Donna-Langley-Prince-William-BAFTAs.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-22T20:54:01.000Z",
      "dateModified": "2026-02-22T20:54:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Marty Supreme’ Ties BAFTA Record for Most Losses in History",
    "url": "https://variety.com/2026/film/awards/marty-supreme-ties-bafta-record-most-losses-1236666026/",
    "image": "https://variety.com/wp-content/uploads/2026/01/MCDMASU_EC029.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-22T20:07:53.000Z",
    "description": "\n\tMarty Mauser has lost another critical match — but this time, it was in the awards game.\n\n\tJosh Safdie’s sports dramedy “Marty Supreme” left this ye",
    "body": "\n\tMarty Mauser has lost another critical match — but this time, it was in the awards game.\n\n\tJosh Safdie’s sports dramedy “Marty Supreme” left this year’s BAFTA ceremony with an unwelcome distinction, tying the record for most losses in a single night after going 0-for-11.\n\n\tThe film entered BAFTA with formidable nomination strength and broad expectations of converting in at least a handful of categories — particularly for leading actor Timothée Chalamet, who picked up major stops this season at the Critics Choice Awards and the Golden Globes in Jan. In one of the night’s biggest shocks, Chalamet lost to Robert Aramayo from Kirk Jones’ Tourette’s drama movie, “I Swear.” \n\t\n\n\tNow, the A24 contender was shut out across the board, joining “Women in Love” (1969) and “Finding Neverland” (2004) as the only films to go winless with 11 nominations. Notably, both of those titles still went on to win a single Oscar on their respective nights: Glenda Jackson for best actress (“Women in Love”) and Jan A.P. Kaczmarek for original score (“Finding Neverland”). The BAFTA result is especially striking given Safdie’s own dominance on the ballot; he is the year’s most-nominated individual with four nominations, spanning his roles as director, co-producer, co-writer and co-editor.\n\n\n\tDespite the BAFTA setback, “Marty Supreme” remains a formidable player in the wider awards conversation, and history offers a reminder that a rough precursor night isn’t always fatal. Another A24 title, “Everything Everywhere All at Once” (2022), managed only one BAFTA win (film editing) before going on to take seven Oscars, including best picture, director and three acting prizes. The moving drama “Moonlight” (2016) also went without a single BAFTA win that year, losing all four of its awards, before pulling off a historic upset in best picture at the Oscars.\n\t\n\n\tStill, the optics sting with a win-less night and a record-tying losses stat, which is not the kind of headline any campaign wants in the final stretch.\n\n\tAt BAFTA, “Marty Supreme” was nominated for best film, director, leading actor (Chalamet), supporting actress (Odessa A’zion), casting, original screenplay, production design, cinematography, costume design, film editing and makeup and hairstyling. At the Oscars, the film is nominated for nine, but misses BAFTA nominations for supporting actress and makeup and hairstyling.\n\n\tFinal Oscar voting runs from Feb. 26 to March 5. The 98th Oscars will be held on March 15 on ABC, hosted by Conan O’Brien.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Marty Supreme’ Ties BAFTA Record for Most Losses in History",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/MCDMASU_EC029.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-22T20:07:53.000Z",
      "dateModified": "2026-02-22T20:07:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "BAFTAs Make the Oscars Race Messy, From Timothée Chalamet’s Shocking Loss to Sean Penn and Wunmi Mosaku Proving Supporting Races Are Anyone’s Game",
    "url": "https://variety.com/2026/film/awards/baftas-oscars-chalamet-loss-penn-mosaku-supporting-races-1236669817/",
    "image": "https://variety.com/wp-content/uploads/2026/02/3-Split-3x2-Layout-2-6.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-22T21:50:32.000Z",
    "description": "\n\tFractured, unpredictable and thrilling chaos are defining this awards season after a wild night at the 79th BAFTA Awards, with the race now barrelin",
    "body": "\n\tFractured, unpredictable and thrilling chaos are defining this awards season after a wild night at the 79th BAFTA Awards, with the race now barreling into the final stretch before Oscar voting opens Thursday, Feb. 26.\n\n\tPaul Thomas Anderson’s “One Battle After Another” was the night’s dominant force, winning six BAFTAs: best film, director, adapted screenplay, supporting actor (Sean Penn), cinematography and editing.\n\n\n\tFor Oscar watchers, the technical trophies matter as much as the headline prizes. Winning for the artisans brings crucial momentum. “One Battle After Another” leaves BAFTA positioned as a below-the-line viability and still a clear best picture frontrunner. But if anyone hoped for a night of tidy answers, BAFTA offered the opposite with a loud reshuffle that may have clarified one thing and destabilized nearly everything else.\n\t\n\n\tEnter “Sinners” from Ryan Coogler. His film won three BAFTAs — original screenplay, supporting actress for Wunmi Mosaku and original score — with Coogler’s screenplay win carrying historic weight as the first Black winner in BAFTA’s original screenplay category. The moment land became a milestone, the campaign accelerated.\n\n\tThe win also sharpens the Oscar math.\n\n\tOnly one Black screenwriter has ever won for original screenplay at the Oscars (Jordan Peele for “Get Out,” 2017). Coogler’s BAFTA trophy strengthens his Oscar prospects against a crowded field. However, and just as important, “Sinners” showed more above-the-line vitality where it needed oxygen most, with Mosaku’s supporting actress win adding real heat to the campaign.\n\t\n\n\tSo if you’re keeping score — “One Battle After Another” needed to prove below-the-line love (which it did), and “Sinners” needed to prove more above-the-line love (which it did). Obviously, “One Battle After Another” taking best film and director, after sweeping major critics awards and the DGA leaves many believing it’s over. But if you do your Oscar homework, you know that’s never the case. We have the PGA Awards and the Actor Awards (formerly SAG Awards) happening this upcoming week, all amid final Oscar voting. There’s room for more shifts to happen in the coming days.\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tCourtesy Everett Collection\n\t\n\n\n\n\tAnother significant upset came later in the BAFTA evening when Timothée Chalamet lost the leading actor award to Robert Aramayo for his performance in Kirk Jones’ Tourette’s drama “I Swear.” Aramayo also won the EE Rising Star Award, the only honor voted on by the public. Interestingly, Aramayo and “I Swear” have different kinds of momentum, which are forward-looking for next year’s Oscars. The film will be eligible for the 99th Oscars ceremony, with a U.S. release later this year from Sony Pictures Classics.\n\n\tNonetheless, Chalamet arrived as the presumed frontrunner after major victories at CCAs and Globes for Josh Safdie’s sports dramedy. At this stage in the season, a loss like this cannot be read as a mere statistical blip. Rather, it can change the story voters tell themselves when they fill out their ballots. Whether it proves ultimately fatal to the campaign is unknowable. Still, it is absolutely relevant, particularly with final voting around the corner.\n\n\tBut the damage didn’t stop there. “Marty Supreme” left with an especially brutal distinction, going 0 for 11, tying the record for most losses in a single night.\n\n\tThe SAG Award may now serve as the decisive indicator. Variety has projected for weeks that Ethan Hawke could be the victor in the category for his work as Lorenz Hart in “Blue Moon.” Whoever claims that prize will likely emerge as your Oscar winner. And worth noting: no performer has ever won back-to-back SAG Awards in the same category. Chalamet, who took home the prize last year for “A Complete Unknown,” would make history if he reversed course and won.\n\n\tJessie Buckley won leading actress for “Hamnet,” which also won for outstanding British film. The result was broadly anticipated, and the reason is simple, as Buckley’s campaign has looked like the closest thing to a straight line in a season full of detours.\n\t\n\n\tThe real circus, though, is the supporting acting races. If BAFTA proved anything, it’s that both are wide open, and not in the polite, pundit-friendly way, but in the genuine chaotic manner. We’ve had three different winners — for both supporting acting races — at the Globes, CCA, and BAFTAs so far.\n\n\tThe closest occurrence of something like this happening was in 2004. Globes went to Clive Owen and Natalie Portman for “Closer” (who both missed SAG noms). CCA went to the “Sideways” duo, Thomas Haden Church and Virginia Madsen, and SAG went to eventual Oscar winner Morgan Freeman from “Million Dollar Baby” and Cate Blanchett from “The Aviator.” That specific year, the BAFTA Awards were the final say on the season, with Owen and Blanchett taking their prizes. In the end, it was SAG that was ultimately correct with Freeman from the eventual best picture winner, and Blanchett from the presumed “runner-up.”\n\n\tEven though he’s a two-time Oscar winner for “Mystic River” (2003) and “Milk” (2008), Penn won his first-ever BAFTA for supporting actor for his villainous turn as Col. Lockjaw in “One Battle After Another,” adding his name to the already fractured leaderboard. Jacob Elordi holds the Critics Choice prize for “Frankenstein.” Stellan Skarsgård took the Golden Globe for “Sentimental Value.” Now Penn has a BAFTA. With the Actor Award still pending, this race is starting to resemble a five-sided coin flip. If Benicio del Toro takes the SAG prize, we’ll have four different winners at every televised show, which hasn’t happened since the COVID-era of 2020’s best actress race — which ended up favoring the BAFTA winner from the eventual best picture winner “Nomadland,” Frances McDormand. That leaves surprise Oscar nominee Delroy Lindo, who is still very much on the table for his work in “Sinners.” Interestingly, before 2020, another time four different winners won awards at the precursors was the 2000 season, where Frances McDormand won CCA for “Almost Famous,” before her co-star Kate Hudson took the Golden Globe, followed by SAG with Judi Dench for “Chocolat” and BAFTA for Julie Walters in “Billy Elliot.” The eventual Oscar winner was Marcia Gay Harden from “Pollock,” who, like Lindo, didn’t land any noms from any of the precursors. Could that be a sign of good things to come for Lindo?\n\t\n\n\tSkarsgård’s loss, in particular, lands with force. His turn as film director Gustav Borg in “Sentimental Value” (which won a single prize for non-English-language film) had the role and prestige that often come with supporting, even with a SAG snub under his belt. Regina King (“If Beale Street Could Talk,” 2018) is the last acting winner to do so without a win from either SAG or BAFTA (and she coincidentally didn’t have nominations at either).\n\n\tSupporting actress is no calmer. Teyana Taylor has the Golden Globe for “One Battle After Another.” Amy Madigan won Critics Choice for “Weapons” but wasn’t nominated at BAFTA. Mosaku now has a BAFTA for “Sinners.” None of it adds up to a safe consensus, and that uncertainty is the point. With SAG still to come and no obvious default choice, the industry’s own voting bloc may end up acting as the season’s final referee.\n\n\tBeyond the headline races, the craft categories offered their declarative statements. “Frankenstein” won costume design, makeup and hair, and production design, giving it a firm technical foothold as Oscar voters start locking in their preferences. “Sentimental Value” won film not in the English language, but “The Secret Agent” has Globes and CCA under its belt as well. “Mr. Nobody Against Putin” won documentary over the presumed favorite “The Perfect Neighbor.” In contrast, “Zootopia 2” won animated film, without the presence of “KPop Demon Hunters,” which wasn’t eligible to be nominated due to its release. However, EJAE still gave the film a presence just one day after it swept the Annie Awards, taking home 10 statuettes.\n\n\tHeading into the final weeks of awards season, the shape of the battlefield is clearer and messier at the same time. “One Battle After Another” looks like the best picture target everyone else has to hit. Buckley appears to be the closest thing to a near-lock in any acting race. Coogler has the wind at his back in original screenplay. And almost everything else remains in flux. The BAFTAs rarely make the Oscars simpler. This year, they’ve made them electric.\n\n\tFinal Oscar voting will take place from Feb. 26 to March 5. The 98th Oscars will be held March 15 and will air on ABC, hosted by Conan O’Brien. This week’s updated Oscar predictions are below.\n\t\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\t©Focus Features/Courtesy Everett Collection\n\t\n\n\n\t\n\t\tOscars Predictions Tracking(Feb. 22, 2026)\t\n\n\tBest Picture: “Sinners” (Warner Bros.) — Zinzi Coogler, Sev Ohanian and Ryan Coogler\n\n\tDirector: Paul Thomas Anderson, “One Battle After Another” (Warner Bros.)\n\n\tActor: Ethan Hawke, “Blue Moon” (Sony Pictures Classics)\n\n\tActress: Jessie Buckley, “Hamnet” (Focus Features)\n\n\tSupporting Actor: Delroy Lindo, “Sinners” (Warner Bros.)\n\n\tSupporting Actress: Wunmi Mosaku, “Sinners” (Warner Bros.)\n\n\tOriginal Screenplay: “Sinners” (Warner Bros.) — Ryan Coogler\n\n\tAdapted Screenplay: “One Battle After Another” (Warner Bros.) — Paul Thomas Anderson\n\n\tCasting: “Sinners” (Warner Bros.) — Francine Maisler\n\n\tAnimated Feature: “KPop Demon Hunters” (Netflix) — Maggie Kang, Chris Appelhans and Michelle L.M. Wong\n\n\tProduction Design: “Frankenstein” (Netflix) — Tamara Deverell; Shane Vieau\n\n\tCinematography: “One Battle After Another” (Warner Bros.) — Michael Bauman\n\n\tCostume Design: “Frankenstein” (Netflix) — Kate Hawley\n\n\tFilm Editing: “One Battle After Another” (Warner Bros.) — Andy Jurgensen\n\n\tMakeup and Hairstyling: “Frankenstein” (Netflix) — Mike Hill, Jordan Samuel and Cliona Furey\n\n\tSound: “F1” (Apple Original Films/Warner Bros.) — Gareth John, Al Nelson, Gwendolyn Yates Whittle, Gary A. Rizzo and Juan Peralta\n\n\tVisual Effects: “Avatar: Fire and Ash” (20th Century Studios) — Joe Letteri, Richard Baneham, Eric Saindon and Daniel Barrett\n\n\tOriginal Score: “Sinners” (Warner Bros.) — Ludwig Göransson\n\n\tOriginal Song: “Golden” from “KPop Demon Hunters” (Netflix) — EJAE, Mark Sonnenblick, Joong Gyu Kwak, Yu Han Lee, Hee Dong Nam, Jeong Hoon Seon and Teddy Park\n\n\tDocumentary Feature: “The Perfect Neighbor” (Netflix) — Geeta Gandbhir, Alisa Payne, Nikon Kwantu and Sam Bisbee\n\n\tInternational Feature: “Sentimental Value” from Norway (Neon) — dir. Joachim Trier\n\n\tAnimated Short: “The Girl Who Cried Pearls” (National Film Board of Canada) — Chris Lavis and Maciek Szczerbowski\n\n\tDocumentary Short: “All the Empty Rooms” (Netflix) — Joshua Seftel and Conall Jones\n\n\tLive Action Short: “Two People Exchanging Saliva” (Canal+/The New Yorker) — Alexandre Singh and Natalie Musteata\n\n\n\tProjected winner leaders (films): “Sinners” (6), “One Battle After Another” (4); “Frankenstein” (3); “KPop Demon Hunters” (2)\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "BAFTAs Make the Oscars Race Messy, From Timothée Chalamet’s Shocking Loss to Sean Penn and Wunmi Mosaku Proving Supporting Races Are Anyone’s Game",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/3-Split-3x2-Layout-2-6.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-22T21:50:32.000Z",
      "dateModified": "2026-02-22T21:50:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NBA Youngboy Announces Birth of His 13th Child, 3rd With Wife Jazlyn Mychelle",
    "url": "https://www.tmz.com/2026/02/22/nba-youngboy-13th-baby/",
    "image": "https://imagez.tmz.com/image/c1/16by9/2026/02/22/c11e70d79a48444fa641e2d4e6a67dd2_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-23T00:45:02.000Z",
    "description": "\n    \n                    \n                          NBA Youngboy\n                          Welcomes Baby No. 13!!!\n                      \n           ",
    "body": "\n    \n                    \n                          NBA Youngboy\n                          Welcomes Baby No. 13!!!\n                      \n                  \n                                                                        Published \n                              February 22, 2026\n                            4:45 PM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          NBA Youngboy and his wife Jazlyn Mychelle have just welcomed their third child ... the \"Bandit\" rapper's 13th!\n      \n    \n          NBA took to Instagram to make the happy announcement Sunday, posting a video on his story.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          He could be heard in the background saying, \"My gangsta had her baby!\"\n      \n\n          He then asked her, \"How do you feel?\"\n      \n    \n          \"Relieved,\" Jazlyn said.\n      \n    \n          The new addition -- a baby girl -- joins the son and daughter NBA and Jazlyn already have, as well as NBA's 10 other children from previous relationships.\n      \n    \n          Congrats!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                NBA Youngboy\n              \n                          \n                Celebrity News\n              \n                          \n                Baby Watch\n              \n                          \n                Music\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NBA Youngboy Announces Birth of His 13th Child, 3rd With Wife Jazlyn Mychelle",
      "image": [
        "https://imagez.tmz.com/image/c1/16by9/2026/02/22/c11e70d79a48444fa641e2d4e6a67dd2_xl.jpg"
      ],
      "datePublished": "2026-02-23T00:45:02.000Z",
      "dateModified": "2026-02-23T00:45:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Timothée Chalamet and Kylie Jenner Turn BAFTAs Into Romantic Date Night",
    "url": "https://www.tmz.com/2026/02/22/timothee-chalamet-kylie-jenner-baftas-date/",
    "image": "https://imagez.tmz.com/image/f9/16by9/2026/02/22/f903c19ae9a94875b99c0bb110e8f9ce_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-22T18:51:00.000Z",
    "description": "\n    \n                    \n                          Timothée Chalamet & Kylie Jenner\n                          We Got It Chala-Made!!!\n              ",
    "body": "\n    \n                    \n                          Timothée Chalamet & Kylie Jenner\n                          We Got It Chala-Made!!!\n                          Shine Bright at BAFTAs\n                      \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Now this is worth the price of Jenner-al admission! Timothée Chalamet and Kylie Jenner -- and their PDA -- were a main attraction at the 2026 BAFTA Awards on Sunday ... turning another award show into an intimate date night.\n      \n    \n          Check out the pics ... the couple matched in elegant black fits for the event at the Southbank Centre's Royal Festival Hall in London. Kylie sparkled in a bedazzled dress, while Chalamet went with a classic tux and bow tie.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Kylie supported her man as he was nominated for Best Leading Actor. His nod marked one of 11 nominations for his film \"Marty Supreme.\"\n      \n\n          The two have gotten quite used to award show red carpets this year. We spotted them at the Golden Globes and the Critics' Choice Awards, where they also turned heads.\n      \n    \n          Can't wait to see them at the Oscars!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Timothee Chalamet\n              \n                          \n                Kylie Jenner\n              \n                          \n                Celebrity News\n              \n                          \n                BAFTA Awards\n              \n                          \n                Dating\n              \n                          \n                Couples\n              \n                          \n                Award Shows\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Timothée Chalamet and Kylie Jenner Turn BAFTAs Into Romantic Date Night",
      "image": [
        "https://imagez.tmz.com/image/f9/16by9/2026/02/22/f903c19ae9a94875b99c0bb110e8f9ce_xl.jpg"
      ],
      "datePublished": "2026-02-22T18:51:00.000Z",
      "dateModified": "2026-02-22T18:51:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Guess Who This '90s Sitcom Star Is!",
    "url": "https://www.tmz.com/2026/02/22/guess-who-sitcom-star/",
    "image": "https://imagez.tmz.com/image/86/16by9/2026/02/18/867935d6abfc4845850cb9e8d38e4617_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-23T00:00:25.000Z",
    "description": "\n    \n                    \n                          Guess Who\n                          This '90s Sitcom Star Is!!!\n                      \n          ",
    "body": "\n    \n                    \n                          Guess Who\n                          This '90s Sitcom Star Is!!!\n                      \n                  \n                                                                        Published \n                              February 22, 2026\n                            4:00 PM PST\n                                                                            \n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          Sometimes all it takes is one iconic face to trigger pure ’90s nostalgia -- but only true sitcom superfans will clock who this mystery legend is!\n      \n    \n          This TV titan has racked up plenty of Emmys, SAG Awards and Golden Globes ... and if you’re still stuck, his last name rhymes with \"glamour.\"\n      \n    \n          We caught up with him in L.A. back in 2020 ... and he sounded off on local bars in the city, and gave us his thoughts about celebrities sticking their noses into politics. Can you guess who it is?!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                TV\n              \n                          \n                Guess Who\n              \n                          \n                TV Stars\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Guess Who This '90s Sitcom Star Is!",
      "image": [
        "https://imagez.tmz.com/image/86/16by9/2026/02/18/867935d6abfc4845850cb9e8d38e4617_xl.jpg"
      ],
      "datePublished": "2026-02-23T00:00:25.000Z",
      "dateModified": "2026-02-23T00:00:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Selena Gomez and Nina Dobrev Turn Up The Heat On Cabo Yacht Getaway",
    "url": "https://www.tmz.com/2026/02/22/selena-gomez-and-nina-dobrev-turn-up-the-heat-on-cabo-yacht-getaway/",
    "image": "https://imagez.tmz.com/image/38/16by9/2026/02/22/389ba6c365bb499887eb9ed5d1a0030d_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-22T23:29:22.000Z",
    "description": "\n    \n                    \n                          Selena Gomez & Nina Dobrev\n                          Make Waves Off Mexico Coast!!!\n             ",
    "body": "\n    \n                    \n                          Selena Gomez & Nina Dobrev\n                          Make Waves Off Mexico Coast!!!\n                      \n      \n    \n          Selena Gomez and Nina Dobrev are living their best yacht life and Cabo is their playground right now.\n      \n    \n          The two A-listers turned up the heat during a sun-drenched girls' getaway off the coast of Los Cabos Sunday, hopping aboard a luxury yacht and diving headfirst into vacation mode.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Selena rocked a sleek black string bikini as she took the plunge into the crystal-blue water while Nina stunned in a black bikini that practically screamed summer.\n      \n\n          Selena wasn't done serving looks on the yacht. She was also photographed beachside at Las Ventanas al Paraíso, lounging under a private cabana in a soft pink one shoulder swimsuit and wide brim straw hat. \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Shielding her eyes with oversized sunglasses, the singer and beauty mogul dipped her toes in the ocean and soaked up the Baja sunshine like a true relaxation pro.\n      \n    \n          Cabo's hot ... but Selena and Nina are hotter!!\n      \n      \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Selena Gomez and Nina Dobrev Turn Up The Heat On Cabo Yacht Getaway",
      "image": [
        "https://imagez.tmz.com/image/38/16by9/2026/02/22/389ba6c365bb499887eb9ed5d1a0030d_xl.jpg"
      ],
      "datePublished": "2026-02-22T23:29:22.000Z",
      "dateModified": "2026-02-22T23:29:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "FBI Director Kash Patel Parties With U.S. Men's Olympic Hockey Team After Gold Medal Win",
    "url": "https://www.tmz.com/2026/02/22/fbi-director-kash-patel-parties-with-us-mens-olympic-hockey-team-after-gold-win/",
    "image": "https://imagez.tmz.com/image/36/16by9/2026/02/23/36356cc9b1814adfb2d2c0a7cba5e66e_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-23T01:49:07.000Z",
    "description": "\n    \n                    \n                          Kash Patel\n                          Chugs Beer With USA Men's Hockey Team\n                      ",
    "body": "\n    \n                    \n                          Kash Patel\n                          Chugs Beer With USA Men's Hockey Team\n                          ... After Gold Medal Win\n                      \n                  \n                                                                        Published \n                              February 22, 2026\n                            5:49 PM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          FBI director Kash Patel really let loose with the USA Men's Olympic hockey team Sunday ... he was seen partying with the newly minted gold medalists in the locker room after their big win.\n      \n    \n          Check out the video ... Patel -- who plays a bit of hockey himself -- is absolutely euphoric, appearing to chug part of a beer and christening the players around him with what was left.\n      \n    \n        Waiting for your permission to load the Twitter Tweet.\n      \n    \n          One player even drapes a gold medal around Patel's neck while he's completely beside himself with joy.\n      \n\n          While Patel's time in Italy was full of fun, the good times may come to a crashing halt when he gets back home.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          The U.S. is bracing for a potential attack on Iran which could inspire threats stateside ... not to mention the investigation into the killing of a would-be intruder at Mar-a-Lago and the ongoing Nancy Guthrie investigation.\n      \n    \n          As we reported ... the U.S. Men's team won their first Olympic gold in 46 years after Jack Hughes scored the winning goal in overtime.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Kash Patel\n              \n                          \n                Sports\n              \n                          \n                Olympics\n              \n                          \n                TMZ Sports\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "FBI Director Kash Patel Parties With U.S. Men's Olympic Hockey Team After Gold Medal Win",
      "image": [
        "https://imagez.tmz.com/image/36/16by9/2026/02/23/36356cc9b1814adfb2d2c0a7cba5e66e_xl.jpg"
      ],
      "datePublished": "2026-02-23T01:49:07.000Z",
      "dateModified": "2026-02-23T01:49:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]