[
  {
    "title": "Keira Knightley Says Paparazzi Shouted ‘Whore’ at Her to Incite Violent Reactions; She Once Stood Still for Five Hours to Block Them From Getting a ‘Valuable Shot’",
    "url": "https://variety.com/2025/film/news/keira-knightley-paparazzi-abuse-whore-1236557017/",
    "image": "https://variety.com/wp-content/uploads/2025/10/P102FYXM.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-20T20:50:49.000Z",
    "description": "\n\tKeira Knightley recently told The Times of London that “I went mad” during the height of “Pirates of the Caribbean” fame, as the paparazzi descended",
    "body": "\n\tKeira Knightley recently told The Times of London that “I went mad” during the height of “Pirates of the Caribbean” fame, as the paparazzi descended onto her life and stalked her every move.\n\n\t“It was mostly ‘whore’ [they’d shout],” the actor said. “‘Slut’ sometimes. Particularly if I was with someone — a boyfriend, my brother or my dad. They were trying to get a reaction out of them — provoking people into punching them, so they could sue. And that was the time the crashes started happening — they were forcing people off the roads, then getting even bigger money for pictures of a crashed actress or whatever. And then Britney shaved her head so it was like, ‘Great — we can push them into doing something fucking crazy.’”\n\t\n\n\tKnightley said she went into survival mode and “started wearing the same clothes every day” in order to make herself not appealing to tabloid magazines. Her clothes included “three pairs of the same jeans, stripy T-shirt, boots. I gave all my other clothes away.”\n\n\n\t“And then, if I was being followed, I stopped walking,” Knightley added. “I’d literally stand there. Stock still. One day, I stood there for five hours. ‘If you’re still there, I’m not going. I’m not going to move’… [and then] it wasn’t a valuable shot to them if it was always me in the same clothes, standing still. There’s only so many times you can write, ‘Ooh, she’s wearing the same clothes,’ with a photo of me standing still. It gets boring.” \n\n\tThe unwanted attention got so extreme that Knightley made the decision to quit acting and “my family backed me. They said, ‘Just fucking walk.’” She first went to London and then started taking various trains all over Europe. Knightley was never noticed.\n\t\n\n\t“I was very good,” she said. “Museums, trains… no one expects to see you there. I was very scruffy, which they also wouldn’t have expected. You just don’t make eye contact, go a bit hunched. I kind of slithered.”\n\n\tKnightley was 18 years old when Disney’s “Pirates of the Caribbean” franchise launched and turned her into an international star. She told The Times last year that fame came at a “big price” and she found herself “stalked by men.” To make matters worse, she was told she deserved such behavior since she was a famous actor. She added at the time: “It was a brutal time to be a young woman in the public eye.”\n\n\tKnightley can currently be seen in the Netflix original movie “The Woman in Cabin 10,” now streaming.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Keira Knightley Says Paparazzi Shouted ‘Whore’ at Her to Incite Violent Reactions; She Once Stood Still for Five Hours to Block Them From Getting a ‘Valuable Shot’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/P102FYXM.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-20T20:50:49.000Z",
      "dateModified": "2025-10-20T20:50:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "AI News Anchor Debuts on U.K.’s Channel 4 in Stunt Proving Dangers of Artificial Intelligence",
    "url": "https://variety.com/2025/tv/news/ai-news-anchor-channel-4-1236557295/",
    "image": "https://variety.com/wp-content/uploads/2025/10/AI-Presenter.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-20T20:00:00.000Z",
    "description": "\n\tA news special on Britain’s Channel 4 titled “Will AI Take My Job?” investigated how automation is reshaping the workplace and pitting humans agains",
    "body": "\n\tA news special on Britain’s Channel 4 titled “Will AI Take My Job?” investigated how automation is reshaping the workplace and pitting humans against machines. At the end of the hour-long program, a major twist was revealed: the anchor, who narrates and appears throughout the telecast reporting from different locations, was entirely AI-generated.\n\n\tIn the final moments of the special, the host says: “AI is going to touch everybody’s lives in the next few years. And for some, it will take their jobs. Call center workers? Customer service agents? Maybe even TV presenters like me. Because I’m not real. In a British TV first, I’m an AI presenter. Some of you might have guessed: I don’t exist, I wasn’t on location reporting this story. My image and voice were generated using AI.”\n\t\n\n\tThe hour aired Monday at 8 p.m. as part of the “Dispatches” documentary program, which Channel 4 says is now the first British television show to feature an AI presenter. The “anchor” was produced by AI fashion brand Seraphinne Vallora for Kalel Productions and was guided by prompts to create a realistic on-camera performance.\n\n\t“The use of an AI presenter is not something we will be making a habit of at Channel 4 — instead our focus in news and current affairs is on premium, fact checked, duly impartial and trusted journalism — something AI is not capable of doing,” said Louisa Compton, Channel 4’s head of news and current affairs. “But this stunt does serve as a useful reminder of just how disruptive AI has the potential to be — and how easy it is to hoodwink audiences with content they have no way of verifying.”\n\t\n\n\tAccording to the state-owned network, the stunt complies with Channel 4’s editorial guidelines governing the ethical use of AI, as the reveal at the end is meant to make the viewer reflect on questions relating to trust and authenticity in the digital age.\n\n\t“Will AI Take My Job?” explores the findings of a Channel 4 survey of 1,000 business leaders in the U.K. According to the survey, 76% of bosses have already adopted AI for tasks previously carried out by humans, and 66% say they are “excited” about the technology’s use in the workplace. 41% said AI adoption has already led to reduced recruitment at their companies, and nearly half said they expect further staff reductions in the next five years.\n\n\tChannel 4’s stunt follows the media firestorm surrounding Tilly Norwood, an AI-generated “actress” that sparked backlash from actors, agencies and Hollywood unions.\n\n\t“To be clear, ‘Tilly Norwood’ is not an actor, it’s a character generated by a computer program that was trained on the work of countless professional performers — without permission or compensation,” SAG-AFTRA wrote in a statement. “It has no life experience to draw from, no emotion and, from what we’ve seen, audiences aren’t interested in watching computer-generated content untethered from the human experience. It doesn’t solve any ‘problem’ — it creates the problem of using stolen performances to put actors out of work, jeopardizing performer livelihoods and devaluing human artistry.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "AI News Anchor Debuts on U.K.’s Channel 4 in Stunt Proving Dangers of Artificial Intelligence",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/AI-Presenter.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-20T20:00:00.000Z",
      "dateModified": "2025-10-20T20:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rosalía Confirms New Album ‘Lux’ Will Release in November",
    "url": "https://variety.com/2025/music/news/rosalia-lux-album-november-release-date-1236554550/",
    "image": "https://variety.com/wp-content/uploads/2025/10/GettyImages-2174253919-e1760980951426.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-20T20:04:57.000Z",
    "description": "\n\tThe wait is over for Rosalía fans. On Monday, the Spanish singer, songwriter and producer confirmed that “Lux” — the follow-up to 2022’s “Motomami” ",
    "body": "\n\tThe wait is over for Rosalía fans. On Monday, the Spanish singer, songwriter and producer confirmed that “Lux” — the follow-up to 2022’s “Motomami” — will arrive on Nov. 7 via Columbia Records.\n\n\tThe Grammy-winning artist appeared at Madrid’s Gran Vía to reveal the official album artwork, a photograph of her in nuns attire against a baby-blue backdrop. The journey to Gran Vía was captured on both TikTok and Instagram livestreams. (Rosalía was driving and smoking a cigarette on the TikTok stream — which is against the platform’s policies. It is possible that is the reason why the live stream there was cut short.) \n\t\n\n\t“Been waiting so long for this day, this moment, and finally, this moment has arrived,” Rosalía said on live. Vinyl and CD editions of “Lux” are already available for sale on her website, including a package with a limited-edition signed postcard going for $34.99. \n\n\tPrior to the reveal, Rosalía had spent weeks dropping “Lux”-related clues across social media. This past month, she tweeted, “LUX = LOVE.” \n\n\tEarlier today, a billboard appeared in Times Square showing that “Lux” had a supposed November release date. More recently, she shared a clip of herself listening to a symphony orchestra with a rosary between her teeth.\n\n\tRosalía also revealed in a conversation with Highsnobiety that she’s experienced personal growth during the album-making process.\n\n\t“I’ve changed a lot, but at the same time, I’m still wrapping my head around the same things,” she said. “It’s like I still have the same questions and the same desire to answer them. I still have the same love for the past and the same curiosity for the future.”\n\t\n\n\tRosalía’s “Motomami” was released in March 2022, and won album of the year at the 23rd Annual Latin Grammy Awards. The feat made her the first woman to win album of the year twice, following her win for “El Mal Querer” in 2019. A concept album, “Motomami” was produced by Rosalía alongside Noah Goldstein, Michael Uzowuru, Dylan Wiggins and Pharrell Williams.\n\n\tFollowing the success of “Motomami,” Rosalía released features alongside Bjork, Lisa from Blackpink, and Ralphie Choo. She also released a three-song collaborative EP called “RR” in 2023 with Rauw Alejandro. The set included popular tracks like “Beso,” “Vampiros,” and “Promesa.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rosalía Confirms New Album ‘Lux’ Will Release in November",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/GettyImages-2174253919-e1760980951426.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-20T20:04:57.000Z",
      "dateModified": "2025-10-20T20:04:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Adam Driver Pitched Kylo Ren ‘Star Wars’ Standalone Movie With Steven Soderbergh, but Disney Rejected Script: ‘One of the Coolest’ Projects ‘I Had Ever Been a Part of’",
    "url": "https://variety.com/2025/film/news/adam-driver-kylo-ren-star-wars-steven-soderbergh-disney-1236557455/",
    "image": "https://variety.com/wp-content/uploads/2019/12/star-wars-the-rise-of-skywalker-3.jpg?crop=0px%2C0px%2C3050px%2C1716px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-10-20T23:12:27.000Z",
    "description": "\n\tAdam Driver and Steven Soderbergh almost brought their own twist to a galaxy far, far away.\n\n\tIn a recent sit down with AP, Driver said that over th",
    "body": "\n\tAdam Driver and Steven Soderbergh almost brought their own twist to a galaxy far, far away.\n\n\tIn a recent sit down with AP, Driver said that over the span of two years, he and Soderbergh developed a script called “The Hunt for Ben Solo.” The film would have taken place after the events of “The Rise of Skywalker,” and followed Driver’s Kylo Ren, aka Ben Solo, on a search for redemption.\n\n\n\tSoderbergh roughed out the story with “Logan Lucky” screenwriter Rebecca Blunt. Scott Z. Burns later joined to pen the script.\n\t\n\n\t“I always was interested in doing another ‘Star Wars,’” Driver said. “I had been talking about doing another one since 2021. Kathleen [Kennedy] had reached out. I always said: ‘With a great director and a great story, I’d be there in a second.’ I loved that character and loved playing him.”\n\n\tDriver described the film as “handmade and character-driven,” comparing it to 1980’s “The Empire Strikes Back.” The “White Noise” star said that that film is the “standard” of what a “Star Wars” movie should be.”\n\n\tSoderbergh and Driver pitched “The Hunt for Ben Solo” to Kathleen Kennedy, Dave Filoni and Cary Beck at Lucasfilm, who “loved the idea.” However, when they took the script over to Disney, they were shut down.\n\n\t“We presented the script to Lucasfilm. They loved the idea,” Driver recalled. “They totally understood our angle and why we were doing it. We took it to Bob Iger and Alan Bergman, and they said no. They didn’t see how Ben Solo was alive. And that was that.”\n\n\tLucasfilm declined to comment.\n\n\tSoderbergh told AP of the experience, “I really enjoyed making the movie in my head. I’m just sorry the fans won’t get to see it.” Driver agreed, calling the project “one of the coolest (expletive) scripts I had ever been a part of.”\n\t\n\n\tDriver debuted as Kylo Ren in 2015’s “The Force Awakens,” and reprised the role in 2017’s “The Last Jedi” and 2019’s “The Rise of Skywalker.”\n\n\tRead Driver’s entire interview with AP here. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Adam Driver Pitched Kylo Ren ‘Star Wars’ Standalone Movie With Steven Soderbergh, but Disney Rejected Script: ‘One of the Coolest’ Projects ‘I Had Ever Been a Part of’",
      "image": [
        "https://variety.com/wp-content/uploads/2019/12/star-wars-the-rise-of-skywalker-3.jpg?crop=0px%2C0px%2C3050px%2C1716px&resize=1000%2C563"
      ],
      "datePublished": "2025-10-20T23:12:27.000Z",
      "dateModified": "2025-10-20T23:12:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ticketmaster Claims in Letter to Congress That It ‘Does More Than Anyone to Get Tickets Into the Hands of Real Fans’; NIVA and NITO Do Not Agree",
    "url": "https://variety.com/2025/music/news/ticketmaster-denies-ftc-claims-scalpers-1236557421/",
    "image": "https://variety.com/wp-content/uploads/2023/01/featured_ticketmaster_digital.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-20T21:30:56.000Z",
    "description": "\n\tTicketmaster unveiled what it says are new measures to stop scalpers by barring users and ticket brokers from making multiple accounts, requiring re",
    "body": "\n\tTicketmaster unveiled what it says are new measures to stop scalpers by barring users and ticket brokers from making multiple accounts, requiring resellers to use taxpayer ID verification, and using AI tools for “faster assessment and cancellation of bot-purchased tickets,” as a Federal Trade Commission lawsuit filed last month continues that accuses the platform of working with resellers to elevate prices. The letter states that “Ticketmaster does more than anyone to fight bots and get tickets into the hands of real fans.”\n\t\n\n\tThe announcement was made via a lengthy letter written to the senators behind the lawsuit by the company’s executive vice president Dan Wall, obtained by Variety, with a goal to “increase the percentage of tickets going to real fans” by utilizing the Social Security number or taxpayer ID verification to cancel scalper accounts. Wall also said the company will not allow brokers to exceed the platform’s ticket resale limits, another accusation in the lawsuit.\n\n\n\tTicketmaster will also discontinue TradeDesk, a tool that allows resellers to track their ticket sales, although Live Nation denied that the tool was being used to mislead customers, as stated in the lawsuit.\n\n\tThe company also denied other allegations made in the lawsuit, claiming that it does not collude with ticket resellers to elevate prices, and that it violate the Better Online Ticket Sales Act (BOTS Act), a 2016 law meant to stop bots from reselling tickets at high prices.\n\n\tNot surprisingly, independent venue and touring organizations were quick to criticize the claims made in the letter. In a statement, the National Independent Venue Assn. wrote: “Live Nation’s ‘actions’ on resale detailed in a letter to Congress are too little and too late to get back the trust of fans, artists, and stages. They apparently got caught opening up their systems to predatory resellers, which is a betrayal of fans and artists. This looks like an attempt to clean up their devastated public image following the Federal Trade Commission’s strong BOTS Act and deceptive practices case against them. Based on that suit and this letter, we have seen clear evidence that Live Nation and Ticketmaster are in bed with scalpers, and resale platforms like StubHub and Vivid Seats benefit daily from it.\n\t\n\n\t“The meaningful way to repair the damage done by Live Nation’s alleged collusion with scalpers is for them to voluntarily cap resale tickets on their resale platform at no more than the face value of the original ticket.”\n\n\tAlso on Monday, the National Independent Talent Association, a trade group for independent U.S. managers, agents, and artists they represent, wrote, “Ticketmaster nor any other platform should engage in reselling tickets above face value. This practice hurts both artists and their fans. We are encouraged that the FTC’s efforts have already led to Ticketmaster reforming its systems by canceling multiple broker accounts and improving its efforts regarding BOTS sweeps.”\n\n\tVariety will have more on the situation as it develops.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ticketmaster Claims in Letter to Congress That It ‘Does More Than Anyone to Get Tickets Into the Hands of Real Fans’; NIVA and NITO Do Not Agree",
      "image": [
        "https://variety.com/wp-content/uploads/2023/01/featured_ticketmaster_digital.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-20T21:30:56.000Z",
      "dateModified": "2025-10-20T21:30:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘The Voice’ Sets Joe Walsh, Zac Brown as Season 28 Mega Mentors",
    "url": "https://variety.com/2025/tv/news/the-voice-joe-walsh-zac-brown-season-28-mega-mentors-1236557312/",
    "image": "https://variety.com/wp-content/uploads/2025/10/Joe-Walsh-Zac-Brown-The-Voice.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-20T20:00:00.000Z",
    "description": "\n\t“The Voice” Season 28 has brought on Rock & Roll Hall of Famer Joe Walsh and Grammy winner Zac Brown as the new mega mentors for the esason. \n\n\tBrow",
    "body": "\n\t“The Voice” Season 28 has brought on Rock & Roll Hall of Famer Joe Walsh and Grammy winner Zac Brown as the new mega mentors for the esason. \n\n\tBrown, the leader of the Zac Brown Band, will make his “Voice” debut alongside coaches Michael Bublé and Snoop Dogg. Walsh will team with coaches Niall Horan and Reba McEntire. Both enter the season as the remaining artists prepare for the Knockouts, which begin on Oct. 27. \n\n\n\tWalsh is known for his time as a member of The Eagles, as well as for hits like “Life’s Been Good,” “Rocky Mountain Way,” “Life in the Fast Lane,” and “Funk #49.” During his time with The Eagles, Walsh won five Grammy Awards. \n\t\n\n\tBrown is a three-time Grammy winner, while the Zac Brown Band has had six consecutive albums reach the Billboard Top 10. The band has also had five consecutive albums debut at number one on the Billboard Country Albums chart. They have sold 10.8 million albums to date. \n\n\tEach coach is entering the Knockouts with eight artists, with no saves or steals in this round of the competition. Coaches alone choose the winner from their team to advance to the Playoffs, the last round before the Live Shows.  This season’s knockouts also feature the first-ever “Mic Drop” button, given to each coach to use on an artist from their respective teams whose performance they deem worthy. Viewers at home will have the opportunity to vote for the “Mic Drop” winner among the four. The artist with the most votes is awarded a performance at The Rose Parade live on Jan. 1, 2026.  \n\n\t“The Voice” airs Mondays at 8 p.m. ET/PT on NBC and streams the next day on Peacock. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘The Voice’ Sets Joe Walsh, Zac Brown as Season 28 Mega Mentors",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/Joe-Walsh-Zac-Brown-The-Voice.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-20T20:00:00.000Z",
      "dateModified": "2025-10-20T20:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Leslie Jones Among ‘DMV’ Guest Stars This Season; Jessica Camacho Added to Recurring Cast",
    "url": "https://variety.com/2025/tv/news/dmv-guest-stars-leslie-jones-jessica-camacho-1236557374/",
    "image": "https://variety.com/wp-content/uploads/2025/10/Screen-Shot-2025-10-20-at-1.09.02-PM.png?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-20T20:45:00.000Z",
    "description": "\n\t“Saturday Night Live” alum Leslie Jones is among the guest stars set for Season 1 of CBS’ new comedy “DMV,” the network announced Monday. Other gues",
    "body": "\n\t“Saturday Night Live” alum Leslie Jones is among the guest stars set for Season 1 of CBS’ new comedy “DMV,” the network announced Monday. Other guest stars lined up include Zoe Lister-Jones (“Slip”), Chelsea Frei (“The Paper”) and former WNBA player Renee Montgomery, while Jessica Camacho (“Countdown”) is set for a recurring role.\n\n\t“DMV” premiered Oct. 13 and is back for its second episode tonight. The show, which airs Mondays at 8:30 p.m. ET, is a single-camera comedy set in the fictional “East Hollywood” branch of the Department of Motor Vehicles – where, as the logline notes, “employees are making minimum wage dealing with customers who are annoyed before they even walk in the door.”\n\t\n\n\tHarriet Dyer, Tim Meadows, Tony Cavalero, Molly Kearney, Alex Tarrant and Gigi Zumbado star in “DMV,” which was developed by Dana Klein and inspired by a short story from Katherine Heiny. The show has already been given a full season order of seven more episodes, bringing the total this year to 20.\n\n\n\tOn an upcoming episode of “DMV” Jones will play Sally, described as “the energetic and proud executive assistant to the Director of the California DMV. Our characters meet Sally on their road trip to the DMV holiday party in Sacramento and Barb (Molly Kearney) and Sally are kindred spirits and share a love for all things DMV.” \n\n\tLister-Jones will guest as Dr. Jacobs, “the entitled surgeon who’s finally set aside time to get their license and is not at all pleased that it is taking so long.” Frei plays Amber, the childhood friend of Colette (Dyer) “who is now an out of touch actress who visits the DMV to get her Real ID.” \n\t\n\n\tIn her recurring role, Camacho plays Surfer Mary, “the confident and carefree love interest who meets love interest Noa (Tarrant) when she is taking her driving test.” And Montgomery is set for a cameo.\n\n\tJones’ new comedy special, “Leslie Jones: Life Part 2,” premieres this Friday, Oct. 24, on Peacock; Lister-Jones’ credits also include “Beau is Afraid,” while Frei (repped by Paradigm and Untitled Ent.) has also been seen in “Poker Face.” Camacho’s other credits include “All Rise.” Montgomery is co-host of “Women’s Sports Now,” a TNT basketball analyst and co-owner and vice president of the WNBA’s Atlanta Dream.\n\n\tThey all join previously announced guest star Randall Park (“Fresh Off the Boat”), who will appear in an upcoming episode as Beau Young, manager of the rival North Hollywood DMV. \n\n\tCBS Studios is behind “DMV,” which is exec produced by Klein, Matt Kuhn, Aaron Kaplan, Wendi Trilling and Robyn Meisinger. Trent O’Donnell executive produced and directed the pilot from a script written by Klein.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Leslie Jones Among ‘DMV’ Guest Stars This Season; Jessica Camacho Added to Recurring Cast",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/Screen-Shot-2025-10-20-at-1.09.02-PM.png?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-20T20:45:00.000Z",
      "dateModified": "2025-10-20T20:45:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ben Stiller Says ‘Comedy Is More Challenging’ in Current Political Climate: ‘Speaking Truth to Power’ Is ‘The Most Important Thing’",
    "url": "https://variety.com/2025/film/news/ben-stiller-comedy-challenging-political-climate-1236557522/",
    "image": "https://variety.com/wp-content/uploads/2025/05/GettyImages-2213274940.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-21T01:44:01.000Z",
    "description": "\n\tBen Stiller is calling on comedians to keep pushing boundaries.\n\n\tDuring a recent interview with Radio Times, the “Severance” director said that com",
    "body": "\n\tBen Stiller is calling on comedians to keep pushing boundaries.\n\n\tDuring a recent interview with Radio Times, the “Severance” director said that comedy is facing unprecedented challenges in the current political climate. However, he urged those working in the genre to not back down in the face of external pressure.\n\n\t“We live in a world where taking chances with comedy is more challenging,” Stiller said. “You’re seeing that front and center in our country. But I think it’s important that comedians keep doing what they’re doing, speaking truth to power and being free to say what they want. That’s the most important thing.”\n\t\n\n\tFreedom of speech in comedy has been front of mind in Hollywood ever since Jimmy Kimmel was temporarily pulled off the air by ABC after the late-night host made on air comments about the death of conservative activist Charlie Kirk. ABC suspended “Jimmy Kimmel Live!” on Sept. 17, and the network returned the show to air on Sept. 22.\n\n\tStiller went on to cite another threat to comedy: social media. He fears the hyperactive nature of platforms like TikTok and Instagram have spoiled audience’s attentions spans and diluted the craft of comedians.\n\n\t“You have things that go out to huge audiences very quickly,” Stiller said. “I think we’ve reduced our attention spans down a little bit. I feel lucky to have grown up in the analogue world.”\n\n\tStiller is one of Hollywood’s most successful funnymen of the late ‘90s and early aughts, appearing in such films as “Happy Gilmore,” “Meet the Parents,” “Zoolander” “Anchorman,” “Dodgeball: A True Underdog Story” and “Tropic Thunder.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ben Stiller Says ‘Comedy Is More Challenging’ in Current Political Climate: ‘Speaking Truth to Power’ Is ‘The Most Important Thing’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/05/GettyImages-2213274940.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-21T01:44:01.000Z",
      "dateModified": "2025-10-21T01:44:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jon Stewart Slams Fox News for Complaining About Too Many ‘Old White People’ at No Kings Protests: ‘Make Up Your Mind’",
    "url": "https://variety.com/2025/tv/news/jon-stewart-fox-news-no-kings-protests-1236557534/",
    "image": "https://variety.com/wp-content/uploads/2025/10/MixCollage-20-Oct-2025-08-47-PM-1416.jpg?crop=0px%2C4px%2C1200px%2C675px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-10-21T04:04:28.000Z",
    "description": "\n\tOn this week’s episode of “The Daily Show,” Jon Stewart went after Fox News for their wishy-washy reaction to Saturday’s No Kings protests.\n\n\tStewar",
    "body": "\n\tOn this week’s episode of “The Daily Show,” Jon Stewart went after Fox News for their wishy-washy reaction to Saturday’s No Kings protests.\n\n\tStewart opened the monologue with clips of House Speaker Mike Johnson calling the No Kings protests the “hate America rally,” and U.S. Treasury Secretary Scott Bessent calling participants “the farthest left, the hardest core, the most unhinged in the Democratic party.”\n\n\n\t“Not the hardest core! I expected partial Marxism and hard core, but not full display hardest core ha-Marxism,” Stewart joked. “It was going to be like ‘Mad Max’ out there with Chuck Schumer on flaming guitar!”\n\t\n\n\tHe added, “So, this weekend, we sat in our bunkers, doors locked, windows boarded, muskets and cyanide pills at the ready, prepared for whatever the hardest core had in store. Do your worst, display your Marxism to its fullest!”\n\n\tStewart then cut to CNN’s report, which claimed that about 7 million people participated in the nationwide demonstration, and that the protests were “largely peaceful” and “often joyful.”\n\n\t“It was kind of an incredible turnout that was somewhat inspiring. 7 million Americans, zero mass shootings?” Stewart said. “I look forward to Republicans apologizing sincerely for implying these Americans were… what’s the word I’m looking for? Deplorable!”\n\n\tBack on Fox News, anchors were calling participants, “silly” and “dumb.” One commentator said because of all the “absurdist costumes,” the protests “don’t look serious.”\n\n\t“Make up your mind, Fox,” Stewart said. “You complained it would be a terrifyingly ‘shit your pants’ protest, and now you are complaining about how boringly unpants-shitting it was? Although there was one nit you picked that really felt off brand.”\n\t\n\n\tStewart then targeted another Fox News complaint, which was the No Kings protests were comprised of mostly “old white people.”\n\n\t“Extra extra, this read all about it! ‘This country has too many angry old white people,’ says — hold on — Fox News,” Stewart joked. “Fox News says, ‘Why are old white people so angry?’ Fox News, mad that there are so many old white people in America.”\n\n\tWatch the entire monologue below.\n\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jon Stewart Slams Fox News for Complaining About Too Many ‘Old White People’ at No Kings Protests: ‘Make Up Your Mind’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/MixCollage-20-Oct-2025-08-47-PM-1416.jpg?crop=0px%2C4px%2C1200px%2C675px&resize=1000%2C563"
      ],
      "datePublished": "2025-10-21T04:04:28.000Z",
      "dateModified": "2025-10-21T04:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘The Simpsons: Treehouse of Horror XXXVI’ Score Was Inspired by ‘Jaws,’ John Williams and ‘Late Night With the Devil’",
    "url": "https://variety.com/2025/artisans/news/the-simpsons-treehouse-of-horrors-inspired-by-jaws-1236557308/",
    "image": "https://variety.com/wp-content/uploads/2025/10/3615_2060_CCs65-1.png?crop=240px%2C43px%2C1406px%2C791px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-10-20T19:31:10.000Z",
    "description": "\n\tYes, that was a “Jaws” reference in the latest “The Simpsons: Treehouse of Horror” episode, and it very much riffs off John Williams’ iconic score. ",
    "body": "\n\tYes, that was a “Jaws” reference in the latest “The Simpsons: Treehouse of Horror” episode, and it very much riffs off John Williams’ iconic score. \n\n\tComposer Kara Talve confirms “Jaws” was the main reference. Talve is no stranger to scoring “Treehouse of Horror,” the annual horror-themed episode of “The Simpsons,” which is now in its 37th season. She is part of Bleeding Fingers Music, a collective founded over a decade ago by Hans Zimmer. Talve is on her sixth go-round with score producer Russell Emanuel.\n\t\n\n\n\n\t\n\n\t\n\n\n\n\tIn the episode, Springfield is “menaced by a mysterious murdering monster from out of the sewers, Krusty has a demonic special guest on his live Halloween special, and we are transported a thousand years into the town’s poseable plastic post-apocalyptic future.” \n\n\n\tThe episode is split into three segments, the first titled “The Last Days of Crisco.” Fatberg is the monster who draws fat from his victims and parodies “Jaws.” Emanuel explains, “The music to Fatberg had to be delightfully distasteful and disgusting. So we had to score disgusting.”\n\n\tTalve adds, “‘Jaws’ was the biggest reference for Fatberg. So we got to go really John Williams, with heavy orchestral music, and we used big, over-the-top brass.” The duo moved around notes to create a sound that was dissonant, amplifying the disgusting effect.\n\n\n\n\t\n\n\t\n\n\n\n\t“Clown Night with the Devil” sees Krusty the Clown’s show go haywire when the Devil (voiced by Idris Elba) shows up and causes chaos. Unlike the previous segment, the music veered away from orchestral sounds and leaned into synth-heavy tones. Talve points out, “It references ‘Late Night With the Devil.’” She went back to revisit the 2023 horror film by Cameron Cairnes and Colin Cairnes. Talve says, “We watched it because, on the spotting call, Mike Price, the showrunner, kept referencing this demonic hum that he wanted to come out of the characters possessed by the devil.” When watching the film, she finally understood the rumble Price was referring to. “He really wanted the music to feel like it was coming internally from the characters, rather than it being scored.”\n\t\n\n\t“Plastic World” leans away from horror and more into a dystopian depiction of Springfield, imagining a world covered in Buzz Cola bottles. For that segment, renowned woodwind player Pedro Eustache was brought in with his extensive arsenal of woodwinds. Talve says, “He used the Wilding Horn,” and, in addition to that, Eustache — who is known for making many of his own instruments — brought in a pipe.\n\n\tEmanuel says, “He had made this giant thing out of PVC pipe, and he was a key part of the sound of ‘Plastic World.’”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘The Simpsons: Treehouse of Horror XXXVI’ Score Was Inspired by ‘Jaws,’ John Williams and ‘Late Night With the Devil’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/3615_2060_CCs65-1.png?crop=240px%2C43px%2C1406px%2C791px&resize=1000%2C563"
      ],
      "datePublished": "2025-10-20T19:31:10.000Z",
      "dateModified": "2025-10-20T19:31:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'Love Is Blind's Lauren & Cameron Announce Birth Of Baby Son",
    "url": "https://www.tmz.com/2025/10/20/lauren-speed-hamilton-cameron-love-is-blind-first-baby/",
    "image": "https://imagez.tmz.com/image/7d/16by9/2025/10/20/7df6802fbb9847ba8b5f94a2556275bd_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-20T22:16:56.000Z",
    "description": "\n    \n                    \n                          'Love Is Blind's Lauren & Cameron\n                          Our Baby Boy Is Here!!!\n             ",
    "body": "\n    \n                    \n                          'Love Is Blind's Lauren & Cameron\n                          Our Baby Boy Is Here!!!\n                      \n                  \n                        Published October 20, 2025 3:16 PM PDT\n                                                                      |\n                Updated October 20, 2025 4:17 PM PDT\n                                    \n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          \"Love Is Blind\" has its first baby in the house -- Lauren and Cameron Hamilton, the franchise’s golden couple, just welcomed their little bundle of joy!\n      \n    \n          The Season 1 lovebirds -- who famously met and tied the knot on the Netflix hit — dropped the big news on IG Monday … posting sweet snaps of their baby boy and revealing little Ezra William Hamilton made his debut on October 1.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          They shared that Ezra arrived a bit early -- after Lauren experienced preeclampsia and a short hospital stay -- but now they’re focused on taking it slow and soaking up all the love.\n      \n\n          Along with their hospital snaps cuddling baby Ezra, the couple also shared handwritten manifestations they’d made -- wishing for him to be born strong and healthy -- plus glimpses of their first few days as brand-new parents.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Lauren and Cameron first announced they were expecting via IVF back in May ... a huge joy for fans, especially since they’d been open about years of infertility struggles.\n      \n    \n          Congrats to the happy family!\n      \n      \n              \n          \n                          \n                Lauren Hamilton\n              \n                          \n                Cameron Hamilton\n              \n                          \n                Reality TV\n              \n                          \n                Baby Watch\n              \n                          \n                Couples\n              \n                          \n                Love Is Blind\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Love Is Blind's Lauren & Cameron Announce Birth Of Baby Son",
      "image": [
        "https://imagez.tmz.com/image/7d/16by9/2025/10/20/7df6802fbb9847ba8b5f94a2556275bd_xl.jpg"
      ],
      "datePublished": "2025-10-20T22:16:56.000Z",
      "dateModified": "2025-10-20T22:16:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Taylor Swift Donatee's Mother Says They Didn't Hear From Taylor Before Donation",
    "url": "https://www.tmz.com/2025/10/20/taylor-swift-donation-mother-speaks-out/",
    "image": "https://imagez.tmz.com/image/c8/16by9/2025/10/20/c85d9eeb7d7d455481633c6d7565cfb5_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-21T02:00:02.000Z",
    "description": "\n    \n                    \n                          Taylor Swift\n                          Donatee's Mom Says Money Came Out of Nowhere\n             ",
    "body": "\n    \n                    \n                          Taylor Swift\n                          Donatee's Mom Says Money Came Out of Nowhere\n                      \n                  \n                        Published October 20, 2025 7:00 PM PDT\n                                                                            \n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          Taylor Swift's $100K donation has totally changed a cancer-stricken girl's life ... but, that young girl's mom says it came completely out of nowhere -- 'cause Taylor dropped the dough without ever reaching out to the fam.\n      \n    \n          We spoke with Katelynn Smoot, whose daughter Lilah was diagnosed with a rare and aggressive form of brain cancer earlier this year, about what the donation means to her and her family ... and, Smoot says it's given the family time to catch their collective breath.\n      \n    \n          Waiting for your permission to load TikTok Post.\n      \n    \n          Smoot says her husband was refreshing the GoFundMe one night and noticed the donation ... leaving the couple totally awestruck -- 'cause Taylor never reached out to inform them of the gift.\n      \n\n          In fact, Swift still hasn't reached out ... it seems Taylor did something out of the goodness of her heart and simply moved on -- and, Smoot ultimately decided to post about it to highlight how wonderful she is.\n      \n    \n          Smoot explains she and her husband were discussing their finances mere days before the donation ... trying to figure out how long they could be out of work so they could focus on Lilah before they ran out of money -- but, Swift's donation has totally wiped that concern away.\n      \n    \n      \n        \n              \n    \n    \n          On top of that, Smoot says Swifites have chipped in now too, alleviating the burden even more ... and, she adds, it feels like their family is wrapped in a warm embrace by the fans. Katelynn -- who is a big Swiftie herself -- previously admitted she nearly named Lilah \"Willow\" after Taylor's song of the same name.\n      \n    \n          Turns out \"The Life of a Showgirl\" is all about performing miracles and not asking for any recognition in return ... though there's one family who certainly won't forget her generosity anytime soon.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Taylor Swift\n              \n                          \n                Money\n              \n                          \n                Kids\n              \n                          \n                Music\n              \n                          \n                Health\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Taylor Swift Donatee's Mother Says They Didn't Hear From Taylor Before Donation",
      "image": [
        "https://imagez.tmz.com/image/c8/16by9/2025/10/20/c85d9eeb7d7d455481633c6d7565cfb5_xl.jpg"
      ],
      "datePublished": "2025-10-21T02:00:02.000Z",
      "dateModified": "2025-10-21T02:00:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Lori Loughlin Prenup Could Mean She Gets Nothing in Divorce From Mossimo",
    "url": "https://www.tmz.com/2025/10/20/lori-loughlin-mossimo-giannulli-prenup/",
    "image": "https://imagez.tmz.com/image/e5/16by9/2025/10/20/e52233ce527c47bfb78ae22655552f52_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-20T17:47:41.000Z",
    "description": "\n    \n                    \n                          Lori Loughlin\n                          Original Prenup Says She Gets Nothing!!!\n                ",
    "body": "\n    \n                    \n                          Lori Loughlin\n                          Original Prenup Says She Gets Nothing!!!\n                      \n                  \n                        Published October 20, 2025 10:47 AM PDT\n                                                                      |\n                Updated October 20, 2025 2:18 PM PDT\n                                    \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Lori Loughlin has separated from estranged husband Mossimo Giannulli, but if she thinks she's going to get a chunk of the fashion designer's fortune in the split, she might have to think again.\n      \n    \n          Sources with direct knowledge tell TMZ ... a prenuptial agreement Lori signed when she married Mossimo in 1997 provides their assets are separate property. We're told it's something Mossimo insisted on before they married.\n      \n    \n          What's more ... Mossimo was worth north of $100 million at the time. It's unclear if the prenup changed, but if it didn't, it looks like she's screwed.\n      \n\n          This could explain why Lori doesn't consider herself \"single\" yet, despite living separately for months. Sources with direct knowledge previously told us she's waiting to see how the separation shakes out.\n      \n    \n          In the meantime, our sources say Lori has a terrific relationship with her daughters and has been spending quality time with them.\n      \n    \n          The \"Full House\" actress is devastated by the separation because she thought Mossimo would make changes after they were released from prison -- but he didn’t -- and she’s disappointed in him, according to our sources.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          As you know, the pair were sentenced to several months in prison over the 2019 \"Varsity Blues\" college admissions scandal. The feds accused Lori and Mossimo of paying $500,000 to college admissions fixer Rick Singer to get Olivia Jade into USC on a crew scholarship.\n      \n    \n          Both Lori and Mossimo struck plea deals, confessing to conspiracy to commit wire and mail fraud. She got 2 months in prison, and he got 5 months.\n      \n    \n          We reached out to Mossimo, who had no comment.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Mossimo Giannulli\n              \n                          \n                Lori Loughlin\n              \n                          \n                Celebrity News\n              \n                          \n                Money\n              \n                          \n                Relationships\n              \n                          \n                Celebrity Divorce\n              \n                          \n                Exclusive\n              \n                          \n                Fairly Legal\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lori Loughlin Prenup Could Mean She Gets Nothing in Divorce From Mossimo",
      "image": [
        "https://imagez.tmz.com/image/e5/16by9/2025/10/20/e52233ce527c47bfb78ae22655552f52_xl.jpg"
      ],
      "datePublished": "2025-10-20T17:47:41.000Z",
      "dateModified": "2025-10-20T17:47:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Doug Martin Had Mental Health Episode Prior To Death, Family Says",
    "url": "https://www.tmz.com/2025/10/20/doug-martin-mental-episode-death-details/",
    "image": "https://imagez.tmz.com/image/7c/16by9/2025/10/21/7cf9a5a8657f404f83147cbed19c5f2e_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-21T03:11:46.000Z",
    "description": "\n    \n                    \n                          Doug Martin\n                          Experienced Mental Health Episode Before Death\n            ",
    "body": "\n    \n                    \n                          Doug Martin\n                          Experienced Mental Health Episode Before Death\n                          ... Family Breaks Silence\n                      \n                  \n                        Published October 20, 2025 8:11 PM PDT\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Doug Martin's family is shedding more light on the ex-NFL star's death ... revealing the 36-year-old privately struggled with mental health issues over the years -- and they were actively trying to get him help prior to his passing.\n      \n    \n          Martin's former agency -- Athletes First -- shared a statement on behalf of the family on Monday ... which explained how Martin's parents had contacted local authorities earlier in the night for \"medical assistance.\"\n      \n    \n          The family said Doug became \"overwhelmed and disoriented\" ... which led him to leave the home and enter a neighbor's residence two doors down the street, where he was then taken into custody.\n      \n\n          Oakland Police said responding officers had a \"brief struggle\" with Martin during his detainment and he become unresponsive.\n      \n    \n          He was then rushed to the hospital by paramedics, where he later died.\n      \n    \n          The family said Martin's mental health issues away from the public eye \"profoundly impacted his personal and professional life.\"\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          \"Ultimately, mental illness proved to be the one opponent from which Doug could not run.\"\n      \n    \n          Martin's cause of death has not been determined ... and the investigation into what transpired is still on-going, with multiple agencies involved.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Doug Martin\n              \n                          \n                Celebrity Death\n              \n                          \n                TMZ Sports\n              \n                          \n                Tampa Bay Buccaneers\n              \n                          \n                Football\n              \n                          \n                Police\n              \n                          \n                NFL\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Doug Martin Had Mental Health Episode Prior To Death, Family Says",
      "image": [
        "https://imagez.tmz.com/image/7c/16by9/2025/10/21/7cf9a5a8657f404f83147cbed19c5f2e_xl.jpg"
      ],
      "datePublished": "2025-10-21T03:11:46.000Z",
      "dateModified": "2025-10-21T03:11:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Justin Baldoni's Studio Head Recorded Calling Blake Lively Claims 'Manufactured'",
    "url": "https://www.tmz.com/2025/10/20/steve-sarowitz-claire-ayoub-justin-baldoni-accusations-blake-lively/",
    "image": "https://imagez.tmz.com/image/42/16by9/2025/10/20/42492e39c0d942aab1f3f5e9c127fbbe_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-20T19:56:58.000Z",
    "description": "\n    \n                    \n                          Justin Baldoni's Studio Honcho\n                          Calls Blake Lively's Accusations 'Manufa",
    "body": "\n    \n                    \n                          Justin Baldoni's Studio Honcho\n                          Calls Blake Lively's Accusations 'Manufactured'\n                          ... In Recorded Phone Call\n                      \n                  \n                        Published October 20, 2025 12:56 PM PDT\n                                                                      |\n                Updated October 20, 2025 2:18 PM PDT\n                                    \n      \n    \n        \n                    \n                  \n      \n    \n          There's a new audio recording in the Justin Baldoni, Blake Lively saga ... and it reveals Justin's business partner trashing Blake's allegations of inappropriate behavior during a secretly recorded phone call.\n      \n    \n          Claire Ayoub -- who wrote and directed a film called \"Empire Waist,\" produced by Wayfarer and Baldoni -- says she recorded her phone chat with Wayfarer's billionaire co-founder Steve Sarowitz.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          In a September 2025 declaration, Claire said she'd endured \"repeated, negative interactions\" and \"verbal abuse\" from Baldoni when they worked on \"Empire Waist\" ... and that's why she recorded the call.\n      \n\n          In the audio, filed by Lively's attorneys, Sarowitz says \"everything was made up\" and \"it was manufactured on purpose to take Justin down\" ... referring to the drama during \"It Ends With Us.\"\n      \n    \n          He added, \"Justin never has a bad set,\" but \"it was the worst set he's ever been on. Still, Sarowitz tried to downplay all the bad buzz.\n      \n    \n          Later in the recording, Sarowitz seems to vent about the ongoing case between Baldoni and Lively, telling Claire, \"There will be 2 dead bodies when I'm done, minimum. Not dead, but dead to me -- that kind of dead ... I'm going to spend a lot of money to make sure the studio is protected.\"\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          As we've reported, Lively filed a lawsuit against Baldoni and Wayfarer, claiming he sexually harassed Lively during the production of their film \"It Ends With Us\" and alleging he spearheaded a smear campaign against her ... claims Baldoni has denied.\n      \n    \n          For her part, Claire says her experience with Baldoni was bad enough she'd requested he not be included in any marketing for their film. She says she feared Sarowitz was going to pressure her about Baldoni ... hence, the recorded call.\n      \n    \n          We reached out to Baldoni's reps, who had no comment. We've also reached out to Lively's reps ... so far no word back.\n      \n      \n              \n          \n                          \n                Blake Lively\n              \n                          \n                Justin Baldoni\n              \n                          \n                Celebrity News\n              \n                          \n                Exclusive\n              \n                          \n                Fairly Legal\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Justin Baldoni's Studio Head Recorded Calling Blake Lively Claims 'Manufactured'",
      "image": [
        "https://imagez.tmz.com/image/42/16by9/2025/10/20/42492e39c0d942aab1f3f5e9c127fbbe_xl.jpg"
      ],
      "datePublished": "2025-10-20T19:56:58.000Z",
      "dateModified": "2025-10-20T19:56:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]