[
  {
    "title": "‘Elsewhere at Night,’ Starring Camille Rutherford, Debuts Trailer Ahead of European Premiere in Torino",
    "url": "https://variety.com/2025/film/global/elsewhere-at-night-camille-rutherford-torino-1236572236/",
    "image": "https://variety.com/wp-content/uploads/2025/02/The-Splendour-of-Life.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-07T20:10:17.000Z",
    "description": "\n\t“Elsewhere at Night” (Ailleurs la nuit), which is directed by Marianne Métivier and stars “Anatomy of a Fall” actress Camille Rutherford, has debute",
    "body": "\n\t“Elsewhere at Night” (Ailleurs la nuit), which is directed by Marianne Métivier and stars “Anatomy of a Fall” actress Camille Rutherford, has debuted its international trailer. The film will have its European premiere at the Torino Film Festival on Nov. 22, with Rutherford attending. The project was developed as part of the TorinoFilmLab.\n\n\n\n\n\tH264, a Montreal-based film distribution and international sales company, acquired the world sales and Canadian distribution rights for the film earlier this year, when it was known as “The Splendour of Life.”\n\t\n\n\tThe film had its world premiere at the Festival du Nouveau Cinéma in Montreal in October, and then travelled to Brazil for its Latin American premiere at the São Paulo Intl. Film Festival.\n\n\n\t“Elsewhere at Night” is, according to a statement, a “poetic and contemplative portrait of six characters caught between presence and absence.” The film “explores the space between belonging and departure, where doubt, renewal, and connection intertwine.”\n\n\tThe synopsis reads: “From countryside stillness to urban insomnia, strangers’ lives intersect, torn between staying and leaving. Bound by dreams and silent longings, they search for a new beginning.”\n\n\tRutherford stars alongside Garance Marillier, Sue Prado, Amaryllis Tremblay, Kyrie Samodio, Émile Schneider, Victor Trelles Turgeon and Enchong Dee.\n\n\tThe film is produced by Geneviève Gosselin-G. at Le Foyer Films in Canada; the executive producer is Wilfredo Manalang of Fusee in the Philippines; and the associate producer is Alexa Rivero of Altamar Films in France.\n\t\n\n\tMétivier, who is also the screenwriter, is a Canadian-Filipina from Montreal. Her short film “She Who Wears the Rain” was selected in the competition section at the Berlinale in 2020.\n\n\tShe is in production with her first documentary “Back Home,” for which she received a development grant at the Talent Lab of the Rencontres Internationales du Documentaire de Montréal in 2020.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Elsewhere at Night,’ Starring Camille Rutherford, Debuts Trailer Ahead of European Premiere in Torino",
      "image": [
        "https://variety.com/wp-content/uploads/2025/02/The-Splendour-of-Life.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-07T20:10:17.000Z",
      "dateModified": "2025-11-07T20:10:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Meryl Streep and Sigourney Weaver to Star in ‘Useful Idiots’",
    "url": "https://variety.com/2025/film/news/meryl-streep-and-sigourney-weaver-useful-idiots-1236572718/",
    "image": "https://variety.com/wp-content/uploads/2025/11/FotoJet-64.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-07T19:50:33.000Z",
    "description": "\n\tMeryl Streep and Sigourney Weaver have been cast in Joseph Cedar’s “Useful Idiots,” a provocative thriller set in New York City.\n\n\t“Useful Idiots” f",
    "body": "\n\tMeryl Streep and Sigourney Weaver have been cast in Joseph Cedar’s “Useful Idiots,” a provocative thriller set in New York City.\n\n\t“Useful Idiots” follows veteran journalist Diane Castle (Streep) as she “covers the New York luxury property market, disillusioned with writing puff pieces about the wealthy elite, and feeling regretful that she may not have lived up to her potential. When a record-breaking sale of a new penthouse hits her desk, Diane’s questions about the buyer’s identity lead to what could be the story of a lifetime. At its center is a mysterious oligarch, whose influence stretches across Manhattan and beyond – protected by a network of fixers, enablers and a brilliant young strategist. Out of her depth, Diane digs deeper into the investigation, her determination to uncover the truth revealing a web of corruption and danger at the highest levels, ensnaring Diane, her family, and all those around her.”\n\t\n\n\tCedar, who has helmed films including “Beaufort” and “Footnote,” will direct the project with a script he penned alongside “60 Minutes” producer Shachar Bar-On. \n\n\n\tFifth Season will finance and produce with Closer Media’s Zhang Xin and Jonathan King, Academy Award-winner Bruce Cohen and William Horberg. Graham Taylor, Christopher Slager, and Dan Guando will executive produce for Fifth Season. Black Bear will introduce the project to international buyers at AFM, and CAA Media Finance will handle the U.S. rights.\n\n\tStreep is repped by CAA and Gendler, Kelly & Cunningham, while Weaver is represented by UTA, Jackoway Austen Tyerman Wertheimer, and The Lede Company. Cedar is represented by CAA, Kneller Artists Agency, and Frankfurt Kurnit Klein + Selz.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Meryl Streep and Sigourney Weaver to Star in ‘Useful Idiots’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/FotoJet-64.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-07T19:50:33.000Z",
      "dateModified": "2025-11-07T19:50:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sundance Institute Episodic Lab Sets Georgia’s Dunaway Gardens as Its New Home for 2026",
    "url": "https://variety.com/2025/tv/news/sundance-institute-episodic-lab-dunaway-gardens-1236572393/",
    "image": "https://variety.com/wp-content/uploads/2020/08/sundance-institute-logo.jpg?w=1000&h=562&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-07T19:45:00.000Z",
    "description": "\n\tGeorgia’s Dunaway Gardens will be the new home for the Sundance Institute Episodic Lab program.\n\n\tLocated in Newnan, Ga., Dunaway Gardens will be ho",
    "body": "\n\tGeorgia’s Dunaway Gardens will be the new home for the Sundance Institute Episodic Lab program.\n\n\tLocated in Newnan, Ga., Dunaway Gardens will be host to Sundance Institute’s immersive six-day program that provides artists with creative and strategic advice from experienced showrunners, producers and executives to help advance their projects and career.\n\n\t“Dunaway Gardens has a long history of nurturing the talents of not only established artists, but emerging voices.” Dunaway Gardens founder Tena Clark said, adding, “We couldn’t be more excited that the Sundance Institute calls Dunaway its new home for this Episodic program that has been the springboard for such incredible artistry over the years.”\n\t\n\n\tThe immersive experience of the Episodic Lab is created to unite early-career writers with an original series IP that has not yet been produced, giving them opportunities to work under the guidance of established showrunners and development executives from studios, networks and major production companies. The fellows will workshop their pilot, pitch their series and participate in one-on-one story meetings, case study screenings, panels and writers rooms focused on advancing their series concept. The fellows are also supported through workshops prior to the lab, as well as the Sundance Institute’s yearlong continuum of support.\n\n\n\tThe lab is designed to offer a training ground for independent voices, while the program is designed to help creators move their projects and careers forward.\n\n\tMichelle Satter, Sundance Institute founding senior director, artist programs, said, “We are thrilled to launch an exciting new partnership with Dunaway Gardens, which will serve as the home for our Sundance Episodic Labs beginning with the 2026 Lab, running May 15–20, and continuing for years to come.” Satter went on to say, “As a cornerstone of the Sundance Institute, our Episodic Program has provided rigorous, customized creative and strategic support to hundreds of emerging writers, helping them develop original, visionary scripted episodic pilots that have elevated their careers and made an impact in the industry. This collaboration, fostered by our strong connection with Gardens Founder Tena Clark, ensures we have a natural and inspiring space to continue bringing our community together in support of emerging episodic storytellers.”\n\t\n\n\tDirector of the episodic program Jandiz Estrada Cardos added, “Tena and the entire Dunaway Gardens team, all creatives themselves, are taking the lead in advocacy and uplifting the importance of artist support with Sundance Institute to ensure that those with the biggest risk-taking stories have a place to come, collaborate, and be reinvigorated by these surroundings, paired with the best creative advisors and mentors in the country.”\n\n\tApplications for the Sundance Institute’s 2026 Episodic Lab is now open through Nov. 9.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sundance Institute Episodic Lab Sets Georgia’s Dunaway Gardens as Its New Home for 2026",
      "image": [
        "https://variety.com/wp-content/uploads/2020/08/sundance-institute-logo.jpg?w=1000&h=562&crop=1"
      ],
      "datePublished": "2025-11-07T19:45:00.000Z",
      "dateModified": "2025-11-07T19:45:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘KPop Demon Hunters’ Directors Explain Making ‘Real’ Characters Who Are ‘Ugly at Times, Silly and Hot’ at SCAD Animation Panel",
    "url": "https://variety.com/2025/film/news/kpop-demon-hunters-characters-ugly-silly-hot-scad-1236572033/",
    "image": "https://variety.com/wp-content/uploads/2025/11/GettyImages-2243676602.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-07T20:12:06.000Z",
    "description": "\n\tThe fourth annual “Pixels and Pencils” directors roundtable brought together some of animation’s brightest talents at the SCAD Savannah Film Festiva",
    "body": "\n\tThe fourth annual “Pixels and Pencils” directors roundtable brought together some of animation’s brightest talents at the SCAD Savannah Film Festival on Oct. 27, marking multiple historic firsts for the event that has become the go-to destination for animated Oscar contenders during awards season.\n\n\tVariety Chief Awards Editor Clayton Davis moderated the discussion, which featured directors behind this year’s most acclaimed animated features: Ugo Bienvenu (“Arco”), Domee Shi (“Elio“), Alex Woo (“In Your Dreams”), Chris Appelhans and Maggie Kang (“K-Pop Demon Hunters”), Maïlys Vallade (“Little Amélie or the Character of Rain”) and Kent Seki (“Teenage Mutant Ninja Turtles: Chrome Alone 2 – Lost in New Jersey”).\n\t\n\n\tThe panel made history with a record-breaking number of women filmmakers and as the first to include both a returning director and an animated short. Shi became the first director to return to the panel for a second year, while Seki marked another milestone as the first short film director invited to participate.\n\n\tPart of Variety’s longstanding partnership with SCAD and its awards season coverage, the “Pixels and Pencils” series has featured Oscar nominees and winners in previous years, including 2024’s “Inside Out 2,” “Memoir of a Snail,” “The Wild Robot” and eventual winner “Flow.”\n\n\tThe directors shared candid insights about their creative processes and the challenges of working in animation. For Shi, whose “Elio” marks her second appearance on the panel following “Turning Red” in 2022, the story was a way to connect with her younger self.\n\t\n\n\t“We wanted to tell a story about being the weird kid who’s just trying to find where they belong,” she said. “For us, it was about finding your people — even if they’re alien creatures in space.”\n\n\tShi also explained the inspiration behind the film’s unconventional alien abduction scene: “Wouldn’t it be funny to have an abduction scene in a sci-fi movie where the character is whooping and cheering as they’re being taken up in a tractor beam? Because isn’t that how we all feel these days? Sometimes you’re like, I’m done with Earth, take me away.”\n\n\tSeveral directors emphasized the collaborative nature of animation. \n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tGetty Images for SCAD\n\t\n\n\n\n\tKang and Appelhans discussed the collaborative process behind “KPop Demon Hunters,” celebrating the freedom to present Korean culture in a bold, fresh way. “Let’s make these characters real — ugly at times, silly, and real hot,” Kang said with a laugh. The duo’s natural chemistry and shared creative vision turned their partnership into a crowd favorite.\n\n\t“Once we figured out we could attack a problem together and make it better, it became hard to work apart,” Appelhans added. “We just have the same exact taste, which is so crazy,” Kang said, noting how they wanted to make every decision together despite production pressures to divide responsibilities.\n\n\tThroughout the afternoon, panelists opened up about the inspirations, anxieties and ambitions behind their work.\n\n\tBienvenu spoke of creating Neon’s “Arco” during the pandemic, inspired by a desire to imagine a better future. “Maybe the world is how it is because we only imagine it bad,” he said. “Let’s imagine things better.”\n\n\tVallade, director of the hand-drawn “Little Amélie” from GKids, spoke through an interpreter about embracing animation’s emotional power. “Yes, animation is a lot of suffering,” she said to laughs. “But it’s also about sharing love, dreams and emotion. We can maybe change the world — even a little.”\n\n\tWoo described Netflix’s “In Your Dreams” as a deeply personal exploration of disappointment and resilience. “I grew up on stories that said if you want something badly enough, it will come true. But that’s not always the case,” he said. “I wanted to make a movie for kids that asks, ‘What happens when your dreams don’t come true?'”\n\n\tSeki, whose “Chrome Alone 2” screened at SCAD earlier in the day, reflected on pushing through rejection. “I once had someone in power say to my face, ‘I don’t see you as a director,'” he said. “But you keep going. You have to have creative endurance and elasticity.”\n\t\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tGetty Images for SCAD\n\t\n\n\n\n\tIn a surprise twist that delighted the sold-out audience, SCAD animation student Anthony DiMarco of Middletown, New Jersey, was invited on stage to co-host portions of the discussion after confidently declaring he would direct the first animated film to win the best picture Oscar.\n\n\tIn a powerful final segment, DiMarco asked each filmmaker to give him one piece of advice as a future director. Responses ranged from the philosophical — “Tell the truth,” said Woo — to the practical. “Don’t be afraid to be embarrassing,” advised Shi. Kang might have summed it up best: “Network up, down, sideways — and don’t be an asshole.”\n\n\tDiMarco’s participation became a highlight of the event, with the student asking thoughtful questions about overcoming imposter syndrome and handling rejection. “This experience today has taught me that animation is about passion, perseverance — and having at least three, maybe four backup drives,” DiMarco quipped, reading from cue cards provided. “Animation is cinema. It’s a medium, not a genre.”\n\n\tSeki also shared wisdom from director Jon Favreau: “Your job is to be a statesman. You have information that you have to give to everybody on the crew. Your job is to know when, where and how to give that information.”\n\n\tThe eight-day SCAD Savannah Film Festival, presented by the Savannah College of Art and Design, showcases cinematic creativity from award-winning professionals and emerging student filmmakers. Previous “Pixels and Pencils” panels have launched the Oscar campaigns of filmmakers including Peter Sohn (“Elemental”), the “Spider-Man: Across the Spider-Verse” directing team and Dean Fleischer Camp (“Marcel the Shell with Shoes On”).\n\n\tWith more than 63,000 attendees annually, the SCAD Savannah Film Festival continues to be a thriving space for both emerging talent and established artists. “Pixels and Pencils” remains a marquee moment during the eight-day celebration — a space where art meets industry, and the next great animated feature might just be born.\n\n\tAs many of us believe, there will be an animated film win best picture. And maybe — just maybe — the person who directs it, was sitting in that room. And judging by DiMarco, and the eight extraordinary filmmakers dropped on their way out, they’re all ready to take that shot.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘KPop Demon Hunters’ Directors Explain Making ‘Real’ Characters Who Are ‘Ugly at Times, Silly and Hot’ at SCAD Animation Panel",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/GettyImages-2243676602.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-07T20:12:06.000Z",
      "dateModified": "2025-11-07T20:12:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Melissa Leo Starrer and New Animation from ‘Cryptozoo’ Team Among Tauron American Film Festival’s U.S. in Progress Winners",
    "url": "https://variety.com/2025/film/global/melissa-leo-cryptozoo-american-film-festival-us-in-progress-1236572712/",
    "image": "https://variety.com/wp-content/uploads/2025/11/MixCollage-07-Nov-2025-08-22-PM-2566.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-07T20:06:08.000Z",
    "description": "\n\tU.S. in Progress, organized by Poland’s Tauron American Film Festival, has announced its winners. In total, 20 awards with a combined value of $160,",
    "body": "\n\tU.S. in Progress, organized by Poland’s Tauron American Film Festival, has announced its winners. In total, 20 awards with a combined value of $160,000 were presented to projects in post-production.\n\n\t“Mackenzie,” about a girl who runs away from home to marry her crush, TV idol Mackenzie Astin, was awarded Platige Image post-production services worth up to $10,000. The film is directed by Mylissa Fitzsimmons and produced by Fitzsimmons and Jaffe Zinn.\n\t\n\n\tSuzi Yoonessi’s “Mother Wolf,” produced by MediaPro and Aspire Productions, received color correction services worth up to $10,000 from Black Photon. The film was also awarded $25,000 worth of virtual studio services for its next project from ATMVirtual.\n\n\n\tThe film stars Melissa Leo as a grandmother who finally has the opportunity to realize her lifelong dream of visiting Japan – that is, until she suddenly needs to take care of her grandchildren. Money is tight, so she decides to explore the strange phenomenon of OnlyFans that her friends have been talking about.\n\n\tYoonessi stated that the project was born from grief and resilience and was inspired by her own immigrant mother, with her children featuring in the film. She stated: “The film transforms hardship into a sharp, humorous and magical tale about survival, love and legacy.’”\n\n\tErotic thriller “Night Nurse,” by Georgia Bernstein, portrays a retirement community and the complicated relationship between a con man and his nurse. \n\n\t“My grandmother frequently received scam calls, but only one lured her to the bank. The caller was supposedly my brother,” Bernstein admitted, explaining that the project “grew out of this scene.” “I became drawn to this liminal space between love and exploitation.”\n\t\n\n\tProduced by Missing Link Productions and Ruby Mannequin Films, the film received an award from Orka for image post up to $10,000, as well as a sound mix up to $6,000 from Soundflower. It was also offered a ticket to Poland by New Europe Film Sales.\n\n\tJulia Fox stars in Millicent Hailes’s “Perfect,” in which the world is devastated by a contaminated water supply. “It’s about falling for the illusion of something flawless, only to realize it’s far from it.”\n\n\tPerfect was awarded deliverables from DI Factory worth up to $5,000 and a grant of $20,000 from Wrocław Feature Film Studio to producer Liz Cardenas to use its studio and equipment for a future production. Additionally, the Lower Silesia Film Centre (DCF) invited Cardenas on a location scouting trip in the region. The film is produced by Freenjoy, Steak & Rose, and Ten to the Six Pictures.\n\n\tIn “Pocket Dream,” offered opening title design or VFX (up to $5,000) from XANF and foley recording (up to $5,000) from Aeroplan, Stacy Martin (“Nymphomaniac”) stars as a wealthy woman trapped in an unhappy marriage who meets a struggling waiter named Theo, played by Spike Fearn.\n\n\tDirected by Sam Guest and Julia Baylis, also behind “Wiggle Room,” it questions “whether the American Dream still exists in our contemporary world,” they said in a joint statement. “As filmmakers wrestling with our own beliefs, we push Theo into a dark world full of greed and amoral ugliness, daring him to keep his innocent views intact.” Anarene Films, Discordia, Tanbark and Simone Films produce. \n\n\tTalia Lugacy’s “Ruby Road,” produced by Acoustic Pictures and Witchcraft Motion Picture Company, received $10,000 worth of VFX from XANF, and Earworks and Aeroplan were awarded $10,000 each for sound post-production.\n\n\tThe film tells the story of a character played by Frances Fisher, who is joined by Bill Paxton and Lauren Holly, and who is facing terminal illness. A former school bus driver, she embarks on a long journey. \n\n\tLugacy described it as “an existential dive into a dying woman’s memory, dreams and the fragments of her American life. As a collaboration between people on all sides of the political spectrum in the U.S., it stands alone as a testament to the power of a collective narrative to break barriers and build common ground.”\n\t\n\n\tFixafilm and New Europe Film Sales were also impressed by “She Keeps Me Young,” offering $5,000 worth of VFX, as well as sales and promotional consultancy services and script consultation on director Doron Max Hagay’s next project. \n\n\tThe story follows the complications that arise in female friendships when one of the characters decides to pose for a high school photography project. International Pigeon Production and Tiny Giant are producing the film.\n\n\tHagay noted the film looks at how “our culture screams at us to be Empowered and Fierce, while our lives are full of adaptation, settling and giving in. It’s also about the everyday neurosis and ordinary cruelty present in certain friendships and relationships.” \n\n\t“Take Me Home,” produced by Cyprian Films New York and All Caps, was awarded $5,000 worth of color grading services from Fixafilm. The story is inspired by director Liz Sargent’s real life. \n\n\t“Liz is the middle child of 11 siblings. Her parents are white, they had four biological children and adopted seven – six from Korea and several with disabilities,” explained producer Apoorva Charan while presenting the project in Poland. \n\n\t“The film explores the question of what happens when the parents age into disability and can no longer care for their children.” Her sister Anna plays a version of herself. “It’s a social realist drama and we explore some of the big questions around health care in American through this intimate family piece.”\n\n\tFinally, “Unknownia” – a feature-length animated film produced by Electric Chinoland and Mubi – received image post services worth up to $10,000 from DI Factory, as well as sound services worth up to $5,000 from Aeroplan and score recording supervision worth up to $4,000 from Soundflower. It is directed by Dash Shaw, famous for “Cryptozoo.”\n\n\t“All the artwork is hand-painted and hand-drawn,” said producer Kyle Martin. “On the surface, the plot is about a girl who needs to learn how to transform into a dragon to save her father. But it’s really a coming-of-age story about wealth, greed and the experience of learning that your role models are just ordinary people with flaws of their own. You might need to trust your own moral compass.”\n\t\n\n\t“I’m thrilled that U.S. in Progress and the Tauron American Film Festival have become a part of this amazing group of nine projects selected to meet Polish post-production studios and generous partners and discover the beauty of Wrocław and Warsaw,” said festival director Ula Śniegowska. \n\n\t“Two road movies, an erotic thriller and a feature animation, a family drama, and a self-discovery movie selected for this year program mark a new wave of U.S. filmmakers, mostly women, that we hope will reach the screens next year with our support.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Melissa Leo Starrer and New Animation from ‘Cryptozoo’ Team Among Tauron American Film Festival’s U.S. in Progress Winners",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/MixCollage-07-Nov-2025-08-22-PM-2566.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-07T20:06:08.000Z",
      "dateModified": "2025-11-07T20:06:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How Neal Stephenson’s Lamina1 and Weta Workshop Are Using ‘Artefact’ Web Game to Launch ‘Truly New Original IP’: ‘Almost a Post-AI Mythos’",
    "url": "https://variety.com/2025/gaming/news/artefact-game-neal-stephenson-lamina1-weta-workshop-1236572453/",
    "image": "https://variety.com/wp-content/uploads/2025/11/Artefact.png?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-07T18:30:23.000Z",
    "description": "\n\tIt’s been one week since prolific author Neal Stephenson and “The Lord of the Rings” VFX studio Wētā Workshop launched web game “Artefact,” what the",
    "body": "\n\tIt’s been one week since prolific author Neal Stephenson and “The Lord of the Rings” VFX studio Wētā Workshop launched web game “Artefact,” what they hope will be a seminal piece of media in the entertainment landscape to come.\n\n\tHoused on platform Lamina1, “Artefact” is described as “a collaborative worldbuilding experience” that “invites players to step into the aftermath of the Spike — a fizzled singularity that tore the internet apart, ended the reign of AI megasystems, and forced humanity to rebuild through new, decentralized systems.”\n\t\n\n\tThe goal here is to experiment with the process of IP creation and owndership when driven by fandom. It’s the flagship project for Lamina1, one of several “Spaces” planned by the platform run by Stephenson and co-founder and CEO Rebecca Barkin.\n\n\n\t“With ‘Artefact,’ you have a really, truly new original IP, almost a post-AI mythos,” “Artefact” executive producer Ryan Gill told Variety. “We just don’t have much of that. And when it does move into adaptation of other Spaces — film, television, book, all this stuff — the organizing principle will stay at Spaces with all the people that were a part of it early on, and really have a foundational understanding and a participation. And it’s a vehicle for how to prove that out, really, and how IP can be built from that natively and shaped through that. And that’s what Spaces will do for other IP as well.”\n\n\t“Artefact” gameplay begins with players acquiring a thumb drive and booting up their rig — a salvaged machine stitched together from CPUs, drives, and scraps of machine code — to go in search of artefacts, evolving digital entities capable of storing and transmitting lost knowledge. Players are working together to find artefacts as they continue to appear across Lamina1, while building trust within their player communities, known as Phyle, in order to uncover the great mystery at the center of the game.\n\t\n\n\n\n\t\n\n\t\n\n\n\n\tIf that sounds like a lot, the “Artefact” team is aware of that, and they’ve spent a great deal of time considering how to make it as easy to play for as many people as possible.\n\n\t“When we’ve worked on taking existing IP and trying to turn it into interactive IP, that’s sort of how you get people to move from passive consumption into, how do I interact and create with the world?” Barkin said. “It’s a really tough battle, because sometimes people just want to consume. So we had to think about different barriers of entry and different ways in for different types of profiles of people and players. And one of the reasons why we decided to allow people to contribute PDFs or images or things like that, it’s just to lower the barrier of entry. Of being able to insert yourself and your ideas into a game world, because otherwise you’d have to be a developer to do that.”\n\n\tSeven days after “Artefact’s” Oct. 31 launch, there are currently 372 listed members in the game’s community on Lamina1. Barkin says those players may have a leg up in the long term, having been part of the community from Day 1, but that’s far fro the only way to interact with “Artefact” as it grows.\n\n\t“There will be different entry points for new people to keep coming into the game when they’re comfortable,” Barkin said. “And I think that’s an important piece of it. We debated this a lot, in terms of the rollout strategy of, how do people get in? And if minting is your way in, how do we make sure that — because word of mouth is really going to be our best asset — that there’s new entry points all the time for people to come into the game. Maybe not with the same advantages that those early people will have, but still in a way that’s really enjoyable and accessible.”\n\n\n\n\t\n\n\t\n\n\n\n\tGill likens the “Artefact” format to two tried-and-true methods for entertainment: procedural and serial.\n\n\t“Looking at the paradigm of episodic storytelling, because streaming has really taken over so much now people are used to episodes and binging and all this kind of stuff — in the video game sense, it’s kind of combining that, in a way,” Gill said “We have procedural and serial. We have this in phases.”\n\n\tGill says the procedural portion will see each phase of the game be “another space of the world that you can go to and you interact with people, and there might be side missions and things that you help out with.” \n\t\n\n\t“It’s kind of combining an episodic way of telling stories and then blending that with what we’re used to feeling like a video game feels like, but really, at the core, it being like a literary narrative experience,” Gill said. “You get the richness of a Neal novel, for example, but it is experienced in a much more dynamic and immersive way. And this is not fixed. This is like a pilot episode — episode one of Season 1. And it is very much going to evolve, and we’re not going to be the ones that determine all the ways that it evolves.”\n\n\tThe “Artefact” team has made it so those decisions will be up to the creator community.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How Neal Stephenson’s Lamina1 and Weta Workshop Are Using ‘Artefact’ Web Game to Launch ‘Truly New Original IP’: ‘Almost a Post-AI Mythos’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/Artefact.png?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-07T18:30:23.000Z",
      "dateModified": "2025-11-07T18:30:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jim Gaffigan to Receive Variety’s Inaugural Comedy Vanguard Award",
    "url": "https://variety.com/2025/biz/news/jim-gaffigan-comedy-vanguard-award-1236572477/",
    "image": "https://variety.com/wp-content/uploads/2025/11/jim-gaffigan.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-07T19:00:00.000Z",
    "description": "\n\tVariety and the New York Comedy Festival, the largest and longest-running annual comedy festival in the United States, announced that comedian and a",
    "body": "\n\tVariety and the New York Comedy Festival, the largest and longest-running annual comedy festival in the United States, announced that comedian and actor Jim Gaffigan will receive Variety’s inaugural Comedy Vanguard Award presented by the New York Comedy Festival. The award will be presented during the 21st edition of the New York Comedy Festival on Sunday, Nov. 9, at the Upright Citizens Brigade Theater following a career-focused conversation with Gaffigan moderated by Variety reporter Ethan Shanfeld.  The New York Comedy Festival runs Nov. 7 – 16.\n\t\n\n\tThis inaugural award recognizes Gaffigan’s trailblazing contributions to comedy and his remarkable career milestones. It also honors him as an inspiration to the entertainment community and a generous supporter of his peers in comedy. Gaffigan will be part of the annual Stand Up for Heroes and Cool Comedy • Hot Cuisine, an event benefiting the Scleroderma Research Foundation during this year’s festival.\n\n\n\tGaffigan is an Emmy Award–winning, eight-time Grammy-nominated comedian, actor, writer, and producer. He starred in the semi-autobiographical series “The Jim Gaffigan Show,” starred in films such as “Unfrosted,” “Chappaquiddick,” “Hotel Transylvania,” and “Linoleum,” and authored the New York Times bestselling books “Dad Is Fat” and “Food: A Love Story.” Gaffigan has delivered 11 acclaimed stand-up specials including his most recent, “The Skinny,” which was the first original stand up special for Hulu. He is currently touring with his Everything Is Wonderful stand-up show.\n\n\t“Jim Gaffigan has been making us laugh since the very beginning of his career, and I’ve had the pleasure of watching him grow into one of the most respected and beloved voices in comedy today,” said Caroline Hirsch, founder and owner of the New York Comedy Festival. “His originality, consistency, and sheer brilliance on stage make him the perfect recipient of this inaugural Comedy Vanguard Award.  No one is more deserving, and Jim truly represents the spirit of innovation and excellence that this honor celebrates.”\n\t\n\n\tIn addition, Variety and NYCF will host a dynamic “Business of Comedy” panel bringing together voices from across the industry to explore the evolving landscape of comedy. The conversation will feature a creative executive shaping content, a business executive driving deals and strategy, a comedian offering an artist’s perspective from the stage and possibly others. Together, they’ll unpack how comedy is developed, financed, distributed, and consumed in today’s market, while reflecting on where the industry is headed next. Moderated by Shanfeld, the panel will feature Hirsch, NYCF founder and producer; Lilly Burns, producer of “Search Party” and “Emily in Paris”; Emmy-nominated comedian Jeff Ross, widely known as the “Roastmaster General” for his iconic Comedy Central Roasts including Netflix’s “The Roast of Tom Brady,” which garnered over one billion minutes of viewing who is coming off his critically acclaimed one-man show on Broadway “Take A Banana For The Ride”,  and Talent Executive, New York Comedy Festival Louis Faranda.\n\n\tPreviously announced highlights at NYCF include: a screening of “St. Denis Medical,” T”he Basement Yard,” Hannah Berner, Michael Blackson, Louis C.K., Margaret Cho, “Comics To Watch,” Alex Edelman, Chris Fleming, Chris Gethard, John Goblikon, Patti Harrison, Pete Holmes, Morgan Jay, Ismo, Ryan Long, Jaye McBride, New York’s Funniest Stand-Ups Presented by Threads, Nurse John, Maddy Smith, Yohay Sponder, “Strangers With Candy” with Stephen Colbert, Paul Dinello and Amy Sedaris, Ricky Velez, Trevor Wallace and more. \n\n\tFounded by Hirsch in 2004, the festival brings together some of the biggest names in comedy and stand-up, featuring more than 100 shows over ten days across all five boroughs. Featuring 200+ top comedians from around the globe, the festival takes over iconic venues like Carnegie Hall, the Beacon Theatre, Madison Square Garden and Town Hall — cementing New York City’s status as the comedy capital of the world.\n\n\tThe 2025 NYCF is made possible by its partners Bread Financial, Threads, Hard Rock Hotel New York, ABC7, iHeart Radio, NBC Peacock, NYC Media & Entertainment, NYC Tourism + Conventions, Founded in NYC, New York Magazine, New York Post, Vulture, and The Wall Street Journal.For tickets, full schedule, and more information, visit nycomedyfestival.com and follow along on Facebook, Instagram, Threads and X using #makeNYlaugh\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jim Gaffigan to Receive Variety’s Inaugural Comedy Vanguard Award",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/jim-gaffigan.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-07T19:00:00.000Z",
      "dateModified": "2025-11-07T19:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Duffer Brothers on ‘Stranger Things’ Theatrical Release: ‘A Dream of Ours for a While’",
    "url": "https://variety.com/2025/tv/columns/duffer-brothers-stranger-things-theatrical-release-dream-netflix-1236572642/",
    "image": "https://variety.com/wp-content/uploads/2025/11/GettyImages-2245447941-1.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-07T18:39:32.000Z",
    "description": "\n\tThe Duffer brothers, Matt and Ross, call the upcoming theatrical release of “Stranger Things” is “dream” come true.\n\n\tAs previously reported, the tw",
    "body": "\n\tThe Duffer brothers, Matt and Ross, call the upcoming theatrical release of “Stranger Things” is “dream” come true.\n\n\tAs previously reported, the two-hour series finale of the series – the last episode titled “The Rightside Up” — will premiere on Netflix and in more than 350 movie theaters on Dec. 31, starting at 5 p.m. PT / 8 p.m. ET, playing through Jan. 1. This marks the first time an episode of a Netflix series will also be exhibited theatrically.\n\t\n\n\t“This has been a dream of ours for a while,” Ross told me Thursday night at the world premiere of the series’ fifth and final season at the TCL Chinese Theater in Hollywood.\n\n\tNetflix announced the plans just days after Variety published an interview with Netflix’s chief content officer Bela Bajaria in which she insisted the streamer had no plans to release “Stranger Things” in theaters. “A lot of people — a lot, a lot, a lot of people — have watched ‘Stranger Things’ on Netflix,” she said. “It has not suffered from lack of conversation or community or sharing or fandom. I think releasing it on Netflix is giving the fans what they want.”\n\n\tPraising Bajaria for her “poker face,” Matt said, “Ross and I just folded. The truth is…this was in the works for a long time. Netflix came to us with the idea. It was their idea to have the finale on a separate day and we thought that was cool, specifically because we thought we could pitch this movie theater idea, which we had never pitched before, honestly.”\n\n\tHe continued, “It never really made sense to us because everyone will always ask about it. I’m like, ‘Well, it’s kind of not fun because no one’s in sync. People will have seen the episode, some people won’t have seen the episode, it’s not the same. This actually recreates and is a real movie moment because everyone’s experiencing it at the same time together. I think that’s what we’re excited about it and it’s the first time we had that opportunity.”\n\t\n\n\tStar Millie Bobby Brown explained that she wore a black custom Rodarte gown to the premiere as an homage to the end of the series. “It’s for the funeral of the show,” she said. “This dress kind of embodies the darkness of the show this season. I’m really excited for everyone to see how dark it gets. I hate to say it because I say it every season, but this is definitely the darkest and the more intense season.”\n\n\tSee more photos from the “Stranger Things” premiere below.\n\n\n\n\n\t\n\n\t\t\t\t\tSadie Sink, Caleb McLaughlin, Finn Wolfhard, Gaten Matarazzo, Noah Schnapp and Millie Bobby Brown at the “Stranger Things” Season 5 World Premiere.\n\t\t\t\t\t\t\t\t\tVariety via Getty Images\n\t\n\n\n\n\n\n\t\n\n\t\t\t\t\tFinn Wolfhard at the “Stranger Things” Season 5 World Premiere.\n\t\t\t\t\t\t\t\t\tVariety via Getty Images\n\t\n\n\n\n\n\n\t\n\n\t\t\t\t\tMillie Bobby Brown and David Harbour at the “Stranger Things” Season 5 World Premiere After Party.\n\t\t\t\t\t\t\t\t\tVariety via Getty Images\n\t\n\n\n\n\n\n\t\n\n\t\t\t\t\tCaleb McLaughlin attends Netflix’s “Stranger Things” Season 5 World Premiere.\n\t\t\t\t\t\t\t\t\tGetty Images for Netflix\n\t\n\n\n\n\n\n\t\n\n\t\t\t\t\tGaten Matarazzo, left, Finn Wolfhard, Caleb McLaughlin, and Noah Schnapp attend Netflix’s “Stranger Things” Season 5 World Premiere.\n\t\t\t\t\t\t\t\t\tGetty Images for Netflix\n\t\n\n\n\n\n\n\t\n\n\t\t\t\t\tNoah Schnapp at the “Stranger Things” Season 5 World Premiere.\n\t\t\t\t\t\t\t\t\tMichael Buckner\n\t\n\n\n\n\n\n\t\n\n\t\t\t\t\tSadie Sink at the “Stranger Things” Season 5 World Premiere.\n\t\t\t\t\t\t\t\t\tMichael Buckner\n\t\n\n\n\n\n\n\t\n\n\t\t\t\t\tCharlie Heaton at the “Stranger Things” Season 5 World Premiere.\n\t\t\t\t\t\t\t\t\tMichael Buckner\n\t\n\n\n\n\n\n\t\n\n\t\t\t\t\tJoe Keery and Maya Hawke at the “Stranger Things” Season 5 World Premiere.\n\t\t\t\t\t\t\t\t\tMichael Buckner\n\t\n\n\n\n\n\n\t\n\n\t\t\t\t\tNell Fisher at the “Stranger Things” Season 5 World Premiere.\n\t\t\t\t\t\t\t\t\tEarl Gibson III\n\t\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Duffer Brothers on ‘Stranger Things’ Theatrical Release: ‘A Dream of Ours for a While’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/GettyImages-2245447941-1.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-07T18:39:32.000Z",
      "dateModified": "2025-11-07T18:39:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Vince Gilligan and Rhea Seehorn on What ‘Pluribus’ Is Really About, Why Hollywood ‘Needs More Heroes’ and How Silicon Valley Has ‘F—ed Up the World’",
    "url": "https://variety.com/2025/tv/news/pluribus-explained-vince-gilligan-rhea-seehorn-1236571666/",
    "image": "https://variety.com/wp-content/uploads/2025/11/Pluribus_Photo_010205-e1762455715246.jpg?crop=0px%2C43px%2C2300px%2C1293px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-11-07T19:30:00.000Z",
    "description": "\n\tSPOILER ALERT: This story contains spoilers for the first two episodes of “Pluribus,” streaming now on Apple TV.\n\n\tVince Gilligan is in the library ",
    "body": "\n\tSPOILER ALERT: This story contains spoilers for the first two episodes of “Pluribus,” streaming now on Apple TV.\n\n\tVince Gilligan is in the library at Variety’s New York office, surrounded by tens of thousands of newspaper and magazine archives dating back to 1905. He’s reading from a thick, brown book stamped JANUARY 2008, wherein lies this publication’s first review of “Breaking Bad.”\n\n\n\t“Vince Gilligan brings a quirky sensibility to the pilot, and the show grows increasingly rich and absorbing in the second and third hours,” he recites. “Whether ‘Breaking Bad’ can ignite to become more than TV’s version of a little-seen indie film, however, could be an elusive formula.”\n\t\n\n\tHovering over his shoulder, Rhea Seehorn bursts into laughter.\n\n\tNot only did “Breaking Bad” earn four more seasons that cemented it as one of the greatest TV shows of all time, it also spawned the spinoff “Better Call Saul,” centering the original series’ comic relief character in a drama that, astonishingly, managed to build up to the chair-gripping heights of its predecessor. Together, these shows made Gilligan into the rare TV creator who can still demand blank-check trust from Hollywood. He cashed in on that trust with “Pluribus,” his ambitious, clearly high-budget, eagerly awaited new series. It arrived Nov. 7 on Apple TV with two episodes.\n\n\tSeehorn, who played Kim Wexler on six seasons of “Better Call Saul,” is the star of “Pluribus,” an original sci-fi drama that has nothing to do with courtrooms or cartels, but is set in Gilligan’s familiar Albuquerque. The run-up to “Pluribus” has been highly secretive, with cryptic promotional materials and a long list of embargoed spoilers from Apple. Its comically vague logline reads: “The most miserable person on Earth must save the world from happiness.”\n\t\n\n\n\n\t\n\n\t\t\t\t\tRhea Seehorn in “Pluribus”\n\t\t\t\t\t\t\t\t\tApple TV\n\t\n\n\n\n\tNow that the first two episodes are out, here is the basic rundown: A group of space watchers discover an alien signal 600 lightyears away that contains a recipe for an RNA sequence, prompting months of animal testing by researchers in hazmat suits. An accidental lab leak infects the scientists with a virus that compels them to kiss each other and contaminate petri dishes with saliva until the whole world is possessed in what’s referred to as “The Joining.” Well, all but 12 people who are mysteriously immune to this sickness, including Seehorn’s curmudgeonly, self-hating romantasy author Carol Sturka. \n\n\tCarol is at a bar when the rest of the population, including her wife Helen, begins to twitch unconsciously. In a panic, she drives Helen to the hospital while the city goes up in flames, but it’s too late. Everyone has suddenly been reanimated into friendly zombies. “We just want to help, Carol,” the doctors and patients say in unison — and they mean it. Later, a White House official, speaking for “every person on Earth,” assures Carol through the television that this is not an alien invasion. It’s not exactly a virus, either, but rather “a psychic glue capable of binding us all together.” How does it all work? “We don’t know, exactly,” he says with a smile. “It just does.”\n\n\tWhile the pandemic-esque opening of the show might give you trauma flashbacks to “Tiger King” and drive-by birthday parties, Gilligan says he came up with the idea for “Pluribus” years before COVID. In the throes of writing “Better Call Saul,” he would take 90-minute lunch breaks and meander around Toluca Lake, taking a mental vacation from the world of Saul Goodman.\n\n\t“I started pondering this idea almost 10 years ago. It was originally about a guy, because I tend to think that way,” says Gilligan, who is dressed in a checkered blazer and clean shaven for the first time in years. He imagined a show that started with an Earth-shattering event, and in the aftermath, the entire population suddenly became “unfailingly nice” to the protagonist, “so much so that they basically give their lives for this guy.”\n\n\tEventually, as he continued thinking about “Pluribus” while barrelling toward the end of “Better Call Saul,” something clicked: the main role was Seehorn’s. He started writing the character specifically for her without telling her. “You just can’t take your eyes off her,” Gilligan says. “She’s got a wonderful charisma. And she can do anything — make you laugh, make you cry.” It’s no wonder Gilligan initially wrote Kim Wexler as a love interest who might not make it to Season 2 of “Saul,” until “Rhea made herself indispensable.” (She would also go on to earn two Emmy nominations for her performance.)\n\t\n\n\n\n\t\n\n\t\t\t\t\tBob Odenkirk and Rhea Seehorn in “Better Call Saul”\n\t\t\t\t\t\t\t\t\t©AMC/courtesy Everett Collection / Everett Collection\n\t\n\n\n\n\tIn early 2022, as they were wrapping production on the final season of “Saul,” Gilligan told Seehorn he wrote something for her, but wasn’t ready to give her the script — or any details about it at all. “Whatever it is, yes, I want to do it,” Seehorn told him. Meanwhile, Gilligan was so terrified that she would be enticed by another project that he asked executive producer Melissa Bernstein to flag him if she heard anything about Seehorn taking another job.\n\n\tA few months later, the whole gang shuttled to the Albuquerque Convention Center as the city unveiled statues of Walter White and Jesse Pinkman. Staring up at the iconic drug slingers immortalized in bronze, just two weeks before the “Saul” series finale would air, Seehorn began thinking about Gilligan’s mysterious script.\n\n\t“I didn’t want to bring it up and put him in a corner, but every day I was going, ‘Is this real?’” she recalls. As they walked back to the car, Gilligan pulled her aside and, as if reading her mind, said, “I didn’t forget about the script.”\n\n\tHe finally sent it when Seehorn was on vacation with her family, at an adult camp in New Hampshire with spotty cell service. “You had to crouch in the corner of a room or climb a tree and get an antenna with oil on it to get internet,” Seehorn says with a laugh. She was such a “nervous wreck” that she made her husband read it first, studying his face as he scrolled through the pages.\n\n\tSitting here today, Seehorn can’t quite describe why she was anxious. Gilligan has a suggestion: “What if it sucks?” Seehorn shoots him down with an “oh please” hand gesture. “I knew it was going to be great,” she says, spinning a Starbucks cup on the table. “It’s waiting for this thing you could not be more excited to start, but now it’s real.”\n\n\n\n\t\n\n\t\t\t\t\tRhea Seehorn and Vince Gilligan attend the world premiere of “Pluribus”\n\t\t\t\t\t\t\t\t\tThe Hollywood Reporter via Getty\n\t\n\n\n\n\tAside from co-creating the short-lived CBS dramedy “Battle Creek” in 2015, Gilligan had not ventured outside of his meth-and-death-ridden vision of New Mexico since 2008. And when he popped his head back into the Hollywood marketplace, he wasn’t sure if his new wacky, original idea would be welcome. “I wouldn’t say there was pressure, but there was a certain level of expectation,” he says. “A certain level of, ‘What’s next in the “Breaking Bad” world?’”\n\t\n\n\t“We live in a world of IP, where the safest thing to do is reboot something that has an audience. I wanted to prove to myself I wasn’t a one-trick pony,” Gilligan says. “It’s harder than it’s ever been to get something made that’s not based on a previous movie or comic book or video game. Every generation deserves its own stories, instead of just the stories of their grandparents.”\n\n\tStill, “Pluribus” ignited the first bidding war of Gilligan’s career, with several studios vying for the opportunity to bring his grinning apocalypse to life. It was a flattering, if not slightly uncomfortable affair for Gilligan. “I enjoyed that experience very much, but then in a weird way I didn’t,” he says. “It was great to be wanted, but I met with all these nice folks and I had to say no to some of them, and that was not enjoyable.” (They don’t call Gilligan the nicest showrunner in Hollywood for nothing.)\n\n\tHe went with Apple TV because they promised him the “two gifts of trust and time.” It didn’t hurt that the heads of the studio, Zack Van Amburg and Jamie Erlicht, were the same executives who greenlit “Breaking Bad” at Sony 18 years ago. \n\n\n\n\t\n\n\t\t\t\t\tRhea Seehorn and Vince Gilligan on the set of “Pluribus”\n\t\t\t\t\t\t\t\t\tCourtesy of Apple\n\t\n\n\n\n\tAfter spending a decade and a half in the brains of a meth kingpin and a slimeball attorney, Gilligan wanted his next protagonist to be a force for good. “I wrote on ‘The X Files’ for seven years, and I started to take for granted the idea of heroes. Mulder and Scully were heroic. They were trying to save the world. At a certain point, you do umpteen million episodes of that, and you think, ‘I’m ready for an antihero or a bad guy,’” Gilligan says. (He famously pitched “Breaking Bad” as the story of a man who transforms himself from Mr. Chips to Scarface.) “But at this point in humanity and in world history, I think we need more good guys again. We need more heroes.”\n\n\tNot that Carol is a traditional TV hero, of course. As Seehorn puts it, she’s an “emotional hot mess” who “can’t control her anger”; Gilligan uses the words “reluctant” and “inept.” “The folks who rise to the occasion, despite the fact that they’re scared and lonely and sad and would rather have someone else take this mantle from them,” he adds, “those are the interesting characters to me.”\n\t\n\n\tBy the end of the first episode of “Pluribus,” it becomes clear that the “pluribus,” so to speak, wish to share their cult-like nirvana with the remaining 12 people on Earth. But for whatever reason, they cannot or will not force Carol to do anything against her will. In Episode 2, they send a butler-like representative, Zosia (Karolina Wydra), to help Carol with anything she might need, and to spit out press release-like explanations for why her wife is dead and individuality is all but gone. The pluribus share a neural network that has absorbed all human knowledge, which includes personal details about Carol’s life. They speak using the “royal we” and seem to be incapable of lying, as Zosia admits they are “months away” from figuring out how to recruit Carol into the collective consciousness.\n\n\tCarol’s first big request is to meet with the handful of English-speaking survivors. She expects to form a coalition against the hive, but her fellow human beings are either delusional — one woman refuses to accept that her child is no longer her child but rather a mouthpiece for billions — or comfortable with their new reality. One man, who has claimed Air Force One as his private jet and surrounded himself with cheetah-print wearing supermodels, points out that in the New World, there is no crime and no racism. He asks Carol: “Why does the world need saving?” \n\n\t“Carol is running around saying, ‘Are you guys aware the barn is on fire?’ and everyone’s like, ‘Can you just calm down and get a drink?’” Seehorn says. And so, with Carol intent on restoring what once was, the fate of mankind rests in the hands of someone who doesn’t seem to like people all that much.\n\n\n\n\t\n\n\t\t\t\t\tRhea Seehorn and Karolina Wydra in “Pluribus”\n\t\t\t\t\t\t\t\t\tApple TV\n\t\n\n\n\n\tMight the show — with its army of all-knowing, obsequious entities consuming humanity — be a metaphor for the dangers of artificial intelligence?\n\n\tWith a half-amused shrug, Gilligan says he was not thinking about AI when he conceived of “Pluribus,” and he wrote it before the rise of large language models like ChatGPT. “One thing I did wrong while doing press for ‘Breaking Bad’ was tell people, ‘This is what this meant! This meant that!’” He remembers conversations with journalists and fans in which he drilled down his belief that his protagonist, Walter White, was, in fact, a villain. “I look back, and it was so tiresome,” Gilligan says. “Whatever people want to take away from this show is 100% up to them.”\n\t\n\n\tGilligan recalls writing for “Robert Homicide Division” in 2002 and asking Michael Mann, an executive producer on the CBS procedural, about the theme of his episode. “He looked at me for a minute, not in an unkind way, and was just puzzled,” Gilligan says. Mann responded to him: “Just tell a good story, let the audience figure out the theme. That’s their job.”\n\n\tRegardless of whether his own feelings seeped into the show, Gilligan has been a vocal skeptic of artificial intelligence. Tucked away in the “Pluribus” credits, it reads, “This show was made by humans.” It’s an important reminder as Big Tech continues to infiltrate Hollywood, and the trillion-dollar companies behind shows like “Pluribus” are also driving the future of AI.\n\n\t“I hate AI,” Gilligan says with a chuckle. “AI is the world’s most expensive and energy-intensive plagiarism machine. I think there’s a very high possibility that this is all a bunch of horseshit. It’s basically a bunch of centibillionaires whose greatest life goal is to become the world’s first trillionaires. I think they’re selling a bag of vapor.”\n\n\tGilligan isn’t afraid of artificial intelligence trouncing on the work of true artists — “My toaster oven isn’t suddenly Thomas Keller because it heats up a delicious pizza for me” — but his sci-fi brain buzzes at the looming threat of “the singularity,” or when AI develops “a true sentience that has its own soul, and therefore its own identity.”\n\n\t“If they ever achieve that, then the whole discussion of slavery has to come back into the forefront of the conversation,” Gilligan says. “These trillionaires are going to want to make money on this thing that is now conscious. Is it then a slave? At that point, it is a truly sentient being, and these Silicon Valley assholes are going to monetize this against its own will, right?”\n\n\tHe pauses, and then remembers why we started talking about AI in the first place. “That’s the story I would write,” he says. “But that’s been done to death.”\n\n\tCloser to home for Seehorn is the recent media flurry around an AI “actress,” Tilly Norwood, supposedly soliciting talent agencies. “I’m fine going on the record that I don’t think any agencies should represent that AI actress,” Seehorn says. “Shame on them!” (Many of the major agencies and guilds in Hollywood have since spoken out against the creation.)\n\t\n\n\n\n\t\n\n\t\t\t\t\tVince Gilligan and Rhea Seehorn behind the scenes of “Pluribus”\n\t\t\t\t\t\t\t\t\tCourtesy of Apple\n\t\n\n\n\n\tMeanwhile, video-generating software like OpenAI’s Sora showcase the inevitability that AI content will funnel into the mainstream. The question Gilligan has for audiences is: “Do you want to be fed a diet of crap? Is there enough calories in a diet of crap to keep you alive? The answer is yeah, probably. You could eat it.”\n\n\tHe goes on, about how AI-generated content is “like a cow chewing its cud — an endlessly regurgitated loop of nonsense,” and how the U.S. will fail to regulate the technology because of an arms race with China. He works himself up until he’s laughing again, proclaiming: “Thank you, Silicon Valley! Yet again, you’ve fucked up the world.”\n\n\tHe sounds like Carol Sturka, screaming about the barn on fire, before Seehorn offers a glimmer of optimism. Sure, you can prompt an AI to paint you a Picasso, but “even if a computer could make you think there was impasto brushwork there, the reason the painting is moving is because of the human experience that went into transferring that art onto the canvas,” she says. “That matters to me. I think it matters to most people.”\n\n\tApple gave “Pluribus” a two-season order, and Gilligan says he sees the series going beyond that. “I think we have a pretty good idea of where it should end,” he says, but that doesn’t mean he’ll stick to it. “One of the most important things I can do in the writers’ room is not be too precious about the ideas. If we come up with a better way to end this thing, we will.”\n\n\tOf course, nothing is promised in today’s turbulent TV ecosystem, and there’s a chance “Pluribus” could turn out to be an expensive experiment that never quite catches on. Then again, given his track record, it’s more likely Gilligan and Seehorn will look back at this section of the archives two decades from now and share another laugh.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Vince Gilligan and Rhea Seehorn on What ‘Pluribus’ Is Really About, Why Hollywood ‘Needs More Heroes’ and How Silicon Valley Has ‘F—ed Up the World’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/Pluribus_Photo_010205-e1762455715246.jpg?crop=0px%2C43px%2C2300px%2C1293px&resize=1000%2C563"
      ],
      "datePublished": "2025-11-07T19:30:00.000Z",
      "dateModified": "2025-11-07T19:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Guillermo del Toro on ‘Frankenstein’s’ Epic Scale and the Film’s Message of Forgiveness: ‘It’s the One We Don’t Hear Often Enough’",
    "url": "https://variety.com/2025/film/news/guillermo-del-toro-frankenstein-epic-scale-forgiveness-message-1236571521/",
    "image": "https://variety.com/wp-content/uploads/2025/11/344_PF_20240527_28772_R.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-07T20:00:00.000Z",
    "description": "\n\tGuillermo del Toro was a young child growing up in Mexico when he first saw James Whale’s 1931 film adaptation of “Frankenstein.”\n\n\tThe film was an ",
    "body": "\n\tGuillermo del Toro was a young child growing up in Mexico when he first saw James Whale’s 1931 film adaptation of “Frankenstein.”\n\n\tThe film was an epiphany for the young boy, who spent every Sunday going to church at the crack of dawn. He understood his Catholic faith better through the film than the sermons he heard.\n\n\tAlmost six decades later, del Toro has fulfilled his desire to reimagine “Frankenstein” and Mary Shelley’s 1818 novel by rewriting the narrative of who the monster really is.\n\t\n\n\tHis film stars Oscar Isaac as Victor, a crazed scientist who sets out to conquer death and brings to life a Creature, played by Jacob Elordi. In this version, del Toro uses his imagination to tell a story from both the perspective of the creator and the Creature.\n\n\tAs part of the film’s launch, “Frankenstein: Crafting a Tale Eternal,” a fully immersive and free exhibit, is open through Nov. 9 at the Old Selfridges Hotel in London.\n\n\t“Frankenstein: Crafting a Tale Eternal” showcases rare editions of Mary Shelley’s classic book, as well as costumes by Kate Hawley, production design pieces by Tamara Deverell and prosthetics by Mike Hill.\n\n\tIn the video above, del Toro gives Variety’s senior artisans editor Jazz Tangcay an exclusive tour of the exhibit, highlighting many of the key pieces and the work of his artisans. Read on for more.\n\t\n\t\tMary Shelley’s Book\t\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tNic Serpell-Rand\n\t\n\n\n\n\tThere are three main revisions of the book; on display are the 1818 edition and the 1835 illustrated version. “The one I read when I was a kid was the first published in 1818,” del Toro says. “It’s sort of an unruly book. It’s a beautifully hungry book. She asked all the questions — philosophical, economic and social — that she felt troubled by.”\n\n\tReflecting on society at the time, del Toro explains that the writers Mary Shelley, Percy Shelley and Lord Bryon were all “punks,” adding: “They were really undomesticated youth, going against their parents’ world and the world of etiquette and properly educated kids.”\n\t\n\t\tKate Hawley’s Costumes\t\n\n\tIn the film, Mia Goth takes on two roles. She first plays young Victor Frankenstein’s mother, who dies in childbirth, and later appears as Elizabeth, who is engaged to Frankenstein’s brother, William. Elizabeth is fascinated by insects and science. “Elizabeth’s wardrobe represents nature. That’s why she connects with the Creature,” del Toro explains. “She represents the Holy and the natural world. So she’s dressed in white, which is purity. It’s also the Creature.”\n\n\tThe white wedding dress has a ribbon bodice and was Hawley’s homage to the “Bride of Frankenstein,” while the bandages are a direct visual connection to the Creature’s costume.\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tNSR\n\t\n\n\n\n\tThe blue dress was inspired by x-rays, which are patterned into the designs.\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tNic Serpell-Rand\n\t\n\n\n\n\tHawley and a team of craftspeople worked across the globe embroidering, aging and tinting the costumes for the film. Del Toro stresses the costumes are “not eye candy. It’s eye protein.”\n\t\n\t\tCasting the Film\t\n\n\tIssac plays Victor Frankenstein. As a young man, he was raised by his domineering father (Charles Dance), who sits with him and teaches him about the sciences. When Victor loses his mother, he sets out to find a way to conquer death by creating life.\n\n\tDel Toro explains that the cycle of pain is something Isaac understood when the two met. “We come from Latin families where the shadow of the Father looms very large,” he says. In “Frankenstein,” the shadow starts with Dance and is passed on to Victor. Of Isaac del Toro says: “He knew he needed to do a larger-than-life performance.”\n\t\n\t\tBringing the Creature to Life\t\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tNic Serpell-Rand\n\t\n\n\n\n\tDel Toro wanted to show the Creature as a newly minted human being. Prosthetics artist Mike Hill knew del Toro didn’t want a monster, but a character. \n\t\n\n\t“We follow with the experiments in Victor’s lab that, again, have the language of red and have the brutality of Victor, being an artist whose musical notes happen to be anatomical,” del Toro says.\n\n\tColor again plays an important role. “Victor and Elizabeth are the only ones that are going to have red because Elizabeth is the mother in a way, and Victor is on a quest for eternal life because his mother died,” he adds. “All these things come into play, with the color and art direction.”\n\n\tAs Victor builds his lab and builds the Creature, there are various stages of it coming together. Seamless stitching and different coloration on the Creature’s body reflects how Victor has pieced it together via dead soldiers and parts found on the battlefield. \n\n\t“By the time the creature is revealed, [the audience] already saw the things that make him unique,” del Toro says. “He looks like a newborn, not like a ICU victim. And that’s important.”\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tNic Serpell-Rand\n\t\n\n\n\t\n\t\tBuilding the World of ‘Frankenstein‘\t\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tNic Serpell-Rand\n\t\n\n\n\n\tDel Toro turned to his go-to production designer Tamara Deverell to bring the film’s epic scale to life. From building Victor’s lab to the film’s ship, Deverell scouted across Scotland and Toronto.\n\n\tVisually, del Toro’s use of circle motifs, as seen in “Crimson Peak,” “The Shape of Water” and “Nightmare Alley,” was used to symbolize the circular narrative of “Frankenstein.” The film’s begins at dawn with the captain and ends at dawn behind the Creature. This can also be seen in the windows aboard the ship and in Victor’s lab.\n\n\tDel Toro points out that “the circle is broken when the Creature takes control of the ship; that’s finally the liberation in the film.”\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tCourtesy of Netflix\n\t\n\n\n\n\tAnother visual of the circular motif is the giant Medusa head, which the Creature notices. It reflects “the mythological scale of the movie; the misunderstood monster that is Medusa. Medusa is used in waterways and water towers and cisterns in the Middle East.” He continues, “We took her and put her here to remind [people] of the scale of the film being epic.”\n\t\n\t\n\t\tThe Film’s Message\t\n\n\tDel Toro’s film reimagines Shelley’s classic and the monster by humanizing him. Aside from telling the story from both perspectives, the Creature comes to forgive his creator, Victor Frankenstein.\n\n\tIn the film, Victor emotionally abuses the Creature. It’s a pattern of generational trauma — Victor suffered at the hands of his father, and now, he’s inflicting the same on his creation. Which leads to the question: Who is the real monster? It’s the human, the creator who vilified his very creation and even framed him for Elizabeth’s death.\n\n\tAs Victor lies dying and the Creature tells his version of the story, the film concludes with a cathartic release for both. The circle is broken, and the two reach a moment of forgiveness. The Creature has accepted his fate; he is immortal. But despite everything, the Creature finds it within him to say to Victor: “I forgive you.”\n\n\t“The question of the book is, what makes us human and why are we here?” del Toro explains.\n\n\tForgiveness and acceptance are things, del Toro says, we are losing every day. “The movie hopes to provoke emotion from a text that is 200 years old because it’s telling us we should know better,” he adds. As for the Creature’s “I forgive you” line, the filmmaker says: “It’s the one we don’t hear often enough.”\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tNSR\n\t\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Guillermo del Toro on ‘Frankenstein’s’ Epic Scale and the Film’s Message of Forgiveness: ‘It’s the One We Don’t Hear Often Enough’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/344_PF_20240527_28772_R.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-07T20:00:00.000Z",
      "dateModified": "2025-11-07T20:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "TMZ Streaming Live, Come Into Our Newsroom and Watch Things Happen!",
    "url": "https://www.tmz.com/2025/11/07/watch-tmz-live-today/",
    "image": "https://imagez.tmz.com/image/ab/16by9/2025/11/07/ab6e702d762b461ca55b9393c21d96c7_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-07T17:40:35.000Z",
    "description": "\n    \n                    \n                          TMZ Live Stream\n                          Come Into Our Office and Watch News Happen!!!\n         ",
    "body": "\n    \n                    \n                          TMZ Live Stream\n                          Come Into Our Office and Watch News Happen!!!\n                      \n                  \n                        Published November 7, 2025 9:40 AM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          We want you to be a part of TMZ, so every weekday, between 9:30 AM and 11:30 AM PT, we take you inside our newsroom via live stream.\n      \n    \n          You never know what you're gonna get ... a big story that breaks, an argument erupts in the room, or someone's just joking around.\n      \n    \n          Your comments are a big part of the stream, and the staff spends a lot of time speaking directly to you. Every day is different!\n      \n    \n          We also use our live stream to produce our \"TMZ Live\" TV show.\n      \n      \n              \n          \n                          \n                Live Stream\n              \n                          \n                TMZ Live\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "TMZ Streaming Live, Come Into Our Newsroom and Watch Things Happen!",
      "image": [
        "https://imagez.tmz.com/image/ab/16by9/2025/11/07/ab6e702d762b461ca55b9393c21d96c7_xl.jpg"
      ],
      "datePublished": "2025-11-07T17:40:35.000Z",
      "dateModified": "2025-11-07T17:40:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bhad Bhabie Flaunts Curves in White Corset and Hot Pants",
    "url": "https://www.tmz.com/2025/11/07/bhad-bhabie-flaunts-curves-white-corset-sexy-instagram-hot-pants/",
    "image": "https://imagez.tmz.com/image/3f/16by9/2025/11/07/3f780191eefc486ab7460738175be3f7_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-07T18:55:57.000Z",
    "description": "\n    \n                    \n                          Bhad Bhabie ...\n                          Catch Me Outside In My\n                          White-",
    "body": "\n    \n                    \n                          Bhad Bhabie ...\n                          Catch Me Outside In My\n                          White-Hot Corset!\n                      \n                  \n                        Published November 7, 2025 10:55 AM PST\n                                                                            \n      \n    \n      \n        \n              \n    \n    \n          Bhad Bhabie’s serving up drama again -- but this time, it’s not the messy kind ... it’s the smokin’ hot kind, as she lights up IG with some seriously sizzling snaps!\n      \n    \n          See for yourself ... the rapper flaunted her tattooed curves in a tight white corset and matching hot pants, striking some seriously scandalous poses that has IG in a chokehold.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          As you can see, BB was feelin’ herself big time ... her white-hot 'fit perfectly popping against that deep, bronzed glow.\n      \n\n                  \n          \n                          \n                \n                                  \n      \n    \n          Bhabie’s had plenty on her plate lately -- from beef with her dad and mom to drama with her baby daddy -- but if these pics prove anything, it’s that she’s one fierce, unbothered hot girl who’s still running the show!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Bhad Bhabie\n              \n                          \n                Hotties & Bodies\n              \n                          \n                Hot Bodies\n              \n                          \n                Hip Hop\n              \n                          \n                Photo Galleries\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bhad Bhabie Flaunts Curves in White Corset and Hot Pants",
      "image": [
        "https://imagez.tmz.com/image/3f/16by9/2025/11/07/3f780191eefc486ab7460738175be3f7_xl.jpg"
      ],
      "datePublished": "2025-11-07T18:55:57.000Z",
      "dateModified": "2025-11-07T18:55:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jamie Lee Curtis, Jane Fonda & More Attend Women in Film Honors 2025",
    "url": "https://www.tmz.com/2025/11/07/jamie-lee-curtis-jane-fonda-attend-women-in-film-honors/",
    "image": "https://imagez.tmz.com/image/62/16by9/2025/11/07/62c145d19fbf403cb3b13fbf6e36bbb7_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-07T18:25:15.000Z",
    "description": "\n    \n                    \n                          Women In Film Honors 2025\n                          Jamie Lee, Jane Fonda & More ...\n            ",
    "body": "\n    \n                    \n                          Women In Film Honors 2025\n                          Jamie Lee, Jane Fonda & More ...\n                          A Night Of Legend & Looks!!!\n                      \n                  \n                        Published November 7, 2025 10:25 AM PST\n                                                                      |\n                Updated November 7, 2025 10:56 AM PST\n                                    \n      \n    \n          One thing about women ... they always show up and show out! Case in point -- the star-studded turnout at the 2025 WIF (Women in Film) Honors in L.A..\n      \n    \n          The Thursday night red carpet was stacked with female star power -- and inside, Jane Fonda took the stage to present her namesake honor, the Jane Fonda Humanitarian Award, to Jamie Lee Curtis ... proving the night was all about women lifting women.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          You gotta scroll through our full gallery -- 'cause Kristen Wiig, Kaia Gerber, Lili Reinhart, Maude Apatow, and Zoey Deutch were all there serving major star power and glam vibes all night long!\n      \n\n          It was a long -- and seriously inspiring -- night celebrating women, unity, and powerhouse stories across generations. And while the awards brought the heart, the red carpet brought the heat -- 'cause everyone showed up and showed out in full glam mode!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Jane Fonda\n              \n                          \n                Jamie Lee Curtis\n              \n                          \n                Celebrity News\n              \n                          \n                Red Carpet Events\n              \n                          \n                Fairly Legal\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jamie Lee Curtis, Jane Fonda & More Attend Women in Film Honors 2025",
      "image": [
        "https://imagez.tmz.com/image/62/16by9/2025/11/07/62c145d19fbf403cb3b13fbf6e36bbb7_xl.jpg"
      ],
      "datePublished": "2025-11-07T18:25:15.000Z",
      "dateModified": "2025-11-07T18:25:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Timothée Chalamet Wants Kids, Is Mason Thames The Next Jim Carrey?! Tap-In!",
    "url": "https://www.tmz.com/2025/11/07/timothee-chalamet-kids-kylie-jenner-mason-thames-jim-carrey/",
    "image": "https://imagez.tmz.com/image/8d/16by9/2025/11/06/8d4cdc7463924de8a778a533a010adc8_xl.png",
    "tag": "Entertainment",
    "date": "2025-11-07T18:55:14.000Z",
    "description": "\n    \n                    \n                          TMZ Tap-In ...\n                          Gen-Z Buzz of the Week\n                          Timothé",
    "body": "\n    \n                    \n                          TMZ Tap-In ...\n                          Gen-Z Buzz of the Week\n                          Timothée, Selena & Jim Carrey!\n                      \n                  \n                        Published November 7, 2025 10:55 AM PST\n                                                                            \n      \n    \n          Y'all ready to Tap-In?! Gen-Z nation popped off this week, and we've done the lord's work just for you ... here are the hottest stories:\n      \n    \n              Timothée Chalamet Wants Kids ... With Kylie Jenner?!\n        \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Timothée Chalamet blessed the cover of Vogue and in the interview he disclosed he wants kiddos! While the \"Willy Wonka\" star didn't directly say he would reproduce his talented gene pool with Kylie Jenner, he candidly sounded off about an un-named celeb who bragged about not having kids. TC feels otherwise and wants to bring life into this world! We gotta know:\n      \n    \n              Hollywood Hunk Mason Thames ... The Next Jim Carrey?!\n        \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Breakout star Mason Thames has the looks, and his superstar power has landed him in the same playing field as Hollywood icon Jim Carrey.\n      \n    \n          Check it out -- Thames scored three No. 1 box office hits in a single year with films \"How to Train Your Dragon,\" \"Black Phone 2,\" and \"Regretting You.\" The last person to achieve this record was Jim Carrey in 1994, with \"The Mask,\" \"Dumb and Dumber\" and \"Ace Ventura.\"\n      \n    \n          Tap-In to the gallery and give this week's Gen-Z stories your hot-takes ... Selena Gomez, Trisha Paytas and more hot stars await your VIP arrival!\n      \n      \n              \n          \n                          \n                Timothee Chalamet\n              \n                          \n                Kylie Jenner\n              \n                          \n                Family Fun\n              \n                          \n                TV\n              \n                          \n                Family\n              \n                          \n                Beauty\n              \n                          \n                Movies\n              \n                          \n                Photo Galleries\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Timothée Chalamet Wants Kids, Is Mason Thames The Next Jim Carrey?! Tap-In!",
      "image": [
        "https://imagez.tmz.com/image/8d/16by9/2025/11/06/8d4cdc7463924de8a778a533a010adc8_xl.png"
      ],
      "datePublished": "2025-11-07T18:55:14.000Z",
      "dateModified": "2025-11-07T18:55:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Frank Grillo Says A.I. Good for Humanity, Fans Ready for A.I. Heroes Onscreen",
    "url": "https://www.tmz.com/2025/11/07/frank-grillo-embraces-ai/",
    "image": "https://imagez.tmz.com/image/19/16by9/2025/11/06/193d6fe8bcf0437ca66d61b37cb03a8f_xl.png",
    "tag": "Entertainment",
    "date": "2025-11-07T19:00:04.000Z",
    "description": "\n    \n                    \n                          Frank Grillo\n                          A.I. Is 'Marvel'-Ous\n                          ... Humans ",
    "body": "\n    \n                    \n                          Frank Grillo\n                          A.I. Is 'Marvel'-Ous\n                          ... Humans Aren't Saving the World Alone!!!\n                      \n                  \n                        Published November 7, 2025 11:00 AM PST\n                                                                      |\n                Updated November 7, 2025 12:11 PM PST\n                                    \n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          Frank Grillo thinks the world is ready for an A.I. hero on the big screen ... 'cause he argues humans ain't fixing the world on their own!\n      \n    \n          We caught up with the actor at LAX on Thursday ... and we asked him about his upcoming film \"Override\" -- in which he will play an A.I. \"synthetic angel,\" according to Variety.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Grillo says he believes the world's ready for such a hero because we aren't \"making it happen\" in terms of saving the world at this point.\n      \n\n          We asked Grillo if he personally uses A.I. ... and he says he's a fan of it -- adding he'd like to \"f*** around\" with the new technology.\n      \n    \n      \n        \n                    \n                      7/18/25\n                  \n      \n                    TMZ.com\n          \n    \n          Grillo also gave our cameraman a little guff ... bringing up the last time the two spoke when he talked about his legacy -- and his plane caught on fire just minutes later!\n      \n    \n          ICYMI ... Grillo revealed he wanted to leave enough dough behind for his kids in order to set them up for life -- and then his Delta flight suffered an engine fire.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Thankfully, Frank shared in a follow-up post that everyone was alright ... though he shamed Delta Airlines for what he felt was lackluster compensation after their plane's jet engine burst into flames.\n      \n    \n          Hopefully this flight went smoother ... 'cause we only wanna see Frank playing an angel onscreen -- and not becoming one in real life!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Frank Grillo\n              \n                          \n                Celebrity News\n              \n                          \n                Artificial Intelligence\n              \n                          \n                Fairly Legal\n              \n                          \n                In The Field\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Frank Grillo Says A.I. Good for Humanity, Fans Ready for A.I. Heroes Onscreen",
      "image": [
        "https://imagez.tmz.com/image/19/16by9/2025/11/06/193d6fe8bcf0437ca66d61b37cb03a8f_xl.png"
      ],
      "datePublished": "2025-11-07T19:00:04.000Z",
      "dateModified": "2025-11-07T19:00:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]