[
  {
    "title": "‘A Knight of the Seven Kingdoms’ Creator on George R. R. Martin’s Plans for 15 More Books and That Gross Poop Shot in the Premiere: ‘It’s Not a Fake Up There S—-ing on Screen. That’s His Butt’",
    "url": "https://variety.com/2026/tv/features/knight-seven-kingdoms-premiere-poop-joke-george-rr-martin-1236630568/",
    "image": "https://variety.com/wp-content/uploads/2026/01/peter-claffey_2.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-19T03:45:00.000Z",
    "description": "\n\tSPOILER ALERT: This article contains spoilers for the premiere of “A Knight of the Seven Kingdoms,” now streaming on HBO Max.\n\n\tWesteros is not read",
    "body": "\n\tSPOILER ALERT: This article contains spoilers for the premiere of “A Knight of the Seven Kingdoms,” now streaming on HBO Max.\n\n\tWesteros is not ready for “A Knight of the Seven Kingdoms.”\n\n\tThe new “Game of Thrones” prequel, which takes place about 100 years before the main series and 80 years after “House of the Dragon,” leaves the dragons and politics behind and instead focuses on one oafish knight, Peter Claffey’s Ser Duncan the Tall, aka Dunk, and his diminutive squire named Egg, played by nine-year-old Dexter Sol Ansell.\n\t\n\n\t“A Knight of the Seven Kingdoms” is less about Targaryens and Starks and more about Dunk’s personal journey to becoming a knight while at a tourney with some of the fiercest warriors in Westeros. It’s based “A Song of Ice and Fire” author George R. R. Martin’s novella, “The Hedge Knight,” published in 1998, and there are two more books that could form the groundworks for Season 2, which was announced ahead of the show’s premiere, and beyond. Each installment in the six-episode Season 1 is less than an hour long and packs in more jokes and cutaway gags than any single episode of “Thrones” or “House of the Dragon.” \n\n\n\tThe series starts with Dunk mourning the death of his mentor and elderly knight, Ser Arlan of Pennytree (Danny Webb). After saying his goodbyes, Dunk picks up Arlan’s sword in the shining sun and has a hero moment worthy of Jon Snow or Jaime Lannister — but then gets a queasy stomach and explosively poops behind a tree. \n\n\tGoing quickly from hero to zero, Dunk journeys to the tourney to prove himself as a real knight. Along the way, he meets a little bald boy named Egg who secretly follows him and convinces the would-be knight he should be his squire. Resigned to sleeping outside, Dunk also manages to sneak into a party held by the rowdy Ser Lyonel Baratheon (Daniel Ings) to scrape together some food and catches the eye of a cute puppeteer named Tanselle (Tanzyn Crawford).\n\t\n\n\tWith Variety, showrunner Ira Parker, who was a co-executive producer on “House of the Dragon,” breaks down the premiere, that poop joke and how much of George R. R. Martin’s unpublished source material he has access to for the show’s future.\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tHBO\n\t\n\n\n\t\n\t\tI love that this show is still set in Westeros and has a similar feel as “Game of Thrones,” but there are poop jokes and cutaway gags. How did you strike that tone?\t\n\n\tReally it all just came from Dunk’s POV. We wanted the audience to feel whatever he was feeling in that moment. One of the first jokes that we do is Dunk feeling like a hero. He picks up this sword of his old master, and he thinks, “Maybe I could be the guy. Maybe I can be a knight.” But, of course, he’s not a hero. None of us are really heroes. Then all of a sudden, he gets a stomachache and he shits because he hears that music and the call, but he’s not quite there yet. But he decides he’s gonna try and go anyway. I feel like that’s how so many decisions in my life were made, which is having these grand thoughts and dreams and then the reality of it sets in and it becomes a lot more complicated. \n\n\tDunk’s journey in Season 1 is no different than somebody going out to New York or L.A. from their little hometown, thinking “I’m gonna go and try and make it.” Then you end up taking a bus there, realizing you have nothing, spending all your money on some shitty car that breaks down all the time, and you can’t afford rent, so you’re sleeping in your car and you’re going to auditions and trying to make it work. This is the experience that a lot of people have, whether you’re going into the arts or if you’re going into anything that is highly competitive like knighting can be. Dunk finds himself at the very bottom of this. He doesn’t have the training, the name, the money, he can’t afford to fail.\n\t\n\t\n\t\tI have to ask about the pooping scene with the iconic “Game of Thrones” theme song. Where did that come from?\t\n\n\tIt was written in the script very early on as the hero theme. We tried a bunch of different versions, and the one that felt the most iconic was the major theme. Because we were not going with an opening title sequence, it felt right to give everybody a little bit of a taste of it to launch into our show. It comes out of how Dunk is feeling in that moment, going from hero to the opposite of hero, as so many of us do sometimes.\n\t\n\t\tHow did that work? Is that actually Peter Claffey’s butt or did you use a fake one?\t\n\n\tA magician never gives it away. I will say that we don’t have the budget for fake anything on this show. Very, very little is done fake. We’re not crazy. It’s not a fake up there shitting on screen, that’s his butt.\n\t\n\t\tIt wouldn’t be Westeros without dragons, and even though there aren’t any real dragons left, you still have a fake one in the episode. Did you purposely want to have some sort of dragon representation in the show, and how did you make that puppet?\t\n\n\tWe were trying to figure out how to “Game of Thrones” this puppet show. The idea that these were real artisans and craftsmen, this traveling puppet show with these massive, moving puppets was very interesting to us early on. The puppet makers did a fantastic job. It felt impressive enough, and the goal was to disconcert Dunk and send him into this puppet show and for him to be just blown away and almost intimidated. He can’t escape the fact that he feels insignificant to this world where everyone’s doing these wonderful things, and he’s just wondering if he belongs there. Even the fire was done in a way that theoretically could have been done back in the 14th century. The dust that is being caught on fire is called Lycopodium, which is a dried pollen that theoretically could have actually been collected and ignited with a torch. So no special effects for us. We tried to keep it grounded.\n\t\n\t\n\t\tDexter Sol Ansell was 9 years old when he filmed Season 1, as you get into Season 2 and beyond are you worried at all about him aging out of the role, like how the “Stranger Things” kids got so much older by the end of their show?\t\n\n\tDexter is going to have whatever career he decides that he wants. He’s so talented. He’s come in Season 2 like an old pro. He’s so confident, calm, and he can give you different versions now. He’s really come into himself. I think he’s the best child actor on Earth, there’s no doubt about it. The planned books that George has take Dunk and Egg through their whole lives. I’ve joked about this with HBO, to which I’ve definitely got some eye rolls, but I would love to do three, four or five seasons with Egg the boy and then come back in five or 10 years and do a few more with Egg the prince. Then come back in five or 10 years from then and do him at the end of his life — Linklater method. They go off, do whatever they want to do in between, they can have lives, then we come back and get the crew back together and we tell a little bit more of the story because I think it would be really interesting. The idea of taking two people on a journey through their lives, I haven’t seen a lot of that. But I embrace the oldening of Dexter and Egg. He’ll grow older with the character; he’s supposed to get older. Hopefully, it’s not all based on him having a cute, high voice. We understand how important that is right now, but hopefully he will develop and the characters will develop, and it will still be a lot of fun.\n\t\n\t\tHow much of George R. R. Martin’s unpublished novels do you have access to? Do you have the details of stories that he hasn’t written yet?\t\n\n\tI do. There’s a document that few people have read. He works all offline. His computer is not connected to the internet, so things have to be printed out and passed around that way. I’ve seen the plan for 12, 13, 14, 15, maybe, of these novellas. It would be fantastic, but I don’t want to get carried away here. Let’s see if people watch the show. Maybe we’re just one, one and a half, two and done and we all go home, but it’s a lot of fun to write in this world so I hope we get to do more.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘A Knight of the Seven Kingdoms’ Creator on George R. R. Martin’s Plans for 15 More Books and That Gross Poop Shot in the Premiere: ‘It’s Not a Fake Up There S—-ing on Screen. That’s His Butt’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/peter-claffey_2.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-19T03:45:00.000Z",
      "dateModified": "2026-01-19T03:45:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Industry’ Star Kit Harington on Henry Muck’s Acid-Popping Descent Into Supernatural Despair and Unraveling the ‘Real Trauma in His Past’",
    "url": "https://variety.com/2026/tv/global/industry-kit-harington-henry-muck-supernatural-descent-1236633180/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Industry-S4S2.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-19T03:00:00.000Z",
    "description": "\n\tSPOILER ALERT: This story contains plot details for “The Commander and the Grey Lady,” Season 4, Episode 2 of HBO’s “Industry,” now streaming on HBO",
    "body": "\n\tSPOILER ALERT: This story contains plot details for “The Commander and the Grey Lady,” Season 4, Episode 2 of HBO’s “Industry,” now streaming on HBO Max.\n\n\tAll is not well in the House of Muck.\n\n\tAfter underlining his credentials as a failed entrepreneur in Season 3, “Industry” creators Mickey Down and Konrad Kay plunge their silver spoon-fed aristocrat Henry Muck (Kit Harington) into dramatic new lows in the second episode of Season 4. In the first few scenes alone, he’s humiliated on stage at the local election in his bid to become a Conservative Party member of parliament, then back at the vast country pile sees his relatively fresh marriage to Yasmin (Marisa Abela) loudly unravel as he lies hungover in a four-poster bed, mopes around in a silk dressing gown feeling sorry for himself, and gives up his libido in exchange for lines of coke (and much more). \n\t\n\n\n\n\t\n\n\t\n\n\n\n\tBut that’s not all. At a glittering birthday party Yasmin (kitted out like Marie Antoinette) throws for Henry, he ups the drug-taking with some LSD, and then, leaving the party, embarks on a violent adventure with a visitor. At the pub, having gotten into a physical fight with one of the locals, the audience learns that the friend Henry’s with is a figment of his imagination — the ghost of his late father (a man looming large over all his growing mental health woes). Later, back at the estate, Henry tries to end it all for good in a garage (his father had also taken his own life).\n\n\n\tFor Harington, who was only brought into “Industry” in Season 3, the episode — almost entirely set on Muck’s grand estate — was the opportunity to give Henry a much more complete and complex character, warts and all, than seen before.\n\t\n\n\t“The importance of it was to see him as I had always known him, as a real and fully rounded person, not just a kind of villainous character who comes in and steals the girl, but someone who actually has a real trauma in his past — and who wants to do good at the heart of it, but is struggling,” he tells Variety. “And I thought, if we could see that see in all its ugliness, then we might empathize with him.”\n\n\tFor all the upper-class hijinks, Henry’s descent also raises the topic of male suicide, an “important subject matter that needs to be talked about,” says Harington. “No one should go through that, no matter how privileged you are, no matter how despicable a person you are.”\n\n\t“Industry” watchers will note that the episode is the show’s wildest departure from its origins yet. Season 4 in itself serves as an mini-reboot of the series, expanding the story away from its financial roots and into ambitious pastures new. But this dark tale — directed by Down and Kay — is easily the furthest its felt from Pierpoint, with the ghost element also dragging the drama into new genre realms. “A neo-Gothic period drama in a big house,” is how Kay described it to Variety.\n\n\t“One thing you know about Mickey and Konrad is that they’re not afraid to take a wild swing, and land it,” says Harington. “And I think it works, because it’s all in Henry’s mind — we’re seeing it mainly from his perspective. So it is supernatural, but Henry has just popped an acid. And we’ve also set the episode up as being very strange and odd and surreal in its placement in this house. I think they’ve done it very cleverly.”\n\n\n\n\t\n\n\t\n\n\n\n\tDespite having added numerous layers to Henry — who actually emerges from Episode 2 somewhat rejuvenated and with his relationship with Yasmin refreshed following a quick shag on the bonnet of his sports car — it hasn’t changed his opinion of the character.\n\n\t“You know, I still think he’s an egotistical nightmare and completely self obsessed,” he says. “But at the heart of it, I really like him.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Industry’ Star Kit Harington on Henry Muck’s Acid-Popping Descent Into Supernatural Despair and Unraveling the ‘Real Trauma in His Past’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Industry-S4S2.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-19T03:00:00.000Z",
      "dateModified": "2026-01-19T03:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Raid’ Franchise Director Raj Kumar Gupta to Helm Tentpole Film for India’s Junglee Pictures (EXCLUSIVE)",
    "url": "https://variety.com/2026/film/news/raid-director-raj-kumar-gupta-junglee-pictures-1236634176/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Myra-Karn-Vineet-Jain-Raj-Kumar-Gupta.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-19T02:30:00.000Z",
    "description": "\n\tIndia’s Junglee Pictures has tapped filmmaker Raj Kumar Gupta to helm a tentpole theatrical feature, bringing together the studio behind “Badhaai Ho",
    "body": "\n\tIndia’s Junglee Pictures has tapped filmmaker Raj Kumar Gupta to helm a tentpole theatrical feature, bringing together the studio behind “Badhaai Ho” and “Raazi” with the director of the “Raid” franchise.\n\n\tGupta, whose credits include “Raid,” “Raid 2,” “No One Killed Jessica” and “Aamir,” has established himself as a filmmaker specializing in reality-based narratives with commercial appeal. His most recent film, “Raid 2,” ranks among the top 10 highest-grossing Bollywood theatrical releases of 2025.\n\t\n\n\tThe collaboration pairs Gupta’s grounded storytelling approach with Junglee Pictures’ track record of championing content-driven cinema across multiple genres. The studio launched with “Dil Dhadakne Do” before producing hits including “Badhaai Ho,” “Raazi,” “Talvar,” “Badhaai Do” and “Bareilly Ki Barfi.” Its 2025 slate included “Haq” and Malayalam-language film “Ronth,” both receiving acclaim during their theatrical and streaming releases.\n\n\n\tThe untitled project has completed its scripting phase, with casting scheduled to begin soon. The film is described as delivering an intense narrative consistent with Gupta’s directorial signature.\n\n\t“Junglee Pictures has always focused on backing distinctive, relatable stories with lasting cultural value,” said Vineet Jain, MD of The Times Group, which is Junglee’s parent outfit. “This collaboration with Raj reflects the studio’s intent to join forces with filmmakers who strengthen its slate through purposeful, impact-driven cinema, bringing quality storytelling with relevance, scale, and audience connection. This film will also be a true tentpole for Junglee – bold and impactful, rooted in realism.”\n\t\n\n\t“I’ve always been drawn to narratives grounded in reality that also have the ability to connect with audiences on a larger canvas,” Gupta added. “This film is conceived as a hard-hitting, immersive, engaging and entertaining theatrical experience. Junglee Pictures has a strong legacy of backing thoughtful, content-led cinema, making this collaboration feel like a natural alignment.”\n\n\tProducing partner Myra Karn added: “Junglee Pictures brings together heart, vision, and fearless storytelling. Junglee’s bold innovative approach meets Raj Kumar Gupta’s unflinching storytelling, crafting stories that questions the status quo. This collaboration is special and I am honored to be part of this dream team.”\n\n\tAdditional story details remain undisclosed.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Raid’ Franchise Director Raj Kumar Gupta to Helm Tentpole Film for India’s Junglee Pictures (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Myra-Karn-Vineet-Jain-Raj-Kumar-Gupta.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-19T02:30:00.000Z",
      "dateModified": "2026-01-19T02:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "CBS News Ready to Unveil Delayed ’60 Minutes’ Report That Pit Correspondent Against Chief",
    "url": "https://variety.com/2026/tv/news/60-minutes-cbs-news-inside-cecot-bari-weiss-sharyn-alfonsi-1236634344/",
    "image": "https://variety.com/wp-content/uploads/2026/01/MixCollage-18-Jan-2026-10-49-AM-6352.jpg?crop=16px%2C15px%2C1165px%2C655px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-01-18T22:52:10.000Z",
    "description": "\n\tCBS News is getting ready to put a delayed and much-scrutinized “60 Minutes” segment out into public view, but it remains unclear that doing so will",
    "body": "\n\tCBS News is getting ready to put a delayed and much-scrutinized “60 Minutes” segment out into public view, but it remains unclear that doing so will tamp down the controversy that has erupted around it.\n\n\tThe previously-impeded segment is called “Inside CECOT” and is a piece by “60 Minutes” correspondent Sharyn Alfonsi built around on-screen accounts of Venezuelan men deported by the U.S. to a harsh prison in El Salvador. It had been shelved even though CBS News had already promoted it as part of the lineup of the newsmagazine’s December 21 telecast. As disclosed by an email sent to colleagues at the time by Alfonsi, the decision was made by top CBS News executive Bari Weiss, who had at the time insisted that Trump officials appear in the report to comment on camera, even though Alfonsi’s team had made good-faith efforts to secure response ahead of filing the report for legal review. “The public will correctly identify this as corporate censorship,” Alfonsi said in her memo.\n\t\n\n\t“CBS News leadership has always been committed to airing the ’60 Minutes’ CECOT piece as soon as it was ready,” the news division said in a statement Sunday. “Tonight, viewers get to see it, along with other important stories, all of which speak to CBS News’ independence and the power of our storytelling.”\n\n\n\tWhen the report airs, it will not contain any direct interviews or exchanges on screen with Trump officials, according to three people familiar with the matter. Alfonsi had been dispatched to Washington, D.C. last week to try and secure an on-screen interview, two of these people said, but an interview that Weiss had hoped for did not take place. The story will, however, contain statements from several different parts of the U.S. government, something Weiss felt was lacking in the original piece and an element she wants in much of CBS’ political reportage, according to an executive familiar with the matter.\n\t\n\n\tAnd the piece will have three minutes of new reporting, this executive said, as well some minor changes from what had been expected to run in December. A statistic about the number of people who are deported from the U.S. because they are criminal has been added, and the story will note that one of the interviewees has two tattoos that are known marks of gangs or Nazis — elements the administration uses to identify migrants for potential deportation.\n\n\tAlfonsi is not expected to address any of the controversies around the piece in her introduction to the segment Sunday night.\n\n\tCareful viewers will be able to compare the new version with the original that was ready to air in December. After Weiss ordered the story held, a copy of it that had already been distributed to a Canadian media partner leaked and were made available via YouTube and other social outlets.\n\n\tAiring of the segment may not mend any frayed relationships between management and staff. Alfonsi’s current contract with CBS News is slated to lapse sometime this summer, according to a person familiar with the matter. If her deal is not renewed, some journalists could interpret it as the result of retaliation for her willingness to speak up. \n\n\tAlfonsi, who worked at ABC News before joining “60 Minutes,” has earned a reputation as a dependable reporter who typically avoids the controversies that can engulf TV-news personnel. At “60 Minutes,” Alfonsi told Variety in 2020, “you are dropped by a helicopter on top of a mountain and you have to kind of find your way down. There are some paths and moguls and jumps. You are sort of kicking your way out. I’ve been pushed out of the helicopter. I’m on the mountain. I feel like I’m just taking speed.”\n\n\tWeiss has defended her decision to hold the piece. But she acknowledges her timing was inopportune, according to a person familiar with her thinking, and she recognizes that she inserted herself into “60 Minutes'” editing and vetting process at a late stage. \n\n\t“Right now, the majority of Americans say they do not trust the press. It isn’t because they’re crazy,” Weiss said in a memo issued around Christmas. “To win back their trust, we have to work hard. Sometimes that means doing more legwork. Sometimes it means telling unexpected stories. Sometimes it means training our attention on topics that have been overlooked or misconstrued. And sometimes it means holding a piece about an important subject to make sure it is comprehensive and fair.” \n\t\n\n\tWeiss has attracted more attention to CBS News since her arrival last year than perhaps any other personality except Katie Couric, who jumped from NBC to anchor of “CBS Evening News” in 2006.  Weiss, a conservative opinion provocateur who founded the right-leaning site The Free Press, joined Paramount Skydance last year after the company purchased her outlet for $150 million. Since that time, she has overhauled “CBS Evening News” and sought to launch a new series of town halls and debates. But her  lack of experience with managing a large TV asset has been on regular display, giving staffers and critics plenty of reason for skepticism.\n\n\t“60 Minutes,” which features profiles and features along with investigative pieces, has seen its credibility undermined over the past two years as corporate managers failed to defend it from what was largely considered to be a nuisance suit from President Trump over the editing of a 2024 interview with then-Democratic presidential candidate Kamala Harris. Paramount, eager to clear a path to a sale of the company from the Redstone family, former controlling shareholders, to the Ellisons, who now operate Paramount Skydance, agreed to pay a $16 million settlement to Trump.\n\n\tAs a result, two senior CBS News executives  — Bill Owens, the executive producer of “60 Minutes” and Wendy McMahon, the former CEO of CBS News, local stations and syndication — suggested in remarks that they could no longer push back against corporate mandates they felt would weaken the newsroom. Three people familiar with the show say there have been calls for “60 Minutes” to cut back on the number of hard-news or investigative segments it runs, and pay more attention to features and celebrity profiles, which corporate managers believe will generate more attention online. On Sunday, however, the telecast will contain two segments tied to politics: one is the CECOT report, and the other is a look at what has happened in Minneapolis as ICE authorities crack down on the populace.\n\n\tThe newsmagazine has long worked apart from the rest of CBS News, and in recent years there have been some efforts to bring the show to heel. Whether the correspondents who work there will continue to bristle at similar maneuvers remains to be seen, but there is a hope internally that the show can get back to producing its journalism instead of being forced to defend it under circumstances Mike Wallace and Morley Safer might have considered surreal.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "CBS News Ready to Unveil Delayed ’60 Minutes’ Report That Pit Correspondent Against Chief",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/MixCollage-18-Jan-2026-10-49-AM-6352.jpg?crop=16px%2C15px%2C1165px%2C655px&resize=1000%2C563"
      ],
      "datePublished": "2026-01-18T22:52:10.000Z",
      "dateModified": "2026-01-18T22:52:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Billy Bob Thornton on Arguing With Andy Garcia in ‘Landman’ and Award Shows Snubbing Taylor Sheridan Shows Because They ‘Assume’ He’s a ‘Right-Wing Guy’",
    "url": "https://variety.com/2026/tv/features/billy-bob-thornton-andy-garcia-fights-landman-award-snubs-1236633602/",
    "image": "https://variety.com/wp-content/uploads/2026/01/LANDMAN_209_EM_0717_01595_RT_f.png?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-19T00:30:00.000Z",
    "description": "\n\tThe second season of “Landman” has come to an end, and while the dramatic focus of the series shifted from oil business to family matters, Billy Bob",
    "body": "\n\tThe second season of “Landman” has come to an end, and while the dramatic focus of the series shifted from oil business to family matters, Billy Bob Thornton‘s character Tommy always remained the central focus. Brash, brilliant and funny, Tommy is always able to keep cool under pressure and speak what’s on his mind, which is very reminiscent of Thornton’s real-life energy. The veteran actor spoke with Variety about his biggest challenges this season, how the show speaks to so many different fans, and why writer and co-creator Taylor Sheridan‘s shows are sometimes snubbed in awards conversations.\n\t\n\t\n\t\tWhat would you consider your most challenging scene to shoot this season?\t\n\n\tMaybe not every actor is this way, but I can’t help it because I’m so codependent. Some of the hardest stuff I had to do was when I had to be abrupt to, or even mean with, Sam Elliott. Sam and I are old, old friends. He’s been like a pop to me since I’ve known him in the ’80s. He’s been a mentor, a friend and everything. Sometimes, knowing the other human, it’s not as easy to just go for it, but you have to. You have to go 100%. When I did “Bad Santa,” it’s not like I could be really sweet with the kids. I actually explained that to the kids on that set and to the parents. But I would say that was the most challenging thing. \n\n\n\tThis cast has such great chemistry, and it was instant chemistry, which is awesome. But Sam, Andy Garcia and Demi [Moore] and I all go way back. Ali [Larter] and Michelle [Randolph] and Jacob [Lofland] and Kayla Wallace and James Jordan, none of us knew each other. But somehow we had a chemistry that was there from day one. It’s also a tribute to Taylor, because he knows who to cast and for what part. He really does. Some writers write with their own voice for every character, but each person on this show is their own thing. I love that. So when you have chemistry like that, but not everyone’s talking the same … One of the most brilliant things Taylor’s done with his shows is he has very strong individual characters with their own voices.\n\t\n\t\n\t\tYou mentioned Andy Garcia. The scenes this season where your characters are feuding are really electric. How do you find that spark together and find the rhythm of those big arguments?\t\n\n\tAndy and I are both sort of known for that. I grew up as an actor doing that, and so did he. Andy probably improvised more than I did in the scenes that we did. We stuck to what Taylor had written, but there are things we would throw in there at each other now and then. There’s one where Andy is putting in his office while we’re having our talk. That was Andy’s deal. It’s real easy to do this with Andy, he and I both have played a couple of bad guys, too. When you get into a confrontation, I think the adrenaline of the moment just takes over and can help you forget that you’re talking to your buddy. Whereas with me and Sam, they’re more sedated moments, more personal moments. So with Andy, that was a lot easier, knowing that this is my nemesis and he knows I’m his.\n\t\n\t\tWhy do you think “Landman” speaks to such a broad group of fans?\t\n\n\tIt’s interesting because we were very surprised it became an international hit. We thought it was going to appeal to Middle America, maybe not even the coasts. Now we have fans from Africa, South America, Canada, Australia, England, wherever it is. I think a lot of it is because the characters are unabashedly who they are. I think people like it that we just say and do whatever we do. There’s no walking on eggshells because we’re worried of what someone’s going to think. I think sometimes people like to see that freedom if they don’t have it in their own lives. Also, you’re taking a peek behind the curtain of a business that’s not normally portrayed.\n\t\n\t\tYou’ve spoken candidly in the past about award shows in Hollywood. Compared to its success, it seems that “Landman” and other Taylor Sheridan shows are sometimes underrepresented in award conversations. Why do you think that is?\t\n\n\tI think a lot of it’s political. I really do. I think some people assume Taylor is some sort of right-wing guy or something, and he’s really not. Even with this show being about the oil business, he just shows you what it’s like. He’s not saying “Rah, rah, rah for oil.” It’s just the people who work in this business or who are affected by this business, the people on the periphery and within the families in the business; this is what happens. These are the kinds of problems and joys and triumphs and whatever happens in this world. It’s a world of gambling, and you never know what’s going to happen. But I think people got the wrong idea about that. \n\t\n\n\tActing is not a sport. If you run the 100-meter dash in the Olympics and you break the tape first, you win. There’s no question about it. Everybody saw it. How do you say in the artistic world who won? It’s an intangible thing. Then people say, “Well, any one of the nominees besides me could have won this. They’re all wonderful actors.” Not only them, some other actors in the audience who weren’t nominated, some other ones who aren’t even at the show, some other ones who aren’t even known by people have done an amazing job. If you put your heart and soul into something you love, and you’re satisfied with your work, and it works in the thing, there’s the award. I look at it that way. I’m too damn old now to worry about stuff like that. I got enough awards. I’m good. I’m sure the people that I work for or work with me don’t like to hear that. But I guess when I said I’m too damn old, I guess I’m too damn old to not tell the truth.\n\n\tThis interview has been edited and condensed.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Billy Bob Thornton on Arguing With Andy Garcia in ‘Landman’ and Award Shows Snubbing Taylor Sheridan Shows Because They ‘Assume’ He’s a ‘Right-Wing Guy’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/LANDMAN_209_EM_0717_01595_RT_f.png?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-19T00:30:00.000Z",
      "dateModified": "2026-01-19T00:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Hong Kong’s New Con-Con Asian IP Festival to Feature Anime Premieres, J-Pop Acts, Local Creators",
    "url": "https://variety.com/2026/biz/news/con-con-hong-kong-ip-festival-anime-music-1236634210/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Hong-Kong-Con-Con.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-19T02:00:00.000Z",
    "description": "\n\tMedialink Group Limited is launching Con-Con Hong Kong 2026, billed as Asia’s first comprehensive intellectual property extravaganza, set for April ",
    "body": "\n\tMedialink Group Limited is launching Con-Con Hong Kong 2026, billed as Asia’s first comprehensive intellectual property extravaganza, set for April 4-5 at AsiaWorld-Expo.\n\n\tThe inaugural two-day gathering aims to merge IP-focused programming with a large-scale music festival and immersive theatrical experiences, creating what organizers describe as a cross-sector cultural platform. The event will spotlight local Hong Kong creations alongside Japanese and international properties spanning collectibles, anime, music, fashion, art and design.\n\t\n\n\tArtist Coin Parking Delivery will serve as event creative director, bringing experience from collaborations across animation, cosmetics, watches, sports apparel and K-pop to shape the visual identity and on-site experiences.\n\n\n\tThe festival’s musical component features chart-topping J-pop artists, performers known for anime theme songs, and prominent Hong Kong pop acts, though specific talent has not yet been revealed. Programming will include experiential IP zones, world premiere anime screenings, fan meet-and-greets, limited-edition collectibles, industry panel discussions, and dedicated exhibition space for emerging Hong Kong creators.\n\n\tAn immersive black box theater element is designed to facilitate interaction between creators, industry professionals and fans across multiple entertainment sectors including games, lifestyle, sports and food.\n\n\tParent company Medialink Group Limited, headquartered in Hong Kong since 1994, operates across Greater China, Japan and Southeast Asia with a portfolio exceeding 1,000 pop culture and anime properties. The company’s business encompasses content distribution, brand licensing, merchandise rights and location-based entertainment.\n\t\n\n\tMedialink’s digital footprint includes 11 YouTube channels under the Ani-One brand, collectively drawing over 10 million subscribers and 2.4 billion views. The company also operates Asia-focused animation channels Ani-Mi and e-commerce platform Ani-Mall.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Hong Kong’s New Con-Con Asian IP Festival to Feature Anime Premieres, J-Pop Acts, Local Creators",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Hong-Kong-Con-Con.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-19T02:00:00.000Z",
      "dateModified": "2026-01-19T02:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Green Day to Kick Off Super Bowl LX Opening Ceremony",
    "url": "https://variety.com/2026/music/news/green-day-kick-off-super-bowl-lx-opening-ceremony-1236634366/",
    "image": "https://variety.com/wp-content/uploads/2025/02/GREEN_DAY_HIRES-13_Alice-Baxley-AppleMusic.jpg?crop=549px%2C330px%2C5721px%2C3215px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-01-18T23:07:27.000Z",
    "description": "\n\tBay Area natives Green Day will kick off Super Bowl LX’s opening ceremony, the NFL announced on Sunday. It all takes place at Levi’s Stadium in Sant",
    "body": "\n\tBay Area natives Green Day will kick off Super Bowl LX’s opening ceremony, the NFL announced on Sunday. It all takes place at Levi’s Stadium in Santa Clara, Calif., on Sunday, Feb. 8, 2026.\n\n\tAccording to the announcement, the band “will open Super Bowl LX by ushering generations of Super Bowl MVPs onto the field with a dynamic performance of their most iconic rock anthems.”\n\n\t“We are super hyped to open Super Bowl 60 right in our backyard!” said Green Day lead singer Billie Joe Armstrong. “We are honored to welcome the MVPs who’ve shaped the game and open the night for fans all over the world. Let’s have fun! Let’s get loud!”\n\t\n\n\tThe Super Bowl LX opening ceremony will air live at 6 p.m. ET/ 3 p.m. PT on NBC, Telemundo, Peacock and Universo.\n\n\t“Celebrating 60 years of Super Bowl history with Green Day as a hometown band, while honoring the NFL Legends who’ve helped define this sport is an incredibly powerful way to kick off Super Bowl LX.” said Tim Tubito, NFL senior director, event and game presentation. “As we work alongside NBC Sports for this opening ceremony, we look forward to creating a collective celebration for fans in the stadium and around the world.”\n\n\tThe Super Bowl LX opening ceremony will take place ahead of the previously announced pregame entertainment lineup, featuring Charlie Puth, Brandi Carlile and Coco Jones. Puth will perform the national anthem, Carlile will sing “America the Beautiful,” and Jones will deliver “Lift Every Voice and Sing.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Green Day to Kick Off Super Bowl LX Opening Ceremony",
      "image": [
        "https://variety.com/wp-content/uploads/2025/02/GREEN_DAY_HIRES-13_Alice-Baxley-AppleMusic.jpg?crop=549px%2C330px%2C5721px%2C3215px&resize=1000%2C563"
      ],
      "datePublished": "2026-01-18T23:07:27.000Z",
      "dateModified": "2026-01-18T23:07:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ben Affleck ‘Had Food Poisoning’ While Shooting Goodbye Scene With Bruce Willis in ‘Armageddon’",
    "url": "https://variety.com/2026/film/news/ben-affleck-food-poisoning-bruce-willis-armageddon-1236634494/",
    "image": "https://variety.com/wp-content/uploads/2026/01/P101BJGV.jpg?crop=0px%2C0px%2C2000px%2C1125px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-01-19T00:32:19.000Z",
    "description": "\n\tBen Affleck recently told Fox 32 Chicago that he had food poisoning while shooting his emotional goodbye scene with Bruce Willis in the 1998 disaste",
    "body": "\n\tBen Affleck recently told Fox 32 Chicago that he had food poisoning while shooting his emotional goodbye scene with Bruce Willis in the 1998 disaster blockbuster “Armageddon.”\n\n\t“When we shot that scene, I had food poisoning,” Affleck said. “I wasn’t an experienced enough actor at that point to know that you can just pick up the phone and be like, ‘I’m too sick to work today.’ I’m like, ‘I better come in.’ So I went and I was literally, it’s the only time it’s ever happened in my life, vomiting between takes.”\n\t\n\n\tAffleck added with a laugh that his distressed state “probably made the scene better.”\n\n\n\tThe scene in question saw oil man A.J. Frost, played by Affleck, say goodbye to “deep core” oil driller Harry Stamper, played by Willis, as he sacrifices himself to manually detonate a bomb to destroy an asteroid on a collision course with Earth.\n\n\tDirected by Michael Bay, other cast members included Billy Bob Thornton, Ben Affleck, Liv Tyler, Will Patton, Steve Buscemi, William Fichtner, Owen Wilson and Michael Clarke Duncan.\n\n\tAffleck recalled seeing Buscemi at the premiere of his new Netflix film “The Rip,” which he said flooded his mind with memories of the film.\n\n\tHe said, “I actually saw Steve Buscemi last night at the premiere for ‘The Rip,’ and we were reminiscing about that movie and thinking about how that was the weirdest, kind of wonderful, strange, otherworldly movie experience.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ben Affleck ‘Had Food Poisoning’ While Shooting Goodbye Scene With Bruce Willis in ‘Armageddon’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/P101BJGV.jpg?crop=0px%2C0px%2C2000px%2C1125px&resize=1000%2C563"
      ],
      "datePublished": "2026-01-19T00:32:19.000Z",
      "dateModified": "2026-01-19T00:32:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Francois Ozon’s ‘The Stranger’ Tops France’s Lumières Awards as Richard Linklater Wins Best Director With ‘Nouvelle Vague’",
    "url": "https://variety.com/2026/film/global/francois-ozon-stranger-lumieres-awards-richard-linklater-1236634448/",
    "image": "https://variety.com/wp-content/uploads/2025/09/NV2_CL0A8830.jpg?crop=0px%2C5px%2C5467px%2C3078px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-01-18T22:52:35.000Z",
    "description": "\n\tFrancois Ozon‘s “The Stranger,” an adaptation of Albert Camus’ literary masterpiece which world premiered at Venice, topped the 31st Lumières Awards",
    "body": "\n\tFrancois Ozon‘s “The Stranger,” an adaptation of Albert Camus’ literary masterpiece which world premiered at Venice, topped the 31st Lumières Awards, taking best Film, best Actor for Benjamin Voisin, and best cinematography for Manu Dacosse at a ceremony held Sunday at the Institut du Monde Arabe in Paris.\n\n\tIt marks Ozon’s first time winning best film at the Lumière Awards, after prior nominations in 2020 for “By the Grace of God,” and in 2021 for “Summer 85.” Voisin, who stars in “The Stranger” opposite Rebecca Marder, previously won best revelation for his role in “Summer 85.” \n\t\n\n\tAmerican filmmaker Richard Linklater, meanwhile, picked up best director for “Nouvelle Vague,” a black-and-white love letter to the French cinematic movement known as the New Wave. The film, which  opened in competition at Cannes, also earned best male revelation for Guillaume Marbeck. Considered France’s equivalent to the Golden Globes, the Lumières Awards are voted on by international journalists from 36 countries and are handed out during a ceremony that takes place roughly a month before the Cesar Awards and kicks off France’s awards season.French star Léa Drucker won best actress for Dominik Moll’s Yellow Jacket drama “Case 137,” which also opened at Cannes. It was Druker’s first Lumière victory following nominations in 2019 for Xavier Legrand’s “Custody,” and 2024 with Catherine Breillat’s “Last Summer.” \n\n\n\tNadia Melliti, who won best actress at Cannes for her role in Hafsia Herzi’s “The Little Sister” won best female revelation; and another Cannes prizewinner, “The Secret Agent,” by Brazilian filmmaker Kleber Mendonça Filho, picked up best international co-production. The movie just nabbed a pair of Golden Globes — Wagner Moura for best actor and best international film. Screenwriter-director Stéphane Demoustier won best screenplay for “L’Inconnu de la Grande Arche,” his second Lumière after a 2021 win for “La Fille au bracelet.”The awards spread further across the slate with Pauline Loquès’ “Nino,” starring Théodore Pellerin, winning best first film; Ugo Bienvenu’s “Arco” named best animated feature; and Sepideh Farsi’s “Put Your Soul on Your Hand and Walk” taking best documentary. Best original music went to Warren Ellis, Dom La Nena and Rosemary Standley for “Le Chant des forêts,” directed by Vincent Munier.\n\n\tNext up in France’s race will be the Cesar Awards which are scheduled to take place on Feb. 27 at the Olympia in Paris with Jim Carrey set as this year’s honorary Cesar recipient. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Francois Ozon’s ‘The Stranger’ Tops France’s Lumières Awards as Richard Linklater Wins Best Director With ‘Nouvelle Vague’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/09/NV2_CL0A8830.jpg?crop=0px%2C5px%2C5467px%2C3078px&resize=1000%2C563"
      ],
      "datePublished": "2026-01-18T22:52:35.000Z",
      "dateModified": "2026-01-18T22:52:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘A Knight of the Seven Kingdoms’ Cast Guide: Who’s Who in the ‘Game of Thrones’ Prequel?",
    "url": "https://variety.com/lists/knight-of-the-seven-kingdoms-cast-characters/",
    "image": "https://variety.com/wp-content/uploads/2026/01/MixCollage-16-Jan-2026-12-09-PM-2630.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-19T01:30:00.000Z",
    "description": "\n\t\n\t\t\t\n\t\t\t\t\n\t\n\n\t\n\tJan 18, 2026 5:30pm PT\t\n\t\n\n\t\n\t\t‘A Knight of the Seven Kingdoms’ Cast Guide: Who’s Who in the ‘Game of Thrones’ Prequel?\n\t\n\t\n\t\t\t\n\n\n\t\t",
    "body": "\n\t\n\t\t\t\n\t\t\t\t\n\t\n\n\t\n\tJan 18, 2026 5:30pm PT\t\n\t\n\n\t\n\t\t‘A Knight of the Seven Kingdoms’ Cast Guide: Who’s Who in the ‘Game of Thrones’ Prequel?\n\t\n\t\n\t\t\t\n\n\n\t\t\t\n\t\t\t\n\t\n\n\t\t\t\t\t\t\t\t\tHBO\n\t\n\n\t\t\n\t\n\t\t\t\t\n\n\tIt’s time to journey back to Westeros.\n\n\tHBO’s latest “Game of Thrones” prequel spinoff, “A Knight of the Seven Kingdoms,” goes back in time and zeroes in on a lowly hedge knight, Ser Duncan the Tall (Peter Claffey), rather than focus on the grand politics of the Iron Throne. The show is a departure from the serious politics and dragon battles of “Game of Thrones” and “House of the Dragon” and is a more humorous, grounded story of Ser Duncan’s journey through knighthood while at a jousting tourney. He’s also joined by a bald young squire named Egg (Dexter Sol Ansell), who he meets along the way while also running into new Targaryens, Baratheons and more.\n\n\t“A Knight of the Seven Kingdoms” is based on a series of novellas by George R. R. Martin, the author of the “A Song of Ice and Fire” series and creator of the “Game of Thrones” world. The first novella, “The Hedge Knight,” was published in 1998 and introduced readers to Ser Duncan, aka Dunk, and Egg. Martin followed that up with “The Sworn Sword” in 2003 and “The Mystery Knight” in 2010, and he has plans for even more books in the “Dunk and Egg” series (but first he has to finish the final two books in “A Song of Ice and Fire” and the second part of “Fire & Blood,” on which “House of the Dragon” is based).\n\n\tMeet Westeros’ newest characters in “A Knight of the Seven Kingdoms” below.\n\n\n\t\t\t\n\t\t\t\n\tSer Duncan the Tall (Peter Claffey)\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Steffan Hill\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\tYou may remember hearing vague references to the adventures of Ser Duncan the Tall here and there throughout “Game of Thrones,” but when we meet him in “A Knight of the Seven Kingdoms,” he’s still an awkward, lanky guy going by his childhood nickname, Dunk.\n\n\tDunk became Ser Duncan after being knighted by Ser Arlan of Pennytree (Danny Webb), whom he spent years traveling with — and who very few people in Westeros have ever heard of. Since no one witnessed the knighting, Dunk has a hard time getting anyone to take him seriously. Still, he aspires to greatness.\n\n\t\t\n\t\t\t\n\t\t\t\n\tEgg (Dexter Sol Ansell)\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Steffan Hill\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tEgg, an adorable little bald boy, drives Dunk crazy. But he’s also his only friend. Dunk first runs into the child at an inn he sleeps at on his way to a jousting tourney. Egg immediately shows a defiant streak, sassing Dunk when he asks for help with his horse and later making fun of his clothes, truthfully telling Dunk he doesn’t look like a knight. Still, he asks Dunk to take him in as his squire, hopeful to leave the inn and see a bit more of the world. Though Dunk declines, Egg sets out on his own and essentially gives himself the squire job, building a fire and cooking dinner at Dunk’s camp before he returns for the night. And it’s Egg who tells Dunk that he ought to go by Ser Duncan to command more respect. They’re an odd pair, but they’re good for each other.\n\t\t\n\t\t\t\n\t\t\t\n\tSer Arlan of Pennytree (Danny Webb)\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Steffan Hill\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tSer Arlan is an elderly hedge knight who was Dunk’s mentor. After his death in the premiere, Dunk takes Arlan’s sword and heads out to the tourney to become a knight himself.\n\t\t\n\t\t\t\n\t\t\t\n\tRaymun Fossoway (Shaun Thomas)\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Steffan Hill\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tRaymun is the squire and cousin of Ser Steffon Fossoway, a knight at the tourney.\n\t\t\n\t\t\t\n\t\t\t\n\tSteffon Fossoway (Edward Ashley)\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Steffan Hill\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tAshley (“The Lost City of Z,” “The Terror,” “Masters of the Air”) plays Steffon Fossoway. A knight and heir to House Fossoway of Cider Hall during King Daeron II Targaryen’s reign, Ser Steffon was one of the entrants in the tourney at Ashford Meadow, which is a key event in George R.R. Martin’s “The Hedge Knight” story about Ser Duncan and Egg.\n\t\t\n\t\t\t\n\t\t\t\n\tLyonel Baratheon (Daniel Ings)\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Steffan Hill\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tBest known for playing Luke Curran in the Channel 4/Netflix comedy series “Lovesick,” Ing plays Lyonel Baratheon. Nicknamed “Laughing Storm,” Lyonel was the Lord of Storm’s End and the head of House Baratheon during King Aegon V Targaryen’s reign on the Iron Throne. He is a charcter included in George R.R. Martin’s “Dunk and Egg” short story, “The Hedge Knight,” on which the HBO series is based. Ing’s other notable credits include “The Crown,” “Black Mirror,” “Sex Education” and The Gentlemen\n\t\t\n\t\t\t\n\t\t\t\n\tTanselle (Tanzyn Crawford)\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Steffan Hill\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tAustralian actress Crawford (“Tiny Beautiful Things,” “Swift Street”) plays Tanselle. Nicknamed “Tanselle Too-Tall” in George R.R. Martin’s “The Hedge Knight” installment of his “Dunk and Egg” stories, Tanselle was a Dornish puppeteer during the reign of King Daeron II Targaryen.\n\t\t\n\t\t\t\n\t\t\t\n\tAerion Targaryen (Finn Bennett)\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Steffan Hill\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tAerion Targaryen is the second eldest son of Prince Maekar Targaryen (Sam Spruell). He’s a grandson of the king, but he and his brothers aren’t in line for the Iron Throne since Maekar has an older brother, Baelor. Aerion is played by Finn Bennett, best known for HBO’s “True Detective: Night Country,” Netflix’s “Black Doves” and the 2025 film “Warfare.” \n\t\t\n\t\t\t\n\t\t\t\n\tBaelor Targaryen (Bertie Carvel)\n\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\n\n\tBaelor Targaryen is played by Bertie Carvel, whose credits include stage roles including Miss Trunchbull in “Matilda the Musical” and Rupert Murdoch in “Ink” and screen roles like “The Tragedy of Macbeth” (2021) and “The Crown.” Up next, he’ll be seen as Cornelius Fudge in HBO’s “Harry Potter” series.\n\n\tIn “A Knight of the Seven Kingdoms,” Baelor is the eldest son of King Daeron II, making him the crown prince of Westeros.\n\n\t\t\n\t\t\t\n\t\t\t\n\tMaekar Targaryen (Sam Spruell)\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Steffan Hill\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\tKnown for his work in the “Fargo” TV series (2014), “Legend” (2015) and “Small Axe” (2020), Spruell plays Maekar I Targaryen. Appearing in not only George R.R. Martin’s “The Hedge Knight,” the source material for “A Knight of the Seven Kingdoms,” Maekar is referenced through Martin’s main “A Song of Ice and Fire” book series. He was the fourth son of King Daeron II Targaryen and was Prince of Summerhall and an army commander who served in two of the Blackfyre Rebellions.\n\t\t\n\t\n\t\n\n\n\t\n\t\tMore from Variety\n\t\n\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\n\n\t\t\n\n\t\n\t\tMore From Our Brands\n\t\n\t\n\t\t\n\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\n\tRolling Stone\n\n\t\t\t\t\tOne More Saturday Night: Bobby Weir Remembered at San Francisco ‘Homecoming’\t\t\n\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\n\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\n\tRobb Report\n\n\t\t\t\t\tGene Hackman’s 53-Acre New Mexico Estate Just Listed for $6.3 Million\t\t\n\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\n\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\n\tSportico\n\n\t\t\t\t\tTrinidad Chambliss Sues NCAA in Test of Medical Waiver System\t\t\n\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\n\t\t\n\t\n\t\n\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘A Knight of the Seven Kingdoms’ Cast Guide: Who’s Who in the ‘Game of Thrones’ Prequel?",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/MixCollage-16-Jan-2026-12-09-PM-2630.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-19T01:30:00.000Z",
      "dateModified": "2026-01-19T01:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Penn & Teller Cancel Las Vegas Shows After Nasty Injury",
    "url": "https://www.tmz.com/2026/01/18/penn-and-teller-cancel-shows-after-injury/",
    "image": "https://imagez.tmz.com/image/97/16by9/2026/01/18/97b07d9312454f158b222cf1568b074a_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-18T19:29:41.000Z",
    "description": "\n    \n                    \n                          Can't Stand It\n                          Penn & Teller Cancel Shows After Ankle Break\n           ",
    "body": "\n    \n                    \n                          Can't Stand It\n                          Penn & Teller Cancel Shows After Ankle Break\n                      \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Penn & Teller's magic act vanished from Las Vegas this weekend ... Penn Jillette was sidelined due to an ankle injury.\n      \n    \n          Penn took to Facebook to announce the news Saturday, writing, \"We are sorry to have to cancel this weekend's shows. I broke my ankle yesterday and on doctor's orders, I am not able to do the show.\"\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          He added ... \"Thanks so much for understanding and we hope to see you soon.\"\n      \n\n          Of course, the iconic duo has been wowing audiences for 50 years now, performing nearly 300 live shows every year. Their show was called \"The single best show in Vegas\" by the Los Angeles Times, and their hit series \"Penn & Teller: Fool Us!\" -- where up-and-coming magicians try to fool the famous pair -- has been renewed for a 12th season.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          The good news is, tickets are still on sale for this upcoming weekend, suggesting Penn expects a quick recovery.\n      \n    \n          Next week, they're expected in Fort Myers, Florida.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Penn Jillette\n              \n                          \n                Celebrity News\n              \n                          \n                Comedy\n              \n                          \n                Health\n              \n                          \n                Concerts and Tours\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Penn & Teller Cancel Las Vegas Shows After Nasty Injury",
      "image": [
        "https://imagez.tmz.com/image/97/16by9/2026/01/18/97b07d9312454f158b222cf1568b074a_xl.jpg"
      ],
      "datePublished": "2026-01-18T19:29:41.000Z",
      "dateModified": "2026-01-18T19:29:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Emmie Bunni Offers $10.2M For Logan Paul's Rare Pokémon Card",
    "url": "https://www.tmz.com/2026/01/18/emmi-bunnie-offers-10-2m-for-logan-pauls-pokemon-card/",
    "image": "https://imagez.tmz.com/image/ea/16by9/2026/01/18/eaf6034093ba4d44a9d632e7b241098c_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-19T02:41:09.000Z",
    "description": "\n    \n                    \n                          Gotta Bid 'Em All!!!\n                          Emmie Bunni Offers Logan Paul $10.2M For Pokémon C",
    "body": "\n    \n                    \n                          Gotta Bid 'Em All!!!\n                          Emmie Bunni Offers Logan Paul $10.2M For Pokémon Card\n                      \n                  \n                                                                        Published \n                              January 18, 2026\n                            6:41 PM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          OnlyFans star Emmie Bunni apparently made Logan Paul an offer he COULD refuse ... the influencer-turned-pro-wrestler has so far neglected to accept $10.2 million from Emmie for his rare Pokémon card.\n      \n    \n          It might sound crazy, but LP bought the PSA 10 Pikachu Illustrator card in 2022 for more than $5 million, and he apparently believes he can get more than Emmie's generous offer.\n      \n    \n      \n        \n              \n    \n    \n          But he's not wrong ... bidding for the card at Goldin Auctions has already climbed past $6 million and he has weeks before the auction officially closes.\n      \n\n          In a press release, EB explained, \"I offered Logan two times what it is being bid at auction for right now, $10.2 is a LOT for a Pokémon card, but it has true meaning to me, I think it took Logan a minute, but ultimately he did not want to pull from auction.\"\n      \n    \n          She added ... \"The max I will bid is 10.2M, not a penny more.\"\n      \n    \n          Well... good to know she has a strict budget!\n      \n    \n      \n        \n              \n    \n    \n          \"It’s only six months of OnlyFans,\" Emmie said. \"But this card is history. You don’t hesitate when something like this comes up.\"\n      \n    \n          According to Emmie, if she was the lucky winner, she'd give the card to her dad, who got into collecting Pokémon cards in the first place.\n      \n    \n          The card -- graded GEM MT 10 -- is widely considered the rarest and most valuable Pokémon card in existence.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Logan Paul\n              \n                          \n                TV\n              \n                          \n                Reality TV\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Emmie Bunni Offers $10.2M For Logan Paul's Rare Pokémon Card",
      "image": [
        "https://imagez.tmz.com/image/ea/16by9/2026/01/18/eaf6034093ba4d44a9d632e7b241098c_xl.jpg"
      ],
      "datePublished": "2026-01-19T02:41:09.000Z",
      "dateModified": "2026-01-19T02:41:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Guess Who This Former Pro Wrestler Is!",
    "url": "https://www.tmz.com/2026/01/18/guess-who-former-pro-wrestler/",
    "image": "https://imagez.tmz.com/image/cd/16by9/2026/01/12/cd262c4e14c846a3b4dde30577e5c2f9_xl.png",
    "tag": "Entertainment",
    "date": "2026-01-18T20:00:29.000Z",
    "description": "\n    \n                    \n                          Guess Who\n                          This Former Professional Wrestler Is!\n                      \n",
    "body": "\n    \n                    \n                          Guess Who\n                          This Former Professional Wrestler Is!\n                      \n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          Some guys have plenty of confidence in their old friends ... can you guess who this former professional wrestler is?\n      \n    \n          We ran into this dude while he was signing autographs and asked him if he had any advice for his old pal John Cena as he prepared to leave the ring behind ... but he was confident his buddy had a pretty bright future outside of wrestling.\n      \n    \n          And don't worry about him, because he's staying busy, too ... sharing the screen with Jason Momoa doesn't sound like an easy feat, though!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Wrestling\n              \n                          \n                Movies\n              \n                          \n                Guess Who\n              \n                          \n                MMA\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Guess Who This Former Pro Wrestler Is!",
      "image": [
        "https://imagez.tmz.com/image/cd/16by9/2026/01/12/cd262c4e14c846a3b4dde30577e5c2f9_xl.png"
      ],
      "datePublished": "2026-01-18T20:00:29.000Z",
      "dateModified": "2026-01-18T20:00:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Piers Morgan Hospitalized After Fall, Undergoes Hip Replacement",
    "url": "https://www.tmz.com/2026/01/18/piers-morgan-hospitalized-after-fall/",
    "image": "https://imagez.tmz.com/image/c9/16by9/2026/01/18/c9d1153a71f44e3691958444ee0a3d84_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-18T16:00:05.000Z",
    "description": "\n    \n                    \n                          Piers Morgan\n                          Lands in Hospital After Fall ...\n                         ",
    "body": "\n    \n                    \n                          Piers Morgan\n                          Lands in Hospital After Fall ...\n                          Jokingly Blames Trump!!!\n                      \n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Piers Morgan is hospitalized after a painful fall, which landed him with a brand new hip.\n      \n    \n          The broadcaster revealed Sunday he's recovering in a London hospital after tripping at a restaurant, suffering a serious femur fracture that required a hip replacement.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Morgan shared the update on X, posting a photo from his hospital bed and explaining he tripped on a small step while dining out. He joked the New Year was already \"off to a cracking start.\"\n      \n\n          The fall turned out to be far more serious than it sounded. Morgan said the impact fractured his femur so badly, surgeons had no choice but to give him a new hip.\n      \n    \n          Now in recovery, he says he'll be on crutches for six weeks and unable to travel long haul for at least 12 weeks.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Still, Morgan couldn't resist cracking a joke, saying ... \"I blame Donald Trump,\" he wrote, alongside a thumbs up selfie from his hospital bed.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Morgan also shared an image of an X-ray showing the fracture.\n      \n    \n          One wrong step sent Piers to the hospital, but it certainly didn't knock out his sense of humor.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Piers Morgan\n              \n                          \n                Donald Trump\n              \n                          \n                President Trump\n              \n                          \n                Piers Morgan Tonight\n              \n                          \n                Celebrity News\n              \n                          \n                Politix\n              \n                          \n                Health\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Piers Morgan Hospitalized After Fall, Undergoes Hip Replacement",
      "image": [
        "https://imagez.tmz.com/image/c9/16by9/2026/01/18/c9d1153a71f44e3691958444ee0a3d84_xl.jpg"
      ],
      "datePublished": "2026-01-18T16:00:05.000Z",
      "dateModified": "2026-01-18T16:00:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nick Fuentes & Andrew Tate Party to Kanye's Banned 'Heil Hitler'",
    "url": "https://www.tmz.com/2026/01/18/club-issues-apology-for-hosting-nick-fuentes-and-andrew-tate/",
    "image": "https://imagez.tmz.com/image/c7/16by9/2026/01/19/c741f0f59ffc4b51834ea04cc27dcc90_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-19T02:21:37.000Z",
    "description": "\n    \n                    \n                          Racism On Repeat\n                          Nick Fuentes, Andrew Tate Party to 'Heil Hitler'\n     ",
    "body": "\n    \n                    \n                          Racism On Repeat\n                          Nick Fuentes, Andrew Tate Party to 'Heil Hitler'\n                      \n                  \n                                                                        Published \n                              January 18, 2026\n                            6:21 PM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Nick Fuentes, Andrew Tate, Sneako and other professional agitators posted video over the weekend partying to Kanye West's song \"Heil Hitler\" ... and it's about as gross as you'd imagine.\n      \n    \n          Full of proud Nazi salutes and tentative head bobbing, the posse of attention whores pre-gamed in their party bus before heading to a Miami nightclub. Once inside, the \"manosphere\" boys apparently got the DJ to play the banned song for them inside the venue.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          The song has obviously been widely condemned for its use of antisemitic references, and the club, Vendome, later responded, making clear they don't stand with the messaging.\n      \n\n          In a statement released on Instagram, they wrote ... \"We are aware of a video circulating online from one of our venues that includes content and imagery that are deeply offensive and unacceptable.\"\n      \n    \n          They continued ... \"We want to be unequivocally clear: Vendôme and our hospitality group do not condone antisemitism, hate speech, or prejudice of any kind. These values are fundamentally opposed to who we are and the environments we strive to create.\"\n      \n    \n      \n      Club plays HH by Ye while Nick Fuentes, Tate, Sneako, Clavicular, and Myron sing and throw salutes.The culture is changing 💀 pic.twitter.com/0tTTBksZte— 𝐀𝐍𝐓𝐔𝐍𝐄𝐒 (@Antunes1) January 18, 2026\n              @Antunes1\n          \n  \n    \n          \"We are currently conducting an internal review to understand the circumstances surrounding how this requested song came to be played during a bottle parade, and we will take immediate action to hold the responsible parties accountable,\" they said.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Andrew Tate\n              \n                          \n                Kanye West\n              \n                          \n                Celebrity News\n              \n                          \n                Music\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nick Fuentes & Andrew Tate Party to Kanye's Banned 'Heil Hitler'",
      "image": [
        "https://imagez.tmz.com/image/c7/16by9/2026/01/19/c741f0f59ffc4b51834ea04cc27dcc90_xl.jpg"
      ],
      "datePublished": "2026-01-19T02:21:37.000Z",
      "dateModified": "2026-01-19T02:21:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]