[
  {
    "title": "Kate Hudson on the Film She’d Make With Goldie Hawn and Breaking Out of Her Rom-Com Box in ‘Song Sung Blue’: ‘I Didn’t Want to Get Boxed In’",
    "url": "https://variety.com/2025/film/awards/kate-hudson-song-sung-blue-goldie-hawn-rom-com-1236584196/",
    "image": "https://variety.com/wp-content/uploads/2025/11/P102WDWO.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-21T20:00:00.000Z",
    "description": "\n\tKate Hudson’s still got it, and she’s ready to remind you all. But first, she pauses mid-interview to answer a call. \n\n\tIt’s her 14-year-old son, a ",
    "body": "\n\tKate Hudson’s still got it, and she’s ready to remind you all. But first, she pauses mid-interview to answer a call. \n\n\tIt’s her 14-year-old son, a dedicated drummer who’s recently broken two cymbals. “Sweetheart, I’m in the middle of an interview, and I love you so much, but I can’t do this right now,” she says gently. “We’ll get your cymbals, I promise.”\n\n\tIt’s a charming, off-script moment that captures something essential about Hudson: grounded, warm and always playing multiple roles — mother, artist, movie star. And in Craig Brewer’s “Song Sung Blue,” she delivers a performance that feels like the culmination of a life lived in the spotlight and on the sidelines of it.\n\t\n\n\tWhile many are calling the role a comeback, Hudson doesn’t see it that way. “I don’t like reading anything because it makes me anxious,” she admits. \n\n\n\tHudson’s turn as Claire Sardinia — a woman navigating music, love and loss within a Neil Diamond cover band — is raw and revelatory. She breaks her own heart open on screen and sifts through the pieces in front of all of us. It’s a portrayal filled with tenderness and turbulence, and as many have noted, perhaps the finest work of her career.\n\n\t“I knew the movie wouldn’t work if people didn’t believe the love story,” she says of the onscreen romance with Hugh Jackman. “That was my biggest concern going in.”\n\n\tSo, Hudson made sure their chemistry had room to grow. “I told Hugh, ‘I’m super tactile. We need to really get to know each other and find this intimacy.’” Their first bonding experience wasn’t a rehearsal, rather a recording session. “The first thing we did was sing. It came really easy.”\n\t\n\n\tThe film, based on a true story and steeped in Diamond’s extensive catalog, also marked a long-awaited collaboration with Brewer. Hudson had admired the director since “Hustle and Flow.” “We’ve been circling each other for 20 years, waiting for the right thing,” she says. “This was worth the wait.”\n\n\n\n\t\n\n\t\t\t\t\tHugh Jackman as Mike Sardina, Kate Hudson as Claire Sardina, “Song Sung Blue.” (Focus Features / Courtesy Everett Collection)\n\t\t\t\t\t\t\t\t\t©Focus Features/Courtesy Everett Collection\n\t\n\n\n\n\tFor Hudson, whose breakout in “Almost Famous” (2000) earned her an Oscar nomination at 21, “Song Sung Blue” represents a kind of creative homecoming. It breaks free of the romantic-comedy image that dominated much of her early career — even though she’s always worked across genres.\n\n\t“I love doing rom-coms, but after ‘Almost Famous’ and ‘How to Lose a Guy in 10 Days,’ people kind of decided, ‘This is your lane,’” she says. “And every time I wanted to step outside it, it was hard for people to see me in a different light.”\n\n\tShe doesn’t express bitterness. Only clarity. “It’s different for women. When a woman becomes a movie star in a certain genre, it’s harder for people to bet on her somewhere else. More so than it is with men.”\n\n\tThat’s what makes the current moment feel so satisfying — not just to audiences, but to Hudson herself. “I’ve worked really hard,” she says. “But I also feel incredibly lucky. I’ve had a dope life. This movie is different, though. It shows what I’ve always known I could do.”\n\n\tThe movie takes some surprising twists and turns. One particularly wrenching moment in the film made an impression on her stepfather, Kurt Russell. “He was like, ‘No, no, no, no, no’ — out loud. It was audible,” she says, laughing. “It hit him hard.”\n\n\tRussell and Hudson’s mother, Goldie Hawn, came away from the film deeply moved. “It was emotional for them,” she says. “Maybe because they’ve seen how long I’ve waited for a role like this — one that lets me really do what I love.”\n\n\tThe performance — nuanced, aching and full of soul — has re-energized her place in the industry, and as Oscar season builds momentum, Hudson finds herself back in the Oscar conversation.\n\n\t“The little girl in me, it’s a big deal,” she says. “It’s our Stanley Cup. It’s our World Series.”\n\t\n\n\tShe’s savoring the moments, notably the connections and conversations happening around the film. “When you’re in the celebration of the great films of the year, it feels like you’ve done exactly what you’ve wanted to do in your life — creatively.”\n\n\tOn this episode of the Variety Awards Circuit Podcast, Hudson discusses her journey alongside Hugh Jackman in the emotionally resonant film, in addition to her earliest influences, her favorite collaborations and the type of movie she would consider filming with her mother. \n\n\tAlso on this episode, Oscar-winner Brendan Fraser discusses his role in “Rental Family.” Additionally, the Awards Circuit Roundtable takes you inside the Governors Awards, how big “Wicked: For Good” will be, and what’s expected with Thanksgiving around the corner. Listen below!\n\n\n\n\t\n\n\t\t\t\t\tKate Hudson as Claire Sardina,”Song Sung Blue.” (Focus Features / Courtesy Everett Collection)\n\t\t\t\t\t\t\t\t\t©Focus Features/Courtesy Everett Collection\n\t\n\n\n\n\tRead excerpts from her interview below, which has been edited and condensed for clarity.\n\t\n\t\tYou mentioned you’ve wanted to work with Craig Brewer for 20 years. What was it about this project that finally aligned?\t\n\n\tCraig and I have always wanted to work together. I remember watching “Hustle & Flow” and thinking, I have to meet this filmmaker. That was twenty years ago. We met, fell in love creatively, and kept trying to find something that felt right for both of us. Sometimes he’d say, “This isn’t right,” I would. Then this movie came along, and everything finally aligned. Hugh saw me talking about my album on CBS, went to Craig, and suddenly it all made sense. I just said, “Sure.”\n\t\n\t\tWere you scared at all to take on this role?\t\n\n\tNo, I was excited. The only thing I was concerned about was whether Hugh and I would work well together. The movie doesn’t function if you don’t believe the love story. I remember telling him, I’m super tactile — we really need to get to know each other and find this intimacy. I didn’t know him well, and I’d never seen him in a role like this. But the first thing we did was sing together in the recording studio, and it came so easily. We had great conversations, and it just clicked. I love him so much.\n\t\n\t\tThe film features a breakout performance from Ella Anderson. What was it like working with her?\t\n\n\tShe’s incredible. I can’t wait to see what she does. She’s so intelligent and so young, but maybe one of the most well-read people I’ve ever met. That voraciousness informs her work, her choices, and her understanding of character. She’s wonderful and so sweet. My dad saw the movie and immediately clocked it — “That young girl… you see talent like that, it’s so exciting.” He knows what’s up.\n\t\n\n\tThere’s a moment in the film — when she gives the command during the military sequence — that still makes me emotional just thinking about it. This movie will open so many doors for her. Filmmakers will see that performance and want to work with her.\n\t\n\t\tHow much time did you spend with the real-life Claire to prepare for the role?\t\n\n\tCraig really wanted us to create our own versions of these characters and not mimic anyone from the documentary. So I didn’t connect with Claire until we started filming. Once she began visiting set, I got to know her, and it was great — but I’m glad it happened later. It kept me from slipping into caricature. I didn’t have to play someone iconic like Bob Dylan or Linda Ronstadt.\n\n\tI worked with Hugh’s wonderful dialect coach, but I also grew up with an assistant from Wisconsin who worked with me for 27 years. That accent is embedded in me because of her. Her name is Kathy, and she’s a huge part of how I found the voice for this character.\n\t\n\t\tWere you a big Neil Diamond fan before this project?\t\n\n\tI knew the big Neil Diamond songs, but I didn’t realize how prolific he is. His catalog is massive. I was shocked by how many beautiful songs I’d never heard, including “I’ve Been This Way Before,” which I sing toward the end of the movie. It’s gorgeous.\n\n\tCraig had carte blanche with the catalog, and I loved the songs he chose. Sometimes I’d think, Where’s ‘Cracklin’ Rosie”? Where’s “Girl, You’ll Be a Woman Soon”? But the ones in the film were the right ones — and you can only fit so many.\n\t\n\t\tLooking back at “Almost Famous,” do you still remember the morning you got your Oscar nomination?\t\n\n\tWe were in London — I think at the airport. My mom actually found out she was nominated for “Cactus Flower” in Heathrow, too, which is wild. I was in this whirlwind: 21 years old, madly in love with my husband Chris, and suddenly an Oscar nominee. My parents kept me grounded, though. People were saying, You’re going to win, and I kept saying, Stop saying that. And, of course, I didn’t win — but it was an incredible moment.\n\t\n\t\tYou’ve mentioned that having Kurt Russell as your dad and Goldie Hawn as your mom gave you different perspectives on Hollywood. Can you talk about that?\t\n\n\tMy mom won an Oscar; my dad’s never been nominated. It’s crazy. His body of work is extraordinary — and I say that not just because he’s my dad. He might be my favorite actor. He’s such a great storyteller, so thoughtful, and so committed. I’ve learned so much from him, and he still loves what he does.\n\t\n\n\tWatching the movie with them was emotional. They both had strong reactions. The story is inspiring, and it reminds you why you love movies. It has that nostalgic, old-school Touchstone feel. For them, I think it was personally emotional to see me doing the things they know I love. But it must have been intense too — seeing me go through everything the character goes through.\n\t\n\t\tWho were the actresses that inspired you growing up?\t\n\n\tAnn-Margret was huge for me, but I especially loved Jodie Foster. People sometimes say that’s surprising, but why? She was engaging, unique, and intelligent. I remember being captivated by her as a young girl because she wasn’t like anyone else. Her choices were always so smart. I’ve always admired her, both as an actress and a director.\n\t\n\t\tHas it been frustrating throughout your career that you haven’t always gotten roles like this one?\t\n\n\tI’m not calculated. Honestly, I’m just so grateful for the life and career I’ve had. I work incredibly hard, but I also love my life, and I feel lucky. So any frustration is always balanced against that.\n\n\tBut yes — the business can box you in. After “Almost Famous” and “How to Lose a Guy,” everyone wanted me in rom-coms. I love doing them, but that lane wasn’t the only thing I wanted. Every time I’d try to pivot, people still saw me a certain way. You don’t enter this business thinking, I can’t wait to be boxed in. But that’s what happens, and everyone experiences it from their own angle.\n\t\n\t\tDo you think there’s a gender disparity in how Hollywood allows actors to move between genres?\t\n\n\tI do. When a woman becomes a big movie star in a certain genre, it’s harder for people to bet on her in something different. Opportunities skew toward men getting those genre leaps. I don’t think it’s intentional — it’s just how the industry has operated.\n\n\tWomen are also expected to sell movies in a way men aren’t. They want to see what we’re wearing, what carpet we’re on, what shows we’re doing. Women do far more of that. And yet, if we have two movies that don’t hit, the consequences feel bigger. It’s harsh, but it’s also the business. You just hope to keep doing good work and be invited to do more.\n\t\n\t\tWhat does being in the awards conversation mean to you this time around?\t\n\n\tThe little girl in me thinks it’s a big deal. It’s our Stanley Cup — our World Series. But more than that, being in the conversation means you’ve done what you set out to do creatively. It’s so hard to make a movie that people carry with them. I’ve been lucky — from “Almost Famous” to “How to Lose a Guy” to “Bride Wars,” people still come up to me about those films, and that’s wonderful.\n\t\n\n\tThis kind of recognition is the ultimate. Some movies are meant to be big hits; some are meant to move people. That was our intention here. Seeing how audiences respond — seeing their faces — is everything. Filmmaking is deeply collaborative, and when you feel the collective effort reflected back at you, it’s an amazing thing.\n\t\n\t\tWould you like to do a movie with your mom? Is so, which one?\t\n\n\tI would love to, but it has to be the right project. Nothing so far has felt right. People have tried, but the material hasn’t fit. I’d love something in the spirit of “Postcards From the Edge,” but that kind of role hasn’t been presented to us. We’d probably have to create it ourselves.\n\n\tVariety’s “Awards Circuit” podcast, hosted by Clayton Davis, Jazz Tangcay, Emily Longeretta, Jenelle Riley and Michael Schneider, who also produces, is your one-stop source for lively conversations about the best in film and television. Each episode, “Awards Circuit” features interviews with top film and TV talent and creatives, discussions and debates about awards races and industry headlines, and much more. Subscribe via Apple Podcasts, Stitcher, Spotify or anywhere you download podcasts.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kate Hudson on the Film She’d Make With Goldie Hawn and Breaking Out of Her Rom-Com Box in ‘Song Sung Blue’: ‘I Didn’t Want to Get Boxed In’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/P102WDWO.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-21T20:00:00.000Z",
      "dateModified": "2025-11-21T20:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Best Smart Home Automation Tech Gifts to Buy Online in 2025",
    "url": "https://variety.com/2025/shopping/news/smart-home-automation-gift-guide-buy-online-1236588263/",
    "image": "https://variety.com/wp-content/uploads/2025/11/Google-Nest-Hub-VR-Featured.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-21T19:31:56.000Z",
    "description": "\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.\n\n\tA modern ",
    "body": "\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.\n\n\tA modern smart home calls for modern smart home automation tech. These items make sure everything is running smoothly, so free time can be spent doing something more fulfilling than worrying about household temperatures, flipping on the lights or even answering the front door.\n\n\tWe rounded up the best home automation gifts for the holiday season to give the gift of free time and carefree living. From Google to Blink and Ring and TP-Link, these products aren’t just trendy, but they’re also practical, exciting and transformative.\n\n\n\tWhether you’re shopping for a gadget obsessive or a productivity finder, the right tech gift can strike the perfect balance between function, fun and just flat out cool. Scroll down and check out the best smart home automation tech to gift in 2025 below:\n\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\t\t\t\tGoogle\n\t\n\t\t\t\t\t\n\n\tArmed with a 7-inch HD screen, the Google Nest Hub smart display, which goes for $99.99 at Best Buy, is a hub that centralizes your smart home devices. It’s ideal to place in a kitchen or living room to quickly get up-to-information, like weather, sports scores and news, just by asking Google’s voice assistant. It comes with a front-facing Nest camera that lets you keep in touch with family and friends with free Google Meet video calling, while the hub doubles as a security cam.\n\n\t\t\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\t\t\t\tBlink\n\t\n\t\t\t\t\t\n\t\t\n\n\t\t\t\t\tBlink Outdoor 4 Wireless Smart Security Camera\t\t\n\n\t\n\t\t5-pack\t\n\t\t\n\t\n\n\tOn sale for $119.99 (reg. $299.99) for a 5-pack at Best Buy, the Blink Outdoor 4 Wireless Smart Security Camera is a battery-powered camera that keeps an eye on your home and property day and night. The camera captures video with an infrared night mode and two-way microphone system. At $199.99 for a 5-pack, this deal breaks down to $23.99 each.\n\n\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\t\t\t\tRing\n\t\n\t\t\t\t\t\n\n\tNow half off at Best Buy, the Ring Video Doorbell isn’t a regular doorbell at all. It’s a smart doorbell that can provide you with a 24/7 video stream and a nice wide field of view. The device syncs to your smartphone, tablet, laptop or streaming device, so you can always keep an eye on your home — even if you’re not there.\n\n\t\t\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\t\t\t\tGoogle\n\t\n\t\t\t\t\t\n\t\t\n\n\t\t\t\t\tGoogle Nest WiFi Pro 6e\t\t\n\n\t\n\t\t3-pack\t\n\t\t\n\t\n\n\tA 3-pack of the Google Nest WiFi Pro 6e mesh router goes for $279.99 (reg. $399.99), a 30% savings. This breaks down to $93.99 each. These routers covers a wider portion of your home than traditional routers, while they keep internet speeds stable, strong and long-lasting. A mesh router setup in a large home is ideal for streaming 4K on multiple devices at the same time, which is key for smart home automation.\n\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\t\t\t\tGoogle\n\t\n\t\t\t\t\t\n\n\tFor Google users, the Google Nest Learning Thermostat — which is on sale for $229.99 (reg. $279.99) at Best But — is ideal, especially with the Google Home app. After installation and setup, control home temperatures and comfort level from a mobile device.\n\n\t\t\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\t\t\t\tTP-Link\n\t\n\t\t\t\t\t\n\t\t\n\n\t\t\t\t\tTP-Link Tapo Smart WiFi Plug Mini\t\t\n\n\t\n\t\t3-pack\t\n\t\t\n\t\n\n\tOn sale for $21.99 (reg. $49.99) for a 3-pack at Best Buy, the TP-Link Tapo Smart WiFi Plug Mini transforms any “dumb” appliance, lamp or TV into a smart home device. In fact, anything plugged into it can be smart with Apple Home, Amazon Alexa, Google Assistant and Samsung SmartThings compatibility. At $21.99, this goes for just $7.33 apiece.\n\n\tAnd since these smart home automation tech products are from Best Buy, you’ll get anyone of them shipped to you for free for My Best Buy members. If you’re not a member, you can sign up for free to take advantage of everything the retailer’s rewards program has to offer with perks such as free standard shipping. Learn more about My Best Buy here.\n\n\tWant more? You can find even more smart home automation tech gear at Best Buy, below:\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Best Smart Home Automation Tech Gifts to Buy Online in 2025",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/Google-Nest-Hub-VR-Featured.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-21T19:31:56.000Z",
      "dateModified": "2025-11-21T19:31:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sofia Vergara Joins Cast of Dark Comedy ‘Thumb’ (EXCLUSIVE)",
    "url": "https://variety.com/2025/film/news/sofia-vergara-thumb-milly-alcock-awkwafina-kate-mckinnon-1236588528/",
    "image": "https://variety.com/wp-content/uploads/2025/11/Sofia-Vergara.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-21T19:54:27.000Z",
    "description": "\n\tSofia Vergara has joined the cast of “Thumb,” a dark comedy from director Daina Oniunas-Pusić. The Emmy and Golden Globe-nominated actress is part o",
    "body": "\n\tSofia Vergara has joined the cast of “Thumb,” a dark comedy from director Daina Oniunas-Pusić. The Emmy and Golden Globe-nominated actress is part of an ensemble that includes such previously announced cast members as Milly Alcock, Awkwafina and Kate McKinnon. \n\n\tVergara is best known for her breakout role as Gloria, the second wife of a wealthy businessman, in “Modern Family.” She also was in the voice cast of “Despicable Me 4” and most recently starred as a drug lord in the Netflix crime drama “Griselda,” which she also executive produced. Vergara earned Emmy and Golden Globe nominations for “Griselda” and was an Emmy nominee for “Modern Family.” Her film credits include “Hot Pursuit,” “The Smurfs,” “Koati,” “The Emoji Movie,” “Chasing Papi” and “Chef.”\n\t\n\n\tPrincipal photography on “Thumb” began last week in New York. Written by Cesar Vitale, the film is about a lonely young woman (Alcock) who mistakenly receives a severed thumb in the mail. According to the official plot description, “she makes it her life’s obsession to return it to the hand it once belonged to, putting her on a collision course that will upend her world forever.” No word yet on what Vergara’s role will be in the picture.\n\n\n\tAkiva Goldsman and Greg Lessans are producing “Thumb” for Weed Road Pictures, and Richard Saperstein, Brooke Saperstein, Beau Turpin, and Annie Saperstein for Bluestone Entertainment alongside Jack Heller under his Assemble Media banner. CAA Media Finance is handling domestic sales.\n\n\tExecutive producers include Frank Mayor, Terrol Cummins, Arvind Gopwani, Harrison Moore, Caitlin de Lisser-Ellen, Darren Goldberg and Thomas Whelan.\n\t\n\n\tBluestone Entertainment and Weed Road Pictures are also developing “Basketful of Heads,” a darkly comedic horror comic series published by DC’s Hill House, with Natasha Lyonne attached to star. Ana Lily Amirpour will adapt and direct the feature.\n\n\tVergara is represented by CAA, Latin World Entertainment and Matthew Johnson at Johnson Shapiro Slewett & Kole.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sofia Vergara Joins Cast of Dark Comedy ‘Thumb’ (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/Sofia-Vergara.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-21T19:54:27.000Z",
      "dateModified": "2025-11-21T19:54:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cher, Lindsay Lohan and Marilyn Monroe to Be Featured in Journalist Scott Huver’s Second ‘Beverly Hills Noir’ True-Crime Book (EXCLUSIVE)",
    "url": "https://variety.com/2025/biz/columns/cher-lindsay-lohan-scott-huver-beverly-hills-noir-true-crime-book-1236588494/",
    "image": "https://variety.com/wp-content/uploads/2025/11/Author-Photo-1-Scott-Huver-author-photo-Lindsey-Foard58.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-21T19:41:23.000Z",
    "description": "\n\tVeteran entertainment journalist Scott Huver has signed a deal for a second installment of his Los Angeles crime anthology book series.\n\n\t“Beverly H",
    "body": "\n\tVeteran entertainment journalist Scott Huver has signed a deal for a second installment of his Los Angeles crime anthology book series.\n\n\t“Beverly Hills Noir Vol. II: Murder, Money & Mayhem in 90210” will chronicle true-crime stories that feature some of the most famous names among the rich and famous, including Charlie Chaplin, Marilyn Monroe, Harpo Marx, Greta Garbo, J. Paul Getty, Joan Crawford, Lena Horne, Johnny Carson, Zsa Zsa Gabor, George Michael, Lindsay Lohan, Cher and more.\n\t\n\n\tThe book will be published in 2027 by Post Hill Press and distributed by Simon & Schuster. The first volume, “Beverly Hills Noir: Crime, Sin & Scandal in 90210,” was released in 2024 and featured Winona Ryder’s infamous shoplifting at a luxury department store and Alfred Hitchcock’s arrest, among others.\n\n\n\t“Beverly Hills has provided a wealth — pun intended — of true stories revealing the dark side of that luxurious, sun-soaked dreamscape known around the world,” Huver said in a statement. “I’m thrilled to take the opportunity to crack open the case files again and dive deep into some stories you only think you know, and even more that you’ve never heard of before.”\n\n\tHuver has covered the inner workings of Beverly Hills, the entertainment industry and Los Angeles for three decades. He began as a police and crime reporter for local newspaper The Beverly Hills Courier and co-authored the book “Inside Rodeo Drive: The Stores, the Stars, the Story.” He has written and reported for numerous outlets, including Variety, People, CNN, InStyle, TV Guide, Vulture, The Hollywood Reporter, Deadline, Los Angeles Magazine, Gold Derby and more.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cher, Lindsay Lohan and Marilyn Monroe to Be Featured in Journalist Scott Huver’s Second ‘Beverly Hills Noir’ True-Crime Book (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/Author-Photo-1-Scott-Huver-author-photo-Lindsey-Foard58.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-21T19:41:23.000Z",
      "dateModified": "2025-11-21T19:41:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Memory of a Killer’ Trailer: Patrick Dempsey Stars as Hitman With Alzheimer’s in First Look at Fox Drama",
    "url": "https://variety.com/2025/tv/news/memory-of-a-killer-trailer-patrick-dempsey-fox-1236588469/",
    "image": "https://variety.com/wp-content/uploads/2025/11/download-1.png?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-21T19:00:00.000Z",
    "description": "\n\tThe first trailer for Fox’s “Memory of A Killer” starring Patrick Dempsey and Michael Imperoli has been released. The series will premiere this Janu",
    "body": "\n\tThe first trailer for Fox’s “Memory of A Killer” starring Patrick Dempsey and Michael Imperoli has been released. The series will premiere this January. \n\n\tThe series follows Angelo Doyle (Patrick Dempsey), a hitman who is losing his memory. As Angelo begins to lose his memory as a result of early onset Alzheimer’s, he slowly begins to regain his conscience. With his friend Dutch (Imperioli) who works as a chef at a restaurant as a front for a criminal enterprise, the two must team up to help save Angelo’s family from danger. \n\t\n\n\tThe series description reads “Angelo is exceptionally resourceful and talented, the best of the best. But he’s about to be tested like never before — and now every minute counts. This is only made more difficult when he discovers that his wife’s recent death may not have been an accident. So, when someone comes after his daughter — who is pregnant — it’s clear the wall between his lives has been breached. Now Angelo must hunt down his mortal enemy while continuing to carry out hits without giving away his diagnosis and still making it home in time to cook dinner for his daughter.”\n\n\n\t“Memory of a Killer” stars Richard Harmon as Joe, a hitman, Odeya Rush as Maria, Angelo’s daughter, Daniel David Stewart as Jeff, Maria’s husband, Peter Gadiot as Dave, a local police detective alongside Gina Torres as Special Agent Linda Grant.\n\n\t“Memory of a Killer” is produced by Warner Bros. Television and FOX Entertainment. Executive producers include Dempsey, Aaron Zelman, Glenn Kessler, Ed Whitmore, Tracey Malone, Cathy Schulman, David Schulner with Arthur Sarkissian and Martin Campbell Peter Bouckaert of Eyeworks serves as an executive producer. \n\t\n\n\tWatch the trailer for “Memory of a Killer” below:\n\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Memory of a Killer’ Trailer: Patrick Dempsey Stars as Hitman With Alzheimer’s in First Look at Fox Drama",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/download-1.png?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-21T19:00:00.000Z",
      "dateModified": "2025-11-21T19:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Hilary Duff Announces New Album ‘Luck…or Something’",
    "url": "https://variety.com/2025/music/news/hilary-duff-announces-sixth-album-luck-or-something-1236587499/",
    "image": "https://variety.com/wp-content/uploads/2025/11/DIGITAL_hd_luck_or_something_final-e1763685458487.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-21T18:05:00.000Z",
    "description": "\n\tHilary Duff has announced that her sixth album “Luck…or Something” will be released on Feb. 20 via Atlantic Records.\n\n\tThe singer has been teeing up",
    "body": "\n\tHilary Duff has announced that her sixth album “Luck…or Something” will be released on Feb. 20 via Atlantic Records.\n\n\tThe singer has been teeing up her first record in a decade over the past few months, releasing the project’s first single “Mature” in early November.\n\n\t“I am often asked how I still have my head on straight after growing up in this industry,” said Duff in a statement. “The album title is my way of answering that question. It’s luck, but there’s also a lot of weight in the ‘…or something’. Many of the things I’ve been through along the way are held there, and I feel like ultimately that’s what’s shaped me.”\n\t\n\n\tIn early September, Duff announced that she had signed with Atlantic and was prepping a docuseries about her return to music. The series is set to be directed and executive-produced by Sam Wrench, who previously helmed “A Nonsense Christmas With Sabrina Carpenter” and “Taylor Swift: The Eras Tour,” through Next of Kin Content. The docuseries will embrace “the ups, downs and everything in between,” and promises that “fans will ride shotgun as she balances raising a family, recording new music, live show rehearsals, and preparing to perform on stage for the first time in over a decade.”\n\n\tDuff’s first official foray back into music was with “Mature,” which Duff co-wrote with her husband Matthew Koma and Madison Love. She followed the song’s release with the announcement of her “Small Rooms, Big Nerves” mini-tour that kicks off in London on Jan. 19 before heading to Toronto (Jan. 24) and Brooklyn (Jan. 27). She’ll conclude the trek just weeks before the album’s release at Los Angeles’ Wiltern on Jan. 29.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Hilary Duff Announces New Album ‘Luck…or Something’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/DIGITAL_hd_luck_or_something_final-e1763685458487.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-21T18:05:00.000Z",
      "dateModified": "2025-11-21T18:05:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "I Watched Those Eight Unreleased Episodes of ‘Joey,’ Despite Never Watching ‘Friends’ — and They’re Terrible",
    "url": "https://variety.com/2025/tv/columns/friends-spinoff-joey-unaired-episodes-review-1236587261/",
    "image": "https://variety.com/wp-content/uploads/2025/11/l-intro-1763590854.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-21T19:21:47.000Z",
    "description": "\n\tI have never seen an episode of “Friends.” I realize this is a borderline blasphemous thing to admit, especially for a TV critic. Obviously, the ico",
    "body": "\n\tI have never seen an episode of “Friends.” I realize this is a borderline blasphemous thing to admit, especially for a TV critic. Obviously, the iconic NBC sitcom is such a cultural juggernaut that I know all the main characters, the love triangles and the show’s beats. For example, I’ve been told Ross (David Schwimmer) and Rachel (Jennifer Aniston) end up together; Cole Sprouse played Ross’s son, Ben; and there was a major debate over relationship “breaks” and cheating. \n\t\n\n\tStill, I’ve gone out of my way to ignore “Friends.” I’ve fled the room if it was playing on the TV or quickly changed the channel if I came across a rerun. But with the news that the final eight unaired episodes of “Joey,” the beloved show’s short-lived spinoff, are now available to stream on the “Friends” YouTube channel, I have taken my first-ever dive into the “Friends” universe — by binge-watching those lost “Joey” episodes.  \n\n\n\tTwenty years too late and with zero context, I began my foray into “Joey” with Season 2, Episode 15 (“Joey and the Dad”), the first of the unaired eight. I was able to get up to speed quickly. After leaving the Big Apple and settling on the West Coast, Joey has done well in Los Angeles and gained some decent traction in his acting career. He’s closer to his family, which includes his brash older sister Gina (Drea de Matteo) and his nerdy adult nephew, Michael (Paulo Costanzo). \n\n\tAnd for the purpose of this episode, we see that Joey has also continued his womanizing ways. In “Joey and the Dad,” he has a hot date with Carmen Electra (who plays herself), but he’s jealous of her sexy, attention-grabbing billboard. I was delighted to see Jennifer Coolidge appear in the first scene as Joey’s ditzy, absurd agent, Bobbie. Unfortunately, she’s criminally underutilized in the episodes I saw, so I often forgot about the character until she appeared again. \n\t\n\n\tFrom what I know about “Friends,” Joey was a ladies’ man who did his best work as a likable sidekick to the other five. After screening these concluding episodes of “Joey,” it seems he should have remained right where he was. LeBlanc is affable in his role, but he’s surrounded by dull characters all trying their best to wrangle a script riddled with misogyny and stale plot points – alarming even for the early 2000s. \n\n\tThe two hours and forty minutes of the sitcom that I screened were bursting with horrendous one-liners. At one point, Gina’s fiancé Jimmy (Adam Goldberg)”jokingly” calls her a bitch and says he’ll kill her. In another episode, Gina screams at Michael’s Indian roommate for speaking Hindi in his own home. It was like a bizarre “Twilight Zone” (though perhaps accurate to today’s America).\n\n\tIn Season 2, Episode 16, “Joey and the Party for Alex,” Joey realizes that he has a crush on his friend/landlord Alex (Andrea Anders), which leads him to ruin her 30th birthday party. After that and for the remainder of the series, he tries to convince her that he’s finally ready for an honest, long-term, committed relationship — despite his rather sordid romantic past. \n\n\tThe final episodes are par for the course. Gina and Jimmy yell at each other, though they do eventually get married in the series finale, “Joey and the Wedding.” Michael learns that Jimmy is his biological father. Yet, he fails to find a real friend group or love interest of his own. And finally, Joey and Alex do become a couple, but given Joey’s track record in the episodes I watched, I doubt they would have made it past a third season. The ending, it seems, was as unceremonious as the other unaired episodes, making “Joey” another spinoff that should’ve remained an idea. But that’s just my opinion, as someone who has actively avoided “Friends” with a determined and steadfast vigor for the past three decades. \n\n\tSo, why have I, a 30-something-year-old Black woman from the South Side of Chicago who has lived in New York City half my life, steered clear of Phoebe, Rachel, Monica and the rest? Honestly, I found “Friends” to be highly unrelatable. I grew up watching “Living Single” and “Moesha,” so nothing concerning “Friends” ever seemed appealing or groundbreaking to me. I had already seen all of these themes and tropes, but with characters who actually looked like me, boasting a cultural familiarity I could touch. Those Manhattan-dwelling friends and their beloved Central Perk always seemed generic and uninspiring, unable to pull me in the way similar shows like “Will & Grace” or “Sex and the City” did. It was the same reason I stopped watching “Girls” after Season 1 in my early 20s; nothing about it rang authentic or felt relatable to my personal experiences. \n\t\n\n\t“Friends” may offer a lot more than “Joey,” but I’ll likely never know. I do know that the LA-based series was yanked off the air before its entire Season 2 had aired due to plummeting ratings. From what I just watched, the NBC executives at the time made the right choice.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "I Watched Those Eight Unreleased Episodes of ‘Joey,’ Despite Never Watching ‘Friends’ — and They’re Terrible",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/l-intro-1763590854.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-21T19:21:47.000Z",
      "dateModified": "2025-11-21T19:21:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kristen Bell, Brian Cox and More Surprised to Find Out They Are Starring in Fox News Audio ‘Life of Jesus’ Resurrected Podcast",
    "url": "https://variety.com/2025/digital/news/kristen-bell-brian-cox-fox-news-life-of-jesus-podcast-1236588322/",
    "image": "https://variety.com/wp-content/uploads/2025/11/Kristen-Bell-Brian-Cox.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-21T18:47:57.000Z",
    "description": "\n\tActors who many years ago lent their voices to an audiobook about the life of Jesus Christ were caught off guard when they found out this week that ",
    "body": "\n\tActors who many years ago lent their voices to an audiobook about the life of Jesus Christ were caught off guard when they found out this week that it has been picked up by Fox News Audio, converted into a massive, 52-episode podcast series for release this holiday season.\n\n\tReps for Kristen Bell, who portrayed Mary Magdalene in the original audiobook, told Rolling Stone that she had no knowledge of the Fox News deal for the “Life of Jesus Podcast,” which was announced Wednesday. \n\t\n\n\tSimilarly, Brian Cox — the “voice of God” in the audiobook epic — wasn’t aware of the forthcoming Fox News Audio podcast, according to a rep for the actor. “Brian recorded audio for a project over a decade ago,” the spokesman said. “He was unaware that the audio would be repurposed for a new podcast series in 2025.”\n\n\n\tAlso surprised about the Fox News pickup of the project was Malcolm McDowell, who provides the voice of the high priest Caiaphas, according to his manager, Chris Roe.\n\n\t“This project was recorded and released 15 years ago as an audiobook,” Roe told Variety. “We were unaware that it was being turned into a podcast until this week. We found out about it when everyone else did. We were never consulted, nothing was renegotiated, and we would not have approved.”\n\n\tBut Fox News says the company’s licensing deal involves a project that the actors had signed off on. A Fox News Media spokesperson said in a statement: “Gulfstream Studios produced the ‘Life of Jesus Podcast’ from The Truth and Life Dramatized Audio Bible, which was licensed by FOX News Audio, with full cooperation and participation by all the actors involved.”\n\t\n\n\tIn other words, while some of the actors may be surprised that Fox News is distributing a version of the audio project they participated in more than a decade ago, the original deals they signed for the audiobook allow for the show to be licensed in this way, according to Fox News Media.\n\n\tThe “Life of Jesus Podcast” is a serialized version of “The Truth and Life Dramatized Audio Bible: New Testament,” first released in 2010 by Ignatius Press, which weighs in at a whopping 21-hour runtime.\n\n\tVariety has reached out to reps for Bell, Neal McDonough (who voices Jesus) and Sean Astin (Matthew) for additional comment, as well as Gulfstream Studios.\n\n\tFox News Audio’s “The Life of Jesus Podcast,” which premieres Sunday, Nov. 30, is the latest addition to Fox Faith, the media company’s religion vertical. The podcast will be available in audio format on Spotify, Apple Podcasts, Amazon Music, Fox News’ podcast website and other major platforms.\n\n\tIn the podcast, “Fox & Friends” co-host Ainsley Earhardt will introduce each 30-minute episode, “guiding listeners through the life, teachings and miracles of Jesus Christ.” In all, “The Life of Jesus Podcast” features more than 100 actors voicing characters from the Bible, which in addition to those already cited include John Rhys-Davies (narrator), Julia Ormond (Mary Mother of God), Blair Underwood (Mark), Stacy Keach (John), Hill Harper (Angel of the Lord) and Michael York (Luke).\n\n\tThe release schedule for “The Life of Jesus Podcast” is as follows: Nov. 30: first 13 episodes debut to mark the start of Advent; Dec. 21: 13 additional episodes releasing during Christmas week; Feb. 15, 2026: third installment of 13 episodes arrive for Lent; March 29: final 13 episodes premiere on Palm Sunday.\n\n\tListen to the trailer for “The Life of Jesus”:\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kristen Bell, Brian Cox and More Surprised to Find Out They Are Starring in Fox News Audio ‘Life of Jesus’ Resurrected Podcast",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/Kristen-Bell-Brian-Cox.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-21T18:47:57.000Z",
      "dateModified": "2025-11-21T18:47:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "LISTEN: UTA’s Blair Kohan and Jason Heyman Have a Deep Conversation About the Business of Comedy: ‘If You Don’t Build It, They Won’t Come’",
    "url": "https://variety.com/2025/biz/news/uta-blair-kohan-jason-heyman-comedy-strictly-business-1236587920/",
    "image": "https://variety.com/wp-content/uploads/2025/11/11052025-BLAIRK-JASONH0209-1-copy-e1763715942474.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-21T18:27:22.000Z",
    "description": "\n\tThe work of being a comedian and fielding comedy projects hasn’t been the same since the pandemic — in good and not-so-good ways. \n\n\tThat’s one of m",
    "body": "\n\tThe work of being a comedian and fielding comedy projects hasn’t been the same since the pandemic — in good and not-so-good ways. \n\n\tThat’s one of many takeaways from a deep conversation about the business of comedy with Blair Kohan and Jason Heyman, UTA board members and partners, featured on the latest episode of Variety‘s “Strictly Business” podcast. Kohan and Heyman are longtime colleagues who have been in the trenches together and know each other’s rhythms and strengths, like any good buddy act. \n\t\n\n\tThe two address head on the challenges that traditional adult comedies have faced in recent years at the box office, and the fact that sitcoms are few and far between on network television these days. And yet, the pair emphasize, there’s more talent bursting from all corners and more avenues for expressing comedy than ever before. \n\n\n\t“I think people want to laugh in community. I think what’s driving this live experience [boom] is being together in a room and laughing together,” Kohan says. “When we talk about all these great movies, these great comedies of the last 25-50 years, it was going to the theater and laughing in community. And I think we are missing that.”\n\n\tHeyman sees opportunity in the disruption around the network TV system that was once crucial for building the careers of comedy stars. \n\n\t“Can a ‘Modern Family’ exist again? Can an ‘Everybody Loves Raymond’ exist? It’s a really good question,” Heyman asks. “The good side of it is that schedule, that routine that we all grew up with  — pilot season and upfronts and fall schedule and all of that — that’s all gone. So you have a little more flexibility and the talent can go off to do other things, come back when they feel creatively inspired,” Hayman says.\n\t\n\n\tKohan notes that stars that emerge out of social media platforms can often have more control over their material when they do work with mainstream Hollywood, citing Rachel Sennott and her new HBO series “I Love L.A.” as an example. Kohan calls it a “reverse-incubation” effect.\n\n\t“We always talk about the heyday of Comedy Central and Funny or Die and those incubators. ‘SNL,’ which is still there and still incubating, identifying, discovering. We miss those days because that’s where we were able to launch talent. It’s where we discovered talent,” she says. “With social media, we have comedians like Matt Rife. Nate Bargatze Leanne Morgan, Ali Wong, who are developing their audience directly, and so we have this reverse-incubation thing where the Netflixes and the Amazons and HBOs attach to them after they’ve already created this platform for themselves. So they have a little bit more control and understanding about what their audience is looking for. The loss of Comedy Central and, Funny or Die has been replaced by, Instagram, YouTube and TikTok.”\n\n\tHeyman, who has had a long association with Will Ferrell and other multihyphenate comedians, says the low volume of comedy movies reaching the theatrical box office situation is concerning.\n\n\t“If you don’t build it, they won’t come. So at a certain point, someone has to take the shot,” Heyman says. “Because if you don’t build it, I can guarantee you they won’t come. People largely now don’t even think about going to the theater to see an R-rated comedy. If you’re a 20-year-old kid going out with your buddies, It’s not something you even consider doing.”\n\n\t(Pictured: Blair Kohan and Jason Heyman outside UTA’s headquarters in Beverly Hills)\n\n\t“Strictly Business” is Variety’s weekly podcast featuring conversations with industry leaders about the business of media and entertainment. (Please click here to subscribe to our free newsletter.) New episodes debut every Wednesday and can be downloaded at Apple Podcasts, iHeartMedia, Amazon Music, Spotify and more.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "LISTEN: UTA’s Blair Kohan and Jason Heyman Have a Deep Conversation About the Business of Comedy: ‘If You Don’t Build It, They Won’t Come’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/11052025-BLAIRK-JASONH0209-1-copy-e1763715942474.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-21T18:27:22.000Z",
      "dateModified": "2025-11-21T18:27:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Eddie Murphy to Be Honored With AFI Life Achievement Award",
    "url": "https://variety.com/2025/film/news/eddie-murphy-afi-life-achievement-award-1236588386/",
    "image": "https://variety.com/wp-content/uploads/2025/01/20190621-Netflix-Seliger-EM_01-Grey-Seamless_0050rv5_lo-e1763751314585.jpg?crop=0px%2C284px%2C8320px%2C4680px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-11-21T19:00:00.000Z",
    "description": "\n\tEddie Murphy has been selected to receive the 51st AFI Life Achievement Award. The American Film Institute will honor him at a gala tribute at the D",
    "body": "\n\tEddie Murphy has been selected to receive the 51st AFI Life Achievement Award. The American Film Institute will honor him at a gala tribute at the Dolby Theater in Hollywood on April 18.\n\n\tConsidered the highest honor for a career in film, the AFI Life Achievement Award is given to a single honoree each year, recognizing talent that has furthered the cinematic arts, demonstrated longevity and been acknowledged by scholars, critics, peers and audiences alike.\n\t\n\n\tMurphy certainly fits the criteria, with a massive body of work as an actor and comedian. The most commercially successful African American actor of all time, Murphy is among the top five box office performers in the industry’s history. Some of his most iconic hits on the big screen include “Beverly Hills Cop,” “Coming to America,” “Trading Places,” “Daddy Daycare,” “48 Hrs” and “The Nutty Professor.” He has also made a significant impact as a voice actor, voicing Mushu in “Mulan” and Donkey in the “Shrek” franchise.\n\n\n\tOn stage, Murphy’s stand up specials including 1983’s “Delirious” and 1987’s “Raw” and his role as a cast member on “Saturday Night Live” has also contributed to his immense cultural impact. Most recently, he was the subject of the 2025 Netflix documentary “Being Eddie” and the star of the Amazon Prime action comedy feature, “The Pickup.”\n\n\tAFI Board of Trustees chairwoman Kathleen Kennedy said in a statement, “Eddie Murphy is an American icon. A trailblazing force in the art forms of film, television and stand-up comedy, his versatility knows no bounds. Across five decades, his enduring impact on our culture has inspired artists and audiences alike and AFI is proud to honor him with the 51st AFI Life Achievement Award.”\n\t\n\n\tThe AFI Life Achievement Award honoree is selected by the AFI Board of Trustees. Last year’s recipient was Francis Ford Coppola and previous winners from the past decade include Steve Martin, John Williams, Diane Keaton, George Clooney, Denzel Washington, Julie Andrews and Nicole Kidman. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Eddie Murphy to Be Honored With AFI Life Achievement Award",
      "image": [
        "https://variety.com/wp-content/uploads/2025/01/20190621-Netflix-Seliger-EM_01-Grey-Seamless_0050rv5_lo-e1763751314585.jpg?crop=0px%2C284px%2C8320px%2C4680px&resize=1000%2C563"
      ],
      "datePublished": "2025-11-21T19:00:00.000Z",
      "dateModified": "2025-11-21T19:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "K-Pop News: Stray Kids Make History With New Project Release!",
    "url": "https://www.tmz.com/2025/11/21/k-pop-news-stray-historical-project-release/",
    "image": "https://imagez.tmz.com/image/3e/16by9/2025/11/20/3ea692b2e3eb4ad985a24c61d1ecd9c4_xl.png",
    "tag": "Entertainment",
    "date": "2025-11-21T18:03:28.000Z",
    "description": "\n    \n                    \n                          K-Pop\n                          Stray Kids Make History\n                          With New Projec",
    "body": "\n    \n                    \n                          K-Pop\n                          Stray Kids Make History\n                          With New Project Release!\n                      \n                  \n                        Published November 21, 2025 10:03 AM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          🚨 THIS IS NOT A DRILL 🚨 Stray Kids made another comeback today, releasing their mini album \"SKZ IT Tape 'DO IT!'\"\n      \n    \n          Back in August, the K-pop group -- made up of Bang Chan, Lee Know, Changbin, Hyunjin, HAN, Felix, Seungmin, and I.N -- released their album \"Karma\" ... and today they're back and bigger than ever, droppin' more bangers!\n      \n    \n          \"Do It\" marks the 1st K-pop album in Spotify history to surpass 1 million pre-saves! The only other albums ever to reach this milestone are Taylor Swift’s \"The Life of a Showgirl\" and Tame Impala’s \"Deadbeat.\"\n      \n    \n          Atta way, SKZ ... and enjoy the milestone, Stay!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Photo Galleries\n              \n                          \n                Music\n              \n                          \n                K-Pop\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "K-Pop News: Stray Kids Make History With New Project Release!",
      "image": [
        "https://imagez.tmz.com/image/3e/16by9/2025/11/20/3ea692b2e3eb4ad985a24c61d1ecd9c4_xl.png"
      ],
      "datePublished": "2025-11-21T18:03:28.000Z",
      "dateModified": "2025-11-21T18:03:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "TikTok Star Ben Bader's Cause of Death Released",
    "url": "https://www.tmz.com/2025/11/21/ben-bader-cause-of-death/",
    "image": "https://imagez.tmz.com/image/3d/16by9/2025/11/21/3d4a2295ed604955832333b6af92ae92_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-21T16:08:08.000Z",
    "description": "\n    \n                    \n                          Ben Bader\n                          TikTok Star's Cause of Death Revealed\n                      \n",
    "body": "\n    \n                    \n                          Ben Bader\n                          TikTok Star's Cause of Death Revealed\n                      \n                  \n                        Published November 21, 2025 8:08 AM PST\n                                                                      |\n                Updated November 21, 2025 9:08 AM PST\n                                    \n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          TikTok star Ben Bader died from complications of cardiovascular disease, TMZ has learned.\n      \n    \n          According to medical examiner documents obtained by TMZ, the content creator had untreated hardening and narrowing of the arteries ... and his death has been ruled as natural. Florida's Palm County Medical Examiner noted genetic factors \"were likely involved in the development\" of his cardiovascular impairment.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Ben was believed to be healthy, and only had recent complaints of back and shoulder pain he sought physical therapy to alleviate, the documents further state. The pain reliever codeine was traced in his urine, but not in his blood ... and was not a contributing factor to his unexpected death.\n      \n\n          The report states he was exercising at his private community's gym when a fellow gymgoer found him unresponsive on the ground 8 minutes after he had gotten off the treadmill.\n      \n    \n          The Jupiter Police Department told us after his October 23 death that bystanders found him and he appeared \"not to be breathing.\" Life-saving measures were performed by responding authorities before he was rushed to a hospital, where he was pronounced dead.\n      \n    \n          As we reported, his girlfriend is the one who broke the devestating news, telling fans his death was \"extremely sudden.\"\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Ben's loved ones remembered him as \"visionary who led with love, lived with intention, and turned his passions into helping others.\"\n      \n    \n          He was known for his lifestyle content and financial advice, and even offer a financial coaching course.\n      \n    \n          He was just 25 when he died.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                RIP\n              \n                          \n                Celebrity Death\n              \n                          \n                Exclusive\n              \n                          \n                Fairly Legal\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "TikTok Star Ben Bader's Cause of Death Released",
      "image": [
        "https://imagez.tmz.com/image/3d/16by9/2025/11/21/3d4a2295ed604955832333b6af92ae92_xl.jpg"
      ],
      "datePublished": "2025-11-21T16:08:08.000Z",
      "dateModified": "2025-11-21T16:08:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Anna Kepner’s Stepbrother Was Allegedly Obsessed With Her Before Cruise Death",
    "url": "https://www.tmz.com/2025/11/21/anna-kepner-stepbrother-obsession-with-her-before-her-death/",
    "image": "https://imagez.tmz.com/image/5c/16by9/2025/11/19/5ce06a7bd9034cc7b9f59583feaf8cae_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-21T13:08:28.000Z",
    "description": "\n    \n                    \n                          Carnival Cruise Death\n                          Anna Kepner's Stepbrother Allegedly Obsessed With",
    "body": "\n    \n                    \n                          Carnival Cruise Death\n                          Anna Kepner's Stepbrother Allegedly Obsessed With Her\n                      \n                  \n                        Published November 21, 2025 5:08 AM PST\n                                                                      |\n                Updated November 21, 2025 9:45 AM PST\n                                    \n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Anna Kepner was mysteriously found dead on a Carnival Cruise ship two weeks ago -- and we're now learning her stepbrother allegedly had a strange infatuation with the teen cheerleader ... even climbing on top of her in bed one time, according to a new report.\n      \n    \n          \"Inside Edition\" interviewed Steven Westin -- the father of Kepner's ex-boyfriend -- for an episode that aired Thursday ... and Westin made several shocking claims based on discussions he says he had with his 18-year-old son about Kepner's stepbrother.\n      \n    \n          As you know, Kepner, also 18, was on the Carnival Cruise with her stepbrother and other family members returning to Miami on November 7 ... when she was tragically found dead on board.\n      \n\n      \n        \n                    \n                  \n      \n                    TikTok/@fl.anna18\n          \n    \n          According to Westin, Kepner's stepbrother was totally obsessed with her and wouldn't stop pursuing her. Westin also claims Kepner was frightened of her stepbrother -- saying he allegedly always carried a knife.\n      \n    \n          Furthermore, Westin claims his son once saw Kepner's stepbrother enter her room and get on top of her while she was asleep -- all during a FaceTime call.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Westin describes Kepner's stepbrother as having a crazy infatuation with her because he apparently always wanted to date her.\n      \n    \n          The FBI has launched an investigation into Kepner's death while the Miami-Dade County Medical Examiner works to determine how she died.\n      \n    \n          Meanwhile, Kepner's stepmom, Shauntel Hudson, revealed in a recent court filing separate from the probe that a \"criminal case may be initiated against one of the minor children\" in connection with Anna's death.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                RIP\n              \n                          \n                Family\n              \n                          \n                Fairly Legal\n              \n                          \n                News\n              \n                          \n                True Crime\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Anna Kepner’s Stepbrother Was Allegedly Obsessed With Her Before Cruise Death",
      "image": [
        "https://imagez.tmz.com/image/5c/16by9/2025/11/19/5ce06a7bd9034cc7b9f59583feaf8cae_xl.jpg"
      ],
      "datePublished": "2025-11-21T13:08:28.000Z",
      "dateModified": "2025-11-21T13:08:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Penis Costume-Wearing Grandma Arrested at Trump Protest, Body Cam Video",
    "url": "https://www.tmz.com/2025/11/21/penis-costume-arrest-body-camera-video/",
    "image": "https://imagez.tmz.com/image/6b/16by9/2025/11/21/6b516bc4d9cd4368b9508c1b0a01239c_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-21T17:54:45.000Z",
    "description": "\n    \n                    \n                          Alabama Trump Protest\n                          Grandma Arrested in Penis Costume ...\n           ",
    "body": "\n    \n                    \n                          Alabama Trump Protest\n                          Grandma Arrested in Penis Costume ...\n                          A Real Dick Move!!!\n                      \n                  \n                        Published November 21, 2025 9:54 AM PST\n                                                                      |\n                Updated November 21, 2025 11:18 AM PST\n                                    \n      \n    \n        \n                    \n                  \n      \n    \n          Hilarious moment at a Trump protest in Alabama ... a grandmother wearing an inflatable penis costume on the side of the road got arrested ... and it's all on video.\n      \n    \n          Newly released police body cam footage shows the moment 61-year-old Renea Gamble is confronted and busted by law enforcement during a No Kings protest in Fairhope.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Renea says she's the person underneath the inflatable penis costume with a picket sign that says, \"No D*ck Tator.\"\n      \n\n          Police didn't find her costume and sign funny ... in the video, the officer tells Renea her getup won't fly in a \"town that has values.\"\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Renea says she was just exercising her First Amendment right to free speech, but in the October video, the cop tells her ... \"I'm not going to sit here and argue with you. If my kids came by here to see this, how would I explain this?\"\n      \n    \n          The cop also says ... \"How would you explain to my children what you are supposed to be? This is a family town. I'm not going to have someone out here dressed like this. It's abusive.\"\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Cops say Renea was charged with disorderly conduct and resisting arrest ... but she's fighting the charges, and say it's ridiculous she could resist arrest from inside an inflatable penis.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Donald Trump\n              \n                          \n                Insane Videos\n              \n                          \n                Politix\n              \n                          \n                Fairly Legal\n              \n                          \n                Police\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Penis Costume-Wearing Grandma Arrested at Trump Protest, Body Cam Video",
      "image": [
        "https://imagez.tmz.com/image/6b/16by9/2025/11/21/6b516bc4d9cd4368b9508c1b0a01239c_xl.jpg"
      ],
      "datePublished": "2025-11-21T17:54:45.000Z",
      "dateModified": "2025-11-21T17:54:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Bella Twins Hot Shots -- Nikki and Brie Turn 42!",
    "url": "https://www.tmz.com/2025/11/21/bella-twins-hot-shots-nikki-brie/",
    "image": "https://imagez.tmz.com/image/cb/16by9/2025/11/18/cb038c1e6c0e41c99dd3f4f16c035ff6_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-21T19:29:39.000Z",
    "description": "\n    \n                    \n                          Nikki and Brie Bella\n                          Check Out Our Twins!!!\n                      \n    ",
    "body": "\n    \n                    \n                          Nikki and Brie Bella\n                          Check Out Our Twins!!!\n                      \n                  \n                        Published November 21, 2025 11:29 AM PST\n                                                                            \n      \n    \n      \n        \n              \n    \n    \n          Nikki Garcia and Brie Bella are twinning to perfection, and we're looking back at some of their hottest looks over the years as they celebrate another trip around the sun.\n      \n    \n          It's Nikki and Brie's 42nd birthday, and the former WWE stars are looking as fine and fit as ever ... so let's go for a stroll down memory lane.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Click through the gallery for some throwback shots of Nikki and Brie at the height of their pro wrestling hotness ... and stay for the recent photos of their brunette sexiness.\n      \n\n          Nikki, Brie and the twins have been all over ... they've got hot shots at gyms, beaches, hotel lobbies, wrestling events, wineries, talk shows, hotel rooms, elevators, and even music festivals.\n      \n    \n          These twins are so hot, they'll have you tapping out!!!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Nikki Bella\n              \n                          \n                Brie Bella\n              \n                          \n                Hotties & Bodies\n              \n                          \n                Hot Bodies\n              \n                          \n                TMZ Sports\n              \n                          \n                Birthdays\n              \n                          \n                Photo Galleries\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Bella Twins Hot Shots -- Nikki and Brie Turn 42!",
      "image": [
        "https://imagez.tmz.com/image/cb/16by9/2025/11/18/cb038c1e6c0e41c99dd3f4f16c035ff6_xl.jpg"
      ],
      "datePublished": "2025-11-21T19:29:39.000Z",
      "dateModified": "2025-11-21T19:29:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]