[
  {
    "title": "American Cinematheque, Vidiots Among Theaters Offering Free Admission During Nationwide Shutdown on Friday",
    "url": "https://variety.com/2026/film/news/american-cinematheque-vidiots-free-nationwide-shutdown-1236645414/",
    "image": "https://variety.com/wp-content/uploads/2023/04/Vidiots1.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-30T04:53:18.000Z",
    "description": "\n\tIn the wake of the ICE shooting of Alex Pretti in Minneapolis on Jan. 24, non-profit organizations and small businesses across the country are parti",
    "body": "\n\tIn the wake of the ICE shooting of Alex Pretti in Minneapolis on Jan. 24, non-profit organizations and small businesses across the country are participating in a nationwide shutdown and general strike to show solidarity with the people of Minnesota and activism against ICE. In Los Angeles, many restaurants and shops are shutting down entirely, others are staying open to foster community and continue paying their employees, some while making donations to social justice organizations. \n\t\n\n\tVidiots in the Los Angeles neighborhood of Eagle Rock announced it would make all screenings free of charge on Friday. “What’s Love Got to Do With It” and “UHF” are among films showing in the evening.\n\n\n\n\tThe American Cinematheque will offer free admission to “Something Wild” at the Aero in Santa Monica and “Horse Feathers” and “The Killing of a Chinese Bookie” at the Los Feliz 3. Free popcorn and soda will be included at the Aero.\n\n\tBraindead Studios and the Museum of Neon Art are among other cultural shutdowns on Friday. \n\n\tAmong the organizations supporting the effort are IATSE Local 800 (Art Director’s Guild) and the WGA West, which will have a presence at the National Day of Action rally at L.A. City Hall at 1 p.m. Friday. \n\n\tRestaurants closing down for the day include Joan’s on Third, Wilde’s, Bar Siesta, Canyon Coffee, Courage Bagels, Tomat, Bacetti Trattoria and Proof Bakery.\n\n\tRestaurants and other shops that will be open for business but supporting the shutdown through donations to CHIRLA and other efforts include Kismet, Maru Coffee, Homestate, Bub and Grandma’s, Belle’s Bagels, Donna’s, Little Dom’s, Bar Sinizki and Valerie Confections. \n\t\n\n\tSee more information on local businesses and organizations supporting the shutdown at LATaco.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "American Cinematheque, Vidiots Among Theaters Offering Free Admission During Nationwide Shutdown on Friday",
      "image": [
        "https://variety.com/wp-content/uploads/2023/04/Vidiots1.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-30T04:53:18.000Z",
      "dateModified": "2026-01-30T04:53:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Alia Bhatt’s Eternal Sunshine Productions Teams With Prime Video on Coming-of-Age Rom-Com ‘Don’t Be Shy’ (EXCLUSIVE)",
    "url": "https://variety.com/2026/tv/news/alia-bhatt-prime-video-rom-com-dont-be-shy-1236642135/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Alia-Bhatt-Nikhil-Madhok.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-30T04:27:00.000Z",
    "description": "\n\tPrime Video has greenlit “Don’t Be Shy,” an original romantic comedy produced by Alia Bhatt and Shaheen Bhatt through their Eternal Sunshine Product",
    "body": "\n\tPrime Video has greenlit “Don’t Be Shy,” an original romantic comedy produced by Alia Bhatt and Shaheen Bhatt through their Eternal Sunshine Productions banner, with Grishma Shah and Vikesh Bhutani serving as co-producers.\n\n\tWritten and directed by Sreeti Mukerji, the coming-of-age film centers on Shyamili “Shy” Das, a 20-year-old whose meticulously organized life begins to unravel when an unexpected turn of events sends things spiraling beyond her control. Mukerji previously worked on the direction teams of Bollywood hits “Yeh Jawaani Hai Deewani,” “Ae Dil Hai Mushkil” and “Brahmastra Part One: Shiva.” \n\t\n\n\t“We’re thrilled to collaborate with Alia Bhatt and Shaheen Bhatt on this extremely fun yet warm romantic comedy, with a remarkable character like Shy Das at its heart,” said Nikhil Madhok, director and head of originals at Prime Video India. “Alia’s innate instinct for stories that are emotionally rich, deeply relatable, and immensely entertaining shines through in this young adult story about friendship, love, and growing up.”\n\n\n\tMadhok highlighted the project’s female-forward narrative, describing the writing as fresh, relatable and humorous with earnest characters. The film features an original score by composer Ram Sampath.\n\n\t“At Eternal Sunshine, we’ve always wanted to back stories that feel honest and voices that feel their own,” said Alia Bhatt, co-founder of Eternal Sunshine Productions. “This film immediately spoke to us because of its sincerity and coming-of-age lens and Sreeti’s passion and energy naturally fed into the spirit of the story.”\n\t\n\n\tBhatt described the project as particularly meaningful for both herself and Eternal Sunshine Productions, praising Prime Video as a partner that consistently takes bold creative calls and supports distinctive storytelling.\n\n\tEternal Sunshine Productions was founded in 2021 by Bhatt, one of India’s most prominent actors, and her sister Shaheen Bhatt, author of the bestselling mental health memoir “I’ve Never Been (Un)Happier.” The production house’s debut feature, “Darlings,” co-produced with Red Chillies, premiered on Prime Video in 2022 and marked director Jasmeet K. Reen’s first film. The company subsequently produced the Prime Video series “Poacher,” directed by Emmy winner Richie Mehta, and “Jigra,” an action-adventure helmed by Vasan Bala and co-produced with Dharma Productions.\n\n\tPrime Video’s Indian original content includes series “Paatal Lok,” “Mirzapur,” “The Family Man,” “Panchayat,” “Made in Heaven” and “Citadel: Honey Bunny,” along with original films such as “Shershaah,” “Sardar Udham” and “Maja Ma.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Alia Bhatt’s Eternal Sunshine Productions Teams With Prime Video on Coming-of-Age Rom-Com ‘Don’t Be Shy’ (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Alia-Bhatt-Nikhil-Madhok.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-30T04:27:00.000Z",
      "dateModified": "2026-01-30T04:27:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Paralyzed by Hope: The Maria Bamford Story’ Shares the Tears, Fears, Insights of a Unique Clown",
    "url": "https://variety.com/2026/film/reviews/paralyzed-by-hope-maria-bamford-story-review-judd-apatow-1236645400/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Paralyzed_by_Hope_The_Maria_Bamford_Story-Still_1.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-30T04:01:39.000Z",
    "description": "\n\tStand-up comedy is best live — and often lived. Judd Apatow and comedy appreciator Neil Berkeley know this. In their admiring, at times achingly fun",
    "body": "\n\tStand-up comedy is best live — and often lived. Judd Apatow and comedy appreciator Neil Berkeley know this. In their admiring, at times achingly funny documentary “Paralyzed by Hope: The Maria Bamford Story” premiering at the Sundance Film Festival, the co-directors celebrate a comedian especially good at mining her life — including her struggles with mental health.\n\n\tThe film builds the arc of Bamford’s life and career by utilizing clips from decades of her stand-up. Augmenting that spine are family photos and home movies, copious insights and praise from fellow comedians, anchored with interviews — awkward and endearing — with the comic herself, as well as her parents and older sister, Sarah Bamford Seidelmann.\n\t\n\n\tBorn and raised in Duluth, she’s the second daughter of a doctor and a formidable mother. Around the time Bamford was 8 years old, she began experiencing a form of OCD that is marked by dark, intrusive thoughts that can be violent and or sexual. She also began having suicidal thoughts.\n\n\n\tEven so, Bamford might be an exemplar of Minnesota nice. She’s got a whispery, high-register delivery, seemingly sped up by anxieties 1.5 times. She’s modest, even mousy, but her self-deprecating revelations have a kind of muscular courage behind them. After sharing that she has a mild tremor from a medication, someone suggest she take another drug to counteract whichever one is causing the tremor. To which she responds, holding up her mildly quivering hand “Weakness is the brand.” That retort was also the title of her 2020 comedy special.\n\t\n\n\tIf you don’t know Bamford’s work, then “Paralyzed by Hope” serves as an affectionate introduction. If you’re familiar with her stand-up, then it’s fun to listen to the parade of comics and friends try to get at what makes her such a great comedian in their estimation. In that sense, this is something of a comic’s comic appraisal. \n\n\tPatton Oswalt, Brian Posehn and Zach Galifianakis along with Bamford made up the nerdly-hip comedy tour called The Comedians of Comedy, which was a Comedy Channel special and then series in 2005. Oswalt confesses being bewildered by Bamford at first. “I didn’t get it,” he says. He has since called her “the greatest living comedian.” And there are times in the clips from her stand-up when you might get why he didn’t. Singing ever-so-familiarly the Old MacDonald tune Bamford swaps “Pterodactyl” for “farm” and why not? “Old MacDonald had a Pterodactyl E-I-E-I-O. With a…” she sings. Then she lets out an unexpected and ungodly screech. Maybe you had to be there. Apatow and Berkeley make sure we are.\n\n\tNetflix’s Ted Sarandos counts himself a fan. He greenlit the first season of her series, “Lady Dynamite,” and then doubled down for a second season. That he’s proud of doing the first and stumped by his impulse to do a second season, is amusing and perhaps says something about the well of fondness Bamford taps.\n\n\tTig Notaro, Ron Funches and Sarah Silverman also offer thoughts, sometimes smiling with a kind of incredulity as they do. Apatow tells Stephen Colbert and a few others that to test out new material, Bamford invited strangers to sit across a table from her at a café and listen to her work her material. She then — wait for it — paid them.\n\n\tWhile the film leans on other comics to celebrate Bamford’s unique delivery, deft timing and exquisite plying of vulnerability, it’s the time with her family — her parents and her sister — that grounds the documentary. Her husband, painter Scott Marvel Cassidy, also makes an appearance.\n\n\tThose moments give voice —their own — to the people who figure mightily into Bamford’s comedy. She also wrote about more deeply about them in 2023’s “Sure, I’ll Join Your Cult: A Memoir of Mental Illness and the Quest to Belong Anywhere.” (The book is an intentional tribute to the self-help genre and 12-step programs.)\n\t\n\n\tBamford helped raise the profile of a micro-comedy club in Altadena, Calif., where she lives, called PDA (Public Displays of Altadena) by staging a morning set. It burned in the Eaton Fire last year. It’s not the only loss she faces in “Paralyzed by Hope” — a phrase that comes from Bamford. But toward the end of Apatow and Berkeley’s documentary, we know two things: She’s a comic’s comic; kindness keeps her moving.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Paralyzed by Hope: The Maria Bamford Story’ Shares the Tears, Fears, Insights of a Unique Clown",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Paralyzed_by_Hope_The_Maria_Bamford_Story-Still_1.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-30T04:01:39.000Z",
      "dateModified": "2026-01-30T04:01:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Later-in-Life Rom-Com Produced by Jamie Lee Curtis and Therapist Comedy Starring Jane Lynch and Katey Sagal Score NBC Pilot Orders",
    "url": "https://variety.com/2026/tv/news/nbc-jamie-lee-curtis-jane-lynch-therapy-pilot-1236645361/",
    "image": "https://variety.com/wp-content/uploads/2026/01/MixCollage-29-Jan-2026-09-33-PM-6706.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-30T03:00:00.000Z",
    "description": "\n\tNBC has ordered two pilots: a rom-com called “Newlyweds” and an untitled comedy about therapists-slash-best friends played by Jane Lynch and Katey S",
    "body": "\n\tNBC has ordered two pilots: a rom-com called “Newlyweds” and an untitled comedy about therapists-slash-best friends played by Jane Lynch and Katey Sagal.\n\n\t“Newlyweds” is written by Gail Lerner, who executive produces alongside Jamie Lee Curtis, Eric Tannenbaum, Kim Tannenbaum and Scott Schwartz. Per the official logline, the project is “a later-in-life love story about a free-spirited woman and a buttoned-up professor who marry impetuously after a whirlwind courtship.” Lionsgate Television produces, and Universal Television is the studio.\n\t\n\n\tLerner is best known for her work as a writer and producer on Seasons 5 through 8 of NBC’s “Will & Grace” and Seasons 1 through 6 of ABC’s “Black-ish.”\n\n\n\tThe logline for the untitled pilot, written by Kari Lizer, reads, “Ginger (Sagal) and Jill (Lynch) have always been a team as opposites that work best together. As they sort their past and look toward their future, they’ll discover that in spite of it all, they wouldn’t change a thing.” The project is loosely inspired by real-life friendship between therapists and sociologists Pepper Schwartz and Janet Lever, who study sex and gender and serve as consulting producers. Executive producers include Lizer, Lynch, Sagal and Trip the Light Productions’ Krista Vernoff, Andrew Stearn and Alexandre Schmitt. The pilot is produced by Paramount Television Studios.\n\n\tLizer is best known as the creator of “The New Adventures of Old Christine,” which ran on CBS for five seasons from 2006 to 2010. She was also a writer and producer on Seasons 3 through 6 of “Will & Grace,” which she also acted in for five episodes among various other acting credits.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Later-in-Life Rom-Com Produced by Jamie Lee Curtis and Therapist Comedy Starring Jane Lynch and Katey Sagal Score NBC Pilot Orders",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/MixCollage-29-Jan-2026-09-33-PM-6706.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-30T03:00:00.000Z",
      "dateModified": "2026-01-30T03:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tyler, the Creator and Rosé to Perform at 2026 Grammy Awards",
    "url": "https://variety.com/2026/music/news/tyler-the-creator-rose-perform-at-2026-grammy-awards-1236645241/",
    "image": "https://variety.com/wp-content/uploads/2026/01/FotoJet-1-3-e1769729676322.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-30T00:59:00.000Z",
    "description": "\n\tThe rapid-fire announcement of Grammy performers continues as Tyler, the Creator and Rose, both of whom were honored at Variety’s 2025 Hitmakers eve",
    "body": "\n\tThe rapid-fire announcement of Grammy performers continues as Tyler, the Creator and Rose, both of whom were honored at Variety’s 2025 Hitmakers event in December, will perform at the show on Sunday (not together).\n\n\tGrammy-winner Tyler, who was named Variety’s Hitmakers Innovator of the Decade, is up for six Grammy Awards this year: Album of the Year (“Chromakopia”), Best Alternative Music Album (“Don’t Tap the Glass”), Best Rap Performance (“Darling, I”), Best Rap Song (“Sticky”), and Best Rap Album (“Chromakopia”).\n\t\n\n\tFirst-time nominee Rose, who was named Variety’s Global Hitmaker of the Year, is up for three Grammy Awards this year, all for her single with Bruno Mars, “APT.”: Record of the Year, Song of the Year and Best Pop Duo/Group Performance.\n\n\n\tPreviously announced performers include Lady Gaga, Justin Bieber, Sabrina Carpenter, Clipse and Pharrell Williams, Post Malone, Reba McEntire, Katseye, Leon Thomas, Lola Young, Olivia Dean, Addison Rae, the Marias and Alex Warren.\n\n\tReba McEntire, Brandy Clark and Lukas Nelson will perform during the In Memoriam segment during this Sunday’s Grammy Awards, while Ms. Lauryn Hill will perform in honor of D’Angelo and Roberta Flack and a tribute to Ozzy Osbourne will feature Post Malone with Watt, Slash, Duff McKagan and Chad Smith.\n\n\tHarry Styles and Doechii have been tapped as presenters; more performers and presenters will be announced in the coming days.\n\n\tThe 68th Grammy Awards are scheduled to air live on Sunday at 8 p.m. ET/5 p.m. ET. Trevor Noah will host the ceremony for the sixth consecutive year, and will conclude his run as this year will be his final time emceeing the event.\n\t\n\n\tPrior to the big show, the Grammy Awards Premiere Ceremony will be broadcast live from the Peacock Theater at 12:30 p.m. PT and will be streamed live on live.Grammy.com.\n\n\tThe 2026 Grammy Awards will be produced by Fulwell Entertainment for the Recording Academy. Ben Winston, Raj Kapoor, Jesse Collins, and Trevor Noah are executive producers.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tyler, the Creator and Rosé to Perform at 2026 Grammy Awards",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/FotoJet-1-3-e1769729676322.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-30T00:59:00.000Z",
      "dateModified": "2026-01-30T00:59:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘The Traitors’ Black Banquet Sees a Murder in Plain Sight, Followed by a Banishment That Changes the Game",
    "url": "https://variety.com/2026/tv/news/the-traitors-lisa-rinna-banished-yam-yam-black-banquet-1236644800/",
    "image": "https://variety.com/wp-content/uploads/2026/01/NUP_207954_01356.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-30T03:05:00.000Z",
    "description": "\n\tSPOILER ALERT: This post contains spoilers from  “The Black Banquet,” Season 4, Episode 7 of “The Traitors,” now streaming on Peacock.\n\n\tFor weeks n",
    "body": "\n\tSPOILER ALERT: This post contains spoilers from  “The Black Banquet,” Season 4, Episode 7 of “The Traitors,” now streaming on Peacock.\n\n\tFor weeks now, Alan Cumming has been raving about “The Traitors” episode 7, namely, “The Black Banquet,” and how it makes history. And, it did just that when the Traitors took out a Faithful in plain sight during Thursday’s episode. And for the first time ever, the cast found out immediately who was killed, not having to wait until the following morning over smoked salmon.\n\t\n\n\tTraitor Lisa Rinna had to choose who she wanted to murder, and, somehow, have that person touch the amulet pinned to her elaborate outfit. She revealed during a confessional that she had narrowed it down to Kristen, Natalie and Yam Yam. Then, Alan came in to share the shocking twist — two vials would be brought in; if the victim of the murder drank the vial, they wouldn’t be murdered after all.\n\n\n\tHowever, the moment he told the cast to discuss, madness ensued, and everyone began pointing fingers — some at Lisa, some at Stephen (who is finally getting air time!) — and no one could hear anyone else’s point. Ultimately, a very aggressive Natalie and Kristen drank the antidote. With that, the group was informed that it was actually Yam Yam who was murdered. Two masked figures came in and dragged him out of the dinner, but not before he could tell everyone that it was Lisa, because she kissed him on the cheek and air-kissed everyone else.\n\n\tAt breakfast, when the Traitors were finally alone, Lisa asked them for their help and support moving forward, since they hadn’t helped her at all the night before. They said yes, but almost immediately afterward, Rob proved he wasn’t going to do that; when chatting with a group a few moments later, he made sure they knew that Yam Yam was saying Lisa — and that Lisa was denying kissing him. He asked, why would Yam Yam lie on his way out? \n\t\n\n\tThe next day, it was time for the challenge, during which gold rocks had to be collected and put into a chest — either yours or someone else’s — at the top of a mountain. The six players with the most gold in their chest had the chance to earn a dagger, which would serve as an extra vote at the roundtable.\n\n\tLisa gave her gold to Stephen, which Colton immediately clocked. Colton, meanwhile, was closer than ever to Rob and together, they decided they were rallying against Lisa. The six players with the most gold were Colton, Erik, Mark, Natalie, Rob and Stephen. Rob’s chest was the most full, so he got an advantage; the others were given tablets — one of which had a dagger on it. \n\n\tRob questioned each of them and had to guess who was lying about having the dagger in front of them. If he guessed right, he could keep the dagger. He chose Natalie, and he was right. When the group arrived back at the castle, Rob told the group of six he had the dagger, and everyone made a pact to keep it a secret. \n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tEuan Cherry/PEACOCK\n\t\n\n\n\n\tWhen it came time for the roundtable, most were torn between Lisa and Natalie. Rob made it very clear that he was not writing down Natalie’s name, and brought up Yam Yam calling out Lisa, asking everyone at the table, “Why would he lie?”\n\n\tThe dagger was not used or revealed at the roundtable, where Lisa and Natalie got the most votes. Candiace wrote down Rob’s name, stating that she was throwing away her vote because she didn’t think either of the women was a traitor, and seemingly, planting the seed in others’ minds that he may not be that innocent after all.\n\n\tUltimately, Lisa was sent home, and Colton and Rob couldn’t have been happier. Afterward, Colton told Johnny he was starting to look at Stephen next and later also brought up Candiace’s name. Rob then asked whether it could be a turret full of Housewives.\n\n\tAt the same time, Johnny told Candiace he was starting to look at Colton, since he was the first one to randomly bring up Lisa, as well as Rob, since he was so attached to Colton.\n\n\tNeedless to say, it’ll be exciting to see how Candiace and Rob continue to work in this game together or completely destroy the Traitors’ turret — and if a Faithful will be converted to a Traitor anytime soon.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘The Traitors’ Black Banquet Sees a Murder in Plain Sight, Followed by a Banishment That Changes the Game",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/NUP_207954_01356.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-30T03:05:00.000Z",
      "dateModified": "2026-01-30T03:05:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "WGA Staff Authorizes a Strike, Accuses Guild Leaders of Bargaining in Bad Faith",
    "url": "https://variety.com/2026/film/news/wga-staff-strike-authorization-bad-faith-bargaining-1236645029/",
    "image": "https://variety.com/wp-content/uploads/2023/09/BUC_2323-1.jpg?crop=395px%2C1064px%2C7861px%2C4419px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-01-30T02:46:41.000Z",
    "description": "\n\tThe staff of the Writers Guild of America West has voted to authorize a strike, just weeks before the union is due to sit down with the major studio",
    "body": "\n\tThe staff of the Writers Guild of America West has voted to authorize a strike, just weeks before the union is due to sit down with the major studios.\n\n\tThe union staffers, who organized last spring, have been demanding better wages and job protections in their first contract. Negotiations with WGA West management have been underway intermittently since September, with the last session held on Jan. 17.\n\n\n\tDuring a break in talks, the Writers Guild Staff Union staged a picket outside WGA West headquarters, demanding “just cause” employee discipline and a “fair deal.”\n\t\n\n\tThe staffers — represented by the Pacific Northwest Staff Union — have since voted to authorize a strike over unfair labor practices, with 82 of 100 employees voting yes. The alleged unfair practices include “surface bargaining,” unilateral changes to the status quo, “unlawful surveillance,” and retaliation.\n\n\t“If management won’t bargain in good faith with us at the table, we will see them on the picket line,” the union said on its Instagram post on Thursday. “#ItsTime.”\n\n\tNo deadline was given.\n\n\tThe WGSU filed an unfair labor practices complaint against the WGA West in August, alleging that a member of the organizing committee was unlawfully fired. The WGA West denied the allegation at the time.\n\n\tAccording to a WGSU fact sheet, the staffers are pursuing a range of proposals, including:\n\n\nJust cause and grievance procedures that promote mutual accountability and fairness\nRobust protections from artificial intelligence in the workplace\nWork from home provisions that codify and improve upon current practice\nSustainable workloads that promote quality in servicing writers\nExtreme weather events and climate change impact language\nProfessional development resources that promote opportunities for growth\nPay increases that result in living wages reflective of the value our work provides\nA strong union wage scale that rewards longevity and dedication to WGAW members\n\n\n\n\tThe staff union has also stated that 64% of its members make less than $84,850, the “low income” threshold for a single-person household in Los Angeles County.\n\n\tIn a statement, the WGA West denied the allegations of labor law violations.\n\t\n\n\t“The WGAW has been bargaining in good faith with its staff union since September and has offered comprehensive proposals with numerous union protections and improvements to compensation and benefits,” a spokesperson for the union said. “Public claims suggesting otherwise are inaccurate, and allegations of unfair labor practices are without merit. WGAW respects the staff’s right to engage in collective activity, and hopes to reach a first contract agreement with the staff union soon.”\n\n\tThe WGA West also released a four-page side-by-side comparison of the proposals and counterproposals on Thursday evening. According to that document, management has offered a minimum annual salary of $55,000, while the staff union wants a minimum of $59,737.\n\n\tThe staff union has also sought assurances that generative AI will not be used in the workplace. Management has confirmed it has no intention of using AI, and offered that if it does, the staff will be given paid training. However, management worries that the staff’s proposal could impede it from using new technologies to evaluate employees’ work.\n\n\tWGA West staffers played a key part in the 2023 WGA strike, supporting thousands of TV and film writers who spent months picketing the major studios in Los Angeles.  \n\n\tThe WGA is due to return to the negotiating table with the Alliance of Motion Picture and Television Producers on March 16, with several weeks of bargaining expected ahead of the May 1 contract expiration.\n\n\tIn a message to its members, the WGA West said that it would prefer that the staff not go on strike at such a critical point, but that the AMPTP negotiations work will continue regardless.\n\n\t“(T)he executive and managerial staff that work directly with the WGA Negotiating Committee are not part of the PNWSU bargaining unit,” the union said. “Other management staff will carry out core functions of the Guild to lessen the impact of any disruption on the membership.”\n\n\tThe staff union includes attorneys, research analysts, residuals representatives, software engineers, and many other job classifications.\n\n\tThe union leadership said it supports the staff’s right to collective action.\n\n\t“At the same time, we are focused on the challenging negotiation period ahead of us, including securing necessary funding for the health and pension funds that writers struck to establish and maintain — and that Guild staff also receive their benefits from,” the union said.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "WGA Staff Authorizes a Strike, Accuses Guild Leaders of Bargaining in Bad Faith",
      "image": [
        "https://variety.com/wp-content/uploads/2023/09/BUC_2323-1.jpg?crop=395px%2C1064px%2C7861px%2C4419px&resize=1000%2C563"
      ],
      "datePublished": "2026-01-30T02:46:41.000Z",
      "dateModified": "2026-01-30T02:46:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "John Leguizamo, Eva Longoria and More Latino Creatives Call for ‘Accountability and Equity in Casting’ After Odessa A’zion ‘Deep Cuts’ Controversy",
    "url": "https://variety.com/2026/film/news/latino-creatives-open-letter-equity-casting-1236645350/",
    "image": "https://variety.com/wp-content/uploads/2026/01/FotoJet-76.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-30T02:24:55.000Z",
    "description": "\n\tMore than 100 Latino creatives have signed an open letter to Hollywood after widespread controversy broke out over Odessa A’zion’s casting in the A2",
    "body": "\n\tMore than 100 Latino creatives have signed an open letter to Hollywood after widespread controversy broke out over Odessa A’zion’s casting in the A24 adaptation “Deep Cuts” as the character Zoe Gutierrez. The letter asks decision-makers to increase Latino voices in development and greenlighting projects, as well as the amount of Latino actors in auditions and non-stereotypical leads. \n\n\tAmong those signing the letter are Eva Longoria, John Leguizamo, Xochitl Gomez, Danny Ramirez, Gina Rodriguez, Gloria Calderon Kellett and Jessica Alba.\n\t\n\n\tA’zion dropped out of the movie on Wednesday, saying she had not yet read the book. “I am with all of you and I am not doing this movie,” she wrote on Instagram.\n\n\n\t“Recent casting decisions around the character Zoe Gutierrez in A 24’s ‘Deep Cuts’ have exposed a troubling pattern,” the letter says, “We acknowledge and commend Odessa A’zion for listening, reflecting and deciding to exit the project and become an ally. Yet how did this happen?”\n\n\tRead the letter below:\n\n\tAn Open Letter to Hollywood from Latino Actors, Artists, and Storytellers\n\n\tDear Casting Directors, Creative Executives, Writers, Producers, and Hollywood Leaders, \n\n\tWe write to you with urgency, because storytelling is humanity’s compass and Hollywood wields all the power. The stories you choose to tell, and how you tell them, shape public perception, cultural understanding, and who gets to see themselves reflected on screen. In these challenging moments that power comes with real responsibility. Recent casting decisions around the character Zoe Gutierrez in A 24’s Deep Cuts have exposed a troubling pattern. We acknowledge and commend Odessa A’zion for listening, reflecting and deciding to exit the project and become an ally. Yet how did this happen? The absence of Latina audition opportunities, and the choice to replace a clearly Latina character with a non-Latina actress, signals a broader, ongoing erasure of our community from the stories that define our culture. This is not about any one actor or project. It is about a system that repeatedly overlooks qualified Latino talent even as our identities, histories, and experiences fuel the most enduring stories. Latino communities are already underrepresented and misrepresented in ways that distort reality and harm real people. Casting decisions carry real weight: they influence who is seen as worthy of authentic storytelling and who gets to tell those stories with care, nuance, and authority.\n\t\n\n\tWe are calling for accountability, intentionality, and equity in casting and storytelling. Authentic representation means more than casting a performer who looks like the character; it means involving the communities being portrayed not just in front of the camera, but in the decisions that shape these stories from their inception. Our stories deserve to be shaped with the input, guidance, and leadership of Latino creators, consultants, writers, and performers at every stage. We implore you to join us in concrete action:\n\n\nAudition and hire more Latino actors for a diverse range of roles, including non-stereotypical leads\nHire Latino executives in your greenlighting rooms\nInclude Latino voices as consultants, writers, and producers from the earliest stages of development\nCreate and support pipelines: mentoring, scholarships, and opportunities that expand access all levels of the ecosystem\n\n\n\n\tThe world is watching.\n\n\tAaron DominguezAitch AlbertoAlma MartinezAmanda DiazAna Navarro CardenasAndrea ChignoliAngel Manuel SotoAngelique CabralAnna TerrazasAnnie GonzalezAntonio NegretBecky GBrandon GuzmanBrandon PereaBricia LopezCamila BaqueroCarla GutierrezCarlo SiliottoCarla HoolCarlos Eric LopezCarlos Lopez EstradaChrissie FitChristian SerratosCierra RamirezCyria FialloDaniella PinedaDanny RamirezDavid CastenadaDesi PerkinsDiego BonetaEdher CamposEiza GonzalezElisa CapaiElsa CollinsEmilie LesclauxEnrique MelendezEva LongoriaFabrizio GuidoFelipe VargasFernando GarciaFlavia AmonFrancia RaisaGabriela MaireGina RodriguezGloria Calderon KellettGregory Diaz IVIlda SantiagoIsabella GomezIsabela MercedIsabella FerriaIsis MussendenIsmael Cruz CordovaIvette RodriguezJacob ScipioJavier MunozJazmin AguilarJesse GarciaJessica AlbaJillian MercadoJohn LeguizamoJose VelazquezJuan Pa ZuritaJulio MaciasJustina MachadoKarrie Martin LachneyKate Del CastilloKlaudia ReynickeKylie CantrallLeo GonzalezLisette OliveraLorenza MunozLynette CollMaia ReficcoMarcel RuizMaria LegardaMariana OlivaMariem Perez RieraMauro MuellerMayan LopezMelissa BarreraMelissa FumeroMichael CiminoMichael PenaMiguel MoraMonica VillarrealNatalie ChaidezNatalie MoralesNava MauNaz PerezNezza (Vanessa Hernandez)Neysa BoveNicolas CelisNicole BetancurOrlando PinedaPatricia CardosaPatricia RiggenPatty RodriguezPaulina GarciaPetra CostaRafael AgustinRafael CebrianRamon RodriguezRene G. BoscioRobin De JesusRodrigo TeixeiraRudy MancusoTonatiuh ElizarrarzTony RevoloriVictoria AlonsoXochitl GomezYareli ArizmendriAitch AlbertoHector MedinaLuca CastellaniNatalia Boneta \n\n\tYareli ArizmendiJuanpa ZuritaMaia ReficcoStephanie Osuna-HernandezPaulina ChávezSierra OrnelasMarvin LemusStephanie Beatriz\n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "John Leguizamo, Eva Longoria and More Latino Creatives Call for ‘Accountability and Equity in Casting’ After Odessa A’zion ‘Deep Cuts’ Controversy",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/FotoJet-76.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-30T02:24:55.000Z",
      "dateModified": "2026-01-30T02:24:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Amazon Blocks Mainstream Press From Watching ‘Melania’ Documentary at Kennedy Center",
    "url": "https://variety.com/2026/film/news/melania-documentary-premiere-amazon-blocks-press-1236645317/",
    "image": "https://variety.com/wp-content/uploads/2026/01/GettyImages-2258950913.jpg?crop=581px%2C225px%2C4014px%2C2251px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-01-30T02:26:45.000Z",
    "description": "\n\t“Are you getting in?” \n\n\t”No, are you?” \n\n\tOn Thursday afternoon, in the lobby of the Trump Kennedy Center, reporters whispered in hushed voices to ",
    "body": "\n\t“Are you getting in?” \n\n\t”No, are you?” \n\n\tOn Thursday afternoon, in the lobby of the Trump Kennedy Center, reporters whispered in hushed voices to each other to see which journalists, if any, would be allowed entry to a screening of Melania Trump’s documentary “Melania.”\n\n\tIn the hours before the film screened (press check-in began at 2 p.m. for the 6 p.m. carpet), there was slight optimism from veteran reporters, accustomed to slipping their way into Trump World, that they’d be able to network their way into a seat. But by 6:30 p.m., when members of the administration began walking the carpet, it became clear that most of the mainstream press would be blocked from attending the Amazon MGM Studios film.\n\t\n\n\tReporters from The New York Times, The Washington  Post, AP and Vanity Fair, among dozens of other outlets on the carpet, were not granted tickets to the invite-only screening in the Opera House, located one floor above the carpet. The only press from the carpet allowed into the screening (not counting those separately invited) were One America News anchor Dan Ball and his wife Peyton Drew, a producer for the far-right news channel. \n\n\n\t“I feel overdressed,” Drew, who wore a floor-length glitter ballgown on the press line, told her husband before talent arrived. “But,” she quickly reassured herself, “we’re attendees.”\n\n\tMembers of the Trump administration — Robert F. Kennedy Jr., Pete Hegseth, Lee Zeldin and Mike Johnson — attended the film’s premiere, in addition to the film’s director Brett Ratner and producer Marc Beckman. Several times when government officials walked towards the press line, Ball would encourage them to skip the “fake news” and come straight to him. At one point, after wrapping an interview with former Trump advisor Alina Habba, he called the rest of the reporters on the carpet “mongrels,” to which they both laughed.\n\t\n\n\tThat said, President Trump spent a surprising amount of time answering questions from mainstream press while Melania, wearing a black Dolce & Gabbana skirt suit, posed for photos. Reporters from The New York Times and Reuters asked Trump a slew of questions, such as progress on the government funding deal and when he plans on choosing a replacement for Jerome Powell as Federal Reserve Chair (Friday morning, he said).\n\n\tThe film opens on Friday, Jan. 30 against a backdrop of political unrest, with ICE raids in Minneapolis and other parts of the country causing increased backlash against the administration’s glitzy White House screening earlier this week (with Apple CEO Tim Cook in attendance) and tonight’s premiere.\n\n\tWhen asked about the exorbitant amount of money Amazon spent on the film — Amazon MGM paid $40 million for rights to the doc, and reportedly another $35 million on marketing — Trump said he “wasn’t involved with that.” \n\n\t“It was done with my wife,” he said, adding that he thinks the movie “is very important” and  “a big deal.”\n\n\tDespite the staggering sum spent for a documentary, it is only expected to earn $3 million to $5 million at the box office this weekend. The lack of advance ticket sales have become a meme online, with screenshots of empty movie theaters on ticketing sites such as Fandango making their rounds on social media — although, these can only be verified on a case-by-case basis.\n\n\tBut producer Beckman said the reports he’s received — “the real numbers” — are tracking “very positively.”\n\n\tThe film also marks Ratner’s return to directing after a hiatus following several sexual misconduct allegations in 2017. Ahead of the premiere, Rolling Stone reported that some crew members requested to not be formally credited on the film, with one citing the “alarm” they felt about the administration following Trump’s second term. \n\n\t“I understand if a liberal is working on the movie and they don’t want to be credited but they want to feed their family,” Ratner told Variety. “I don’t blame anybody for that.” He continued to say that the “main crew” will all be credited but because the doc shot in multiple places — such as Washington D.C.. New York and Florida — it was likely the daily or short term hires that had decided to distance themselves from the project.\n\t\n\n\tIn general, members of the administration looked to be in high spirits while walking to the pre-screening reception. “Happy to be here!” Hegseth, who attended with his wife, exclaimed to the press line. Others expressed how excited they are for the public to see the “real Melania.”\n\n\tKennedy said he came to support Melania because she has been one of his biggest supporters in the administration for his agenda, such as children’s health, food regulations and foster care.\n\n\t“I think she’s been portrayed as a one-dimensional figure,” he said, “but that’s not who she is.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Amazon Blocks Mainstream Press From Watching ‘Melania’ Documentary at Kennedy Center",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/GettyImages-2258950913.jpg?crop=581px%2C225px%2C4014px%2C2251px&resize=1000%2C563"
      ],
      "datePublished": "2026-01-30T02:26:45.000Z",
      "dateModified": "2026-01-30T02:26:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kate Walsh on Returning to ‘Grey’s Anatomy,’ Her ‘Family’ Bond With Caterina Scorsone and Why Fans Still Talk About Addison’s ‘Iconic’ Season 1 Entrance (EXCLUSIVE)",
    "url": "https://variety.com/2026/tv/news/kate-walsh-greys-anatomy-return-addison-marriage-trouble-jake-1236644697/",
    "image": "https://variety.com/wp-content/uploads/2026/01/KateWalsh-GreysAnatomy-MAIN.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-30T04:00:00.000Z",
    "description": "\n\n\tSPOILER ALERT: This interview contains spoilers from “Strip That Down,” the 10th episode of Season  22 of ABC’s “Grey’s Anatomy,” streaming on Hulu",
    "body": "\n\n\tSPOILER ALERT: This interview contains spoilers from “Strip That Down,” the 10th episode of Season  22 of ABC’s “Grey’s Anatomy,” streaming on Hulu.\n\n\tKate Walsh will always make time to return to “Grey’s Anatomy.”\n\n\tFrom the moment Addison Montgomery first strutted into the lobby of Seattle Grace Hospital and famously introduced herself to Ellen Pompeo’s protagonist Meredith Grey as the wife of the man Meredith was “screwing,” Walsh cemented herself as an enduring fan favorite. Addison’s impact on Shonda Rhimes’ venerable medical drama was so significant that, after two seasons of being a series regular, the world-class neonatal surgeon and OB/GYN left to lead her own six-season spinoff, “Private Practice,” which aired from 2007 to 2013.\n\n\tEight years after the end of “Private Practice,” Walsh made a surprise return to “Grey’s” in Season 18. In between performing the first successful uterine transplant and training a new class of residents at what’s now called Grey Sloan Memorial Hospital, Addison reconnected with her old colleagues, including her former sister-in-law, Amelia Shepherd (Caterina Scorsone). Having not visited the hospital since the tragic death of their shared ex Derek Shepherd (Patrick Dempsey) in Season 11, Addison had an emotional heart-to-heart with Meredith in an elevator after operating on a patient together. As an olive branch of sorts, Meredith then offered to let Addison meet the three children that she had with Derek.\n\n\tSince that two-episode arc, Addison has appeared in six episodes as a reminder of the crisis facing women’s healthcare. After her practice in Los Angeles became overrun with out-of-state patients seeking abortions, she returned to Seattle to seek the help of Miranda Bailey (Chandra Wilson) and Grey Sloan’s new interns to make sexual education videos. At the insistence of Bailey, Addison took over the hospital’s decommissioned mobile surgery unit, which she used to perform abortions in hostile states. Once news of her operations came to light, Addison became the target of pro-life activists — who stalked and doxxed her, threw a brick into Grey Sloan’s clinic, and even tried to run her over with a car. Despite these threats, Addison vowed to continue doing everything she could medically to protect her vulnerable patients.\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tCourtesy of Disney\n\t\n\n\n\n\n\tHaving played Addison now for nearly 180 episodes across “Grey’s” and “Practice Practice,” reprising the character feels “like putting on an old dress, but very sparkly still. It’s got a little sparkle, literally and figuratively,” Walsh tells Variety with a glint in her eye. “But, yeah, there’s a part of my psyche that will always be reserved space for Addison. It’s just in me. It’s so nice. It’s more like putting on a worn but comfortable glove that I could just go right into. All the metaphors are just so cheesy, but it’s like going home.”\n\n\t“It’s such a delight not just to work with Caterina, but to work with the entire crew that have been there, many of them since the very beginning,” she adds. “The last couple of times I’ve been back, I worked with Kim Raver as a director, and now we had Kevin McKidd again. I’ve worked with him a couple times, and he’s such a delight. It’s so fun just to work with friends.”\n\n\n\tIn the Jan. 29 episode, Addison returns to Seattle to convince Amelia — who has been on a sabbatical since the death of her colleague and friend, Monica Beltran (Natalie Morales) — to consult on a pregnant mother with neurological issues. But Addison’s return turns out to be as personal as it is professional. Following years of running the mobile clinic, Addison needs to confide in someone about the strain her work has put on her marriage to Jake Reilly (played by Benjamin Bratt on “Private Practice”), who is now threatening to leave her for not being a present partner and parent to their child, Henry.\n\n\n\t“Jake used to be in it with me. He used to call me every morning when I was on the road, and give me these pep talks — tell me how brave I was for doing work no one else would do. He’d send me these care packages with birth control pills and talk through difficult cases with me. He was on my side,” Addison tells Amelia, shortly after apologizing to her for pressuring her into taking their case of the week. “But now he hardly calls. And when he does, he complains about traffic on the 405, or Henry’s school, or me.”\n\t\n\n\tDuring the COVID-19 pandemic, Walsh quietly moved to Australia for a project, and stayed there. And while she still travels to North America and Europe for work, she logged on to our video call from her home in Perth, where she now lives with her Australian farmer fiancé, Andrew Nixon. “I’m about to go back to New York for a big fat stint in April. I’ve always kept my apartment, so I’ve gone back and forth. The Northern Hemisphere is my office, and then I just come home here, so it’s a little half and half. I’m very lucky,” she says, adding that she remains “hopeful” that the political climate in the U.S. will change in the near future.\n\n\tIn her only interview about her highly anticipated return to “Grey’s,” Walsh opens up below about the new but not entirely unsurprising development in Addison’s personal life; how she wanted to explore the emotional cost of laws and policies restricting abortion access on physicians; and whether she has been in touch with her former co-star Eric Dane, who played Addison’s late ex Mark Sloan, as he battles ALS. Walsh also confirms that the door is “always” open for her to reprise Addison, and she even has an idea for her next appearance.\n\t\n\t\n\t\tYou made your long-awaited return to Grey Sloan in Season 18, but you haven’t been back to visit since Season 19. What kinds of conversations did you have with showrunner Meg Marinis about what you wanted to accomplish with Addison’s return this time around?\t\n\n\tWe had been chatting, and I really wanted to have Addison come back a little shaken too, and she had pitched this idea. Amelia and Addison are always confidants, and Addison’s always obviously been there for Amelia, historically, whenever she’s in trouble — whether it’s with her addiction struggles or what have you — in the past. And I was like, “Yeah, but I think it would be cool to see Addison kind of messed up from everything that’s happening in the world, and how it’s affecting her.” So the last time we saw Addison, she was with Bailey and doing the mobile clinic for women. I was like, “I want to see some kind of wear and tear on her, or some kind of stress.” We hadn’t really seen Addison vulnerable in a while, like freaking out. So I thought that might be a little more interesting, a bit of a role reversal, and I think you see that in this episode.\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tCourtesy of Disney\n\t\n\n\n\t\n\t\tYou and Caterina have worked together for so long as Addison and Amelia, who are obviously family members — but your roles were a bit reversed this time, as you just described, since it’s Addison who’s the “dumpster fire” for once in that dynamic. Can you talk about what your dynamic is like now as scene partners?\t\n\n\tThis was her first episode back, so I think it was really fun just to be back for her on set. She and I always just jive so well and have great chemistry. She does feel like family to me. I just love going back. I put on my little scrubs or a fabulous pair of shoes and clothes, as the scene requires, and I’m Addison again. So it was really comforting, in a way. I kind of felt like a homing pigeon being called in, or like a spy coming in from the cold. I’m always happy to go work with her and everyone on the show, but it was really special to have just scenes with her in a way. It was very intimate.\n\t\n\t\tI’m personally curious about how you actually arrange these special guest-star appearances on “Grey’s,” given that you now live halfway across the world in Australia and the show still shoots in Los Angeles. Do you get personally approached about returning to “Grey’s,” or does your agent field that call? Does the creative team pitch you storylines for Addison and tell you where they see the character now, or is it more of a collaboration between all of you?\t\n\n\tWell, in recent years, whether it was Meg or [former showrunner] Krista Vernoff, we just reach out directly to each other because for Addison to come back, it’s always a creative beginning. And then it’s like, “OK, how can we do our schedules?” And then the agents usually get involved with just scheduling and all the minutiae of contract stuff, and travel, obviously. But it always starts creatively. So after all these years, that’s one of the nice things. It’s not always that way, but I am very fortunate that happens with most of the stuff that I work on.\n\n\tI just did a comedy [called “What the F*ck Is My Password?”] with Steve Pink, Alexander Ludwig, Stephen Dorff and all these people. That was a creative conversation, too, that started with my agent and manager, and they’re like, “Hey, there is this really fun, crazy thing that I think you’ll love.” We just shot that, but that started with them. I read it, and I was like, “Really? I don’t know.” And they’re like, “Just have a conversation with Steve,” who I’d known for years and years. He did “Hot Tub Time Machine” and “Grosse Pointe Blank,” and we came up together in Chicago. And then you’re like, “OK, let’s talk about it and see what we can do, what I can do.” So it’s always been creative for me.\n\t\n\t\tBut how exactly do you navigate those conversations about how Addison will come back and in what capacity? Does it always come down to your schedule, or do you have to be excited creatively about what the character is up to now?\t\n\n\tIt’s both. It’s scheduling and it’s also like, “Well, let’s just make this something that’s interesting and viable and relevant.” Obviously, it has to work within the context of not just my schedule, but the show and their storylines that they have going on already. But I always want it to be of value, and that it’s not just like, “Oh, hi! I’m here!” I want it to be important and meaningful.\n\t\n\n\tI think one of the things that “Grey’s” has always done — and Meg, of course, continues that, and she’s been there since the very beginning; she’s an OG “Grey’s” writer. They’ve always been able to deal with what’s happening in culture and in the world and run it through the filter of Grey Sloan or Seattle Grace, as it were back in the day, or Oceanside Wellness [on “Private Practice”], or whatever they’ve got. That’s how they sort of take the macro and bring it into the micro of that container, and I love it. The writing is so strong, and the relationships are so great. I think it’s very, very special not only that “Grey’s” is in its 22nd season — it’s like baseball at this point — but people have grown up and come along with these characters for all these 20-odd years. It’s really meaningful and special and intimate in a way that we don’t really have in any other aspect of storytelling.\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tCourtesy of Disney\n\t\n\n\n\t\n\t\tThere are some “Private Practice” fans who will have a lot of feelings about the “Grey’s” writers choosing to put Addison and Jake’s marriage in jeopardy — that union was supposed to be her happy ending, after all! — and the way this week’s episode ends suggests that they could be headed toward a divorce. Do you think there is any hope left for Addison and Jake?\t\n\n\tThere’s always hope! But I think, look, what she’s doing is so radically different, and everything’s changed so much. I think it’d be really interesting to actually see that transpire or see what comes of it. But I really loved [the storyline]. I was like, “She should be in jeopardy.” My thing is, I love that she’s doing all these things and coming back. There’s this sort of desperation, but how does that manifest in her life for real? How does it manifest at work? What does the clinic look like? Is Oceanside still [around]? What’s happening? So [I want] to have a little catch up and to actually see the ramifications of the choices she’s making and the sacrifices she’s making. I think a lot of people can relate to that.\n\t\n\t\tYou mentioned checking in with Addison, and now I can’t help but imagine seeing Jake appear onscreen again, but this time on “Grey’s” for the first time. Someone needs to give Benjamin Bratt a call and ask him to join Addison in Seattle next time.\t\n\n\tThat would be great. I would love that too. He’s such a delight.\n\t\n\t\n\t\tIn this week’s episode, Addison tells Amelia, “I don’t even recognize science anymore. All I know is that I can’t stomach sitting on the sidelines and watching people die, so I’m gonna choose work.” The helplessness that Addison feels as a world-class neonatal surgeon and OB/GYN in the current sociopolitical climate, following the fall of Roe v. Wade, is obvious, but what do you think is the long-term emotional cost of the work she is doing?\t\n\n\tI don’t think that she knows. Again, what’s so great about “Grey’s” is everyone’s kind of forced to take things a day at a time. But one of the things that Meg and the writers and everyone feels really passionately about — and I do too — is not just, of course, women’s health, but really the challenges in the macro with medicine. The episode, as you said, gets into what’s happening and how quickly things have changed for doctors and nurses and the whole medical community, and, of course, for patients as well — and access to good healthcare. It has just kind of all turned upside down beyond women’s health. I mean, it’s everybody. So I think that they do a great job of addressing it and dealing with it.\n\n\tAgain, I was interested in the personal aspect of it for the character of Addison and how it feels for her as an expert doctor with all these degrees and adjectives behind her name — how it feels to be an expert in your field and have it all turned upside down and shaken around like a snow globe. That’s what we were really interested in trying to embody. Like anybody, I think that you can hyperfocus on one thing — or one case in this episode — of, “I just have to try to help this person.” I think that for Addison, her emotions and her frustration and anxieties always get filtered through her cases and her patients, and that’s the same in this episode.\n\t\n\t\tA lot has been said and written about Addison’s evolution in the last two decades, but how have you personally seen her growth over the years?\t\n\n\tWell, [she went] from being the bitch in black — albeit in Fendi! But I think one of the things that Shonda is so great about is she would give you one character, and it’s such an archetype and you think, “Oh, this is the villain.” But she always would turn every character kind of like a bug on their back and show you the tender underbelly, or show you the humanity. I think for Addison, you saw her become more and more vulnerable and human and fallible, but still funny and all those things that define the multifaceted characters of Shondaland. But I think the thing I’m interested in, like anybody as we age, is just the vulnerability that comes through and the fragility a little more. There’s so many different places to go, still, with her.\n\t\n\t\n\t\tA lot of other “Grey’s” actors — both past and present — have mentioned being in contact with Eric Dane ever since he disclosed his battle with ALS last year. Have you been in touch with him at all? What has it been like for you to watch someone with whom you worked so closely battle this devastating disease?\t\n\n\t[Her face drops a little bit.] It’s so painful. It’s really sad. I haven’t been in touch with him, but I’ve reached out and sent my love and support and strength. It’s so heartbreaking. He’s such a beautiful person and such an incredible man, and I’ve had other friends that have battled with this disease, and it’s just horrific. So my heart goes out to him. I keep him, his family, his girls, in my prayers.\n\t\n\t\tYour characters, Addison and Mark, will forever be intertwined not only in the “Grey’s” universe, but in TV history.\t\n\n\tI know. That’s why it’s so heartbreaking to me, so emotional.\n\t\n\t\tLooking back, is there a particular storyline of Addison’s that you still find people wanting to talk to you about when they meet you, or on the street?\t\n\n\tWhat I’m always struck by is the people who tell me their personal stories, like, “Oh my God, I went to med school,” or “I became a nurse,” or “I watched this when I was in med school,” or “My mom and I watched this every week growing up.” And that’s really meaningful to me that this is a part of their life, and the power of storytelling and art is that it connects and unites people. But I’m trying to think… I mean, there’s always the very first moment of her entrance, which is like, “Oh my God!” That was the cliffhanger. Those 30 seconds, 60 seconds, 90 seconds, whatever it was, on television — I got probably the most notice for that than anything I’d done, ever. Talk about entrances. That was an iconic entrance.\n\t\n\n\tThis interview has been edited and condensed.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kate Walsh on Returning to ‘Grey’s Anatomy,’ Her ‘Family’ Bond With Caterina Scorsone and Why Fans Still Talk About Addison’s ‘Iconic’ Season 1 Entrance (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/KateWalsh-GreysAnatomy-MAIN.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-30T04:00:00.000Z",
      "dateModified": "2026-01-30T04:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sexy Ab Cracks -- Can You Guess The Fit Physique?!",
    "url": "https://www.tmz.com/2026/01/29/sexy-ab-cracks-guess-who/",
    "image": "https://imagez.tmz.com/image/54/16by9/2026/01/28/54462c4a446a44da9260bcce8f2719c8_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-29T23:19:29.000Z",
    "description": "\n    \n                    \n                          Sexy Ab Cracks\n                          Guess The Fit Physique ...\n                          Alo",
    "body": "\n    \n                    \n                          Sexy Ab Cracks\n                          Guess The Fit Physique ...\n                          Alo-Ha 💦!\n                      \n      \n    \n          Can you guess which famous model put her toned tummy on full display in this eye-popping shot?!\n      \n    \n          Here she is rockin' some ALO athleisure -- which definitely has us sayin, \"ALO-ha!\" When she's not on the catwalk, catch her hangin' with her famous rents in Beverly Hills!\n      \n    \n          Strut into the gallery for the big reveal, and then put your Beverly Hills skills to the test in this trivia quiz ...\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Hotties & Bodies\n              \n                          \n                Hot Bodies\n              \n                          \n                Guess Who\n              \n                          \n                Photo Galleries\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sexy Ab Cracks -- Can You Guess The Fit Physique?!",
      "image": [
        "https://imagez.tmz.com/image/54/16by9/2026/01/28/54462c4a446a44da9260bcce8f2719c8_xl.jpg"
      ],
      "datePublished": "2026-01-29T23:19:29.000Z",
      "dateModified": "2026-01-29T23:19:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'The Blind Side' Star Quinton Aaron Suffered Spinal Stroke",
    "url": "https://www.tmz.com/2026/01/29/quinton-aaron-suffered-spinal-stroke/",
    "image": "https://imagez.tmz.com/image/d6/16by9/2026/01/30/d6b25f33d93345fbb13e224dfcd326e0_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-30T00:55:28.000Z",
    "description": "\n    \n                    \n                          'The Blind Side' Quinton Aaron\n                          Suffered Spinal Stroke\n                 ",
    "body": "\n    \n                    \n                          'The Blind Side' Quinton Aaron\n                          Suffered Spinal Stroke\n                      \n                  \n                                                                        Published \n                              January 29, 2026\n                            4:55 PM PST\n                                                                      |\n                                                                Updated \n                                  January 29, 2026\n                                7:54 PM PST\n                                    \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          \"The Blind Side\" star Quinton Aaron's family is revealing what led to his hospitalization ... they tell us he suffered a spinal stroke.\n      \n    \n          Quinton's family tells us he is \"alert, aware and recovering.\"\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          In a statement Thursday, Aaron's family says ... \"We acknowledge that you’ve heard about Quinton Aaron‘s condition. We appreciate the overwhelming love, support and prayers that Quinton has received over the past few days from his fans, the public, and our concerned community.\"\n      \n    \n          They add ... \"To update everyone, he had a spinal stroke. He is alert, aware and recovering.\"\n      \n\n                  \n          \n                          \n                \n                  \n      \n    \n          The statement continues ... \"The Aaron family has a lot to deal with for the betterment of their loved one, but will be sure to keep everyone posted regarding Quinton‘s health as we see fit.\"\n      \n    \n          They say, \"To be clear, any other information that you hear pertaining to Quinton’s health from any other source that isn’t coming directly from his official blood relative family, that will come in the form of their appointed chosen spokesperson and life long friend Liana Mendoza, is not to be taken as factual information.\"\n      \n    \n          Quinton's family adds ... \"We kindly ask the public to please respect the decisions we make and to please understand that false information or statements may be made by others who continue to come forward but are not fully informed or aware of all of the facts surrounding his condition nor are they authorized to do so.\"\n      \n    \n          They continue ... \"If there continues to be indications of, or individuals who speak about his condition without consent, which violates HIPAA laws, we strongly urge you not to, because there will be legal repercussions.\"\n      \n    \n          The statement ends ... \"Thank you once again for the outpouring of love. We send Peace & Love.\"\n      \n    \n          Quinton has since been hospitalized for about a week and has been on life support.\n      \n    \n          Spinal strokes happen when something stops blood flow in the spinal cord ... like blood clots or hemorrhages ... according to the Cleveland Clinic.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Quinton Aaron\n              \n                          \n                Celebrity News\n              \n                          \n                Family\n              \n                          \n                Movies\n              \n                          \n                Exclusive\n              \n                          \n                Health\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'The Blind Side' Star Quinton Aaron Suffered Spinal Stroke",
      "image": [
        "https://imagez.tmz.com/image/d6/16by9/2026/01/30/d6b25f33d93345fbb13e224dfcd326e0_xl.jpg"
      ],
      "datePublished": "2026-01-30T00:55:28.000Z",
      "dateModified": "2026-01-30T00:55:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Heidi Klum Shirtless Under Fur Coat Teasing New Song With Diplo",
    "url": "https://www.tmz.com/2026/01/29/heidi-klum-shirtless-fur-coat-diplo/",
    "image": "https://imagez.tmz.com/image/2e/16by9/2026/01/29/2e2c11386c3a471a9d0414bc8a68f77f_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-29T22:31:41.000Z",
    "description": "\n    \n                    \n                          Heidi Klum\n                          Bare Hugging My Fur Coat!!!\n                      \n      \n  ",
    "body": "\n    \n                    \n                          Heidi Klum\n                          Bare Hugging My Fur Coat!!!\n                      \n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Heidi Klum never met a top she didn't want to immediately take off ... and she's using her love for the nude to push a new musical venture.\n      \n    \n          The supermodel is promoting her new song with Diplo by, you guessed it, going topless ... which is her signature move.\n      \n    \n        Waiting for your permission to load the Instagram Media.\n      \n    \n          In a social media post teasing the upcoming track, Heidi is letting the girls breathe under a white furry coat ... and she's wearing some sexy lingerie bottoms, along with some knee-high boots.\n      \n\n          The song is called \"Red Eye\" but Heidi isn't on a plane here ... instead, she's got boots on the ground ... in the middle of some train tracks. Makes sense.\n      \n    \n      \n        \n              \n    \n    \n          Heidi says the new song is for the 21st season of \"Germany's Next Topmodel\" ... and it's available to stream February 13 ... the day before Valentine's Day.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Diplo\n              \n                          \n                Heidi Klum\n              \n                          \n                Social Media\n              \n                          \n                Hot Bodies\n              \n                          \n                Fashion\n              \n                          \n                Models\n              \n                          \n                Music\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Heidi Klum Shirtless Under Fur Coat Teasing New Song With Diplo",
      "image": [
        "https://imagez.tmz.com/image/2e/16by9/2026/01/29/2e2c11386c3a471a9d0414bc8a68f77f_xl.jpg"
      ],
      "datePublished": "2026-01-29T22:31:41.000Z",
      "dateModified": "2026-01-29T22:31:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nicki Minaj Fans Fight Over Supporting Her Amid Trump Saga",
    "url": "https://www.tmz.com/2026/01/29/nicki-minaj-fans-debate-support/",
    "image": "https://imagez.tmz.com/image/57/16by9/2026/01/29/57b3c0cbcb604094b4e5038d01eb04f4_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-29T21:23:08.000Z",
    "description": "\n    \n                    \n                          'TMZ Live'\n                          Trump Is Breaking Up Barbz, Nicki Minaj's Fans Argue\n       ",
    "body": "\n    \n                    \n                          'TMZ Live'\n                          Trump Is Breaking Up Barbz, Nicki Minaj's Fans Argue\n                      \n                  \n                                                                        Published \n                              \n                January 29, 2026\n                \n                            1:23 PM PST\n                                                                      |\n                                                                Updated \n                                  January 29, 2026\n                                2:37 PM PST\n                                    \n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          Nicki Minaj fans are taking sides after watching her cozy up to President Trump ... some are sticking by her, and others are dropping her like a bad habit.\n      \n    \n          The battle of the Barbz played out Thursday on \"TMZ Live\" when we had a couple supporters join our show and explain why Nicki's embrace of Trump is either a deal-breaker ... or no big deal.\n      \n    \n          Blair Thompson says he's cutting the cord when it comes to Nicki ... and he tells us why her politics feel like a slap in the face to lots of her longtime supporters who come from diverse backgrounds.\n      \n\n      \n        \n                    \n                  \n      \n                    FOX 9 Minneapolis-St. Paul\n          \n    \n          On the other hand, Tre The Entertainer is still all-in when it comes to Nicki ... and it sounds like he's separating the art from the artist. Tre's been a Barb since he was 13, and it seems he's ride-or-die.\n      \n    \n          Nicki being Trump's biggest supporter looks like it's working out for her ... the Trinidad-born rapper has one of the Trump Gold Cards ... but it's definitely costing her some of her diehard fans -- just not all of them.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Nicki Minaj\n              \n                          \n                Donald Trump\n              \n                          \n                Live Stream\n              \n                          \n                Hip Hop\n              \n                          \n                Politics\n              \n                          \n                Exclusive\n              \n                          \n                Controversial S#!T\n              \n                          \n                Music\n              \n                          \n                News\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nicki Minaj Fans Fight Over Supporting Her Amid Trump Saga",
      "image": [
        "https://imagez.tmz.com/image/57/16by9/2026/01/29/57b3c0cbcb604094b4e5038d01eb04f4_xl.jpg"
      ],
      "datePublished": "2026-01-29T21:23:08.000Z",
      "dateModified": "2026-01-29T21:23:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "President Trump's Cabinet Members Show Up For 'Melania' Premiere",
    "url": "https://www.tmz.com/2026/01/29/trump-cabinet-members-attend-melania-documentary-premiere/",
    "image": "https://imagez.tmz.com/image/de/16by9/2026/01/30/de7457dc07d64387905b5040f559869a_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-30T02:19:31.000Z",
    "description": "\n                    \n                          President Trump's Cabinet\n                          No Way We'd Miss Melania Premiere!!!\n             ",
    "body": "\n                    \n                          President Trump's Cabinet\n                          No Way We'd Miss Melania Premiere!!!\n                      \n                  \n                                                                        Published \n                              January 29, 2026\n                            6:19 PM PST\n                                                                            \n              \n    \n          When President Trump invites his underlings to a social event, they show up ... look no further than the premiere of Amazon's new Melania Trump documentary.\n      \n    \n          The Kennedy Center looked like a Trump cabinet meeting Thursday night ... with a who's-who of Republican elected officials showing up in support of their boss and the First Lady.\n      \n    \n          Dr. Oz, administrator of the Centers for Medicare & Medicaid Services, was in the house with his family. Ditto for Speaker of the House Mike Johnson and his wife, Kelly Lary.\n      \n\n                  \n          \n                          \n                \n                  \n      \n    \n          Howard Lutnick, the Secretary of Commerce, made the trek with his wife, Allison ... as did Secretary of the Interior Doug Burgum and his better half, Kathryn.\n      \n    \n          Secretary of Defense Pete Hegseth and his wife, producer Jennifer Rauchet, showed up to support the Trumps ... same goes for E.P.A. administrator Lee Zeldin and his wife, Diana.\n      \n    \n          Linda McMahon, the Secretary of Education, was flying solo ... as was Alina Habba, who recently resigned as the U.S. attorney for New Jersey.\n      \n    \n          Kelly Loeffler, the Small Business Administration honcho, showed up with her billionaire husband, Jeffrey Sprecher ... and Michael Waltz, our ambassador to the United Nations, was there with his wife, Julia Nesheiwat.\n      \n    \n          Sources at the premiere tell TMZ … a black car was sent to each guest's home, transporting them to and from the premiere ... and the Kennedy Center had an open bar serving up pomegranate Cosmopolitans and French 75s, plus wine, Champagne and non-alcoholic drinks.\n      \n    \n          We're told folks in attendance got gift bags ... among the items inside was a compact mirror that read on the front, \"Everyone wants to know.\"\n      \n    \n          Our sources say there was also a make-your-own cologne station ... and a sketch artist.\n      \n    \n          Seems the Trump admin really knows how to turn up!!!\n      \n      ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "President Trump's Cabinet Members Show Up For 'Melania' Premiere",
      "image": [
        "https://imagez.tmz.com/image/de/16by9/2026/01/30/de7457dc07d64387905b5040f559869a_xl.jpg"
      ],
      "datePublished": "2026-01-30T02:19:31.000Z",
      "dateModified": "2026-01-30T02:19:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]