[
  {
    "title": "Fetty Wap Released From Prison Early After Serving Three Years in Drug Trafficking Case",
    "url": "https://variety.com/2026/music/news/fetty-wap-released-prison-three-years-drug-trafficking-1236626810/",
    "image": "https://variety.com/wp-content/uploads/2021/10/Untitled-1-e1767917073656.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-09T00:10:59.000Z",
    "description": "\n\tFetty Wap has been released from prison after serving three years of a six-year sentence, his rep tells Variety.\n\n\tThe rapper, whose real name is Wi",
    "body": "\n\tFetty Wap has been released from prison after serving three years of a six-year sentence, his rep tells Variety.\n\n\tThe rapper, whose real name is Willie Junior Maxwell II, also confirmed on social media that he was freed from incarceration. “Home,” he wrote on Instagram Stories.\n\n\tIn a statement shared with Variety, Fetty said, “I want to thank my family, friends, and fans for the love, prayers, and continued support—it truly means everything to me. Right now, my focus is on giving back through my community initiatives and foundation, supporting at-risk young children by expanding access to education, early tech skills, and vision care for young kids and students so they can show up as their best selves. I’m committed to moving forward with purpose and making a meaningful impact where it matters most.”\n\t\n\n\tThe rapper was initially sentenced to six years in prison and five years of post-release supervision back in May 2023 for his involvement in a drug trafficking ring where narcotics were shipped from the West Coast to be sold in New Jersey and Long Island.\n\n\tHe was initially arrested in October 2021 and pleaded guilty in August 2022, facing a minimum of five years in prison. He was serving his sentence at a low-security prison in Sandstone, Minnesota, and was scheduled for release this December.\n\n\tFetty is best known for his smash hits “Trap Queen” and “My Way,” among other hits. While incarcerated, he released the single “Forever (71943509)” in May 2025 and appeared as a guest on Doe Boy’s “Lil Sexy” the following month.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Fetty Wap Released From Prison Early After Serving Three Years in Drug Trafficking Case",
      "image": [
        "https://variety.com/wp-content/uploads/2021/10/Untitled-1-e1767917073656.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-09T00:10:59.000Z",
      "dateModified": "2026-01-09T00:10:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Conan O’Brien Criticizes Comedians Who Are Too Serious and Only Want to Say ‘F— Trump’: ‘If You’re Just Angry, You’ve Lost Your Best Tool’",
    "url": "https://variety.com/2026/tv/news/conan-obrien-criticizes-comedians-anti-trump-serious-1236626599/",
    "image": "https://variety.com/wp-content/uploads/2025/03/conan.png?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-08T23:42:53.000Z",
    "description": "\n\tConan O’Brien recently took part in a nearly hour-long discussion with Oxford Union and criticized comedians whose material have become dominated wi",
    "body": "\n\tConan O’Brien recently took part in a nearly hour-long discussion with Oxford Union and criticized comedians whose material have become dominated with serious, anti-Trump commentary. The former late night host said Trump is not good for comedy at large because “comedy needs a straight line to go off of, and we don’t have a straight line right now. We have a very bendy, rubbery line” (via Mediaite).\n\n\t“Some comics go the route of “I’m going to just say “F Trump” all the time’… that’s their comedy,” O’Brien said. “And I think well now, a little bit, you’re being co-opted because you’re so angry. You’ve been lulled. It’s like a siren leading you into the rocks. You’ve been lulled into just saying ‘F Trump. F Trump. F Trump. Screw this guy.’ And I think you’ve now put down your best weapon, which is being funny, and you’ve exchanged it for anger.”\n\t\n\n\tO’Brien pushed back against the idea that because the state of world has gotten so serious it means comedians also need to be serious all the time.\n\n\t“That person or any person that would say, ‘Well, things are too serious now. I don’t need to be funny.’ And I think, well, if you’re a comedian, you always need to be funny,” he said. “You just have to find a way. And you just have to find a way to channel that anger into a way…because good art will always be a great weapon, will always be a perfect weapon against power. But if you’re just screaming and you’re just angry, you’ve lost your best tool in the toolbox.”\n\n\tO’Brien found himself in the center of a Trump controversy last year when he attended the Kennedy Center‘s event to accept the Mark Twain Prize for American Humor. The event was held after Donald Trump‘s election to the Kennedy Center board and his takeover of the center. Trump has since added his name to the building in a controversial move. \n\t\n\n\t“Obviously for the last couple of months with the new administration, there’s been some controversial stuff going on with the Kennedy Center,” O’Brien said during an August eepisode of his “Conan O’Brien Needs a Friend” podcast months after his ceremony. “There was a question of, ‘Should I go? Should I not go?’ And I felt like it was important to show up.”\n\n\tO’Brien explained that he was awarded by the “old regime” and that he “thought we should honor their decision.” The event marked the first national event at the Kennedy Center since chairman David Rubenstein and president Deborah Rutter were replaced by Trump last February.\n\n\tO’Brien is currently the host of the popular “Conan O’Brien Needs a Friend” podcast and is set to return as Oscars host in March. Watch his full discussion with Oxford Union in the video below.\n\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Conan O’Brien Criticizes Comedians Who Are Too Serious and Only Want to Say ‘F— Trump’: ‘If You’re Just Angry, You’ve Lost Your Best Tool’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/03/conan.png?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-08T23:42:53.000Z",
      "dateModified": "2026-01-08T23:42:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Hollywood Unions Pencil in Bargaining Dates as AI and Health Funding Issues Loom",
    "url": "https://variety.com/2026/film/news/hollywood-unions-bargaining-dates-1236626773/",
    "image": "https://variety.com/wp-content/uploads/2025/05/GettyImages-1760960350.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-09T01:04:27.000Z",
    "description": "\n\tThe Hollywood unions are penciling in bargaining dates for the coming months, as they prepare to negotiate with the studios about thorny issues like",
    "body": "\n\tThe Hollywood unions are penciling in bargaining dates for the coming months, as they prepare to negotiate with the studios about thorny issues like artificial intelligence and health coverage.\n\n\tSAG-AFTRA told members last month that its negotiators will sit down with the Alliance of Motion Picture and Television Producers on Feb. 9. Those talks are due to run through March 6.\n\n\tThe Writers Guild of America is expected to begin talks 10 days later, on March 16. The WGA contract expires on May 1, and those negotiations typically go down to the wire.\n\t\n\n\tThe Directors Guild of America is expected to begin its talks 10 days after that, on May 11. The DGA and SAG-AFTRA contracts each expire on June 30. If the SAG-AFTRA talks do not result in a deal before the WGA talks start, there will still be an opportunity to resume negotiations in June before the expiration.\n\n\n\tThe negotiations will be the first since the writers and actors strikes of 2023, and will likely revisit the concerns that animated those stoppages, such as AI and residuals on streaming platforms. Traditionally, the first of the three unionn to negotiate — often, the DGA — has set a pattern for the other two. But that dynamic broke down to a large extent in the last cycle and may or may not return.\n\n\tThe industry has struggled over the last three years, particularly in Los Angeles. Negotiators are expected to focus on items that could boost jobs for members while being wary of jeopardizing a recovery.\n\n\tIn their message to members last month, SAG-AFTRA leaders said they had asked for an early negotiating window in order to give plenty of time to talk, and to avoid threatening “the nascent but much-needed resurgence in domestic production activity.”\n\t\n\n\tThe slowdown in production has also put a strain on industry health plans, which could force negotiators to look into adjusting benefit structures. The AMPTP has begun laying the groundwork on that issue, putting out a five-page report last month showing that guild members get relatively generous health coverage.\n\n\tThe report showed that compared to other large employer-based plans, DGA, WGA and SAG-AFTRA members pay lower premiums, have lower deductibles, and have lower out-of-pocket maximums.\n\n\tThe AMPTP has also floated the idea of a five-year contract — instead of the typical three-year deal — indicating that studios would be willing to pay a premium to buy an extended period of labor peace.\n\n\tThe unions are also expected to renew their push to protect members from the threat of AI. The writers and actors sought in 2023 to protect members’ work from being used to train AI systems. While they won a range of other AI guardrails, they were not able to secure anything on training. Disney’s recent deal with OpenAI — which allows Disney characters on Sora 2 — has heightened concerns around that issue.\n\n\tThe unions and the AMPTP declined to comment on the bargaining dates.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Hollywood Unions Pencil in Bargaining Dates as AI and Health Funding Issues Loom",
      "image": [
        "https://variety.com/wp-content/uploads/2025/05/GettyImages-1760960350.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-09T01:04:27.000Z",
      "dateModified": "2026-01-09T01:04:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sarah Jessica Parker Has Emotional ‘Sex and the City’ Reunion While Accepting Golden Globe Prize, Quips She Has a ‘Permanent Residency’ at HBO",
    "url": "https://variety.com/2026/awards/news/sarah-jessica-parker-sex-and-the-city-reunion-golden-eve-1236626708/",
    "image": "https://variety.com/wp-content/uploads/2026/01/GF1_3130.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-09T01:09:15.000Z",
    "description": "\n\tIt was a “Sex and the City” celebration when Sarah Jessica Parker was honored with the Carol Burnett Award during “Golden Eve: The Golden Globes Hon",
    "body": "\n\tIt was a “Sex and the City” celebration when Sarah Jessica Parker was honored with the Carol Burnett Award during “Golden Eve: The Golden Globes Honor Helen Mirren & Sarah Jessica Parker,” which aired on Thursday night on CBS.\n\n\tIn addition to her husband and children, Parker was supported by Kristin Davis, Evan Handler and David Eigenberg, best known as Charlotte, Harry and Steve in the HBO series, two movies, and revival, “And Just Like That.”\n\t\n\n\tDavis took the stage at the Beverly Hilton to honor her costar, getting choked up multiple times during her speech.\n\n\n\t“‘Sex and the City’ has a lot of great themes, but my favorite theme is honoring the importance of friendship, of life, long chosen family, and that’s what you are to me,” Davis said through tears. “It is a joy to be with you in this life and to be here tonight.”\n\n\tDuring the night, two montages showed clips from Parker’s career — the first dedicated to roles other than Carrie Bradshaw, the second all about Carrie. During one clip of her winning a Golden Globe (she took home three acting Globes during the show’s run), both Davis and Cynthia Nixon were shown applauding. Kim Cattrall, who has a long-standing feud with Parker, did not appear. However, later in the montage was footage of the four women walking the streets of New York — an image that fans of the show have cemented into our minds. One person who did not appear was Chris Noth, who played Carrie’s on-again, off-again love, Mr. Big. Noth was removed from the “And Just Like That” finale in 2021 after multiple claims of sexual assault. He denied all claims. Many of Carrie’s other love interests were featured.\n\t\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tChristopher Polk\n\t\n\n\n\n\tAfter a beautiful introduction by her husband, Matthew Broderick, Parker took the stage, and reflected on meeting Burnett. She shared stories about their bond and the importance of the honor. \n\n\t“Like millions of others, I revered Carol Burnett when I was very young. We didn’t have a television so I would call a friend and I would invite myself over on Saturday nights, so I could watch ‘The Carol Burnett Show’ on CBS,” she said. “Carol was a North Star. She was an inspiration. I could not possibly have articulated at age eight or nine, but came to understand my feelings about her as wonderment and idolatry.”\n\n\tShe later brought up “SATC” and her love for the characters created, thanking Casey Bloys and the team for allowing her to have a “permanent residency” at the network.\n\n\t“I met Carrie Bradshaw, Charlotte York, Samantha Jones and Miranda Hobbs, and I spent 25 years with the most glorious ensemble of women and actors, where we treated all of New York like CBS Television City and the streets like studio 33,” Parker said. “I cherish every 15th hour on the set or 16th hour, every walk and talk, looking into your eyes for the hardest and silliest moments. As Kristen once said, ‘You are in my bones.'”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sarah Jessica Parker Has Emotional ‘Sex and the City’ Reunion While Accepting Golden Globe Prize, Quips She Has a ‘Permanent Residency’ at HBO",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/GF1_3130.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-09T01:09:15.000Z",
      "dateModified": "2026-01-09T01:09:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Tangled’: Kathryn Hahn in Talks to Play Mother Gothel in Disney’s Live-Action Movie",
    "url": "https://variety.com/2026/film/news/kathryn-hahn-mother-gothel-tangled-1236626716/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Kathryn-Hahn-and-Mother-Gothel.jpg?crop=0px%2C10px%2C1000px%2C562px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-01-08T22:50:33.000Z",
    "description": "\n\tKathryn Hahn isn’t quite done being a Disney villain.\n\n\tVariety has confirmed the “Agatha All Along” star is eyeing a leading role in the studio’s l",
    "body": "\n\tKathryn Hahn isn’t quite done being a Disney villain.\n\n\tVariety has confirmed the “Agatha All Along” star is eyeing a leading role in the studio’s live-action “Tangled” film, in the role of baddie Mother Gothel. \n\n\tWhile Hahn is only in talks, she would join the previously reported Teagan Croft in the role of Rapunzel and Milo Manheim as Flynn Rider as third lead. Mother Gothel is the villain of the original animated film, one who poses as an overprotective guardian to Rapunzel while secretly using her ward’s magic hair to stay young and beautiful. Disney had no comment on the matter.\n\t\n\n\tMichael Gracey (“The Greatest Showman”) will direct the project, set to roll later this year. Kristin Burr (“Freakier Friday,” “Cruella”) is producing from a script by multi-hyphenate Jennifer Kaytin Robinson (“Someone Great,” “Do Revenge,” “I Know What You Did Last Summer”). \n\n\n\tThe original “Tangled” released in 2010 and earned nearly $600 million at the worldwide box office. The voice cast featured Mandy Moore, Zachary Levi, Brad Garrett and Donna Murphy as Mother Gothel.\n\n\tHahn is on a hot streak with Apple’s awards magnet “The Studio,” where she portrays the foul-mouthed label-whore film marketing executive Maya Mason. The comedy followed the “Agatha” series on Disney+, a spinoff from “WandaVision” where she debuted as Marvel witch Agatha Harkness. She will next appear in “Madden,” David O. Russell’s John Madden biopic starring Christian Bale, Nicolas Cage, Sienna Miller and John Mulaney.\n\n\tShe previously appeared in series including “Mrs. Fletcher,” “Tiny Beautiful Things” and “Transparent.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Tangled’: Kathryn Hahn in Talks to Play Mother Gothel in Disney’s Live-Action Movie",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Kathryn-Hahn-and-Mother-Gothel.jpg?crop=0px%2C10px%2C1000px%2C562px&resize=1000%2C563"
      ],
      "datePublished": "2026-01-08T22:50:33.000Z",
      "dateModified": "2026-01-08T22:50:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Hybe America Names Ethiopia Habtemariam President of Music",
    "url": "https://variety.com/2026/music/news/hybe-america-ethiopia-habtemariam-president-of-music-1236626709/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Ethiopia2-e1767911453477.jpg?w=508&h=339&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-08T22:31:27.000Z",
    "description": "\n\tHybe America has named former Motown and Universal Publishing top exec Ethiopia Habtemariam as president of music, effective immediately. She will b",
    "body": "\n\tHybe America has named former Motown and Universal Publishing top exec Ethiopia Habtemariam as president of music, effective immediately. She will be based in Los Angeles and Atlanta.\n\n\tAccording to the announcement, in the role, Habtemariam will help advance the company’s long-term growth strategy, spearheading A&R and artist development initiatives across the company’s label ecosystem and identifying new creative and commercial opportunities at the intersection of music, culture, and fandom. She will also play a key role in expanding the company’s presence in Atlanta, her hometown and a global epicenter of R&B and hip-hop, further strengthening Quality Control’s presence and impact.\n\t\n\n\t“Ethiopia is a once-in-a-generation leader whose impact on artists, songwriters, culture, and the music business is undeniable,” said Hybe America chairman-CEO Isaac Lee, to whom Habtemariam will report. “Her vision, taste, and strategic insight make her uniquely suited to help shape the next chapter of Hybe America as we continue building a future-facing entertainment company centered on artists and fans.”\n\n\n\t“I’ve long admired how Hybe America approaches artists, fans, and the future of entertainment,” said Habtemariam. “This is a company building with intention and investing for the long term while staying deeply connected to culture. I’m excited to contribute my experience as HYBE AMERICA continues to shape what’s next for music on a global scale.”\n\n\tMost recently, Habtemariam served as Chairwoman and CEO of Motown Records. During her tenure, she spearheaded the landmark Quality Control–Motown label venture, overseeing the signing and development of genre-defining artists including Lil Yachty, City Girls, Migos and Lil Baby while also signing and championing artists such as Leon Thomas and NBA YoungBoy to the label.\n\t\n\n\tPrior to Motown, Habtemariam spent more than two decades at Universal Music Group, holding senior leadership roles across Universal Music Publishing, Capitol Music Group and Motown Records. During her tenure at Universal Music Publishing, she played a pivotal role in the signing and development of influential artists and songwriters including Chris Brown, Theron Thomas, J. Cole, Justin Bieber, Ciara, Polow Da Don, Jhene Aiko, Cardo, Hit Boy, Keri Hilson and Happy Perez.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Hybe America Names Ethiopia Habtemariam President of Music",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Ethiopia2-e1767911453477.jpg?w=508&h=339&crop=1"
      ],
      "datePublished": "2026-01-08T22:31:27.000Z",
      "dateModified": "2026-01-08T22:31:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Lost in Translation: Guilds Ignored Global Cinema’s Banner Year – Will the Oscars Correct It?",
    "url": "https://variety.com/2026/film/awards/guilds-snub-international-films-sentimental-value-1236625679/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Sentimental-Valur-Sirat-It-Was-Just-an-Accident-Kokuho-The-Voice-of-Hind-Rajab.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-08T23:20:14.000Z",
    "description": "\n\tThere is a quiet contradiction bubbling up this Oscar season, but you might need subtitles to understand it.\n\n\tComing off nominations for The Actor ",
    "body": "\n\tThere is a quiet contradiction bubbling up this Oscar season, but you might need subtitles to understand it.\n\n\tComing off nominations for The Actor Awards and Directors Guild of America, social media and industry voices are becoming vocal about the fact that despite a banner year for non-English language filmmaking, the major guilds have been ignoring these achievements.\n\n\tThe Academy of Motion Picture Arts and Sciences has spent the last decade globalizing — expanding to over 11,000 members across 60 countries. That transformation has shown up on ballots. Last year, it elevated Fernanda Torres to a best actress nomination for the Brazilian drama “I’m Still Here,” which was then embraced in best picture. The year prior, two non-English language movies were recognized for the first time: the French legal thriller “Anatomy of a Fall” and the timely U.K. Holocaust German-language drama “The Zone of Interest.”\n\t\n\n\tMeanwhile, America’s guilds remain locked in a narrower vision. This week, SAG-AFTRA and the DGA shut out international cinema entirely. No foreign-language performances. No international directors in the main best director category. \n\n\n\tJoachim Trier’s Norwegian family drama “Sentimental Value,” Park Chan-wook’s South Korean black comedy “No Other Choice,” Oliver Laxe’s Spanish rave thriller “Sirât,” Kleber Mendonça Filho’s Brazilian political thriller “The Secret Agent” and Jafar Panahi’s Palme d’Or winner “It Was Just an Accident” were all passed over. And those are just the high-profile titles.\n\n\tThere’s also Kaouther Ben Hania’s true story of a 5-year-old Palestinian girl being killed in “The Voice of Hind Rajab,” Neeraj Ghaywan’s Indian coming-of-age story “Homebound,” Dolores Fonzi’s Argentine legal drama “Belén,” Lee Sang-il’s Japanese historical wonder “Kokuho” and more. However, Hasan Hadi was recognized in the first-time director DGA category for his Iraqi film “The President’s Cake.”\n\t\n\n\tMany of these auteurs have dominated critical year-end lists and shaped conversations about cinema’s direction. Yet when guild voters spoke, they spoke only in English.\n\n\tOn one side sits a globalized Academy — broader, younger, more international than at any point in its history — whose evolving membership has embraced a wide spectrum of cinematic voices. On the other sit America’s guilds, shaped by domestic members, whose nominations this week suggested a far narrower definition of what counts as prestige filmmaking.\n\n\tThis is not new.\n\n\n\n\t\n\n\t\t\t\t\t“Sirât”\n\t\t\t\t\t\t\t\t\tNeon\n\t\n\n\n\n\tOver the past decade, AMPAS has undergone a fundamental transformation. Its total membership now stands at more than 11,000, with 55% of the most recent invitees being international, with 41% identifying as women and 45% coming from underrepresented racial or ethnic communities.\n\n\tIn a conversation with an Academy voter, when asked about the matter, they posited that some in Hollywood may be focusing more on their own country. “It’s a different time, and it’s a different administration,” the anonymous AMPAS member tells Variety. “Hollywood, and the Academy, has never been as liberal as all conservative right-wingers and conspiracy theorists want you to believe. I talk with these people every day, and there’s a sense they want to keep it all in America.”\n\n\tThe guilds, by contrast, remain structurally narrower — not only in who votes, but in how their ecosystems reward familiarity. \n\n\tThe SAG Awards and the DGA are American institutions first, global arbiters second. Their rosters skew heavily domestic, since membership generally requires authorization to work in the U.S. \n\n\tThe DGA, to its credit, has long articulated a mission rooted in inclusion. Its diversity initiatives date back to the establishment of the Women’s Steering Committee in 1979 and its current mission statement explicitly frames storytelling as a global enterprise. The DGA can point to genuine progress — this year’s lineup marks only the second time a majority of nominees represent underrepresented communities, echoing a pivotal 2017 slate. Guillermo del Toro’s return with his “Frankenstein” nomination signals continuity.\n\n\tThe Oscars have recognized what the guilds have not: The Oscar race to recognize cinema’s greatest achievements is no longer a single lane. It’s a collision point where international films, American independents and studio prestige converge. One institution has adjusted to that reality. The others are lagging behind, still treating global cinema as supplemental rather than central.\n\t\n\n\tThis matters because visibility creates opportunity. When guilds ignore entire categories of achievement, they don’t just fail to predict; they actively narrow the conversation about what constitutes excellence. \n\n\tIf American guilds want to remain culturally relevant, they need to diversify more than their mission statements. They need to challenge their cultural assumptions. The future of the Oscars is already multilingual, borderless and already redefining excellence.\n\n\tWhat makes the moment especially striking is how the Oscar math is diverging from the signals coming out of the guilds — and how narrowly diversity is often framed in that conversation. Diversity is a wider concept — it’s not limited to ethnicity or race, or with films made outside the English language. It can also look like a Black filmmaker standing on the brink of unprecedented institutional recognition. Ryan Coogler’s “Sinners” is currently projected to earn 15 Oscar nominations, a total that would surpass the Academy’s all-time record held by “All About Eve,” “Titanic” and “La La Land.”\n\n\t2025 didn’t lack worthy global cinema. It may just lack institutions willing to catch up.\n\n\tThis week’s Oscar predictions are below.\n\n\t*** = PREDICTED WINNER(All predicted nominees below are in alphabetical order)\n\n\n\n\t\n\n\t\t\t\t\t“Sinners”\n\t\t\t\t\t\t\t\t\tEli Ade\n\t\n\n\n\t\n\t\tOscars Predictions Tracking(Jan. 8, 2026)\t\n\n\tBest Picture“Blue Moon” (Sony Pictures Classics)“Bugonia” (Focus Features)“Frankenstein” (Netflix)“Hamnet” (Focus Features) “It Was Just an Accident” (Neon)“Marty Supreme” (A24)“One Battle After Another” (Warner Bros.) “Sentimental Value” (Neon)“Sinners” (Warner Bros.) ***“Train Dreams” (Netflix)\n\n\tDirectorPaul Thomas Anderson, “One Battle After Another” (Warner Bros.) ***Ryan Coogler, “Sinners” (Warner Bros.)Guillermo Del Toro, “Frankenstein” (Netflix)Jafar Panahi, “It Was Just an Accident” (Neon)Chloé Zhao, “Hamnet” (Focus Features)\n\n\tActorTimothée Chalamet, “Marty Supreme” (A24) Leonardo DiCaprio, “One Battle After Another” (Warner Bros.) Ethan Hawke, “Blue Moon” (Sony Pictures Classics) ***Michael B. Jordan, “Sinners” (Warner Bros.)Wagner Moura, “The Secret Agent” (Neon)\n\n\tActressJessie Buckley, “Hamnet” (Focus Features) ***Rose Byrne, “If I Had Legs I’d Kick You” (A24)Kate Hudson, “Song Sung Blue” (Focus Features)Chase Infiniti, “One Battle After Another” (Warner Bros.)Renate Reinsve, “Sentimental Value” (Neon)\n\n\tSupporting ActorBenicio Del Toro, “One Battle After Another” (Warner Bros.) Jacob Elordi, “Frankenstein” (Netflix)Paul Mescal, “Hamnet” (Focus Features)Sean Penn, “One Battle After Another” (Warner Bros.) Stellan Skarsgård, “Sentimental Value” (Neon) ***\n\n\tSupporting ActressAriana Grande, “Wicked: For Good” (Universal Pictures) Inga Ibsdotter Lilleaas, “Sentimental Value” (Neon) Amy Madigan, “Weapons” (Warner Bros.) ***Wunmi Mosaku, “Sinners” (Warner Bros.)Teyana Taylor, “One Battle After Another” (Warner Bros.)\n\t\n\n\tOriginal Screenplay“Blue Moon” (Sony Pictures Classics) — Robert Kaplow“It Was Just an Accident” (Neon) — Jafar Panahi“Marty Supreme” (A24) — Ronald Bronstein and Josh Safdie“Sentimental Value” (Neon) — Joachim Trier and Eskil Vogt “Sinners” (Warner Bros.) — Ryan Coogler ***\n\n\tAdapted Screenplay“Bugonia” (Focus Features) — Will Tracy“Frankenstein” (Netflix) — Guillermo Del Toro“Hamnet” (Focus Features) — Chloé Zhao “One Battle After Another” (Warner Bros.) — Paul Thomas Anderson “Train Dreams” (Netflix) — Clint Bentley and Greg Kwedar ***\n\n\tCasting“Frankenstein” (Netflix) — Robin D. Cook“Marty Supreme” (A24) — Jennifer Venditti“The Secret Agent” (Neon) — Gabriel Domingues“Sinners” (Warner Bros.) — Francine Maisler ***“Weapons” (Warner Bros.) — Allison Jones\n\n\tAnimated Feature“Arco” (Neon) “Elio” (Pixar)“KPop Demon Hunters” (Netflix) “Little Amélie or the Character of Rain” (GKids) “Zootopia 2” (Walt Disney Pictures) ***\n\n\tProduction Design“Frankenstein” (Netflix) — Tamara Deverell and Shane Vieau ***“Hamnet” (Focus Features) — Fiona Crombie and Alice Felton“Marty Supreme” (A24) — Jack Fisk and Adam Willis“Sinners” (Warner Bros.) — Hannah Bleachler and Monique Champagne“Wicked: For Good” (Universal Pictures) — Nathan Crowley and Lee Sandales\n\n\tCinematography“Frankenstein” (Netflix) — Darius Khondji“Hamnet” (Focus Features) — Łukasz Żal“One Battle after Another” (Warner Bros.) — Michael Bauman“Sinners” (Warner Bros.) — Autumn Durald Arkapaw ***“Train Dreams” (Netflix) — Adolpho Veloso\n\n\tCostume Design“Frankenstein” (Netflix) — Kate Hawley“Hamnet” (Focus Features) — Malgosia Turzanska“One Battle After Another” (Warner Bros.) — Colleen Atwood“Sinners” (Warner Bros.) — Ruth E. Carter ***“Wicked: For Good” (Universal Pictures) — Paul Tazewell \n\n\tFilm Editing“F1” (Apple Original Films/Warner Bros.) — Stephen Mirrione“Frankenstein” (Netflix) — Evan Schiff“Marty Supreme” (A24) — Ronald Bronstein and Josh Safdie“One Battle After Another” (Warner Bros.) — Andy Jurgensen ***“Sinners” (Warner Bros.) — Michael P. Shawver\n\n\tMakeup and Hairstyling“Frankenstein” (Netflix) — Cliona Furey, Mike Hill, Jordan Samuel, ***“One Battle After Another” (Warner Bros.) — Heba Thorisdottir, Ahou Mofid, Arjen Tuiten“The Smashing Machine” (A24) — Felix Fox, Kazu Hiro, Mia Neal“The Ugly Stepsister” (IFC) — Thomas Foldberg, Anne Cathrine Sauerberg“Wicked: For Good” (Universal Pictures) — Laura Blount, Mark Coulier, Frances Hannon\n\t\n\n\tSound“F1” (Apple Original Films/Warner Bros.) “One Battle After Another” (Warner Bros.) ***“Sinners” (Warner Bros.) “Sirât” (Neon)“Wicked: For Good” (Universal Pictures) \n\n\tVisual Effects“Avatar: Fire and Ash” (20th Century Studios) ***“F1” (Apple Original Films/Warner Bros.)“Frankenstein” (Netflix)“Sinners” (Warner Bros.)“Superman” (DC Studios)\n\n\tOriginal Score“Frankenstein” (Netflix) — Alexandre Desplat“Hamnet” (Focus Features) — Max Richter“One Battle after Another” (Warner Bros.) — Jonny Greenwood“Sinners” (Warner Bros.) — Ludwig Göransson ***“Sirât” (Neon) — Kangding Ray\n\n\tOriginal Song“Dear Me” from “Diane Warren: Relentless” (Greenwich Entertainment) — Diane Warren“Golden” from “KPop Demon Hunters” (Netflix) — EJAE and Mark Sonnenblick ***“Last Time (I Seen the Sun)” from “Sinners” (Warner Bros.) — Miles Caton, Ludwig Göransson and Alice Smith“I Lied To You” from “Sinners” (Warner Bros.) — Ludwig Göransson and Raphael Saadiq“Train Dreams” from “Train Dreams” (Netflix) — Nick Cave and Bryce Dessner\n\n\tDocumentary Feature“The Alabama Solution” (HBO Documentary Films)“Cutting Through Rocks” (Autlook Films)“The Perfect Neighbor” (Netflix) ***“Seeds” (Interior Films)“2000 Meters to Andriivka” (PBS)\n\n\tInternational Feature“It Was Just an Accident” from France (Neon) ***“Kokuho” from Japan (GKids)“The Secret Agent” from Brazil (Neon)“Sentimental Value” from Norway (Neon) “The Voice of Hind Rajab” from Tunisia (Willa)\n\n\tAnimated Short“Cardboard” (Locksmith Animation) — dir. J.P. Vine “Éiru” (GKids) — dir. Giovanna Ferrari ***“Hurikán” (AEON Production) — dir. Jan Saska“The Quinta’s Ghost” (Illusorium Films) — dir. James A. Castillo“The Shyness of Trees” (Gobelins, l’Ecole de l’Image) — dir. Sofiia Chuikovska, Loïck Du Plessis D’Argentré, Lina Han, Simin He, Jiaxin Huang, Maud Le Bras, Bingqing Shu\n\n\tDocumentary Short“All the Empty Rooms” (Netflix) — dir. Joshua Seftel ***“All the Walls Came Down” (Interloper Films) — dir. Ondi Timoner“Armed Only with a Camera: The Life and Death of Brent Renaud” (HBO Documentary Films) — dir. Brent Renaud and Craig Renaud“Chasing Time” (Exposure Labs) — dir. Sarah Keo and Jeff Orlowski-Yang“The Devil is Busy” (HBO Documentary Films) — dir. Geeta Gandbhir, Christalyn Hampton\n\t\n\n\tLive Action Short“Extremist” (The New Yorker) — dir. Aleksandr Molochnikov“Pantyhose” (Harmony Concepts) — dir. Fabian Munsterhjelm“Rock, Paper, Scissors” (National Film and Television School)“The Singers” (Highway West Entertainment)“Two People Exchanging Saliva” (The New Yorker) ***\n\n\tTop 5 projected Oscar nomination leaders (films): “Sinners” (15); “One Battle After Another” (14); “Frankenstein” (12); “Hamnet” (9); “Sentimental Value” (6)\n\n\tTop 5 projected Oscar nomination leaders (studios): Warner Bros. (34); Netflix (20); Neon (16); Focus Features (12); A24 (8)\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lost in Translation: Guilds Ignored Global Cinema’s Banner Year – Will the Oscars Correct It?",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Sentimental-Valur-Sirat-It-Was-Just-an-Accident-Kokuho-The-Voice-of-Hind-Rajab.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-08T23:20:14.000Z",
      "dateModified": "2026-01-08T23:20:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘People We Meet on Vacation’ Review: Undemanding Netflix Romcom Coasts on the Charms of Emily Bader and Tom Blyth",
    "url": "https://variety.com/2026/film/reviews/people-we-meet-on-vacation-review-1236626469/",
    "image": "https://variety.com/wp-content/uploads/2025/12/PWMOV_20240920_03337_R2.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-09T00:00:00.000Z",
    "description": "\n\tNew York Times bestselling author Emily Henry is happy to own her reputation as a merchant of breezy, disposable beach reads, to the point that her ",
    "body": "\n\tNew York Times bestselling author Emily Henry is happy to own her reputation as a merchant of breezy, disposable beach reads, to the point that her first adult novel was plainly titled “Beach Read.” The first film adaptation of a Henry title to reach the screen, beating at least three other projects in development, “People We Meet on Vacation” is similarly straightforward about its aspirations: It even opens with a wink-wink shot of its heroine reclining on a quiet beach, reading a book that may as well be one of Henry’s, before the page is spattered with some passing bird excrement from on high. With this introduction of a hapless protagonist not entirely managing to live her best life, Brett Haley‘s film cheerfully speaks both the literary and cinematic language of romantic comedy — and won’t seek to subvert or elevate it in the two hours that follow.\n\t\n\n\tAll of which is completely fine. A summer-soaked Netflix release cannily scheduled to counter the January fug, “People We Meet on Vacation” offers no surprises, to an audience that isn’t after any. From the second that free spirit Poppy (Emily Bader) and straitlaced Alex (Tom Blyth) meet as ill-matched college students, you know where they’re going to end up, and precisely how they’re going to end up there. Moreover, the film knows that you know: It offers the comforting satisfaction of pieces falling predictably into place to any viewers wishing their own life would slot together so neatly. “I thought I knew what I wanted in life — it turns out I had no idea,” Poppy says at one point. She’s pretty much alone in not getting the memo.\n\t\n\n\tFor most of the film’s nine-year timeframe, at least, what Poppy mistakenly thinks she wants is a life less obvious. One of the few things she and Alex have in common at the outset is a shared hometown in the sleepy and fictitious Linfield, Ohio, though they’ve never met before — and where she’s bursting with plans to escape the place, he’s all too eager to nest there. At the end of their final term at Boston College, he gives her a ride back to the Midwest, cuing a passive-aggressive two-day road trip. Any resemblance to the setup of “When Harry Met Sally” is not remotely coincidental, though the character dynamics are gender-flipped: Here, he’s the uptight square, and she’s the wisecracking agent of chaos.\n\n\tBar that minor variation, “People We Meet on Vacation” is wholly deferent to Rob Reiner and Nora Ephron’s standard-bearing romcom, bringing little new generational perspective to the question of whether straight men and women can be friends without sex getting in the way. (Spoiler alert: the answer is still “not in this genre, no.”) The structure is a bit tricksier, flipping between the present — which finds our two inevitable lovers estranged and in their early thirties — and a staggered series of flashbacks catching up to it. \n\n\tHaving eventually become platonic friends via that post-college trip to Linfield, Poppy and Alex resolve to meet every year for a shared summer vacation, even as their lives take very different paths: hers as a jet-setting New York-based travel writer for a glossy magazine, his as a homebody academic still rooted in Ohio. The past vacation sequences, hopping from New Orleans to Tuscany to the Canadian wilderness, repeatedly stress the point of how adorkably perfect they are for each other, even as assorted other love interests keep coming between them. In the present, they’re awkwardly reunited for his brother’s destination wedding in Barcelona, following two years of mutual silent treatment. The rift isn’t explained until later, though as with everything here, you can confidently fill in the gaps.\n\n\tWhat keeps things diverting, and sometimes even interesting, is the genuine but necessarily tentative chemistry between its stars, one staging an all-out charm offensive and the other projecting a flintier allure. Amid the big, cute, relatably klutzy gestures required of the character, Bader (“Paranormal Activity: Next of Kin,” Amazon Prime’s “My Lady Jane”) gives Poppy a groggy, between-the-lines wistfulness that’s less expected, leaving one curious to see her in more knottily written film roles. Blyth hasn’t wanted for those of late: “People We Meet on Vacation” represents quite a departure from tougher arthouse assignments like “Plainclothes,” “Wasteman” and Claire Denis’s “The Fence,” though his quiet, nervy quality goes a long way toward humanizing a character described, not unreasonably, by one of Poppy’s more glamorous exes as “a bit of a wet lettuce.”\n\t\n\n\tThat’s one of the tangier lines in a film that, like many of its contemporary peers in a genre lately consigned to the streamingverse, is heavier on rom than com. The script — credited to three writers, though you’d be forgiven for assuming an even larger committee — maintains a general buoyancy of tone to compensate for a shortage of outright jokes; a setpiece involving a goofily drunken dance to Paula Abdul’s “Forever Your Girl” is the closest we get to farce. A decade on from his tender indie sleeper “I’ll See You in My Dreams,” Haley steers proceedings in more proficiently impersonal fashion, while DP Rob C. Givens takes the tonal directive “sunny” as an all-out aesthetic mission statement. Yellow-filtered to the max, the film looks veritably marinated in Hawaiian Tropic.  \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘People We Meet on Vacation’ Review: Undemanding Netflix Romcom Coasts on the Charms of Emily Bader and Tom Blyth",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/PWMOV_20240920_03337_R2.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-09T00:00:00.000Z",
      "dateModified": "2026-01-09T00:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Salt-N-Pepa’s Lawsuit Against UMG Over Master Recording Ownership Dismissed by Judge",
    "url": "https://variety.com/2026/music/news/salt-n-pepa-lawsuit-against-umg-ownership-dismissed-1236626742/",
    "image": "https://variety.com/wp-content/uploads/2025/11/saltnpepa-GF1_5019.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-08T22:58:39.000Z",
    "description": "\n\tSalt-N-Pepa’s lawsuit against Universal Music Group over control over their master recordings, including hits like 1987’s “Push It,” has been dismis",
    "body": "\n\tSalt-N-Pepa’s lawsuit against Universal Music Group over control over their master recordings, including hits like 1987’s “Push It,” has been dismissed by a New York judge.\n\n\tCheryl “Salt” James and Sandra “Pepa” Denton, who constituted Salt-N-Pepa before DJ Spinderella joined, initially filed their lawsuit in May 2025, citing the Copyright Act of 1976 that allows some artists to reclaim their copyright after 35 years.\n\n\n\tThey had filed termination notices in 2022 to end UMG’s ownership of their early recordings. UMG responded by claiming those notices were invalid because their songs were “works made for hire” and that they had no rights to the tracks, subsequently filing a motion to dismiss the lawsuit in August.\n\t\n\n\tJudge Denise Cote dismissed the lawsuit on Thursday, granting UMG’s motion to dismiss for failure to state a claim. The dismissal, reviewed by Variety, determined that Salt-N-Pepa had granted ownership to their first label Noise in the Attic (NITA) Productions and that the contract for the recordings was between Next Plateau Records and NITA, the latter of which is owned by Hurby “Luv Bug” Azur.\n\n\t“None of the contracts identified by Plaintiffs indicate that they ever owned the Master Tapes,” reads the dismissal. The judge further argued that “the statutory text in § 203 is clear: Plaintiffs can only terminate copyright transfers that they executed. They cannot terminate a copyright grant executed by NITA. As a result, Plaintiffs do not plausibly allege a claim for declaratory relief.”\n\n\tIn a statement to Variety, a representative for UMG said, “While we are gratified that the court dismissed this baseless lawsuit, it should never have been brought in the first place. Prior to this suit—and without any legal obligation to do so—we made multiple attempts to resolve the matter amicably, improve the artists’ compensation, and ensure that Salt-N-Pepa’s fans had access to their music. Even with the court’s complete rejection of their claims, we remain open and willing to find a resolution to the matter and turn the page so we can focus our efforts on working together to amplify Salt-N-Pepa’s legacy for generations to come.”\n\t\n\n\tRepresentatives and attorneys for Salt-N-Pepa did not immediately respond to Variety‘s request for comment. In November, the group used their induction speech at the Rock and Roll Hall of Fame ceremony to call out “the industry” for a situation in which their music has been removed from streaming platforms.\n\n\t“As we celebrate this moment, fans can’t even stream our music. It’s been taken down from all streaming platforms because the industry still doesn’t want to play fair,” said James.\n\n\t“Salt-N-Pepa have never been afraid of a fight,” she continued. “This is the Influence Award. We have to keep using our influence until the industry honors creativity the way the audience does — with love, respect and fairness — and that includes streaming platforms too.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Salt-N-Pepa’s Lawsuit Against UMG Over Master Recording Ownership Dismissed by Judge",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/saltnpepa-GF1_5019.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-08T22:58:39.000Z",
      "dateModified": "2026-01-08T22:58:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kat Dennings Says Marvel ‘Did Scan Me. They Could Put Me in Anything They Want at This Point. I’m in the System’",
    "url": "https://variety.com/2026/film/news/kat-dennings-marvel-body-scan-1236626426/",
    "image": "https://variety.com/wp-content/uploads/2026/01/TCDWAND_G5045-e1767903973747.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-08T23:05:50.000Z",
    "description": "\n\tKat Dennings told Entertainment Tonight on the set of her ABC sitcom “Shifting Gears” that Marvel scanned her so that her likeness can be used in fu",
    "body": "\n\tKat Dennings told Entertainment Tonight on the set of her ABC sitcom “Shifting Gears” that Marvel scanned her so that her likeness can be used in future projects. Dennings has been a part of the MCU since debuting as Darcy Lewis in 2011’s “Thor.” She also appeared in “Thor: The Dark World,” “Thor: Love and Thunder,” “WandaVision” and more. The revelation about Marvel scanning her came up when Dennings was asked about starring in the upcoming Marvel tentpole, “Avengers: Doomsday.”\n\t\n\n\t“What’s ‘Doomsday’? Oh ‘Avengers: Doomsday.’ I thought you meant our show. Like, is that the finale?” Dennings quipped. “I am in the [Marvel] universe and, as you know, I can’t tell you anything. But I am not in it. I mean, I’m not in it. I am telling you right now, I’m not in it. If I were in it, which I’m not, I couldn’t tell you, but I literally am not. I’m sure they already filmed it. I was here [on set]. I’m not in it. But they did scan me, so to be honest they could put me in anything they want at this point. I’m in the system.”\n\n\n\tDennings’ most recent MCU appearance came in the animated series “What If…?” She voiced Darcy in four episodes of the show. Her future with Marvel is unknown at this time, as is how the studio intends to use her likeness.\n\n\tAs for “Avengers: Doomsday,” the upcoming Marvel tentpole is being co-headlined by Dennings’ frequent MCU co-star Chris Hemsworth. The Australian star is back as Thor, who was even given a standalone “Doomsday” teaser trailer that suggests he’ll play a big part in the movie.\n\n\tBody scanning actors is becoming an increasingly common practice in Hollywood to much divisiveness from the industry. Nicolas Cage made headlines last year when he told The New Yorker that he is terrified of AI and is hoping recent body scans he had to do for two upcoming projects aren’t used as reference for AI technology to recreate him on screen after his death. One of the projects is Prime Video’s “Spider-Man Noir.”\n\t\n\n\t“They have to put me in a computer and match my eye color and change — I don’t know,” Cage said. “They’re just going to steal my body and do whatever they want with it via digital AI. … God, I hope not AI. I’m terrified of that. I’ve been very vocal about it. … And it makes me wonder, you know, where will the truth of the artists end up? Is it going to be replaced? Is it going to be transmogrified? Where’s the heartbeat going to be? I mean, what are you going to do with my body and my face when I’m dead? I don’t want you to do anything with it!”\n\n\t“Avengers: Doomsday” opens in theaters Dec. 18.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kat Dennings Says Marvel ‘Did Scan Me. They Could Put Me in Anything They Want at This Point. I’m in the System’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/TCDWAND_G5045-e1767903973747.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-08T23:05:50.000Z",
      "dateModified": "2026-01-08T23:05:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "President Trump Says He's Not Considering Pardoning Diddy",
    "url": "https://www.tmz.com/2026/01/08/president-trump-not-considering-diddy-pardon/",
    "image": "https://imagez.tmz.com/image/02/16by9/2026/01/08/02ff6ccd17e24e61aaeb5ebcffd87970_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-08T20:45:40.000Z",
    "description": "\n    \n                    \n                          President Trump\n                          No Life-Saver For Diddy ...\n                          I",
    "body": "\n    \n                    \n                          President Trump\n                          No Life-Saver For Diddy ...\n                          I'm Not Considering Pardon\n                      \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          It looks like Diddy's going to have to suck it up and serve out his prison sentence ... because President Trump says he's not considering a pardon.\n      \n    \n          Trump told The New York Times he received a letter from Diddy seeking a pardon ... but told the outlet he wasn't considering granting the request.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          POTUS is certainly bursting Diddy's bubble here ... as we first reported, Diddy was telling inmates at FCI Fort Dix in New Jersey back in November that he would get a presidential pardon from Trump early in 2026.\n      \n\n          Diddy is serving a 50-month sentence for his conviction on a couple of prostitution charges.\n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          We broke the story ... almost immediately after Diddy was sentenced in October 2025 his legal team got in touch with a high-ranking White House official who has the ear of the President regarding a commutation or pardon. Just days later, Trump told the media he was aware of Diddy's ask.\n      \n    \n          Our sources told us, at the time, Trump was \"vacillating\" on a commutation ... but now it sounds like he's made a final decision.\n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          We reached out to Diddy's camp ... they had no comment.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Donald Trump\n              \n                          \n                Diddy\n              \n                          \n                Crime & Arrests\n              \n                          \n                Hip Hop\n              \n                          \n                Politix\n              \n                          \n                Music\n              \n                          \n                Fairly Legal\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "President Trump Says He's Not Considering Pardoning Diddy",
      "image": [
        "https://imagez.tmz.com/image/02/16by9/2026/01/08/02ff6ccd17e24e61aaeb5ebcffd87970_xl.jpg"
      ],
      "datePublished": "2026-01-08T20:45:40.000Z",
      "dateModified": "2026-01-08T20:45:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Steve-O Says Bam Margera Could 'Absolutely' Come Back for 'Jackass 5'",
    "url": "https://www.tmz.com/2026/01/08/steve-o-wants-bam-margera-return-jackass-movie/",
    "image": "https://imagez.tmz.com/image/79/16by9/2026/01/08/79d84e43b02f44649d92da215601461f_xl.png",
    "tag": "Entertainment",
    "date": "2026-01-08T22:30:04.000Z",
    "description": "\n    \n                    \n                          Steve-O\n                          Come Back, Bam!!!\n                          We Need You For Mor",
    "body": "\n    \n                    \n                          Steve-O\n                          Come Back, Bam!!!\n                          We Need You For More 'Jackass'!!!\n                      \n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          A new \"Jackass\" movie will head to theaters this summer, and Steve-O told us he's hoping all beefs get buried ... and Bam Margera makes a triumphant return to the cast.\n      \n    \n          We caught up with Steve-O at LAX Thursday, where he was visibly stoked to start shooting new stunts with his friends again, but he told us he wants \"all the bros back together.\"\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          We broke the story ... Bam has cleared never-seen footage of him to be used in the new movie, but there's still no word on if he would rejoin the guys on set for new bits.\n      \n    \n          According to Steve-O, now that Bam is sober and doing incredible, there's \"absolutely\" a path for him to get back with the band, as it were.\n      \n\n          He explained ... \"There's still some stuff that needs to be worked out, but there's nothing that would be better than a full-circle redemption, triumphant return, and for us to ride off into the sunset on a win -- all of us together.\"\n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          As for himself, Steve-O told us he's ready to \"swing for the fences.\"\n      \n    \n          While it's hard to imagine he could top what he's already done, Steve-O assured us, \"I got my own ideas that are pretty outrageous. I'm ready to go.\"\n      \n    \n          \"Jackass Forever\" saw the stuntman cover his genitals in bumblebees so ... if Steve-O says his pitches are outrageous, you can take that to the bank!\n      \n    \n          Watch the video to see the picture Steve-O showed us of a recent injury that made his knee swell up to the size of a melon ... and check out the second video -- Steve-O tells us about the gobs of cash he put toward a good cause after the MrBeast celebrity challenge!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Bam Margera\n              \n                          \n                Steve O\n              \n                          \n                Celebrity News\n              \n                          \n                Jackass\n              \n                          \n                Movies\n              \n                          \n                Exclusive\n              \n                          \n                Movie Business\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Steve-O Says Bam Margera Could 'Absolutely' Come Back for 'Jackass 5'",
      "image": [
        "https://imagez.tmz.com/image/79/16by9/2026/01/08/79d84e43b02f44649d92da215601461f_xl.png"
      ],
      "datePublished": "2026-01-08T22:30:04.000Z",
      "dateModified": "2026-01-08T22:30:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Dr. Drew Says Changing Nick Reiner's Meds Was Wrong Move, Rips California",
    "url": "https://www.tmz.com/2026/01/08/dr-drew-says-nick-reiner-meds-changed-wrong-move/",
    "image": "https://imagez.tmz.com/image/c1/16by9/2026/01/08/c1ae85631888451c99e341f5a1eac62d_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-08T21:43:38.000Z",
    "description": "\n    \n                    \n                          Dr. Drew on Nick Reiner\n                          Changing Meds Was Wrong Move ...\n              ",
    "body": "\n    \n                    \n                          Dr. Drew on Nick Reiner\n                          Changing Meds Was Wrong Move ...\n                          Cali Doesn't Help Either\n                      \n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          Dr. Drew says doctors prescribing medication to Nick Reiner for his mental illness royally screwed up by changing his meds in the weeks leading up to his parents' murders ... but hindsight is 20/20, and there are all sorts of reasons why the meds get changed.\n      \n    \n          The good doc joined us on \"TMZ Live\" Thursday ... and we asked him about something we uncovered in our new documentary, \"TMZ Investigates: The Reiner Murders: What Really Happened\" ... Nick was stable on his meds for schizoaffective disorder a month before the killings, but then doctors decided to change things up.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Dr. Drew says meds get changed all the time when patients stress about how they're feeling or how their side effects are affecting them ... but that doesn't always make it the right move.\n      \n\n          We're told Nick went into a spiral after his meds were changed ... and doctors did NOT attempt to place him under a psychiatric hold while they tried to adjust the meds and stabilize him, which may be key to his defense.\n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ Studios\n          \n    \n          Dr. Drew says California makes it extremely hard for doctors to get their patients on a psychiatric hold ... breaking down the hurdles he and his colleagues face.\n      \n    \n          Catch the full interview on \"TMZ Live\" ... and watch out for our new doc, airing Friday night on FOX at 8 PM ET ... and dropping the next day on HULU.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Dr. Drew\n              \n                          \n                Nick Reiner\n              \n                          \n                Celebrity News\n              \n                          \n                TMZ Investigates\n              \n                          \n                TMZ Live\n              \n                          \n                Exclusive\n              \n                          \n                True Crime\n              \n                          \n                Rob Reiner Death\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Dr. Drew Says Changing Nick Reiner's Meds Was Wrong Move, Rips California",
      "image": [
        "https://imagez.tmz.com/image/c1/16by9/2026/01/08/c1ae85631888451c99e341f5a1eac62d_xl.jpg"
      ],
      "datePublished": "2026-01-08T21:43:38.000Z",
      "dateModified": "2026-01-08T21:43:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bills To Sell Nearly Everything From Stadium Before Demolition, Even Trough Urinals",
    "url": "https://www.tmz.com/2026/01/08/buffalo-bills-highmark-stadium-keepsakes/",
    "image": "https://imagez.tmz.com/image/54/16by9/2026/01/08/5405e01a97474341b752da7387cfe180_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-08T23:37:17.000Z",
    "description": "\n    \n                    \n                          Buffalo Bills\n                          We're Selling Stadium Keepsakes\n                         ",
    "body": "\n    \n                    \n                          Buffalo Bills\n                          We're Selling Stadium Keepsakes\n                          Even Trough Urinals!!!\n                      \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Bills Mafia has a chance to literally own part of Buffalo Bills history ... whether it’s seats, turf, lockers ... and even the trough urinals.\n      \n    \n          After 53 years at Highmark Stadium, the Bills are moving to a new $2.1 billion venue across the street in the fall. Before that, everything must go!!!\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          The Bills have partnered with sports memorabilia company CollectibleXchange to make as many keepsakes available to the public as possible. Brandon Steiner is spearheading the project after doing the same for other iconic venues such as Yankee Stadium, Texas Stadium, and Madison Square Garden.\n      \n\n          He said the reaction has exceeded expectations ... especially with certain items that might come as a surprise.\n      \n    \n          \"People want those troughs. They want that kind of stuff, so we’ll make that available … you’re talking about Buffalo, and people take a lot of pride in the stadium.\"\n      \n    \n          There’s going to be something for everybody, and more than 12,000 orders have already been placed -- leading Steiner to worry they could possibly run out of seats from the 70,000-capacity stadium.\n      \n    \n          Prices start at $549 for one seat and chunks of turf, and goalposts cost $100.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          New products will be made available every few weeks throughout 2026. Many of the 1-of-1 items will be up for auction while the rest will be available for purchase.\n      \n    \n          It’s too early to estimate how much money will be generate ... but as part of the deal, New York’s Erie County -- which owns the stadium -- will receive 50% of the proceeds to help fund local initiatives.\n      \n    \n          There’s a long-shot possibility the Bills could host one more game if they make a deep run into the postseason -- but for all intents and purposes, fans have already said their goodbyes.\n      \n    \n          Now they can start outfitting their mancaves!!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                TMZ Sports\n              \n                          \n                Buffalo Bills\n              \n                          \n                NFL\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bills To Sell Nearly Everything From Stadium Before Demolition, Even Trough Urinals",
      "image": [
        "https://imagez.tmz.com/image/54/16by9/2026/01/08/5405e01a97474341b752da7387cfe180_xl.jpg"
      ],
      "datePublished": "2026-01-08T23:37:17.000Z",
      "dateModified": "2026-01-08T23:37:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Naked Yungblud Shows Off on Yacht Down Under, Check Out Pics",
    "url": "https://www.tmz.com/2026/01/08/yungblud-shows-near-naked-body-australia/",
    "image": "https://imagez.tmz.com/image/4a/16by9/2026/01/08/4aeba734ff524776af4b656e8fb0d7f6_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-09T01:00:33.000Z",
    "description": "\n    \n                    \n                          Yungblud\n                          Getting Cocky Down Under!!!🤪🍆\n                      \n       ",
    "body": "\n    \n                    \n                          Yungblud\n                          Getting Cocky Down Under!!!🤪🍆\n                      \n                  \n                                                                        Published \n                              January 8, 2026\n                            5:00 PM PST\n                                                                            \n      \n    \n          It’s sunny Down Under and Yungblud is absolutely taking advantage -- 'cause when the sun’s out, he's making it clear his buns are out too, and yes ... we’ve got the peachy pics!\n      \n    \n          NSFW alert -- the British rapper was caught getting way too comfortable at a rowdy yacht party cruising Sydney Harbour, ditching his clothes and barely committing to modesty with a half-hearted hand-and-towel combo doing the absolute least to cover his goods.\n      \n    \n      \n        \n                    \n                  \n      \n                    MEDIA-MODE\n          \n    \n          As you can see, YB was fully committed to having a good time -- flashing his bum to even out that tan, flexing some serious body confidence, and happily soaking up the attention.\n      \n\n                  \n          \n                          \n                \n                  \n      \n    \n          All signs point to a good ol' time -- Yungblud managed to keep his bits successfully under wraps while sipping a drink and partying it up with his equally wild crew.\n      \n    \n          Clearly, he’s starting the year strong -- and making it clear, what happens Down Under, stays Down Under!😜\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Celebrity News\n              \n                          \n                Beauty\n              \n                          \n                Photo Galleries\n              \n                          \n                Exclusive\n              \n                          \n                Music\n              \n                          \n                Vacations\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Naked Yungblud Shows Off on Yacht Down Under, Check Out Pics",
      "image": [
        "https://imagez.tmz.com/image/4a/16by9/2026/01/08/4aeba734ff524776af4b656e8fb0d7f6_xl.jpg"
      ],
      "datePublished": "2026-01-09T01:00:33.000Z",
      "dateModified": "2026-01-09T01:00:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]