[
  {
    "title": "‘Ne Zha 2,’ ‘Zootopia 2’ Lead China Box Office Past $7.4 Billion in 2025",
    "url": "https://variety.com/2026/film/box-office/ne-zha-2-zootopia-2-2025-china-box-office-7-4-billion-1236621734/",
    "image": "https://variety.com/wp-content/uploads/2025/02/Ne-Zha-2-2.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-01T09:18:39.000Z",
    "description": "\n\tChina‘s theatrical market staged a robust recovery in 2025, with total box office reaching RMB51.83 billion ($7.41 billion) and admissions climbing ",
    "body": "\n\tChina‘s theatrical market staged a robust recovery in 2025, with total box office reaching RMB51.83 billion ($7.41 billion) and admissions climbing to 1.24 billion – both representing year-over-year increases exceeding 20%, according to a new report from Maoyan Entertainment’s research division.\n\n\tIn 2024, the China box office plummeted 23% to $5.8 billion. The 2025 rebound was fueled primarily by animated titles and IP-driven franchises, with 57 animated films generating over RMB25 billion ($3.57 billion) in revenue – representing nearly half of the year’s total gross. Leading the charge were local sequel “Ne Zha 2” ($2.13 billion) and Disney’s “Zootopia 2” ($558.3 million), which delivered exceptional box office performance.\n\t\n\n\tThe Maoyan Research Institute’s “Insight Report on 2025 China’s Box Office Film Data,” highlighted animation’s outsized impact on the market’s growth trajectory.\n\n\n\tIP strength proved particularly potent in the animation sector, with select franchises recording significantly higher rewatch rates than market averages. “Ne Zha 2” achieved the year’s highest rewatch ratio, while “Zootopia 2” and other popular titles demonstrated sustained fan engagement and loyalty.\n\n\tThe report revealed increasing market concentration around tentpole releases. Among 2025’s top 10 new films, four surpassed RMB3 billion ($429 million) at the box office and eight crossed the RMB1 billion ($143 million) threshold. Local productions captured a slightly larger market share compared to 2024, though the number of local films grossing over RMB1 billion remained steady year-over-year.\n\t\n\n\tHowever, mid-tier local releases faced challenges, with films earning between RMB100-500 million ($14.3 million-$71.5 million) and RMB500 million-1 billion ($71.5 million-$143 million) showing marked declines, underscoring the market’s growing polarization toward blockbuster projects.\n\n\tLower-tier cities emerged as crucial growth engines, with third- and fourth-tier markets’ box office contributions reaching a five-year high in 2025, marking three consecutive years of expansion. The proportion of first-time and infrequent moviegoers also increased, broadening cinema’s audience reach.\n\n\tLocal productions shifted away from sweeping narratives toward stories reflecting everyday life, employing diverse visual styles and genres to meet varied audience preferences. Meanwhile, imported superhero franchises experienced notable declines, suggesting these properties require fresh creative approaches to maintain market appeal.\n\n\t“In 2025, several key holiday release windows outperformed expectations thanks to the support of breakout hits, setting multiple new records and delivering pleasant surprises to both the industry and audiences,” said Maoyan Entertainment market analyst Lai Li. “The traditional ‘blockbuster model,’ in its classic sense, is no longer a guaranteed formula for box office success, offering new lessons for market participants.”\n\n\tLooking toward 2026, Lai emphasized the industry must continue refining its content pipeline, attracting diverse audience segments with high-quality films combining popularity, strong word-of-mouth, and freshness to unlock further growth potential.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Ne Zha 2,’ ‘Zootopia 2’ Lead China Box Office Past $7.4 Billion in 2025",
      "image": [
        "https://variety.com/wp-content/uploads/2025/02/Ne-Zha-2-2.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-01T09:18:39.000Z",
      "dateModified": "2026-01-01T09:18:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Watching the ‘Stranger Things’ Finale in a Theater: 11 Moments That Got the Biggest Reactions",
    "url": "https://variety.com/lists/stranger-things-finale-11-moments-big-fan-reaction-theater/",
    "image": "https://variety.com/wp-content/uploads/2025/12/GettyImages-2254210837.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-01T13:00:00.000Z",
    "description": "\n\t\n\t\t\t\n\t\t\t\t\n\t\n\n\t\n\tJan 1, 2026 5:00am PT\t\n\t\n\n\t\n\t\tWatching the ‘Stranger Things’ Finale in a Theater: 11 Moments That Got the Biggest Reactions\n\t\n\t\n\t\t\t\n",
    "body": "\n\t\n\t\t\t\n\t\t\t\t\n\t\n\n\t\n\tJan 1, 2026 5:00am PT\t\n\t\n\n\t\n\t\tWatching the ‘Stranger Things’ Finale in a Theater: 11 Moments That Got the Biggest Reactions\n\t\n\t\n\t\t\t\n\n\n\t\t\t\n\t\t\t\n\t\n\n\t\t\t\t\t\t\t\t\tGetty Images for Netflix\n\t\n\n\t\t\n\t\n\t\t\t\t\n\n\tSPOILER ALERT: This story contains spoilers for the series finale of “Stranger Things,” now streaming on Netflix.\n\n\tAfter five seasons and nearly a decade of anticipation, the “Stranger Things” finale has arrived. Unlike the 41 episodes preceding it, the finale was not exclusive to the small screen, as Netflix decided to event-ize the pop culture phenomenon’s send off with a limited theatrical release on Dec. 31 and Jan. 1 across 500 theaters.\n\n\tThe earliest screenings took place at 5 p.m. PT, coinciding with the moment that the episode dropped on the streamer. While there was no formal red carpet premiere, the most sensational screening may have been at Netflix’s very own Egyptian Theater in the heart of Hollywood. Audiences donning Hellfire Club t-shirts, WSQK shirts, bowl cuts and other 1980s apparel from the show packed the historic theater, eager to experience their favorite show on the big screen for the first time.\n\n\tThe audience was a sea of nerds. Considering that “Stranger Things” began in 2016, the youngest fans in the crowd very well may not have been born when the show first debuted. Similarly, the adolescents in the theater were probably in kindergarten when the first season came out. Personally, I was in college in 2016, and have been watching the show for most of my twenties. To see the finale in theaters, surrounded by fans on the day of its premiere was thus akin to seeing “Avengers: Endgame” or “Harry Potter and the Deathly Hallows: Part 2” in the cinema on their respective opening weekends. It was the conclusion to a decade-long journey of fandom, and it made for moments that simply couldn’t be replicated in a watch party.\n\n\n\n\t\n\n\t\t\t\t\tFans at the “Stranger Things 5: The Finale Fan Screenings” at The Egyptian Theatre in Hollywood on New Year’s Eve. \n\t\t\t\t\t\t\t\t\tGetty Images for Netflix\n\t\n\n\n\n\tFrom cheering on the Netflix logo at the top of the episode to singing along with David Bowie in the closing credits, these are the 11 moments from the “Stranger Things” finale that received the biggest reactions in the theater.\n\n\n\t\t\t\n\t\t\t\n\t11. Hopper Goes Back For Kali\n\t\t\t\t\n\tHopper (David Harbour) and Kali (Linnea Berthelsen) have been at odds with one another for the entirety of Season 5, arguing over their respective approaches to how Eleven (Millie Bobby Brown) should use her powers. When both Kali and Eleven are paralyzed during a tense chase from the military, Hopper at first just rescues Eleven, but when he goes back for Kali, it affirms his heroism, warranting strong applause from the audience. \n\t\t\n\t\t\t\n\t\t\t\n\t10. Eleven Pulls Lt. Akers’ Trigger\n\t\t\t\t\n\tShortly after Hopper rescues Kali, both are captured and held hostage by the season’s side-antagonist Lt. Robert Akers (Alex Breaux). Akers has proven a nasty force throughout the season, so when Eleven liberates them by forcing Akers to turn his gun on himself, it received a cathartic response. Credit is also due to Murray (Brett Gelman) for disrupting the situation by blowing up the helicopter outside, adding to the climactic sequence.\n\t\t\n\t\t\t\n\t\t\t\n\t9. Hopper Proposes To Joyce\n\t\t\t\t\n\tBecause the “Stranger Things” finale wraps up the stories of its enormous ensemble, it suffers from a bit of “Return of the King” syndrome (i.e. it seems to have several final farewell scenes taking place in sequence). Luckily, all of the farewells are heartfelt, but the one that got the biggest reaction was Hopper and Joyce’s (Winona Ryder) final scene together. After the kids all graduate from high school, Hopper takes Joyce out to a fancy restaurant and floats the idea of them leaving Hawkins for Montauk (a nod to the show’s original proposed setting). However, the reaction came not from this subtle Easter Egg, but from the moment that Hopper gets down on one knee, presents Joyce with a ring and asks her to spend the rest of her life with him.\n\t\t\n\t\t\t\n\t\t\t\n\t8. Eleven Releases Hopper\n\t\t\t\t\n\tAudiences weren’t cheering during this scene, but sniffles were audible in the theater. Hopper has long been protective of Eleven, and his refusal to let her sacrifice herself for the world stems from the pain he felt at the loss of his daughter, Sara. In this emotional scene, Eleven tenderly explains that even though Hopper has proven a loving father figure to her, she isn’t Sara. She then returns to him a hair tie that once belonged to Sara, relieving him of his guilt. There was hardly a dry eye in the house.\n\t\t\n\t\t\t\n\t\t\t\n\t7. Eleven Says Goodbye To Mike\n\t\t\t\t\n\tIf Eleven’s emotional moment with Hopper made for some dewy eyes and sniffles, her final scene with Mike created audible sobs. When Eleven makes the decision to stay in the Upside Down when the bomb goes off, Mike (Finn Wolfhard) rushes in to try and save her, but she takes him into her mind and explains what must be done. All the while, they share tearful embraces over Prince’s “Purple Rain.” It’s beautiful and tragic all at once, and the audience was breaking down with the characters.\n\t\t\n\t\t\t\n\t\t\t\n\t6. Joyce Decapitates Vecna\n\t\t\t\t\n\tThere are several cathartic moments in the ensemble’s defeat of Vecna (Jamie Campbell Bower), but Joyce delivers the final blow to the archvillain, decapitating him with an ax after he’s impaled against a spike in the heart of the Mind Flayer. Before she starts hacking away at his neck, she says, with fire in her eyes, “You fucked with the wrong family.” It was the finale’s “I am Iron Man” moment, and the audience absolutely ate it up.\n\t\t\n\t\t\t\n\t\t\t\n\t5. Eleven Reenters the Abyss\n\t\t\t\t\n\tWhen Vecna gives into the Mind Flayer and it starts attacking the heroes in the Abyss, there are several moments of heroism. The audience clapped when Lucas (Caleb McLaughlin) saves Dustin (Gaten Matarazzo) from getting smushed and then again when Nancy (Natalia Dyer) volunteers herself as bait. However, the largest applause came when its revealed that Eleven has successfully reentered Abyss via her shortcut and distracts the Flayer with a boulder to the head. She then charges towards it head on, rips a hole in its chest and dives in like a superhero, receiving a superheroic ovation.  \n\t\t\n\t\t\t\n\t\t\t\n\t4. Derek Saves Holly\n\t\t\t\t\n\tJake Connelly’s Derek Turnbow is one of the best additions to “Stranger Things 5” and perhaps the funniest character in the entire series. It’s therefore no surprise that he solicited some of the biggest laughs in the theater— from his unexpected hug with Steve (Joe Keery) to his awkward wave to Mike. However, his most shining moment in the finale comes when he helps Holly (Nell Fisher) escape Vecna’s clutches while entering the Cave. He saves her by pulling her in and once they’re both safe, flips off Vecna and utters his signature line: “Suck my fat one.” Dipshit Derek certainly Delighted the crowd with that one.\n\t\t\n\t\t\t\n\t\t\t\n\t3. Hopper Shoots Eleven\n\t\t\t\t\n\tAudiences audibly gasped in this scene, where Hopper, tricked by Vecna, fires his gun at an apparition only for the bullets to go right into the water tank where Eleven is submerged. When he pulls back the metal to reveal the blood pouring from Eleven’s body, the theater’s shock was audible. One person behind me even blurted, “Shut the fuck up!” in surprise. Fortunately, Eleven’s wounds ended up being as fabricated as the apparition itself, but Hopper’s panicked decision to free her from the tank veered the plot in an unexpected direction. Also, when Vecna plays with Hopper’s mind, it’s the first time that his villainous voice is heard in the finale. Its vibrations rumbled the theater, sounding superbly spooky over the Egyptian’s cinematic sound system.\n\t\t\n\t\t\t\n\t\t\t\n\t2. Jonathan Saves Steve\n\t\t\t\t\n\tThe entire scene where Eleven is trying to align the falling Abyss with the radio tower in the Upside Down was thrilling to watch on the big screen. With the seconds counting down and characters facing odds across three different realms, everyone was on the edge of their seats. However, the audience cried and screamed when the screen cut to black as it appears that Steve will fall to his death. Those cries of despair turned into cheers of triumph when it’s revealed that Jonathan (Charlie Heaton) — a rival of Steve’s throughout the series — saves him. It’s an early moment in the episode that tests the audience’s fears for all of the characters’ fates. Fortunately, this one ended with catharsis. Also, as a bonus, Joe Keery’s name received the loudest applause during the closing credits.\n\t\t\n\t\t\t\n\t\t\t\n\t1. Will Becomes Vecna to Save Eleven\n\t\t\t\t\n\tIf Joyce telling Vecna that he “fucked with the wrong family” was the finale’s “I am Iron Man” moment, then Will (Noah Schnapp) embodying Vecna to save Eleven and make way for his defeat was Captain America wielding Mjölnir. Just when Vecna appears to have the upper hand in the final battle against Eleven, Will taking control gives the heroes the upper hand for the final time. It is the satisfying moment that affirms the villain’s fate and everything the heroes are capable of.\n\t\t\n\t\n\t\n\n\n\t\n\t\tMore from Variety\n\t\n\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\n\n\t\t\n\n\t\n\t\tMore From Our Brands\n\t\n\t\n\t\t\n\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\n\tRolling Stone\n\n\t\t\t\t\tWatch Phish Ring In the New Year by Playing Prince’s ‘Cream’ for the First Time\t\t\n\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\n\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\n\tRobb Report\n\n\t\t\t\t\tBeyoncé Is Officially a Billionaire\t\t\n\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\n\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\n\tSportico\n\n\t\t\t\t\tAlabama, Indiana Bring Stark Contrasts to CFP Clash\t\t\n\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\n\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\n\tWWD\n\n\t\t\t\t\tStyle Icon and Philanthropist Countess Jacqueline de Ribes Dies at 96\t\t\n\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\n\t\t\n\t\n\t\n\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Watching the ‘Stranger Things’ Finale in a Theater: 11 Moments That Got the Biggest Reactions",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/GettyImages-2254210837.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-01T13:00:00.000Z",
      "dateModified": "2026-01-01T13:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "BTS to Return in March With First Album in Nearly Four Years",
    "url": "https://variety.com/2025/music/news/bts-new-album-coming-march-1236621674/",
    "image": "https://variety.com/wp-content/uploads/2025/12/GettyImages-1202149664.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-01T05:56:13.000Z",
    "description": "\n\tBTS fans are dreaming of spring, and not just because of the current winter weather. The turning of the new year brought an announcement to Korean m",
    "body": "\n\tBTS fans are dreaming of spring, and not just because of the current winter weather. The turning of the new year brought an announcement to Korean media that the group will be releasing a new album on March 20, which will be their first in nearly four years.\n\n\tThe long-awaited album will be BTS’ first since “Proof,” a June 2022 release that was followed by a long group hiatus. The gap saw the individual members fulfilling mandatory military service in South Korea and recording a multitude of solo projects.\n\t\n\n\tThe news was reported in newspapers in the group’s home country. BigHit confirmed the reports with a post on its Korean-language X account.\n\n\n\tPrior to the official announcement, group members had already gone direct to fans with the release date, sending letters with handwritten messages to some ARMY members’ homes with the telltale dateline of “2026.3.20.” \n\n\n\n\t\n\n\t\n\n\n\n\tAmong the messages, RM wrote that he’d been “waiting for this moment more desperately than anyone.” Said Jin, “I greeted you all as a soloist in 2023 and 2024, but I can finally greet you as part of a team again.” J-Hope wrote, “Finally, it’s the year that we will all be together with you!!” Said Jungkook: “Please take good care of us this year as well.”\n\n\tBTS also got together to participate in a countdown to the New Year on Weverse.\n\n\tA world tour is expected to be announced soon as well.\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "BTS to Return in March With First Album in Nearly Four Years",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/GettyImages-1202149664.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-01T05:56:13.000Z",
      "dateModified": "2026-01-01T05:56:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "CBS’ ‘New Year’s Eve Live: Nashville’s Big Bash’ Special Faces Mid-Show Outage",
    "url": "https://variety.com/2025/tv/news/cbs-nashvilles-big-bash-live-technical-problem-matlock-1236621691/",
    "image": "https://variety.com/wp-content/uploads/2025/12/GettyImages-2254210763.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-01T05:51:53.000Z",
    "description": "\n\tCBS faced a technical snafu that knocked the live broadcast of “New Year’s Eve Live: Nashville’s Big Bash” off the air for about 12 minutes on Wedne",
    "body": "\n\tCBS faced a technical snafu that knocked the live broadcast of “New Year’s Eve Live: Nashville’s Big Bash” off the air for about 12 minutes on Wednesday night.\n\n\tIn the interim the network ran an episode of “Matlock,” an abrupt shift that greatly confused viewers who had tuned in for a selection of country music superstars performing from Nashville and other locations in the lead-up to midnight. The interruption came about 50 minutes in to the five and a half hour special.\n\t\n\n\tThe circumstances behind the technical problems were not entirely clear. \n\n\n\tAt about 8:50 p.m. PT, singer-actor Lainey Wilson was in the middle of a tune when suddenly it was interrupted. Soon thereafter a voice mentioned “technical difficulties,” and after that CBS cut to a string of commercials. Those were followed by an episode of “Matlock” that appeared to start in progress. Finally, after about 12 and a half minutes, hosts Bert Kreischer and country singer Hardy came back on and apologized for the interruption. Singer Gretchen Wilson then took the stage.\n\n\tThe event is staged at Bicentennial Capitol Mall State Park in Nashville. The 2025 telecast featured appearances by such country notables as Jason Aldean, Bailey Zimmerman, CeCe Winans and the Fisk Jubilee Singers, Dierks Bentley, Brooks & Dunn, Rascal Flatts, Riley Green, Marcus King, Megan Moroney, Zach Top, Keith Urban and Stephen Wilson Jr.\n\n\t“Nashville’s Big Bash” is executive produced by Robert Deaton and Mary Hilliard Harrington in partnership with Music City Inc., the foundation of the Nashville Convention & Visitors Corp. \n\t\n\n\t(Pictured: Lainey Wilson performs at the Nashville’s Big Bash event telecast live on CBS)\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "CBS’ ‘New Year’s Eve Live: Nashville’s Big Bash’ Special Faces Mid-Show Outage",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/GettyImages-2254210763.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-01T05:51:53.000Z",
      "dateModified": "2026-01-01T05:51:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Menemsha Acquires North American Rights to Coming-of-Age Comedy ‘Ethan Bloom’ (EXCLUSIVE)",
    "url": "https://variety.com/2026/film/global/menemsha-ethan-bloom-1236621149/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Ethan-Bloom.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-01T08:54:00.000Z",
    "description": "\n\tMenemsha Films has acquired North American rights to “Ethan Bloom,” an interfaith coming-of-age comedy from Herschel Faber, the director of “Cavemen",
    "body": "\n\tMenemsha Films has acquired North American rights to “Ethan Bloom,” an interfaith coming-of-age comedy from Herschel Faber, the director of “Cavemen.”\n\n\tThe distributor will launch the film on the festival circuit this spring, followed by its theatrical release in North American cinemas.\n\n\tThe cast includes Joshua Malina (“The West Wing,” “Scandal”), Rachelle Lefevre (“The Twilight Saga”), Carlos Ponce, who is also a singer and songwriter, and Mindy Sterling (the “Austin Powers” trilogy). The film is led by rising stars Caroline Valencia, best known as young Selena Gomez in the hit Hulu series “Only Murders in the Building,” and Hank Greenspan, who appeared in the CBS sitcom “The Neighborhood” for eight seasons.\n\t\n\n\tThe film centers on 13-year-old Ethan Bloom (Greenspan), who should be preparing for his bar mitzvah – but against the wishes of his widowed Jewish dad (Malina), he is convinced his spiritual calling is with the Catholic church, where he secretly finds solace under the guidance of Father Diaz (Ponce).\n\n\n\tThrough the wisdom of an unconventional rabbi (Lefevre), the love of his complicated family, and his first romance with a cowboy-boot-wearing girl who can put him in a headlock, Ethan must confront his lies and grief to discover that faith isn’t about choosing sides—it’s about honoring all the messy, beautiful pieces of who we are.\n\n\tNeil Friedman of Menemsha Films said, “The film ‘Ethan Bloom’ is a one-of-a-kind coming-of-age story featuring two wonderful young actors. The adult cast including Joshua Malina, Rachelle Lefevre and Carlos Ponce are equally compelling, making this film a unique look at faith, love and family we’ve yet to see on screen until now.”\n\t\n\n\tFaber added, “’Ethan Bloom’ is about every kid who’s ever felt caught between different worlds—whether that means faith, culture, or family expectations—and writer Maylen Dominguez and I set out to tell a story that could make people laugh, cry, and see themselves. I’m thrilled that Menemsha Films understands this story’s heart and its breakout potential to reach audiences everywhere.”\n\n\tFaber previously wrote, directed and produced “Cavemen,” a feature-length romantic comedy starring Skylar Astin (“Pitch Perfect”), Camilla Belle, Chad Michael Murray and Jason Patric, which was released theatrically by Well Go USA. As a screenwriter, Faber wrote “Mac and Devin Go to High School,” starring Snoop Dogg and Wiz Khalifa, and has placed in the semi-finals of the Nicholl Fellowship and Austin Film Festival.\n\n\tDominguez previously won the Zaki Gordon Award for screenwriting and an NBC/Universal award for TV writing.\n\n\tThe deal was negotiated by Friedman on behalf of Menemsha Films, and Faber and Dominguez on behalf of Fascination Media and Plato’s Daughter Productions. The film was produced by Faber and Dominguez.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Menemsha Acquires North American Rights to Coming-of-Age Comedy ‘Ethan Bloom’ (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Ethan-Bloom.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-01T08:54:00.000Z",
      "dateModified": "2026-01-01T08:54:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This Year's Top New Year's Eve Broadcasts -- And Where to Stream Them Live Online",
    "url": "https://variety.com/2025/shopping/news/new-years-eve-specials-broadcasts-how-to-stream-live-online-1236620399/",
    "image": "https://variety.com/wp-content/uploads/2024/01/GettyImages-1898816976-e1704400239718.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-01T03:20:00.000Z",
    "description": "\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.\n\n\tAs the ca",
    "body": "\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.\n\n\tAs the calendar flips and viewers once again choose between braving the cold or celebrating from the couch, television networks are rolling out their annual New Year’s Eve spectacles. This year’s lineup includes a mix of musical performances, celebrity hosts and live countdowns designed to carry audiences into the new year. From “Dick Clark’s New Year’s Rockin’ Eve” to Anderson Cooper and Andy Cohen’s more PG-13 CNN special, here’s a look at the biggest New Year’s Eve broadcasts airing this year and how to stream them live at home.\n\n\t\n\t\t‘Dick Clark’s New Year’s Rockin’ Eve’\t\n\n\tABC once again anchors the night with “Dick Clark’s New Year’s Rockin’ Eve,” the most watched New Year’s Eve program on television. Hosted by Ryan Seacrest, the long-running special kicks off in primetime and stretches through midnight, offering a steady parade of chart-topping performances and live check-ins from Times Square and other U.S. cities before culminating in the iconic ball drop. Cable-cutters can watch the broadcast live via streaming TV services that carry ABC, including DirecTV, Sling TV, Hulu + Live TV and Fubo.\n\n\tOver on cable, CNN continues to position itself as the looser, adult-leaning alternative with “CNN New Year’s Eve Live,” hosted by Anderson Cooper and Andy Cohen. Broadcasting live from Times Square, this year’s special promises special guests such as Brandi Carlisle, Sarah Squirm, Leanne Morgan and Patti LaBelle.  The broadcast will air live on CNN and is also available to stream through live-TV streaming bundles such as DirecTV, Hulu + Live TV and Sling TV (with the news add-on).\n\n\t\n\t\t‘New Year’s Eve Live: Nashville’s Big Bash’\t\n\n\tCBS offers a different flavor of celebration with New Year’s Eve Live: Nashville’s Big Bash, which broadcasts from downtown Nashville and leans heavily into country music and live performances. Airing in primetime on CBS, the concert-style special doubles as a showcase for the network’s music-event programming strategy and has become a reliable alternative for viewers less interested in Times Square spectacle. The show streams live for subscribers to Paramount+ with Showtime, while CBS affiliates also carry the broadcast over the air.\n\t\n\t\t‘A Toast to the New Year’ \t\n\n\tNBC rounds out the major-network offerings with “A Toast to the New Year,” which this year reunites former “Today” co-hosts Hoda Kotb and Jenna Bush. The dynamic duo will take a look back at the year’s most memorable moments, with special guest appearances from Howie Mandel, Kristin Chenowethm Ethan Slater, Jim Gaffigan and more. The broadcast airs live on NBC and is available to stream in real time on Peacock for subscribers.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This Year's Top New Year's Eve Broadcasts -- And Where to Stream Them Live Online",
      "image": [
        "https://variety.com/wp-content/uploads/2024/01/GettyImages-1898816976-e1704400239718.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-01T03:20:00.000Z",
      "dateModified": "2026-01-01T03:20:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Politicians and Pop Stars Go Pow! — The Year’s Top  Alliances and Beefs Between Musicians and Lawmakers",
    "url": "https://variety.com/2025/music/news/politicians-musicians-news-beefs-1236621625/",
    "image": "https://variety.com/wp-content/uploads/2025/01/GettyImages-2194384270-e1767225891439.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-01T00:12:56.000Z",
    "description": "\n\tIt’s not as if music and politics haven’t been strange bedfellows for decades. But the bedding down got weirder than ever in 2025, when you were as ",
    "body": "\n\tIt’s not as if music and politics haven’t been strange bedfellows for decades. But the bedding down got weirder than ever in 2025, when you were as likely to see music superstars pop up in the headlines of a D.C. news site like Politico as on Pitchfork. Here are some of the year’s highlights — or, let’s be real, lowlights — in that crossover zone:\n\n\tJan. 20 — Performers at President Trump’s inaugural events include such GOP-favoring artists as Jason Aldean and Kid Rock (who roars, “Is MAGA in the house tonight?”) as well as less obviously partisan Carrie Underwood, who takes the most heat from anti-Trumpers. She says she’s doing it because “we must all come together in the spirit of unity,” which in 2025 does not count as taking the temperature of the room.\n\t\n\n\tMay 15— Bruce Springsteen tells a British audience that America is “in the hands of a corrupt, incompetent and treasonous administration.” Trump responds by calling Springsteen “highly overrated,” “dumb as a rock” and a “dried out prune of a rocker (his skin is all atrophied!).” The president did not lend the Boss any tangerine orange moisturizer tips.\n\n\n\tMay 16 — Unprompted by much of anything, the president contends that music’s biggest superstar has gone from hero to zero under his withering social Truths: “Has anyone noticed that, since I said ‘I HATE TAYLOR SWIFT,’ she’s no longer ‘HOT?’” Three months later, as an addendum to his praise of Sydney Sweeney, he adds of Swift, “I can’t stand her (HATE!).” OMG, gag him with a spoon!\n\n\tMay 29 — In one of many conciliatory moves toward the hip-hop community, Trump pardons Young Boy NBA on a guns conviction. Pras and Diddy lobby for their own pardons (not yet successfully) since the’re being handed out like candy.\n\t\n\n\tOct. 8 — House Speaker Mike Johnson says Bad Bunny being booked for the Super Bowl halftime show is “a terrible decision… In my view, you would have Lee Greenwood, or role models, doing that. Not somebody like this… It sounds like he’s not someone who appeals to a broader audience.” We’ll see whether his math on the seats he needs to hold onto in 2026 is better than his math on Bad Bunny’s stats. Anyhow, way to court that Latino vote.\n\n\tNov. 7 — Trolling with the best, the White House begins a video meme campaign consisting of appropriating huge pop stars or hits for pro-ICE videos. Olivia Rodrigo blasts back: “Don’t ever use my songs to promote your racist, hateful propaganda.” Sabrina Carpenter calls a meme using her music “evil and disgusting. Do not ever involve me or my music to benefit your inhumane agenda.” Tweeted SZA: “White House rage baiting artists for free promo is PEAK DARK.” Of course, for this administration, triggering the world’s most beloved stars is a feature, not a flaw.\n\n\tDec. 7 —Kennedy Center honorees including Kiss and George Strait come to the White House for a medallion ceremony. Gene Simmons,  a longtime friend of the president, insists he is apolitical, but supports the president’s East Wing teardown: ““Have you ever been to Versailles? The American house of the people is shameful.” And he knows shame. So does Cheap Trick, which plays the Honors event to cover Kiss’ “Rock N Roll All Nite,” then lives to regret it every day. Many left-leaning supporters go online to renounce their CT fandom, leading the group to issue a Dec. 17 statement swearing they weren’t there supporting Trump.\n\n\tDec. 12 —Nicki Minaj goes after California governor Gavin Newsom for supporting trans kids, calling him a “wicked and evil man” who will be “obliterated” by her campaign against him. Newsom simply responds by posting Megan Thee Stallion’s anti-Minaj diss track, “Hiss.” It gets weirder when Vice President JD Vance, the recent subject of supportive Minaj posts, tweets “Nicki > Cardi” — further establishing that all adult political life is like high school, just not not as mature or noble.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Politicians and Pop Stars Go Pow! — The Year’s Top  Alliances and Beefs Between Musicians and Lawmakers",
      "image": [
        "https://variety.com/wp-content/uploads/2025/01/GettyImages-2194384270-e1767225891439.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-01T00:12:56.000Z",
      "dateModified": "2026-01-01T00:12:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Stranger Things’ Finale Breakdown: How Does it End, Who Dies and What Happens to Hawkins?",
    "url": "https://variety.com/2025/tv/news/stranger-things-finale-explained-kali-dies-ending-1236620850/",
    "image": "https://variety.com/wp-content/uploads/2025/12/StrangerThings_S5_0694_R.png?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-01T03:00:18.000Z",
    "description": "\n\tSPOILER ALERT: This story contains spoilers for the series finale of “Stranger Things,” now streaming on Netflix.“Stranger Things” has come to an en",
    "body": "\n\tSPOILER ALERT: This story contains spoilers for the series finale of “Stranger Things,” now streaming on Netflix.“Stranger Things” has come to an end.\n\n\tThe horror-fantasy sensation, which started as a modest ’80s pastiche in 2016 and quickly became a Netflix juggernaut, wrapped with a plus-sized series finale written and directed by show creators The Duffer Brothers. Below, find a breakdown of the most important events of the last episode.\n\t\n\t\n\t\tEleven made it out alive!\t\n\n\tIt looked like Eleven (Millie Bobby Brown) sacrificed herself when the bomb detonated, destroying the Upside Down and effectively closing the bridge for evil to appear. She even had one last kiss with Mike (Finn Wolfhard), and all of her friends and loved ones mourned their loss. But surprise! Her sister Kali (Linnea Berthelsen) actually cast one last spell to create a fake Eleven, so it only looked like she died. In the end, per Mike’s estimation, Eleven is safe and sound on a beautiful hike, far away from anyone looking to harvest her blood.\n\n\t\n\t\tBoth Vecna and the Mind Flayer appear to be dead.\t\n\n\tAs Eleven and Vecna (Jamie Campbell Bower) battled inside the enormous Mind Flayer, the rest of the Hawkins crew shot at and fought the big beast. Once Will (Noah Schnapp) jumped into Vecna’s mind to assist Eleven, both baddies — who, according to Henry (also Jamie Campbell Bower), are one and the same — received too many blows and were taken down. Joyce (Winona Ryder) delivered the final strike, beheading Vecna with an axe. Bonus: The little kids were saved, too!\n\t\n\t\tKali is killed.\t\n\n\tLt. Robert Akers (Alex Breaux) got off a shot at Kali right before Murray (Brett Gelman) caused a distraction by blowing up a helicopter. After this, Eleven killed all of the military men and then took over Akers’ mind to make him shoot himself in the head.\n\t\n\t\n\t\tHenry Creel’s traumatizing cave memory is revealed.\t\n\n\tIt turns out that after killing the mystery man, Henry watched his younger self open the briefcase as a piece inside leaps out and burrows itself into his hand. Turns out the Mind Flayer didn’t want Henry to remember that he used him as a vessel to get to Hawkins — just as Will was a vessel for Henry. Henry disputed this, though, saying that he and the Mind Flayer were one and the same.\n\t\n\t\t18 months post-Vecna, things in Hawkins are pretty much back to normal.\t\n\n\tThe catastrophic events of the Upside Down may have been swept under the rug as an earthquake, but at least there’s a memorial! We catch up with our crew after a time jump on high school graduation day. Max (Sadie Sink) is skateboarding and making out with Lucas (Caleb McLaughlin). Hopper (David Harbour) is playing stepfather to Joyce and her kids, taking time to comfort Mike, who’s still grieving El. Plus, Dustin (Gaten Matarazzo) is valedictorian, and, of course, his speech is all about “Dungeons & Dragons.”\n\n\tSteve (Joe Keery) is now a high school sex-ed teacher and baseball coach — and Derek (Jake Connell) is a catcher on the team. In other news, Nancy (Natalia Dyer) dropped out of Emerson for a journalism job, Robin (Maya Hawke) is studying at Smith and Jonathan (Charlie Heaton) is working on a movie at NYU film school. \n\n\tAfter graduation day, Hopper proposes to Joyce and suggests they move to Montauk, where he got a new job offer, so they could have a fresh start. Meanwhile, Mike, Max, Dustin, Lucas and Will skip an invite to a graduation party in order to play a D&D campaign that has a bittersweet ending which mirrors their own futures: Will heads to the big city and starts dating; Max and Lucas stay together; Dustin goes to college but still hangs out with Steve; and Mike becomes an author.\n\n\tThe last scene finds Mike watching as Holly (Nell Fisher), Derek and their friends start up their own D&D campaign.\n\t\n\t\tMike apologizes for not saying something earlier about Will coming out.\t\n\n\tIt was sweet to see Mike comforting Will at the top of the episode. Nothing will get between these two buds!\n\t\n\t\tSteve and Jonathan make nice.\t\n\n\tSteve and Jonathan let bygones be bygones, and both agree that neither is the right man for Nancy.\n\t\n\t\n\t\tHolly finally had her heroic moment by leading the kids to the cave.\t\n\n\tHolly felt so guilty about not helping her mother, Karen (Cara Buono), and not being brave at other times, but she made up for it in this episode.\n\t\n\t\tUnlike most blockbusters these days, there is no mid- or post-credits scene.\t\n\n\tThings are quiet in Hawkins…for now!\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Stranger Things’ Finale Breakdown: How Does it End, Who Dies and What Happens to Hawkins?",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/StrangerThings_S5_0694_R.png?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-01T03:00:18.000Z",
      "dateModified": "2026-01-01T03:00:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump Mocks George and Amal Clooney For Becoming French Citizens: ‘Two of the Worst Political Prognosticators of All Time’",
    "url": "https://variety.com/2025/film/news/trump-mocks-george-amal-clooney-french-citizens-1236621618/",
    "image": "https://variety.com/wp-content/uploads/2025/12/MixCollage-31-Dec-2025-03-33-PM-5612.jpg?crop=23px%2C46px%2C1151px%2C647px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-12-31T23:45:12.000Z",
    "description": "\n\tDonald Trump took to Truth Social on Wednesday afternoon to poke fun at George Clooney and his family for becoming French citizens. He also made sur",
    "body": "\n\tDonald Trump took to Truth Social on Wednesday afternoon to poke fun at George Clooney and his family for becoming French citizens. He also made sure to loop in some of his favorite political targets: Joe Biden, Kamala Harris and Gavin Newsom.\n\n\t“Good News! George and Amal Clooney, two of the worst political prognosticators of all time, have officially become citizens of France which is, sadly, in the midst of a major crime problem because of their absolutely horrendous handling of immigration, much like we had under Sleepy Joe Biden.” Trump wrote.\n\t\n\n\tHe contiuned, “Remember when Clooney, after the now infamous debate, dumped Joe during a fundraiser, only to go onto the side of another stellar candidate, Jamala(K!), who is now fighting it out with the worst governor in the Country, including Tim Waltz, Gavin Newscum, for who is going to lead the Democrats to their future defeat. Clooney got more publicity for politics than he did for his very few, and totally mediocre, movies. He wasn’t a movie star at all, he was just an average guy who complained, constantly, about common sense in politics.”\n\n\n\tClooney is an outspoken critic of Trump and a staunch supporter of the Democratic Party. Back in April, the “Jay Kelly” star told CBS that he pays no mind to Trump’s insults and mocked the president as a “fake movie actor.”\n\n\t“I don’t care,” Clooney said. “I’ve known Donald Trump for a long time. My job is not to please the President of the United States. My job is to try and tell the truth when I can and when I have the opportunity. I am well aware of the idea that people will not like that. … People will criticize that. Elon Musk has weighed in [about me]. That is their right. It’s my right to say the other side.”\n\t\n\n\tIn a recent cover story with Variety, Clooney addressed Trump’s second-term lawsuits against the media and encouraged networks to stand up to the president rather than settle.\n\n\t“If CBS and ABC had challenged those lawsuits and said, ‘Go fuck yourself,’ we wouldn’t be where we are in the country,” Clooney said. “That’s simply the truth.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump Mocks George and Amal Clooney For Becoming French Citizens: ‘Two of the Worst Political Prognosticators of All Time’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/MixCollage-31-Dec-2025-03-33-PM-5612.jpg?crop=23px%2C46px%2C1151px%2C647px&resize=1000%2C563"
      ],
      "datePublished": "2025-12-31T23:45:12.000Z",
      "dateModified": "2025-12-31T23:45:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Netflix Crashes as ‘Stranger Things’ Finale Premieres, Second Time This Season",
    "url": "https://variety.com/2025/tv/news/netflix-down-crashes-stranger-things-finale-1236621055/",
    "image": "https://variety.com/wp-content/uploads/2025/12/StrangerThings-Eleven-submerged.Volume2.1.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-01T01:05:15.000Z",
    "description": "\n\tVecna has struck again!\n\n\tNetflix crashed for some useres Wednesday night as the series finale of “Stranger Things” premiered. The streamer also exp",
    "body": "\n\tVecna has struck again!\n\n\tNetflix crashed for some useres Wednesday night as the series finale of “Stranger Things” premiered. The streamer also experienced technical problems a few weeks ago during the Season 5 premiere on Nov. 26.\n\n\tThe streamer crashed right at 5 p.m. PT, coinciding with the drop time for the “Stranger Things 5” finale. The crash lasted roughly a minute and was fixed after a few refreshes. As was the case last time, users encountering the error were met with an image from “Nailed It!” with the caption: “Something went wrong. Sorry, we’re having trouble with your request. You’ll find lots to explore on the home page.” \n\t\n\n\tDuring the Nov. 26 crash, Netflix was down for about five minutes when the first four episodes of Season 5 released at 5 p.m. PT. Season 4 of “Stranger Things” also caused some technical issues back in July 2022 when the final episodes dropped. Outside of the Upside Down, Netflix had livestream issues when the Mike Tyson vs. Jake Paul boxing match aired live last year.\n\n\n\tNetflix survived the second batch of “Stranger Things” Season 5 episodes, which released on Christmas Day and had no technical problems. Those episodes powered Netflix to its highest viewership ever for Christmas Day. Season 5 was the most-watched title worldwide thanks to the three new episodes. Between Dec. 22-28, the fifth and final season received 34.5 million views. That marked the season’s second-best weekly total after its debut with 59.6 million views in November, which was Netflix’s best-ever opening week for an English-language title.\n\t\n\n\tThe highly anticipated series finale also premieres in select theaters on New Year’s Eve. According to co-creator Ross Duffer, 1.1 million people have RSVP’d to theatrical screenings. He added that 3,500 screenings are sold out across 620 theaters.\n\n\t“What a way to close out a 10-year journey — together,” he wrote on Instagram with his brother and co-creator Matt Duffer. “Maybe we’ll see some of you in LA.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Netflix Crashes as ‘Stranger Things’ Finale Premieres, Second Time This Season",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/StrangerThings-Eleven-submerged.Volume2.1.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-01T01:05:15.000Z",
      "dateModified": "2026-01-01T01:05:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Island Boys' Franky Venegas Arrested in Florida",
    "url": "https://www.tmz.com/2026/01/01/island-boys-franky-venegas-arrested/",
    "image": "https://imagez.tmz.com/image/a0/16by9/2026/01/01/a07df33b89f448dbb105aa72653e43ca_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-01T13:52:48.000Z",
    "description": "\n    \n                    \n                          Island Boys' Franky Venegas\n                          Arrested On NYE\n                      \n    ",
    "body": "\n    \n                    \n                          Island Boys' Franky Venegas\n                          Arrested On NYE\n                      \n                  \n                                                                        Published \n                              January 1, 2026\n                            5:52 AM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          One half of the Island Boys didn't ring in the New Year on a high note ... 'cause TMZ has learned Franky Venegas was arrested again in Florida for alleged drug related offenses and is currently behind bars.\n      \n    \n          Law enforcement tells us Franky was booked into the Collier County Jail in Naples Wednesday night on one count of drug paraphernalia, posing for a fresh mug shot ... face tattoos and all.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          We're told Franky has no bond, as he's being held on a 24 hour hold because he's already out on bond from a February arrest for delivering/possessing/selling a firearm with an altered serial number.\n      \n    \n          We broke the story ... Franky was arrested in February on drug and firearm charges. The drug count was dropped, but the firearm charge stuck and that's the case he's currently out on bond for.\n      \n\n          According to the February sheriff's report, officers stopped a yellow Corvette after it allegedly ran a stop sign. Cops say a baggie of suspected Oxycodone was found on the passenger side floorboard. Venegas denied ownership, claiming he had a prescription he didn't have with him.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          At the time, police also found a brown \"MGM\" handbag containing a blue spray painted handgun with no serial numbers, a cut straw, and credit cards in Venegas' name. Another straw with a white powdery substance was allegedly found in the center console.\n      \n    \n          Franky rose to fame in 2021 with twin brother Alex after their viral hit, \"I'm an Island Boy.\"\n      \n    \n          He's previously been arrested for domestic battery, reckless driving, and driving without a license.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Flyysoulja\n              \n                          \n                Celebrity News\n              \n                          \n                Arrests\n              \n                          \n                Drugs & Alcohol\n              \n                          \n                Crime\n              \n                          \n                Exclusive\n              \n                          \n                Police\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Island Boys' Franky Venegas Arrested in Florida",
      "image": [
        "https://imagez.tmz.com/image/a0/16by9/2026/01/01/a07df33b89f448dbb105aa72653e43ca_xl.jpg"
      ],
      "datePublished": "2026-01-01T13:52:48.000Z",
      "dateModified": "2026-01-01T13:52:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Deadly New Year's Fire at Swiss Alps Resort Bar, Dozens Killed",
    "url": "https://www.tmz.com/2026/01/01/new-years-fire-swiss-alpes-resort/",
    "image": "https://imagez.tmz.com/image/c4/16by9/2026/01/01/c4e5f36ac5af46fcb191eec24d92bed8_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-01T13:17:45.000Z",
    "description": "\n    \n                    \n                          Swiss Alps Resort Bar\n                          Fire Leaves Dozens Dead\n                      \n  ",
    "body": "\n    \n                    \n                          Swiss Alps Resort Bar\n                          Fire Leaves Dozens Dead\n                      \n                  \n                                                                        Published \n                              January 1, 2026\n                            5:17 AM PST\n                                                                      |\n                                                                Updated \n                                  January 1, 2026\n                                6:20 AM PST\n                                    \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          A New Year's celebration turned tragic in the Swiss Alps.\n      \n    \n          Police say several dozen people are presumed dead and around 100 others were injured after a massive fire ripped through a popular bar in the resort town of Crans-Montana Wednesday morning.\n      \n    \n      \n      🔴 #Svizzera, esplosione in un bar della località sciistica di Crans-Montana: «40 morti e un centinaio di feriti». I testimoni: «Era una festa di #Capodanno per under 17»L'incendio partito nel seminterrato del «Le Constellation»: il locale può ospitare fino a 400 persone. pic.twitter.com/sKuaFvaIJf— DaniDan (@DanieleDann1) January 1, 2026\n              @DanieleDann1\n          \n  \n    \n          Reports say the blaze broke out around 1:30 AM local time at Le Constellation, a bar packed with New Year's revelers. Authorities say the fire's cause is still undetermined.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          \"A large contingent of police, firefighters, and rescue personnel immediately responded to the scene to assist the numerous victims,\" police said in a statement, calling the response a major emergency operation.\n      \n\n          First responders flooded the area as flames tore through the venue, with officials quickly closing off the surrounding neighborhood to the public. A no fly zone was also put in place as rescue efforts continued.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Crans-Montana is a well known ski destination in Switzerland's southern Sierre District, drawing tourists from around the world during the winter season especially during the holidays.\n      \n    \n          Police say casualty numbers could change as rescue crews continue to search the scene and hospitals treat the injured. Investigators are now working to determine how the fire started.\n      \n      \n              \n          \n                          \n                RIP\n              \n                          \n                News\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Deadly New Year's Fire at Swiss Alps Resort Bar, Dozens Killed",
      "image": [
        "https://imagez.tmz.com/image/c4/16by9/2026/01/01/c4e5f36ac5af46fcb191eec24d92bed8_xl.jpg"
      ],
      "datePublished": "2026-01-01T13:17:45.000Z",
      "dateModified": "2026-01-01T13:17:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Zohran Mamdani Sworn In as New York City Mayor",
    "url": "https://www.tmz.com/2026/01/01/zohran-mamdani-sworn-in-as-new-york-city-mayor/",
    "image": "https://imagez.tmz.com/image/52/16by9/2026/01/01/5261730fe1bf4f53a2ed71ba875bd4c2_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-01T12:59:03.000Z",
    "description": "\n    \n                    \n                          Zohran Mamdani\n                          Sworn In as NYC Mayor in Midnight Ceremony\n             ",
    "body": "\n    \n                    \n                          Zohran Mamdani\n                          Sworn In as NYC Mayor in Midnight Ceremony\n                      \n                  \n                                                                        Published \n                              January 1, 2026\n                            4:59 AM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Zohran Mamdani is officially New York City's mayor and he kicked off his historic term in unconventional fashion.\n      \n    \n          The 34-year-old was sworn in just after midnight Thursday in a private ceremony administered by New York Attorney General Letitia James. The oath took place at the old City Hall subway station, one of the city's original stops.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          The ceremony made history, with Mamdani becoming NYC's first Muslim mayor. He was joined by his wife, Rama Duwaji. A larger, public ceremony is scheduled for later Thursday at City Hall, where Mamdani will be formally introduced by Rep. Alexandria Ocasio-Cortez. Bernie Sanders is also expected to attend.\n      \n\n          Mamdani won the mayoral race in November, defeating Andrew Cuomo and Curtis Sliwa. While critics labeled him a \"communist,\" Mamdani identifies as a democratic socialist, aligning himself politically with Sanders and Ocasio-Cortez.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          In his election-night speech, he promised to confront oligarchy and authoritarianism \"with the strength it fears, not the appeasement it craves.\"\n      \n    \n          Mamdani’s swearing in marked the end of Eric Adams' single term as mayor.\n      \n      \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Zohran Mamdani Sworn In as New York City Mayor",
      "image": [
        "https://imagez.tmz.com/image/52/16by9/2026/01/01/5261730fe1bf4f53a2ed71ba875bd4c2_xl.jpg"
      ],
      "datePublished": "2026-01-01T12:59:03.000Z",
      "dateModified": "2026-01-01T12:59:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Disney World Employee Recovering After 400-lb Boulder Crushed Him",
    "url": "https://www.tmz.com/2025/12/31/disney-world-employee-recovering-indiana-jones-boulder/",
    "image": "https://imagez.tmz.com/image/02/16by9/2025/12/31/021edcc8d1ee4b2cafc4cfaa07c4217c_xl.png",
    "tag": "Entertainment",
    "date": "2025-12-31T22:41:59.000Z",
    "description": "\n    \n                    \n                          Disney World Disaster\n                          'Indiana Jones' Staffer Recovering From Boulder B",
    "body": "\n    \n                    \n                          Disney World Disaster\n                          'Indiana Jones' Staffer Recovering From Boulder Bash\n                      \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          A Walt Disney World 'Indiana Jones' employee won't experience their 'Last Crusade' after being smashed by a prop boulder ... because the park says the worker is recovering.\n      \n    \n          Here's the deal ... video went viral Tuesday of a live \"Indiana Jones Epic Stunt Spectacular\" show going off the rails -- and, we mean that literally, because a fake boulder jumped the track and started bouncing toward the rail ... right at the crowded audience.\n      \n    \n          Waiting for your permission to load TikTok Post.\n      \n    \n          An adventurous staffer rushed forward to try and stop the boulder ... but, he ended up knocked down to the ground and bloody.\n      \n\n          A spokesperson for WDW tells TMZ ... \"We’re focused on supporting our cast member, who is recovering. Safety is at the heart of what we do, and that element of the show will be modified as our safety team completes a review of what happened.”\n      \n    \n          Glad to hear our Dr. Jones staffer's feeling alright ... though hopefully some real doctors are keeping a close eye on him.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Nurse!\n              \n                          \n                Disney\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Disney World Employee Recovering After 400-lb Boulder Crushed Him",
      "image": [
        "https://imagez.tmz.com/image/02/16by9/2025/12/31/021edcc8d1ee4b2cafc4cfaa07c4217c_xl.png"
      ],
      "datePublished": "2025-12-31T22:41:59.000Z",
      "dateModified": "2025-12-31T22:41:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Body Found in Texas Identified as Missing Teen Camila Olmos, Death Ruled Suicide",
    "url": "https://www.tmz.com/2025/12/31/camila-olmos-body-identified-death-ruled-suicide-missing-texas-teen/",
    "image": "https://imagez.tmz.com/image/4d/16by9/2025/12/31/4d1810f799d24e9089d95481b2191ec0_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-12-31T21:15:06.000Z",
    "description": "\n    \n                    \n                          Missing Texas Teen\n                          Body Confirmed as Camila Olmos ...\n                 ",
    "body": "\n    \n                    \n                          Missing Texas Teen\n                          Body Confirmed as Camila Olmos ...\n                          Death Ruled Suicide\n                      \n                  \n                                                                        Published \n                              \n                December 31, 2025\n                \n                            1:15 PM PST\n                                                                      |\n                                                                Updated \n                                  December 31, 2025\n                                2:53 PM PST\n                                    \n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          A body found in a field in Texas Tuesday evening has been identified as missing 19-year-old Camila Mendoza Olmos, who disappeared on Christmas Eve ... and local law enforcement says she took her own life.\n      \n    \n          The Bexar County Sheriff's Office announced Wednesday the body was confirmed as Camila, and the medical examiner ruled her death a suicide ... a gunshot wound to the head.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          As we reported, Bexar County and FBI investigators found the corpse around 4:40 to 4:45 PM local time Tuesday amid a frantic weeklong search for Camila in the San Antonio area.\n      \n\n          The grim discovery occurred near a landscaping business, only a few hundred yards from Camila's home. Authorities said there was a gun found next to the body.\n      \n    \n          Camila was last seen leaving her home around 7 AM on Christmas Eve and local authorities released dashcam footage from the day of her disappearance that shows a person -- who they previously said was her -- walking along the side of the Wildhorse Parkway, about 2 blocks from her house.\n      \n    \n          Notably, Camila was 1 of 3 teens recently reported as missing in the area. A 14-year-old has since been found safe, while a 17-year-old is still MIA. Officials have not connected the cases.\n      \n    \n          If you or someone you know is struggling or in crisis, help is available. Call or text 988 or chat 988lifeline.org.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Camila Mendoza Olmos\n              \n                          \n                RIP\n              \n                          \n                True Crime\n              \n                          \n                Police\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Body Found in Texas Identified as Missing Teen Camila Olmos, Death Ruled Suicide",
      "image": [
        "https://imagez.tmz.com/image/4d/16by9/2025/12/31/4d1810f799d24e9089d95481b2191ec0_xl.jpg"
      ],
      "datePublished": "2025-12-31T21:15:06.000Z",
      "dateModified": "2025-12-31T21:15:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]