[
  {
    "title": "Shah Rukh Khan’s ‘King’ Tops IMDb’s Most Anticipated Indian Films of 2026 List (EXCLUSIVE)",
    "url": "https://variety.com/2026/film/news/shah-rukh-khan-king-imdb-most-anticipated-indian-films-2026-1236630785/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Shah-Rukh-Khan-King.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-15T04:30:00.000Z",
    "description": "\n\tIMDb has revealed its most anticipated Indian films of 2026, with Shah Rukh Khan‘s action thriller “King” claiming the top spot based on global user",
    "body": "\n\tIMDb has revealed its most anticipated Indian films of 2026, with Shah Rukh Khan‘s action thriller “King” claiming the top spot based on global user engagement from the platform’s worldwide audience.\n\n\tThe rankings, determined by actual page views from more than 250 million monthly visitors to IMDb, reflect growing international interest in India’s diverse film output. The list spans 20 titles across five languages, with 10 Hindi-language films leading the pack, followed by five Telugu productions, three Tamil titles, and one each in the Malayalam and Kannada languages.\n\t\n\n\t“King” reunites Khan with his “Pathaan” director Siddharth Anand, marking the superstar’s first theatrical release in nearly three years. The film’s top ranking signals strong fan anticipation for Khan’s big-screen return.\n\n\n\tFollowing “King” in the rankings are Nitesh Tiwari’s mythological epic “Ramayana Part 1,” starring Ranbir Kapoor and Yash; H. Vinoth’s Tamil political drama “Jana Nayagan,” which is supposed to be actor-turned-politician Vijay’s last acting role;  Prabhas-starrer “Spirit,” directed by Sandeep Reddy Vanga; and Geetu Mohandas’ “Toxic,” featuring Yash.\n\n\tSeveral major stars appear in multiple films on the list. Nayanthara features in both “Toxic” and “Patriot,” which is headlined by Malayalam cinema superstars Mammootty and Mohanlal, while Yash appears in “Ramayana Part 1” and “Toxic.” Sunny Deol stars in “Ramayana Part 1” and “Border 2,” and Prabhas leads “Spirit” and “Fauzi.” Ranbir Kapoor appears in “Ramayana Part 1” and Sanjay Leela Bhansali’s “Love & War,” which also stars Alia Bhatt. Bhatt additionally features in “Alpha,” part of the Yash Raj Films Spy Universe. Triptii Dimri rounds out the multi-film stars with roles in “Spirit” and “O Romeo.”\n\t\n\n\tThe lineup also includes sequel “Dhurandhar 2,” alongside franchise expansions such as “Alpha” (YRF Spy Universe), “Benz” (Lokesh Cinematic Universe), and “Shakti Shalini” (Maddock Horror-Comedy Universe).\n\n\tRounding out the top 20 are Salman Khan’s “Battle of Galwan,” Pradeep Ranganathan’s “LIK: Love Insurance Kompany,” Nani’s “The Paradise,” Ram Charan’s “Peddi,” NTR Jr’s “Dragon” and Akshay Kumar’s “Bhooth Bangla.”\n\n\tThe rankings methodology focuses on sustained engagement, measuring which titles were consistently most viewed by IMDb’s global user base among Indian films scheduled for 2026 theatrical release. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Shah Rukh Khan’s ‘King’ Tops IMDb’s Most Anticipated Indian Films of 2026 List (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Shah-Rukh-Khan-King.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-15T04:30:00.000Z",
      "dateModified": "2026-01-15T04:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Witches, Vampires and Aliens: How Genre Films Like ‘Sinners’ and ‘Weapons’ Factor Into the Oscar Race",
    "url": "https://variety.com/2026/film/actors/horror-movies-vampires-witches-wicked-for-good-sinners-1236631566/",
    "image": "https://variety.com/wp-content/uploads/2024/12/Bugonia-Movie-2.jpg?w=900&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-15T04:03:34.000Z",
    "description": "\n\tHailee Steinfeld and her “Sinners” co-star Michael B. Jordan shared the kind of on-set conversations you can only have while making a horror movie. ",
    "body": "\n\tHailee Steinfeld and her “Sinners” co-star Michael B. Jordan shared the kind of on-set conversations you can only have while making a horror movie. While filming, one of their frequent debates was over what would it sound like to feed on someone as a vampire. \n\n\t“We were joking that we sounded like the Cookie Monster at one point because we thought that, while you’re overcome by this whole transformation, you are still you, and everything you’re feeling is just heightened,” Steinfeld tells Variety. “You want what you want a whole lot more. You feel the loss and hunger a whole lot more.”\n\t\n\n\tQuestioning the specifics of vampire behavior may not seem like a serious acting exercise, but it was just one of the ways the cast of Ryan Coogler’s hit spent their days digging down to the root of humanity that flows through the Southern gothic vampire story. Yet horror films like “Sinners” very seldom get their due for the tremendous effort put into making the genre recognizable and realistic. Aside from notable exceptions like “Silence of the Lambs” and “The Exorcist,” vampires, witches and the stuff of nightmares have long failed to be taken seriously by awards bodies, despite receiving acclaim from critics and audiences.\n\n\n\t“It truly is one of the most emotionally demanding genres because it asks actors to live in extremes,” Steinfeld says. “It is often dismissed as less serious or whatnot, but I think when it’s done well, it is a mirror that reflects our deepest fears and desires in a very raw way. I don’t even know if you could call [“Sinners”] a horror film without calling it anything and everything else too.” \n\t\n\n\n\n\t\n\n\t\t\t\t\tHailee Steinfeld is a vampire in ‘Sinners.’\n\t\n\n\n\n\tEven the fantasy genre has its troubles, despite big wins for films like “The Lord of the Rings: The Return of the King” and “The Shape of Water.” But this year promises to challenge that long-held stigma with a handful of worthy contenders making the case that horror, fantasy and other genre stories can be successful without scaring voters away.\n\n\t“Sinners” is just the start. In the horror space, Warner Bros. also has “Weapons,” Zach Cregger’s box office smash that has a surprise-but-thrilling awards contender in Amy Madigan as Aunt Gladys. Madigan’s campaign may have begun as grassroots manifesting online, but her recent Critics Choice Awards win for best supporting actress and a  SAG-AFTRA Actor Awards nomination solidifies that bigger prizes are within reach. \n\n\n\n\t\n\n\t\t\t\t\tAmy Madigan won audiences over as Aunt Gladys in ‘Weapons.’\n\t\t\t\t\t\t\t\t\tQuantrell Colbert\n\t\n\n\n\n\tIn the fantasy realm, “Wicked: For Good” hopes to continue its own streak of making witches and wizards (even fake ones like Jeff Goldblum’s Wizard of Oz) palatable awards players, with Cynthia Erivo and Ariana Grande already being chiseled into stone for repeat nominations for their performances as Elphaba and Glinda, respectively.\n\n\tBut on the fringes, Oscar voters can also consider aliens (or at least conspiracies about them) with Focus Features’ “Bugonia,” starring Emma Stone and Jesse Plemons. Voters can fall under the spell of a different kind of vamp with Jennifer Lopez’s tantalizing musical “Kiss of the Spider Woman,” or ponder the fantasia that is life itself with Mike Flanagan’s Stephen King adaptation “The Life of Chuck.” The possibilities to recognize genre storytelling feel infinite this awards season, and it is all anchored in character work.\n\n\tFor Omar Benson Miller, who plays sharecropper and nightclub bouncer Cornbread in “Sinners,” his transformational role was personally grounded by his own family. Coogler had given him photos of sharecroppers to consider while in prep, but Miller didn’t need the lesson.\n\n\n\n\t\n\n\t\t\t\t\tOmar Benson Miller as Cornbread in ‘Sinners’\n\t\n\n\n\n\t“Little did he know this was actually in my family history because my grandfather was a sharecropper in Mississippi,” Miller says. “I had photos I could get from my family, so there was a lot that went into me trying to represent my people and my actual family correctly, which then I felt like would translate across the board. At the end of the day, the only way Ryan’s bold vision will work is if you care about the characters before the genre element is ever introduced.”\n\t\n\n\tWhen Cornbread’s story takes a tragic, but not wholly unexpected, turn, Miller says showing what made his character human helps the monster he becomes lure the audience into a dangerous sense of familiarity.\n\n\t“The only way that you actually consider letting him in is if you have built a relationship with him,” he says. “Since Cornbread has been the face at the door for a while, and you saw him previously in the field with his wife, then it really matters when he is pleading and trying to get in.”\n\n\tSkirting that line between horror and fantasy was the unique challenge for “Wicked: For Good’s” Ethan Slater, who had to take his compassionate Boq and warp him into something far more heartless when he is magically transformed into the Tin Man. Despite being a kid-friendly story about flying monkeys, witchy wars and soaring musical declarations, the making of the Tin Man may be among the biggest leaps for audiences. But that’s where the genre can break open even the most human experiences.\n\n\n\n\t\n\n\t\t\t\t\tEthan Slater transforms into the Tin Man in ‘Wicked: For Good.’\n\t\n\n\n\n\t“There’s a horror element to what happens to him,” Slater says. “It was actually really helpful to have a character going through this massive transformation of being open-hearted and optimistic and loving, and then have that stolen from him and his heart shrinking. Sometimes magic is just a helpful way of expressing something that is innately human.”\n\n\tThe physical performance in this case also gets an assist from the prosthetics that let Slater slip into Boq’s new silver-plated era. “It was one of the benefits of working with such an amazing makeup and prosthetic team because I was wearing different skin,” he says. “That is also a very human thing — to not feel at home in your own body.”\n\n\tSlater says genre storytelling can sometimes foster an authentic emotional platform that’s even more realistic than a traditional drama.\n\n\t“When we are telling human stories, we control ourselves more than people do in real life, where we have really high highs and really low lows,” he says. “In reality, we sometimes do things that seem unrealistic, but that’s how people live and it is liberating to push stories to those very real extremes.”\n\n\tIn that way, “The Life of Chuck” may be the toughest pill to swallow among this year’s genre contenders. King’s story tells of the end of the world, through the life of one man. It’s an ethereal, almost mystical dance with the questions of the universe and our part in it. But Flanagan remembers that after King saw the film (and loved it, by the way), he was honest that it wouldn’t be for everyone because even with vampires, witches and wizards on screen this year, embracing human emotion may be the scariest thing of all.\n\t\n\n\t“[King said] ‘This works on me because its heart is on its sleeve,” Flanagan recently recalled on an FYC panel. “We’ve been trained very well to be skeptical, to be on guard, and not to lead with our emotions because that’s vulnerable. We all had a realistic expectation that this wouldn’t necessarily work for everyone because it was so earnest.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Witches, Vampires and Aliens: How Genre Films Like ‘Sinners’ and ‘Weapons’ Factor Into the Oscar Race",
      "image": [
        "https://variety.com/wp-content/uploads/2024/12/Bugonia-Movie-2.jpg?w=900&h=563&crop=1"
      ],
      "datePublished": "2026-01-15T04:03:34.000Z",
      "dateModified": "2026-01-15T04:03:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Todd and Julie Chrisley on Why They Did ‘The Masked Singer’ and Potential Criticism: ‘Their Issue Is Who Pardoned Us’",
    "url": "https://variety.com/2026/tv/news/todd-julie-chrisley-critics-pardon-trump-masked-singer-1236631887/",
    "image": "https://variety.com/wp-content/uploads/2026/01/image002-5.png?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-15T04:15:00.000Z",
    "description": "\n\tLife after lockup: The reveal of Todd and Julie Chrisley as the Croissants on “The Masked Singer” might come with some controversy — given the reali",
    "body": "\n\tLife after lockup: The reveal of Todd and Julie Chrisley as the Croissants on “The Masked Singer” might come with some controversy — given the reality TV couple’s conviction of tax evasion and bank fraud, followed by a pardon by Trump. But Todd told Variety that he hasn’t faced an in-person negative encounter in the months since he and Julie were released from prison.\n\n\tOf course, online, it’s a bit different. “You have people that say things on social media that they used to love us, but now that Trump pardoned us,” he said. “Their issue is who pardoned us. It’s not that we were pardoned, it’s who pardoned us. So I would say to any person that has an issue with that, if they were in our situation and President Trump could have pardoned them, they would have stood in line to have gotten that pardon.”\n\t\n\n\tJulie said she hasn’t seen much blowback because, she believes, the couple has been transparent about what happened, having been convicted and sentenced to a combined 19 years in prison in November 2022 (which was later reduced). The couple reported to prison in 2023.\n\n\t“If we didn’t talk about it on ‘Chrisley Knows Best,’ it was because that was a decision that the network made,” she said. “They didn’t really want to delve into that. But we’ve never shied away from what we’ve gone through, and it’s taken so long to get to the other side. We just look at it as, it’s our story. And so we’re going to tell our story. Who better to tell our story than us.”\n\n\tTodd said he doesn’t respond to the criticism — unless it’s directed right at him. “I live my life based off of what I know is the right thing to do for me, my wife, my children and my mother. I try not to be rude. I try not to offend people,” he said. “But if you knock on my door and you come to my door with that, then I’ve got something waiting for you.”\n\t\n\n\tIn their quest for a pardon, the Chrisleys argued that their conviction was due to political persecution, even though there was no proof of that. Now, Todd Chrisley has tempered that tone, and said that “I don’t want my conversations to be political. I don’t want the movements that I make to be politicized. I want the world to know that Julie and I and our family are the same today. Our core value system is still the same, and it’s still intact. We’re a family that loves people, and our love is not conditional because you love this person, or you live this way, or you believe in this. We are so blessed that that everyone that has a seat at our table, for the most part, has a different political view. And yet, we still have dinner together here in Nashville. We still have a great time. We’re there for each other when something happens and I feel like that, that’s what the world needs.\n\n\t“You can sit and say, ‘I hate President Trump,’ ‘I hate Joe Biden,’ ‘I hate Obama,’ ‘I hate Clinton.’ That’s like a football team. I love Clemson University. That’s where Julie and I grew up, but my son goes to Alabama, so we can’t pull for Clemson when they’re playing Alabama. Just understand that you have a different team that you root for. But do it with respect, do it with kindness and do it with generosity,” he said. “And if we could all get to that place in life, then I think that the world would be a much better place.”\n\n\tOn “The Masked Singer,” the Chrisleys performed “Jailhouse Rock” on last week’s episode, and they agreed that it was perhaps a bit too on the nose.\n\n\t“We’ve leaned into it since it’s happened, we haven’t ran from it,” Todd Chrisley said. “And it just felt right. It was kind of like, ‘you’re not going to hold this over our head, you’re not going to shame us with this.’ And I just felt good with that song. I’ve always loved that song, and it just felt appropriate.”\n\n\tBetween “Jailhouse Rock” and the clue package, it wasn’t hard to figure out it was the Chrisleys — and indeed, panelist Jenny McCarthy-Wahlberg quickly identified them.\n\n\t“We said to the folks at ‘Masked Singer’ that these clues are too telling,” Todd said. “ It’s too fresh, they’re going to figure this out quick. I’ve known Jenny for years, and I always felt she was going to be the one to figure this out.”\n\t\n\n\tThe Chrisleys’ daughter Savannah appeared on “The Masked Singer” in Season 11 as the Afghan Hound, but Todd and Julie didn’t tell her they were going on the show. She figured it out anyway.\n\n\t“The day that we were on set, I got a text from her, and she goes, ‘Are you doing Masked Singer?’ And I said, ‘Why would you ask that?’ And then she called, and she said, ‘Dad, someone there on the set just sent me a text and said they ran into you and mom.’ So that’s how she found out.”\n\n\tWhy do “The Masked Singer”? “I’m not going to lie, I was a little apprehensive,” Julie Chrisley said. “Todd can sing. He has a great voice. He’s recorded a song with Sarah Evans before. So I knew he would be fine. It was something that was completely out of my comfort zone, but I was excited to do it.”\n\n\tThen came the costume, and the Croissant sealed the deal for the two of them. “Savannah’s late fiancé, Nic Kerdiles, who passed away in a motorcycle accident, was French, and I kind of felt like that was a wink from him, because we love him so much,” Todd said. “I just looked at Julie and I said, ‘we have to do the Croissants.’”\n\n\tThe Chrisleys said they’re busy this year working on five different series: Besides Lifetime’s “The Chrisleys: Back to Reality,” Julie has a new cooking show, as well as another show with Savannah, while Todd is working on a separate project in the U.K.\n\n\t“I say this often, that so many people that go through what we have gone through, their whole world is shattered. There’s nothing left for them,” Todd said. “We were blessed that that didn’t happen to us. We were able to come home to our home, we were able to have a car, to be able to have our clothes, to be able to go and sit down for a nice dinner. And so many people don’t have that. So it has been a very humbling season for our family, and it has exposed us to families that we probably would have never had any interaction with. And so I look at that, and I look at where our life is today and how blessed we are since we’ve been home. And I don’t take it for granted.”\n\n\tWatch the Chrisleys as they’re unmasked on “The Masked Singer”:\n\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Todd and Julie Chrisley on Why They Did ‘The Masked Singer’ and Potential Criticism: ‘Their Issue Is Who Pardoned Us’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/image002-5.png?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-15T04:15:00.000Z",
      "dateModified": "2026-01-15T04:15:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Ultimate Girls Trip’ Cast: Bravo Assembles Seven Real Housewives All-Stars to Celebrate Franchise Turning 20",
    "url": "https://variety.com/2026/tv/news/real-housewives-ultimate-girls-trip-cast-lisa-barlow-kyle-richards-nene-leakes-1236631751/",
    "image": "https://variety.com/wp-content/uploads/2026/01/MixCollage-14-Jan-2026-03-47-PM-323.jpg?crop=16px%2C14px%2C1166px%2C656px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-01-15T03:25:00.000Z",
    "description": "\n\t\n\t\t\t\n\t\t\t\t\n\t\n\n\t\n\tJan 14, 2026 7:25pm PT\t\n\t\n\n\t\n\t\t‘Ultimate Girls Trip’ Cast: Bravo Assembles Seven Real Housewives All-Stars to Celebrate Franchise Tu",
    "body": "\n\t\n\t\t\t\n\t\t\t\t\n\t\n\n\t\n\tJan 14, 2026 7:25pm PT\t\n\t\n\n\t\n\t\t‘Ultimate Girls Trip’ Cast: Bravo Assembles Seven Real Housewives All-Stars to Celebrate Franchise Turning 20\n\t\n\n\tErstwhile Bravo star NeNe Leakes will be among 60 Housewives also featured in the series\n\t\n\t\t\t\n\n\n\t\t\t\n\t\t\t\n\t\n\n\t\t\t\t\t\t\t\t\tCourtesy of Bravo\n\t\n\n\t\t\n\t\n\t\t\t\t\n\n\tAs foretold at BravoCon by Andy Cohen — the executive producer of “The Real Housewives,” and the host of Bravo‘s nightly talk show “Watch What Happens Live” — the network will celebrate the franchise turning 20 by producing “The Real Housewives Ultimate Girls Trip: Roaring 20th,” an all-star season featuring a core cast of seven Housewives from seven different cities. Cohen made the announcement on “Watch What Happens Live” Wednesday night, when Porsha Williams of “The Real Housewives of Atlanta” and Venita Aspen from “Southern Charm” were his guests.\n\n\tWilliams will be representing “Atlanta,” as the show makes its way through five different locations where “Real Housewives” has filmed. OG of the OC Vicki Gunvalson (“The Real Housewives of Orange County”), Kyle Richards (“The Real Housewives of Beverly Hills”), Countess Luann de Lesseps (“The Real Housewives of New York City”), Teresa Giudice (“The Real Housewives of New Jersey”), Gizelle Bryant (“The Real Housewives of Potomac”) and Lisa Barlow (“The Real Housewives of Salt Lake City”) will go from Orange County to Beverly Hills, then travel to Atlanta and Miami before ending the trip in New York City. The show will premiere later this year.\n\n\tAlong the way, the main cast will be joined by more than 60 additional Housewives, and that is where NeNe Leakes comes in for her much-heralded (and much-rumored) return to Bravo after her 2022 lawsuit in which she sued NBCUniversal, Bravo, True Entertainment, Cohen personally and other involved parties for violating federal employment and anti-discrimination laws. In Leakes’ lawsuit, which she withdrew later in 2022, she alleged the network and its parent company “maintain a corporate culture that is insensitive to Black talent and fosters racially-offensive behavior that goes unpunished.” \n\n\tLeakes was part of the original cast of “The Real Housewives of Atlanta” in 2008, and was one of the first Bravo stars who showed what the platform could do: Her lightning-quick wit, equally fast comebacks, compelling backstory and immense charisma made her an audience favorite. She quickly became the most quoted and GIF’d Bravo star, as “Close your legs to married men!,” “I said what I said,” “So nasty and so rude,” among many, many other NeNe moments entered the pantheon. Leakes also caught the attention of powerful TV boss Ryan Murphy, who created a recurring role for her on “Glee” and cast her as a series regular on the NBC sitcom “The New Normal.” As her fortunes changed, she remained on “Real Housewives of Atlanta” (though she went part-time for a few seasons), and left officially after Season 12 in 2020.\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tTommy Garcia/Bravo\n\t\n\n\n\n\n\tAfter filing the lawsuit in 2022, though, Leakes became persona non grata at the network, and the following year, she went on former Bravo star (turned anti-Bravo activist) Bethenny Frankel’s podcast to say she’d been blacklisted in the entertainment industry, and was being “severely punished.” In 2024, though, something began to thaw at NBCUniversal, and Leakes was hired to be one of the presenters for “Live From E!: Emmy After Party.” The thawing continued: In an interview from BravoCon from this past November with Frances Berwick — the chairman of Bravo and Peacock Unscripted — when asked whether Leakes might ever fully reconcile with the network, Berwick said, “Yes, she can be on a show again.” Indeed, it’s Berwick whom Leakes thanks first in an emotional post on Instagram earlier Wednesday, in which she collaborated with Bravo to announce her official return. “Couldn’t celebrate 20 years without you,” Cohen wrote in the comments of the post.\n\n\n\tFilming is imminent on “The Real Housewives Ultimate Girls Trip: Roaring 20th” (which is the series’ working title). According to the network’s official description for the show, “Starting where it all began in Orange County and culminating in an epic East Coast grand finale, each stop will feature appearances by fan favorites from different cities to pay tribute to the past, embrace the present and look toward the many miles still ahead. Along the way, viewers can expect nostalgic reunions, heartfelt revelations, effortless humor and the larger-than-life dynamics that only Housewives can deliver.” \n\t\n\n\t“The Real Housewives of Orange County” premiered on Bravo on March 21, 2006, and was intended to be a reality version of “Desperate Housewives,” then among the top shows on television. Nearly 20 years later, Bravo plans to aggressively commemorate the milestone for the franchise. As Berwick put it at BravoCon, “Let’s just say the audience will be very aware that it is the 20th anniversary of ‘Real Housewives,’ with many celebrations around that.”\n\n\t“The Real Housewives Ultimate Girls Trip: Roaring 20th” is produced by Shed Media with Lisa Shannon, Dan Peirson and Darren Ward serving as executive producers. Cohen also serves as executive producer. \n\t\n\n\n\t\n\t\tMore from Variety\n\t\n\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\n\n\t\t\n\n\t\n\t\tMore From Our Brands\n\t\n\t\n\t\t\n\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\n\tRolling Stone\n\n\t\t\t\t\tICE Officer Shoots Man in Leg During Minneapolis Arrest, Says Homeland Security\t\t\n\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\n\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\n\tRobb Report\n\n\t\t\t\t\tThis Sprawling Ritz-Carlton Residence in N.Y.C. Fetched $28.4 Million for Charity\t\t\n\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\n\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\n\tSportico\n\n\t\t\t\t\tRiverside Church Opens Defense in Child Sex Abuse Trial\t\t\n\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\n\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\n\tWWD\n\n\t\t\t\t\tAmazon Seeks to Delay Saks Global’s DIP Financing\t\t\n\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\n\t\t\n\t\n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Ultimate Girls Trip’ Cast: Bravo Assembles Seven Real Housewives All-Stars to Celebrate Franchise Turning 20",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/MixCollage-14-Jan-2026-03-47-PM-323.jpg?crop=16px%2C14px%2C1166px%2C656px&resize=1000%2C563"
      ],
      "datePublished": "2026-01-15T03:25:00.000Z",
      "dateModified": "2026-01-15T03:25:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chris Noth Explains Replying to ‘F— Sarah Jessica Parker’ Comment Amid Rumored Feud: ‘Off-the-Cuff, Slightly Sarcastic Response’",
    "url": "https://variety.com/2026/tv/news/chris-noth-sarah-jessica-parker-comment-sex-and-the-city-1236631869/",
    "image": "https://variety.com/wp-content/uploads/2026/01/MCDSEAN_EC160.jpg?crop=0px%2C124px%2C2813px%2C1582px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-01-15T02:35:09.000Z",
    "description": "\n\t\t\t\n\t\t\t\t\n\t\n\n\t\n\tJan 14, 2026 6:35pm PT\t\n\t\n\n\t\n\t\tChris Noth Explains Replying to ‘F— Sarah Jessica Parker’ Comment Amid Rumored Feud: ‘Off-the-Cuff, Sli",
    "body": "\n\t\t\t\n\t\t\t\t\n\t\n\n\t\n\tJan 14, 2026 6:35pm PT\t\n\t\n\n\t\n\t\tChris Noth Explains Replying to ‘F— Sarah Jessica Parker’ Comment Amid Rumored Feud: ‘Off-the-Cuff, Slightly Sarcastic Response’\n\t\n\t\n\t\t\t\n\n\n\t\t\t\n\t\t\t\n\t\n\n\t\t\t\t\t\t\t\t\t©Warner Bros/Courtesy Everett Collection\n\t\n\n\t\t\n\t\n\t\t\t\t\n\tChris Noth took to Instagram on Wednesday to calm the buzz surrounding a comment he made on an earlier post that appeared to endorse a fan’s take-down of his former “Sex and the City” co-star Sarah Jessica Parker.\n\n\t“My off-the-cuff slightly sarcastic response to a comment on the internet seems to have caused a tempest in a teapot,” Noth wrote. “It is not news. It is not worth all this discussion. It is a waste of time in a world where there are more important things to worry about.”\n\t\n\n\tThe drama for Noth began after he posted a gym selfie on Jan. 9 with the caption, “Fuck new years – LET’S GO!!!!” A fan then replied, “You mean f— sjp & her award right? lol,” in reference to Parker receiving the Golden Globes’ Carol Burnett Award. Noth replied to that comment, “Right.”\n\n\n\tIn Dec. 2021, Noth was accused of sexual assault by two women. Speaking under pseudonyms, Zoe, a member of the entertainment industry, told The Hollywood Reporter she was assaulted by Noth in 2004 in Los Angeles. Lilly, who identified as a journalist, told the outlet she was assaulted by Noth in 2015 in New York City. Noth called the allegations “categorically false” in a prepared statement.\n\n\tIn the wake of the allegations, Noth was dropped from “The Equalizer” and the “Sex and the City” sequel series “And Just Like That.” In a joint statement, Parker and her “Sex and the City” co-stars Cynthia Nixon and Kristin Davis said, “We are deeply saddened to hear the allegations against Chris Noth. We support the women who have come forward and shared their painful experiences. We know it must be a very difficult thing to do and we commend them for it.”\n\n\n\t\n\t\tMore from Variety\n\t\n\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chris Noth Explains Replying to ‘F— Sarah Jessica Parker’ Comment Amid Rumored Feud: ‘Off-the-Cuff, Slightly Sarcastic Response’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/MCDSEAN_EC160.jpg?crop=0px%2C124px%2C2813px%2C1582px&resize=1000%2C563"
      ],
      "datePublished": "2026-01-15T02:35:09.000Z",
      "dateModified": "2026-01-15T02:35:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bruno Mars Adds 30+ New Dates to ‘The Romantic Tour’",
    "url": "https://variety.com/2026/music/news/bruno-mars-adds-romantic-tour-dates-1236631834/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Untitled_c2fe4c.jpg?w=896&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-15T01:11:50.000Z",
    "description": "\n\tBruno Mars has added 30-plus new dates to his 2026 “Romantic Tour,” announced earlier this week, which marks his first full headline tour in nearly ",
    "body": "\n\tBruno Mars has added 30-plus new dates to his 2026 “Romantic Tour,” announced earlier this week, which marks his first full headline tour in nearly a decade. Produced by Live Nation, the 2026 tour will be his first full headlining stadium tour, spanning nearly 70 shows to date across North America, Europe and the U.K.\n\n\tSecond shows have been added in Las Vegas, Arlington, Atlanta, Detroit, Chicago, Miami, Santa Clara, Madrid, Milan and more, with Paris and Vancouver each hosting three nights each. In Toronto, Amsterdam, East Rutherford and Los Angeles, the tour has expanded to four stadium shows per city, while London will see an extraordinary six-night run at Wembley Stadium in July.\n\t\n\n\tThe full itinerary appears below.\n\n\n\tJoining Mars across all dates is his Silk Sonic collaborator Anderson .Paak as DJ Pee .Wee. Additional support will be provided by Victoria Monét, Raye and Leon Thomas across select markets. All North American dates on the Romantic Tour are sponsored by MGM Resorts International and the Pinky Ring at Bellagio.\n\n\tThe tour announcement follows recent news of Mars’ fourth solo album, “The Romantic,” due Feb. 27 on Atlantic Records.\n\n\tTICKETS: Tickets for newly added dates and remaining tickets for previously announced dates will be available during the general onsale beginning tomorrow, January 15 at 12 p.m. local time.\n\n\tTHE ROMANTIC TOUR 2026 DATES:\n\n\tFri, Apr 10 — Las Vegas, NV — Allegiant Stadium*#\n\n\tSat, Apr 11 — Las Vegas, NV — Allegiant Stadium*# – NEW DATE\n\n\tTue, Apr 14 — Glendale, AZ — State Farm Stadium*#\n\t\n\n\tWed, Apr 15 — Glendale, AZ — State Farm Stadium*# – NEW DATE\n\n\tSat, Apr 18 — Arlington, TX — Globe Life Field*#\n\n\tSun, Apr 19 — Arlington, TX — Globe Life Field*# – NEW DATE\n\n\tWed, Apr 22 — Houston, TX — NRG Stadium*#\n\n\tSat, Apr 25 — Atlanta, GA — Bobby Dodd Stadium at Hyundai Field*#\n\n\tSun, Apr 26 — Atlanta, GA — Bobby Dodd Stadium at Hyundai Field*# – NEW DATE\n\n\tWed, Apr 29 — Charlotte, NC — Bank of America Stadium*#\n\n\tSat, May 2 — Landover, MD — Northwest Stadium*#\n\n\tSun, May 3 — Landover, MD — Northwest Stadium*# – NEW DATE\n\n\tWed, May 6 — Nashville, TN — Nissan Stadium*#\n\n\tSat, May 9 — Detroit, MI — Ford Field*#\n\n\tSun, May 10 — Detroit, MI — Ford Field*# – NEW DATE\n\n\tWed, May 13 — Minneapolis, MN — U.S. Bank Stadium*#\n\n\tSat, May 16 — Chicago, IL — Soldier Field*#\n\n\tSun, May 17 — Chicago, IL — Soldier Field*# – NEW DATE\n\n\tWed, May 20 — Columbus, OH — Ohio Stadium*#\n\n\tSat, May 23 — Toronto, ON — Rogers Stadium*#\n\n\tSun, May 24 — Toronto, ON — Rogers Stadium*#\n\n\tWed, May 27 — Toronto, ON — Rogers Stadium*# – NEW DATE\n\n\tThu, May 28 — Toronto, ON — Rogers Stadium*# – NEW DATE\n\n\tThu, Jun 18 — Paris, FR — Stade de France*^ – NEW DATE\n\n\tSat, Jun 20 — Paris, FR — Stade de France*^\n\n\tSun, Jun 21 — Paris, FR — Stade de France*^\n\n\tFri, Jun 26 — Berlin, DE — Olympiastadion*^\n\n\tSun, Jun 28 — Berlin, DE — Olympiastadion*^ – NEW DATE\n\n\tThu, Jul 2 — Amsterdam, NL — Johan Cruijff ArenA*^ – NEW DATE\n\n\tSat, Jul 4 — Amsterdam, NL — Johan Cruijff ArenA*^\n\n\tSun, Jul 5 — Amsterdam, NL — Johan Cruijff ArenA*^\n\n\tTue, Jul 7 — Amsterdam, NL — Johan Cruijff ArenA*^ – NEW DATE\n\n\tFri, Jul 10 — Madrid, ES — Riyadh Air Metropolitano*^\n\n\tSat, Jul 10 — Madrid, ES — Riyadh Air Metropolitano*^ – NEW DATE\n\n\tTue, Jul 14 — Milan, IT — Stadio San Siro*^\n\n\tWed, Jul 15 — Milan, IT — Stadio San Siro*^ – NEW DATE\n\n\tSat, Jul 18 — London, UK — Wembley Stadium Connected by EE*^\n\n\tSun, Jul 19 — London, UK — Wembley Stadium Connected by EE*^\n\n\tWed, Jul 22 — London, UK — Wembley Stadium Connected by EE*^ – NEW DATE\n\n\tFri, Jul 24 — London, UK — Wembley Stadium Connected by EE*^ – NEW DATE\n\t\n\n\tSat, Jul 25— London, UK — Wembley Stadium Connected by EE*^ – NEW DATE\n\n\tTue, Jul 28 — London, UK — Wembley Stadium Connected by EE*^ – NEW DATE\n\n\tFri, Aug 21 — East Rutherford, NJ — MetLife Stadium*@\n\n\tSat, Aug 22 — East Rutherford, NJ — MetLife Stadium*@\n\n\tTue, Aug 25 — East Rutherford, NJ — MetLife Stadium*@ – NEW DATE\n\n\tWed, Aug 26 — East Rutherford, NJ — MetLife Stadium*@ – NEW DATE\n\n\tSat, Aug 29 — Pittsburgh, PA — Acrisure Stadium*\n\n\tTue, Sep 1 — Philadelphia, PA — Lincoln Financial Field*@\n\n\tWed, Sep 2 — Philadelphia, PA — Lincoln Financial Field*@ – NEW DATE\n\n\tSat, Sep 5 — Foxborough, MA — Gillette Stadium*@\n\n\tSun, Sep 6 — Foxborough, MA — Gillette Stadium*@ – NEW DATE\n\n\tWed, Sep 9 — Indianapolis, IN — Lucas Oil Stadium*@\n\n\tSat, Sep 12 — Tampa, FL — Raymond James Stadium*@\n\n\tSun, Sep 13 — Tampa, FL — Raymond James Stadium*@ – NEW DATE\n\n\tWed, Sep 16 — New Orleans, LA — Caesars Superdome*@\n\n\tSat, Sep 19 — Miami, FL — Hard Rock Stadium*@\n\n\tSun, Sep 20 — Miami, FL — Hard Rock Stadium*@ – NEW DATE\n\n\tWed, Sep 23 — San Antonio, TX — Alamodome*@\n\n\tSat, Sep 26 — Air Force Academy, CO — Falcon Stadium at the United States Air Force Academy*@\n\n\tSun, Sep 27 — Air Force Academy, CO — Falcon Stadium at the United States Air Force Academy*@ – NEW DATE\n\n\tFri, Oct 2 — Inglewood, CA — SoFi Stadium*@\n\n\tSat, Oct 3 — Inglewood, CA — SoFi Stadium*@\n\n\tTue, Oct 6 — Inglewood, CA — SoFi Stadium*@ – NEW DATE\n\n\tWed, Oct 7 — Inglewood, CA — SoFi Stadium*@ – NEW DATE\n\n\tSat, Oct 10 — Santa Clara, CA — Levi’s Stadium*@\n\n\tSun, Oct 11 — Santa Clara, CA — Levi’s Stadium*@ – NEW DATE\n\n\tWed, Oct 14 — Vancouver, BC — BC Place*@\n\n\tFri, Oct 16 — Vancouver, BC — BC Place*@ – NEW DATE\n\n\tSat, Oct 17 — Vancouver, BC — BC Place*@ – NEW DATE\n\n\t* with Anderson .Paak as DJ Pee .Wee\n\n\t# with Leon Thomas\n\n\t^ with Victoria Monét\n\n\t@ with RAYE\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bruno Mars Adds 30+ New Dates to ‘The Romantic Tour’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Untitled_c2fe4c.jpg?w=896&h=563&crop=1"
      ],
      "datePublished": "2026-01-15T01:11:50.000Z",
      "dateModified": "2026-01-15T01:11:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Radford Lot to Be Turned Over to Lenders After Hackman Defaults (Report)",
    "url": "https://variety.com/2026/film/news/radford-lot-goldman-hackman-capital-partners-1236631832/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Radford-Studio-Center.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-15T02:22:39.000Z",
    "description": "\n\tHackman Capital Partners is expected to cede ownership of Radford Studio Center, the historic L.A. production facility, to lenders after defaulting ",
    "body": "\n\tHackman Capital Partners is expected to cede ownership of Radford Studio Center, the historic L.A. production facility, to lenders after defaulting on a $1.1 billion mortgage, Bloomberg reported Wednesday.\n\n\tHackman, the world’s largest independent studio owner, reportedly told investors last month that it had suspended negotiations to restructure the debt on the 55-acre site, and is expected to turn over the facility to Goldman Sachs.\n\t\n\n\tStudio owners have struggled to lease space due to a sharp downturn in film and TV production volume since 2022. Bloomberg reported that revenue from the property covered just 21% of Hackman’s debt service costs on the property as of last June.\n\n\n\tIn a statement to Variety, Hackman said it is working with the banks on a resolution.\n\n\t“We are continuing to work with the Radford lenders on a path forward for this asset,” a spokesperson said. “This is a challenging time for all suppliers and independent studio owners and operators in the U.S. We have substantial capital behind us, hold 50 percent of our assets without debt, and remain geographically diverse, with 55 percent of our studios outside the U.S. This will help us to navigate through these troubled waters.”\n\n\tGoldman Sachs declined to comment.\n\n\tIn its letter to investors, Hackman said that the MBS Group — which operates Radford and other Hackman-owned facilities — had thwarted efforts to restructure the debt. The MBS Group is an affiliate of Hackman, and allegedly sought changes in the equipment rental deal that made working out an agreement with the banks impossible.\n\t\n\n\tHackman acquired the Radford lot, formerly known as CBS Studio Center, from ViacomCBS for $1.85 billion in 2021. The purchase was part of an acquisition spree that also included the CBS Television City studio in the Fairfax District.\n\n\tHackman announced plans in 2023 to invest $1 billion to renovate the lot, which was built in 1928 and has been home to shows like “Gunsmoke,” “My Three Sons,” “Gilligan’s Island,” “The Mary Tyler Moore Show,” “American Gladiators” and “Seinfeld.”\n\n\tA worker, J.C. “Spike” Osorio, was killed when he fell through rafters at the facility in February 2024. A Cal/OSHA investigation attributed the death to aging wood in the catwalks and assessed Radford a $45,000 penalty.\n\n\tHackman also owns Culver Studios — which is leased to Amazon — as well as production facilities in New York, New Orleans, the U.K. and Vancouver.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Radford Lot to Be Turned Over to Lenders After Hackman Defaults (Report)",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Radford-Studio-Center.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-15T02:22:39.000Z",
      "dateModified": "2026-01-15T02:22:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How Johnny Sequoyah, Breakout Star of ‘Primate,’ Used Jane Goodall’s Life to Inspire Terrifying Lead Role",
    "url": "https://variety.com/2026/film/news/johnny-sequoyah-primate-monkey-horror-jane-goodall-1236631726/",
    "image": "https://variety.com/wp-content/uploads/2026/01/IMG_1840.jpg?crop=0px%2C0px%2C1170px%2C658px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-01-15T00:12:22.000Z",
    "description": "\n\tNever work with kids or animals, the Hollywood cliche goes. Thankfully, actor Johnny Sequoyah didn’t pay attention.\n\n\tAs the lead of last weekend’s ",
    "body": "\n\tNever work with kids or animals, the Hollywood cliche goes. Thankfully, actor Johnny Sequoyah didn’t pay attention.\n\n\tAs the lead of last weekend’s buzzy horror debut “Primate,” Sequoyah heads a cast of young stars in a battle for survival against a killer chimp – worse, one that was raised as a sibling to Sequoyah’s character. The film held its own at the box office against juggernaut “Avatar: Fire and Ash” and the sleeper hit “The Housemaid,” in part thanks to Sequoyah’s sensitive (but still terrifying) work under director Johannes Roberts (“47 Meters Down,” “The First Omen”).\n\t\n\n\tAt 23, Sequoyah is something of a veteran. She began acting at age 8, eventually landing the lead of the NBC series “Believe,” created by Alfonso Cuarón and Mark Friedman and executive produced by J.J. Abrams. As she enters a new chapter and looks toward adult roles, Sequoyah caught up with Variety to discuss her academic approach to the craft and the surprising way she used the late Jane Goodall to inform her performance.\n\n\n\tYour director, Johannes, has a very specific POV. How familiar were you with his work before you read for this part?\n\n\tI had always been too afraid to watch his films. I struggled to make it through “47 Meters Down” once I got this role. He is such a brilliant director in building suspense that it honestly was hard to watch his stuff in preparation. It’s that scary.\n\n\tHe said before that he originally imagined your character, Lucy, as a “nerd,” but you brought an interesting take in your audition that made him change his mind. What was it?\n\t\n\n\tI grounded myself in my relationship with the chimpanzee, Ben. I think that wasn’t the expected route to go, because it’s a horror movie, and you have to be scared. For me, what I thought was scariest was the thing you love most turning against you. I also took a big risk in my audition. I threw a very big “horror girl” scream in there. It wasn’t scripted.  I watched the producers, Johannes and our casting director jump out of their seats and land back in them. The casting director told me she peed a little.\n\n\tYou nailed it.\n\n\tIt was also in person, which I was so grateful for. I got to own this space and feed off their energy. I’m glad it worked out.\n\n\tIt’s probably so rare for an actor of your generation to get an in-person audition.\n\n\tOld school approach!\n\n\tIt’s also a big deal to be number one on the call sheet – on a theatrical movie, no less – at your age.\n\n\tI thought about my younger self a lot taking on this role. I was first on the call sheet as a kid, when I was about 10 years old. I was the lead of a television show called “Believe,” created by Alfonso Caron and J.J. Abrams. I hadn’t been since this movie. When it comes to leading a set, I think the most important thing is just being kind. You can let go of the expectations and the pressure if you come with kindness.\n\n\tWhat did you learn in between those “number one” experiences?\n\n\tGrowing up in the industry isn’t easy for anyone, and I also had some challenges. I was cast in the pilot for “American Housewife” but wasn’t attached to the rest of the series. I was only in the pilot.  I’ve taken experiences that have maybe made me feel ashamed — or even made me think, ”Oh, well, am I supposed to quit now?” — and I used them to work way harder. It’s almost like my war paint. I’m grateful for all of it. It’s made me take my craft more seriously.\n\n\tYou’re 23, I think you’re doing just fine. One of the impressive things about “Primate” is that there’s no CGI. There’s a performer in the chimp suit. Do you ever get used to that? Is it not terrifying every take?\n\n\tI felt like a kid in a candy shop. They don’t really make movies like this anymore. Ben was practical, our wounds were practical. We used a projector for the stars in the sky, our crew painted 1,000-foot murals for palm trees. There was so much love and craftsmanship and care in this film. Ben comprises a 50-person “chimp team,” and he was really scary. When he’s on top of you, your body doesn’t know what’s real or not. I walked off some takes uncontrollably shaking.\n\t\n\n\tWithout giving anything away, it seems like the big scene of the film is you hiding in a closet from Ben – a rickety old thing with slats you can barely see through.\n\n\tThat was the first day of filming. Victoria Wynat, who plays Kate, and I were thrown into the deep end. Neither of us had ever done a horror film, and I’m grateful that we started off there. It set the bar for what was expected from us. Walter Hamada, our producer, gave me an interesting piece of advice before we started. He said, “The audience will only ever be as scared as you are, so you have to be terrified.”\n\n\tYour director has said “Cujo” was a major inspiration point for this film. Did he show you any films or give you any reference points for your character?\n\n\tI love to prepare. I’m in a conservatory and I approach it like a student. I watched every monkey horror movie I could find. The top one is definitely “Monkey Shines.” It’s early ‘80s, and I really loved it. I also listened to a lot of Jane Goodall, her clips and biographies, to understand her research around chimps. I framed my character’s mom on Jane. In the film, my mother was a linguistics professor who was studying chimp and human connections. Who else better to learn from than Jane, the queen? I also did stunt training and learned ASL for this film.\n\n\tYou have Oscar winner Troy Kotsur in this movie. Talk about your dynamic.\n\n\tHe’s the best scene partner you could ever ask for. I was a little intimidated going into working with him, especially learning a new language. I wanted to show up accurately for the role and to work with him. He could not have been more kind. He really took so much time to sit down with me and work on the role and look at the script as a whole, and find moments that I could possibly bring in ASL\n\n\tWhat’s next for you? I hear you’re producing your own stuff now.I am focused on developing and producing my own content. I sold a show that I’m in development on. I can’t say anything more specific at the moment. But doing “Primate” has significantly helped me on my future projects, and I’m passionate about being on the other side of the camera, too.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How Johnny Sequoyah, Breakout Star of ‘Primate,’ Used Jane Goodall’s Life to Inspire Terrifying Lead Role",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/IMG_1840.jpg?crop=0px%2C0px%2C1170px%2C658px&resize=1000%2C563"
      ],
      "datePublished": "2026-01-15T00:12:22.000Z",
      "dateModified": "2026-01-15T00:12:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘The Masked Singer’ Reveals Identity of Croissants and Le Who Who: Here Are All the Celebrities Under the Costumes",
    "url": "https://variety.com/2026/tv/news/the-masked-singer-season-14-episode-2-recap-croissants-1236631765/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Croissants-Le-Who-Who.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-15T01:05:00.000Z",
    "description": "\n\tSPOILER ALERT: Details follow for Season 14, Episode 2 of “The Masked Singer,” “Fear Night,” which aired Jan. 14 on Fox. Updated at 6 p.m. ET to inc",
    "body": "\n\tSPOILER ALERT: Details follow for Season 14, Episode 2 of “The Masked Singer,” “Fear Night,” which aired Jan. 14 on Fox. Updated at 6 p.m. ET to include full recap.\n\n\tTodd and Julie Chrisley, who were fully pardoned by Donald Trump last year after the reality stars were convicted of tax evasion and bank fraud, were revealed on Wednesday as the celebrities under the Croissant costume on Fox’s “The Masked Singer.” And later, comedian Tiffany Haddish was unmasked as the Le Who Who.\n\t\n\n\tThe Croissants were actually eliminated at the end of the season premiere episode last week, but the show ended on a cliffhanger. Panelist Jenny McCarthy-Wahlberg was right, guessing the Chrisleys, while Robin Thicke said it was Snooki and the Situation from “Jersey Shore,” Ken Jeong guessed Tim McGraw and Faith Hill and Rita Ora went with Spencer Pratt and Heidi Montag.\n\n\n\tRELATED: Todd and Julie Chrisley on Why They Did ‘The Masked Singer’ and Potential Criticism: ‘Their Issue Is Who Pardoned Us’\n\n\tWatch their unmasking here:\n\n\n\n\n\tLater, Le Who Who received the fewest votes among this week’s contestants. Ora got it right with Tiffany Haddish. Thicke thought it was Keke Palmer, McCarthy-Wahlberg went with Leslie Jones and Jeong guessed Wanda Sykes.\n\n\t“This is the show that I always wanted to be on,” Haddish told Variety. “Well, I’ve always wanted to be on ‘Dancing With the Stars’, but they said my career isn’t where it needs to be. So when I guess where it needs to be, I get to be on there! I know I’d dominate on ‘Dancing With the Stars’ because I’m a dancing machine.”\n\t\n\n\tHaddish credited her high school years as a mascot for helping her “Masked Singer” performance. “Back in the 1900s I was the school mascot, and I used to have to wear mascot uniform,” she said. “My uniform back then was nowhere near as encompassing as the uniform that I wore this time as being La Who Who. But it was a great reminder. It was like the muscle memory for me, and it made me feel young again, and also very sweaty.”\n\n\tHere is Haddish’s unmasking:\n\n\n\n\n\tThe “Fear Night” episode is a tie-in with Fox’s new “Fear Factor: House of Fear,” which premieres right after “Masked Singer” on Wednesday. Host Johnny Knoxville was a guest on this week’s episode.\n\n\tMoving on to the next round: High Voltage, Calla Lily, Owl and Eggplant. They join Galaxy Girl, Pugcasso, Scarab, Stingray, Cat Witch, Handyman, Queen Corgi, and Snow Cone from last week.\n\n\tTiffany Haddish as Le Who Who, Todd and Julie Chrisley as Croissants and David “Big Papi” Ortiz as Googly Eyes are the celebrities unmasked so far on “The Masked Singer” Season 14.\n\n\tBack for Season 14 are host Nick Cannon, alongside panelists McCarthy Wahlberg, Jeong, Ora and Thicke.\n\n\tNew this season is “America’s Insider,” in which singer, dancer and social media personality Kylie Cantrall will share behind-the-scenes hints and clues for viewers. The twist: Cantrall is in costume, but will unmask for viewers — so the audience knows who she is, but the panelists don’t.\n\n\t“The Masked Singer” Season 14 themed episodes include a tribute to “Star Trek,” the ‘90s comedy “Clueless,” the comic franchise “Teenage Mutant Ninja Turtles” and the blockbuster “Twilight Saga” films. Also Fox’s new “Fear Factor” reboot will feature host Johnny Knoxville in a “Fear Factor: House of Fear Night,” and an “Ozzfest Night” honors late rocker Ozzy Osbourne, including a special tribute by “Masked Singer” alum Kelly Osbourne (Season 2’s Ladybug) saluting her father’s musical influence.\n\n\tThe 18 Masked contestants in Season 14 include Eggplant, Pugcasso, Queen Corgi, the Croissants, Owl, 14 Karat Carrot, Snow Cone, Galaxy Girl, High Voltage, Googly Eyes, Scarab, Handyman, Crane, Le Who Who, Pangolin, Stingray, Cat Witch and Calla Lily.\n\t\n\n\tPer the show, the Season 14 contestants have sold a combined 94 million records, received 47 Teen Choice Award nominations, 12 Emmy nominations, two stars on the Hollywood Walk of Fame, one Tony Award win and one Academy Award nomination.\n\n\tHere were the performances on Wednesday’s two-hour premiere episode.\n\n\n\n\t\n\n\t\t\t\t\tNick Cannon and Le Who Who, “The Masked Singer”\n\t\n\n\n\n\tSong: “One Way or Another,” by Blondie\n\n\tJohnny Knoxville clue: Snakes in a box. “EGOT loading 50%.” “EGOT, that’s just a fancy word for doing it all. And I’m halfway there.”\n\n\tPanel guesses: Leslie Jones, Wanda Sykes, Tiffany Haddish\n\n\tLe Who Who? voiceover: “Did I scare you? You’ve been guessing me for long enough. So here I am. I’m a monster talent. Too big to fit in any little package. Over a billion at the box office. Late night legend? One of the most influential people on the planet. Still think I’m cute? More like raw, bold, and sometimes a little naughty. So congrats on your rare fine. Because I am a collectible, baby.”\n\n\n\n\t\n\n\t\t\t\t\tHigh Voltage, “The Masked Singer”\n\t\n\n\n\t\n\t\tHigh Voltage\t\n\n\tSong: “Everybody Wants to Rule the World,” by Tears for Fears\n\n\tJohnny Knoxville clue: Tarantula. “Rose Bowl.”\n\n\tPanel guesses: Conan O’Brien, Julian Edelman\n\n\tHigh Voltage voiceover: “When I first began my career, the idea of blending in was my biggest fear. I was always more interested in being a leader in my field. Sometimes you gotta get a little crazy to draw a lot of attention. So I listened to my gut and billions took notice. Suddenly, people were plugged in. I’ve been called a patriot, a revolutionary, changing the fabric of American culture. And my Masked Singer mission is taking home that trophy.”\n\n\n\n\t\n\n\t\t\t\t\tCalla Lily, “The Masked Singer”\n\t\n\n\n\t\n\t\tCalla Lily\t\n\n\tSong: “Fight Song,” by Rachel Platten\n\n\tJohnny Knoxville clue: Sewer rats. “Film slate.” “This is the most important role of my life.”\n\n\tPanel guesses: Selma Blair, Christina Applegate\n\n\tCalla Lily voiceover: “Lilies represent life’s beauty. The happy and the sad. I was recently reminded how precious it all is. The doctors didn’t catch it at first, but I knew something was wrong. I pushed back and needed answers. When they told me the diagnosis, my world stopped. But then I thought about my children. I chose to face my fears and fight. And it seems to be working. I still have good days and bad ones. But when this opportunity popped up, I jumped at it. I’m nervous but I’m present. Tonight I’m ready to show my kids what we do. Keep loving without any fear.”\n\t\n\n\n\n\t\n\n\t\t\t\t\tOwl, “The Masked Singer”\n\t\n\n\n\t\n\t\tOwl\t\n\n\tSong: “Wild Thing,” by the Troggs\n\n\tJohnny Knoxville clue: African giant millipedes. “Goat.”\n\n\tPanel guesses: Matthew McConaughey, Billy Bob Thornton\n\n\tOwl voiceover: “Gather round, let me tell you my spooky tale. When I took flight, you couldn’t go anywhere without hearing my name. Folks even started following my look. Imagine that. But then there were also the comments. My biggest fear became people laughing at me, and not with me. Terrifying, right?  But I didn’t listen. Instead, I focused on me. On family. Eventually, life gave me the chance to do something so big, those haters were all eating their words. So, if folks are poking fun behind your back, just give them the bird and do your thing.”\n\n\n\n\t\n\n\t\t\t\t\tEggplant, “The Masked Singer”\n\t\n\n\n\t\n\t\tEggplant\t\n\n\tSong: “Rocket Man,” by Elton John\n\n\tJohnny Knoxville clue: Hissing cockroaches. “Broadway.”\n\n\tPanel guesses: Martin Short, Nathan Lane\n\n\tEggplant voiceover: “Fellow Americans don’t fear, Eggplant is here. And I’m running for winner of the Masked Singer. Here’s why I’m the perfect candidate. I have five decades’ worth of experience playing in many fields. I stand up for the people. I represent the rock stars, ship captains and a whole lot of lovers. When it comes to connections, I’ve schmoozed with everybody. Jason Bateman, Jack Nicholson, Clint Eastwood. They’d all endorse me. So cast your ballot and join me. Together we’ll shoot for the stars.”\n\n\tPast “The Masked Singer” winners include T-Pain as Monster (Season 1), Wayne Brady as Fox (Season 2), Kandi Burruss as Night Angel (Season 3), LeAnn Rimes as Sun (Season 4), Nick Lachey as Piglet (Season 5), Jewel as Queen of Hearts (Season 6), Teyana Taylor as Firefly (Season 7), Amber Riley as Harp (Season 8), Bishop Briggs as Medusa (Season 9), Ne-Yo as Cow (Season 10), Vanessa Hudgens as Goldfish (Season 11), Boyz II Men as Buffalos (Season 12) and Gretchen Wilson as Pearl (Season 13).\n\n\t“The Masked Singer” comes from Fox Alternative Entertainment. Rosie Seitchik, Craig Plestis and Cannon are executive producers, while Seitchik serves as showrunner. The series is based on the South Korean format created by Mun Hwa Broadcasting Corp.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘The Masked Singer’ Reveals Identity of Croissants and Le Who Who: Here Are All the Celebrities Under the Costumes",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Croissants-Le-Who-Who.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-15T01:05:00.000Z",
      "dateModified": "2026-01-15T01:05:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Marty Supreme’ Original Vampire Ending Fully Revealed; Director Josh Safdie Says A24 Reacted by Asking: ‘This Is a Mistake, Right?’",
    "url": "https://variety.com/2026/film/news/marty-supreme-original-vampire-ending-1236631757/",
    "image": "https://variety.com/wp-content/uploads/2026/01/MixCollage-14-Jan-2026-03-34-PM-3137.jpg?crop=14px%2C15px%2C1172px%2C660px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-01-15T00:10:27.000Z",
    "description": "\n\tJosh Safdie told Sean Baker during a recent episode of the A24 Podcast that an early draft of “Marty Supreme” took Timotheé Chalamet’s titular ping-",
    "body": "\n\tJosh Safdie told Sean Baker during a recent episode of the A24 Podcast that an early draft of “Marty Supreme” took Timotheé Chalamet’s titular ping-pong star all the way through the late ‘80s, where he becomes a successful business owner. However, in the film’s final moment, Milton Rockwell, played by Kevin O’Leary, would take “a bite out of his neck,” paying off Rockwell’s “I’m a vampire” line earlier in the third act.\n\t\n\n\t“He turns that [shoe store] into the most successful shop on Orchard Street. He changes it to Marty Mauser’s Shoes,” Safdie said of the scraped ending. “Franchises, franchises again, leaves New York State, becomes a very rich man. All the metrics of success are there. His family grows, he leaves the city, has this beautiful house, and it ends with him at a concert for Tears for Fears with his granddaughter. They’re great seats, up front, and he’s watching it. And he’s thinking about ‘Everybody Wants to Rule the World,’ and youth, and what does it mean, and he has this success, but he’s not doing the thing that he believed he was born on the planet to do.”\n\n\n\tSafdie then dropped the punchline, “You’re on his eyes, we built the prosthetics for Timmy and everything, and Mr. Wonderful shows up behind him and takes a bite out of his neck, and that was the last image. And he hasn’t aged.”\n\n\tSafdie recalled that when A24 read the ending, studio execs asked him, “’This is a mistake, right?’”\n\n\tO’Leary recently told Variety that he was all for the vampiric payoff, sharing that Safdie “went as far as to make digital teeth.” He added, “I know that sounds nuts, but to me that would be the right punishment.”\n\t\n\n\tThe “Shark Tank” star shared that he was “really unsatisfied” with the conclusion of “Marty Supreme,” given that his character gets “fucked over” while Marty and his family have a “kumbaya ending.” O’Leary suggested Odessa A’Zion’s Rachel had to “die in childbirth” at the end as punishment for Marty Mauser’s selfishness. Safdie allegedly considered the change but ultimately deemed it too “sick.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Marty Supreme’ Original Vampire Ending Fully Revealed; Director Josh Safdie Says A24 Reacted by Asking: ‘This Is a Mistake, Right?’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/MixCollage-14-Jan-2026-03-34-PM-3137.jpg?crop=14px%2C15px%2C1172px%2C660px&resize=1000%2C563"
      ],
      "datePublished": "2026-01-15T00:10:27.000Z",
      "dateModified": "2026-01-15T00:10:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sydney Sweeney Wags Bunny Tail During Booty Shake in 'Euphoria' S3 Trailer",
    "url": "https://www.tmz.com/2026/01/14/sydney-sweeney-bunny-booty-shake-euphoria-trailer/",
    "image": "https://imagez.tmz.com/image/db/16by9/2026/01/14/dbbe34ad86634031a012495e4eaf23c3_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-14T18:13:00.000Z",
    "description": "\n    \n                    \n                          'Euphoria' S3 Trailer\n                          Sydney Sweeney Booty Shake Sends Fans Into a Tail",
    "body": "\n    \n                    \n                          'Euphoria' S3 Trailer\n                          Sydney Sweeney Booty Shake Sends Fans Into a Tailspin!!!\n                      \n                  \n                                                                        Published \n                              \n                January 14, 2026\n                \n                            10:13 AM PST\n                                                                      |\n                                                                Updated \n                                  January 14, 2026\n                                12:34 PM PST\n                                    \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Sydney Sweeney is wildin' out on OnlyFans with a full-on booty shake -- psych! It’s not her. It’s Cassie going full send in the latest \"Euphoria\" trailer, and yeah… things get very raunchy, very fast.\n      \n    \n          Yup -- the first teaser for S3 just dropped, and Sydney is fully locked into Cassie mode, playing a cam girl with one very up-close, in-your-face shot of her shaking her booty while rocking a sexy bunny-tail cosplay outfit.\n      \n    \n          There's some other quick flashes of Cassie filming adult content on a bed -- until her boo Nate (Jacob Elordi) walks in mid-scene, and makes it clear he's not thrilled about her new X-rated side hustle.\n      \n\n                  \n          \n                          \n                \n                  \n      \n    \n          There’s a LOT happening -- clearly making up for the four-year wait since Sam Levinson’s drama disappeared from our screens -- and with the story jumping five years ahead, Zendaya’s Rue is still tangled up in that dangerous drug-debt mess we last left her in.\n      \n    \n          The trailer also makes it clear we’ll be checking back in with Hunter Schafer’s Jules, Maude Apatow’s Lexi, Alexa Demie’s Maddy and the rest of the chaotic crew in the final season of \"Euphoria\" -- with the ultra-raunchy ride set to hit HBO on April 12!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Sydney Sweeney\n              \n                          \n                Jacob Elordi\n              \n                          \n                Zendaya Coleman\n              \n                          \n                Celebrity News\n              \n                          \n                TV\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sydney Sweeney Wags Bunny Tail During Booty Shake in 'Euphoria' S3 Trailer",
      "image": [
        "https://imagez.tmz.com/image/db/16by9/2026/01/14/dbbe34ad86634031a012495e4eaf23c3_xl.jpg"
      ],
      "datePublished": "2026-01-14T18:13:00.000Z",
      "dateModified": "2026-01-14T18:13:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'Diff'rent Strokes' Actor Todd Bridges Splits From Wife, Headed for Divorce",
    "url": "https://www.tmz.com/2026/01/14/todd-bridges-wife-separate/",
    "image": "https://imagez.tmz.com/image/df/16by9/2026/01/14/dfe0281cc51748bca32ccf6917557957_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-14T22:36:36.000Z",
    "description": "\n    \n                    \n                          'Diff'rent Strokes' Todd Bridges\n                          Splits From Wife After 3 Years\n       ",
    "body": "\n    \n                    \n                          'Diff'rent Strokes' Todd Bridges\n                          Splits From Wife After 3 Years\n                      \n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Todd Bridges and his wife, Bettijo, are calling it quits and heading for divorce ... TMZ has learned.\n      \n    \n          The \"Diff'rent Strokes\" star tells TMZ ... \"After much thought and mutual respect, we have decided to end our marriage. During our time together we shared meaningful moments, but have chosen to go our separate ways. I ask for privacy and wish her nothing but love and happiness moving forward.\"\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          The split comes just over three years after the couple tied the knot in a low-key Beverly Hills ceremony with about 40 guests.\n      \n\n          The pair met on a dating app nine months before their wedding, quickly hitting it off and getting engaged about six months later.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Todd is a stepfather to Bettijo's four children and has two of his own -- 29-year-old daughter Bo and 28-year-old son Spencir.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          This was Todd's second marriage. He was previously married to Dori Bridges from 1998 to 2012.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Todd Bridges\n              \n                          \n                Breakups\n              \n                          \n                TV\n              \n                          \n                Celebrity Divorce\n              \n                          \n                Exclusive\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Diff'rent Strokes' Actor Todd Bridges Splits From Wife, Headed for Divorce",
      "image": [
        "https://imagez.tmz.com/image/df/16by9/2026/01/14/dfe0281cc51748bca32ccf6917557957_xl.jpg"
      ],
      "datePublished": "2026-01-14T22:36:36.000Z",
      "dateModified": "2026-01-14T22:36:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kendra Wilkinson Talks Transition From 'Girls Next Door' To Real Estate",
    "url": "https://www.tmz.com/2026/01/14/kendra-wilkinson-talks-transition-playboy-real-estate-agent/",
    "image": "https://imagez.tmz.com/image/9c/16by9/2026/01/14/9c596d66a0b047f086639933464004ad_xl.png",
    "tag": "Entertainment",
    "date": "2026-01-15T01:14:27.000Z",
    "description": "\n    \n                    \n                          Kendra Wilkinson\n                          From Playboy Mansion To Selling Mansions\n             ",
    "body": "\n    \n                    \n                          Kendra Wilkinson\n                          From Playboy Mansion To Selling Mansions\n                      \n                  \n                                                                        Published \n                              January 14, 2026\n                            5:14 PM PST\n                                                                            \n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          Kendra Wilkinson is a long way from her days at the Playboy Mansion ... because now she's a realtor.\n      \n    \n          We got the former \"Girls Next Door\" star at the Supermodels Unlimited Magazine Cover Party and our photog asked her about her transition from Playboy and reality TV to real estate.\n      \n    \n          Kendra says she's still got a lot of baggage from her days in Hollywood and that is playing a role in her new life as a celeb realtor ... but she's got no other choice than to make deals to feed her family as a single mother.\n      \n\n          It's interesting, Kendra says lots of people aren't chomping at the bit to hire a famous realtor ... telling us she has to dim her light in this new field.\n      \n    \n                    \n                          \n                                  \n      \n        \n    \n          Kendra says celebrity status works for some of the big guys -- like Jason Oppenheim -- but she hasn't found it to be a plus for her.\n      \n    \n          Check out the clip ... Kendra also tells us whether she'd ever want to join the cast of \"Selling Sunset.\"\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Kendra Wilkinson\n              \n                          \n                Selling Sunset\n              \n                          \n                Reality TV\n              \n                          \n                Exclusive\n              \n                          \n                Models\n              \n                          \n                Playboy\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kendra Wilkinson Talks Transition From 'Girls Next Door' To Real Estate",
      "image": [
        "https://imagez.tmz.com/image/9c/16by9/2026/01/14/9c596d66a0b047f086639933464004ad_xl.png"
      ],
      "datePublished": "2026-01-15T01:14:27.000Z",
      "dateModified": "2026-01-15T01:14:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Video Shows Cam Taylor-Britt's Car Flip in November Crash",
    "url": "https://www.tmz.com/2026/01/14/bengals-cam-taylor-britt-rollover-car-crash-november-nfl/",
    "image": "https://imagez.tmz.com/image/79/16by9/2026/01/14/79585aa3436e45538cf6671f3324cc35_xl.png",
    "tag": "Entertainment",
    "date": "2026-01-14T23:51:48.000Z",
    "description": "\n    \n                    \n                          Bengals' Cam Taylor-Britt\n                          November Crash Caught On Video\n              ",
    "body": "\n    \n                    \n                          Bengals' Cam Taylor-Britt\n                          November Crash Caught On Video\n                          ... Jeep Flips In Terrifying Scene\n                      \n      \n    \n      \n        \n                    \n                  \n      \n                    Covington PD\n          \n    \n          Cincinnati Bengals cornerback Cam Taylor-Britt is lucky to be alive -- the NFL-er told police he was a passenger in a terrifying crash in November, when a vehicle flipped in the street after colliding with a parked car.\n      \n    \n          The moment was caught on surveillance footage, which showed a black Jeep -- registered to Taylor-Britt -- blowing through a red light around 3 AM on November 15.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          The car rolled over and onto its roof ... and out of frame.\n      \n\n          In bodycam footage obtained by Local 12, the scene was empty when officers arrived ... and when they spoke with Taylor-Britt and his brother, Jafabian Booker, about who was behind the wheel ... there were conflicting stories.\n      \n    \n      \n      We obtained 2 1/2 hours of body camera. Officers find no one at the crash..they track Taylor-Britt to his house, officers find him outside.“It is what it is.” Taylor-Britt then offers to go back to the scene. The officer asks, “Who was driving?”Watch @Local12 6 for more pic.twitter.com/OZXybBLfQT— meghan mongillo (@meghanmongillo) January 14, 2026\n              @meghanmongillo\n          \n  \n    \n          When speaking with cops, Taylor-Britt acknowledged his license was suspended at the time.\n      \n    \n          Ultimately, Booker stated he was the driver ... after initially blaming it on a drunk \"female\" who ran off after the crash.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          This incident happened the day before Taylor-Britt suffered a season-ending injury during the Bengals vs. Steelers game.\n      \n    \n          Earlier this month, Taylor-Britt pled guilty to reckless driving and driving with a restricted license ... and was sentenced to five days behind bars.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Cam Taylor-Britt\n              \n                          \n                Arrests\n              \n                          \n                Car Crashes\n              \n                          \n                TMZ Sports\n              \n                          \n                Cincinnati Bengals\n              \n                          \n                NFL\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Video Shows Cam Taylor-Britt's Car Flip in November Crash",
      "image": [
        "https://imagez.tmz.com/image/79/16by9/2026/01/14/79585aa3436e45538cf6671f3324cc35_xl.png"
      ],
      "datePublished": "2026-01-14T23:51:48.000Z",
      "dateModified": "2026-01-14T23:51:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Khloe Kardashian vs. Lizzo Who'd You Rather?! (Animal Print Lewks Edition)",
    "url": "https://www.tmz.com/2026/01/14/khloe-kardashian-vs-lizzo-animal-print/",
    "image": "https://imagez.tmz.com/image/c1/16by9/2026/01/14/c17cd9a00d26437ea4d1fd4255c7b84d_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-14T22:12:48.000Z",
    "description": "\n    \n                    \n                          Khloe Kardashian vs. Lizzo\n                          Who'd You Rather?!\n                         ",
    "body": "\n    \n                    \n                          Khloe Kardashian vs. Lizzo\n                          Who'd You Rather?!\n                          (Animal Print Lewks Edition)\n                      \n      \n    \n          Khloe Kardashian and Lizzo are goin' neck n' neck in their animal print fashion, but which fierce female is gettin' your vote, and which star are you going to demote?! And keep on keepin' on for a Khloe Kardashian memoji game!\n      \n    \n          The question here is: Who'd You Rather?!\n      \n    \n          VOTE NOW! \n      \n    \n          Once you've left the ballots, can you score the Memoji pairs below?\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Khloe Kardashian\n              \n                          \n                Lizzo\n              \n                          \n                Hotties & Bodies\n              \n                          \n                Hot Bodies\n              \n                          \n                Fashion\n              \n                          \n                Who'd You Rather?\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Khloe Kardashian vs. Lizzo Who'd You Rather?! (Animal Print Lewks Edition)",
      "image": [
        "https://imagez.tmz.com/image/c1/16by9/2026/01/14/c17cd9a00d26437ea4d1fd4255c7b84d_xl.jpg"
      ],
      "datePublished": "2026-01-14T22:12:48.000Z",
      "dateModified": "2026-01-14T22:12:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]