[
  {
    "title": "Lumina Media Partners With Benedict Cumberbatch’s Company SunnyMarch (EXCLUSIVE)",
    "url": "https://variety.com/2025/biz/global/benedict-cumberbatch-sunnymarch-lumina-media-1236600069/",
    "image": "https://variety.com/wp-content/uploads/2021/08/The-Electrical-Life-of-Louis-Wain.jpg?crop=0px%2C0px%2C1000px%2C562px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-12-04T19:53:42.000Z",
    "description": "\n\tIt appears Thomas Benski’s new venture Lumina Media has acquired a notable stake in Benedict Cumberbatch‘s production outfit SunnyMarch, according t",
    "body": "\n\tIt appears Thomas Benski’s new venture Lumina Media has acquired a notable stake in Benedict Cumberbatch‘s production outfit SunnyMarch, according to documents filed in the U.K.\n\n\tCumberbatch launched SunnyMarch with friend and producer Adam Ackland in 2013 and they have since made a number of films and TV projects, including “The Thing with Feathers,” which stars Cumberbatch as a grieving father, and comedy-drama “The Electrical Life of Louis Wain,” also featuring the actor.\n\t\n\n\tDocuments filed at U.K. business registrar Companies House late last month show that Ackland, who previously owned more than 75% of SunnyMarch Group Limited, no longer has “significant control” of the company. He has been replaced by the Benski-controlled Lumina Studios Group, which now owns between 25% and 50% of the shares. Ackland remains the sole director of the company however.\n\n\n\tCumberbatch and Ackland have also both ceased to be significant owners of SunnyMarch Holdings Limited in favor of Sunnymarch Group Limited but they remain directors of the company alongside Anton CEO Sebastien Raybaud, to whom they sold a minority stake in 2021. Two charges Anton had registered against another subsidiary, SunnyMarch Limited, which is also owned by SunnyMarch Holdings, were paid off around the same time Lumina took on significant control of the company.\n\n\tCumberbatch recently set out his vision for SunnyMarch, saying it’s focused on “character-driven” films with budgets of between £9 million and £20 million, although he acknowledged it is “increasingly hard” to get movies with such small budgets made. “Our USP is to try to match quality with commerciality that understands the kind of films that we loved growing up watching,” he told Screen.\n\t\n\n\tLumina, which publicly launched this week and is backed by a number of investors including Magnus Rausing, Charles Dorfman and Philip Van Sandwijk, has already partnered with Omar Sy’s Carrousel Studios and Yann Demange’s Wayward Films.\n\n\tVariety has contacted Lumina and SunnyMarch for comment.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lumina Media Partners With Benedict Cumberbatch’s Company SunnyMarch (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2021/08/The-Electrical-Life-of-Louis-Wain.jpg?crop=0px%2C0px%2C1000px%2C562px&resize=1000%2C563"
      ],
      "datePublished": "2025-12-04T19:53:42.000Z",
      "dateModified": "2025-12-04T19:53:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Inside ‘Pink Pony Club’ and Chappell Roan’s Five-Year Journey to the Top of the Charts: ‘We Were Right All Along’",
    "url": "https://variety.com/2025/music/news/chappell-roan-pink-pony-club-five-year-label-fight-1236596969/",
    "image": "https://variety.com/wp-content/uploads/2025/12/Chappell-Roan-Pink-Pony-Club.jpg?crop=0px%2C35px%2C1500px%2C844px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-12-04T20:00:00.000Z",
    "description": "\n\t“Pink Pony Club” may be one of the biggest hits of 2025, but Chappell Roan’s anthemic ode to gay bars was first released five years ago. Roan co-wro",
    "body": "\n\t“Pink Pony Club” may be one of the biggest hits of 2025, but Chappell Roan’s anthemic ode to gay bars was first released five years ago. Roan co-wrote the song with producer Dan Nigro in 2019 and spent a year begging Atlantic Records to put it out. Eventually, the label relented, making it the lead single on what was meant to be Roan’s debut album. But Atlantic dropped the singer before the end of the year, and she recouped ownership of the master recording.\n\t\n\n\tThree years later, the song reemerged on Roan’s debut album, “The Rise and Fall of a Midwest Princess,” and two years after that, it topped the charts and amassed nearly 1 billion streams on Spotify. \n\n\t“It took five years and a ton of blood, sweat and tears from so many people to get this song to where it is now,” Roan says. “To see it go No. 1 is just affirmation that we were right all along.”\n\n\n\tNigro said he knew early on that “Pink Pony Club” was worth the effort it took to get it released — and rereleased. “There are times you know in your heart you have to fight for a song,” Nigro says. “I always think, if a song gives me this feeling, then it has to be able to do it for other people too.”\n\n\t“Pink Pony Club” is inspired by Roan’s visit to West Hollywood gay bar The Abbey after moving from Missouri to L.A. Roan became infatuated with the go-go dancers and thought of the nightclub as a refuge for queer expression. She and Nigro wrote the entire song to a drum beat before laying the throbbing synth foundation under the pre-chorus: “God, what have you done?”\n\t\n\n\t“We felt right away that we had something special,” Nigro says. “I remember my assistant putting on his headphones in the studio, and he took them off after a few minutes, looked at me and said, ‘Wow, this song is crazy.’” Another one of Nigro’s engineers told him, “This might be my favorite song you’ve co-written.”\n\n\tThe lyrics trace Roan’s journey from the Midwest to the West Coast, fictionalizing a few key aspects. Like, she’s leaving Tennessee — not Missouri — in the song, simply because “it sounded better,” Nigro says. And while the Pink Pony Club does not exist, it has come to symbolize any space where people are free to be themselves.\n\n\t“I can’t tell you how many times I’ve cried listening to this song,” Nigro says. “It still makes me emotional.” \n\n\tSongwriters: Chappell Roan, Dan Nigro \n\n\tProducer: Dan Nigro \n\n\tLabel: Amusement / Island Records \n\n\tHitmakers: Dan Nigro, co-writer/producer; Gia Rigoli, Griffin Stoddard, music video producer and director; Heather Baker, Direction Music Group; Ramisha Sattar, creative director\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Inside ‘Pink Pony Club’ and Chappell Roan’s Five-Year Journey to the Top of the Charts: ‘We Were Right All Along’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/Chappell-Roan-Pink-Pony-Club.jpg?crop=0px%2C35px%2C1500px%2C844px&resize=1000%2C563"
      ],
      "datePublished": "2025-12-04T20:00:00.000Z",
      "dateModified": "2025-12-04T20:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Vin Diesel Wheels Michael Caine Along Red Sea Film Festival Red Carpet as Sean Baker Compares Saudi to ‘Early Days of Hollywood’",
    "url": "https://variety.com/2025/film/awards/michael-caine-vin-diesel-red-sea-opening-night-1236600353/",
    "image": "https://variety.com/wp-content/uploads/2025/12/Red-Sea-opener.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-04T19:52:00.000Z",
    "description": "\n\tThe fifth edition of Saudi Arabia’s Red Sea Film Festival kicked off on Thursday with a glitzy red carpet for the Middle East premiere of Rowan Atha",
    "body": "\n\tThe fifth edition of Saudi Arabia’s Red Sea Film Festival kicked off on Thursday with a glitzy red carpet for the Middle East premiere of Rowan Athale’s Sylvester-Stallone produced “Giant,” starring Egyptian-British actor Amir El Masry as iconic British-Yemeni featherweight “Prince” Naseem Hamed and Pierce Brosnan as his trainer. \n\n\tStars walking the carpet included Dakota Johnson, Uma Thurman, Ana de Armas, head of jury Sean Baker and jury members Riz Ahmed, Naomie Harris, Nadine Labaki and Olga Kurylenko, as well as Queen Latifah and Nina Dobrev, who engaged in-depth conversations on-stage at the festival earlier in the day. The carpet’s most momentous exchange, however, happened between Vin Diesel and Michael Caine. The “Fast and Furious” star, who received the festival’s Special Recognition Award in 2024, wheeled the legendary British actor onto the red carpet, where they warmly posed for the cameras. \n\t\n\n\n\n\t\n\n\t\t\t\t\tVin Diesel presents an Honoree Award to Michael Caine during the opening ceremony at the Red Sea Film Festival\n\t\t\t\t\t\t\t\t\tCourtesy of Daniele Venturelli/Getty Images\n\t\n\n\n\n\tDiesel and Caine worked together on 2015’s “The Last Witch Hunter,” with the American actor taking to the stage at the opening ceremony to award Caine his honoree prize. Before praising Caine, Diesel pointed at Baker and joked: “You’re making us all want to make independent movies,” then repeating his infamous 2024 line: “You see more people from Hollywood here [in Jeddah] than at the Oscars.”\n\n\n\t“Tonight is more special for me personally because I’ve been asked to recognize someone who you all know as one of the best actors who’s ever lived,” said Diesel. “He’s been somebody that, as Uma Thurman said, could play character roles or main roles, and all the while has more charisma in his finger than most people in Hollywood.”\n\t\n\n\t“I’m here to get an award, which doesn’t surprise me. I won two Oscars,” quipped Caine on stage, where he was supported by three of his grandchildren. “I have a fabulous family that I adore beyond belief. I’ve had a fairly fabulous movie family, some who’ve let me down, and I love them beyond belief, including the failures. I kept going until I was 90, which is two years ago. I’m not going to do anything else, I’ve had all the luck I can get.”\n\n\n\n\t\n\n\t\t\t\t\tRachid Bouchareb, Kirsten Dunst, Jessica Alba, Jomana R. Alrashid, Juliette Binoche, Dakota Johnson and Stanley Tong during the opening ceremony at the Red Sea Film Festival\n\t\t\t\t\t\t\t\t\tCourtesy of Tim P. Whitby/Getty Images\n\t\n\n\n\n\t“And one of the luckiest things is tonight,” said a clearly moved Caine. “I’m just so happy to be here. I’ve seen it on television but never won anything here, so I’m happy. I want to thank you for the surprise, because in show business you don’t get many surprises, you get a couple of shocks and that’s about it.” \n\n\tCaine joins Sigourney Weaver, Juliette Binoche, Rachid Bouchareb and Stanley Tong as festival honorees this year. The stars will continue to make their way through Jeddah this week, with guests including Jessica Alba, Adrien Brody, Darren Aronofsky and “The Voice of Hind Rajab” director Kaouther Ben Hania.\n\n\tSpeaking at the opening ceremony, Baker said he was “incredibly excited” to be in Saudi, which he compared to the “early days of Hollywood” due to the “endless possibilities” in cinema. “While we are fighting to save screens in the U.S., in five years, hundreds of cinemas have opened here. That makes Saudi the fastest growing box office in the world. As a cinephile whose world is movies, the leaps and bounds happening here are insightful, inspirational and heartwarming.” \n\n\tChairwoman of the Red Sea Film Foundation Jomana R. Alrashid spoke about the impact of the foundation over the last five years. “We have quietly but surely built what many thought was impossible: an ecosystem where filmmakers from across [Asia, Africa and the Arab world] were empowered to lead.”\n\n\tAlrashid emphasized how seven Red Sea Fund-backed projects have been chosen by their countries as Oscar representatives since the beginning of the funding program, a testament to a fund that has supported over 130 projects in the last half decade. The exec also “implored” filmmakers to cease the opportunity to “change perspectives” through changes in paradigm, such as the strength of streamers and new technologies on the rise. “Where creators who once faced barriers now find open doors. This is the most precious gift a creator can have: access and a voice.”\n\t\n\n\tOn the honorees front, Bouchareb said he feels “hopeful for Arab cinema.” “Even in challenging times for the Arab world and its people I am glad to see us telling our stories and welcoming artists from all around the world.”\n\n\tJessica Alba presented the award to iconic stunt coordinator and regular Jackie Chan collaborator Stanley Tong by praising how his work “shaped how we experience action on screen.” Tong thanked the people who “trusted” him throughout his career. “For all the falls, tough shots and impossible action sequences, it taught me one thing: cinema belongs to those actors who never give up, like Jackie Chan,” he added. Tong went on to say he hopes to return to Jeddah next year to shoot a Chinese-Saudi co-production he has already written for Chan to star in after the duo visited the festival two years ago. \n\n\tBinoche got visibly emotional, holding back tears before muttering into the microphone, “I am not going to cry.” In an emotional speech, she said: “Being in an international film festival is very special. It opens your heart even more. It gives so much horizon to your mind. I wish you the best festival ever. Thank you so much for this, it’s very special.”\n\n\tThe Red Sea Film Festival takes place in Jeddah between Dec. 4-13.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Vin Diesel Wheels Michael Caine Along Red Sea Film Festival Red Carpet as Sean Baker Compares Saudi to ‘Early Days of Hollywood’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/Red-Sea-opener.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-04T19:52:00.000Z",
      "dateModified": "2025-12-04T19:52:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Fox News Sets Six Appearances for Erika Kirk Next Week",
    "url": "https://variety.com/2025/tv/news/fox-news-erika-kirk-interview-appearances-charlie-kirk-book-1236600328/",
    "image": "https://variety.com/wp-content/uploads/2025/12/Erika-Kirk.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-04T19:19:22.000Z",
    "description": "\n\tErika Kirk will make six appearances on Fox News Media shows next week, as part of the book tour for “Stop, in the Name of God: Why Honoring the Sab",
    "body": "\n\tErika Kirk will make six appearances on Fox News Media shows next week, as part of the book tour for “Stop, in the Name of God: Why Honoring the Sabbath Will Transform Your Life,” written by her late husband Charlie Kirk.\n\n\tAhead of the book’s release Tuesday, Erika Kirk — who is CEO of Turning Point USA, the conservative activist group founded by Charlie Kirk — will give her first interview to Fox News host Sean Hannity. The interview will air live on “Hannity” at 9 p.m. ET on Fox News Channel on Monday, Dec. 8. Hannity’s interview with her will focus on “why Mrs. Kirk felt it was important to see this project through,” according to Fox News.\n\t\n\n\tKirk will next appear on “Fox & Friends” (6-9 a.m. ET) on Tuesday, Dec. 9, followed by Fox News Radio’s “The Brian Kilmeade Show.” She also will appear as guest co-host on Fox News’ “The Five” (5-6 p.m. ET) on Dec. 9, and join the full hour of FNC’s “Outnumbered” (12-1 p.m. ET) on Wednesday, Dec. 10. In addition, she is scheduled to appear on Fox News Radio’s “Will Cain Country” on Thursday, Dec. 11.\n\n\n\tSeparately, Erika Kirk will be hosted at a one-hour CBS News town-hall special moderated by Bari Weiss, the founder of The Free Press and editor-in-chief of CBS News, scheduled to air Saturday, Dec. 13.\n\n\tCharlie Kirk was assassinated on Sept. 10, 2025, while speaking before a crowd on the campus of Utah Valley University in Orem, Utah.\n\n\tFinished one month before his assassination, “Stop, in the Name of God” was written “in recognition of” Charlie Kirk’s faith, “highlighting the importance of connection, peace and presence,” per Fox News. Erika Kirk was the recipient of the Fox Nation Patriot Awards’ inaugural Charlie Kirk Legacy Award, presented to her at an event Nov. 6, 2025. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Fox News Sets Six Appearances for Erika Kirk Next Week",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/Erika-Kirk.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-04T19:19:22.000Z",
      "dateModified": "2025-12-04T19:19:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How Addison Rae and Collaborators Luka Kloser and Elvira Anderfjärd Crafted Her Grammy-Nominated Debut as an All-Female Power Trio",
    "url": "https://variety.com/2025/music/news/addison-rae-redefined-pop-debut-album-1236599158/",
    "image": "https://variety.com/wp-content/uploads/2025/12/Addison-Rae-Luka-Kloser-Elvira-Anderfjard.jpg?crop=0px%2C0px%2C1500px%2C844px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-12-04T19:00:00.000Z",
    "description": "\n\tWhen Addison Rae reached the final stretch of completing her self-titled debut in 2024, everything seemed to crystallize with one last song: “Times ",
    "body": "\n\tWhen Addison Rae reached the final stretch of completing her self-titled debut in 2024, everything seemed to crystallize with one last song: “Times Like These.” The moody track became the finishing touch on the 12-song project, built around themes of self-discovery and self-definition. Its lyrics wrestle with the chaos of transformation (“Should I jump in the unknown? Or is it better to know how it unfolds?”), dancing between nervousness and finding comfort in the idea that progress starts with a leap. \n\t\n\n\tFor the 25-year-old influencer-turned-pop-hopeful, that willingness wasn’t something she discovered alone. Once she teamed with Los Angeles native Luka Kloser and Stockholm-born Elvira Anderfjärd — a writer-producer duo under Max Martin’s MXM Publishing — her vision for something bold and different finally found the right support. Anderfjärd, 26, has worked on songs and remixes for Taylor Swift, Katy Perry and Tove Lo, while Kloser, 27, has credits alongside Ariana Grande and Tate McRae. \n\n\n\tWorking with a like-minded young all-female team ensured Rae shared a true sense of creative control, allowing her instincts to not just surface but take shape. “I would have never gotten as deep as I do in [‘Times Like These’] without the friendship and comfort I share with Luka and Elvira,” says Rae. “When we finished recording it, I remember feeling, ‘I don’t have anything left to say on this project.’” \n\n\tThat sense of conviction takes on extra weight when one considers that, historically, the recording studio has been a boys’ club, a place where a debut can feel more like a test than a launch. \n\t\n\n\t“I’ve had beautiful collaborations with men before, and they never made me doubt myself, but this was different,” adds Kloser. “It made me wonder what happens when women actually hold every role? And that’s such an empowering feeling as a woman, to experience it for the first time.” \n\n\tAnderfjärd adds, “It sounds silly even now, but that sense of freedom is not something you can easily master. Sometimes just one person walking into the studio can change the way you perceive what you’re making, even if the feedback is positive.” \n\n\tFor Rae, the challenge was part of the thrill. “I love proving myself; it’s something I’ll never shy away from,” she says. “What’s really interesting is that people will either fully accept me or really not — and I enjoy that push and pull. It’s inspiring, and it drives me to strive for perfection.” \n\n\tThe proof is in the reception. Rae, fresh off a plane from Australia, just wrapped a three-continent tour behind the album; soon she’ll be heading to Sweden to reunite with Anderfjärd and Kloser to continue shaping new music. And in just a few weeks, she’ll walk into Crypto.com Arena in Los Angeles, where she’ll compete for best new artist at the 68th Grammy Awards. \n\n\t“It’s such an honor to be recognized — not just as a new artist, but as an artist at all — by the Recording Academy,” she says. “Anyone who has ever dreamed of doing what they love but feared they wouldn’t be taken seriously knows how much this kind of moment means. I’ve definitely battled with that doubt before, wondering if this could ever be possible.” \n\n\tAnderfjärd concludes, “What always worked for us was our shared taste. We just wanted to make music we all genuinely like.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How Addison Rae and Collaborators Luka Kloser and Elvira Anderfjärd Crafted Her Grammy-Nominated Debut as an All-Female Power Trio",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/Addison-Rae-Luka-Kloser-Elvira-Anderfjard.jpg?crop=0px%2C0px%2C1500px%2C844px&resize=1000%2C563"
      ],
      "datePublished": "2025-12-04T19:00:00.000Z",
      "dateModified": "2025-12-04T19:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "AFI Awards Top 10: ‘One Battle After Another,’ ‘Sinners’ and ‘Marty Supreme’ Make the List, as ‘The Pitt’ and ‘The Studio’ Lead TV Honors",
    "url": "https://variety.com/2025/film/news/afi-top-10-2025-one-battle-after-another-sinners-frankenstein-1236600233/",
    "image": "https://variety.com/wp-content/uploads/2025/12/Hamnet-One-Battle-After-Another-Frankenstein-Marty-Supreme-Sinners.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-04T20:00:00.000Z",
    "description": "\n\t“Hamnet,” “Marty Supreme” and a powerful one-two punch from Warner Bros. — “One Battle After Another” and “Sinners” — are among the American Film In",
    "body": "\n\t“Hamnet,” “Marty Supreme” and a powerful one-two punch from Warner Bros. — “One Battle After Another” and “Sinners” — are among the American Film Institute’s 10 best films of the year, the organization announced Thursday. On the television side, HBO Max’s “The Pitt,” Netflix’s “Adolescence” and Apple TV’s “Severance” and “The Studio” were included among AFI’s top programs.\n\n\tThe film selections reflect a robust and varied year in cinema, blending box office heavyweights with formally ambitious works. The lineup spans indie auteurs such as Chloé Zhao with “Hamnet” and Clint Bentley with “Train Dreams”; industry veterans like Paul Thomas Anderson (“One Battle After Another”) and Guillermo del Toro (“Frankenstein”); filmmakers hitting new creative heights, including Noah Baumbach (“Jay Kelly”) and Josh Safdie (“Marty Supreme”); stylish visionaries such as Ryan Coogler (“Sinners”) and Yorgos Lanthimos (“Bugonia”); and dependable studio mainstays like James Cameron (“Avatar: Fire and Ash”) and Jon M. Chu (“Wicked: For Good”).\n\t\n\n\tNeon’s international Oscar hopeful “It Was Just an Accident,” from writer-director Jafar Panahi, received the AFI Special Award, which recognizes productions that fall outside AFI’s traditional eligibility rules, including international films and other non-U.S. media. Past recipients include “The King’s Speech” (2010), “The Artist” (2011), “Roma” (2018), “Parasite” (2019), “Belfast” (2021) and “The Banshees of Inisherin” (2022). The designation also helps explain the absence of Neon’s other international standouts: Park Chan-wook’s South Korean black comedy “No Other Choice,” Kleber Mendonça Filho’s Brazilian thriller “The Secret Agent” and Joachim Trier’s Norwegian family drama “Sentimental Value.”\n\t\n\n\tThe AFI Awards remain one of the season’s most meaningful bellwethers. Over the past decade, AFI’s top 10 films have consistently overlapped with the Academy’s best picture slate, typically matching seven or eight eventual nominees. While an AFI selection doesn’t guarantee Oscar momentum, a miss often signals a steeper hill ahead.\n\n\tIt’s a huge boost particularly for Focus Features, which was shut out from the National Board of Review on Wednesday and Netflix, which once again landed a leading three films on the list.\n\n\tWhich brings us to this year’s notable omissions. Left off the list were Joseph Kosinski’s racing epic “F1,” Kathryn Bigelow’s political thriller “A House of Dynamite,” Bradley Cooper’s family dramedy “Is This Thing On” and Scott Cooper’s Bruce Springsteen portrait “Springsteen: Deliver Me From Nowhere.” All four have been viewed as solid awards contenders, and their absence could complicate their Oscar trajectories. Also missing were consumer-friendly titles such as Rian Johnson’s whodunit “Wake Up Dead Man” and Craig Brewer’s musical love story “Song Sung Blue,” both of which had been expected to resonate with AFI voters.\n\n\tAFI’s recent history continues to highlight the evolving challenges of eligibility amid an increasingly global marketplace. In each of the last two years, eight AFI selections went on to earn best picture nominations, while films such as “A Real Pain,” “Sing Sing,” “I’m Still Here” and “The Substance” demonstrated how precursor overlaps can diverge from the Academy. In 2023, AFI also omitted international films “Anatomy of a Fall” and “The Zone of Interest” under its eligibility rules.\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tApple TV\n\t\n\n\n\n\tOn the television side, AFI’s choices reflect a landscape dominated by prestige dramas, genre experimentation and increasingly auteur-driven storytelling. Apple TV led all platforms with three mentions including Emmy-winning comedy “The Studio,” the breakout dystopian thriller “Severance” and its new freshman drama “Pluribus.” HBO Max and Netflix earned two slots each — HBO Max for its Emmy-winning drama “The Pitt” and the crime thriller “Task,” and Netflix for the Emmy-winning limited series “Adolescence” and the historical drama “Death by Lightning.” Disney+ and FX rounded out the list with the sophomore season of “Andor” and “The Lowdown,” the critically acclaimed Ethan Hawke–Sterlin Harjo collaboration.\n\t\n\n\tThis year’s juries — one for film and one for television — included Lily Gladstone, Lauren LeFranc, Patton Oswalt and Thomas Schlamme; scholars Mark Harris and Leonard Maltin along with representatives from Syracuse University, USC, UCLA and UC Santa Cruz; critics Ann Hornaday, Janet Maslin and Peter Travers; and members of the AFI Board of Trustees. The panels were chaired by AFI Board of Trustees member Jeanine Basinger, chair emerita and founder of the film studies department at Wesleyan University, and AFI Board of Trustees Vice Chair Richard Frank, former chairman of Walt Disney Television and president of Walt Disney Studios.\n\n\tThe AFI Awards ceremony will take place on Jan. 9.\n\n\tThe complete list is below.\n\n\tAFI Motion Pictures of the Year\n\n\n“Avatar: Fire and Ash” (20th Century Studios)\n“Bugonia” (Focus Features)\n“Frankenstein” (Netflix)\n“Hamnet” (Focus Features)\n“Jay Kelly” (Netflix)\n“Marty Supreme” (A24)\n“One Battle After Another” (Warner Bros.)\n“Sinners” (Warner Bros.)\n“Train Dreams” (Netflix)\n“Wicked: For Good” (Universal Pictures)\n\n\n\n\tAFI Television Programs of the Year\n\n\n“Adolescence” (Netflix)\n“Andor” (Disney+)\n“Death by Lightning” (Netflix)\n“The Diplomat” (Netflix)\n“The Lowdown” (FX)\n“The Pitt” (HBO Max)\n“Pluribus” (Apple TV)\n“Severance” (Apple TV)\n“The Studio” (Apple TV)\n“Task” (HBO Max)\n\n\n\n\tAFI Special Award: “It Was Just an Accident” (Neon)\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "AFI Awards Top 10: ‘One Battle After Another,’ ‘Sinners’ and ‘Marty Supreme’ Make the List, as ‘The Pitt’ and ‘The Studio’ Lead TV Honors",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/Hamnet-One-Battle-After-Another-Frankenstein-Marty-Supreme-Sinners.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-04T20:00:00.000Z",
      "dateModified": "2025-12-04T20:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kit Harington Joins Lindsay Lohan, Shailene Woodley in Hulu Limited Series ‘Count My Lies’",
    "url": "https://variety.com/2025/tv/news/kit-harington-lindsay-lohan-shailene-woodley-count-my-lies-1236600208/",
    "image": "https://variety.com/wp-content/uploads/2025/12/P115S8TL.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-04T19:00:00.000Z",
    "description": "\n\tKit Harington is the latest addition to the cast of Hulu‘s upcoming limited series adaptation of the Sophie Stava novel “Count My Lies.” \n\n\tHaringto",
    "body": "\n\tKit Harington is the latest addition to the cast of Hulu‘s upcoming limited series adaptation of the Sophie Stava novel “Count My Lies.” \n\n\tHarington will star opposite previously announced stars Lindsay Lohan and Shailene Woodley. Harington will appear in the role of Jay Lockhart. \n\n\tThe logline for the series states, “When compulsive liar Sloane Caraway (Woodley) fibs her way into a nanny position for the gorgeous and charismatic Violet (Lohan) and Jay Lockhart (Harington), it seems she’s finally landed her dream job. But little does Sloane know, she’s just entered a household brimming with secrets that are about to explode — with potentially catastrophic consequences for all.” \n\t\n\n\tHarington currently stars in the hit HBO financial drama “Industry,” which is launching its fourth season on Jan. 11. He also recently guest starred in the Netflix series “Too Much” from Lena Dunham and will be seen in the BBC One/MGM+ miniseries version of “A Tale of Two Cities” in 2026. He is best known for his role as Jon Snow in the megahit HBO series “Game of Thrones,” on which he starred throughout the show’s eight-season run. In film, Harington was just in the Apple film “The Family Plan 2” and has starred in other features such as “Eternals” and “The Death & Life of John F. Donovan.” \n\n\n\tHe is repped by CAA, United Agents, Shafran PR, and Jackoway Austen Tyerman. \n\n\t“Count My Lies” is being adapted for the screen by Isaac Aptaker and Elizabeth Berger, who will also executive produce via The Walk-Up Company. Both Lohan and Woodley will executive produce in addition to starring. Antonio Campos is attached to direct and executive produce. Scott Morgan of The Walk-Up Company executive produces as well, with Stava producing. 20th Television is the studio, \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kit Harington Joins Lindsay Lohan, Shailene Woodley in Hulu Limited Series ‘Count My Lies’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/P115S8TL.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-04T19:00:00.000Z",
      "dateModified": "2025-12-04T19:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How ‘Chess’ Went From Cult Fave to Broadway Breakout—With the Help of a Winning Score",
    "url": "https://variety.com/2025/legit/news/chess-broadway-sales-lea-michele-1236600243/",
    "image": "https://variety.com/wp-content/uploads/2025/12/image-18.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-04T18:42:26.000Z",
    "description": "\n\tIt was a heck of an opening gambit: In its first week on Broadway, the new revival of “Chess” earned more than $1.2 million from just four sold-out ",
    "body": "\n\tIt was a heck of an opening gambit: In its first week on Broadway, the new revival of “Chess” earned more than $1.2 million from just four sold-out performances. A few weeks later, the show, headlined by stars Lea Michele, Aaron Tveit and Nicholas Christopher, broke the house record at the Imperial Theatre for a seven-performance week, topping $1.7 million. And the week after, it broke the theater’s eight-performance record with a $2 million haul.\n\t\n\n\tNot bad for an under-the-radar title that famously flopped on Broadway 40 years ago.\n\n\n\tIn those intervening decades, the score of “Chess,” written by the ABBA songwriting duo of Benny Andersson and Björn Ulvaeus and featuring tunes “I Know Him So Well,” “Nobody’s Side,” “Anthem” and the Top 40 hit “One Night in Bangkok,” picked up a cult following of superfans — and as the new production makes clear, that cult turned out to be larger than almost anyone expected. That fact, paired with the appeal of the revival’s cannily marketed stars, has helped make the show one of fall’s biggest box office breakouts.\n\n\n\t“It’s a really engaged fan base,” says producer Tom Hulce, who’s been involved in the project for a decade. “As far as we can tell, the majority of people have never seen a production. It’s this broader cross-section who came across the music in high school or college, or they love ‘One Night in Bangkok’ but until recently had no idea it came from a show.”\n\n\tIn addition to marketing to the surefire fans—“Really, that core group found us,” says fellow producer Robert Ahrens — the show’s promotional strategy aimed to attract new followers with its three leads: Tony winner Tveit, rising talent Christopher (“Sweeney Todd”) and Michele, the former “Glee” star who proved her box office muscle when she stepped into the 2022 revival of “Funny Girl.”\n\t\n\n\t“There was a sexy edge to that initial artwork, and a little bit of an air of mystery,” says Ahrens of the campaign, which featured the trio in a series of sultry black-and-white shots. The subsequent release of three songs from the production, showing off the vocal chops of the leads — and getting traction in outlets like Entertainment Weekly — further fueled buzz.\n\n\tThe aim now is to maintain sales momentum with fresh TV ads that showcase not just the stars but the entire production, with its cast of 23 and orchestra of 18. It appears to be working: Over Thanksgiving week the show set a new house record, earning $2,066,742 for eight performances.\n\n\tReviews for the new “Chess” — which has a fresh book by Danny Strong that aims to make sense of the original production’s confusing plot — have been decidedly mixed, but no critic seemed able to resist the allure of the score. Audience enthusiasm, in any event, seems undampened.\n\n\t“That original production may have had a problem or two,” says Robert Wankel of the Shubert Organization, which is both a producer of the show and the owner of the Imperial. “But the music never did.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How ‘Chess’ Went From Cult Fave to Broadway Breakout—With the Help of a Winning Score",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/image-18.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-04T18:42:26.000Z",
      "dateModified": "2025-12-04T18:42:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bowen Yang and Matt Rogers to Write and Star in New Comedy for Searchlight",
    "url": "https://variety.com/2025/film/news/bowen-yang-matt-rogers-searchlight-comedy-1236599513/",
    "image": "https://variety.com/wp-content/uploads/2025/12/Bowen-Yang-Matt-Rogers.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-04T18:45:00.000Z",
    "description": "\n\tActors, comedians and “Las Culturistas” co-hosts Bowen Yang and Matt Rogers are developing a new movie at Searchlight Pictures.\n\n\tYang and Rogers, w",
    "body": "\n\tActors, comedians and “Las Culturistas” co-hosts Bowen Yang and Matt Rogers are developing a new movie at Searchlight Pictures.\n\n\tYang and Rogers, who previously starred in the Searchlight rom-com “Fire Island,” will write and star in the untitled comedy. The story is inspired by the “Search Engine” podcast’s episode ‘Why didn’t Chris and Dan get into Berghain?’ about two Americans who embark on a quest: fly across an ocean to try to get into the most exclusive nightclub in the world – Berghain.\n\t\n\n\tOlivia Gerke and Oly Obst will produce the project for 3 Arts Entertainment. “Search Engine” co-creators PJ Vogt and Sruthi Pinnamaneni will serve as co-producers on the movie. VP of production Richard Ruiz and creative executive Daniel Yu are overseeing the project for the studio, reporting to co-heads of film production & development DanTram Nguyen and Katie Goodson-Thomas. UTA, which represents Yang, Rogers, Vogt and Pinnamaneni, brokered the deal.\n\n\n\tNews of the project comes amid a banner year for Yang and Rogers, both separately and as a duo. The pair, who were featured on Variety’s 2025 Comedy Impact Report, co-host the hit podcast “Las Culturistas.” Yang and Rogers, who met while students at NYU, launched the show in 2016 and have since welcomed guests like Mariah Carey, Tina Fey, Ariana Grande, Amy Poehler and Lady Gaga. “Las Culuristas” was named Podcast of the Year at the iHeart Radio Podcast Awards in 2023 and 2025. In August, the duo’s annual “Las Culturistas Culture Awards” was televised for the first time; the show aired on Bravo and streamed on Peacock, with another ceremony planned for 2026.\n\t\n\n\tYang is a five-time Emmy-nominated comedian, actor and writer, best known for his work on “Saturday Night Live,” where he’s been a standout performer for seven seasons. He currently stars in the blockbuster musical “Wicked: For Good,” reprising his role as Pfanee. Up next, Yang voices a role in “The Cat in the Hat” from Warner Bros. Animation.\n\n\tLikewise, Rogers is a multihyphenate talent and is currently performing his annual holiday tour, dubbed “Christmas in December.” Following his breakout performance in Showtime’s “I Love That For You,” Rogers recent credits include Aziz Ansari’s “Good Fortune,” the Netflix series “No Good Deed” and a guest spot on Apple TV’s “Palm Royale.” Behind the scenes, Rogerts has written for hit series such as “The Other Two” and the animated spy comedy “Q-Force.”\n\n\tIn 2022, Yang and Rogers starred in “Fire Island,” Joel Kim Booster’s rom-com about a group of queer best friends who gather in Fire Island Pines for their annual vacation. Booster led the ensemble cast, which also featured Conrad Ricamora, Tomás Matos, Torian Miller and Margaret Cho. Andrew Ahn directed the film.\n\n\tIn addition to UTA, Yang and Rogers are also represented by 3 Arts Entertainment and Schreck Rose Dapello Adams Berlin & Dunham. Vogt & Pinnamaneni are also repped by Jackoway Austen.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bowen Yang and Matt Rogers to Write and Star in New Comedy for Searchlight",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/Bowen-Yang-Matt-Rogers.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-04T18:45:00.000Z",
      "dateModified": "2025-12-04T18:45:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Don’t Let the Sun Go Up on Me,’ ‘La Más Dulce,’ ‘Chapa 100’ Score Top Prizes at Atlas Workshops",
    "url": "https://variety.com/2025/film/global/asmae-el-moudir-atlas-cristian-mungiu-marrakech-1236600175/",
    "image": "https://variety.com/wp-content/uploads/2025/12/MixCollage-25-Nov-2025-09-52-AM-8673.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-04T18:33:10.000Z",
    "description": "\n\t“Don’t Let the Sun Go Up on Me”, “La Más Dulce,” and “Chapa 1000” claimed the top postproduction and development prizes at this year’s Atlas Worksho",
    "body": "\n\t“Don’t Let the Sun Go Up on Me”, “La Más Dulce,” and “Chapa 1000” claimed the top postproduction and development prizes at this year’s Atlas Workshops, which ran from Nov. 30 – Dec. 5 as part of the Marrakech Film Festival.\n\n\tCo-winner of the top award, “Don’t Let the Sun Go Up on Me” walked away with a €20,000 post-production grant. Directed by Asmae El Moudir, the film retraces the life of Fatimazahra, a young woman born with a rare genetic disorder that made exposure to sunlight deadly. She lived a parallel, nocturnal existence and founded a community known as the Children of the Moon. Following her death in 2023, the group traveled to Norway’s Lofoten Islands to live beneath the polar night, seeking a world where darkness offers safety.\n\t\n\n\t“We’re talking about a rare disease with a very strong antagonist: the sun,” says El Moudir. “What normally represents joy becomes a source of danger. For this community, light can kill. In that sense, the project is like a vampire film made real. We’re exploring how this hidden community lives among us — a community most people don’t even know exists — but I don’t want to portray them as victims.” \n\n\n\tThis is the second time El Moudir won the Atlas Workshops’ number one grant. Her previous effort, “The Mother of All Lies” would later score Cannes’ best documentary award, as well as the Un Certain Regard directing prize, before making history as the first Moroccan film to win Marrakech’s Etoile d’Or. The filmmaker remains an Atlas Workshops’ emblematic success story – and she’ll soon be back behind the camera for a second bout of production ahead of a 2027 delivery.\n\t\n\n\tPost-productions jurors Beatrice Fiorentino (Settimana Internazionale della Critica), Martin Gondre (Best Friends Forever), and Hania Mroué (Metropolis) decided to give two top prizes, also awarding €20,000 to Laila Marrakchi’s “La Mas Dulce,” a story about agricultural exploitation in Andulusia, following a pair of Moroccan women hired for a season of strawberry picking.\n\n\t“The film reveals their courage, their determination, and their struggle to denounce the injustices and abuses they suffer,” says Marrakchi in her director’s statement. “It also shows that, despite the initial promise of freedom and financial independence that leads to forced exile that ultimately distances them from their families and their country, an unbreakable bond is formed between them.” \n\n\tLucky Number handles world sales, with a 2026 festival berth highly likely.\n\n\tRounding out the post-production winners, director Mohammed Hammad’s “Safe Exit” and “Goma Enough Is Enough,” from filmmaker Elisé Sawasawa, claimed additional grants. Hammad’s “Safe Exit” follows a security guard struggling with PTSD in the aftermath of a 2015 ISIS massacre, while Sawasawa’s doc follows the everyday Congolese who picked up arms to defend their families after the city of Goma fell to rebels this past January.\n\n\tOn the development side, top honors went to Ique Langa’s “Chapa 100,” a love-story between aging street vendors in Mozambique that soon assumes more magical realist and poetic dimensions. This is Langa’s second feature; his debut “The Prophet” is expected to make a festival debut in 2026.\n\n\tDevelopment jurors Karim Aïtouna (Haut les Mains Productions), Ama Ampadu (BFI Filmmaking Fund) and Olivier Père (Arte France) also awarded Boubacar Sangaré’s “Les Dieux Delinquants,” Scandar Copti’s “A Childhood” and Kamy Lara’s “Vanda” with additional financial support. \n\n\tThe awards capped a second consecutive year of growth for the workshops, which welcomed 60 distributors from across the Middle East and North Africa through the newly launched Atlas Distribution Meetings.\n\n\t“These distribution professionals aren’t always present at major international markets, and when they are, they’re few in number and not necessarily a top priority for pressured sales agents,” says Atlas director Hédi Zardi.\n\t\n\n\tHe notes that European and Arab distributors even asked to meet simply as colleagues. “I saw a Lebanese distributor chatting with a Polish one — they have nothing to sell each other, yet were eager to talk. That’s exactly what we hoped for: putting everyone in the same space to spark conversation. Deals may come later, but the main goal was for them to meet and discover things together.”\n\n\tDespite the influx of distributors, overall industry attendance stayed in line with previous editions — and the Atlas chief prefers it that way.\n\n\t“We must stay boutique,” says Zardi. “We want these informal encounters to happen naturally. If we lose freshness and spontaneity, we lose our essence. Some people who came the first year returned later and told us it feels exactly the same — and we need to preserve that while improving each time. We’ve reached our desired scale.”\n\n\tThis year’s mentor was Palme d’Or winner Cristian Mungiu, who left his mentees with this advice: “Don’t overdevelop.”\n\n\t“It’s wonderful to get feedback, and even better to receive development funding, but don’t spend years in development. We’re eager to see your films!”\n\n\tHe later followed up to Variety: “I believe cinema has the power to challenge the stereotypes so often applied to people or regions we know too little about. From this perspective, Atlas makes a significant contribution to the visibility of a fascinating part of the world. If we watch more films from this region, we may discover that we’re not so different after all.”\n\n\tSince 2018, the workshops have supported 180 projects, among them more than 70 Moroccan films. Since the post-production prize was introduced in 2020, the top winners have all gone on to premiere in Cannes or Berlin, with respective victors “Feathers” and “The Mother of all Lies” collecting prizes out of Critics’ Week and Un Certain Regard.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Don’t Let the Sun Go Up on Me,’ ‘La Más Dulce,’ ‘Chapa 100’ Score Top Prizes at Atlas Workshops",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/MixCollage-25-Nov-2025-09-52-AM-8673.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-04T18:33:10.000Z",
      "dateModified": "2025-12-04T18:33:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "TMZ Streaming Live, Come Into Our Newsroom and Watch Things Happen!",
    "url": "https://www.tmz.com/2025/12/04/watch-tmz-live-today/",
    "image": "https://imagez.tmz.com/image/38/16by9/2025/12/04/380a737df7df43bb8a06e434bcef25a0_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-12-04T17:33:33.000Z",
    "description": "\n    \n                    \n                          TMZ Live Stream\n                          Come Into Our Office and Watch News Happen!!!\n         ",
    "body": "\n    \n                    \n                          TMZ Live Stream\n                          Come Into Our Office and Watch News Happen!!!\n                      \n                  \n                        Published December 4, 2025 9:33 AM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          We want you to be a part of TMZ, so every weekday, between 9:30 AM and 11:30 AM PT, we take you inside our newsroom via live stream.\n      \n    \n          You never know what you're gonna get ... a big story that breaks, an argument erupts in the room, or someone's just joking around.\n      \n    \n          Your comments are a big part of the stream, and the staff spends a lot of time speaking directly to you. Every day is different!\n      \n    \n          We also use our live stream to produce our \"TMZ Live\" TV show.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Celebrity News\n              \n                          \n                Live Stream\n              \n                          \n                Viral\n              \n                          \n                Fairly Legal\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "TMZ Streaming Live, Come Into Our Newsroom and Watch Things Happen!",
      "image": [
        "https://imagez.tmz.com/image/38/16by9/2025/12/04/380a737df7df43bb8a06e434bcef25a0_xl.jpg"
      ],
      "datePublished": "2025-12-04T17:33:33.000Z",
      "dateModified": "2025-12-04T17:33:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Paige VanZant Flashes Major Underboob In Neon Bikini!",
    "url": "https://www.tmz.com/2025/12/04/paige-vanzant-underboob-bikini/",
    "image": "https://imagez.tmz.com/image/76/16by9/2025/12/04/76ef8253ecbe40e88594a8ab25687459_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-12-04T18:48:11.000Z",
    "description": "\n    \n                    \n                          Paige VanZant\n                          Ultimate Underboob Champ\n                          ... Fl",
    "body": "\n    \n                    \n                          Paige VanZant\n                          Ultimate Underboob Champ\n                          ... Flashes Curves in Tiny Neon Bikini\n                      \n                  \n                        Published December 4, 2025 10:48 AM PST\n                                                                            \n      \n    \n      \n        \n              \n    \n    \n          Paige VanZant's not fighting in The Octagon anymore, but she's certainly drawing people in with her spheres ... showing some serious cleavage in these new bikini pics.\n      \n    \n          The former UFC fighter shared a series of photos where she's decked out in the tiny neon orange 2-piece ... pulling on the string connecting the two cups of the thin material and puckering up her lips as she poses for the camera.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          PVZ wore a shirt on top of the bikini ... but pulled it up so it basically only kept her shoulders warm instead of providing any sort of adequate coverage. It especially didn't cover her when she leaned forward as she did in this picture.\n      \n\n          Paige captioned her post, \"Is orange your favorite color??? 🧡🧡\" -- and, we gotta imagine many of her fans will now definitely say it is.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Also, check out the background around Paige -- if you can pull your eyes from her rock-hard abs ... it seems the walls surrounding her are full of pin-up girls. It's alright if you didn't notice them before ... Paige is certainly drawing a majority of focus in the photo.\n      \n    \n          Paige won two fights by knockout in her UFC career ... and, we think it's fair to call these pics a third KO!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Paige VanZant\n              \n                          \n                Hotties & Bodies\n              \n                          \n                Hot Bodies\n              \n                          \n                TMZ Sports\n              \n                          \n                Photo Galleries\n              \n                          \n                WWE\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Paige VanZant Flashes Major Underboob In Neon Bikini!",
      "image": [
        "https://imagez.tmz.com/image/76/16by9/2025/12/04/76ef8253ecbe40e88594a8ab25687459_xl.jpg"
      ],
      "datePublished": "2025-12-04T18:48:11.000Z",
      "dateModified": "2025-12-04T18:48:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Babes In Tube Socks Guess Who -- National Sock Day!",
    "url": "https://www.tmz.com/2025/12/04/babes-tube-socks-guess-who-national-sock-day/",
    "image": "https://imagez.tmz.com/image/96/16by9/2025/12/03/96928728b8964827acdddf83cb0903e3_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-12-04T08:01:03.000Z",
    "description": "\n    \n                    \n                          Babes In Tube Socks\n                          Guess Who ...\n                          Drop It Lik",
    "body": "\n    \n                    \n                          Babes In Tube Socks\n                          Guess Who ...\n                          Drop It Like It's Sock!\n                      \n                  \n                        Published December 4, 2025 12:01 AM PST\n                                                                            \n      \n    \n      \n        \n              \n    \n    \n          Slip into National Sock Day with Hollywood's finest ... in tube socks! Here's the catch: do you think you can pair the unknown photo with the celebrity name?!\n      \n    \n          Sexy stars like Millie Bobby Brown, Bella Hadid, and Maggie Lindemann will give you some pep in your step with their sock style on blast ...\n      \n    \n          Are your hands cold? Warm 'em up and scroll through the gallery above!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Hotties & Bodies\n              \n                          \n                Hot Bodies\n              \n                          \n                Guess Who\n              \n                          \n                Holidaze\n              \n                          \n                Photo Galleries\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Babes In Tube Socks Guess Who -- National Sock Day!",
      "image": [
        "https://imagez.tmz.com/image/96/16by9/2025/12/03/96928728b8964827acdddf83cb0903e3_xl.jpg"
      ],
      "datePublished": "2025-12-04T08:01:03.000Z",
      "dateModified": "2025-12-04T08:01:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Texas A&M Student Brianna Aguilera's Death Officially Ruled a Suicide",
    "url": "https://www.tmz.com/2025/12/04/texas-am-student-death-ruled-suicide/",
    "image": "https://imagez.tmz.com/image/ec/16by9/2025/12/04/ec5c8c84e49a401abd1322ec15f66e38_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-12-04T19:31:37.000Z",
    "description": "\n    \n                    \n                          Texas A&M Student\n                          Postgame Death Officially Ruled Suicide\n             ",
    "body": "\n    \n                    \n                          Texas A&M Student\n                          Postgame Death Officially Ruled Suicide\n                      \n                  \n                        Published December 4, 2025 11:31 AM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          The Texas A&M student who was found dead after the school's football game against the University of Texas died by suicide ... according to the Austin Police Department.\n      \n    \n          Remember ... Brianna Aguilera -- a 19-year-old student at the university -- was found outside a campus apartment complex around 1 AM Saturday, hours after A&M's 27-17 Friday night loss against rival Texas.\n      \n    \n          Detective Robert Marshall of APD says she was found with trauma from an apparent fall from a high floor. Cameras showed Brianna arriving at the apartment building around 11 PM Friday before heading up to a 17th-floor apartment.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n\n          A large group left the building around 12:30 AM Saturday morning, cops say ... leaving Brianna and three other women in the apartment together. Brianna had lost her phone earlier in the evening and borrowed a friend's to call her boyfriend. Austin Police officers say the call took place from 12:43 AM to 12:44 AM -- and, two minutes later, they say she leaped from the building.\n      \n    \n          Officers later recovered Aguilera's lost phone ... and, they discovered a suicide note written days before Brianna's death addressed to specific individuals in her life.\n      \n    \n          Detective Marshall says, \"Brianna had made suicidal comments previously to friends, back in October of this year. This continued through the evening of her death, with some self-harming actions early in the evening and a text message to another friend indicating the thought of suicide.\"\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Aguilera had been at a football tailgate get-together earlier Friday and \"became intoxicated to a point where she was asked to leave,\" Marshall said, according to ABC News.\n      \n    \n          Aguilera's mother, Stephanie Rodriguez, insisted to local news outlets that her daughter wasn't suicidal, and she looked forward to becoming a lawyer one day. The family's attorney, Tony Buzbee, has called out APD for their handling of the case.\n      \n    \n          If you or someone you know is struggling or in crisis, help is available. Call or text 988 or chat 988lifeline.org.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Brianna Aguilera\n              \n                          \n                Tony Buzbee\n              \n                          \n                Celebrity Death\n              \n                          \n                TMZ Sports\n              \n                          \n                News\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Texas A&M Student Brianna Aguilera's Death Officially Ruled a Suicide",
      "image": [
        "https://imagez.tmz.com/image/ec/16by9/2025/12/04/ec5c8c84e49a401abd1322ec15f66e38_xl.jpg"
      ],
      "datePublished": "2025-12-04T19:31:37.000Z",
      "dateModified": "2025-12-04T19:31:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Texas Police Use Grinch to Warn Against Holiday Porch Thefts",
    "url": "https://www.tmz.com/2025/12/04/texas-police-use-grinch-to-warn-against-porch-theft/",
    "image": "https://imagez.tmz.com/image/da/16by9/2025/12/04/dace33188bdd4ebfb05db3f9e8af28ec_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-12-04T20:02:54.000Z",
    "description": "\n    \n                    \n                          Texas Cops\n                          How The Grinch Got Pinched\n                      \n          ",
    "body": "\n    \n                    \n                          Texas Cops\n                          How The Grinch Got Pinched\n                      \n                  \n                        Published December 4, 2025 12:02 PM PST\n                                                                            \n      \n    \n      \n        \n                    \n                  \n      \n                    Deer Park Police Department via Storyful\n          \n    \n          Police in Deer Park, Texas are reminding residents to keep their Christmas packages safe during the holiday season ... warning a thieving Grinch just might be lurking!\n      \n    \n          DPPD posted a short video Thursday of a Grinch wearing a Santa costume stealthily creeping onto a porch ... when the green-tufted bandit finally tiptoes his way up to the door, he swiftly scoops up a tower of packages left unattended on the doormat.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Just when he thinks he's home free, one of Deer Park's finest pulls up and chases him down. The Grinch ditches the packages to make his escape, but even he can't outrun the law!\n      \n\n          In no time, the officer pushes him to the ground before loading the would-be thief into the back of his squad car.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Moral of the story ... if you're planning on receiving gifts, keep them safe. And if you're planning on stealing gifts, you better think twice ... because Santa's not the only one watching who's naughty or nice!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Family Fun\n              \n                          \n                Fairly Legal\n              \n                          \n                Christmas\n              \n                          \n                Holidays\n              \n                          \n                Police\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Texas Police Use Grinch to Warn Against Holiday Porch Thefts",
      "image": [
        "https://imagez.tmz.com/image/da/16by9/2025/12/04/dace33188bdd4ebfb05db3f9e8af28ec_xl.jpg"
      ],
      "datePublished": "2025-12-04T20:02:54.000Z",
      "dateModified": "2025-12-04T20:02:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]