[
  {
    "title": "Jackson Yee, Zhu Yilong, Zhang Yimou Spy Thriller ‘Scare Out’ Heading to U.K., Ireland",
    "url": "https://variety.com/2026/film/asia/jackson-yee-zhu-yilong-zhang-yimou-spy-thriller-scare-out-uk-ireland-1236649424/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Scare-Out.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-02T11:59:00.000Z",
    "description": "\n\tTrinity CineAsia has acquired U.K. and Ireland distribution rights to “Scare Out,” a contemporary counter-espionage thriller from acclaimed Chinese ",
    "body": "\n\tTrinity CineAsia has acquired U.K. and Ireland distribution rights to “Scare Out,” a contemporary counter-espionage thriller from acclaimed Chinese director Zhang Yimou, from Damai Entertainment.\n\n\tWritten by Chen Liang, the film follows a National Security squad racing to identify and capture spies who have leaked classified intelligence about China’s latest fighter jet technology. The covert investigation expands beyond intelligence circles into civilian life as the hunt intensifies.\n\t\n\n\tThe film will launch theatrically across both territories on Feb. 20, synchronized with the Lunar New Year period and its local China release. Select preview screenings are scheduled to begin Feb. 17, offering a day-and-date rollout with the home market.\n\n\n\tProduced by Damai Entertainment, “Scare Out” represents Zhang’s first venture into modern national security storytelling. The director previously helmed period wuxia epics including “Hero” and “House of Flying Daggers.”\n\n\tThe thriller features Chinese box office stars Jackson Yee (“Better Days,” “Full River Red”) and Zhu Yilong (“Only the River Flows”) in lead roles, alongside Song Jia (“Her Story”), Lei Jiayin (“A Writer’s Odyssey”) and Yang Mi (“She’s Got No Name”). Zhang Yi, Liu Shishi and Liu Yaowen appear in special roles.\n\n\t“We are very excited to bring Zhang Yimou’s ‘Scare Out’ to U.K. and Ireland audiences — our first-ever release from this legendary director,” said Cedric Behrel, managing director of Trinity CineAsia. Zhang Yimou, the leading light of the so-called Fifth Generation directors, is responsible for so many filmgoers’ initiation into Chinese cinema, not least myself – having been mesmerised by ‘Raise the Red Lantern’ and ‘Ju Dou’ as a young boy, which deeply informed both my own sensibilities and Trinity’s foray into Chinese cinema. He predicted the film “will feel familiar to U.K. audiences and John le Carré fans, yet is unlike anything previously seen in Chinese cinema here.”\n\t\n\n\tTrinity CineAsia specializes in Asian releases in the U.K. market. Recent theatrical titles include Bi Gan’s “Resurrection,” war drama “Dongji Rescue,” animated blockbuster “Ne Zha 2” and Jackie Chan’s “The Shadow’s Edge.“​​​​​​​​​​​​​​​​\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jackson Yee, Zhu Yilong, Zhang Yimou Spy Thriller ‘Scare Out’ Heading to U.K., Ireland",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Scare-Out.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-02T11:59:00.000Z",
      "dateModified": "2026-02-02T11:59:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Savannah Guthrie Not on ‘Today’ Amid Search for Missing Mother, Gives Statement to Co-Hosts: ‘Our Focus Remains on the Safe Return of Our Dear Mom’",
    "url": "https://variety.com/2026/tv/news/savannah-guthrie-not-on-today-missing-mother-statement-1236649436/",
    "image": "https://variety.com/wp-content/uploads/2026/02/savannah-nancy.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-02T12:32:26.000Z",
    "description": "\n\tSavannah Guthrie was not behind the desk on “Today” Monday morning amid the search for her 84-year-old mother Nancy Guthrie, but gave a statement to",
    "body": "\n\tSavannah Guthrie was not behind the desk on “Today” Monday morning amid the search for her 84-year-old mother Nancy Guthrie, but gave a statement to her co-hosts Craig Melvin and Sheinelle Jones asking for the public’s help. \n\n\t“On behalf of our family, I want to thank everyone for the thoughts, prayers and messages of support,” Savannah Guthrie said. “Right now, our focus remains on the safe return of our dear mom. We thank law enforcement for their hard work on this case and encourage anyone with information to contact the Pima County Sheriff’s office at 520-351-4900.”\n\t\n\n\tIt was first reported on Sunday that Nancy Guthrie had gone missing in Arizona. She has been classified as a “missing vulnerable adult” by the Pima County Sheriff’s Department due to her age.\n\n\n\tAccording to the Pima County Sheriff, who held a press conference on Nancy Guthrie’s disappearance Sunday night, she had “no signs of cognitive issues” and is “very alert” and of “very sound mind.” During the conference, the sheriff also said that police found a “very concerning” scene at her house, though they did not give details. Tom Winter, who covers crime and security for NBC, joined Melvin and Jones to share the significance of that update.\n\n\t“What they found there led them to this point where they thought this was something that required their urgent attention,” Winter said. “They were able to get out helicopters last night that use infrared cameras. They’ve got drones up. They’ve enlisted the help of the customs and border protection — obviously, not too far from the border there in Mexico. They have some special resources. The FBI is also aware of this case as well.”\n\t\n\n\tWinter continued that it’s the “nature of what was found at the scene that’s got them so concerned,” adding: “We are withholding some details, as we would do with any investigation, to make sure that the investigation could go forward without us interfering in it.”\n\n\tNancy Guthrie was last seen on the evening of Jan. 31 at her house near East Skyline Drive and North Campbell Avenue in Catalina Foothills, Arizona. Deputies say they aren’t sure what clothes she is wearing, but she is 5 feet 5 inches tall, weighs about 150 pounds and has brown hair and blue eyes.\n\n\tSavannah Guthrie has been a co-host on “Today” since 2012 and currently presents the show alongside Craig Melvin, Al Roker, Carson Daly and Jenna Bush Hager. She’s previously spoken about her close relationship with her mother on “Today.”\n\n\t“When I was in my 30s, I really wished to be married and to be a mom, and things just did not happen that fast for me,” she said during a Mother’s Day segment in 2023. “And my mom’s confidence that I would be a mom — even as the years ticked by and ticked by and ticked by — meant so much to me. She said, ‘Of course you’ll be a mom, and you’re going to be a wonderful mom.’ And for her to have that confidence and faith was so meaningful to me. It got me through some really hard times.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Savannah Guthrie Not on ‘Today’ Amid Search for Missing Mother, Gives Statement to Co-Hosts: ‘Our Focus Remains on the Safe Return of Our Dear Mom’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/savannah-nancy.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-02T12:32:26.000Z",
      "dateModified": "2026-02-02T12:32:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "CJ Enm Partners With JYP, Tencent Music to Launch Greater China-Focused Onecead Venture",
    "url": "https://variety.com/2026/music/news/cj-enm-jyp-tencent-music-onecead-1236649456/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Modyssey.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-02T10:27:09.000Z",
    "description": "\n\tKorean powerhouse CJ Enm has partnered with JYP Entertainment’s Chinese subsidiary and Tencent Music Entertainment to launch Onecead, a new joint ve",
    "body": "\n\tKorean powerhouse CJ Enm has partnered with JYP Entertainment’s Chinese subsidiary and Tencent Music Entertainment to launch Onecead, a new joint venture focused on developing artists for the Greater China market.\n\n\tThe partnership establishes Onecead through NCC Entertainment, a company formed by JYP China and Chinese online music platform TME. The venture will handle artist development and management, with plans to expand into music production, live events and merchandising.\n\t\n\n\tOnecead’s inaugural project involves managing Modyssey, a seven-member boy band that emerged from Mnet Plus’s survival competition “Planet C: Home Race.” The program, which wrapped in late December as an extension of Mnet’s “Boys II Planet” franchise, drew millions of votes worldwide to determine the final lineup of Hengyu, Fan Zheyi, Li Zihao, Lynnlynn, Suren, Yichen And Rowan.\n\n\n\tCJ Enm is replicating a business model it has successfully deployed in Japan through Lapone Entertainment, which manages acts including JO1 and INI. Those groups have built substantial followings not only in Japan but across broader Asian markets, demonstrating the Korean entertainment giant’s capacity to develop local talent with regional and global appeal.\n\n\tThe new entity aims to create a comprehensive music business spanning artist management, production, touring and merchandise across Greater China and international markets. The partnership leverages CJ Enm’s content production capabilities alongside JYP China and TME’s regional infrastructure and industry networks.​​​​​​​​​​​​​​​​\n\t\n\n\tCJ ENM operates across media content, music, film and performing arts. The company has backed Oscar-winning film “Parasite,” operates K-content platform TVING, and manages K-pop acts including Zerobaseone and Alpha Drive One, while also presenting the KCON fan festival and MAMA Awards.​​​​​​​​​​​​​​​​\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "CJ Enm Partners With JYP, Tencent Music to Launch Greater China-Focused Onecead Venture",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Modyssey.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-02T10:27:09.000Z",
      "dateModified": "2026-02-02T10:27:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "ESPN Took $110 Million Hit From YouTube TV Blackout Last Fall",
    "url": "https://variety.com/2026/tv/news/espn-110-million-lost-income-youtube-tv-blackout-1236648725/",
    "image": "https://variety.com/wp-content/uploads/2025/11/GettyImages-2240863408.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-02T11:41:30.000Z",
    "description": "\n\tDisney was estimated to be losing about $4.3 million per day during the YouTube TV blackout last fall, according to one Wall Street analyst. In fact",
    "body": "\n\tDisney was estimated to be losing about $4.3 million per day during the YouTube TV blackout last fall, according to one Wall Street analyst. In fact, the carriage fight cost the Mouse House much more than that.\n\n\tThe 15-day blackout of the ESPN suite of networks on Google’s YouTube TV resulted in a decline of $110 million to ESPN’s operating income for the year-end quarter. That works out to a loss of more than $7 million per day, just for ESPN. Disney made the disclosure in announcing earnings for the year-end quarter.\n\t\n\n\tABC and Disney’s entertainment TV networks also suffered a revenue drop because of the YouTube TV blackout but the company didn’t quantify that. In fact, Disney is no longer reporting revenue or operating income for its linear TV business as of the December 2025 quarter, which is the media conglom’s Q1 of fiscal 2026.\n\n\n\tIn the YouTube TV blackout, ESPN and other Disney nets went dark on the internet service just before midnight ET on Thursday, Oct. 30. The dispute was largely over price hikes Disney was seeking. The two sides finally reached an agreement restoring the channels on Nov. 14.\n\n\tDisney CFO Hugh Johnston, on the company’s Nov. 13 earnings call, said that regarding “the dollar impact” of the YouTube TV blackout, while Disney was indeed losing money because it networks were unavailable on the streamer, it was garnering incremental revenue “by virtue of subscribers moving elsewhere.”\n\n\tIt’s likely the two-week YouTube TV blackout pushed some subscribers to sign up for ESPN Unlimited, the streamer that for the first time includes everything from ESPN’s networks and services. But Disney has not detailed ESPN Unlimited subscribers or revenue.\n\t\n\n\tWith the launch of ESPN Unlimited in August, Disney initially offered a bundle with Disney+, Hulu and ESPN Unlimited for $29.99/month for the first 12 months — the same price as the standalone version of ESPN Unlimited. According to Disney, in the September 2025 quarter, 80% of ESPN Unlimited customers took the three-way bundle, which isn’t surprising given the major discount of the promo offer. (The Disney+/Hulu/ESPN bundle is now priced starting at $35.99/month.)\n\n\tFor the year-end 2025 quarter, overall revenue for ESPN was $4.9 billion, up 1%. The sports segment’s operating income was $191 million, down 23% year-over-year. According to Disney, ESPN advertising revenue growth of 10% was more than offset by higher programming and production costs and a decrease in subscription and affiliate fees, including the loss of revenue because of the YouTube TV blackout.\n\n\tAccording to Disney, in the year-end 2025 quarter, ESPN captured more than 30% of all sports viewership across networks, including via ESPN on ABC programming, an industry-leading share.\n\n\tSeparately, on Saturday, Disney and the NFL confirmed they closed a deal that gives the NFL a 10% ownership stake in ESPN, which will in exchange gain control over NFL Network and the popular NFL RedZone highlights service. Disney licensed rights to operate NFL Network and NFL RedZone through 2033.\n\n\tDisney’s NFL deal has an estimated fair value of $3 billion, according to the media company’s quarterly 10-Q filing Monday with the SEC. After July 2034, based on the performance of the NFL assets, Disney may have the right to reacquire the NFL’s interest in ESPN in exchange for a 10-year security at 70% of the then-fair market value of the NFL’s interest in ESPN. Alternatively, the NFL may have the right to acquire up to a 4% additional equity interest in ESPN at a purchase price equal to 70% of the then-fair market value of ESPN.\n\n\tWith the NFL deal, Disney now holds an effective 72% interest in ESPN. Hearst owns 18% and NFL Enterprises LLC holds 10%.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "ESPN Took $110 Million Hit From YouTube TV Blackout Last Fall",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/GettyImages-2240863408.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-02T11:41:30.000Z",
      "dateModified": "2026-02-02T11:41:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Carpet Chemicals Catastrophe Brings Band of Media Outlets Together to Investigate",
    "url": "https://variety.com/2026/tv/news/carpet-chemicals-catastrophe-frontline-pbs-ap-ajc-1236649013/",
    "image": "https://variety.com/wp-content/uploads/2026/02/FL_Contaminated_SignatureImage1.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-02T11:00:00.000Z",
    "description": "\n\tSometimes, it takes a nation to cover what’s happening in a single backyard.\n\n\tThe town of Dalton in northwestern Georgia has long hosted many of th",
    "body": "\n\tSometimes, it takes a nation to cover what’s happening in a single backyard.\n\n\tThe town of Dalton in northwestern Georgia has long hosted many of the country’s carpet mills. What isn’t as widely known is that so-called synthetic “forever chemicals” used to make carpets stain-resistant have spread into local waters and rivers downstream, contaminating drinking water across the region. Investigative reporters from the Atlanta Journal Constitution were eager to show readers how the spreading chemicals might affect their lives but soon realized that many other areas were affected – so much so that editors thought an unlikely team of journalists from different outlets might be required.\n\t\n\n\t“In Alabama, they’re seeing contamination in their drinking water that they’re tracing back to Dalton, more than 100 miles upstream,” says Dylan Jackson, an investigative reporter for the Atlanta media outlet. “And for them the story is different. We have this sort of industry or company town lens we are looking though in Georgia, nobody has a connection to carpet in any significant way in these downstream communities in Alabama.”Several media outlets tried to put the pieces together. Journalists from the AJC reached out to the Associated Press, which has an initiative that spurs cooperation with local partners. Eventually, the parties joined in a broader effort alongside The Post and Courier in South Carolina, AL.com in Alabama, PBS’ “Frontline” and The Associated Press to examine the problem not only in terms of its effects on local communities but also on the nation.\n\n\n\tSuch collaborations are “important right now when you see the industry really cutting back on investigative recording. We have to get together and collaborate to do these types of things right now because, you know, we don’t have the type of resources and investigative reporting that we did decades ago,” says Jason Dearen, an investigative reporter for the Associated Press. “That’s something I really love about this whole thing. that I think this story doesn’t necessarily get told in the same way unless we all come together.”\n\t\n\n\tIn addition to stories published in the various regional publications “Frontline”: will present a documentary “Contaminated: The Carpet Industry’s Toxic Legacy” on Tuesday that is based in part on the findings from the local journalism outlets. The program will debut on pbs.org/frontline and in the PBS App or on PBS stations and on the “Frontline” YouTube channel Tuesday night at 10 p.m. It will also be available on the PBS Documentaries Prime Video Channel.\n\n\tThe journalists set up a broader database that allowed them to look at others’ reporting, as well as information on lawsuits and other records and findings. “We are sharing intel and documents. We created a big, huge database for everybody to have access to these documents so they could read them, footnote their stories. ‘Frontline’ used this as well,” says Dearen. “There are a lot of different stories going out, but they all kind of work together as one whole, you know? It tells one whole story, almost like a book. It’s like different chapters in a book\n\n\tThe challenge for “Frontline’ was to turn a regional investigation into a tale that would interest viewers no matter where they live, says Jonatha Schienberg, the director and producer of the documentary.  “The story that really hasn’t been told in the past is the story of the downstream impacts. We are likely going to see other situations out there because this is such a widely used chemical as well. It’s used in so many consumer products and so many industries – in microwave popcorn and makeup. There are so many. I think we are kind of in the nascent stages of some of this in terms of the story.”\n\n\tOne thing all the reporters wanted was more participation from the carpet companies. No executive from the corporations appears on camera in the “Frontline” documentary and most reports had to rely on prepared statements. But there was hope for more. After all, as the companies explained, they initially thought the chemicals they used were safe. What that reaction leaves out, however, is an explanation of what they’ve done to mitigate the problem since the dangers of “forever chemicals” have become more widely known.\n\n\tAll the journalists involved believe their findings will be compelling enough for audiences beyond their immediate reach. “What’s happening in northwest Georgia is really sort of the front line a dynamic that playing out all over the country. These chemicals are not only everywhere, they are persistent,” says Jackson. “What we’re dealing with in Georgia is something that communities across the country are going to have to deal with, for my generation and for future generations.”\n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Carpet Chemicals Catastrophe Brings Band of Media Outlets Together to Investigate",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/FL_Contaminated_SignatureImage1.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-02T11:00:00.000Z",
      "dateModified": "2026-02-02T11:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Disney Gets Bump From ‘Zootopia 2’ and Parks in Year-End 2025 Quarter, Streaming Income Jumps 72% as Company Stops Disclosing Disney+, Hulu Subscriber Numbers",
    "url": "https://variety.com/2026/tv/news/disney-q1-2026-earnings-stops-reporting-disney-plus-hulu-subscribers-1236648525/",
    "image": "https://variety.com/wp-content/uploads/2025/11/MCDZOTW_WD005.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-02T11:40:46.000Z",
    "description": "\n\tDisney beat Wall Street expectations with a 5% lift in revenue for the December 2025 quarter, and its streaming biz continued its up-and-to-the-righ",
    "body": "\n\tDisney beat Wall Street expectations with a 5% lift in revenue for the December 2025 quarter, and its streaming biz continued its up-and-to-the-right trajectory — but the company is no longer reporting Disney+ and Hulu subscriber totals.\n\n\tThe Mouse House’s total revenue came in at $25.98 billion for the three months ended Dec. 27, 2025, the first quarter of Disney’s 2026 fiscal year. Net income before income taxes was $3.69 billion, roughly in line with the year-prior quarter, and adjusted earnings per share declined 7% to $1.63.\n\t\n\n\tEntertainment segment revenue increased 7%, thanks to box-office blockbuster “Zootopia 2” — which has become the highest-grossing animated film ever — James Cameron’s “Avatar: Fire and Ash” and other movies, as well as higher revenue from Disney+ and Hulu after price hikes that took effect in the quarter. Disney’s theme parks and products biz hit a record $10 billion in revenue (up 6%) in the year-end quarter and operating income rose 6% to $3.3 billion.\n\n\n\tHowever, overall company operating income decreased 9% for the quarter, to $4.6 billion. Disney’s entertainment business was hurt by higher content and production costs; it also spent more on theatrical marketing (with nine releases in the quarter, vs. four the year earlier) and marketing for Disney+ and Hulu. In addition, ESPN’s operating income took a $110 million hit because of last fall’s two-week YouTube TV blackout.\n\n\tDisney chief Bob Iger said in prepared remarks: “We are pleased with the start to our fiscal year, and our achievements reflect the tremendous progress we’ve made. We delivered strong box-office performance in calendar year 2025 with billion-dollar hits like ‘Zootopia 2’ and ‘Avatar: Fire and Ash,’ franchises that generate value across many of our businesses. As we continue to manage our company for the future, I am incredibly proud of all that we’ve accomplished over the past three years.”\n\t\n\n\tThe company’s board is expected to announce Iger’s successor as the next Disney CEO as soon as this week. Iger is reportedly planning to step down in 2026 before his contract officially expires at the end of the year. The board is “aligning” around selecting Josh D’Amaro, chairman of the Disney Experiences theme parks, cruises and products division, per Bloomberg.\n\n\tStreaming again shone in the quarter: Total revenue for Disney+ and Hulu was $5.35 billion, up 11%, and operating income zoomed 72% to $450 million. That represented operating margin of 8.4% for the period, and Disney reiterated that it expects entertainment streaming to see operating margin of 10% for full-year fiscal 2026.\n\n\tGoing forward, investors will have to track Disney’s streaming progress without knowing subscriber numbers for Disney+, Hulu or Hulu + Live TV. The company had announced in August that it would no longer report subscribers or revenue for Disney+ or Hulu, saying those metrics have become “less meaningful to evaluating the performance of our businesses.” The move follows the lead of Netflix, which discontinued regularly reporting sub numbers in Q1 of 2025, citing the same rationale.\n\n\tOn Oct. 29, 2025, Disney merged its Hulu + Live TV assets with Fubo, and Disney now owns a 70% interest in the combined business. In the quarter, Disney took a $307 million non-cash tax charge for the Fubo transaction.\n\n\tMeanwhile, Disney also is no longer breaking out revenue or operating income for its linear TV business, which includes ABC and entertainment cable networks like FX and Disney Channel. Along with the rest of the industry, Disney’s linear TV operations have seen a steady decline amid cord-cutting and the rise of streaming. TV ad revenue declined in the quarter, according to Disney, in part because of lower political ad spending compared with 2024. ABC and Disney’s entertainment cablers also suffered a revenue drop from the YouTube TV blackout (but the company didn’t quantify that).\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Disney Gets Bump From ‘Zootopia 2’ and Parks in Year-End 2025 Quarter, Streaming Income Jumps 72% as Company Stops Disclosing Disney+, Hulu Subscriber Numbers",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/MCDZOTW_WD005.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-02T11:40:46.000Z",
      "dateModified": "2026-02-02T11:40:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kelli Garner, Jake Connelly’s ‘Blood on the Ice,’ Mbrella Films’ First U.S. Production, Commences Illinois Shoot (EXCLUSIVE)",
    "url": "https://variety.com/2026/film/news/kelli-garner-jake-connelly-blood-on-the-ice-1236649507/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Kelli-Garner-Jake-Connelly.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-02T11:10:33.000Z",
    "description": "\n\tBangkok-based Mbrella Films has commenced production on its inaugural American feature, the thriller “Blood on the Ice,” which is currently shooting",
    "body": "\n\tBangkok-based Mbrella Films has commenced production on its inaugural American feature, the thriller “Blood on the Ice,” which is currently shooting on location in central Illinois.\n\n\tThe project, co-produced with IB Films, is helmed by director Justin Hayward and produced by Adam Pray. Kelli Garner (“The Aviator,” “Lars and the Real Girl”) leads the cast, joined by Jake Connelly (“Stranger Things”) and former Chicago Bears defensive end Israel Idonije. Stephen Fletcher and Darren Weninger serve as executive producers.\n\t\n\n\tThe character-driven thriller unfolds against the backdrop of a harsh Midwestern winter, utilizing the extreme environment as a key dramatic element. Post-production is scheduled to take place in Thailand under Mbrella Films’ oversight.\n\n\n\t“I’m very happy that Mbrella Films is able to support this project, as this is the type of film that’s becoming increasingly difficult to make,” Pray said. “‘Blood on the Ice’ is a lean film with a strong creative vision, offering a deep exploration of character within a compelling setting.”\n\n\tHayward added: “The story is rooted in place and pressure. The Midwest winter isn’t just a backdrop — it actively shapes the film’s tone and the characters’ decisions.”\n\n\tJoshua Dixon, CEO of Mbrella Films, said: “This film marks our first feature produced in the U.S., and we see it as a foundation for future co-productions between the U.S. and Thailand.”\n\n\tMbrella Films provides production and post-production services for international features and television projects while developing its own original content slate. The company received a strategic investment from Friday Industries in 2025 as part of its international expansion efforts.​​​​​​​​​​​​​​​​\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kelli Garner, Jake Connelly’s ‘Blood on the Ice,’ Mbrella Films’ First U.S. Production, Commences Illinois Shoot (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Kelli-Garner-Jake-Connelly.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-02T11:10:33.000Z",
      "dateModified": "2026-02-02T11:10:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Maxima,’ Now Gearing Up for Season 2, Sold by Beta Film to 85 Territories Worldwide, Drops New Trailer (EXCLUSIVE)",
    "url": "https://variety.com/2026/tv/global/maxima-beta-film-trailer-london-tv-screenings-1236649444/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Maxima-Season-2-Delfina-Chaves-as-Maxima-Millstreet_Films-redit-Mark-de-Blok16.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-02T10:37:20.000Z",
    "description": "\n\tConsolidating its status as one of Europe’s major post-peak TV sales hits, Dutch royalty series “Maxima,” has been licensed by Beta Film to over 85 ",
    "body": "\n\tConsolidating its status as one of Europe’s major post-peak TV sales hits, Dutch royalty series “Maxima,” has been licensed by Beta Film to over 85 territories around the world. \n\n\tOften compared to “The Crown,” the series dramatizes the real-life odyssey of Argentina’s Máxima Zorreguieta from a fun-loving her-own-woman as a New York-based economist to becoming an institution, Queen Maxima of the Netherlands.    \n\t\n\n\tNews of the sales smash comes as Beta Film has shared with Variety in exclusivity a new trailer for Season 2, as Beta Film gears up to offer “Maxima’s” 12 episodes at late February’s London TV Screenings. \n\n\n\tAmong new licensing deals, Beta Film has closed “Maxima” with HBO Max in France, as well as with major SVOD service LG U+in South Korea and with Arabic-language Dubai TV for the Middle East and Northern Africa. Telco channel Nova will release “Maxima” in Greece and Cyprus. \n\n\tThe sales add to a slew of accords announced from 2024 when “Maxima” bowed at Canneseries, led by deals with HBO Max for Latin America and public broadcaster SBS in Australia, plus multi-broadcaster deals to Scandinavia and others to German-speaking territories. Season 2 will be released March 14 on Videoland, the streaming service of RTL Netherlands, where Season 1 smashed records, natural enough when it offers an intimate portrait of the country’s crowned Queen. \n\n\tIn international, however, Episode 1 attracted over 1 million viewers on Atresmedia’s SVOD service Atresplayer, hit the Top 10 of international series on Italy’s RaiPlay and broke records on HBO Max in Latin America where it became the best-viewed premiere ever in Máxima’s native Argentina. It also ranked in the Top 10 on HBO Max for multiple weeks over the whole of Latin America. \n\t\n\n\tBased on the book “Máxima Zorreguieta: Motherland” by Marcia Luyten and produced by Dutch company Millstreet Films (“The Neighbors”), in co-production with FBO and Beta Film, the story of Máxima, at least in its first two seasons is a spectacular case of a universal narrative: the transition from young to full adulthood. \n\n\tSeason 1 sometimes played as a comedy of contrasts, as when the outgoing Máxima (Delfina Chaves) and a tongue-tied Willem-Alexander (Martijn Lakemeir) first meet at the Seville Spring Fair in 1999. Maxima drags him out to dance. She’s a relaxed mover, the future King of the Netherlands dances like  a clodhopper. \n\n\tThe series is above all, however, a royal love story seen from Maxima’s point of view. Later, Maxima is introduced to the Netherlands’ shrewd ad kindly Queen Beatrix who tries to put her at ease. The past of Máxima’s father Jorge Zorreguieta, one of the longest-serving civilian ministers in Argentina’s murderous 1976-1983 military dictatorship, prompts, however, a row between Maxima and Willem-Alexander and is aired by the Dutch press. Season 1 climaxes with the couple’s engagement.\n\n\tAs Variety has observed, some fairytales end with a royal wedding. Season 2 of “Maxima” starts with one, caught in the new trailer. Outwardly composed, Maxima is a bundle of nerves. There’s a deeper reason than fear of a snafu at the ceremony. “Am I really ready to serve 17 million people?” Maxima asks herself. “I don’t know,” she answers candidly.\n\n\n\n\n\tDirected by Saskia Diesing & Joosje Duk and produced by Millstreet Films’ Rachel Van Bommel, later Season 2 scenes take in Maxima pregnant, then a young mother. She seems still very much in love with Willem-Alexander. Season 2 also takes in a replica of Maxima’s legendary Valentino wedding gown. But marriage is not a bed of roses. Maxima is subjected to intense public scrutiny and sometimes criticism. “They’re destroying me,” Maxima storms of one day’s newspapers. “I want to be judged for everything I have fought for. For who I am,” adds Maxima, a staunch defender of immigrants and LGBTQ causes. \n\n\tThere are also tragedies. The real drama, however, is how Maxima, as Season 2 races towards her coronation, can carry out her responsibilities as a wife, mother and future Queen while retaining her own voice. “We all have to make compromises,” says Queen Beatrix. Maxima looks set to learn that sometimes the hard way. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Maxima,’ Now Gearing Up for Season 2, Sold by Beta Film to 85 Territories Worldwide, Drops New Trailer (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Maxima-Season-2-Delfina-Chaves-as-Maxima-Millstreet_Films-redit-Mark-de-Blok16.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-02T10:37:20.000Z",
      "dateModified": "2026-02-02T10:37:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "French Director Quentin Dupieux on ‘Full Phil’ Starring Kristen Stewart, Woody Harrelson: ‘It’s Like “Emily in Paris” in Hell — a Fever Dream, a Nightmare Version of It’ (EXCLUSIVE)",
    "url": "https://variety.com/2026/film/global/quentin-dupieux-full-phil-kristen-stewart-woody-harrelson-1236649429/",
    "image": "https://variety.com/wp-content/uploads/2026/02/fdaca458-06d8-40ad-a59e-af174f4643be.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-02T10:41:46.000Z",
    "description": "\n\tQuentin Dupieux‘s “Full Phil” has been described as a “White Lotus”-esque project based on its high concept pitch, starring Woody Harrelson as a wea",
    "body": "\n\tQuentin Dupieux‘s “Full Phil” has been described as a “White Lotus”-esque project based on its high concept pitch, starring Woody Harrelson as a wealthy American industrialist attempting to reconnect with his daughter – played by Kristen Stewart — during an opulent trip to Paris. Yet, the prolific French director tells Variety that his movie is “more like ‘Emily in Paris’ in hell — a fever dream, a nightmare version of it.”\n\n\tA highly prolific and iconoclastic filmmaker, Dupieux (who describes himself as a “washing machine running non-stop”) says “Full Phil” was sparked by his desire to make a film in English after making 10 movies in French. At the start of his filmmaking career, he had made a few projects in the U.S. such as “Rubber,” which lensed in California with a cast including Stephen Spinella. “When you change languages, your brain enters a slightly different zone. It’s very interesting,” Dupieux says in an exclusive interview with Variety on the eve of the EFM.\n\t\n\n\tThe surreal black comedy, which Studiocanal will introduce to buyers at the European Film Market in Berlin, also stars Charlotte Le Bon (“White Lotus”), Emma Mackey (“Barbie”), Nassim Lyes (“Under Paris”), Tim Heidecker and Eric Wareheim. \n\n\tNow in post-production, “Full Phil” shot on location in Paris and marks the first film co-starring Harrelson and Stewart. They turned out to have the perfect chemistry, Dupieux says, adding that “making the Kristen–Woody relationship believable” was key for the movie. “Even if my films are often absurd, I always want believable worlds. I wouldn’t have liked it if they didn’t feel like family,” the helmer says. “But they’re great professionals. We never questioned it. He really is her dad, she really is his daughter.”\n\t\n\n\tYet, “Full Phil” isn’t a deep exploration of a father-daughter relationship, says Dupieux, who is known for his absurdist and quirky sense of humor. The synopsis suggests a surprising subplot, mentioning “French cuisine, a 1950s horror film and an invasive hotel employee” disturbing their lavish Paris trip. “Pure emotion as an objective isn’t my thing,” he says. “What I like is fantasy, and above all, making people laugh and be entertained — but not through traditional comedy.”\n\n\t“The film is funny in other ways. I started with this father-daughter story, and then there’s a second film inside the film,” he says. “I see these conceptual films like amusement parks. It takes us on emotional, comical and fantastical rides.”\n\n\t“Full Phil” reteams Dupieux with producer Hugo Selignac at Chi-Fou-Mi (a Mediawan company). They have made eight films in six years together, including “Mandibules,” “Smoking Causes Coughing,” “Yannick,” “Daaaaalí!,” “The Second Act”, “The Piano Accident” and “Signaux.”\n\n\tThe pair are already working on another project with American actors. “There are many actors I still haven’t worked with. In France, I’m close to exhausting the possibilities. In the U.S., I’m just getting started,” Dupieux says. \n\t\n\t\tWhat’s the origin of “Full Phil”?\t\n\n\tI’m a bit like a washing machine that runs non-stop. Projects are born and feed off each other constantly. I know there are people who work differently, who tackle a project one day and for whom there are reasons and a strong desire. For me, it’s more like a washing machine. Right now, I’m really at the end of “Full Phil,” and I’m already revisiting scripts I had in progress, and we’re already relaunching other projects. So there isn’t this system of a project being born in my mind. It’s not a race — I do it calmly — but this project was born in my laboratory, like all my other projects, in perpetual motion. It’s very hard to find what triggered it.\n\t\n\t\tWas it perhaps a meeting with Woody or Kristen?\t\n\n\tMore likely a desire to confront the English language again. When I was just starting out, I made a few small films in the U.S., in English, and I had a lot of fun. When you change languages, your brain enters a slightly different zone. It’s very interesting. Then I came back to France and eagerly made 10 French films in quick succession. I met lots of French actors, and there are many films in that group that I’m very proud of. That’s pretty much where it all started — a desire to change register through language. My films rely heavily on dialogue, and changing languages means confronting a different rhythm, a different music. That was the starting point. After that, Woody and I met because he saw “The Second Act” and “Yannick.”\n\t\n\t\n\t\tHow did that connection happen?\t\n\n\tHe was very taken with “The Second Act” and “Yannick,” which surprised me because those films are based solely on text. It’s hard to imagine Anglo-Saxons watching something like “Yannick,” which is an hour of subtitles and very little action. You’d think those films wouldn’t travel, but they do.\n\n\tWhat people don’t necessarily know about Woody is that he has a very intellectual side. A few years ago, he made a single-shot film broadcast live. I didn’t see it, but he immediately told me about it because there are long shots in “The Second Act.” You wouldn’t think it, but he has that kind of thinking. His film was like live theater, and my films are quite theatrical too — very focused on actors and dialogue. That spoke to him, and we connected. At that point, I was already writing “Full Phil,” and that meeting boosted my desire to do it. Having direct contact with an American actor like Woody makes development much easier. In France, I can call actors directly, text them, get decisions very quickly. In the U.S., everything takes longer. Decision-making is slower. Given that I like immediacy — my films are short, I make several a year — that’s not always easy to combine with the American system. Here, it worked because Woody really wanted it.\n\t\n\t\tWhat about Kristen Stewart?\t\n\n\tWe embarked on the film as soon as Woody came on board. He accepted without reading the script, which is extraordinary for an American actor. He was so enthusiastic about the two films he’d seen. I finished writing, and we had to find the character of his daughter. We always start by checking availability, because I like immediacy. We set dates right away — we don’t say, “We’ll see in a year.” That’s the DNA of my projects. They’re very prepared and very written, but we do them quickly. We started looking for a young woman who could play Woody’s daughter and who would be available, and we quickly came across Kristen. It was a great choice. The combination works perfectly. We’d never seen them together, but something was immediately obvious. She took a weekend to consider it and accepted within 48 hours, which is rare. I think there was a challenge in the film that excited her. She joined just like that — very brave of her.\n\t\n\t\n\t\tWhy brave? Is she doing stunts?\t\n\n\tYou don’t know it yet, but there’s a delicate aspect to what she does in one part of the film. There was a whole thing about cuisine, but I can’t say more. Sometimes the difficulty is physical transformation or stunts or shaving your head. Here, it’s something completely different. I’ll leave the mystery unresolved.\n\t\n\t\tIs it a film about cooking?\t\n\n\tNot at all. I’m dissecting a father-daughter relationship in a complicated situation. It’s about a widowed father trying to reconnect with his daughter, who’s about 30. There’s a very emotional, grounded part with real characters. And then the film slips — inevitably — into something more fantastical.\n\t\n\t\tThere are often fantastical elements in your films.\t\n\n\tThat’s because a straight film about a father and daughter isn’t my thing. Many people do that very well — I’m thinking of “Sentimental Value” recently. That’s not my specialty. I dabbled in it, but inevitably I ended up doing something else. Pure emotion as an objective isn’t my thing. What I like is fantasy, and above all, making people laugh and be entertained — but not through traditional comedy. The film is funny in other ways. I started with this father-daughter story, and then there’s a second film inside the film, which is also a surprise. You can guess it from the synopsis: Kristen and Woody’s film is mixed with a 1950s horror film. It’s done in a very playful way. I see these conceptual films like amusement parks. The film takes us on emotional, comical, and fantastical rides.\n\t\n\t\tWhat worked in particular? The chemistry between Kristen and Woody?\t\n\n\tThat was the major challenge — making the Kristen–Woody relationship believable. Even if my films are often absurd, I always want believable worlds. I wouldn’t have liked it if they didn’t feel like family. But they’re great professionals. We never questioned it. He really is her dad, she really is his daughter. That was a great success.\n\n\tAnother gamble was integrating a 1950s horror film into a modern story. On paper, it sounds crazy. The synopsis is mysterious. But that ingredient worked too. It makes the film joyful, special, and quite new.There’s also the theme of Americans in Paris, which can feel artificial. We shot in real locations. The film could have been partly shot in a studio — it would’ve been easier and cheaper — but we refused. It really takes place in Paris, in real streets and buildings, and that gives it real charm.\n\t\n\t\n\t\tSome people compared your film to “White Lotus” based on the pitch. Do you see that?\t\n\n\tI recently watched a few episodes of the latest season with Charlotte Le Bon, who’s also in my film. I don’t really see the similarity. “White Lotus” is quite realistic. Yes, there are two people in a hotel, but there’s much more than that. And we don’t stay in the hotel the whole movie.\n\t\n\t\tDid you ever think of setting “Full Phil” in L.A.?\t\n\n\tI could have told the story anywhere, but I’d never filmed in Paris before. I usually escape — deserts, sea, mountains. I live in Paris, so I need dreamlike places. Recently, I made “L’accident de piano” in Haute-Savoie. Here, it was interesting to invite Americans into the cliché of Americans in Paris and actually shoot in Paris. It was part of the DNA from the beginning. And the cooking element wouldn’t have worked anywhere else. It’s more like “Emily in Paris” in hell — a fever dream, a nightmare version of it.\n\t\n\t\tDo you let actors improvise?\t\n\n\tNo, that’s not my system. The script is a score, and it must be followed. But within that, I’m completely open to real life. I love being surprised by performances. I work by ear. I listen to rehearsals or the first take, and I know what to tell them. Sometimes it works immediately; sometimes there are misinterpretations, and I correct them. When a line sounds wrong, it’s like music — I ask for another tune. The rhythm is musical work. We explore. Sometimes we get stuck on three lines for no reason. That’s part of the job. It’s not improvisation, but it’s not robotic either.\n\t\n\t\tKristen Stewart is also a filmmaker. Did that influence the collaboration?\t\n\n\tShe was very nice and let herself go. She immediately saw that my method was unique and not conventional. Because I write everything myself, I’m behind the camera, I decide when we stop and start — it’s a little wild. She understood it quickly and trusted it completely. The same with Woody. For the first two or three days, they were spectators of a method they’d never encountered. It was a very serene set. I think it made an impression.\n\t\n\t\tWhat defines your method?\t\n\n\tSpeed. We shoot very quickly, but without stress. The team is extremely professional. Actors often tell me that on traditional sets they spend their days waiting. On my films, Woody and Kristen were on set all day.\n\t\n\t\n\t\tYou also edit during filming?\t\n\n\tI pre-edit during filming. As soon as I have a doubt, I lock myself in a dressing room and check if the editing works. That way, I avoid shooting unnecessary footage. Many directors would keep shooting “just in case.” I don’t. I check. It means I don’t exhaust the actors by repeating things endlessly.\n\t\n\t\tWhat stage is the film in now? \t\n\n\tI’m finishing the editing now, and I’m very happy with it. I’ve never done anything like this before. It’s new, even for me. And I’m delighted it’s in English with Woody, Kristen, Charlotte Le Bon, and Tim and Eric. Cinema is often compared to cooking. There are ingredients. Sometimes recipes don’t work. In this case, I found a recipe that really worked.\n\t\n\t\tDid this experience make you want to make more English-language films?\t\n\n\tAbsolutely. We have other projects in the works. One was written even before “Full Phil.” It’s like changing music. English has a different rhythm. I saw it during editing — it’s new music, very enjoyable. I’m not tired of French at all, but this is a musical respite. And the U.S. is a wonderful playground. There are many actors I still haven’t worked with. In France, I’m close to exhausting the possibilities. In the U.S., I’m just getting started. So I’ll absolutely continue developing projects in English.\n\t\n\t\tYour producer Hugo Selignac says many American actors want to work with you.\t\n\n\tYes, we are in demand, which is very pleasant. It reinforces our conviction. But actually making it happen is complicated — schedules, huge stars, timing. My method is fast-paced, and I can’t project myself two years into the future. I live in the moment. So I’ll end up working with those who accept that speed. Woody and Kristen were the first to try it. They loved it. It went very well. And we hope to convince others to go just as fast.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "French Director Quentin Dupieux on ‘Full Phil’ Starring Kristen Stewart, Woody Harrelson: ‘It’s Like “Emily in Paris” in Hell — a Fever Dream, a Nightmare Version of It’ (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/fdaca458-06d8-40ad-a59e-af174f4643be.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-02T10:41:46.000Z",
      "dateModified": "2026-02-02T10:41:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Clio Barnard’s ‘I See Buildings Fall Like Lightning’ Boarded by Charades Ahead of EFM as First Look Unveiled (EXCLUSIVE)",
    "url": "https://variety.com/2026/film/global/clio-barnard-i-see-buildings-fall-like-lightning-charades-1236649462/",
    "image": "https://variety.com/wp-content/uploads/2026/02/92_ISBFLL-DAY27-81332.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-02T11:30:00.000Z",
    "description": "\n\t“I See Buildings Fall Like Lightning,” the next feature from BAFTA-nominated writer/director Clio Barnard (“Ali & Ava,” “Dark River”), has been boug",
    "body": "\n\t“I See Buildings Fall Like Lightning,” the next feature from BAFTA-nominated writer/director Clio Barnard (“Ali & Ava,” “Dark River”), has been bought for worldwide rights by Charades. \n\n\tThe Paris-based sales company will now launch the project — first announced by Variety in 2025 — at the upcoming European Film Market in Berlin, and has unveiled a first look image. \n\n\tAdapted by “Die My Love” and “Hunger” writer Enda Walsh from Keiran Goddard’s eponymous novel, the film is lead by a buzzy ensemble cast, including Anthony Boyle (“Say Nothing,” “Masters of the Air”), Joe Cole (“Gangs of London,” “A Prayer Before Dawn”), Jay Lycurgo (“Steve,” “Half Bad: The Bastard Son & The Devil Himself”), Daryl McCormack (“Good Luck to You, Leo Grande,” “Bad Sisters”) and Lola Petticrew (“Say Nothing,” “She Said”). Millie Brady (“The Last Kingdom”), Lucie Shorthouse (“Rebus”) and James Eeles (“The Batman”) also star. \n\t\n\n\t“I See Buildings Fall Like Lightning” follows five childhood friends; Patrick, Shiv, Rian, Oli, and Conor played together, who skipped school together and dreamt of the lives they would have one day. Now they’re thirty, and the future they imagined is slipping quietly out of reach.\n\n\tThe film is produced by Tracy O’Riordan of Moonspun Films, continuing her long-time relationship with the Barnard. It was developed with BBC Film who are also co-financing with BFI (awarding National Lottery funding), in association with Curzon Film who will handle U.K. distribution, and TPC.\n\n\t“Collaborating with Clio Barnard and her long-time producer Tracy O’Riordan represents for us a unique opportunity to contribute to the growing legacy of this essential U.K. filmmaker, while also shining a light on her remarkable ensemble cast, whose energy and authentic performances immediately resonated with us — including young rising star Jay Lycurgo, recently awarded at the BIFAs,” said Charades co-founder Carole Baraton.\n\t\n\n\tExecutive producers are Barnard, Walsh, Keiran Goddard, Claudia Yusef at BBC Film, Mia Bays at the BFI, Ali Jazayeri and Keith Kehoe at TPC, Louisa Dent and Philip Knatchbull at Curzon Film, Baraton and Lucie Desquiens at Charades and Jane Moore.\n\n\t“We’ve long been admirers of their passion and expertise, so we’re delighted to be working with Carole and team at Charades on ‘I See Buildings Fall Like Lightning’ and looking forward to introducing this beautiful film and stellar ensemble cast to an international audience,” said O’Riordan.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Clio Barnard’s ‘I See Buildings Fall Like Lightning’ Boarded by Charades Ahead of EFM as First Look Unveiled (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/92_ISBFLL-DAY27-81332.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-02T11:30:00.000Z",
      "dateModified": "2026-02-02T11:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'TODAY' Anchor Savannah Guthrie’s Mom Missing",
    "url": "https://www.tmz.com/2026/02/01/today-anchor-savannah-guthrie-s-mom-missing/",
    "image": "https://imagez.tmz.com/image/03/16by9/2026/02/02/03280d87ec65424cbad48a2f7201e7e1_xl.png",
    "tag": "Entertainment",
    "date": "2026-02-02T04:32:46.000Z",
    "description": "\n    \n                    \n                          'TODAY' Anchor Savannah Guthrie\n                          Mom Missing in Arizona\n                ",
    "body": "\n    \n                    \n                          'TODAY' Anchor Savannah Guthrie\n                          Mom Missing in Arizona\n                      \n                  \n                                                                        Published \n                              February 1, 2026\n                            8:32 PM PST\n                                                                      |\n                                                                Updated \n                                  February 2, 2026\n                                4:39 AM PST\n                                    \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Authorities in Arizona are searching for Nancy Guthrie, the mother of 'TODAY' anchor Savannah Guthrie, who was reported missing under what authorities are calling concerning circumstances.\n      \n    \n          The Pima County Sheriff's Department says the 84 year old was last seen Saturday night near her home in the Tucson area. Sheriff Chris Nanos said she was last seen at her residence around 9:30 to 9:45 p.m.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          A family member called 911 around noon on Sunday to report the NBC star's mom missing.\n      \n    \n          During a briefing, the sheriff said disturbing or concerning circumstances were found at the home, prompting homicide detectives to assist in the investigation. While authorities emphasized the case is currently being handled as a search and rescue operation, the sheriff said investigators are not ruling out foul play.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Search efforts are ongoing and include air and ground teams scouring the area. Nancy is described as 5 feet 5 inches tall, weighing approximately 150 pounds, with brown hair and blue eyes.\n      \n    \n          In a statement, Savannah says, “On behalf of our family, I want to thank everyone for the thoughts, prayers and messages of support. Right now, our focus remains on the safe return of our dear mom.\"\n      \n      \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'TODAY' Anchor Savannah Guthrie’s Mom Missing",
      "image": [
        "https://imagez.tmz.com/image/03/16by9/2026/02/02/03280d87ec65424cbad48a2f7201e7e1_xl.png"
      ],
      "datePublished": "2026-02-02T04:32:46.000Z",
      "dateModified": "2026-02-02T04:32:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Druski Hits Lakers-Knicks At MSG w/ OnlyFans Star Sky Bri",
    "url": "https://www.tmz.com/2026/02/01/druski-lakers-knicks-onlyfans-sky-bri-lebron/",
    "image": "https://imagez.tmz.com/image/5b/16by9/2026/02/02/5b135a51c5264e659c15a6a410f2f3b1_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-02T01:40:48.000Z",
    "description": "\n    \n                    \n                          Druski\n                          Hits N.Y. Knicks Game W/ OnlyFans Star Sky Bri\n                 ",
    "body": "\n    \n                    \n                          Druski\n                          Hits N.Y. Knicks Game W/ OnlyFans Star Sky Bri\n                          ... NBA Date Night?!\n                      \n                  \n                                                                        Published \n                              February 1, 2026\n                            5:40 PM PST\n                                                                      |\n                                                                Updated \n                                  February 1, 2026\n                                6:33 PM PST\n                                    \n      \n    \n        \n                    \n                  \n      \n    \n          It could be LeBron James' last time playing at Madison Square Garden, but Druski stole some of the spotlight Sunday night ... pulling up to the World's Most Famous Arena with adult film star, Sky Bri!\n      \n    \n          TMZ Sports has video of the comedian and Bri arriving at the arena in Midtown Manhattan in a black SUV, before heading to their courtside seats -- right next to NYK superfan, Spike Lee -- for the sold-out NBA game.\n      \n    \n          The million-dollar, currently unanswered, question ... are they dating, or just friends?!\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n\n          Druski was previously linked to rapper Rubi Rose, while Bri, Jake Paul and Adin Ross.\n      \n    \n          Tickets to the game were selling for exorbitant prices (upwards of $5k) -- not out of the ordinary for a Lakers vs. Knicks game -- but questions about LeBron's future added to the marquee value of the matchup.\n      \n    \n          James, 41, has recently talked about retirement ... acknowledging, in his 23rd season in the NBA, that the end is close.\n      \n    \n          Tonight's game is the last time the Lakers will travel to New York City to play the Knicks this season.\n      \n    \n          We see you, Druski!\n      \n      \n              \n          \n                          \n                Druski\n              \n                          \n                LeBron James\n              \n                          \n                TMZ Sports\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Druski Hits Lakers-Knicks At MSG w/ OnlyFans Star Sky Bri",
      "image": [
        "https://imagez.tmz.com/image/5b/16by9/2026/02/02/5b135a51c5264e659c15a6a410f2f3b1_xl.jpg"
      ],
      "datePublished": "2026-02-02T01:40:48.000Z",
      "dateModified": "2026-02-02T01:40:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chappell Roan Goes Topless on Grammy Red Carpet",
    "url": "https://www.tmz.com/2026/02/01/chappell-roan-topless-grammy/",
    "image": "https://imagez.tmz.com/image/bf/16by9/2026/02/02/bf3cd380bc1547deb519775aa38efab4_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-02T00:25:44.000Z",
    "description": "\n    \n                    \n                          Chappell Roan\n                          Wears Topless Dress to Grammys!!!\n                      \n",
    "body": "\n    \n                    \n                          Chappell Roan\n                          Wears Topless Dress to Grammys!!!\n                      \n                  \n                                                                        Published \n                              February 1, 2026\n                            4:25 PM PST\n                                                                      |\n                                                                Updated \n                                  February 1, 2026\n                                8:45 PM PST\n                                    \n      \n    \n          It wasn't the Pink Pony Club but Chappell Roan definitely caused a scene at the Grammys ... she showed up topless as she hit the red carpet!\n      \n    \n          Check out the pic ... her boobs were completely out as cameras flashed to capture the image.\n      \n    \n          The singer is nominated for Record of the Year and Best Pop Solo Performance for \"The Subway.\"\n      \n    \n          While she wasn't performing she still found a way to put on a show!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Chappell Roan\n              \n                          \n                Celebrity News\n              \n                          \n                Red Carpet Events\n              \n                          \n                Photo Galleries\n              \n                          \n                Grammy Awards\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chappell Roan Goes Topless on Grammy Red Carpet",
      "image": [
        "https://imagez.tmz.com/image/bf/16by9/2026/02/02/bf3cd380bc1547deb519775aa38efab4_xl.jpg"
      ],
      "datePublished": "2026-02-02T00:25:44.000Z",
      "dateModified": "2026-02-02T00:25:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Guess Who This Lil' Musician In Yellow Turned Into!",
    "url": "https://www.tmz.com/2026/02/02/guess-who-lil-musician-in-yellow-turned-into/",
    "image": "https://imagez.tmz.com/image/a3/16by9/2026/01/26/a3471a1671164b0e899f69e40708fc56_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-02T08:01:21.000Z",
    "description": "\n    \n                    \n                          Guess Who This\n                          Lil' Musician\n                          Turned Into!\n   ",
    "body": "\n    \n                    \n                          Guess Who This\n                          Lil' Musician\n                          Turned Into!\n                      \n                  \n                                                                        Published \n                              February 2, 2026\n                            12:01 AM PST\n                                                                            \n      \n    \n          Before this girl in yellow was a global superstar, she was just rockin' out at the local theater, acting and singing ... and growing up in Boca Raton, Florida.\n      \n    \n          ... \"This is the part when you break free\" and hit up the gallery!\n      \n    \n          Can you guess who she is?\n      \n      \n      \n          \n            \n              \n                \n                Share on Facebook\n              \n            \n            \n              \n                \n                Share on X\n              \n            \n                          \n                \n                  \n                \n              \n                      \n        \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Pop Music\n              \n                          \n                Movies\n              \n                          \n                Guess Who\n              \n                          \n                Kids\n              \n                          \n                Photo Galleries\n              \n                          \n                Music\n              \n                          \n                Wicked\n              \n                      \n        \n          \n  ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Guess Who This Lil' Musician In Yellow Turned Into!",
      "image": [
        "https://imagez.tmz.com/image/a3/16by9/2026/01/26/a3471a1671164b0e899f69e40708fc56_xl.jpg"
      ],
      "datePublished": "2026-02-02T08:01:21.000Z",
      "dateModified": "2026-02-02T08:01:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Guess Who This Horror-Loving Actor Is!",
    "url": "https://www.tmz.com/2026/02/01/guess-who-horror-loving-actor/",
    "image": "https://imagez.tmz.com/image/cf/16by9/2026/01/27/cfeb91b12bbe43f8b31403c53aa53ff8_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-02T00:00:13.000Z",
    "description": "\n    \n                    \n                          Guess Who\n                          This Horror-Loving Actor Is!\n                      \n         ",
    "body": "\n    \n                    \n                          Guess Who\n                          This Horror-Loving Actor Is!\n                      \n                  \n                                                                        Published \n                              February 1, 2026\n                            4:00 PM PST\n                                                                            \n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          There are lots of celebs out there who get thrills from spooky chills ... can you guess who this horror-loving actor is?\n      \n    \n          We caught up with this actor in 2018 and asked him about being the narrator of a Stephen King audiobook ... he was pretty stoked about the whole thing!\n      \n    \n          We pointed out his voice was perfect for narrating the book ... and he wasn't shy about admitting how creepy his voice could get!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                TV\n              \n                          \n                Guess Who\n              \n                          \n                Books\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Guess Who This Horror-Loving Actor Is!",
      "image": [
        "https://imagez.tmz.com/image/cf/16by9/2026/01/27/cfeb91b12bbe43f8b31403c53aa53ff8_xl.jpg"
      ],
      "datePublished": "2026-02-02T00:00:13.000Z",
      "dateModified": "2026-02-02T00:00:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]