[
  {
    "title": "Washington Post Publisher and CEO Will Lewis Steps Down Following Layoffs",
    "url": "https://variety.com/2026/biz/news/will-lewis-washington-post-ceo-1236655923/",
    "image": "https://variety.com/wp-content/uploads/2022/06/Washington-Post.png?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-08T01:20:16.000Z",
    "description": "\n\tDays after The Washington Post laid off nearly one-third of its staff, the outlet’s publisher and CEO, Will Lewis, has stepped down. Current CFO Jef",
    "body": "\n\tDays after The Washington Post laid off nearly one-third of its staff, the outlet’s publisher and CEO, Will Lewis, has stepped down. Current CFO Jeff D’Onofrio will step into Lewis’ role, effective immediately. \n\n\t“After two years of transformation at The Washington Post, now is the right time for me to step aside,” Lewis wrote in an email to staffers that was then shared to X by Post reporter Matt Viser. “I want to thank Jeff Bezos for his support and leadership throughout my tenure as CEO and Publisher. The institution could not have a better owner.”\n\t\n\n\tLewis’ note continued: “During my tenure, difficult decisions have been taken in order to ensure the sustainable future of The Post so it can for many years ahead publish high-quality nonpartisan news to millions of customers each day.” \n\n\n\tD’Onofrio joined the Post in June 2025, having formerly been the CFO of Raptive and, before then, the CEO of Tumblr. He also held leadership roles at Yahoo and Google.\n\n\t“The Post’s resolute commitment to writing the first rough draft of history anchors and imprints its future,” said D’Onofrio in a statement. “I am honored to become part of charting that future and to take the lead in securing both the legacy and business of this fierce, storied American institution.”\n\n\tJeff Bezos, owner of The Washington Post, also issued a statement: “The Post has an essential journalistic mission and an extraordinary opportunity. Each and every day our readers give us a roadmap to success. The data tells us what is valuable and where to focus. Jeff, along with Matt and Adam, are positioned to lead The Post into an exciting and thriving next chapter.”\n\t\n\n\tLewis’ statement on his departure is the first Washington Post staffers have heard from the executive following Wednesday’s layoffs, though a now-viral snap posted of Lewis to X shows that he was at a red carpet for the NFL honors on Thursday ahead of the Super Bowl in San Francisco. \n\n\tPrior to stepping down, Lewis had served as the newspaper’s publisher and CEO for the past two years,\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Washington Post Publisher and CEO Will Lewis Steps Down Following Layoffs",
      "image": [
        "https://variety.com/wp-content/uploads/2022/06/Washington-Post.png?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-08T01:20:16.000Z",
      "dateModified": "2026-02-08T01:20:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Olympic Skier Mikaela Shiffrin on Competing for Team USA Amid Political Turmoil in America: ‘There’s a Lot of Hardship in the World’",
    "url": "https://variety.com/2026/tv/news/olympic-skier-mikaela-shiffrin-team-usa-politics-1236655899/",
    "image": "https://variety.com/wp-content/uploads/2026/02/GettyImages-2260395923.jpg?crop=0px%2C329px%2C5266px%2C2962px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-02-08T00:42:21.000Z",
    "description": "\n\tTeam USA alpine skier Mikaela Shiffrin on Saturday told reporters during a press conference (via USA Today) that she hopes to elevate “inclusivity… ",
    "body": "\n\tTeam USA alpine skier Mikaela Shiffrin on Saturday told reporters during a press conference (via USA Today) that she hopes to elevate “inclusivity… diversity and kindness” at the 2026 Winter Olympics despite the current political turmoil in the United States.\n\n\tWhen asked about representing the United States during a time of deep social and political division, she said, “I think there’s a lot of hardship in the world globally, and there’s a lot of heartbreak, there’s a lot of violence. It can be tough to reconcile that when you’re also competing for medals in an Olympic event. I actually have some thoughts. I can read something that I had written.”\n\t\n\n\tShiffrin then shared a quote from Nelson Mandela. She said she was inspired by Charlize Theron, who quoted the South African civil rights leader during the Winter Olympics Opening Ceremony. “’Peace is not just the absence of conflict. Peace is the creation of an environment where we can all flourish regardless of race, color, creed, religion, gender, class, caste, or any other social markers of difference.’”\n\n\n\tShe concluded, “And for me, as this relates to the Olympics, I’m really hoping to show up and represent my own values. Values of inclusivity, values of diversity and kindness and sharing, tenacity, work ethic, showing up with my team every single day, like I said before, and the values that we bring and put out on the mountain and on the hill every single day. I’m hoping to represent those who have been supporting me this entire time, and I’m really thankful to be here. My greatest hope for these Olympic Games, from a broader perspective, is that it is a beautiful show of cooperation and of competition.”\n\t\n\n\tTeam USA’s freestyle skiers also had some complicated feelings about representing America. Chris Lillis told the press he feels “heartbroken” about the turmoil that ICE has caused in Minnesota, but hopes American athletes can represent a more unified vision of the United States.\n\n\t“I think that as a country, we need to focus on respecting everybody’s rights and making sure that we’re treating our citizens, as well as anybody, with love and respect,” Lillis said. “I hope that when people look at athletes compete in the Olympics, they realize that that’s the America that we’re trying to represent.”\n\n\tFellow Team USA freestyle skier Hunter Hess said during a press conference that representing the United States brings up “mixed emotions,” and that if he wins a medal, it would be more for his “family and the people that support me getting here” than his home country.\n\n\t“I think it’s a little hard,” Hess said. “There’s obviously a lot going on that I’m not the biggest fan of, and I think a lot of people aren’t. If it aligns with my moral values, I feel like I’m representing it. Just because I’m wearing the flag doesn’t mean I represent everything that’s going on in the U.S.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Olympic Skier Mikaela Shiffrin on Competing for Team USA Amid Political Turmoil in America: ‘There’s a Lot of Hardship in the World’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/GettyImages-2260395923.jpg?crop=0px%2C329px%2C5266px%2C2962px&resize=1000%2C563"
      ],
      "datePublished": "2026-02-08T00:42:21.000Z",
      "dateModified": "2026-02-08T00:42:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Savannah Guthrie Says ‘We Will Pay’ for Return of 84-Year-Old Mother Nancy: ‘This Is the Only Way We Will Have Peace’",
    "url": "https://variety.com/2026/tv/news/savannah-guthrie-will-pay-nancy-guthrie-return-1236655770/",
    "image": "https://variety.com/wp-content/uploads/2026/02/MixCollage-07-Feb-2026-03-42-PM-1568.jpg?crop=0px%2C63px%2C1200px%2C675px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-02-07T23:40:39.000Z",
    "description": "\n\tSavannah Guthrie took to Instagram on Saturday afternoon to share another message with her mother’s kidnapper, this time saying she and her family w",
    "body": "\n\tSavannah Guthrie took to Instagram on Saturday afternoon to share another message with her mother’s kidnapper, this time saying she and her family will pay for Nancy Guthrie‘s return.\n\n\t“We received your message, and we understand,” Guthrie said in the video, flanked by her siblings Annie and Camron. “We beg you now to return our mother to us so that we can celebrate with her. This is the only way we will have peace. This is very valuable to us, and we will pay.”\n\t\n\n\tNancy Guthrie went missing from her Arizona residence on Jan. 31, and on Monday, the Pima County Sheriff’s Office announced that the disappearance was being treated as a crime. Sheriff Chris Nanos told CBS that investigators found “very concerning” evidence in her home.\n\n\n\t“I believe she was abducted, yes,” he said. “She didn’t walk from there. She didn’t go willingly.”\n\n\tOn Thursday, the FBI, which is also investigating the suspected kidnapping of Nancy Guthrie, put up a $50,000 reward for information leading to her recovery, “and/or the arrest and conviction of anyone involved in her disappearance.”\n\n\t“The FBI has agents, analysts and professional staff employees working day and night with our partners at the sheriff’s department,” FBI Special Agent in Charge Heith Janke said during a press briefing. “We have deployed additional intelligence and agents from our Phoenix office.”\n\n\tNanos, who also spoke during the briefing, said that authorities “have not identified a suspect or a person of interest in this case.” He also shut down claims that force entry was used to gain entrance to Nancy Guthrie’s home.\n\t\n\n\tDonald Trump, who ordered “all federal law enforcement” to help search for Nancy Guthrie, told reporters on Air Force One Friday night that the investigation is going “very well” and “definitive” answers as to what happened could be released in the coming days.\n\n\t“I think we’re doing very well in that regard,” he said. “You’re probably surprised to hear that. I think we’re doing very well. Very well meaning we have some clues, I think, that are very strong, and I think we could have some answers coming up fairly soon.”\n\n\tOn Wednesday evening, Savannah Guthrie posted an emotional video to her Instagram in which she and her two siblings, Annie and Camron, pleaded with their mother’s kidnapper to give them a sign of life.\n\n\t“She’s 84 years old. Her health, her heart, is fragile. She lives in constant pain. She is without any medicine. She needs it to survive, and she needs it not to suffer,” Guthrie said. “We, too, have heard the reports about a ransom letter in the media. As a family, we are doing everything that we can. We are ready to talk. However, we live in a world where voices and images are easily manipulated. We need to know without a doubt that she is alive and that you have her. We want to hear from you, and we are ready to listen.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Savannah Guthrie Says ‘We Will Pay’ for Return of 84-Year-Old Mother Nancy: ‘This Is the Only Way We Will Have Peace’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/MixCollage-07-Feb-2026-03-42-PM-1568.jpg?crop=0px%2C63px%2C1200px%2C675px&resize=1000%2C563"
      ],
      "datePublished": "2026-02-07T23:40:39.000Z",
      "dateModified": "2026-02-07T23:40:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Winter Olympics Opening Ceremony Attracts 21.4 Million Viewers on NBC and Peacock According to Preliminary Ratings",
    "url": "https://variety.com/2026/tv/news/winter-olympics-opening-ceremony-ratings-nbc-peacock-1236655889/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Winter-Olympics-opening-ceremony.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-07T23:54:58.000Z",
    "description": "\n\tThe Milan Cortina Winter Olympics kicked off with an opening ceremony on Friday that averaged 21.4 million viewers on NBC and Peacock, according to ",
    "body": "\n\tThe Milan Cortina Winter Olympics kicked off with an opening ceremony on Friday that averaged 21.4 million viewers on NBC and Peacock, according to preliminary Nielsen ratings and digital data from Adobe Analytics. \n\n\tThe official Nielsen Big Data + Panel viewership will be posted on Tuesday. But for now, NBCUniversal is reporting that this year’s Winter Olympics opening ceremony was up 34% from the one that kicked off the 2022 Beijing Winter Olympics — which posted 15.9 million using similar methodology.\n\t\n\n\tCoverage of the ceremony, live from Italy, aired in the afternoon (“Milan Prime”) followed by a primetime presentation.\n\n\n\t“We are off to a strong start with Friday’s captivating Opening Ceremony highlighted by the historic cities, the scenic mountain areas, and the Parade of Athletes,” NBC Sports prexy Rick Cordella said in a statement. “The Opening Ceremony audience exceeded our expectations, and we can’t wait for the next two weeks of competition.”\n\n\tAccording to NBCU, the opening ceremony averaged more than 3 million on Peacock, making it the most streamed for a Winter Games. The company also noted that “Milan Cortina Olympics streaming consumption across NBCUniversal platforms exceeded 700 million minutes through Friday – most ever for a Winter Games and 2.5 times greater than the 2022 Beijing Olympics through the comparable time frame.”\n\n\tThe opening ceremony also gave Friday’s episode of “The Tonight Show Starring Jimmy Fallon” a boost, as the talker posted its most-watched telecast since Thanksgiving (2.3 million viewers).\n\t\n\n\tOn Sunday, the Winter Olympics will get another big ratings boost, as NBC is once again opting not to take advantage of the massive Super Bowl lead-out to promote a new, returning or pre-existing entertainment program. Instead, just like the network did in 2022, it will instead go right back to coverage of the Winter Olympics.\n\n\tAfter the Vince Lombardi trophy is hoisted at the end of Super Bowl LX on Sunday, Feb. 8, NBC Sports will segue to the Milan Cortina Winter Olympics primetime show, “Primetime in Milan,” at approximately 10:45 p.m. ET — including the women’s downhill competition (which will include Lindsey Vonn going for the gold as part of her comeback) and team figure skating.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Winter Olympics Opening Ceremony Attracts 21.4 Million Viewers on NBC and Peacock According to Preliminary Ratings",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Winter-Olympics-opening-ceremony.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-07T23:54:58.000Z",
      "dateModified": "2026-02-07T23:54:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Caleb McLaughlin on Wanting to Play Miles Morales and Moving On From ‘Stranger Things’",
    "url": "https://variety.com/2026/film/columns/caleb-mclaughlin-miles-morales-spider-man-stranger-things-1236655839/",
    "image": "https://variety.com/wp-content/uploads/2026/02/GettyImages-2259689282.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-07T22:05:12.000Z",
    "description": "\n\tYou have to love Caleb McLaughlin for being so public about wanting to play Miles Morales.\n\n\t“I would love to play Miles,” he told me Friday night a",
    "body": "\n\tYou have to love Caleb McLaughlin for being so public about wanting to play Miles Morales.\n\n\t“I would love to play Miles,” he told me Friday night at the premiere of his new animated movie “Goat.”\n\n\tThe “Stranger Things” star has been a fan favorite to slip into the Spider-Man suit as Miles. \n\n\t“I think Miles represents something bigger than myself; it represents something bigger than most people,” he said. “Also, being from New York [McLaughlin grew up in the Bronx] and then just seeing the “Spider-Verse” story, I just feel it’s really, really connected and I feel like a lot of people understand what that means.”\n\t\n\n\tMiles was most recently voiced by Shameik Moore in the animated “Spider-Verse” franchise. “Sinners” star Hailee Steinfeld plays Gwen Stacy. A third and final “Spider-Verse” is set for release in June 2027.\n\n\tMcLaughlin’s latest comments come just about a month after speculation that he’s been cast as Miles hit a fever pitch after the actor posted videos on social media of his gymnastics training.\n\n\tHe recently ended his run as Lucas in “Stranger Things” with the show’s fifth and final season premiering on New Year’s Eve. “It’s a blessing,” he said. “Looking back on the past, I’m truly grateful for everything that I went through, people that I’ve met along the way and all the friends that I have. I am very grateful. I think life after the show is a new chapter and I’m happy to start it with ‘Goat.’”\n\n\t“Goat” marks McLaughlin’s first major role since “Stranger Things.”\n\n\t“Goat” tells the story of Will, a goat who gets a shot at playing a professional roarball, a basketball-like sport featuring the world’s biggest and strongest animals. The cast also includes Gabrielle Union, Stephen Curry (who is also producer on the film), Jennifer Hudson, Nicola Coughlan, Nick Kroll, David Harbour, Jenifer Lewis, Aaron Pierre, Patton Oswalt, Andrew Santino, Bobby Lee, Eduardo Franco, Sherry Cola and Jelly Roll. \n\t\n\n\t“Goat” is in theaters on Feb. 13.\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Caleb McLaughlin on Wanting to Play Miles Morales and Moving On From ‘Stranger Things’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/GettyImages-2259689282.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-07T22:05:12.000Z",
      "dateModified": "2026-02-07T22:05:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sam Raimi Says Rachel McAdams Was ‘Underutilized’ in ‘Doctor Strange’: ‘Promised Myself That I Would Work With Her Again’",
    "url": "https://variety.com/2026/film/news/sam-raimi-rachel-mcadams-doctor-strange-send-help-1236655826/",
    "image": "https://variety.com/wp-content/uploads/2026/01/MCDSEHE_H3009-e1769610275829.jpg?crop=0px%2C19px%2C1000px%2C562px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-02-07T21:05:33.000Z",
    "description": "\n\tSam Raimi told Total Film that Rachel McAdams was “underutilized” in his 2022 MCU sequel “Doctor Strange in the Multiverse of Madness,” and after th",
    "body": "\n\tSam Raimi told Total Film that Rachel McAdams was “underutilized” in his 2022 MCU sequel “Doctor Strange in the Multiverse of Madness,” and after that movie, he “promised” himself he would work with her again. This pledge led to Raimi casting McAdams in his latest comedy thriller, “Send Help.”\n\n\t“First, she was the perfect person because she’s such a brilliant actress,” Raimi said. “I had a chance to work with her on my last film and saw how talented she was and actually underutilized, and I promised myself that I would work with her again. And then this film came up, and her warmth is wonderful.”\n\t\n\n\tHe added, “The fact that she has not really played a dark, terrible villain before, [producer Zainab Azizi] is the one that told me this, really sets the audience up to be surprised.”\n\n\n\t“Send Help” follows an underutilized and undervalued employee (McAdams) and her younger, douchebag boss (Dylan O’Brien), whose toxic power dynamic is reversed when they become stranded on a remote island. Other cast members include Dennis Haysbert, Edyll Ismail, Xavier Samuel, Chris Pang and Thaneth Warakulnukroh. The film hails from Disney and 20th Century.\n\n\t“Because the movie’s focus is not a whodunnit, but what comes next, that’s what really the movie wants to do to the audience,” Raimi concluded. “They don’t know what’s right around the corner. It turns left when they think it’s gonna turn right, that was an important factor, that she, this good person that we know and love, becomes this terrible villain.”\n\n\t“Send Help” is currently in theaters nationwide.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sam Raimi Says Rachel McAdams Was ‘Underutilized’ in ‘Doctor Strange’: ‘Promised Myself That I Would Work With Her Again’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/MCDSEHE_H3009-e1769610275829.jpg?crop=0px%2C19px%2C1000px%2C562px&resize=1000%2C563"
      ],
      "datePublished": "2026-02-07T21:05:33.000Z",
      "dateModified": "2026-02-07T21:05:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Halle Berry Is ‘Sad’ Storm Isn’t in ‘Avengers: Doomsday’ But Would Return to the MCU ‘In a Heartbeat’: ‘There Are Other Rounds’",
    "url": "https://variety.com/2026/film/news/halle-berry-storm-avengers-doomsday-xmen-1236655785/",
    "image": "https://variety.com/wp-content/uploads/2026/02/MCDXMEN_FE174.jpg?crop=0px%2C219px%2C3200px%2C1800px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-02-07T19:59:09.000Z",
    "description": "\n\tHalle Berry might not be reprising her role as the weather-controlling Storm in the forthcoming “Avengers: Doomsday,” but don’t count the Oscar-winn",
    "body": "\n\tHalle Berry might not be reprising her role as the weather-controlling Storm in the forthcoming “Avengers: Doomsday,” but don’t count the Oscar-winning actor out of a future Marvel reunion. \n\n\t“While I’m sad I won’t be in ‘Doomsday’ this round, there are other rounds,” Berry told ScreenRant while promoting her new movie “Crime 101.” “And I would do that in a heartbeat.”\n\n\n\tBerry also noted how proud she is to have been a part of the X-Men world: “I think the whole world of the X-Men and being mutants and outcasts. [They’ve] been movies that I’ve been proud to have my children watch. They have so much to say that I thought has been really important, especially for my children as they’ve grown. So they’re beloved.” \n\t\n\n\tThe “Catwoman” actor played Storm from 2000 to 2014, appearing in “X-Men,” “X2: X-Men United,” “X-Men: The Last Stand” and “X-Men: Days of Future Past.”\n\n\t“Storm is a very special character to me,” Berry continued. “I’ve been so blessed [that I’ve] gotten to play her.”\n\n\tWhile Storm won’t be returning, a long list of names from the “X-Men” universe are set to reprise their roles in “Avengers: Doomsday,” including Patrick Stewart, Ian McKellen, Kelsey Grammer, Alan Cumming, James Marsden, Channing Tatum and Rebecca Romijn. \n\n\tAlso set to appear are Chris Hemsworth, Anthony Mackie, Danny Ramirez, Sebastian Stan, Paul Rudd, Tom Hiddleston, Letitia Wright, Winston Duke, Simu Liu, Pedro Pascal, Vanessa Kirby, Joseph Quinn, Ebon Moss-Bachrach, Florence Pugh, David Harbour, Wyatt Russell, Hannah John-Kamen and Lewis Pullman. Robert Downey Jr. will also be in “Doomsday,” though not as Tony Stark — he’ll instead play Doctor Doom, a villain. \n\t\n\n\tDirected by MCU regulars Anthony and Joe Russo, “Avengers: Doomsday” is set to release on Dec. 18.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Halle Berry Is ‘Sad’ Storm Isn’t in ‘Avengers: Doomsday’ But Would Return to the MCU ‘In a Heartbeat’: ‘There Are Other Rounds’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/MCDXMEN_FE174.jpg?crop=0px%2C219px%2C3200px%2C1800px&resize=1000%2C563"
      ],
      "datePublished": "2026-02-07T19:59:09.000Z",
      "dateModified": "2026-02-07T19:59:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Brad Arnold, Lead Singer of 3 Doors Down, Dies at 47",
    "url": "https://variety.com/2026/music/news/brad-arnold-dead-3-doors-down-kryptonite-1236655787/",
    "image": "https://variety.com/wp-content/uploads/2026/02/MixCollage-07-Feb-2026-11-15-AM-3768.jpg?crop=0px%2C14px%2C1200px%2C675px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-02-07T19:26:05.000Z",
    "description": "\n\tBrad Arnold, the lead singer and founding member of the American rock band 3 Doors Down, died on Saturday after a battle with cancer. He was 47.\n\n\tA",
    "body": "\n\tBrad Arnold, the lead singer and founding member of the American rock band 3 Doors Down, died on Saturday after a battle with cancer. He was 47.\n\n\tA rep for Arnold said he died peacefully in his sleep, surrounded by his wife and family.\n\n\tArnold, the original drummer and vocalist of 3 Doors Down, helped form the band in 1996 in Escatawpa, Miss. He was responsible for writing and producing the 2000 hit “Kryptonite,” one of the group’s most enduring tracks. Arnold famously wrote the lyrics for the song when he was just 15 years old.\n\t\n\n\tIn May of 2025, Arnold revealed in a social media video that he had been diagnosed with Stage 4 kidney cancer.\n\n\n\t“Hey everybody, it’s Brad from 3 Doors Down. I hope you’re having a great day today,” he said in the video. “Got some not so good news for you today. So, I’d been sick a couple of weeks ago and then went to the hospital and got checked out, and actually got the diagnosis that I had a clear cell renal cell carcinoma that had metastasized into my lung. And it’s stage four, and that’s not real good.”\n\n\tHe added, “But you know what? “We serve a mighty God, and he can overcome anything. So I have no fear. I really sincerely am not scared of it at all. But it is gonna force us to cancel our tour this summer. And we’re sorry for that. And I’d love for you to lift me up in prayer every chance you get. And Ithink it is time for me to go listen to ‘It’s Not My Time’ a little bit, right?”\n\n\tArnold is survived by his wife, Jennifer\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Brad Arnold, Lead Singer of 3 Doors Down, Dies at 47",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/MixCollage-07-Feb-2026-11-15-AM-3768.jpg?crop=0px%2C14px%2C1200px%2C675px&resize=1000%2C563"
      ],
      "datePublished": "2026-02-07T19:26:05.000Z",
      "dateModified": "2026-02-07T19:26:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘One Battle After Another’s’ Michael Bauman Wins British Society of Cinematographers Feature Film Award",
    "url": "https://variety.com/2026/artisans/news/one-battle-wins-british-society-of-cinematographers-2026-1236655868/",
    "image": "https://variety.com/wp-content/uploads/2024/12/One-Battle-After-Another-Editing.jpg?w=900&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-07T23:04:39.000Z",
    "description": "\n\t“One Battle After Another” cinematographer Michael Bauman has won the British Society of Cinematographers Award for best cinematography in a feature",
    "body": "\n\t“One Battle After Another” cinematographer Michael Bauman has won the British Society of Cinematographers Award for best cinematography in a feature film.\n\n\tThis is Bauman’s first win and nomination at the BSC Awards. He triumphed over “Die My Love” (Seamus McGarvey), “Marty Supreme” (Darius Khondji), “Sinners” (Autumn Arkapaw Arkapaw) and “Frankenstein” (Dan Lausten).\n\n\n\tWhen Bauman joined Variety for Inside the Frame, he said Anderson wanted something in the “vein of ‘70s cinema,” pointing to films like “The French Connection” and “The Last Detail.” He explained, “A lot of the movies in that period that had a certain stylistic roughness to it that he really felt was essential in telling this story. He also really wanted to shoot the movie in VistaVision.”\n\t\n\n\tIn the Television Drama (UK Terrestrial) category, Ollie Downey won for his work on the BBC drama “Reunion,” and in the Television Drama (International/Streaming) category, Suzie Lavelle won her second award for her photography of the Apple TV series “Severance.”\n\n\tIn the Music Video category, cinematographer Jake Gabbay followed on his victory at Camerimage by taking home the Cinematography in a Music Video Award for “Chains and Whips” from Kendrick Lamar, Pusha T and Malice.\n\n\tThe Operators Award, presented by the British Society of Cinematographers, Association of Camera Operators and Guild of British Camera Technicians named Danny Bishop Assoc the winner for his operating on the Netflix film “Ballad of a Small Player” and in the Television category Peter Robertson Assoc and Emiliano Topai were victorious for their work on the series “Mussolini: Son of the Century.”\n\t\n\n\tThe BSC Short Film Awards were presented to Linda Wu, Christopher Hudson and Theo Hughes for their respective films.\n\n\tThe evening was filled with emotional and humorous moments as the BSC presented its highest honor, the BSC Lifetime Achievement Award, to Remi Adefarasin.\n\n\tAdefarasin’s career began at the BBC, where he worked his way up through the ranks until reaching the role of Cinematographer – shooting while he was there some of the most iconic TV movies, including work by Mike Leigh, Adrian Shergold and Anthony Minghella. His work as a Feature Film Cinematographer led him to being Oscar-nominated in 1998 for “Elizabeth,” in so doing becoming the first Black Cinematographer to be nominated in that category. He was Emmy-nominated for his work on the Miniseries “Band of Brothers” and “The Pacific. “\n\n\tJohn de Borman received the BSC John Alcott Memorial Award for his work for the BSC, and focus puller Hilda Sealy was awarded the Special Achievement Award for her work toward transforming the industry into a more inclusive space. The BSC Bert Easey Technical Award was awarded to Optical Support.\n\n\tPresident of the British Society of Cinematographers, Oliver Stapleton said, “Tonight we celebrated 70 years of the British Society of Cinematographers Awards, a moment to reflect on the previous winners from ‘Lawrence of Arabia’ to ‘Schindler’s List,’ but also to celebrate the addition of ‘One Battle After Another’ to that list. My congratulations to all the winners and recipients tonight, your work is a reminder of just how vibrant and creative our industry still is.”\n\n\tThe awards were held at the Grosvenor House Hotel in London and hosted by Edith Bowman. The BSC wishes to thank all our sponsors who have helped make the evening happen.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘One Battle After Another’s’ Michael Bauman Wins British Society of Cinematographers Feature Film Award",
      "image": [
        "https://variety.com/wp-content/uploads/2024/12/One-Battle-After-Another-Editing.jpg?w=900&h=563&crop=1"
      ],
      "datePublished": "2026-02-07T23:04:39.000Z",
      "dateModified": "2026-02-07T23:04:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Brandi Carlile on What It Means to Sing ‘America the Beautiful’ at the Super Bowl in a Time of Turmoil: It’s a Song of ‘Fragile Hope, for Where America Could Be’",
    "url": "https://variety.com/2026/music/news/brandi-carlile-america-the-beautiful-super-bowl-interview-1236655795/",
    "image": "https://variety.com/wp-content/uploads/2026/02/GettyImages-2260092639_a98a9a-e1770493074638.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-07T20:50:47.000Z",
    "description": "\n\tNo “Joke”: Brandi Carlile is one of the few vocalists out there with so powerhouse of a voice, she could almost be considered overqualified to sing ",
    "body": "\n\tNo “Joke”: Brandi Carlile is one of the few vocalists out there with so powerhouse of a voice, she could almost be considered overqualified to sing “America the Beautiful.” That’s what she’ll be doing just prior to Super Bowl LX kicking off on Sunday, and although it is not always considered to be as demanding as its patriotic twin, “The Star Spangled Banner,” Carlile promises that she’ll be performing it at the upper end of her range, which may mean that this seemingly gentler song will have its own bombs bursting in air, musically speaking.\n\t\n\n\tWhat does it mean to her to be singing “America the Beautiful,” though, at a time where not everyone in the country is thinking beautiful thoughts about the state of the nation? Carlile has thought plenty about that, as you’d expect from someone with such a history of activism. It means something to her to be on the biggest stage the world has to offer as a representative of the queer community, and she’s also mindful that the historic song itself was co-written by a woman believed by many to be gay. Most of all, she is tuned in to the lyrics, which, if you’ve ever really read through them all, are more aspirational than triumphal. While “America the Beautiful” may never get officially adopted as the national anthem, as some have suggested over the years, i’s a song anyone who believes in the promise of America could, and maybe should, sing.\n\n\n\tVariety spoke with Carlile on Friday as she prepared for her worldwide TV moment Sunday… with scant time to be too focused on a global arena tour that begins just two days later.\n\t\n\n\tOn the most practical level: Performing at the Super Bowl, with an audience of over 125 million viewers, is scary to a lot of people. But if you sing something as demanding as “The Joke” every night without fail, you probably can’t be that worried about hitting the notes on “America the Beautiful,” can you?\n\n\tNo, I’m a little worried about it. I put it in a key that’s right at the ceiling there for me, and so I’m gonna come out swinging.\n\n\tWhat kind of arrangement are you giving it, and who’ll accompany you?\n\n\tIt’s going to be me and SistaStrings. So it’s gonna be sort of a melodically centered version, instead of a rhythmically centered version.\n\n\tHave you sung “America the Beautiful” before? And for that matter, going through the patriotic pantheon, have you ever sung “The Star Spangled Banner”?\n\n\tYeah, I sang “The Star Spangled Banner” a couple of times in high school, and I sang it for the Seattle Storm a couple of times early on when I was really young, and then I sang it once for the Seahawks in one really, really big game [in 2015]. That is a really, really hard song. So I’ve sung that one before. But I’ve never sung “America the Beautiful.” I’ve been hearing it my whole life, but I do remember when I first sort of clocked it. I was invited to the White House when Obama was president to sing on the lawn on the 4th of July, and Brandon Flowers [frontman of the Killers] sang it. I just remember hearing it that way, as a modern song, and I was like, “Oh, that is a beautiful song” — beautiful melodically, and lyrically beautiful. Other than that, my exposure to it has been that the definitive versions of the song have been Ray Charles and Whitney Houston, and those versions can’t be touched.\n\n\tMany people hear the imagery in the first verse, which is what is usually performed, and think, “Oh, it’s a scenery song,” first and foremost. And there is that aspect — the lyricist, Katharine Lee Bates, had recently been to Pikes Peak. But it’s really a pretty heavy song, in a lot of ways, when you listen to or read through the whole thing. It says, about America, “God mend thine every flaw…”\n\n\t“…Confirm thy soul in self-control / Thy liberty in law”! Yeah. I don’t want to put words in her mouth; she was beyond brilliant. But it almost feels almost like she was feeling the way about the country when she wrote it that I’m feeling today singing it. Just this fragile hope, love and belief in where it could be, and acknowledging where it’s been, and acknowledging that we’re not there yet. And that’s what I think is so American about that song — that total celebration is not in order; that our prayers are still in order. But that the only way to move forward is with belief.\n\t\n\n\tThere might be a different way that we all sort of receive the song, in calmer times. But even without hearing every verse that was written, there may be something about it that, in a time of trouble and division, will be moving for people who are really tuned into it. You’re feeling that.\n\n\tYeah. And I think if we’re gonna save this country as a people, we have to be reminded on some level that deep down we love it.\n\n\n\n\t\n\n\t\t\t\t\tBrandi Carlile speaks onstage during the Super Bowl LX Pregame & Apple Music Super Bowl LX Halftime Show Press Conference at Moscone Center West on February 5, 2026 in San Francisco, California. \n\t\t\t\t\t\t\t\t\tGetty Images\n\t\n\n\n\n\tThere’s obviously controversy around the Super Bowl music this year. Some MAGA people are unhappy enough about Bad Bunny to be having a alternative halftime show. I don’t know if you’ve experienced any controversy personally, but I can sort of imagine that, on the one end, there might be at least a few people out there on the MAGA end of things questioning what it means to be having a gay person sing a patriotic song this year. And then on other end of the scale, there might be some of your most progressive fans wondering if their favorite singer should participating in anything patriotic right now, when the nation is troubled. Basically, there is some baggage connected to this year’s Super Bowl.\n\n\tThere is, you’re right.\n\n\tBut, obviously you’re feeling very proud of being there, and you’ve said that you feel like queer representation matters in a moment like this — the biggest show on earth, basically.\n\n\tYeah. And I have my own moral code, my own moral imperative, that I have to answer to at the end of the day, as a wife and mother, and I believe in my ability and responsibility to do this, and that’s why I’m here. And the throughline to being queer and being a representative of a marginalized community and being put on the largest stage in America to acknowledge the fraught and tender hope that this country is based on, it’s something you don’t say no to. You do it.\n\n\tIn researching the song, I know you took an interest in Katharine Lee Bates, who was a social activist and very involved in the world in that way, as well as being a poet. And people have speculated, “Was she gay?” or not, and there may never be a definitive answer to that…\n\t\n\n\tClearly gay.\n\n\tOkay.\n\n\tTotally gay! [Laughs.]\n\n\tKnowing about her and what she stood for and, and how interesting her life was, that’s something that’s obviously not going to be known to most of America. There won’t be factoids appearing on screen like it’s a “VH1 Pop-Up Video.” But it’s something that must help inform why you love the song, or at least it means something to you.\n\n\tYeah, it absolutely does. You know, I feel called to a long line of contemplative and struggling people. I feel motivated by the fact that she was very likely gay, and a woman relying on her intellect in a time when that was difficult for women to do so, and living with a partner who was doing the same thing. And still choosing — even in that total oppression; even not being able to be married; even not even being able to say that she was gay, or to be elevated to the heights that she probably deserved to be elevated to in politics — and, during those times, to still love America and to still believe that it could get to a place of goodness. I won’t say greatness, because that feels a little, you know, patriarchal. But goodness. And I believe the same thing. And I have a sliver of the struggle ahead of and behind me that she was facing in her day.\n\n\tSo, you know, this is an interesting song. And it’s an interesting decision that I’m making. I definitely don’t want to be seen as neoliberal or as someone who’s glossing over the problems that we have in this country. I want to be seen as one of the people that’s helping.\n\n\tYour fans likely understand you are not taking lightly what the mood of the nation is right now, or at least of different parts of the nation.\n\n\tNo. But I’m not gonna waste my time in the pit fights. My activism isn’t gonna be in the comments section. And, you know, I may not be everyone’s kind of activist, but like I said, I have my own moral imperative that I have to go to sleep with at night.\n\n\n\n\t\n\n\t\t\t\t\tCharlie Puth, Coco Jones and Brandi Carlile at the Super Bowl LX Pregame + Apple Music Halftime Show Press Conference on February 05, 2026 in San Francisco, California.\n\t\t\t\t\t\t\t\t\tChristopher Polk/Variety\n\t\n\n\n\n\tAnything to say about the bill overall? It’s such an eclectic, interesting collection of people, between you, Bad Bunny, Coco Jones and Charlie Puth. And, as previously stated, controversial in some ways.\n\t\n\n\tAnd it shouldn’t be. It shouldn’t be. It looks exactly like America! It looks exactly like the United States. It looks like the players on the field, and it looks like the people that are watching the sport. And that’s how it should look, with a lot of demographics represented, and a lot of enthusiastic people excited to celebrate a huge game on a unifying day. And I think that the folks that put together the entertainment portion of the Super Bowl this year just did a bang-up job. It’s really good. Bad Bunny’s incredible —an incredible spirit and performer. It’s gonna be a fabulous halftime show.\n\n\tOn the most trivial level, you were approaching this not just thinking of social statements, or what songs and performers in the mix, but as a football fan.\n\n\tMaybe more so than ever.\n\n\tYour hometown rooting interest is well-established. You’re not going to wear a Seahawks jersey while you sing, are you? You probably couldn’t get away with that?\n\n\tYou’re not allowed to. But I’ll have a Seahawks jersey on in my heart. You know, people say to me, “Oh, isn’t it complicated and difficult to get involved in something like the Super Bowl in these times?” And there’s a lot of validity to that observation. I don’t disagree. But it does get a little easier when it’s your team. [Laughs.] You’d be really surprised, right?\n\n\tAfter it’s all over, you get to go take it easy and relax for a few weeks, right? Sorry, that’s a joke. Your first arena tour kicks off two nights after the Super Bowl, in Philadelphia. We saw a preview of the tour set at your Girls Just Wanna Weekend festival in mid-January, and it seemed extremely well-rehearsed, so you probably don’t have jitters about going directly into that in just a few days.\n\n\tI’m so glad it came off as well-rehearsed to you. That was our first one, and then we had some rehearsals after that, and I think it’s even gotten better. So, yeah, I’m really anxious and excited to get out on the road. I don’t think I will relax until I get the first show or two under my belt.\n\n\tThe 1911 lyrics for “America the Beautiful”:\n\n\tO beautiful for spacious skies,For amber waves of grain,For purple mountain majestiesAbove the fruited plain!America! America!God shed His grace on theeAnd crown thy good with brotherhoodFrom sea to shining sea!\n\t\n\n\tO beautiful for pilgrim feet,Whose stern, impassioned stressA thoroughfare for freedom beatAcross the wilderness!America! America!God mend thine every flaw,Confirm thy soul in self-control,Thy liberty in law!\n\n\tO beautiful for heroes provedIn liberating strife,Who more than self their country lovedAnd mercy more than life!America! America!May God thy gold refine,Till all success be nobleness,And every gain divine!\n\n\tO beautiful for patriot dreamThat sees beyond the yearsThine alabaster cities gleamUndimmed by human tears!America! America!God shed His grace on theeAnd crown thy good with brotherhoodFrom sea to shining sea!\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Brandi Carlile on What It Means to Sing ‘America the Beautiful’ at the Super Bowl in a Time of Turmoil: It’s a Song of ‘Fragile Hope, for Where America Could Be’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/GettyImages-2260092639_a98a9a-e1770493074638.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-07T20:50:47.000Z",
      "dateModified": "2026-02-07T20:50:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Robert F. Kennedy Jr. Went Dinosaur Bone Hunting with Jeffrey Epstein, Ghislaine Maxwell",
    "url": "https://www.tmz.com/2026/02/07/robert-f-kennedy-jeffrey-epstein-ghislaine-maxwell-went-dinosaur-bone-hunting/",
    "image": "https://imagez.tmz.com/image/c6/16by9/2026/02/07/c65b457f0d0b4bcf9f012759d4df8e2f_xl.png",
    "tag": "Entertainment",
    "date": "2026-02-08T00:28:25.000Z",
    "description": "\n    \n                    \n                          RFK Jr.\n                          Epstein & I Looked For T-Rexs Together!!!\n                     ",
    "body": "\n    \n                    \n                          RFK Jr.\n                          Epstein & I Looked For T-Rexs Together!!!\n                      \n                  \n                                                                        Published \n                              February 7, 2026\n                            4:28 PM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Robert F. Kennedy Jr. certainly has some interesting hobbies ... including dinosaur bone hunting -- which he allegedly did with Jeffrey Epstein back in the day.\n      \n    \n          Among the numerous documents released by the Department of Justice related to the notorious pedophile recently were emails sent between Epstein and Ghislaine Maxwell ... in which he said he went dinosaur and fossile hunting with renowned paleontologist Jack Horner on a ranch.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Maxwell then asked Epstein, \"Didn't we go fossil hunting with him and Bobby Kennedy in N Dakota?\" to which he replied yes.\n      \n\n          It's worth noting, this isn't the first we've heard about the trip ... Maxwell mentioned it when the DOJ interviewed her back in July -- though she said she doesn't remember Kennedy ever flying with them.\n      \n    \n          Kennedy also previously admitted he'd been on the trip with Epstein ... revealing on Fox News in 2023 he flew on Epstein's jet three times -- including once with his then-wife Mary Richardson Kennedy and their four children to go \"fossil hunting for a weekend.\" He made it clear he never flew on the jet without his family.\n      \n    \n          Kennedy is far from the only celebrity mentioned in the most recent release of the so-called \"Epstein Files\" ... with President Donald Trump, Jay-Z, Brett Ratner, Prince Andrew and more receiving mentions in the documents.\n      \n    \n          To be clear, Kennedy has not been accused of any wrongdoing in connection to Epstein ... he was just an excited excavator!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Jeffrey Epstein\n              \n                          \n                Robert F. Kennedy Jr.\n              \n                          \n                Ghislaine Maxwell\n              \n                          \n                Animals\n              \n                          \n                Crime\n              \n                          \n                Viral\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Robert F. Kennedy Jr. Went Dinosaur Bone Hunting with Jeffrey Epstein, Ghislaine Maxwell",
      "image": [
        "https://imagez.tmz.com/image/c6/16by9/2026/02/07/c65b457f0d0b4bcf9f012759d4df8e2f_xl.png"
      ],
      "datePublished": "2026-02-08T00:28:25.000Z",
      "dateModified": "2026-02-08T00:28:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bea Miller Hot Shots to Kick Off Her 27th Bday!",
    "url": "https://www.tmz.com/2026/02/07/bea-miller-hot-shots-birthday/",
    "image": "https://imagez.tmz.com/image/01/16by9/2026/02/03/0163e86053b24fa98815b9a0cf7ed291_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-07T20:00:05.000Z",
    "description": "\n    \n                    \n                          Bea Miller's\n                          Sultriest Snaps\n                          To Kick Off Her ",
    "body": "\n    \n                    \n                          Bea Miller's\n                          Sultriest Snaps\n                          To Kick Off Her 27th Birthday!\n                      \n      \n    \n      \n        \n              \n    \n    \n          Okay, folks, it's officially time to break out the champagne, because Bea Miller's turning 27 -- and you already know we're celebrating!\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          You know what goes great with some bubbly? A couple of Bea's hottest shots!\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Alright, now all you gotta do is sit back, relax, and take in the scenic views ... of Bea's smoking bod, of course!\n      \n      \n      \n          \n            \n              \n                \n                Share on Facebook\n              \n            \n            \n              \n                \n                Share on X\n              \n            \n                          \n                \n                  \n                \n              \n                      \n        \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Hotties & Bodies\n              \n                          \n                Hot Bodies\n              \n                          \n                Photo Galleries\n              \n                          \n                Music\n              \n                      \n        \n          \n  ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bea Miller Hot Shots to Kick Off Her 27th Bday!",
      "image": [
        "https://imagez.tmz.com/image/01/16by9/2026/02/03/0163e86053b24fa98815b9a0cf7ed291_xl.jpg"
      ],
      "datePublished": "2026-02-07T20:00:05.000Z",
      "dateModified": "2026-02-07T20:00:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Addison Rae Debuts New Hair Color in Sexy Social Media Post",
    "url": "https://www.tmz.com/2026/02/07/addison-rae-new-hair/",
    "image": "https://imagez.tmz.com/image/41/16by9/2026/02/07/416b369408824d129203a300d4c51ab9_xl.png",
    "tag": "Entertainment",
    "date": "2026-02-07T21:01:45.000Z",
    "description": "\n    \n                    \n                          Addison Rae\n                          My New Coloring is '2 Die 4!!!'\n                      \n    ",
    "body": "\n    \n                    \n                          Addison Rae\n                          My New Coloring is '2 Die 4!!!'\n                      \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Addison Rae's new hair color is certainly putting the \"pop\" in \"pop star\" ... with her style catching eyes all over social media.\n      \n    \n          The singer-songwriter shared a sizzling pic of her new look to Instagram Saturday morning ... throwing a sultry glance over her shoulder while wearing a tight black leather dress, which revealed a pink garter wrapped around her left thigh.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          She added a little more color to the outfit with her hair now boasting bright red coloring spread throughout it ... making a fiery statement in the pic.\n      \n\n          She simply captioned the snap, \"🔥🐎.\"\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Worth noting ... Addison's new look just changed this week. She attended the 68th Grammy Awards on Sunday -- no trace of the Kool-Aid colored hair yet.\n      \n    \n          The Recording Academy nominated Addison for Best New Artist at this year's ceremony ... but she went home empty-handed. Olivia Dean took home the trophy instead.\n      \n    \n      \n        \n              \n    \n    \n          She might not have won a Grammy ... but she definitely deserves a gold medal for her smokin' hot new look!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Addison Rae\n              \n                          \n                Social Media\n              \n                          \n                Hot Bodies\n              \n                          \n                Viral\n              \n                          \n                Music\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Addison Rae Debuts New Hair Color in Sexy Social Media Post",
      "image": [
        "https://imagez.tmz.com/image/41/16by9/2026/02/07/416b369408824d129203a300d4c51ab9_xl.png"
      ],
      "datePublished": "2026-02-07T21:01:45.000Z",
      "dateModified": "2026-02-07T21:01:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Skater Apparel for Former Rats and Wannabes",
    "url": "https://www.tmz.com/2026/02/07/skater-gear-former-rats-wannabes/",
    "image": "https://imagez.tmz.com/image/68/16by9/2026/01/30/6844a5236e8142f398a239fdcb1ffe05_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-07T08:05:18.000Z",
    "description": "\n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          TMZ may colle",
    "body": "\n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          TMZ may collect a share of sales or other compensation from links on this page.\n      \n    \n          Feeling nostalgic for your days of effortlessly kickflipping ... or just always wanted that skater vibe but never got beyond cruising?\n      \n    \n          Either way, our best advice is to skip the ankle pain and just be a poser.\n      \n    \n          Check out our guide, below, for ex-ratz and forever wannabes.\n      \n    \n          TMZ Cheatsheet: Skater 'Fits\n  \n\n          Etnies Barge LS Low-Top Skate Shoes: $52Thrasher Hoodie: $70Vans Knu Skool: $80Vans Classic Crew Socks: $15Volcom Web Belt: $18Volcom Loose Fit Pants: $60Powell Peralta T-Shirt: $33\n      \n    \n              \n      Etnies Barge LS Low-Top Skate Shoes\n      \n        \n    \n                    \n                          \n                                  \n      \n        \n    \n          Remember the good ol' days when \"Viva La Bam\" was playing on repeat and all you wanted to do was see how many brightly colored flannels you could rock? If you do, these Etnies are the perfect shoes to tie your look together.\n      \n    \n          These kicks get right to the point ... midnight black, low-top, and ready to take on all the tre flips you can throw at them ... that is, if you can pull a tre flip off in the first place.\n      \n    \n              \n      Thrasher Hoodie\n      \n        \n    \n                    \n                          \n                                  \n      \n        \n    \n          If there's a ranking of the most iconic pieces of outerwear for skaters out there, this Thrasher Hoodie's definitely near the top of the list ... oversized or slightly undersized, this thing works with pretty much any look.\n      \n    \n          It's simple, as elegant as skate gear can realistically get, and really gives off the whole \"yeah, I skate, so what?\" attitude in an unmistakable way ... by the way, RIP Jake Phelps.\n      \n    \n              \n      Vans Knu Skool Sneakers\n      \n        \n    \n                    \n                          \n                                  \n      \n        \n    \n          Vans Old Skools are a classic, there's no denying that -- but the Knu Skools give the tried-and-true formula loved by generations of skaters a modern update ... and plenty of cushion to boot.\n      \n    \n          Hey, the kids in Dogtown were all rocking Vans, and we think you're the right person to keep that legacy alive and push it forward ... in a fresh pair of Knu Skools, of course.\n      \n    \n              \n      Vans Classic Crew Socks\n      \n        \n    \n                    \n                          \n                                  \n      \n        \n    \n          Skating means a lot of wear and tear on your clothes, and since no one likes having itchy feet when you're trying to pull off tricks, you'll probably need to switch out your socks often ... we think these Vans crew socks get the job done every time.\n      \n    \n          They're soft, understated, and can get away as formal socks if you really need them to ... or show off the logo and make a statement, your call.\n      \n    \n              \n      Volcom Web Belt\n      \n        \n    \n                    \n                          \n                                  \n      \n        \n    \n          Practicing ollies means lots of jumping, and if your pants are just a bit too big, they might just end up on the floor the next time you get some air ... this Volcom web belt's the perfect fix for that problem.\n      \n    \n          No need for finding the right hole with this belt ... just slip the strap right on through the clamp and you're good to go!\n      \n    \n              \n      Volcom Loose Fit Pants\n      \n        \n    \n                    \n                          \n                                  \n      \n        \n    \n          There's an eternal struggle between baggy, baggier, and the baggiest types of pants as to which is best for skating ... we don't know the answer, but we do know these Volcom loose fit pants get the job done every time.\n      \n    \n          Roll them up, sag them a little, do whatever you want to 'em -- just know that every ollie you actually manage to land is gonna look all the more iconic in these.\n      \n    \n              \n      Powell Peralta T-Shirt\n      \n        \n    \n                    \n                          \n                                  \n      \n        \n    \n          Let's say you and skating go way, way back -- like \"The Bones Brigade Video Show\" back -- and you're looking for something to show off your old-school charms ... bingo, this Powell Peralta T-shirt's just what you need.\n      \n    \n          Just because something's classic doesn't mean it's old ... and we think this shirt's perfect for wiping off all that sweat you'll work up carving those empty pools!\n      \n    \n          All prices subject to change.\n      \n      ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Skater Apparel for Former Rats and Wannabes",
      "image": [
        "https://imagez.tmz.com/image/68/16by9/2026/01/30/6844a5236e8142f398a239fdcb1ffe05_xl.jpg"
      ],
      "datePublished": "2026-02-07T08:05:18.000Z",
      "dateModified": "2026-02-07T08:05:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Savannah Guthrie Tells Mother's Abductors Family Will Pay Ransom, on Video",
    "url": "https://www.tmz.com/2026/02/07/savannah-guthrie-tells-abductors-they-will-pay-ransom-on-video/",
    "image": "https://imagez.tmz.com/image/17/16by9/2026/02/07/17753774252d42848d2b370733ba0ab2_xl.png",
    "tag": "Entertainment",
    "date": "2026-02-07T23:37:57.000Z",
    "description": "\n    \n                    \n                          Savannah Guthrie\n                          'We Will Pay'\n                      \n                 ",
    "body": "\n    \n                    \n                          Savannah Guthrie\n                          'We Will Pay'\n                      \n                  \n                                                                        Published \n                              \n                February 7, 2026\n                \n                            3:37 PM PST\n                                                                      |\n                                                                Updated \n                                  February 7, 2026\n                                5:01 PM PST\n                                    \n      \n    \n      \n        \n                    \n                  \n      \n                    Instagram/@savannahguthrie\n          \n    \n          Savannah Guthrie and her family say they will pay the ransom for the return of their mother, Nancy.\n      \n    \n          The NBC anchor and her family released a video Saturday afternoon in which they directly address the people allegedly holding their mother captive ... saying they received their message, and they will pay the demanded dollar figure.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Nancy was last seen when a family member dropped her off at her Tucson home on Saturday, January 31. We and several other news outlets received an alleged ransom note earlier this week which contained two deadlines.\n      \n\n          The first deadline was Thursday at 5 PM which changed the alleged abductors demands. The second deadline is Monday, February 9.\n      \n    \n      \n        \n                    \n                  \n      \n                    Instagram / @savannahguthrie\n          \n    \n          Guthrie and her family previously asked for proof of life before they paid a ransom. It is unclear if they received such confirmation ... but, this second video seems to indicate they feel these abductors are serious.\n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          On Friday, our own Harvey Levin broke down how far Nancy may have been taken showing a geographic area where her abductors may be holding her based on clues in the alleged ransom note we received.\n      \n    \n          As we've told you ... Nancy is 84 years old and not in terrific health. She has a pacemaker and needs daily medication. It's unclear if she's receiving her pills.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Law enforcement officials have made it clear they have not identified a suspect, person of interest or vehicle connected to the crime. However, a man was arrested for allegedly sending fake ransom demands to the Guthries.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Savannah Guthrie\n              \n                          \n                Nancy Guthrie\n              \n                          \n                TV\n              \n                          \n                Money\n              \n                          \n                Breaking News\n              \n                          \n                Crime\n              \n                          \n                Viral\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Savannah Guthrie Tells Mother's Abductors Family Will Pay Ransom, on Video",
      "image": [
        "https://imagez.tmz.com/image/17/16by9/2026/02/07/17753774252d42848d2b370733ba0ab2_xl.png"
      ],
      "datePublished": "2026-02-07T23:37:57.000Z",
      "dateModified": "2026-02-07T23:37:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]