[
  {
    "title": "Philippine Theater Star Lhorvie Nuevo-Tadioan Lands Title Role in Sonny Calvento’s ‘Mother Maybe’ (EXCLUSIVE)",
    "url": "https://variety.com/2026/film/news/lhorvie-nuevo-tadioan-mother-maybe-1236629464/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Mother-Maybe.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-13T01:00:00.000Z",
    "description": "\n\tPhilippine theater actor Lhorvie Nuevo-Tadioan has secured the title role in director Sonny Calvento‘s “Mother Maybe,” joining previously announced ",
    "body": "\n\tPhilippine theater actor Lhorvie Nuevo-Tadioan has secured the title role in director Sonny Calvento‘s “Mother Maybe,” joining previously announced star Anthony Jennings, Southern Lantern Studios revealed.\n\n\tThe horror-comedy-drama, a tri-national co-production between Southern Lantern Studios (Philippines), E&W Films (Singapore) and Volos Films Ltd. (Taiwan), follows Marco (Jennings), a young man who reunites with his long-lost mother during a high-stakes Asian game show, only to discover she transforms into something monstrous at night. Nuevo-Tadioan will play Minda, the mother at the center of the supernatural narrative.\n\t\n\n\tIn the role, Nuevo-Tadioan portrays a parent who communicates minimally and keeps much of her emotional life hidden. The character required a performer who can build tension through what goes unexpressed – through hidden truths, contained feelings and deliberate physical choices. The film uses supernatural horror to examine the overseas Filipino worker experience and the emotional toll of migration. \n\n\n\tThe casting represents just Nuevo-Tadioan’s second film project –  after her screen debut in “Phantosmia,” a film by director Lav Diaz that premiered at the Venice Film Festival – though she brings extensive stage credentials to the production. A veteran member of Tanghalang Pilipino – the Cultural Center of the Philippines’ resident theater company – Nuevo-Tadioan has built a reputation for performances requiring both emotional depth and physical discipline.\n\n\tHer work in “Anak Datu” brought her dual honors: the Gawad Buhay Award for Outstanding Performer and the Aliw Award for Best Featured Performer. Playing the character Potri Loling without any spoken lines, Nuevo-Tadioan demonstrated an ability to convey complex emotional states through physical performance alone.\n\t\n\n\tThat particular skill caught Calvento’s attention. “In theater, Lhorvie carries an extraordinary authority,” Calvento said. “What moved me most was her ability to hold an audience even in silence. She doesn’t need dialogue to be felt – her body and stillness already speak.”\n\n\tThe director also praised Nuevo-Tadioan’s natural screen presence. “There’s something deeply cinematic about her,” he added. “The smallest shift in her movement, the way she holds a pause. Those nuances already tell a story. That’s essential for this role.”\n\n\tCalvento believes Nuevo-Tadioan’s stage training has prepared her to maintain the role’s understated intensity and emotional complexity.\n\n\tProduction on the film resumes in February. The project has secured significant industry recognition, winning the TAICCA Development Grant at Full Circle Lab Philippines and the Malaysian Development Lab for Feature Films in 2022, followed by the TAICCA x CNC Award for Best Project and the MPA Grand Award at the Taiwan Creative Content Fest in 2023.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Philippine Theater Star Lhorvie Nuevo-Tadioan Lands Title Role in Sonny Calvento’s ‘Mother Maybe’ (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Mother-Maybe.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-13T01:00:00.000Z",
      "dateModified": "2026-01-13T01:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Dinner at Noma’s Los Angeles Residency Will Cost $1500",
    "url": "https://variety.com/2026/scene/food/noma-los-angeles-dinner-reservations-1500-dollars-1236629883/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Rene_AudreyMa_0115-large.jpg?crop=0px%2C557px%2C1998px%2C1125px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-01-13T00:58:01.000Z",
    "description": "\n\tFans of chef René Redzepi and his groundbreaking Noma restaurant can start getting in line on Monday, Jan. 26 for the Los Angeles residency this spr",
    "body": "\n\tFans of chef René Redzepi and his groundbreaking Noma restaurant can start getting in line on Monday, Jan. 26 for the Los Angeles residency this spring. Well, not literally in line, since the Noma will pop-up at what is reportedly a historic venue in a Silver Lake residential neighborhood where the address won’t be revealed until reservations are made. \n\n\tAspiring diners can sign up for Noma’s newsletter by Jan. 23 to have a chance at reservations that will be released starting Jan. 26 — as long as they agree to a crew filming on the premises during service for a future documentary project. If a reservation is granted, the $1500 per person is due immediately — though it will include beverage pairing, tax and tip.\n\t\n\n\tFounded in Copenhagen in 2003, Noma has been named the world’s No. 1 restaurant four times and its elaborate tasting menus emphasize foraging, fermentation and local ingredients in conversation with Redzepi’s Nordic roots.\n\n\n\tRedzepi is going to great lengths to establish the L.A. outpost from March 11 to June 26. After previous residencies in cities including Tokyo, Kyoto and Tulum, Mexico, the L.A. location will be the first longer-term project in the U.S. outside of a four-day stint in Brooklyn in 2022. Also planned for somewhere in Silver Lake is a Noma Projects shop where housemade items such as vinegar, garum and coffee will be for sale. \n\n\tRedzepi explained in a statement how he chose the location. “It had to be Los Angeles,” he wrote. “I love this region. The vast Pacific. The farmers’ markets overflowing with produce in the middle of January. A place where you can have tacos for breakfast and a Thai tasting menu in an alleyway for dinner. Oaxacan mole from a strip mall. A great-grandmother’s kimchi soup served at 2 a.m. in Koreatown.\n\t\n\n\t“L.A. is a city of wild contrasts — a place that makes you ask: how can these things go together?”\n\n\n\n\t\n\n\t\t\t\t\tRedzepi is considering using California-sourced ingredients including cactus, crab, citrus and flowers.\n\t\t\t\t\t\t\t\t\tAudrey Ma\n\t\n\n\n\n\t“For this residency, our work will be shaped by the landscapes surrounding the city — from the Pacific to the mountains and deserts beyond — and by the people who know them best,” the Noma team added in a statement. “We’ve spent the past few months listening, learning, and building a new pantry of flavors rooted in this place, filtered through our imagination and the experience we bring with us from Copenhagen. We can’t wait to share this work over the next coming months.”\n\n\tIn addition to collaborations with other L.A. restaurants, Redzepi will bring other chefs from Copenhagen for pop-ups, and his MAD non-profit will host talks like the October event that included director Lulu Wang.\n\n\tRedzepi is bringing numerous kitchen staffers, their families and children to L.A., which explains part of the high cost of the meal. The restaurant will also provide work experience and mentorships to students from underserved communities. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Dinner at Noma’s Los Angeles Residency Will Cost $1500",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Rene_AudreyMa_0115-large.jpg?crop=0px%2C557px%2C1998px%2C1125px&resize=1000%2C563"
      ],
      "datePublished": "2026-01-13T00:58:01.000Z",
      "dateModified": "2026-01-13T00:58:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How to Watch 'The Night Manager' Online for Free",
    "url": "https://variety.com/2026/shopping/news/how-to-watch-the-night-manager-online-free-1236629814/",
    "image": "https://variety.com/wp-content/uploads/2025/12/The-Night-ManagerS2.jpg?crop=0px%2C65px%2C3900px%2C2193px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-01-12T22:09:31.000Z",
    "description": "\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.\n\n\tAlthough ",
    "body": "\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.\n\n\tAlthough it’s been just about 10 years since the season one finale of “The Night Manager” back in Mar. 2016, the hit British spy thriller series based on the novel of the same name by John le Carré is back for season two.\n\n\tDropping on Sundays until the season finale on Feb. 1, “The Night Manager” returns with weekly episodes on Prime Video for subscribers only. Season two has six episodes, in total.\n\n\n\tNot a member? Sign up for a 30-day free trial to take advantage of all that Amazon Prime has to offer, including access to Prime Video and Prime Gaming; fast free shipping within two days; in-store discounts at Whole Foods Market, access to exclusive shopping events — like Prime Day and Black Friday — and more.\n\n\n\tAfter the trial is up, you can either cancel the streaming service altogether, or you can keep watching for $8.99/month for just the Prime Video plan. But, if you want all the perks that come with Amazon Prime, it goes for $14.99/month, or $139.99/year — a nearly 25% savings.\n\n\tAlong with “The Night Manager,” Prime Video also has access to hit movies like “A Working Man,” “The Accountant 2″ and “Last Breath,” plus originals like “Fallout,” “Gen V,” “The Boys,” “Invincible,” “Daisy Jones & The Six” and more. Prime Video also offers free live sports streaming from the NFL, NBA, ONE Championship, Professional Pickleball Association Tour, UTR Pro Tennis and other events, as well as live news.\n\n\tFor season two, “The Night Manager” follows Jonathan Pine (Tom Hiddleston) is on a new mission, but this time he’s in Colombia trying to infiltrate a dangerous arms dealer, Teddy Dos Santos (Diego Calva). The series also stars Olivia Colman, Camila Morrone, Paul Chahidi, Hayley Squires, Indira Varma, Kirby Howell-Baptiste, Slavko Sobin and others.\n\n\n\tYou can stream “The Night Manager” season two weekly on Prime Video on Sundays until the season finale on Feb. 1. But in the meantime, watch the trailer for season two, below:\n\n\n\n\n\tIn addition, Prime Video has “The Night Manager” season one, so you can catch up before you watch the new season.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How to Watch 'The Night Manager' Online for Free",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/The-Night-ManagerS2.jpg?crop=0px%2C65px%2C3900px%2C2193px&resize=1000%2C563"
      ],
      "datePublished": "2026-01-12T22:09:31.000Z",
      "dateModified": "2026-01-12T22:09:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Elijah Wood Says ‘I’m Not Allowed to Confirm’ Frodo’s Return in ‘The Hunt for Gollum’ and ‘Their Intention Is to Make Other Films’ in ‘Lord of the Rings’ Universe",
    "url": "https://variety.com/2026/film/news/elijah-wood-frodo-the-hunt-for-gollum-lord-of-the-rings-1236629627/",
    "image": "https://variety.com/wp-content/uploads/2026/01/MSDLOOF_EC044.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-12T21:37:57.000Z",
    "description": "\n\tIs Elijah Wood returning as Frodo in the new “Lord of the Rings” movie “The Hunt for Gollum”? Don’t ask Elijah Wood, even though his co-star Ian McK",
    "body": "\n\tIs Elijah Wood returning as Frodo in the new “Lord of the Rings” movie “The Hunt for Gollum”? Don’t ask Elijah Wood, even though his co-star Ian McKellen let it slip last year that Frodo and Gandalf would be back on the big screen when Middle-Earth returns to movie theaters in 2027. \n\n\t“I can neither confirm nor deny. Listen, a wizard is to be trusted,” Wood told ScreenRant at Fan Expo New Orleans, teasing that McKellen’s slip is likely accurate. “Aside from any of that, I’m not really allowed to confirm. I’m really excited about the film. I think it really is a creative ‘getting the band back together.’ A lot of the creative heads of department are back and in that space again. Philippa [Boyens] I think, is co-writing it and producing it. It’s very much that core original group getting back together to tell this story that will feel like a really fun exploration of this character that we all love so much. And I’m just really excited.\n\t\n\n\t“I’m excited for Andy [Serkis] to direct it,” Wood continued. “It feels so unbelievably appropriate that he directs a film about his character that he has really made his own. I’m thrilled. It’ll be great. And I’m excited to see… I know their intention is to make other films in this universe. And that’s exciting, interesting to see where that goes, but very exciting.”\n\n\n\tWarner Bros. first announced “The Hunt for Gollum” in summer 2024 and originally said it would be ready for theaters in 2026. It then got delayed to December 2027. Serkis is directing the tentpole and once again starring in the title role, which he’s been playing via motion capture since 2002’s “The Lord of the Rings: The Two Towers.” Serkis’ directorial efforts include “Mowgli: Legend of the Jungle” and “Venom: Let There Be Carnage.”\n\t\n\n\tPeter Jackson, who directed “The Lord of the Rings” and “The Hobbit” trilogies, is producing “The Hunt for Gollum” with longtime “Rings” collaborators Fran Walsh and Philippa Boyens. Warner Bros. stressed when announcing “Gollum” that the trio “will be involved every step of the way.”\n\n\tBoyens previously told Empire magazine that “The Hunt for Gollum” is “quite an intense story” that “falls after the birthday party of Bilbo and before the Mines of Moria. It’s a specific chunk of incredible untold story, told through the perspective of this incredible creature.” \n\n\tSerkis confirmed to Metro last year that he arrived in New Zealand in September to begin pre-production on the tentpole. He added at the time: “I’m thrilled to return to the family that I’ve loved working with for many years, and a character that I cannot escape from.”\n\n\t“The Hunt for Gollum” will open in theaters Dec. 17, 2027.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Elijah Wood Says ‘I’m Not Allowed to Confirm’ Frodo’s Return in ‘The Hunt for Gollum’ and ‘Their Intention Is to Make Other Films’ in ‘Lord of the Rings’ Universe",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/MSDLOOF_EC044.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-12T21:37:57.000Z",
      "dateModified": "2026-01-12T21:37:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Inside the Ballroom at the Golden Globes: 12 Starry Moments You Didn’t See on TV",
    "url": "https://variety.com/2026/biz/news/teyana-taylor-keri-russell-ayo-edebiri-golden-globes-inside-1236629895/",
    "image": "https://variety.com/wp-content/uploads/2026/01/GettyImages-2255394908.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-13T00:40:25.000Z",
    "description": "\n\tYou may be a global comedy superstar, but that doesn’t get you out of spousal support duties at the Golden Globe Awards.\n\n\tKevin Hart exited the Bev",
    "body": "\n\tYou may be a global comedy superstar, but that doesn’t get you out of spousal support duties at the Golden Globe Awards.\n\n\tKevin Hart exited the Beverly Hilton’s International Ballroom on Sunday night at the end of a long Golden Globe Awards ceremony holding up the long train of the beautiful beaded frock worn by his wife, Eniko Hart. Kevin Hart was a good sport about the whole thing, just as he was about the number of jokes and comments that came his way during the three hour and 15-minute ceremony.\n\t\n\n\tWith so many stars packed into a small space — enhanced with sushi and Champagne — the star-gazing is a huge part of the fun of going to the Globes IRL.\n\n\n\tHere’s a rundown of some things that you couldn’t see on TV:\n\n\tPower table: Keri Russell, Matthew Rhys, Claire Danes and “The Beast in Me” writer Daniel Pearle seemed to have a heck of a time at their table. Russell was animated in waving at friends and fans throughout the ceremony. Brett Goldstein, who sat at a neighboring table, had a chat with Rhys. Emma Stone also stopped by to talk with Russell. So did Jacob Elordi.\n\n\tHBO Max’s Sarah Aubrey and “The Pitt” executive producers John Wells and R. Scott Gemmill sat together with “Hacks” creators Lucia Aniello, Paul W. Downs and Jen Statsky. Aubrey and Wells celebrated with a first bump when “The Pitt” star Noah Wyle won for actor in a TV drama. The “Hacks” trio shot to their feet with applause and cheers when Jean Smart won for TV comedy actress. Wells and Gemmill later squeezed their way through the tables to collect their trophy for best drama series. \n\t\n\n\tTeyana Taylor demonstrated her roots as a choreographer by dancing all the way down the wings as the “One Battle After Another” left the stage after winning the first trophy of the night, for film supporting actress in a comedy.\n\n\tPresenters pass the time: Queen Latifah bopped to Chic’s “Good Times” as she waited to hand out a trophy. Colman Domingo did the same to Kool and the Gang’s “Hollywood Swinging” as he waited for his presenter slot. Ayo Edebiri turned to someone in the crowd and made a heart sign with both hands as she waited for her moment alongside a very pregnant Hailee Steinfeld.\n\n\tBill Maher and Mel Robbins exchanged greetings during a commercial break. Same for Judd Apatow and Brett Goldstein.\n\n\tAnother power table: Sarah Snook and Elle Fanning sat with NBCUniversal’s Pearlena Igbokwe. That group rose up in applause when Amy Poehler won for best podcast.\n\n\t“The White Lotus” creator Mike White stood for Erin Doherty’s win for “Adolescence.”\n\n\tAdam Sandler and Dwayne Johnson stood to clap for Wagner Moura’s win for “The Secret Agent.”\n\n\tTed Sarandos, Nicole Avant and Guillermo del Toro stood up as the “Kpop Demon Hunters” stars won for original song for “Golden” and for animated film.\n\n\tNikki Glaser’s opening monologue played really well in the ballroom. It wasn’t tame, but it wasn’t vicious. She threaded the needle perfectly to get the crowd on her side.\n\n\tBy contrast, the one bit that went over like a lead balloon with the industry crowd was the moment when two UFC fighters briefly took the stage, followed by the wink-wink-nudge-nudge presenter banter between “Heated Rivalry” stars Connor Storrie and Hudson Williams. You can’t win ‘em all.\n\n\t(Pictured: Jacob Elordi and Teyana Taylor)\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Inside the Ballroom at the Golden Globes: 12 Starry Moments You Didn’t See on TV",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/GettyImages-2255394908.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-13T00:40:25.000Z",
      "dateModified": "2026-01-13T00:40:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Elliot Page and Naomi Watts Star in New ACLU Campaign Supporting Trans Youth (EXCLUSIVE)",
    "url": "https://variety.com/2026/politics/columns/elliot-page-naomi-watts-aclu-campaign-supporting-trans-youth-1236629766/",
    "image": "https://variety.com/wp-content/uploads/2026/01/MixCollage-12-Jan-2026-03-24-PM-9381.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-12T22:45:00.000Z",
    "description": "\n\tElliot Page and Naomi Watts are among the bold-faced names starring a new American Civil Liberties Union public awareness campaign in support of tra",
    "body": "\n\tElliot Page and Naomi Watts are among the bold-faced names starring a new American Civil Liberties Union public awareness campaign in support of transgender youth.\n\n\tLaunching Monday ahead of oral arguments at the U.S. Supreme Court in West Virginia v. BPJ Little v. Hecox — two cases challenging state laws that ban transgender girls from participating in school sports — More Than A Game also features Megan Rapinoe, Sue Bird, Benito Skinner, Brianna Turner, Naomi Watts, and a group of young people, including the lead plaintiff in one of the cases.\n\t\n\n\tThe campaign includes photos and videos of participants wearing exclusive merchandise designed by award-winning fashion designer and ACLU Artist Ambassador Willy Chavarria. The photos were captured by artist and fashion photographer Collier Schorr and videography captured by Sundance award-winning writer and director Alessandra Lacorazza\n\n\n\t“This week the Supreme Court is set to consider a case that will have major implications for women’s sports, civil rights and the future of our country,” said U.S. Women’s National Team legend and two-time World Cup winner Rapinoe. “I am not going to be tricked into sacrificing hard fought civil rights protections because of anti-trans rhetoric. All women will be harmed if the Court rules against the young trans people at the center of these cases and I wanted to make unambiguously clear that I am on the side of equality and justice.”\n\n\tThe More Than A Game campaign’s first ad buys are during the Unrivaled women’s basketball series on Jan. 12 and will continue through in-person activations at Unrivaled playoff games in Miami in early March, featuring a 30-second ad with athletes, celebrities, artists, advocates and youth, both cisgender and transgender.\n\t\n\n\t“Supporting trans youth isn’t just about sports,” Skinner says in the 30-second video spot before Watts says, “It’s about freedom.\n\n\n\n\t\n\n\t\n\n\n\n\t“This moment in our country’s history is a test of our willingness to stand up and speak out for the most vulnerable,” said the ACLU’s LGBT & HIV Project co-director Chase Strangio. “And while we will absolutely defend our rights and our humanity in the courts, we know that transgender people’s path out of this moment of crisis will also require a broad, diverse coalition leading change in our communities and our culture. More Than A Game is our rejection of the efforts to divide us against one another and is instead a call for the unity we need to defend the freedom we deserve on and off the field.”\n\n\tPage disclosed in a social media post five years ago that he was transgender. “”I love that I am trans. And I love that I am queer,” he wrote, in part, on Twitter.\n\n\tWatts’ daughter, Kai, with ex-husband Live Schreiber is trans. Kai, 17, is a model who has worked with has Valentino and Jason Wu. In May, she and her father and his wife Taylor attended Ali Forney Center’s A Place at the Table Gala in New York City. The center, which provides housing and support for homeless LGBTQ youth, currently serves more than 2,200 young people through its 24/7 Drop-In Center and network of 13 emergency and transitional housing sites.\n\n\tTo learn more about the ACLU campaign, go to aclu.org.\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Elliot Page and Naomi Watts Star in New ACLU Campaign Supporting Trans Youth (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/MixCollage-12-Jan-2026-03-24-PM-9381.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-12T22:45:00.000Z",
      "dateModified": "2026-01-12T22:45:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'Pole to Pole With Will Smith:' How to Watch the Nat Geo Docuseries Online",
    "url": "https://variety.com/2026/shopping/news/pole-to-pole-with-will-smith-watch-nat-geo-series-online-1236628228/",
    "image": "https://variety.com/wp-content/uploads/2026/01/watch-pole-pole-will-smith-e1768106215484.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-12T22:17:00.000Z",
    "description": "\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.\n\n\tWill Smit",
    "body": "\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.\n\n\tWill Smith is bravely going where few actors have gone before with the premiere of his new National Geographic original docuseries, “Pole to Pole With Will Smith.”\n\n\tThe seven-part series follows the actor as he makes his way across all seven continents in 100 days, highlighting postcard-worthy destinations, while taking on physical challenges in some of the toughest conditions on earth. Along the way, Smith will showcase new scientific discoveries and shine a light on marginalized communities around the world. Inspired to “explore life’s big questions,” the show also features interviews with local community leaders, scientists and other explorers.\n\n\n\tWant to watch “Pole to Pole With Will Smith?” The series premieres Jan. 13 at 9 p.m. ET/PT on the National Geographic channel on TV, but you can also stream the show online without cable through Sling. The live TV streamer offers Nat Geo as part of its “Select” package, which is one of the cheapest live streaming packages online.\n\n\tFor just $29.99/month, you have access to a live feed of National Geographic plus channels like FX, NFL Network, FS1, GRIT and more. You also have access to FOX, ABC, and NBC in select markets. Sling’s plans let you stream live TV on up to three devices at once. Your subscription also includes access to thousands of TV shows and movies on-demand through the Sling website and app.\n\n\tSling lets you stream “Pole to Pole With Will Smith” online on your computer, on your phone, tablet or on your smart TV. Want more streaming options? Sling’s Orange & Blue Plan gets you 50+ channels and is currently discounted by as much as 50% off right now for your first month, bringing the price down to as low as $33. The Sling Orange & Blue Plan is your best bet for watching live sports, news and entertainment shows online without needing cable.\n\n\n\n\tPer a press release, the docuseries “blends cutting-edge science, environmental storytelling, and bold exploration,” as Smith “throws himself into incredible challenges for 100 days,” including “skiing to the South Pole, catching a giant anaconda, milking a venomous tarantula, climbing mountains, and diving under the ice of the North Pole.”\n\n\tThe series follows the actor as he helps to make “world-first scientific discoveries and forges profound human connections — from the Amazon’s Waorani community to the Kalahari’s San people, whose knowledge and resilience offer powerful lessons about our future on the planet.”\n\n\t“This journey was unlike anything I’ve ever done,” Smith says, adding that “at times I feared I might not make it home. It’s an exploration not just of the planet’s edges, but of some of the most extraordinary people living there. From the coldest ice to the deepest jungles, the beauty of our world inspired my every step with awe and hope.”\n\n\tThe National Geographic series was first announced back in February of 2022, though it was likely pushed back following the “Oscar slap” a month later. The show marks Smith’s third project with National Geographic, after “Welcome to Earth” and “One Strange Rock.”\n\n\t“Pole to Pole With Will Smith” premieres with back-to-back episodes on Jan. 13 with two new episodes airing each Tuesday evening, and a finale episode on Feb. 3. You can watch the show live online through Sling. The episodes stream on-demand on Disney+ and Hulu the next day.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Pole to Pole With Will Smith:' How to Watch the Nat Geo Docuseries Online",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/watch-pole-pole-will-smith-e1768106215484.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-12T22:17:00.000Z",
      "dateModified": "2026-01-12T22:17:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Newport Beach Film Festival Honors,’ Featuring Variety’s 10 Actors to Watch, to Air Tonight on PBS SoCal",
    "url": "https://variety.com/2026/film/features/newport-beach-honors-variety-10-actors-to-watch-pbs-1236629798/",
    "image": "https://variety.com/wp-content/uploads/2026/01/2242083258.jpg?crop=200px%2C346px%2C4437px%2C2497px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-01-12T22:07:47.000Z",
    "description": "\n\tThe 26th Annual Newport Beach Film Festival Honors, featuring Variety’s 10 Actors to Watch and their presentation of the Legends and Groundbreakers ",
    "body": "\n\tThe 26th Annual Newport Beach Film Festival Honors, featuring Variety’s 10 Actors to Watch and their presentation of the Legends and Groundbreakers Award to Scarlett Johansson, airs Monday on PBS SoCal at 7:30 pm. It is also available to stream on their website.\n\tThe Honors program also includes speeches and interview with other honorees, including Mark Hamill, Noah Schnapp and Diane Lane. The event was recorded on oceanside at the Balboa Bay Resort in October and executive produced by Visit Newport Beach.\n\t\n\tVariety’s 10 Actors to Watch annual list now boasts over 35 actors who have gone on to be nominated for or win Academy Awards, including Mahershala Ali, Timothée Chalamet and Brie Larson. This year’s honorees include contender Chase Infiniti of “One Battle After Another,” who spoke about the life-changing experience. “Just getting the opportunity to be in a room with Paul Thomas Anderson, Leonardo DiCaprio, Regina Hall, Teyana Taylor, Sean Penn, Benicio del Toro, like it’s insane to think,” she revealed. “And I took every single moment, and I treated it like a master class.”Like Infiniti, “Sinners” breakout Miles Caton made his film debut last year and spoke about how he never expected such a warm response to the film. “I feel like once I reached a certain point my music career, I would venture off into different things,” he noted. “So I feel like I eventually would, you know, get into acting. I grew up like the family clown and stuff, but not like this.”\n\n\tMari Yamamoto took a moment to pay tribute to her “Rental Family” co-star, Brendan Fraser, who was present at the honors to receive the Icon Award. She told a story about how they shot a scene on a tiny balcony in Japan, and Fraser insisted on being present for her, risking his safety. “He’s just leaning out so much to put his face as close as he can to me, and he’s worried about that, but I’m worried about the Oscar winner falling from the balcony,” she recalled. “It’s just a story that tells you how he is as a person and as an actor that you know he will do anything to catch you if you fall; he will always be there for you. So now I’m crying, but I learned that that’s how I want to be as a person and as an actor.”Other 10 Actors to Watch feted include Milly Alcock (“Supergirl”), Ella Anderson (“Song Sung Blue,”) Edmund Donovan (“Late Fame”), Inga Ibsdotter Lilleaas  (“Sentimental Value”), Jay Lycurgo (“Steve”), Guillaume Marbeck (“Nouvelle Vague”) and Tonatiuh (“Kiss of the Spider Woman”).Alumni from past 10 Actors to Watch lists were also recognized at the festival, with “Hedda” star Tessa Thompson (class of 2015) receiving the Outstanding Achievement in Acting Award, “Dying for Sex” scene stealer Jenny Slate (class of 2014) honored with the Artist of Distinction Award and Kerry Condon (class of 2022) presented with the Artist of Distinction by her “F1” producer Jerry Bruckheimer. Condon told the crowd, “I left at 16 with no money in the dark and got on a train; 25 years later here I am. So my whole career has literally been a dream come true.”Icon Award honorees included Brendan Fraser, Diane Lane and Mark Hamill. Hamill, who starred in both “The Life of Chuck” and “The Long Walk” in 2025, admitted that prior to such projects, he thought his career was slowing down. “As much as an actor likes a good entrance, you also eye a dignified exit. And a few years ago, I reached a platea. I’m not a spring chicken anymore,” he said. “So I didn’t say I’m retired, and I always thought, ‘Well, I’ll do voiceover,’ but I don’t care about being on camera anymore. Once that feeling came over me, out of nowhere, I was sort of in demand again.”Former Variety editor Steven Gaydos, who retired last year after more than 30 years with the publication, received the Arts Champion Award and gave a shout-out to Hamill when he began his speech. “I’m very proud to be here, to be able to say something I’ve wanted to say for 50 years, which is I could have been Luke Skywalker,” he revealed, saying he auditioned for the part. “Thank god this amazing man created an immortal role and spared me screwing it up.”\n\tThe show closed out with the presentation of Variety’s Legends and Groundbreakers Award to Johansson, who made her directorial debut last year with “Eleanor the Great.” Of the honor, she said, “I think it means creating a path that wasn’t there before, but certainly there are many in many ingenious and brave artists whose pioneering journeys have guided my way, so I can only hope to pay it forward, and that my visibility in directing ‘Eleanor the Great’ will encourage other women to pursue their dreams of directing and will help to shine a spotlight on the importance of women in film.”\n\t\n\tThe 26th Annual Newport Beach Film Festival Honors is also available to stream on the PBS SoCal website here.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Newport Beach Film Festival Honors,’ Featuring Variety’s 10 Actors to Watch, to Air Tonight on PBS SoCal",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/2242083258.jpg?crop=200px%2C346px%2C4437px%2C2497px&resize=1000%2C563"
      ],
      "datePublished": "2026-01-12T22:07:47.000Z",
      "dateModified": "2026-01-12T22:07:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NBC Pulls ‘Law & Order: SVU’ Episode Featuring Timothy Busfield Following Child Sex Abuse Charges",
    "url": "https://variety.com/2026/tv/news/nbc-law-amp-order-svu-timothy-busfield-1236629863/",
    "image": "https://variety.com/wp-content/uploads/2026/01/GettyImages-1204318979-e1768003063516.jpg?crop=0px%2C79px%2C1968px%2C1107px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-01-12T23:17:26.000Z",
    "description": "\n\tNBC will no longer air an upcoming episode of “Law & Order: SVU” in which Timothy Busfield appears in a guest star role. \n\n\tVariety has confirmed th",
    "body": "\n\tNBC will no longer air an upcoming episode of “Law & Order: SVU” in which Timothy Busfield appears in a guest star role. \n\n\tVariety has confirmed that the broadcast network has shelved the episode, which was set to air on Jan. 15. Instead, NBC will air the “SVU” episode originally scheduled to air on Jan. 22. Busfield was set to play a judge in the now pulled “SVU” episode, which is titled “Corrosive.” He previously guest starred on the long-running series in 2011 and directed two other episodes in 2019.\n\t\n\n\tIt was recently reported that an arrest warrant was issued for Busfield in New Mexico on charges of sexual abuse involving a minor. The accusations stem from his time as director on the Fox drama series “The Cleaning Lady.” One of a pair of twin boys who worked on the show claims that Busfield touched his “private areas” when he was seven years old, and again when he was eight, while they were on set. \n\n\n\tWarner Bros. Television, which produced “The Cleaning Lady,” had conducted an internal investigation into Busfield’s behavior towards the boys onset in 2025 following an anonymous tip involving a separate incident. The studio previously issued a statement regarding the accusations stating: \n\n\t“The health and safety of our cast and crew is always our top priority, especially the safety of minors on our productions. We take all allegations of misconduct very seriously and have systems in place to promptly and thoroughly investigate, and when needed, take appropriate action. We are aware of the current charges against Mr. Busfield and have been and will continue to cooperate with law enforcement.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NBC Pulls ‘Law & Order: SVU’ Episode Featuring Timothy Busfield Following Child Sex Abuse Charges",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/GettyImages-1204318979-e1768003063516.jpg?crop=0px%2C79px%2C1968px%2C1107px&resize=1000%2C563"
      ],
      "datePublished": "2026-01-12T23:17:26.000Z",
      "dateModified": "2026-01-12T23:17:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Awards HQ: Ariana Grande Packs CAA, Emma Stone Backs ‘Bugonia,’ Demi Moore Champions Kate Hudson and 20 Oscar Nomination Questions",
    "url": "https://variety.com/2026/film/awards/ariana-grande-caa-emma-stone-demi-moore-kate-hudson-1236629832/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Ariana-Grande-Bugonia-Jessie-Buckley-Kate-Hudson.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-12T22:27:46.000Z",
    "description": "\n\n\n\t\n\n\t\n\n\n\n\tWelcome to Variety Awards HQ — your weekly command center for the Oscars race.\n\n\n\tIt’s January 12, 2026, and Oscar nomination voting is of",
    "body": "\n\n\n\t\n\n\t\n\n\n\n\tWelcome to Variety Awards HQ — your weekly command center for the Oscars race.\n\n\n\tIt’s January 12, 2026, and Oscar nomination voting is officially underway.\n\n\tAfter a quiet holiday break, the first 12 days of the new year have kicked the race into overdrive. Every strategist and studio is pounding the pavement, treating this final stretch like the last hour of Election Day: “If you’re in line, stay in line.” Translation: It’s a close race everywhere, and one more screening, one more call, and one more push could make all the difference.\n\n\n\tJust ask Fernanda Torres. Last year, she not only squeezed into the actress category for “I’m Still Here” but pulled her film along for the ride with a surprise best picture nomination. Do we have another one of those waiting for us?\n\t\n\n\tAs we head into the final stretch before nominations are revealed on January 22, here are the 20 questions keeping me up at night that I’m not going to answer here (at least not yet):\n\n\nWill “One Battle After Another” and/or “Sinners” tie or break the all-time Oscar nomination record of 14?\nIs there such a thing as too many non-English films in the race? Could vote-splitting become a factor?\nAfter the DGA and SAG matched 5/5 in directors (only the second time in history), will the Academy follow suit—or throw us a curveball with an international or under-the-radar filmmaker?\nThere’s always a “normal people” movie in the mix. Is that “F1,” “Wicked: For Good,” or “Avatar: Fire and Ash”?\nWill Golden Globe winner Wagner Moura (“The Secret Agent”) or Globe and SAG nominee Jesse Plemons (“Bugonia”) claim the final best actor slot? Or could we see a surprise entirely?\nWill Rose Byrne (“If I Had Legs I’d Kick You”) and Kate Hudson (“Song Sung Blue”) become best actress nominees as the sole representatives for their films?\nPundits have locked in the same five men for supporting actor — Benicio Del Toro, Jacob Elordi, Paul Mescal, Sean Penn, and Stellan Skarsgård. But is that actually correct?\nHow many women from “Sentimental Value” will be nominated?\nAre the Oscars cool enough to nominate Amy Madigan, Miles Caton, and “The Ugly Stepsister” all in one year?\nDid the PGA nomination for “Weapons” signal a best original screenplay nod lurking? Or even best picture itself?\nWill “Bugonia” land one, or more technical nominations?\nDid the ASC snub for “Hamnet” (cinematographer Łukasz Żal) mean anything?\nWill production design and costume design recognize the same five films?\nCould there be a non-best picture nominee in film editing?\nWill “Sinners” score two original song nominations?\nCan Crunchyroll’s “Demon Slayer: Kimetsu no Yaiba Infinity Castle” break into the animated feature lineup?\nWill Neon sweep all five international feature slots? “It Was Just an Accident” (France), “Sirât” (Spain), “The Secret Agent” (Brazil), “Sentimental Value” (Norway), and “No Other Choice” (South Korea).\nWill the Documentary Branch pull another jaw-dropper and snub the frontrunner—like they did with “Jane,” “Apollo 11,” “Three Identical Strangers,” and “Won’t You Be My Neighbor?”\nWhat are the casting directors ACTUALLY considering when voting on casting?\nWill I accurately predict the three shorts categories? (Spoiler: Probably not).\n\n\n\n\tOscar nomination voting closes Jan. 16 at 5 p.m. Pacific. Nominees will be announced Jan. 22.\n\n\tSee some of the highlights of the New Year below.\n\t\n\t\tAriana Grande Toasts the Art of Casting at Soho House West Hollywood and Says Goodbye to ‘Wicked’ at CAA\t\n\n\n\n\t\n\n\t\n\n\n\n\tOn Monday, Jan. 5, a standing-room-only crowd packed Soho House West Hollywood as Ariana Grande moderated a spirited and insightful Q&A with casting directors Bernard Telsey and Tiffany Little Canfield. Balancing sharp humor with genuine admiration, Grande “roasted and toasted” her collaborators while guiding a conversation that demystified the casting process behind their blockbuster success. The lively exchange kept guild voters laughing while offering real insight into the creative decisions that shape a film from the ground up.\n\t\n\n\tThe next day on Jan. 6, demand was so high that attendees wrapped around CAA’s offices — with turnaways — for a screening and Q&A with Ariana Grande, moderated by Kevin McCarthy. Speaking candidly to a room filled with AMPAS members and industry insiders, Grande reflected on spending five years with the role in “Wicked: For Good,” framing the project as a heartfelt farewell. Following the Q&A, she stayed to mingle one-on-one with attendees, even FaceTiming children of guests, turning the event into a rare, personal moment of connection.\n\n\tVariety also sat down with the Golden Globe, Critics Choice and SAG nominated star, where she talked about her love for acting.\n\n\n\n\t\n\n\t\n\n\n\n\t\n\t\tYorgos Lanthimos, Emma Stone and Jesse Plemons Draw Full House for All-Guild Q&A\t\n\n\tOn Jan. 7, a Los Angeles all-guild screening of “Bugonia” brought together director Yorgos Lanthimos, Emma Stone and Jesse Plemons for a wide-ranging Q&A moderated by Nathan Fielder. \n\n\tIt followed a week of events for the filmmaking team.\n\n\tOn Jan. 6, The American Cinematheque’s Aero Theatre hosted a packed screening and Q&A with Plemons, moderated by Adam Scott. Plemons offered thoughtful insight into his performance and the film’s darker comedic edge.\n\n\tAnd last weekend, screenwriter Will Tracy took center stage for an all-guild screening and Q&A, moderated by David Hemingson. \n\n\tJesse Plemons is also the cover story for this week’s Extra Edition of Variety, penned by yours truly. Give it a read!\n\n\n\n\t\n\n\t\n\n\n\t\n\t\tChloé Zhao Joins Seth Rogen at the Directors Guild\t\n\n\tA Los Angeles special screening of “Hamnet” featured a Q&A with director Chloé Zhao, Jessie Buckley, Jacobi Jupe, artisans and producers on Jan. 5. \n\n\tOn Wed. Jan. 7, Zhao returned for a Directors Guild screening and Q&A moderated by recent Golden Globe winner Seth Rogen, focusing on her approach to adaptation, tone and visual storytelling. \n\n\t\n\t\tDemi Moore and Al Pacino Stomp for Kate Hudson in ‘Song Sung Blue’\t\n\n\tSoho House hosted a Tastemaker screening and Q&A with Kate Hudson, moderated by Demi Moore. The evening drew a high-profile crowd of A-listers and Oscar nominees and winners including Leonardo DiCaprio, Al Pacino, Mark Ruffalo and David O. Russell — and showcased Hudson’s performance alongside a warm, reflective conversation.\n\n\tThe support is building for Hudson’s outstanding work in Craig Brewer’s impactful drama, which also stars Hugh Jackman.\n\n\tA special screening of “Song Sung Blue” paired director Craig Brewer and star Kate Hudson with moderator Rian Johnson for an engaging Q&A. \n\n\n\n\t\n\n\t\t\t\t\tLOS ANGELES, CALIFORNIA – JANUARY 06: Rian Johnson, Kate Hudson and Craig Brewer seen at Focus Features’ “Song Sung Blue” Special Screening at DGA Theater Complex on January 06, 2026 in Los Angeles, California.  (Photo by Eric Charbonneau/Focus Features via Getty Images)\n\t\t\t\t\t\t\t\t\tFocus Features via Getty Images\n\t\n\n\n\n\t\n\t\t‘Train Dreams’ Draws Strong AMPAS and WGA Turnout\t\n\n\n\n\t\n\n\t\t\t\t\tWEST HOLLYWOOD, CALIFORNIA – JANUARY 05: (L-R) Clayton Davis, Clint Bentley, Joel Edgerton, Greg Kwedar, Adolpho Veloso and Bryce Dessner attend Netflix’s “Train Dreams” AMPAS Tastemaker Event at San Vincente Bungalows Santa Monica on January 05, 2026 in Santa Monica, California. (Photo by Phillip Faraone/Getty Images for Netflix)\n\t\t\t\t\t\t\t\t\tGetty Images for Netflix\n\t\n\n\n\n\tA screening of “Train Dreams” at San Vicente Bungalows Santa Monica brought together composer Bryce Dessner, cinematographer Adolpho Veloso, co-writer Greg Kwedar, star Joel Edgerton and director/co-writer Clint Bentley for a robust Q&A moderated by Variety’s Clayton Davis.\n\t\n\n\tWith AMPAS and WGA members in attendance, the conversation explored the film’s visual language, score and literary roots, capping off an evening of focused, craft-driven discussion.\n\n\t\n\t\t‘Sirāt’ Score-to-Picture Event Stuns at Avalon Hollywood\t\n\n\tOn Wed. Jan.  7, a completely full Avalon Hollywood hosted a score-to-picture event for “Sirāt,” with Kangding Ray performing his full set live. Director Oliver Laxe delivered a moving introduction before a Q&A moderated by Mark McGille of the LA Philharmonic. The immersive experience left attendees visibly energized and eager to revisit the film through its music.\n\n\n\tOscar voting has officially opened, kicking off a five-day period that will determine nominations for another competitive awards season.\n\n\tThe 11,000-member Academy of Motion Picture Arts and Sciences began casting ballots at 9 a.m. PT across 19 branches representing various disciplines. Voting remains open through Jan. 16 at 5 p.m.\n\n\tThe most up-to-date predictions are below.\n\n\tBest Picture“Bugonia” (Focus Features)“F1” (Apple Original Films/Warner Bros.)“Frankenstein” (Netflix)“Hamnet” (Focus Features) “Marty Supreme” (A24)“One Battle After Another” (Warner Bros.) “The Secret Agent” (Neon)“Sentimental Value” (Neon)“Sinners” (Warner Bros.) ***“Train Dreams” (Netflix)\n\n\tDirectorPaul Thomas Anderson, “One Battle After Another” (Warner Bros.) ***Ryan Coogler, “Sinners” (Warner Bros.)Guillermo Del Toro, “Frankenstein” (Netflix)Joachim Trier, “Sentimental Value” (Neon)Chloé Zhao, “Hamnet” (Focus Features)\n\n\tActorTimothée Chalamet, “Marty Supreme” (A24) Leonardo DiCaprio, “One Battle After Another” (Warner Bros.) Ethan Hawke, “Blue Moon” (Sony Pictures Classics) ***Michael B. Jordan, “Sinners” (Warner Bros.)Wagner Moura, “The Secret Agent” (Neon)\n\n\tActressJessie Buckley, “Hamnet” (Focus Features) ***Rose Byrne, “If I Had Legs I’d Kick You” (A24)Kate Hudson, “Song Sung Blue” (Focus Features)Chase Infiniti, “One Battle After Another” (Warner Bros.)Emma Stone, “Bugonia” (Focus Features)\n\n\tSupporting ActorBenicio Del Toro, “One Battle After Another” (Warner Bros.) Jacob Elordi, “Frankenstein” (Netflix)Paul Mescal, “Hamnet” (Focus Features)Sean Penn, “One Battle After Another” (Warner Bros.) Stellan Skarsgård, “Sentimental Value” (Neon) ***\n\n\tSupporting ActressAriana Grande, “Wicked: For Good” (Universal Pictures) Inga Ibsdotter Lilleaas, “Sentimental Value” (Neon) Amy Madigan, “Weapons” (Warner Bros.) ***Wunmi Mosaku, “Sinners” (Warner Bros.)Teyana Taylor, “One Battle After Another” (Warner Bros.)\n\t\n\n\tOriginal Screenplay“Blue Moon” (Sony Pictures Classics) — Robert Kaplow“Marty Supreme” (A24) — Ronald Bronstein and Josh Safdie“Sentimental Value” (Neon) — Joachim Trier and Eskil Vogt “Sinners” (Warner Bros.) — Ryan Coogler ***“Weapons” (Warner Bros.) — Zach Cregger\n\n\tAdapted Screenplay“Bugonia” (Focus Features) — Will Tracy“Frankenstein” (Netflix) — Guillermo Del Toro“Hamnet” (Focus Features) — Chloé Zhao “One Battle After Another” (Warner Bros.) — Paul Thomas Anderson “Train Dreams” (Netflix) — Clint Bentley and Greg Kwedar ***\n\n\tCasting“Frankenstein” (Netflix) — Robin D. Cook“Marty Supreme” (A24) — Jennifer Venditti“One Battle After Another” (Warner Bros.) — Cassandra Kulukundis“Sinners” (Warner Bros.) — Francine Maisler ***“Weapons” (Warner Bros.) — Allison Jones\n\n\tAnimated Feature“Demon Slayer: Kimetsu no Yaiba Infinity Castle” (Crunchyroll)“Elio” (Pixar)“KPop Demon Hunters” (Netflix) “Little Amélie or the Character of Rain” (GKids) “Zootopia 2” (Walt Disney Pictures) ***\n\n\tProduction Design“Bugonia” (Focus Features) — James Price, Prue Howard, Sarah Carter“Frankenstein” (Netflix) — Tamara Deverell and Shane Vieau ***“Hamnet” (Focus Features) — Fiona Crombie and Alice Felton“Marty Supreme” (A24) — Jack Fisk and Adam Willis“Sinners” (Warner Bros.) — Hannah Bleachler and Monique Champagne\n\n\tCinematography“Frankenstein” (Netflix) — Darius Khondji“Hamnet” (Focus Features) — Łukasz Żal“One Battle after Another” (Warner Bros.) — Michael Bauman“Sinners” (Warner Bros.) — Autumn Durald Arkapaw ***“Train Dreams” (Netflix) — Adolpho Veloso\n\n\tCostume Design“Frankenstein” (Netflix) — Kate Hawley“Hamnet” (Focus Features) — Malgosia Turzanska“One Battle After Another” (Warner Bros.) — Colleen Atwood“Sinners” (Warner Bros.) — Ruth E. Carter ***“Wicked: For Good” (Universal Pictures) — Paul Tazewell \n\n\tFilm Editing“F1” (Apple Original Films/Warner Bros.) — Stephen Mirrione“Frankenstein” (Netflix) — Evan Schiff“Marty Supreme” (A24) — Ronald Bronstein and Josh Safdie“One Battle After Another” (Warner Bros.) — Andy Jurgensen ***“Sinners” (Warner Bros.) — Michael P. Shawver\n\n\tMakeup and Hairstyling“The Alto Knights” (Warner Bros.)“Frankenstein” (Netflix) ***“The Smashing Machine” (A24) “The Ugly Stepsister” (IFC) “Wicked: For Good” (Universal Pictures)\n\n\tSound“F1” (Apple Original Films/Warner Bros.) *** “One Battle After Another” (Warner Bros.)“Sinners” (Warner Bros.) “Sirât” (Neon)“Wicked: For Good” (Universal Pictures)\n\n\tVisual Effects“Avatar: Fire and Ash” (20th Century Studios) ***“F1” (Apple Original Films/Warner Bros.)“Frankenstein” (Netflix)“Sinners” (Warner Bros.)“Superman” (DC Studios)\n\n\tOriginal Score“Frankenstein” (Netflix) — Alexandre Desplat“Hamnet” (Focus Features) — Max Richter“One Battle after Another” (Warner Bros.) — Jonny Greenwood“Sinners” (Warner Bros.) — Ludwig Göransson ***“Train Dreams” (Netflix) — Bryce Dessner\n\t\n\n\tOriginal Song“Salt Then Sour Then Sweet” from “Come See Me in the Good Light” (Apple Original Films)“Dear Me” from “Diane Warren: Relentless” (Greenwich Entertainment) — Diane Warren“Golden” from “KPop Demon Hunters” (Netflix) — EJAE and Mark Sonnenblick ***“Last Time (I Seen the Sun)” from “Sinners” (Warner Bros.) — Miles Caton, Ludwig Göransson and Alice Smith“I Lied To You” from “Sinners” (Warner Bros.) — Ludwig Göransson and Raphael Saadiq\n\n\tDocumentary Feature“The Alabama Solution” (HBO Documentary Films)“Cutting Through Rocks” (Autlook Films)“The Perfect Neighbor” (Netflix) ***“Seeds” (Interior Films)“2000 Meters to Andriivka” (PBS)\n\n\tInternational Feature“It Was Just an Accident” from France (Neon) “Kokuho” from Japan (GKids)“The Secret Agent” from Brazil (Neon)“Sentimental Value” from Norway (Neon) ***“The Voice of Hind Rajab” from Tunisia (Willa)\n\n\tAnimated Short“Cardboard” (Locksmith Animation) — dir. J.P. Vine “Éiru” (GKids) — dir. Giovanna Ferrari ***“Hurikán” (AEON Production) — dir. Jan Saska“The Quinta’s Ghost” (Illusorium Films) — dir. James A. Castillo“The Shyness of Trees” (Gobelins, l’Ecole de l’Image) — dir. Sofiia Chuikovska, Loïck Du Plessis D’Argentré, Lina Han, Simin He, Jiaxin Huang, Maud Le Bras, Bingqing Shu\n\n\tDocumentary Short“All the Empty Rooms” (Netflix) — dir. Joshua Seftel ***“All the Walls Came Down” (Interloper Films) — dir. Ondi Timoner“Armed Only with a Camera: The Life and Death of Brent Renaud” (HBO Documentary Films) — dir. Brent Renaud and Craig Renaud“Chasing Time” (Exposure Labs) — dir. Sarah Keo and Jeff Orlowski-Yang“The Devil is Busy” (HBO Documentary Films) — dir. Geeta Gandbhir, Christalyn Hampton\n\n\tLive Action Short“Extremist” (The New Yorker) — dir. Aleksandr Molochnikov“Pantyhose” (Wildhog Productions) — dir. Fabian Munsterhjelm“Rock, Paper, Scissors” (National Film and Television School)“The Singers” (Highway West Entertainment)“Two People Exchanging Saliva” (The New Yorker) ***\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Awards HQ: Ariana Grande Packs CAA, Emma Stone Backs ‘Bugonia,’ Demi Moore Champions Kate Hudson and 20 Oscar Nomination Questions",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Ariana-Grande-Bugonia-Jessie-Buckley-Kate-Hudson.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-12T22:27:46.000Z",
      "dateModified": "2026-01-12T22:27:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "U.S. Marshals Assisting Police in Locating Timothy Busfield Amid Child Sex Abuse Allegations",
    "url": "https://www.tmz.com/2026/01/12/us-marshals-assist-police-locating-timothy-busfield/",
    "image": "https://imagez.tmz.com/image/fa/16by9/2026/01/10/fad4d1570f224813911894f70fb0d2d0_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-13T00:41:31.000Z",
    "description": "\n    \n                    \n                          Timothy Busfield\n                          Feds Get Involved In Child Sex Abuse Case\n            ",
    "body": "\n    \n                    \n                          Timothy Busfield\n                          Feds Get Involved In Child Sex Abuse Case\n                      \n                  \n                                                                        Published \n                              January 12, 2026\n                            4:41 PM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Federal authorities are now involved in the Timothy Busfield child sex abuse case ... TMZ has learned.\n      \n    \n          A spokesperson for the Albuquerque Police Department tells TMZ ... the U.S. Marshals Service is assisting APD as officers work to locate Busfield and take him into custody in connection with the allegations.\n      \n\n                  \n          \n                          \n                \n                  \n      \n    \n          As we previously reported ... Melissa Gilbert's husband was accused of sexually abusing underage boys who were child actors on \"The Cleaning Lady\" while he was directing the show. An investigation into Busfield began in November 2024, and a warrant for his arrest was issued Friday.\n      \n    \n          We're told Busfield is not currently in custody, and law enforcement has not provided a timeline for an arrest. His whereabouts have not been publicly disclosed.\n      \n    \n                    \n                          \n                                  \n      \n        \n    \n          During a police interview, Busfield told detectives the show's lead actress, Élodie Yung, claimed the mother of the two boys wanted revenge after her children were not invited back for the show's final season.\n      \n    \n          Busfield has not been convicted, and the allegations remain under investigation.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Timothy Busfield\n              \n                          \n                Melissa Gilbert\n              \n                          \n                Celebrity News\n              \n                          \n                TV\n              \n                          \n                Movies\n              \n                          \n                Rape and Sexual Assault\n              \n                          \n                Exclusive\n              \n                          \n                Police\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "U.S. Marshals Assisting Police in Locating Timothy Busfield Amid Child Sex Abuse Allegations",
      "image": [
        "https://imagez.tmz.com/image/fa/16by9/2026/01/10/fad4d1570f224813911894f70fb0d2d0_xl.jpg"
      ],
      "datePublished": "2026-01-13T00:41:31.000Z",
      "dateModified": "2026-01-13T00:41:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sarah Silverman Says Nikki Glaser Did Brilliant Job Hosting Golden Globes",
    "url": "https://www.tmz.com/2026/01/12/sarah-silverman-praises-nikki-glaser-hosting/",
    "image": "https://imagez.tmz.com/image/0d/16by9/2026/01/12/0d09c4f13d7c4885a40a2ccb9a75aaf2_xl.png",
    "tag": "Entertainment",
    "date": "2026-01-12T23:00:54.000Z",
    "description": "\n    \n                    \n                          Sarah Silverman\n                          Glaser's Golden Globes Gig?!?\n                         ",
    "body": "\n    \n                    \n                          Sarah Silverman\n                          Glaser's Golden Globes Gig?!?\n                          Chef's Kiss!!!\n                      \n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          Leonardo DiCaprio might’ve been muttering insults under his breath at Nikki Glaser's Golden Globes roast -- but Sarah Silverman tells us there’s no debate ... she straight-up killed it as host!\n      \n    \n          We caught up with the comedy legend at LAX Monday, and she couldn’t stop raving about Nikki’s hosting gig the night before ... showering her with praise and saying she seriously raised the bar.\n      \n    \n      \n        \n                    \n                  \n      \n                    Golden Globes / Dick Clark Productions\n          \n    \n          You’ve gotta catch the clip ... we also ask Sarah whether Nikki crossed the line going after certain people, and get her take on whether she thinks she'll be back to host again next year.\n      \n\n          While we were at it, we also got Nikki’s take on whether awards show hosts should steer clear of politics ... and Sarah didn’t hold back one bit, capping it all off with a mic-drop -- \"F*** ICE, right?\"\n      \n    \n                    \n                          \n                                  \n      \n        \n    \n          Yeah ... you definitely need to watch this one!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Sarah Silverman\n              \n                          \n                Nikki Glaser\n              \n                          \n                Celebrity News\n              \n                          \n                TV\n              \n                          \n                Golden Globes\n              \n                          \n                Comedy\n              \n                          \n                Exclusive\n              \n                          \n                In The Field\n              \n                          \n                Award Shows\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sarah Silverman Says Nikki Glaser Did Brilliant Job Hosting Golden Globes",
      "image": [
        "https://imagez.tmz.com/image/0d/16by9/2026/01/12/0d09c4f13d7c4885a40a2ccb9a75aaf2_xl.png"
      ],
      "datePublished": "2026-01-12T23:00:54.000Z",
      "dateModified": "2026-01-12T23:00:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "GoFundMe Benefiting ICE Agent Jonathan Ross Receives Over $475K in Donations",
    "url": "https://www.tmz.com/2026/01/12/jonathan-ross-shooter-receives-donations/",
    "image": "https://imagez.tmz.com/image/3b/16by9/2026/01/12/3b345c771ad345da8c4105eb18deb44d_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-12T21:24:28.000Z",
    "description": "\n                    \n                          Jonathan Ross\n                          GoFundMe Campaign For ICE Agent Surpasses $475K\n              ",
    "body": "\n                    \n                          Jonathan Ross\n                          GoFundMe Campaign For ICE Agent Surpasses $475K\n                      \n                  \n                                                                        Published \n                              \n                January 12, 2026\n                \n                            1:24 PM PST\n                                                                      |\n                                                                Updated \n                                  January 12, 2026\n                                2:05 PM PST\n                                    \n              \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          A GoFundMe campaign benefiting Jonathan Ross -- the ICE agent who allegedly shot Renee Nicole Good to death last week in Minneapolis -- reached over $475,000 in donations as of the Monday after Good's death.\n      \n    \n          The campaign's organizer is a Michigan man named Clyde Emmons, according to the web page. He wrote he'd set up the GoFundMe, which has a goal of $550,000, \"after seeing all the media bs about a domestic terrorist\" -- referring to Good -- getting her own GoFundMe campaign.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Emmons wrote Ross' actions were \"1000 percent justified\" and said funds from the campaign were going to help the ICE agent.\n      \n\n          The campaign's biggest donor was billionaire businessman Bill Ackman, who donated a whopping $10,000 to the campaign. He justified his donation in a post on X, writing he wanted to donate the same amount to Good's campaign ... which was closed after it received more than $1.5 million in donations.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Ackman wrote he's a \"big believer in our legal principal that one is innocent until proven guilty,\" and described the whole situation as a tragedy.\n      \n    \n          It's unclear if Ross will be able to accept the donations ... federal government employees can't receive any supplementations to their salaries as compensation for their services, according to the U.S. Office of Government Ethics.\n      \n    \n          However, government employees can solicit and accept gifts from people when it's clear the gift is motivated by a familial or personal relationship ... but not a federal position.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          FYI ... Ross shot Good in traffic on a residential street in Minneapolis last week, on January 7. Good attempted to drive away from the scene as ICE officers ordered her out of her Honda Pilot. Ross, standing at the front of her vehicle, fired three shots at Good, fatally striking her in the head. The intentions of Good and of Ross at the scene are both in dispute.\n      \n    \n          The Trump administration, including Vice President J.D. Vance and Kristi Noem, has praised Ross' actions, claiming he was acting in self-defense when he shot Good.\n      \n      ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "GoFundMe Benefiting ICE Agent Jonathan Ross Receives Over $475K in Donations",
      "image": [
        "https://imagez.tmz.com/image/3b/16by9/2026/01/12/3b345c771ad345da8c4105eb18deb44d_xl.jpg"
      ],
      "datePublished": "2026-01-12T21:24:28.000Z",
      "dateModified": "2026-01-12T21:24:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Go Coco-Nuts Over Alessandra Ambrosio's Tropical Bae-Cay!",
    "url": "https://www.tmz.com/2026/01/12/alessandra-ambrosio-tropical-hot-shots/",
    "image": "https://imagez.tmz.com/image/44/16by9/2026/01/12/44f1e18a619f4ed9b0deb182dc4be604_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-12T20:16:53.000Z",
    "description": "\n    \n                    \n                          Go Coco-Nuts Over\n                          Alessandra Ambrosio's\n                          Tropi",
    "body": "\n    \n                    \n                          Go Coco-Nuts Over\n                          Alessandra Ambrosio's\n                          Tropical Bae-Cay 🥥!\n                      \n                  \n                                                                        Published \n                              \n                January 12, 2026\n                \n                            12:16 PM PST\n                                                                      |\n                                                                Updated \n                                  January 12, 2026\n                                3:49 PM PST\n                                    \n      \n    \n      \n        \n              \n    \n    \n          When you're an iconic model like Alessandra Ambrosio, you work hard ... and play even HARDER!\n      \n    \n          Posting up a storm, the 44-year-old has been livin' it up in Brazil -- showcasing her smokin' hot bod on socials, and the bikini pics are one for the books! Also, keep scrolling for an Alessandra Ambrosio Wordsearch!\n      \n\n                  \n          \n                          \n                \n                                  \n      \n    \n          Can you say, \"hair flip?!\" Ambrosio shared this photo -- came thru' drippin, drip drip! Peep her coconut(s) planted in the sand ...\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          It's hard to believe she's in her mid-40s, but here she is -- hands in the air like she just don't care!\n      \n    \n          Check out the gallery and see all the sexy snaps! Once you're done pickin' your jaws off the floor, can you track down the words below?\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Alessandra Ambrosio\n              \n                          \n                Hotties & Bodies\n              \n                          \n                Hot Bodies\n              \n                          \n                Photo Galleries\n              \n                          \n                Instagram\n              \n                          \n                Models\n              \n                          \n                Vacations\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Go Coco-Nuts Over Alessandra Ambrosio's Tropical Bae-Cay!",
      "image": [
        "https://imagez.tmz.com/image/44/16by9/2026/01/12/44f1e18a619f4ed9b0deb182dc4be604_xl.jpg"
      ],
      "datePublished": "2026-01-12T20:16:53.000Z",
      "dateModified": "2026-01-12T20:16:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bam Margera Says He Won't Film New Stunts For New 'Jackass' Movie",
    "url": "https://www.tmz.com/2026/01/12/bam-margera-not-filming-new-stunts-jackass/",
    "image": "https://imagez.tmz.com/image/39/16by9/2026/01/12/39e73f3d882248fca9969dfd2570511e_xl.png",
    "tag": "Entertainment",
    "date": "2026-01-13T00:25:55.000Z",
    "description": "\n    \n                    \n                          Bam Margera\n                          I Won't Film New 'Jackass' Stunts ...\n                     ",
    "body": "\n    \n                    \n                          Bam Margera\n                          I Won't Film New 'Jackass' Stunts ...\n                          It's Still F*** Knoxville!!!\n                      \n                  \n                                                                        Published \n                              January 12, 2026\n                            4:25 PM PST\n                                                                            \n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          Bam Margera says he won't film any new stunts for a new 'Jackass' movie ... and even though he squashed his beef enough to get in the new flick, he's still pissed at Johnny Knoxville and Jeff Tremaine.\n      \n    \n          We got Bam at the Dream Hotel in Hollywood on Monday, and our photog asked him about signing a deal where some of his never-before-seen stunts get featured in the new 'Jackass' movie.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Bam takes us down memory lane and explains why his appearance is going to be limited to old content that's never seen the light of day ... safe to say there are still a lot of wounds there.\n      \n\n          Steve-O is trying to get the band back together for the new flick, but Bam makes it clear to us he's still got major beef with Knoxville and Tremaine. Maybe Chris Pontius could convince him ... based on what Bam says here.\n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          Check out the clip ... things are going well for Bam outside the 'Jackass' franchise, it seems.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Bam Margera\n              \n                          \n                Johnny Knoxville\n              \n                          \n                Celebrity News\n              \n                          \n                Jackass\n              \n                          \n                Movies\n              \n                          \n                Exclusive\n              \n                          \n                In The Field\n              \n                          \n                Celebrity Feuds\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bam Margera Says He Won't Film New Stunts For New 'Jackass' Movie",
      "image": [
        "https://imagez.tmz.com/image/39/16by9/2026/01/12/39e73f3d882248fca9969dfd2570511e_xl.png"
      ],
      "datePublished": "2026-01-13T00:25:55.000Z",
      "dateModified": "2026-01-13T00:25:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]