[
  {
    "title": "Jodie Foster, Guillermo del Toro, Raouya and Hussein Fahmi to Be Honored at Marrakech Film Festival",
    "url": "https://variety.com/2025/film/global/jodie-foster-guillermo-del-toro-raouya-hussein-fahmi-marrakech-1236568966/",
    "image": "https://variety.com/wp-content/uploads/2025/11/Marrakech_822ecd.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-04T08:00:00.000Z",
    "description": "\n\tMarrakech Film Festival will pay tribute to U.S. actor-director Jodie Foster, Mexican director Guillermo del Toro, Moroccan actress Raouya and Husse",
    "body": "\n\tMarrakech Film Festival will pay tribute to U.S. actor-director Jodie Foster, Mexican director Guillermo del Toro, Moroccan actress Raouya and Hussein Fahmi, an Egyptian actor, director and producer, at its 22nd edition, which runs from Nov. 28 to Dec. 6.\n\n\tFoster will introduce her new film “Vie Privée” (A Private Life) by director Rebecca Zlotowski, while Del Toro will present “Frankenstein.”\n\n\n\tIn a statement, Foster said, “What an honor to discover your beautiful city of Marrakech and to celebrate film at the same time. I can’t wait to experience the historic sites, gardens, and markets, to walk alongside new friends, colleagues, and movie lovers.”\n\t\n\n\tDel Toro said, “I am thrilled to be invited to return to the wonderful Marrakech International Film Festival. Since my previous visit, both the festival and the city have always been so welcoming to me. I’m especially honored to receive a tribute, and to show the audience my most personal work, ‘Frankenstein.’”\n\n\tRaouya said, “What joy and emotion to be celebrated in my own country, in the ochre city, at one of its largest film events. Above all, my connection to the festival is a story of friendship and loyalty. Every encounter with Marrakech and its audience remains a precious moment for me—I have so many memories of exciting films and exchanges.”\n\n\tFahmi said, “Being one of those who attended the festival’s first edition, it gives me a great energy and enthusiasm to get together again with colleagues and friends from across the globe. The city of Marrakech has a special place in my heart as one of my earliest films, ‘Damy wadmoy waebtsamty’ (My Blood, My Tears, My Smile) was shot there. Coming back to this joyful city to be honored is a very precious moment.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jodie Foster, Guillermo del Toro, Raouya and Hussein Fahmi to Be Honored at Marrakech Film Festival",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/Marrakech_822ecd.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-04T08:00:00.000Z",
      "dateModified": "2025-11-04T08:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Strong Island Locks Film and TV Rights to Ken Bruen’s Inspector Brant Franchise (EXCLUSIVE)",
    "url": "https://variety.com/2025/film/global/strong-island-ken-bruen-inspector-brant-1236569235/",
    "image": "https://variety.com/wp-content/uploads/2025/11/Bruen.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-04T07:54:58.000Z",
    "description": "\n\tChristopher Tuffin’s Strong Island has secured worldwide feature film and television rights to the Inspector Brant crime-novel series from the estat",
    "body": "\n\tChristopher Tuffin’s Strong Island has secured worldwide feature film and television rights to the Inspector Brant crime-novel series from the estate of the late Irish author Ken Bruen, whose hard-bitten London detective was first brought to the screen by Jason Statham in the 2011 film “Blitz.”\n\n\tUnder the pact, Strong Island will develop a new cycle of Brant films, launching with adaptations of Bruen’s “Calibre” and “Vixen.” British writer-director Tom Edmunds (“Dead in a Week”) is set to pen and helm both projects. Edmunds most recently wrapped the period action-thriller “The Butler” for Strong Island, starring Jean Reno and Tom Hollander, with Molly McCann also aboard. That film, set in 1920s London and produced by Tuffin, is currently in post-production.\n\t\n\n\tTuffin will produce the Inspector Brant pictures through Strong Island. He’s simultaneously shepherding a busy slate that includes the completed “Alphas” with Martin Henderson; a remake of the John Wayne western “Angel and the Badman”; “Last Meals,” toplined by Mads Mikkelsen (“Another Round,” “The Promised Land”) and Boyd Holbrook (“Narcos,” “Indiana Jones and the Dial of Destiny”); and “Princess,” starring Lucy Hale (“Pretty Little Liars,” “The Hating Game”). He also has a remake of “The Others” set up at Universal.\n\n\n\tTuffin past releases include “Canary Black,” starring Kate Beckinsale (number one on Amazon Prime), “Freelance” with John Cena (number one on Hulu, number two on Netflix), “Peppermint” with Jennifer Garner (which opened at number two domestically before reaching number one on Netflix), and “Sound of Freedom,” which bowed to $14 million on its first day and went on to gross more than $250 million worldwide.\n\t\n\n\tJoel Gotler represented the Bruen estate in association with the Philip Spitzer Agency and will executive produce alongside the estate of the late author. Jere Hausfater repped Strong Island.\n\n\tA promo for “The Butler” will be screening at the American Film Market on Nov. 11 at 11 a.m. at the AMC Century City 13, with K5 Intl. handling sales.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Strong Island Locks Film and TV Rights to Ken Bruen’s Inspector Brant Franchise (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/Bruen.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-04T07:54:58.000Z",
      "dateModified": "2025-11-04T07:54:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jonathan Bailey Named People’s 2025 Sexiest Man Alive",
    "url": "https://variety.com/2025/film/news/jonathan-bailey-people-2025-sexiest-man-alive-1236569171/",
    "image": "https://variety.com/wp-content/uploads/2025/11/GettyImages-2244240431.jpg?crop=0px%2C246px%2C6000px%2C3375px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-11-04T05:07:46.000Z",
    "description": "\n\tJonathan Bailey has been named People’s Sexiest Man Alive for 2025.\n\n\tThe selection was unveiled Monday night on “The Tonight Show Starring Jimmy Fa",
    "body": "\n\tJonathan Bailey has been named People’s Sexiest Man Alive for 2025.\n\n\tThe selection was unveiled Monday night on “The Tonight Show Starring Jimmy Fallon.”\n\n\t“It’s an honor of a lifetime,” Bailey said of the title. “And I want to say, Jimmy, thank you so much for turning it down so I could be here.”\n\n\t2025 marks the 40th anniversary of the Sexiest Man Alive award. As Bailey sat down for his interview, Fallon unveiled Bailey’s two covers. One features him chest deep in a rocky ocean, and the other features him shirtless while holding a fluffy dog. \n\t\n\n\tBailey explained he first heard he was the Sexiest Man Alive at the beginning of 2025 while appearing in a production of Shakespeare’s “Richard II.” \n\n\n\t“The only thing madder than doing ‘Richard II’ was to be invited into this,” Bailey said. “And also in 2025, I’m sort of thrilled that People Magazine has invited someone in, to bestow this honor on someone who can really cherish the value of a sexy man.”\n\n\tWhen asked if he thinks people are going to treat him differently after winning Sexiest Man Alive, Bailey joked, “I fucking hope so.”\n\n\tBailey’s was widely introduced to TV audiences in 2020 as the titular Lord Anthony Bridgerton on Netflix’s royal drama series “Bridgerton.” More recently, the British actor has broken onto the big screen playing Prince Fiyero in “Wicked” and Dr. Henry Loomis in “Jurassic World: Rebirth.”\n\n\tPeople’s Sexiest Man Alive feature has been an annual staple for the publication since 1985, with the first-ever honoree being Mel Gibson. 2024’s winner was John Krasinski. Other recent recipients include Patrick Dempsey, Chris Evans, Paul Rudd, Michael B. Jordan and John Legend.\n\t\n\n\tRead Bailey’s Sexiest Man Alive interview with People here. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jonathan Bailey Named People’s 2025 Sexiest Man Alive",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/GettyImages-2244240431.jpg?crop=0px%2C246px%2C6000px%2C3375px&resize=1000%2C563"
      ],
      "datePublished": "2025-11-04T05:07:46.000Z",
      "dateModified": "2025-11-04T05:07:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How Netflix’s ‘Culinary Class Wars’ Turned Korean Cultural Codes Into a Global Cooking Show Phenomenon – Taiwan Creative Content Fest",
    "url": "https://variety.com/2025/tv/markets-festivals/culinary-class-wars-netflix-tccf-1236569228/",
    "image": "https://variety.com/wp-content/uploads/2025/11/Culinary-Class-Wars.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-04T06:52:47.000Z",
    "description": "\n\tNetflix’s first Korean culinary competition series has quickly become a breakout global hit — with Taiwan ranking among its most enthusiastic market",
    "body": "\n\tNetflix’s first Korean culinary competition series has quickly become a breakout global hit — with Taiwan ranking among its most enthusiastic markets. \n\n\tThe Taiwan Creative Content Fest hosted producer Eunji Kim of Studio Slam, who broke down how the series evolved from a rough idea into a fully realized format.\n\n\tBefore “Culinary Class Wars,” Kim and her team produced the 2020 talent show “Sing Again,” which spotlighted Korean singers who had released albums but never found mainstream recognition. That experience formed the foundational idea for their next project. “We wanted to make a competition show for chefs,” Kim said. “But our first question was: how do we stand out against long-running giants like ‘Top Chef’?”\n\t\n\n\tFor the team, the answer was rooted in local culture. “This is a Korean variety show. We needed a cultural symbol that speaks directly to Korean audiences,” Kim noted. In Korea, the spoon is a potent symbol of social class. That concept inspired one of the show’s defining visual cues: the split between white-spoon chefs, representing the culinary elite, and black-spoon chefs, representing lesser-known talent.\n\n\n\tNot all participants immediately embraced the class-based format, but the creative team considered it central to the show’s DNA. From early development, they committed to the dramatic tension of a concealed classification system as the core engine of the competition. “From a production standpoint, we held firm to the show’s structure,” Kim said. “But how the chefs performed — how they presented themselves, how they marketed themselves — that was entirely improvised.”\n\t\n\n\tThrough careful editing and narrative shaping, the team ultimately found that cultural specificity didn’t limit the show; instead, its themes resonated widely with international viewers. Following the first season’s success, the response from the culinary community shifted dramatically. “For Season 2, many chefs who turned us down the first time actually came back to us after watching the show,” Kim revealed. “That boomerang effect proved that our approach wasn’t just creatively sound — it had real commercial value.”\n\n\tFrom Korean cuisine and culturally rooted symbols to a competition format that speaks a universal entertainment language, “Culinary Class Wars” has achieved exceptional visibility on Netflix while pioneering a new style of reality-competition storytelling. As the series heads into a new season, global audiences are eagerly anticipating even more compelling narratives that go far beyond the kitchen.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How Netflix’s ‘Culinary Class Wars’ Turned Korean Cultural Codes Into a Global Cooking Show Phenomenon – Taiwan Creative Content Fest",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/Culinary-Class-Wars.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-04T06:52:47.000Z",
      "dateModified": "2025-11-04T06:52:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Harrison Ford Makes Surprise Appearance at Fellow ‘Star Wars’ Actors Joel Edgerton and Felicity Jones’ ‘Train Dreams’ Premiere",
    "url": "https://variety.com/2025/film/columns/harrison-ford-surprise-appearance-star-wars-joel-edgerton-felicity-jones-train-dreams-premiere-1236569148/",
    "image": "https://variety.com/wp-content/uploads/2025/11/MAB_2878.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-04T05:34:06.000Z",
    "description": "\n\tFelicity Jones admits she was at a loss for words when she met fellow “Star Wars” star Harrison Ford for the first time on Monday night at the Los A",
    "body": "\n\tFelicity Jones admits she was at a loss for words when she met fellow “Star Wars” star Harrison Ford for the first time on Monday night at the Los Angeles premiere of her new drama “Train Dreams.”\n\n\t“That was a real moment for me,” Jones, who starred as Jyn Erso in “Rogue One: A Star Wars Story,” told me, adding, “Obviously, he’s like the forefather of the whole universe. It’s like meeting my great ancestral figure.”\n\t\n\n\n\t“I was a little bit speechless, taken aback,” she said. “I actually really studied him, studied his work to play Jyn Erso in the film. He was a massive, massive inspiration, particularly what he does in ‘Indiana Jones.’ I watched them over and over and over again because I wanted to have some of that looseness that he has to be in her. It was very special, the worlds colliding tonight.”\n\n\n\tJones’ co-star Joel Edgerton, who played Owen Lars in two “Star Wars” movies, as well in the television series “Obi-Wan Kenobi,” invited Ford to the premiere. The two have become close since Edgerton directed Ford in an ad campaign last year for Glenmorangie Scotch Whisky. “He’s a good enough friend to want to support the film and hang out and that made me feel very special,” Edgerton said.\n\n\n\tDirected and co-written by Clint Bentley, “Train Dreams” is based Denis Johnson’s novella of the same name about a logger and railroad man (Edgerton) in the early 20th century contemplating life as he experiences work, love (Jones plays his wife) and death.\n\t\n\n\tEdgerton felt the movie would resonate with Ford because he “lives out in the wilderness in Wyoming and he’s very connected to nature.”\n\n\tFord also is a “working man,” who was a carpenter before he become the “greatest” movie star of “all time,” Edgerton said. “In fact, I tried to buy a house back about eight years ago and the realtor said, ‘You know, one of the cool things about this house is Harrison Ford built the kitchen.’ And when I worked with Harrison, I told him this story, and he goes, ‘Yeah,’ and he told me the address of the house.”\n\n\tEdgerton also revealed that he had a “great” reunion with George Lucas on Saturday at the LACMA Art+Film Gala: “I tapped him on the shoulder and was literally like, ‘It’s Uncle Owen.'”\n\n\t“Train Dreams” will be released in select theaters in the U.S. on Nov. 7, before streaming on Netflix globally on Nov. 21. The film is gaining awards season traction, picking up two Gotham Film Awards nominations last week for best feature and best adapted screenplay.\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Harrison Ford Makes Surprise Appearance at Fellow ‘Star Wars’ Actors Joel Edgerton and Felicity Jones’ ‘Train Dreams’ Premiere",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/MAB_2878.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-04T05:34:06.000Z",
      "dateModified": "2025-11-04T05:34:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jon Stewart Thanks Fans as He Renews as ‘Daily Show’ Host for Another Year: ‘We Don’t Take For Granted in Any Way How Much Your Support Means’",
    "url": "https://variety.com/2025/tv/news/jon-stewart-thanks-fans-renews-daily-show-host-1236569154/",
    "image": "https://variety.com/wp-content/uploads/2025/11/MixCollage-03-Nov-2025-08-22-PM-8591.jpg?crop=0px%2C2px%2C1200px%2C675px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-11-04T04:38:28.000Z",
    "description": "\n\tOn this week’s episode of “The Daily Show,” Jon Stewart gave a special shout-out to his fans as he renewed his agreement to host Comedy Central‘s la",
    "body": "\n\tOn this week’s episode of “The Daily Show,” Jon Stewart gave a special shout-out to his fans as he renewed his agreement to host Comedy Central‘s late-night program through 2026.\n\n\t“Lots of news to discuss, including, apparently, something I read today, that ‘The Daily Show’ will be coming back for another year,” Stewart joked at the top of Monday night’s episode to rapturous applause. “We got another year. It is our 30th year when we come back on the air. And like most 30-year-olds, we are still thinking about going to law school.”\n\t\n\n\tHe continued, “But listen, we want to thank everybody. We don’t take for granted in any way how much your support means, so that we get a chance to keep making the best show that we can make for you. So we truly appreciate that. Thank you.”\n\n\n\tParamount and CBS announced Monday that Stewart will remain host and executive producer of “The Daily Show” through December 2026. He will continue to helm the show every Monday, and the show’s other contributors will host Tuesday through Thursday as usual.\n\n\t“Jon Stewart continues to elevate the genre he created. His return is an ongoing commitment to the incisive comedy and sharp commentary that define ‘Daily Show,'” said Ari Pearce, head of Comedy Central, in a statement. “The renewal is a win for audiences, for Comedy Central and for all our programming partners. We’re proud to support Jon and the extraordinary news team.”\n\n\tStewart’s renewal comes during an industry low for late-night programming. In July, CBS unveiled its plans to cancel Stephen Colbert’s “Late Show” after the next TV season, citing the move as a “financial decision.” “Jimmy Kimmel Live!” also came under fire in September. ABC, along with two of the nation’s largest TV-station owners, sidelined the show after the host made on-air comments about the death of conservative activist Charlie Kirk.\n\t\n\n\tWatch the entire monologue below. \n\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jon Stewart Thanks Fans as He Renews as ‘Daily Show’ Host for Another Year: ‘We Don’t Take For Granted in Any Way How Much Your Support Means’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/MixCollage-03-Nov-2025-08-22-PM-8591.jpg?crop=0px%2C2px%2C1200px%2C675px&resize=1000%2C563"
      ],
      "datePublished": "2025-11-04T04:38:28.000Z",
      "dateModified": "2025-11-04T04:38:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "CJ ENM and Far EasTone Lead Launch of Twin Content Funds at Taiwan Creative Content Fest",
    "url": "https://variety.com/2025/film/markets-festivals/cj-enm-global-funds-taiwan-creative-content-fest-1236569139/",
    "image": "https://variety.com/wp-content/uploads/2025/11/CJ-ENM-signing.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-04T05:09:21.000Z",
    "description": "\n\tThe 2025 Taiwan Creative Content Fest (TCCF) got down to business with the unveiling of two global-facing investment vehicles — the Taiwan–Korea Ent",
    "body": "\n\tThe 2025 Taiwan Creative Content Fest (TCCF) got down to business with the unveiling of two global-facing investment vehicles — the Taiwan–Korea Entertainment and Cultural Content Fund and the Far EasTone Creative Entertainment Fund — aimed at accelerating international collaboration, co-production and IP development across the Asian content landscape.\n\n\tThe Taiwan–Korea Entertainment and Cultural Content Fund is spearheaded by CJ ENM — Korea’s powerhouse entertainment conglomerate spanning TV, talent management, film and drama production, cinemas and concerts — in partnership with Taiwan’s Far EasTone Telecom and TVBS Group. The NT960 million ($31 million) initiative will drive investment in film, television, music, live entertainment, co-production, distribution and international marketing.\n\t\n\n\tComplementing the bilateral fund, the Far Eastern Creative Entertainment Fund — jointly established by Fubon Cultural Creative, Far EasTone and the Taiwan Creative Content Agency (TAICCA) — focuses on elevating Taiwanese IP globally while introducing world-class works to local audiences. The total fund size is NT600 million ($19.4 million).\n\n\n\tTAICCA chair Sue Wang emphasized that the two funds represent more than a capital infusion — they signal a more mature, globally connected ecosystem. “TCCF has become a key entry point for international companies seeking to collaborate with Taiwan,” she said. “The island is evolving from a creator’s hub into a center for investment and co-production.”\n\n\tSean Cho, VP of international business at CJ ENM, highlighted the strategic potential of the Taiwan–Korea partnership: “By combining Korea’s production expertise with Taiwan’s creative strengths, we aim to develop more internationally impactful works.”\n\t\n\n\tThe launch of these two major funds sets a strong tone for TCCF 2025 as the event continues to expand its role as a leading hub for Asian creative industries. It was a busy morning for CJ ENM with the unveiling of a major content partnership with Disney+ to bring its streamer Tving’s content to Japan. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "CJ ENM and Far EasTone Lead Launch of Twin Content Funds at Taiwan Creative Content Fest",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/CJ-ENM-signing.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-04T05:09:21.000Z",
      "dateModified": "2025-11-04T05:09:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rana Daggubati’s Spirit Media Sets Aravind Adiga’s ‘Last Man in Tower’ as Hindi Debut, Unveils Five-Film Slate, Including Dulquer Salmaan’s ‘Kaantha’ (EXCLUSIVE)",
    "url": "https://variety.com/2025/film/news/rana-daggubati-spirit-media-aravind-adiga-last-man-in-tower-1236569218/",
    "image": "https://variety.com/wp-content/uploads/2025/11/Kaantha-Rana-Daggubati.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-04T06:23:46.000Z",
    "description": "\n\t“Baahubali” star Rana Daggubati‘s Spirit Media is making a leap into Hindi-language cinema with an adaptation of Booker winner Aravind Adiga’s accla",
    "body": "\n\t“Baahubali” star Rana Daggubati‘s Spirit Media is making a leap into Hindi-language cinema with an adaptation of Booker winner Aravind Adiga’s acclaimed novel “Last Man in Tower,” starring Manoj Bajpayee and directed by Ben Rekhi.\n\n\tThe announcement comes as part of a five-film slate spanning the Tamil, Telugu and Hindi languages that the Hyderabad-based studio unveiled, just ahead of the release of its first home production, “Kaantha,” the Tamil period-noir drama thriller starring Dulquer Salmaan.\n\t\n\n\tThe untitled adaptation of “Last Man in Tower” marks a significant milestone for Spirit Media as it expands beyond South Indian cinema. The film delves into the moral compromises that accompany ambition, the fragility of human relationships under pressure and the shifting fabric of contemporary India.\n\n\n\t“With ‘Kaantha’ releasing soon, I’m thrilled to announce Spirit’s Hindi production debut with the adaptation of ‘Last Man in Tower,'” said Daggubati, founder of Spirit Media. “Manoj Bajpayee has played so many iconic roles, and to partner with him on a story like this — we couldn’t have had a better team of collaborators to do our first Hindi film with.”\n\n\t“With ‘Kaantha,’ the adaptation of ‘Last Man in Tower,’ and the other films we’re supporting in different capacities — have all given us a chance to partner with different creative teams — directors, writers and producers. Our goal remains to shape Spirit Media into a creative home for independent producers, a space that nurtures collaboration and storytelling across industries and languages.”\n\n\tBajpayee spoke to the weight of adapting such material. “When a book with such depth moves to screen, the responsibility is both meaningful and inspiring,” he said. “And with Rana Daggubati’s studio behind it, there is a strong sense of purpose and backing. Their belief in sincere storytelling gives the film the space and confidence it deserves. Working with Ben Rekhi has been a very rewarding experience.”\n\t\n\n\tDirector Rekhi praised the source material: “Aravind Adiga is one of the greatest writers of our generation, and once again he is ahead of his time. I’m so thrilled to have worked with such incredible collaborators to bring his brilliant book to life.”\n\n\tThe slate also includes “Kaantha,” set for release Nov. 14, which reunites Spirit Media with Dulquer Salmaan. “I heard the story of ‘Kaantha’ in 2019 and fell in love instantly,” Salmaan said. “It truly is a labour of love and one of the most special films in my career. The process of partnering with newer creative talent and Rana as a producer has been a really fulfilling experience.”\n\n\tRounding out the lineup are Telugu-language productions “Dark Chocolate,” a pulpy thriller dark-comedy co-produced with Waltair Productions; “Psyche Siddharth,” a debut feature that Spirit Media will present and distribute; and “Premante,” a love-comedy-thriller backed by the studio and debut producer Jhanvi Narang.\n\n\tSpirit Media has positioned itself as a champion of independent cinema, recently backing Cannes winner “All We Imagine As Light” and Sundance winner “Cactus Pears” for theatrical distribution across India.\n\n\tFounded in 2005, Spirit Media specializes in original content development and distribution, talent management and creative brand marketing services, with headquarters in Hyderabad.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rana Daggubati’s Spirit Media Sets Aravind Adiga’s ‘Last Man in Tower’ as Hindi Debut, Unveils Five-Film Slate, Including Dulquer Salmaan’s ‘Kaantha’ (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/Kaantha-Rana-Daggubati.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-04T06:23:46.000Z",
      "dateModified": "2025-11-04T06:23:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Disney+ Japan Inks Major Content Deal With CJ ENM’s Tving",
    "url": "https://variety.com/2025/tv/news/disney-japan-inks-content-deal-cj-enm-tving-1236569111/",
    "image": "https://variety.com/wp-content/uploads/2025/11/Disney-CJ-ENM.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-04T02:25:44.000Z",
    "description": "\n\tDisney+ has secured a landmark multi-year content partnership with CJ ENM to bring South Korean streaming service Tving’s premium content to Japan f",
    "body": "\n\tDisney+ has secured a landmark multi-year content partnership with CJ ENM to bring South Korean streaming service Tving’s premium content to Japan for the first time. \n\n\tThe deal positions Disney+ as a key SVOD partner for Tving in the critical Japanese market, with up to 60 of the Korean streamer’s top-performing originals and CJ ENM drama series set to launch on the platform. Content begins rolling out Nov. 5, featuring fan-favorite titles including “Guardian: The Lonely and Great God” and “Reply 1988.”\n\t\n\n\tLeading the charge is “Dear X,” starring Kim Yoo-jung, Kim Young-dae and Kim Do-hoon, which will stream exclusively on Disney+ Japan starting Nov. 6 in a day-and-date release with its Korean debut.\n\n\n\tTo showcase the expanded Korean content library, Disney+ Japan will introduce “Tving Highlights” as a dedicated feature on its homepage, positioned alongside the streamer’s franchise tentpoles and original programming. Subscribers will also gain access to “Tving Collection,” a curated hub aggregating TVING’s diverse slate of emotionally driven and genre-defining series.\n\n\t“As we celebrate five years of Disney+ in Japan, we remain committed to expanding our content offerings to reflect the diverse preferences of audiences,” said Tamotsu Hiiro, managing director of The Walt Disney Company (Japan) Ltd. “This collaboration with CJ ENM and Tving is a significant step forward in that journey.”\n\n\tJulie Choi, CEO of Tving, framed the partnership as a strategic move to expand the service’s global footprint. “Our partnership with Disney, which has a strong presence and deep history in Japan, is an opportunity to most effectively present Tving content to local viewers,” Choi said. “Through this partnership with Disney, we aim to grow beyond Korea’s No. 1 OTT [streamer] into a truly global K-OTT platform.”\n\t\n\n\tTony Zameczkowski, senior VP and GM of DTC for Asia Pacific at The Walt Disney Company, called the collaboration “a pivotal moment in our regional content and partnership strategy.”\n\n\t“As Korean storytelling continues to captivate global audiences, we’re proud to bring CJ ENM and Tving’s most compelling series to Disney+ viewers in Japan,” Zameczkowski said. “This partnership not only strengthens our Korean content offering but is the beginning of a broader opportunity to deepen our connection with audiences in one of the world’s most dynamic streaming markets.”\n\n\tThe deal builds on Disney+’s existing Korean content slate, which includes originals “Moving,” “The Worst of Evil” and “Tempest,” alongside Japanese originals such as “Gannibal” and “Disney Twisted-Wonderland: The Animation.“​​​​​​​​​​​​​​​​\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Disney+ Japan Inks Major Content Deal With CJ ENM’s Tving",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/Disney-CJ-ENM.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-04T02:25:44.000Z",
      "dateModified": "2025-11-04T02:25:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Taiwan Creative Content Fest Opens With Record International Participation as Local Hit ’96 Minutes’ Crosses Box Office Milestone",
    "url": "https://variety.com/2025/film/markets-festivals/taiwan-creative-content-fest-international-attendance-1236569150/",
    "image": "https://variety.com/wp-content/uploads/2025/11/TCCF-2025-opening.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-04T04:38:57.000Z",
    "description": "\n\tThe 2025 Taiwan Creative Content Fest (TCCF) kicked off with record-breaking international attendance and a major box office milestone, as Taiwan’s ",
    "body": "\n\tThe 2025 Taiwan Creative Content Fest (TCCF) kicked off with record-breaking international attendance and a major box office milestone, as Taiwan’s Minister of Culture Li Yuan revealed that local action thriller “96 Minutes” has crossed NT$200 million ($6.4 million) at the country’s box office.\n\n\tThe achievement marks a dramatic turnaround for Taiwan’s film industry, which nearly collapsed in the early 21st century when local productions were earning less than NT$1 million per film. “If you know that situation, you’ll understand how we struggled for 10 to 20 years before Taiwan’s film and television industry rose again,” Li said during the opening ceremony.\n\t\n\n\tThe market has drawn an unprecedented international contingent, with South Korea sending the largest delegation of nearly 100 representatives, followed by France with 80 delegates who also established a national pavilion. Delegations from Japan, Hong Kong, Singapore, Thailand and the Philippines are also attending, marking the highest number of participating countries, delegates and project pitches in TCCF’s history.\n\n\n\tTaiwan Creative Content Agency (TAICCA) chair Sue Wang attributed the breakthrough to collaborative participation across the industry. “This year’s TCCF has achieved a major breakthrough — whether it’s the number of participating countries, the number of delegations, or the number of proposals, all are at record highs,” Wang said.\n\n\tLi emphasized Taiwan’s growing international visibility, recounting a September meeting in France with CNC president Gaëtan Bruel, who expressed strong interest in Taiwan’s VR/AR capabilities. “He said France looks carefully at where to invest in each place, and Taiwan will definitely be a very important investment point globally in the future,” Li recalled. “When I saw him, I didn’t know if he was serious or not, but I felt Taiwan has finally been seen.” Li noted that Bruel delivered on his promise, bringing 80 delegates to the festival.\n\t\n\n\tBruel attended the opening alongside Chilean Trade Office director Fernando Mariano Schmidt Hernández and executives from Chunghwa Telecom. \n\n\tThe minister highlighted that Taiwan established TAICCA six years ago after recognizing that the content industry represents a strategic sector. \n\n\tLi outlined three critical directions for Taiwan’s content industry: cross-domain collaboration to build IP, embracing technology including AI and VR/AR in production methods, and international expansion. “Taiwan’s market of 23 million people cannot sustain our own film and television products,” he said. “Taiwan’s film and television workers work very hard to sell their films around the world.”\n\n\tWang framed the moment as both challenging and exhilarating for content creators, producers and investors. “We’re facing a very interesting era where all cultural content paradigms are undergoing dramatic changes and major shifts,” she said. “The fixed time slots and single platforms we saw in the past no longer exist as restrictions on cultural content.”\n\n\tShe described the current environment as “an era for risk-takers,” noting that while collaborations between creators, producers and investors carry high risks, they’re also full of excitement and possibility.\n\n\tWang emphasized that IP development has evolved beyond single-format thinking. “It’s no longer about whether I want to make a movie or a TV series,” she said. “When an IP is created, you have to envision from the beginning what it can be. Every IP has no limits — it can be a technological product, it can be film and television, it can be performing arts, it can be graphic peripherals and so on.”\n\n\tTAICCA positions itself as a connector platform linking creators, producers, investors and international partners. Wang highlighted regional developments including France’s cultural assets combined with new technology, South Korea’s global Hallyu phenomenon, Japan’s strength in animation and manga adaptation, and Singapore’s commercial integration model.\n\n\tThe minister noted that while many MOUs have been signed with countries including France, Japan and South Korea, realizing actual collaborations takes years of negotiation. “I hope that in this conference, we can realize many dreams,” Li said.\n\n\tRecent local films have also attracted international funding, a trend Li hopes will accelerate through platforms like TCCF. “I hope in the future, through occasions like TCCF, we can find many international friends to become our future allies and move toward the international market together,” he said.\n\t\n\n\tWang closed by articulating TAICCA’s vision as creating “cultural content and creative industries that move people, excite people, and make people want to experience them in this new era.”\n\n\t“That is our common goal and common dream sitting here today,” she said. “I hope this dream can, through working together, one day be achieved as we welcome the road to that new era.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Taiwan Creative Content Fest Opens With Record International Participation as Local Hit ’96 Minutes’ Crosses Box Office Milestone",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/TCCF-2025-opening.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-04T04:38:57.000Z",
      "dateModified": "2025-11-04T04:38:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Guess the Fitness Influencer Behind This Baby Bump Pic!",
    "url": "https://www.tmz.com/2025/11/03/guess-the-fitness-influencer-behind-this-baby-bump-pic/",
    "image": "https://imagez.tmz.com/image/1b/16by9/2025/11/03/1bfbcbb007fe44afb46e25fee261fbd3_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-03T23:26:52.000Z",
    "description": "\n    \n                    \n                          Guess The\n                          Fitness Influencer Behind This Baby Bump Pic!\n               ",
    "body": "\n    \n                    \n                          Guess The\n                          Fitness Influencer Behind This Baby Bump Pic!\n                      \n                  \n                        Published November 3, 2025 3:26 PM PST\n                                                                            \n      \n    \n      \n        \n              \n    \n    \n          Can you guess which fitness influencer flaunted her baby bump?! The social media star recently announced her pregnancy ... and now she's giving us a little glimpse of her motherhood journey!\n      \n    \n          To give you a hint ... the soon-to-be mom is known for her motivational workout videos while rocking some fire 'fits!\n      \n    \n          Hit up the gallery to reveal the babe with the bump!\n      \n      \n      \n          \n            \n              \n                \n                Share on Facebook\n              \n            \n            \n              \n                \n                Share on X\n              \n            \n                          \n                \n                  \n                \n              \n                      \n        \n              \n          \n                          \n                Guess Who\n              \n                      \n        \n          \n  ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Guess the Fitness Influencer Behind This Baby Bump Pic!",
      "image": [
        "https://imagez.tmz.com/image/1b/16by9/2025/11/03/1bfbcbb007fe44afb46e25fee261fbd3_xl.jpg"
      ],
      "datePublished": "2025-11-03T23:26:52.000Z",
      "dateModified": "2025-11-03T23:26:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Duncan 'Mac' Mcleod On \"Highlander: The Series\" 'Memba Him?!",
    "url": "https://www.tmz.com/2025/11/04/duncan-mac-mcleod-on-highlander-the-series/",
    "image": "https://imagez.tmz.com/image/a9/16by9/2025/10/17/a908733fd8cc4395880909e7682a4882_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-04T08:01:09.000Z",
    "description": "\n    \n                    \n                          Duncan 'Mac' Mcleod On\n                          \"Highlander: The Series\"\n                       ",
    "body": "\n    \n                    \n                          Duncan 'Mac' Mcleod On\n                          \"Highlander: The Series\"\n                          'Memba Him?!\n                      \n                  \n                        Published November 4, 2025 12:01 AM PST\n                                                                            \n      \n    \n          English actor Adrian Paul was in his early 30s when he first started playing Duncan aka 'Mac' -- the powerful Immortal and champion -- on the action series \"Highlander: The Series\" back in 1992.\n      \n    \n          Paul was part of an ensemble cast including actors, Stan Kirsch, Peter Wingfield and Jim Byrnes.\n      \n    \n          Guess what he looks like now!\n      \n      \n      \n          \n            \n              \n                \n                Share on Facebook\n              \n            \n            \n              \n                \n                Share on X\n              \n            \n                          \n                \n                  \n                \n              \n                      \n        \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                TV\n              \n                          \n                Memba Them\n              \n                          \n                Photo Galleries\n              \n                      \n        \n          \n  ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Duncan 'Mac' Mcleod On \"Highlander: The Series\" 'Memba Him?!",
      "image": [
        "https://imagez.tmz.com/image/a9/16by9/2025/10/17/a908733fd8cc4395880909e7682a4882_xl.jpg"
      ],
      "datePublished": "2025-11-04T08:01:09.000Z",
      "dateModified": "2025-11-04T08:01:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Meghan Trainor Films New Music Video on TMZ Tour Bus",
    "url": "https://www.tmz.com/2025/11/03/meghan-trainor-films-new-music-video-tmz-celebrity-tour-bus/",
    "image": "https://imagez.tmz.com/image/63/16by9/2025/11/03/63418fa168ed4c2e86e71897b22c039c_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-04T00:00:39.000Z",
    "description": "\n    \n                    \n                          Meghan Trainor\n                          All About That Showcase ...\n                          Fi",
    "body": "\n    \n                    \n                          Meghan Trainor\n                          All About That Showcase ...\n                          Films New Music Video on TMZ Tour Bus!!!\n                      \n                  \n                        Published November 3, 2025 4:00 PM PST\n                                                                            \n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          You never know who or what you're going to see on the TMZ Celebrity Tour ... and today it was Meghan Trainor filming a music video for a new song ... and she got on the bus with cameras rolling!!!\n      \n    \n          Our tour bus was cruising through Beverly Hills when we spotted Meghan on the corner of Beverly Drive filming a music vid for her upcoming single, \"Nope, I Still Don't Care.\"\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Meghan smiled and waved as we leaned out the window and told her someone on the bus was celebrating a birthday, and she sent love and wishes ... then went one step further.\n      \n\n          As we drove away to let Meghan do her thing, someone from her team ran after our bus and asked us to turn around ... and we obliged.\n      \n    \n          Meghan hopped on the bus with cameras in tow and took selfies with everyone on board ... and she even filmed some content for her music video.\n      \n    \n          Check out the clip ... and get your TMZ Celebrity Tour tickets now!!!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Meghan Trainor\n              \n                          \n                TMZ Tours\n              \n                          \n                Music\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Meghan Trainor Films New Music Video on TMZ Tour Bus",
      "image": [
        "https://imagez.tmz.com/image/63/16by9/2025/11/03/63418fa168ed4c2e86e71897b22c039c_xl.jpg"
      ],
      "datePublished": "2025-11-04T00:00:39.000Z",
      "dateModified": "2025-11-04T00:00:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Man Shot In Neck at New York State University, Campus on Lockdown",
    "url": "https://www.tmz.com/2025/11/03/man-shot-neck-suny-morrisville/",
    "image": "https://imagez.tmz.com/image/0d/16by9/2025/11/03/0deddcd327d84482b2a52c006a295601_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-03T23:57:11.000Z",
    "description": "\n    \n                    \n                          SUNY Morrisville\n                          Man Shot In Neck ...\n                          Campus ",
    "body": "\n    \n                    \n                          SUNY Morrisville\n                          Man Shot In Neck ...\n                          Campus On Lockdown\n                      \n                  \n                        Published November 3, 2025 3:57 PM PST\n                                                                      |\n                Updated November 3, 2025 4:28 PM PST\n                                    \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          A 20-year-old man was shot in the neck inside a campus building at a state university in New York ... and police are searching for the shooter.\n      \n    \n          State Police say the shooting went down Monday afternoon on the SUNY Morrisville campus ... with shots ringing out inside the South Hall dormitory.\n      \n    \n          Troopers responded to a 911 call and found a 20-year-old man -- who is not a student -- suffering from a gunshot wound to the neck ... and he was rushed to a hospital.\n      \n\n                  \n          \n                          \n                \n                                  \n      \n    \n          The campus remains on lockdown as officers go building to building, clearing the area floor by floor. SWAT teams are on hand, and cops are using bloodhounds too.\n      \n    \n          WSTM-TV in Syracuse reports the shooting occurred around 3:45 PM local time.\n      \n    \n          Reports say a suspect was spotted running from South Hall after the shooting ... and cops have set up a perimeter ... with fire trucks and police cars stationed at all campus entrances.\n      \n    \n          Students are being evacuated on school buses borrowed from a nearby elementary school.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          SUNY Morrisville is about 40 miles outside Syracuse in Upstate New York.\n      \n    \n          So far, troopers say there is just the one victim.\n      \n    \n          Gov. Kathy Hochul addressed the incident on social media, saying ... \"I have been briefed on the shooting on campus at SUNY Morrisville. New York State Police are assisting local law enforcement and SUNY leadership as they respond to this situation. The campus remains on lockdown until further notice.\"\n      \n    \n          Story developing ...\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Weapons & Guns\n              \n                          \n                Breaking News\n              \n                          \n                Fairly Legal\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Man Shot In Neck at New York State University, Campus on Lockdown",
      "image": [
        "https://imagez.tmz.com/image/0d/16by9/2025/11/03/0deddcd327d84482b2a52c006a295601_xl.jpg"
      ],
      "datePublished": "2025-11-03T23:57:11.000Z",
      "dateModified": "2025-11-03T23:57:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cop Car Rolls Over Suspect When Officer Forgets to Put It in Park, on Video",
    "url": "https://www.tmz.com/2025/11/03/toronto-police-run-over-suspect/",
    "image": "https://imagez.tmz.com/image/a1/16by9/2025/11/03/a147360a23874d2a875fc2c416831a3d_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-03T21:12:42.000Z",
    "description": "\n    \n                    \n                          Toronto\n                          Cops Run Over Suspect, Twice ...\n                          Put ",
    "body": "\n    \n                    \n                          Toronto\n                          Cops Run Over Suspect, Twice ...\n                          Put It in Park, Eh?!?\n                      \n                  \n                        Published November 3, 2025 1:12 PM PST\n                                                                      |\n                Updated November 3, 2025 1:55 PM PST\n                                    \n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          A suspect in Toronto over the weekend had a pretty rough arrest ... 'cause he was accidentally run over by the same cop car, TWICE.\n      \n    \n          Here's the deal ... viral video shows police officers firing a Taser at a man in a parking lot, and he freezes up and falls to the ground. While cops rush over to cuff him, an officer in a cruiser behind them jumps out -- but apparently forgets to put the vehicle in park, as it rolls forward over the suspect's legs and hitting the officer on top of him.\n      \n    \n      \n      I’m shocked and horrified.Police INCOMPETENTLY run over a suspect.The officer exits his car before putting it in park. Gets control of the car and runs over the suspect — again.Then they tell him “get down.” After he can’t move.Toronto's finest. pic.twitter.com/y3zSPaOBvn— dahlia kurtz ✡︎ דליה קורץ (@DahliaKurtz) November 3, 2025\n              @DahliaKurtz\n          \n  \n    \n          As a couple of the cops push the SUV backward off the man, the driver gets back in ... and apparently guns it, rolling the front tires over the suspect, AGAIN. The cop finally hits it into reverse -- and toots the horn twice.\n      \n\n          Toronto Police tell TMZ ... the incident occurred Saturday when officers responded to reports of a person armed with knives who was damaging vehicles.\n      \n    \n          Despite how bad it looks ... we're told both the suspect and a cop who was also hit are OK -- the suspect just needed medical attention for his Taser injuries. Toronto Police tell us they are \"reviewing the circumstances.\"\n      \n    \n          We've heard of roll call ... but that was ridiculous!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Insane Videos\n              \n                          \n                Exclusive Details\n              \n                          \n                Fairly Legal\n              \n                          \n                News\n              \n                          \n                Police\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cop Car Rolls Over Suspect When Officer Forgets to Put It in Park, on Video",
      "image": [
        "https://imagez.tmz.com/image/a1/16by9/2025/11/03/a147360a23874d2a875fc2c416831a3d_xl.jpg"
      ],
      "datePublished": "2025-11-03T21:12:42.000Z",
      "dateModified": "2025-11-03T21:12:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]