[
  {
    "title": "‘I Want Your Sex’ Review: Olivia Wilde and Cooper Hoffman Are Hot for One Another in Gregg Araki’s Unapologetically Randy Rom-Com",
    "url": "https://variety.com/2026/film/reviews/i-want-your-sex-review-1236639774/",
    "image": "https://variety.com/wp-content/uploads/2026/01/I-Want-Your-Sex.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-24T06:57:44.000Z",
    "description": "\n\tSure, the devil wears Prada, but what does an aggressive contemporary artist wear to work? How about a see-through dress and stiletto heels? Kinky c",
    "body": "\n\tSure, the devil wears Prada, but what does an aggressive contemporary artist wear to work? How about a see-through dress and stiletto heels? Kinky costumes are just a fraction of the fun in Gregg Araki’s “I Want Your Sex,” which stars Olivia Wilde as Erika Tracy, the most domineering movie boss since James Spader in “Secretary” (the last BDSM-themed workplace comedy to premiere at Sundance). Cooper Hoffman plays her all-too-eager subordinate in a film that’s fully liberated where sex and nudity are concerned, but kind of old-fashioned when it comes to the interpersonal dynamics between its lusty leads.\n\t\n\n\tSurprisingly enough, “I Want Your Sex” shares a decent amount of common ground with screwball classics like “The Shop Around the Corner” and “His Girl Friday” — not that anyone in the target demographic will be making the connection. For Araki, who most recently tried remixing familiar themes for a new generation with “Now Apocalypse,” this unconventional rom-com feels like a natural extension of the queer indie pioneer’s sex-positive sensibility, even as he steers things into novel territory.\n\n\n\tInfinitely less punk that his early work, though still edgier than nearly everything else out there, “I Want Your Sex” represents a sincere attempt by Araki to connect with the kids, whose relationship to sex couldn’t be more confusing to a child of the ’60s: Whereas Araki is a child of the Swinging ’60s, the neuter-minded audience for this movie grew up overexposed to porn and insecure about intimacy, but relatively considerate when it comes to consent. That’s why Hoffman’s Elliot seems so thrilled to find himself at Erika’s service: When she’s in charge, “I don’t have to make any decisions,” he beams, more than happy to relinquish control. But even that freedom can go too far.\n\t\n\n\tAs the movie opens, Elliot stumbles out of Erika’s posh mansion in a blood-splattered pink bra and panties, only to discover his boss floating face down in the pool. Cut to a police interrogation room, where a straight-faced Margaret Cho and Johnny Knoxville grill Elliot about what happened. “9 1/2 weeks earlier,” reads the fluorescent pink caption (Araki is second only to Almodóvar when it comes to ultra-saturated color schemes), winking at ’80s cine-kinkster Adrian Lyne.\n\n\tMost erotic movies come with an element of danger, and though this one starts off with Elliot under suspicion for Erika’s death, Araki can’t resist leaning into the comedy — and why not? Sex should be joyful, and even when there’s degradation and pain play involved (pig masks and ball gags, handcuffs and sharp heels), he clearly thinks it’s more fun to laugh alongside the participants than to go down whatever dark black rabbit hole directors like David Cronenberg and the Wachowskis do with their leather and latex.\n\n\tAraki movies are color-coded like candy, and “I Want Your Sex” is no exception, especially when it comes to Erika’s art studio, where Elliot is hired as one of her assistants. They’re the grunts who paint the papier-mâché phalluses and chew gum all day, sticking the bright pink wads to a labia-shaped canvas. “Contemporary art is a scam,” opines Erika. “The real art is convincing people you’re making something meaningful.” With those words, Araki could be criticizing fellow queer director Bruce La Bruce, who has somehow figured out how to get each new film (no matter how terrible) invited to prestigious international film festivals.\n\n\tBy contrast, Araki belongs to the John Waters school of outsider filmmaking, poking fun at uptight mainstream culture, whether that’s via a stoner comedy like “Smiley Face” or a nihilistic cri de coeur like “The Doom Generation,” without paying much mind to such square notions as “good acting.” Wilde delivers a pure-camp performance here, trying to one-up Miranda Priestly with her imperious workplace attitude, cover-girl eyeliner and droll line deliveries. More ferocious than any cougar, she lures Elliot into her spider’s web of an office and threatens to report him to HR, before propositioning him for sex. She wants it without strings. He’s too naive to realize she’ll have him whipped in every sense of the word.\n\t\n\n\tElliot already has a girlfriend (Charli xcx), though she’s too distracted with grad school to satisfy him sexually. So he turns to his friends for advice, whether it’s Chase Sui Wonders as the roommate who lives vicariously through his exploits or Mason Gooding as his insatiably gay co-worker. The script (which Araki wrote with “Now Apocalypse” partner Karley Sciortino) never fully makes the case for how this vixen figured out her employee’s deepest fantasies, though nearly all of Araki’s characters are sexually fluid, so maybe Elliot’s awakening isn’t such a stretch.\n\n\tIn Hoffman’s hands, Elliot looks like a cross between the late Phillip Seymour Hoffman (the young actor’s dad) and a roguishly handsome member of the Kennedy clan. He amounts to a less confident version of his “Licorice Pizza” character, still plenty enthusiastic about crawling around on all fours or taking a sex toy in the backdoor (the look on Elliot’s face after Erika penetrates him for the first time says it all). Tellingly, when thinking about Erika on his own, Elliot entertains more traditional desires, like getting married and starting a family.\n\n\tHoffman and Wilde’s commitment makes the film feel more important than it is. It’s better to think of this either as pure, irreverent escapism or a guiltless pleasure. There’s no important message or perceptive social insight to be gleaned from “I Want Your Sex,” beyond Araki giving the kids enthusiastic permission to test their own boundaries. Once you get past the shock, the plot falls apart. But that hardly matters, since Araki’s achieved his main goal: getting a repressed generation to loosen up about sex by pushing the boundaries between profound and profane. How’s that for a happy ending?\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘I Want Your Sex’ Review: Olivia Wilde and Cooper Hoffman Are Hot for One Another in Gregg Araki’s Unapologetically Randy Rom-Com",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/I-Want-Your-Sex.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-24T06:57:44.000Z",
      "dateModified": "2026-01-24T06:57:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ethan Hawke, Ava DuVernay, Chloe Zhao Give Emotional Robert Redford Tributes at Sundance Gala: ‘An Extraordinary Man Who Connected All of Us’",
    "url": "https://variety.com/2026/film/news/robert-redford-tribute-sundance-film-festival-gala-1236639202/",
    "image": "https://variety.com/wp-content/uploads/2026/01/GettyImages-2257874155.jpg?w=1000&h=562&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-24T06:51:44.000Z",
    "description": "\n\t“Once upon a time, there lived an extraordinary man who connected all of us in this room,” Ethan Hawke narrated to kick off the Sundance Institute’s",
    "body": "\n\t“Once upon a time, there lived an extraordinary man who connected all of us in this room,” Ethan Hawke narrated to kick off the Sundance Institute’s annual gala, fittingly a tribute to the festival’s late founder.\n\n\t“We wouldn’t be here without the love and appreciation for Robert Redford,” Hawke said.\n\n\tThis year’s gala was emotional, not just because it’s the last hurrah in Park City, but also because it was held shortly after Redford died in September at the age of 89. The actor-turned-director, who was one of the most sought-after leading men through much of the ’70s and ’80s through such films as “Butch Cassidy and the Sundance Kid,” “The Way We Were,” and “All the President’s Men,” founded Sundance Film Festival in 1978 as a launchpad for independent filmmakers. Friends of the filmmaker and alumni of the festival, including Woody Harrelson, Chloé Zhao, Ava DuVernay and Taika Waititi, trekked on Friday night to the Grand Hyatt Deer Valley to toast to Redford.\n\t\n\n\t“For some of you younger folks who didn’t live in the ‘60s, ‘70s or ‘80s, it might be hard for you to understand what Robert Redford meant to my generation,” Harrelson said. “He was part of my childhood.”\n\n\n\tHarrelson described a sense of “unbridled euphoria” when he got to know Redford while filming the erotic thriller “Indecent Proposal” in the early ‘90s. “I admit he’s the only man on earth I’d sell my wife to,” Harrelson cracked. “And I also admit, unabashedly, that he’s the only man I’d return the money to, to take me for a night.”\n\t\n\n\tFriday night’s event also honored Zhao, who just made history as the first person of color and second woman to be nominated twice for the best director Oscar for “Hamnet,” with the Trailblazer Award. Nia DaCosta, the filmmaker of “Hedda,” “28 Years Later: The Bone Temple” and “The Marvels,” was feted with the Vanguard Award. DaCosta made her Sundance debut with 2018’s “Little Woods,” starring Tessa Thompson and Lily James. \n\n\t“Being part of this community taught me something very important, which is trailblazing or leadership is not about dominance. It’s about interdependence. It’s about community,” Zhao said. “I want to thank Robert Redford for knowing the importance of interdependence in nature and human nature.”\n\n\tHawke, a Sundance regular over the years in films such as “Before Sunrise” and this year’s drama “The Weight,” shared the story of the first time he met Redford. Hawke had auditioned for “A River Runs Through It” and didn’t get the role. Hawke remembers that Redford told him: “You’re too young for this part. But I just want you to know, you’re going to have a wonderful career and I can’t wait to watch it.” \n\n\tHawke’s takeaway from the exchange? “He believed in me. He followed up. He came to see me in a play. It was 99-seat theater; $10 a ticket. What the fuck?” Hawke said. “He championed other people. The fact that he had time to care about all of us is so meaningful.”\n\n\tA recurring theme of the emotional evening was Redford’s passion for cultivating and supporting new talent, as well as his insistence that they called him “Bob.” However several filmmakers, including DuVernay and DaCosta, admitted they were uncomfortable using a nickname for someone they considered a hero.\n\n\t“When I think of Redford, I think of how frustrated he was when I never called him Bob,” DuVernay shared. “I said ‘Because you’re Mr. Redford.’ He’d said, “Ava, please call me Bob.’”\n\n\t(That didn’t apply to Waititi, who later in the evening joked, “Robert Redford— Bob to me, not to you.”)\n\n\tBefore Patti LuPone made a surprise appearance to perform a heartfelt rendition of “Forever Young,” Robert’s daughter Amy honored her father and said the evening felt “like a homecoming.”\n\n\t“I can’t help but think of all the galas my dad had no interest in showing up to,” Amy said, “and how he might have actually enjoyed this one.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ethan Hawke, Ava DuVernay, Chloe Zhao Give Emotional Robert Redford Tributes at Sundance Gala: ‘An Extraordinary Man Who Connected All of Us’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/GettyImages-2257874155.jpg?w=1000&h=562&crop=1"
      ],
      "datePublished": "2026-01-24T06:51:44.000Z",
      "dateModified": "2026-01-24T06:51:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Laura Adler, ‘American Dreams’ Casting Director, Dies at 65",
    "url": "https://variety.com/2026/tv/news/laura-adler-dead-american-dreams-1236639532/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Laura-Adler_Rosalie-Joseph-Humanitarian-Award.jpg?crop=0px%2C435px%2C3662px%2C2062px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-01-23T23:49:02.000Z",
    "description": "\n\tLaura Adler, a former Casting Society administrator and casting director, died on Thursday in Los Angeles following a brief illness. She was 65 year",
    "body": "\n\tLaura Adler, a former Casting Society administrator and casting director, died on Thursday in Los Angeles following a brief illness. She was 65 years old.\n\n\tFor 16 years, Adler worked as a casting director, and was involved with the casting for television shows including “Better Off Ted,” “Dream On,” “The Goode Family” and “American Dreams.” For the latter, Adler was nominated for a Primetime Emmy Award for Outstanding Casting in a Drama Series. Before becoming one herself, she assisted renowned casting directors Barbara Claman, Mark Saks and Ted Hann.\n\t\n\n\tOver more than four decades in the industry, Adler built a career in entertainment that was defined by her service, integrity and tireless advocacy; she became an original member of the steering committee to secure pension and health benefits for casting directors in 2005 and in 2014, she was hired as an administrator for the Casting Society. She held the position for a decade, serving and supporting the global casting community up until she retired from the role in 2024.  \n\n\n\tIn recognition of her tireless efforts and the impact her work had on the casting community, Adler will be receiving the Rosalie Joseph Humanitarian Award, given to those who have made outstanding contributions to humanitarian causes that have in turn supported the casting community. The award will be presented at the 41st Annual Artios Awards on Feb. 26 in Los Angeles. \n\n\tThe daughter of the late actor and director Jerry Adler, Adler was born and raised in New York City. Before transitioning into casting in 1989, she began working in television and film production in 1980. \n\t\n\n\tShe is survived by her sisters Alisa Adler, a talent agent at Paradigm; Emily Adler, a writer; Amy Adler; and nephew, Joe Adler. A memorial service will be announced at a later date.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Laura Adler, ‘American Dreams’ Casting Director, Dies at 65",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Laura-Adler_Rosalie-Joseph-Humanitarian-Award.jpg?crop=0px%2C435px%2C3662px%2C2062px&resize=1000%2C563"
      ],
      "datePublished": "2026-01-23T23:49:02.000Z",
      "dateModified": "2026-01-23T23:49:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Channing Tatum Cried ‘Five, Six, Seven Times’ at ‘Josephine’ Premiere as Film Becomes First Sundance 2026 Sensation",
    "url": "https://variety.com/2026/film/news/channing-tatum-cries-josephine-sundance-premiere-1236639359/",
    "image": "https://variety.com/wp-content/uploads/2026/01/GettyImages-2257853547.jpg?w=1000&h=562&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-24T01:23:09.000Z",
    "description": "\n\tAudience members were moved to tears during the world premiere of “Josephine,” one of the first major revelations out of this year’s Sundance Film F",
    "body": "\n\tAudience members were moved to tears during the world premiere of “Josephine,” one of the first major revelations out of this year’s Sundance Film Festival. One of the people who was blubbering at Park City’s Eccles Theater was none other than the film’s star Channing Tatum, who confessed that he “cried five, six, seven times” as he finally watched the movie for the first time.\n\n\tFestival-goers didn’t just weep through “Josephine.” They also laughed and cheered during the few lighthearted moments in the otherwise heart-wrenching drama about a young girl who witnesses a brutal sexual assault at her local park in San Francisco. Tatum and Gemma Chan star as Josephine’s parents, who struggle to console their young daughter as she grapples with the aftermath of the traumatic event.\n\t\n\n\tBeth de Araújo wrote and directed the film about a harrowing real-life experience she faced as a child. When the director took the stage at the Eccles on Friday afternoon, she wiped away tears of her own as she was greeted with a standing ovation. The crowd continued to clap and cheer as de Araújo brought out her actors, newcomer Mason Reeves who plays Josephine, as well as Tatum — who picked up his pint-sized co-star and swung her around — and Chan. \n\n\n\t“I started writing this in 2014 when I realized that something happened to me when I was young that haunted me,” De Araújo said during the Q&A after the screening. “I took a stab at writing about female fear, and how that’s shaped who I’ve become. I kept it through the eyes of an 8-year-old and how she learns about male aggression, and I took the fear to the extreme.”\n\t\n\n\tFriday’s premiere was a star-is-born moment for 8-year-old Reeves, whom the director discovered at a farmer’s market in San Francisco. As for her first time on a film set, Reeves declared “what I liked most was all of it” — prompting laughter from the audience. Reeves continued to charm the crowd, saying she hopes to keep acting but would prefer a less-intense genre the next time around. “I have five different [in mind]…. the first is action, then fantasty, a musical, a movie with animals in it, and the last is one a movie filmed in Paris.”\n\n\tThroughout the film, Tatum and Chan’s characters are forced to reprimand their daughter, who acts out as she wrestles with a newfound fear and anger that she can’t yet comprehend. Tatum, in real life the father to a 12-year-old daughter, was worried that Reeves wouldn’t be able to differentiate pretend from reality.\n\n\t“I was concerned about her actually thinking I was mad at her,” Tatum said about Reeves. “I was like, ‘You know I’m just acting, right?'”\n\n\tReeves, decked out in a sparkly silver dress, interjected: “He kept asking me about it, and I was like, ‘I’m fine!‘”\n\n\tChan, who was the first actor to sign onto the film, said she felt “there was a truth radiating from the page” while reading the script. “It’s a really challenging subject matter, and I thought the way [Beth] approached it and forced us to see it through a child’s eyes was brave.”\n\n\tBefore the audience ventured back into the cold, De Araújo thanked everyone for “engaging with something that isn’t an easy sit” and added, “I hope you feel like you had an opportunity to crack your heart open and give yourself the time and space to imagine a better world for yourself.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Channing Tatum Cried ‘Five, Six, Seven Times’ at ‘Josephine’ Premiere as Film Becomes First Sundance 2026 Sensation",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/GettyImages-2257853547.jpg?w=1000&h=562&crop=1"
      ],
      "datePublished": "2026-01-24T01:23:09.000Z",
      "dateModified": "2026-01-24T01:23:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chris Pine Tells Future ‘Star Trek’ Bosses to ‘Have Fun’ and ‘Good Luck’ With the Franchise: ‘Live Long and Prosper’",
    "url": "https://variety.com/2026/film/news/chris-pine-paramount-bosses-star-trek-1236639421/",
    "image": "https://variety.com/wp-content/uploads/2026/01/chris.pine_.png?crop=0px%2C39px%2C1614px%2C908px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-01-23T23:33:30.000Z",
    "description": "\n\tChris Pine is in the dark about the future of the “Star Trek” franchise. During a Sundance interview at the Variety Studio presented by Audible, the",
    "body": "\n\tChris Pine is in the dark about the future of the “Star Trek” franchise. During a Sundance interview at the Variety Studio presented by Audible, the actor was asked about Paramount’s new leadership and what they have in store for the space franchise. The answer was simple: “You probably know more than I do.”\n\n\tAs Variety reported last year, Jonathan Goldstein and John Francis Daley, the duo behind the Pine-starring “Dungeons & Dragons: Honor Among Thieves” are writing, producing and directing a new “Star Trek” film that will seek to revitalize the franchise. The new film will not be a continuation of the J.J. Abrams-led reboot of the series and won’t feature Pine, who played Captain Kirk in three “Star Trek” movies between 2009 and 2016.\n\t\n\n\tWhen asked if he had any advice for the new Paramount leadership in regards to “Star Trek,” Pine answered: “Advice? Have fun, good luck, live long and prosper.”\n\n\tPine opened the 2026 Sundance Film Festival with “Carousel,” a romance drama co-starring Jenny Slate and directed by Rachel Lambert. Pine stars in the film as a single father whose life is upended by the reemergence of his high school ex. \n\n\t“Many a male character in film and in life… there is a difficulty for men to communicate feelings with clarity. He struggles with that,” Pine said about his character, noting how Slate’s ex-girlfriend “allows him in the messiest way to confront these feelings and purge them out of the system.”\n\n\tSlate added of the film, “I was so excited by Rachel’s script for many reasons, but I think it’s a real opportunity when you get a full interiority. That makes for good drama. I started in comedy because it’s the easiest way to deal with my shadow, but not because I don’t have one. Now to sort of grow up into my adulthood as performer and to confront it straight on… I saw that opportunity in this script.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chris Pine Tells Future ‘Star Trek’ Bosses to ‘Have Fun’ and ‘Good Luck’ With the Franchise: ‘Live Long and Prosper’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/chris.pine_.png?crop=0px%2C39px%2C1614px%2C908px&resize=1000%2C563"
      ],
      "datePublished": "2026-01-23T23:33:30.000Z",
      "dateModified": "2026-01-23T23:33:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Netflix Postpones Alex Honnold’s ‘Skyscraper Live’ Climb Due to Weather Concerns",
    "url": "https://variety.com/2026/tv/news/netflix-postpones-alex-honnold-skyscraper-live-weather-1236639657/",
    "image": "https://variety.com/wp-content/uploads/2026/01/P114KR87-e1769214851990.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-24T00:37:27.000Z",
    "description": "\n\tNetflix‘s “Skyscraper Live,” which is set to follow free solo climber Alex Honnold as he climbs the Taipei 101 tower in Taiwan, has been postponed b",
    "body": "\n\tNetflix‘s “Skyscraper Live,” which is set to follow free solo climber Alex Honnold as he climbs the Taipei 101 tower in Taiwan, has been postponed because of rain — and will move to Saturday night U.S. time (Sunday morning Taiwan time) instead.\n\n\t“Due to weather, we are unable to proceed with today’s SkyscraperLIVE event. It has been rescheduled for Saturday, January 24 at 8 p.m. ET / 5 p.m. PT,” the streamer said in a statement. “Safety remains our top priority, and we appreciate your understanding.”\n\t\n\n\tOn Instagram, Honnold shared the news “from a very rainy Taipei”: “I sadly will not get to climb the building today because it’s raining. I suppose climbing is always at the mercy of nature. That’s just how it goes…  I’m going to go for a hike and have a nice day out. But sadly, can’t climb a skyscraper when it’s raining, so tune in tomorrow. Hopefully I’ll get the opportunity to climb the building tomorrow, same time, and then beyond that, we’ll just kind of see what nature allows. But hopefully I get the opportunity to climb. Either way, I really appreciate the support from everybody. It’s been incredible being here, and it’s been incredible checking out the building. So let’s hope that the weather gets good.”In a story posted earlier today by Variety, Plimsoll Prods. Ltd. CEO Grant Mansfield, Plimsoll head of adventure James Smith and Netflix unscripted VP Jeff Gaspin addressed the possibility of postponement due to weather.\n\n\n\tThe January date for the climb was chosen because it’s dry season in Taiwan right now — although rain was still possible, and the forecast was calling for a chance of moisture the morning Honnold starts his climb. Rain was expected right as “Skyscraper Live” was expected to kick off at 9 a.m. local time. So far, the forecast for tomorrow calls for conditions to be “sunny and pleasant” in Taipei, according to Accuweather.\n\n\t“If it is deemed too wet, if there’s too much moisture on the building, we will probably delay to the next day, which would be a Saturday night transmission in the U.S.,” Smith had told Variety. “We could even delay another day if we needed to. Obviously Alex has to be 100% comfortable and happy in himself and in the conditions. And then our safety team likewise have to.”\n\t\n\n\tGaspin had compared the live telecast window to “launching a space shuttle. We’ll be on site for a few days after if, for some reason he doesn’t go on that day,” he said. “But after that, it’s probably a bigger reschedule. There’s only certain times of year you can actually climb the tower because it’s rainy season between April and September.”\n\n\tSaid Mansfield: “He won’t be on that building unless we’re all comfortable. But there’s been a huge amount of planning for this. He said he’s the fittest he’s ever been. He’s really been training for this. We’ve gone to Taipei in the dry season, but there’s always a risk of a bit of rain. It’s a live event and anything can happen, and we can’t control the weather.”\n\n\tHonnold has become a well-known rock climber noted for his daring “free solo” feats of ascending cliffs without the help of any ropes or safety equipment. He was the subject of the Oscar-winning doc “Free Solo,” which chronicled his climb of El Capitan’s 3,000-foot “Freerider” route in Yosemite National Park.\n\n\tThe 2-hour “Skyscraper Live” will follow Honnold as he attempts to free solo the Taipei 101, a 101-story skyscraper that is the 11th tallest building in the world (and the tallest in Taiwan) at 1,667 feet. Plimsoll Prods. Limited, a part of ITV Studios, is producing the special. Al Berman is showrunner and executive producer of “Skyscraper Live,” while Honnold, Grant Mansfield, James Smith, Alan Eyres and Jonathan Retseck are also EPs. Joe DeMaio is director.\n\n\tHere’s Honnold’s Instagram video explaining the postponement:\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Netflix Postpones Alex Honnold’s ‘Skyscraper Live’ Climb Due to Weather Concerns",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/P114KR87-e1769214851990.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-24T00:37:27.000Z",
      "dateModified": "2026-01-24T00:37:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Extra Geography’ Review: Molly Manners’ Delightful Female Friendship Movie Shines With Original Wit and Disarming British Humor",
    "url": "https://variety.com/2026/film/reviews/extra-geography-review-molly-manners-1236637524/",
    "image": "https://variety.com/wp-content/uploads/2026/01/ExtraGeography.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-24T02:45:00.000Z",
    "description": "\n\tFemale friendships demand something a little extra. As that famous America Ferrera monologue in “Barbie” reminded us, it’s tough to be a woman — or,",
    "body": "\n\tFemale friendships demand something a little extra. As that famous America Ferrera monologue in “Barbie” reminded us, it’s tough to be a woman — or, in the case of the two off-kilter leads of the uniquely witty “Extra Geography,” to be in that transitional and equally contradictory period known as girlhood. On top of the burdens you’re born into, how do you simultaneously navigate schoolwork, peer drama, the many mysteries of your budding sexuality, and the unknowable land of boys while also trying to stay loyal to your friendships and be true to your own identity? And on that note, have you figured out who you are yet?\n\t\n\n\tBased on Rose Tremain’s dreamlike 2007 short story with the same name, Molly Manners’ debut feature “Extra Geography” (adapted by “Succession” scribe Miriam Battye) conquers these treacherous coming-of-age waters with a prose so sharp-tongued, timelessly wise and funny that this Gen-Xer felt as if it arrived to fill a cinematic void in her own teen-hood retroactively, just like other comparable movies this side of “Ghost World.” In that, the first quarter of the 21st century has indeed been good to movies about female friendships, with “Extra Geography” joining the ranks of instant greats like “Lady Bird,” “Booksmart” and “Frances Ha.”\n\n\n\tThen again, the proudly British text and aesthetics of Manners and Battye’s “Extra Geography” charts its own fresh territory, like a contemporary Jane Austen novel unfolding within the walls of an English school. Stylistically in step with Tremain’s nostalgic tale, it’s rooted in the palpable pains of youth, while hovering slightly above the realities of everyday life like a cheeky fantasy. At the film’s center are the lovably gruff duo Flic and Minna, played with precision and stiff-upper-lipped hilarity by newcomers Marni Duggan and Galaxie Clear respectively. Accompanied by a range of tunes — from a touch of Boccherini to the likes of “Crimson and Clover” that accentuates the story’s timeless qualities (“Extra Geography” doesn’t spell out the period it’s set in) — Flic and Minna keep busy enough at their boarding school by playing lacrosse, moving across the property’s expansive grounds with an air of snide untouchability and bickering about the future, almost exclusively with one another. “What will happen if we don’t get into Oxbridge?,” Minna wonders right at the start, while the two pick on their perennially bruised knees. “Maybe we’ll just die,” Flic suggests.\n\t\n\n\tAnd there you have it — the risks always seem that intense during one’s youth when every little triumph or mistake lands like a life-or-death situation. Caught in these currents, the amusingly terse Minna and Flic decide that it isn’t enough to just go to a good school and get good grades. In order to really thrive in the future, they also need to become “worldly.” And you can’t possibly be worldly unless you give yourself a little taste of Shakespeare no matter how “rubbish” he might be, and fall in love with someone. Excited about their plan, the duo auditions for an upcoming production of “A Midsummer Night’s Dream,” and choose an unlikely school project on the side: fall in love with the first person that they’d come across.\n\n\tThe first part of the plan doesn’t quite work out when the casting gets announced with Minna landing the role of Titania the Queen of Fairies, and Flic, a lowly tree. As for the second part, the girls set their sights on their geography teacher Miss Delavigne (a wonderfully nervy Alice Englert). They check out romantic books from the library, study up the intricacies of courtship, and try to score an invitation to their teacher’s cottage to advance their plan. Except, when the rehearsals start in earnest and boys enter the duo’s orbit in after-school adventures, their already off-balance dual existence and sneaky one-upmanship worsens. Will Minna and Flic maintain their best-friend status against the odds?\n\n\tExploring an eager case of codependency, and later on, a heartbreaking instance of growing apart, a film like this requires utmost chemistry between the co-leads, an occasion Duggan and Clear rise to with ease. Establishing a rare closeness of the finishing-each-other’s-sentences kind, the duo truly embrace the immersive feeling of being one half of that singular, irreplaceably defining friendship of the teen years, one that often feels like a high-stakes romantic entanglement. \n\n\tThroughout the movie chaptered like a stage play, Manners captures the two actresses’ rhythms organically with an insightful and mischievously British sense of humor. Her perceptive lensing is especially poignant across wordless scenes where the two girls romance their teacher through longing gazes. (It’s also quite funny when Minna involuntarily makes a “longing” sound while reading about love, to Flic’s astonishment.) When they finally receive that coveted invitation to Miss Delavigne’s home with the pretense of researching their teacher’s motherland New Zealand, Manners follows the trio through a vigilant sense of awe and restraint, without ever sensationalizing the shocking occurrence that follows. \n\t\n\n\t“I’m stressed about everything and I don’t even know what any of it is,” Flic says early on in this infinitely quotable film that feels like a new high-school movie classic. In a way, her words also sum up what’s so wonderful about the searching spirit of “Extra Geography,” a film that mines reserves of tenderness in young female angst and cluelessness with loving empathy.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Extra Geography’ Review: Molly Manners’ Delightful Female Friendship Movie Shines With Original Wit and Disarming British Humor",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/ExtraGeography.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-24T02:45:00.000Z",
      "dateModified": "2026-01-24T02:45:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Renée Fleming Becomes Latest Star to Drop Out of a Kennedy Center Engagement",
    "url": "https://variety.com/2026/music/news/renee-fleming-exits-kennedy-center-engagement-1236639524/",
    "image": "https://variety.com/wp-content/uploads/2018/07/renee-fleming.jpg?w=1000&h=562&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-23T23:39:04.000Z",
    "description": "\n\tThe Kennedy Center has lost another one of the few remaining stars on its 2026 schedule, as the legendary soprano Renée Fleming has dropped out of a",
    "body": "\n\tThe Kennedy Center has lost another one of the few remaining stars on its 2026 schedule, as the legendary soprano Renée Fleming has dropped out of an appearance at the embattled venue previously scheduled for May.\n\n\tAlthough many of the musicians who have bowed out of appearances there have made note of the political toxicity that has made it difficult for name artists to fulfill their engagements, a notice on the Kennedy Center’s website blames her exit on an issue with her schedule\n\t\n\n\t“Renée Fleming regrets that, due to a scheduling conflict, she must withdraw from her May 2026 concerts with the NSO,” the notice reads. “A new soloist and repertoire will be announced at a later date, and the remainder of the program remains unchanged.”\n\n\n\tFleming was set to sing with the National Symphony Orchestra and conductor James Gaffigan.on May 29-30.\n\n\tFleming has a strong and recent connection to the center: She was celebrated with an award at the Kennedy Center Honors in 2023. That was prior to President Donald J. Trump taking it over as its chairman in a coup and replacing much of the board with his associates and friends at the beginning of 2025. She had previously served as “Artistic Advisor at Large,” but resigned from that role last year after the president and chair of the center were forced out.\n\n\tA representative for Fleming did not immediately respond to Variety‘s request for comment.\n\n\tOn Jan. 16, the Martha Graham Dance Company said it was withdrawing from performing at the center in April. “The Martha Graham Dance Company regrets that, for a variety of reasons, we are unable to perform at the Kennedy Center in April,” the company said in a statement. “We hope to perform at the center in the future.”\n\t\n\n\tAmong others who have pulled out of shows since the politicized takeover are Stephen Schwartz, a production of “Hamilton,” Béla Fleck, Rhiannon Giddens, Issa Rae, Sonia De Los Santos, the Cookers, Magpie, Kristy Lee, the comedy troupe Asian AF, Balún and one of the Kennedy Center’s anchor attractions for many decades, the Washington National Opera.\n\n\tFew big-name acts remain on the schedule for the rest of this year. The list of those still scheduled is led by right-leaning comic Adam Carolla, Jeff Foxworthy, Tony Hinchcliffe and R&B singer Tyrese.\n\n\tThe center’s president, Richard Grenell, who regularly tweets his conservative positions on Twitter, has gone after other performers who have pulled out, saying they are the ones politicizing the venue.\n\n\tWhen the banjo player Fleck canceled his appearance this month, he wrote, “I have withdrawn from my upcoming performance with the NSO at The Kennedy Center. Performing there has become charged and political, at an institution where the focus should be on the music. I look forward to playing with the NSO another time in the future when we can together share and celebrate art.”\n\n\tGrenell’s heated response: “You just made it political and caved to the woke mob who wants you to perform for only Lefties.”\n\n\tIn December, when jazz musician Chuck Redd canceled a New Year’s Eve appearance, Grenell sent him a letter saying he would be sued for $1 million in damages. There has been no subsequent indication that a lawsuit will be filed against any of the artists canceling shows.\n\n\tThe board recently voted to rename the facility the Trump-Kennedy Center, although many have argued that it would take an act of Congress to rename a national presidential memorial, so many continue to refer to it as simply the Kennedy Center, given questions over the legality of the name change.\n\n\tAudiences have been down since the Trump takeover, according to data acquired by the New York Times that showed single-ticket sales down 50%, and subscription revenue for theater down 82% and dance 57% during April and May of 2024 from the previous year.\n\n\tThe center’s current president and representatives have in turn pointed to $130 million in fundraising since Trump took over, along with $257 million approved by Congress and directed by the president toward building renovations.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Renée Fleming Becomes Latest Star to Drop Out of a Kennedy Center Engagement",
      "image": [
        "https://variety.com/wp-content/uploads/2018/07/renee-fleming.jpg?w=1000&h=562&crop=1"
      ],
      "datePublished": "2026-01-23T23:39:04.000Z",
      "dateModified": "2026-01-23T23:39:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Firing Up ‘The Power Station’ for a 40th Anniversary Boxed Set: Duran Duran’s John Taylor on Coralling Robert Palmer and Members of Chic for a True Pop Supergroup",
    "url": "https://variety.com/2026/music/news/power-station-anniversary-john-taylor-supergroup-interview-1236639677/",
    "image": "https://variety.com/wp-content/uploads/2026/01/image-2.png?w=915&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-24T01:51:30.000Z",
    "description": "\n\tAs a founding member of Duran Duran, you wouldn’t think that much could surprise John Taylor.By 1984, each of the British new wave gods’ first three",
    "body": "\n\tAs a founding member of Duran Duran, you wouldn’t think that much could surprise John Taylor.By 1984, each of the British new wave gods’ first three albums had gone platinum, their cinematic videos were regularly rotated on MTV, and nonstop global touring attracted Swiftian levels of excitable fans. So, to get away from it all, and rock harder than the synth-pop-driven Duran Duran, bassist Taylor and his guitarist bandmate Andy Taylor hooked up with Chic drummer Tony Thompson, invited Chic bassist Bernard Edwards to produce, and brought in blue-eyed soul legend Robert Palmer to sing a few songs. The next thing Taylor knew, his sidepiece supergroup, the Power Station (named for the NYC studio), had racked up two Billboard Top 10 hits in “Some Like It Hot” and a cover of T. Rex’s “Get It On (Bang a Gong).” The group’s 1985 self-titled debut got to No. 6 on Billboard’s Top 200) and went platinum without even trying.\n\n\n\t“I was not, in annnnny way, prepared for that to happen,” says Taylor, from his home in Los Angeles, about the astonishment that was the success of the Power Station.\n\t\n\n\tTo quote one of Robert Palmer’s solo songs: “Some Guys Have All the Luck.”\n\n\tTaylor is on tour through the end of January with Duran Duran, which will soon release a deluxe version of its eponymously titled 1993 comeback record, oft-referred to as “The Wedding Album.” But the reason for our conversation is a well-deserved 40th anniversary edition of that famous side project, out today. Expanded into 4-CD and 2-LP packages, “The Power Station” comes complete with, among other extras, live rarities from their time with a second journeyman singer Michael Des Barres. (Palmer performed on stage with the Power Station just once, for “Saturday Night Live” in February 1985, then left the band shortly after their album came out the following month.) It also includes testimonies form Taylor paying respects to Power Station’s two late members, Palmer and Thompson, and their producer, Edwards.\n\n\tGoing back to before the start of the supergroup, Taylor recalls Duran Duran’s biggest moment with bittersweet reminiscence. “Collectively, psychologically, after ‘Seven and the Ragged Tiger’… that record was a bitch to make, something where we went in having to top to our massive second album (1982’s “Rio”) and show musical growth,” Taylor says, thinking of the heights of Duran-mania that accompanied their third album. “We had a huge, long arena tour where everything’s bonkers, and was truly the first time that we’d been exposed to such mass hysteria, internationally. To be honest, we were frazzled at tour’s end, to say the very least.”\n\t\n\n\n\n\t\n\n\t\t\t\t\tThe Power Station\n\t\n\n\n\n\tKnowing that, in 1984, the post-tour Duran Duran did not have another album in them, despite the urging of its management (“We gave them one new song, ‘The Wild Boys,’ for the live album ‘Arena'”), the quintet decided to take a break, yet make their time away from each other a working vacation.\n\n\t“Everything was changing within Duran,” Taylor notes of that band’s suddenly sweet smell of success, and the so-called “fork in the road” that brought about both the Power Station and Arcadia, Simon Le Bon and Nick Rhodes’ art-pop project with Roxy Music’s Andy Mackay.\n\n\t“Going back to the question of what was going on psychologically with Duran Duran then, things were complicated. It was the first time where we all had money; some of the guys got married; some of us began to develop outside relationships during that time off, most notably with Tony and Robert. Andy and I just broke off a bit from the others – we were like Thelma and Louise, off into the sunset, motherfuckers…. And with those two guys right there, Andy and I couldn’t resist doing something, something a little bit more organic, a little more muscular, a little less thought-out.”\n\n\tTaylor met Thompson around the time that his fellow Chic member Nile Rodgers had exploded with his first huge production outside of their disco ensemble, David Bowie’s “Let’s Dance” album. “Tony played on ‘Let’s Dance’ and Madonna’s ‘Like a Virgin’ (another Rodgers production) and his was a style of drumming that lit up the dance floor,” says the bassist, before adding that Thompson was the “real star” of the Power Station, the foundation upon which every other sound was built.\n\n\n\n\t\n\n\t\n\n\n\n\tIt was, however, another non-Duran relationship of the time that signaled the start of the Power Station project before it had a name: the one with model and Playboy Playmate Bebe Buell, who, at that moment, was John Taylor’s paramour. It was upon Buell’s urging that the bassist would back her on a crunching cover of 1971’s “Get It On.”\n\t\n\n\t“I was dating her at the tail end of that Duran tour. She was an artiste who’d already had a record out by that time (1981’s “Covers Girl” EP produced by Ric Ocasek and Rick Derringer), and I thought it could be fun producing something with her,” says Taylor, who went to his then-label, EMI, for backing. “They weren’t going to say ‘no,’ so we got the green light for studio time to develop the idea, then she and I fell out. But by then the horse was running, and Andy and I took the bit between our teeth…\n\n\t“Andy, Tony and I were going to be this rhythm section, despite not having played together as a unit at that point,” adds Taylor, talking about a “fantasy” of that trio of musicians backing various vocalists ,as if they were “a new version of the Stax house band.” The schematic of many singing cooks in one Power Station kitchen changed when their pal Robert Palmer stopped by the studio.“Robert came in, sang ‘Communication’ (a tune penned by the two Taylors and co-composer Derek Bramble, to which Palmer added lyrics), and asked about ‘Get It On.’ We put that track up next, and as soon as he finished singing, Bernard said that we’d need not look further for vocalists – that Robert was the perfect singer for this project. At that exact moment, the nature of the project changed.”Robert Palmer, by 1984, was a cooly composed, eclectic, British R&B-rock vocal legend — a “concessioner of many things,” by Taylor’s estimation — without having ever had a huge, continuous presence on the charts since his solo album debut with “Sneakin’ Sally Through the Alley” (1974).\n\n\t“Robert had a very dexterous voice and a clever lyrical style about him,” says Taylor.\n\n\tPalmer’s gritty but gracefully soulful singing prowess and fast way with a lyric brought a different energy to what the Taylors and Thompson had planned for the sessions. “We didn’t have a plan…. Didn’t really think it all out,” says the bassist. “Andy and I didn’t have, as our goal, to start another band. We just wanted to make cool music with Tony and Bernard. Suddenly, however, we had this other group. Fuck me, right? But it all sounded so incredible with Robert in the mix.”Suddenly, and quickly, the Power Station became an “antidote” to what Duran Duran had become at that time, where everything they did felt important and pre-planned, if not fussy. “It was nice to do something that wasn’t at all important,” Taylor says. “Actually, what we did was like we were having an affair from our marriage. And we knew that this affair wasn’t going to last. We were built to come together like a lightning flash, and pull off something unusual.”The album’s most thundering track, one that came together speedily, was Power Station’s biggest hit, “Some Like It Hot,” a Twin Taylor idea where Palmer immediately added the “sweat when the heat is on” lyrics after hearing the title.“The success of these songs was excess to expectation, as no one could anticipate the outcome, let alone the lot of us who made it,” says Taylor. “This project was driven solely by a desire to fuck, to rock – nothing contrived. It all started out as truly unconventional.” Taylor quickly credits the work of “the hottest engineer and mixer at that time, Jason Corsaro, from the hottest studio around, the Power Station,” as hugely beneficial to his band’s buoyant vibes.That drive – and this band’s muscular rock and funk sound – quickly pushed “The Power Station” up the charts following the March 1995 release, to the point they immediately scheduled a summer shed tour. That same sound was so crisp, cutting and, yes, commercial that Palmer suddenly took it as his own, and recorded 1985’s “Riptide” with producer Edwards, drummer Thompson and guitarist Taylor on his biggest-ever solo hit to date, “Addicted to Love.” Not long after “Riptide’s” release, Palmer left his longtime label, Island, for new digs at EMI, and a continuation of the crunch-rock-rhythm sound.\n\n\tPalmer bailed on the tour and split from the Power Station weeks after the album’s release. Taylor doesn’t sound angry at Palmer, now, for having jumped ship on the Power Station when he did.\n\n\t“Hey, Island made him a huge money offer at the time to deliver a new album on the heels of ours,” says the bassist. ”Look, we were blessed just to be able to make a record with Robert. He’s a great artist, a great collaborator, and should be in the Rock and Roll Hall of Fame. Robert just came into the studio, loosened his tie, and took off – he made it all look so easy.”\n\n\tTaylor makes sure to mention that Palmer’s Power Station tour replacement, Michael Des Barres, came nobly to their rescue when the already-booked 1985 Power Station summer tour and Live Aid appearance reared its head. “We started out as a band meant to have more than one singer, so why not,” says Taylor with a laugh. “Still, we needed a singer for this tour, so God bless Michael. \n\t\n\n\t“Everyone knew his reputation as an amazing singer and an underachiever who had two bands who were supposed to have been massive – Silverhead and Detective – that just didn’t happen. And it wasn’t as if he wasn’t current; he had just written that Animotion song ‘Obsession,’ which was a huge hit, and he was wide and alive. We found Michael in Texas hanging out with Don Johnson on a movie set, flew him into New York, he hit the mic, and immediately we knew that he just got it. Michael was perfect. He came in and embraced it.”\n\n\tTaylor says that listening to the never-before-released August 1985 live show that’s part of the new Power Station boxed set was something of a thrill, as he’d never heard the tapes prior to creating this 2026 collection. “I forgot that we’d had to fill out a two-hour set on that tour based on a Power Station album of just eight songs, so, sure, we did ‘Obsession.’ And of course, let’s do a Duran Duran song. Hey, let’s do two.”\n\n\tThe lesson John Taylor learned with the creation of the supergroup: there’s no place like home.\n\n\t“The idea of a supergroup was so everything not punk-rock, right?” says the bassist with a big laugh. “The Power Station started off as this unconventional thing, gained traction, and became more legitimate, more conventional. And by the end of its 1985 tour, I realized that I didn’t start the Power Station for the sake of convention, or even to have another band. I was already in a great band to start: Duran Duran.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Firing Up ‘The Power Station’ for a 40th Anniversary Boxed Set: Duran Duran’s John Taylor on Coralling Robert Palmer and Members of Chic for a True Pop Supergroup",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/image-2.png?w=915&h=563&crop=1"
      ],
      "datePublished": "2026-01-24T01:51:30.000Z",
      "dateModified": "2026-01-24T01:51:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Dildos, Ball Gags and Threesomes: Kinky Olivia Wilde Thriller ‘I Want Your Sex’ Heats Up Sundance",
    "url": "https://variety.com/2026/film/news/olivia-wilde-i-want-your-sex-sundance-premiere-nudity-dildos-1236639049/",
    "image": "https://variety.com/wp-content/uploads/2026/01/02e8fu8ktI_Want_Your_Sex-Still_1.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-24T04:26:13.000Z",
    "description": "\n\t“I Want Your Sex,” an erotic thriller starring Olivia Wilde as a sexually assured artist who embarks on a sadomasochistic relationship with her gall",
    "body": "\n\t“I Want Your Sex,” an erotic thriller starring Olivia Wilde as a sexually assured artist who embarks on a sadomasochistic relationship with her gallery assistant, got Sundance’s pulse racing on Friday night. Cooper Hoffman plays Elliot, the sub to Wilde’s dom in Gregg Araki’s latest piece of boundary-pushing provocation, one that Sundance programming director Kim Yutani dubbed a “return to form” for the filmmaker in her introductory remarks.\n\t\n\n\tBoth stars go for it — baring all in a relationship that is kinky, but also tender at times. Not in a conventional way, of course. Wilde’s character, Erika Tracy, opens a sexual Pandora’s box for Hoffman, one that comes with ball gags, stilettos, whips, chains, and a cornucopia of dildos and strap-ons. There’s even a disastrous threesome that goes comically off the rails.\n\n\n\tWhen Araki heard that Wilde was interested in playing Erika, he made it clear what would be required. \n\n\n\t“We had a meeting, and I just said, ‘you know, to do this part, you gotta just not give a fuck, and just want to just fucking take the plunge,'” Araki recalled during a post-screening Q&A. “‘Because I don’t want to compromise it. I don’t want to water it down.’ And she said, ‘Let’s go.'”\n\n\tWilde said she never looked back after signing up to play the role of an artist whose swagger masks her dwindling self-confidence.\n\n\t“I was just so excited by Gregg’s enthusiasm for the medium, for the process,” Wilde said. “I wish more people made movies like [Gregg]. You just said, ‘Let’s do it. Let’s get cool people together who want to tell a story, and let’s just do it. And it doesn’t have to be a whole thing, and it doesn’t have to feel like this corporate project. It has to just come from the heart.’ And I wanted to be a part of something like that.”\n\t\n\n\tHoffman, who turned heads in Paul Thomas Anderson’s “Licorice Pizza,” wasn’t sure he was right for the part of a bumbling boy toy. Araki was drawn to Hoffman because he reminded him of Dustin Hoffman in “The Graduate” and thought he could bring the same nebbish intensity to the part.\n\n\t“I honestly didn’t think I’d get cast,” Hoffman admitted. “I just threw my hat in the ring and kept getting closer and closer. And then they said I got the job. And I was like, ‘Ah, shit. I gotta go do this.’ And I’m very happy I did.”\n\n\tOn the red carpet prior to the premiere, Wilde told Variety that Gen Z wants to see less sex in movies and TV because they “don’t want to see inauthenticity anymore.”\n\n\t“The way that sex has been portrayed in film for a long time hasn’t been particularly realistic,” Wilde said. \n\n\n\tThat may not be a critique that’s leveled at Araki and company. The nudity and S&M mean “I Want Your Sex” will push the R-rating to the breaking point, but it was the film’s heart that the cast kept emphasizing on stage.\n\n\t“Ultimately, the sex feels secondary,” Chase Sui Wonders, who plays Hoffman’s best friend and roommate, said. “It’s a story about being obsessed with someone…It’s just a tragic love story.”\n\n\tMason Gooding, Daveed Diggs and Charli xcx round out the ensemble. Black Bear produced the film, which is looking for distribution. The packed auditorium included executives from indie labels like Magnolia, Roadside and Mubi, and the room was so crowded that Patrick Schwarzenegger was spotted walking up and down the aisle looking for an empty seat.\n\n\t“I Want Your Sex” is Araki’s eleventh feature at Sundance, with the director having previously debuted the likes of “Mysterious Skin” and “The Doom Generation” at the mountain festival. Before the film screened, Araki praised Sundance founder Robert Redford, who died last year at the age of 89.\n\n\t“There’s been nobody in the history of fucking Hollywood movies who says, ‘I want to use my fucking incredible star power and all my fucking clout to create this place in the world for those fucking weird filmmakers, those outsider filmmakers, those different voices,” Araki said. “It’s all about DEI.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Dildos, Ball Gags and Threesomes: Kinky Olivia Wilde Thriller ‘I Want Your Sex’ Heats Up Sundance",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/02e8fu8ktI_Want_Your_Sex-Still_1.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-24T04:26:13.000Z",
      "dateModified": "2026-01-24T04:26:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Car Crashes Into Terminal at Detroit Airport In Crazy Video",
    "url": "https://www.tmz.com/2026/01/23/car-crash-detroit-airport-video/",
    "image": "https://imagez.tmz.com/image/be/16by9/2026/01/24/be609e05b8374d3e8416c0db0db77922_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-24T02:15:01.000Z",
    "description": "\n    \n                    \n                          Detroit Metro Airport\n                          Pre-boarding on a Whole Other Level!!!\n          ",
    "body": "\n    \n                    \n                          Detroit Metro Airport\n                          Pre-boarding on a Whole Other Level!!!\n                      \n                  \n                                                                        Published \n                              January 23, 2026\n                            6:15 PM PST\n                                                                      |\n                                                                Updated \n                                  January 23, 2026\n                                9:44 PM PST\n                                    \n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Chaos at the Detroit Metro Airport ... a car came crashing into the check-in area at a terminal ... the driver got arrested ... and it's all on video.\n      \n    \n          Footage shows a Mercedes Benz crashing through the entrance and into the McNamara Terminal on Friday night ... and it left a trail of destruction near the Delta desk.\n      \n    \n        Waiting for your permission to load the Instagram Media.\n      \n    \n          Per local reports ... Delta employees were in their busy daily routine when the car came barreling into their workstation ... but thankfully, no injuries have been reported!\n      \n\n          Folks who were there and posted to social media ... say the driver got out of the car with his hands raised ... but it's unclear what caused the crash.\n      \n    \n          Police and TSA reportedly responded to the scene and the driver was taken into custody ... and it looks like he was wearing a Detroit Lions jersey.\n      \n    \n          Just when you think you've seen it all at the airport.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Insane Videos\n              \n                          \n                Car Crashes\n              \n                          \n                News\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Car Crashes Into Terminal at Detroit Airport In Crazy Video",
      "image": [
        "https://imagez.tmz.com/image/be/16by9/2026/01/24/be609e05b8374d3e8416c0db0db77922_xl.jpg"
      ],
      "datePublished": "2026-01-24T02:15:01.000Z",
      "dateModified": "2026-01-24T02:15:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "D4vd's Friend Neo Arrested for Failure to Appear as Witness",
    "url": "https://www.tmz.com/2026/01/23/d4vd-friend-neo-langston-arrested/",
    "image": "https://imagez.tmz.com/image/fe/16by9/2026/01/23/fe51197e311b4e918e7a8a00f0c2438e_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-23T21:16:06.000Z",
    "description": "\n                    \n                          D4vd\n                          Friend Neo Arrested ...\n                          Failure to Appear as ",
    "body": "\n                    \n                          D4vd\n                          Friend Neo Arrested ...\n                          Failure to Appear as Witness\n                      \n                  \n                                                                        Published \n                              \n                January 23, 2026\n                \n                            1:16 PM PST\n                                                                      |\n                                                                Updated \n                                  January 23, 2026\n                                3:29 PM PST\n                                    \n              \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          UPDATE\n  \n    \n          3:02 PM PT -- A local journalist posted photographs online at the scene of Neo's arrest in Helena, Montana from Thursday. Helena Independent Record City Editor Thom Bridge posted the 3 snaps Friday afternoon.\n      \n    \n      \n      Here's the scene when police arrested Neo Langston in Helena, Mont. on Jan. 22. https://t.co/csh7kjNNpa pic.twitter.com/MBf5wUl7Rv— Thom Bridge (@thom_g_bridge) January 23, 2026\n              @thom_g_bridge\n          \n  \n    \n          2:32 PM PT -- Neo is already being transferred to Los Angeles, according to multiple law enforcement sources in Montana. We're told his trek south began immediately after a Friday morning appearance before a judge\n      \n    \n          Cops in Helena, MT confirm they were assisting LAPD's Robbery-Homicide Division when they busted Neo. As we've reported, Robbery-Homicide is also leading the D4vd investigation.\n      \n    \n          While D4vd remains in the cross-hairs of investigators probing the Celeste Rivas murder, one of his friends, a famous streamer, is also in trouble now.\n      \n    \n          D4vd's friend Neo Langston was booked into a Montana jail Thursday on a warrant ... according to online records.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          A rep for Lewis & Clark County Jail, where Neo is locked up, tells TMZ ... there was an out of jurisdiction warrant from Los Angeles for failure to appear as a witness. He's currently held without bond.\n      \n\n          That's interesting because we know there's been a grand jury convened since at least November in the Celeste murder case, and multiple witnesses have already testified. Our sources have told us D4vd is likely to be charged with her murder.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Unclear if 23-year-old Neo was being called as a witness in the Rivas case ... but his connection to D4vd can't be ignored. It's documented on social media that D4vd and Neo are friends and hang out.\n      \n    \n          We broke the story ... last month D4vd's day-to-day manager, Robert Morgenroth, testified for days. A TMZ reporter heard Morgenroth tell his lawyer in the courtroom hallway, prosecutor Beth Silverman was \"very pushy\" as to why he didn't call the police. Morgenroth said he responded by saying it wasn't his responsibility and his job was to make sure D4vd's tour kept going.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          There was also talk in the courtroom hallway ... the grand jury could hear more witnesses in 2026.\n      \n    \n          Story developing ...\n      \n      ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "D4vd's Friend Neo Arrested for Failure to Appear as Witness",
      "image": [
        "https://imagez.tmz.com/image/fe/16by9/2026/01/23/fe51197e311b4e918e7a8a00f0c2438e_xl.jpg"
      ],
      "datePublished": "2026-01-23T21:16:06.000Z",
      "dateModified": "2026-01-23T21:16:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Elvis Presley 'Loving You' Co-Star Yvonne Lime Dead at 90",
    "url": "https://www.tmz.com/2026/01/23/yvonne-lime-dead/",
    "image": "https://imagez.tmz.com/image/72/16by9/2026/01/24/722b28c65bc14c328bcaae46eba623c8_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-24T01:38:22.000Z",
    "description": "\n    \n                    \n                          Elvis Presley Co-Star\n                          Yvonne Lime\n                          Dead at 90\n",
    "body": "\n    \n                    \n                          Elvis Presley Co-Star\n                          Yvonne Lime\n                          Dead at 90\n                      \n                  \n                                                                        Published \n                              January 23, 2026\n                            5:38 PM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Yvonne Lime, who acted in movies alongside Elvis Presley and Katharine Hepburn, is dead.\n      \n    \n          Yvonne died Friday, according to Childhelp, a national nonprofit organization she co-founded that's dedicated to helping abused, neglected, and at-risk children.\n      \n    \n          The cause of death is unclear but Yvonee's nonprofit says she \"passed away peacefully.\"\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Yvonne was born and raised in Glendale and she graduated from the Pasadena Playhouse before getting into Hollywood ... appearing in a bunch of movies in TV shows in the 1950s and 1960s.\n      \n    \n          She appeared opposite Elvis in the 1957 flick \"Loving You\" ... and they went on some dates during production ... with Elvis even bringing her to Graceland for Easter weekend in 1957.\n      \n    \n          Yvonne's first movie role was in 1956 when she landed a part in \"The Rainmaker,\" which starred Hepburn and Burt Lancaster.\n      \n    \n          In '57 before the Elvis movie, Yvonne played Michael Landon's girlfriend in \"I Was a Teenage Werewolf.\"\n      \n    \n          Yvonne married TV producer Don Fedderson in 1969 ... and she later served as president and CEO of his company, Don Fedderson Productions, managing the rights to huge TV shows like \"The Betty White Show,\" \"Family Affair,\" and \"My Three Sons.\"\n      \n    \n          She was 90.\n      \n    \n          RIP\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Elvis Presley\n              \n                          \n                Celebrity News\n              \n                          \n                RIP\n              \n                          \n                Movies\n              \n                          \n                Celebrity Death\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Elvis Presley 'Loving You' Co-Star Yvonne Lime Dead at 90",
      "image": [
        "https://imagez.tmz.com/image/72/16by9/2026/01/24/722b28c65bc14c328bcaae46eba623c8_xl.jpg"
      ],
      "datePublished": "2026-01-24T01:38:22.000Z",
      "dateModified": "2026-01-24T01:38:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Big Game Day Essentials: Football Tailgating",
    "url": "https://www.tmz.com/2026/01/24/big-game-day-essentials-football-tailgating/",
    "image": "https://imagez.tmz.com/image/06/16by9/2026/01/16/0681cb26ef9b4a729a5c32f40031eb32_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-24T08:05:20.000Z",
    "description": "\n                    \n                          Big Game, Bigger Snacks\n                          Tailgate Like You're Actually Invited  🏈\n          ",
    "body": "\n                    \n                          Big Game, Bigger Snacks\n                          Tailgate Like You're Actually Invited  🏈\n                      \n                  \n                                                                        Published \n                              January 24, 2026\n                            12:05 AM PST\n                                                                            \n              \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          TMZ may collect a share of sales or other compensation from links on this page.\n      \n    \n          It's the season of big games, and with the highly anticipated biggest game of them all coming very soon, you'll definitely want to take a shot at one or all of these ideas to make your tailgating experience XXL!\n      \n    \n          We're throwing you a whole bunch of touchdowns! Don't choke on these spectacular items that will make your tailgates that much better, whether you're sharing them with friends and family in the house, or with fellow fans in the parking lot!\n      \n    \n          TMZ CHEAT SHEET: AMAZON TAILGATE FOOD ESSENTIALS\n  \n    \n          Electric Table Top Grill -- $45Stadium Chip and Dip Tray -- $48Tailgate Table -- $55Cooler -- $150Mini Slow Cooker -- $24\n      \n    \n              \n      Electric Table Top Grill\n      \n        \n    \n                    \n                          \n                                  \n      \n        \n    \n          What better excuse to break out an all-knew, easy-to-use Electric Table Top Grill for your big game party!\n      \n    \n          This is a quick and easy way to get some patties cooked for the big game burgers that are sure to score 10 points per bite! And, after the big game, whether you're happy or sad with the result, you'll be relieved at how easy this thing is to clean.\n      \n    \n              \n      Stadium chip and dip tray\n      \n        \n    \n                    \n                          \n                                  \n      \n        \n    \n          Take your chips and dip straight to Levi's Stadium ... with this properly themed Stadium Chip and Dip Tray!\n      \n    \n          This chip and dip set is ceramic, so it doesn't feel like you're cheaply scooping up snacks from a flimsy cardboard bowl. Come on, when it's the most important kickoff of the post season, it's not just about premium games and performances ... it's also all about premium snacks!\n      \n    \n              \n      Tailgate table\n      \n        \n    \n                    \n                          \n                                  \n      \n        \n    \n          Nothing screams tailgate more than a Tailgate Table that you get to share with all your buddies during the big game.\n      \n    \n          Pitch this little outdoor table, and you won't need anything else for the rest of your big game night. It has four beer-holders on each corner, a center bowl for chips or other snacks, and a cooler on the bottom so you don't have to go to the fridge every time you need to crack another cold one. Now, just sit back, relax, and watch the game ... and the overwhelming amount of commercials, too!\n      \n    \n              \n      Cooler\n      \n        \n    \n                    \n                          \n                                  \n      \n        \n    \n          Stash your favorite drinks to stay fresh and cool for wherever you end up watching the big game, whether it's at a friend's place, your place, or the parking lot of Levi stadium! This Cooler will make sure you're chill with your drinks.\n      \n    \n          No need to carry your team like Drake Maye and Stefon Diggs are doing for the Patriots' offense! This cooler is half the weight of other brands, but still carries all you'll need for the night!\n      \n    \n              \n      Mini slow cooker\n      \n        \n    \n                    \n                          \n                                  \n      \n        \n    \n          This Mini Slow Cooker is just a great reminder that just because finals might drag on and on, your food can stay nice and hot for whenever you're ready for it to check in for the big game!\n      \n    \n          This slow cooker has three settings from high, to low, to warm, making it a versatile member of your tailgate! It can feed 2+ people and is perfectly sized for small meals, snacks, sides, and dips for all stress-eaters to enjoy! Best of luck at the big game! May your team win!\n      \n    \n          Sign up for Amazon Prime to get the best deals!\n      \n    \n          All prices subject to change.\n      \n      ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Big Game Day Essentials: Football Tailgating",
      "image": [
        "https://imagez.tmz.com/image/06/16by9/2026/01/16/0681cb26ef9b4a729a5c32f40031eb32_xl.jpg"
      ],
      "datePublished": "2026-01-24T08:05:20.000Z",
      "dateModified": "2026-01-24T08:05:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Courtney Stodden Sizzles in Bikini For New Hair Style Debut",
    "url": "https://www.tmz.com/2026/01/23/courtney-stodden-sizzles-bikini-new-hair-color/",
    "image": "https://imagez.tmz.com/image/1c/16by9/2026/01/24/1c19563cddb44eec892b41f551fb9138_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-24T00:44:22.000Z",
    "description": "\n    \n                    \n                          Courtney Stodden\n                          Eyes Up Here ...\n                          My Hairdo C",
    "body": "\n    \n                    \n                          Courtney Stodden\n                          Eyes Up Here ...\n                          My Hairdo Changed!!!\n                      \n                  \n                                                                        Published \n                              January 23, 2026\n                            4:44 PM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Courtney Stodden is making some big changes three weeks into a new year ... and, you guessed it, it's a cosmetic one.\n      \n    \n          The influencer hopped on social media Friday and posted a thirst trap of her in a skimpy bikini on the beach, showing off her new feature ... dark hair.\n      \n    \n        Waiting for your permission to load the Instagram Media.\n      \n    \n          Courtney's mostly been blonde since she's been a public figure ... but she's switched things up here and gone many shades darker.\n      \n\n          She captioned the snap, \"New year! New hair!\"\n      \n    \n          The hair color is different, but Courtney's sex appeal remains unchanged ... she knows how to command attention and fish for compliments.\n      \n    \n          Courtney also shared the post on her Instagram Story and added some music ... going with Rihanna's \"Kiss it Better.\"\n      \n    \n          Who says blondes are the only ones who can have fun?!?\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Courtney Stodden\n              \n                          \n                Social Media\n              \n                          \n                Hotties & Bodies\n              \n                          \n                Hot Bodies\n              \n                          \n                Photo Galleries\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Courtney Stodden Sizzles in Bikini For New Hair Style Debut",
      "image": [
        "https://imagez.tmz.com/image/1c/16by9/2026/01/24/1c19563cddb44eec892b41f551fb9138_xl.jpg"
      ],
      "datePublished": "2026-01-24T00:44:22.000Z",
      "dateModified": "2026-01-24T00:44:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]