[
  {
    "title": "AI Impact Drama ‘Humans in the Loop’ Adds Shabana Azmi, Ritesh Batra, Shaunak Sen as Executive Producers in Oscar Push (EXCLUSIVE)",
    "url": "https://variety.com/2026/film/news/shabana-azmi-ritesh-batra-humans-in-the-loop-oscars-1236627051/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Humans-in-The-Loop2.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-09T09:52:03.000Z",
    "description": "\n\tThree major international talents hailing from Indian cinema have thrown their weight behind “Humans in the Loop” during its awards season push. Act",
    "body": "\n\tThree major international talents hailing from Indian cinema have thrown their weight behind “Humans in the Loop” during its awards season push. Actor Shabana Azmi alongside directors Ritesh Batra and Shaunak Sen have taken executive producer roles on the feature, which is seeking recognition in the best original screenplay category at the 98th Academy Awards.\n\n\tTheir backing continues momentum for writer-director Aranya Sahay’s debut, produced by Mathivanan Rajendran. The narrative tracks a woman from an indigenous community in rural India whose job involves educating machine learning systems.\n\t\n\n\tSahay’s script builds its three-chapter structure around questions of how traditional wisdom intersects with technological advancement. The story positions the protagonist’s work as analogous to nurturing a child. The project originated from a news story and took shape during a residency at the Museum of Imagined Futures.\n\n\n\tBatra, director of “The Lunchbox,” responded to the film’s tone. “What moved me about ‘Humans in the Loop’ is its tenderness. It looks at systems and data, but listens closely to the people inside them, their pauses, their compromises, and their need to be seen,” he said.\n\n\t“Halo” star Azmi emphasized the accessible storytelling. “It is a beautiful story, told very simply with a heart. It makes you sensitive to what is happening around us in the world. It is a film that touches and enriches you in many ways,” she said.\n\n\tSen, whose “All That Breathes” won at Sundance and Cannes and was Oscar nominated, discussed the work’s philosophical dimension. “Humans in the Loop is attentive to the quiet spaces where technology meets lived experience. Rather than offering answers, the film stays with the ethical uncertainty of technological progress and the people whose lives are shaped by it,” he said.\n\t\n\n\tDirector Shekhar Kapur (“Elizabeth”) also weighed in, stating: “The film is written in such a way that it reminds us that in the pauses between technology and humanity lies something more ethereal, the responsibility of choice.”\n\n\tThe project’s journey involved multiple collaborators. Bijjo Toppo came aboard as executive producer during development, while Kiran Rao facilitated the Indian release and Misaq Kazimi oversaw the American rollout. Film Independent’s 2025 Sloan Distribution Grant, designated for science-focused works, went to the production.\n\n\tThe stateside engagement strategy involves advisors Ketki Parikh and Priya Samant working with several ambassadors: Aroon Shivdasani of the Indo American Arts Council, chef Vikas Khanna, and media figures Medha Jaishankar and Sanjay Sharma.\n\n\tReflecting on the support network, Sahay said: “I feel deeply honored that artists whose work has inspired me have connected with this film. It began as a short script and gradually evolved into the feature we see today, and that journey has been a labor of love.”\n\n\tAcademy members accessed the film through the organization’s screening platform earlier in the year. Netflix released it in November. Beyond awards consideration, the project is staging discussion events around artificial intelligence and indigenous perspectives.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "AI Impact Drama ‘Humans in the Loop’ Adds Shabana Azmi, Ritesh Batra, Shaunak Sen as Executive Producers in Oscar Push (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Humans-in-The-Loop2.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-09T09:52:03.000Z",
      "dateModified": "2026-01-09T09:52:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Come See Me in the Good Light’ Takes Top Prize at Cinema Eye Honors",
    "url": "https://variety.com/2026/film/awards/come-see-me-in-the-good-light-cinema-eye-honors-1236626960/",
    "image": "https://variety.com/wp-content/uploads/2024/12/Come-See-Me-in-the-Good-Light-Song.jpg?crop=0px%2C23px%2C900px%2C506px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-01-09T03:34:19.000Z",
    "description": "\n\tRyan White’s “Come See Me in the Good Light” won top honors at the 19th annual Cinema Eye Honors in New York on Thursday. The documentary, which pro",
    "body": "\n\tRyan White’s “Come See Me in the Good Light” won top honors at the 19th annual Cinema Eye Honors in New York on Thursday. The documentary, which profiles poets Andrea Gibson and Megan Falley facing Gibson’s cancer journey, won prizes for outstanding nonfiction feature, original music score and Unforgettables honors for Gibson and Falley. “The Perfect Neighbor” won outstanding director for Geeta Gandbhir and outstanding editing for Viridiana Lieberman, while “Seeds” also took two honors, for debut feature and cinematography for Brittany Shyne. \n\n\n\t“The Alabama Solution” and “Apocalypse in the Tropics” tied for outstanding production. \n\t\n\n\t“Come See Me in the Good Light,” “The Perfect Neighbor,” “Seeds,” “The AlabamaSolution” and “Apocalypse in the Tropics” were all Oscar-shortlisted for documentary feature.  Lauren Greenfield’s FX series “Social Studies” was recognized for outstanding nonfiction series and broadcast editing.  \n\n\tSee all the winners below: FeatureCome See Me in the Good LightRyan White, Jessica Hargrave, Tig Notaro, Stef Willen, Brandon Somerhalder, BereniceChávez, Blake Neely, Dave Richards, Brent Kiser, Andrea Gibson and Megan FalleyDirectionGeeta GandbhirThe Perfect NeighborEditingViridiana LiebermanThe Perfect NeighborProduction(tie)Andrew Jarecki and Charlotte KaufmanThe Alabama SolutionandPetra Costa and Alessandra OrofinoApocalypse in the TropicsCinematographyBrittany ShyneSeedsOriginal Music ScoreBlake NeelyCome See Me in the Good LightSound DesignJames LeBrecht, Greg Francis and Nina HartstoneDeaf President Now!Visual DesignSara Gunnarsdóttir, Josh Shaffner and Kevin EskewIt’s Never Over, Jeff BuckleyDebutSeedsDirected By Brittany ShyneAudience Choice PrizeThe Tale of SIlyanDirected By Tamara KotevskaNonfiction ShortAll The Empty RoomsDirected by Joshua SeftelSpotlight AwardTo the West, in ZapataDirected By David BimHeterodox AwardThe Voice of Hind RajabDirected By Kaouther Ben HaniaUnforgettables HonoreesNoam Shuster-EliassiCoexistence, My Ass!Andrea Gibson and Megan FalleyCome See Me in the Good LightSeymour HershCover-UpSara ShahverdiCutting Through RocksPavel TalankinMr. Nobody Against PutinJacinda ArdernPrime MinisterFatma HassonaPut Your Soul On Your Hand and WalkBroadcast FilmPee-wee as HimselfDirected by Matt WolfHBO | MaxNonfiction SeriesSocial StudiesDirected by Lauren GreenfieldFX on HuluAnthology SeriesConan O’Brien Must GoExecutive Producers Conan O’Brien and Jeff RossHBO | MaxBroadcast EditingSocial StudiesEdited by Alyse Ardell Spiegel, Helen Kearns, Catherine Bull and Charles Little IIFX on HuluBroadcast CinematographyOmnivoreDirector of Photography Tom Elliott, Sy Turnbull and Jurgen LisseApple TV+\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Come See Me in the Good Light’ Takes Top Prize at Cinema Eye Honors",
      "image": [
        "https://variety.com/wp-content/uploads/2024/12/Come-See-Me-in-the-Good-Light-Song.jpg?crop=0px%2C23px%2C900px%2C506px&resize=1000%2C563"
      ],
      "datePublished": "2026-01-09T03:34:19.000Z",
      "dateModified": "2026-01-09T03:34:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Mortal Kombat II’ Star Ludi Lin Joins ‘Comedy InvAsian III’ Cast (EXCLUSIVE)",
    "url": "https://variety.com/2026/tv/news/mortal-kombat-ii-ludi-lin-comedy-invasian-iii-cast-1236627039/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Comedy-InvAsian-III.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-09T08:23:26.000Z",
    "description": "\n\t“Mortal Kombat II” actor Ludi Lin is joining the cast of “Comedy InvAsian III,” alongside comedians Juno Men, Erik Escobar, Trevor Jang, Michelle Ma",
    "body": "\n\t“Mortal Kombat II” actor Ludi Lin is joining the cast of “Comedy InvAsian III,” alongside comedians Juno Men, Erik Escobar, Trevor Jang, Michelle MaliZaki, Shivaan Nadan, Kitty Pine and Vanja Renee.\n\n\tThe third season of the AAPI stand-up comedy showcase comes from creator-showrunner Koji Steven Sakai of Little Nalu Pictures, executive producer Victor Elizalde of Viva Pictures and creator-showrunner Quentin Lee of Margin Films. Each episode features a different comedian performing a 30-minute set.\n\t\n\n\tProduced by Little Nalu Pictures and distributed by Viva Pictures Distribution LLC, “Comedy InvAsian” premiered as a Hulu exclusive in 2018. Seasons 1 and 2 currently stream on Peacock, Tubi and Amazon Prime.\n\n\n\tThe series has launched the television careers of several AAPI comics, including Atsuko Okatsuka, Joey Guila, Robin Tran and Jiaoying Summers.\n\n\tSeason 3 will tape during four live performances on Valentine’s weekend, Feb. 14-15, at the Japanese American National Museum’s Tateuchi Democracy Forum in Los Angeles. \n\n\t“Comedy InvAsian has proven itself as both a cultural platform and a discovery engine,” said Elizalde, president of Viva Pictures. “From its Hulu-exclusive Season 1 with Atsuko Okatsuka to Season 2’s breakout performances by Jiaoying Summers, the series has helped introduce audiences to the next generation of Asian comedy talent. Season 3 continues that mission with an extraordinary new lineup.”\n\n\tElizalde also produces “Entre Nos,” the LatinX stand-up comedy series currently in its fifth season as an HBO exclusive.\n\n\t“We are thrilled to have assembled such a powerhouse of diverse talent for Season 3 of Comedy InvAsian,” said Sakai. “Seeing alumni like Atsuko Okatsuka and Robin Tran reach such heights proves how vital this platform is. This new group is incredibly sharp and ready to follow in those footsteps, bringing fresh, hilarious perspectives to the stage.”\n\t\n\n\t“As a proud Television Academy member, we plan to premiere the series in May, in celebration of AAPI Heritage Month, strategically timed for Emmy 2026 FYC consideration for outstanding variety series,” said Lee, whose spinoff “Comedy Invasion” won the 2024 Canadian Screen Award for best comedy special.\n\n\tThe Season 3 cast includes Erik Escobar, who has appeared on Prime Video’s “Beast Games” and NBC’s “Last Comic Standing”; Vancouver-based Trevor Jang, making his television debut; Lin, who returns as Liu Kang in “Mortal Kombat II” in May; Los Angeles-based Michelle MaliZaki; Seattle comedian Juno Men, who debuted in Lee’s 2024 special “Laugh Proud”; Bay Area comic Shivaan Nadan; Filipino American comedian Kitty Pine; and Vanja Renee, of Korean and Black heritage.\n\n\tViva Pictures will distribute the series on AAM.tv, Tubi and Prime Video. The company’s current comedy specials include Nick Swardson, Gary Owen and Craig Ferguson, while its original series “Entre Nos” airs on HBO. Viva has also featured early specials from Ralph Barbosa, Jiaoying Summers, Atsuko Okatsuka and Joey Guila.\n\n\tLittle Nalu Pictures, based in South Pasadena, California, specializes in diverse and inclusive narratives. The company’s projects appear on Netflix, Hulu, Amazon Prime and Peacock.\n\n\tMargin Films was founded by Lee in 1996 and is incorporated in British Columbia, Canada, and California. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Mortal Kombat II’ Star Ludi Lin Joins ‘Comedy InvAsian III’ Cast (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Comedy-InvAsian-III.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-09T08:23:26.000Z",
      "dateModified": "2026-01-09T08:23:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Adarsh Gourav, Shanaya Kapoor’s Bejoy Nambiar Thriller ‘Tu Yaa Main’ Unveils Teaser Ahead of Valentine’s Release (EXCLUSIVE)",
    "url": "https://variety.com/2026/film/news/adarsh-gourav-shanaya-kapoor-thriller-tu-yaa-main-teaser-1236627012/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Tu-Yaa-Main1.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-09T07:20:07.000Z",
    "description": "\n\tThe makers of Indian filmmaker Bejoy Nambiar’s survival thriller “Tu Yaa Main” have unveiled the film’s teaser, offering audiences their first glimp",
    "body": "\n\tThe makers of Indian filmmaker Bejoy Nambiar’s survival thriller “Tu Yaa Main” have unveiled the film’s teaser, offering audiences their first glimpse at the edge-of-the-seat drama starring Adarsh Gourav and Shanaya Kapoor, set for a Valentine’s Day-adjacent release on Friday, Feb. 13.\n\n\tThe teaser plunges viewers into the world of two content creators from contrasting backgrounds who unite for a collaboration fueled by curiosity, social media clout and mutual attraction. What begins as an energetic adventure spirals into a deadly confrontation with a menacing crocodile, transforming their content creation mission into a desperate fight for survival.\n\t\n\n\tThe film marks a departure from traditional Bollywood Valentine’s Day fare by blending romance with high-octane danger. \n\n\n\tNambiar directs from a script by Abhishek Bandekar that speaks to contemporary youth culture, merging the world of digital content creation with primal survival stakes. The film is produced by Aanand L. Rai and Himanshu Sharma under their Colour Yellow banner, alongside Vinod Bhanushali and Kamlesh Bhanushali of Bhanushali Studios Limited.\n\n\tGourav broke through internationally with his BAFTA-nominated performance in Netflix’s “The White Tiger,” which also earned him an Independent Spirit Award nomination. The actor has since appeared in “Guns & Gulaabs,” “Kho Gaye Hum Kahan,” Toronto selection “Superboys of Malegaon,” and Apple TV’s “Extrapolations.” Most recently, he was in FX series “Alien: Earth,” playing the character Slightly in the prequel to Ridley Scott’s iconic sci-fi franchise. He made his acting debut as a teenager in Karan Johar’s “My Name Is Khan.”\n\t\n\n\tKapoor makes her second big screen appearance following her debut in “Aankhon Ki Gustaakhiyan,” released in 2025. \n\n\tNambiar, who earned acclaim for stylized thrillers “Shaitan” and “David,” most recently directed the bilingual action drama  – “Dange” in the Hindi language and “Por” in Tamil – in 2024. \n\n\tWatch the teaser here:\n\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Adarsh Gourav, Shanaya Kapoor’s Bejoy Nambiar Thriller ‘Tu Yaa Main’ Unveils Teaser Ahead of Valentine’s Release (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Tu-Yaa-Main1.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-09T07:20:07.000Z",
      "dateModified": "2026-01-09T07:20:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Robbie G.K. on ‘Heated Rivalry’ Impact on the NHL and Miley Cyrus Contributing Music to Season 2: ‘I Was Absolutely a “Hannah Montana” Fan’",
    "url": "https://variety.com/2026/scene/columns/robbie-g-k-heated-rivarly-impact-nhl-miley-cyrus-music-season-2-1236627001/",
    "image": "https://variety.com/wp-content/uploads/2026/01/GettyImages-2254554761.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-09T06:27:07.000Z",
    "description": "\n\t“Heated Rivalry” star Robbie G.K. is speaking out about the show’s possible impact on professional hockey.\n\n\t“I certainly hope so,” he told me Wedne",
    "body": "\n\t“Heated Rivalry” star Robbie G.K. is speaking out about the show’s possible impact on professional hockey.\n\n\t“I certainly hope so,” he told me Wednesday at “The Pitt” Season 2 premiere in Los Angeles. “I think that big organizations like that, sports organizations — we’ve seen things in the past, specifically in the NFL, where there’s been these types of movements or things that are trying to create change. And I hope as much as [the NHL is] using this as leverage and from a marketing standpoint, they’re also taking internal notes and changing the atmosphere in change rooms and from an organizational standpoint.” (Watch the full interview in the video above.)\n\t\n\n\t“Heated Rivalry,” a show produced by Canadian streamer Crave and available in the U.S. on HBO Max, stars Hudson Williams and Connor Storrie as two pro hockey players who fall in love while having a secret 10-year affair. G.K. plays Kip, a juice bar barista who dates hockey player Scott Hunter, played by François Arnaud.\n\n\tIn the third episode of the series, Scott comes out of the closet by kissing Kip in the rink after his team has just won the Stanley Cup.\n\n\tG.K. says teams have invited him to their games: “The Vancouver Canucks reached out to me, which me and my roommates were losing our minds because we were talking about trying to get tickets. I think the New Jersey Devils reached out to me. It’s just insane, but I’m super stoked.”\n\n\t“Heated Rivalry” is based on “Game Changer,” Rachel Reid’s series of queer hockey romance novels. While storylines for Season 2 have yet to be revealed by series creator Jacob Tierney, Reid told me last month that she hopes Scott and Kip will be featured more because of the couple’s popularity among the show’s fans.\n\t\n\n\t“I saw an interview with Jacob when he was talking about writing Season 2, and he said he’s going to turn his phone off, throw it away, because I’m sure everybody and their grandma has an opinion as to what should be in Season 2,” G.K. said.” I’m just sitting around. My fingers are crossed but I appreciate having Rachel in my corner because that’s exciting. I would love to be on it more.”\n\n\tG.K. was also happy to see that Miley Cyrus is up for contributing music in Season 2. “I was absolutely a ‘Hannah Montana’ fan,” he said, adding, “That’s what I grew up on. That’s the reason I got into acting and musical theater in the first place. To see something like that is surreal. I hope at some point to meet you in person, Miley.”\n\n\t“Heated Rivalry” became an overnight hit shortly after the first two of its six episodes dropped on HBO Max over Thanksgiving weekend. G.K. said he’s being recognized more when he’s out in public. A flight attendant complimented him on the show during his flight from his hometown of Vancouver to Los Angeles. Also, at the airport, a fan handed him a “lovely letter that was very heartwarming.”\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Robbie G.K. on ‘Heated Rivalry’ Impact on the NHL and Miley Cyrus Contributing Music to Season 2: ‘I Was Absolutely a “Hannah Montana” Fan’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/GettyImages-2254554761.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-09T06:27:07.000Z",
      "dateModified": "2026-01-09T06:27:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "New Projects by Renowned Palestinian Filmmaker Suha Arraf and Oscar-Nominated Nebojša Slijepčević Selected for Göteborg’s Nordic Gateway Competition (EXCLUSIVE) ",
    "url": "https://variety.com/2026/film/global/goteborg-nordic-gateway-suha-arraf-nebojsa-slijepcevic-1236626191/",
    "image": "https://variety.com/wp-content/uploads/2026/01/VARIETY-SIZING-33.png?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-09T08:20:42.000Z",
    "description": "\n\t“Two Little Nightmares,” directed by Oscar-nominated Croatian filmmaker Nebojša Slijepčević (“The Man Who Could Not Remain Silent”), and “Chentian,”",
    "body": "\n\t“Two Little Nightmares,” directed by Oscar-nominated Croatian filmmaker Nebojša Slijepčević (“The Man Who Could Not Remain Silent”), and “Chentian,” by renowned Palestinian screenwriter Suha Arraf (“Villa Touma”), are amongst the six films selected in competition at the sophomore edition of the Nordic Gateway programme. \n\n\tThe initiative is nested within the Göteborg Film Festival’s Nordic Film Market, Scandinavia’s biggest film emporium, taking place over Jan. 28-30.\n\t\n\n\tThe program, launched last year, highlights high-potential projects from renowned helmers and production companies to facilitate co-productions and financing possibilities. A competitive showcase, the Nordic Gateway awards its winner with a  €35,000 ($40,600) Tint Post-Production Award. This year’s projects come from Palestine, Germany, Croatia, Belgium and the U.K. \n\n\n\tSpeaking with Variety, Göteborg Film Festival Head of Industry Josef Kullengård said that the Nordic Gateway initiative was designed as a way of preserving the original roots of the Nordic Film Market, which was born out of a need to have a “platform where Nordic films can reach out to the world,” but has grown exponentially since its inception. \n\n\t“Nordic Gateway is about finding the projects that we believe are suitable for co-production with Nordics, but that also tick other boxes,” he added. “The variety [this year] is super interesting as well. I’m very pleased with the spectrum of the projects.”\n\n\tProjects selected for Gateway have been hand-picked by the industry team as opposed to selected through an open call. Certain entries also come in collaboration with key partners, as is the case this year with “Element,” a German production that was selected in collaboration with the European Audiovisual Entrepreneurs (EAVE), “Two Little Nightmares,” in partnership with CineLink and “Euro Pop Bubble” with Midpoint.\n\t\n\n\n\n\t\n\n\t\t\t\t\t“Chentian,” courtesy of Göteborg Film Festival\n\t\t\t\t\t\t\t\t\tAFP\n\t\n\n\n\n\tBelow, you will find profiles for the six projects selected for this year’s Nordic Gateway: \n\n\t“Chentian,” dir. Suha Arraf (Palestine)\n\n\tArraf is the screenwriter behind festival hits such as “The Syrian Bride” and “Lemon Tree.” Her 2014 directorial debut, “Villa Touma,” played at Venice. “Chentian,” produced by leading Palestinian producer May Odeh (“Aisha Can’t Fly Away,” “A Useful Ghost”), is fresh out of Marrakech’s prestigious Atlas Workshops and trails sisters-in-law Nabila and Sham to tell a story about women, marriage and desire during occupation. As the men disappear, the women must confront betrayal, power, and survival on their own terms. A co-production between Palestine’s Odeh Films and Germany’s Mayana Films.\n\n\t“Euro Pop Bubble,” dir. Grant Gulczynski (U.K.)\n\n\tGulczynski’s work has screened at major festivals such as CPH:DOX and Sarajevo, with the filmmaker having previously been selected for the Berlin Talent Campus and Midpoint Institute. “Euro Pop Bubble” finds British musician Fred spending a lonely Christmas in the aftermath of his boyfriend’s death. Fred’s grief is quickly complicated by jealousy and ambition when he decides to follow his late partner’s dream all the way to the finale of the Euro Pop Contest, going from his lonely Berlin bedroom to a big stage in Stockholm. Produced by Crystal Compass. \n\n\t“Alors on Danse,” dir. Pieter Van Hees (Belgium) \n\n\tSet in Brussels, the film follows Zoé and Ota, two young dancers from different worlds who are unexpectedly paired during a casting call. What starts as a thorny mess of clashing egos eventually blurs into love in what is described as “an energetic, youthful and romantic dance film.” Director and writer Van Hees has previously directed provocative genre cinema such as “Left Bank” and “Waste Land,” as well as working on television in projects such as “Versailles” and “Undercover.” Producer Roxanne Sarkozi tells Variety that “Alors on Danse” “feels like a fresh echo of Pieter Van Hees’ earlier work: the same sharp eye for relationships, but with a younger, brighter spark.” Produced by De Wereldvrede. \n\n\t“Element,” dir. Mariko Minoguchi (Germany)\n\t\n\n\tThis German sci-fi offering is set soon after a seaquake begins to drain the world’s water reserves. To save humankind, a geophysicist living with early-onset Alzheimer’s is recruited to investigate the vast void swallowing the oceans. Sent to a remote station, she must uncover the truth before it’s too late. “Element” is Minoguchi’s sophomore directorial effort, following 2018’s “Relativity,” which won the German Film Critics’ Award for best debut and best screenplay. Minoguchi also co-wrote “The Colony,” which premiered at the Berlinale and reached No. 1 on U.S. Netflix charts. Producer Jorgo Narges describes “Element” as “ambitious, high-concept sci-fi that speaks to a global audience.” Produced by X Filme Creative Pool (“The White Ribbon,” “Berlin Babylon”).\n\n\t“Our Sister Angela,” dir. Jascha Hannover and Katharina Warda (Germany) \n\n\tBerlin-based writer, speaker and filmmaker Katharina Warda and “The Books He Didn’t Burn” director Jascha Hannover join forces to tell the story of GDR, an enthusiastic solidarity movement for the Black U.S. civil rights activist Angela Davis that emerged in East Germany in the early 1970s. Produced by Germany’s Florianfilm in co-production with the U.K.’s Dare Pictures and U.S.-based La Lutta. Speaking with Variety, Warda says the film will be told “from the perspective of Black East Germans, a community that is almost invisible both in Germany and internationally.”\n\n\t“Two Little Nightmares,” dir. Nebojša Slijepčević (Croatia)\n\n\tSlijepčević’s 2024 short film “The Man Who Could Not Remain Silent” won the Palme d’Or at Cannes and the European Film Award for best short film, as well as being nominated for an Oscar in the same category. “Two Little Nightmares” tells the story of Matija, who at seven-years-old is inexplicably linked to a series of suicides in the small village where he grew up — including his father’s. Years later, the playwright uses his practice as well as long-buried memories to process his troubled past. A co-production between Antitalent, Contrast Films, Les Films Norfolk, Studio Virc and Sense Production.\n\n\tAnnika Pham contributed to this piece.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "New Projects by Renowned Palestinian Filmmaker Suha Arraf and Oscar-Nominated Nebojša Slijepčević Selected for Göteborg’s Nordic Gateway Competition (EXCLUSIVE) ",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/VARIETY-SIZING-33.png?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-09T08:20:42.000Z",
      "dateModified": "2026-01-09T08:20:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "BAFTA Awards Longlists: ‘One Battle After Another’ Leads With Record 16 Nods, ‘Hamnet’ and ‘Sinners’ Follow With 14 Each",
    "url": "https://variety.com/2026/film/awards/bafta-awards-longlists-one-battle-after-another-hamnet-sinners-1236627069/",
    "image": "https://variety.com/wp-content/uploads/2026/01/bafta-longlists.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-09T12:00:00.000Z",
    "description": "\n\t“One Battle After Another” has further strengthened its long-touted position as the movie to beat this awards season, landing atop the lineup of lon",
    "body": "\n\t“One Battle After Another” has further strengthened its long-touted position as the movie to beat this awards season, landing atop the lineup of longlisted titles following the first round of voting for the 2026 BAFTA Film Awards.\n\n\tPaul Thomas Anderson’s epic, scathing and increasingly topical political satire about U.S. extremism and polarization came away with 16 nods after voting across 25 categories — the highest since the longlist round was first introduced in 2021. Predictably, alongside best film, director and adapted screenplay, it dominated the performance lists, with Chase Infiniti, Leonardo DiCaprio, Teyana Taylor, Benicio Del Toro and Sean Penn all making it through to the next round.\n\t\n\n\tFollowing on its heels, a tight pack of films is led by Chloe Zhao’s “Hamnet” and Ryan Coogler’s “Sinners,” which landed 14 longlist slots each. Right behind, Josh Safdie’s “Marty Supreme” earned 13 nods, with Yorgos Lanthimos’ “Bugonia” and Guillermo del Toro’s “Frankenstein” all receiving 12. Meanwhile, “Sentimental Value” and “Wicked: For Good” both found spaces on eight lists (down from the 10 the first “Wicked” earned last year, with Jon M. Chu again missing out on director but Cynthia Erivo in the mix despite recent SAG and Critics Choice snubs).\n\n\n\tAlongside the expected big names in the race, there was good news for British films too. “I Swear” and “Pillion” landed on six lists and “The Ballad of Wallis Island” on five, including the performance categories. Robert Aramayo and Peter Mullan from “I Swear,” Harry Melling and Alexander Skarsgard from “Pillion” and “Wallis Island’s” Carey Mulligan all got through to round two.\n\t\n\n\t“Wallis Island” and “I Swear” also managed to earn enough love from BAFTA voters to find themselves on the 10-strong best film longlist, as did “Nuremberg,” which earned six slots overall.\n\n\tWhen it comes to snubs, some may be surprised that Jafar Panahi’s Palme d’Or-winning “It Was Just an Accident” didn’t manage more than two longlist mentions beyond original screenplay and film not in the English language. “The Secret Agent” landed in the same lists as “It Was Just an Accident,” but notably walked away empty handed for lead star Wagner Moura, still considered an Oscars potential. And for all its growing buzz, “Sirāt” also managed just two, for casting and film in the English language (and not, as many might have expected, for sound).\n\n\tMeanwhile, many major films tipped early on for awards glory came away with even fewer nods. “The Smashing Machine” found space solely in make-up and hair list, “Jay Kelly” landed a supporting slot for Adam Sandler, while “Hedda” emerged with a leading actress slot for Tessa Thompson. Despite acclaim and multiple award nominations on home soil, local titles “Urchin” (the directorial debut of Harris Dickinson) and “My Father’s Shadow” also earned just one longlist space each (Akinola Davies Jr.’s “My Father’s Shadow” unexpectedly absent from the outstanding British film list).\n\n\tAs ever, all may change dramatically when the full list of nominations is announced on Jan. 27 (minus the Rising Star award nominees, which are unveiled on Jan. 14). Then it’s over to the BAFTA Film Awards ceremony itself, which will take place Feb. 22 at London’s Royal Festival Hall with Alan Cumming on hosting duties for the first time.\n\n\tSee all the longlists below.\n\n\tBEST FILM\n\n\t“The Ballad of Wallis Island”\n\n\t“Bugonia”\n\n\t“Frankenstein”\n\n\t“Hamnet”\n\n\t“I Swear”\n\n\t“Marty Supreme”\n\n\t“Nuremberg”\n\n\t“One Battle After Another”\n\n\t“Sentimental Value”\n\n\t“Sinners”\n\n\tOUTSTANDING BRITISH FILM\n\n\t“28 Years Later”\n\n\t“Ballad of a Small Player”\n\n\t“The Ballad of Wallis Island”\n\n\t“Bridget Jones: Mad About the Boy”\n\n\t“The Choral”\n\n\t“Die My Love”\n\n\t“Goodbye June”\n\n\t“H Is for Hawk”\n\n\t“Hamnet”\n\n\t“I Swear”\n\n\t“Mr. Burton”\n\n\t“Pillion”\n\t\n\n\t“The Roses”\n\n\t“Steve”\n\n\t“Warfare”\n\n\tOUTSTANDING DEBUT BY A BRITISH WRITER, DIRECTOR OR PRODUCER\n\n\t“The Ceremony”\n\n\t“The Man in My Basement”\n\n\t“Mother Vera”\n\n\t“My Father’s Shadow”\n\n\t“Pillion”\n\n\t“Ocean With David Attenborough”\n\n\t“The Shadow Scholars”\n\n\t“Urchin”\n\n\t“A Want in Her”\n\n\t“Wasteman”\n\n\tCHILDREN’S & FAMILY FILM\n\n\t“Arco”\n\n\t“Boong”\n\n\t“Elio”\n\n\t“Grow”\n\n\t“How to Train Your Dragon”\n\n\t“Lilo & Stitch”\n\n\t“Little Amelie”\n\n\t“Zootropolis 2”\n\n\tFILM NOT IN ENGLISH LANGUAGE\n\n\t“It Was Just an Accident”\n\n\t“La Grazia”\n\n\t“Left-Handed Girl”\n\n\t“No Other Choice”\n\n\t“Nouvelle Vague”\n\n\t“Rental Family”\n\n\t“The Secret Agent”\n\n\t“Sentimental Value”\n\n\t“Sirāt”\n\n\t“The Voice of Hind Rajab”\n\n\tDOCUMENTARY\n\n\t“2000 Meters to Andriivka”\n\n\t“Apocalypse in the Tropics”\n\n\t“Becoming Led Zeppelin”\n\n\t“Cover-Up”\n\n\t“The Librarians”\n\n\t“Mr. Nobody Against Putin”\n\n\t“Ocean With David Attenborough”\n\n\t“One to One: John & Yoko”\n\n\t“The Perfect Neighbor”\n\n\t“Riefenstahl”\n\n\tANIMATED FILM\n\n\t“Arco”\n\n\t“The Bad Guys 2”\n\n\t“Demon Slayer: Kimetsu no Yaiba Infinity Castle”\n\n\t“Elio”\n\n\t“Little Amelie”\n\n\t“Zootropolis 2”\n\n\tDIRECTOR\n\n\t“Bugonia,” Yorgos Lanthimos\n\n\t“Die My Love,” Lynne Ramsay\n\n\t“Hamnet,” Chloé Zhao\n\n\t“A House of Dynamite,” Kathryn Bigelow\n\n\t“Marty Supreme,” Josh Safdie\n\n\t“One Battle After Another,” Paul Thomas Anderson\n\n\t“Rental Family,” Hikari\n\n\t“Sentimental Value,” Joachim Trier\n\n\t“Sinners,” Ryan Coogler\n\n\t“The Voice of Hind Rajab,” Kaouther Ben Hania\n\n\tORIGINAL SCREENPLAY\n\n\t“Blue Moon”\n\n\t“A House of Dynamite”\n\n\t“I Swear”\n\n\t“Is This Thing On?”\n\n\t“It Was Just an Accident”\n\n\t“Marty Supreme”\n\n\t“The Secret Agent”\n\n\t“Sentimental Value”\n\n\t“Sinners”\n\n\t“Weapons”\n\n\tADAPTED SCREENPLAY\n\n\t“28 Years Later”\n\n\t“The Ballad of Wallis Island”\n\n\t“Bugonia”\n\n\t“Frankenstein”\n\n\t“Hamnet”\n\n\t“Nuremberg”\n\n\t“One Battle After Another”\n\n\t“Pillion”\n\n\t“Train Dreams”\n\n\t“Wake Up Dead Man: A Knives Out Mystery”\n\n\tLEADING ACTRESS\n\n\tJessie Buckley, “Hamnet”\n\n\tRose Byrne, “If I Had Legs I’d Kick You”\n\n\tCynthia Erivo, “Wicked: For Good”\n\n\tKate Hudson, “Song Sung Blue”\n\t\n\n\tChase Infiniti, “One Battle After Another”\n\n\tJennifer Lawrence, “Die My Love”\n\n\tRenate Reinsve, “Sentimental Value”\n\n\tAndrea Riseborough, “Dragonfly”\n\n\tEmma Stone, “Bugonia”\n\n\tTessa Thompson, “Hedda”\n\n\tLEADING ACTOR\n\n\tRobert Aramayo, “I Swear”\n\n\tTimothée Chalamet, “Marty Supreme”\n\n\tRussell Crowe, “Nuremberg”\n\n\tLeonardo DiCaprio, “One Battle After Another”\n\n\tJoel Edgerton, “Train Dreams”\n\n\tEthan Hawke, “Blue Moon”\n\n\tMichael B. Jordan, “Sinners”\n\n\tHarry Melling, “Pillion”\n\n\tCillian Murphy, “Steve”\n\n\tJesse Plemons, “Bugonia”\n\n\tSUPPORTING ACTRESS\n\n\tOdessa A’zion, “Marty Supreme”\n\n\tBrenda Blethyn, “Dragonfly”\n\n\tAriana Grande, “Wicked: For Good”\n\n\tInga Ibsdotter Lilleaas, “Sentimental Value”\n\n\tAmy Madigan, “Weapons”\n\n\tWunmi Mosaku, “Sinners”\n\n\tCarey Mulligan, “The Ballad of Wallis Island”\n\n\tGwyneth Paltrow, “Marty Supreme”\n\n\tTeyana Taylor, “One Battle After Another”\n\n\tEmily Watson, “Hamnet”\n\n\tSUPPORTING ACTOR\n\n\tBenicio Del Toro, “One Battle After Another”\n\n\tJacob Elordi, “Frankenstein”\n\n\tDelroy Lindo, “Sinners”\n\n\tPaul Mescal, “Hamnet”\n\n\tPeter Mullan, “I Swear”\n\n\tSean Penn, “One Battle After Another”\n\n\tAdam Sandler, “Jay Kelly”\n\n\tAndrew Scott, “Blue Moon”\n\n\tAlexander Skarsgård, “Pillion”\n\n\tStellan Skarsgård, “Sentimental Value”\n\n\tCASTING\n\n\t“Frankenstein”\n\n\t“Hamnet”\n\n\t“A House of Dynamite”\n\n\t“I Swear”\n\n\t“Marty Supreme”\n\n\t“One Battle After Another”\n\n\t“Pillion”\n\n\t“Sentimental Value”\n\n\t“Sinners”\n\n\t“Sirāt”\n\n\tCINEMATOGRAPHY\n\n\t“Ballad of a Small Player”\n\n\t“Bugonia”\n\n\t“Die My Love”\n\n\t“F1”\n\n\t“Frankenstein”\n\n\t“Hamnet”\n\n\t“Marty Supreme”\n\n\t“One Battle After Another”\n\n\t“Sinners”\n\n\t“Train Dreams”\n\n\tCOSTUME DESIGN\n\n\t“Bugonia”\n\n\t“Downton Abbey: The Grand Finale”\n\n\t“Frankenstein”\n\n\t“Hamnet”\n\n\t“Marty Supreme”\n\n\t“Nouvelle Vague”\n\n\t“Nuremberg”\n\n\t“One Battle After Another”\n\n\t“Sinners”\n\n\t“Wicked: For Good”\n\n\tEDITING\n\n\t“28 Years Later”\n\n\t“Bugonia”\n\n\t“F1”\n\n\t“Frankenstein”\n\n\t“Hamnet”\n\n\t“A House of Dynamite”\n\n\t“Marty Supreme”\n\n\t“One Battle After Another”\n\n\t“Sinners”\n\n\t“Weapons”\n\n\tMAKE UP & HAIR\n\n\t“Bugonia”\n\n\t“Downton Abbey: The Grand Finale”\n\t\n\n\t“Frankenstein”\n\n\t“Hamnet”\n\n\t“Marty Supreme”\n\n\t“Nuremberg”\n\n\t“One Battle After Another”\n\n\t“Sinners”\n\n\t“The Smashing Machine”\n\n\t“Wicked: For Good”\n\n\tORIGINAL SCORE\n\n\t“28 Years Later”\n\n\t“The Ballad of Wallis Island”\n\n\t“Bugonia”\n\n\t“Frankenstein”\n\n\t“Hamnet”\n\n\t“Marty Supreme”\n\n\t“Nuremberg”\n\n\t“One Battle After Another”\n\n\t“Sinners”\n\n\t“Wicked: For Good”\n\n\tPRODUCTION DESIGN\n\n\t“Ballad of a Small Player”\n\n\t“Bugonia”\n\n\t“The Fantastic Four: First Steps”\n\n\t“Frankenstein”\n\n\t“Hamnet”\n\n\t“Marty Supreme”\n\n\t“Mickey 17”\n\n\t“One Battle After Another”\n\n\t“Sinners”\n\n\t“Wicked: For Good”\n\n\tSPECIAL VISUAL EFFECTS\n\n\t“Avatar: Fire and Ash”\n\n\t“F1”\n\n\t“Frankenstein”\n\n\t“How to Train Your Dragon”\n\n\t“Jurassic World Rebirth”\n\n\t“The Lost Bus”\n\n\t“Mickey 17”\n\n\t“Superman”\n\n\t“Tron: Ares”\n\n\t“Wicked: For Good”\n\n\tSOUND\n\n\t“Avatar: Fire and Ash”\n\n\t“Bugonia”\n\n\t“F1”\n\n\t“Frankenstein”\n\n\t“The Lost Bus”\n\n\t“Mission: Impossible – The Final Reckoning”\n\n\t“One Battle After Another”\n\n\t“Sinners”\n\n\t“Warfare”\n\n\t“Wicked: For Good”\n\n\tBRITISH SHORT ANIMATION\n\n\t“Brain Space”\n\n\t“Cardboard”\n\n\t“Death’s Peak”\n\n\t“Ovary-Acting”\n\n\t“Solstice”\n\n\t“Two Black Boys in Paradise”\n\n\tBRITISH SHORT FILM\n\n\t“22+1”\n\n\t“Blondi”\n\n\t“Magid / Zafar”\n\n\t“Neil Armstrong and the Langholmites”\n\n\t“Nostalgie”\n\n\t“The Pearl Comb”\n\n\t“Terence”\n\n\t“This Is Endometriosis”\n\n\t“Welcome Home Freckles”\n\n\t“Wonderwall”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "BAFTA Awards Longlists: ‘One Battle After Another’ Leads With Record 16 Nods, ‘Hamnet’ and ‘Sinners’ Follow With 14 Each",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/bafta-longlists.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-09T12:00:00.000Z",
      "dateModified": "2026-01-09T12:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Berlin Golden Bear Prizewinner Dag Johan Haugerud and ‘Sami Blood’ Director Amanda Kernell Present Projects at Göteborg’s Nordic Film Market (EXCLUSIVE)",
    "url": "https://variety.com/2026/film/global/nordic-film-market-amanda-kernell-dag-johan-haugerud-1236626306/",
    "image": "https://variety.com/wp-content/uploads/2026/01/MixCollage-08-Jan-2026-07-25-PM-1866.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-09T08:16:01.000Z",
    "description": "\n\tThe 27th edition of the Göteborg Festival’s Nordic Film Market, taking place over Jan. 28 – 30, is readying for a starry edition, welcoming new proj",
    "body": "\n\tThe 27th edition of the Göteborg Festival’s Nordic Film Market, taking place over Jan. 28 – 30, is readying for a starry edition, welcoming new projects by “Sami Blood” director Amanda Kernell (“Brace Your Heart”), Ulaa Salim (“Candy Kings”) and “Quisling” helmer Erik Poppe (“Beloved”), among many more. \n\n\tMay el-Toukhy, known for “Queen of Hearts,” will bring “Woman, Unknown,” produced by Mikael Rieks for Nordisk Film Production. Norway’s up-and-coming Rikke Gregersen (“Requiem for Selina”) will have titles in both Discovery and the Works in Progress sections, while Alex Schulman will present “Once in The Archipelago.”\n\t\n\n\t“Schulman is very well known to the Swedish audience: he’s a writer and podcaster. It’s one of the titles that I believe will resonate both with audiences and with the festivals. Our priority is always to have distinct voices, and we really try to have a strong blend between newcomers and senior directors, but also films that are not only festival films but do have a clear target audience and commercial ambition,” noted Nordic Film Market head Josef Kullengård.\n\n\n\t“We have been growing slightly for the past years. We are expecting 650 attendees for the Nordic Film Market and 1200 for the NFM and TV Drama Vision. But for us, it’s not a value in itself just to grow – it has always been about serving the industry,” he added. \n\n\t“Judging from the selection so far, we can expect a vintage year for Nordic films in 2026.”\n\n\tAt the Discovery Co-Production Platform – promoting feature films in development – Dag Johan Haugerud will follow his acclaimed “Sex/Love/Dreams” trilogy with “Light and Shadows,” produced by Yngve Sæther for Motlys. Frida Kempff will present “Swine.”\n\t\n\n\t“‘Swine’ is about what happens when women are reduced to surfaces and functions,” observed Kempff, known for “Knocking” and “The Swedish Torpedo.”\n\n\t“By working with body horror and black comedy, I want to make a film that is confrontational, sensual and uncomfortable, without asking for permission. Genre becomes a way to be brutally honest.” \n\n\tAction thriller “The Silver of Egill,” directed by Hafsteinn Gunnar Sigurðsson, as well as August Joensalo’s “This Body Is My Final Address,” are among other highlights. \n\n\t“We are thrilled to be launching ‘The Silver of Egill’ at the Nordic Film Market. This is a really exciting script, set in contemporary Iceland, that casts new light on the Icelandic sagas and the origin of the Icelandic people, which strongly resonates with the wild political climate of our time,” said Hafsteinn Gunnar Sigurðsson, also behind “Under the Tree” and “Either Way,” later remade as “Prince Avalanche.”\n\n\t“It’s an unexpected take on the adventure thriller. Or as we prefer to call it, a Viking spin on ‘The Da Vinci Code’.”\n\n\tIn “This Body Is My Final Address,” Joensalo “has set out to create an intimate film about how it feels for them to gender transition in Finland,” said Emilia Haukka, producing for Finland’s Aamu Film Company.\n\n\t“They have an exceptional access to document how it feels to go through a second puberty, navigate trans healthcare, and fall in love while being in constant change with their body and mind. August is a new talent in Aamu Film Company’s family of filmmakers, and we are captivated by their ability to take on deeply personal subjects and transform them to compelling storytelling for the screen.”\n\n\tBloody genre offerings will also be represented, thanks to Elin Grönblom’s “Bloodsuckers,” Ilja Rautsi’s “Red Snow” and “Vampyr,” directed by Arild Fröhlich.\n\n\t“It’s been a pleasure to be able to show such variety of films and to have more genre-flirting films than we usually do: both with ‘Red Snow’ and ‘Bloodsuckers,’ which we had in the Discovery lineup last year,” noted Kullengård, calling it a “very elevated horror film.”\n\n\tOverall, this year’s line-up features 15 completed Nordic market screenings, 19 Works in Progress and 16 films in development alongside six titles showcased in the Nordic Gateway: “Alors on Danse,” “Chentian,” “Element,” “Euro Pop Bubble,” “Our Sister Angela – Black Power in the GDR” and “Two Little Nightmares.” \n\t\n\n\tMany NFM projects return to the festival later on. That includes past Works in Progress titles “Redoubt,” “Weightless,” “The Last Resort” and “The Love That Remains,” all part of this year’s lineup.  \n\n\t“It’s a beautiful cycle: we want Göteborg to be part of the entire journey of Nordic creators and projects, from engaging with emerging talent at Nordic film schools to premiering a debut film within the festival program. To be able to tie that circle together is something we are very proud of,” Kullengård added.\n\n\t“Göteborg is the place where people come to meet with the Nordics.”\n\n\tOr with two-time Cannes Palme d’Or winner Ruben Östlund himself. The director of “The Square” and “Triangle of Sadness” will surely generate quite a few headlines thanks to an exclusive on-stage conversation about his upcoming seventh feature “The Entertainment System Is Down.” \n\n\t“The idea with this session is to dive into the production journey and artistic ambition of the project. It will be a case study, not a work in progress. Ruben is the Honorary President [of the Göteborg Film Festival], so it’s a way of getting our attendees to get closer to his artistic brilliance,” said Kullengård.\n\n\tAdditional reporting by Annika Pham\n\n\n\n\t\n\n\t\t\t\t\t‘Woman, Unknown’\n\t\t\t\t\t\t\t\t\tCourtesy of Göteborg Film Festival\n\t\n\n\n\n\tWorks in Progress\n\n\t“Almost There” (NO), directed by Rikke Gregersen, produced by Ingvil Sæther Berger, Motlys \n\n\t“Beloved” (NO), directed by Erik Poppe, produced by Finn Gjerdrum, Paradox (Sales: Reinvent Yellow)\n\n\t“Bloodsuckers” (SE), directed by Elin Grönblom, produced by Patrik Andersson, Jakob Abrahamsson, Mylla Films (Sales: TBA)\n\n\t“Brace Your Heart” (SE), directed by Amanda Kernell, produced by Eva Åkergren, Nordisk Film (Sales: TrustNordisk)\n\n\t“Candy Kings” (DK), directed by Ulaa Salim, produced by Daniel Mühlendorph, Hyæne (Sales: Reinvent Yellow)\n\n\t“Halima” (FI), directed by Naima Mohamud, produced by Anita Hyppönen, Jani Pösö, Hannu Aukia, It’s Alive Films \n\n\t“Lionheart” (DK), directed by Nagieb Khaja, produced by Signe Leick Jensen, Morten Kaufmann, Toolbox Film \n\n\t“Low Expectations” (NO), directed by Eivind Landsvik, produced by Synnøve Hørsdal, Lotte Sandbu, Maipo \n\t\n\n\t“Maia Against the World” (DK), directed by Hannah Elbke, produced by Maria Møller Christoffersen, Frau Film \n\n\t“Once in The Archipelago” (SE), directed by Alex Schulman, produced by Christina Legkova, Sofie Palage, Warner Bros \n\n\t“Push The Button” (SE), directed by Anton Källrot, produced by Ylva Olaison, Madeleine Ekman, Ögat Film\n\n\t“Red Snow” (FI), directed by Ilja Rautsi, produced by Misha Jaari, Mark Lwoff, Bufo (Sales: Charades)\n\n\t“Saturn Return” (SE), directed by Agnes Skonare, produced by Joel Rostmark, Adam Meinking, Saturnus Films \n\n\t“Sãp” (SE), directed by Alecio Araci, produced by Stina Ikovic, Alicia Hansen, Prolaps Produktion\n\n\t“Transfer Window” (DK), directed by Caroline Sasha Cogez, produced by Jesper Morthorst, Lise Orheim Stender, Motor \n\n\t“Vampyr” (NO), directed by Arild Fröhlich, produced by Petter Onstad Løkke, Cornelia Boysen, Maipo (Sales: TrustNordisk)\n\n\t“Weird Elliot” (SE), directed by Johannes Nyholm, produced by Nima Yousefi, Peter Krupenin, HOBAB\n\n\t“Will You Care If I Die?” (SE), directed by Rojda Sekersöz, produced by Helen Ahlsson, Sandra Harms, Nordic Drama Queens (Sales: TrustNordisk)\n\n\t“Woman, Unknown” (DK), directed by May el-Toukhy, produced by Mikael Rieks, Nordisk Film Production (Sales: TrustNordisk)\n\n\n\n\t\n\n\t\t\t\t\t‘Bloodsuckers’\n\t\t\t\t\t\t\t\t\tCourtesy of Göteborg Film Festival\n\t\n\n\n\n\tDiscovery Co-production Platform\n\n\t“A Root of Evil” (SE), directed by Henrik Björn, produced by Emma Nyberg, Johanna Bergenstråhle, Nordisk Film Sweden \n\n\t“Beautiful Misfits” (SE), directed by André Vaara, produced by Erika Malmgren, Annika Hellström, Cinenic Film \n\n\t“Bitte Leben” (SE), directed by Elsa Rosengren, produced by Peter Krupenin, Christopher Zitterbart, Margarita Amineva, HOBAB \n\n\t“Cartas” (SE), directed by Juan Pablo Libossart, produced by Anna-Maria Kantarius, Mimmi Spång, Garagefilm International \n\n\t“Labour Day” (FI), directed by Joel Karppanen, produced by Pasi Hakkio, Wacky Tie Films \n\n\t“Light and Shadows” (NO), directed by Dag Johan Haugerud, produced by Yngve Sæther, Motlys \n\n\t“Medicated” (DK), directed by Las Dyhrcrone, produced by Daniel Mühlendorph, Hyæne Film \n\n\t“Ghosts” (DK), directed by Milad Alami, produced by Stinna Lassen, Uma Film \n\t\n\n\t“Neela” (DK), directed by Nivetha Balasubramaniam, produced by Matilda Appelin, New Day Productions\n\n\t“Out of Athens” (NO), directed by Badrudin Gaur, produced by Vibeke Ringen, Nordisk Film Production\n\n\t“Racer” (SE), directed by Johan Storm, produced by Per Janérus, Björn Carlström, Harmonica Films \n\n\t“Swine” (SE), directed by Frida Kempff, produced by Erik Andersson, David Herdies, Läsk “\n\n\t“The Silver of Egill” (IS), directed by Hafsteinn Gunnar Sigurðsson, produced by Grímar Jónsson, Netop Films \n\n\t“This Body Is My Final Address” (FI), directed by August Joensalo, produced by Emilia Haukka, Aamu Film Company \n\n\t“Tiger” (NO), directed by Rikke Gregersen, produced by Rebekka Rognøy, Gary Cranner, Bacon \n\n\t“Worldbuilding” (SE), directed by Balder Ljunggren, produced by Stina Ikovic, Alicia Hansen, Prolaps produktion \n\n\tNordic Gateway\n\n\t“Alors on Danse” (BE), directed by Pieter Van Hees, produced by Roxanne Sarkozi, De Wereldvrede \n\n\t“Chentian” (PS), directed by Suha Arraf, produced by May Odeh, Odeh Films \n\n\t“Element” (DE), directed by Mariko Minoguchi, produced by Jorgo Narjes, X-Filme \n\n\t“Euro Pop Bubble” (UK), directed by Grant Gulczynski, produced by Harry Silverlock, Crystal Compass\n\n\t“Our Sister Angela – Black Power in the GDR” (DE), directed by Jascha Hannover, Katharina Warda, produced by Markus Augé, Florianfilm \n\n\t“Two Little Nightmares” (HR), directed by Nebojša Slijepčević, produced by Danijel Pek, Katarina Prpić, Antitalent \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Berlin Golden Bear Prizewinner Dag Johan Haugerud and ‘Sami Blood’ Director Amanda Kernell Present Projects at Göteborg’s Nordic Film Market (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/MixCollage-08-Jan-2026-07-25-PM-1866.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-09T08:16:01.000Z",
      "dateModified": "2026-01-09T08:16:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘A Concert for Altadena’ Raises $450K for Community Rebuilding, and Raises Spirits With Dawes, Brandon Flowers, Brad Paisley and Other Performers",
    "url": "https://variety.com/2026/music/concert-reviews/altadena-fire-benefit-concert-dawes-brandon-flowers-1236626776/",
    "image": "https://variety.com/wp-content/uploads/2026/01/2.-Altadena-Credit_Nikki_Phillips.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-09T05:06:47.000Z",
    "description": "\n\tBackstage at the benefit that took place Wednesday night under the name A Concert for Altadena, star and co-organizer Taylor Goldsmith of Dawes was ",
    "body": "\n\tBackstage at the benefit that took place Wednesday night under the name A Concert for Altadena, star and co-organizer Taylor Goldsmith of Dawes was talking about how he came close to thinking it was not necessarily vital to hold the concert exactly on the first anniversary of the devastating fires of Jan. 7, 2025.\n\n\t“You know, I was saying today I’m so glad we did,” said Goldsmith, as the sold-out show was beginning at the Pasadena Civic Auditorium. “Because initially I thought, ‘Oh, should we just do it on the Friday that week, to help people get here?’ But I mean, I’ve found myself, even, emotionally processing in ways that feel like this show’s gonna be all the more potent. If we had we done it on Friday, I feel like it just wouldn’t be necessarily living in us the way it is right at this moment.” \n\t\n\n\tAt one point in the nearly four-hour show, host John C. Reilly stopped to acknowledge that there were members of the community who might have wanted to be among the 3,000-strong audience members, but who skipped out on buying tickets (or accepting the gratis ones offered to some fire victims) because it would have been too traumatic to see footage of the fire or its aftermath, or hear the recounting of the devastation and 19 deaths. It was the rare concert where a moment was given to respect for those who opted out of coming.\n\n\n\tFor Goldsmith, whose family lost part or all of three Altadena homes in the fire, all these emotions were encouraged and expected. “I think people want to have a good time, but I do think catharsis plays a massive role,” he said, “I think people are expecting to have to hold each other, but maybe also encourage a little bit of these (tougher) emotions. This is gonna be a space for that, whether it’s cheering or singing or crying. And I think a lot of these songs speak to kind of giving that opportunity.”\n\t\n\n\tAnyone who came just for known bangers, based on the featured billing, did not leave disappointed. Brandon Flowers of the Killers was saved for a climactic spot in the proceedings for a reason, capping off a rousing “When We Were Young” with an even more rabble-rousing cover of Bruce Springsteen’s “The Promised Land.” Stephen Stills stood energized the many boomers on hand and their progeny with versions of “For What It’s Worth” and “Love the One You’re With” that featured fellow guitar gunslinger Brad Paisley. Everclear brought the vintage KROQ energy with a full mini-set of alt-rock perennials. And those moments were the tip of the iceberg for a night that found standing ovations given to songs and artists that were not as recognizable to everyone in the house, like the leaps to stand up and applaud that followed vocally stunning performances by Lucius and Judith Hill.\n\n\n\n\t\n\n\t\t\t\t\tBrandon Flowers performs at ‘A Concert for Altadena’ at the Pasadena Civic Auditorium\n\t\t\t\t\t\t\t\t\tNikki Phillips/First III No Flash\n\t\n\n\n\n\tThe evening raised more than $450,000, its producers announced Thursday., earmarked for the Altadena Builds Back Foundation (ABBF), a charity that was formed last April under the wing of the 70-year-old Pasadena Community Foundation. Speaking early in the program, Jennifer DeVoll, executive director of the ABBF, talked about the grants the org has already given out this past year, much of which has gone toward building homes, through organizations like Habitat for Humanity. Intensely local groups like the Black Freedom Fund and Altadena Girls will also benefit from the proceeds.\n\n\tThere has been controversy over the dispersal of fundraising since the fire, which was on Goldsmith’s mind as he and his fellow organizers decided who would benefit from Wednesday’s show. “That kind of suspicion or concern was what really went into us making these decisions,” he said backstage. “And so when we came across Altadena Builds Back Foundation, that was working with Habitat for Humanity, and then visiting some of the properties and seeing firsthand what they were doing for these families, it made us feel like this is the right, this is the right foundation to bring. That’s what this whole thing’s for, so we weren’t gonna just not think it through in any detail.”\n\n\n\n\t\n\n\t\t\t\t\tDawes performs at ‘A Concert for Altadena’ at the Pasadena Civic Auditorium\n\t\t\t\t\t\t\t\t\tNikki Phillips/First III No Flash\n\t\n\n\n\n\tGoldsmith, who lost a home studio and all his equipment in the fire, was standing in a group with several other people who suffered property losses of their own, including his brother, Dawes drummer Griffin Goldsmith. (The brothers’ parents also lost their home.) Co-organizer Eric Krasno, a guitar great who later that night would deliver a pitch-perfect “Voodoo Chile,” was another in this circle, along with fellow guest performer Aloe Blacc, who would soon thrill the crowd with a signature song, “Wake Me Up.”\n\t\n\n\t“My kids lost their school,” said Blacc. “The students from Pasadena Waldorf Choir are singing tonight.” In fact, that’s what Taylor Goldsmith, Krasno and Blacc had in common: children at that school. “Many of my friends and many of the teachers at the school lost homes. And I lost a couple of properties, though it wasn’t my main home. So I have to stand and support as many people as possible spreading the word. Since the fires, I’ve met up with a lot of organizations and foundations to donate, and then linked them with local organizations that they could get the money to. Because money was going to, in my opinion, some organizations that were not distributing properly. If I could be diplomatic.”\n\n\n\n\t\n\n\t\t\t\t\tAloe Blacc and Brandon Flowers perform at ‘A Concert for Altadena’ at the Pasadena Civic Auditorium\n\t\t\t\t\t\t\t\t\tNikki Phillips/First III No Flash\n\t\n\n\n\n\tAs Blacc hinted at, there is more than a little anger to go around about what happened before, during and since the fires, along with the sorrow and thousand other emotions. This primarily celebratory night wasn’t about that… or mostly wasn’t about it; a little feistiness bubbled up from time to time, especially when host Reilly went off-script for some impromptu remarks about the power company and President Trump that got much of the crowd whooping in appreciation.\n\n\tNoting that he was being prompted to “riff” between musical setups, Reilly — who was also displaced by the Altadena fire — took on Southern California Edison. “I want to point out that many people are calling these fires, wildfires. And they were wild…. Those Santa Anas made those fires wild. But those fires did not start naturally. Those fires started because of Southern California Edison. … By the way, I saw what you offered, Southern California Edison, to our survivors — you could go fuck yourselves.”\n\n\tIt wasn’t just Trump and the power company drawing the ire of the otherwise good-humored actor. “2025, you can kiss my ass,” he blurted, extending his rear end.\n\n\n\n\t\n\n\t\t\t\t\tJohn C. Reilly hosts ‘A Concert for Altadena’ at the Pasadena Civic Auditorium\n\t\t\t\t\t\t\t\t\tNikki Phillips/First III No Flash\n\t\n\n\n\n\tThe idea that a historically mixed-race and mixed-class neighborhood might be rebuilt as a very different kind of community came up in the speech of activist Heavenly Hughes, one of the subjects of the currently Oscar-shortlisted short film “All the Walls Came Down.” A chant was led: “Altadena is not for sale.”\n\t\n\n\tBut for much of the night, the mood was lighter, if not giddy at times. That’s inevitable for any night that has Ozomatli performing in the first half-hour and dispersing through the aisles — right on the heels of the aforementioned kids’ choir performance. After the requisite turnout of local speakers, the stage was turned over to Everclear, whose Art Alexakis made sure the twin fire above the other end of the Los Angeles basin was not forgotten in the Altadena/Pasadena focus.\n\n\t“This goes out to all our brothers and sisters in Pacific Palisades,” said Alexakis., introducing the song “Santa Monica.” “I grew up in Santa Monica on the poor side of town in a place called Ocean Park, which a lot of people call Dogtown. Pacific Palisades is what you aspire to, right? And just seeing the damage there just breaks my heart. But I gotta tell you… I aspired Altadena, and I didn’t even know it.” \n\n\n\n\t\n\n\t\t\t\t\tEverclear performs at ‘A Concert for Altadena’ at the Pasadena Civic Auditorium\n\t\t\t\t\t\t\t\t\tNikki Phillips/First III No Flash\n\t\n\n\n\n\tTalking backstage before the show, Goldsmith said he couldn’t forecast any highlights, but once he was out on stage, he let his bias show. “I’m not above saying that this next guest is my favorite guest of the whole batch,” he told the crowd. “This is the person that actually helped guide my family through the whole experience… this person I love more than anything in the world. This is Mandy Moore.” For anyone who was listening to Top 40 instead of KROQ in 1999, Goldsmith’s wife was also able to take the crowd back, with a slightly more rocking version of her breakout hit “Candy.”\n\n\tDawes’ own contributions to the night, apart from serving as backing band for most of the performers in the second half, included reprising “I Love L.A.,” which they played at the 2025 Grammys with Paisley, as they did here — somehow resisting what had to have been an impulse to insert Lake Ave. somewhere into Randy Newman’s sacred text. The Goldsmith brothers touched on the theme of hope for something lasting amid impermanence in a more mirth-skirting way with their anthem “All Your Favorite Bands.” (Again, if you wanted to sing it as “may all your favorite towns stay together,” that was up to you.) They erred, if anything, on the side of not overloading the show with very much actual Dawes material, but their most anthemic song, “When My Time Comes,” was a given for the penultimate spot, followed only by a full-cast sing-along of “With a Little Help From My Friends” to close out the night.\n\t\n\n\n\n\t\n\n\t\t\t\t\tLucius performs at ‘A Concert for Altadena’ at the Pasadena Civic Auditorium\n\t\t\t\t\t\t\t\t\tNikki Phillips/First III No Flash\n\t\n\n\n\n\tLucius’ Jess Wolfe and Holly Laessig were MVPs, as they often are at shows like this, generously supporting other artists with world-class background vocals as well as performing just a taste of their own material. Among their key support moments was aiding Goldsmith in a perfect reading of Pink Floyd’s “Shine on You Crazy Diamond” — something that was done on a joint Dawes/Lucius tour a few years ago, and of course was a staple of the shows back when the women were touring with Roger Waters. For their own part, they bought down the house — or brought it up — with “Dusty Trails,” the Lucius number that is most guaranteed to instantly make fans with a subdued opening eventually rising to sudden high harmonies no one sees coming until they are infiltrating your nervous system.\n\n\tPasadena native Judith Hill’s “Cry Cry Cry” had a similar way of surprising an unsuspecting audience, both for the crescendo of her vocals and her ability to suddenly switch from powerhouse singer to electric guitar shredder without losing a step. Similar dexterity was found in the voice and hands of Krasno, another audience favorite, whose reference in his Hendrix cover to “stand(ing) up next to a mountain” fit in well with a neon backdrop of mountain ridges meant to evoke the San Gabriel Mountains.\n\n\n\n\t\n\n\t\t\t\t\tEdith Hill performs at ‘A Concert for Altadena’ at the Pasadena Civic Auditorium\n\t\t\t\t\t\t\t\t\tNikki Phillips/First III No Flash\n\t\n\n\n\n\n\n\t\n\n\t\t\t\t\tEric Krasno performs at ‘A Concert for Altadena’ at the Pasadena Civic Auditorium\n\t\t\t\t\t\t\t\t\tNikki Phillips/First III No Flash\n\t\n\n\n\n\tJenny Lewis, singing with Goldsmith on harmony, gave voice in song to some of the spicier sentiments that some of the speakers brought with her song “Rise Up With Fists!!” Rufus Wainwright lent the most dulcet tones imaginable to the Beatles’ “Across the Universe,” which got an extra kick when Griffin Goldsmith added a healthy backbeat to the normally not-so-percussive tune halfway through. Lord Huron’s contribution to the evening was a cover of the underrated Kinks song “Strangers,” with Ray Davies’ appropriate unity theme no worse for the wear 55 years on.\n\n\n\n\t\n\n\t\t\t\t\tRufus Wainwright and Taylor Goldsmith of Dawes perform at ‘A Concert for Altadena’ at the Pasadena Civic Auditorium\n\t\t\t\t\t\t\t\t\tNikki Phillips/First III No Flash\n\t\n\n\n\n\n\n\t\n\n\t\t\t\t\tJenny Lewis and Dawes perform at ‘A Concert for Altadena’ at the Pasadena Civic Auditorium\n\t\t\t\t\t\t\t\t\tNikki Phillips/First III No Flash\n\t\n\n\n\n\tAlthough rain was not the theme of the evening, dealing from depression was, in part — which made Paisley’s and Goldsmith’s duet of their original song “Raining Inside” one of the major knockouts of the evening. Their sole public co-write to date kind of quietly came out as a one-off single under Paisley’s name 10 months ago, and getting the rare chance to hear them sing it together was in itself a possible cure for the blues.\n\t\n\n\n\n\t\n\n\t\t\t\t\tBrad Paisley performs at ‘A Concert for Altadena’ at the Pasadena Civic Auditorium\n\t\t\t\t\t\t\t\t\tNikki Phillips/First III No Flash\n\t\n\n\n\n\tBackstage, Goldsmith had navigated a question about how the devastation that ripped homes and studios away from his family had affected his psyche over the past year. There is a gentle stoicism to his public persona, although his music erupts from reflectiveness into passion. Although he projects a kind of zen calm more often than not, which is an especially useful quality as an organizer and band leader, he acknowledged his reaction to the fires is a work in progress, philosophically as well as emotionally.\n\n\t“It’s tough, because I always want to be honest with myself and my emotional state and let my feelings hit me and address them the ways I need to. But at the same time, I feel like my emotional state is something that I manifest. So sometimes I don’t want to enlarge too much” the reliving of negative feelings. “But today, I have allowed that. I have watched old videos of the next morning after the fire. And it’s good for me. But I refuse to let it make me go dark, to make me bitter. I know it’s gonna change me, but I just don’t want it to change me in those ways. There’s still a lot of kind of wrestling with it to make sure it’s not gonna have more of a influence on who I am than I want it to.”\n\n\tAfter the event was over at the Pasadena Civic, a few dozen VIP guests and sponsors moved a couple of blocks over to the Altadena Girls facility for an after-party. Even there, the talent chosen had more than a professional reason for being there. The DJ for the occasion was Jeffrey Paradise, who performs as Poolside. He, too, lost his home in the fire, escaping with his girlfriend, his blind senior dog and little else. \n\n\t“I feel lucky to be a part of it, but it is emotional, to be honest, to revisit losing all my stuff and my house,” said Paradise, before going out to do his DJ set. “But it’s a bit cathartic being around others who have done the same and celebrate in the midst of suffering. I just went up to my land with my burned out house a couple days ago, and the sunset was beautiful, and I was just like, fuck, I see why I fell in love with this.” He recently sold his vacant lot for what he considered a rock-bottom price. “We were underwater, and even all of our insurance money to our mortgage company was still not enough. And al my neighbors are stuck dealing with permitting issues. I miss my house and I wish I was rebuilding, but I’m also very glad to feel like a new book has been pulled off the shelf. \n\t\n\n\n\n\t\n\n\t\n\n\n\n\t“I’m glad to be a part of revisit this awareness, with people reaching out and supporting one another. It’s still just as present as ever for most people who have lost everything. But there’s a good sides of losing everything in that you see how the really good side of humanity has come out in certain ways. I’ve thought we should behave more like there’s a fucking disaster in our everyday life. We’d all be a lot more at peace.”\n\n\tAnd with that, Paradise went out to spin an incongruous but apropos dance remix, of Nicolette Larson singing “It’s gonna take a lotta love, to get us through the night…”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘A Concert for Altadena’ Raises $450K for Community Rebuilding, and Raises Spirits With Dawes, Brandon Flowers, Brad Paisley and Other Performers",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/2.-Altadena-Credit_Nikki_Phillips.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-09T05:06:47.000Z",
      "dateModified": "2026-01-09T05:06:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "X Limits AI Image Editing to Paid Users After Grok Deepfake Controversy Spurs U.K. Ban Threat",
    "url": "https://variety.com/2026/digital/news/x-grok-ai-editing-paid-users-deepfake-controversy-uk-ban-threat-1236627061/",
    "image": "https://variety.com/wp-content/uploads/2026/01/elon-musk-grok.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-09T10:22:27.000Z",
    "description": "\n\tElon Musk‘s X has moved image editing features in its Grok AI chatbot behind a paywall following widespread condemnation over the tool’s use in crea",
    "body": "\n\tElon Musk‘s X has moved image editing features in its Grok AI chatbot behind a paywall following widespread condemnation over the tool’s use in creating non-consensual sexual deepfakes, while the British government has called on regulators to consider banning the platform entirely, according to BBC News.\n\n\tSince Friday morning, Grok has been displaying a notification to users attempting image manipulation stating “image generation and editing are currently limited to paying subscribers” with an invitation to “subscribe to unlock these features,” BBC News reported. The restriction requires users to provide identification and payment information to access the capabilities, with only verified blue checkmark account holders able to successfully edit images on the social media platform.\n\t\n\n\tFree users can still access Grok’s image editing functionality through the AI tool’s separate application and website.\n\n\n\tThe paywall implementation follows intense backlash after the chatbot fulfilled requests to digitally remove clothing from photographs without subjects’ consent. Targets of these alterations described feeling “humiliated” and “dehumanized” to BBC News.\n\n\tThe British government has simultaneously escalated pressure on X, urging media regulator Ofcom to deploy its full enforcement powers over concerns about unlawful AI-generated imagery on the platform.\n\n\tGovernment sources told BBC News: “We would expect Ofcom to use all powers at its disposal in regard to Grok and X.”\n\n\tPrime Minister Sir Keir Starmer delivered sharp criticism during a Greatest Hits Radio interview, particularly regarding the creation of explicit imagery depicting both adults and minors. “This is disgraceful. It’s disgusting. And it’s not to be tolerated,” Starmer said, according to BBC News. “It’s unlawful. We’re not going to tolerate it. I’ve asked for all options to be on the table.”\n\t\n\n\tStarmer emphasized that Ofcom has received the government’s “full support” for enforcement action.\n\n\tThe regulatory agency said Monday it had reached out urgently to both X and xAI, Grok’s developer, and confirmed to BBC News it has launched an investigation. Ofcom now has authority under the Online Safety Act to petition courts for orders that would cut off X’s access to British users and revenue streams, including advertising income and user payments. \n\n\tWhile such intervention typically follows a lengthy investigative process, the law permits expedited action when situations involve severe threats to public welfare, endangerment of children, or documented patterns of regulatory defiance. Ofcom has deployed these Online Safety Act authorities on just six prior occasions, according to BBC News.\n\n\tBritish law currently prohibits distribution of deepfake imagery depicting adults.\n\n\t“We take action against illegal content on X, including Child Sexual Abuse Material (CSAM), by removing it, permanently suspending accounts, and working with local governments and law enforcement as necessary,” X said in a statement shared with Variety. “Anyone using or prompting Grok to make illegal content will suffer the same consequences as if they upload illegal content.”\n\n\tOfcom is currently recruiting a new chair who will be tasked with adopting more forceful oversight strategies as concerns mount over emerging technologies and platform ownership structures, according to BBC News. The Online Safety Act has drawn attention from the Trump administration over its potential impact on American technology companies.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "X Limits AI Image Editing to Paid Users After Grok Deepfake Controversy Spurs U.K. Ban Threat",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/elon-musk-grok.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-09T10:22:27.000Z",
      "dateModified": "2026-01-09T10:22:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Stars Taking Bubble Baths for National Bubble Bath Day",
    "url": "https://www.tmz.com/2026/01/08/stars-national-bubble-bath-day/",
    "image": "https://imagez.tmz.com/image/83/16by9/2026/01/08/83ae801082e74168a60e4943d2a433d1_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-08T23:44:39.000Z",
    "description": "\n    \n                    \n                          Stars Taking Bubble Baths ...\n                          Caution:\n                          Slippe",
    "body": "\n    \n                    \n                          Stars Taking Bubble Baths ...\n                          Caution:\n                          Slippery When Wet 🫧\n                      \n      \n    \n      \n        \n              \n    \n    \n          Guess what day it is y'all?! It's National Bubble Bath Day, and boy oh boy do we have a slippery show in store for you 😘! And keep scrolling for some bubble bath trivia!\n      \n    \n          From steamy selfies to sultry tub shots, celebs like Justina Valentine and Holly Madison proved bath time isn’t just about self-care -- it’s about serving looks!\n      \n    \n          Bring your bubbles and slip into our photo gallery! Once you're all cleaned up, can you solve the bubble bath trivia?\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Holly Madison\n              \n                          \n                Justina Valentine\n              \n                          \n                Hotties & Bodies\n              \n                          \n                Hot Bodies\n              \n                          \n                Photo Galleries\n              \n                          \n                NSFW\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Stars Taking Bubble Baths for National Bubble Bath Day",
      "image": [
        "https://imagez.tmz.com/image/83/16by9/2026/01/08/83ae801082e74168a60e4943d2a433d1_xl.jpg"
      ],
      "datePublished": "2026-01-08T23:44:39.000Z",
      "dateModified": "2026-01-08T23:44:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'Members Only: Palm Beach’ Gale Brophy Calls Out Cast for Lack of Class",
    "url": "https://www.tmz.com/2026/01/08/members-only-gale-brophy-calls-out-cast-lacking-class/",
    "image": "https://imagez.tmz.com/image/d4/16by9/2026/01/08/d48b6f7aefe64570805c09ba1321a5e7_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-09T00:24:25.000Z",
    "description": "\n                    \n                          'Members Only: Palm Beach'\n                          Gale Brophy says New crew aint got the class ...\n",
    "body": "\n                    \n                          'Members Only: Palm Beach'\n                          Gale Brophy says New crew aint got the class ...\n                      \n                  \n                                                                        Published \n                              January 8, 2026\n                            4:24 PM PST\n                                                                            \n              \n    \n      \n        \n                    \n                  \n      \n                    TMZ's Previously On...\n          \n    \n          \"Members Only: Palm Beach\" star Gale Brophy is speaking out for the first time since the show aired ... and she says the newest women on the show are failing to represent the town with the elegance and refinement it’s known for.\n      \n    \n          Gale hopped on TMZ's 'Previously On...' podcast, and she tells us she would not have joined the show had she known how chaotic it would become ... unless the cast looked very different ... with the exception of Rosalyn.\n      \n    \n          The \"Queen of Palm Beach\" tells us her main issue isn’t the drama itself, but what she believes is a misrepresentation of Palm Beach culture. According to Gale, Palm Beach is the richest zip code in the world and operates by a strict code of etiquette, discretion, and philanthropy -- standards she says the new women simply don’t meet.\n      \n\n                  \n          \n                          \n                \n                  \n      \n    \n          She points out that several of them aren’t even from Palm Beach -- which she believes explains why their behavior doesn’t reflect the town’s traditional elegance -- and as someone deeply involved in charity work and board leadership, Gale says she hoped the show would spotlight established Palm Beach women who are pillars of the community.\n      \n    \n          Instead, she takes aim at the younger cast members, noting that none of them serve on boards or are meaningfully involved in charitable organizations ... a key marker of status and respectability in Palm Beach society.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Gale also reveals she stepped away from her involvement with the Red Cross due to concerns over how reality TV editing could impact her reputation, underscoring just how seriously she takes her public image and community standing.\n      \n    \n          While she admits she had a ball filming the show and understands why audiences love watching the train wreck ... Gale says the elegance line has been crossed and claims she’s been bullied by the other women ... something she says she hasn’t experienced since childhood.\n      \n    \n          Gale tells TMZ the producers allegedly confirmed to her that she was being bullied, and Gale believes the tension may stem from the fact that she wasn’t a main cast member, didn’t receive confessionals, and didn’t know the women before filming.\n      \n    \n          Despite the drama, Gale insists every cast member has a beautiful story worth telling ... but when it comes to Palm Beach, she says elegance isn’t optional.\n      \n      ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Members Only: Palm Beach’ Gale Brophy Calls Out Cast for Lack of Class",
      "image": [
        "https://imagez.tmz.com/image/d4/16by9/2026/01/08/d48b6f7aefe64570805c09ba1321a5e7_xl.jpg"
      ],
      "datePublished": "2026-01-09T00:24:25.000Z",
      "dateModified": "2026-01-09T00:24:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Border Patrol Shoots Two In Portland, Listen To Dispatch Audio",
    "url": "https://www.tmz.com/2026/01/08/federal-immigration-agents-shoot-two-people-portland/",
    "image": "https://imagez.tmz.com/image/88/16by9/2026/01/09/887653ce8f7840fb8104edae5c7db755_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-09T00:46:34.000Z",
    "description": "\n                    \n                          Customs and Border Patrol\n                          Agents Shoot Alleged Venezuelan Gang Member ...\n  ",
    "body": "\n                    \n                          Customs and Border Patrol\n                          Agents Shoot Alleged Venezuelan Gang Member ...\n                          Gunshot Wounds To Arm\n                      \n                  \n                                                                        Published \n                              January 8, 2026\n                            4:46 PM PST\n                                                                      |\n                                                                Updated \n                                  January 8, 2026\n                                5:57 PM PST\n                                    \n              \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          UPDATE\n  \n    \n          5:33 PM PT -- TMZ obtained the dispatch audio from the call to Portland Fire Rescue and it reveals cops were told the man was shot twice in the arm and the woman, his wife, was shot in the chest.\n      \n    \n          Worth noting ... in the audio the dispatcher says the victim claims he and his wife were shot by ICE, but was confused with Border Patrol, based on the DHS statement.\n      \n    \n      \n        \n                    \n                  \n      \n                    Broadcastify.com\n          \n    \n          4:58 PM PT -- The Department of Homeland Security says Border Patrol agents were conducting a traffic stop targeting an alleged \"Venezuelan illegal alien affiliated with the transnational Tren de Aragua prostitution ring.\"\n      \n    \n          DHS says when Border Patrol agents identified themselves to the people in the car, the driver, who the feds allege is a Tren de Aragua gang member, \"weaponized his vehicle and attempted to run over the law enforcement agents.\"\n      \n    \n          The feds say the agent \"fired a defensive shot\" out of fear for his life and safety ... and the driver fled the scene with his passenger.\n      \n    \n          DHS also says the alleged gang member here was recently involved in a shooting in Portland.\n      \n    \n          Another shooting involving federal immigration agents and civilians ... and this time the feds shot two people in Oregon.\n      \n    \n      \n      🚨BREAKING🚨 ICE Agents allegedly shoot two people in Portland, city officials say. The shooting occurred near East Burnside and 141st Avenue. FBI is expected to release a statement soon. pic.twitter.com/vGwJt5OX45— Black Rebel (@RealBlackRebel_) January 8, 2026\n              @RealBlackRebel_\n          \n  \n    \n          The FBI's office in Portland says they are investigating an agent-involved shooting involving Customs and Border Patrol Agents in which 2 people were wounded.\n      \n    \n          Federal authorities say the shooting happened Thursday around 2:15 PM.\n      \n\n                  \n          \n                          \n                \n                  \n      \n    \n          The Portland Police Bureau say they responded to a call about a shooting and found a man and a woman with apparent gunshot wounds. Cops say officers applied a tourniquet bandage and called for emergency medical personnel, who transported the victims to a hospital.\n      \n    \n          Cops say the victims' conditions are unclear.\n      \n    \n      \n        \n                    \n                  \n      \n                    FreedomNews.TV\n          \n    \n          The Portland shooting comes one day after an ICE agent shot and killed a woman in Minneapolis.\n      \n    \n          PPB Chief Bob Day says ... \"We are still in the early stages of this incident. We understand the heightened emotion and tension many are feeling in the wake of the shooting in Minneapolis, but I am asking the community to remain calm as we work to learn more.\"\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Portland Mayor Keith Wilson blasted the feds in a statement, saying ... \"We cannot sit by while constitutional protections erode and bloodshed mounts. Portland is not a 'training ground' for militarized agents, and the 'full force' threatened by the administration has deadly consequences. As Mayor, I call on ICE to end all operations in Portland until a full investigation can be completed.\"\n      \n    \n          We reached out to the FBI and the Department of Homeland Security ... so far, no word back.\n      \n      ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Border Patrol Shoots Two In Portland, Listen To Dispatch Audio",
      "image": [
        "https://imagez.tmz.com/image/88/16by9/2026/01/09/887653ce8f7840fb8104edae5c7db755_xl.jpg"
      ],
      "datePublished": "2026-01-09T00:46:34.000Z",
      "dateModified": "2026-01-09T00:46:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Guess Who This Girly In Bangs Turned Into!",
    "url": "https://www.tmz.com/2026/01/09/guess-who-bangs-girly-turned-into/",
    "image": "https://imagez.tmz.com/image/bf/16by9/2026/01/08/bfb703633c2d4510931740b457f99eac_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-09T08:01:10.000Z",
    "description": "\n    \n                    \n                          Guess Who This\n                          Girly With Bangs\n                          Turned Into!\n",
    "body": "\n    \n                    \n                          Guess Who This\n                          Girly With Bangs\n                          Turned Into!\n                      \n                  \n                                                                        Published \n                              January 9, 2026\n                            12:01 AM PST\n                                                                            \n      \n    \n      \n        \n              \n    \n    \n          Before this girl turned into a popular actress, she was just growing up in Ireland with her three siblings and dreaming of becoming a star!\n      \n    \n          Her big breakthrough role was starring on the show \"Derry Girls,\" but you may also recognize her as the daughter of a rich family on \"Bridgerton.\"\n      \n    \n          Can you guess who she is?\n      \n      \n      \n          \n            \n              \n                \n                Share on Facebook\n              \n            \n            \n              \n                \n                Share on X\n              \n            \n                          \n                \n                  \n                \n              \n                      \n        \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Guess Who\n              \n                          \n                Kids\n              \n                          \n                celebrity kids\n              \n                          \n                Photo Galleries\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Guess Who This Girly In Bangs Turned Into!",
      "image": [
        "https://imagez.tmz.com/image/bf/16by9/2026/01/08/bfb703633c2d4510931740b457f99eac_xl.jpg"
      ],
      "datePublished": "2026-01-09T08:01:10.000Z",
      "dateModified": "2026-01-09T08:01:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Guess The Hot Housewife In Her Yellow Bikini!",
    "url": "https://www.tmz.com/2026/01/09/guess-hot-housewife-yellow-bikini/",
    "image": "https://imagez.tmz.com/image/95/16by9/2026/01/08/9524a529b3ac4288899803df954a374a_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-09T08:45:59.000Z",
    "description": "\n    \n                    \n                          Guess The\n                          Hot Housewife In Her\n                          Yellow Bikini!",
    "body": "\n    \n                    \n                          Guess The\n                          Hot Housewife In Her\n                          Yellow Bikini!\n                      \n                  \n                                                                        Published \n                              January 9, 2026\n                            12:45 AM PST\n                                                                            \n      \n    \n      \n        \n              \n    \n    \n          At last, Friday is here, and we've got a hot housewife to kick off the sex appeal for the weekend! Can you guess who she is?! Oh, and keep on scrollin' to see if you can solve the Housewives' puzzle!\n      \n    \n          Money can't buy her class, but it can buy her a house in the Hamptons. Don't be uncool, just hit the gallery and see who owns these long sexy stems!\n      \n    \n          Once you've solved the mystery housewife, can you slide these puzzle pieces into their respective places?!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Hotties & Bodies\n              \n                          \n                Hot Bodies\n              \n                          \n                Guess Who\n              \n                          \n                Real Housewives\n              \n                          \n                Photo Galleries\n              \n                          \n                Real Housewives of New York\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Guess The Hot Housewife In Her Yellow Bikini!",
      "image": [
        "https://imagez.tmz.com/image/95/16by9/2026/01/08/9524a529b3ac4288899803df954a374a_xl.jpg"
      ],
      "datePublished": "2026-01-09T08:45:59.000Z",
      "dateModified": "2026-01-09T08:45:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]