[
  {
    "title": "‘Minions & Monsters’ Trailer: Gru’s Minions Return to Wreak Havoc in ‘Despicable Me’ Spinoff",
    "url": "https://variety.com/2026/film/news/minions-3-trailer-despicable-me-spinoff-1236626576/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Screen-Shot-2026-02-08-at-7.24.32-PM.png?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-09T00:28:05.000Z",
    "description": "\n\tThe beloved, bright yellow underlings in overalls are back this July, with their supervillain antics in full swing. Only this time, their adventure ",
    "body": "\n\tThe beloved, bright yellow underlings in overalls are back this July, with their supervillain antics in full swing. Only this time, their adventure is set in the world of 1920’s Hollywood and these cuddly critters are putting their own spin on the monster movie genre and showing a previously unknown knack for screenwriting. \n\n\tDuring the Super Bowl, Universal Pictures released the first trailer for “Minions 3,” which has been dubbed “Minions & Monsters.” It’s the seventh overall installment in the “Despicable Me” franchise. Produced by the animation studio Illumination, the upcoming comedy film is the sequel to “Minions: The Rise of Gru” (2022).  \n\t\n\n\tInstead of being Gru’s assistants, this time the Minions go on an odyssey to find frightening creatures to appear as baddies in their monster movie. They partner with a cute green creature and then go head-to-head with sea beasts, a giant pink bunny with a bad attitude and a mumm, whose linen wrapping they mistakenly rip off his bones. \n\n\n\t“Minions & Monsters” will be produced by Illumination founder and CEO Chris Meledandri and Bill Ryan, executive producer of “The Super Mario Bros. Movie.” The film is written by Brian Lynch (“Minions” and “The Secret Life of Pets” films) and will be directed by Academy Award nominee Pierre Coffin. Coffin was also a director of the first three “Despicable Me” films, the first “Minions” movie and has provided the voice for the Minions since their first appearance in 2010.  \n\n\tThe “Minions” franchise focuses on the antics of the fun-sized yellow creatures as they search for an evil mastermind boss to serve, eventually encountering their “Despicable Me” leader Gru (voiced by Steve Carell) at the end of the first “Minions” movie.\n\t\n\n\t“Minions & Monsters” follows the blockbuster success of “Despicable Me 4,” which opened to $230 million worldwide in 2024. Over 15 years after “Despicable Me” debuted, the franchise has generated over $5 billion at the global box office, making it the highest-grossing animated film franchise worldwide. \n\n\tAll premiering around the Fourth of July, 2022’s “Minions: The Rise of Gru,” brought in $125 million over the holiday period, while “Despicable Me 3” (2017) debuted with $99 million and 2013’s “Despicable Me 2” with $83.5 million over the same time frame.\n\n\t“Minions & Monsters” hits theaters July 1.\n\n\tWatch the trailer below. \n\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Minions & Monsters’ Trailer: Gru’s Minions Return to Wreak Havoc in ‘Despicable Me’ Spinoff",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Screen-Shot-2026-02-08-at-7.24.32-PM.png?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-09T00:28:05.000Z",
      "dateModified": "2026-02-09T00:28:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Liquid I.V. Super Bowl Commercial Offers Viewers a Potty Break",
    "url": "https://variety.com/2026/tv/news/liquid-iv-super-bowl-commercial-potty-break-toilets-1236656233/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Liquid-I.V._Urinals_Big-Game-Ad-Image.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-09T00:52:28.000Z",
    "description": "\n\tCommercial breaks often give TV viewers time for a trip to the bathroom — but never quite like this.\n\n\tIn a 30-second ad that aired during NBC’s tel",
    "body": "\n\tCommercial breaks often give TV viewers time for a trip to the bathroom — but never quite like this.\n\n\tIn a 30-second ad that aired during NBC’s telecast of Super Bowl LX, Liquid I.V., a maker of electrolyte drink mixes, decided to give viewers a royal flush: a series of toilets and commodes singing about the need to examine the color of one’s urine to ensure proper hydration. The spot showed a series of different latrines and urinals crooning a cover version of the Phil Collins power ballad “Against All Odds (Take a Look at Me Now),” by the singer Ejae, who is known for her recent work in the film “KPop Demon Hunters.”\n\t\n\n\n\n\n\tThe concept “is one of those things that just makes you sit up a little bit straighter in your chair, and you’re just uncomfortable enough,” says Stacey Andrade-Wells, the company’s chief marketing officer, during a recent interview. And while the ad doesn’t discuss the actual product it’s pitching until its final seconds, “it all comes together at the very end,” she adds, and consumers will “understand now why these toilets are singing.”\n\n\n\tLiquid I.V. jumped into a very crowded pool. More marketers of health and wellness products and services came to the Super Bowl to tout weight loss pills, telehealth services and even getting consumers to take tests that might identify potential maladies. Andrade-Wells attributes the interest in “a refocus on health and wellness” in the aftermath of the coronavirus pandemic. Taking care of one’s mind and body has become “such a critical part of people’s everyday lives,” she says. “And that trend is not going anywhere.”\n\t\n\n\tUnlike many of the others, Liquid I.V. bet on a creative concept, not a famous face.  Super Bowl viewers will see Serena Williams tout the telehealth provider Ro; Kenan Thompson, Ana Gasteyer, DJ Khaled and others in a commercial for a new Wegovy weight loss pill; and Octavia Spencer and Sofía Vergara  spotlight a new urine test from Boehringer Ingelheim meant to highlight kidney function.\n\n\t“One thing that we were very intentional about when we were creating this idea was most brands are going to show up to the Super Bowl with celebrity talent in their ads, and ultimately, you see so many celebrities. You start to misattribute,” says Andrade-Wells. “It becomes almost a little bit of celebrity fatigue.” Liquid I.V. told its ad agency, Anomaly, that any Super Bowl commercial ideas “would not rely on celebrity talent.”\n\n\tAnd while Liquid I.V. has never run a commercial in the Super Bowl before, its owner, Unilever, most certainly has. The consumer-products giant has placed commercials for Hellmann’s mayonnaise in the Big Game for six consecutive years, including in 2026. And its Dove is appearing for the second time in as many years on Sunday.\n\n\tPotty humor can also be a tricky conceit to pull off for a Super Bowl audience. Gross-out jokes don’t always play well for a broad crowd that often includes families and kids. But others have found a way to approach the subject without alienating crowds often eating as they watch the Big Game.\n\n\tGeorgia-Pacific’s Angel Soft last year ran a 30-second spot during Fox’s telecast of Super Bowl LIX featuring a cute animated ‘angel” figure telling the audience they had time to dash to the bathroom. The commercial even featured a countdown clock. WK Kellogg’s Raisin Bran may step closer to the bounds of good taste with an ad on Sunday slated to run on Peacock that features William Shatner as “William Shat” talking about a high-fiber version of the cereal. The commercial will stream only, rather than appearing in NBC’s linear feed.\n\n\t“I’m sure we’re going to get some people who are like, ‘I can’t believe they’re telling me to look at my pee,’” says Andrade-Wells. “But it isn’t offensive.”\n\n\tIndeed, getting people to converse about their bathroom habits is the point. “Our goal is to inspire behavior change,” says the executive. “We want people at their Super Bowl parties to be debating it with each other. And ultimately, we want them to think about hydration.”\n\t\n\n\tTo make its point further, Liquid I.V. is putting some ad money into places where people might talk further about its ad — like barroom bathrooms in San Francisco, where this year’s Super Bowl takes place, and in the hometowns of the Seattle Seahawks and New England Patriots. The company has also arranged to have Monday christened National Rehydration Day and has worked out a way to get Liquid I.V. delivered to consumers via a partnership with DoorDash.\n\n\tPeople can always drink more water, of course, but the goal of this Super Bowl commercial is to get them to think about something slightly more complex. Liquid I.V. has “about 37% national awareness as a brand” and “about 18.5% household penetration, says Andrade-Wells. “Still less than half of America is aware this brand even exists.” After Sunday’s Super Bowl debut, that probably will no longer be the case.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Liquid I.V. Super Bowl Commercial Offers Viewers a Potty Break",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Liquid-I.V._Urinals_Big-Game-Ad-Image.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-09T00:52:28.000Z",
      "dateModified": "2026-02-09T00:52:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Coinbase Bets Lo-Fi Karaoke Super Bowl Commercial Creates High-Flying Response",
    "url": "https://variety.com/2026/tv/news/coinbase-super-bowl-commercial-lo-fi-karaoke-1236656225/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Everybody_Coinbase_Hero_Image_16x9_v04.png?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-09T00:30:00.000Z",
    "description": "\n\tMost Super Bowl commercials aim to be faster, louder and shinier than the rest. And then there are Big Game ads from advertisers like Coinbase.\n\n\tAf",
    "body": "\n\tMost Super Bowl commercials aim to be faster, louder and shinier than the rest. And then there are Big Game ads from advertisers like Coinbase.\n\n\tAfter mystifying Super Bowl viewers in 2022 with a decidedly lo-fi ad showing nothing but a floating QR code, the cryptocurrency trading platform has returned with another spot that’s so spartan it looks like it was created by someone working on an Apple II in the 1980s. The 60-second spot emulates a karaoke screen at a bar, with basic computer animation and less-than-stylish graphics. The emphasis is on lyrics from the 1997 Backstreet Boys song “Everybody (Backstreet’s Back)” and the first words people will see on screen are “Oh my god we’re back again.”\n\t\n\n\tThe no-frills approach is the point. By not emulating “that kind of more polished feeling than every other ad at the Super Bowl time typically has,” Coinbase believes its commercial is more likely to capture attention than many of its celebrity laden counterparts, says Cat Ferdon, Coinbase’s chief marketing officer, during a recent interview.\n\n\n\tThe commercial aims to create a communal moment, the executive says and get all members of the Super Bowl audience singing the song, which has words the company hopes will suggest the broader appeal of cryptocurrency. “We’re still competing with people’s cell phones, and this ad will undoubtedly get them and anyone to look up,” she says. “We’re really trying to effectively use this as the world’s biggest singalong, to show that crypto isn’t just for techies, but really for anyone who knows the lyrics.”\n\t\n\n\tCoinbase isn’t the first Super Bowl advertiser to take an extremely basic approach to its pitch. In 2020, Lifeminders.com, an email advertising company, ran what was basically a few lines of black text against a yellow screen, proclaiming that the spot was “the worst commercial in the Super Bowl.” As an error-filled version of the piano exercise “Chopsticks” plays, the ad told the audience that “We’re information experts. (Geeks). But we don’t know diddley about making ads.” In 2021, Oatly ran a spot that showed a senior executive in a field playing a keyboard and singing about its chief product, oat milk.\n\n\tThe commercials come off like  cutoff jeans and a tank top at a formal affair. Viewers typically tune into the Super Bowl to see the best of what Madison Avenue has to offer. Expectations are high for surprise celebrity cameos, dazzling images, clever uses of popular songs and, in some cases, the chance to see a culture-defining effort like Apple’s famous “1984” commercial, which blew minds with its depiction of an athlete rebelling against autonomous society, or Chrysler’s 2012 “Halftime in America” spot, which featured a grim Clint Eastwood telling the nation to get back on the playing field after being hit by a significant recession.\n\n\tSome of the unembellished spots stand out despite their rudimentary nature. GoDaddy, a web hosting company, thrived for years with bare-bones commercials that initially played on the potential for seeing a scantily clad female character. Cash4Gold, a trader that usually relied on cheaply made direct response commercials, in 2009 made a Super Bowl ad that used celebrity pitchman Ed McMahon and rapper MC Hammer.\n\n\tSuch efforts have surfaced as the ranks of the annual Super Bowl ad roster have swelled to include more start-ups and first-time entrants. Many of these companies have little experience with mainstream advertising, and most of their focus has instead been on using digital outreach to cultivate specific customer niches. The best Super Bowl ads find a way to capture the attention of tens of millions of viewers, while driving home a need for a product or the reliability of an overall brand.\n\n\tCoinbase executives believe their approach works. The company’s 2022 commercial “was probably the most talked about ad” of that year, says Ferdon. After the QR code appeared in the Super Bowl, Coinbase saw 20 million hits on its landing page in one minute, the company revealed following the end of the 2022 game. Its app crashed in the immediate aftermath.\n\t\n\n\tPerhaps Coinbase knows something about the Super Bowl audience that others don’t?\n\n\tOf the 120 million tuning in to the gridiron classic, “I think 110 million have had a bit to drink,” says Joe Staples, Coinbase’s vice president of creative. “This is fun and it’s supposed to be kind of our gift to that moment.\n\n\tThe Coinbase team considered every element of design in the ad, he says. Should they add some of he backgrounds people see on karaoke screens in bars, like waterfalls? Should the graphics have fuzzy edges? Should the ad try to use some of the heart-shaped graphics that sometimes surface as lyrics scroll?\n\n\t “Almost all of our conversations were about restraint,” says Staples. “So people can just focus on themselves.”\n\n\tIf it works, the ad will also help lend something that is not often attributed to cryptocurrency companies: emotion. Executives hope that spot spurs “a sense of togetherness” and that viewers will start to sing along with the tune, says Ferdon. “We know that 60% of Americans who watch the Super Bowl watch it together. It’s not exactly a solemn, singular pastime. It’s something we do in a group. And we really think that this kind of captures the spirit of it,” she says.  “We’re not just buying airtime with this ad. We really designed like a shared high energy experience for our community to participate in and do that together.”\n\n\tA winning Super Bowl commercial says Ferdon, sometimes must break old rules. “Ideas stand out,” she says. “And doing things other people aren’t doing stands out.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Coinbase Bets Lo-Fi Karaoke Super Bowl Commercial Creates High-Flying Response",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Everybody_Coinbase_Hero_Image_16x9_v04.png?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-09T00:30:00.000Z",
      "dateModified": "2026-02-09T00:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘The Mandalorian and Grogu’ Trailer: Baby Yoda and Mando Cruise Through the Snow With Tauntauns on Hoth",
    "url": "https://variety.com/2026/film/news/the-mandalorian-and-grogu-trailer-1236645911/",
    "image": "https://variety.com/wp-content/uploads/2026/02/mandalorian-.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-09T00:09:08.000Z",
    "description": "\n\tBaby Yoda made his Super Bowl debut.\n\n\tDisney’s Lucasfilm dropped a new trailer for “The Mandalorian and Grogu” during Sunday night’s big game — and",
    "body": "\n\tBaby Yoda made his Super Bowl debut.\n\n\tDisney’s Lucasfilm dropped a new trailer for “The Mandalorian and Grogu” during Sunday night’s big game — and the “Star Wars” spinoff is giving fans another glimpse of Pedro Pascal‘s armored bounty hunter and his pint-sized sidekick. In the 37-second spot, Mando and Grogu (a.k.a. Baby Yoda) are journeying through the snow while being pulled in Tauntauns. They appear to be Hoth, the icy plant that first appeared in 1980’s “The Empire Strikes Back.”\n\t\n\n\t“Grogu is more than a character; he’s a pop culture phenomenon. Riding alongside the heroic Mandalorian, he brings lightness, humor, joy, and an instant emotional connection that transcends the moment,” said Disney’s executive VP of creative marketing Jackson George. “This Big Game spot celebrates how deeply we love and connect with these characters, reminds us of the fun, heart, and spectacle that defines ‘Star Wars,’ and offers a bite-sized promise of the experience audiences will get when they see these two beloved icons on the big screen.”\n\n\n\tJon Favreau directed “The Mandalorian and Grogu,” which is slated to hit theaters on May 22. A continuation of the hit Disney+ series “The Mandalorian,” the movie follows Din Djarin (a.k.a. Mando) and Grogu (formerly known as the Child) as they navigate a galaxy still recovering from the fall of the Empire. According to the official logline, the story is set after the fall of the Galactic Empire, with Imperial warlords still scattered throughout the galaxy. The fledgling New Republic works to protect what the Rebellion fought for and turns to the legendary bounty hunter and his young apprentice for help.\n\t\n\n\tJoining Pascal and the diminutive, Force-sensitive Grogu are Sigourney Weaver as a skilled fighter pilot, Jeremy Allen White as Rotta, Jabba the Hutt’s rebellious son, and Jonny Coyne as a ruthless Imperial warlord. Fans will also spot cameos from beloved “Star Wars” characters Babu Frik and Zeb Orrelios.\n\n\tLucasfilm’s marketing brand lead Ryan Stankevich said they wanted a Super Bowl spot that felt “instantly iconic, cinematic, and quintessentially ‘Star Wars.'”\n\n\t“Our creative and marketing team landed on a unique concept that gave a nod to classic Big Game spots of years past,” Stankevich said. “It captured the warmth, humor, and emotional connection between these two beloved characters and was the perfect next step for our campaign as we lead up to their big screen debut this summer.”\n\n\tWatch the trailer below:\n\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘The Mandalorian and Grogu’ Trailer: Baby Yoda and Mando Cruise Through the Snow With Tauntauns on Hoth",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/mandalorian-.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-09T00:09:08.000Z",
      "dateModified": "2026-02-09T00:09:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Disclosure Day’ Trailer: Emily Blunt and Josh O’Connor Jump From Moving Train, Reveal Aliens’ Existence in Spielberg Sci-Fi Thriller",
    "url": "https://variety.com/2026/film/news/disclosure-day-emily-blunt-steven-spielberg-super-bowl-1236645279/",
    "image": "https://variety.com/wp-content/uploads/2026/02/disclosure-day.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-08T23:44:39.000Z",
    "description": "\n\tUniversal Pictures has released a new trailer for Steven Spielberg‘s mysterious alien film, “Disclosure Day,” during Super Bowl Sunday.\n\n\tThe scienc",
    "body": "\n\tUniversal Pictures has released a new trailer for Steven Spielberg‘s mysterious alien film, “Disclosure Day,” during Super Bowl Sunday.\n\n\tThe science-fiction movie stars Emily Blunt, Josh O’Connor, Colin Firth, Eve Hewson, Colman Domingo, Wyatt Russell and Henry Lloyd-Hughes.\n\n\tThe logline reads, “If you found out we weren’t alone, if someone showed you, proved it to you, would that frighten you? This summer, the truth belongs to seven billion people. We are coming close to … ‘Disclosure Day.’”\n\t\n\n\tSpielberg developed the story with screenwriter David Koepp, who he previously collaborated with on the films “Jurassic Park,” “Jurassic Park: The Lost World,” “War of the Worlds” and “Indiana Jones and the Kingdom of the Crystal Skull.”Blunt plays a Kansas City TV meteorologist who is suddenly overcome by a mysterious extraterrestrial force while taping a weather segment live on air. O’Connor stars as an alien life believer, determined to reveal the truth about life outside of Earth to the rest of the world.\n\n\n\t“Disclosure Day” marks the 37th film that Spielberg has directed since his debut in 1964. Well-known science-fiction projects in his filmography include the “Jurassic Park” movies and “War of the Worlds,” in addition to “Close Encounters of the Third Kind,” “E.T. the Extra-Terrestrial,” “Minority Report,” “A.I. Artificial Intelligence” and “Ready Player One.”\n\n\tSpielberg’s most recent film, “The Fablemans,” was released in 2022 as a coming-of-age drama loosely based on the director’s own early life and beginnings as a filmmaker. The semi-autobiographical film was dedicated to the memories of Spielberg’s parents, Leah Adler and Arnold Spielberg, who died in 2017 and 2020.\n\n\t“Disclosure Day” will be in theaters on June 12.\n\t\n\n\tWatch the trailer below.\n\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Disclosure Day’ Trailer: Emily Blunt and Josh O’Connor Jump From Moving Train, Reveal Aliens’ Existence in Spielberg Sci-Fi Thriller",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/disclosure-day.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-08T23:44:39.000Z",
      "dateModified": "2026-02-08T23:44:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Cliff Booth’ Teaser: Brad Pitt Surprises Super Bowl With First Footage From David Fincher’s Tarantino Sequel",
    "url": "https://variety.com/2026/film/news/cliff-booth-super-bowl-brad-pitt-once-upon-time-hollywood-1236499066/",
    "image": "https://variety.com/wp-content/uploads/2023/03/MCDONUP_EC187.jpg?crop=0px%2C190px%2C5400px%2C3037px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-02-09T00:17:20.000Z",
    "description": "\n\tNetflix dropped the surprise first look at Brad Pitt returning as stuntman Cliff Booth in “The Adventures of Cliff Booth,” the sequel to Quentin Tar",
    "body": "\n\tNetflix dropped the surprise first look at Brad Pitt returning as stuntman Cliff Booth in “The Adventures of Cliff Booth,” the sequel to Quentin Tarantino‘s “Once Upon a Time in Hollywood,” during the Super Bowl.\n\n\tThe short teaser was set to retro music and showed Cliff kicking back at a bar, walking behind the scenes of a film set and behind the wheel of a derby car on a dirt race track. It starts with the stuntman icing his knee and meeting Elizabeth Debicki and Yahya Abdul-Mateen II’s characters, both dressed up in fancy Old Hollywood clothing. There were a few shots of nude women, cigarettes, middle fingers, guns and people cursing that were dashed out in a cheeky censorship gag throughout the teaser. Finally, there was a shot of Cliff placing an Oscar on his desk — a nod to Pitt winning his first acting Oscar for his “Once Upon a Time in Hollywood” role.\n\t\n\n\n\tThe cool, charming stunt double was first introduced in Tarantino’s original movie in 2019 and is back for more in a sequel helmed by David Fincher. Tarantino wrote the script, but opted to give Fincher the reins to direct, as the original “Once Upon a Time in Hollywood” director is still on the hunt for his 10th and final film to make. Fincher’s relationship with Netflix dates back to his “Mindhunter” TV series days and includes his recent films “The Killer” and “Mank.”\n\n\n\t“Once Upon A Time In Hollywood” ended with Booth and his principle performer and friend Rick Dalton (Leonardo DiCaprio) revising history by killing the Manson family murderers on the night that they would have killed Sharon Tate, Jay Sebring, Abigail Folger, Wojciech Frykowski and Steven Parent in 1969. “The Adventures of Cliff Booth” picks up in the 1970s. While DiCaprio’s Dalton is not expected to return in the spinoff, Booth is back in action alongside new characters played by Scott Caan, Elizabeth Debicki, Yahya Abdul-Mateen II, Carla Gugino, Holt McCallany, and JB Tadena. Timothy Olyphant is also confirmed to reprise his “Once Upon A Time In Hollywood” role of James Stacy.\n\t\n\n\tTarantino serves as a producer alongside Pitt, David Heyman, Ceán Chaffin and Stacey Sher. Frequent Fincher collaborator Erik Messerschmidt serves as the film’s director of photography. The film was shot on-location in Los Angeles.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Cliff Booth’ Teaser: Brad Pitt Surprises Super Bowl With First Footage From David Fincher’s Tarantino Sequel",
      "image": [
        "https://variety.com/wp-content/uploads/2023/03/MCDONUP_EC187.jpg?crop=0px%2C190px%2C5400px%2C3037px&resize=1000%2C563"
      ],
      "datePublished": "2026-02-09T00:17:20.000Z",
      "dateModified": "2026-02-09T00:17:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jake Paul, Who Lives in Puerto Rico, Calls Bad Bunny a ‘Fake American’ in Halftime Show Rant",
    "url": "https://variety.com/2026/music/news/jake-paul-bad-bunny-super-bowl-halftime-show-1236656447/",
    "image": "https://variety.com/wp-content/uploads/2026/02/MixCollage-08-Feb-2026-04-05-PM-6002.jpg?crop=15px%2C16px%2C1171px%2C659px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-02-08T23:59:49.000Z",
    "description": "\n\tInfluencer and professional boxer Jake Paul took to X on Sunday to tell people to turn off the Super Bowl during Puerto Rican superstar Bad Bunny’s ",
    "body": "\n\tInfluencer and professional boxer Jake Paul took to X on Sunday to tell people to turn off the Super Bowl during Puerto Rican superstar Bad Bunny’s halftime show performance.\n\n\t“Purposefully turning off the halftime show,” Paul wrote. “Let’s rally together and show big corporations they can’t just do whatever they want without consequences (which equals viewership for them). You are their benefit. Realize you have power. Turn off this halftime. A fake American citizen performing who publicly hates America. I cannot support that.”\n\t\n\n\tPaul and his brother, Logan, moved to Puerto Rico in 2021, primarily to leverage tax benefits, as announced by Logan in an interview with Graham Bensinger.\n\n\n\tLogan Paul previously criticized Bad Bunny on the “Philip DeFranco Show” in 2022, saying, “I do find it hypocritical because Bad Bunny is a Puerto Rican, living in Puerto Rico, who is privately taking advantage of the same tax program that he is publicly condemning”.\n\n\tThe comment followed the release of Bad Bunny’s “El Apagón – Aquí Vive Gente” documentary, which highlighted the gentrification and displacement of local Puerto Ricans caused by wealthy outsiders moving to the island under tax incentive programs.\n\n\tJake Paul recently took to X to state that people who criticize Immigration and Customs Enforcement should not rely on emergency services. “If you don’t like ICE then you can’t call 911 when you’re in trouble,” Paul wrote. “If you don’t respect law enforcement agents then you shouldn’t depend on them.”\n\n\tHe later directed a post at Billie Eilish, after she publicly condemned ICE at the 2026 Grammy Awards, referring to her as “Billie Eyelash.” Paul wrote, “When Billie Eyelash gets her home broken into it’s not gonna be f-ck ICE I can promise you that.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jake Paul, Who Lives in Puerto Rico, Calls Bad Bunny a ‘Fake American’ in Halftime Show Rant",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/MixCollage-08-Feb-2026-04-05-PM-6002.jpg?crop=15px%2C16px%2C1171px%2C659px&resize=1000%2C563"
      ],
      "datePublished": "2026-02-08T23:59:49.000Z",
      "dateModified": "2026-02-08T23:59:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Charlie Puth Sings a Soulful National Anthem at Super Bowl: Watch ",
    "url": "https://variety.com/2026/music/news/charlie-puth-national-anthem-super-bowl-1236653875/",
    "image": "https://variety.com/wp-content/uploads/2026/02/GettyImages-2260596206-e1770593719560.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-08T23:33:52.000Z",
    "description": "\n\tCharlie Puth brought an understated yet soulful delivery to the National Anthem before the Super Bowl on Sunday.\n\n\tAccompanying himself on electric ",
    "body": "\n\tCharlie Puth brought an understated yet soulful delivery to the National Anthem before the Super Bowl on Sunday.\n\n\tAccompanying himself on electric piano, Puth began the song softly but upped the intensity on the “Rockets red glare” verse, his voice soaring and nailing the high notes as a choir joined him. The song reached its climax as four Air Force jets flew overheard. Puth raised his arms, waving to the crowd as he finished, clearly taking in the moment. \n\t\n\n\n\tIn the days before his performance, Puth sat down with Apple Music’s Zane Lowe and Ebro Darden to discuss how he was preparing for the show. “I think the best way for me specifically to approach it is, the arrangement is everything for me,” he said. “I always reverse engineer how I hear my own music in my head and then it’s just kind of pulling it apart and making it a feasible product to hold. I’ve been rehearsing this in my head for months, if that makes sense.”\n\n\n\tPuth was announced as a performer at the Super Bowl back in November and was met with some criticism that he wasn’t the best choice for the gig. One X user wrote that “we’ve fallen from when Whitney Houston sang at the Super Bowl,” referring to her iconic rendition of the song in 1991. “Charlie Puth? He’s not gonna give us vocals I’m afraid.”\n\n\tHe was quick to respond, quoting the tweet and stating, “I’ll never claim to be as good of a singer as Whitney Houston ever was. But I assure you we’re putting a really special arrangement together- in D major. It’ll be one of my best vocal performances.”\n\t\n\n\tPuth’s rendition of the National Anthem comes amid the rollout for his upcoming fourth album, “Whatever’s Clever,” releasing on March 27. He already dropped the lead single “Changes” and followed with “Beat Yourself Up,” and at his Blue Note residency in Los Angeles last fall, he debuted the track “Sideways” featuring Coco Jones, which is expected to appear on the project.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Charlie Puth Sings a Soulful National Anthem at Super Bowl: Watch ",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/GettyImages-2260596206-e1770593719560.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-08T23:33:52.000Z",
      "dateModified": "2026-02-08T23:33:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ben Affleck’s Dunkin’ Super Bowl Commercial Taps Jennifer Aniston, Tom Brady, Ted Danson for 1990s Sitcom",
    "url": "https://variety.com/2026/tv/news/dunkin-super-bowl-commercial-jennifer-aniston-tom-brady-1236656261/",
    "image": "https://variety.com/wp-content/uploads/2026/02/1-1.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-09T01:00:22.000Z",
    "description": "\n\tBen Affleck’s latest Super Bowl commercial for Dunkin’ serves up a lot more than coffee and doughnuts.\n\n\tJennifer Aniston, Matt LeBlanc, Jason Alexa",
    "body": "\n\tBen Affleck’s latest Super Bowl commercial for Dunkin’ serves up a lot more than coffee and doughnuts.\n\n\tJennifer Aniston, Matt LeBlanc, Jason Alexander. Ted Danson, Alfonso Ribeiro, Jaleel White and Jasmine Guy all join Affleck and frequent partner Tom Brady in a surprising spot that shows the ensemble acting in a long-lost sitcom called “Good Will Dunkin’” The show answer the never-asked question of what the 1997 drama “Good Will Hunting,” starring and devised by Affleck and Matt Damon, might have looked like if it were presented in comedy form.\n\t\n\n\n\n\n\tThe show contains multiple references to the “Good Will Hunting” script, even as it makes references to shows like “Friends,” “Cheers,” “A Different World,” “Fresh Prince of Bel-Air,” “Seinfeld” and “Family Matters.” The various actors got a special effects tune-up and were de-aged via production techniques. But the spot was shot on film on a real set.\n\n\n\tDunkin made a callback to 1990s TV because it wants to celebrate its first advertisement for iced coffee, which debuted in1995.  As part of the look back, Dunkin will give away 1.995 million free iced coffees of any size starting Monday, Feb. 9. Guests can redeem the offer using code GOODWILLDUNKIN in the Dunkin’ app.\n\n\tDunkin will also offer a limited collection of vintage apparel inspired by the 1990s – all sourced vintage shops in Boston! Fans can shop at DunkinRunsOnMerch.com Sunday night after the ad runs.\n\n\tThe Dunkin ad is the latest in a series of hilarious and star-studded spots Affleck has made for the coffee and pastry chain since 2023. Some spots featured a musical group called the “DunKings” and enlisted actors including Jeremy Strong and Casey Affleck. Two spots featured cameos by Jennifer Lopez, Affleck’s former spouse.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ben Affleck’s Dunkin’ Super Bowl Commercial Taps Jennifer Aniston, Tom Brady, Ted Danson for 1990s Sitcom",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/1-1.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-09T01:00:22.000Z",
      "dateModified": "2026-02-09T01:00:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Big Tech Taps Super Bowl Commercials to Put Human Face on A.I.",
    "url": "https://variety.com/2026/tv/news/super-bowl-commercials-ai-human-face-open-ai-anthropic-1236656239/",
    "image": "https://variety.com/wp-content/uploads/2026/02/raspberry-pi-v1.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-09T00:26:56.000Z",
    "description": "\n\tIf you believe what you see on TV, then the mysterious technological force known as A.I. is nothing without the help of some human hands.\n\n\tIn a 60-",
    "body": "\n\tIf you believe what you see on TV, then the mysterious technological force known as A.I. is nothing without the help of some human hands.\n\n\tIn a 60-second ad slated to run Sunday in NBC’s telecast of Super Bowl LX, Open AI shows a series of pictures of people using their hands to read, sketch, design, ask questions and even guide a pair of robotic arms.  The last few seconds are used to flash the words “You Can Just Build Things” on screens, following by a prompt to consider Codex, an app that can develop software depending on the instructions of the users who harness it.\n\t\n\n\n\n\n\t“We shot the ads with real people, on film, who use our tools,” says Kate Rouch, chief marketing officer of Open AI, during a recent interview, “The core message is that people are actually the hero. This is a technology that extends what’s possible for people.” That message will sound again quicky with local ads running during the Super Bowl telecast in New York. Los Angeles, San Francisco Chicago, Philadelphia, Boston, Las Vegas, and Dallas.\n\n\n\tRouch knows something about capturing attention at the Super Bowl. In a previous role, she worked as chief marketing officer for Coinbase, the cryptocurrency platform that surprised Super Bowl viewers in 2022 with a bare-bones spot that featured nothing but a floating, color-changing QR code. Response was instantaneous and overwhelming, according to company comments made at the time.\n\n\tIn 2026, however, OpenAI is just one of several A.I. firms taking to the Super Bowl to get messages out about a technology that spurs more questions than answers. This emerging science solves problems and moves quickly but, because it does, stokes fears about whether it may wipe out a significant chunk of human activity and process as it continues to evolve. In addition to Open AI, Anthropic, Google, Amazon, Meta and two less-familiar firms, Genspark and Base44, will all promote A.I. chatbots or technologies in the Big Game.\n\t\n\n\tThe attraction of the Super Bowl, a bastion of traditional media, to even the most revolutionary of technologies isn’t hard to discern. All these companies need to get the word out about their creations to the broader populace, and very few media properties lure the broad crowd that tunes into the gridiron classic.  Consumer research from Anthropic, the company behind the A.I. interface known as Claude, shows the average consumer has “not locked in any choice” when it comes to a favorite A.I. provider, says Andrew Stirk, the company’s head of brand marketing.  Consumers are “enjoying exploring what this technology can do,” he says, but “the openness to switch is equally high.”\n\n\tAnthropic will use its Super Bowl berth to take a poke at A.I. companies that want to make ads part of the experience. “Ads are coming to A.I.,” reads a message at the tail end of the spot. “But not to Claude.” And it will run a 60-second spot in NBC’s pre-game coverage ahead of airing a 30-second ad in the Super Bowl itself. Savvy viewers will understand the spot takes a poke at Open AI’s recent decision to open an ad-supported service tier.\n\n\n\n\n\tAmazon’s new ad will nod to some of the fears around A.I.’s increasing presence in everyday human affairs. Actor Chris Hemsworth envisions the company’s new Alexa+ A.I. assistant plotting his demise with an automatic garage door or an easily rigged fireplace (all the while, INXS’s “The Devil Inside” plays in the background).\n\n\n\n\n\tGenspark has tapped actor Matthew Broderick. Google shows a woman and her young child using the company’s Gemini A.I. interface to imagine what inside of their new home might look like, while Randy Newman’s “Feels Like Home” underscores the action.\n\n\tOpen AI is trying to pivot away from “negative versions of the future,” says Rouch. “We fundamentally believe that people with these tools, are actually going to be able to do and already are doing at scale incredible things. And that’s a conversation that we want to have.”\n\n\tShe hopes the company’s commercial stands apart from the rest of the pack and offers Open AI a point of distinction. Some ads from A.I. players sounds as if they are “talking down to people” or playing up very simple functions, like remembering a child’s birthday or setting a timer. Rouch sees more opportunities in focusing on the ways people can use this new technology to augment their lives, taking on tasks like navigating paperwork around a complex health situation or learning a new language.\n\t\n\n\t “A.I. is at a turning point,” she says, “where it’s turning from something that can ask and answer questions and becoming something that can act and do things in the world for you.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Big Tech Taps Super Bowl Commercials to Put Human Face on A.I.",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/raspberry-pi-v1.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-09T00:26:56.000Z",
      "dateModified": "2026-02-09T00:26:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "ICE Ads Photographed Around Levi's Stadium Ahead of Super Bowl",
    "url": "https://www.tmz.com/2026/02/08/ice-ads-spotted-around-levis-stadium-ahead-of-super-bowl/",
    "image": "https://imagez.tmz.com/image/fe/16by9/2026/02/09/fe5483fcf4c44157ada8591f8c1e587f_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-09T00:00:48.000Z",
    "description": "\n    \n                    \n                          Super Bowl LX\n                          ICE Ads Spotted Outside Levi's Stadium\n                  ",
    "body": "\n    \n                    \n                          Super Bowl LX\n                          ICE Ads Spotted Outside Levi's Stadium\n                      \n                  \n                                                                        Published \n                              February 8, 2026\n                            4:00 PM PST\n                                                                      |\n                                                                Updated \n                                  February 8, 2026\n                                4:44 PM PST\n                                    \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          ICE announced they wouldn't be running immigration enforcement at Levi's Stadium during Super Bowl LX, but their presence was still felt.\n      \n    \n          Ads for the agency were spotted around the venue before the big game.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          In the photo, you can see a truck displaying a recruitment ad for U.S. Immigration and Customs Enforcement, directing potential applicants to their website along with the slogan ... \"One team. One purpose. One mission.\"\n      \n    \n          As we reported ... Sources told TMZ Sports there is no plan for ICE to be at Levi's Stadium, meaning there will be no immigration enforcement at the site of the game.\n      \n\n          Still, numerous federal law enforcement agencies like the FBI will be on the ground, providing security.\n      \n    \n          Bottom line, from what we were told, the feds' presence at the game is about keeping fans safe, as it has been in the past, not making arrests for illegal entry into the country.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Donald Trump\n              \n                          \n                Sports\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "ICE Ads Photographed Around Levi's Stadium Ahead of Super Bowl",
      "image": [
        "https://imagez.tmz.com/image/fe/16by9/2026/02/09/fe5483fcf4c44157ada8591f8c1e587f_xl.jpg"
      ],
      "datePublished": "2026-02-09T00:00:48.000Z",
      "dateModified": "2026-02-09T00:00:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Charlie Puth Brings Down the House At Super Bowl LX With Powerful Nat'l Anthem",
    "url": "https://www.tmz.com/2026/02/08/charlie-puth-brings-down-the-house-at-super-bowl-lx-with-powerful-natl-anthem-prep/",
    "image": "https://imagez.tmz.com/image/c7/16by9/2026/02/08/c75b916caf9a467193725b26c7f1b618_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-09T00:25:40.000Z",
    "description": "\n    \n                    \n                          Super Bowl LX\n                          Charlie Puth Hits All the Right Notes With Nat'l Anthem\n ",
    "body": "\n    \n                    \n                          Super Bowl LX\n                          Charlie Puth Hits All the Right Notes With Nat'l Anthem\n                      \n                  \n                                                                        Published \n                              February 8, 2026\n                            4:25 PM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Charlie Puth soared at the Super Bowl with his rendition of the National Anthem, and, folks, Taylor Swift was right ... he should be a bigger artist!\n      \n    \n          The singer-songwriter was backed by a band and an absolutely celestial choir, fitted out in all white to match their angelic voices.\n      \n    \n      \n      It’s hard to do a tasteful maximalist national anthem, but Charlie Puth just DESTROYED it.One of the best in recent memory pic.twitter.com/GUGzoG4k2a— NFL Draft Files (@NFL_DF) February 8, 2026\n              @NFL_DF\n          \n  \n    \n          Players, coaches and fans alike were visibly moved as Puth acted out nearly every singer's dream, killing it on one of the world's biggest stages.\n      \n\n                  \n          \n                          \n                \n                  \n      \n    \n          Watch the clip, there was hardly a dry eye in the house when Puth was done.\n      \n    \n          Puth’s “Star-Spangled Banner” was preceded by Brandi Carlile who destroyed with “America the Beautiful,” and Green Day, who got everyone of their feet with \"American Idiot.\"\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Charlie Puth\n              \n                          \n                Taylor Swift\n              \n                          \n                Sports\n              \n                          \n                TMZ Sports\n              \n                          \n                Super Bowl\n              \n                          \n                Music\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Charlie Puth Brings Down the House At Super Bowl LX With Powerful Nat'l Anthem",
      "image": [
        "https://imagez.tmz.com/image/c7/16by9/2026/02/08/c75b916caf9a467193725b26c7f1b618_xl.jpg"
      ],
      "datePublished": "2026-02-09T00:25:40.000Z",
      "dateModified": "2026-02-09T00:25:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Protesters Gather Outside Super Bowl LX to Protest ICE",
    "url": "https://www.tmz.com/2026/02/08/ice-protest-at-super-bowl-lx/",
    "image": "https://imagez.tmz.com/image/eb/16by9/2026/02/09/eb245d0a5eb34fde9eb29aca3c4e47e3_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-09T01:01:10.000Z",
    "description": "\n    \n                    \n                          Super Bowl LX\n                          ICE Protest Breaks Out In Streets Near Stadium\n          ",
    "body": "\n    \n                    \n                          Super Bowl LX\n                          ICE Protest Breaks Out In Streets Near Stadium\n                      \n                  \n                                                                        Published \n                              February 8, 2026\n                            5:01 PM PST\n                                                                            \n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          Even with no plans of making arrests at Levi's Stadium, ICE's presence was apparently still unwanted Sunday ... judging by the protest that broke out against them.\n      \n    \n          TMZ has video from the demonstration outside Super Bowl LX, where activists peacefully gathered to profess their distaste for ICE's aggressive tactics.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Waving \"Anti-ICE\" and \"Anti-Trump\" flags, people marched along the street accompanied by officers on horseback.\n      \n\n                  \n          \n                          \n                \n                  \n      \n    \n          In the clip, you can hear the chants of \"Sí se puede\" and \"F**k ICE.\"\n      \n    \n          As we reported, sources told us ICE may be present at the Super Bowl but only in a security role.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          We spotted ICE ads around the stadium, but so far no major dust ups have been reported.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Donald Trump\n              \n                          \n                Sports\n              \n                          \n                TMZ Sports\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Protesters Gather Outside Super Bowl LX to Protest ICE",
      "image": [
        "https://imagez.tmz.com/image/eb/16by9/2026/02/09/eb245d0a5eb34fde9eb29aca3c4e47e3_xl.jpg"
      ],
      "datePublished": "2026-02-09T01:01:10.000Z",
      "dateModified": "2026-02-09T01:01:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Lindsey Vonn In Stable Condition After Surgery Following Olympic Crash",
    "url": "https://www.tmz.com/2026/02/08/lindsey-vonn-surgery-stable-condition-after-olympic-crash/",
    "image": "https://imagez.tmz.com/image/d6/16by9/2026/02/08/d635ba44888f46518bc0ab32eae1f810_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-08T19:54:34.000Z",
    "description": "\n    \n                    \n                          Lindsey Vonn\n                          Has Surgery for Broken Leg After Olympic Crash\n           ",
    "body": "\n    \n                    \n                          Lindsey Vonn\n                          Has Surgery for Broken Leg After Olympic Crash\n                      \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Lindsey Vonn is in stable condition after undergoing emergency surgery to repair a broken leg she suffered during her violent crash in the women's downhill at the Winter Olympics in Italy.\n      \n    \n          Team officials and hospital staff say the skiing legend is recovering and expected to be okay after the procedure, which stabilized the fracture she suffered early Sunday in Cortina d'Ampezzo.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Vonn's Olympic bid came to a frightening end just seconds into her downhill run on Sunday, when she lost control and tumbled hard down the Olympia delle Tofane course. The impact left her on the snow in visible pain before medical personnel rushed in.\n      \n\n          With concerns over her injuries on the mountain, rescuers airlifted Vonn off the slope by helicopter. She was rushed first to a local clinic and later transferred to a larger hospital in Treviso for surgery and care.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          The crash marked a heartbreaking culmination to Vonn's emotional comeback. Just days earlier, she had confirmed she would compete in Milan-Cortina despite suffering a completely ruptured ACL in her left knee during a World Cup downhill race and skiing with a rebuilt right knee that included a titanium implant.\n      \n    \n          Vonn's attempt to make history as one of the oldest Olympic downhill competitors came with massive fan support in the Italian Alps. Moments after the crash, the crowd and fellow skiers alike watched in stunned silence as she was tended to on the snow.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Lindsey Vonn\n              \n                          \n                Celebrity News\n              \n                          \n                Olympics\n              \n                          \n                TMZ Sports\n              \n                          \n                Health\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lindsey Vonn In Stable Condition After Surgery Following Olympic Crash",
      "image": [
        "https://imagez.tmz.com/image/d6/16by9/2026/02/08/d635ba44888f46518bc0ab32eae1f810_xl.jpg"
      ],
      "datePublished": "2026-02-08T19:54:34.000Z",
      "dateModified": "2026-02-08T19:54:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nancy Guthrie's Pastor Prays for The Hearts of Those Responsible For Her Abduction",
    "url": "https://www.tmz.com/2026/02/08/nancy-guthrie-pastor-abduction-prayer-for-people-responsible/",
    "image": "https://imagez.tmz.com/image/d4/16by9/2026/02/08/d4fc7e14b35444f287fb2b903f486cc4_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-08T20:31:24.000Z",
    "description": "\n    \n                    \n                          Savannah Guthrie\n                          Missing Mom's Pastor Prays for Hearts of Those Respons",
    "body": "\n    \n                    \n                          Savannah Guthrie\n                          Missing Mom's Pastor Prays for Hearts of Those Responsible\n                      \n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          As the search for Nancy Guthrie continues, her church delivered a powerful and emotional message not just for her safety, but for the conscience of those who may be responsible for her abduction.\n      \n    \n          During Sunday's service, Pastor John Tittle of St. Andrew’s Presbyterian Church told the congregation they had been given one clear request from the Guthrie family ... pray.\n      \n    \n          \"We are seeking to just honor the family's privacy and their desires,\" Tittle said. \"It was communicated to me, 'pray.' We’re going to keep praying through this horrific ordeal.\"\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Tittle led the church in prayer, asking God to protect the 84-year-old, allow her to feel the love surrounding her, and guide authorities in their search. But he also included a pointed plea asking that the hearts of \"those who are responsible\" be softened so they may do what is \"humane and right.\"\n      \n\n          Much of Tittle’s message focused on forgiveness, acknowledging how difficult it can be when fear and anger take hold.\n      \n    \n          \"When we find ourselves heartbroken by the inhumanity and the evil that has been done to Nancy and her family, what do we do?\" he asked, calling forgiveness essential to overcoming hatred and bitterness.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Nancy has been a member of the church for nearly 30 years, according to the church, which described her as a deeply loved part of the community.\n      \n    \n          On Sunday, the Sheriff's Department said the investigation is ongoing and they still have no suspects or persons of interest in the case. Also on Sunday, investigators were seen searching a septic tank behind Nancy's Tucson home.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Nancy Guthrie\n              \n                          \n                Celebrity News\n              \n                          \n                Religion/ Spirituality\n              \n                          \n                Nancy Guthrie Case\n              \n                          \n                True Crime\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nancy Guthrie's Pastor Prays for The Hearts of Those Responsible For Her Abduction",
      "image": [
        "https://imagez.tmz.com/image/d4/16by9/2026/02/08/d4fc7e14b35444f287fb2b903f486cc4_xl.jpg"
      ],
      "datePublished": "2026-02-08T20:31:24.000Z",
      "dateModified": "2026-02-08T20:31:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]