[
  {
    "title": "‘Soap Bubbles’ Tracks Down a Long-Gone Bohemian Dynasty: ‘A Big Industrial Empire Can Burst Like a Bubble’",
    "url": "https://variety.com/2025/film/global/soap-bubbles-tatana-markova-1236560852/",
    "image": "https://variety.com/wp-content/uploads/2025/10/Kingdom-of-Soap-Bubbles.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-25T15:57:13.000Z",
    "description": "\n\tCzech documentarian Tatana Markova says she became intrigued by her subject in “Kingdom of Soap Bubbles” – a once-great Bohemian dynasty that’s been",
    "body": "\n\tCzech documentarian Tatana Markova says she became intrigued by her subject in “Kingdom of Soap Bubbles” – a once-great Bohemian dynasty that’s been nearly forgotten – after meeting one of its would-be heirs.\n\n\t“One of the protagonists of my last film, “Libussa Unbound,” was U.S.-based director and producer Constantin Werner. He told me some family stories and I found them so appealing I wanted to find out more about the Schicht family he came from.”\n\t\n\n\n\n\n\tThe Schicht name was once known in every household in what is today the Czech Republic and Slovakia – and considerably beyond. It rose to prominence during the last days of the Habsburg Empire, built around the phenomenal success of entrepreneur Georg Schicht, who founded a soap factory in what is today the town of Rynoltice.\n\n\n\tWith bold innovations such as the sidelines Elida cosmetics and Kalodont toothpaste, the sourcing of coconut and palm oil from Africa, brilliant branding and marketing with a wholesome billboard girl and slick silent film promos, the Schicht brand eventually became synonymous with “easy, cheap and clean” in households far and wide.\n\n\tAnd its signature product, the “soap with the stag,” known for its distinctive leaping deer symbol, was nearly as recognizable in the early 20th century as Apple or Starbucks is today. \n\n\tNowadays, just a shell of the family’s industrial base and their nearby mansion remain in the Czech city of Usti nad Labem – known during the family’s heyday under the Habsburg Empire, as Aussig.\n\t\n\n\tAnd it’s into the darkened halls and corridors of these buildings, stripped nearly bare, that Markova’s camera rolls as her documentary, competing in the Czech Joy section of the Ji.hlava film fest, opens.\n\n\tShe began writing in 2019, just in time for the challenges of COVID lockdowns, says Markova, but she soon faced another difficulty almost as great.\n\n\tShe wanted to film the company heirs venturing into the former family home, she says, but “the descendants of the entrepreneurial Schicht family are spread all over the world and they are quite busy. It is not possible for them to travel to the Czech Republic often.”\n\n\tThere was also much ground to cover: The founding of Czechoslovakia after World War I “wasn’t beneficial to the Schichts,” as the film recounts, dropping them into the middle of a linguistic power struggle in which the German language was no longer to be officially used and many felt resentful of all things not Slavic.\n\n\tThe Schichts managed to survive and thrive, building the company, merging with Unilever, founding a cinema, building international networks and even taking to the skies in airplane races.\n\n\tBut with World War II soon looming, and a company base squarely in the middle of what Nazi Germany would call the Sudetenland, the family was to find itself in an increasingly hazardous world – in fact, as the Third Reich rose, the Schicht company was under pressure to prove itself Aryan – and even to work on components of V1 rockets, says Markova.\n\n\tWas she was not permitted to ask about any of these subjects? “No,” says Markova. “They were very open.”\n\n\tAfter the war, Czech citizens who were ethnic Germans were expelled from Czechoslovakia, and their land and assets were seized.\n\n\t“That collective guilt was applied to the whole family,” says Markova. “The Ústí nad Labem property of Georg Schicht was confiscated after World War II, despite the fact that he lived in London, had British citizenship and his sons fought in the British army.\n\n\t“I am using the memories from the diary of Eleonore Schicht and a written recommendation by Minister of Foreign Affairs Jan Masaryk in the film to demonstrate this fact.”\n\n\tWith the country soon under Soviet control, successful capitalists such as the Schichts were considered public enemies – and the factory became the state-run enterprise Setuza. What’s more, after the Velvet Revolution of 1989, Czechs who had their property seized by the state were allowed to reclaim much of it through a restitution system – but not ethnic Germans who lost it under the post-war Benes decrees.\n\t\n\n\t“The Benes decrees, which legally expelled Germans from Czechoslovakia after World War II, were never repealed; there was no restitution process for the property of Czech Germans.”\n\n\tThe Schicht family moved into other businesses and investments in London, Zurich and even Brazil after World War II, eventually doing well enough that they were able to buy back the former family home in Usti, which they plan to open to the public, they say.\n\n\tIn this city, at least, they were never forgotten, says Markova, in part because the company was known for its socially conscious local investments, building homes for its workers, a community pool, and more.\n\n\t“In 2006 the so-called ‘Soap King’ Johann Schicht was the winner of a local survey,” Markova says, “for the most important citizen of Aussig in last 150 years, so many people know the name. Outside Ústí nad Labem not so many.”\n\n\t“Johann Schicht (the company director in the generation after founder Georg) was a visionary and a philanthropist. He had a relationship to the place where he had his business, his son Heinrich as well. This is not the case of many contemporary entrepreneurs.”\n\n\t“A once-famous name can fall into oblivion, a big industrial empire can burst like a bubble, but something from the non-material values, such as social responsibility and philanthropy, can be passed down through generations,” Markova says.\n\n\t“It is a nice act of respect for ancestors to buy their villa with the vision to open it to the public.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Soap Bubbles’ Tracks Down a Long-Gone Bohemian Dynasty: ‘A Big Industrial Empire Can Burst Like a Bubble’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/Kingdom-of-Soap-Bubbles.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-25T15:57:13.000Z",
      "dateModified": "2025-10-25T15:57:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Box Office: ‘Chainsaw Man’ Revs $8.5 Million Opening Day on Top, ‘Regretting You’ Spars for Second as ‘Springsteen’ Strums in Fourth",
    "url": "https://variety.com/2025/film/box-office/chainsaw-man-beating-springsteen-deliver-me-from-nowhere-1236560960/",
    "image": "https://variety.com/wp-content/uploads/2025/10/springsteen-chainsaw-hoover-split.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-25T15:10:07.000Z",
    "description": "\n\tAnime rides again atop the domestic box office, as “Chainsaw Man — The Movie: Reze Arc” looks to open ahead of fellow new releases, the Bruce Spring",
    "body": "\n\tAnime rides again atop the domestic box office, as “Chainsaw Man — The Movie: Reze Arc” looks to open ahead of fellow new releases, the Bruce Springsteen biopic “Deliver Me From Nowhere” and the Colleen Hoover adaptation “Regretting You.”\n\n\tThe R-rated “Chainsaw Man” went brrr with $8.5 million across Friday and preview screenings from 3,003 locations. The feature, which serves as a big-screen continuation of the manga adaptation’s first season, is headed to an opening bow of $15.5 million. It’s available in both subtitled and dubbed versions, and gets a boost from playing Imax and other premium large format auditoriums, which carry higher ticket prices.\n\t\n\n\tIt’s another win for Sony’s anime label Crunchyroll, which delivered its parent studio’s biggest opening of the year in September with a historic $70.6 million start for “Demon Slayer: Kimetsu no Yaiba – The Movie: Infinity Castle.” “Chainsaw Man” will only hit a fraction of that blockbuster figure, but that a new anime release is again leading charts, above two English language features from traditional Hollywood studios, speaks to how theatrical appetites have shifted over recent years. \n\n\n\tReviews are strong for “Chainsaw Man,” but, more importantly, the audience loves it, as indicated by the “A” grade polled by moviegoer survey firm Cinema Score. Anime is almost always very front-loaded at the box office, with most fans rushing to opening weekend screenings. The bulk of the North American gross will likely come this weekend, but “Chainsaw Man” is already sitting pretty for producer Mappa with $61 million in overseas grosses.\n\t\n\n\tIt’s a tighter race for second place, with “Regretting You” narrowly leading ahead of the sophomore outing of “Black Phone 2.”\n\n\tParamount’s “Regretting You” kicked off with $5.2 million across Friday and previews, including special fan event screenings that featured a live cast Q&A. The Josh Boone-directed generations-spanning drama, produced by Constantin Films, is now projecting a $13 million opening.\n\n\tThat would come out ahead of tracking, which had forecast a debut between $8 million to $10 million. It’s not the box office force that “It Ends With Us,” the first Colleen Hoover feature adaptation, was in August 2024. That Blake Lively starrer launched to a $24 million opening day and a $50 million debut — against a slim $25 million production budget. “Regretting You” cost $30 million to produce. \n\n\tReviews have been comparatively rough for “Regretting You” too, while Cinema Score turned in a middling “B” grade. (Comp to the “A-” earned by “It Ends With Us.”) The ensemble drama, which is rated PG-13 and stars Mckenna Grace, Mason Thames, Allison Williams, Dave Franco and more, is the first of a wave of Hoover adaptations on the way. “Verity” and “Reminders of Him” remain on the slate from other studios.\n\n\tBowing in fourth on Friday, “Deliver Me From Nowhere,” which stars “The Bear” lead Jeremy Allen White belting out as the Boss, earned $3.5 million across opening day, including preview screenings, from 3,460 locations. It’s looking to land within its pre-weekend projections for a debut between $8 million and $12 million, though it’ll have to show some fight to hit the eight-digits side. The PG-13-rated biopic is also sharing Imax and other PLFs with “Chainsaw Man.”\n\n\tThe comparison for 20th Century Studios’ “Springsteen” is last year’s Bob Dylan biopic “A Complete Unknown” — another period piece music drama, which hailed from fellow Disney label Searchlight Pictures. That Timothée Chalamet vehicle debuted with a slightly higher $11.6 million three-day, before riding Oscar buzz through the holidays and the first weeks of January to leg out to $75 million domestic and $140 million globally.\n\n\t“Deliver Me From Nowhere,” directed by Scott Cooper, has similar awards aspirations, after holding film festival premieres attended by Springsteen himself at Telluride, New York and AFI Fest. But reviews have been lukewarm compared to “A Complete Unknown” and the film won’t have the benefit of playing the holiday season. Audiences do like the movie, with Cinema Score turning in a “B+” grade. But at a considerable production budget of $55 million, “Deliver Me From Nowhere” will have to vie to stay relevant to moviegoers in the weeks ahead.\n\t\n\n\tStill with a chance for second, Universal’s release of “Black Phone 2” added $3.7 million on Friday and is headed to a second weekend of $12 million for a 56% drop from its opening. The horror sequel looks to push its domestic total to $48 million through Sunday, pacing a hair ahead of its 2022 predecessor ($47 million through 10 days). It already ranks as the highest-grossing North American release of the year for Blumhouse — a bounce-back after fielding a slate of theatrical nonstarters earlier in 2025, though “Black Phone 2” is also the most expensive of the lot at a $30 million production budget.\n\n\tDisney’s “Tron: Ares” looks to round out the top five, earning another $1.3 million on Friday to fall 48% from its daily total a week ago. Now in its third weekend of release, the sci-fi revival has dropped off fast in theaters and earned just $59 million in North America — a dismal result for an IP play with an $180 million production budget.\n\n\tAlso opening this weekend, Neon is bowing its horror mystery “Shelby Oaks” in 1,823 locations. The original R-rated feature, which has so-so reviews, earned about $1.1 million across Friday and previews and seems headed for a seventh place bow.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Box Office: ‘Chainsaw Man’ Revs $8.5 Million Opening Day on Top, ‘Regretting You’ Spars for Second as ‘Springsteen’ Strums in Fourth",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/springsteen-chainsaw-hoover-split.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-25T15:10:07.000Z",
      "dateModified": "2025-10-25T15:10:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UFC 321 Livestream: How to Watch Aspinall vs. Gane MMA Fight Live Online",
    "url": "https://variety.com/2025/shopping/news/how-to-watch-ufc-321-aspinall-vs-gane-online-livestream-free-1236560516/",
    "image": "https://variety.com/wp-content/uploads/2025/10/UFC-Aspinall-vs.-Gane-VR-Featured.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-25T11:00:00.000Z",
    "description": "\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.\n\n\tAfter lig",
    "body": "\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.\n\n\tAfter light heavyweights Alex Pereira defeated Magomed Ankalaev by technical knockout in round one during UFC 320, the Ultimate Fighting Championship travels to “The Emirates” in the Middle East for UFC 321. The main event features Englishman Tom Aspinall (15-3-0) defending his heavyweight title against French fighter Ciryl Gane (13-2-0) in a marquee matchup. It’s scheduled for five rounds.\n\n\tUFC 321: Aspinall vs. Gane takes place at Etihad Arena in Abu Dhabi, United Arab Emirates on Saturday, Oct. 25. The prelims start at 10 a.m. ET/7 a.m. PT, while the main card kicking off at 2 p.m. ET/11 a.m. PT.\n\n\t\n\t\tHow to Watch UFC 321 Online\t\n\n\tUFC 321 is a pay-per-view (PPV) event that’s available to stream exclusively on ESPN Unlimited. The only way to watch the MMA event is to purchase the PPV livestream feed here.\n\n\tFor new subscribers, the UFC 321 PPV price is $79.99 with the ESPN Unlimited bundle, which comes with Disney+ and Hulu. You’re essentially getting ESPN Unlimited, Disney+ and Hulu for free when you purchase access to the PPV livestream feed.\n\n\tAfterwards, the ESPN Unlimited bundle goes for $29.99/month for the first 11 months of service. However, if you are an ESPN Unlimited subscriber, then you just pay for the UFC 321 PPV price of $79.99.\n\n\tESPN Unlimited features everything that ESPN has to offer, including access to all of its networks and streaming service, like ESPN, ESPN2, ESPN3, ESPN on ABC, ESPNU, ESPNEWS, ESPN Deportes, SEC Network, ACC Network and ESPN+. It’s the ideal streamer for sports fans who want it all. Learn more about ESPN Unlimited here.\n\n\t\n\t\tHow to Livestream UFC 321 Online Free\t\n\n\tSince this is an official pay-per-view fight, there isn’t a way to watch UFC 321 online for free. However, the prelims streams for free on Disney+ and ESPN+ for subscribers, while it also broadcasts on cable network FX on TV — which is available via DirecTV, Fubo and Hulu + Live TV. Use this DirecTV free trial to watch the prelims online for free.\n\t\n\t\tUFC 321 Odds & Predictions\t\n\n\tFor the main event, Aspinall is the favorite to retain his title against Gane. BetMGM’s oddsmakers give Tom Aspinall a -420 moneyline, while Gane received a line of +315 as the underdog. Want more odds? Check out the complete odds and wagers at BetMGM.com online here.\n\n\tYou can livestream UFC 321: Aspinall vs. Gane online with ESPN Unlimited, with the pay-per-view feed for $79.99 for access to the entire event.\n\n\tMain Card, 2 p.m. ET/11 a.m. PT — PPV\n\n\nHeavyweight: Tom Aspinall (champion) vs. Ciryl Gane — Main Event, Title Fight\nWomen’s Strawweight: Virna Jandiroba vs. Mackenzie Dern\nBantamweight: Umar Nurmagomedov vs. Mario Bautista\nHeavyweight: Alexander Volkov vs. Jailton Almeida\nLight Heavyweight: Aleksandar Rakić vs. Azamat Murzakanov\n\n\n\n\tPrelims, 10 a.m. ET/7 a.m. PT — Disney+, ESPN+, FX\n\n\nLightweight: Nasrat Haqparast vs. Quillan Salkilld\nMiddleweight: Ikram Aliskerov vs. Park Jun-yong\nLightweight: Ľudovít Klein vs. Mateusz Rębecki\nHeavyweight: Valter Walker vs. Louie Sutherland\nFeatherweight: Nathaniel Wood vs. Jose Miguel Delgado\nHeavyweight: Hamdy Abdelwahab vs. Chris Barnett\nFlyweight: Azat Maksum vs. Mitch Raposo\nWomen’s Strawweight: Jaqueline Amorim vs. Mizuki Inoue\n\n\n\t\n\t\tGambling problem? Call 1-800-GAMBLER (Available in the US)Call 877-8-HOPENY or text HOPENY (467369) (NY)Call 1-800-327-5050 (MA)21+ only. Please Gamble Responsibly. Call 1-800-NEXT-STEP (AZ), 1-800-BETS-OFF (IA), 1-800-981-0023 (PR). Visit www.1800gambler.net (WV). First Bet Offer for new customers only (if applicable). Subject to eligibility requirements. Bonus bets are non-withdrawable. In partnership with Kansas Crossing Casino and Hotel.See BetMGM.com for Terms. US promotional offers not available in DC, Mississippi, New York, Nevada, Ontario, or Puerto Rico.\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UFC 321 Livestream: How to Watch Aspinall vs. Gane MMA Fight Live Online",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/UFC-Aspinall-vs.-Gane-VR-Featured.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-25T11:00:00.000Z",
      "dateModified": "2025-10-25T11:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How to Watch Joseph Parker vs. Fabio Wardley Live Online",
    "url": "https://variety.com/2025/shopping/news/how-to-watch-parker-vs-wardley-boxing-ppv-online-livestream-free-1236560539/",
    "image": "https://variety.com/wp-content/uploads/2025/10/Boxing-Joseph-Parker-vs.-Fabio-Wardley-Featured.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-25T12:00:00.000Z",
    "description": "\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.\n\n\tWith inte",
    "body": "\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.\n\n\tWith interim WBO heavyweight champion Joseph Parker being the prime contender to take on undisputed WBO heavyweight champion Oleksandr Usyk, the Kiwi still has to grow in the boxing ranks to earn a spot against Usyk in the hopes to win the title.\n\n\tTo prove his mettle, Parker (36-3-0) battles British fighter Fabio Wardley (19-0-1), who has the WBA interim heavyweight title, in an epic pay-per-view heavyweight title bout in London. However, Wardley is looking for an upset, so he can grow in the ranks himself.\n\n\n\tOn Saturday, Oct. 25, All or Nothing: Parker vs. Wardley takes place at O2 Arena in London, England with a start time of 11 a.m. ET/8 a.m. PT. Ringwalk for the main event is expected around 5:30 p.m. ET/2:30 p.m. PT.\n\n\tParker vs. Wardley is available as a pay-per-view boxing event priced at $59.99 for DAZN subscribers.\n\n\tNot a DAZN subscriber? Right now, you can purchase the PPV event and get one month of DAZN with an annual plan for free. An annual subscription starting at $19.99/month for 11 months (one month for free), a 33% savings. But, if you’d like to go monthly instead, DAZN offers a 7-day free trial with a monthly payment of $29.99/month after the trial is over. You can cancel the service, if you’re not into it, with a 30 day notice.\n\n\tAdditionally, some of the fights during the Parker vs. Wardley event are free to watch for subscribers. As a DAZN subscriber, you’ll also have access to more than 100 live fights all year long, as well as fight replays, highlights and documentaries.\n\t\n\t\tJoseph Parker vs. Fabio Wardley Odds & Predictions\t\n\n\tFor the main event, Parker is the favorite to win against Wardley. Oddsmakers give Joseph Parker a -400 moneyline, while Fabio Wardley received a line of +300, as the underdog. Want more odds? Check out the complete odds and wagers at BetMGM.com online here.\n\n\n\tTaking place on Saturday, Oct. 25, Joseph Parker vs. Fabio Wardley is available to stream on DAZN starting at 11 a.m. ET/8 a.m. PT.\n\n\tAll or Nothing: Main Card\n\n\nHeavyweight: Joseph Parker (WBO champion) vs. Fabio Wardley (WBA champion) — Main Event, Title Fight\nLight Heavyweight: Lewis Edmonson vs Ezra Taylor\nCruiserweight: Juergen Uldedaj vs Rolly Lambert Fogoum\nSuper Featherweight: Danny Quartermaine vs Royston Barney-Smith\nSuper Featherweight: Mitchell Smith vs Arnie Dawson\n\n\n\n\tFan of world sports? DAZN is the home to global sports, including FIFA, BKFC, National League, UEFA Women’s Championship League, ERC and WRC racing, Riyadh Season boxing, NFL Game Pass International and other American and international sports leagues. Learn more about DAZN and its programming here.\n\t\n\t\tGambling problem? Call 1-800-GAMBLER (Available in the US)Call 877-8-HOPENY or text HOPENY (467369) (NY)Call 1-800-327-5050 (MA)21+ only. Please Gamble Responsibly. Call 1-800-NEXT-STEP (AZ), 1-800-BETS-OFF (IA), 1-800-981-0023 (PR). Visit www.1800gambler.net (WV). First Bet Offer for new customers only (if applicable). Subject to eligibility requirements. Bonus bets are non-withdrawable. In partnership with Kansas Crossing Casino and Hotel.See BetMGM.com for Terms. US promotional offers not available in DC, Mississippi, New York, Nevada, Ontario, or Puerto Rico.\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How to Watch Joseph Parker vs. Fabio Wardley Live Online",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/Boxing-Joseph-Parker-vs.-Fabio-Wardley-Featured.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-25T12:00:00.000Z",
      "dateModified": "2025-10-25T12:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘SNL’s’ Most Legendary Writer Speaks: Jim Downey on What Makes Trump Jokes Funny, Improvising That Jeffrey Epstein Bit and the ‘SNL’ Sketch He Still Wants to Make",
    "url": "https://variety.com/2025/tv/news/jim-downey-snl-trump-jeffrey-epstein-obaa-1236561159/",
    "image": "https://variety.com/wp-content/uploads/2025/10/NUP_208284_01581-e1761345388390.jpg?crop=52px%2C29px%2C1588px%2C894px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-10-25T15:00:00.000Z",
    "description": "\n\tIn comedy, few are as influential — and elusive — as Jim Downey.\n\n\tDuring his 30-year tenure as a writer on “Saturday Night Live,” he penned era-def",
    "body": "\n\tIn comedy, few are as influential — and elusive — as Jim Downey.\n\n\tDuring his 30-year tenure as a writer on “Saturday Night Live,” he penned era-defining sketches like Chris Farley’s “Chippendales Audition” and defined the show’s political satire with Dana Carvey’s George H.W. Bush (“na ga da it”) and Will Ferrell’s W. Bush (“strategery”). \n\n\tFor many years he was the voice of “Weekend Update,” launching with Norm Macdonald a comedic crusade against O.J. Simpson that resulted in both of them getting fired by NBC. (Downey returned two years later and eventually retired in 2013.) Lorne Michaels has called him the “voice” of “Saturday Night Live” and the “best political humorist alive.”\n\t\n\n\tOutside of occasional appearances on “SNL” and a memorable role opposite Adam Sandler in “Billy Madison,” Downey has remained mostly behind the scenes, rarely granting interviews. Until now.\n\n\tThis year, Downey stepped into the spotlight as the subject of the Peacock documentary “Downey Wrote That,” in which people like Conan O’Brien, John Mulaney and Bill Hader praise him as one of the greatest comedians of all time. And Downey also had two acting roles, playing a jolly member of the Christmas Adventurers Club in Paul Thomas Anderson’s “One Battle After Another” and a bubble-blowing middle manager in Tim Robinson’s HBO series “The Chair Company.”In a phone interview with Variety, while Downey is on vacation in Bermuda, he’s joyously long-winded and generous with his time. When I suggest a word-association game, instructing Downey to provide just one- or two-word answers, he can’t help himself, gushing for minutes on end about his friends and collaborators. While our conversation was initially slotted for 20 minutes, it runs over an hour, with Downey thwarting multiple attempts to set him free. “Go ahead, I’ll take all the questions you have,” he says when I try to wrap at the 45-minute mark. And, 20 minutes later, when I thank him for “going long,” he corrects me: “No, this has not been a long interview. Keep going.”\n\t\n\t\n\t\tYou famously shared an office at “SNL” with Bill Murray. Is there something about the lack of sleep and personal space that breeds comedic creativity?\t\n\n\tI do think it breaks down some barriers. It makes it easier to try something you might be afraid to work up in private and hand in to somebody. The way I write is I work it out on my feet — talking it down, pitching it to people, and changing it as I go. By the time I write a script, it’s really just a record of something that’s already been worked out. I don’t find it on paper; I find it in conversation. The lack of sleep definitely affected the writing and performing in all kinds of ways. It made the whole thing feel more heroic.\n\t\n\t\tYou say in the documentary that you were once the youngest writer on “SNL” and once the oldest. What was the biggest change in the show between those years?\t\n\n\tIn the beginning, almost everything we did — whether it was truly new or not — felt new. It was like walking into a virgin forest and cutting down 200-foot trees. There was so much uncharted territory. But 40 or 45 years later, a lot of that ground has been covered. That’s one of the reasons I have so much respect for the last group I knew well — Bill Hader, Jason Sudeikis, Maya Rudolph, Kristen Wiig, Amy Poehler, Will Forte, Kenan Thompson and that whole crew.\n\n\tComedy had evolved by their time. They could do certain things we couldn’t have done in the ’70s or ’80s, simply because audiences were more innocent back then. There were sketches we did in those early years that wouldn’t even make it out of a read-through today. Sensibilities have changed — tightened, in some ways. You can say audiences have become too politically correct or too sensitive, but arguing about it doesn’t really help. What matters is not just what people find funny, but what they’re comfortable being seen laughing at. In a live audience, that’s a big factor.\n\n\n\n\t\n\n\t\t\t\t\tJim Downey in “Downey Wrote That”\n\t\t\t\t\t\t\t\t\tRalph Bavaro/PEACOCK\n\t\n\n\n\t\n\t\tYou helped put together the “In Memoriam” segment on “SNL50,” which honored the characters and sketches that haven’t aged well.\t\n\n\tIt started as a tribute to the writers and performers we’d lost, but it became something else. It became about all the material we could no longer do. Things that had to be retired forever. Some of it was borderline offensive, but in a comedy-offensive way. And some of it — well, it just wouldn’t work anymore, because it would genuinely upset people. So in a strange way, I think we actually had a little more artistic freedom in the ’70s and ’80s. Maybe less conceptual freedom, but more freedom to take risks. Comedy keeps evolving, though — hopefully expanding, getting smarter, reaching new places.\n\t\n\t\n\t\tWhat was it like coming back for “SNL50”?\t\n\n\tI spent most of my time working with Bill Murray on something for the Radio City Music Hall show, which was on Friday. The anniversary show was Sunday. Coming back after all that time was strange. I’d retired in 2013, so it had been 12 years since I’d been in that kind of setting. To be honest, it was a little frustrating. The Radio City work took up so much of the weekend that I missed seeing some old friends. I caught up with a few people but completely missed others. The big after-party went on all night. There were something like 1,100 people there. And it actually left me kind of sad and emotional. I realized there’s never going to be another one of those, and for some people I saw, that was probably the last time I will see them. So it wasn’t quite the pure fun I’d hoped it would be.\n\t\n\t\tFrom a viewer’s perspective, it did feel like a culmination, even though the show is, of course, continuing.\t\n\n\tIt’s funny you say that. The feeling I had at the 50th anniversary was very similar to the feeling I had in May of 1980 [when most of the cast and crew, including Lorne Michaels, left “SNL”]. We thought of that as the last season. I remember being very emotional.\n\t\n\t\tI’d like to play a word association game, if you’re up for it. I’ll give you a name, and you say the first thing that comes to mind.\t\n\n\tOK.\n\t\n\t\tAdam Sandler.\t\n\n\tThis isn’t a word, but he was our version of Jerry Lewis. He was wild and unpredictable, not to everyone’s taste, but an incredible combination of real brilliance and occasional goofy, low-brow-ness. \n\t\n\t\tNorm Macdonald.\t\n\n\tThe person whose sense of humor was closest to my own. Incredibly principled and fearless. He did like to make people laugh — he lived for that — but he had really high standards about ways of getting to that.\n\t\n\t\tDavid Letterman.\t\n\n\tHe was willing to do things that he knew wouldn’t get huge laughs, but he loved them. I always think about how much he paid attention to language. He had this very Midwestern fondness for odd turns of phrase. [When I was head writer on “Late Night,”] we once did a bit where we had this weeklong project upgrading his desk, adding little features. The NBC crew guy was there with a power drill, and Dave said, “My dream is for ‘Late Night’ to get its own three-speed drill — and someday, God willing, a variable-speed drill.” I remember thinking, nobody in the history of comedy is ever going to get a laugh out of “variable-speed drill.” But that’s what I loved about Letterman. It was about the language. And he was the king of dry.\n\t\n\t\n\t\tLorne Michaels.\t\n\n\tIndispensable. He protected and encouraged writers and performers, but, importantly, he didn’t protect the performers more than the writers. Nobody protected writers like this guy. He’d go to bat for us when the network tried to screw us. Lorne fought for us, and he had the clout to actually solve problems. He was brilliant at negotiating with the network. He was very smooth—I don’t want to say “slick,” but he could be extremely charming.\n\n\tThe only time he ever really ran into trouble was during the [NBC executive] Don Ohlmeyer years. Ohlmeyer’s secret weapon was that he didn’t get Lorne’s jokes. The kind of things that had always worked for Lorne — his wit, his charm — just didn’t land. Most network executives are at least somewhat sophisticated and have a decent sense of humor. Ohlmeyer wasn’t. He was kind of a thug, immune to Lorne’s charm.\n\n\n\n\t\n\n\t\t\t\t\tLorne Michaels and Jim Downey\n\t\t\t\t\t\t\t\t\tNBC via Getty Images\n\t\n\n\n\t\n\t\tWhat will happen to “SNL” after Lorne retires?\t\n\n\tIf Lorne ever leaves the show, I can’t imagine anyone replacing him. I haven’t met a person who could do everything he does. There are people who might have the comedic stature to keep the network and the critics at bay, but no one who can do it all. He’s indispensable.\n\t\n\t\tTina Fey and Seth Meyers are the names that get brought up.\t\n\n\tThose are the two I was thinking of. I just worry that no one has the mystique Lorne has. They maybe have their own kind of mystique, but it’d be rough. I think it was Gilbert Gottfried who once said “SNL” is beyond good or bad, that it’s a restaurant in a good location. But people need to remember that Lorne made it a good location. It was a shitty location — a derelict neighborhood, metaphorically speaking. In the 1970s, there was nothing. They were showing Johnny Carson repeats or something. No one watched television on Saturday night, much less at that time. Half the country was in bed by the time our show came on — probably more than half. And yet, within a year, people were interrupting parties saying, “Hey everybody, it’s 11:30!” and everyone would crowd around the TV. That had never happened before. I’m sure it stopped happening a long time ago, but at the time it was extraordinary.\n\n\tIn the ’70s, brunch was a big thing. After the show, we’d have an after-party, and sometimes an after-after party. We’d get home around 5 a.m., wake up around noon, and crawl out to some restaurant for an omelet and a Bloody Mary. If you went to the bathroom and walked past the other tables, you’d hear people reciting sketches from the night before. Sometimes you’d want to correct them and say, “Excuse me, it was Land Shark, not…” whatever it was. I wish I’d been older, more experienced, to appreciate it fully. It’s a very heady thing to have as your first grown-up job.\n\t\n\n\n\n\t\n\t\tYou finally left “SNL” in 2013, two years before the rise of Donald Trump as a major political figure. Were you sitting on the sidelines saying, “Put me in coach!”?\t\n\n\tHe was already a comic figure to us 30 years before he announced for president. I remember writing a Trump piece in 1984 or ’85, and then another one around ’87 that was a kind of “Gift of the Magi” sketch. In it, Donald and Ivana Trump had given each other these profane, tasteless gifts — Trump bought the doors of the Sistine Chapel for the garage at Mar-a-Lago, and Ivana had ruined some sacred piece of art for a cheesy decoration. He always seemed like this beat-up, ridiculous character. I never had a great, fresh take on him.\n\n\tI do think it’s important to make fun of people, but to try to keep your own animus out of it — not out of fairness or respect for the MAGA audience, but because anger just makes the comedy less funny. Stridency makes it harder for me. Maybe others would disagree, but I was sick of him before he even ran for president. If I were still there, having to deal with him every week, I’d go crazy. I love James Austin Johnson’s impression. The way he plays Trump, with these insane mind excursions and wandering all over the place — is exactly right, and those pieces are really well written.\n\n\tEvery once in a while, I’ll have an idea. I don’t try to think of them, but something may pop into my head while I’m driving, and some of those ideas are so perishable they’d only work that week. Sometimes I’ll call into “SNL” and say, “Hey, I’ve got something if you want it.”\n\t\n\t\tDo you have an example?\t\n\n\tDuring his first term, Trump kept bragging about having the lowest Black unemployment rate in U.S. history, and I gave Michael Che an “Update” joke that went, “I’m pretty sure during slavery times it was zero.”\n\t\n\t\tIs there a politician you wish you could have satirized more?\t\n\n\tI really wanted to write Al Gore for eight years. I thought he was such a strange, interesting character, and a fun person for Darrell Hammond to play. A lot of my friends said, “Oh, you lucked out — Bush is going to be so much easier to write than Gore.” And I totally disagreed. I thought Gore would’ve been much more fun. Bush fit too easily into that “dumb hick” stereotype, and that’s mostly how he was portrayed. Gore, to me, was weirder, more nuanced, and more interesting.\n\t\n\t\n\t\tYou’ve often described your political comedy as apolitical. What do you make of the Trump administration attempting to infuse comedy into their rhetoric? The DHS recently quoted your monologue from “Billy Madison” in a social media post defending ICE.\t\n\n\tIt’s shockingly informal. I don’t quite know what to make of it. I guess there’s nothing I can do about it legally. Trump’s tweets are just kind of semi-literate, but Vance can actually bite. I want the government to have a sense of decorum. You can be funny and dignified, but that was… I was shocked.\n\t\n\t\tWhat is your take on breaking? It seems to be more embraced these days at “SNL” than in the past.\t\n\n\tI was never a fan. You have to earn the right to break. And you earn it by having a long track record of committing to the material, playing it straight, and not breaking. Then, every once in a while, you’re allowed. I never objected when John Mulaney would give Bill Hader Stefon jokes he’d never seen before on-air, and Hader would fight like hell not to break. That, to me, is fine. Phil Hartman, for instance, may have been in more sketches than any cast member in history, and he broke exactly once, in a piece Jack Handey and I wrote. The set started to collapse around him. All hell broke loose. Everyone else in the cast was breaking, and Phil held out for as long as he could, but eventually he lost it. Then you had guys like Horatio Sanz, who I don’t recall ever not breaking. It always seemed cheap to me. \n\n\tNorm hated it. He thought it was an easy laugh. He used to say comedy is like Russian slaw: the cheap stuff can drive the good stuff out of circulation, because it’s easier to make. He used to say his least favorite audience members were the ones who laughed and said, “Oh, that’s cute.” It’s too cute. Too cloying. So, put me down as a hard no on breaking.\n\t\n\t\tYour Jeffrey Epstein bit on Conan O’Brien’s podcast became an internet phenomenon. Was that spontaneous, or was Conan aware you were going to do that bit on the show?\t\n\n\tNo, it unfolded in a completely organic way, moment to moment. The night before I did the show, I was talking to Paula Davis, one of Conan’s producers, and she said to me, “You just need to have an ‘I am blank to be Conan’s friend’ thing ready.” I called her back and said, “Has anyone done “I am entirely unashamed”? Then, driving over to the studio, I realized I needed to think of something to justify it — it was kind of a tail-wagging-the-dog situation. I don’t think I told them I was going to say “Jeffrey Epstein,” but I didn’t really know what I was going to do beyond that.\n\t\n\n\tThere were also things we talked about but never got to, which is why I’m supposed to go back and do Conan’s podcast again, probably in the next couple of months. We were going to talk about Norm Macdonald — that was something we never got to. We spent so much time on the Epstein stuff. We might even return to Epstein, just for fun. It was wild, though, the way that bit had legs.\n\n\n\n\t\n\t\tYou played a member of an exclusive white supremacist group in Paul Thomas Anderson’s “One Battle After Another.” When reading the script, did you anticipate how funny the film would play on screen? \t\n\n\tI thought that character was funny, but I also wanted to play it straight. On set, Paul doesn’t rehearse a lot with the actors. He tends to trust you, like, “You know what I want, right?” Then he’ll fine-tune it. We ran through it a few times, and he asked me to try a few different things, but basically, I just wanted to make him happy. I’m a huge fan of Paul and his work, so my attitude was: as long as you’re sure I’m not going to ruin your movie, I’m thrilled to be here. I’ll give you whatever I’m capable of giving.\n\t\n\t\tDid you improvise at all?\t\n\n\tWe all played around. “Semon demon” was in the script. Some of the other lines Paul said we could take in different directions. But, no, I wasn’t out there winging it. I’ve written for other people for so many years, and I know how much it means when a performer really tries to do something the way you wrote it — the way you intended and imagined it. There’s always room for surprise, but I don’t have any ego about being a performer. I just go, “Here’s what you like,” and when I’d see Paul smiling behind the camera, I figured I was doing it right.\n\t\n\t\tAside from calling into “SNL” every once in a while, what do you do with your ideas? Are you writing something? Are you trying to act more?\t\n\n\tI have outside interests, personal things. What a lot people like me do now is send goofy emails or texts to old friends, often other writers. I’m constantly texting back and forth with George Meyer, who wrote for “The Simpsons” and worked with me at “Letterman” 45 years ago. Jack Handey, another great writer, and I have had this running joke for more than 40 years where we write each other emails or call each other as attorneys threatening to sue one another. It involves this mix of performance and writing — we create these fake legal documents and send them back and forth. It actually takes up a fair amount of time. Sometimes Jack will call, and when I see his name on the caller ID, I won’t pick up because I can’t think of anything to say as my angry attorney character screaming at him. So a lot of my comedy energy gets burned up in those ways.\n\t\n\n\tSomewhere in my texts and old notebooks, there are things I’d like to pursue at some point. I may do a guest writing week at “SNL” again — I could walk in with a couple of sketches I’ve already thought about, just because I’d like to see them done. I think Lorne vaguely doesn’t trust that someone my age could write something that appeals to an 18-year-old audience — and he may well be right. He trusts me if I’m writing something political, because that’s more grown-up stuff anyway. But I still have sketch ideas I’ve always wanted to try.\n\t\n\t\tLike what?\t\n\n\tOne was an instructional video about texting while driving responsibly. It would just be explaining that there’s a right way to text while driving and a wrong way, and we’re here to show you. That’s probably something that would run into standards issues, by the way.\n\t\n\t\tReally?\t\n\n\tYes, because it’s taking a lighthearted approach to a serious problem. Back in the ’70s, our standards battles were more like, “You can’t say ‘pussy,’ it’s a dirty word.” Then later there was one where you couldn’t say “bastard” — not because it was considered a dirty word anymore, but because it might be offensive to children whose parents weren’t married. So the reasoning changed. And now, you’re more likely to run into notes that say, “There’s nothing funny about X.”\n\t\n\t\tBut isn’t that the point of comedy? To find the funny in things that aren’t funny?\t\n\n\tThere’s always a degree-of-difficulty factor in comedy. That was something Norm and I were really in sync about. There are certain things you know are going to get a laugh. You don’t need to be proud of it. It’s like this: if you can get a 13-year-old kid to enjoy sea urchin sashimi, that’s a real fucking achievement. Getting him to like banana cream pie is not. You don’t say, “Did you see that? He ate it right up!” Yeah, of course he did — it’s fucking banana cream pie.\n\n\tOur favorite “Update” jokes made the audience go: “Oh, you fuckers. I disapprove of what you’re doing, but I have to admit it’s funny. I can’t help it.” That’s very different from the reaction: “What you did isn’t really funny, but I agree with your political stance, so I’m going to applaud anyway.” We always preferred the jokes that made people feel a little bad for laughing, not because they were cruel or dirty or juvenile, but because they pushed against comfort a bit. A lot of our O.J. Simpson jokes fell into that category. At a certain point, the relentlessness itself became part of the joke — the fact that we just refused to stop doing them.\n\t\n\n\tI agree that comedy should be challenging. What I hate is pandering. I think most of us do. You still see a little of it on the show sometimes, but for the most part, the show’s done a pretty good job of keeping its standards — trying to do things the right way, not taking shortcuts, not getting too corny, lazy, sappy, or warm and cuddly.\n\n\tThis interview has been edited and condensed.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘SNL’s’ Most Legendary Writer Speaks: Jim Downey on What Makes Trump Jokes Funny, Improvising That Jeffrey Epstein Bit and the ‘SNL’ Sketch He Still Wants to Make",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/NUP_208284_01581-e1761345388390.jpg?crop=52px%2C29px%2C1588px%2C894px&resize=1000%2C563"
      ],
      "datePublished": "2025-10-25T15:00:00.000Z",
      "dateModified": "2025-10-25T15:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Microsoft’s ‘Halo’ Coming to PlayStation in 2026 With ‘Modernized Remake’",
    "url": "https://variety.com/2025/gaming/news/halo-playstation-2026-remake-1236561085/",
    "image": "https://variety.com/wp-content/uploads/2025/10/Halo.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-24T21:25:35.000Z",
    "description": "\n\tXbox’s prized “Halo” franchise is coming to PlayStation 5 next year with a remake of the very first “Halo” game, 2001’s “Halo: Combat Evolved.”\n\n\tTi",
    "body": "\n\tXbox’s prized “Halo” franchise is coming to PlayStation 5 next year with a remake of the very first “Halo” game, 2001’s “Halo: Combat Evolved.”\n\n\tTitled “Halo: Campaign Evolved,” the game is described as “a faithful yet modernized remake of Halo: Combat Evolved’s campaign, rebuilt from the ground up in Unreal Engine 5.” \n\n\tPer Microsoft Gaming and Halo Studios, “Play the legendary story with upgraded visuals, refined controls, two-player split-screen (console only), up to four-player online co-op with cross-play and cross-progression, three new missions, and an expanded arsenal of weapons, vehicles, and new enemies.”\n\t\n\n\tThe news was announced Friday out of the Halo World Championship 2025.\n\n\n\t“We wanted to start where it all began, with the original campaign that defined Halo,” executive producer Damon Conn said in an Xbox Wire post Friday. “Starting here means people that have never played the game before will be able to understand the story from the very beginning, and that can help us chart a course forward with new Halo stories. Focusing on the campaign experience means we can concentrate fully on really capturing the atmosphere, tone – the emotional impact of what made the first campaign so special and iconic.”\n\n\t“Halo: Campaign Evolved” is coming in 2026 to Xbox Series X and S, Xbox on PC, Steam, PlayStation 5. The game will support Xbox Cloud Gaming and Xbox Play Anywhere and be available at launch with Game Pass Ultimate and PC Game Pass. \n\n\tWatch the PlayStation 5 trailer for “Halo: Campaign Evolved” in the video below.\n\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Microsoft’s ‘Halo’ Coming to PlayStation in 2026 With ‘Modernized Remake’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/Halo.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-24T21:25:35.000Z",
      "dateModified": "2025-10-24T21:25:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Shelby Oaks’ Director Chris Stuckmann on That Horrific Ending, Shooting on 2000s Camcorders and His YouTube Origins",
    "url": "https://variety.com/2025/film/news/shelby-oaks-ending-director-chris-stuckmann-youtube-1236559966/",
    "image": "https://variety.com/wp-content/uploads/2025/10/MCDSHOA_EC005_be81bd.jpg?crop=0px%2C3px%2C1280px%2C720px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-10-24T23:30:16.000Z",
    "description": "\n\tSPOILER ALERT: This article contains spoilers for the ending of “Shelby Oaks,” now playing in theaters.\n\n\tSo, who took Riley Brennan?\n\n\tDirector Chr",
    "body": "\n\tSPOILER ALERT: This article contains spoilers for the ending of “Shelby Oaks,” now playing in theaters.\n\n\tSo, who took Riley Brennan?\n\n\tDirector Chris Stuckmann makes his directorial debut with Neon’s horror “Shelby Oaks,” which follows the disappearance of a YouTuber and amateur ghost hunter Riley Brennan (Sarah Durn). Having started his career as a film critic and essayist on YouTube, Stuckmann makes the transition to director with a horror movie that expertly blends media and feels at times like a mockumentary ripped right from the video platform.\n\t\n\n\tCamille Sullivan stars as Mia Brennan, who has been searching for her younger sister Riley after she vanished 12 years ago in the remote town of Shelby Oaks with her YouTube group, the Paranormal Paranoids. The film starts out like a fictional documentary on Riley’s disappearance, but then transforms into a supernatural horror that uses found footage and scripted scares unlike any recent studio movie. It’s like “Blair Witch Project” for the YouTube generation, and Stuckmann uses his years of experience on the platform to maximum effect.\n\n\n\tWith Variety, the director discusses his YouTube origins, shooting on old-school camcorders and that shocking ending.\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tCourtesy Everett Collection\n\t\n\n\n\t\n\t\tWhy was “Shelby Oaks” the story you wanted to tell with your directorial debut?\t\n\n\tI didn’t want to give any producers that I met a chance to turn me down, so I wrote probably like six or seven spec scripts and I went to film festivals and met so many different filmmakers and spent a lot of time trying to meet people and network and get to a place where I could make a connection with someone. It finally helped me get a movie off the ground, because I had been trying for so long. I didn’t want to go into these situations with one script and pitch. So I went into a lot of these film festivals hoping to meet producers with a lot of scripts and pitches. When I bumped into Aaron Koontz at Fantastic Fest in 2019, I had two or three different things I could have pitched him at the time, and “Shelby Oaks” was the one that caught his attention. From there, it became a process of developing it.\n\t\n\t\n\t\tI’m from the Midwest, but I’d never heard of Darke County in Ohio before. How did you choose that as your setting?\t\n\n\tI was trying to think of a general area in Ohio to set it in. Obviously Shelby Oaks is fictional, but as soon as I discovered the name “Darke” and it has an E, which makes it feel more artsy and it’s farm country, it’s literally exactly what I want. I’ve taken a bit of a “Castle Rock” approach because a lot of my spec scripts take place in Darke County, this little mini cinematic universe that may or may not happen one day.\n\t\n\t\tHow did you blend the mix of mockumentary footage, YouTube found footage and scripted horror?\t\n\n\tBeing on YouTube since 2009, there is a phenomena that I have witnessed over the years: People like to watch people watch things. Reacting videos are a very, very popular trend. There is something very inviting about the idea of seeing a person take in information. There’s this sequence with Mia where she watches the tape, and you’re kind of there with her feeling her emotions. She’s your conduit for these emotions. I really love the idea of mixing media, because I feel like that’s how we all live now. We all pop on TikTok, YouTube, TV, movies, audio books, physical books, there’s no set thing for all of us. We all experience media in different ways.\n\t\n\t\tWas there ever a version of this that was a full mockumentary version?\t\n\n\tIt started out completely mockumentary. The very first pitch that we ever had was that, out of necessity. My first idea for this movie was that I would self-finance it for like $20,000 and put it on YouTube, because I was tired of waiting. Eventually the ideas kept evolving and kept coming. As I was writing, I couldn’t stop it. It was this whole thing, and now I had to figure out where this goes. The way it came to me was that every time you watch a mockumentary that’s fictional, you know it’s fictional. You’re in on the joke. I understand that most of them are made out of a budgetary necessity, but since we’re all in on the joke, why can’t we have some fun with this? We have cameras that the actors are aware of, why can’t we also have cameras they’re not aware of and just play in that world?\n\t\n\t\tSome of the found-footage jump scares feel like throwbacks to the early days of scary YouTube videos, like the “Relaxing Car Drive” video that I’m sure many people have stumbled upon. How did you make these retro, proto-internet scares?\t\n\n\tI do think it does have something to do with YouTube, the internet and the creepypasta generation. We all look for ways to describe how art makes us feel through past pieces of art. We always try to find a way to connect. But we’re in this generational shift now where filmmakers are starting to come out of the early YouTube years. Not all the inspiration is coming from film or TV anymore. A lot of it is coming from the internet. Like you mentioned that relaxing car video, I remember watching that back in the day and the thing pops up at the end and I’m falling back in my seat. We weren’t used to being scared by the internet yet. The internet was still kind of a remotely safe place. There wasn’t social media yet. When things on the internet started to scare us, it’s a whole new world of potential horror that can be mined. The mixed media element was very important to me to present different types of scares. The found-footage scare is very different from the traditional narrative scare, not just in visual presentation, but in sound. In the traditional narrative portion of the film, we really opened up the sound channels and explored so many more possibilities of what we could do with sound. In the the earlier portions of the movie, we tried to restrict ourselves a little bit more to the types of sounds that would come from an old-school camcorder. In those Paranormal Paranoids episodes, I shot all those myself with gear from pre-2008. The camcorder was from 2006. The microphone we used was from 2007. We didn’t allow ourselves to have things they wouldn’t have had.\n\t\n\t\n\t\tDid you always imagine the ending as a bleak punch to the gut? How much of it did you want to leave open to interpretation for fans?\t\n\n\tYes, there was never any question for me. All of my favorite horror films tend to have an ending that sticks with you. Obviously, when you’re trying to get your script seen, there are going to be people who make requests, especially some of the less risk-taking producers. I was always very adamant that this has got to be the way it is. When I think about all my favorite horrors, they’re very rarely warm and fuzzy at the end.\n\n\tIf you want to look at just the emotion of it, when something happens to you when you’re younger that leaves a scar or some kind of trauma that it sticks with you, you could view that literally as a crack in a window. If you don’t fix it or get and try to better your life, you just let it sit there and fester and grow and spider-web into something worse, eventually it will probably eat you alive. That’s been the emotional idea behind this thing that has always been looming in the background of Riley and Mia’s life that is also literally represented by this window in the conclusion of the movie. It’s all in there, and there’s a lot of hidden stuff too in various shots.\n\t\n\t\tThere are so many filmmakers, like Danny and Michael Philippou and Curry Barker, who are getting Hollywood deals after starting out on YouTube. How does it feel to see them grow after starting out online? \t\n\n\tI think it’s absolutely wonderful. I’ve talked with Danny and Mike, and I had Danny and Curry on my podcast. When I started my YouTube channel in 2009, it took about six years before I even was able to get press tickets to movies at advanced screenings. That’s because at that time, YouTube as a platform was not taken seriously by Hollywood. If you said you were a YouTube film critic, they’d be like, ‘Cool. Have a nice day.’ Now, when you go to a premiere, what do you see everywhere? YouTubers and TikTokers. Hollywood has had to take the platforms seriously. I think it’s the same with film. There is a new generation of people in their 30s or late 20s who are coming up and started on Vine, TikTok and YouTube. Now they’re getting a chance to make movies, because that is the progression of time that we’re in. If YouTube existed in the ’70s or ’80s, I guarantee Scorsese, Spielberg, Robert Rodriguez, all those guys, would have been uploading.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Shelby Oaks’ Director Chris Stuckmann on That Horrific Ending, Shooting on 2000s Camcorders and His YouTube Origins",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/MCDSHOA_EC005_be81bd.jpg?crop=0px%2C3px%2C1280px%2C720px&resize=1000%2C563"
      ],
      "datePublished": "2025-10-24T23:30:16.000Z",
      "dateModified": "2025-10-24T23:30:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Morena Baccarin on ‘Sheriff Country,’ More ‘Deadpool’ Movies and Seeing Muscled-Up Nicholas Galitzine as He-Man on ‘Masters of the Universe’ Set: ‘Oh My, God, How Did You Do That?’",
    "url": "https://variety.com/2025/tv/columns/morena-baccarin-sheriff-country-deadpool-nicholas-galitzine-he-man-masters-of-the-universe-1236557187/",
    "image": "https://variety.com/wp-content/uploads/2025/08/SheriffCountry.1.jpg?crop=0px%2C43px%2C1200px%2C675px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-10-24T21:40:59.000Z",
    "description": "\n\tMorena Baccarin has done her crimefighting homework.\n\n\tThe actress stars in CBS’s new “Fire Country” spinoff “Sheriff Country” as Sheriff Mickey Fox",
    "body": "\n\tMorena Baccarin has done her crimefighting homework.\n\n\tThe actress stars in CBS’s new “Fire Country” spinoff “Sheriff Country” as Sheriff Mickey Fox. The procedural follows Mickey as she heads up her small hometown police force while grappling with her daughter’s battle with addiction.\n\n\t“It’s been so fun to understand law enforcement, to train in that way,” Baccarin tells me on Zoom video during a lunch break on the Ontario, Canada set. “We always have somebody on set with us, helping us with things like if I’m suspecting somebody’s going to come at me and they’re potentially armed and I’m walking out of my car and I’m parking, how do I do it? Do I pull my gun out?”\n\t\n\n\tRemoving her gun from a holster takes a lot of practice. “Matt Lauria [he co-stars as deputy Nathan Boone]  and I joke around a lot because half of our time on set is spent practicing pulling the gun out, putting it back in, pulling it out and putting it back in,” Baccarin says. “You want it to be second nature because when you put that gun back in you don’t want to look down to see where it is.”\n\n\tNot that Baccarin will ever get completely comfortable handling a firearm. “I’ve aways been very scared of guns. I don’t own a gun. I believe if we didn’t have guns at all, then a lot of the stuff that we deal with would not be happening,” she says. “But I have a new respect for it. Everybody who has been teaching us has been incredibly respectful about the weapon and when you use it, when you touch it, what you do with it and how to handle it.”\n\n\tBaccarin says she was sure she wouldn’t be cast on the show when she told producers she would only sign on if production moved from its planned West Coast location to the East Coast because she wanted to be closer to her family, husband Ben McKenzie and their three kids, in New York. “I 100% thought the job was going away once I said that,” she says, adding, “I think that was a big moment for me to realize that I am valuable enough for them to make that concession. It also sets up a really nice work relationship, not just that they want me, but that we are partners in this.”\n\t\n\n\tBaccarin reflects on being a working mom in Hollywood. “You’re definitely letting somebody down sometimes, at all times, whenever,” she says. “You come to work without having done enough work at home. You miss a birthday, so you make up for something by having a day off and doing more than you should. It’s a mess. But I try to remind them that even if we’re not together, I’m thinking of them, that they’re a part of me, and that it makes me a better mom if I can do what I love, and that one day they’ll understand that.”\n\n\tBaccarin is a familiar face in the superhero world. Her voicework for animated projects is prolific, but her most prominent role is that of Vanessa Carlysle in the “Deadpool” movies. “It’s been such a long journey. I can’t it’s almost 10 years since we shot the first one,” she says. “I never would have imagined in my wildest dreams that that’s what it would have turned out to be. We had so much fun shooting it. It was such a fun world. I hope that I get to do more of it and participate a little bit more than the last one [“Deadpool & Wolverine”]. But I understood that it was the bro comedy.”\n\n\tHer superhero resume expands with her role as The Sorceress in the upcoming live-action “Masters of the Universe” opposite Nicholas Galitzine as He-Man.\n\n\tShe says of Galitzine’s muscled-up transformation for the role, “It’s insane. I saw him on set and he’d been training for months and months and months, I was like, ‘Oh, my god, how did you do that?’”\n\n\tJoining the film was a no-brainer for Baccarin. “I grew up watching He-Man, my brother and I, so it was a really big part of my childhood,” she says, smiling. “It was really cool once I got there and saw the costume and what they had in mind for me — the whole get-up and the wig and contacts and all of it. I’m so excited to see what they make of it because I feel like my part of it was just such a small element to what it’s going to actually be in the end.”\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Morena Baccarin on ‘Sheriff Country,’ More ‘Deadpool’ Movies and Seeing Muscled-Up Nicholas Galitzine as He-Man on ‘Masters of the Universe’ Set: ‘Oh My, God, How Did You Do That?’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/08/SheriffCountry.1.jpg?crop=0px%2C43px%2C1200px%2C675px&resize=1000%2C563"
      ],
      "datePublished": "2025-10-24T21:40:59.000Z",
      "dateModified": "2025-10-24T21:40:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Danny McBride, David Gordon Green, Peter Farrelly Use Their Star Power to Give Life to Doc ‘The Man Who Saves the World?’",
    "url": "https://variety.com/2025/film/news/danny-mcbride-peter-farrelly-doc-the-man-who-saves-the-world-1236558719/",
    "image": "https://variety.com/wp-content/uploads/2025/10/MCDMAWH_EC331.jpg?crop=56px%2C0px%2C2642px%2C1482px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-10-24T23:10:18.000Z",
    "description": "\n\tWhen Gabe Polsky pitched his latest documentary, “The Man Who Saves the World?”  to the major streamers, they weren’t interested.\n\n\t“I made a sizzle",
    "body": "\n\tWhen Gabe Polsky pitched his latest documentary, “The Man Who Saves the World?”  to the major streamers, they weren’t interested.\n\n\t“I made a sizzle and took it to all the usual suspects,” Polsky says. “For them, it felt like it was just too far out.”\n\n\tRevolving around Patrick McCollum, a 75-year-old eccentric peace activist who believes he has been chosen by an ancient prophecy to help unite the Indigenous tribes of South America to save the Amazon and the planet from environmental ruin, the 85-minute film is undeniably surreal. Even Polsky was initially skeptical of McCollum, a jack-of-all-trades ordained chaplain who, prior to facilitating peace in countries around the world, served as a prison chaplain to both Charles Manson and the Menendez brothers and designed jewelry for members of the British royal family.\n\t\n\n\tProducer Doug DeLuca introduced Polsky to McCollum in 2023.\n\n\n\t“Doug knows some wacky people in this world, and he said, ‘Look. I heard this story. It’s really crazy, but I think maybe you should get on the phone and listen and hear this guy out,” Polsky says. “I did, and right away, I was like this guy is crazy.”\n\n\tDespite his initial hesitations, Polsky (“Red Army”) ultimately decided to follow McCollum as he attempted to fulfill the prophecy.\n\n\t“I really had nothing to lose except my time,” Polsky says.\n\n\tThe director appears in the doc and often voices his skepticism, which creates a push-and-pull dynamic between him and McCollum. Just when Polsky is finding it impossible not to feel like he’s part of a lunatic’s sham, Jane Goodall appears.\n\t\n\n\t“I can honestly say Patrick is one of the most extraordinary and inspirational people I have had the good fortune to know and count as a true friend,” Goodall says in the film.\n\n\t“Jane was an absolute game changer,” Polsky says. “I knew that it would be very difficult for this film to work if I didn’t have her because his story’s so unbelievable.”\n\n\tTo say that “The Man Who Saves the World?” is funny is an understatement. It’s a hilarious character study that tackles environmental issues. But despite being that rare doc that combines humor with urgency, Polasky’s inability to find a mainstream distributor has made it hard to find an audience for the film. So, the director asked a few Hollywood heavyweights, including Peter Farrelly, Danny McBride and David Gordon Green, to help get the word out about his doc by signing on as executive producers.\n\n\t“Danny and I were watching cuts and saying, this is awesome. How do we find a home for this doc, knowing that there’s a unique spirit and eccentric quality to it that doesn’t necessarily check the box of your average film festival depressing doc,” says Green. “It’s something different, and that’s what our company ends up just loving to support.”\n\n\tMcBride said that his and Green’s Rough House Pictures, which executive produced the 2023 HBO doc “Telemarketers,” try to champion filmmakers with voices that they believe in.\n\n\t“If weirdly our involvement can help them reach a larger audience, it feels like it’s our duty to participate and lend a hand wherever we can,” says McBride.\n\n\tIn July, Area 23a, the company known for distributing the 2019 doc “Fantastic Fungi,” signed on to do a hybrid, experience based release of “The Man Who Saves the World?” across the country in cities including Portland and Seattle. On Oct. 17, the film kicked off an awards-qualifying theatrical run in Los Angeles. \n\n\t“The documentary is a great journey and it’s hopeful,” says Farrelly. “That is the main reason I wanted to be involved with this film. It’s such a hopeful vision, and that’s what we need right now.”\n\n\t“The Man Who Saves the World?” is now playing in limited release in theaters, starting with New York. The film will expand to additional markets in November with theatrical runs in Chicago and Orlando and major theatrical events in Minneapolis and Charleston.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Danny McBride, David Gordon Green, Peter Farrelly Use Their Star Power to Give Life to Doc ‘The Man Who Saves the World?’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/MCDMAWH_EC331.jpg?crop=56px%2C0px%2C2642px%2C1482px&resize=1000%2C563"
      ],
      "datePublished": "2025-10-24T23:10:18.000Z",
      "dateModified": "2025-10-24T23:10:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "At an L.A. Concert Honoring Warren Zevon, a Starry Cast of Friends and Acolytes Will Pay Tribute to a Wolfman and a Scholar",
    "url": "https://variety.com/2025/music/news/warren-zevon-tribute-concert-wild-honey-1236561026/",
    "image": "https://variety.com/wp-content/uploads/2025/10/GettyImages-534354092-e1761336724543.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-24T22:26:22.000Z",
    "description": "\n\tIt’s Warren Zevon season. That may sound like a funny thing to say, in 2025, or in any year since the legendary rock singer-songwriter died in 2003,",
    "body": "\n\tIt’s Warren Zevon season. That may sound like a funny thing to say, in 2025, or in any year since the legendary rock singer-songwriter died in 2003, given a perennial underdog status that never augured for anything that would be likely to be called a posthumous groundswell, per se. And yet, downtown Los Angeles is about to see two major celebrations of Zevon in less than a month, against all odds. The second will come when he is inducted into the Rock and Roll Hall of Fame on Nov. 8. \n\t\n\n\tBut preceding that this Friday night is the true concentrated dose of Zevon power — a full-on tribute concert involving dozens of singers and dozens more backing musicians taking place at the United Theatre on Broadway. It’s being produced as the annual benefit of the Wild Honey Foundation, which earns plaudits every year for salutes to Buffalo Springfield, the Band, the Beach Boys, the Beatles and so many other classic rock acts that start with a B that it’s a wonder they ever looked to the opposite end of the alphabet. Wild Honey tributes tend to push the three-hour mark, so “Play It All Night Long” may be the operative song of the night — that, or “I’ll Sleep When I’m Dead.”\n\n\n\tThe two key frontpeople of the night may be Jackson Browne and Jorge Calderón, both of whom worked with Zevon from his first album in 1976 and remained close with him until the end — not to mention his son, Jordan Zevon, the night’s most important co-sign. Other participating artists include Dwight Yoakam (who’ll surely be reprising his well-known cover of “Carmelita”), Fountains of Wayne, Shooter Jennings, Marshall Crenshaw, Chris Stills, Steve Wynn and many more. (Veteran L.A. rock writer and Variety contributor Chris Morris will host the evening.)\n\t\n\n\tJordan Zevon is sitting at a rehearsal studio in North Hollywood after running through his chosen songs for Friday’s show. Asked if this tribute is the kind of event he’s been waiting for to honor his dad for the last 20 years or more, he shakes his head.\n\n\t“Quite the opposite,” Zevon demurs. In the past, when much smaller-scale salutes took place, “I kind of avoided them and didn’t  get too involved,” he says.. “I always wished everybody well. But I knew I’d get really picky about it. Even thinking about it gives me chills,” and not the good kind. “What made this exciting for me was that I knew Wild Honey and I’d been to their shows in the past, so I knew this would be one that would just sound really great. And I knew a lot of the people that would be involved, so it made it much more appetizing for, for me to do.” (It helped that one of the musical directors, Jordan Summers (who plays with artists from the Wildflowers to Cat Powers), was his classmate, bandmate and BFF going back to their days as the only two Jordans then attending University High in West L.A.)\n\n\n\n\t\n\n\t\n\n\n\n\tCalderón was Zevon’s most regular collaborator, co-writing songs with him ranging from “Veracruz” and “Nighttime in the Switching Yard” on the earliest albums to finally producing and co-writing the singer-songwriter’s swan song, “The Wind,” released a month before his death.\n\n\t“Jackson Browne and myself put together three or four tributes at Largo, before the pandemic,” Calderón recounts, “and they were great because it was a smaller scale. But I hadn’t done one in a long time when Jordan Zevon called me to do it, and I said, ‘You know, I, I don’t want to do this. Leave it to the youngsters to do the songs.’ Immediately I got a phone call from Jackson” — and faster than you can say “Mama Could Be Persuaded,” “he talked me into doing it.”\n\n\tNot everyone stepping up to the mic has a long association. Shooter Jennings would seem to be one of the most qualified acts on the bill: On several occasions in recent years, he has done full-length Zevon tribute shows in different cities, and even released a limited-edition vinyl LP of his Zevon covers. So to hear him admit that he was not super into Zevon until the past decade is somewhat shocking… if a good sign of just how far beyond his death the artist is still picking up wholesale converts who become devoted for life.\n\t\n\n\tAdmits Jennings, “I’m a latecomer to the party, compared to some of these dudes who have been swimming in it for 30, 40 years. I knew his music a little — I even used to sing ‘Carmelita’ with buddies at Molly Malone’s back in the early 2000s, and I loved Drive-by Truckers’ cover of ‘Play It All Night Long,’ and I knew him from seeing him on Letterman. But I hadn’t really done a deep dive until a friend of mine made me sit down and listen to the words of ‘Desperados Under the Eaves.’ And then it kind of made me collapse inward with my lack of knowledge of him. But I definitely, take it very seriously now.” Once he got over the shame, starting around 2018 “l started to go crazy over him and then I spent like the next few years pretty much only listening to him and Linda Ronstadt. It became this period of time where I was just loving the Los Angeles of the ’70s and the bands that were recording here at the time.”\n\n\tLiving in L.A. and thinking about its literary traditions was part of the appeal of adopting Zevon as a favorite, Jennings says. “I mean, his perspective is pretty cold and dark, in moments, and you gotta kinda live and learn , I think, to get that, and to have that sense of humor in a weird way,. There was a point in time in which I felt I was the guy in ‘Desperados Under the Eaves,’ you know? Tthere’s a part of me that believes that he’s like if Bukowski was a musician or something, exploring that kind of hard, ugly truth a lot of the time. I like the guy who was in the gutter and, strung out and, made his way back from it and hates everybody for every reason in the world. That’s the stuff that interests me in life. I’m not interested in the pretty picture as much,” he says, extolling the guy who — beyond his hit “Werewolves of London” — has songs like “Ain’t That Pretty at All” and “Life’ll Kill Ya.”\n\n\tBut Jennings points out that his couth side was very much a match for his wildman side, even before he became renowned as one of the first rockers to go public with his detox experiences in the ’80s. “He wrote this brutal stuff, but then he was armed with the piano, and the stuff had a classical bent to it — these neoclassical arrangements mixed with this kind of folk and almost Beatles-meets-country kind of sensibility musically excited me.”\n\t\n\n\tPaul Rock is the chief driving force behind Wild Honey, having set the org up going back to the ’90s as a chance to gather some of L.A.’s best musicians in tribute to the world’s greatest artists, as a fundraiser for causes related to autism, a condition that has touched his family. (See this Variety story for an account of how his son, Jacob, found a way to co-compose music, despite being non-verbal, and had his own Wild Honey show.) This year, there are two beneficiaries of the proceeds: the Ed Asner Family Center, which is for autism families, and the Asbestos Disease Awareness Foundation, the Zevon family’s charity of choice.\n\n\tRock says putting together the Zevon show was “two years in the process, but maybe another year before that that we thought about it. The Jackson Browne connection is strong and we knew he was Interested in doing it, so that plays a role when you know you can get somebody that’s that passionate and have someone like that to build the show off. Because the only tricky part of this is that it’s just about the first time where we can’t bring the original artist because he’s not alive. We’ve always tried to have a key member of the band.” (Past Wild Honey shows have seen Richie Furay show up for the Buffalo Springfield show, John Sebastian for the Lovin’ Spoonful, Garth Hudson for the Band, Al Jardine and Brian Wilson for the Beach Boys and Dave Davies for the Kinks.)\n\n\t“So to supplement that for this show, we tried to get people that were crucial to his career, in his band live or in the studio. Of course Jackson produced his first two early records, which gives us a lot of authenticity in this one, along with Jorge. Then we got all the session guys like Bob Glaub and Rick Marotta. I think that’s what’s selling the show to the hardcore Zevon fan.” (As of this writing, only a handful of seats were left in the balcony of the United, formerly the Theatre at Ace Hotel, and at least dozens of those tickets are being claimed by fans flying in from around the country.)\n\n\t“I think there’s a real cult of personality there, even with people who are  way too young to have heard him originally. It strikes a chord, the guy who just couldn’t stop himself; the myth of the wild man artist, I think. is pretty strong with him, and with young people, more than you’d think.”\n\t\n\n\tBut the irony with Zevon, as Rock also points out, is that there are fans who have little interest in the artist as anti-hero and just revere him for the songwriting that has resulted in dozens if not hundreds of covers — starting with the woman who first introduced his name to much of America, Ronstadt.\n\n\t“Over the year his songs have continued to be covered songs by people that are somewhat contemporary. So when you’re thinking about who’s gonna play,  you go through everybody who’s covered the songs, you know, and you find their videos on YouTube and know you could ask them, so there’s still a presence there that’s stronger than most of his time. Plus, I think his appearances on Letterman over the years kept it alive” — including the one in 2003 where he revealed he had terminal cancer, where he uttered his famous “Enjoy every sandwich” maxim. “He was on quite a bit, so there’s a whole generation of people who saw him do that.”\n\n\t“The thing about Warren being known as a songwriter, all the way back to Linda, that really makes it  a real easy one for us. When you have someone whose appeal is built mostly around their style or their stage thing or  something that’s very unique to them, as opposed to the songs that have been covered by many people, it’s harder to do a show if people are just sitting there thinking about the qualities of the original artist and what makes them so striking. Warren is obviously a unique personality, but the songs are very universal.”\n\n\tExcept, of course, for when they’re incredibly peculiar. On this particular rehearsal day, Inara George, of the Bird and the Bee, and Eleni Mandell, who sometimes joins George in their side project the Living Sisters, are rehearsing a duet of a song that is about as distinctive as it gets: “Roland the Headless Thompson Gunner,” which starts off as a heavily detailed foreign mercenary story and ends somewhere in the land of Ichabod Crane.\n\n\n\n\t\n\n\t\t\t\t\tEleni Mandell and Inara George rehearse for the ‘Join Me in L.A.’ Wild Honey tribute to Warren Zevon\n\t\t\t\t\t\t\t\t\tChris Willman/Variety\n\t\n\n\n\n\t“It’s a march,” says George. “It’s a jig,” counters Mandell. “It’s a marching jig,” they collectively decide. With an almost nursery rhyme-like quality, amid the bloodshed. “I actually am really excited about this one,” George said, “because my husband Jake got my kids into Warren Zevon when they were really little and they could sing every word of this song.” (Allegedly, even “Through sixty-six and seven they fought the Congo war / With their fingers on their triggers, knee-deep in gore / For days and nights they battled the Bantu to their knees / They killed to earn their living and to help out the Congolese.” And: “The CIA decided they wanted Roland dead / That son-of-a-bitch Van Owen blew off Roland’s head.”)\n\t\n\n\tThere was a machismo to some of Zevon’s work, clearly, but George finds a different message in “Roland the Headless Thompson Gunner.” “I was listening to it coming over here, and I feel like [the theme is] violence begets violence. It’s not gonna work out, killing people.”\n\n\tThat attention to period detail or geographical specificity very much applied to “Veracruz,” one of the seminal co-writes between Calderón and Zevon, toward the beginning of their three-decade alliance.\n\n\t“Back then in ’78 when he was doing the ‘Excitable Boy’ album, he had started writing the song, and he told me it’s about when Woodrow Wilson sent troops to the port of Veracruz in 1914. He had the first part of the song, but said, ‘I need something because I’m stuck.’ And that was the first one we actually wrote and got recorded. I heard what he had and I came up withthat music and lyrics for the Hispanic part, and that’s how our collaboration started. That song is about the imperialistic government of the U.S. They’re just going somewhere to invade something, and nothing has changed. You know, it’s the same thing. The only thing is that now they send the troops to our cities to mess with us.”\n\n\tHe says “Veracruz” is “an anti-war song war, but it has a lot of heart in it because there’s a family in a horrible situation and they have to leave. After I wrote the Spanish part, Warren says, ‘Man, now the song has heart.’ Because the other part of the song is the description of the people, but now the people are. speaking. And so it was a wonderful song and he loved it till the end of his life.”\n\n\n\n\t\n\n\t\t\t\t\tJordan Summers and Jorge Calderon rehearse for the ‘Join Me in L.A.’ Wild Honey tribute to Warren Zevon\n\t\t\t\t\t\t\t\t\tChris Willman/Variety\n\t\n\n\n\n\tCalderón was critical in the final part of Zevon’s musical journey. “I really, really thought that we were meant to have been together in this lifetime, to meet and, and collaborate. Sometimes I would go there and be with him andend up playing bass or guitar, or I’d clap my hands or sing Harmony, or write a song. You’d see some albums that I just did a few things, and some other albums I’d do more. The only one that I didn’t do anything was ‘Transverse City,’ because he called me up to come work but I had chickenpox!\n\n\t“When we did ‘The Wind,’ it was such a ominous thing. He was dying,” says Calderon. “We were already planning to write the songs fast and do something fast, but between that and starting to work on it, he found out about the cancer. At first I said, ‘Maybe you should just forget the record and go be with your family, get treatment.’ He said, ‘No, I wanna do the record.’ So we did it the same way we had talked about, but with this cloud of a different reality. Nobody knew. The doctors had said, ‘Oh, three months, six months’ — he lasted a year, but we didn’t know that. And the creative energy and process that he was going through and the joy of the songs that we were writing kept him alive longer. And he knew it and the people around us knew it. So that was a beautiful thing. It’s a wonderful album, very honest and sincere. It was done fast, so it’s not perfect. But rock ”n’ roll is not perfect. Rock ‘n’ roll is rock ‘n’ roll.”\n\t\n\n\tThe song that has come closest to becoming a standard from the final album is “Keep Me in Your Heart.” Calderón says, “That was another one that he started from the beginning, but then it became too hard for him to write — too sorrowful. He told me, ‘It’s too painful. Dude, you gotta finish this song. You are gonna have to help me, because I cannot do it.’ I don’t know how I did it, but I did, and at the end, we were both glad that the song got written, because it’s a beautiful song, touching song. What can I say? That album was a special thing, and it was the culmination and the catharsis of knowing each other.”\n\n\tHis son, Jordan, has had a great deal of time to consider his father’s dual (at least) legacies as a wild man before rehab, and a musical scholar before and after finding his sobriety and his footing.\n\n\t“He was a brilliant songwriter, and I don’t think that that’s something that I say just because he is my dad,” Jordan says. In fact, he adds, “it might have taken me longer than some people to get old enough to realize. He really put work into it and tried to create deep, meaningful indelible songs. And he certainly never lost that when he also was being seen as a rock star and, at times, people said, a wild man on stage. A lot of people in his position might have let persona take over when the audience is sort of latching onto that image. But when you go into it with classical training and you put in this kind of deep work, you can kind of let the other stuff get to the bare edge and the talent is still there. I think he would be the first person to say that none of that stuff helped him be what he was in the ’70s. It certainly wasn’t his favorite time of his life, but he got through it.\n\n\t“I think that there’s a lot of timelessness to the music. If you look at some of the brilliant songwriters, the Beatles or Elton John and Bernie Taupin, there’s that same craftsmanship to it. You know, we’ve all gone through a couple of apartments worth of IKEA furniture, and eventually we end up with the antique dresser that still looks as beautiful as the day it was made.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "At an L.A. Concert Honoring Warren Zevon, a Starry Cast of Friends and Acolytes Will Pay Tribute to a Wolfman and a Scholar",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/GettyImages-534354092-e1761336724543.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-24T22:26:22.000Z",
      "dateModified": "2025-10-24T22:26:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Katy Perry Hot Shots To Celebrate Her 41st Birthday!",
    "url": "https://www.tmz.com/2025/10/25/katy-perry-hot-shots-birthday/",
    "image": "https://imagez.tmz.com/image/0b/16by9/2023/11/07/0b5ee8f01c354390ade778bacacb1611_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-25T14:00:38.000Z",
    "description": "\n    \n                    \n                          Katy Perry's\n                          Hottest Shots\n                          On Her 41st Birthd",
    "body": "\n    \n                    \n                          Katy Perry's\n                          Hottest Shots\n                          On Her 41st Birthday! 🎉\n                      \n                  \n                        Published October 25, 2025 7:00 AM PDT\n                                                                            \n      \n    \n          Katy Perry might be celebrating her 41st birthday ... but we're thinking she's going to be feeling like a \"Teenage Dream\" for the entire weekend!\n      \n    \n          And we figured we'd celebrate the pop star's special day by putting together a gallery of her most sizzling shots -- we think each one's hotter than a firework!\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          These photos of this California girl -- or is it Gurl? -- will have you feeling wide awake real fast! Check out our gallery for more!\n      \n      \n              \n          \n                          \n                Katy Perry\n              \n                          \n                Hot Bodies\n              \n                          \n                Birthdays\n              \n                          \n                Music\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Katy Perry Hot Shots To Celebrate Her 41st Birthday!",
      "image": [
        "https://imagez.tmz.com/image/0b/16by9/2023/11/07/0b5ee8f01c354390ade778bacacb1611_xl.jpg"
      ],
      "datePublished": "2025-10-25T14:00:38.000Z",
      "dateModified": "2025-10-25T14:00:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Mandy Moore What's The Big Frigin' Difference?!",
    "url": "https://www.tmz.com/2025/10/25/mandy-moore-whats-the-big-frigin-difference/",
    "image": "https://imagez.tmz.com/image/1d/16by9/2025/10/21/1d762c336ef94f939a4e492eb9d6b0b8_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-25T07:01:43.000Z",
    "description": "\n    \n                    \n                          Mandy Moore ...\n                          What's The Big\n                          Frigin' Differ",
    "body": "\n    \n                    \n                          Mandy Moore ...\n                          What's The Big\n                          Frigin' Difference?!\n                      \n                  \n                        Published October 25, 2025 12:01 AM PDT\n                                                                            \n      \n    \n          Grab your \"Candy\" and see if you can find the sneaky tricks we've implemented into these two Mandy Moore pics ...\n      \n    \n          Earlier this week, the 41-year-old singer-actress hit Disneyland with her fam and posted up on Main Street with Chip 'n' Dale ... and the giant Mickey Pumpkin! As you venture around the street, look above for one of the sneaky switches!\n      \n    \n          \"I'm craving for you (I'm craving), I'm missing you like candy!\"\n      \n    \n          HINT: There are THREE differences in the above Mandy Moore photos!*\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Mandy Moore\n              \n                          \n                Photo Galleries\n              \n                          \n                What's The Big Frigin' Difference\n              \n                          \n                Disney\n              \n                          \n                Halloween\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Mandy Moore What's The Big Frigin' Difference?!",
      "image": [
        "https://imagez.tmz.com/image/1d/16by9/2025/10/21/1d762c336ef94f939a4e492eb9d6b0b8_xl.jpg"
      ],
      "datePublished": "2025-10-25T07:01:43.000Z",
      "dateModified": "2025-10-25T07:01:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Fall Hard for This Thigh High Hottie -- Guess Who!",
    "url": "https://www.tmz.com/2025/10/24/fall-hard-thigh-high-hottie-guess-who/",
    "image": "https://imagez.tmz.com/image/fb/16by9/2025/10/24/fbb76964d21d4179812c6cf7b8e2d45b_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-24T21:56:14.000Z",
    "description": "\n    \n                    \n                          Fall So Hard For This\n                          Thigh High Hottie\n                          Guess",
    "body": "\n    \n                    \n                          Fall So Hard For This\n                          Thigh High Hottie\n                          Guess Who!\n                      \n                  \n                        Published October 24, 2025 2:56 PM PDT\n                                                                            \n      \n    \n          Fall is fall'n hard, and this sexy star knows how to plant a tease on her page and keep her millions wantin' more ... Can you pick up which singer put her stems on full display in these two hot shots?!\n      \n    \n          She's a vocalist who got her start on Disney. She's also an actress -- perhaps you've seen her on Peacock's \"Bel-Air.\"\n      \n    \n          Need one more clue? Just ask Mike Jones!\n      \n    \n          Hit up the gallery for the reveal!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Weather\n              \n                          \n                Hotties & Bodies\n              \n                          \n                Hot Bodies\n              \n                          \n                Guess Who\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Fall Hard for This Thigh High Hottie -- Guess Who!",
      "image": [
        "https://imagez.tmz.com/image/fb/16by9/2025/10/24/fbb76964d21d4179812c6cf7b8e2d45b_xl.jpg"
      ],
      "datePublished": "2025-10-24T21:56:14.000Z",
      "dateModified": "2025-10-24T21:56:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Stars and Scars -- You Be the Judge",
    "url": "https://www.tmz.com/2025/10/25/polls-you-be-the-judge/",
    "image": "https://imagez.tmz.com/image/f3/16by9/2025/10/24/f3c7879b80bb43c8b59ec7a17dec3945_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-25T07:45:52.000Z",
    "description": "\n    \n                    \n                          Stars & Scars\n                          You Be the Judge\n                      \n                 ",
    "body": "\n    \n                    \n                          Stars & Scars\n                          You Be the Judge\n                      \n                  \n                        Published October 25, 2025 12:45 AM PDT\n                                                                            \n      \n    \n          The FBI nabs NBA Hall of Famer Chauncey Billups and other players, President Trump's pal vows a 3rd term's coming and Shohei Ohtani's in the World Series ... again! So, we gotta ask ...\n      \n      \n      \n          \n            \n              \n                \n                Share on Facebook\n              \n            \n            \n              \n                \n                Share on X\n              \n            \n                          \n                \n                  \n                \n              \n                      \n        \n              \n          \n                          \n                Stars and Scars\n              \n                      \n        \n          \n  ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Stars and Scars -- You Be the Judge",
      "image": [
        "https://imagez.tmz.com/image/f3/16by9/2025/10/24/f3c7879b80bb43c8b59ec7a17dec3945_xl.jpg"
      ],
      "datePublished": "2025-10-25T07:45:52.000Z",
      "dateModified": "2025-10-25T07:45:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Halloween Costumes Who'd You Rather?!",
    "url": "https://www.tmz.com/2025/10/25/halloween-costumes-whod-you-rather/",
    "image": "https://imagez.tmz.com/image/e8/16by9/2025/10/21/e8f4b709522942369274cff2782f19c9_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-25T07:30:15.000Z",
    "description": "\n    \n                    \n                          Halloween Costumes\n                          Who'd You Rather?!\n                      \n          ",
    "body": "\n    \n                    \n                          Halloween Costumes\n                          Who'd You Rather?!\n                      \n                  \n                        Published October 25, 2025 12:30 AM PDT\n                                                                            \n      \n    \n          As the saying goes, \"Imitation is the sincerest form of flattery,\" but when celebs opt for similar Halloween costumes, we gotta ask y'all: Who'd You Rather?!\n      \n    \n          \"It's Britney B*tch!\" Paris Hilton rocked a schoolgirl outfit from the \"Hit Me Baby One More Time\" era, while Casey Boonstra sported a \"I'm A Slave For You\" 'fit ... Which iconic Britney look is best?!\n      \n    \n          \"Edward Scissor Hands?! More like \"Edward SZA Hands!\" Musicians Lizzo and Saweetie nailed the spooky classic ... But there can only be one winner!\n      \n    \n          Avanai Gregg is known for her intricate makeup work, and of course, James Charles is a makeup guru, but which Avatar is giving you the blues and who's comin' out on top?!\n      \n    \n          Y'all know the drill ... Hit up the gallery, cast your faves and vote Who'd You Rather?!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Paris Hilton\n              \n                          \n                Hotties & Bodies\n              \n                          \n                Hot Bodies\n              \n                          \n                Who'd You Rather?\n              \n                          \n                Photo Galleries\n              \n                          \n                Halloween\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Halloween Costumes Who'd You Rather?!",
      "image": [
        "https://imagez.tmz.com/image/e8/16by9/2025/10/21/e8f4b709522942369274cff2782f19c9_xl.jpg"
      ],
      "datePublished": "2025-10-25T07:30:15.000Z",
      "dateModified": "2025-10-25T07:30:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]