[
  {
    "title": "‘Harry Potter’ Series Is ‘Such a Delightful Adaptation,’ HBO Max Exec Says: ‘When People Watch It’ They Will Think, ‘These Are the Books’",
    "url": "https://variety.com/2025/tv/global/harry-potter-series-delightful-adaptation-hbo-max-exec-1236598367/",
    "image": "https://variety.com/wp-content/uploads/2025/08/harry-potter-dom-mclaughlin.webp?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-03T12:21:36.000Z",
    "description": "\n\tHBO‘s upcoming “Harry Potter” series is shaping up to be “such a delightful adaptation” of J.K. Rowling’s books, according to HBO Max head of origin",
    "body": "\n\tHBO‘s upcoming “Harry Potter” series is shaping up to be “such a delightful adaptation” of J.K. Rowling’s books, according to HBO Max head of original content Sarah Aubrey. \n\n\tSpeaking on a panel at Content London on Wednesday, Aubrey revealed that she is visiting the set of the series tomorrow. “I just keep thinking, it’s such a delightful adaptation of the books,” she teased. “And I think when people watch it, they [will] think, ‘These are the books.'”\n\t\n\n\tAubrey added that the series is a great representation of the U.K. industry as a whole. “It’s created by a British writer, it’s directed by a British filmmaker and its craftspeople are the best that this country has to offer,” she said. “I’m so excited for everyone to see it.” \n\n\n\tThe upcoming “Harry Potter” series is currently filming at Warner Bros. Studios Leavesden and is targeting a 2027 release, with each season dedicated to one of Rowling’s books. Led by showrunner Francesca Gardiner (“His Dark Materials”) and “Succession” director Mark Mylod, the series stars newcomers Dominic McLaughlin, Alastair Stout and Arabella Stanton as Harry, Ron and Hermione, respectively.\n\n\tAubrey’s keynote at Content London came just a few hours after HBO Max announced a Jan. 13 launch date for the streamer in territories including Germany, Italy, Austria, Switzerland, Luxembourg and Liechtenstein. During her presentation, Aubrey spoke about the original content HBO Max has in the pipeline in those countries, including German production “4 Blocks Zero,” which she teased as a “fantastic, gritty thriller,” and Marco Bellocchio’s Italian series “Portobello,” which she said “swept the festival circuit.” She also revealed that Spanish original series “Rage,” which became the country’s third most-watched premiere on HBO Max since 2021, has been renewed for a second season.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Harry Potter’ Series Is ‘Such a Delightful Adaptation,’ HBO Max Exec Says: ‘When People Watch It’ They Will Think, ‘These Are the Books’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/08/harry-potter-dom-mclaughlin.webp?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-03T12:21:36.000Z",
      "dateModified": "2025-12-03T12:21:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Manoj Bajpayee’s ‘The Family Man’ Season 3 Becomes Prime Video India’s Most-Watched Series of 2025 (EXCLUSIVE)",
    "url": "https://variety.com/2025/tv/news/manoj-bajpayee-family-man-season-3-prime-video-india-record-1236598245/",
    "image": "https://variety.com/wp-content/uploads/2025/11/The-Family-Man-Season-3.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-03T10:27:00.000Z",
    "description": "\n\t“The Family Man” Season 3 has shattered records to become Prime Video India’s most-watched series of 2025 in its first week, the streamer has reveal",
    "body": "\n\t“The Family Man” Season 3 has shattered records to become Prime Video India’s most-watched series of 2025 in its first week, the streamer has revealed.\n\n\tThe spy-action thriller, which launched Nov. 21, reached 96% of post codes in India during its debut week and trended in the top five in more than 35 countries including the U.K., Canada, Australia, the U.A.E, Singapore and Malaysia. The performance marks the strongest opening for the franchise, surpassing benchmarks set by the show’s previous two seasons and any other title on the service this year.\n\t\n\n\tCreators, directors and writers Raj & DK said: “The overwhelming reception to the latest season, even after a four-year wait, reaffirms that they value our efforts to make the series bigger, better, and more engaging and entertaining for them.” \n\n\n\t“The immense love and adulation that audiences have for ‘The Family Man’ is evident in the spectacular reception of the latest season,” added Nikhil Madhok, director and head of originals at Prime Video India. “The gripping story, exceptional performances, and Raj and DK’s signature quirk, complemented by their distinctive storytelling style and heart-stopping thrills, are what have made the series so widely loved and a true audience favorite.”\n\n\tThe season features an ensemble cast led by Manoj Bajpayee, with Jaideep Ahlawat and Nimrat Kaur joining as new additions. Returning cast members include Sharib Hashmi, Priyamani, Ashlesha Thakur, Vedant Sinha, Shreya Dhanwanthary and Gul Panag.\n\n\tCreated by Raj & DK under their D2R Films banner, Season 3 was written by the duo along with Suman Kumar, with dialogues by Sumit Arora. Raj & DK directed alongside Suman Kumar and Tusshar Seyth, who joined as directors for this season.\n\t\n\n\tThe series debuted on Prime Video in 2019 and has remained popular with both audiences and critics across its three-season run.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Manoj Bajpayee’s ‘The Family Man’ Season 3 Becomes Prime Video India’s Most-Watched Series of 2025 (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/The-Family-Man-Season-3.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-03T10:27:00.000Z",
      "dateModified": "2025-12-03T10:27:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Saturday Night Live U.K.’ Casting Is ‘Well Underway,’ Sky Exec Says: ‘An Opportunity for Us to Nurture That Next Generation of Comic Talent’",
    "url": "https://variety.com/2025/tv/global/saturday-night-live-uk-casting-well-underway-sky-exec-1236598283/",
    "image": "https://variety.com/wp-content/uploads/2025/09/NUP_207712_00018.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-03T11:07:33.000Z",
    "description": "\n\tCasting for the U.K. version of “Saturday Night Live” is “well underway,” Sky exec Phil Edgar-Jones said on Wednesday.\n\n\tWhen asked about the upcomi",
    "body": "\n\tCasting for the U.K. version of “Saturday Night Live” is “well underway,” Sky exec Phil Edgar-Jones said on Wednesday.\n\n\tWhen asked about the upcoming sketch series on a panel at Content London, Edgar-Jones — executive director of unscripted originals at the broadcaster — teased: “I am actually not allowed to say anything. It’s going to be good!”\n\n\tHowever, he soon gave the audience a bit more information, saying: “We’re so excited about it because it is an opportunity for us to really nurture that next generation of comic talent. So we’re casting at the moment, we’re sort of well underway with that. We’re looking at writers.”\n\t\n\n\tEdgar-Jones added that Sky has had “such a great response to it from the comedy community and I’m really, really excited about. It’s going to be a lot of fun.”\n\n\n\t“SNL U.K.,” which marks the first British adaptation of the long-running U.S. show, is set to launch on Sky and streaming service NOW next year. Series creator Lorne Michaels is executive producing the London-set spinoff. \n\n\tLast month, Sky revealed the first key creatives behind the show. “The Late Late Show With James Corden” alum and two-time Emmy winner James Longman will serve as the sketch show’s lead producer, while Liz Clare, an experienced live event director with credits like the BRIT Awards and “An Audience With Adele,” is set to helm the series. Daran Jonno Johnson, part of the comedy group Sheeps who penned the 2022 film “Wedding Season” for Disney+, is on board as head writer.\n\n\t“SNL U.K.” will have “the same live, fast-paced format as the original, featuring a new generation of comedy players in the core cast, alongside guest hosts and musical performances,” according to a press release.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Saturday Night Live U.K.’ Casting Is ‘Well Underway,’ Sky Exec Says: ‘An Opportunity for Us to Nurture That Next Generation of Comic Talent’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/09/NUP_207712_00018.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-03T11:07:33.000Z",
      "dateModified": "2025-12-03T11:07:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Singapore Launches $154 Million Program to Boost Film and TV Talent",
    "url": "https://variety.com/2025/film/markets-festivals/singapore-154-million-program-film-tv-talent-1236598322/",
    "image": "https://variety.com/wp-content/uploads/2025/12/Tan-Kiat-How.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-03T11:23:42.000Z",
    "description": "\n\tSingapore‘s Infocomm Media Development Authority has launched a three-year, SGD200 million ($154 million) initiative designed to develop the country",
    "body": "\n\tSingapore‘s Infocomm Media Development Authority has launched a three-year, SGD200 million ($154 million) initiative designed to develop the country’s film and television talent and position it as a regional co-production hub.\n\n\tThe Talent Accelerator Program, unveiled at the Asia TV Forum and Market, creates structured pathways for media professionals to advance from project development through to global distribution.\n\n\n\tSingapore’s Senior Minister of State for Digital Development and Information and Ministry of Health Tan Kiat How said the government is responding to a rapidly evolving media landscape where artificial intelligence is transforming content production and audiences have unprecedented choice.\n\t\n\n\t“The $200 million [$154 million] Talent Accelerator Program is a major investment to ensure that Made-with-Singapore content stands out on the international stage,” Tan said. “We aim to build a stronger pipeline of stories with global appeal, strengthen Singapore’s position as a co-production hub, and reinforce our role as a trusted creative partner in the region.”\n\n\tThe program tackles three distinct phases of the media value chain. In development, IMDA will connect local professionals with commissioners and buyers, offering mentorships in story development, pitching, and deal negotiation. The program provides access to global streamers, platforms, and international production houses.\n\n\tFor production, IMDA will co-fund both regional and global co-productions across films, scripted and unscripted television, and IP adaptations. The distribution phase includes a dedicated marketing team to promote Singapore content and talent internationally, with additional marketing funds for select projects.\n\t\n\n\tIMDA Assistant chief executive for media industry group Yvonne Tang said the authority is building an ecosystem where international partners view Singapore as an essential creative collaborator rather than just a production location.\n\n\t“TAP signals a fresh chapter in our endeavour to support and develop our film and television talent through world-class mentorships and masterclasses, strategic global partnerships, and a new wave of co-production opportunities,” Tang said.\n\n\tThe announcement follows recent partnerships including an unscripted content collaboration with Warner Bros. Discovery. Application details for the program will be released in the first quarter of 2026.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Singapore Launches $154 Million Program to Boost Film and TV Talent",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/Tan-Kiat-How.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-03T11:23:42.000Z",
      "dateModified": "2025-12-03T11:23:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Sandokan: The Pirate Prince’ Leads Fremantle’s Scripted Sales Across Asia – ATF",
    "url": "https://variety.com/2025/tv/markets-festivals/sandokan-fremantle-scripted-sales-asia-1236598259/",
    "image": "https://variety.com/wp-content/uploads/2025/12/Sandokan-poster.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-03T09:37:24.000Z",
    "description": "\n\tFremantle has locked in a series of scripted sales throughout Asia, led by action-adventure series “Sandokan: The Pirate Prince.”\n\n\tThe Lux Vide-pro",
    "body": "\n\tFremantle has locked in a series of scripted sales throughout Asia, led by action-adventure series “Sandokan: The Pirate Prince.”\n\n\tThe Lux Vide-produced “Sandokan,” adapted from Emilio Salgari’s classic saga for Rai, stars Can Yaman, Alanah Bloor, Ed Westwick and John Hannah. The series has been acquired by Rewind’s Hits Now for pan-regional Asia, along with Hulu in Japan and LG U+ in South Korea.\n\n\n\tAlso from Lux Vide, fast-paced drama “Hotel Costiera” — directed by Emmy winner Adam Bernstein and starring Jesse Williams as a former Marine investigating a missing-person case on the Amalti Coast — will launch on Hits Now for pan-regional Asia, Star Entertainment in India and LG U+ in South Korea.\n\t\n\n\tSky Original thriller “The Iris Affair,” created by Neil Cross and starring Niamh Algar and Tom Hollander, will debut on BBC First and BBC Player across pan-regional Asia, plus Wowow in Japan.\n\n\n\tNow TV Limited in Hong Kong has picked up multiple Fremantle titles, including psychological thriller “Little Disasters” starring Diane Kruger from Roughcut Television; romantic comedy-drama “Film Club” from Gaumont UK, co-created by and starring Aimee Lou Wood and Ralph Davis; drama “The Rumour” from Clapperboard Studios and Cuba Pictures with Rachel Shenton; “Daddy Issues” Season 2 from Fudge Park featuring Wood and David Morrissey; and “Big Mood” Season 2 from Dancing Ledge Productions starring Nicola Coughlan and Lydia West.\n\n\tLG U+ in South Korea has acquired over 70 hours of Fremantle dramas, including 2025 titles and catalog offerings such as thriller “No Man’s Land” from Haut et Court TV, Masha and Spiro Film; adventure drama “The Luminaries” from Working Title Television and Southern Light Films starring Eva Green; and Paolo Sorrentino’s “The Young Pope” and “The New Pope” with Jude Law.\n\t\n\n\tThe deals were unveiled at Singapore’s Asia TV Forum and Market.\n\n\t“It’s been amazing to see the incredible response to our scripted slate across Asia,” said Haryaty Rahman, executive VP distribution Asia at Fremantle. “The appetite for authentic storytelling has never been stronger, and our partners across the region are really connecting with our bold new dramas and iconic catalogue titles.”\n\n\tThe deals follow Fremantle’s recent announcement that the final season of “My Brilliant Friend: The Story of the Lost Child,” plus the complete box set, is now available on China’s four leading platforms — iQIYI, Tencent Video, Youku and Bilibili — marking the first time all four services have simultaneously premiered a non-English language European drama series in China.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Sandokan: The Pirate Prince’ Leads Fremantle’s Scripted Sales Across Asia – ATF",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/Sandokan-poster.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-03T09:37:24.000Z",
      "dateModified": "2025-12-03T09:37:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Quezon’ Director Jerrold Tarog Sets Horror Film ‘Knock Three Times’ for CreaZion Studios (EXCLUSIVE)",
    "url": "https://variety.com/2025/film/news/quezon-director-jerrold-tarog-horror-film-knock-three-times-1236598300/",
    "image": "https://variety.com/wp-content/uploads/2025/12/Knock-Three-Times-ATF.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-03T10:59:47.000Z",
    "description": "\n\tPhilippine filmmaker Jerrold Tarog has signed on to helm CreaZion Studios’ “Knock Three Times,” a psychological horror feature, it was revealed at t",
    "body": "\n\tPhilippine filmmaker Jerrold Tarog has signed on to helm CreaZion Studios’ “Knock Three Times,” a psychological horror feature, it was revealed at the Asia TV Forum and Market.\n\n\tThe film follows a young woman returning from rehab who discovers her mother has fallen under the influence of a malevolent antique mirror. The story draws from Filipino urban folklore, specifically a childhood ritual involving mirrors, candles and three knocks that serves as the narrative’s foundation.\n\t\n\n\tThe project, that earned finalist status at the ATF x EST N8 Horror Pitch 2025, marks a genre return for Tarog, whose credits include the psychological horror “Bliss” alongside historical epics “Heneral Luna,” “Goyo” and the recent “Quezon.” \n\n\n\t“What excited me about ‘Knock Three Times’ is its emotional core,” Tarog said. “Horror is most powerful when grounded in human vulnerability, and this film explores how trauma opens doors – sometimes literally – to forces we can’t control.”\n\n\tFilmmaker-producer Real Florido, who pitched the project at ATF Singapore, is producing alongside RJ Agustin. Florido cited a childhood experience during Manila’s frequent power outages as inspiration, recalling watching teenage girls perform a mirror ritual that ended when all their candles extinguished simultaneously.\n\n\t“I see ‘Knock Three Times’ as an opportunity to merge Filipino folklore with a level of cinematic psychological tension that international audiences appreciate,” Tarog said. “It’s intimate, atmospheric, and built around a universal fear: what we might summon when we confront the things we’re not yet ready to face.”\n\t\n\n\tCreaZion Studios is engaging with international distributors and investors following the ATF pitch. The company emphasized the film aligns with its mission to elevate Filipino stories for global audiences.\n\n\t“It’s a film rooted in our culture, our memories, and our people, yet its themes of fear, family, and survival are universal,” said Agustin, who serves as CreaZion Studios’ president and CEO.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Quezon’ Director Jerrold Tarog Sets Horror Film ‘Knock Three Times’ for CreaZion Studios (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/Knock-Three-Times-ATF.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-03T10:59:47.000Z",
      "dateModified": "2025-12-03T10:59:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Svedka Super Bowl Commercial Will Mix Vodka With AI",
    "url": "https://variety.com/2025/tv/news/svedka-super-bowl-commercial-vodka-ai-1236598140/",
    "image": "https://variety.com/wp-content/uploads/2025/12/IY6WscBw.jpeg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-03T11:45:00.000Z",
    "description": "\n\tA new taste is coming to Super Bowl viewers who have long been accustomed to watching ads for soda, candy, pizza, chips and beer.\n\n\tSvedka vodka wil",
    "body": "\n\tA new taste is coming to Super Bowl viewers who have long been accustomed to watching ads for soda, candy, pizza, chips and beer.\n\n\tSvedka vodka will run a 30-second ad just after halftime during NBC’s telecast of Super Bowl LX on February 8 of next year. Executives at Sazerac, the company that distributes the spirit, believe the appearance will mark the first time in at least three decades that a vodkawill advertise during the gridiron classic, which for years was the exclusive domain of beer giant Anheuser Busch InBev when it comes to alcohol commercials.\n\t\n\n\tSvedka “had been in decline for some time when we decided to acquire it” in 2024 says Sara Saunders, chief marketing officer at Sazerac, which also distributes Buffalo Trace and 1792, among others, during a recent interview. “I’m happy to report in the last few months it has returned to consumer growth.” The hope is that a Super Bowl appearance will remind some consumers about Svedka and introduce it to millions of others. The spot marks Sazerac’s first entry into Big Game advertising.\n\n\n\tNBC has sought at least $7 million for a 30-second ad in the annual TV spectacular, which has attracted more demand from advertisers and sold out earlier than is typical.\n\n\tSvedka’s marketing recipe calls for something old and something new. The Svedka “fembot,” a female robot character that was a strong part of the brand years ago, has been revived after an absence of more than a decade. Svedka’s Super Bowl commercial will use artificial intelligence to show the mascot doing a  dance submitted as part of a contest tied to the event that launches Wednesday.\n\t\n\n\tCommercials that use AI elements have been greeted warily in past months, as was the case with a holiday ad from Coca-Cola that debuted last year. Consumers and industry insiders worry that the technology, while making the creation of special effects easier, takes away roles from actual humans. Sazerac’s Saunders says that isn’t the case. Utilizing AI, she says, “has been more time intensive” and required more work from the people on Svedka’s internal creative team. Using the technology was “done so with the intention of expanding what our human team can imagine and produce.”\n\n\tSazerac worked with Silverside, an AI production house that also helped Coca-Cola.\n\n\tThe true aim is to get people talking about vodka in the weeks ahead. Fans over the age of 21 will be asked to create and post a dance routine on Instagram or TikTok using required audio and hashtags tied to the campaign. Victoria Justice, the actor and singer, will work with Sazerac as part of the campaign and contest. Humans will teach the Svedka Fembot — who will appear with a “BroBot” counterpart  — how to perform the winning steps, which will be seen on Super Bowl Sunday.\n\n\tSvedka’s Super Bowl appearance comes partially because of Anheuser-Busch InBev deciding to open the extravaganza to alcohol rivals, ceding its exclusive hold on the category starting in the 2023 game. Since that time, rivals MolsonCoors, Diageo and Heineken have all run pitches during the football festival.\n\n\t“For the last few years, we have had our eyes on the Big Game, really waiting for the right opportunity,” says Saunders. Apparently, the moment has arrived.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Svedka Super Bowl Commercial Will Mix Vodka With AI",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/IY6WscBw.jpeg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-03T11:45:00.000Z",
      "dateModified": "2025-12-03T11:45:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Red Sea Souk Director Holly Daniel Talks ‘Bigger,’ More Competitive Edition: ‘There Has Been an Increase in People Wanting to Come to Red Sea’ ",
    "url": "https://variety.com/2025/film/festivals/red-sea-souk-director-holly-daniel-bigger-2025-edition-1236597124/",
    "image": "https://variety.com/wp-content/uploads/2025/12/VARIETY-SIZING-43.png?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-03T09:13:23.000Z",
    "description": "\n\tWhen asked to describe this year’s edition of the Red Sea Souk, the Arab region’s largest market nested under the dates of the Red Sea Film Festival",
    "body": "\n\tWhen asked to describe this year’s edition of the Red Sea Souk, the Arab region’s largest market nested under the dates of the Red Sea Film Festival, market director Holly Daniel is direct and concise: “Bigger.” A year after first taking over the position, Daniel is leading the major industry event into its most ambitious edition yet, taking place in a new, larger home connected to the festival base in Jeddah’s Culture Square by a physical overpass that symbolizes the event’s ambitions to become a bridge between the Middle East and North Africa region and Asia and the remainder of the world. \n\t\n\n\t“This year everything is bigger and more developed,” says Daniel. “Our exhibition hall is bigger than last year. Over 70% of our exhibitors are new. We are looking at 166 this year, up from 142 last year. There is much more of an international mix, and we have 13 country pavilions. There is a real understanding that Red Sea is the place to come to.”\n\n\n\tBetween Dec. 6-10, senior executives from major players such as Netflix, Amazon, Disney and MBC will head to Jeddah to take part in the Souk, with the market hosting dozens of talks and events including case studies on big Hollywood productions shot in Saudi like “Desert Warrior” and “Kandahar.” \n\n\tAsked what her key priorities were for this year, Daniel says she and her team wanted to “engage with partners more.” It helped that the physical space of the Souk has been increased, allowing the event an additional room for talks and an extra workshop area, two rooms that have been made available for industry partners to curate their own sessions. Daniel’s team also welcomed new curator Wendy Mitchell, who has steered industry sidebars at prominent festivals such as San Sebastian and Sundance London. \n\t\n\n\tKey talks this year include conversations on how to work with MENA partners, India’s creative economy, understanding Saudi audiences, contemporary Palestinian cinema and Arab distribution. On the talents side, organized by the Red Sea Labs, participating members will have access to exclusive conversations and workshops by big Hollywood names like “Breaking Bad” actor Giancarlo Esposito and “Black Swan” director Darren Aronofsky. \n\n\t“We definitely wanted to enhance our talks program,” adds the director. “We had a very strong program last year and worked closely with CCA to curate it. This year, we wanted to have our own in-house team for that. Wendy has great contacts, experiences and networks, so we have a team that has been able to broaden our focus. We wanted to show that Red Sea is a bridge between different territories, and that we can showcase those regions to the global industry as well.”\n\n\tTalking about this desire to become a bridge, Daniel emphasizes that the Red Sea team spent a great deal of time and energy on outreach over the last year, with a particular focus on raising awareness that the Jeddah-based event had recently begun welcoming projects, films, and talent from Asia. When attending key events like Berlin, Cannes and Venice, Daniel has noticed “there has been an increase in people wanting to come to Red Sea.” “From the people we’ve been meeting through outreach, there is a lot of interest both in Saudi, the festival and the region. We’ve had a lot more applications for our project market and talent program. Across everything we are doing, it’s been really positive.” \n\n\tThe director says that the work of the other arms of the Red Sea Film Foundation, like the Red Sea Fund and Red Sea Labs, has helped bolster the image of the fete abroad. “The fund is doing some great work, supporting amazing projects, and we work very closely with the Saudi Film Commission, who have great representation at all the international markets. We work with them to ensure the presence of the Saudi industry is visible and engagement is happening at an international level.”\n\n\tWith more interest from the industry, the Souk is naturally becoming more competitive when it comes to projects selected to pitch and present at the market. “There has definitely been an increase in applications from across Asia,” notes Daniel. “We only opened to Asia last year, and the word is definitely spreading. We also have a lot more local applications from Saudi, and it’s getting more and more competitive. It’s great to see the interest and the strong ideas coming through.” \n\t\n\n\tThis competition brought with it a few structural changes to the selection process. Daniel notes they now have a much wider pool of international project readers, and all projects have a minimum of three reads, with one reader always coming from the same region as the project. “There are a lot more industry voices feeding back on the projects, which has been really beneficial to our process and in helping identify the strong mix we’ll present during the Souk.”\n\n\tAs for what a successful edition would look like to Daniel, she says it is all about the connections being made on the ground. “We are always looking to see successful outcomes for the projects in the project market. We want to see them playing festivals the following year or the year after. We also want our exhibitors to have a positive business experience. But, going back to what I was saying about us being a bridge in the region, what we want is to see true connections being made in the Souk.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Red Sea Souk Director Holly Daniel Talks ‘Bigger,’ More Competitive Edition: ‘There Has Been an Increase in People Wanting to Come to Red Sea’ ",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/VARIETY-SIZING-43.png?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-03T09:13:23.000Z",
      "dateModified": "2025-12-03T09:13:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘The Stories’ and ‘Noor’ Among Highlights at Red Sea as Revamped Programming Team Keeps the Focus on Filmmaking",
    "url": "https://variety.com/2025/film/festivals/red-sea-programmers-on-modified-film-versions-1236597511/",
    "image": "https://variety.com/wp-content/uploads/2025/12/VARIETY-SIZING-42.png?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-03T08:58:11.000Z",
    "description": "\n\tIt’s a year of change in the programming of the Red Sea Film Festival. Its fifth edition, taking place between Dec. 4-13, marks the first for Fionnu",
    "body": "\n\tIt’s a year of change in the programming of the Red Sea Film Festival. Its fifth edition, taking place between Dec. 4-13, marks the first for Fionnuala Halligan as director of international programs. The seasoned journalist and curator arrives at a time of expansion at the Saudi festival, which has settled into its new home of Jeddah’s Culture Square as it solidifies a desire to deliver film programming year-round. \n\n\tSpeaking with Variety ahead of the festival’s kick off, Halligan says her first few months in the job have been “pretty fast and furious.” “There was not much time to sit still. I had to get a team together and figure out what we could do with the existing structure. By the time I came on board, it was just about trying to bring new ideas and see what we could work with.” \n\t\n\n\tHalligan brought in an entirely new programming team to the festival, which includes her former collaborator at the Macao Film Festival and Good Chaos CEO Mike Goodridge, Toronto film curator Giovanna Fulvi, former artistic director of the MAMI Mumbai Film Festival Deepti D’Cunha, journalist Ahmed Al-Ayyad, African cinema expert Alex Moussa Sawadogo, and Alice Kharoubi, who was already part of the Souk team.\n\n\n\tHighlights of this year’s program include Venice standouts “Hijra” and “Roqia,” Lebanon’s Oscar entry “A Sad and Beautiful World,” renowned Palestinian films such as “Palestine 36,” “All That’s Left of You” and major international standouts such as “The Secret Agent,” “Sirât,” and “The Voice of Hind Rajab.” The festival will also host world premieres like “The Stories” and “Noor.” \n\t\n\n\tHalligan worked closely alongside the director of Arab programs, Antoine Khalife, to shape the 2025 edition. Together, the two created stronger ties between their sections as the festival welcomed films from Asia — one of Halligan’s specialties — to its competition, previously only open to the Arab world and Africa. “Antoine is very open and passionate about film, and we have a lot of common ground. All my films go to him, all his films come to me, and when he gets enthusiastic about things I’m chasing, it encourages me on,” says Halligan. “We’re both after the same thing, which is full houses, progression, inclusion, expansion and encouragement to young filmmakers.”\n\n\tKhalife echoes his colleague, praising the “exchange” of ideas the two had over the last few months. Commenting on the Arab selection at this year’s festival, the programmer says it’s one of the strongest crops they have ever had, with standouts like Ameer Fakher Eldin’s “Yunan” and Saudi’s very own Shahad Ameen with “Hijra.” “I started programming very early this year because I knew the Arabic films were very strong. We’ve all been moved by the quality of the films.”\n\n\n\n\t\n\n\t\t\t\t\t“Yunan,” courtesy of Red Sea Film Festival\n\t\t\t\t\t\t\t\t\tCourtesy of Amman Film Festival\n\t\n\n\n\n\tStill, Khalife highlights a certain “difficulty” in programming an Arab festival when the region is experiencing devastating wars in Palestine and Sudan. At such times, many filmmakers turn their lenses to conflict, broaching urgent issues that often obfuscate conversations around the filmmaking itself. “This is such an important conversation because it affects many films, not just the Palestinian ones,” says the veteran curator. “The war in Palestine has a direct impact on all Arab films of today. Directors, given what is happening in Gaza, want to talk more about their own families, their identities and the past. Of course, films coming from Palestine like ‘Palestine 36’ and ‘All That’s Left of You’ are very strong, but the filmmaking itself is strong, it’s not just the subject that is important.” \n\n\t“Even the films trying to play with a new genre go back to political or social problems,” he adds. “We have an Algerian film called ‘Roqia,’ the first Algerian film to play Venice, and it was supposed to be a horror film, but, when you think about it, it is about the black years in Algeria at the beginning of the 90s. It goes back to political issues.” \n\t\n\n\tOn the subject of the local cultural and political landscape, the festival has managed to screen several uncut international films over the years, even showcasing frontal nudity and sex scenes like in John Crowley’s “We Live in Time,” which played in Jeddah last year. Variety has learned that this year, however, certain films will be slightly altered to play for Saudi audiences, like Kleber Mendonça Filho’s twice-Cannes-winning thriller “The Secret Agent.” The festival will not screen a scene of the film that features gay sex. \n\n\tIn a statement, Red Sea said: “We never require films to be altered in order to play at our festival – however, we run a public-facing event within a specific cultural context which we need to respect. On rare occasions, and with directors’ consent, rightsholders have submitted slightly modified versions– similar to standard Middle East edits – for submission. This happened with ‘The Secret Agent.’” When asked if any other films would face cuts to play at the festival this year, representatives could not confirm. \n\n\n\n\t\n\n\t\t\t\t\t“The Secret Agent,” courtesy of Neon\n\t\t\t\t\t\t\t\t\tCourtesy of NEON\n\t\n\n\n\n\tProdded on the subject, Halligan says that she sees “an opening up of society” in Saudi. “The Saudi film industry has come a lot over the last year, and the big story of this year is how people are flocking to see their own culture in cinemas. We are seeing a lot more excitement for the Saudi features and people looking at us as a portal into what is going on at the moment in world cinema. People are proud [of the festival] and rightly so because it has made a huge mark on the map in a very short space of time. A lot is going on in the region; it’s a very exciting moment.”\n\n\tAs for the future, Halligan says the entire Red Sea team is “pretty ambitious.” “You have the feeling you are just scratching the surface. We have had huge interest from the territories we are focused on, and people are really supportive in countries like India. We’d like to have something for them here throughout the year so we don’t confine our relationship to only 10 days of the year.”\n\n\tKhalife is frank in saying that the festival won’t have longevity if they don’t have “good audiences.” “I believe the challenge is to attract more people, not only from the industry, but locals, so we can create a local audience for a different kind of cinema. The challenge is to see full houses during the festival for films like ‘Yunan’ or ‘Hjra.’ I want to organize year-round events at Culture Square and make Jeddah a cinema destination. I want Culture Square to be Saudi’s film house.” \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘The Stories’ and ‘Noor’ Among Highlights at Red Sea as Revamped Programming Team Keeps the Focus on Filmmaking",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/VARIETY-SIZING-42.png?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-03T08:58:11.000Z",
      "dateModified": "2025-12-03T08:58:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "HBO Max Sets Jan. 13 Launch in Italy, Germany and Other Key European Markets",
    "url": "https://variety.com/2025/streaming/global/hbo-max-launch-italy-germany-austria-jan-13-1236597237/",
    "image": "https://variety.com/wp-content/uploads/2025/12/251120_HBO-Max-3-December-Press-Release_16x9-4.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-03T09:00:00.000Z",
    "description": "\n\tHBO Max is coming to Italy, Germany, Austria, Switzerland, Luxembourg and Liechtenstein on Jan. 13, the streamer revealed on Wednesday. This nearly ",
    "body": "\n\tHBO Max is coming to Italy, Germany, Austria, Switzerland, Luxembourg and Liechtenstein on Jan. 13, the streamer revealed on Wednesday. This nearly completes HBO Max’s rollout in Europe, with just the U.K. and Ireland left to launch.\n\n\tFor the first time, viewers in these territories will be able to enjoy content from HBO, Warner Bros. Pictures, Warner Bros. Television, the DC Universe and Max Originals all in one place. Some of the streamer’s most popular shows include “The Pitt,” “It: Welcome to Derry,” “House of the Dragon,” “The Last of Us,” “The White Lotus” and “Euphoria,” while movie offerings include “Superman,” “The Batman,” “Dune” and the “Harry Potter” franchise. The news also comes in time for the Olympic Winter Games Milano Cortina 2026, which will broadcast live on HBO Max from Feb. 6 to 22. \n\t\n\n\tAlongside the date announcement, a slew of local HBO original series have been unveiled. In Germany, W&B Television has set “4 Blocks Zero” — a prequel to award-winning gangster drama “4 Blocks” – and “Banksters,” a real-life heist story. Also on the docket this year is a Beetz Brothers documentary about the theft of the “Big Maple Leaf” coin from Berlin’s Bode Museum and a “Struwwelpeter” thriller series from Jantje Friese and Baran Bo Odar of Dark Ways. Over in Italy, the drama show “Melania” will retrace the 2011 murder of Melania Rea, played by Maria Esposito, and Marco Bellocchio’s Venice-premiering series “Portobello” will debut on HBO Max Feb. 20. Upcoming Italian docuseries include “Gina Lollobrigida: Diva Contesa,” exposing the battle over the legacy of a cinema icon, and “Saman,” depicting the struggle of a young Pakistani woman who was murdered by her own family for refusing an arranged marriage.\n\t\n\n\n\n\t\n\n\t\t\t\t\tMaria Esposito in “Melania.”\n\t\n\n\n\n\tHBO Max Germany will also offer acclaimed films through output agreements with Leonine Studios, Constantin Film and German Warner Bros. Pictures productions like Wunderschöner, as well as a curated slate from DCM. Meanwhile, HBO Max Italy will debut “Nonostante,” the new film directed by and starring Valerio Mastandrea, and “Squali,” Daniele Barbiero’s feature directorial debut starring Lorenzo Zurzolo and James Franco.\n\n\t“We are thrilled to bring HBO Max and the stories that stick with you to new countries across Europe this January,” JB Perrette, CEO and president of global streaming and games at Warner Bros. Discovery, said in a statement. “With our strongest line-up of U.S. and local HBO series yet, blockbuster local and international movies and the Olympic Winter Games, it is the perfect time to make HBO Max available directly to subscribers. It has never been easier to enjoy the most talked-about series, hit movies, unmissable live sports and extraordinary real-life stories.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "HBO Max Sets Jan. 13 Launch in Italy, Germany and Other Key European Markets",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/251120_HBO-Max-3-December-Press-Release_16x9-4.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-03T09:00:00.000Z",
      "dateModified": "2025-12-03T09:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jenna Dewan's Hot Shots to Kick Off Her 45th Birthday",
    "url": "https://www.tmz.com/2025/12/03/jenna-dewan-hot-shots-45th-birthday/",
    "image": "https://imagez.tmz.com/image/66/16by9/2025/12/02/661a56c2e9ac46f0a9fb2804fd3d1de3_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-12-03T08:01:56.000Z",
    "description": "\n    \n                    \n                          Jenna Dewan's Hot Shots\n                          To Kick Off her\n                          45th ",
    "body": "\n    \n                    \n                          Jenna Dewan's Hot Shots\n                          To Kick Off her\n                          45th Birthday!\n                      \n                  \n                        Published December 3, 2025 12:01 AM PST\n                                                                            \n      \n    \n      \n        \n              \n    \n    \n          Forty-five has never looked this good! Jenna Dewan is far from a \"Rookie\" but if there's ever a draft for a league of hot actresses, she's our number one pick.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          In honor of her birthday, we're revisiting her hottest pics ... like this one of a smoldering mirror selfie.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          And this super shot of the \"Superman & Lois\" star in a tantalizing low-cut number.\n      \n\n          \"Step Up\" into our hot shots gallery for more!\n      \n    \n          Happy Birthday, Jenna!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Jenna Dewan\n              \n                          \n                Hotties & Bodies\n              \n                          \n                Hot Bodies\n              \n                          \n                Movies\n              \n                          \n                Birthdays\n              \n                          \n                Photo Galleries\n              \n                          \n                Hot Mamas\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jenna Dewan's Hot Shots to Kick Off Her 45th Birthday",
      "image": [
        "https://imagez.tmz.com/image/66/16by9/2025/12/02/661a56c2e9ac46f0a9fb2804fd3d1de3_xl.jpg"
      ],
      "datePublished": "2025-12-03T08:01:56.000Z",
      "dateModified": "2025-12-03T08:01:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Timothee Chalamet Gets a Love Puppy",
    "url": "https://www.tmz.com/2025/12/02/timothee-chalamet-gets-love-puppy/",
    "image": "https://imagez.tmz.com/image/61/16by9/2025/12/03/618b53650cc640e688b174d320668293_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-12-03T00:05:31.000Z",
    "description": "\n    \n                    \n                          Timothee Chalamet\n                          PUPPY LOVE!!!\n                      \n                ",
    "body": "\n    \n                    \n                          Timothee Chalamet\n                          PUPPY LOVE!!!\n                      \n                  \n                        Published December 2, 2025 4:05 PM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Move over Kylie Jenner ... there's a new love interest in Timothee Chalamet's life!\n      \n    \n          Timothee has welcomed a fur baby into his life ... a sleepy little critter who has instantly bonded to the \"Marty Supreme\" star.\n      \n    \n          The dog seems to be a pit bull terrier mix -- at least according to A.I.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Timothee hasn't revealed a name for the pooch, but you can feel the love by the crying-eye emoji in the caption.\n      \n    \n          What's unclear ... will this be a case of 'Have Dog, Will Travel'? Timothee is one of the most sought-after actors in the game, so will the dog accompany him on his travels?\n      \n    \n          Unclear how Kylie feels about the competition, but it feels like a case of ... like my dog, or else!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Timothee Chalamet\n              \n                          \n                Kylie Jenner\n              \n                          \n                Pets\n              \n                          \n                Celebrity News\n              \n                          \n                Animals\n              \n                          \n                Instagram\n              \n                          \n                Fairly Legal\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Timothee Chalamet Gets a Love Puppy",
      "image": [
        "https://imagez.tmz.com/image/61/16by9/2025/12/03/618b53650cc640e688b174d320668293_xl.jpg"
      ],
      "datePublished": "2025-12-03T00:05:31.000Z",
      "dateModified": "2025-12-03T00:05:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Eloise In 'Eloise At The Plaza' 'Memba Her?!",
    "url": "https://www.tmz.com/2025/12/03/eloise-at-the-plaza-sofia-vassilieva-memba-her/",
    "image": "https://imagez.tmz.com/image/0a/16by9/2025/11/26/0af1ba6907c94be19aeb2bfebf049756_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-12-03T08:45:53.000Z",
    "description": "\n    \n                    \n                          Eloise In\n                          'Eloise At The Plaza'\n                          'Memba Her?!\n",
    "body": "\n    \n                    \n                          Eloise In\n                          'Eloise At The Plaza'\n                          'Memba Her?!\n                      \n                  \n                        Published December 3, 2025 12:45 AM PST\n                                                                            \n      \n    \n          American Actress Sofia Vassilieva was just 10 years old when she starred as the creative and silly little girl living at The Plaza Hotel in the 2003 comedy film \"Eloise At The Plaza.\"\n      \n    \n          Vassilieva shared the big screen with Hollywood legends Julie Andrews, Christine Baranski, and Jeffrey Tambor.\n      \n    \n          Guess what she looks like now in her 30s!\n      \n      \n      \n          \n            \n              \n                \n                Share on Facebook\n              \n            \n            \n              \n                \n                Share on X\n              \n            \n                          \n                \n                  \n                \n              \n                      \n        \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Jeffrey Tambor\n              \n                          \n                Julie Andrews\n              \n                          \n                Movies\n              \n                          \n                Memba Them\n              \n                          \n                Photo Galleries\n              \n                      \n        \n          \n  ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Eloise In 'Eloise At The Plaza' 'Memba Her?!",
      "image": [
        "https://imagez.tmz.com/image/0a/16by9/2025/11/26/0af1ba6907c94be19aeb2bfebf049756_xl.jpg"
      ],
      "datePublished": "2025-12-03T08:45:53.000Z",
      "dateModified": "2025-12-03T08:45:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Alleged Wife Killer Brian Walshe May Have Searched For Porn About Cheating Spouses",
    "url": "https://www.tmz.com/2025/12/02/brian-walshe-search-history-cheating-wife-porn/",
    "image": "https://imagez.tmz.com/image/aa/16by9/2025/11/18/aa6b96801e22483f9dd4564c3f21d0e9_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-12-03T03:53:54.000Z",
    "description": "\n    \n                    \n                          Brian Walshe Murder Trial\n                          Laptop Shows Pornhub Searches\n               ",
    "body": "\n    \n                    \n                          Brian Walshe Murder Trial\n                          Laptop Shows Pornhub Searches\n                          ... 'Cheating Wife' Smut Film\n                      \n                  \n                        Published December 2, 2025 7:53 PM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          The Massachusetts man on trial for allegedly killing and disposing of his wife may have watched a porn flick about a cheating spouse three days before the mother of his 3 children disappeared, according to testimony from an investigator.\n      \n    \n          Brian Walshe went on trial Monday in Dedham, Mass., for allegedly murdering and dismembering his wife, Ana, then disposing of her remains on New Years Day 2023.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Last month, Walshe pleaded guilty to getting rid of Ana's corpse and deceiving investigators, but he denied killing his wife. Ana's remains have never been found.\n      \n    \n          Massachusetts State Police Trooper Nicholas Guarino testified Tuesday under direct questioning that Walshe's laptop had viewed a pornographic video about a “cheating wife.\"\n      \n    \n          But, on cross examination, Walshe's defense attorney, Larry Tipton, got Guarino to admit that Walshe’s computer searches failed to show the user was specifically looking for smut films about a cheating wife.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Tipton indicated the laptop's user downloaded a video from Pornhub's vast library of erotic content and even suggested the user was searching for a specific porn star. Throughout his examination, Tipton was careful not to identify Walshe as the actual user of the laptop, instead referring to the person as a “device user.”\n      \n    \n          Guarino also testified that Walshe made numerous Internet searches about cleaning up and disposing of bodies, as well as searching for 1970's serial killer Patrick Kearney, better known as the \"Trash Bag Killer.\" After killing and dismembering his victims, Kearney would discard them in trash bags.\n      \n    \n          Day 3 of the trial continues tomorrow.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Brian Walshe\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Alleged Wife Killer Brian Walshe May Have Searched For Porn About Cheating Spouses",
      "image": [
        "https://imagez.tmz.com/image/aa/16by9/2025/11/18/aa6b96801e22483f9dd4564c3f21d0e9_xl.jpg"
      ],
      "datePublished": "2025-12-03T03:53:54.000Z",
      "dateModified": "2025-12-03T03:53:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "John Stamos vs. Ricky Martin Who'd You Rather (Hollywood Zaddies)",
    "url": "https://www.tmz.com/2025/12/02/john-stamos-vs-ricky-martin-whod-you-rather/",
    "image": "https://imagez.tmz.com/image/cd/16by9/2025/12/02/cdfe88353eec4831ab0b29b40ee7fe82_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-12-02T23:46:23.000Z",
    "description": "\n    \n      \n        \n        \n          Launch Gallery\n        \n                  Getty/Instagram\n              \n    \n    \n          This is a \"Full ",
    "body": "\n    \n      \n        \n        \n          Launch Gallery\n        \n                  Getty/Instagram\n              \n    \n    \n          This is a \"Full House\" of Hot Dads -- Ricky Martin and John Stamos posed for a pretty lil' pic, but which spiffy stud is gettin' your hard vote?!\n      \n    \n          The question here is: Who'd You Rather?!\n      \n    \n          VOTE NOW!\n      \n      ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "John Stamos vs. Ricky Martin Who'd You Rather (Hollywood Zaddies)",
      "image": [
        "https://imagez.tmz.com/image/cd/16by9/2025/12/02/cdfe88353eec4831ab0b29b40ee7fe82_xl.jpg"
      ],
      "datePublished": "2025-12-02T23:46:23.000Z",
      "dateModified": "2025-12-02T23:46:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]