[
  {
    "title": "Park Chan-Wook to Preside Over 79th Cannes Film Festival Jury",
    "url": "https://variety.com/2026/film/global/park-chan-wook-cannes-film-festival-jury-president-1236672634/",
    "image": "https://variety.com/wp-content/uploads/2025/12/Park-Chan-wook.jpg?crop=0px%2C15px%2C1200px%2C675px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-02-26T04:00:00.000Z",
    "description": "\n\tPark Chan-wook will preside over the jury of the 79th edition of the Cannes Film Festival. The celebrated South Korean director, screenwriter and pr",
    "body": "\n\tPark Chan-wook will preside over the jury of the 79th edition of the Cannes Film Festival. The celebrated South Korean director, screenwriter and producer will succeed French actor Juliette Binoche, whose jury handed the Palme d’Or to Jafar Panahi’s Iranian drama “It Was Just an Accident.”\n\n\tKnown for his baroque and subversive work, Park has a long history with Cannes. He presented his feature debut, “Oldboy,” at the 2004 festival, where it won the Grand Prize and later became a cult film. He’s returned to the competition with most of his films since then, including “Thirst,” which picked up the Jury Prize in 2009, “The Handmaiden” in 2016 and “Decision to Leave,” which won best director in 2022.\n\n\n\t“Park Chan-wook’s inventiveness, visual mastery, and penchant for capturing the multiple impulses of women and men with strange destinies have given contemporary cinema some truly memorable moments,” said festival president Iris Knobloch and director Thierry Frémaux in a joint statement. “We are delighted to celebrate his immense talent and, more broadly, the cinema of a country deeply engaged with the questioning of our time.”\n\t\n\n\tPark will become the first South Korean president of the Cannes Film Festival in its 79-year history. Wong Kar-wai is the only other Asian filmmaker to have headed the jury, 20 years ago.\n\n\tPark, whose latest film “No Other Choice” was nominated for three Golden Globes, said, “The theater is dark so that we may see the light of cinema. We confine ourselves within the theater so that our souls may be liberated through the window of film.\n\n\t“To be enclosed in a theater to watch films, and enclosed again to engage in debate with the members of the jury, this double, voluntary confinement is something I await with great anticipation,” he continued.\n\t\n\n\tAlluding to ongoing wars and political tensions, he said, “In this age of mutual hatred and division, I believe that the simple act of gathering in a theater to watch a single film together, our breaths and heartbeats aligning, is itself a moving and universal expression of solidarity.”Cannes has long championed South Korean cinema. Back in 2002, the festival awarded Im Kwon-taek with the best director award for “Strokes of Fire.” Bong Joon-ho became the first Korean director to win the Palme d’Or in 2019 for “Parasite” and then made history winning best picture, director, screenplay and international feature at the Oscars.\n\n\tOver the years, Cannes also shined a spotlight on a new generation of South Korean directors who presented their films in competition; notably Hong Sang-soo, with “Tale of Cinema” in 2005, Kim Ki-duk with “Breath” in 2007 and Lee Chang-dong with “Poetry,” which won best screenplay in 2010. Others have included Kim Jee-woon with “A Bittersweet Life” in 2005, Yeon Sang-ho in “Train to Busan” in 2016, Byun Sung-hyun with “The Merciless” in 2017 and Lee Won-tae with “The Gangster, the Cop, the Devil” in 2019.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Park Chan-Wook to Preside Over 79th Cannes Film Festival Jury",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/Park-Chan-wook.jpg?crop=0px%2C15px%2C1200px%2C675px&resize=1000%2C563"
      ],
      "datePublished": "2026-02-26T04:00:00.000Z",
      "dateModified": "2026-02-26T04:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "AMC Theatres to ‘Block and Reserve Best Seats’ for A-List and Stubs Premiere Members",
    "url": "https://variety.com/2026/film/news/amc-theatres-reserve-best-seats-a-list-stubs-members-1236673087/",
    "image": "https://variety.com/wp-content/uploads/2020/10/MovieTheatres224652.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-25T23:19:40.000Z",
    "description": "\n\tAMC Theatres is offering a new perk to its loyalty program members: Customers who pay a monthly fee for A-List or Stubs Premiere will get priority a",
    "body": "\n\tAMC Theatres is offering a new perk to its loyalty program members: Customers who pay a monthly fee for A-List or Stubs Premiere will get priority access to the best seats in the house.\n\n\tThe program is expected to launch in 2026, the company’s chairman Adam Aron on Tuesday’s earnings call. This change comes three years after AMC tested (and then abandoned) Sightline at AMC, a ticket pricing initiative based on seat location within the auditorium. \n\t\n\n\t“Later this year, AMC will introduce preferred premier seating, where we will block and reserve the best seats in the house in our theaters to be accessed first only by our A-List and our Stubs Premiere members — that’s the two VIP tiers within our Stubs program — at no added charge at AMC,” Aron said during the call. “We will assure the best seats in our auditoriums are held, at first anyway, for our best customers.”\n\n\n\tOf course, seating preferences can be subjective — and AMC Theatres didn’t define which will be considered the “best” rows. But the pilot program for Sightline at AMC involved customers paying more money for prime middle seats with an unobstructed view and less to sit in the front row. It’s possible the new initiative will follow a similar pattern.\n\n\tIn 2025, AMC raised the price of Stubs A-List to $27.99 per month in New York and California and $19.99 to $25.99 per month elsewhere in the country, depending on the state. Under the highest membership tier, patrons can see up to four movies every week in any format. Premiere — a tier below A-list that offers waived online ticketing fees, popcorn upgrades and other perks but doesn’t include the benefit of four-movies-a-week — costs $17.99 a month.\n\t\n\n\t“We think it will be a considerable consumer benefit that our most frequent guests will notice and greatly appreciate, further cementing their brand loyalty to AMC,” Aron added.\n\n\tEarlier this week, AMC Theatres reported a 10% decline in attendance during the end of 2025 as the chain’s quarterly revenue dropped to $1.28 billion, down 1.4% from the year prior. AMC has been testing all kinds of initiatives to lure customers in greater numbers. Last summer, the company started offering 50% off movie tickets on Tuesdays and Wednesdays for AMC Stubs rewards program. \n\n\tAlthough 2026 has been off to a slow start, Hollywood studios and theater owners are bullish that upcoming blockbusters like Christopher Nolan’s “The Odyssey,” two Marvel’s adventures in “Spider-Man: Brand New Day” and “Avengers: Doomsday,” as well as Disney and Pixar’s “Toy Story 5,” will help to push domestic box office revenues toward pre-pandemic heights. Across the entire movie theater industry, exhibitors have struggled to recover from the pandemic and dual labor strikes, as well as the rise in popularity of streaming services.\n\n\t“AMC is exceptionally well positioned to capitalize on a recovering box office,” Aron said. “And as I have said many times before, the not-so-secret formula to a full box‑office recovery is straight forward, we need more great movies from our studio partners.”\n\n\tMore to come….\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "AMC Theatres to ‘Block and Reserve Best Seats’ for A-List and Stubs Premiere Members",
      "image": [
        "https://variety.com/wp-content/uploads/2020/10/MovieTheatres224652.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-25T23:19:40.000Z",
      "dateModified": "2026-02-25T23:19:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Adult Swim’s ‘Smiling Friends’ to End After Season 3",
    "url": "https://variety.com/2026/tv/news/smiling-friends-ending-season-3-adult-swim-1236673215/",
    "image": "https://variety.com/wp-content/uploads/2025/10/Unknown_21e554.jpeg?w=668&h=376&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-26T03:55:54.000Z",
    "description": "\n\tAdult Swim‘s animated comedy “Smiling Friends” is ending after its third season. Creators and stars Michael Cusack and Zach Hadel revealed the news ",
    "body": "\n\tAdult Swim‘s animated comedy “Smiling Friends” is ending after its third season. Creators and stars Michael Cusack and Zach Hadel revealed the news in a video posted to Adult Swim’s X account.\n\n\t“I’m gonna cut right to the chase,” Hadel said at the top of the message. “This is not a bit, this is not a joke. Michael and I are here to announce that ‘Smiling Friends’ will be ending after Season 3 is done.”\n\n\n\n\t“To be perfectly honest, after we finished Season 3, Zach and I just both had the same feeling where we felt pretty burnt out after putting years and years into this, but also pretty accomplished,” Cusack added. “We just came to this feeling where we were like, ‘I think that could just be it,’ after Season 3.” \n\t\n\n\tHadel explained that from the very beginning, he and Cusack wanted to put “110%” into “Smiling Friends” and then “go out on top.” He said it was better to leave the audience “wanting more” than to have fans think, “‘That show is still on the air? Oh god.'”\n\n\t“We wouldn’t want to be doing more seasons half-hearted or burnt out or not feeling it,” he added. “That’s not fair to us, and it’s not fair to the audience to give you guys fucking slop. That sucks.”\n\n\tCusack explained that ending “Smiling Friends” was “our decision,” and that Adult Swim has been “very supportive.”\n\n\t“When we told them exactly this, they said, ‘If you’re not feeling like making a cartoon, we’re not going to stop you. Go have a break. Either come back or don’t,” Cusack continued. “That’s the other thing, we could come back in the future and make more episodes if we want, if we feel like it. And they’ve been super cool and said they would let us do that. But maybe not. Who knows?”\n\t\n\n\tThe pair went on to announce that two unreleased Season 3 episodes will air April 12 on Adult Swim. Hadel clarified they are “not finales,” but rather “little stragglers” that didn’t make it into the initial season rollout. \n\n\t“We know this is very disappointing,” Cusack concluded, “It’s been very hard to even record this recording for it because it’s just a very difficult thing to say for us. We hope you understand and we hope you’ve enjoyed what we’ve done. It’s been amazing. The fans have been so good. It’s been the best. It’s been the ride of a lifetime. But I hope you see where we are coming from.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Adult Swim’s ‘Smiling Friends’ to End After Season 3",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/Unknown_21e554.jpeg?w=668&h=376&crop=1"
      ],
      "datePublished": "2026-02-26T03:55:54.000Z",
      "dateModified": "2026-02-26T03:55:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘A CNN & Variety Town Hall Event: Timothée Chalamet and Matthew McConaughey’ Reaches 8.35 Million People on All Platforms",
    "url": "https://variety.com/2026/film/news/town-hall-timothee-chalamet-matthew-mcconaughey-ratings-1236673155/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Timothee-Chalamet-and-Matthew-McConaughey-Variety-Conversation-5.jpg?crop=0px%2C32px%2C1920px%2C1080px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-02-26T01:31:36.000Z",
    "description": "\n\t“A CNN & Variety Town Hall Event: Timothée Chalamet and Matthew McConaughey” reached 8.35 million worldwide on all platforms. Some 5.13 million peop",
    "body": "\n\t“A CNN & Variety Town Hall Event: Timothée Chalamet and Matthew McConaughey” reached 8.35 million worldwide on all platforms. Some 5.13 million people in the United States interacted with content from the exclusive interview, while the remaining 3.22 million were international.\n\n\tOn CNN, the interview — which aired on Feb. 21 at. 7 p.m. ET/PT — drew 453,000 viewers, with 57,000 in the key 25-to-54 demographic, according to Nielsen. The full conversation was also available on CNN’s streaming platform and Variety‘s YouTube page.\n\t\n\n\tClips from the “Town Hall” were a major driver of social media traffic, reaching 46.29 million views across all of Variety‘s platforms. Instagram and Facebook lead with 20.35 million, followed by TikTok at 14.54 million and X at 11.4 million.\n\n\n\tThe Saturday night broadcast, filmed in front of an audience of University of Texas at Austin students, saw the reunion of Chalamet and McConaughey, who played son and father in 2014’s “Interstellar.” During the roughly 90-minute sitdown, the pair discussed memories from Christopher Nolan’s sci-fi epic, Chalamet’s Oscar-contending performance in “Marty Supreme” and took questions from the audience.\n\n\tDuring their chat, Chalamet told McConaughey that “Interstellar” was his “favorite project” he’s ever been a part of, adding that he thought McConaughey’s Cooper was “his most fantastic role.” \n\n\t“I know you were coming off ‘Dallas Buyers Club,’ but that movie, to me, was the origin point in seeing how you carried yourself on set, how seriously you and Christopher Nolan took the work,” Chalamet said. “It gave me a license. Coming out of high school, it’s hard to take yourself super seriously. You can feel like you’re wasting time or stuck-up or something. And I remember you had a yoga mat, and you’d be working out and sleeping on set. It was all very strange to me. But it was super inspiring. I just can’t thank you enough for being warm to me at that time, when you had no reason to be warm to me. Christopher as well. It just changed my life, man.”\n\t\n\n\tMcConaughey graciously responded, “Thanks for that, man. You were pretty easy to be warm to. I remember you had what I felt like was a feverish curiosity at that time. You were figuring some stuff out, but it seemed obvious to me that no matter what you were dealing with, you were going to make your way. And I believe you were in some sort of limbo. You were choosing — something about music, and somebody was putting pressure about, ‘Maybe go this way,’ and you wanted to go this way.”\n\n\tWatch “A CNN & Variety Town Hall Event: Timothée Chalamet and Matthew McConaughey” below.\n\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘A CNN & Variety Town Hall Event: Timothée Chalamet and Matthew McConaughey’ Reaches 8.35 Million People on All Platforms",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Timothee-Chalamet-and-Matthew-McConaughey-Variety-Conversation-5.jpg?crop=0px%2C32px%2C1920px%2C1080px&resize=1000%2C563"
      ],
      "datePublished": "2026-02-26T01:31:36.000Z",
      "dateModified": "2026-02-26T01:31:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ann Godoff, Penguin Press Founder and Editor, Dies at 76",
    "url": "https://variety.com/2026/biz/news/ann-godoff-dead-penguin-press-1236673154/",
    "image": "https://variety.com/wp-content/uploads/2026/02/IMG_2517.jpeg?crop=60px%2C251px%2C702px%2C392px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-02-26T01:24:07.000Z",
    "description": "\n\tAnn Godoff, an editor and publisher for Penguin Press, died on Feb. 24 in Albany, N.Y. She was 76.\n\n\tGodoff died from complications of bone cancer i",
    "body": "\n\tAnn Godoff, an editor and publisher for Penguin Press, died on Feb. 24 in Albany, N.Y. She was 76.\n\n\tGodoff died from complications of bone cancer in a hospital, her partner, Annik LaFarge confirmed to the New York Times.\n\n\tGodoff spent more than three decades as the head of Random House, nurturing the careers of numerous novelists and nonfiction writers. Her more celebrated authors include Salman Rushdie, Zadie Smith, Ron Chernow, E.L. Doctorow, Henry Louis Gates Jr., Thomas Pynchon, Tom Brokaw, William Styron and Alice Waters. \n\t\n\n\tAt Random House, Godoff was named executive editor in 1991 and rose to editor-in-chief and publisher of its trade publishing group before being fired in a corporate restructuring in 2003. Eight days later, Godoff founded the American hardcover imprint, Penguin Press, where she served as editor in chief and publisher.\n\n\n\tSome of Godoff’s latest projects include Gisèle Pelicot’s memoir “A Hymn to Life,” California Governor Gavin Newsom’s memoir “Young Man in a Hurry,” and Michael Pollan’s “A World Appears: A Journey Into Consciousness.”\n\n\tGodoff was born in Manhattan and enrolled at Bennington College in Vermont, but later transferred to New York University, where she graduated with a Bachelor of Fine Arts degree in film.\n\n\tGodoff also previously worked for Simon & Schuster from 1980 to 1986, until the Atlantic Monthly Press hired her to be its editor-in-chief. She joined Random House in 1991, becoming its executive editor, a post she held until 1996, and then president and editor-in-chief until 2003.\n\t\n\n\tGodoff was previously married to Malcolm Drummond from 1973 to 2012. The same year, she married LaFarge, who is an editor, author and photographer. In addition to her partner, Godoff is survived by her brother, Peter. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ann Godoff, Penguin Press Founder and Editor, Dies at 76",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/IMG_2517.jpeg?crop=60px%2C251px%2C702px%2C392px&resize=1000%2C563"
      ],
      "datePublished": "2026-02-26T01:24:07.000Z",
      "dateModified": "2026-02-26T01:24:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Protestors Gather at ‘Scream 7’ Premiere After Melissa Barrera Fired: ‘Stand For Free Speech’ and ‘Cancel Paramount+’",
    "url": "https://variety.com/2026/film/news/protest-scream-7-premiere-melissa-barrera-paramount-1236673201/",
    "image": "https://variety.com/wp-content/uploads/2023/11/GettyImages-1471762058.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-26T03:20:01.000Z",
    "description": "\n\tProtestors gathered outside of Wednesday night’s “Scream 7” premiere at the Paramount Studios lot in Los Angeles, calling for a boycott of the horro",
    "body": "\n\tProtestors gathered outside of Wednesday night’s “Scream 7” premiere at the Paramount Studios lot in Los Angeles, calling for a boycott of the horror film in a show of support for Palestine. \n\n\tAbout 25 demonstrators were seen positioned around the lot with flags, drums and bullhorns. They were heard chanting phrases like “Paramount, Paramount, what do you say?” and “Palestine will live forever!”\n\n\n\n\n\t\n\n\t\n\n\n\n\tWhile speaking on the red carpet, “Scream 7” director Kevin Williamson shared his thoughts on the protest. \n\t\n\n\t“We live in a world where a lot of bad things are happening out there, and I think a lot of people want to be heard and they want to have their voice heard about the bad stuff that’s happening,” Williamson told Variety. “My heart goes out to them. I don’t know if canceling Paramount+ is the way to do it. But I think people should listen to their inner self and do what feels good for them.”\n\n\n\tThe outrage likely stems from the firing of the former series star Melissa Barrera. In the wake of Hamas’ Oct. 7, 2023 attack and Israel’s subsequent retaliation, Barrera took to Instagram to share her views on the conflict. She was largely critical of Israel, and she accused the nation of “genocide and ethnic cleansing.” She also shared a post from Jewish Currents Magazine about distorting “the Holocaust to boost the Israeli arms industry.” Shortly after, “Scream” producer Spyglass Media Group exclusively revealed to Variety that it had dropped the “In the Heights” actress from the franchise because of the posts.\n\n\n\n\t\n\n\t\n\n\n\n\t“Spyglass’ stance is unequivocally clear: We have zero tolerance for antisemitism or the incitement of hate in any form, including false references to genocide, ethnic cleansing, Holocaust distortion or anything that flagrantly crosses the line into hate speech,” a Spyglass spokesperson told Variety at the time.\n\t\n\n\tCo-star Jenna Ortega, citing scheduling conflicts, exited “Scream 7” shortly after, along with original director Christopher Landon, who said he received death threats over Barrera’s firing. The script had to be rewritten, and Neve Campbell’s original heroine, Sidney Prescott, was inserted as the lead. Williamson, who wrote the first “Scream” movie, took over as director. \n\n\t“Scream 7,” which premieres on Friday, follows Campbell’s Sidney Prescott as she relocates to Woodsboro for a quiet life with her daughter, only to have Ghostface return to burn it all down. Campbell stars alongside fellow original cast members Courteney Cox, David Arquette and Matthew Lillard, as well as Isabel May, Jasmin Savoy Brown, Mason Gooding, Anna Camp, Joel McHale and Mckenna Grace.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Protestors Gather at ‘Scream 7’ Premiere After Melissa Barrera Fired: ‘Stand For Free Speech’ and ‘Cancel Paramount+’",
      "image": [
        "https://variety.com/wp-content/uploads/2023/11/GettyImages-1471762058.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-26T03:20:01.000Z",
      "dateModified": "2026-02-26T03:20:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Scrubs’ Stars and Producers on Who’s Back, Which Couples Survived and Why the Goofiness Was Toned Down — For Now",
    "url": "https://variety.com/2026/tv/news/scrubs-return-whos-back-which-couples-survived-changes-1236673175/",
    "image": "https://variety.com/wp-content/uploads/2026/02/180080_815_v3.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-26T02:00:00.000Z",
    "description": "\n\tSPOILER ALERT: This article contains spoilers for the Season 1 (or Season 10? Season 9?) premiere of “Scrubs” (2026), which premiered Wednesday nigh",
    "body": "\n\tSPOILER ALERT: This article contains spoilers for the Season 1 (or Season 10? Season 9?) premiere of “Scrubs” (2026), which premiered Wednesday night on ABC.\n\n\tWhen the cast and producers of hit early 2000s comedy “Scrubs” reunited for a panel at the ATX TV festival in 2022, the question naturally turned to a series revival. Most of the cast loved the idea — but figured it was a non-starter. “It can’t be a full season of a show,” said star Donald Faison (Turk), who suggested a TV movie instead. “Everyone is doing things.”\n\t\n\n\tBut creator Bill Lawrence — who’s pretty busy at the moment (“Shrinking,” “Rooster,” “Bad Monkey”) — nonetheless was eager to get the gang back together again. “I just thought it would happen,” he says. “People often go, ‘why would you reboot this?’ If you enjoyed spending time with and working with people you know, I would think you would be crazy to not take a shot. Even if the worst thing that happens is that you get to spend some time again with people you love. We had reached points in our lives that we weren’t getting to spend as much time with each other — because everybody’s successful and doing their own thing — that everybody would ultimately be receptive to giving another spin and seeing if we had fun again.”\n\n\n\tStar Zach Braff (J.D.) noted that the “Scrubs” rewatch podcast that he and Faison hosted over the pandemic, “Fake Doctors, Real Friends,” helped garner interest in a revival. And then there are those T-Mobile ads, where Braff and Faison play themselves — but remind viewers of their “Scrubs” characters’ chemistry. “I think that kicked it into even a higher gear,” he says. “I think that that’s when Bill started actually trying to figure out how to make it work.”\n\t\n\n\tBecause Lawrence is obligated to produce his other shows — and he’s under contract at Warner Bros. TV, whereas “Scrubs” is produced by Disney — he tapped “Scrubs” alum Assem Batra to showrun the revival. “I feel this show in my soul,” she says. “The balance of heart and funny. Bill gave me a lot of leeway of what will this be. It feels like we’ve been talking about it for years, so it’s exciting that it’s finally happening.”\n\n\tNow that the “Scrubs” revival has officially premiered on ABC (next day on Hulu), here are some things to know about the show’s return:\n\t\n\t\tThe new “Scrubs” opens with a bit of an homage to “The Pitt” before revealing it’s all a J.D. fantasy, and he’s really working as a successful, but bored, concierge doctor.\t\n\n\t“I’ll tell you right now, my favorite medical show on TV is ‘The Pitt,’” Lawrence says. “I’ll put Scrubs as a close second, but I’m obsessed, and it kind of represents that world of what it means to be dropped into a place that you know, on some level, just by the very simple act of being there. It’s because you want to be of service and do things that matter for the world. Man, that’s the kind of a storytelling arena that always hooks me.”\n\t\n\t\tBut as J.D. visits Sacred Heart, he realizes he misses the calling of being in the middle of the action. And so when Dr. Cox (John C. McGinley) offers him the job to replace him as chief of medicine, he accepts.\t\n\n\tSays Braff: “That’s in him, that passion, and that’s when Cox says, ‘what are you doing?’ He has the attitude of, ‘I trained you to be far more than what you’re doing, and you’re better than just being a concierge doctor. You should come back and make a difference.’ I think that really lands with JD, especially when he sees what a difference he can make. In that two days he spends at the hospital, he gets a little glimpse of what it’s like to be a teacher, to share your knowledge. It just kind of comes back into his system. Like, ‘I miss this. This is a lot harder, and the money might not be as good, but I want to make a difference again.”\n\n\tThe decision by Dr. Cox to retire was also out of necessity — McGinley was busy shooting Lawrence’s new HBO Max series “Rooster.” But that Dr. Cox/J.D. relationship is still front and center in the first episode. “We always kept that dynamic where Cox did not let him in, and he’s letting him in a little bit more now,” Aseem says. \n\t\n\t\n\t\tAs “Scrubs” returns after 15 years, its characters are now the veteran doctors teaching a whole new generation of “newbies.”\t\n\n\tNew cast members include Joel Kim Booster as Dr. Eric Park, J.D.’s new rival (and someone who was expecting to replace Dr. Cox in charge) and Vanessa Bayer as hospital HR director Sibby. Ava Bunn, Jacob Dudman, David Gridley, Layla Mohammadi and Amanda Morrow play the new generation of interns.\n\n\t“It’s 21 minutes and 30 seconds, and you almost feel like you’re doing two shows,” Batra says. “You’re doing a show with our legacy cast, and you’re doing a show with the new cast. So it is tricky, but we hope there’s enough for old fans and new fans to hook into this.”\n\t\n\t\tAmong the themes for the returning “Scrubs” characters: What it’s like to be getting older.\t\n\n\t“In healthcare, you’re dealing with humanity so much every day, and part of humanity is aging and getting older, and what that means emotionally and spiritually and physically,” Batra says. “It’s almost organic to see our cast go through these issues in a hospital setting. We’re actually talking head on about, ‘what does it feel to get older?’ And we have an episode of that coming up.\n\t\n\t\tFans quickly learn that J.D. and Elliot (Sarah Chalke) have divorced.\t\n\n\t“The Elliot/J.D. relationship was always tricky, because people root for them so much,” Batra says. “But if you go back and look at their dynamic in the first season, it was a hot mess. There was something we felt we could get out of them not being together that would be more complex and layered than if everything had worked out. It felt like Turk and Carla were always the core, the solid couple. We were actually excited to do this, because even being split for Elliot and J.D. didn’t mean they don’t love each other. And being able to have that arc for them of how do they come back together, even if it’s not romantically, we don’t know. But seeing them rebuild something together is also gives us so much to do.”\n\n\tSays Chalke: “Elliot and J.D. figuring out who they’re going to be to each other in this new iteration, that was really, I thought, such a smart way in. I thought it just leaves so much room for story lines and for conflict and interest. It’s such a unique experience to get to come back and play a character that you spent eight years doing. It’s unique to get to do it once, but then to get to do it again, feels really lucky.”\n\t\n\t\n\t\tBatra and Braff, who directed the pilot, say they wanted to keep the return of “Scrubs” more grounded vs. the flights of fancy the show was famous for later in its run.\t\n\n\t“I think what we both understood and agreed on was we had to keep it tonally grounded,” Batra says. “We couldn’t start at the ‘Scrubs’ 10 at goofiness. We had to give people a way in, to hook in emotionally. We know it’s going to get pushed more toward the comedy, but we really wanted to connect with our audience, and so we have grounded it more in that for now.”\n\n\tSays Braff: “Outside of the fantasies, we really wanted to ground the show back to where it was in Season 1 of the original show. We got broader and broader over the years, and it almost became cartoonish at points. And we want to be real. When I was directing, I  would catch myself and the other cast and go, ‘that’s kind of a heightened version of that. How would you really say it in the real world?’ And I just kept trying to ground it.”\n\t\n\t\tThat’s not to say there isn’t some fan service. Eccentric surgeon Hooch (Phill Lewis) — seemingly fired in Season 8 — is back, as is bro doctor The Todd (Robert Maschio).\t\n\n\t“The Todd was a tricky one, because we’re like, ‘well, the Todd in this day and age, it’s so problematic,’” Batra says. “So for the spin on the Todd, he thinks he understands what’s going on, and he’s kind of like, ‘you get consent.’ So he’s not a bad guy. He’s just a dated guy, and he’s trying very hard to understand the rules, but probably getting them wrong. So that’s how we decided to address Todd in this day and age.”\n\n\tAlso making return appearances: Judy Reyes as Carla, Christa Miller as Jordan and Neil Flynn as The Janitor. “It is difficult to thread that needle of giving the fans everything they want, even just with availability and being able to introduce a new cast, versus putting emphasis on older cast,” Batra says. “After the pilot, we got eight episodes, which I think also determined what we can do. Hopefully in success and a Season 2, we’ll be able to bring back a lot more fan favorites and address some of the things. Sam Lloyd [who played Sacred Heart lawyer Ted] passed away, and we wanted to do a memorial to him. Something like that may come up next season, because we really feel his absence in the show.”\n\t\n\t\n\t\tAnd yes, Turk and J.D. revive their “eagle” lift in the season opener — but soon realize that their bodies aren’t cut out for it anymore.\t\n\n\t“We just didn’t want it to be a greatest hits nostalgia session,” Braff says. “Although we do have characters that people like, and of course, we do our probably first and last ‘eagle’ at 50 years old in the pilot, I think mostly it’s like, we want to introduce a new audience that doesn’t know ‘Scrubs’ to this world and have it be the case that you could just start the show anew without having known anything about ‘Scrubs.’ In that case, it’s about a doctor who returns to work at a hospital after being gone for many years.”\n\t\n\t\tABC is branding this as “Scrubs” Season 1, even if it’s technically Season 10. But Lawrence prefers to call it Season 9.\t\n\n\t“I would say that this is the ninth season of Scrubs, and it just takes place 20 years later,” Lawrence says. That’s because the previous final season of “Scrubs” was actually a bit of a different show, as attention turned to new characters played by Eliza Coupe, Kerry Bishé, Michael Mosley and Dave Franco.\n\n\t“The ninth season of ‘Scrubs’ wasn’t supposed to be ‘Scrubs,’” Lawrence notes. “It was called ‘Scrubs Med,’ and it was supposed to be a fun spin off. And as a spin off, I don’t regret it at all. I think a lot of those actors and actresses, Mike Mosley and Eliza Coupe and Kerry Bouche, Dave Franco, they were doing really funny, cool stuff. And if it would have been interesting to see where it went. But for me, the show ‘Scrubs’ ended the eighth year, and this is kind of picking it up 20 years later.”\n\n\tAdds Braff: “In terms of going back to the Bill Lawrence vision of ‘Scrubs,’ it’s Seasons 1 through 8. And if you look at eight the way it ends, when all those images are projected on that sheet, that’s just what J.D. hopes will happen. That’s what he daydreams will happen. It’s not saying necessarily that any of those things actually occurred.”\n\t\n\t\tThat means some of what happened in Season 9 is no longer canon, and the new “Scrubs” instead picks up after the events of Season 8.\t\n\n\t “It doesn’t mean that we don’t respect Season 9, but we feel like that was more of the spin off thing,” says Batra. “So we really decided, let’s follow after Season 8. We knew we would annoy some people with that, people who are hardcore about all that, but we decided that just felt right to us tonally and everything else.\n\t\n\n\tAdds Faison: “For all my nerds out there, just look at Season 9 as a ‘what if.’”\n\t\n\t\tThe cast and producers are on board to keep the “Scrubs” revival going.\t\n\n\t“We definitely want to keep going and tell more ‘Scrubs’ stories,” Braff says. “This is sort of like an audition, if you will, to see if people like it. And I think if people like it, I know that we and ABC would like to do more.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Scrubs’ Stars and Producers on Who’s Back, Which Couples Survived and Why the Goofiness Was Toned Down — For Now",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/180080_815_v3.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-26T02:00:00.000Z",
      "dateModified": "2026-02-26T02:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Sinners’ Cast and Teyana Taylor Win on Night 3 of NAACP Image Awards’ Virtual Pre-Show; Malcolm-Jamal Warner Gets Posthumous Award",
    "url": "https://variety.com/2026/awards/news/naacp-image-awards-winners-list-1236670835/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Malcolm-Jamal-Warner-Sinners-Teyana-Taylor.jpg?crop=0px%2C27px%2C2160px%2C1215px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-02-26T01:30:00.000Z",
    "description": "\n\tRyan Coogler’s “Sinners” was the big winner on the final night of the 57th NAACP Image Awards virtual ceremonies.\n\n\tThe blockbuster movie — which le",
    "body": "\n\tRyan Coogler’s “Sinners” was the big winner on the final night of the 57th NAACP Image Awards virtual ceremonies.\n\n\tThe blockbuster movie — which led the Image Award nominations with a dominant 18 nods, including outstanding motion picture — won three categories: stunt ensemble, cinematography (Autumn Durald Arkapaw) and ensemble cast (Michael B. Jordan, Hailee Steinfeld, Miles Caton, Jack O’Connell, Wunmi Mosaku, Jayme Lawson, Omar Miller, Buddy Guy, Delroy Lindo, Peter Dreimanis, Lola Kirke, Li Jun Li, Saul Williams and Yao). Coogler and Jordan’s previous collaborations, “Black Panther” and its sequel “Wakanda Forever,” also won the ensemble prize on the way to massive trophy hauls at their respective Image Awards telecasts.\n\t\n\n\tWednesday night’s virtual ceremony, hosted by Angel “ThatChickAngel” Laketa Moore and Khleo Thomas, focused on the non-televised film, television, and writing award categories. Teyana Taylor — who is nominated for six Image Awards, including one for her role in “One Battle After Another” — picked up the prize for outstanding supporting actress in a TV movie, limited series or dramatic special for her work in “Tyler Perry’s Straw.” Her co-star in the Netflix thriller, Glynn Turman, won the supporting actor award.\n\n\n\tThe late Malcolm-Jamal Warner won the prize for outstanding guest performance for his part in the Fox series “Murder in a Small Town.” It was the second Image Award win for the actor, who died last year at 54.\n\n\tWith the virtual ceremonies complete, the Image Awards week rolls along to its final destination, the 57th Image Awards telecast, hosted by Deon Cole, on Saturday, Feb. 28. The show will be broadcast live from the Pasadena Civic Auditorium at 8 p.m. ET/PT on BET, CBS and across Paramount networks.\n\t\n\n\tDeon Cole returns to host the show, broadcast from the Pasadena Civic Auditorium. While “Sinners” topped the film categories, the recently-wrapped Peacock series “Bel-Air” led the TV categories with seven nominations. The nominees for Entertainer of the Year, the show’s signature category, include Cynthia Erivo, Doechii, Kendrick Lamar, Michael B. Jordan and Teyana Taylor.\n\n\tSpecial honorees for this year’s NAACP Image Awards week include Viola Davis, who will be presented with the Chairman’s Award; Colman Domingo, the President’s Award honoree; Salt-N-Pepa and DJ Spinderella who will be inducted into the Image Awards Hall of Fame; A$AP Rocky, to be presented with the Vanguard Award for fashion; and Rev. Dr. Jamal-Harrison Bryant, who will receive the prestigious Mildred Bond Roxborough Social Justice Impact Award. \n\n\n\n\n\tThe full list of winners from night three can be found below:\n\t\n\t\tOutstanding Children’s Program\t\n\n\t“Gracie’s Corner” (YouTube TV)\n\t\n\t\tOutstanding Animated Series\t\n\n\t“Gracie’s Corner” (YouTube TV)\n\t\n\t\tOutstanding Character Voice-Over Performance (Television)\t\n\n\tKyla Pratt – “The Proud Family: Louder and Prouder” (Disney+)\n\t\n\t\tOutstanding Character Voice-Over Performance (Motion Picture)\t\n\n\tQuinta Brunson – “Zootopia 2” (Walt Disney Studios Motion Pictures)\n\t\n\t\tOutstanding Stunt Ensemble (Television or Motion Picture)\t\n\n\t“Sinners” – Andy Gill (Warner Bros. Pictures)\n\t\n\t\tOutstanding Independent Motion Picture\t\n\n\t“Love, Brooklyn” (Greenwich Entertainment)\n\t\n\t\tOutstanding International Motion Picture\t\n\n\t“Souleymane’s Story” (Kino Lorber)\n\t\n\t\tOutstanding Documentary (Film)\t\n\n\t“Being Eddie” (Netflix)\n\t\n\t\tOutstanding Cinematography in a Motion Picture\t\n\n\tAutumn Durald Arkapaw – “Sinners” (Warner Bros. Pictures)\n\t\n\t\tOutstanding Editing in a Motion Picture or Television Series, Movie, or Special\t\n\n\tDeanna Nowell – “Ironheart” (Disney+)\n\t\n\t\tOutstanding Breakthrough Creative (Motion Picture)\t\n\n\tCassandra Mann – “Unexpected Christmas” (3 Diamonds Entertainment LLC)\n\t\n\t\tOutstanding Ensemble Cast in a Motion Picture\t\n\n\tMichael B. Jordan, Hailee Steinfeld, Miles Caton, Jack O’Connell, Wunmi Mosaku, Jayme Lawson, Omar Miller, Buddy Guy, Delroy Lindo, Peter Dreimanis, Lola Kirke, Li Jun Li, Saul Williams, Yao – “Sinners” (Warner Bros. Pictures)\n\t\n\t\n\t\tOutstanding Variety (Series or Special)\t\n\n\t“Ali Siddiq: My Two Sons” (YouTube/Moment PPV)\n\t\n\t\tOutstanding Guest Performance\t\n\n\tMalcolm-Jamal Warner – “Murder in a Small Town” (FOX)\n\t\n\t\tOutstanding Writing in a Comedy Series\t\n\n\tAisha Muharrar – “Hacks” – “Clickable Face” (HBO Max)\n\t\n\t\tOutstanding Writing in a Drama Series\t\n\n\tCynthia Adarkwa – “The Pitt” -“12:00 P.M.” (HBO Max)\n\t\n\t\tOutstanding Writing in a Television Movie or Special\t\n\n\tAireka Muse – “Friends & Lovers” (Lifetime Movie Network)\n\t\n\t\tOutstanding Directing in a Comedy Series\t\n\n\tTyler James Williams – “Abbott Elementary” – “The Science Fair” (ABC)\n\t\n\t\tOutstanding Directing in a Drama Series\t\n\n\tMario Van Peebles – “Power Book III: Raising Kanan” – “Allow Me to Re-Introduce Myself” (STARZ)\n\t\n\t\tOutstanding Directing in a Television Movie or Special\t\n\n\tOlatunde Osunsanmi – “Star Trek: Section 31” (Paramount+)\n\t\n\t\tOutstanding Breakthrough Creative (Television)\t\n\n\tChinaka Hodge – “Ironheart” (Disney+)\n\t\n\t\tOutstanding Supporting Actress in a Television Movie, Limited–Series or Dramatic Special\t\n\n\tTeyana Taylor – “Straw” (Netflix)\n\t\n\t\tOutstanding Supporting Actor in a Television Movie, Limited–Series or Dramatic Special\t\n\n\tGlynn Turman – “Straw” (Netflix)\n\t\n\t\tOutstanding Host in a Reality/Reality Competition, Game Show or Variety (Series or Special) – Individual or Ensemble\t\n\n\tSteve Harvey – “Celebrity Family Feud” (ABC)\n\t\n\t\tOutstanding Reality Program, Reality Competition or Game Show (Series)\t\n\n\t“Celebrity Family Feud” (ABC)\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tGetty Images\n\t\n\n\n\t\n\t\tTuesday, February 24\t\n\n\tCardi B, Don Lemon and SZA joined Michelle Obama and Kendrick Lamar as NAACP Image Award winners on night two of the virtual pre-show.\n\n\tCardi B won three Image Awards on Tuesday night, including outstanding female artist and outstanding album for her latest record “Am I the Drama?” Her track “ErrTime” won the prize for outstanding hip-hop/rap song. Before this year’s ceremony, Cardi B had won just one Image Award, for serving as judge and executive producer of “Rhythm & Flow.”\n\n\tVeteran journalist Don Lemon won two trophies for his eponymous talk show, “The Don Lemon Show”; Lemon’s news and talk series and Obama’s podcast “IMO,” which the former first lady co-hosts with her brother Craig Robinson, won four of the five awards presented for that medium.\n\t\n\n\tLamar, who was also a big winner on the first night of the three-part virtual ceremony, added two more prizes on night two. The rapper was named outstanding male artist and shared the music video/visual album award with SZA for their Grammy-winning hit “Luther.”\n\n\tCoogler’s “Sinners” won its first awards out of its 18 nominations, collecting the prizes for outstanding soundtrack and original score. \n\n\tWatch the virtual pre-show in the video here. The full list of winners from night two can be found below:\n\n\n\n\t\n\t\tOutstanding Music Video/Visual Album\t\n\n\t“luther” – Kendrick Lamar & SZA (pgLang under exclusive license to Interscope Records)\n\t\n\t\tOutstanding New Artist\t\n\n\tMonaleo – “Who Did the Body?” (Columbia Records)\n\t\n\t\tOutstanding Female Artist\t\n\n\tCardi B (Atlantic Records)\n\t\n\t\tOutstanding Male Artist\t\n\n\tKendrick Lamar (pgLang under exclusive license to Interscope Records)\n\t\n\t\tOutstanding Hip-Hop/Rap Song\t\n\n\t“ErrTime” – Cardi B (Atlantic Records)\n\t\n\t\tOutstanding Soundtrack/Compilation Album\t\n\n\t“Sinners (Original Motion Picture Soundtrack)” (Proximity Media LLC, under exclusive license to Masterworks, a label of Sony Music Entertainment)\n\t\n\t\tOutstanding International Song\t\n\n\t“Is It” – Tyla (Epic Records)\n\t\n\t\tOutstanding Jazz Album\t\n\n\t“We Insist! 2025” – Terri Lyne Carrington & Christie Dashiell (Candid Records)\n\t\n\t\tOutstanding Gospel/Christian Song\t\n\n\t“Do it Again” – Kirk Franklin (Fo Yo Soul Recordings/Tribl Records)\n\t\n\t\tOutstanding Gospel/Christian Album\t\n\n\t“Tasha” – Tasha Cobbs Leonard (Motown Gospel)\n\t\n\t\tOutstanding Duo, Group or Collaboration (Traditional)\t\n\n\t803Fresh feat. Fantasia – “Boots on the Ground Remix” (Snake Eyez Music Group/Artist Partner Group)\n\t\n\t\tOutstanding Duo, Group or Collaboration (Contemporary)\t\n\n\tChris Brown feat. Bryson Tiller & Usher – “It Depends (Remix)” (RCA Records/Chris Brown Entertainment)\n\t\n\t\tOutstanding Original Score for TV/Film\t\n\n\t“Sinners (Original Motion Picture Score)” (Proximity Media LLC, under exclusive license to Sony Classical, a label of Sony Music Entertainment)\n\t\n\t\tOutstanding Album\t\n\n\t“Am I The Drama?” – Cardi B (Atlantic Records)\n\t\n\t\tOutstanding Podcast – Scripted/Limited Series/Short Form\t\n\n\t“Interesting Things with JC” (Jim Connors LLC)\n\t\n\t\n\t\tOutstanding Podcast – News and Information\t\n\n\t“The Don Lemon Show” (Lemon Media Network)\n\t\n\t\tOutstanding Podcast – Lifestyle/Self-Help\t\n\n\t“IMO with Michelle Obama and Craig Robinson” (Higher Ground)\n\t\n\t\tOutstanding Podcast – Arts, Sports and Entertainment\t\n\n\t“IMO with Michelle Obama and Craig Robinson” (Higher Ground)\n\t\n\t\tOutstanding Podcast – Society and Culture\t\n\n\t“The Don Lemon Show” (Lemon Media Network)\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tGetty Images\n\t\n\n\n\t\n\t\tMonday, February 23\t\n\n\tThe 57th NAACP Image Awards week kicked off Monday with former first lady Michelle Obama and rapper Kendrick Lamar winning two of the early prizes. \n\n\tObama’s latest book, “The Look” — which explored her style evolution from her time in the White House to life afterwards — won the award for outstanding literary work biography/autobiography. Meanwhile, Lamar’s electrifying Super Bowl halftime performance was named outstanding short-form series or special – reality/nonfiction/documentary. Both Obama and Lamar are repeat winners at the Image Awards: she won in the same category in 2019 for her memoir “Becoming,” while he has nine trophies from the NAACP, including two for his 2025 anthem “Not Like Us.”\n\n\tThe awards were announced during the first edition of a three-night virtual event, where winners will be revealed in the majority of the Image Awards’ more than 90 categories (across film, television and streaming, music, literature and podcasts). The pre-show ceremony, hosted by Angel “ThatChickAngel” Laketa Moore and Khleo Thomas, aired exclusively on YouTube and NAACP+ and focused primarily on the literary categories, as well as two digital content creator prizes. For the first time, the NAACP Image Awards got into gaming, with Berlin Edmond Jr., aka Berleezy, winning the top prize.\n\n\n\n\n\tWatch the virtual pre-show ceremony in the video above. The full list of winners from night one can be found here:\n\t\n\t\tOutstanding Literary Work – Biography/Autobiography\t\n\n\t“The Look” – Michelle Obama (Crown)\n\t\n\t\tOutstanding Literary Work – Non-Fiction\t\n\n\t“A More Perfect Party: The Night Shirley Chisholm & Diahann Carroll Reshaped Politics” – Juanita Tolliver (Legacy Lit/Hachette Book Group)\n\t\n\t\tOutstanding Literary Work – Instructional\t\n\n\t“Who Better Than You?” – Will Packer (Penguin Random House)\n\t\n\t\n\t\tOutstanding Literary Work – Journalism\t\n\n\t“On Borrowed Time” – Anissa Durham (Online)\n\t\n\t\tOutstanding Literary Work – Debut Author\t\n\n\tCharles B. Fancher – “Red Clay” (Blackstone Publishing)\n\t\n\t\tOutstanding Literary Work – Fiction\t\n\n\t“Death of the Author” – Nnedi Okorafor (William Morrow)\n\t\n\t\tOutstanding Literary Work – Poetry\t\n\n\t“The Intentions of Thunder: New and Selected Poems” – Patricia Smith (Scribner)\n\t\n\t\tOutstanding Literary Work – Children\t\n\n\t“Yvonne Clark and Her Engineering Spark” – Allen R. Wells; Illustrated by DeAndra Hodge (Farrar Straus Giroux Books for Young Readers/Macmillan)\n\t\n\t\tOutstanding Literary Work – Youth/Teens\t\n\n\t“Nic Blake and the Remarkables: The Book of Anansi” – Angie Thomas (HarperCollins/Clarion Books)\n\t\n\t\tOutstanding Literary Work – Graphic Novel\t\n\n\t“Parable of the Talents: A Graphic Novel Adaptation” – Octavia E. Butler, adapted by Damien Duffy, illustrated by John Jennings and David Brame (Abrams ComicArts)\n\t\n\t\tOutstanding Short-Form Series or Special – Reality/Nonfiction/Documentary\t\n\n\t“The Apple Music Super Bowl LIX Halftime Show Starring Kendrick Lamar” (FOX)\n\t\n\t\tOutstanding Digital Content Creator – Gaming/Tech\t\n\n\tBerlin Edmond Jr. (@Berleezy)\n\t\n\t\tOutstanding Digital Content Creator – Fitness/Wellness/Food\t\n\n\tKeith Lee (@keith_lee125)\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Sinners’ Cast and Teyana Taylor Win on Night 3 of NAACP Image Awards’ Virtual Pre-Show; Malcolm-Jamal Warner Gets Posthumous Award",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Malcolm-Jamal-Warner-Sinners-Teyana-Taylor.jpg?crop=0px%2C27px%2C2160px%2C1215px&resize=1000%2C563"
      ],
      "datePublished": "2026-02-26T01:30:00.000Z",
      "dateModified": "2026-02-26T01:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nike Unveils 'USA Gold' and Jack Hughes Merch to Celebrate Historic Olympic Hockey Win",
    "url": "https://variety.com/2026/shopping/athletes/nike-usa-olympic-hockey-jack-hughes-merch-shirt-hoodie-shop-1236673000/",
    "image": "https://variety.com/wp-content/uploads/2026/02/team-usa-jack-hughes-nike-merch.png?w=900&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-25T23:09:10.000Z",
    "description": "\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.\n\n\tThe U.S. ",
    "body": "\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.\n\n\tThe U.S. men’s national hockey team made headlines over the weekend when it defeated Canada 2-1 in the gold medal final at the Winter Olympics, and now, Nike has dropped a new line of merch to commemorate the occasion.\n\n\tThe U.S. men’s win marked the first Olympic gold medal for an American hockey team since the now-legendary “Miracle on Ice” victory by the U.S. over their Soviet opponents in the 1980 Winter Olympics. That win of course, went on to inspire the 2004 film, “Miracle,” starring Kurt Russell.\n\n\n\tNow, Nike has dropped a limited-edition line of apparel to celebrate the new Olympic champs, including New Jersey Devils forward Jack Hughes, who scored the overtime-winning goal over the Canadians in Milan.\n\n\t\t\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\t\t\n\n\t\t\t\t\t\t\t\t\t\tNEW RELEASE\t\t\t\t\t\t\n\n\t\t\t\t\tUSA Hockey Nike 2026 Winter Olympics Gold Medal Roster Club Fleece Hoodie \t\t\n\n\t\t\n\t\n\n\tThe collection includes this officially-licensed hoodie features a “USA Gold” emblem on the front along with the USA Hockey shield and Nike logo. The back of the hoodie features the names and numbers of all the players on the men’s Olympic team.\n\n\tThe hoodie is Made in the USA from a cozy cotton blend with a regular fit. Choose from sizes small to 2XL.\n\n\t\t\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\t\t\n\n\t\t\t\t\t\t\t\t\t\tNEW T-SHIRT\t\t\t\t\t\t\n\n\t\t\t\t\tUSA Hockey Nike 2026 Winter Olympics Gold Medal Core T-Shirt \t\t\n\n\t\t\n\t\n\n\tGet the same gold medal-winning graphic on this unisex T-shirt, which is also Made in the USA from a 100% cotton material. The T-shirt also comes in navy, though unlike the hoodie, the back does not feature the roster names. Choose from sizes small to 2XL.\n\n\t\t\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\t\t\n\n\t\t\t\t\t\t\t\t\t\tWOMEN’S HOCKEY PICK\t\t\t\t\t\t\n\n\t\t\t\t\tUSA Hockey Nike Unisex 2026 Winter Olympics Gold Medal Fleece Hoodie\t\t\n\n\t\t\n\t\n\n\tOf course, the U.S. women’s hockey team also took home gold in Milan and Nike has released this white hoodie commemorating their win. The gold graphics on the front of the hoodie also include the “USA Gold” tagline only with the words “Women’s Olympic Champions” instead of “men’s.” You can get the same design in a white T-shirt here.\n\n\n\tNike says the pieces “honor the U.S. Hockey team’s historic win,” with new graphics “printed across the chest so you’ll never forget their triumphant efforts. Secure this celebratory piece today and relive the glory of the U.S. Hockey team’s golden moment for years to come.”\n\n\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\t\t\n\n\t\t\t\t\t\t\t\t\t\tALSO CONSIDER\t\t\t\t\t\t\n\n\t\t\t\t\tUSA Hockey Outerstuff 2026 Winter Olympics Heart of Gold T-Shirt\t\t\n\n\t\t\n\t\n\n\tLooking for something a little different? Fanatics also has this unisex T-shirt from Outerstuff, which depicts the silhouette of a hockey player against the American flag. The Team USA Olympic logo also features prominently in the design.\n\n\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\t\t\n\n\t\t\t\t\t\t\t\t\t\tJACK HUGHES MERCH\t\t\t\t\t\t\n\n\t\t\t\t\tJack Hughes USA Hockey 2026 Name & Number T-Shirt\t\t\n\n\t\t\n\t\n\n\tAnd you can pick up an official Jack Hughes Team USA T-shirt, which celebrates the young hockey hero whose overtime goal lifted the the States to their first Olympic gold medal since Lake Placid. This one is an officially-licensed release from Nike.\n\n\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\t\t\n\n\t\t\t\t\t\t\t\t\t\tLIMITED QUANTITIES\t\t\t\t\t\t\n\n\t\t\t\t\tJack Hughes Team USA Autographed 2026 Winter Olympics Gold Medal Winner Photograph\t\t\n\n\t\n\t\tThis photo measures 8 x 10 inches in size and includes an individually numbered hologram that can be verified online to certify authenticity\t\n\t\t\n\t\n\n\tYou can find more USA Hockey gold medal merch including autographed pucks, posters and other collectibles at Fanatics.com. One thing that may be harder to find: official Team USA Nike hockey jerseys, which sold out online in the days following the Americans’ big Olympic win.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nike Unveils 'USA Gold' and Jack Hughes Merch to Celebrate Historic Olympic Hockey Win",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/team-usa-jack-hughes-nike-merch.png?w=900&h=563&crop=1"
      ],
      "datePublished": "2026-02-25T23:09:10.000Z",
      "dateModified": "2026-02-25T23:09:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘The Masked Singer’ Reveals the Identity of Snow Cone: Here Is the Celebrity Under the Costume",
    "url": "https://variety.com/2026/tv/news/the-masked-singer-season-14-episode-7-recap-snow-cone-1236673079/",
    "image": "https://variety.com/wp-content/uploads/2026/02/MS-14_1408-Show-TP_00966-e1772060228268.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-26T02:00:00.000Z",
    "description": "\n\tSPOILER ALERT: Details follow for Season 14, Episode 7  of “The Masked Singer,” “Spice Girls Night,” which aired Feb. 25 on Fox.\n\n\t “The Masked Sing",
    "body": "\n\tSPOILER ALERT: Details follow for Season 14, Episode 7  of “The Masked Singer,” “Spice Girls Night,” which aired Feb. 25 on Fox.\n\n\t “The Masked Singer” headed to the hills for this week’s episode, as Heidi Montag was the latest celebrity to be unmasked on Season 14 of the Fox singing reality competition.\n\n\tAmong the panelists, Jenny McCarthy-Wahlberg got it right with Montag. Guest panelist Taraji P. Henson went with Anna Faris. Ken Jeong thought it was Mandy Moore. Rita Ora guessed Moore as well, and Robin Thicke went with Leighton Meester.\n\t\n\n\tIn her final appearance, Montag — as Snow Cone — alluded to the loss of her home with husband Spencer Pratt during last year’s fires in Pacific Palisades. “The Spice Girls took over the world with girl power and left a legacy for generations to come. That’s all we can every ask for, something to pass on. This is especially true for me and my husband. Together we built a home where our kids could grow up surrounded by love and laughter. And then without warning, everything changed. We lost everything. Photos, favorite toys, I mean, this is the home my kids came home to from the hospital. I get so emotional. Putting our lives back together has tested me in ways I could never imagine. But you know what I’m learning? Nothing good or bad lasts forever. But love is our legacy.”\n\n\n\tIn another clue package on the show, Montag alluded to her music career: “I poured everything I had into it. Even turned down a record deal with David Foster. But when I released it, nobody bought it. For years, I was devastated. But when I was at my lowest point, everyone rallied behind me. Fans started buying my music again. And this once again album became No. 1.”\n\t\n\n\tHere’s what she said on night 1 of this season: “I’m here to clear the air. I’ve been misunderstood. Look, from day one I knew I was destined for stardom. Sure, I was just modeling snow boots for a kids catalog. But I was the whole package. And then wham, I finally got my big break. I landed a role on one of TV’s hottest shows. Until one moment spoiled everything. I was kicked to the curb. You should have seen what the headlines said about me. All lies. Hollywood completely iced me out. And ever since then, I’ve been trying to shake that image… I’m not what you think. And I’m going to prove those people wrong.”\n\n\tOra opened the show by singing “Spice Up Your Life,” one of the Spice Girls’ classic tracks — along with the show’s remaining contestants. Guest panelist Taraji P. Henson — unmasked earlier this season as Scarab — also joined in, dressed as “Scarab Spice,” aka Scary Spice. McCarthy Wahlberg dressed as Baby Spice, Ora was Posh Spice, Thicke was Ginger Spice and Jeong was “Old Spice.”\n\n\tOn this week’s episode, the bottom two were Crane and Snow Cone. They battled by both performing their own versions of “Stop,” by Spice Girls. Crane was saved, leaving Snow Cone to be unmasked as Montag.\n\n\tWith Snow Cone gone, that leaves High Voltage, Pangolin, Eggplant, Galaxy Girl, Stingray, Cat Witch, Pugcasso and Crane left in the competition.\n\n\tHeidi Montag (Snow Cone) joins Billy Ray Cyrus (Owl), Teddi Mellencamp (Calla Lily), Claudia Oshry (Queen Corgi), Taraji P. Henson (Scarab), Tone Loc (Handyman), Tiffany Haddish (Le Who Who), Todd and Julie Chrisley (Croissants) and David “Big Papi” Ortiz (Googly Eyes) as the celebrities unmasked so far on “The Masked Singer” Season 14.\n\n\tBack for Season 14 are host Nick Cannon, alongside panelists McCarthy Wahlberg, Jeong, Ora and Thicke.\n\n\tNew this season is “America’s Insider,” in which singer, dancer and social media personality Kylie Cantrall will share behind-the-scenes hints and clues for viewers. The twist: Cantrall is in costume as Cat Witch, but will only unmask for viewers — so the audience knows who she is, but the panelists don’t.\n\n\t“The Masked Singer” Season 14 themed episodes include a tribute to “Star Trek,” the ‘90s comedy “Clueless,” the comic franchise “Teenage Mutant Ninja Turtles” and the blockbuster “Twilight Saga” films. Also Fox’s new “Fear Factor” reboot will feature host Johnny Knoxville in a “Fear Factor: House of Fear Night,” and an “Ozzfest Night” honors late rocker Ozzy Osbourne, including a special tribute by “Masked Singer” alum Kelly Osbourne (Season 2’s Ladybug) saluting her father’s musical influence.\n\t\n\n\tThe 18 Masked contestants in Season 14 include Eggplant, Pugcasso, Queen Corgi, the Croissants, Owl, 14 Karat Carrot, Snow Cone, Galaxy Girl, High Voltage, Googly Eyes, Scarab, Handyman, Crane, Le Who Who, Pangolin, Stingray, Cat Witch and Calla Lily.\n\n\tPer the show, the Season 14 contestants have sold a combined 94 million records, received 47 Teen Choice Award nominations, 12 Emmy nominations, two stars on the Hollywood Walk of Fame, one Tony Award win and one Academy Award nomination.\n\n\tHere were the performances on Wednesday’s episode.\n\n\n\n\t\n\n\t\t\t\t\tCrane, “The Masked Singer”\n\t\t\t\t\t\t\t\t\tTrae Patton\n\t\n\n\n\t\n\t\tCrane\t\n\n\tSong: “Say You’ll Be There,” by Spice Girls\n\n\tClue: Train. “Not every journey sparkles, but this one was pure gold for my soul.”\n\n\tPanel guesses: Keke Palmer, Ciara, Mya\n\n\tPrevious song: “It’s Not Right But It’s Okay,” by Whitney Houston\n\n\tPrevious panel guesses: Misty Copeland, Mya, Ashanti\n\n\tCrane voiceover: “I feel lucky to have an actual Spice Girl take me under her wing. Mel B. But, I’ve had an OG Spice in my corner since before I could even walk: My grandma. I remember being 5 and seeing her dressed as Tina Turner for Halloween. Legs out, strutting like a diva. I guess that’s where I got it from. She’s literally like my second mom. Sewing my costumes, making my evening gowns for pageants. Front row at every performance. I could hear her voice screaming the loudest: ‘That’s my baby! Do your thing, girl!’ And now to spice up her life a little bit, grandma! Your baby’s on your favorite show! I can’t wait for you to figure out it’s your baby under this mask all along.”\n\n\n\n\t\n\n\t\t\t\t\tSnow Cone, “The Masked Singer”\n\t\t\t\t\t\t\t\t\tTrae Patton\n\t\n\n\n\n\tSong: “Wannabe,” by Spice Girls\n\n\tClue: Wedding cake. “I’ve always embraced new beginning, especially after life’s toughest chapters. Resilience can be its own kind of healing..”\n\n\tPanel guesses: Anna Faris, Heidi Montag, Leighton Meester\n\n\tPrevious songs: “When I Grow Up,” by the Pussycat Dolls; “Stronger,” by Britney Spears\n\n\tPrevious panel guesses: Mischa Barton, Nicole Richie, Taylor Momsen, Avril Lavigne, Paris Hilton, Mandy Moore\n\n\tSnow Cone voiceover: “The Spice Girls took over the world with girl power and left a legacy for generations to come. That’s all we can every ask for, something to pass on. This is especially true for me and my husband. Together we built a home where our kids could grow up surrounded by love and laughter. And then without warning, everything changed. We lost everything. Photos, favorite toys, I mean, this is the home my kids came home to from the hospital. I get so emotional. Putting our lives back together has tested me in ways I could never imagine. But you know what I’m learning? Nothing good or bad lasts forever. But love is our legacy.”\n\t\n\n\n\n\t\n\n\t\t\t\t\tPugcasso, “The Masked Singer”\n\t\t\t\t\t\t\t\t\tTrae Patton\n\t\n\n\n\t\n\t\tPugcasso\t\n\n\tSong: “Too Much,” by Spice Girls\n\n\tClue: “Rejected.” “Some people told me I wasn’t good at music. Luckily they weren’t good at their job either, so it all worked out in the end.”\n\n\tPanel guesses: Pat Monahan of Train; Vance Joy; Charlie Puth\n\n\tPrevious songs: “Ordinary,” by Alex Warren; “Fake Plastic Trees,” by Radiohead\n\n\tPrevious panel guesses: Dan Reynolds, Darren Criss, Ryan Tedder, Jack Johnson, Rob Thomas\n\n\tPugcasso voiceover: “Spice Girls? Man they were lucky to have each other. Call me jealous spice, because there were many times where I was on my own, feeling mighty lonely. Like when I was in another country doing the biggest show of my life, surrounded by legends. Bruce Springsteen to my left, John Mayer to my right. And it was my turn to go on stage in front of hundreds of thousands of people. All by myself. And all I could think was… But the moment I stepped on stage, the entire stadium went wild. And sand along to every single word. Turns out I wasn’t alone. I had a hundred thousand voices joining mine.”\n\n\tPast “The Masked Singer” winners include T-Pain as Monster (Season 1), Wayne Brady as Fox (Season 2), Kandi Burruss as Night Angel (Season 3), LeAnn Rimes as Sun (Season 4), Nick Lachey as Piglet (Season 5), Jewel as Queen of Hearts (Season 6), Teyana Taylor as Firefly (Season 7), Amber Riley as Harp (Season 8), Bishop Briggs as Medusa (Season 9), Ne-Yo as Cow (Season 10), Vanessa Hudgens as Goldfish (Season 11), Boyz II Men as Buffalos (Season 12) and Gretchen Wilson as Pearl (Season 13).\n\n\t“The Masked Singer” comes from Fox Alternative Entertainment. Rosie Seitchik, Craig Plestis and Cannon are executive producers, while Seitchik serves as showrunner. The series is based on the South Korean format created by Mun Hwa Broadcasting Corp.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘The Masked Singer’ Reveals the Identity of Snow Cone: Here Is the Celebrity Under the Costume",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/MS-14_1408-Show-TP_00966-e1772060228268.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-26T02:00:00.000Z",
      "dateModified": "2026-02-26T02:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Hot Bods Over 50 ... Guess The Sexy Mama!",
    "url": "https://www.tmz.com/2026/02/25/hot-bods-over-50-guess-who/",
    "image": "https://imagez.tmz.com/image/4e/16by9/2026/02/25/4ea668e328d642418469a7654ba2d567_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-25T21:15:28.000Z",
    "description": "\n    \n                    \n                          Hot Bods Over 50 ...\n                          Guess The\n                          Sexy Mama!\n   ",
    "body": "\n    \n                    \n                          Hot Bods Over 50 ...\n                          Guess The\n                          Sexy Mama!\n                      \n      \n    \n      \n        \n              \n    \n    \n          We're halfway through the week, and this mama came to play -- delivering quite the stellar snack for your mid-week treat ... can you guess who this beauty queen is?\n      \n    \n          Back in '95, she won Miss New York USA and grabbed the title of Miss USA later that year ... Her baby-daddy is a famous drummer!\n      \n    \n          Hit the gallery for the reveal, and then test your Miss USA trivia ...\n      \n      \n      \n          \n            \n              \n                \n                Share on Facebook\n              \n            \n            \n              \n                \n                Share on X\n              \n            \n                          \n                \n                  \n                \n              \n                      \n        \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Shanna Moakler\n              \n                          \n                TV\n              \n                          \n                Hotties & Bodies\n              \n                          \n                Hot Bodies\n              \n                          \n                TV Stars\n              \n                          \n                Hot Shots\n              \n                      \n        \n          \n  ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Hot Bods Over 50 ... Guess The Sexy Mama!",
      "image": [
        "https://imagez.tmz.com/image/4e/16by9/2026/02/25/4ea668e328d642418469a7654ba2d567_xl.jpg"
      ],
      "datePublished": "2026-02-25T21:15:28.000Z",
      "dateModified": "2026-02-25T21:15:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Shannon Beador's Ex-Husband Facing Divorce Papers in Couple's 5th Filing",
    "url": "https://www.tmz.com/2026/02/25/david-beador-wife-files-for-divorce-again/",
    "image": "https://imagez.tmz.com/image/c3/16by9/2026/02/25/c388a5558d9b4e7c8f3d3f89063b7bd5_xl.png",
    "tag": "Entertainment",
    "date": "2026-02-25T22:08:57.000Z",
    "description": "\n    \n                    \n                          Shannon Beador's Ex-Husband\n                          David's Wife Files for Divorce ...\n        ",
    "body": "\n    \n                    \n                          Shannon Beador's Ex-Husband\n                          David's Wife Files for Divorce ...\n                          In Couple's 5th Attempt\n                      \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          \"The Real Housewives of Orange County\" alum Shannon Beador’s ex-husband David Beador is once again staring down divorce papers ... 'cause his current wife has filed -- and it's the fifth time between the two.\n      \n    \n          TMZ obtained the docs, showing Lesley Beador has officially pulled the plug on their marriage. She's asking for legal and physical custody of their 5-year-old daughter, Anna Love Beador ... but she does check the box for David to be granted visitation.\n      \n    \n          Lesley is also seeking spousal support ... and wants the court to block any spousal support award to David.\n      \n    \n          The couple apparently tied the knot in 2020, but their marriage has been a legal revolving door ever since. David first filed for divorce in September 2022 ... then again in May 2023. Lesley filed in September 2024 ... followed by David filing in June 2025. Every single time the cases were dismissed before the divorce could be finalized.\n      \n    \n          As for David’s history in the marriage department, this obviously isn’t his first headline-making split. He separated from Shannon in 2017 after 17 years of marriage, and their divorce was finalized two years later.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Shannon Beador\n              \n                          \n                Celebrity News\n              \n                          \n                Reality TV\n              \n                          \n                Celebrity Divorce\n              \n                          \n                Exclusive\n              \n                          \n                Fairly Legal\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Shannon Beador's Ex-Husband Facing Divorce Papers in Couple's 5th Filing",
      "image": [
        "https://imagez.tmz.com/image/c3/16by9/2026/02/25/c388a5558d9b4e7c8f3d3f89063b7bd5_xl.png"
      ],
      "datePublished": "2026-02-25T22:08:57.000Z",
      "dateModified": "2026-02-25T22:08:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'Real World: Portland' Star Averey Tressler's Dog Dies",
    "url": "https://www.tmz.com/2026/02/25/averey-tresslers-dog-daisy-dead/",
    "image": "https://imagez.tmz.com/image/fb/16by9/2026/02/25/fba21bc436334b9995808798529cff74_xl.png",
    "tag": "Entertainment",
    "date": "2026-02-25T23:36:45.000Z",
    "description": "\n    \n                    \n                          'Real World: Portland'\n                          Averey Tressler's Dog Daisy Dies ...\n           ",
    "body": "\n    \n                    \n                          'Real World: Portland'\n                          Averey Tressler's Dog Daisy Dies ...\n                          Made Multiple Appearances on Reality Show\n                      \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Averey Tressler -- a star of \"The Real World: Portland\" -- is dealing with a personal tragedy ... because her dog, Daisy, has passed away.\n      \n    \n          The reality star posted about her late pal Wednesday ... telling her more than 65K followers the pup passed away earlier this week.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Tressler asks for privacy ... but thanks fans for all the love they've shown her and Daisy over the years.\n      \n\n          Fans of 'RW:P' will remember the dog from 2013 ... who found herself in the center of some drama when Averey flipped out on housemate Nia Moore for making \"kissy\" noises at her pup -- claiming it entitles the dog.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Plus, at a different point, Daisy turned the house into her own personal toilet ... doing her business wherever she darn-well pleased.\n      \n    \n          RIP\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                TV\n              \n                          \n                Animals\n              \n                          \n                Reality TV\n              \n                          \n                Real World\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Real World: Portland' Star Averey Tressler's Dog Dies",
      "image": [
        "https://imagez.tmz.com/image/fb/16by9/2026/02/25/fba21bc436334b9995808798529cff74_xl.png"
      ],
      "datePublished": "2026-02-25T23:36:45.000Z",
      "dateModified": "2026-02-25T23:36:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bianca Censori Rocks Pink Hair With Skimpy Outfit",
    "url": "https://www.tmz.com/2026/02/25/bianca-censori-pink-hair/",
    "image": "https://imagez.tmz.com/image/a2/16by9/2026/02/26/a23524c781be4ba38d7ba86d38d37a5f_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-26T02:09:12.000Z",
    "description": "\n    \n                    \n                          Bianca Censori\n                          On Wednesdays I Wear Pink\n                      \n       ",
    "body": "\n    \n                    \n                          Bianca Censori\n                          On Wednesdays I Wear Pink\n                      \n                  \n                                                                        Published \n                              February 25, 2026\n                            6:09 PM PST\n                                                                            \n      \n    \n          Bianca Censori is strutting her stuff in a skimpy skirt and a top that shows off her breasts ... but it's what's above the shoulders that should be catching everyone's eye here.\n      \n    \n          Check out these photos of Kanye West's wife going out Wednesday in Los Angeles ... she's rocking pink hair!!!\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          The hair color is different, but everything else is the same old Bianca -- lots of boobs and lots of leg -- thanks to a silver mini skirt and a top that looks more like a bra than a traditional shirt.\n      \n\n          Bianca recently had long, dark hair when we saw her going to an L.A. medspa for Valentine's Day ... but now she's chopped her locks down to a pixie cut and dyed her hair pink.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          No word on what inspired Bianca to switch up her hairstyle ... but she was on her way to an art exhibit at the Roosevelt Hotel when photogs snapped her.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Bianca Censori\n              \n                          \n                Kanye West\n              \n                          \n                Celebrity News\n              \n                          \n                Beauty\n              \n                          \n                Fashion\n              \n                          \n                Models\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bianca Censori Rocks Pink Hair With Skimpy Outfit",
      "image": [
        "https://imagez.tmz.com/image/a2/16by9/2026/02/26/a23524c781be4ba38d7ba86d38d37a5f_xl.jpg"
      ],
      "datePublished": "2026-02-26T02:09:12.000Z",
      "dateModified": "2026-02-26T02:09:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Britney Spears Gets Down and Dirty in the Dining Room",
    "url": "https://www.tmz.com/2026/02/25/britney-spears-dancing-video-dining-room-nip-slip/",
    "image": "https://imagez.tmz.com/image/60/16by9/2026/02/25/60f960af00ef435f85a5887b6d9ec854_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-26T00:04:29.000Z",
    "description": "\n    \n                    \n                          Britney Spears\n                          I'm a Dining Room Slave 4 U\n                      \n     ",
    "body": "\n    \n                    \n                          Britney Spears\n                          I'm a Dining Room Slave 4 U\n                      \n                  \n                                                                        Published \n                              February 25, 2026\n                            4:04 PM PST\n                                                                            \n      \n    \n      \n        \n                    \n                  \n      \n                    Instagram / @britneyspears\n          \n    \n          Britney Spears is freeing the nipple, in the dining room no less ... and she's back with another revealing dancing video.\n      \n    \n          Check out this latest in a long line of Britney specials ... she's getting down and doing some dirty dancing in front of her dining room table.\n      \n    \n          Britney posted the footage on her Instagram, and there are even a few slips of the nipple ... but she is covering the goods with a ❤️ emoji.\n      \n\n      \n        \n              \n    \n    \n          This is par for the course from Britney ... it was just a few days ago that she showed the world her butt cheeks in a nude beach photo.\n      \n    \n          Britney's got 200 million reasons to dance ... as we first reported, she recently sold her rights to her music catalog to Primary Wave in a move our sources called a \"landmark deal,\" with estimates hovering around $200 million.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Britney Spears\n              \n                          \n                Social Media\n              \n                          \n                Music Business\n              \n                          \n                Viral\n              \n                          \n                Music\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Britney Spears Gets Down and Dirty in the Dining Room",
      "image": [
        "https://imagez.tmz.com/image/60/16by9/2026/02/25/60f960af00ef435f85a5887b6d9ec854_xl.jpg"
      ],
      "datePublished": "2026-02-26T00:04:29.000Z",
      "dateModified": "2026-02-26T00:04:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]