[
  {
    "title": "‘Phineas and Ferb,’ ‘Sesame Street,’ ‘100 Foot Wave’ Among Producers Guild Awards Nominees in Sports, Children’s and Short-Form",
    "url": "https://variety.com/2025/tv/news/producers-guild-awards-nominees-sports-childrens-short-form-1236607791/",
    "image": "https://variety.com/wp-content/uploads/2025/12/MixCollage-12-Dec-2025-01-51-PM-2099.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-12T20:00:00.000Z",
    "description": "\n\tThe Producers Guild of America is continuing to unveil nominations for its 37th annual PGA Awards — and on Friday, the org revealed nods in the spor",
    "body": "\n\tThe Producers Guild of America is continuing to unveil nominations for its 37th annual PGA Awards — and on Friday, the org revealed nods in the sports, children’s and short-form program categories. Among the nominees are last year’s winner for outstanding children’s program, “Sesame Street,” which is back to face off among this year’s contenders. \n\n\tOther nominees that are returning include “Formula 1: Drive to Survive” and “Hard Knocks” in the sports field; “SpongeBob SquarePants” in the children’s category; and “Hacks: Bit By Bit” and “Overtime with Bill Maher” in the short-form program field.\n\t\n\n\tThe 37th Annual Producers Guild Awards will announce winners at the PGA’s east and west coast celebrations of the nominees and producing teams in February; the PGA awards show takes place on February 28.\n\n\n\tPer the org, the annual PGA ceremony “celebrates the work of producing and recognizes standout achievements across film, television, and emerging media, highlighting the professionals whose decisions and oversight have made superlative contributions to the projects shaping the industry and culture at large.”\n\n\tFinal polls open for the sports, children’s and short-form categories on Monday, Jan. 5, and those polls end on Monday, Jan. 19 at 2 p.m. PT.\n\n\tNominees for the innovation award and documentary motion pictures were revealed on Dec. 9; producers set to be honored at this year’s ceremony include Amy Pascal (David O. Selznick Achievement Award), Mara Brock Akil (Norman Lear Achievement Award) and Jason Blum (Milestone Award). Next up, theatrical motion pictures, animated motion pictures, TV series/specials and televised/streamed motion pictures nominees will be announced on Friday, Jan. 9.\n\t\n\n\tHere are the 2026 Producers Guild Awards nominees in the sports, children’s, and short-form:\n\n\tOutstanding Sports Program“100 Foot Wave”“Big Dreams: The Little League World Series 2024”“Formula 1: Drive to Survive”“Hard Knocks: Training Camp with the Buffalo Bills”“Surf Girls: International”\n\n\tOutstanding Children’s Program“Lego Star Wars: Rebuild the Galaxy – Pieces of the Past”“Phineas and Ferb”“Sesame Street”“Snoopy Presents: A Summer Musical”“SpongeBob SquarePants”\n\n\tOutstanding Short-Form Program“Adolescence: The Making of Adolescence”“The Daily Show: Desi Lydic Foxsplains”“Hacks: Bit By Bit”“Overtime with Bill Maher”“The White Lotus: Unpacking the Episode”\n\n\tAwards in these categories are presented to the production as a whole, not to individual producers.\n\n\tThe 2026 Producers Guild Awards event chairs are Mike Farah and Joe Farrell; and the ceremony is produced by Anchor Street Collective. Branden Chapman is executive producer, and Carleen Cappelletti is co-executive producer. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Phineas and Ferb,’ ‘Sesame Street,’ ‘100 Foot Wave’ Among Producers Guild Awards Nominees in Sports, Children’s and Short-Form",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/MixCollage-12-Dec-2025-01-51-PM-2099.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-12T20:00:00.000Z",
      "dateModified": "2025-12-12T20:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "David Zaslav Could Become a Billionaire if Warner Bros. Sells to Either Netflix or Paramount",
    "url": "https://variety.com/2025/film/news/david-zaslav-billionaire-warner-bros-sale-deal-1236607737/",
    "image": "https://variety.com/wp-content/uploads/2025/12/David-Zaslav-1.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-12T20:02:58.000Z",
    "description": "\n\tDavid Zaslav, president and CEO of Warner Bros. Discovery, would be out of a job if a deal is completed with Netflix or Paramount Skydance. Softenin",
    "body": "\n\tDavid Zaslav, president and CEO of Warner Bros. Discovery, would be out of a job if a deal is completed with Netflix or Paramount Skydance. Softening the blow: Zaslav stands to get hundreds of millions of dollars in cash and/or stock if WBD completes a sale to either company, which would lift him to billionaire status.\n\n\tZaslav’s current stock holdings in Warner Bros. Discovery, along with future grants he is entitled to, would be worth around $660 million in the event the deal with Netflix goes through, CNBC reported. (Netflix and WBD anticipate the deal closing within 12-18 months.) All told, Zaslav would have a net worth topping $1 billion if Netflix wins the day, per Bloomberg. Note that those estimates are based on Netflix’s $27.75/share offer for only WB studios and HBO Max. Paramount’s hostile takeover bid of $30/share (which might go higher) would mean Zaslav’s payout will be even bigger if that deal prevails.\n\t\n\n\tWarner Bros. Discovery did not respond to a request for comment.\n\n\n\tZaslav, 65, has been the highest-paid media exec in recent years. In 2024, his pay package increased 4.4% to total compensation of $51.9 million, including a cash bonus of $23.9 million and $23.1 million in performance-based restricted stock grants — despite Warner Bros. Discovery posting an $11.5 billion loss for the year. In 2021, as CEO of Discovery Communications he received an astonishing $246.6 million compensation package (including stock options valued at $203 million at the time). In May 2021, Discovery had announced an agreement to buy WarnerMedia from AT&T, a deal that closed in April 2022.\n\t\n\n\tIn June 2025 — after a majority of shares voted by Warner Bros. Discovery stockholders were against the pay packages of Zaslav and other top execs, in a symbolic (non-binding) rebuke — the company entered into a new employment agreement with Zaslav that will “significantly reduce” his target annual compensation, “including lowering his annual cash compensation opportunity and reorienting the total pay mix toward long-term incentives,” according to WBD. \n\n\tHowever, that was in anticipation of Warner Bros. Discovery’s planned 2026 split into two entities: the Zaslav-led Warner Bros., comprising streaming and studios; and Discovery Global, mostly constituting WBD’s linear TV network operations. Last month, WBD amended the contracts of Zaslav and other top brass so that their stock options will remain valid and eligible for vesting in the event of a sale (of either the Warner Bros. stand-alone entity or WBD as a whole).\n\n\tNetflix’s megadeal to buy Warner Bros. studios, HBO and HBO Max, with an enterprise value of $82.7 billion, was announced on Dec. 5. Three days later, Paramount Skydance chief David Ellison — his ego bruised after Zaslav ghosted him over Paramount’s aggressive takeover offers — went hostile, saying he was taking his $30/share offer for all of WBD directly to shareholders. Paramount’s current offer has a $108.4 billion enterprise value.\n\n\tAs Variety reported this week, Zaslav has been telling friends and colleagues that he’s focused on helping to get the Netflix pact to the finish line and ensuring Warner Bros. and HBO Max are in the best financial shape when (or if) that deal closes.\n\n\tThe M&A battle for WBD is not even at halftime — and the price of a proposed deal could go up. Ellison, in his letter to WBD shareholders arguing that his offer is better than Netflix’s, noted that the $30/share proposal was not Paramount’s “best and final” offer. The question now is whether Ellison comes back with a higher bid, despite the fact that hostile takeovers for U.S. companies historically have been unsuccessful.\n\n\tIf Ellison does bump up his offer, would Netflix at that point counterbid? Maybe not: Netflix’s shares have taken a hit amid the WBD deal saga as investors worry about a highly leveraged takeover, so co-CEOs Ted Sarandos and Greg Peters might opt to tap out. Then again, it’s a once-in-a-generation chance to score some of Hollywood’s biggest properties.\n\t\n\n\tHowever it all turns out, Zaslav, for one, is poised to take home a big bag of money to his Beverly Hills mansion.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "David Zaslav Could Become a Billionaire if Warner Bros. Sells to Either Netflix or Paramount",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/David-Zaslav-1.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-12T20:02:58.000Z",
      "dateModified": "2025-12-12T20:02:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Neon Chief Marketing Officer Christian Parkes Exits Indie Studio (EXCLUSIVE)",
    "url": "https://variety.com/2025/film/news/neon-chief-marketing-officer-christian-parkes-exits-studio-1236607771/",
    "image": "https://variety.com/wp-content/uploads/2025/12/Christian-Parkes.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-12T18:52:54.000Z",
    "description": "\n\tNeon and its longtime marketing chief Christian Parkes are parting ways. \n\n\tParkes joined the indie studio behind “Parasite” and “Anora” in 2017, a ",
    "body": "\n\tNeon and its longtime marketing chief Christian Parkes are parting ways. \n\n\tParkes joined the indie studio behind “Parasite” and “Anora” in 2017, a year after it was founded. He made waves with the first campaign he did at Neon for “I, Tonya,” a film about Tonya Harding that earned an Oscar nomination for Margot Robbie and a prize for Allison Janney as Harding’s mother LaVona Golden. He also worked on the marketing for such notable Neon releases as “Anatomy of a Fall,” “Titane,” “Longlegs,” “The Seed of the Sacred Fig” and “Triangle of Sadness,” receiving plaudits for his innovations and outside-the-box initiatives. He most recently helped develop the promotional rollout for “Keeper,” an Osgood Perkins horror film that disappointed at the box office and suffered from poor reviews.\n\t\n\n\tThis year, Neon has released Oscar contenders such as Jafar Panahi’s “It Was Just an Accident,” Joachim Trier’s “Sentimental Value” and Kleber Mendonça Filho’s “The Secret Agent.” Neon has won two best picture Oscars, capturing the top prize for “Parasite” and “Anora,” and is known for its scrappy promotions and bets on auteur-driven productions. \n\n\n\tParkes submitted his resignation this week. The parting is said to be amicable. Neon is expected to announce a new chief marketing officer in the coming weeks. A spokesperson for the indie studio declined to comment on this article. \n\n\tBefore joining Neon, Parkes worked at Alamo Drafthouse Cinemas and Drafthouse Films. He started as chief brand officer before getting promoted to chief marketing officer for the theater chain and its distribution arm. He also worked at Nasty Gal, MySpace, Levi Strauss, Gatorade and Nike. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Neon Chief Marketing Officer Christian Parkes Exits Indie Studio (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/Christian-Parkes.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-12T18:52:54.000Z",
      "dateModified": "2025-12-12T18:52:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ed Sheeran and Blake Slatkin on Writing the Rock Anthem ‘Drive’ for ‘F1’ and Making It ‘Sound Like an Engine’",
    "url": "https://variety.com/2025/artisans/news/ed-sheeran-song-drive-f1-engine-1236607623/",
    "image": "https://variety.com/wp-content/uploads/2025/12/MCDFONE_WB060.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-12T18:39:27.000Z",
    "description": "\n\tEd Sheeran may be known for his slow, sultry songs, but that vibe didn’t fit Apple Original Film’s “F1.”\n\n\tWith Joseph Kosinski at the helm of the f",
    "body": "\n\tEd Sheeran may be known for his slow, sultry songs, but that vibe didn’t fit Apple Original Film’s “F1.”\n\n\tWith Joseph Kosinski at the helm of the film, “F1” is an adrenaline-fueled look at the world of Formula 1 racing. Brad Pitt’s Sonny Hayes is forced out of retirement to help his friend’s team APEX GP to a podium finish. So, a slow acoustic song wouldn’t work.\n\n\tBefore the opportunity to pen a song for the film even came along, Sheeran was a fan of the sport and could often be spotted in the paddocks, and, like many others, he’d seen Netflix’s “Drive to Survive.” But it was his producing partner Blake Slatkin who first got to see about 20 minutes of the film and immediately brought it up to him. Sheeran watched the footage with Jerry Bruckheimer, but the producer  wanted him to write a song for a specific scene that would be the film’s final sequence.\n\t\n\n\tAfter screening that footage, Slatkin called John Mayer, who is one of the songs producers and plays guitar on the track. Sheeran was inspired after he’d seen that footage and knowing the song would go over the final scene of the film. “I sent a voice note to Blake which was essentially the chorus mumbled,” Sheeran says. At the end he mumbled the word “drive” because “I wanted it to sound like an engine starting.”\n\n\n\tA rock anthem was the only way to go. Led Zepplin’s “Whole Lotta Love” opens the film, and that inspired Sheeran and Slatkin to create something with a big riff. “We wanted it to make it feel in the zone of very riffed-based ‘70s rock music.”\n\n\tAs for his vocals, Sheeran reveals hitting those registers in his voice and “making it more screamy” was not something he gets to use much. And it’s not for lack of trying.\n\t\n\n\tSlatkin says, “People don’t realize that Ed can rock like this. We had so many times when we were making music…but it never really fit the record.”\n\n\t“Drive” provided Sheeran to flex that registry. In writing the song for the dune buggy scene, the idea was that everything had to build up to the crescendo of the film. Sheeran knew it needed to be high intensity. “It needs to have this riff to start off with. The drums need to come in at this point. The chorus needs to come at this point. “\n\n\tOnce Sheeran and Slatkin had the framework of the song, including the mumbles and chorus, the rest was about “putting lyrics when the phonetics are there,” says Sheeran. “You’re singing vowels and words form themselves in those points. When you have bullet points of lines from the film, that will actually make up lyrics of the song, it’s quite easy to put song lyrics together.”\n\n\tCurrently on tour, Sheeran hasn’t added “Drive” to his set list. Writing the song came easily for him. He jokes, “It was a fucking ball ache to sing.”\n\n\tWatch the video below.\n\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ed Sheeran and Blake Slatkin on Writing the Rock Anthem ‘Drive’ for ‘F1’ and Making It ‘Sound Like an Engine’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/MCDFONE_WB060.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-12T18:39:27.000Z",
      "dateModified": "2025-12-12T18:39:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sydney Sweeney Says Her TikTok For You Page Is ‘Sadly a Lot of Hate About Me’; Her ‘Housemaid’ Co-Star Amanda Seyfried Says ‘F— TikTok!’",
    "url": "https://variety.com/2025/film/news/sydney-sweeney-tiktok-hate-amanda-seyfried-slams-app-1236607578/",
    "image": "https://variety.com/wp-content/uploads/2025/12/P103E1LU.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-12T18:45:43.000Z",
    "description": "\n\t“The Housemaid” co-stars Sydney Sweeney and Amanda Seyfried recently participated in Vanity Fair’s lie detector test video series, where Sweeney mad",
    "body": "\n\t“The Housemaid” co-stars Sydney Sweeney and Amanda Seyfried recently participated in Vanity Fair’s lie detector test video series, where Sweeney made an upsetting revelation by telling Seyfried that her TikTok For You Page is dominated with users posting hate content about her.\n\n\t“It depends what TikToK I’m on,” Sweeney said when Seyfried asked what her For You Page looks like on any given day. “If I’m on my private TikTok, my entire For You Page is history facts and arts and crafts. If I’m on my @syds_garage page, it’s sadly a lot of hate about me.”\n\t\n\n\t“Syd’s Garage? Your public TikTok?” Seyfried responded. “Well, fuck TikTok. Fuck TikTok!”\n\n\n\tSweeney has been combating online hate for much of her career. She made national headlines this year when her American Eagle jeans campaign sparked outrage, as some viewers accused the ads of glorifying the actor’s white heritage and thin physique. The campaign was centered on the tagline “Sydney Sweeney Has Great Jeans.” The pun around “great genes” is what caused the online controversy.\n\n\t“I was honestly surprised by the reaction,” Sweeney recently told People magazine. “I did it because I love the jeans and love the brand. I don’t support the views some people chose to connect to the campaign. Many have assigned motives and labels to me that just aren’t true.” \n\n\t“Anyone who knows me knows that I’m always trying to bring people together. I’m against hate and divisiveness,” Sweeney added. “In the past my stance has been to never respond to negative or positive press but recently I have come to realize that my silence regarding this issue has only widened the divide, not closed it. So I hope this new year brings more focus on what connects us instead of what divides us.”\n\t\n\n\t“The Housemaid” opens in theaters Dec. 19 from Lionsgate. Watch Sweeney and Seyfried’s full Vanity Fair lie detector test video below.\n\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sydney Sweeney Says Her TikTok For You Page Is ‘Sadly a Lot of Hate About Me’; Her ‘Housemaid’ Co-Star Amanda Seyfried Says ‘F— TikTok!’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/P103E1LU.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-12T18:45:43.000Z",
      "dateModified": "2025-12-12T18:45:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ashleigh Banfield to Exit NewsNation Primetime in Favor of Podcasting",
    "url": "https://variety.com/2025/tv/news/ashleigh-banfield-exit-newsnation-primetime-true-crime-podcast-1236607768/",
    "image": "https://variety.com/wp-content/uploads/2024/05/Ashleigh-Banfield-e1714667634217.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-12T18:36:56.000Z",
    "description": "\n\tAshleigh Banfield will exit NewsNation‘s primetime lineup in favor of focusing on her own true-crime podcast, the Nexstar-backed media outlet announ",
    "body": "\n\tAshleigh Banfield will exit NewsNation‘s primetime lineup in favor of focusing on her own true-crime podcast, the Nexstar-backed media outlet announced Friday. She will remain as a contributor to the network and also lead a true-crime digital vertical.\n\n\tUnder a new a new partnership, content from Banfield’s podcast,  “Drop Dead Serious with Ashleigh Banfield,” will be made available on NewsNation. Banfield has hosted an hour on NewsNation at 10 p.m. weekdays since 2021. Her last linear telecast will take place in January. The network will rely on a rotating series of anchors to fill the time period for the immediate future.\n\t\n\n\t“Ashleigh is truly one of the best at what she does — her storytelling and credibility make her the perfect partner as we build a digital destination for true crime fans while keeping her voice central to our on-air coverage,” said Michael Corn, president of programming and specials, in a statement.\n\n\n\tBanfield is the latest of NewsNation’s best-known personalities to test out new relationships with the outlet as the prospects of fortunes tied to personal digital projects beckon. Dan Abrams, one of the first major names to join the network’s lineup, left in early 2025 to put more energy into other businesses that he runs.\n\n\tThe network, which also features Chris Cuomo, Elizabeth Vargas and Leland Vittert in prominent evening hours, did not name an immediate replacement for Banfield. Her 10 p.m. program, “Banfield,” also puts a spotlight on prominent crime and justice stories in the headlines. \n\n\tNewsNation last renewed Banfield’s contract in 2024, noting that she “covers crime and the justice system better than anyone.”\n\t\n\n\t“I’m excited to channel the momentum of my ‘Drop Dead Serious’ podcast brand towards NewsNation’s growing digital audience,” said Banfield, in a statement. “The success of true crime reporting on streaming media platforms has been transformative, and I’m looking forward to helping shape and enhance NewsNation’s multi-platform strategy in this genre.”\n\n\tMore to come…\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ashleigh Banfield to Exit NewsNation Primetime in Favor of Podcasting",
      "image": [
        "https://variety.com/wp-content/uploads/2024/05/Ashleigh-Banfield-e1714667634217.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-12T18:36:56.000Z",
      "dateModified": "2025-12-12T18:36:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Taylor Swift Wore This Posture-Supporting Bra While Training for the 'Eras Tour'",
    "url": "https://variety.com/2025/shopping/news/taylor-swift-posture-supporting-bra-eras-tour-shop-online-1236607842/",
    "image": "https://variety.com/wp-content/uploads/2025/12/taylor-swift-posture-correcting-bra-buy-online.png?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-12T19:57:34.000Z",
    "description": "\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.\n\n\tIn Disney",
    "body": "\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.\n\n\tIn Disney+’s newly released “Eras Tour” docuseries, Taylor Swift offers fans an unusually granular look at the physical demands behind her record-shattering stadium run. While vocal warm-ups and endurance training are standard practice for pop stars, one unassuming piece of gear featured in the series also helped Swift get through three-plus hours onstage night after night: a posture-correcting bra from the brand Forme Science. \n\n\tUnlike a traditional sports bra designed primarily for compression or impact control, Forme Science’s Power Bra is built around posture alignment. The design uses layered, tension-mapped fabrics that gently pull the shoulders back and encourage engagement through the upper back and core, creating what the brand describes as “active biofeedback.” The goal isn’t restriction but awareness, helping the wearer maintain proper alignment throughout movement, whether they’re running choreography, lifting weights or standing for extended periods of time. It’s a subtle, wearable approach to posture correction, more akin to muscle training than a rigid brace.\n\t\n\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\n\tThere’s no mystery as to why the bra likely proved particularly helpful for Swift during her tour training. The “Eras Tour” required not just cardiovascular stamina, but sustained vocal and physical control across dozens of songs spanning multiple genres and eras. Good posture plays a crucial role in breath support, vocal projection and fatigue management — all essential for a performer carrying a stadium-scale production several nights a week.\n\n\tForme Science was founded in the late 2010s as a performance-driven activewear brand with a specific focus on posture, alignment and long-term musculoskeletal health. Rather than chasing trend-led athleisure, the company built its reputation around patented, FDA-registered posture-correcting technology designed to gently retrain the body through tension-mapped fabrics. The Power Bra, one of Forme Science’s earliest and most recognizable products, helped establish the brand’s core thesis: that posture correction could be integrated into clothing people actually want to wear, rather than bulky medical devices or braces.\n\t\n\n\tSince the launch of the Power Bra, Forme Science has expanded its lineup to include additional bras, tops and posture-support garments tailored to different activity levels and comfort preferences, including softer, more flexible versions designed for all-day wear. The brand has gained traction among dancers, trainers, physical therapists and wellness-minded consumers. While Forme Science has remained relatively low-key compared to mass athleisure labels, its recent endorsement by Swift is a sure sign that it may be finally entering the mainstream.\n\n\tShop the Forme Science’s Power Bra here, and their full lineup of offerings here.  \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Taylor Swift Wore This Posture-Supporting Bra While Training for the 'Eras Tour'",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/taylor-swift-posture-correcting-bra-buy-online.png?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-12T19:57:34.000Z",
      "dateModified": "2025-12-12T19:57:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Embeth Davidtz on Turning Down Todd Haynes’ ‘Safe,’ Making Her Directing Debut at 60 and Why She ‘Loathed’ Acting",
    "url": "https://variety.com/2025/film/awards/embeth-davidtz-directorial-debut-rejecting-todd-haynes-safe-1236604899/",
    "image": "https://variety.com/wp-content/uploads/2025/12/MCDDOLE_SP003.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-12T18:40:00.000Z",
    "description": "\n\tEmbeth Davidtz never set out to become a director.\n\n\tThe actress, long admired for her work in films such as “Schindler’s List,” “Junebug” and “Mati",
    "body": "\n\tEmbeth Davidtz never set out to become a director.\n\n\tThe actress, long admired for her work in films such as “Schindler’s List,” “Junebug” and “Matilda,” stumbled into filmmaking almost by accident — only to discover she loved it more than the career that made her famous.\n\n\t“Honestly, it ended up being my favorite part of it — directing,” Davidtz says. “I loathed acting in this, really.”\n\n\n\tHer directorial debut, “Don’t Let’s Go to the Dogs Tonight,” which was distributed by Sony Pictures Classics, is adapted from Alexandra Fuller’s memoir. It tells the story of a white family living in Rhodesia (now Zimbabwe) during the Bush War; offering a raw, tactile portrait of childhood shaped by instability, danger and inherited prejudice.\n\t\n\n\tDavidtz’s debut arrives in what may be the strongest year for actress-turned-directors in recent memory. Alongside films such as Kate Winslet’s “Goodbye June” and Kristen Stewart’s “The Chronology of Water,” “Don’t Let’s Go to the Dogs Tonight” positions her as a viable contender for the Directors Guild of America’s First-Time Feature Film Award.\n\n\tHowever, getting the movie made required Davidtz to do something she had never attempted: write the screenplay herself.\n\n\tAfter surviving breast cancer and feeling ready to return to work, she reread Fuller’s book and felt its urgency. “I couldn’t find a writer. No one understood it,” she recalls. “So I just sat down — writing, never written before — to teach myself. It was slow.” What followed were roughly 20 drafts over many years.\n\t\n\n\t“What I like about this is I can disappear and cobble something together again,” she says. “It makes me happy and doesn’t put me out in the fray.”\n\n\n\n\t\n\n\t\t\t\t\tLexi Venter, Embeth Davidtz, Rob van Vuuren in “Don’t Let’s Go to the Dogs Tonight”\n\t\t\t\t\t\t\t\t\t©Sony Pictures/Courtesy Everett Collection\n\t\n\n\n\n\tThe film is told through the eyes of young Bobo (Lexi Venter), whose observations cut through the adult world’s contradictions. Casting her proved to be Davidtz’s greatest challenge — and the key to unlocking the movie.\n\n\t“I hired a casting director and said, ‘Here’s my brief: non-actors, everyone who’s never acted before,’” she says. She wanted unvarnished authenticity, someone with “a wildness in her.”\n\n\tWhen she finally saw McGuire, she saw not just talent — but herself. “When I saw her face, that’s my face,” she says, showing a side-by-side comparison on her cellphone. “More also, this cinematic quality to that face.”\n\n\tBut McGuire struggled to memorize lines traditionally. “The minute I’d give her a scene to learn, we had a problem,” Davidtz says. Her solution was to shoot with two cameras running nearly nonstop, limit the child’s workday to three hours and craft the performance in the edit.\n\n\t“I didn’t have to find a little kid to play a leopard cub. I found a leopard cub,” she says. “And then I just filmed a leopard.”\n\n\tAmong the most fascinating revelations were the parts Davidtz passed on throughout her career.\n\n\tOne, in particular, stands out: Todd Haynes’ “Safe,” the role that became one of Julianne Moore’s defining performances.\n\n\t“I had just come off ‘Schindler’s.’ I’m going to be going into the same place, not looking,” she says, explaining why she turned it down. It is, she admits, a regret she carries.\n\n\t“I have to live with the regret. I said no to that, and that’s the road,” she says. “Because I ended up on a different road with this husband, these children, this life that I love. And I got to do this, which is closer to who I am.”\n\n\tShe passed on other projects too, including Christopher Hampton’s “The Secret Agent” — at her agent Brian Lourd’s urging — in order to take the Danny DeVito-directed “Matilda.” “He said, ‘You don’t fuck around. You are going to do ‘Matilda.’ This is a much more commercial film.’”\n\t\n\n\tLooking back, she concedes she didn’t know how to steer a Hollywood career. “I showed up going, I can now pick anything I wanted for the rest of my life,” she says. “And I didn’t know what I wanted.”\n\n\tDirecting has given Davidtz something she didn’t know she was missing. That was purpose.\n\n\t“I found something else that I loved,” she says. “Something about that old way, my feet didn’t fit into that shoe.”\n\n\tWriting, she admits, is lonely. Directing demands carrying “everything on my shoulders.” But it also fits her in a way acting never quite did. “At 60 years old, this feels like an enormous privilege to be able to do it.”\n\n\tHer transition echoes that of Carrie Fisher, an actress pigeonholed by iconic work who reinvented herself as a respected writer. Davidtz, too, is emerging as a filmmaker with a clear point of view.\n\n\tHer influences include Jane Campion, Sofia Coppola and Steven Spielberg, particularly for the way they frame children’s emotional worlds. And she’s already deep into her next project: adapting a short story she’s “almost done making a deal on,” while writing original material focused on “female stories, but with a bit of a twist.”\n\n\tThe actress who once navigated Hollywood with uncertainty has found her true creative home behind the camera — shaping stories only she can tell.\n\n\t“Writing is so lonely,” she admits. “But something about directing; it fits better.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Embeth Davidtz on Turning Down Todd Haynes’ ‘Safe,’ Making Her Directing Debut at 60 and Why She ‘Loathed’ Acting",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/MCDDOLE_SP003.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-12T18:40:00.000Z",
      "dateModified": "2025-12-12T18:40:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Amanda Seyfried on Becoming ‘Ann Lee,’ Urging Unity in America and Why ‘Mamma Mia 3’ Is ‘Burning a Hole Through the Table’",
    "url": "https://variety.com/2025/film/news/amanda-seyfried-testament-ann-lee-america-mamma-mia-3-1236604863/",
    "image": "https://variety.com/wp-content/uploads/2025/12/P103E2I6.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-12T19:12:25.000Z",
    "description": "\n\tAmanda Seyfried is grappling with the state of America.\n\n\t“Did we ever think this is where we would be as Americans?” she asks, her voice catching. ",
    "body": "\n\tAmanda Seyfried is grappling with the state of America.\n\n\t“Did we ever think this is where we would be as Americans?” she asks, her voice catching. “No. Because America felt like the best place to be.”\n\n\tIt’s a vulnerable moment during a conversation that spans the spectrum — including her towering performance in “The Testament of Ann Lee,” her famous Thanksgiving pie-baking tradition, and the unexpected ways a period film about a 18th-century religious leader speaks to our fractured present.\n\t\n\n\tBetween promotional appearances, Seyfried is homesick, missing her kids on her upstate New York farm while contemplating what Ann Lee’s utopian vision means in 2025.\n\n\n\t“Thank God we’re talking about Ann Lee so much, because there’s a direct relationship to what she created and what we’re lacking,” Seyfried says. “How about we all don’t have any kind of agendas? How about our agenda is take care of each other? Socialism is a gorgeous idea, and I know it doesn’t work perfectly, or that people understand what the word actually means. For me, it’s taking care of each other. If I have more money, I can spend more money on other people.”\n\n\tIn Mona Fastvold’s richly layered drama, Seyfried plays Ann Lee, the founder of the Shakers, a woman who lost four children and channeled her devastating grief into a religious movement built on communal living and equality. The film, which premiered at the Venice Film Festival before being acquired by Searchlight Pictures, is a genre-bending exploration of trauma, faith and the human capacity for survival. It’s also, surprisingly, funny — something Seyfried made sure to emphasize before a screening at the SCAD Film Festival. “I give you permission to laugh,” she told the audience, acknowledging the film’s dark humor and unexpected tonal shifts.\n\t\n\n\tThe parallels between Ann Lee’s 18th-century experiment in collective care and our current moment aren’t lost on Seyfried. She recalls the aftermath of 9/11, when she witnessed something that feels increasingly distant. “Everybody dropped everything for each other. People sacrificed their lives without a thought in the world,” she remembers. “And we shouldn’t have to have a meteor or a house-on-fire situation in order to drop everything for each other. That’s just what we are as human beings.”\n\n\tHer voice rises with frustration and hopes in equal measure: “We all want to be seen, we all want to be loved, we all want to be desired. We all want to win at things. We all love money. We all love our children. That’s right. Both sides, all sides. So, what is the greed? How does the greed help you? How does the defensiveness help you? How do our egos work against us?”\n\n\tWorking with Fastvold and her husband and co-writer, Brady Corbet — fresh off their Oscar nominations for “The Brutalist” — proved transformative. Seyfried had previously collaborated with the couple on “The Crowded Room,” and when Fastvold approached her with the script, the director was convinced she’d found her Ann.\n\n\t“She understood how I worked,” Seyfried says. “We are very similar in a lot of ways. We love getting as dark as humanly possible and as awkward as humanly possible, and she understands the awkwardness of humanity in a way that a lot of people don’t.”\n\n\n\n\t\n\n\t\t\t\t\tAmanda Seyfried and ensemble in “The Testament of Ann Lee” \n\t\t\t\t\t\t\t\t\tSearchlight Pictures\n\t\n\n\n\n\tPerhaps the most demanding aspect was the choreography. Working with Celia Rowlson-Hall, Seyfried spent more than a month “perpetually dancing through grief.” Every movement was rooted in Ann Lee’s spiritual and emotional state. “Every movement was designed to explore and to reflect an emotional state of this character who wants to become closer to God, who feels like she’s the second coming of Christ, who is on her knees in order to survive losing her four children.”\n\n\tThe film’s centerpiece, a sequence set to a hymn called “Hunger and Thirst,” showcases Seyfried at her most raw and visceral. “You become more human for sure when you’re dancing, and you become more human for sure when you’re singing, because your body takes on these physical tasks,” she reflects. “We are liberated because of it.”\n\t\n\n\tThe production was grueling, particularly the climactic burning-house sequence, shot in freezing conditions with four cameras rolling at once. Lewis Pullman literally suffered from hypothermia. Yet Seyfried speaks of the experience with something approaching reverence: “After we were done, we all just kind of got up and laughed, even though we were soaked and cold and bloodied. We knew we’d do it for the love of the game, but we also knew that we were all doing it together. And if that ain’t something, why we do it.”\n\n\tAs Oscar season continues — she’s earned recent nominations from the Critics Choice Awards and Golden Globes — Seyfried remains grounded, planning to spend the holidays baking her signature pies (pecan, pumpkin, apple and, this year, cherry). But there’s little question that “The Testament of Ann Lee” marks a career peak, a performance that pushes her into new territory while speaking unexpectedly to our fractured moment.\n\n\tOn this episode of the Variety Awards Circuit Podcast, Seyfried talks about juggling family life with awards season, the film’s visceral exploration of trauma and grief, and what she hopes comes next — including the long-awaited “Mamma Mia 3.”\n\n\tAlso on this episode, Elle Fanning, one of the stars of the Norwegian drama “Sentimental Value” as she discusses working on her next project with her sister, Dakota. Listen below!\n\n\n\n\t\n\n\t\t\t\t\tStacy Martin, Scott Handy, Viola Prettejohn, Lewis Pullman, Amanda Seyfried, Matthew Beard and Thomasin McKenzie in “The Testament of Ann Lee”\n\t\t\t\t\t\t\t\t\tSearchlight Pictures\n\t\n\n\n\n\tRead excerpts from her interview below, which has been edited and condensed for clarity.\n\t\n\t\tThe script for “The Testament of Ann Lee” is complex. What was your first reaction when you read it?\t\n\n\tWhen Mona brought me the script, I read it and I didn’t feel like I was smart enough to understand it. There were all these hymns that were written in that were kind of bookmarks for what we were going to end up putting in, because Daniel Blumberg had been working on this script with her for many years before we made it, and he’s the composer.\n\n\tThey had to really work together to figure out how the music was going to flow in and out of the dialogue and the movement, because there are so many layers in this movie, so many physical offerings. It was really hard to picture when I read it, but her passion and her understanding of what she wanted to say and her clarity of storytelling were all I really needed, because I knew that it was all going to come out in some form.\n\t\n\n\tThe more we talked about it, and the more I prepared, and the more I danced, and the more I worked on the Manchester accent, and the more I kind of lived in this idea of who this woman was, I just trusted her. It’s hard not to. She’s also very brave — that magical, mythical fairy that you don’t think exists is embodied by this Nordic woman.\n\t\n\t\tHow did the choreography in this film compare to something like “Mamma Mia?”\t\n\n\tIt’s very similar for me, in that it’s all very challenging. The faster the movements are, the faster the rhythm of the song, the harder it is, and the muscle memory is really important. To get muscle memory, you have to just repeat, repeat, repeat, and that’s sometimes very frustrating, very boring at times.\n\n\tI don’t move naturally in these ways at all. I would prefer ballet, honestly, which is maybe crazy to say, but I do. When you’re hearing ABBA, you want to move. Here, we’re hearing this music — this incredibly melodic, very abstract-at-times music that was kind of designed through the Shaker hymns. You feel like it lends itself to a certain type of movement as well, and more primal movement, for sure.\n\n\tCelia Rowlson-Hall, who did the choreography, the way she moves is otherworldly. The thing about the movement in Ann Lee is that every movement was designed to explore and to reflect an emotional state of this character who wants to become closer to God, who feels like she’s the second coming of Christ, who is on her knees in order to survive losing her four children.\n\n\tCelia and I both live upstate, so we met at this little, beautiful acting class/dance studio and just spent hours and hours and hours — weeks, probably over a month and a half — of just perpetual dancing through grief. You become more human for sure when you’re dancing, and you become more human for sure when you’re singing, because your body takes on these physical tasks. It’s melody and movement, and we are nothing without that.\n\t\n\t\tDo you believe Ann Lee was truly a prophet, or was something else happening to her?\t\n\n\tI’m not a religious person. No, I see it as that she didn’t eat and she was hallucinating — she was dying, and she hallucinated seeing Adam and Eve and seeing the devil. With that journey that she went on, she discovered new meaning, whatever that is.\n\t\n\n\tSome people do ayahuasca, some people just do therapy. There are all these ways of accessing parts of your brain that are so shut off just because we are human and we need to keep walking. It’s fascinating to me how most people who have this feverish passion and devotion are on some kind of drug.\n\n\tIt’s whatever we need to do to survive. And she didn’t just do that. She thrived, and she created a world or utopia for the greater good of her community. Her intentions were so pure, and she did so much with her grief. I believe that people will tell themselves what they need to tell themselves, or go and try to find parts of themselves that help them feel alive. We’re constantly trying to grab something.\n\t\n\t\tThe film explores trauma in such a visceral way. How did you think about that while preparing for the role?\t\n\n\tIt’s how cells regenerate, and we are forces to be reckoned with. The human body is absurdly complicated and almost more powerful than we give it credit for sometimes, especially when it comes to our psyches and trauma.\n\n\tWe create new pathways. That’s why it’s so important for kids to have people who love them and who hear them and understand them and guide them, because those pathways aren’t set in stone — they’re just developing.\n\n\tI think with trauma, you can be renewed in a way. You can be damaged. There’s so much that happens in grief that I don’t fully understand — thank God. I think we can’t survive unless we create new pathways, subconsciously and consciously, but the body is going to try to survive.\n\t\n\t\tWhat was it like working with Lewis Pullman?\t\n\n\tHe has no fear. He just goes. He’s beautiful, and you can see the depths of his soul. He brings himself completely to every scene, to every character. I love him.\n\n\tHe just really showed up for Mona. He really wanted to do it, and he had no ego. I don’t know where his ego went, but it’s not there, and it’s beautiful. It was immediate that I understood that our process in that way is the same — just to show up and to really love our characters and love what we do.\n\n\tI can’t imagine a better person to play my brother, because he understands the sibling relationship the same way I do. I want to nurture him. I want to protect him. He’s just a good, good guy.\n\t\n\t\n\t\tThe burning house sequence at the end looks incredibly difficult to shoot. What was that experience like?\t\n\n\tWhen the house is burning and Mary’s laying there with her eye out, and Lewis is truly suffering from hypothermia in real life, we had Matthew Beard — who’s one of the best actors of our generation, for sure — and all of us were just screaming for 10 minutes straight because we had four cameras going at the same time.\n\n\tIt was one of those moments where we could have all just really wanted to quit what we do because it was so hard and cold and we didn’t know what was happening. After we were done, we all just kind of got up and laughed, even though we were soaked and cold and bloodied.\n\n\tWe knew we’d do it for the love of the game, but we also knew that we were all doing it together — and if that ain’t something, why we do it?\n\t\n\t\tSo, we have to ask: “Mamma Mia 3?” Is it happening?\t\n\n\tI was talking to Rita Wilson last night. Someone had said earlier that night, “I just talked to Rita Wilson. She said ‘Mamma Mia 3’ is not off the table.” And I was like, “It’s burning a hole through the table.” She agreed with me.\n\n\tIt would be so silly if it didn’t happen. I mean, they keep making “Fast and the Furious.” We’ve already done “Mamma Mia” two. Meryl is available. Let’s do it. Just get me on an island with Christine Baranski. Just get me back there. She’s one of the goddesses of our time.\n\t\n\t\tThis feels like a career-defining performance. How do you look back on it?\t\n\n\tIt was a challenge, and I was totally there for it. I’m really proud of it. I’m super, super proud.\n\n\tI love acting, but getting the opportunity to sing and move — and I mean, not necessarily move, I don’t love it, but it’s necessary — getting to sing again in this medium with this kind of genre-bending, magical stuff is a role of a lifetime, for sure. I’m just so glad she chose me, because it’s another one of those opportunities that you can miss out on. And I’m in it.\n\n\tVariety’s “Awards Circuit” podcast, hosted by Clayton Davis, Jazz Tangcay, Emily Longeretta, Jenelle Riley and Michael Schneider, who also produces, is your one-stop source for lively conversations about the best in film and television. Each episode, “Awards Circuit” features interviews with top film and TV talent and creatives, discussions and debates about awards races and industry headlines, and much more. Subscribe via Apple Podcasts, Stitcher, Spotify or anywhere you download podcasts.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Amanda Seyfried on Becoming ‘Ann Lee,’ Urging Unity in America and Why ‘Mamma Mia 3’ Is ‘Burning a Hole Through the Table’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/P103E2I6.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-12T19:12:25.000Z",
      "dateModified": "2025-12-12T19:12:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "TV Academy Reveals Emmy Calendar for 2026 — Including Eligibility, Submission, Voting and Nomination Dates",
    "url": "https://variety.com/2025/tv/news/emmy-calendar-2026-voting-nomination-dates-tv-academy-1236607719/",
    "image": "https://variety.com/wp-content/uploads/2025/09/Noah-Wyle-Emmy-Win-2.jpg?crop=0px%2C50px%2C1200px%2C675px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-12-12T18:57:32.000Z",
    "description": "\n\tThe Television Academy has unveiled its 2026 Emmy Awards Calendar — which includes a new tweak to how some category nominations will be announced in",
    "body": "\n\tThe Television Academy has unveiled its 2026 Emmy Awards Calendar — which includes a new tweak to how some category nominations will be announced in the coming year. The bulk of nominations for the 78th Emmys will still be revealed on Wednesday, July 8. But there are 14 artisans categories that rely on peer group screening panels — and in 2026, those nominations won’t be announced until the following week, on Wednesday, July 15.\n\n\tMeanwhile, the TV Academy also said that it will announce several Emmy rules changes for the coming contest next week. (The full 78th Emmy Rules and Procedures will be posted at the end of January.)\n\t\n\n\tAs previously announced, the 78th Emmy Awards will air live on NBC (and streamed live on Peacock) from the Peacock Theater at L.A. Live in downtown Los Angeles on Monday, Sept. 14, at 8 p.m. ET/5 p.m. PT. This reps the final year of the four-network Emmy “wheel deal.”\n\n\n\tMeanwhile, the 2026 Creative Arts Emmy Awards will take place on Saturday, Sept. 5, and Sunday, Sept. 6. Those ceremonies will also be held at the Peacock Theater.\n\n\tHere’s the 78th Emmy Awards schedule:\n\n\tJune 1, 2025 – May 31, 2026: Eligibility period.\n\n\tThursday, Feb. 19: Open for submissions.\n\n\tTuesday, Apr. 7: Deadline to apply for membership to guarantee voting eligibility for both rounds of the 78th Emmy competition and to secure member entry-fee discount. Application(s) must be completed and paid for by this date.\n\n\tTuesday, Apr. 7: Deadline for current voting members to apply for hyphenate voting status.\n\n\tWednesday, May 6: Deadline for lapsed members to apply to reinstate their membership to guarantee voting eligibility for both rounds of the 78th Emmy competition and secure member entry-fee discount. Application(s) must be completed and paid for by this date.\n\t\n\n\tThursday, May 7: Entry deadline for programs that identify as Primetime programming by virtue of genre and were originally presented on a national platform June 1, 2025 – May 31, 2026.\n\n\tThursday, May 7: Upload deadline for all entry materials.\n\n\tThursday, June 11: Nomination-round voting begins.\n\n\tMonday, June 22, 10 p.m.: Nomination-round voting ends.\n\n\tJune 26 – July 7: Voting begins for peer group specific top 10 round panels.\n\n\tWednesday, July 8: Nominations announced.\n\n\tWednesday, July 15: Nominations announced for peer group specific top 10 round panels.\n\n\tWednesday, July 22: Deadline for errors and omissions to the nominations.\n\n\tWeek of Aug. 10: Final-round videos available for viewing.\n\n\tFriday, Aug. 14 – Sunday, Aug. 16: Televerse at the JW Marriott at L.A. Live\n\n\tMonday, Aug. 17: Final-round voting begins.\n\n\tWednesday, Aug. 26, 10 p.m.: Final-round voting ends.\n\n\tSaturday, Sept. 5, and Sunday, Sept. 6: Creative Arts Awards and Governors Gala.\n\n\tMonday, Sept. 14: NBC Telecast and Governors Gala.\n\n\tHere are the categories that rely on peer group screening panels for nominations:\n\n\tOutstanding Cinematography For A Series (Half-Hour)Outstanding Cinematography For A Series (One Hour)Outstanding Cinematography For A Limited Or Anthology Series Or MovieOutstanding Lighting Design/Lighting Direction For A SeriesOutstanding Lighting Design/Lighting Direction For A SpecialOutstanding Music Composition For A Series (Original Dramatic Score)Outstanding Music Composition For A Limited Or Anthology Series, Movie Or Special (Original Dramatic Score)Outstanding Music Composition For A Documentary Series Or Special (Original Dramatic Score)Outstanding Sound Editing For A Comedy Or Drama Series (One Hour)Outstanding Sound Editing For A Comedy Or Drama Series (Half-Hour)Outstanding Sound Editing For An Animated ProgramOutstanding Sound Editing For A Limited Or Anthology Series, Movie Or SpecialOutstanding Technical Direction and Camerawork For A SeriesOutstanding Technical Direction and Camerawork For A Special\n\n\tAnd here’s how it works: Nominations are determined first by voting of all submissions by the Peer Group. The top 10 to 15 highest vote-getters are sent to the Peer Group Screening Panel, which consists of eligible members who have volunteered to serve on the panel. Then, the Screening Panel will view and vote on all submissions to determine the nominations. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "TV Academy Reveals Emmy Calendar for 2026 — Including Eligibility, Submission, Voting and Nomination Dates",
      "image": [
        "https://variety.com/wp-content/uploads/2025/09/Noah-Wyle-Emmy-Win-2.jpg?crop=0px%2C50px%2C1200px%2C675px&resize=1000%2C563"
      ],
      "datePublished": "2025-12-12T18:57:32.000Z",
      "dateModified": "2025-12-12T18:57:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Emma Stone and Dave McCary Sell Their Austin Estate",
    "url": "https://www.tmz.com/2025/12/12/emma-stone-sells-austin-home/",
    "image": "https://imagez.tmz.com/image/af/16by9/2025/12/12/afd66a56e81944c884279f8858375991_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-12-12T19:37:11.000Z",
    "description": "\n    \n                    \n                          Emma Stone, Dave McCary\n                          Unload Austin Estate ...\n                      ",
    "body": "\n    \n                    \n                          Emma Stone, Dave McCary\n                          Unload Austin Estate ...\n                          Giddy Up!!!\n                      \n                  \n                                                                        Published \n                              December 12, 2025\n                            11:37 AM PST\n                                                                            \n      \n    \n          Emma Stone and Dave McCary can pop Champagne ... they've got reason to celebrate, because they just sold their fancy estate in Texas.\n      \n    \n          Our real estate sources tell us Emma and Dave unloaded their newly restored home in Austin, which they put on the market for $26.5 million.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          The couple purchased the home in 2021 and then gave it a facelift ... construction was completed this summer, and the place looks super lavish.\n      \n\n          There's a 5-bedroom main house, a 2-bedroom guest house, a garage with a screening room and entertaining space, and a pool.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          The location is elite ... it's in Tarrytown -- a super fancy enclave in West Austin chock full of prime real estate -- and the home is just a half mile from a boat ramp on Lake Austin.\n      \n    \n          Eric Moreland and Diane Humphreys from Moreland Properties/Forbes Global Properties held the listing. Laura Greissing also of Moreland Properties/Forbes Global Properties represented the buyer.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Emma Stone\n              \n                          \n                Celebrity News\n              \n                          \n                Movies\n              \n                          \n                Exclusive\n              \n                          \n                Celebrity Homes\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Emma Stone and Dave McCary Sell Their Austin Estate",
      "image": [
        "https://imagez.tmz.com/image/af/16by9/2025/12/12/afd66a56e81944c884279f8858375991_xl.jpg"
      ],
      "datePublished": "2025-12-12T19:37:11.000Z",
      "dateModified": "2025-12-12T19:37:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Guess the Sexy Singer Feeling Nippy in a Sheer Top!",
    "url": "https://www.tmz.com/2025/12/12/guess-who-singer-sheer-top/",
    "image": "https://imagez.tmz.com/image/64/16by9/2025/12/12/6463b10e369f4164ac82ccbcef6e62fd_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-12-12T19:24:07.000Z",
    "description": "\n    \n                    \n                          Guess The\n                          Sexy Singer Giving Us a 'Fever' In a Sheer Top, No Bra!!!\n   ",
    "body": "\n    \n                    \n                          Guess The\n                          Sexy Singer Giving Us a 'Fever' In a Sheer Top, No Bra!!!\n                      \n                  \n                                                                        Published \n                              December 12, 2025\n                            11:24 AM PST\n                                                                            \n      \n    \n      \n        \n              \n    \n    \n          This gorgeous singer-songwriter shared some \"Hotter than Hell\" snaps ... that, upon closer inspection, showed she was feeling quite nippy!\n      \n    \n          The Brit pop star has sold tens of millions of records globally, been nominated and won a bunch of awards -- including 3 Grammys! -- and also had a memorable cameo in the \"Barbie\" movie.\n      \n    \n          Still unsure? Hit up the gallery for the \"Blow Your Mind\" reveal!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Hot Bodies\n              \n                          \n                Guess Who\n              \n                          \n                Music\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Guess the Sexy Singer Feeling Nippy in a Sheer Top!",
      "image": [
        "https://imagez.tmz.com/image/64/16by9/2025/12/12/6463b10e369f4164ac82ccbcef6e62fd_xl.jpg"
      ],
      "datePublished": "2025-12-12T19:24:07.000Z",
      "dateModified": "2025-12-12T19:24:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Model & Plastic Surgery Enthusiast Mary Magdalene Dead",
    "url": "https://www.tmz.com/2025/12/12/mary-magdalene-denise-dead/",
    "image": "https://imagez.tmz.com/image/0f/16by9/2025/12/11/0fa37959975940f6a8273d72223bbfcb_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-12-12T19:10:55.000Z",
    "description": "\n    \n                    \n                          Model Mary Magdalene\n                          Found Dead Years After Accident Left Her With 'Uni",
    "body": "\n    \n                    \n                          Model Mary Magdalene\n                          Found Dead Years After Accident Left Her With 'Uni-Boob'\n                      \n                  \n                                                                        Published \n                              December 12, 2025\n                            11:10 AM PST\n                                                                      |\n                                                                Updated \n                                  December 12, 2025\n                                11:44 AM PST\n                                    \n      \n    \n      \n        \n              \n    \n    \n          Mary Magdalene -- the Canadian-Mexican Instagram model who got 38J breast implants -- has reportedly died.\n      \n    \n          According to Daily Mail, Mary -- whose real name was Denise Jarvis -- was in Thailand when she fell from the ninth floor of a high-rise apartment.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Friend Eden \"the Doll\" Estrada also posted about Mary's untimely passing.\n      \n    \n          Mary made headlines when one of her 11-pound breast implants exploded, leaving her with what some followers referred to as a \"uni-boob.\"\n      \n\n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          In a February 2023 interview with TMZ ... Mary shared that she started getting plastic surgeries when she was 18 years old and felt like the many procedures that followed represented her way of being an adrenaline junkie.\n      \n    \n          Mary said she was just like anyone who gets super into extreme sports ... but instead of climbing bigger mountains or jumping from higher heights, she went bigger and bigger with her injections.\n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          However, her breast implant accident inspired her to go for a more \"natural\" look.\n      \n    \n          Mary said she had a spiritual awakening after the incident and wanted to move away from what she called a \"bimbo\" look.\n      \n    \n          In March 2023, Mary spoke to us again, showing off her breast reduction, which set her back nearly $33,000 and brought her implants down to a C-cup.\n      \n    \n          RIP\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                RIP\n              \n                          \n                Beauty\n              \n                          \n                Plastic Surgery Journey\n              \n                          \n                Plastic Surgery\n              \n                          \n                Celebrity Death\n              \n                          \n                Influencers\n              \n                          \n                Culture\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Model & Plastic Surgery Enthusiast Mary Magdalene Dead",
      "image": [
        "https://imagez.tmz.com/image/0f/16by9/2025/12/11/0fa37959975940f6a8273d72223bbfcb_xl.jpg"
      ],
      "datePublished": "2025-12-12T19:10:55.000Z",
      "dateModified": "2025-12-12T19:10:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'Love Island USA' Stars Chelley Bissainthe & Ace Greene Break Up",
    "url": "https://www.tmz.com/2025/12/12/chelley-ace-love-island-breakup/",
    "image": "https://imagez.tmz.com/image/bb/16by9/2025/12/12/bbb52a7b96ea4185891c51d7a26f4cb8_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-12-12T17:35:01.000Z",
    "description": "\n    \n                    \n                          'Love Island USA'\n                          Chelley & Ace Are Heading to Separate Villas ...\n    ",
    "body": "\n    \n                    \n                          'Love Island USA'\n                          Chelley & Ace Are Heading to Separate Villas ...\n                          She Announces Breakup Live On-Air\n                      \n                  \n                                                                        Published \n                              December 12, 2025\n                            9:35 AM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Chelley Bissainthe and Ace Green's love couldn't survive off the island ... because the two reality television stars have broken up.\n      \n    \n          Chelley announced her split from her fellow \"Love Island USA\" Season 7 standout on Page Six Radio ... after the show hosts asked her several questions about how her relationship with Ace was progressing.\n      \n    \n          Check out the clip ... Chelley offers some non-committal answers at first -- telling the hosts they aren't moving in together, but adding Ace is doing well. However, the hosts seem to pick up on the awkwardness ... and they offer to move on before Chelley just straight-up tells them it's over between her and Ace.\n      \n\n          Chelley calls the decision to break up a tough one ... but adds sometimes loving someone means letting them go. She calls the breakup mutual, and she says there are certain details about their relationship she wants to keep to herself.\n      \n    \n          The couple's relationship was never for the public, Chelley makes clear ... they got together because they loved each other -- so, they weren't going to stay in it just because fans shipped the pair.\n      \n    \n          As for moving forward, Chelley says she wishes Ace the best ... and she's taking this time to grow.\n      \n    \n          Chelley and Ace coupled up from early on in Season 7 of the show ... which led to some ire among fans, because the two revealed on the first episode that they had actually met years before. Some accused the pair of simply getting together to try to win the show ... but the two always maintained they only had one meeting at a club way before production, were mutual friends on Instagram, and they weren't up to anything nefarious.\n      \n    \n          The two nearly made the finals ... but were eliminated on Day 30. Amaya Espinal and Bryan Arenales went on to win the show -- they have also since broken up.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Amaya Espinal\n              \n                          \n                Chelley Bissainthe\n              \n                          \n                Celebrity News\n              \n                          \n                Breakups\n              \n                          \n                Love Island\n              \n                          \n                Reality TV\n              \n                          \n                Relationships\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Love Island USA' Stars Chelley Bissainthe & Ace Greene Break Up",
      "image": [
        "https://imagez.tmz.com/image/bb/16by9/2025/12/12/bbb52a7b96ea4185891c51d7a26f4cb8_xl.jpg"
      ],
      "datePublished": "2025-12-12T17:35:01.000Z",
      "dateModified": "2025-12-12T17:35:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "T.J. Watt Suffers Partially Collapsed Lung Following Treatment At Steelers Facility",
    "url": "https://www.tmz.com/2025/12/12/tj-watt-suffers-collapsed-lung-after-dry-needling-treatment/",
    "image": "https://imagez.tmz.com/image/19/16by9/2025/12/12/1945c6e0c7d548e7a24ea218512d7bec_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-12-12T19:19:28.000Z",
    "description": "\n    \n                    \n                          T.J. Watt\n                          Suffered Partially Collapsed Lung\n                          .",
    "body": "\n    \n                    \n                          T.J. Watt\n                          Suffered Partially Collapsed Lung\n                          ... Following Treatment At Steelers Facility\n                      \n                  \n                                                                        Published \n                              December 12, 2025\n                            11:19 AM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          T.J. Watt underwent surgery on Thursday to repair and stabilize a partially collapsed lung after a dry needling treatment session at the Pittsburgh Steelers facility ... his brother, J.J., announced on Friday.\n      \n    \n          Watt shared the news on social media after the team announced he was admitted to the hospital with a health scare. While no recovery timeline is currently available, he is expected to be released from the hospital on Friday.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          \"He and his family are very appreciative of everyone's kind words and well wishes,\" J.J. said.\n      \n\n          NFL insider Ian Rapoport said dry needling is a treatment many players in the league undergo without any complications. It's used to alleviate general soreness, but after his treatment, he says Watt was left in \"extreme pain, and doctors quickly sent him to the hospital.\"\n      \n    \n          It's a similar scare to the one current New York Jets quarterback Tyrod Taylor had in 2020 when he was with the Los Angeles Chargers. Just before kickoff against the Kansas City Chiefs ... a doctor was trying to administer a pain-killing injection to his cracked ribs and accidentally punctured his lung.\n      \n    \n          Taylor then sued the doctor, alleging medical malpractice ... and sought at least $5 million in damages.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          The Steelers star pass rusher has yet to address the incident himself, but it's safe to assume he won't be suiting up for the team Monday night against the Miami Dolphins. After that, the team has three games remaining on the schedule -- plus any additional playoff games if they make the postseason.\n      \n    \n          Wishing you a speedy recovery, T.J.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                J.J. Watt\n              \n                          \n                TMZ Sports\n              \n                          \n                Pittsburgh Steelers\n              \n                          \n                Health\n              \n                          \n                Football\n              \n                          \n                NFL\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "T.J. Watt Suffers Partially Collapsed Lung Following Treatment At Steelers Facility",
      "image": [
        "https://imagez.tmz.com/image/19/16by9/2025/12/12/1945c6e0c7d548e7a24ea218512d7bec_xl.jpg"
      ],
      "datePublished": "2025-12-12T19:19:28.000Z",
      "dateModified": "2025-12-12T19:19:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]