[
  {
    "title": "David Harbour on How ‘Stranger Things’ Has Changed Him: ‘It Ripped Apart the Whole Conception of What I Would Be’",
    "url": "https://variety.com/2025/tv/news/david-harbour-stranger-things-5-hopper-1236588795/",
    "image": "https://variety.com/wp-content/uploads/2025/11/David-Harbour-Stranger-Things-5.png?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-22T19:30:00.000Z",
    "description": "\n\tOver the first 16 years of David Harbour’s acting career, he built a successful resume of Broadway theater (in productions like “The Invention of Lo",
    "body": "\n\tOver the first 16 years of David Harbour’s acting career, he built a successful resume of Broadway theater (in productions like “The Invention of Love,” “Who’s Afraid of Virginia Woolf” and “The Coast of Utopia”) and supporting roles in TV (“Pan Am,” “The Newsroom”) and film (“Quantum of Solace,” “State of Play,” “The Equalizer”). \n\n\t“I really enjoyed being No. 7 on a call sheet of, like, a Denzel Washington action movie, and also being leads in plays at the Public Theater in New York,” he says. “It was a lovely life, a fantastic life, a one-bedroom-rental-in-the-East-Village life.”\n\t\n\n\tThen, at 41, Harbour was cast in “Stranger Things” as Hawkins, Indiana, police chief Jim Hopper — the only adult male lead (opposite Winona Ryder’s Joyce Byers) on a show populated almost entirely with young people. His life has never been the same. The show became an immediate global blockbuster on Netflix, catapulting Harbour to top-of-the-call-sheet status in a matter of weeks. Over its five-season run of the Netflix blockbuster series, Harbour has also headlined a reboot of “Hellboy” in 2019, played a kick-ass Santa in 2022’s “Violent Night,” and joined the Marvel Cinematic Universe as the Red Guardian in 2021’s “Black Widow,” 2025’s “Thunderbolts*” and 2026’s “Avengers: Doomsday.”\n\n\n\tSince finishing production on the final season of “Stranger Things” in 2024, Harbour has already shot a new limited series for HBO, the dark comedy “DTF St. Louis” with Jason Bateman and Linda Cardellini, and a sequel to “Violent Night,” both expected in 2026. In late September, he spoke with Variety while in production on the latter, to discuss the end of “Stranger Things” and the creators of the show, Matt and Ross Duffer, for the magazine’s Oct. 15 cover story. (The interview predates the report that co-star Millie Bobby Brown filed a harassment complaint against Harbour prior to shooting Season 5, as well as the announcement and then release of his ex-wife Lily Allen’s new album, “West End Girl.”)\n\t\n\n\tHarbour shared the impact “Stranger Things” has had on his life; how the show’s massive success has changed it, for better and for worse; and how his character has evolved over its five seasons.\n\n\n\n\t\n\n\t\t\t\t\tRoss Duffer and David Harbour on the set of “Stranger Things 5,” with Matt Duffer, Millie Bobby Brown and Winona Ryder in the background\n\t\t\t\t\t\t\t\t\tAtsushi Nishijima/Netflix\n\t\n\n\n\t\n\t\tYou’ve said before that, going into Season 1, you saw Hopper as a make-or-break role for you. Did you understand then that the show had the potential to become what it is now?\t\n\n\tNo. You would know better than I in terms of the business models of how something like Netflix operates. But when we started the show, it was the fall of 2015, and the model for Netflix original series was like “House of Cards” and “Orange is the New Black.” I figured it would be kind of a sci-fi show, which some people would really enjoy, others, you know, it wouldn’t be their thing. But the universal appeal on the sort of zeitgeist that it has become, I never imagined.\n\t\n\t\tWhat has “Stranger Things” done for your career and for your life?\t\n\n\tA lot of people know me now, and it gave me a fan base of a certain type. So, career wise, it just opened a tremendous amount of doors. I mean, I’m interested now in what happens after “Stranger Things,” in terms of walking through those doors. I have this new HBO show coming out in January, me and Jason Bateman, and all this other stuff in the pipe now, so that’s more where my focus is on right now. \n\n\tWhereas, had you asked me that question seven years ago? It just ripped apart the whole conception of what I would be. I got to a certain point in my life when I was 35 — I really enjoyed being number seven on a call sheet of, like, a Denzel Washington action movie, and also being leads in plays at the Public Theater in New York. It was a lovely life, a fantastic life, a one-bedroom-rental-in-the-East-Village life, and “Stranger Things” changed that entire life in many ways. The one thing that it hasn’t changed is my intent, and I think my intent has always been to tell beautiful, weird stories that open people up. That’s been the same pre-“Stranger Things” and after “Stranger Things,” but everything else has changed.\n\t\n\t\tWhy do you think the show has endured for so long as a massive hit? What do you think is at the core of its appeal?\t\n\n\tYou probably know that better than I do. What would you say it is? \n\t\n\t\n\t\tI’ve been asking that question of a lot of people, and one thing that people have really pointed to is that, because of the breadth of the ensemble, there’s a character that basically everyone can identify with — and it’s a story about people who are outsiders fighting back.\t\n\n\tWell, the outsiders fighting back has shifted over the years. I did find that as seasons go on, it’s more interested in empathy. Vecna has become very important, like the monster himself is becoming more human, and we’re supposed to understand and have feelings for the monster. Whereas in Season 1, it was really scrappy outsiders who were taking down a corporation, right? It has been an interesting transition in terms of what they’re focused on, how you elaborate that story. \n\n\tI think, at its best, it really hits all the beats of character and story moving forward at the same pace, which is a difficult thing for a script to do. Usually, scripts focus on character or they focus on plot. “Stranger Things” will do both of them simultaneously in a very sophisticated way. The other thing is, we love “Star Wars,” right? We love “Lord of the Rings.” I think what “Stranger Things” is trying to do is, instead of rebooting “Star Wars” or “Lord of the Rings,” they’re taking the archetypes or the tropes — or the words and the letters, let’s say, and creating new sentences out of them. Hopper is Han Solo, is Indiana Jones, is Gandalf the Gray. There are these archetype tropes that just live in our subconscious cinematic lexicon and we love them. “Stranger Things” just reinvents them with Eleven, Hopper, Max. It’s not afraid to play those really strong power chords.\n\t\n\t\tWhat is the experience like of being directed by the Duffer brothers when the show started?\t\n\n\tWhen we started, I think they were much greener, and the show also had much less at stake. We were the forgotten show that first season. I don’t even know how much money they spent on the show, but it was not a lot, and we didn’t have any executives down there. Nobody was looking at what we’re doing. I think that they looked to me and Winona in a lot of ways to help them more with the bigger dialogue heavy scenes. I mean, not that they didn’t have brilliant stuff every day, but I remember it being a little more freewheeling.\n\t\n\t\n\t\tHow has that evolved over the last decade?\t\n\n\tAs their aesthetic got more what they wanted it to be, they started getting a lot more specific about camera moves and shots and structure and cuts and things like that. As the show grew in popularity, and as the money grew and the stakes grew, I think we got more precise. They’ve always been very generous with me. They’ve always really appreciated me as performer, really appreciated what I brought to the character, and wanted me to sort of guide him. Over the years before each season, we would talk about the kind of direction that we wanted Hopper to go to. \n\n\tYou know, the problem with TV is that you’re always Gilligan on the island in the red shirt and the bucket hat for 10 seasons. I get bored and I wanted Hopper to be different. I wanted to show different colors of him: the Season 1 guy to the Season 2 very protective, overbearing father, to the Season 3 “Magnum PI” ’80s detective, to the Season 4 gaunt, brutal, resurrected warrior, to this Season 5 — I don’t know what he is this season. But we were very collaborative on where we could take him. They’re super bright guys, and they really know how to tell a story.\n\t\n\t\tFinally, as one of the only adults with a lot of experience on the show, I wanted to ask what it’s been like to be on the inside of it becoming such a phenomenon?\t\n\n\tIt’s going to be hard for me to really speak openly about any of this, because of what people do nowadays when you try to discuss something that I feel is very three dimensional and very complex. \n\n\tYou gain something and you lose something. You know, Hopper doesn’t smoke in the show anymore. That is a direct result of popularity. Because your audience does get so large, you are trying to continue to appeal to the largeness of that audience, and large audiences require soft edges. Which is an interesting conundrum that you deal with in pop music and pop culture and all sorts of popular entertainment. So, for me, the freedoms of that first season, when we were just carving it out and no one expected anything, as opposed to the pressures that we were under on the fifth season, you know, I would prefer the freedoms of that first season. And yet, I love the attention, and I love capturing the widest audience possible, and I love moving the most people with what you’re doing.\n\t\n\n\tThis is just something that entertainment struggles with. I guess the long and the short of it is just that you gain something — obviously, clearly — and you also remember and miss those days when we were all naive and had all the freedom in the world because no one expected anything of us.\n\n\tThis interview has been edited and condensed.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "David Harbour on How ‘Stranger Things’ Has Changed Him: ‘It Ripped Apart the Whole Conception of What I Would Be’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/David-Harbour-Stranger-Things-5.png?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-22T19:30:00.000Z",
      "dateModified": "2025-11-22T19:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "On the 30th Anniversary of Its Release, It’s Time ‘Casino’ Took Its Rightful Place as a Scorsese Classic",
    "url": "https://variety.com/2025/film/columns/casino-30th-anniversary-a-scorsese-masterpiece-1236580647/",
    "image": "https://variety.com/wp-content/uploads/2025/04/Robert-De-Niro-in-Casino.png?crop=0px%2C37px%2C1000px%2C562px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-11-22T19:08:25.000Z",
    "description": "\n\tMartin Scorsese’s “Casino” was released 30 years ago today (on Nov. 22, 1995), and I have no problem saying that I think it’s a Scorsese masterpiece",
    "body": "\n\tMartin Scorsese’s “Casino” was released 30 years ago today (on Nov. 22, 1995), and I have no problem saying that I think it’s a Scorsese masterpiece. But I didn’t say that, or anything close to it, when I originally reviewed the film. And I was far from alone. When “Casino” first came out, it provoked a mixed response, on the part of both critics and audiences. And I think it’s easy to see why. Though packed with Scorsese’s virtuosity, the film seemed almost too conscious of its own bravura. For a lot of us, it was bedazzling in a slightly detached and even opaque way.\n\t\n\n\tThe movie marked Scorsese’s return to the glittering, fast-talk mode of Mob docudrama he’d pioneered five years before with “GoodFellas” (both films were based on nonfiction books by Nicholas Pileggi, with scripts by Pileggi and Scorsese). “GoodFellas,” for all its brutality, was a beloved movie, because people thought of it as a joyride to the dark side. “Casino” was colder, longer (three hours!), less relatable, more overstuffed with underworld information, and it had a hero, Robert De Niro’s implacable sports-gambler-turned-Vegas-casino-operator Sam “Ace” Rothstein, who wasn’t exactly easy to cozy up to. At the time, “Casino” struck a lot of people, including me, as both more than “GoodFellas” and less. It felt visibly top-heavy with Scorsese’s ambition to outdo what he’d done before.\n\n\n\tAnd that’s how I’ve thought of it for most of three decades — at least, until I saw it again a few years ago, and what happened took me by surprise. The movie blew me away.\n\n\tI was mesmerized from the opening moments: the hallucinatory lights-of-Vegas credits, the ironic surge of Bach’s “St. Matthew Passion” on the soundtrack as Ace, in his pink jacket, gets into the boxy ’70s car that blows up, and the hypnotic extended sequence in which Ace explains in voice-over how the casino operates, and Scorsese’s rushing camera seems to be everywhere at once, darting through the gaming parlors of the Tangiers, taking us back into the counting room to show us how the skim works, mapping out the hustlers and the gangsters and the suckers and the bosses back in Kansas City, channeling the thrill of the bet, showing it to us in close-up detail, but also filling us in on the big picture, which is that it’s all a grand illusion, because in legalized gambling there is (as Ace puts it) only one winner, and it’s the people who own the casino. Everyone else is feeding them.\n\t\n\n\tWhat shocked me, this time, is that the hypnotic quality of that opening sequence didn’t ebb away. I sat there riveted, for the entire movie, sinking into the nuances in a way I hadn’t before, seeing how it all fit together: Ace’s impeccable style and threatening manners and control-freak way of running the casino, and the hunger inside him that’s driving it all; the recklessness and wild-card cunning of Joe Pesci’s Nicky Santoro, who’s like a richer, more fascinating variation on his Tommy DeVito in “GoodFellas”; and the way Sharon Stone, playing the impassioned gold-digger Ginger McKenna, gives a lacerating performance that is nothing short of extraordinary, showing you how wily and scurrilous Ginger can be, but also humanizing the damage that drives her. The film starts out as crime-syndicate psychodrama and descends into a scandalous underworld “Scenes from a Marriage.” And the rock ‘n’ roll! If it’s hard to highlight any one needle drop (though the “Can’t You Hear Me Knocking” montage is simply undeniable), that’s because Scorsese now weaves those golden oldies into a dream collage, orchestrating the movie like a jukebox that never stops shuffling.\n\n\tSo what changed for me? What did I, and a lot of other Scorsese fans, miss the first time? I think “Casino” was experienced far too much through the lens of “GoodFellas.” That film was a work of fabled perfection (though I’ve never shaken the feeling that Ray Liotta was miscast); it had an adrenaline-shot exuberance that made it a violent Mafia-party hangout movie. “Casino,” by comparison, seemed a party with the bliss chilled out of it. Yet that’s kind of like saying that “Macbeth” isn’t “Hamlet.” If you forget about “GoodFellas,” “Casino” casts its own daunting spell. It’s a vision of what it looks like when money fever becomes the life force. The movie could almost be called “Money,” because that’s the obsession that brings everyone in it down.\n\n\tAt the same time, it’s Scorsese’s darkest Mob drama. When you look at the great Scorsese underworld movies, going back to “Mean Streets” (1973), there’s a paradox built into every one of them. Scorsese, in the very cells of his cinematic being, wants to live in those worlds, to feel as intensely as the characters feel. He’s a saintly rationalist who wants to touch the burn. Yet he also wants to demonstrate the price — to show us that it’s not worth it. And he has never scraped the varnish off the underworld as definitively as he does in “Casino.” That’s what makes the movie not just a masterpiece but such a forbidding one. It’s Scorsese’s most pitiless reckoning of the wages of sin.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "On the 30th Anniversary of Its Release, It’s Time ‘Casino’ Took Its Rightful Place as a Scorsese Classic",
      "image": [
        "https://variety.com/wp-content/uploads/2025/04/Robert-De-Niro-in-Casino.png?crop=0px%2C37px%2C1000px%2C562px&resize=1000%2C563"
      ],
      "datePublished": "2025-11-22T19:08:25.000Z",
      "dateModified": "2025-11-22T19:08:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Zahraa Ghandour’s ‘Flana’ Marks Historic Moment for Iraqi Women",
    "url": "https://variety.com/2025/film/global/cairo-film-festival-zahraa-ghandour-flana-iraq-documentary-1236589435/",
    "image": "https://variety.com/wp-content/uploads/2025/11/Flana.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-22T18:57:55.000Z",
    "description": "\n\tAt this year’s Cairo Intl. Film Festival, Iraqi filmmaker Zahraa Ghandour marks a notable milestone with “Flana,” a documentary centered on the live",
    "body": "\n\tAt this year’s Cairo Intl. Film Festival, Iraqi filmmaker Zahraa Ghandour marks a notable milestone with “Flana,” a documentary centered on the lived realities of Iraqi women. After its world premiere in Toronto, the film arrived in Cairo as part of the Horizons of Arab Cinema competition, not just as a promising debut but as a rare work in Iraqi cinema, shaped by a woman living inside the country and focusing on stories too often sidelined or silenced.\n\t\n\n\tGhandour’s path to filmmaking began more than a decade ago, not in film school, but on Iraqi television. At barely 20, she began presenting and eventually directing the popular documentary show “52 Minutes,” a program she now calls her “foundation.” Week after week, she travelled across the country to report on social issues like early marriage, domestic violence, inequitable laws, women’s prisons — stories so pervasive that colleagues and audiences alike joked she worked only on “women’s issues.” Yet for Ghandour, these were not “women’s issues,” they were the systemic realities Iraqi women navigate every day. “There were endless subjects to cover,” she recalls. “And I loved it. I went everywhere in Iraq because of this show.”\n\n\tBut even as she acted in several Iraqi independent films, she felt none went far enough. “They were all about complicated women, but none were written or directed by women,” she notes. When she began working on “Flana” in 2018, she realized she could no longer hide behind other women’s stories without confronting her own. Growing up, she recalls being treated as “less” than her brother, not by him, but by a society structured to celebrate boys to the detriment of girls. “I felt it was missing the truth if I didn’t speak about the story I knew the most,” she reflects. “It’s all connected.”\n\t\n\n\t“Flana” begins with Ghandour’s desperate search for her childhood friend, Noor, whose disappearance two decades earlier haunts her to this day. It expands into an excavation of the systemic violence facing Iraqi women, from patriarchal traditions to the country’s unresolved legal failures around honor killings. For Ghandour, the personal becomes a rallying cry. “If these personal things aren’t addressed in a fair way, then they’re political,” she argues. “People should be shouting nonstop in the streets to stop little girls from being thrown out on the streets, to stop these criminals from murdering their wives and daughters, to have fair laws.”\n\n\tBringing that truth to the screen, however, required not just artistic clarity but constant strategizing, and immense risk. Ghandour speaks openly about the fear that has accompanied the project from the beginning. “Sometimes I fear the reaction physically,” she admits, pointing to worries about retribution. She was more nervous for her Arab premiere in Cairo than for Toronto “because of how this society thinks and because there were many Iraqis in the audience, I was nervous about the possible reaction.”\n\n\tHer concern stems from experience. When she has spoken publicly about gendered violence in the past, she has been accused of “destroying the Iraqi image,” as though acknowledging injustice were a betrayal rather than a demand for accountability. “There is a lot of denial in society,” she laments. “People take it personally because they’re not doing anything about it.”\n\n\tDuring production, she often had to lie to authorities in order to shoot safely, submitting a fake synopsis about empowered Iraqi women gaining opportunities. Within private homes, birth rooms, and shelters, the women who allowed her to film trusted her with their identities and, in some cases, with their lives. Several women initially refused to appear on camera, though one changed her mind after building trust with Ghandour. Even then, Ghandour made the difficult decision to remove entire characters from the film if she feared for their safety. In one case, she excluded a key figure because presenting her story might expose her to retaliation.\n\n\tThe core of the film, however, centers on two women: Ghandour’s aunt, a midwife whose home becomes a refuge, and Natalie, also known by the pseudonym Leila, whose journey through shelters and family violence reveals the human cost of Iraq’s legal vacuum where women are concerned. Both women have seen the film. Ghandour’s aunt offered an emotional, encouraging response, while Natalie was struck by her on-screen appearance, conscious of the reconstructive surgery she needs for her injured chin, a result of the violence she faced. The team is now helping raise funds for the operation.\n\t\n\n\tThe film’s title captures the erasure Ghandour is fighting against. In Iraq, “flana” is a term used for a woman whose name is forgotten or dismissed, “as if she’s not worthy to mention,” she explains. She deliberately turned it into a name, a presence.\n\n\tInternationally, “Flana” is arriving at a moment when Arab women directors are gaining unprecedented visibility. Ghandour, fresh off of screening the film at IDFA, sees this momentum clearly. “Women are working more on films and having the chance they deserve,” she observes. In Iraq, the film arrives amid a small but significant shift: the country issued its first-ever public film fund this year, and young filmmakers from the 1980s and 1990s generations are forging a path without formal film schools or established industry infrastructure.\n\n\tYet “Flana” is singular. It is the first Iraqi film about women made by a woman living in Iraq. “That mattered to me more than being selected by a major festival,” she remarks. “It’s a point on the road, one of many. But it’s noticed.”\n\n\tCairo, unexpectedly, became a turning point. “I didn’t expect people to care,” she recalls of the film’s sold-out screening at the Opera House. “That theater being full changed something in me. It gave me trust, in ‘Flana’ and in Arab audiences.”\n\n\tNext, Ghandour plans an Iraq premiere, a national screening tour in towns without cinemas, and a companion book of essays, poetry and comics inspired by the film. Broadcasters across the region are in conversation. Al Jazeera, for example, has expressed interest.\n\n\tBut at its heart, Ghandour hopes “Flana” sparks something far simpler and far more pressing: a reckoning with the shelters, honor killings, and the everyday brutality facing women across Iraq, and further, a path toward accountability.\n\n\t“The experience showed me it’s possible to do more, to keep pushing,” she concludes. “And for anyone who tries to undermine us, we know exactly what we’re doing.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Zahraa Ghandour’s ‘Flana’ Marks Historic Moment for Iraqi Women",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/Flana.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-22T18:57:55.000Z",
      "dateModified": "2025-11-22T18:57:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Family Plan 2’ Director Simon Cellan Jones on Why Computers Can Never Duplicate the Thrills of Human-Made Action Movies: ‘I F‑‑‑ing Hate AI’",
    "url": "https://variety.com/2025/film/features/family-plan-2-director-action-scenes-hate-ai-1236589232/",
    "image": "https://variety.com/wp-content/uploads/2025/11/TheFamilyPlan2_Film_S03308F.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-22T18:12:09.000Z",
    "description": "\n\tSimon Cellan Jones has had a long career directing both film and television, but he says he gets his biggest thrill when a tricky action setpiece co",
    "body": "\n\tSimon Cellan Jones has had a long career directing both film and television, but he says he gets his biggest thrill when a tricky action setpiece comes together. In his newest movie, the Mark Wahlberg action-filled family comedy “The Family Plan 2,” now streaming on Apple TV, the globetrotting adventure has one knockout car chase all around the famous Montmartre district in Paris, and it pushed everyone on set to their limit.\n\n\t“We were literally driving down these steps outside this famous church,” Cellan Jones says. “When I saw that shot, we did that for real. We drove a little Trabant, an old East German car, and a Range Rover down these steps. And the stunt person came up to me and said, ‘Simon, you got one more, because this is getting really scary, okay?’ And I said, ‘I need one more.’ So we made a deal, and it was even more terrifying the last time.”\n\t\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tCourtesy of Apple\n\t\n\n\n\n\tCellan Jones and the stunt team nailed the shot, along with several other big-ticket on-location stunts that other productions might have filmed at the studio or by other means.\n\n\n\t“It’s getting permission from the bureaucracy, the mayor’s office or whatever,” Cellan Jones says. “You’ve got to fill out so many forms and be really specific about what you do. We had another sequence that took place in Piccadilly Circus and Westminster Bridge, iconic parts of London. We had to close them down by putting in a plan three months in advance. Then, when you get there, you can’t change it. So you want to be spontaneous, but you have to have your ducks in a row three months in advance, and then you have to hope that you were right. On the day, hopefully it all works out.”\n\t\n\n\tIn a world where Sora 2 videos are touted online as able to conjure action and adventure scenes from thin air in a few minutes, and filming hubs in Atlanta and Canada often stand in for locations all around the world, it’s refreshing to hear a craftsman like Cellan Jones push for his work to feel real and tactile.\n\n\t“People always say, ‘Well, listen, we could do this CG,'” Cellan Jones says. “They always say that. But I work with Skydance. They’re pretty cool. They really do like movies. So when I said to them, ‘I want to do all these shots of parkour on the roof,’ the first thing was, ‘Look, it’s very dangerous on a roof. You have to have hundreds of safety cables. It takes hours and hours’ — which it does, by the way. And I said, ‘Look, we could do it on a set, but honestly, it wouldn’t look as good.’ And they went, ‘Okay, fine. If you can make it work for the money, do that.’ So they were really supportive.”\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tCourtesy of Apple\n\t\n\n\n\n\tIt’s no surprise that Cellan Jones likes to keep things real, growing up loving ’70s and ’80s movies, and worshipping stuntwork and car chases like those in 1971’s “The French Connection” and 1968’s “Bullitt.” He’s currently in the midst of a creative partnership with Wahlberg, another action aficionado who starred in his last two films, 2023’s “The Family Plan” and 2024’s “Arthur the King.” Additionally, Cellan Jones’ television work is filled with shows known for impressive stunt work and real locations, like “Generation Kill,” “Boardwalk Empire” and “Jessica Jones.”\n\n\tDespite more industry championing for action to be processed through AI, Cellan Jones says it’s impossible to fully duplicate the feel of great action with computer intelligence.\n\n\t“Often I see a big scene, and even if it’s very skillfully done, I know it’s fake, it’s crowd replication, it’s AI, it’s CG,” he says. “A little switch goes in me, and I think even in young kids who watch TikTok, where they go, ‘Yeah, okay, but that doesn’t quite feel real.'”\n\n\tAnd while effects sometimes creep into his projects for the safety of his crew or to get an impossible shot, Cellan Jones is happy to keep championing reality in even the most challenging action work.\n\n\t“I obviously have to work with CG a little bit here and there, but I don’t consider myself an expert,” Cellan Jones says. “And, honestly, I don’t want to become an expert. My go-to is, first of all, let’s do it for real with the actors. Then, sometimes either it’s unfair to ask the actors, or you wouldn’t get the insurance or whatever. But then, okay, let’s do it for real with stuntmen or really good doubles. Everything that you can do for real is great. And I don’t want to completely shit on AI because I don’t want to be a Luddite who refuses to see the future, but I fucking hate AI at the moment. It’s going to be relevant, but I think people can tell when you’re using CG and AI, and they appreciate it when you don’t.”\n\t\n\n\tWatch the “Family Plan 2” trailer below.\n\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Family Plan 2’ Director Simon Cellan Jones on Why Computers Can Never Duplicate the Thrills of Human-Made Action Movies: ‘I F‑‑‑ing Hate AI’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/TheFamilyPlan2_Film_S03308F.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-22T18:12:09.000Z",
      "dateModified": "2025-11-22T18:12:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How Short Film ‘The Singers’ Used Viral Talent to ‘Make Something Very Human and Handmade’ About Male Vulnerability",
    "url": "https://variety.com/2025/film/features/the-singers-short-film-viral-talent-1236583117/",
    "image": "https://variety.com/wp-content/uploads/2025/11/THE-SINGERS-Still-2.png?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-22T16:17:55.000Z",
    "description": "\n\tWho could have guessed that one of the most socially prescient works of 2025 is based on a story from 175 years ago?\n\n\tThat’s the fascinating genesi",
    "body": "\n\tWho could have guessed that one of the most socially prescient works of 2025 is based on a story from 175 years ago?\n\n\tThat’s the fascinating genesis of “The Singers,” which is quickly becoming one of the most fêted short films of the year. The piece, from director Sam Davis, was inspired when he read Ivan Turgenev’s short story “The Singers,” which was included in George Saunders’ book of literary analysis, “A Swim in a Pond in the Rain.” In the text, a group of gruff men at a bar finds connection by baring their souls in an impromptu singing competition. In an interesting twist, Davis was first inspired to adapt the old work when juxtaposing it with a modern medium.\n\t\n\n\t“I thought it was cool, but I didn’t come away from it thinking I want to make a film about this,” he says. “That happened moments later when I opened my phone, and the first video that popped up was a viral video of a guy busking in the subway station. It was the most beautiful, soulful, raw performance I had ever heard.The idea for adapting it was suddenly so crystal clear: I would retell this 1850 Russian short story, but with all these really unsuspecting, viral video singing talents who we would curate from TikTok and YouTube and Instagram from all over the world. Then we can fill a bar up with this group of geniuses in the rough, hiding in plain sight in a pub.”\n\n\n\n\n\t\n\n\t\t\t\t\tSam Davis directing “The Singers.”\n\t\t\t\t\t\t\t\t\tPhoto by Jordan Cramer\n\t\n\n\n\n\tThe result is a bold mix of classic filmmaking and new techniques. Davis doubled down on the risk of hiring non-professional actors by not writing a traditional script, instead letting his unique talent improvise much of their dialogue, the looseness of which drew on Davis’ experience in the documentary world. Additionally, the project was shot on 35mm to create a rich look for the warm story, and the music was recorded live on set — two challenging maneuvers that added to the vérité.\n\t\n\n\tAlso timeless about this film is that it naturally speaks to the so-called “male loneliness epidemic,” a social issue that has had plenty of ink spilled about it over the last year as more and more friendships are dulled by a very-online culture.\n\n\t“That was definitely my takeaway from the original short story: ‘Wow, this is a lowly pub in 1850 and a group of men who are these hard shells of men,'” Davis says. “The lengths that a little bit of vulnerability goes to forming a community and having this moment of connection. I grew up in a small town in Michigan — definitely not a place where we are healthy communicators of our emotions, especially as men. I think making this film was a bit of me bearing my soul. Each of the characters in the film is opening up in a radical way for them. But on a meta level, that was what really drew me to this: The power of, especially for men, being open to connecting and sharing and discovering that the guy you’re sitting next to at the bar actually has a lot in common with you, and for that to result in something cathartic.”\n\n\tConnections have also been built between “The Singers” and audiences. After a world premiere at South by Southwest, the film has gone onto receive over 25 festival awards, including grand prize winner at the Provo, Utah, festival Filmquest. ” I’m Not a Robot,” which won FilmQuest’s top honors in 2024, ended up winning the Academy Award for best live action short film this year.\n\n\tDavis, who is already an Academy Award nominee for producing the 2023 short film “Nǎi Nai & Wài Pó,” hopes that any further success for the Oscar-qualifying short film inspires more people to seek out its unique take on art and vulnerability.\n\n\t“These two very disparate pieces of media merged in this really beautiful way and crystallized into a specific vision,” Davis says. “I think it’s a fun way to have a subversive approach to using the algorithm to make something very human and handmade and analog.”\n\n\tWatch the teaser trailer and see the poster for “The Singers” below.\n\n\n\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tCourtesy poster (ft. painting by Paul Mellender)\n\t\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How Short Film ‘The Singers’ Used Viral Talent to ‘Make Something Very Human and Handmade’ About Male Vulnerability",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/THE-SINGERS-Still-2.png?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-22T16:17:55.000Z",
      "dateModified": "2025-11-22T16:17:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Josh Hutcherson on Why a ‘Hunger Games’ Return ‘Wouldn’t Take Any Convincing’ and How ‘I Love L.A.’ and ‘Five Nights at Freddy’s 2’ Got Him Out of a Major Slump",
    "url": "https://variety.com/2025/film/news/josh-hutcherson-hunger-games-return-five-nights-at-freddys-2-1236587674/",
    "image": "https://variety.com/wp-content/uploads/2025/11/Josh-Hutcherson.png?crop=0px%2C782px%2C2000px%2C1124px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-11-22T17:30:00.000Z",
    "description": "\n\n\tJosh Hutcherson was trying get the hell out of Los Angeles. For the better part of a decade, the “Hunger Games” star and his girlfriend, Spanish ac",
    "body": "\n\n\tJosh Hutcherson was trying get the hell out of Los Angeles. For the better part of a decade, the “Hunger Games” star and his girlfriend, Spanish actor Claudia Traisac, had split their time between L.A. and Madrid, but the eight-hour time difference between the cities had grown wearying. So Hutcherson leased an apartment in Brooklyn, and in April of this year, the couple flew into New York City from Spain, eager to launch their new East Coast life — until, in the car from JFK, Hutcherson got a call from his agent.\n\n\t“‘How do you feel about going back to the airport right now?’” Hutcherson recalls his agent asking. “I was like, ‘I don’t fucking feel good about it, not at all! Why?’”\n\n\n\tThe agent explained that Rachel Sennott, the buzzy star of indie hits “Bottoms” and “Shiva Baby,” was launching her first comedy series with HBO, and she wanted Hutcherson to play her character’s boyfriend. But it was going to start shooting in roughly two weeks, and the show’s eventual title doubled as its location: “I Love L.A.”\n\n\n\tIt was the phone call that Hutcherson had spent years waiting to get. He’d been acting since he was 9; he’d landed his first starring role at 13, in “Zathura: A Space Adventure”; he had a key supporting role in 2010 best picture nominee “The Kids Are All Right” at 16; and when he was 18, he was catapulted into global superstardom when he was cast as Peeta Mellark in “The Hunger Games.” But as Hutcherson drifted toward 30, the roles started to dry up.\n\t\n\n\t“I went through a few years where it was kind of slim pickings, and I wasn’t doing much,” he says quietly, swirling his coffee cup outside a bistro in L.A.’s Echo Park neighborhood. “A lot of young actors don’t make the transition, or the industry kicks them out. I was kind of like, is this the time where I’m over it and done?”\n\n\n\tInstead, at 33, Hutcherson is entering a new career peak. On Dec. 5, he’ll star in Blumhouse’s “Five Nights at Freddy’s 2,” adapted from the feverishly popular video game franchise — the first “Freddy’s” movie was an unexpected hit in 2023, grossing $292 million worldwide. And after scrambling to get out of his NYC lease, he did indeed join the cast of “I Love L.A.,” an experience that “reignited such a love and appreciation for this job in me,” he says. “I’ve always wanted to do an HBO comedy on Sunday night. That, to me, is a dream come true.”\n\n\n\n\t\n\n\t\t\t\t\tRachel Sennott and Josh Hutcherson in “I Love L.A.”\n\t\t\t\t\t\t\t\t\tKenny Laubbacher/HBO\n\t\n\n\n\n\tOn “I Love L.A.” — which premiered on Nov. 2, runs through Dec. 21 and was just renewed for a second season — Hutcherson plays Dylan, a schoolteacher who loves his live-in girlfriend Maia (Sennott), despite the chaos that her ambition to become a talent manager brings into his life.\n\n\t“I grew up watching him in ‘Bridge to Terabithia’ and ‘The Hunger Games,’ and there’s something about him, how warm and lovely he is,” Sennott told Variety in October. “I was so impressed by his comedic and improv chops. But also, for audiences, I think you see him and you feel like he’s your boyfriend a little.”\n\t\n\n\tHutcherson smiles when I tell him Sennott’s reasoning for casting him. “I am known as the good-hearted golden boy, which I’m not mad about,” he says. He has tried to break free of that perception, most recently by playing the toxic tech bro villain in the 2024 Jason Statham action film “The Beekeeper.” But with “I Love L.A.,” Hutcherson says he was “happy to lean into” his Good Guy persona. “If it got me on set and shooting this with Rachel — it’s meant to be.”\n\n\tPart of the appeal were the days during the eight-week shoot when Hutcherson literally walked to work. “The first script mentioned Erewhon and Tenants of the Trees and the reservoir,” he says, ticking off landmarks of L.A.’s Eastside. “That’s my circuit. That’s where I’ve been haunting for years.”\n\n\tHe also felt at home as the only character on the show who isn’t obsessed with breaking into show business. “Even though I’ve been doing this since I was 9, and I’m so wildly in this industry, I don’t feel like I am in so many ways,” he says. “I don’t go to events unless I need to be there. I’m not active on social media unless the studio is like, we need you to be. I’ve always been one foot in, one foot out. When I started, I didn’t have a hunger for becoming famous; I just wanted to make movies and TV shows. I feel like that aligns with Dylan. He just wants to exist and do something he cares about.”\n\n\tThe chance to play an everyday adult living in the world as it exists in 2025 is rare for any actor right now, and Hutcherson does not take it for granted. “I’ve grown up working with tennis balls and green screens,” he says. “I don’t have to try to convince the audience that we’re, like, X amount of years in the future in a dystopic society or that these animatronics are possessed by ghost children.”\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tUniversal/Courtesy Everett Collection\n\t\n\n\n\n\tHe’s referring, of course, to the “Freddy’s” movies, which revolve around a creepy, long-shuttered pizzeria joint à la Chuck E. Cheese and its homicidal robot animal mascots that are embodied by the spirits of murdered kids. The elaborate animatronic costumes created by Jim Henson’s Creature Shop can be worn by the performers only for 30 minutes at a time before the weight and heat become overwhelming. And when they do have the costumes on, there’s no guarantee they’re going to work right.\n\n\t“The stunt actor has to turn and look to the right, but then three people with remote controls have to make the eyes time with the blink,” Hutcherson says. “You’ll do 10 takes, because the animatronic movement isn’t quite working. That one take that the animatronic is perfect, you better be perfect too, because that’s the one that’s going in the movie.”\n\t\n\n\tThe sequel, Hutcherson estimates, has “more than double” the creatures from the first film, one of which, the character called Mangle, requires “a team of 10 or 12 people to operate.”\n\n\n\t“And the animatronics might find a way to leave the pizzeria,” he adds, “which is a big deal.”\n\n\tBut wait, I say, didn’t the titular Freddy exit the pizzeria in the first movie?\n\n\n\t“Yes, but there’s, like, certain rules of the game that —” he says, his voice slowing down and raising in pitch with each successive word. “It’s murky. And I don’t fully get it, but I know it’s a big deal that the animatronics that leave, leave. It’s a whole thing.”\n\n\tWhen Hutcherson signed on to the first “Freddy’s,” he didn’t really grasp the size of the “absolutely rabid fan base” for the mid-2010s video games that inspired the films “until after the movie came out.” But as he talks about shooting the sequel — directed once again by Emma Tammi, and written by the game’s creator, Scott Cawthon — I get the feeling that Hutcherson is still simply along for the ride.\n\n\n\n\t\n\n\t\t\t\t\tJosh Hutcherson and director Emma Tammi on the set of “Five Nights at Freddy’s 2”\n\t\t\t\t\t\t\t\t\tRyan Green / Universal Pictures / Courtesy Everett Collection\n\t\n\n\n\n\t“The main focus is making something that the FNAF fandom will go crazy for,” he says, pronouncing the acronym as the fans do: “fuh-naff.” “Sometimes I’m like, ‘This doesn’t make any sense! How can I possibly do this?’ And they’re like, ‘It’s from the game.’” He starts laughing as he puts up his hands in surrender. “‘All right, all right, all right, I’m on board, I’m on board.’ But it’s crazy.”\n\n\tSatisfying the exacting expectations of a vocal fanbase is certainly familiar territory for Hutcherson, after spending half a decade with Jennifer Lawrence and Liam Hemsworth inside the “Hunger Games” maelstrom. As his time with that franchise was coming to an end with 2015’s “The Hunger Games: Mockingjay – Part 2,” Hutcherson says he went through a phase where he wanted absolutely nothing to do with it. “I was like, ‘Fuck that,’” he says matter-of-factly. “I got thrust into a place of notoriety that I never dreamed of, never wanted. It took privacy from me.”\n\n\tTo this day, Hutcherson avoids crowded public places, including in Madrid, and strangers yelling “Peeta” at him is a daily occurrence. But he’s grown to appreciate everything that “The Hunger Games” has provided him, so much so that his face lights up when I bring up the prospect of making another film with the core team, including director Francis Lawrence and co-star Woody Harrelson. “I would love to be back on set with Francis, with Jen, with Liam, with Woody,” he says. “It would not take any convincing at all. I’d be there in a heartbeat.”\n\n\tThere’s a chance that could happen sooner than one may expect. Francis Lawrence is in production on an adaptation of Suzanne Collins’ prequel novel “Sunrise on the Reaping,” which chronicles the Hunger Games experience from the perspective of Harrelson’s character Haymitch Abernathy when he was 16 — and ends with an epilogue set after the events of “Mockingjay,” featuring Haymitch, Peeta and series heroine Katniss Everdeen.\n\n\n\tHutcherson learned of that coda only as the book hit shelves in March. So, I ask, is he in the new movie?\n\n\tHe breaks into a massive grin. “That would be a dream come true,” he says, holding my gaze.\n\n\tI’m not quite sure what you’re trying to communicate to me, I say.\n\n\t“It would be a dream come true,” he repeats. “Do dreams come true? Sometimes. Sometimes not. Sometimes, yeah.”\n\n\n\tSelome Hailu contributed to this story.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Josh Hutcherson on Why a ‘Hunger Games’ Return ‘Wouldn’t Take Any Convincing’ and How ‘I Love L.A.’ and ‘Five Nights at Freddy’s 2’ Got Him Out of a Major Slump",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/Josh-Hutcherson.png?crop=0px%2C782px%2C2000px%2C1124px&resize=1000%2C563"
      ],
      "datePublished": "2025-11-22T17:30:00.000Z",
      "dateModified": "2025-11-22T17:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Eddie Murphy Says ‘Ghostbusters’, ‘Rush Hour’ and ‘Who Framed Roger Rabbit’ are His Three ‘Wish I Would Have Done’ Movies",
    "url": "https://variety.com/2025/film/news/eddie-murphy-ghostbusters-rush-hour-wish-i-would-have-done-1236589366/",
    "image": "https://variety.com/wp-content/uploads/2025/11/GettyImages-2246468969.jpg?crop=15px%2C156px%2C4975px%2C2798px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-11-22T17:13:08.000Z",
    "description": "\n\tSome of Hollywood’s most iconic comedies would’ve looked very different if Eddie Murphy had not turned them down.\n\n\tIn a recent interview with AP pr",
    "body": "\n\tSome of Hollywood’s most iconic comedies would’ve looked very different if Eddie Murphy had not turned them down.\n\n\tIn a recent interview with AP promoting his new Netflix documentary “Being Eddie,” Murphy shared his “big three ‘wish I would have done’ movies.”\n\n\t“‘Ghostbusters,’ I was supposed to do ‘Ghostbusters,'” Murphy recalled. “Didn’t do that, and ‘Rush Hour.’ Didn’t do that. Oh, and ‘Who Framed Roger Rabbit.’ Those are my big three ‘wish I would have done’ movies.”\n\t\n\n\tMurphy explained that the reason he wished he had joined those projects is that they were all “huge, giant hits.” However, he doesn’t hold too much regret. The “Shrek” star explained that because he turned down the role in “Ghostbusters,” he landed the part of Axel Foley in “Beverly Hills Cop.”\n\n\n\t“With ‘Ghostbusters,’ I did ‘Beverly Hills Cop’ instead,” he said. “It was do this or that, so it worked out cool. And ‘Who Framed Roger Rabbit’ just sounded ridiculous to me, and I passed on it. And afterwards, I was like, ‘Oh, that’s fucking amazing.'”\n\n\t“Being Eddie” released on Netflix on Nov. 12, and with it came several revelations about Murphy’s storied career. In the doc, he reflected on feeling betrayed by “Saturday Night Live,” which called him a “falling star” during a segment targeting the poor reception of his 1995 horror comedy “Vampire in Brooklyn.” Murphy, who appeared on “SNL” from 1980 to 1984, felt like his “alma mater” took a shot at him.\n\n\t“I was like, hurt,” Murphy said in the doc. “My feelings was hurt. I’m from the same… It’s like your alma mater taking a shot at you — at my career, not how funny I was, calling me ‘a falling star.’ If there was a joke like that right now, and it was about some other ‘SNL’ cast member, and it was about how fucked up their career was, it would get shot down.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Eddie Murphy Says ‘Ghostbusters’, ‘Rush Hour’ and ‘Who Framed Roger Rabbit’ are His Three ‘Wish I Would Have Done’ Movies",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/GettyImages-2246468969.jpg?crop=15px%2C156px%2C4975px%2C2798px&resize=1000%2C563"
      ],
      "datePublished": "2025-11-22T17:13:08.000Z",
      "dateModified": "2025-11-22T17:13:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cairo Film Festival Puts Co-Production in Spotlight as Industry Pushes for Regional Collaboration",
    "url": "https://variety.com/2025/film/global/cairo-co-production-project-salon-mena-collaboration-1236589372/",
    "image": "https://variety.com/wp-content/uploads/2025/11/CIFF-Industry-Days.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-22T17:20:52.000Z",
    "description": "\n\tAt this year’s Cairo Intl. Film Festival, some of the most energized conversations unfolded inside Cairo Industry Days, where co-production emerged ",
    "body": "\n\tAt this year’s Cairo Intl. Film Festival, some of the most energized conversations unfolded inside Cairo Industry Days, where co-production emerged as one of the festival’s most strategic themes. Between a candid panel on balancing identity with market demands and the launch of CIFF film market partner Co-Production Salon’s new platform, Project Salon, the festival underscored its commitment to improving regional collaboration and giving Arab filmmakers more structured tools to navigate the international marketplace.\n\t\n\n\tDuring the panel “Co-production: Between Identity and the Market,” filmmakers and producers from across the region and Europe dissected the realities of working across borders. Egyptian producer-director Ali El Arabi (“Captains of Za’atari”) opened with a reminder that co-production isn’t an automatic solution for every project. Its value, he argued, depends on what a filmmaker genuinely needs, whether that’s financing, expertise, or shared creative sensibilities.\n\n\n\tOthers pointed to the stakes behind those decisions. Senior VP of business and content development at Rise Studios Ziad Srouji (“Once Upon a Time in Gaza,” co-producer) stressed that co-production deals must be understood as commercial risks. With markets shifting and budgets tightening, producers are making business decisions as much as artistic ones.\n\n\tJordanian producer Rula Nasser (“Inshallah a Boy”) added that international partners are not always essential. Some films, especially those by emerging filmmakers, she maintained, thrive precisely because they remain grounded in local contexts.\n\t\n\n\tStill, the financing landscape is evolving quickly. Norwegian producer Dyveke Graver (“The Worst Person in the World”) noted that where one or two co-producers once sufficed, today’s projects often rely on four or five partners to cover different territories and secure distribution pathways.\n\n\tEgyptian filmmaker Mayye Zayed described how this complexity can bring creative tension. On her award-winning documentary “Lift Like a Girl,” she received strong interest from European co-producers, but some pushed for rushed schedules or stylistic adjustments that clashed with her slow, observational approach. Eventually, Zayed partnered with producers who understood the film’s rhythm, an experience that strengthened her resolve to protect her vision even when more heavily financed options were on the table.\n\n\tAcross the panel, one theme resurfaced often: the importance of establishing a stable core team before expanding into co-production. Nasser emphasized that no matter how many partners are involved, the director-lead producer relationship anchors the film creatively. Graver agreed, arguing that producers should understand the project’s DNA before approaching outside collaborators. As she put it, the right co-producer should be “someone you’d actually want to have dinner with,” a reminder that compatibility matters as much as credentials.\n\n\tPanelists also discussed the political nuances of international funding. Srouji acknowledged that some European cultural funds come with editorial expectations, but they also provide crucial access to festivals, markets, and new audiences. Nasser noted that countries like Jordan often rely on European post-production services out of necessity, but doing so doesn’t necessarily mean surrendering creative identity.\n\n\tAnother shared warning: know your contracts. El Arabi spoke bluntly about learning hard lessons on rights and revenue splits, while Nasser admitted she entered her early projects with limited understanding of copyright. The takeaway, echoed by the group, is that legal literacy is now a foundational skill for producers.\n\n\tThe room also grappled with why Arab-Arab co-productions remain less common than collaborations with Europe. Nasser offered a lighthearted but telling explanation, saying producers in the region “love each other too much,” leading to disputes over shooting locations, premiere rights, and broadcast priority. In markets with small audiences for independent cinema, these decisions can carry disproportionate weight.\n\t\n\n\tProject Salon: A new tool for collaboration\n\n\tThe festival’s focus on co-production was amplified by the launch of Project Salon, a digital platform developed by CIFF partner Co-Production Salon, the UAE-based networking hub, on stage at the Cairo Film Market. The tool allows experienced producers to upload comprehensive project materials, including scripts, budgets, schedules, and pitch decks, and to specify the type of partnership they’re seeking, from co-financing to distribution. To ensure professional standards, projects must already have at least 10% of their financing secured and come from producers with at least one commercially released work.\n\n\tIn a region where many filmmakers struggle to find the right partners at the right moment, the platform aims to streamline the process. By centralizing pitching, matchmaking, and financing opportunities in one place, Co-Production Salon is positioning itself as a key connector for the Middle East and North Africa industry. Founder Heba Korayem frames it as a way to bridge the gap between creative ambition and market access, helping Arab producers compete more confidently on the international stage.\n\n\tThe initiative fits neatly into CIFF’s wider strategy. The Cairo Film Market welcomed more than 20 Arab and international institutions this year, and CIFF recently formalized a strategic partnership with Co-Production Salon to expand MENA co-production opportunities.\n\n\tTogether, the panel conversations and new infrastructure reflect an industry at a turning point. Arab producers are pushing for partnerships that protect artistic identity, all while widening international reach. Co-production, once viewed primarily as a funding lifeline, is now being reframed as a strategic tool, one that can both affirm cultural authenticity, as well as unlock new markets.\n\n\tAs CIFF invests in platforms and programs that prioritize transparent, equitable collaboration, the region’s filmmaking community appears ready to enter a new phase shaped not by dependency, but by deliberate, confident, and increasingly region-driven co-production.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cairo Film Festival Puts Co-Production in Spotlight as Industry Pushes for Regional Collaboration",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/CIFF-Industry-Days.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-22T17:20:52.000Z",
      "dateModified": "2025-11-22T17:20:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Dragonfly,’ ‘Once Upon a Time in Gaza’ Win Big at Cairo Film Festival as Industry Hub Cairo Film Connection Marks Record Year",
    "url": "https://variety.com/2025/film/global/cairo-winners-dragonfly-once-upon-a-time-in-gaza-1236589358/",
    "image": "https://variety.com/wp-content/uploads/2025/11/Dragonfly.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-22T16:46:26.000Z",
    "description": "\n\tThe 46th Cairo Intl. Film Festival wrapped Friday in an emotionally charged ceremony that balanced the region’s realities with a showcase of bold ne",
    "body": "\n\tThe 46th Cairo Intl. Film Festival wrapped Friday in an emotionally charged ceremony that balanced the region’s realities with a showcase of bold new cinema. Held at the Cairo Opera House before a packed crowd of Egyptian, Arab and international filmmakers, the gala awarded its top honor, the Golden Pyramid, to Paul Andrew Williams’ “Dragonfly,” while Tarzan and Arab Nasser’s “Once Upon a Time in Gaza” emerged as the evening’s other major winner.\n\t\n\n\tA Ceremony Marked by SolidarityThe ceremony opened on a stark humanitarian note. Before any awards were announced, a photo of six-year-old Palestinian child Hind Rajab filled the screen, accompanied by audio from her final phone call before being killed in Gaza. Festival president Hussein Fahmi, visibly moved, called it a reminder of cinema’s responsibility. “The power of cinema lies in its ability to document and keep true stories alive,” he said, adding that children lost to conflict “are not just numbers, but real human beings made of flesh and blood.”\n\n\tCIFF reinforced the message with its closing film, Kaouther Ben Hania’s “The Voice of Hind Rajab,” screened immediately following the awards.\n\n\n\tFahmi also announced a new partnership with Qatar Media City, connecting Cairo with the Doha Film Festival, a collaboration he described as “an exciting moment for Arab cinema.”\n\n\t‘Dragonfly’ Takes Cairo’s Top Honor“Dragonfly,” represented internationally by AMP International, claimed the festival’s highest accolade, with jury president Nuri Bilge Ceylan praising its “profound exploration of solitude, memory, and human resilience” and its “delicate storytelling.”\n\t\n\n\tStars Andrea Riseborough and Brenda Blethyn shared the best actress award, adding Cairo to a growing streak of recognition after the pair jointly won best performance in an international feature at this year’s Tribeca Festival.\n\n\tWilliams’ drama, set in a British coastal town, follows the evolving relationship between two neighbors, Colleen and Elsie, after Colleen intervenes when the elderly Elsie appears neglected by her caregivers.\n\n\t‘Once Upon a Time in Gaza’ Scores Three Major WinsThe Nasser brothers’ “Once Upon a Time in Gaza” secured the Silver Pyramid for best director, best actor for Majd Eid, and the best Arab feature film award, reaffirming Cairo’s role as a launch platform for emerging Palestinian cinema.\n\n\tThe film had its world premiere in Un Certain Regard at the 78th Cannes Film Festival, where Tarzan and Arab Nasser won the section’s best director prize before its theatrical release helmed by Sophie Dulac Distribution.\n\n\tSet in 2007 Gaza, the drama follows Yahya, a young student who befriends Osama, a charismatic falafel shop owner. Their side business delivering sandwiches while quietly dealing small amounts of drugs pulls them into a confrontation with a corrupt local officer.\n\n\tOther Standout HonorsIranian filmmaker Alireza Khatami had a strong showing with “The Things You Kill,” winning both the Naguib Mahfouz best screenplay award in the international competition and the FIPRESCI Prize. The film follows a university professor looking into the suspicious death of his mother, drawing him and his quiet gardener into an increasingly personal search for answers.\n\n\tThe international competition jury awarded Lebanese filmmaker Nicolas Khoury best documentary film for “Souraya Mon Amour,” which revisits artist Souraya Baghdadi’s relationship with her late husband filmmaker Maroun Baghdadi through archival material and new reflections on grief and memory three decades after his death.\n\n\tIn the Horizons of Arab Cinema section, Sara Francis’ “Dead Dog” took top honors, with jury member Nadia Dresti praising the film for “successfully immersing us in a demanding cinematic experience that explored a complex relationship through an audacious aesthetic.”\n\n\t“One More Show,” directed by Mai Saad and Ahmed Al Danaf, won the Youssef Sherif Rizkallah audience award, with Al Danaf joining the ceremony from Gaza via an iPad held by Saad. Shot under bombardment, the documentary follows the Free Gaza Circus as they perform for displaced children, offering an on-the-ground portrait of artistic resilience during war.\n\t\n\n\tSaudi documentary “Anti-Cinema” from filmmaker Ali Saeed received the special jury prize. The film examines how Saudi cinephiles came of age without theaters, while shedding light on the country’s overlooked pre-1979 film culture.\n\n\tEgyptian filmmaker Yasser Shafeiy was awarded with a best screenplay nod in the category for his debut feature “Complaint No. 713317.” The drama centers on a retired couple navigating a simple appliance repair that slowly exposes the quiet pressures and small injustices shaping their daily lives.\n\n\tShort film awards went to Abdellah Taïa’s “Cairo Streets” (Youssef Chahine Award for best short film) and Lynn El Safah’s “Two Tetas” (best Arab short).\n\n\tIndustry: Cairo Film Connection Marks Record EditionWhile the awards grabbed the spotlight, much of the week’s industry momentum ran through the Cairo Film Connection, which continued its rise as one of the region’s most active pitching and financing hubs. Under director Rodrigo Brum, the platform awarded more than $200,000 in cash and in-kind support, drawing partners from Europe, Africa and the Gulf. Brum framed the mission simply: “Every project here expands the cinematic map of the Arab world.”\n\n\tIndustry prizes went to a broad slate of titles, with slots awarded by Durban Film Mart (“Goodbye Party”), Medimed (“I Have Other Friends”), Malmö Arab Film Festival (“Al Madeenah 2008”) and the Amman International Film Festival (“Where Do I Belong”). Rough Cut Lab Africa selected “Asphalt” for its main prize and gave a special mention to “Revolutionaries Never Die.”\n\n\tTechnical and post-production support from Cinetech, Ambient Light, Nu’Ta, DTS, I Sound and Shift Studios was distributed widely across the lineup, reflecting CFC’s push to broaden access.\n\n\tCash awards came from Special Touch, AH Media, Pathé Touch, Rise Studios, Lagoonie, ART, Iraqi Cinema, and the Red Sea Intl. Film Festival, which split its top prize between two projects.\n\n\tThe forum’s top honors went to:Best project in development: “The Side Effects of Trusting Life”\n\n\tBest project in post-production: “Revolutionaries Never Die”\n\n\tCFC was bolstered this year by a packed Cairo Industry Days program: 22 market booths, 55 ProMeet sessions and 380 industry participants, underscoring Cairo’s ascent as a regional co-production hub.\n\t\n\n\tWith 153 films from 55 countries, artistic director Mohamed Tarek shaped an edition that leaned into intimate international titles, new Arab voices, and a reinforced industry market. A steady turnout and expanded programming suggested increased momentum for the festival as it continues to reassert its place in the region’s cultural landscape.\n\n\tA full list of winners at the 46th Cairo Intl. Film Festival:\n\n\tINTERNATIONAL COMPETITIONGolden Pyramid for best film“Dragonfly,” Paul Andrew Williams\n\n\tSilver Pyramid for best director“Once Upon a Time in Gaza,” Tarzan & Arab Nasser\n\n\tBronze Pyramid special jury prize“As We Breathe,” Seyhmus Altun\n\n\tBest actorMajd Eid, “Once Upon a Time in Gaza”\n\n\tBest actress (shared)Andrea Riseborough and Brenda Blethyn, “Dragonfly”\n\n\tNaguib Mahfouz Award for best screenplay“The Things You Kill,” Alireza Khatami\n\n\tHenri Barakat Award for best artistic contribution (cinematography)Mathieu Giombini, “Sand City”\n\n\tDocumentary film award“Souraya Mon Amour,” Nicolas Khoury\n\n\tYoussef Sherif Rizkallah audience award“One More Show,” Mai Saad & Ahmed Al Danaf\n\n\tHORIZONS OF ARAB CINEMA COMPETITIONSaad Eddine Wahba best Arab film award“Dead Dog,” Sarah Francis\n\n\tSalah Abu Seif special jury prize“Anti-Cinema,” Ali Saeed\n\n\tBest screenplayYasser Shafiey, “Complaint No. 713317”\n\n\tBest acting awardAfef Ben Mahmoud, “Round 13”\n\n\tINTERNATIONAL CRITICS’ WEEKShadi Abdel Salam Award for best film“Habibi Hussein,” Alex Bakri\n\n\tFathi Farag Special jury prize“In My Parents House,” Tim Ellrich\n\n\tSpecial mention“The Botanist,” Jing Yi\n\n\tSHORT FILM COMPETITIONYoussef Chahine award for best short film“Cairo Streets,” Abdellah Taïa\n\n\tBest Arab short film“Two Tetas,” Lynn El Safah\n\n\tSpecial jury prize“A Very Straight Neck,” Neo Sora\n\n\tFIPRESCI AWARD“The Things You Kill,” Alireza Khatami\n\n\tBEST ARAB FEATURE FILM (Watch It Award)“Once Upon a Time in Gaza,” Tarzan and Arab Nasser\n\n\tSpecial mention“Flana,” Zahraa Ghandour\n\n\tNETPAC AWARD Best Asian Film“The Botanist,” Jing Yi\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Dragonfly,’ ‘Once Upon a Time in Gaza’ Win Big at Cairo Film Festival as Industry Hub Cairo Film Connection Marks Record Year",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/Dragonfly.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-22T16:46:26.000Z",
      "dateModified": "2025-11-22T16:46:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sia, Kathy Griffin, Amber Ruffin and More Out100 Party Red Carpet Photos",
    "url": "https://variety.com/gallery/out100-party-red-carpet-photos-2025/",
    "image": "https://variety.com/wp-content/uploads/2025/11/MG_3218-1.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-22T16:01:06.000Z",
    "description": "\n\t\n\t\t\t\n\t\t\t\t\n\t\n\t\n\tNov 22, 2025 8:01am PT\t\n\t\n\n\t\t\t\n\n\n\t\t\t\n\t\t\t\n\t\n\n\t\t\t\t\t\t\t\t\tRiver Callaway\n\t\n\n\t\t\n\t\n\t\t\t\tKathy Griffin was honored Friday night by Out magazin",
    "body": "\n\t\n\t\t\t\n\t\t\t\t\n\t\n\t\n\tNov 22, 2025 8:01am PT\t\n\t\n\n\t\t\t\n\n\n\t\t\t\n\t\t\t\n\t\n\n\t\t\t\t\t\t\t\t\tRiver Callaway\n\t\n\n\t\t\n\t\n\t\t\t\tKathy Griffin was honored Friday night by Out magazine as the LGBTQ+ community’s Advocate of the Year.\nThe “My Life on the D-List” star was presented with the award by Sia during the Out100 party at Sia at nya studios West in Los Angeles. “She’s my friend, she’s an excellent person and she saved my life,” the singer said, before serenading Griffin with her empowerment anthem “Unstoppable.”\nGriffin thanked the queer community for standing by her side even when she was “canceled” following her clash with Donald Trump. “There was a term in my day called f— hag,” Griffin said. “We won’t say the f-a-g word anymore but, honey, I am the OG hag. I know all of you. We go back. We have a relationship.”\nShe went on to say, “I’m so honored to be Advocate of the Year because we are a community. This is a tough time, so I have to tell you, please become as politically engaged as you can. Please. It’s so important because I worry about you guys and I worry about an America where it may not even be safe to walk down the street as a gay person.”\nNiecy Nash-Betts accepted the Icon Award via a video message after she was unable to appear in person because she was filming in Atlanta. “Boots” star Miles Heizer was also recognized as one of the Out100 honorees.\nCheck out all the best photos from the Out100 party below.\n\n\n\n\t\t\t\n\t\t\t\n\tKathy Griffin\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: River Callaway\t\t\t\n\t\t\t\n\tKathy Griffin at the OUT100 Celebration held at nya Studios West on November 21, 2025 in Los Angeles, California.\n\n\t\t\n\t\t\t\n\t\t\t\n\tSia\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: River Callaway\t\t\t\n\t\t\t\n\tSia onstage at the OUT100 Celebration held at nya Studios West on November 21, 2025 in Los Angeles, California.\n\n\t\t\n\t\t\t\n\t\t\t\n\tTonatiuh\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: River Callaway\t\t\t\n\t\t\t\n\tTonatiuh at the OUT100 Celebration held at nya Studios West on November 21, 2025 in Los Angeles, California.\n\n\t\t\n\t\t\t\n\t\t\t\n\tAmber Ruffin\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: River Callaway\t\t\t\n\t\t\t\n\tAmber Ruffin at the OUT100 Celebration held at nya Studios West on November 21, 2025 in Los Angeles, California.\n\n\t\t\n\t\t\t\n\t\t\t\n\tGigi Goode and Symone\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: River Callaway\t\t\t\n\t\t\t\n\tGigi Goode and Symone at the OUT100 Celebration held at nya Studios West on November 21, 2025 in Los Angeles, California.\n\n\t\t\n\t\t\t\n\t\t\t\n\tAnna Camp\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: River Callaway\t\t\t\n\t\t\t\n\tAnna Camp at the OUT100 Celebration held at nya Studios West on November 21, 2025 in Los Angeles, California.\n\n\t\t\n\t\t\t\n\t\t\t\n\tMiles Heizer\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: River Callaway\t\t\t\n\t\t\t\n\tMiles Dominic Heizer at the OUT100 Celebration held at nya Studios West on November 21, 2025 in Los Angeles, California.\n\n\t\t\n\t\t\t\n\t\t\t\n\tSophia Bush and Ashlyn Harris\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: River Callaway\t\t\t\n\t\t\t\n\tSophia Bush and Ashlyn Harris at the OUT100 Celebration held at nya Studios West on November 21, 2025 in Los Angeles, California.\n\n\t\t\n\t\t\t\n\t\t\t\n\tScott Evans\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: River Callaway\t\t\t\n\t\t\t\n\tScott Evans at the OUT100 Celebration held at nya Studios West on November 21, 2025 in Los Angeles, California.\n\n\t\t\n\t\t\t\n\t\t\t\n\tFrankie Grande\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: River Callaway\t\t\t\n\t\t\t\n\tFrankie Grande at the OUT100 Celebration held at nya Studios West on November 21, 2025 in Los Angeles, California. (Photo by River Callaway/Variety via Getty Images)\n\n\t\t\n\t\t\t\n\t\t\t\n\tGuillermo Díaz\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: River Callaway\t\t\t\n\t\t\t\n\tGuillermo Díaz at the OUT100 Celebration held at nya Studios West on November 21, 2025 in Los Angeles, California.\n\n\t\t\n\t\t\t\n\t\t\t\n\tEJ Johnson\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: River Callaway\t\t\t\n\t\t\t\n\tEJ Johnson at the OUT100 Celebration held at nya Studios West on November 21, 2025 in Los Angeles, California.\n\n\t\t\n\t\t\t\n\t\t\t\n\tScott Evans\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: River Callaway\t\t\t\n\t\t\t\n\tScott Evans at the OUT100 Celebration held at nya Studios West on November 21, 2025 in Los Angeles, California.\n\n\t\t\n\t\t\t\n\t\t\t\n\tTonatiuh, Isis King and R.K. Russell\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: River Callaway\t\t\t\n\t\t\t\n\tTonatiuh, Isis King and R.K. Russell at the OUT100 Celebration held at nya Studios West on November 21, 2025 in Los Angeles, California.\n\n\t\t\n\t\t\t\n\t\t\t\n\tVincint\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: River Callaway\t\t\t\n\t\t\t\n\tVINCINT at the OUT100 Celebration held at nya Studios West on November 21, 2025 in Los Angeles, California.\n\n\t\t\n\t\n\t\n\n\n\t\n\t\tMore from Variety\n\t\n\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\n\n\t\t\n\n\t\n\t\tMore From Our Brands\n\t\n\t\n\t\t\n\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\n\tRolling Stone\n\n\t\t\t\t\t‘Zodiac Killer Project’: When Serial-Killer Docs Go Wrong!\t\t\n\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\n\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\n\tRobb Report\n\n\t\t\t\t\tThis $115 Million Miami Spread Is a Tropical Oasis With Multiple Pools and a Private Marina\t\t\n\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\n\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\n\tSportico\n\n\t\t\t\t\tNCAA Rescinds Rule to Allow Betting on Pro Sports Amid Reckoning\t\t\n\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\n\t\t\n\t\n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sia, Kathy Griffin, Amber Ruffin and More Out100 Party Red Carpet Photos",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/MG_3218-1.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-22T16:01:06.000Z",
      "dateModified": "2025-11-22T16:01:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Guess Who These Wickedly Talented Costars Are!",
    "url": "https://www.tmz.com/2025/11/22/guess-who-wickedly-talented-costars/",
    "image": "https://imagez.tmz.com/image/94/16by9/2025/11/19/94bad4da29ae4161813516f8d0f5a9aa_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-22T20:00:33.000Z",
    "description": "\n    \n                    \n                          Guess Who\n                          These Wickedly Talented Costars Are!\n                      \n ",
    "body": "\n    \n                    \n                          Guess Who\n                          These Wickedly Talented Costars Are!\n                      \n                  \n                        Published November 22, 2025 12:00 PM PST\n                                                                            \n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          There's magic in the air this weekend -- can you guess who these wickedly talented co-stars are?\n      \n    \n          We caught the first of these two actresses while she was signing autographs for a few fans, and she was just tickled pink by the whole experience!\n      \n    \n          We also ran into her costar while she was doing the same for a couple of movie fanatics -- and we're green with envy of the folks who managed to score one of her signatures!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Guess Who\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Guess Who These Wickedly Talented Costars Are!",
      "image": [
        "https://imagez.tmz.com/image/94/16by9/2025/11/19/94bad4da29ae4161813516f8d0f5a9aa_xl.jpg"
      ],
      "datePublished": "2025-11-22T20:00:33.000Z",
      "dateModified": "2025-11-22T20:00:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ariana Grande -- Can You Find The \"Wicked\" Differences?!",
    "url": "https://www.tmz.com/2025/11/22/ariana-grande-can-you-find-wicked-differences/",
    "image": "https://imagez.tmz.com/image/c9/16by9/2025/11/19/c97a178e26554c4f9c0afae301cf1880_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-22T08:01:23.000Z",
    "description": "\n    \n                    \n                          Ariana Grande ...\n                          Find The\n                          \"Wicked\" Differenc",
    "body": "\n    \n                    \n                          Ariana Grande ...\n                          Find The\n                          \"Wicked\" Differences!\n                      \n                  \n                        Published November 22, 2025 12:01 AM PST\n                                                                            \n      \n    \n          Waltz up to these stylish shots of Ariana Grande and see if you can tackle the wicked differences! \"You'll hang with the right cohorts\" after you circle in on all this fabulousness!\n      \n    \n          Glinda The Good Witch showed up and showed out for the \"Wicked: For Good\" premiere earlier this week. Grande rocked a black and white gown, definitely the most 'popular' girl in town!\n      \n    \n          Put your hand up if you know the correct answer!\n      \n    \n          HINT: There are THREE differences in the above Ariana Grande photos!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Ariana Grande\n              \n                          \n                Cynthia Erivo\n              \n                          \n                Movies\n              \n                          \n                Photo Galleries\n              \n                          \n                Wicked\n              \n                          \n                What's The Big Frigin' Difference\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ariana Grande -- Can You Find The \"Wicked\" Differences?!",
      "image": [
        "https://imagez.tmz.com/image/c9/16by9/2025/11/19/c97a178e26554c4f9c0afae301cf1880_xl.jpg"
      ],
      "datePublished": "2025-11-22T08:01:23.000Z",
      "dateModified": "2025-11-22T08:01:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Matthew McConaughey Says 'Wet Dream' Led Him to Wife Camila Alves",
    "url": "https://www.tmz.com/2025/11/22/matthew-mcconaughey-wet-dream-leading-him-to-camila-alves/",
    "image": "https://imagez.tmz.com/image/d8/16by9/2025/11/22/d80d5891bbad4ba98bd7cfed7a7ea54a_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-22T19:44:07.000Z",
    "description": "\n    \n                    \n                          Matthew McConaughey\n                          How to Land A Wife in 10 Days ...\n                 ",
    "body": "\n    \n                    \n                          Matthew McConaughey\n                          How to Land A Wife in 10 Days ...\n                          Look In Your Wet Dreams!!!\n                      \n                  \n                        Published November 22, 2025 11:44 AM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Matthew McConaughey was feeling way more than \"alright, alright, alright\" during a dream one night ... revealing he ejaculated in his sleep ... and it led him to his wife, Camila Alves!\n      \n    \n          The actor made his emission admission in his “Lyrics of Living” newsletter Friday, according to Us Weekly ... explaining he had laid his head down on the pillow one night and dreamt about his 88th birthday, where he was surrounded by 22 women and 88 children -- having fathered one child for each year of his life.\n      \n    \n          McConaughey claims the women all knew each other well ... and they all shared happy times and good memories -- no green-eyed monster jealously rearing its ugly head at the affair.\n      \n\n          He then writes, \"They all gathered around me on the porch for a family photograph, and we looked toward a large-format box camera on a tripod at the top of the driveway. Three! Two! One! Then I came.”\n      \n    \n          Bizarre, right? Except Matthew says he learned a lesson \"Ghosts of Girlfriend's Past\" style ... realizing he didn't want to be a bachelor forever -- he wanted to be a father and a partner.\n      \n    \n          McConaughey says he stopped looking for the perfect woman ... allowing the universe to simply work its magic instead -- and, just a few months later, he met Camila, the only woman he says he's \"ever wanted to take on a date, sleep with, or wake up next to. \"\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Matthew and Camila met in 2006 and welcomed two children together before they married in 2012, and a third just months after tying the knot.\n      \n    \n          Moral of the story ... big life lessons can hit when ya least expect it ... just make sure to shower off after they do.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Camila Alves\n              \n                          \n                Matthew McConaughey\n              \n                          \n                Celebrity News\n              \n                          \n                Relationships\n              \n                          \n                Fairly Legal\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Matthew McConaughey Says 'Wet Dream' Led Him to Wife Camila Alves",
      "image": [
        "https://imagez.tmz.com/image/d8/16by9/2025/11/22/d80d5891bbad4ba98bd7cfed7a7ea54a_xl.jpg"
      ],
      "datePublished": "2025-11-22T19:44:07.000Z",
      "dateModified": "2025-11-22T19:44:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'The Time' Musician Jellybean Johnson Dead at 69",
    "url": "https://www.tmz.com/2025/11/22/musician-jellybean-johnson-dead/",
    "image": "https://imagez.tmz.com/image/f5/16by9/2025/11/22/f53476990e194774a0171f56f84359f3_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-22T15:18:59.000Z",
    "description": "\n    \n                    \n                          Jellybean Johnson\n                          'The Time' Drummer Dead at 69\n                      \n",
    "body": "\n    \n                    \n                          Jellybean Johnson\n                          'The Time' Drummer Dead at 69\n                      \n                  \n                        Published November 22, 2025 7:18 AM PST\n                                                                      |\n                Updated November 22, 2025 9:21 AM PST\n                                    \n      \n    \n          Jellybean Johnson -- best known for being a founding member of Prince's band The Time -- has died.\n      \n    \n          Jellybean -- real name Garry George Johnson -- died suddenly Friday night, his family tells TMZ. The cause of death is currently unknown.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Aside from being the one and only drummer in The Time -- which later changed its name to Morris Day and the Time and the Original 7ven -- the late musician is known for being a leading innovator in what became known as the Minneapolis Sound -- a funk, rock and soul movement in the 1970s and '80s.\n      \n    \n          Jellybean was also a member of the Prince-formed group The Family, and vocalist Susannah Melvoin paid tribute to her \"brother\" on Instagram following his unexpected death. She remembered him as a prolific guitarist, noting ... \"oxygen for him was the inhale and exhale of playing his guitar.\"\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Adding to his accomplishments, he also played a fictionalized version of himself in the 1984 \"Purple Rain\" movie and helped produce Janet Jackson's 1990 No. 1 hit single \"Black Cat.\"\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          His family tells TMZ Jellybean loved his family, his friends, and the city of Minneapolis. He is the founder -- along with his longterm partner of more than 20 years, Marty Bragg, and her daughter -- of the Minneapolis Sound Museum, meant to preserve the history and legacy of the Minneapolis Sound. Fans can learn more and donate on the museum's website.\n      \n    \n          Jellybean had just celebrated his 69th this week.\n      \n    \n          RIP\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Jellybean Johnson\n              \n                          \n                Celebrity News\n              \n                          \n                RIP\n              \n                          \n                Music\n              \n                          \n                Fairly Legal\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'The Time' Musician Jellybean Johnson Dead at 69",
      "image": [
        "https://imagez.tmz.com/image/f5/16by9/2025/11/22/f53476990e194774a0171f56f84359f3_xl.jpg"
      ],
      "datePublished": "2025-11-22T15:18:59.000Z",
      "dateModified": "2025-11-22T15:18:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "JFK's Granddaughter Tatiana Schlossberg Reveals Terminal Cancer Diagnosis",
    "url": "https://www.tmz.com/2025/11/22/jfk-granddaughter-tatiana-schlossberg-terminal-cancer/",
    "image": "https://imagez.tmz.com/image/4c/16by9/2025/11/22/4c764367dde84bcdbfe0777882dd064b_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-22T19:58:31.000Z",
    "description": "\n    \n                    \n                          Tatiana Schlossberg\n                          JFK's Granddaughter Diagnosed with Terminal Cancer\n",
    "body": "\n    \n                    \n                          Tatiana Schlossberg\n                          JFK's Granddaughter Diagnosed with Terminal Cancer\n                      \n                  \n                        Published November 22, 2025 11:58 AM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Tatiana Schlossberg -- John F. Kennedy's granddaughter -- has terminal cancer ... and has about a year to live, according to her docs.\n      \n    \n          Tatiana, the 35-year-old daughter of Caroline Kennedy and Edwin Schlossberg, revealed she was diagnosed with acute myeloid leukemia in an essay published by The New Yorker Saturday morning. Her form of leukemia has a rare mutation called Inversion 3, making it harder to treat.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          She was diagnosed just hours after giving birth to her 2nd child in May 2024, when her doctor noticed her abnormally high white-blood-cell count. Instead of being discharged with her newborn daughter, she spent 5 weeks at Columbia Presbyterian receiving chemotherapy.\n      \n\n          She was briefly able to go through treatment at home, but then spent 50 days at Memorial Sloan Kettering for a bone-marrow transplant before being released back home with family for additional treatment.\n      \n    \n          Tatiana joined a clinical trial of CAR-T-cell therapy, a type of immunotherapy she said has proved effective against certain blood cancers, in January. With all the effort, she was told she might have a year left to live by her docs.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          The environmental journalist and author also recalled how frightening a time it was when her cousin, Robert F. Kennedy, Jr., was confirmed as the Secretary of Health and Human Services. Shortly after, doctors and scientists at Columbia -- including her husband, George -- had no idea if they'd have a job ... and she didn't know if she'd have medical insurance.\n      \n    \n          She also slammed RFK as an embarrassment to her family over his stance on vaccines and decision to defund medical research as he took over the department.\n      \n    \n          Tatiana is now focused on being present with her family, though she admits it's harder than most would think. She also finds herself reliving memories from throughout her life, noting ... \"Sometimes I trick myself into thinking I’ll remember this forever, I’ll remember this when I’m dead.\"\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Tatiana Schlossberg\n              \n                          \n                John F. Kennedy\n              \n                          \n                Celebrity News\n              \n                          \n                Politix\n              \n                          \n                Fairly Legal\n              \n                          \n                Health\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "JFK's Granddaughter Tatiana Schlossberg Reveals Terminal Cancer Diagnosis",
      "image": [
        "https://imagez.tmz.com/image/4c/16by9/2025/11/22/4c764367dde84bcdbfe0777882dd064b_xl.jpg"
      ],
      "datePublished": "2025-11-22T19:58:31.000Z",
      "dateModified": "2025-11-22T19:58:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]