[
  {
    "title": "China Box Office: ‘Zootopia 2’ Remains on Top, ‘Avatar: Fire and Ash’ Places Third",
    "url": "https://variety.com/2026/film/box-office/china-box-office-zootopia-2-avatar-fire-and-ash-1236629176/",
    "image": "https://variety.com/wp-content/uploads/2025/11/MCDZOTW_WD006.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-12T07:51:07.000Z",
    "description": "\n\tChina’s theatrical market cooled further in the Jan. 9–11 frame, with Disney’s “Zootopia 2” holding on to the No. 1 spot for a second consecutive we",
    "body": "\n\tChina’s theatrical market cooled further in the Jan. 9–11 frame, with Disney’s “Zootopia 2” holding on to the No. 1 spot for a second consecutive weekend after it reclaimed pole position last week.\n\n\t“Zootopia 2” added RMB49.1 million ($6.9 million), according to Artisan Gateway, lifting its cumulative total to RMB4.31 billion ($607.2 million). \n\n\tMaoyan Movie’s crime thriller “The Fire Raven” stayed close behind in second place, earning $6.8 million. The film continued to show solid traction, pushing its running total to $42.3 million after less than two weeks in release. Directed and written by Sam Quah, the film stars Peng Yuchang, Alan Aruna and Chang Ning and follows the reopening of a long-dormant murder case that exposes a wider network of corruption and revenge.\n\t\n\n\tJames Cameron’s sci-fi epic “Avatar: Fire and Ash” moved to third, grossing $6.5 million over the weekend. The 20th Century Studios release has now reached $146.6 million in China.\n\n\n\tHuace Film & TV’s “Back to the Past” placed fourth with $4.9 million, taking its cumulative haul to $33.7 million. The feature film adaptation of Hong Kong broadcaster TVB’s 2001 historical sci-fi series “A Step Into the Past” is produced by Louis Koo‘s One Cool Film Production, with Koo serving as producer. The project reunites the principal cast from the original television series 24 years after it first aired. Koo stars alongside Raymond Lam, Jessica Hsuan, Sonija Kwok, Joyce Tang and Michelle Saram, all reprising their original roles. New cast members include Bai Baihe, Michael Miu and Louis Cheung. The film marks the final screen appearance of the late Dick Liu Kai-chi.\n\t\n\n\tRounding out the top five was Chuanqiren Media’s family drama “Unexpected Family,” which collected $900,000 million and stands at $5.5 million to date. The comedy-drama is co-written and directed by Li Taiyan and centers on a young man who leaves his small town for Beijing and ends up entangled with an elderly man with Alzheimer’s who mistakes him for his son. The film stars Jackie Chan, Peng Yuchang, Zhang Jianing and Pan Binlong.\n\n\tOverall, the China box office generated $31.6 million for the weekend. Year-to-date takings for 2026 have reached $162.4 million, running 9.9% ahead of the same period last year, though the market is clearly settling into a quieter post-festive rhythm with an eye on the Lunar New Year holiday next month when several big ticket releases are expected to bow. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "China Box Office: ‘Zootopia 2’ Remains on Top, ‘Avatar: Fire and Ash’ Places Third",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/MCDZOTW_WD006.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-12T07:51:07.000Z",
      "dateModified": "2026-01-12T07:51:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Hudson Williams’ Serpent Necklace Was a Nod to His Own Snake Tattoo",
    "url": "https://variety.com/2026/shopping/news/hudson-williams-golden-globes-serpent-necklace-1236628844/",
    "image": "https://variety.com/wp-content/uploads/2026/01/GettyImages-2255254239.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-12T04:31:53.000Z",
    "description": "\n\tFor Hudson Williams, the Golden Globes is a finale of sorts to a hall-of-fame press tour since shooting to global stardom as Shane Hollander in “Hea",
    "body": "\n\tFor Hudson Williams, the Golden Globes is a finale of sorts to a hall-of-fame press tour since shooting to global stardom as Shane Hollander in “Heated Rivalry.”  The newly appointed heartthrob of Hollywood met the moment on Sunday night, wearing a Georgio Armani white suit jacket styled with an open neckline, deliberately skipping a shirt and tie to showcase a gold serpent necklace.\n\n\tThe sinuous statement necklace was actually partly inspired by Williams’ own snake tattoo. “He has a keen liking of them so it seemed to be a natural fit,” stylist Anastasia Walker, who dressed him for the Globes, tells Variety. \n\n\n\tPart of Bulgari’s emblematic Serpenti collection, the Tubogas design coils in yellow gold with pavé-set diamonds and onyx accents, using the brand’s signature serpent-inspired motif that’s rooted in mythic symbolism of wisdom, seduction and transformation. The serpent theme has been central to Bulgari since its launch in 1948, with the flexible Tubogas technique allowing the gold to wrap fluidly. It’s also not the first time serpentine jewelry has been worn during an awards show. Last year, Walton Goggins wore multiple pieces of snake-themed jewelry at the 2025 Emmy Awards as a nod to a pivotal plotline in his season of “The White Lotus.”\n\n\tAs for the ensemble as a whole,  Walker says she already has a “good understanding of what silhouettes Hudson gravitates towards so this look was carefully selected with that in mind: Classic with a dose of sex.”\n\n\tWilliams’ fashion journey didn’t start at the Globes: during “The Tonight Show Starring Jimmy Fallon” appearance earlier in the week, Williams shifted gears in an all-black Balmain ensemble consisting of a tailored jacket and coordinating pieces, also styled by Walker. His most headlining fashion moment was a straight-off-the-runway burgundy leather jacket from Todd Snyder that he wore on the streets of New York City last week.\n\n\n\tWhile his “Heated Rivalry” press tour might be coming to a close (for now), he’s already given us a plethora of fashion inspiration to pull from until Season 2 — as well as many more red carpet moments in his future. \n\n\tShop the exact Bulgari necklace worn by Williams below (in addition to a few more affordable dupes):\n\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\n\t\t\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\t\t\n\n\t\t\t\t\t\t\t\t\t\tNO. 1 BESTSELLER\t\t\t\t\t\t\n\n\t\t\t\t\tPetit Moments Snake Chain Necklace\t\t\n\n\t\t\n\t\n\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Hudson Williams’ Serpent Necklace Was a Nod to His Own Snake Tattoo",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/GettyImages-2255254239.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-12T04:31:53.000Z",
      "dateModified": "2026-01-12T04:31:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sweden’s Göteborg Film Festival Introduces Lie Detector ",
    "url": "https://variety.com/2026/film/global/goteborg-festival-lie-detector-test-focus-truth-1236628342/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Goteborg-Film-Festival-Truth-Tickets.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-12T06:00:00.000Z",
    "description": "\n\tSweden’s Göteborg Film Festival, the biggest film-TV event in the Nordic countries, is introducing  a lie detector test, to point up the event’s cen",
    "body": "\n\tSweden’s Göteborg Film Festival, the biggest film-TV event in the Nordic countries, is introducing  a lie detector test, to point up the event’s central 2026 debating point: Truth.\n\n\tInside an interrogation room built for the occasion, members of the public will undergo a polygraph examination conducted by a real-life specialist, Ørjan Hesjedal, the festival announced Monday. \n\n\n\tThe “high-pressure scenario inspired by investigative environments – complete with cameras, lighting and physiological monitoring” – is voluntary, though likely to prove very popular. \n\t\n\n\tIt’s also in the vein of other live-event simulations which are weirdly of the moment and turn on high human-stake issues. Most memorably, in 2021, as the pandemic still raged in parts of the world, Swedish emergency nurse Lisa Enroth was selected from thousands of applicants to spend seven days at the Pater Noster Lighthouse, now a luxury boutique hotel on the isolated island of Hamneskär, off the coast of western Sweden. She had no computer nor mobile but the ability to binge 60 films from the Göteborg Festival’s program. \n\n\n\n\n\n\tThat initiative reflected on social distancing and the increasingly sole experience of film and TV consumption. The lie detector test will launch as the Festival asks what it calls a “simple but radical question: What is truth worth today?”\n\n\tIn a real life departure, cynics would say, truth is rewarded in the tests. Audience members who tell the truth and are found to do so will receive a Truth Ticket, granting access to a festival screening. \n\t\n\n\t“Truth has become strangely negotiable in our time. By turning truth into a currency, we assign it a tangible value that is rarely emphasised. We want to create an experiment where lying has consequences,” said Göteborg Artistic Director Pia Lundberg.“By turning truth into something you can earn – and spend – the festival assigns it a tangible value rarely acknowledged in the real world. In a time when personal narratives often overshadow factual truth, Truth Tickets reframes honesty as something with substance, consequence and worth,” the festival added Monday.\n\n\tIn another stunt, the Festival released on Monday a YouTube black comedy clip in which Alexander Karim (“The Swarm”) plays a lollipop-licking interrogator who reflects in a grimy torturer’s basement on how to measure truth. As his assistant, another Swedish star, David Dencik (“Pressure Point”), demonstrates on himself with a slightly deranged over-readiness two torture techniques. \n\n\tAs another part of its Truth Focus, the Göteborg Festival will screen a showcase of films exploring the issue. These include Kaouther Ben Hania’s high-profile Oscar-shortlisted docudrama “The Voice of Hind Rajab,”; political spin satire “No Comment,” from Norway’s Petter Næss; Kirill Serebrennikov’s Cannes Premiere title “The Disappearance of Josef Mengele” and Jim Sheridan and David Merriman “Re-Creation,” hailed by Variety as a “terrific” juror room drama, reviving the spirit of Sidney Lumet’s 1957 classic “12 Angry Men.”    \n\n\tThe 49th edition of the Göteborg Film Festival runs Jan. 23 to Feb. 1.\n\n\n\n\t\n\n\t\t\t\t\tGöteborg Film Festival Truth Tickets (L-R) David Dencik, Alexander Karim as two interrogators\n\t\t\t\t\t\t\t\t\tCourtesy of the Göteborg Film Festival\n\t\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sweden’s Göteborg Film Festival Introduces Lie Detector ",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Goteborg-Film-Festival-Truth-Tickets.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-12T06:00:00.000Z",
      "dateModified": "2026-01-12T06:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Wagner Moura Makes Golden Globes History as First Brazilian Actor to Win Best Actor in a Drama Film ",
    "url": "https://variety.com/2026/film/news/wagner-moura-golden-globes-best-actor-drama-1236627412/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Wagner-Moura-Golden-Globe-Win-2.jpg?crop=0px%2C0px%2C1200px%2C675px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-01-12T04:06:19.000Z",
    "description": "\n\t“The Secret Agent” star Wagner Moura won the Golden Globe for best actor in a drama at Sunday night’s star-studded awards ceremony, making history a",
    "body": "\n\t“The Secret Agent” star Wagner Moura won the Golden Globe for best actor in a drama at Sunday night’s star-studded awards ceremony, making history as the first Brazilian actor to ever win in this category.\n\n\t“‘The Secret Agent’ is a film about memory — or the lack of memory — and generational trauma. I think that if trauma can be passed along generations, values can too,” Moura said in his acceptance speech. “So this is to the ones that are sticking with their values in difficult moments.”\n\t\n\n\tMoura was nominated alongside Joel Edgerton (“Train Dreams”), Oscar Isaac (“Frankenstein”), Dwayne Johnson (“The Smashing Machine”), Michael B. Jordan (“Sinners”) and Jeremy Allen White (“Springsteen: Deliver Me From Nowhere”). He had previously been nominated for best actor in a TV series — drama for his work on “Narcos.” In addition to being the first Brazilian winner, Moura was also the first Brazilian performer to be nominated in the best actor – drama category.\n\n\n\tThe Golden Globes, held at the Beverly Hilton in Los Angeles, was hosted by comedian Nikki Glaser, who returned as emcee for the second year in a row.  Variety parent company PMC owns Golden Globes producer Dick Clark Prods. in a joint venture with Eldridge. In addition to Moura’s nomination, “The Secret Agent” is nominated for best motion picture — drama, the first Brazilian production recognized in the category, and best foreign language film.\n\n\tIn “The Secret Agent,” set in 1977 Brazil under military rule, Moura stars as technology expert and political dissident, attempting to flee persecution and resist an authoritarian deceitful regime.\n\t\n\n\tThe political thriller, from filmmaker Kleber Mendonça Filho, debuted to massive acclaim at the Cannes Film Festival, becoming the year’s most-awarded title at the fest: Moura won the best actor award; Mendonça Filho was named best director; and the film won both the Art House Cinema Award and the FIPRESCI Prize for best film.\n\n\tMoura has been nominated for a slew of awards for the role, including at the Gotham Awards, the Satellite Awards, the Critics Choice Awards, among other nominations from guilds and critics groups.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Wagner Moura Makes Golden Globes History as First Brazilian Actor to Win Best Actor in a Drama Film ",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Wagner-Moura-Golden-Globe-Win-2.jpg?crop=0px%2C0px%2C1200px%2C675px&resize=1000%2C563"
      ],
      "datePublished": "2026-01-12T04:06:19.000Z",
      "dateModified": "2026-01-12T04:06:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jessie Buckley Wins Golden Globe for ‘Hamnet’ and Thanks the Film’s Grip for Making Soup on Set: ‘This Is Not a Normal Feeling or Situation to Be In’",
    "url": "https://variety.com/2026/film/news/jessie-buckley-wins-golden-globe-best-actress-drama-1236627408/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Jesse-Buckly-Golden-Globe-Win-2.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-12T04:05:55.000Z",
    "description": "\n\t“Hamnet” star Jessie Buckley won the Golden Globe for best actress in a drama at Sunday night’s star-studded awards ceremony.\n\n\tThe win continues a ",
    "body": "\n\t“Hamnet” star Jessie Buckley won the Golden Globe for best actress in a drama at Sunday night’s star-studded awards ceremony.\n\n\tThe win continues a streak for Buckley, who won the Critics Choice award for her performance last weekend, and has also been nominated for the Screen Actors Guild’s Actor Awards.\n\n\tBuckley was nominated alongside Jennifer Lawrence (“Die My Love”), Renate Reinsve (“Sentimental Value”), Julia Roberts (“After the Hunt”), Tessa Thompson (“Hedda”) and Eva Victor (“Sorry, Baby”). This was Buckley’s first Golden Globe nomination.\n\t\n\n\tIn her acceptance speech, Buckley began by saying, “This is not a normal feeling or situation to be in, but thank you, Golden Globes, thank you Focus and everybody who supported this film.” She then thanked many of her collaborators on the film, with a special shoutout reserved for the film’s key grip, Tomasz Sternicki. \n\n\n\t“I found [Tomasz] one day at the back of his truck, and he was chopping up potatoes and onions and meat. He was making — and he brought his ginormous cast iron pot over from Poland — and he was making soup. And this soup started turning up on set, so it was delicious.” \n\n\tIn “Hamnet,” Buckley plays Agnes Shakespeare as she falls in love with a poor Latin tutor named William (Paul Mescal), who goes on to become the famed playwright. The historical fiction story follows the Shakespeares’ love story as they wed and have three children, but tragedy strikes when their only son, 11-year-old Hamnet, dies from the plague. The film, directed by Oscar winner Chloé Zhao, explores the family’s grief over the devastating loss and how the tragedy inspired Shakespeare’s play “Hamlet.”\n\t\n\n\tThe Focus Features film earned six nominations at this year’s Golden Globes, including best motion picture drama, best supporting actor (Mescal), best director (Zhao), best screenplay (Zhao and Maggie O’Farrell) and best original score (Max Richter). It went on to win best drama in addition to Buckley’s award.\n\n\t“Hamnet” debuted at the Telluride Film Festival in August, where Buckley’s devastating performance was hailed as her best work to date. The actress previously starred in “Women Talking,” “Wild Rose” and “The Lost Daughter,” for which she earned a best supporting actress Oscar nod; she will next be seen starring in “The Bride!”\n\n\tVariety parent company PMC owns Golden Globes producer Dick Clark Prods. in a joint venture with Eldridge.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jessie Buckley Wins Golden Globe for ‘Hamnet’ and Thanks the Film’s Grip for Making Soup on Set: ‘This Is Not a Normal Feeling or Situation to Be In’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Jesse-Buckly-Golden-Globe-Win-2.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-12T04:05:55.000Z",
      "dateModified": "2026-01-12T04:05:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Golden Globes Snubs and Surprises: Ryan Coogler’s ‘Sinners’ Script Passed Over; Teyana Taylor and Wagner Moura Triumph and More",
    "url": "https://variety.com/2026/awards/features/golden-globes-snubs-surprises-2026-1236628827/",
    "image": "https://variety.com/wp-content/uploads/2026/01/MixCollage-11-Jan-2026-11-21-PM-2128-e1768191737335.jpg?crop=0px%2C61px%2C2955px%2C1662px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-01-12T04:15:00.000Z",
    "description": "\n\tThe Golden Globes are over, but we still have a few burning questions: What stars took most advantage of the open bar? How many “Heated Rivalry” jok",
    "body": "\n\tThe Golden Globes are over, but we still have a few burning questions: What stars took most advantage of the open bar? How many “Heated Rivalry” jokes were cut? Did CBS Evening News anchor Tony Dokoupil consider ending the show with a monologue making it all about himself? We may never know, but check out the night’s biggest snubs and surprises below.\n\t\n\t\tSurprise: Teyana Taylor wins best supporting actress over tight competition\t\n\n\tWhile “Sentimental Value” star Inga Ibsdotter Lilleaas was the pundit pick and Amy Madigan’s villainous turn in “Weapons” gained steam in the race, Taylor secured the Globes win for her explosive performance in “One Battle After Another.” \n\t\n\t\n\t\tSnub: Best original score not shown on television\t\n\n\tThere are a zillion awards — find room for one more! The “Smartless” bit took forever… substitute this in for that!\n\n\t\n\t\tSurprise: Wagner Moura moves past A-listers for best actor in a motion picture, drama win\t\n\n\t“The Secret Agent” has been gaining heat during this award season, and its Brazilian star was able to overtake big names such as Oscar Isaac, Dwayne Johnson and Michael B. Jordan for the Globe.\n\t\n\t\tSnub: Ryan Coogler loses to Paul Thomas Anderson in screenplay race\t\n\n\tIt was widely believed that Coogler would take script honors for “Sinners” and Anderson would grab the directing Globe for “One Battle After Another,” but that wasn’t the case.\n\t\n\t\tSurprise: Michelle Williams takes best actress in a TV series (limited), but wasn’t there to accept the award\t\n\n\tSarah Snook’s turn in “All Her Fault” was predicted by award prognosticators as the winner in this starry category, which also included turns from Claire Danes, Rashida Jones, Amanda Seyfried and Robin Wright. Yet Williams’ performance as Molly Kochan in “Dying for Sex” landed her the Globe.\n\t\n\t\n\t\tSnub: No clips from films for the first hour\t\n\n\tGive us a taste of the movies — it always makes the night feel more special! After all, the podcast nominations got clips!\n\t\n\t\tSurprise: Amy Poehler takes the first-ever podcast Globe\t\n\n\tHer podcast is very charming, but it’s wild that it began on March 18, 2025.\n\t\n\t\tSurprise: The DJ bringing some heat with interstitial music.\t\n\n\tWatching Stellan Skarsgård take the stage to Usher’s “Yeah!” was a deliriously surreal moment, along with Macaulay Culkin taking the stage to Mark Morrison’s “Return of the Mack.”\n\n\tVariety parent company PMC owns Golden Globes producer Dick Clark Prods. in a joint venture with Eldridge. Polymarket is the exclusive prediction market partner of the Golden Globes.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Golden Globes Snubs and Surprises: Ryan Coogler’s ‘Sinners’ Script Passed Over; Teyana Taylor and Wagner Moura Triumph and More",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/MixCollage-11-Jan-2026-11-21-PM-2128-e1768191737335.jpg?crop=0px%2C61px%2C2955px%2C1662px&resize=1000%2C563"
      ],
      "datePublished": "2026-01-12T04:15:00.000Z",
      "dateModified": "2026-01-12T04:15:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nikki Glaser Honors Rob Reiner at Golden Globes With ‘Spinal Tap’ Hat: ‘This One Went to 11’",
    "url": "https://variety.com/2026/film/news/rob-reiner-golden-globes-nikki-glaser-1236625145/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Nikki-Glaser-ROb-Reiner-Tribute-Golden-Globes.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-12T04:30:29.000Z",
    "description": "\n\tRob Reiner was honored at the 2026 Golden Globes by host Nikki Glaser during the last moments of the broadcast. The ceremony took place just under o",
    "body": "\n\tRob Reiner was honored at the 2026 Golden Globes by host Nikki Glaser during the last moments of the broadcast. The ceremony took place just under one month since “The Princess Bride” and “This Is Spinal Tap” director was killed alongside his wife, Michele Singer. The couple’s son, Nick, has been arrested in connection with their deaths.\n\n\tAs she was closing the show, Glaser wore a “Spinal Tap” baseball cap, and said of the ceremony that “This one went to 11.” That, of course, is a riff on the famous bit from Reiner’s 1984 comedy classic, in which the band’s amps go up to 11, in case they “need that extra push over the cliff.”\n\t\n\n\tThe Golden Globes was the second awards ceremony this season to pay tribute to Reiner. The Critics Choice Awards, which aired Jan. 4, took a moment to honor the late director during host Chelsea Handler’s opening monologue.\n\n\n\t“Everyone in this room knows that the nicest guy in Hollywood was Rob Reiner,” Handler told the crowd. “Anyone who ever spent time with Rob Reiner knows that the minute you met him, he felt like an old friend when you were in a conversation with him. He was present, he was focused, and he was funny, and he would ask you tons of questions, whether you were discussing politics or film or the latest beauty trends. He was all in after I sent him a text thanking him for dinner a few months ago. He texted me back and said, ‘We had so much fun with you last night. Thanks for explaining so much about plastic surgery. It was very edifying.’”\n\n\t“Rob and Michele were tireless in their efforts to so many important causes, all stemming from one basic idea: Decency, and that we should all look out for each other,” Handler continued. “I think we can all agree that we definitely need more of that. So let’s use tonight as a reminder of that decency and as a reminder of everything Rob and Michele represented and fought so hard for.”\n\t\n\n\tIn the aftermath of Reiner’s death, many of his former collaborators issued statements honoring his legacy and friendship. A group of his closest Hollywood friends, including Billy Crystal, Larry David, Martin Short and Albert Brooks, released a joint statement in which Reiner was praised not only as “a great comic actor” but also a “master storyteller.”\n\n\tVariety parent company PMC owns Golden Globes producer Dick Clark Prods. in a joint venture with Eldridge.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nikki Glaser Honors Rob Reiner at Golden Globes With ‘Spinal Tap’ Hat: ‘This One Went to 11’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Nikki-Glaser-ROb-Reiner-Tribute-Golden-Globes.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-12T04:30:29.000Z",
      "dateModified": "2026-01-12T04:30:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘The Studio’ Season 2 Starts Filming Next Week, Seth Rogen Confirms",
    "url": "https://variety.com/2026/tv/news/the-studio-season-2-filming-next-week-seth-rogen-1236629116/",
    "image": "https://variety.com/wp-content/uploads/2024/11/The-Studio-Seth-Rogen-Apple.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-12T04:47:32.000Z",
    "description": "\n\tFresh off its Golden Globe win for best comedy or musical TV series, Apple TV’s “The Studio” is heading back behind the cameras next week. That’s th",
    "body": "\n\tFresh off its Golden Globe win for best comedy or musical TV series, Apple TV’s “The Studio” is heading back behind the cameras next week. That’s the word from series star and executive producer Seth Rogen, who told press backstage at Sunday’s kudocast.\n\n\tEpisode 8 of the Lionsgate-produced series’ Season 1 took place at the Golden Globes, so Sunday night’s actual show made things a bit surreal for Rogen and company as the show picked up multiple awards. Rogen also hinted that Season.2 might even make a return trip to the Globes, noting that some things that happened during the evening at the Beverly Hilton might even inspire events that transpire in Season 2.\n\t\n\n\t“We’ve literally written some things that happened leading up to this award show into episodes as we’ve been writing the show. We start shooting in a week,” he said. “So yes, several things have happened, both today and leading up to this event that we have written directly into the show, and you’ll probably know what they are when you see them.”\n\n\n\tRogen said that could include cameos by people who came up to him during the Globes, pitching themselves to make appearances in Season 2.\n\n\t“A lot of people literally just come up to us and were like, ‘Put me on your show. I’ll do anything. I’ll walk by!'” Rogen said. “It’s very lovely. The head of Sony, Tom [Rothman, the chairman and CEO of the Sony Pictures Motion Picture Group]. I love that real studio heads want to be on the show.”\n\n\tThe execs were perhaps inspired by the appearance of Netflix co-CEO Ted Sarandos in Season 1. “Ted kind of ruined it for everyone. But yeah, there’s a few people we roped in tonight. This is good poaching ground for us.” \n\t\n\n\tBesides the win for best comedy/musical series, Rogen also won for best actor in a TV comedy. That came months after “The Studio” Globes episode, which recruited actors like Jean Smart and Adam Scott in addition to Sarandos to play sent-up versions of themselves. \n\n\t“This is so weird! We just pretended to do this. And now it is happening!” Rogen said as he clutched his Golden Globe award. “I thought the only way I would get to hold one is to create a show to give myself a fake one.”\n\n\tThe Globes wins come after “The Studio” also cleaned up at last September’s Emmy Awards, where the show made Emmys history by winning 13 Emmys, breaking the all-time record for most wins for a comedy series. Also, Rogen tied the record for most Emmys won by a single individual in one night.\n\n\t“The Studio” filmed its first season in Los Angeles — and snagged $13.2 million in California tax credits to do the same for Season 2. Reports had previously suggested that production might get underway in December; with the January start date, it’s still unclear when “The Studio” might return to Apple TV for Season 2. (Season 1 aired from March to May 2025.)\n\n\t“The Studio” stars Rogen, Catherine O’Hara, Kathryn Hahn, Ike Barinholtz and Chase Sui Wonders. Executive Producers include Rogen, Evan Goldberg, James Weaver, Alex McAtee, Josh Fagen, Alex Gregory and Peter Huyck.\n\n\t“The Studio” was nominated for three Golden Globes this year. Besides Rogen’s win best performance by a male actor in a television series — musical or comedy and the series win for best TV musical or comedy, O’Hara was nominated for supporting TV actress.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘The Studio’ Season 2 Starts Filming Next Week, Seth Rogen Confirms",
      "image": [
        "https://variety.com/wp-content/uploads/2024/11/The-Studio-Seth-Rogen-Apple.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-12T04:47:32.000Z",
      "dateModified": "2026-01-12T04:47:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Golden Globes’ Strong Winners and Charming Host Were Nearly Derailed by Polymarket Predictions, Podcast Awards and Other Distracting Stunts: TV Review",
    "url": "https://variety.com/2026/tv/reviews/golden-globes-2026-review-1236629162/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Golden-Globes-TV-Review-Nikki-Glaser.jpg?crop=0px%2C0px%2C1200px%2C675px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-01-12T05:40:42.000Z",
    "description": "\n\tOver the last few years, the Golden Globes has made a concerted effort to improve its reputation. Once somewhat infamous for a small voting body eas",
    "body": "\n\tOver the last few years, the Golden Globes has made a concerted effort to improve its reputation. Once somewhat infamous for a small voting body easily influenced by star power, a setup that culminated in a controversy over its membership in 2021 that led to a temporary suspension of the telecast. Five years later, the Globes are under new ownership — now sharing a parent company with Variety — that’s implemented structural changes like overhauling the roster and, as of this year, no longer paying a salary to legacy voters. There have been both stumbles, like a disastrous hosting performance by standup comedian Jo Koy in 2024, and successful course corrections, like hiring Nikki Glaser as MC last year and rightfully asking her back.\n\t\n\n\tBut even as the Globes has worked to clean up its act, the awards show also tried to expand its reach and profitability in often clumsy and confusing ways. At the ceremony’s 83rd iteration on Sunday night, the tension between those two goals was on full display.\n\n\n\tFirst, the positives. Glaser continued to confidently strut the thin and delicate line between landing punches while seeming infectiously excited to be in the Beverly Hilton ballroom. While the repeated professions of love for various celebrities were a little much, they succeeded in getting the in-person audience to laugh along as she called Sean Penn a “sexy leather handbag” who does cocaine around the globe and labeled Jon M. Chu’s blockbuster sequel “Wicked: For Money.” Frequent self-deprecation — “just like Frankenstein, I’ve been pieced together by an unlicensed European surgeon” — created the sense Glaser was happy to take as well as dish. Callbacks to popular bits from last year, like an Adam Sandler impression and the musical spoof “Pope-ular” (now reborn as “KPong,” a mashup of “KPop Demon Hunters” and “Marty Supreme”) felt earned rather than self-indulgent.\n\t\n\n\tThe actual winners, too, offered plenty to feel good about. Teyana Taylor’s joyful tears started the night on a strong note; Wagner Moura’s victory for “The Secret Agent” bookended the show by demonstrating the benefits of the Globes’ international roots. If anything, the selections were rather staid, with incumbent Emmy winners “The Pitt” and “The Studio” taking home the TV series trophies and Oscar frontrunner “One Battle After Another” leading the film categories. The Globes would like no longer to be known as the type of organization that nominates “Emily in Paris” alongside “Schitt’s Creek,” seemingly leading to a new conservative streak. But the show can still anoint breakout talents like Rhea Seehorn in “Pluribus,” reaping the reward of a giddy, delightful speech that spanned beta blockers and the former chicken chain Koo Koo Roo.\n\n\tYet viewers experienced these demonstrations of seriousness amid a slew of distracting stunts. Announcers Kevin Frazier and Marc Malkin didn’t just banter about nominees’ biographies and past nomination histories; they peppered in statistics about projected winners from the online betting platform Polymarket, complete with screen-swallowing graphics. (Disclosure: Malkin is a Variety colleague.) Actual awards like best original score, which went to Ludwig Goransson of “Sinners,” were shunted to commercial break to make room for awkward non-jokes like having UFC fighters strut across the stage as “extra security” for the stars of “Heated Rivalry.” At least have them accompany the guys onstage for pretense’s sake! A soundtrack of bland Top 40 hits led to dissonant juxtapositions like Stellan Skarsgard taking the stage to Usher’s “Yeah!”, or the team behind “The Secret Agent” walking up to Rihanna’s “Pon de Replay.” While a banger, the 2005 hit didn’t really set the tone for discussing a political thriller about life under fascism.\n\n\tThis clunkily commercial-minded tendency applied not just to the production, but to the honors themselves. The best podcast category, a nonsensical and new inclusion that pitted celebrity chat show “Smartless” against the NPR news digest “Up First,” was presented with lengthy clips for each nominee, while the more established acting ones had to go without. (For some reason, best screenplay also came with clips, a decision that was less cynically promotional and more bafflingly inconsistent.) Winner Amy Poehler, herself a four-time Globes host, was almost bashful in her acceptance, acknowledging her recent arrival to the medium. With no disrespect to the delightful “Good Hang,” the show makes for a more intuitive bridge between a Hollywood-centric event and a new source of attention and advertising than the likes of “Up First,” which could contextualize its triumph. \n\t\n\n\tThe idea of honoring “box office achievement” got practically laughed out of the Oscars when it was briefly floated a few years ago. Its inclusion in the Globes thus reinforces the very reputation as the Academy Awards’ less serious little cousin that the show is trying to move away from. Ryan Coogler’s “Sinners,” which exceeded all financial expectations, is about as worthy a winner as the Globes could find, but the film was nonetheless nominated alongside releases that had no box office (“KPop Demon Hunters”) or weren’t even released at the time of nomination (“Avatar: Fire and Ash”). As with podcasting, the fuzziness of criteria only hurt the end product, putting the inclusion of popular work above any consistent rationale for doing so.\n\n\tGrowth can mean a couple of things: maturation, or just the simple act of getting bigger. The Globes is trying to do both at the same time, but the latter threatens to come at the expense of the former. Tame yet respectable choices are at odds with sponsored content for legalized gambling, or an unending ramble by Judd Apatow. Chasing too many contradictory aims at once ends up frustrating all of them. \n\n\tVariety parent company PMC owns Golden Globes producer Dick Clark Prods. in a joint venture with Eldridge.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Golden Globes’ Strong Winners and Charming Host Were Nearly Derailed by Polymarket Predictions, Podcast Awards and Other Distracting Stunts: TV Review",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Golden-Globes-TV-Review-Nikki-Glaser.jpg?crop=0px%2C0px%2C1200px%2C675px&resize=1000%2C563"
      ],
      "datePublished": "2026-01-12T05:40:42.000Z",
      "dateModified": "2026-01-12T05:40:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Golden Globes 2026 Winners: ‘One Battle After Another’ Earns 4 Awards, ‘Adolescence’ Leads TV",
    "url": "https://variety.com/lists/golden-globes-2026-winners-one-battle-after-another/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Paul-Thomas-Anderson-Golden-Globe-WIn.jpg?crop=0px%2C0px%2C1200px%2C675px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-01-12T04:35:35.000Z",
    "description": "\n\n\t“One Battle After Another,” a blistering satire about radical politics, and “Hamnet,” a look at William Shakespeare’s complicated domestic life, to",
    "body": "\n\n\t“One Battle After Another,” a blistering satire about radical politics, and “Hamnet,” a look at William Shakespeare’s complicated domestic life, took top prizes at the 83rd Golden Globe Awards. “The Studio,” a send-up of Hollywood, was named best TV series (musical or comedy) and “The Pitt,” which takes place in an over-stretched hospital, won best TV series (drama). Best limited or anthology series went to “Adolescence,” the story of a murder investigation that unfolds in one shot.\n\n\tThe Globes, unlike the Oscars, delineates films by genre. That meant “One Battle After Another” won best picture (musical or comedy), while “Hamnet” was crowned best picture (drama). It was a big night for Warner Bros. Discovery, which produced “One Battle After Another,” as well as “The Pitt.” “One Battle After Another” scored a leading four prizes, with writer and director Paul Thomas Anderson nabbing trophies for the film’s screenplay and his direction. “Hamnet” won two statues, including best actress for Jessie Buckley’s portrayal of a grieving mother. Focus Features produced the movie.\n\n\t“Adolescence,” which was backed by Netflix, won four prizes in total, the most of any TV show. Its creator Stephen Graham won best actor in a limited series, while Erin Doherty was named best supporting actress in a TV drama for the show. Owen Cooper, their 16-year-old co-star, won best supporting actor in a TV drama, becoming the youngest ever winner in the category.\n\n\tNikki Glaser returned as emcee for the second year in a row. In her opening monologue, she poked fun at everything from Bari Weiss (“CBS news: America’s newest place to ‘See B.S. News.'”) to the Epstein files (“The Golden Globe for best editing goes to… the Justice Department!”) to Warner Bros.’s pending sale to Netflix. She also lampooned Hollywood’s self-obsession, calling the Globes, “without a doubt the most important thing that’s happening in the world right now.”\n\n\tThere were more somber reminders of politics on display. Celebrities such as Mark Ruffalo and Wanda Sykes wore pins to the ceremony with the messages “Ice Out” and “Be Good” to honor the memory of Renée Macklin Good, who was killed by an ICE agent in Minneapolis this week. Several winners also used their time on stage to urge viewers to exhibit compassion and understanding, an apparent nod to the country’s polarization. \n\n\tTop acting honors went to Rose Byrne, named best actress in a musical or comedy for her work as the mother of a child with a pediatric feeding disorder in “If I Had Legs I’d Kick You,” and Timothée Chalamet, who picked up best actor in a musical or comedy prize for playing a ping-pong player in “Marty Supreme.” Chalamet had previously been nominated four times without ever winning.\n\n\t“My dad instilled in me a spirit of gratitude growing up,” Chalamet said. “Always be grateful for what you have. It’s allowed me to leave the ceremony in the past empty-handed with my head held high. I’d be lying if I said those moments didn’t make this moment that much sweeter.”\n\n\tWagner Moura won best actor in a drama for playing a political refugee in “The Secret Agent.” “If trauma can be passed along through generations, values can too,” Moura said. \n\n\tNoah Wyle earned best actor in a TV drama for playing a hard-charging doctor in “The Pitt,” while Rhea Seehorn won best actress in a TV drama for her performance as a novelist confronting an alien virus in “Pluribus.” “I meant to get a prescription for beta blockers but I did not,” Seehorn said. “Sorry!”\n\n\t“The Studio’s” Seth Rogen was named best actor in a TV comedy for his performance as a blundering movie executive in the Apple TV series. Jean Smart won best actress in a TV comedy for her work as a stand-up comic in “Hacks,” marking her third Golden Globe victory. “What can I say, I’m a greedy bitch,” Smart joked. \n\n\tMichelle Williams won her third Golden Globe, this one in the best actress in a limited series category, for her performance as a terminally ill woman in “Dying for Sex.” \n\n\tTeyana Taylor was named best supporting actress for playing a revolutionary in “One Battle After Another,” and Stellan Skarsgård won best supporting actor for his turn as an emotionally remote filmmaker in “Sentimental Value.” Taylor gave one of the night’s most emotional speeches. “To my Brown sisters and little brown girls watching tonight, our softness is not a liability,” Taylor said. “Our depth is not too much. Our light does not need permission to shine. We belong in every room we walk into. Our voices matter and our dreams deserve space.”\n\n\tIn addition to honoring film and television, the Globes recognized podcasts for the first time, handing out the top prize to “Good Hang With Amy Poehler.” “I don’t know about awards shows, but when they get it right, it makes sense,” Poehler joked.\n\n\tStreaming sensation “KPop Demon Hunters” won two honors, including best animated feature and best original song for its anthem, “Golden.” And Brazil’s “The Secret Agent” was named best international feature.\n\n\tSykes, presenting the award for best standup special, trolled Ricky Gervais for his past anti-trans jokes and atheism. The comic wasn’t in the ballroom when he won the Globe for his latest show, “Mortality,” so Sykes accepted his statue while “thanking God and the trans community.” It was Gervais’ second consecutive win in the category.\n\n\t“Sinners,” a vampire film set in the segregated South, won the prize for best cinematic and box office achievement.\n\n\tSee the full list of winners below.\n\n\n\t\t\t\n\t\t\t\n\tBest Motion Picture – Drama\n\t\t\t\t\n\n\tFRANKENSTEIN (Netflix)\n\n\tHAMNET (Focus Features) (WINNER)\n\n\tIT WAS JUST AN ACCIDENT (NEON)\n\n\tTHE SECRET AGENT (NEON)\n\n\tSENTIMENTAL VALUE (NEON)\n\n\tSINNERS (Warner Bros. Pictures)\n\n\t\t\n\t\t\t\n\t\t\t\n\tBest Motion Picture – Musical or Comedy\n\t\t\t\t\n\n\tBLUE MOON (Sony Pictures Classics)\n\n\tBUGONIA (Focus Features)\n\n\tMARTY SUPREME (A24)\n\n\tNO OTHER CHOICE (NEON)\n\n\tNOUVELLE VAGUE (Netflix)\n\n\tONE BATTLE AFTER ANOTHER (Warner Bros. Pictures) (WINNER)\n\n\t\t\n\t\t\t\n\t\t\t\n\tBest Motion Picture – Animated\n\t\t\t\t\n\n\tARCO (NEON)\n\n\tDEMON SLAYER: KIMETSU NO YAIBA INFINITY CASTLE (Aniplex, Crunchyroll, Sony Pictures Entertainment)\n\n\tELIO (Walt Disney Studios Motion Pictures)\n\n\tKPOP DEMON HUNTERS (Netflix) (WINNER)\n\n\tLITTLE AMÉLIE OR THE CHARACTER OF RAIN (GKIDS)\n\n\tZOOTOPIA 2 (Walt Disney Studios Motion Pictures)\n\n\t\t\n\t\t\t\n\t\t\t\n\tCinematic and Box Office Achievement\n\t\t\t\t\n\n\tAVATAR: FIRE AND ASH (Walt Disney Studios Motion Pictures)\n\n\tF1 (Apple Original Films)\n\n\tKPOP DEMON HUNTERS (Netflix)\n\n\tMISSION: IMPOSSIBLE – THE FINAL RECKONING (Paramount Pictures)\n\n\tSINNERS (Warner Bros. Pictures) (WINNERS)\n\n\tWEAPONS (Warner Bros. Pictures, New Line Cinema)\n\n\tWICKED: FOR GOOD (Universal Pictures)\n\n\tZOOTOPIA 2 (Walt Disney Studios Motion Pictures)\n\n\t\t\n\t\t\t\n\t\t\t\n\tBest Motion Picture – Non-English Language\n\t\t\t\t\n\n\tIT WAS JUST AN ACCIDENT (NEON) – FRANCE\n\n\tNO OTHER CHOICE (NEON) – SOUTH KOREA\n\n\tTHE SECRET AGENT (NEON) – BRAZIL (WINNER)\n\n\tSENTIMENTAL VALUE (NEON) – NORWAY\n\n\tSIRĀT (NEON) – SPAIN\n\n\tTHE VOICE OF HIND RAJAB (WILLA) – TUNISIA\n\n\t\t\n\t\t\t\n\t\t\t\n\tBest Performance by a Lead Actress in a Motion Picture – Drama\n\t\t\t\t\n\n\tJESSIE BUCKLEY (HAMNET) (WINNER)\n\n\tJENNIFER LAWRENCE (DIE MY LOVE)\n\n\tRENATE REINSVE (SENTIMENTAL VALUE)\n\n\tJULIA ROBERTS (AFTER THE HUNT)\n\n\tTESSA THOMPSON (HEDDA)\n\n\tEVA VICTOR (SORRY, BABY)\n\n\t\t\n\t\t\t\n\t\t\t\n\tBest Performance by a Lead Actor in a Motion Picture – Drama\n\t\t\t\t\n\n\tJOEL EDGERTON (TRAIN DREAMS)\n\n\tOSCAR ISAAC (FRANKENSTEIN)\n\n\tDWAYNE JOHNSON (THE SMASHING MACHINE)\n\n\tMICHAEL B. JORDAN (SINNERS)\n\n\tWAGNER MOURA (THE SECRET AGENT) (WINNER)\n\n\tJEREMY ALLEN WHITE (SPRINGSTEEN: DELIVER ME FROM NOWHERE)\n\n\t\t\n\t\t\t\n\t\t\t\n\tBest Performance by a Lead Actress in a Motion Picture – Musical or Comedy\n\t\t\t\t\n\n\tROSE BYRNE (IF I HAD LEGS I’D KICK YOU) (WINNER)\n\n\tCYNTHIA ERIVO (WICKED: FOR GOOD)\n\n\tKATE HUDSON (SONG SUNG BLUE)\n\n\tCHASE INFINITI (ONE BATTLE AFTER ANOTHER)\n\n\tAMANDA SEYFRIED (THE TESTAMENT OF ANN LEE)\n\n\tEMMA STONE (BUGONIA)\n\n\t\t\n\t\t\t\n\t\t\t\n\tBest Performance by a Lead Actor in Motion Picture – Musical or Comedy\n\t\t\t\t\n\n\tTIMOTHÉE CHALAMET (MARTY SUPREME) (WINNER)\n\n\tGEORGE CLOONEY (JAY KELLY)\n\n\tLEONARDO DICAPRIO (ONE BATTLE AFTER ANOTHER)\n\n\tETHAN HAWKE (BLUE MOON)\n\n\tLEE BYUNG-HUN (NO OTHER CHOICE)\n\n\tJESSE PLEMONS (BUGONIA)\n\n\t\t\n\t\t\t\n\t\t\t\n\tBest Performance by a Supporting Actress in Any Motion Picture\n\t\t\t\t\n\n\tEMILY BLUNT (THE SMASHING MACHINE)\n\n\tELLE FANNING (SENTIMENTAL VALUE)\n\n\tARIANA GRANDE (WICKED: FOR GOOD)\n\n\tINGA IBSDOTTER LILLEAAS (SENTIMENTAL VALUE)\n\n\tAMY MADIGAN (WEAPONS)\n\n\tTEYANA TAYLOR (ONE BATTLE AFTER ANOTHER) (WINNER)\n\n\t\t\n\t\t\t\n\t\t\t\n\tBest Performance by a Supporting Actor in Any Motion Picture\n\t\t\t\t\n\n\tBENICIO DEL TORO (ONE BATTLE AFTER ANOTHER)\n\n\tJACOB ELORDI (FRANKENSTEIN)\n\n\tPAUL MESCAL (HAMNET)\n\n\tSEAN PENN (ONE BATTLE AFTER ANOTHER)\n\n\tADAM SANDLER (JAY KELLY)\n\n\tSTELLAN SKARSGÅRD (SENTIMENTAL VALUE) (WINNER)\n\n\t\t\n\t\t\t\n\t\t\t\n\tBest Director\n\t\t\t\t\n\n\tPAUL THOMAS ANDERSON (ONE BATTLE AFTER ANOTHER) (WINNER)\n\n\tRYAN COOGLER (SINNERS)\n\n\tGUILLERMO DEL TORO (FRANKENSTEIN)\n\n\tJAFAR PANAHI (IT WAS JUST AN ACCIDENT)\n\n\tJOACHIM TRIER (SENTIMENTAL VALUE)\n\n\tCHLOÉ ZHAO (HAMNET)\n\n\t\t\n\t\t\t\n\t\t\t\n\tBest Screenplay\n\t\t\t\t\n\n\tPAUL THOMAS ANDERSON (ONE BATTLE AFTER ANOTHER) (WINNER)\n\n\tRONALD BRONSTEIN, JOSH SAFDIE (MARTY SUPREME)\n\n\tRYAN COOGLER (SINNERS)\n\n\tJAFAR PANAHI (IT WAS JUST AN ACCIDENT)\n\n\tESKIL VOGT, JOACHIM TRIER (SENTIMENTAL VALUE)\n\n\tCHLOÉ ZHAO, MAGGIE O’FARRELL (HAMNET)\n\n\t\t\n\t\t\t\n\t\t\t\n\tBest Original Score\n\t\t\t\t\n\n\tALEXANDRE DESPLAT (FRANKENSTEIN)\n\n\tLUDWIG GÖRANSSON (SINNERS) (WINNER)\n\n\tJONNY GREENWOOD (ONE BATTLE AFTER ANOTHER)\n\n\tKANGDING RAY (SIRĀT)\n\n\tMAX RICHTER (HAMNET)\n\n\tHANS ZIMMER (F1)\n\n\t\t\n\t\t\t\n\t\t\t\n\tBest Original Song\n\t\t\t\t\n\n\t“DREAM AS ONE” –– AVATAR: FIRE AND ASH\n\n\tMusic by: Miley Cyrus, Andrew Wyatt, Mark Ronson, Simon Franglen; Lyrics by: Miley Cyrus, Andrew Wyatt, Mark Ronson, Simon Franglen\n\n\t“GOLDEN” –– KPOP DEMON HUNTERS\n\n\tMusic by: Joong Gyu Kwak, Yu Han Lee, Hee Dong Nam, Jeong Hoon Seo, Park Hong Jun; Lyrics by: Kim Eun-jae (EJAE), Mark Sonnenblick (WINNER)\n\n\t“I LIED TO YOU” –– SINNERS\n\n\tMusic by: Raphael Saadiq, Ludwig Göransson; Lyrics by: Raphael Saadiq, Ludwig Göransson\n\n\t“NO PLACE LIKE HOME” –– WICKED: FOR GOOD\n\n\tMusic by: Stephen Schwartz; Lyrics by: Stephen Schwartz\n\n\t“THE GIRL IN THE BUBBLE” –– WICKED: FOR GOOD\n\n\tMusic by: Stephen Schwartz; Lyrics by: Stephen Schwartz\n\n\t“TRAIN DREAMS” –– TRAIN DREAMS\n\n\tMusic by: Nick Cave, Bryce Dessner; Lyrics by: Nick Cave\n\n\t\t\n\t\t\t\n\t\t\t\n\tBest TV Series – Drama\n\t\t\t\t\n\n\tTHE DIPLOMAT (NETFLIX)\n\n\tTHE PITT (HBO MAX) (WINNER)\n\n\tPLURIBUS (APPLE TV)\n\n\tSEVERANCE (APPLE TV)\n\n\tSLOW HORSES (APPLE TV)\n\n\tTHE WHITE LOTUS (HBO MAX)\n\n\t\t\n\t\t\t\n\t\t\t\n\tBest TV Series – Musical or Comedy\n\t\t\t\t\n\n\tABBOTT ELEMENTARY (ABC)\n\n\tTHE BEAR (FX ON HULU)\n\n\tHACKS (HBO MAX)\n\n\tNOBODY WANTS THIS (NETFLIX)\n\n\tONLY MURDERS IN THE BUILDING (HULU)\n\n\tTHE STUDIO (APPLE TV) (WINNER)\n\n\t\t\n\t\t\t\n\t\t\t\n\tBest Limited or Anthology Series\n\t\t\t\t\n\n\tADOLESCENCE (NETFLIX) (WINNER)\n\n\tALL HER FAULT (PEACOCK)\n\n\tTHE BEAST IN ME (NETFLIX)\n\n\tBLACK MIRROR (NETFLIX)\n\n\tDYING FOR SEX (FX ON HULU)\n\n\tTHE GIRLFRIEND (PRIME VIDEO)\n\n\t\t\n\t\t\t\n\t\t\t\n\tBest Performance by a Lead Actress in a TV Series – Drama\n\t\t\t\t\n\n\tKATHY BATES (MATLOCK)\n\n\tBRITT LOWER (SEVERANCE)\n\n\tHELEN MIRREN (MOBLAND)\n\n\tBELLA RAMSEY (THE LAST OF US)\n\n\tKERI RUSSELL (THE DIPLOMAT)\n\n\tRHEA SEEHORN (PLURIBUS) (WINNER)\n\n\t\t\n\t\t\t\n\t\t\t\n\tBest Performance by a Lead Actor in a TV Series – Drama\n\t\t\t\t\n\n\tSTERLING K. BROWN (PARADISE)\n\n\tDIEGO LUNA (ANDOR)\n\n\tGARY OLDMAN (SLOW HORSES)\n\n\tMARK RUFFALO (TASK)\n\n\tADAM SCOTT (SEVERANCE)\n\n\tNOAH WYLE (THE PITT) (WINNER)\n\n\t\t\n\t\t\t\n\t\t\t\n\tBest Performance by a Lead Actress in a TV Series – Musical or Comedy\n\t\t\t\t\n\n\tKRISTEN BELL (NOBODY WANTS THIS)\n\n\tAYO EDEBIRI (THE BEAR)\n\n\tSELENA GOMEZ (ONLY MURDERS IN THE BUILDING)\n\n\tNATASHA LYONNE (POKER FACE)\n\n\tJENNA ORTEGA (WEDNESDAY)\n\n\tJEAN SMART (HACKS) (WINNER)\n\n\t\t\n\t\t\t\n\t\t\t\n\tBest Performance by a Lead Actor in a TV Series – Musical or Comedy\n\t\t\t\t\n\n\tADAM BRODY (NOBODY WANTS THIS)\n\n\tSTEVE MARTIN (ONLY MURDERS IN THE BUILDING)\n\n\tGLEN POWELL (CHAD POWERS)\n\n\tSETH ROGEN (THE STUDIO) (WINNER)\n\n\tMARTIN SHORT (ONLY MURDERS IN THE BUILDING)\n\n\tJEREMY ALLEN WHITE (THE BEAR)\n\n\t\t\n\t\t\t\n\t\t\t\n\tBest Performance by a Lead Actress in a Limited or Anthology Series\n\t\t\t\t\n\n\tCLAIRE DANES (THE BEAST IN ME)\n\n\tRASHIDA JONES (BLACK MIRROR)\n\n\tAMANDA SEYFRIED (LONG BRIGHT RIVER)\n\n\tSARAH SNOOK (ALL HER FAULT)\n\n\tMICHELLE WILLIAMS (DYING FOR SEX) (WINNER)\n\n\tROBIN WRIGHT (THE GIRLFRIEND)\n\n\t\t\n\t\t\t\n\t\t\t\n\tBest Performance by a Lead Actor in a Limited or Anthology Series\n\t\t\t\t\n\n\tJACOB ELORDI (THE NARROW ROAD TO THE DEEP NORTH)\n\n\tPAUL GIAMATTI (BLACK MIRROR)\n\n\tSTEPHEN GRAHAM (ADOLESCENCE) (WINNER)\n\n\tCHARLIE HUNNAM (MONSTER: THE ED GEIN STORY)\n\n\tJUDE LAW (BLACK RABBIT)\n\n\tMATTHEW RHYS (THE BEAST IN ME)\n\n\t\t\n\t\t\t\n\t\t\t\n\tBest Performance by a Supporting Actress on TV\n\t\t\t\t\n\n\tCARRIE COON (THE WHITE LOTUS)\n\n\tERIN DOHERTY (ADOLESCENCE) (WINNER)\n\n\tHANNAH EINBINDER (HACKS)\n\n\tCATHERINE O’HARA (THE STUDIO)\n\n\tPARKER POSEY (THE WHITE LOTUS)\n\n\tAIMEE LOU WOOD (THE WHITE LOTUS)\n\n\t\t\n\t\t\t\n\t\t\t\n\tBest Performance by a Supporting Actor on TV\n\t\t\t\t\n\n\tOWEN COOPER (ADOLESCENCE) (WINNER)\n\n\tBILLY CRUDUP (THE MORNING SHOW)\n\n\tWALTON GOGGINS (THE WHITE LOTUS)\n\n\tJASON ISAACS (THE WHITE LOTUS)\n\n\tTRAMELL TILLMAN (SEVERANCE)\n\n\tASHLEY WALTERS (ADOLESCENCE)\n\n\t\t\n\t\t\t\n\t\t\t\n\tBest Performance in Stand-Up Comedy on TV\n\t\t\t\t\n\n\tBILL MAHER (BILL MAHER: IS ANYONE ELSE SEEING THIS?\n\n\tBRETT GOLDSTEIN (BRETT GOLDSTEIN: THE SECOND BEST NIGHT OF YOUR LIFE)\n\n\tKEVIN HART (KEVIN HART: ACTING MY AGE)\n\n\tKUMAIL NANJIANI (KUMAIL NANJIANI: NIGHT THOUGHTS)\n\n\tRICKY GERVAIS (RICKY GERVAIS: MORTALITY) (WINNER)\n\n\tSARAH SILVERMAN (SARAH SILVERMAN: POSTMORTEM)\n\n\t\t\n\t\t\t\n\t\t\t\n\tBest Podcast\n\t\t\t\t\n\n\tARMCHAIR EXPERT WITH DAX SHEPARD (WONDERY)\n\n\tCALL HER DADDY (SIRIUSXM)\n\n\tGOOD HANG WITH AMY POEHLER (SPOTIFY) (WINNER)\n\n\tTHE MEL ROBBINS PODCAST (SIRIUSXM)\n\n\tSMARTLESS (SIRIUSXM)\n\n\tUP FIRST (NPR (NATIONAL PUBLIC RADIO)\n\n\tVariety parent company PMC owns Dick Clark Prods. in a joint venture with Eldridge.\n\n\t\t\n\t\n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Golden Globes 2026 Winners: ‘One Battle After Another’ Earns 4 Awards, ‘Adolescence’ Leads TV",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Paul-Thomas-Anderson-Golden-Globe-WIn.jpg?crop=0px%2C0px%2C1200px%2C675px&resize=1000%2C563"
      ],
      "datePublished": "2026-01-12T04:35:35.000Z",
      "dateModified": "2026-01-12T04:35:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Josh In 'Air Bud' 'Memba Him?!",
    "url": "https://www.tmz.com/2026/01/12/josh-in-air-bud-memba-him/",
    "image": "https://imagez.tmz.com/image/1e/16by9/2026/01/07/1e8e14a30e0640af8e7b4bd8532917d9_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-12T08:01:07.000Z",
    "description": "\n    \n                    \n                          Josh In\n                          'Air Bud'\n                          'Memba Him?!\n              ",
    "body": "\n    \n                    \n                          Josh In\n                          'Air Bud'\n                          'Memba Him?!\n                      \n                  \n                                                                        Published \n                              January 12, 2026\n                            12:01 AM PST\n                                                                            \n      \n    \n          Canadian actor Kevin Zegers was just a pre-teen when he played Josh -- the middle school boy who recently lost his father ... and discovers his dog, Buddy, can play basketball -- in the 1997 sport/family film \"Air Bud.\"\n      \n    \n          Zegers shared the big screen with Michael Jeter, Bill Cobbs, and Wendy Makkena.\n      \n    \n          Guess what he looks like now in his 40s!\n      \n      \n      \n          \n            \n              \n                \n                Share on Facebook\n              \n            \n            \n              \n                \n                Share on X\n              \n            \n                          \n                \n                  \n                \n              \n                      \n        \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Movies\n              \n                          \n                Memba Them\n              \n                          \n                Photo Galleries\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Josh In 'Air Bud' 'Memba Him?!",
      "image": [
        "https://imagez.tmz.com/image/1e/16by9/2026/01/07/1e8e14a30e0640af8e7b4bd8532917d9_xl.jpg"
      ],
      "datePublished": "2026-01-12T08:01:07.000Z",
      "dateModified": "2026-01-12T08:01:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nikki Glaser Wears 'Spinal Tap' Hat to Tribute Rob Reiner at Golden Globes",
    "url": "https://www.tmz.com/2026/01/11/nikki-glaser-wears-spinal-tap-hat-rob-reiner-golden-globes-tribute/",
    "image": "https://imagez.tmz.com/image/d8/16by9/2026/01/12/d82b795b88e14c5cbbc6ee56028fecf9_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-12T04:42:39.000Z",
    "description": "\n    \n                    \n                          2026 Golden Globes\n                          Nikki Glaser Shouts Out Rob Reiner ...\n             ",
    "body": "\n    \n                    \n                          2026 Golden Globes\n                          Nikki Glaser Shouts Out Rob Reiner ...\n                          Dons 'Spinal Tap' Hat at Close of Show\n                      \n                  \n                                                                        Published \n                              January 11, 2026\n                            8:42 PM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Rob Reiner wasn't forgotten at this year's Golden Globe awards ... because host Nikki Glaser paid tribute to him just weeks after his murder.\n      \n    \n          Here's the deal ... during the sign-off for the awards show, Nikki came onstage wearing a black and white \"Spinal Tap\" hat -- the band which serves as the subject of Reiner's iconic 1984 mockumentary of the same name.\n      \n    \n          Worth noting ... the Golden Globes do not typically air an in memoriam -- so this was the only time Reiner was mentioned at the show.\n      \n\n          As you know ... Rob and his wife Michele Singer Reiner were found dead in their Los Angeles home last month. Their son Nick Reiner has been arrested for murder in connection to the case.\n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          Nick's arraignment was scheduled for last week ... but, his lawyer Alan Jackson dropped out of the case -- leaving Nick with a public defender and new arraignment date set for late February.\n      \n    \n          Jackson told a gaggle of reporters outside the courthouse that Nick's not guilty ... but, he simply can't defend him. He did not provide a reason for his withdrawal.\n      \n    \n                    \n                          \n                                  \n      \n        \n    \n          Our new documentary \"TMZ Investigates The Reiner Murders: What Really Happened\" dives into Rob and Michele's grisly deaths ... as well as Nick's history of mental health issues and even how his weight gain set him on a dangerous path.\n      \n    \n          \"TMZ Investigates The Reiner Murders: What Really Happened\" is now streaming on Hulu.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Nikki Glaser\n              \n                          \n                Rob Reiner\n              \n                          \n                RIP\n              \n                          \n                TV\n              \n                          \n                Crime & Arrests\n              \n                          \n                Movies\n              \n                          \n                Celebrity Death\n              \n                          \n                Golden Globes\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nikki Glaser Wears 'Spinal Tap' Hat to Tribute Rob Reiner at Golden Globes",
      "image": [
        "https://imagez.tmz.com/image/d8/16by9/2026/01/12/d82b795b88e14c5cbbc6ee56028fecf9_xl.jpg"
      ],
      "datePublished": "2026-01-12T04:42:39.000Z",
      "dateModified": "2026-01-12T04:42:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kylie Jenner Goes Gold at the Golden Globes for Timothée Chalamet",
    "url": "https://www.tmz.com/2026/01/11/kylie-jenner-goes-gold-at-the-golden-globes-for-timothee-chalamet/",
    "image": "https://imagez.tmz.com/image/85/16by9/2026/01/12/856e65338e434f17b536deae587f0d9b_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-12T04:34:22.000Z",
    "description": "\n    \n                    \n                          Kylie Jenner & Timothée Chalamet\n                          Heat Up Golden Globes With Steamy Kiss",
    "body": "\n    \n                    \n                          Kylie Jenner & Timothée Chalamet\n                          Heat Up Golden Globes With Steamy Kiss!!!\n                      \n                  \n                                                                        Published \n                              January 11, 2026\n                            8:34 PM PST\n                                                                      |\n                                                                Updated \n                                  January 11, 2026\n                                9:10 PM PST\n                                    \n      \n    \n      \n        \n                    \n                  \n      \n                    Golden Globes / Nikki Glaser\n          \n    \n          Timothée Chalamet and Kylie Jenner aren't just attending awards season ... they're dominating it.\n      \n    \n          The couple stole the show again with a serious makeout during a commercial break.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Kylie popped up Sunday night at the Golden Globes to support boyfriend, who took home the Golden Globe award for best actor in a musical or comedy for his performance in \"Marty Supreme.\"\n      \n\n          While Kylie skipped the red carpet, she still managed to turn the night into her personal runway. Just before the show kicked off, Kylie teased her look on Instagram, revealing a jaw dropping gold gown that clung to every curve.\n      \n    \n          She paired the dress with Christian Louboutin heels, a vintage Gucci clutch, and enough diamonds to light up the entire Beverly Hilton Hotel ballroom.\n      \n    \n          Kylie's custom Lorraine Schwartz jewelry was the real showstopper, featuring diamond rings and statement earrings totaling 75 carats.\n      \n    \n                    \n                          \n                                  \n      \n        \n    \n          Timothée, meanwhile, kept things cool and classic in an all black ensemble, rocking a vest, blazer, and pants tucked into boots. He topped off the look with a silver necklace.\n      \n    \n          The couple was last seen together just a week earlier at the Critics Choice Awards, where they coordinated in black and Timothée took home the Best Actor trophy ... even giving Kylie a nod in his acceptance speech.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Timothee Chalamet\n              \n                          \n                Kylie Jenner\n              \n                          \n                TV\n              \n                          \n                Reality TV\n              \n                          \n                Movies\n              \n                          \n                Golden Globes\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kylie Jenner Goes Gold at the Golden Globes for Timothée Chalamet",
      "image": [
        "https://imagez.tmz.com/image/85/16by9/2026/01/12/856e65338e434f17b536deae587f0d9b_xl.jpg"
      ],
      "datePublished": "2026-01-12T04:34:22.000Z",
      "dateModified": "2026-01-12T04:34:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Figure Skater Maxim Naumov Makes U.S. Olympic Team Year After Parents' Deaths",
    "url": "https://www.tmz.com/2026/01/11/figure-skater-maxim-naumov-makes-olympic-team-year-after-parent-deaths/",
    "image": "https://imagez.tmz.com/image/99/16by9/2026/01/11/991390f65c7948bfa1fc7e96250b0d28_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-11T23:05:46.000Z",
    "description": "\n    \n                    \n                          Figure Skater Maxim Naumov\n                          Makes Olympic Team...\n                      ",
    "body": "\n    \n                    \n                          Figure Skater Maxim Naumov\n                          Makes Olympic Team...\n                          Overcoming Parents' Tragic Plane Crash Deaths\n                      \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Figure skater Maxim Naumov made his dream come true when he made the U.S. Olympic team Sunday ... but the accomplishment was bittersweet, as it came one year after losing his parents to a catastrophic plane crash.\n      \n    \n          Naumov grew up following in his parents' footsteps ... Vadim Naumov and Evgenia Shishkova, competed for Russia, becoming world champions in pairs figure skating in 1994.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Wanting the best for their son, they shared advice and talked to him about what it would take for him to join them in Olympic glory while supporting him last year at the 2025 U.S. championships in Wichita, Kansas.\n      \n\n                  \n          \n                          \n                \n                  \n      \n    \n          But on the way home, Vadim and Evgenia's flight reportedly collided with a military helicopter over the Potomac River, which killed 67 people ... many of them connected to U.S. figure skating.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Naumov told U.S. Figure Skating Sunday, “I thought of them immediately. I wish they could be here to experience it with me, but I do feel their presence, and they are with me.”\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          The 24-year-old athlete was reportedly one of 16 skaters selected for the team.\n      \n    \n          The competition will take place February 6-19 in Milan.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                RIP\n              \n                          \n                Plane Crash\n              \n                          \n                Olympics\n              \n                          \n                Family\n              \n                          \n                TMZ Sports\n              \n                          \n                News\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Figure Skater Maxim Naumov Makes U.S. Olympic Team Year After Parents' Deaths",
      "image": [
        "https://imagez.tmz.com/image/99/16by9/2026/01/11/991390f65c7948bfa1fc7e96250b0d28_xl.jpg"
      ],
      "datePublished": "2026-01-11T23:05:46.000Z",
      "dateModified": "2026-01-11T23:05:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Celebs Go For Gold on 2026 Golden Globes Red Carpet",
    "url": "https://www.tmz.com/2026/01/11/celebs-go-for-gold-on-2026-golden-globes-red-carpet/",
    "image": "https://imagez.tmz.com/image/0d/16by9/2026/01/12/0d1ed1b0a9f74bc9b2f842c1b10b5d18_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-11T23:28:21.000Z",
    "description": "\n    \n                    \n                          2026 Golden Globes\n                          Celebs Go For Gold on Red Carpet...\n                ",
    "body": "\n    \n                    \n                          2026 Golden Globes\n                          Celebs Go For Gold on Red Carpet...\n                          Ariana, Teyana, JLo & More!!!\n                      \n                  \n                                                                        Published \n                              \n                January 11, 2026\n                \n                            3:28 PM PST\n                                                                      |\n                                                                Updated \n                                  January 11, 2026\n                                9:02 PM PST\n                                    \n      \n    \n          The award statuettes weren't the only things shining at the Golden Globes ... the celebs dazzled as they walked the red carpet -- and we have pics of all the hottest looks.\n      \n    \n          Teyana Taylor struck one good pose after another as she arrived in a strappy black dress as a nominee in the Best Supporting Actress for a Motion Picture category .... while Ariana Grande wowed in a jet black off-the-shoulder gown and Jennifer Lopez added another iconic look to her resume in a spectacular skintight dress, showing off her ageless figure.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Priyanka Chopra absolutely dazzled in custom Dior while Jeannie Mai showed legs for days in a sexy, and elegant Tony Ward creation.\n      \n\n                  \n          \n                          \n                \n                  \n      \n    \n          Benny Blanco and Selena Gomez looked good enough to get married again Sunday. The singer rocked a black gown with a white feather neckline and Benny matched her in a black suit. Not to be outdone ... Nikki Glaser was the picture of elegance in a pink gown as she prepared to host the show. Dazzling in a sparkly black number was Jennifer Garner, who smiled for the cameras as she made her way inside.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Brittany Snow hit the red carpet in a snowy white, layered Danielle Frankel gown ... looking ethereal as she posed for photogs in her flowy, strapless number.\n      \n    \n          Rapper and singer, LISA, was a total knockout in a black, see-through Jacquemus dress. Snoop Dogg looked dapper in a black tux featuring a red sash for just the right amount of accent to fill out his ensemble.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Glen Powell brought a touch of old Hollywood glamor in a beautiful tux and light shades.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          And Dylan Efron looked anything but \"Traitor\"-ous in classic Valentino.\n      \n    \n                    \n                          \n                                  \n      \n        \n    \n          Click through the gallery for more of the night's best looks! The Globes kickoff at 5 PM PT on CBS.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Jennifer Garner\n              \n                          \n                Selena Gomez\n              \n                          \n                Benny Blanco\n              \n                          \n                Glen Powell\n              \n                          \n                TV\n              \n                          \n                Fashion\n              \n                          \n                Movies\n              \n                          \n                Golden Globes\n              \n                          \n                Awards / Awards Shows\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Celebs Go For Gold on 2026 Golden Globes Red Carpet",
      "image": [
        "https://imagez.tmz.com/image/0d/16by9/2026/01/12/0d1ed1b0a9f74bc9b2f842c1b10b5d18_xl.jpg"
      ],
      "datePublished": "2026-01-11T23:28:21.000Z",
      "dateModified": "2026-01-11T23:28:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]