[
  {
    "title": "YouTube TV Drops Disney’s ABC, ESPN and Other Networks After Two Sides Fail to Reach New Deal",
    "url": "https://variety.com/2025/tv/news/youtube-tv-blackout-loses-abc-espn-disney-networks-1236566477/",
    "image": "https://variety.com/wp-content/uploads/2025/10/High-Potential.png?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-31T03:15:00.000Z",
    "description": "\n\tDisney‘s networks including ESPN and ABC have gone dark on YouTube TV.\n\n\tYouTube TV removed Disney’s networks as much as 30 minutes before the previ",
    "body": "\n\tDisney‘s networks including ESPN and ABC have gone dark on YouTube TV.\n\n\tYouTube TV removed Disney’s networks as much as 30 minutes before the previous carriage deal expired at the stroke of midnight ET, after the two sides remain far apart on a deal renewal to keep ABC, ESPN and more on the internet TV service. The main sticking point is price — Disney is asking for rate hikes that Google isn’t willing to agree to.\n\n\n\tYouTube TV said that if Disney’s channels remain unavailable for “an extended period of time,” it will offer subscribers a one-time $20 credit. YouTube TV’s base subscription plan costs $82.99/month. With the blackout, TV users nationwide will lose their local ABC stations, as well as ESPN sports programming including NFL, college football, NBA and NHL games.\n\t\n\n\tGoogle said YouTube TV would begin pulling Disney-owned networks off its service beginning at 9 p.m. PT on Oct. 30/12 a.m. ET on Oct. 31. However, YouTube TV users on social media said they lost Disney programming even before the deadline. In addition to dropping the live networks, YouTube TV also is removing any DVR library recordings users have made from those networks.\n\n\tDisney began alerting viewers on Oct. 23 about the carriage dispute with YouTube TV, pointing out that its networks could be removed from the pay-TV provider. YouTube TV is the biggest internet-TV service in the U.S., estimated to have more than 10 million subscribers. In second place is Disney, which just closed a deal to merge its Hulu + Live TV business with Fubo; together, those have almost 6 million subs in North America. \n\t\n\n\t“Last week Disney used the threat of a blackout on YouTube TV as a negotiating tactic to force deal terms that would raise prices on our customers,” a YouTube spokesperson said in a statement. “They’re now following through on that threat, suspending their content on YouTube TV. This decision directly harms our subscribers while benefiting their own live TV products, including Hulu + Live TV and Fubo.”\n\n\tThe YouTube rep continued, “We know this is a frustrating and disappointing outcome for our subscribers and we continue to urge Disney to work with us constructively to reach a fair agreement that restores their networks to YouTube TV. If their content remains off YouTube TV for an extended period of time, we’ll offer subscribers a $20 credit.”\n\n\tAccording to Disney, YouTube TV wants a better deal than anyone else in the market — including Comcast and Charter, which have more TV customers — and is unwilling to pay market rates for Disney’s networks or agree to terms that Disney has reached with other distributors, including it own Hulu + Live TV and Fubo services. In its negotiations with Google, Disney also has proposed new genre-based tiers and packaging flexibility to give YouTube TV customers more choices.\n\n\t“Unfortunately, Google’s YouTube TV has chosen to deny their subscribers the content they value most by refusing to pay fair rates for our channels, including ESPN and ABC,” a Disney spokesperson said. “Without a new agreement in place, their subscribers will not have access to our programming, which includes the best lineup in live sports — anchored by the NFL, NBA, and college football, with 13 of the top 25 college teams playing this weekend.” \n\n\tThe Disney rep continued: “With a $3 trillion market cap, Google is using its market dominance to eliminate competition and undercut the industry-standard terms we’ve successfully negotiated with every other distributor. We know how frustrating this is for YouTube TV subscribers and remain committed to working toward a resolution as quickly as possible.”\n\n\tHere’s the full list of networks being pulled from YouTube TV: ABC, ESPN, ESPN2, ESPNU, ESPNews, Freeform, FX, FXX, FXM, Disney Channel, Disney Junior, Disney XD, SEC Network, Nat Geo, Nat Geo Wild, ABC News Live, ACC Network, Localish; on the Spanish plan, ESPN Deportes, Baby TV Español and Nat Geo Mundo.\n\t\n\n\tDisney is the latest media conglomerate to lock horns with Google over YouTube TV this year. Others that have fought with the company include Paramount Global (now Paramount Skydance), Fox Corp. and NBCUniversal — each of which reached a new deal without a blackout. However, YouTube TV dropped Univision and other TelevisaUnivision-owned networks at the end of September after the two sides could not reach a new agreement.\n\n\tIn 2023, Disney and Charter had a public battle over a renewal, before the two sides resolved their differences to avoid a blackout. In 2024, ESPN and other Disney nets went dark on DirecTV for nearly two weeks before they reached a new deal. Earlier this month, Disney inked a carriage renewal pact with Comcast without any drama.\n\n\tIn December 2021, Disney and Google reached a carriage renewal after a two-day blackout. YouTube TV first launched in April 2017.\n\n\tIn another wrinkle to the current Disney/Google standoff, Justin Connolly, Disney’s former head of distribution, joined YouTube as VP of global head of media this spring. Disney sued YouTube and Connolly, alleging breach of contract and seeking to block his employment at Google, in part citing Connolly’s knowledge of Disney as it pertained to contract renewal talks for YouTube TV. After Disney lost a legal ruling in the case, the parties recently reached a settlement on the matter.\n\n\tPictured top: ABC’s “High Potential” starring Kaitlin Olson and Daniel Sunjata\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "YouTube TV Drops Disney’s ABC, ESPN and Other Networks After Two Sides Fail to Reach New Deal",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/High-Potential.png?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-31T03:15:00.000Z",
      "dateModified": "2025-10-31T03:15:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Take Off’ Director Pengfei on Tokyo Competition Entry: ‘A Fable-Like Story, With a Touch of Fairy Tale’",
    "url": "https://variety.com/2025/film/festivals/take-off-pengfei-tokyo-competition-1236566525/",
    "image": "https://variety.com/wp-content/uploads/2025/10/Take-Off.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-31T02:02:55.000Z",
    "description": "\n\tDirector Pengfei‘s “Take Off,” which world premiered in competition at the Tokyo International Film Festival, represents both a continuation and evo",
    "body": "\n\tDirector Pengfei‘s “Take Off,” which world premiered in competition at the Tokyo International Film Festival, represents both a continuation and evolution of the filmmaker’s artistic preoccupations. \n\n\tAdapted from Shuang Xuetao’s novella “The Aeronaut,” the film follows Li Mingqi (Jiang Qiming), an ordinary worker in Northeast China who inherits his late father’s obsession with flight – a dream that will span decades and test the limits of his persistence.\n\t\n\n\tThe story unfolds against the backdrop of China’s dramatic economic transformation from the 1970s to the present. After a homemade flying machine crashes and leaves his brother-in-law disabled, Li Mingqi and his wife (Li Xueqin) attempt to rebuild their lives by opening a dance hall in an abandoned factory museum, using a hot air balloon as a tourist attraction. But when his nephew falls critically ill, Li faces an impossible choice: accept the limitations of his earthbound existence or risk everything for one final flight.\n\n\n\tFor Pengfei, whose previous films “Underground Fragrance” and “The Taste of Rice Flower” explored working-class and marginalized communities, the project represents his first literary adaptation – and a deepening of his thematic concerns. “I think ‘Take Off’ brings together the emotional themes from my previous films, including love and family,” the director explains. “But this film delves into a deeper layer by incorporating the emotional dynamic between individuals and their dreams, which gives the story greater depth.”\n\n\tThe film’s central tension – between the grounded reality of factory workers’ lives and the transcendent pull of flight – required what Pengfei describes as unwavering sincerity. “From the very beginning of the scriptwriting process, we were pursuing authenticity and sincerity in the story, the characters, and the emotions,” he says. “‘Take Off’ has its element of flight – which represents the dream, and it is imbued with a strong sense of romanticism. But what sustains this spirit is the tangible, down-to-earth life on the ground. Without this foundation, the flight element would not hit close to the heart.”\n\t\n\n\tTranslating Shuang Xuetao’s literary world to the screen presented unique challenges. “The characters in Shuang Xuetao’s works are full of humor and wisdom, just like the author himself,” Pengfei notes. “When reading his novels, I often find myself laughing out loud. But the challenge lies in the intensity of his characters and stories – they are like a shot of espresso.”\n\n\tTo understand the emotional source material, Pengfei conducted extensive field research in Northeast China, interviewing retired factory workers. “Though retired, they reflected on their past with undiminished vibrancy and humor,” he recalls. “That inspired me to bring that same sense of warmth and wit into the film.”\n\n\tCasting proved crucial to the film’s emotional authenticity. Pengfei found his lead in Jiang Qiming, known for “Journey to the West” and “The Long Season.” “Jiang Qiming is an outstanding and deeply focused actor, with a certain sense of detachment that perfectly matches how Li Mingqi is described in the novel and the screenplay,” the director says. “Even their names sound alike.”\n\n\tThe moment of recognition came during the first costume fitting. “When he stepped out after his first costume fitting, I immediately thought, ‘He is the person who walked straight out of the novel,'” Pengfei remembers. The cast also includes veteran actor Jiang Wu, whose natural chemistry with Jiang Qiming required minimal direction. “In the scene where he and Jiang Qiming share a meal, I barely needed to direct at all; simply watching them was already a pleasure.”\n\n\tWorking with cinematographer Lv Songye, Pengfei made a significant stylistic departure from his previous work. “In my previous films, I often used static shots, but after discussing with him, we decided to shoot ‘Take Off’ entirely with moving cameras, either handheld or on tracks, keeping the camera as close to the actors as possible to capture their breathing,” he explains.\n\n\tProduction designer Liu Qing, who has collaborated with Chen Kaige and Jiang Wen, brought his own touch to the period details. “He is deeply passionate about that era, and in ‘Take Off,’ he poured all of his own memories into the film,” Pengfei says. “Memory itself is a fusion of lived experience and romantic imagination.”\n\n\tFor the score, Pengfei returned to Japanese composer Suzuki Keiichi for their third collaboration, despite the language barrier – or perhaps because of it. “I actually see that as an advantage,” the director says. “We communicate in the simplest way possible. For this project, I gave him just one key phrase, ‘a romantic dream,’ and he immediately understood.”\n\t\n\n\tPengfei’s background includes work with Taiwanese director Tsai Ming-liang on “Stray Dogs,” an experience that shaped his approach to filmmaking. “Director Tsai Ming-liang has had a profound influence on me, so much that it took me a long time to focus on my own path,” he acknowledges. “What I learned from him, his seriousness toward cinema and his almost obsessive attention to detail, has benefited me for life.”\n\n\tWhen asked about “Forrest Gump” as a reference point, Pengfei identifies persistence as the common thread, though with important distinctions. “Forrest’s is perhaps unwitting, while Li Mingqi’s is fully conscious,” he explains. “In my film, I chose to depict persistence through the act of letting go: the character stops talking about his dream and ceases to dwell on it, but that does not mean the love for it is gone. In the end, when he faces a moment that demands an all-or-nothing effort, he picks up the dream again without hesitation.”\n\n\tUltimately, Pengfei sees “Take Off” as transcending its specific setting to address universal questions about dreams and dignity. “Yes, I think this is a fable-like story, with a touch of fairy tale in it,” he reflects. “What moves me is that a dream does not have to be pursued all the time. Sometimes, when you reach middle age and have been worn down by life, a moment suddenly arises that awakens the dream you once had in your youth. You may have to pay a heavy price for it, but the question is whether you are still willing to take that step and fight for it. My answer is, I am.”\n\n\tLooking ahead, the director plans to continue his collaboration with Shuang Xuetao. “I’ve barely scratched the surface of his world,” he says – a hint that this journey into the lives of Northeast China’s working-class is far from over.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Take Off’ Director Pengfei on Tokyo Competition Entry: ‘A Fable-Like Story, With a Touch of Fairy Tale’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/Take-Off.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-31T02:02:55.000Z",
      "dateModified": "2025-10-31T02:02:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Little Bear Ridge Road’ Review: Laurie Metcalf Shines in a Flawed but Fascinating COVID Story",
    "url": "https://variety.com/2025/legit/reviews/little-bear-ridge-road-laurie-metcalf-review-1236562382/",
    "image": "https://variety.com/wp-content/uploads/2025/10/Laurie-Metcalf-and-Micah-Stock.-Photo-by-Julieta-Cervantes-1.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-31T02:00:00.000Z",
    "description": "\n\tThe script for Samuel D. Hunter’s “Little Bear Ridge Road” indicates that the play takes place at “a couch in a void.” As the lights come up, we see",
    "body": "\n\tThe script for Samuel D. Hunter’s “Little Bear Ridge Road” indicates that the play takes place at “a couch in a void.” As the lights come up, we see it — a white leather monstrosity with separate recliners built in — and we see, too, the void. The stage is utterly bare otherwise.\n\n\tThe play takes ample metaphorical advantage of both couch and void. In staging the collision of a reluctant aunt (Laurie Metcalf) and her stymied-by-life nephew (Micah Stock) during the early days of COVID, Hunter’s script situates itself within a historical moment when couch-sitting was all many people had. As for the void? Well, those familiar with Hunter’s past work (which includes “The Whale,” which Hunter later adapted for the screen, and “A Bright New Boise”) will not be surprised that Stock’s Ethan is a man more at home with words than with other people, desperate to break out of the American interior but unsure of how to do so. All he sees around him is inky darkness.\n\t\n\n\tEthan has shown up at his aunt’s doorstep at a loss: His father has died, and Ethan is obliged to sell his home and do the administrative tasks that come with grief. Not that Ethan is grieving, exactly — he and Aunt Sarah seem to agree that nothing of value was lost when Ethan’s dad, a drug addict, passed, but now Sarah and Ethan are the last two of the Fernsby family left. Both remaining Fernsbys have seen better days: Ethan’s attempt to establish himself in Seattle has come to an embarrassing end, while Sarah has consciously retreated further into her corner of Idaho, living a half-hour from the closest grocery store and tethered to the world around her only by a reality TV habit. Ethan is self-conscious, but Sarah is, at least, no homophobe; she’s stunned, in fact, to learn Ethan feared that she might be. “All this time you’ve thought I had an issue with you being gay?” she asks. “That’s the most interesting thing about you.”\n\t\n\n\tAnother actor might play a moment of regret after uttering this, but Metcalf, as directed by Joe Mantello, is all momentum, in conversation and otherwise. She strides around the couch, supporting her lower back with her right hand, as if, in moving it, she might come apart altogether. She, unlike her dissatisfied nephew, doesn’t see herself as having that luxury.\n\n\tIt’s a sharp contrast in personality types, and, perhaps, in generations: Stoicism and angst, sharing the couch together. And Sarah and Ethan’s gradual coming into an understanding of one another, and toward a time when they can speak openly about missed opportunities for connection in the past, makes for moving viewing; I was reminded, in stretches, of Jen Silverman’s “The Roommate,” mounted last year on Broadway and similarly concerned with two unlikely living companions trying to come to terms with one another. But there are elements here that don’t quite gel. Hunter, in writing a protagonist not dissimilar from ones he has written in the past, uses at first a sort of shorthand — Ethan is unhappy because, well, what’s to be happy about? — but as details of Ethan’s life accrue, elements (including and especially his life in Seattle) strain credulity. Ethan is, we are told, dreaming of becoming a writer, and yet his mien never struck this viewer as particularly writerly or reflective: Stock gives a performance that is emphatic to a fault. Every word he utters is capitalized.\n\n\tMetcalf fares better; the play was commissioned for her as a way to return to Chicago’s Steppenwolf Theatre Company last year, and one imagines Hunter envisioning “a Laurie Metcalf type” as he wrote. (Stock was in that Chicago production, too, for what it’s worth.) Sarah exists on a continuum with all the great Metcalf characters, from the plainspoken aunt (once again!) on “Roseanne” to Lady Bird’s mother to the recent run of women she’s played on Broadway, wounded but trying to conceal the hurt behind a certain bravado. (Nora in “A Doll’s House, Part 2” comes to mind. So does the defeated politician in “Hillary and Clinton.”) \n\n\tMoments of big emotion in “Little Bear Ridge Road” don’t fall flat, exactly, but they don’t play to Hunter’s strengths as a writer; he’s better in small, askew gestures. We learn a piece of information about Sarah offhandedly, while Ethan is talking about his family situation on a date with nice-guy grad student James (John Drea), and the power of that news dawning on the audience outweighs the excoriations Ethan delivers about his upbringing.\n\t\n\n\tThe show is at its best when allowing Ethan and Sarah’s relationship to unfold without forcing the revelations. (Lead producer Scott Rudin, returning to the industry after a four-year hiatus following reports of an alleged pattern of bullying subordinates, can at least be said to have long had an eye for the truly literary, which this show at its best achieves; perhaps, too, a story about trying to make possible past misdeeds right had its appeals.) The pair’s misunderstandings at first, before a torrent of discussion over what Sarah might have done differently to protect her nephew, may be relatively small beer, but I found myself more interested in little nuances of the ways aunt and nephew differed than in cosmic questions of what is owed to a family member. After all, the first informs the second in ways that are intellectually satisfying to dig into; the latter lends itself to grandiosity.\n\n\tOne of the show’s best moments, to wit, comes in a conversation between the two housemates over what they like to watch on TV. Ethan loves antihero dramas in the post-”Sopranos” vein, and I cued myself to roll my eyes at industry satire that would likely be far from subtle. But what happened next was a strange, sad little moment. Sarah declares, “Just because it’s so complicated that you have to watch an episode recap every week doesn’t mean it’s better. Real people aren’t always desperately doing things.”\n\n\tIt starts out like a groaner that could have been said anytime this century. But it ends up as a statement of purpose — and one that, in the show’s louder moments, I wish Hunter had taken more thoroughly to heart. Sarah’s from the same family as Ethan, has seen the same troubles, and lives a life of similar isolation and lack of fulfillment, and yet, what can she do? Hand at her back, she just keeps moving along. She struggles to express love, but — in one of the many small moments of poignancy studded through “Little Bear Ridge Road,” and distinguishes it as a meaningful achievement — she refuses to make a display of herself. She can’t quite say she loves her nephew, but she can do the next best thing. Sarah has no interest in what Ethan has on the TV set, but she says her piece about it, and then, seated next to him in the void, keeps watching with him. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Little Bear Ridge Road’ Review: Laurie Metcalf Shines in a Flawed but Fascinating COVID Story",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/Laurie-Metcalf-and-Micah-Stock.-Photo-by-Julieta-Cervantes-1.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-31T02:00:00.000Z",
      "dateModified": "2025-10-31T02:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Yamada Yoji and Lee Sang-il Trade Insights on Art, Rivalry and Japan’s Film Future at Tokyo Festival",
    "url": "https://variety.com/2025/film/festivals/yamada-yoji-lee-sang-il-tokyo-1236566546/",
    "image": "https://variety.com/wp-content/uploads/2025/10/Yamada-Yoji-Lee-Sang-Il.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-31T02:20:51.000Z",
    "description": "\n\tThe Tokyo International Film Festival‘s TIFF Lounge series of talks and masterclasses featured a conversation between Yamada Yoji, director of the f",
    "body": "\n\tThe Tokyo International Film Festival‘s TIFF Lounge series of talks and masterclasses featured a conversation between Yamada Yoji, director of the festival Centerpiece “Tokyo Taxi”, and Lee Sang-il, recipient of this year’s Kurosawa Akira Award for his film “Kokuho.”\n\n\tThe 94-year-old Yamada, whose, lengthy filmography includes the iconic 48-episode “Tora-san” series that ran from 1969 to 1995, and the 51-year-old Lee, whose “Kokuho” has become a record-setting hit since its release in June of this year, earning more than $100 million, expressed admiration for each other’s work. Lee called Yamada a “national treasure” (the English translation of “Kokuho”) while Yamada said that putting his modestly budgeted “Tokyo Taxi” next to Lee’s lavishly staged Kabuki drama “makes me feel embarrassed” and that he was there to “watch and learn.”\n\t\n\n\tNoting that “Kokuho” is the “story of two men” who become performers of female roles or onnagata in Kabuki, Yamada said Lee’s film “is exceptionally good precisely because it’s different from typical films about male friendship” since the focus remains on the two protagonists and their suffering for their art, as well as on their intense rivalry as artists. “Usually in a film like that a woman always gets involved between [the two men] so you have a simple relationship dynamic,” Yamada said. “This movie isn’t like that… I was amazed you managed to express something so complex so well.”\n\n\n\tYamada compared the film to the 1984 Mozart biopic “Amadeus” in which “there was jealousy [between the two protagonists], sabotaging each other and deceiving each other.” In “Kokuho,” he added, “You’d expect that kind of thing to unfold, but, there’s an ‘art’ at the center of the drama. Above all, they dedicate themselves to their art.” He also expressed amazement at how the two leads totally inhabited their female stage roles. “How did they pull it off?” he asked.\n\t\n\n\tLee answered that stars Ryo Yoshizawa and Ryusei Yokohama spent a year and half preparing, learning Kabuki from scratch. “Honestly, for the first few months, I’d occasionally go observe them, and it would give me a headache,” Lee said. “I’d wonder if they’d ever get it… But that rehearsal process, where they pushed each other to improve, directly shaped the relationship between their characters.”\n\n\tThe two directors also discussed veteran dancer and actor Tanaka Min, who appears as an elderly Kabuki onnagata in “Kokuho” and as a sword-wielding opponent to the samurai hero in Yamada’s 2002 Oscar-nominated hit “The Twilight Samurai.”\n\n\t“He had a good face and a good voice,” Yamada said. “But his acting… He was just terrible, really terrible. We rehearsed everything, every single thing. And it just didn’t work. So we had to drill in [the dialogue], word by word.”\n\n\tNoting that Tanaka became an in-demand actor after the film’s success, Yamada said, to audience laughter “I watch him sometimes, and he hasn’t improved at all. ”\n\n\tLee countered that Tanaka had a dancerly presence that fit the role: “It’s enough just for him to be there, you know? That presence and the way his body moves. He has this unique way of moving his body, and when that combines with his voice, it creates this magical presence.”\n\n\tThe conversation turned to “Tokyo Taxi,” Yamada’s remake of the 2022 French-Belgian drama “Driving Madeleine.” Frequent Yamada collaborator Baisho Chieko plays an elderly woman who asks her taxi driver (former pop star Kimura Takuya) to drive her to memorable places in her Tokyo life before arriving at the Yokohama retirement home where she intends to spend her remaining days.\n\n\tYamada commented that Kimura, who had starred in his 2006 samurai drama “Love and Honor,” was just as serious as a taxi driver stirring natto (fermented soy beans) into his breakfast rice, as he had been as a samurai in the earlier film. “He’s like, ‘I have to do this properly, seriously. That’s who I am,’” said Yamada. “And even when his own scene is over, he always stays until the end, on the set…Big stars usually show up late or don’t care [about staying to the end], but he never does that.”\n\n\tLee said that when he visited Yamada’s set the director was “always right next to the camera, always watching the actors from the closest spot.” “I tried it myself, kind of half-jokingly” he added. “I realized how much it matters – having the director right there is incredibly important. That lesson has stayed with me ever since.” Younger directors, he noted, tend to watch a monitor positioned some distance from the camera. “I can’t quite accept that,” he said “If I were an actor, I’d hate it.”\n\t\n\n\tIn the Q&A the directors were asked for their thoughts about the enormous global popularity of Japanese animation, as compared to the relatively low international profile of Japanese live-action films.\n\n\tYamada admitted that the profits of Japanese anime are “huge” while those of Japanese films “are practically negligible by comparison.” “That’s incredibly frustrating and sad for us Japanese artists,” he said. “Seventy years ago, when I started going to movie theaters, Japanese films were incredibly vibrant and the cinema scene was rich… We have to do something. It’s not just up to us; the Japanese government must seriously take notice of this too. It’s a national issue. Why is Korean cinema demonstrating such incredible power? Because Korea is genuinely committed to making films, truly responding to cinema. That’s why I hope Japan, as a national policy, will support film. I hope that kind of initiative can emerge from Tokyo.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Yamada Yoji and Lee Sang-il Trade Insights on Art, Rivalry and Japan’s Film Future at Tokyo Festival",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/Yamada-Yoji-Lee-Sang-Il.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-31T02:20:51.000Z",
      "dateModified": "2025-10-31T02:20:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "AI Impact Drama ‘Humans in the Loop’ Lands U.S. Theatrical Release and Netflix Pact, Unveils Trailer (EXCLUSIVE)",
    "url": "https://variety.com/2025/film/news/ai-drama-humans-in-the-loop-netflix-us-theatrical-release-1236566448/",
    "image": "https://variety.com/wp-content/uploads/2025/10/Humans-in-the-Loop.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-30T23:17:02.000Z",
    "description": "\n\tAranya Sahay‘s “Humans in the Loop” has locked in dual distribution, with Netflix streaming the film stateside from Nov. 10 and boutique shingle One",
    "body": "\n\tAranya Sahay‘s “Humans in the Loop” has locked in dual distribution, with Netflix streaming the film stateside from Nov. 10 and boutique shingle One Rising orchestrating a limited theatrical run and impact campaign launching Nov. 7 in L.A.\n\n\tThe drama shadows an Indigenous woman laboring at a data-annotation facility in rural India, where she trains AI systems — exposing the unseen human toll that undergirds the global tech industry. Storiculture and Sauv Films produced the feature, with Mathivanan Rajendran, Sarabhi Ravichandran and Shilpa Kumar serving as producers. Sahay developed the project via a Museum of Imagined Futures fellowship.\n\t\n\n\tIndigenous filmmaker Bijjo Toppo executive produced and mentored Sahay, with Kiran Rao boarding as EP. Rao’s “Laapataa Ladies” represented India at last year’s Oscars race.\n\n\n\tThe film netted Fipresci India’s Grand Prix award. A U.S. release trailer has been unveiled.\n\n\tMisaq Kazimi has come aboard as EP to steer the U.S. campaign. He previously shepherded Iranian auteur Mohsen Makhmalbaf’s “The Gardener” through a similar release.\n\n\t“‘Humans in the Loop’ has the rare ability to merge intimate human storytelling with one of the most urgent global conversations of our time: how we can prevent social inequities from making their way into AI and instead use it to enhance underrepresented voices,” Kazimi said. “We’re excited to help bring the film to audiences in the U.S., whether it’s in theaters, university halls, or intimate community screenings, and engage in conversations around Responsible AI and the role of Indigenous life philosophies in shaping our future.”\n\t\n\n\tSahay added: “Having Misaq Kazimi in our team as an executive producer is the next big step in our journey. Misaq understands the heart of the film and its social relevance and is an impact filmmaker himself. We’re thrilled to share this story with U.S. audiences and to continue the conversations it has already sparked about the invisible labor that builds AI and an inclusive lens on technology.”\n\n\tThe seven-day L.A. run through Nov. 13 positions the film for awards consideration. Sahay will attend screenings for Q&As tackling the pic’s themes around AI ethics, global labor and representation. The campaign also encompasses university venues and community screenings.\n\n\tCast includes Sonal Madhushankar, Ridhima Singh, Geeta Guha, Anurag Lugun, Monika and Sahay. Monica Tiwari and Harshit Saini lensed the film, with Swaroop Reghu and Sahay editing. Kalhan Raina handled sound design, Saransh “Khwagbah” Sharma composed the score, Uday Oswal and Toshik Saraf served as colorists, and Shubham Solanki handled production design.\n\n\tWatch the trailer here:\n\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "AI Impact Drama ‘Humans in the Loop’ Lands U.S. Theatrical Release and Netflix Pact, Unveils Trailer (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/Humans-in-the-Loop.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-30T23:17:02.000Z",
      "dateModified": "2025-10-30T23:17:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Claire Danes, Ewan McGregor to Lead ‘The Spot’ at Hulu",
    "url": "https://variety.com/2025/tv/news/claire-danes-ewan-mcgregor-the-spot-hulu-1236566479/",
    "image": "https://variety.com/wp-content/uploads/2025/10/danes-mcgregor-split.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-31T01:30:00.000Z",
    "description": "\n\tClaire Danes and Ewan McGregor have been tapped to lead “The Spot,” Hulu’s upcoming drama series headed by screenwriter Ed Solomon. The series comes",
    "body": "\n\tClaire Danes and Ewan McGregor have been tapped to lead “The Spot,” Hulu’s upcoming drama series headed by screenwriter Ed Solomon. The series comes from A24 as the lead studio, in co-production with 20th Television.\n\n\tDanes’ casting comes after Kate Winslet exited the project in June, reportedly for creative differences. Winslet, who has led the HBO series “The Regime” and “Mare of Easttown” over recent years, had been set to executive produce on “The Spot” via her Juggle Productions banner.\n\t\n\n\tThe logline for “The Spot” teases a story that follows “a successful surgeon and her schoolteacher husband that begin to suspect that she may be responsible for a child’s hit-and-run death” and a growing number of suspicions that begin to challenge their marriage. \n\n\n\tSolomon serves as writer, executive producer and showrunner on the series, serving as his TV follow-up to co-creating and writing the HBO Max limited series “Full Circle” with Steven Soderbergh. The pair collaborated again on the art-world comedy feature “The Christophers,” which was acquired by Neon following a premiere at the Toronto International Film Festival.\n\n\tAlong with Solomon, Robin Sweet and Ariel Kleiman are also executive producers. Kleiman will direct.\n\n\tDanes and McGregor were once tapped to work together more than 20 years ago, when both were attached to Jodie Foster’s unrealized circus drama “Flora Plum.” Danes will next be seen in November, starring alongside Matthew Rhys in Netflix’s miniseries “The Beast Inside Me.” Recent credits include her Emmy-nominated work on FX’s limited series “Fleishman Is in Trouble” and a leading turn on Solomon’s “Full Circle.” McGregor last led the Paramount+ limited series “A Gentlemen in Moscow,” which earned him Golden Globe and Critics’ Choice nominations. He won an Emmy in 2021 for leading Netflix’s “Halston” and will lead Warner Bros.’ upcoming sci-fi summer release “Flowervale Street.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Claire Danes, Ewan McGregor to Lead ‘The Spot’ at Hulu",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/danes-mcgregor-split.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-31T01:30:00.000Z",
      "dateModified": "2025-10-31T01:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Resale Sites Unveil Promo Codes to Grab Sales As World Series Ticket Prices Rise to $900 Ahead of Dodgers vs. Jays Finale",
    "url": "https://variety.com/2025/shopping/athletes/dodgers-jays-world-series-tickets-2025-buy-cheap-seats-online-1236557996/",
    "image": "https://variety.com/wp-content/uploads/2025/10/buy-world-series-tickets-online.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-31T01:00:00.000Z",
    "description": "\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.\n\n\tThe 2025 ",
    "body": "\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.\n\n\tThe 2025 World Series matchup is into its home stretch, with the Los Angeles Dodgers trailing the Toronto Blue Jays 3-2 in the Major League Baseball (MLB) Championship.\n\n\tThe Dodgers are hoping to repeat as World Series champs after defeating the New York Yankees in five games last fall. L.A. would be the first time to win back to back titles since the Yankees three-peated in 1998, 1999 and 2000. Toronto, meantime, earned a spot in the Fall Classic for the first time since the Jays won it all in 1993.\n\n\n\tWant to watch the World Series on TV? This year’s games air live on FOX and you can watch the Dodgers vs. Jays with any basic antenna or cable package that includes a local FOX affiliate. You can also stream the World Series online with a live TV streamer like DirecTV (new customers can get a five-day free trial here).\n\t\n\t\tHow to Get 2025 World Series Tickets Online\t\n\n\tIf you want to watch the World Series in person, you’ll want to snag tickets while they’re still available online. As of this writing, tickets are already sold out on MLB.com and seats to see the Dodgers vs. Jays are going for up to $10,000 on third-party ticketing sites like Stubhub and Vivid Seats.\n\t\n\t\tFind World Series Tickets on StubHub\t\n\n\tStubHub has the widest selection of World Series tickets that we’re seeing right now, with prices starting at $900 for the remaining Dodgers vs. Jays games at Rogers Centre.\n\n\tStubHub lets you search for tickets by price point and section, and you can even narrow your search down by zones — say, if you want to be behind the dugout, along the baseline, or in the “home run seats” to (hopefully) catch a ball. You can also search for tickets by perks, with StubHub currently showing availability for VIP passes that include food, drinks and parking. \n\n\n\tStubHub’s FanProtect Guarantee ensures valid tickets or your money back. And if there is an issue with your order, the site says customers will receive comparable or better tickets, or be provided with an option to get you money back.\n\t\n\t\tFind World Series Tickets on Vivid Seats\t\n\n\tThere are also few ways to score a deal on World Series tickets and find “cheap” (or discounted) seats online. We like Vivid Seats, which has Jays vs. Dodgers tickets starting from $980 for Game 6 at the Rogers Centre in Toronto. If you’re buying group tickets, Vivid Seats is a solid bet, with a rewards program that gets you your eleventh ticket free (in the form of site credit) after you purchase ten stubs.\n\n\tLooking for a promo code for World Series tickets? Use code VR30 to save $30 off your purchase of $300 or more at VividSeats.com. New customers can also save 15% off their first purchase by signing up for the Vivid Seats email list. As of now, the discounts cannot be combined so do a little calculation before you add to cart to see which promotional offer works best for you.\n\t\n\t\tFind World Series Tickets on SeatGeek\t\n\n\tThe Dodgers announced a new partnership with SeatGeek in March, with the third-party site acting as the “Official and Exclusive Ticket Marketplace Partner” for the team this season. Fans looking to buy and sell Dodgers tickets with the team’s official partner can head to SeatGeek’s website or download the SeatGeek app.\n\n\tWorld Series tickets on SeatGeek start at $1,014 as of this writing, with a decent selection of seats available. Use the promo code VARIETY10 to save an extra $10 off purchase of $250 or more at SeatGeek.com. The site offers digital delivery of tickets so you’ll have them “in hand” (on your phone or in your email inbox) in time for the game.\n\t\n\t\tFind World Series Tickets on TicketNetwork\t\n\n\tTicketNetwork is an online marketplace offering authentic World Series tickets with fees included in the viewable price. TicketNetwork currently has Jays tickets starting from $1,100 for general admission at Rogers Centre, going all the way up to $20,000 for seats behind home plate.\n\n\tNew customers can use our exclusive promo code VARIETY150 for $150 off purchases of $500 or more. Use discount code VARIETY300 for a $300 savings on orders of $1000 and up. Like the sites above, TicketNetwork offers a 100% money-back guarantee. And since they are a resale marketplace, and not a box office or venue agent, prices could be above or below face value (say, if you search for tickets after the baseball game has started).\n\n\n\tThis year’s World Series has been a celeb-studded affair, with everyone from Jays fans Justin Bieber and  anthem singer Deborah Cox, to Dodgers fans Sydney Sweeney, Chris Pine, Prince Harry and Meghan Markle all spotted in attendance at the games.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Resale Sites Unveil Promo Codes to Grab Sales As World Series Ticket Prices Rise to $900 Ahead of Dodgers vs. Jays Finale",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/buy-world-series-tickets-online.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-31T01:00:00.000Z",
      "dateModified": "2025-10-31T01:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘9-1-1’ Star Aisha Hinds on Hen and Athena’s Interstellar Fate and What Comes After the Four-Episode Space Epic",
    "url": "https://variety.com/2025/tv/news/911-hen-athena-space-ending-explained-aisha-hinds-1236566389/",
    "image": "https://variety.com/wp-content/uploads/2025/10/911-Hen-Athena-Aisha-Hinds.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-31T01:00:00.000Z",
    "description": "\n\tSPOILER ALERT: This review contains spoilers for the Oct. 30 episode of “9-1-1.”\n\n\tHouston, we have no more problems. \n\n\tOn Thursday’s episode of “9",
    "body": "\n\tSPOILER ALERT: This review contains spoilers for the Oct. 30 episode of “9-1-1.”\n\n\tHouston, we have no more problems. \n\n\tOn Thursday’s episode of “9-1-1,” Athena (Angela Bassett) and Hen (Aisha Hinds) finally made it back to Earth after a four-episode arc that had them journeying to and from space. What was meant to be a quick trip up and back as a reward for saving a billionaire’s life turned into Hen and Athena’s personal Apollo 13.\n\t\n\n\tWith help from Hen’s physicist wife Karen (Tracie Thoms) and Athena’s willingness to once again put her life on the line for the people closest to her, “9-1-1” avoided losing two major characters. “9-1-1” hasn’t been shy about killing off major characters, such as Peter Krause’s Captain Bobby Nash last season.\n\n\n\t“Listen, no one’s safe at any moment; we know that” Hinds told Variety. “When you have an adventure as intense as going into space and knowing the fabric, the nature and the DNA of ‘9-1-1’ — you can send us to the safest place on Earth and there is going to be a magnanimous mishap of sorts. So it was like, ‘Where does this go?'”\n\n\tAccording to Hinds, she and Bassett were not informed by “9-1-1” showrunner Tim Minear about their fates heading into the multi-episode arc, and instead the writers “slowly rolled it out for us.” \n\n\t“We didn’t know our next move until we were deep into this move — which was also what added to the adventure of it all,” Hinds said.\n\n\tA pivotal moment in the episode is when Athena insists she be the one to go out into space and attempt to fix the ship so that everyone can get home. Athena tells her best friend Hen that Hen needs to live for Karen and their young kids, but that Athena is willing to risk it all after her husband Bobby’s death, and now that her children are older. This present-day moment comes as viewers are seeing part of Athena’s past where she lost a beloved partner in the field, and grappled with how to move on and live without them.\n\t\n\n\t“It was that moment where I felt the fabric of their friendship,” Hinds said. “When I first signed on to do the show, one of the things they talked to me about was Hen’s character will be best friends with Angela’s character. And that was a selling point for me. And I felt the fabric of that friendship in that moment; grappling with watching her out there and knowing the danger. So all throughout I was like, ‘Are we gonna die? Do we die? And so it made getting out of there and Karen being the one to lead us out of there, that much more gratifying and satisfying. You got us out here in space. Athena’s literally walking in space to try to help save our lives. But she’s doing it willingly in a way that’s feeling like she has nothing more to live for, but helping us to all realize that there is so much more to life. And I’m so glad that she gave it all to be able to get out of there.”\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tCourtesy of Disney/Christopher Willard\n\t\n\n\n\n\tBut what does all this mean for Hen and Athena now that they need to return to normal life after facing an experience very few people in existence have ever been through?\n\n\t“It was certainly an incredibly traumatic experience, so much so that you get on the ground and all Athena can do is laugh hysterically and it becomes contagious,” Hinds said. “That’s the question is, do you laugh to keep from feeling all of the other emotions and thinking the real thoughts that come along with the fact that you just faced death in a real way, and the uncertainty of that? But then the flip side of looking at that is, now we’re even more fortified. What on Earth could really stop us at this point? What life experiences on the ground could really throw us? That gives us a fortified renewal for life, and an appreciation for our family and the opportunities to get to be reunited with them and do the work that we do.”\n\n\tHinds notes that Hen and Athena “may spend the rest of the season sort of grappling with those two things,” and then added: “Will the trauma of it overwhelm us, or are we so triumphant that we got to land on the ground and see our family again, and so therefore it’s us against the world at this point?”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘9-1-1’ Star Aisha Hinds on Hen and Athena’s Interstellar Fate and What Comes After the Four-Episode Space Epic",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/911-Hen-Athena-Aisha-Hinds.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-31T01:00:00.000Z",
      "dateModified": "2025-10-31T01:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Pen-ek Ratanaruang Talks Casting, ‘Last Life In The Universe’ and Miike Takashi’s ‘Punch Perm’",
    "url": "https://variety.com/2025/film/festivals/pen-ek-ratanaruang-last-life-in-the-universe-1236566510/",
    "image": "https://variety.com/wp-content/uploads/2025/10/Pen-ek-Ratanaruang-Fujimoto-Akio.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-31T01:31:06.000Z",
    "description": "\n\tAcclaimed Thai director Pen-ek Ratanaruang is back at the Tokyo International Film Festival presenting his latest film “Morte Cucina.” But it was hi",
    "body": "\n\tAcclaimed Thai director Pen-ek Ratanaruang is back at the Tokyo International Film Festival presenting his latest film “Morte Cucina.” But it was his storied collaboration with Japanese actors that took centerstage at a masterclass with “Lost Land” director Fujimoto Akio.\n\n\tThe counterpoint focus of their work, Ratanaruang’s frequent use of Japanese talent and Fujimoto’s focus on Southeast Asian subjects was a central theme of the discussion.\n\t\n\n\tRatanaruang reminisced about working with legendary Japanese filmmaker Miike Takashi on his 2003 film “Last Life in the Universe,” the latter making a cameo as a yakuza boss. Miike took the reins for his own character’s look and support cast.\n\n\n\t“He said he knew who to cast as his henchmen. One was his screenwriter, and the other was an actor that he used all the time. He said he’s going to design all the costumes for all three of them, because he knew how Yakuza really dressed like,” recounted Pen-ek.\n\n\tAccording to Ratanaruang, Miike even insisted on a specific hairstyle, the Punch Pama, a tight cropped perm popular amongst underworld elements in the 1970s.\n\n\t“So he did everything for us. He did casting for us. He designed the costumes and when we had to film in Osaka for a week, he got all the [underworld] permissions for us because they all really admired him,” Ratanaruang said.\n\n\tRatanaruang shared another anecdote from Miike about the finished product.\n\n\t“He’s a really good director but a really terrible actor. He really sticks out. He doesn’t blend in,” said the Thai auteur. “He said that himself, you know, when he saw ‘Last Life In The Universe,’ he said ‘Pen-Ek, you made such a beautiful film… the only thing that was bad in it is me.’”\n\t\n\n\tA key point of overlap in the conversation between Fujimoto and Ratanaruang was how their casting process tended to impact the screenplay.\n\n\t“The most fearful thing, the most frightening thing about filmmaking is when people lose interest after 20 minutes into the film or they fall asleep. You have to fight against losing the audience, against them losing interest,” said Ratanaruang.\n\n\t“So what’s on the screen has to be really interesting. And I think most of the time the actors are on the screen. You cast someone you think the audience can watch for two hours without losing interest. You go for those,” he added.\n\n\t“Someone who maybe doesn’t speak well, who can’t act at all, but just the presence is so great that you have to keep watching. And they may not fit exactly what you wrote in the script. So you change the script to fit them,” he said.\n\n\tIn a similar vein, Japanese director Fujimoto detailed the challenging and delicate process of casting non-professional Rohingya actors for his film “Lost Land,” which focuses on the refugee experience in Myanmar.\n\n\t“Originally in the screenplay, it was about two 14-year-old brothers. But as I was [scouting Rohingya schools] I saw this little boy, four years old at the time, and I felt like this boy is so good and he might lead the movie,  and I went to his home, and he had an older sister and I thought ‘Wow, the sister is good, too’ So then let’s, let’s rewrite the screenplay,” said Fujimoto.\n\n\tDue to the real-life dangers the refugees face, he declined to reveal specifics about where he found his cast or the filming locations, stating, “I cannot really tell you where I found them, because we can’t let people know where they live.”\n\n\tFujimoto’s main actors, a brother and sister, are Rohingya and face immense challenges to their freedom.\n\n\tThe filmmaker underscored their stateless reality when explaining why they could not travel to attend film festivals: “They don’t, they’re stateless. They don’t have passports, so basically, they can’t go out of wherever they’re living right now.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Pen-ek Ratanaruang Talks Casting, ‘Last Life In The Universe’ and Miike Takashi’s ‘Punch Perm’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/Pen-ek-Ratanaruang-Fujimoto-Akio.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-31T01:31:06.000Z",
      "dateModified": "2025-10-31T01:31:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sony Pictures International Eyes Live-Action Adaptations of Japanese Anime – Tokyo Market",
    "url": "https://variety.com/2025/film/global/sony-pictures-international-productions-anime-to-live-action-push-tokyo-market-1236566492/",
    "image": "https://variety.com/wp-content/uploads/2025/10/Kingdom.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-31T01:13:29.000Z",
    "description": "\n\tSony is accelerating its pursuit of anime and manga properties for live-action adaptation, with executive VP, creative production and head of Sony P",
    "body": "\n\tSony is accelerating its pursuit of anime and manga properties for live-action adaptation, with executive VP, creative production and head of Sony Pictures International Productions Shebnem Askin revealing ambitious plans to expand beyond the studio’s hit “Kingdom” franchise during a presentation at TIFFCOM, the market arm of the Tokyo International Film Festival. \n\n\t“Since I came here, I’m taking so many great meetings with a lot of companies that are producing incredible stories with anime,” Askin told attendees at the Tokyo content market. “We are starting to look at different anime movies where we can hopefully adapt as live action movies around the world. This is one of our missions by attending TIFFCOM.”\n\t\n\n\tSPIP operates as one of nine labels under Sony Pictures Entertainment and produces local-language content across 10 countries including Japan, Korea, China, India, Thailand, France, Germany, Spain, Italy, Brazil and Mexico.\n\n\n\tAskin emphasized that SPIP’s anime-to-live-action efforts would complement Sony’s broader animation business, which includes Crunchyroll and Aniplex. She cited recent successes including “Demon Slayer,” which became the highest-grossing Japanese movie of 2025 worldwide, and “Chainsaw Man,” which opened to $100 million globally this past weekend.\n\n\t“It doesn’t really matter which division we all work for Sony, and I’m equally proud, whether it’s our production or not,” Askin said, underscoring the studio’s collaborative approach across divisions.\n\n\tCurrently, SPIP’s sole manga-to-live-action adaptation is the “Kingdom” franchise, based on the Japanese manga property. Askin also highlighted Mamoru Hosoda’s upcoming “Scarlet,” set for November release in Japan, as an original anime movie rather than an adaptation.\n\t\n\n\tThe studio’s anime ambitions are part of a broader IP strategy that has seen SPIP develop a robust business model centered on both original content and strategic remakes. Askin presented a compelling case for the strength of local productions worldwide, noting that local films command 76% of Japan’s box office, 61% of South Korea’s market, and 89% of India’s theatrical business.\n\n\t“Local movies around the world can gross as high at the box office as big commercial Hollywood movies,” Askin said. “We don’t only think local, but we become local in each and every territory.”\n\n\tThe studio has built three successful theatrical franchises: Germany’s “The Three Investigators” series based on children’s books, Spain’s “Father is the Only One” remake franchise, and Japan’s “Kingdom.” The Spanish “Father” series, adapted from Argentine property “Ten Days Without Mom,” has produced five installments, with the most recent entry opening with $16 million against “Top Gun: Maverick’s” $10 million in 2022.\n\n\tSPIP’s approach to IP development prioritizes original content while selectively acquiring and remaking proven properties. Recent originals include Korean thriller “Hijack 1971,” based on a true story of a 1971 plane hijacking to North Korea, and Mexican genre film “Night Shift,” which became the highest-grossing Mexican genre movie in the past decade.\n\n\tFor remakes, the studio has developed a multi-territory strategy, producing local versions of Sony properties including “50 First Dates” (Japan and Mexico), “Friends with Benefits” (Brazil with HBO Latin America), and “Date to Funeral” (Spain). Askin revealed that a Mexican version of “Shall We Dance?” is currently in post-production starring Adrian Uribe, Mexico’s biggest comedy actor, representing a collaboration with Sony Music Vision.\n\n\t“We have creative approval,” Askin explained regarding the greenlight process. “Every movie has to have a P&L. If we love a project creatively, we love the script, we love the cast, we love the producers. We get theatrical estimates from our local managing director and television values from Sony’s international sales team. We at least have five signatures before we greenlight the movie.”\n\n\tThe studio also acquires select properties for distribution, including “YOLO,” for which SPIP secured all rights outside China, and “The Legend of Condor Heroes.” Brazilian drama “I’m Still Here” exemplified Sony’s collaborative approach, with SPIP acquiring the film for Brazil while Sony Classics picked it up for North America, where it grossed $5 million compared to $20 million in its home territory.\n\t\n\n\tAddressing the challenge of cultural adaptation, Askin acknowledged leaning on her background in international sales while emphasizing collaboration with local partners. “I never try to assume that I would know Italy better than an Italian producer, or I would know Germany better than our producers,” she said. “It really is a teamwork for us to make an adaptation of an IP from one country to another.”\n\n\tWhile SPIP has focused heavily on comedy and romantic comedy, genres traditionally considered difficult to export internationally, recent success with Argentine melodrama “The Heart Knows” on Netflix has opened doors to more dramatic content. The film, about a wealthy man who receives a heart transplant from a poor factory worker and subsequently falls in love with the donor’s widow, has remained in Netflix’s global top 25 for six months.\n\n\t“It tells me that a good drama also definitely has an audience around the world,” Askin said, noting that she is now developing an action-comedy slate, “which are really tough to find.”\n\n\tAddressing questions about streaming platforms, Askin emphasized that SPIP remains focused on theatrical distribution while viewing streamers as complementary partners rather than competitors. Over the past three years, the division has delivered 11 direct-to-streaming movies for Amazon Prime, Netflix and Max in Mexico.\n\n\t“We are a theatrical studio, so our number one mission is to make theatrical movies,” Askin said. “Even our conversations with streamers, what they really expect from us is to make great theatrical movies that deliver box office. I don’t think they run against each other, but they complement each other.”\n\n\tThe presentation comes as Sony expands its partnerships in Japan, though Askin declined to provide specific details about recent deals. “I am sure any IP that has been acquired by our studio will come to all of our attention,” she said.\n\n\tMeanwhile, studio’s distribution work with Chinese films earned recognition at the Shanghai International Film Festival, where Sony was honored as the best distributor worldwide for Chinese movies following its releases of “YOLO” and “The Legend of Condor Heroes.”\n\n\tAs SPIP continues to build its slate, Askin emphasized the primacy of authentic local storytelling over purely commercial considerations. “I believe the most powerful movie is a truly original movie, a story that really comes from that country,” she told an audience member asking about Taiwan. “In every country in the world, in its own recent history or old history, there is always an event, an incident that touched everyone by heart. So yes, we will be very open to developing original movies, whether in Taiwan or in any other country, if they are truly cinematic experiences.”\n\t\n\n\tThe presentation took place during the 22nd edition of TIFFCOM, which concludes Oct. 31 at Tokyo Metropolitan Industrial Trade Center Hamamatsucho-Kan during the Tokyo International Film Festival.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sony Pictures International Eyes Live-Action Adaptations of Japanese Anime – Tokyo Market",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/Kingdom.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-31T01:13:29.000Z",
      "dateModified": "2025-10-31T01:13:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Waymo Says Cat Darted Under Self-Driving Car Before Fatal San Francisco Crash",
    "url": "https://www.tmz.com/2025/10/30/waymo-says-cat-darted-under-self-driving-car-before-fatal-crash/",
    "image": "https://imagez.tmz.com/image/bb/16by9/2025/10/30/bb93e0b4e22a483c94329e39178d70fc_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-31T02:41:23.000Z",
    "description": "\n    \n                    \n                          Waymo\n                          Cat Darted Under Vehicle Before Fatal San Fran Accident\n         ",
    "body": "\n    \n                    \n                          Waymo\n                          Cat Darted Under Vehicle Before Fatal San Fran Accident\n                      \n                  \n                        Published October 30, 2025 7:41 PM PDT\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Waymo says its self driving vehicle struck a cat in San Francisco only after the animal suddenly darted underneath as the car began to pull away ... TMZ has learned.\n      \n    \n          A company spokesperson tells TMZ ... \"The trust and the safety of the communities we serve is our highest priority. We reviewed this, and while our vehicle was stopped to pick up passengers, a nearby cat darted under our vehicle as it was pulling away.\"\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          The spokesperson continued ... \"We send our deepest sympathies to the cat’s owner and the community who knew and loved him, and we will be making a donation to a local animal rights organization in his honor.\"\n      \n    \n          As we reported ... the accident happened earlier this week in the cities Mission District where the cat, affectionately known as the \"Mayor of 16th Street,\" had been a local favorite for years.\n      \n      \n              \n          \n                          \n                Fairly Legal\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Waymo Says Cat Darted Under Self-Driving Car Before Fatal San Francisco Crash",
      "image": [
        "https://imagez.tmz.com/image/bb/16by9/2025/10/30/bb93e0b4e22a483c94329e39178d70fc_xl.jpg"
      ],
      "datePublished": "2025-10-31T02:41:23.000Z",
      "dateModified": "2025-10-31T02:41:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Last Minute Halloween Costume Inspo ... Cozy Onesies for the Win!",
    "url": "https://www.tmz.com/2025/10/30/celebs-in-cozy-onesie-costumes-last-minute-costume-inspo/",
    "image": "https://imagez.tmz.com/image/5d/16by9/2025/10/29/5d85aa900a51496182751b301c8bb343_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-30T22:21:20.000Z",
    "description": "\n    \n                    \n                          Last Minute Halloween\n                          Costume Inspo ...\n                          Cozy ",
    "body": "\n    \n                    \n                          Last Minute Halloween\n                          Costume Inspo ...\n                          Cozy Onesies For The Win!\n                      \n                  \n                        Published October 30, 2025 3:21 PM PDT\n                                                                            \n      \n    \n      \n        \n              \n    \n    \n          Even the celebs opt for optimal comfort when it comes to Halloween costumes ... Rockin' a onesie eliminates many reasons for a last-minute panic ...\n      \n    \n          Kelly Rowland proved the squad costume potential -- seen here sportin' \"Bluey\" with her kiddo. Taylor Swift remained weather-proof, captioning her onesie 'fit ... \"Can’t talk right now, I’m doin hot squirrel sh*t 🐿\" ... and Rob Gronkowski's may be tall, handsome and mighty, but there's no wrong age for a cow-onsie!\n      \n    \n          Hit up the gallery and see all the celebs rollin' with this instant costume ... May the best onesie win!\n      \n      \n              \n          \n                          \n                Family Fun\n              \n                          \n                Photo Galleries\n              \n                          \n                Halloween\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Last Minute Halloween Costume Inspo ... Cozy Onesies for the Win!",
      "image": [
        "https://imagez.tmz.com/image/5d/16by9/2025/10/29/5d85aa900a51496182751b301c8bb343_xl.jpg"
      ],
      "datePublished": "2025-10-30T22:21:20.000Z",
      "dateModified": "2025-10-30T22:21:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Lady Gaga's Grandmother Dead at 94",
    "url": "https://www.tmz.com/2025/10/30/lady-gaga-grandma-dead/",
    "image": "https://imagez.tmz.com/image/f7/16by9/2025/10/13/f77d89180ed7465aa3e8c767717e7818_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-30T22:30:37.000Z",
    "description": "\n    \n                    \n                          Lady Gaga\n                          Grandma Dead at 94\n                      \n                  \n",
    "body": "\n    \n                    \n                          Lady Gaga\n                          Grandma Dead at 94\n                      \n                  \n                        Published October 30, 2025 3:30 PM PDT\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Lady Gaga's grandmother, Angelina Calderone Germanotta, has died ... TMZ has learned.\n      \n    \n          Angelina -- the mother of Gaga's dad, Joe Germanotta -- passed away on October 12, just days shy of her 95th birthday. A funeral for Angelina was held on October 17 in Pompton Plains, New Jersey.\n      \n    \n          Angelina was the matriarch of the Germanotta family and had a special bond with her superstar granddaughter. In fact, Gaga's full name -- Stefani Joanne Angelina Germanotta -- carries part of her late grandmother's name, a touching tribute Gaga has often said connects her to her family's legacy and Italian roots.\n      \n\n                  \n          \n                          \n                \n                  \n      \n    \n          Back in 2021, when Gaga's two French bulldogs were kidnapped in a Hollywood ambush that left her dog walker critically injured, Angelina spoke to the New York Daily News, showing the world her strength and empathy.\n      \n    \n          \"It's a cruel world we're living in,\" she said at the time. \"I'm praying this young man recovers, and I hope the dogs are found safe and in good health. The family is devastated. It's very, very sad that we’re living in a world where this can happen.\"\n      \n    \n          Lady Gaga has not yet commented publicly on her grandmother's passing. We reached out to her rep ... so far, no word back.\n      \n    \n          Angelina was 94.\n      \n    \n          RIP\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Lady Gaga\n              \n                          \n                RIP\n              \n                          \n                Family\n              \n                          \n                Music\n              \n                          \n                Fairly Legal\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lady Gaga's Grandmother Dead at 94",
      "image": [
        "https://imagez.tmz.com/image/f7/16by9/2025/10/13/f77d89180ed7465aa3e8c767717e7818_xl.jpg"
      ],
      "datePublished": "2025-10-30T22:30:37.000Z",
      "dateModified": "2025-10-30T22:30:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Riki Lindhome Selling Her Los Angeles Home for $2.8 Million",
    "url": "https://www.tmz.com/2025/10/30/riki-lindhome-selling-her-los-angeles-home-for-2-8-million/",
    "image": "https://imagez.tmz.com/image/02/16by9/2025/10/30/02691fb590624e99acc5e644a9d84f63_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-30T23:21:49.000Z",
    "description": "\n    \n                    \n                          Riki Lindhome\n                          Lists First L.A. Home for $2.8 Million\n                  ",
    "body": "\n    \n                    \n                          Riki Lindhome\n                          Lists First L.A. Home for $2.8 Million\n                      \n                  \n                        Published October 30, 2025 4:21 PM PDT\n                                                                            \n      \n    \n          Riki Lindhome has put her Los Angeles hideaway on the market and it's a mid-century dream perched above the city ... TMZ has learned.\n      \n    \n          Real estate sources tell TMZ ... the \"Wednesday\" actress and Garfunkel & Oates star just listed her first-ever solo home purchase for $2.795 million.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          The 4-bedroom, 3-bathroom property spans 2,311 square feet and sits on nearly 13,000 square feet of hillside land, offering sweeping panoramic views that stretch from downtown L.A. to the Hollywood Hills.\n      \n\n                  \n          \n                          \n                \n                  \n      \n    \n          Inside, the home oozes mid-century magic ... vaulted ceilings, wood beams, skylights, and walls of glass seamlessly blending indoor and outdoor living. The main living area centers around a dramatic two-story window framing the city skyline, while the layout wraps around a lush backyard complete with a renovated saltwater pool, fire pit, and intimate sitting area overlooking the city.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Riki tells TMZ ... \"This extraordinary home spoke to me immediately. The views, the charm, the way the kitchen, hallway, and family room all look into the pool ... it was love at first sight. Once you stepped inside, it felt like an exhale ... calm, quiet, and full of light.\"\n      \n    \n          She calls it her \"sanctuary\" and says she hopes whoever buys it will feel the same sense of peace and connection she did when she first walked through the door.\n      \n    \n          Debbie Weiss of Compass holds the listing.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                TV\n              \n                          \n                Money\n              \n                          \n                Fairly Legal\n              \n                          \n                Celebrity Homes\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Riki Lindhome Selling Her Los Angeles Home for $2.8 Million",
      "image": [
        "https://imagez.tmz.com/image/02/16by9/2025/10/30/02691fb590624e99acc5e644a9d84f63_xl.jpg"
      ],
      "datePublished": "2025-10-30T23:21:49.000Z",
      "dateModified": "2025-10-30T23:21:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Gayle King Reportedly Leaving 'CBS Mornings' Next Year",
    "url": "https://www.tmz.com/2025/10/30/gayle-king-reportedly-expected-to-leave-cbs-mornings/",
    "image": "https://imagez.tmz.com/image/c4/16by9/2025/10/31/c41f1dcef9ba46688d579d5c44732a47_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-31T00:34:11.000Z",
    "description": "\n    \n                    \n                          Gayle King\n                          Reportedly Leaving 'CBS Mornings' Amid Network Shake-Up\n    ",
    "body": "\n    \n                    \n                          Gayle King\n                          Reportedly Leaving 'CBS Mornings' Amid Network Shake-Up\n                      \n                  \n                        Published October 30, 2025 5:34 PM PDT\n                                                                      |\n                Updated October 30, 2025 7:57 PM PDT\n                                    \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Gayle King could soon say goodbye to the \"CBS Mornings\" anchor chair ... with a new report claiming the TV legend is expected to step down next year amid major shakeups under new network leadership.\n      \n    \n          According to Variety, King, who's helmed CBS Mornings since 2012, may stay within the CBS family in a different capacity, possibly developing her own show. The report says the details haven't been finalized.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          The shake-up comes amid a sweeping overhaul led by newly appointed CBS News editor-in-chief Bari Weiss, who's been making moves across the network ... axing two streaming shows, cutting roughly 100 staffers, and parting ways with several on-air anchors and correspondents.\n      \n\n                  \n          \n                          \n                \n                  \n      \n    \n          Despite all the chatter, CBS is pumping the brakes on exit talks ... telling TMZ ... \"There have been no discussions with Gayle about her contract that runs through May 2026. She's a truly valued part of CBS and we look forward to engaging with her about the future.\"\n      \n    \n          Still, there's a clear pattern of change at the network ... former CBS Evening News anchor Norah O'Donnell stepped down earlier this year but stayed on as a senior correspondent, a path King could follow if she trades in early wake-ups for a new chapter.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Gayle King\n              \n                          \n                CBS\n              \n                          \n                Fairly Legal\n              \n                          \n                News\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Gayle King Reportedly Leaving 'CBS Mornings' Next Year",
      "image": [
        "https://imagez.tmz.com/image/c4/16by9/2025/10/31/c41f1dcef9ba46688d579d5c44732a47_xl.jpg"
      ],
      "datePublished": "2025-10-31T00:34:11.000Z",
      "dateModified": "2025-10-31T00:34:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]