[
  {
    "title": "Tom Cherones, ‘Seinfeld’ Producer and Director, Dies at 86",
    "url": "https://variety.com/2026/tv/obituaries-people-news/tom-cherones-dead-seinfeld-1236628041/",
    "image": "https://variety.com/wp-content/uploads/2026/01/TC.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-10T19:59:20.000Z",
    "description": "\n\tTom Cherones, the director and producer best known for working on 81 of the first 86 episodes of “Seinfeld” during the show’s first five years, has ",
    "body": "\n\tTom Cherones, the director and producer best known for working on 81 of the first 86 episodes of “Seinfeld” during the show’s first five years, has died. He was 86.\n\n\tCherones died on Jan. 5 at his home in Florence, Ore., from Alzheimer’s disease, a family spokesperson announced. \n\n\tCherones’s first directing credit for “Seinfeld” was the sitcom’s second episode, “The Stakeout,” which aired in May 1990. Known for wearing Hawaiian shirts on set, he contributed to the show’s visual language by shooting multi-camera in a way that achieved a more cinematic look than the standard sitcom aesthetic. He went on to direct many of the show’s more experimental episodes, including “The Chinese Restaurant,” “The Parking Garage,” and “The Contest.”\n\t\n\n\tCherones appeared on camera once during his run on “Seinfeld,” playing “the director” in the fourth-season episode “The Pilot,” in which he says he was “gonna rip that little guy [Jason Alexander’s George Costanza] a new one.”\n\n\n\tCherones received six Emmy nominations for “Seinfeld” and, in 1993, shared the coveted award for outstanding comedy series with creators Larry David and Jerry Seinfeld, among others. He also won a DGA Award and Golden Globe for the sitcom. \n\n\tBorn on Sept. 11, 1939, in Tuscaloosa, Ala., Cherones graduated from the University of New Mexico with a degree in journalism in 1961. After serving as an officer in the U.S. Navy until 1965, he earned a master’s degree in broadcast and film communications from the University of Alabama in 1967. \n\n\tCherones produced and directed several programs and series episodes at various PBS affiliates before joining station WQED in Pittsburgh, where he worked on productions including “Mister Rogers’ Neighborhood.” \n\t\n\n\tHe moved to Los Angeles in 1975 and worked as a production manager for “General Hospital” and “Welcome Back, Kotter.” He later became an independent producer, working with Warner Bros., ABC, CBS, Paramount, Lorimar and Mary Tyler Moore Productions. In 1980, he wrote and produced the feature-length film “Two of Hearts” for cable and public television. His credits also include “Caroline in the City,” “NewsRadio,” “Ellen,” “Boston Common,” “Growing Pains,” “Ladies Man,” “The Pitts” and “Desperate Housewives.” \n\n\tCherones eventually returned to the University of Alabama, where he taught a class in television production for 12 years, pro bono. \n\n\tCherones was married to Bobby Cherones, with whom he had two children, and later to Joyce Keener until her death in 2006. He is survived by his wife, Carol E. Richards; his daughter, Susan Cherones Lee and her husband Daniel; son, Scott Cherones and his wife, Linda; and grandchildren Jessa and Thomas Cherones, as well as several brothers and sisters-in-law, nieces and nephews.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tom Cherones, ‘Seinfeld’ Producer and Director, Dies at 86",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/TC.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-10T19:59:20.000Z",
      "dateModified": "2026-01-10T19:59:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Matt Rogers Apologizes for Urging Voters Not to Donate to Jasmine Crockett’s Senate Campaign, Says He Has ‘Great Respect’ for Her: ‘My Phrasing Was Not Right’",
    "url": "https://variety.com/2026/digital/news/matt-rogers-apologizes-not-support-jasmine-crockett-senate-campaign-1236628070/",
    "image": "https://variety.com/wp-content/uploads/2026/01/rogers-crockett.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-10T19:25:42.000Z",
    "description": "\n\tMatt Rogers has apologized for previous comments urging voters not to donate to Texas Democratic Rep. Jasmine Crockett’s U.S. Senate campaign, after",
    "body": "\n\tMatt Rogers has apologized for previous comments urging voters not to donate to Texas Democratic Rep. Jasmine Crockett’s U.S. Senate campaign, after the remarks sparked online backlash.\n\n\t“Hey everybody. I hear the response and I am taking every bit of it to heart, I promise,” the comedian and “Las Culturistas” podcast co-host wrote on his Instagram Story on Saturday. “Transparency and candor matter to me, especially on the podcast. I’m a very progressive person who cares deeply about winning these elections, but my phrasing was not right. I will be more thoughtful! I really do promise.” \n\t\n\n\tRogers continued, “I have great respect and admiration for Rep. Crockett, and I regret that my words suggested otherwise. I just want us to win and I will be better at finding ways to help.” \n\n\n\tOn a recent episode of the “Las Culturistas” podcast, co-hosted by Rogers and “SNL” alum Bowen Yang, the duo discussed their political views amid the current climate, including predictions for the 2028 presidential election and the future of the Democratic Party. Rogers said he does not believe California Gov. Gavin Newsom will emerge as the party’s 2028 presidential nominee.\n\n\t“Any time a politician is making it too obviously about themselves, I’m already done. And don’t waste your money sending to Jasmine Crockett. Do not do it. Don’t do it, you’re going to waste your money,” Rogers said, looking into the camera. Yang responded, “I must agree,” before Rogers elaborated on his point moments later.\n\n\tRogers said he fears the party could “flop by putting up whatever everyone said they hated in the beginning,” describing that scenario as nominating “an establishment California Democrat.” “It doesn’t work,” he said.\n\t\n\n\tRogers further explained his thoughts on Crockett, saying on the podcast, “Let me just qualify the Jasmine Crockett thing. She’s not going to win a Senate seat in Texas, you guys. If Beto O’Rourke couldn’t do it, Jasmine Crockett is not going to do it.” He continued, “It’s nothing against her, it’s just that she is a politician, in that she is very well-defined already, and it’s my opinion that we’re going to need someone who is less defined at this moment that rises up.”\n\n\tRead Roger’s statement from his Instagram story below: \n\n\n\n\t\n\n\t\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Matt Rogers Apologizes for Urging Voters Not to Donate to Jasmine Crockett’s Senate Campaign, Says He Has ‘Great Respect’ for Her: ‘My Phrasing Was Not Right’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/rogers-crockett.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-10T19:25:42.000Z",
      "dateModified": "2026-01-10T19:25:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘The Audacity’ Puts a Spotlight on the Human Side of Silicon Valley",
    "url": "https://variety.com/2026/tv/news/billy-magnussen-simon-helberg-audacity-amc-silicon-valley-1236628016/",
    "image": "https://variety.com/wp-content/uploads/2026/01/GettyImages-2254497443.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-10T18:35:38.000Z",
    "description": "\n\tFor Silicon Valley in 2026, is it a time of Renaissance or a return to the Dark Ages? AMC Network‘s “The Audacity” aims to probe all the power, dram",
    "body": "\n\tFor Silicon Valley in 2026, is it a time of Renaissance or a return to the Dark Ages? AMC Network‘s “The Audacity” aims to probe all the power, drama and influence that exudes from San Jose and environs.\n\n\tStars Billy Magnussen and Simon Helberg took part in Variety‘s annual summit at the Consumer Electronics Show in Las Vegas on Jan. 7 to preview the dramedy set to bow April 12 on AMC Network. Created by Jonathan Glatzer, an alum of AMC’s “Better Call Saul” and HBO’s “Succession,” “The Audacity” revolves around an aspiring tech CEO character played by Magnussen and a successful but deeply alienated founder and inventor played Helberg. \n\t\n\n\tDan McDermott, chief content officer for AMC Networks and president of AMC Studios, and “The Audacity” executive producer Gina Mingacci also took part in the session that is featured on today’s episode of Variety‘s “Strictly Business” podcast.\n\n\n\t“This show is a throwback in a lot of ways to the origins of AMC storytelling with shows like ‘Mad Men’ and ‘Breaking Bad,’ ‘Better Call Saul,’ ‘Killing Eve,’ ” McDermott explains. “We focus on three primary things: One is lightning-in-a-bottle characters that can break out and become part of the cultural conversation. We can put them on a billboard and everybody will know that’s Duncan [Magnussen’s character] from ‘The Audacity.’ The second is that they take the audience into a unique world or subculture that we either haven’t seen portrayed or haven’t seen portrayed in this particular way. And the third is we want to be entertaining and fun, of course, but we also want our shows to have a real cultural meaning and ballast and be about something important.”\n\t\n\n\tMagnussen’s enthusiasm for his role as the leader of an upstart data-mining firm is palpable. He was immediately drawn to the subject and bowled over by Glatzer’s scripts.\n\n\t“There’s times in history where there’s a Renaissance and Silicon Valley is one of those times in our modern era which is defining humanity,” he observed. “What better place to make a dark comedy than in that place that develops our society at this point. For me, 20 years in this industry, you see the script that Jonathan Glatzer wrote and you’re just like, ‘Damn, this is fantastic.’ “\n\n\n\n\t\n\n\t\t\t\t\t‘Strictly Business’ host Cynthia Littleton with ‘The Audacity’ stars Simon Helberg and Billy Magnussen, AMC Networks’ Dan McDermott and executive producer Gina Mingacci  (Photo by Brenton Ho/Variety via Getty Images)\n\t\t\t\t\t\t\t\t\tVariety via Getty Images\n\t\n\n\n\n\tHelberg was pressed on whether he did a lot of research on Big Tech and AI to bring his character to life. “I did not have to research to loneliness,” he quipped.\n\n\t“My character, Martin, like many people probably in the Valley is a bit of a maladjusted genius. Went to Stanford at 15, made a chunk of money early on in tech, and now he spends every waking minute locked in his garage with an AI companion that he’s developing to help alienated teenagers,” Helberg explained. “But he has his own alienated teenager daughter who he completely neglects and all the other people around him too. He’s a bit of a recluse. And there’s loneliness at the heart of all the characters, and they’re all trying to connect, and they’re trying to connect through technology, which has some pitfalls.”\n\n\t“The Audacity” is a big swing for AMC and the producers at a time when it’s extremely hard to launch wholly original concepts amid the crush of IP-based material that swirls around linear and streaming TV. Mingacci, a former AMC executive who executive produced the BBC America/AMC drama “Killing Eve,” said that high hurdle is all the more reason to pursue fresh and distinctive projects.\n\n\t“It actually was the same challenge as ‘Killing Eve,’ which is, we do not have as much money as everyone else has, not as much time to make it, but you want to be here. You want to be playing here and hopefully we’ve delivered on that,” Mingacci said. “There is no one better than AMC to make morally complex characters come to life. And those are very specific shows that are hard to get made right now.”\n\t\n\n\tThe episode also features highlights of Variety‘s CES conversation with Anthony Wood, founder, chairman and CEO of Roku.\n\n\t(Pictured top: ‘The Audacity’ stars Simon Helberg and Billy Magnussen with AMC Networks’ Dan McDermott)\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘The Audacity’ Puts a Spotlight on the Human Side of Silicon Valley",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/GettyImages-2254497443.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-10T18:35:38.000Z",
      "dateModified": "2026-01-10T18:35:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sydney Sweeney, Michael B. Jordan, Timothée Chalamet and More Golden Globes 2026 Celeb Party Pics",
    "url": "https://variety.com/gallery/golden-globes-party-photos-2026/",
    "image": "https://variety.com/wp-content/uploads/2026/01/JCO10586_21fc3d.jpg?w=663&h=373&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-10T19:36:48.000Z",
    "description": "\n\t\n\t\t\t\n\t\t\t\t\n\t\n\n\t\n\tJan 10, 2026 11:36am PT\t\n\t\n\n\t\n\t\tSydney Sweeney, Michael B. Jordan, Timothée Chalamet and More Golden Globes 2026 Celeb Party Pics\n\t\n",
    "body": "\n\t\n\t\t\t\n\t\t\t\t\n\t\n\n\t\n\tJan 10, 2026 11:36am PT\t\n\t\n\n\t\n\t\tSydney Sweeney, Michael B. Jordan, Timothée Chalamet and More Golden Globes 2026 Celeb Party Pics\n\t\n\t\n\t\t\t\n\n\n\t\t\t\n\t\t\t\n\t\n\n\t\t\t\t\t\t\t\t\tJC Olivera\n\t\n\n\t\t\n\t\n\t\t\t\tThe Golden Globes may be on Sunday, Jan. 11, but the celebrations began in the days and nights leading up to the big ceremony.\nOn Wednesday, the Globes gathered at the Beverly Hilton to film “Golden Eve,” a CBS primetime special that honored Sarah Jessica Parker with the Carol Burnett Award and Helen Mirren with the Cecile B. DeMille Award. The following evening, Chanel hosted an intimate dinner at Chateau Marmont for its Coco Crush collection. Lily Allen performed for a guest list that included Connor Storrie, Tessa Thompson, Gracie Abrams, Keri Russell and Dakota Fanning.\nAdam Sandler, Sydney Sweeney, Teyana Taylor, Dwayne Johnson, Eva Victor, Kate Hudson, Russell Tovey and Storrie were among the party-goers who mixed and mingled at Variety‘s “Actors on Actors” pre-Golden Globes bash with Aman Beverly Hills presented by Morgan Stanley.\nCheck out all the best celebrity photos from Golden Globes week below. Make sure to keep checking back for more.\n\n\n\t\t\t\n\t\t\t\n\tTimothée Chalamet and Leonardo DiCaprio\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Courtesy\t\t\t\n\t\t\t\n\tTimothée Chalamet and Leonardo DiCaprio at the AFI Awards.\n\n\t\t\n\t\t\t\n\t\t\t\n\tLaura Dern, George Clooney and Adam Sandler\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Getty Images for AFI\t\t\t\n\t\t\t\n\tLaura Dern, George Clooney and Adam Sandler attend the AFI Awards at Four Seasons Hotel Los Angeles at Beverly Hills.\n\n\t\t\n\t\t\t\n\t\t\t\n\tRyan Coogler and Tim Cook\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Courtesy\t\t\t\n\t\t\t\n\tRyan Coogler and Tim Cook at the AFI Awards.\n\n\t\t\n\t\t\t\n\t\t\t\n\tLeonardo DiCaprio and Gwyneth Paltrow\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Getty Images for AFI\t\t\t\n\t\t\t\n\tLeonardo DiCaprio and Gwyneth Paltrow attend the AFI Awards.\n\n\t\t\n\t\t\t\n\t\t\t\n\tMiles Caton, Michael B. Jordan and Autumn Durald Arkapaw\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Getty Images for AFI\t\t\t\n\t\t\t\n\tMiles Caton, Michael B. Jordan and Autumn Durald Arkapaw attend the AFI Awards.\n\n\t\t\n\t\t\t\n\t\t\t\n\tCarol Burnett and Ariana Grande\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Courtesy\t\t\t\n\t\t\t\n\tCarol Burnett and Ariana Grande at the AFI Awards.\n\n\t\t\n\t\t\t\n\t\t\t\n\tGwyneth Paltrow and Jacob Elordi\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Courtesy\t\t\t\n\t\t\t\n\tGwyneth Paltrow and Jacob Elordi at the AFI Awards.\n\n\t\t\n\t\t\t\n\t\t\t\n\tTeyana Taylor\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: JC Olivera\t\t\t\n\t\t\t\n\tTeyana Taylor at the Variety & Golden Globes Pre-Golden Globes Party, Presented by Morgan Stanley at The Polo Lounge at The Beverly Hills Hotel.\n\n\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: JC Olivera\t\t\t\n\t\t\t\n\tSydney Sweeney at the Variety & Golden Globes Pre-Golden Globes Party, Presented by Morgan Stanley at The Polo Lounge at The Beverly Hills Hotel.\n\n\t\t\n\t\t\t\n\t\t\t\n\tEmily V. Gordon and Kumail Nanjiani\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: JC Olivera\t\t\t\n\t\t\t\n\tEmily V. Gordon and Kumail Nanjiani at the Variety & Golden Globes Pre-Golden Globes Party, Presented by Morgan Stanley at The Polo Lounge at The Beverly Hills Hotel.\n\n\t\t\n\t\t\t\n\t\t\t\n\tDylan Efron\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: JC Olivera\t\t\t\n\t\t\t\n\tDylan Efron at the Variety & Golden Globes Pre-Golden Globes Party, Presented by Morgan Stanley at The Polo Lounge at The Beverly Hills Hotel.\n\n\t\t\n\t\t\t\n\t\t\t\n\tMatthew Donnelly, Connor Storrie and Ramin Setoodeh\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Variety via Getty Images\t\t\t\n\t\t\t\n\tConnor Storrie joins Variety‘s Matthew Donnelly and Ramin Setoodeh at the Variety & Golden Globes Pre-Golden Globes Party, Presented by Morgan Stanley at The Polo Lounge at The Beverly Hills Hotel.\n\n\t\t\n\t\t\t\n\t\t\t\n\tTonatiuh\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: JC Olivera\t\t\t\n\t\t\t\n\tTonatiuh at the Variety & Golden Globes Pre-Golden Globes Party, Presented by Morgan Stanley at The Polo Lounge at The Beverly Hills Hotel.\n\n\t\t\n\t\t\t\n\t\t\t\n\tEthan Hawke\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: JC Olivera\t\t\t\n\t\t\t\n\tEthan Hawke at the Variety & Golden Globes Pre-Golden Globes Party, Presented by Morgan Stanley at The Polo Lounge.\n\n\t\t\n\t\t\t\n\t\t\t\n\tCynthia Littleton and Sue Kroll\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: JC Olivera\t\t\t\n\t\t\t\n\tCynthia Littleton and Sue Kroll at the Variety & Golden Globes Pre-Golden Globes Party, Presented by Morgan Stanley at The Polo Lounge at The Beverly Hills Hotel.\n\n\t\t\n\t\t\t\n\t\t\t\n\tRussell Tovey and Marc Malkin\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Variety via Getty Images\t\t\t\n\t\t\t\n\tRussell Tovey and Variety‘s Marc Malkin at the Variety & Golden Globes Pre-Golden Globes Party, Presented by Morgan Stanley at The Polo Lounge at The Beverly Hills Hotel.\n\n\t\t\n\t\t\t\n\t\t\t\n\tKate Hudson\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: JC Olivera\t\t\t\n\t\t\t\n\tKate Hudson and Odessa A’zion at the Variety & Golden Globes Pre-Golden Globes Party, Presented by Morgan Stanley at The Polo Lounge.\n\n\t\t\n\t\t\t\n\t\t\t\n\tConnor Storrie and Eva Victor\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Variety via Getty Images\t\t\t\n\t\t\t\n\tConnor Storrie and Eva Victor at the Variety & Golden Globes Pre-Golden Globes Party, Presented by Morgan Stanley at The Polo Lounge.\n\n\t\t\n\t\t\t\n\t\t\t\n\tBrad Goreski and Demi Moore\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Christopher Polk\t\t\t\n\t\t\t\n\tBrad Goreski and Demi Moore at the 2026 WWD Style Awards at the Regent Santa Monica Beach.\n\n\t\t\n\t\t\t\n\t\t\t\n\tEvan Goldberg, Seth Rogen, Ike Barinholtz, James Weaver and Chase Sui Wonders\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Jesse Grant\t\t\t\n\t\t\t\n\tEvan Goldberg, Seth Rogen, Ike Barinholtz, James Weaver and Chase Sui Wonders at the Variety & Apple TV Special Screening and Conversation for ‘The Studio’ at The Wallis Annenberg Theatre in Beverly Hills.\n\n\t\t\n\t\t\t\n\t\t\t\n\tTyriq Withers and Jason Bolden\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Chad Salvador\t\t\t\n\t\t\t\n\tTyriq Withers and Jason Bolden at the 2026 WWD Style Awards.\n\n\t\t\n\t\t\t\n\t\t\t\n\tHailey Bieber and Kourtney Kardashian Barker\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Christopher Polk\t\t\t\n\t\t\t\n\tHailey Bieber and Kourtney Kardashian Barker at the 2026 WWD Style Awards at the Regent Santa Monica Beach.\n\n\t\t\n\t\t\t\n\t\t\t\n\tGucci Westman and Cameron Diaz\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Getty Images\t\t\t\n\t\t\t\n\tGucci Westman and Cameron Diaz at The 2026 WWD Style Awards.\n\n\t\t\n\t\t\t\n\t\t\t\n\tGracie Abrams\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Variety via Getty Images\t\t\t\n\t\t\t\n\tGracie Abrams at Chanel’s Coco Crush dinner at Chateau Marmont.\n\n\t\t\n\t\t\t\n\t\t\t\n\tDakota Fanning\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Variety via Getty Images\t\t\t\n\t\t\t\n\tDakota Fanning at Chanel’s Coco Crush dinner at Chateau Marmont.\n\n\t\t\n\t\t\t\n\t\t\t\n\tKeri Russell\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Variety via Getty Images\t\t\t\n\t\t\t\n\tKeri Russell at Chanel’s Coco Crush dinner at Chateau Marmont.\n\n\t\t\n\t\t\t\n\t\t\t\n\tKelly Sawyer Patricof\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Variety via Getty Images\t\t\t\n\t\t\t\n\tKelly Sawyer Patricof at Chanel’s Coco Crush dinner at Chateau Marmont.\n\n\t\t\n\t\t\t\n\t\t\t\n\tConnor Storrie\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Variety via Getty Images\t\t\t\n\t\t\t\n\tConnor Storrie at Chanel’s Coco Crush dinner at Chateau Marmont.\n\n\t\t\n\t\t\t\n\t\t\t\n\tTessa Thompson\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Variety via Getty Images\t\t\t\n\t\t\t\n\tTessa Thompson at Chanel’s Coco Crush dinner at Chateau Marmont.\n\n\t\t\n\t\t\t\n\t\t\t\n\tLily Allen\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Variety via Getty Images\t\t\t\n\t\t\t\n\tLily Allen at Chanel’s Coco Crush dinner at Chateau Marmont.\n\n\t\t\n\t\t\t\n\t\t\t\n\tSteve Nissen, Marc Malkin, Brian Cox, Alan Cumming, Monica Lewinsky and Jerry Neuman\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Variety via Getty Images\t\t\t\n\t\t\t\n\tSteve Nissen, Marc Malkin, Brian Cox, Alan Cumming, Monica Lewinsky and Jerry Neuman at the ceremony honoring Alan Cumming with a Star on the Hollywood Walk Of Fame.\n\n\t\t\n\t\t\t\n\t\t\t\n\tMatthew Broderick, Sarah Jessica Parker and James Wilkie Broderick\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Penske Media via Getty Images\t\t\t\n\t\t\t\n\tMatthew Broderick, Sarah Jessica Parker and James Wilkie Broderick at Golden Eve: The Golden Globes Honor Helen Mirren & Sarah Jessica Parker at The Beverly Hilton.\n\n\t\t\n\t\t\t\n\t\t\t\n\tEvan Handler, Kristin Davis, Sarah Jessica Parker and David Eigenberg\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Penske Media via Getty Images\t\t\t\n\t\t\t\n\tEvan Handler, Kristin Davis, Sarah Jessica Parker and David Eigenberg at Golden Eve: The Golden Globes Honor Helen Mirren & Sarah Jessica Parker.\n\n\t\t\n\t\t\t\n\t\t\t\n\tJackie Tohan and Carol Burnett\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Penske Media via Getty Images\t\t\t\n\t\t\t\n\tJackie Tohn and Carol Burnett at the Golden Eve: The Golden Globes Honor Helen Mirren & Sarah Jessica Parker.\n\n\t\t\n\t\t\t\n\t\t\t\n\tHelen Mirren, Helen Hoehne, Carol Burnett and Sarah Jessica Parker\n\t\n\t\t\t\t\t\n\t\t\t\tImage Credit: Penske Media via Getty Images\t\t\t\n\t\t\t\n\tHelen Mirren, the Golden Globes’ Helen Hoehne, Carol Burnett and Sarah Jessica Parker at the Golden Eve: The Golden Globes Honor Helen Mirren & Sarah Jessica Parker.\n\n\t\t\n\t\n\t\n\n\n\t\n\t\tMore from Variety\n\t\n\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\n\n\t\t\n\n\t\n\t\tMore From Our Brands\n\t\n\t\n\t\t\n\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\n\tRolling Stone\n\n\t\t\t\t\tTaylor Swift and Sexy Sax: Inside the Banger Soundtrack for ‘People We Meet on Vacation’\t\t\n\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\n\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\n\tRobb Report\n\n\t\t\t\t\tA French Distillery Just Dropped the First Totally Clear Coffee Liqueur\t\t\n\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\n\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\n\tSportico\n\n\t\t\t\t\tNFL Playoff Teams Must Combat Record Flu Wave\t\t\n\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\n\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\n\tWWD\n\n\t\t\t\t\tInside the WWD Style Awards 2026: Demi Moore, George Clooney, Kristen Stewart & More\t\t\n\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\n\t\t\n\t\n\t\n\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sydney Sweeney, Michael B. Jordan, Timothée Chalamet and More Golden Globes 2026 Celeb Party Pics",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/JCO10586_21fc3d.jpg?w=663&h=373&crop=1"
      ],
      "datePublished": "2026-01-10T19:36:48.000Z",
      "dateModified": "2026-01-10T19:36:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How to Watch 2026 NFL Wild Card Games Live Online Without Cable for Free",
    "url": "https://variety.com/2026/shopping/news/how-to-watch-2026-nfl-wild-card-playoff-games-live-online-free-1236626578/",
    "image": "https://variety.com/wp-content/uploads/2026/01/NFL-Chargers-vs-Patroits-Getty-Featured.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-10T18:30:00.000Z",
    "description": "\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.\n\n\tNow that ",
    "body": "\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.\n\n\tNow that the 2025-26 NFL regular season is over, the playoffs picture is in full view with the NFL Wild Card Playoffs. There are six games scheduled this weekend with the best teams in the AFC and NFC competing to go to Super Bowl LX.\n\n\tAnd in 2026, there are six games during the NFL Wild Card Playoffs, which are spread over five networks (FOX, CBS, ABC, ESPN and NBC,) and one streaming service (Prime Video).\n\n\n\tPost-season games start on Saturday, Jan. 10 at 4:30 p.m. ET/1:30 p.m. PT. If you want to catch the games, there are a number of ways to watch online for free. Check out a complete NFL Playoffs schedule here.\n\n\t\n\t\tWho’s Playing During NFL Wild Card Playoffs?\t\n\n\tStarting on Saturday, Jan. 10, the first game during the NFL Wild Card Playoffs feature the Los Angeles Rams battling the Carolina Panthers at Bank of America Stadium in Charlotte, North Carolina. Kick off is scheduled for 4:30 p.m. ET/1:30 p.m. PT on FOX.\n\n\tAs for the second game on Saturday, the NFL has the Green Bay Packers taking on the Chicago Bears at Soldier Field in Chicago, Illinois, with a start time of 8 p.m. ET/5 p.m. PT. The game livestreams on Prime Video.\n\n\tOn Sunday, Jan. 11, Buffalo Bills play against the Jacksonville Jaguars at EverBank Stadium in Jacksonville, Florida with a start time of 1 p.m. ET/10 a.m. PT on CBS, while the second game has the San Francisco 49ers going head-to-head against Philadelphia Eagles at Lincoln Financial Field in Philadelphia, Pennsylvania starting at 4:30 p.m. ET/1: 30 p.m. PT on FOX.\n\n\tThe third game on Sunday features the Los Angeles Chargers taking on the New England Patriots at Gillette Stadium in Foxborough, Massachusetts with kickoff at 8 p.m. ET/5 pm. PT. The Wild Card game broadcasts on NBC (and Peacock), as part of “Sunday Night Football.”\n\n\n\tThe final game of the NFL Wild Card Playoffs is “Monday Night Football” on Monday, Jan. 12 with Houston Texans playing against the Pittsburgh Steelers at Acrisure Stadium in Pittsburgh, Pennsylvania. The game starts at 8:15 p.m. ET/5:15 p.m. PT on ABC or ESPN.\n\n\tThankfully, even without cable, you don’t have to miss any of the action this season. You can access in-market games on your TV with one of these many affordable cable antennas, and nearly all of the NFL games are also be available to livestream online on a variety of platforms, such as DirecTV and Hulu + Live TV. In fact, some services offer free trials that you can use to livestream NFL Wild Card Playoffs online for free.\n\t\n\t\tHow to Watch NFL Wild Card Playoffs Online: Livestream Football Games Without Cable\t\n\n\tScroll down and check out the best ways to stream the NFL Wild Card Playoffs, below:\n\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\t\t\t\tDirecTV\n\t\n\t\t\t\t\t\n\n\tDirecTV is one of the best ways for cable-cutters to access live sports and TV from home. Starting at $84.99 for the first month of series ($94.99/month afterwards), you get access to the streamer’s “Choice” package for NFL Wild Card Playoffs on FOX, ESPN, ABC, CBS and NBC.\n\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\t\t\t\tSling TV\n\t\n\t\t\t\t\t\n\n\tSling is one of the best options for affordable live streaming with the Sling Orange + Blue package going for $29.99 for your first month of service ($60.99 per month afterwards). The package includes ABC, NBC, FOX, and ESPN (Sling TV doesn’t include CBS), while it also includes the NFL Network for added analysis and commentary. Please note: Pricing and channel availability are subject to your local TV market.\n\n\tNFL fans can add the Sports Extra package to their plan for an additional $11/month to gain access to the NFL RedZone network.\n\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\t\t\t\tFubo\n\t\n\t\t\t\t\t\n\n\tFubo is one of the best options for streaming NFL games. The service features four of the networks that broadcast post-season games, including FOX, ESPN, ABC and CBS (Fubo doesn’t include NBC), while it has additional channels for analysis, like NFL Red Zone. It even has more than 100 live TV channels for cable-free streaming. The streamer offers a 7-day free trial to try out the service before you commit.\n\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\t\t\t\tHulu\n\t\n\t\t\t\t\t\n\n\tStarting at $89.99/month, Hulu + Live TV is a great option for live channel streaming NFL Wild Card Playoffs with access to FOX, ESPN, ABC, CBS and NBC, along with more than 90 other channels, like NFL Network, as well as access to hit originals on Disney+, Hulu and ESPN Unlimited.\n\n\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\t\t\t\tAmazon\n\t\n\t\t\t\t\t\n\n\tAmazon’s Prime Video streaming service is the home the Green Bay Packers-Chicago Bears game during the NFL Wild Card Playoffs, while its also the home to hit originals, like “The Boys,” “Mr. and Mrs. Smith,” “Fallout” and more. The service comes with a subscription to Amazon Prime.\n\n\tNot a member? Sign up for a 30-day free trial to take advantage of all that Amazon Prime has to offer, including access to Prime Video and Prime Gaming; fast free shipping in less than two days with Prime Delivery; in-store discounts at Whole Foods Market, access to exclusive shopping events — like Prime Day and Black Friday — and more.\n\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\t\t\t\tParamount+\n\t\n\t\t\t\t\t\n\n\tFor CBS games, Paramount+ has you covered with prices starting at $7.99/month or $12.99/month afterwards. Paramount+ even has a 7-day free trial (not included with the annual plan), so you can try out the service for yourself.\n\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\t\t\t\tNBCUniversal\n\t\n\t\t\t\t\t\n\n\tPeacock has the broadcast for the Chargers-Patroits game. In addition, the streaming service has access to “Sunday Night Football” this season. Peacock starts at $10.99/month for the ad-supported plan.\n\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\t\t\t\tNFL\n\t\n\t\t\t\t\t\n\n\tFor die-hard NFL fans, the NFL+ streaming service is a must. It features all games across broadcast and cable networks, including NFL Network, during the regular season, post-season, preseason and even the Super Bowl. It broadcasts 24 hours of everything NFL starting at $6.99/month. Learn more about NFL+ here.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How to Watch 2026 NFL Wild Card Games Live Online Without Cable for Free",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/NFL-Chargers-vs-Patroits-Getty-Featured.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-10T18:30:00.000Z",
      "dateModified": "2026-01-10T18:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Hamnet’ Star Paul Mescal on How the Film’s Ending Shows the Impact of Grief: ‘It’s Will’s Opportunity With an Audience — to Let Them In’",
    "url": "https://variety.com/2026/artisans/news/paul-mescal-hamnet-ending-grief-loss-1236626861/",
    "image": "https://variety.com/wp-content/uploads/2024/12/Paul-Mescal-Hamnet.jpg?w=900&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-10T18:00:00.000Z",
    "description": "\n\tPaul Mescal stars in “Hamnet” as a grieving William Shakespeare whose struggle to write ultimately transforms his loss into the inspiration for “Ham",
    "body": "\n\tPaul Mescal stars in “Hamnet” as a grieving William Shakespeare whose struggle to write ultimately transforms his loss into the inspiration for “Hamlet.”\n\n\tBut early on in the film, cinematographer Łukasz Żal and director Chloé Zhao wanted to show how very different Will and his wife Agnes (Jessie Buckley) were, using framing and location to emphasize that contrast.\n\n\tWhen they’re first introduced, Agnes is a free spirit living where the composition feels open. Will, on the other hand, “was in his head,” Żal says. “He is stuck in his family house, this place where he’s always teaching. The windows are small, and he’s always inside, always in a structure.”\n\t\n\n\tThat framing reflected a sense of suffocation.\n\n\tŻal wanted to capture the magic of Agnes and Will falling in love. “What you feel, how you look at somebody’s eyes. You’re also very present, and the world looks beautiful,” he explains. “When they are together, we become closer and follow the emotions.”\n\n\tHowever, their son Hamnet’s death changes everything. The skies become heavy, and there’s less light in the scenes. The colorful energy dissipates. “They are alone in their frames, and they’re not connected anymore,” he says. “The camera is still, slow and uncomfortably slow.”\n\n\tCostume designer Malgosia Turzanska also reflected Will’s journey through her designs.\n\n\tInspired by sportswear, Turzanska padded Will’s clothing — almost as a form of protection — when Will is home with his emotionally abusive father.\n\n\tShe also added slashes in his sleeves, which start off as tiny and become larger and longer.\n\t\n\n\tA tiny detail of his necklace — a toothpick — symbolized his father “picking” at him. After Hamnet’s death, Will travels to London, where he finishes “Hamlet.” When the production opens at the Globe Theatre, Will plays the ghost. For this, Turzanska researched ghost costumes and discovered how linen was historically used to bury the dead. As a result, she put Will in linen cloth and covered him in clay. The cracked clay reflects how broken of a man he is. At the very end, he washes it off, and he’s free.\n\n\tIn terms of the score, composer Max Richter says that when Will washes off the clay, “He just sortof breaks to pieces. This is the almost darkened version of this choral, vocal cloud, which we’ve had from the beginning, connected to Agnes and nature. But it’s almost like the cloud of a moonless night. So it’s kind of super dark.”\n\n\tOn playing Will and going on this journey, Mescal says, “I didn’t think about navigating it from, like, love to grief. I think I looked at it as analyzing somebody’s life.”\n\n\tHe adds, “I was excited by the fact that I would get to show a lot of colors in terms of that, and the more that we could really make an audience feel these two people were madly in love with each other, the more that we would feel the loss of their connection in the middle act and the final act a little bit. So it was exciting to me, because I could see how it might feel to an audience to jump into the end when you’re covered in clay. Visually, we see cracks in his face.”\n\n\tIn that scene, Mescal says he felt the pressure to “land the plane” from a character’s perspective. “We see how present Agnes’ grief is with the children because, ultimately, she’s at home with them for the vast majority of the film. And that’s really Will’s opportunity with an audience — to let them in, to see the cost of the loss of Hamnet and the impact that it has had on him.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Hamnet’ Star Paul Mescal on How the Film’s Ending Shows the Impact of Grief: ‘It’s Will’s Opportunity With an Audience — to Let Them In’",
      "image": [
        "https://variety.com/wp-content/uploads/2024/12/Paul-Mescal-Hamnet.jpg?w=900&h=563&crop=1"
      ],
      "datePublished": "2026-01-10T18:00:00.000Z",
      "dateModified": "2026-01-10T18:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Anaconda’ Crosses $100 Million Globally",
    "url": "https://variety.com/2026/film/box-office/anaconda-crosses-100-million-global-box-office-1236627969/",
    "image": "https://variety.com/wp-content/uploads/2025/09/anaconda.png?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-10T17:34:24.000Z",
    "description": "\n\t“Anaconda” has slithered its way to a box office milestone. \n\n\tThe Sony adventure comedy, starring Jack Black and Paul Rudd, has crossed $100 millio",
    "body": "\n\t“Anaconda” has slithered its way to a box office milestone. \n\n\tThe Sony adventure comedy, starring Jack Black and Paul Rudd, has crossed $100 million at the worldwide box office. As of Friday, the film’s global gross stands at $101.6 million, with $50.4 million domestically and $51.2 million internationally.\n\n\t“Anaconda” earned $1.2 million on Friday from 3,075 locations and is expected to reach $4.6 million in its third weekend, bringing its domestic total to $53.7 million through Sunday. The film was released on Christmas Day last year. \n\t\n\n\t“Anaconda” is a reimagining of the classic 1997 snake horror movie that starred Jennifer Lopez, Owen Wilson, Ice Cube, Jon Voight, Eric Stoltz and Jonathan Hyde. In this “not-a-reboot” film, Black and Rudd play Doug and Griff, two best friends who have always dreamed of remaking their all-time favorite movie. “When a midlife crisis pushes them to finally go for it, they head deep into the Amazon to start filming. But things get real when an actual giant anaconda appears, turning their comically chaotic movie set into a deadly situation,” an official synopsis reads. \n\n\n\tTom Gormican, who helmed “The Unbearable Weight of Massive Talent” and penned “Beverly Hills Cop: Axel F,” directed the new “Anaconda” movie from a script he co-wrote with Kevin Etten. In addition to Black and Rudd, the adventure comedy film stars Steve Zahn, Thandiwe Newton, Daniela Melchior and Selton Mello. Producers include Brad Fuller and Andrew Form under their Fully Formed Entertainment production banner, as well as Etten and Gormican.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Anaconda’ Crosses $100 Million Globally",
      "image": [
        "https://variety.com/wp-content/uploads/2025/09/anaconda.png?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-10T17:34:24.000Z",
      "dateModified": "2026-01-10T17:34:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘No Other Choice’ Star Lee Byung-hun on His Historic Golden Globe Actor Nom and Park Chan-wook’s Latest: ‘I Knew I Would Be Laughing a Lot’",
    "url": "https://variety.com/2026/film/news/no-other-choice-lee-byung-hun-golden-globe-1236627822/",
    "image": "https://variety.com/wp-content/uploads/2026/01/P1032UN5.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-10T17:05:00.000Z",
    "description": "\n\tLee Byung-hun has a chance to make history — he’s the first Korean actor to be nominated for best actor, comedy or musical at the Golden Globes. The",
    "body": "\n\tLee Byung-hun has a chance to make history — he’s the first Korean actor to be nominated for best actor, comedy or musical at the Golden Globes. The “No Other Choice” lead says he found out about the nomination from a friend — the actor was asleep in Korea when noms were announced. “I was sleeping. And my Korean friend texted me. That’s how I found out, but it was like dreaming, because I was sleeping! It was fantastic. And I was so happy but I’m trying to be satisfied only with the nomination, because acting is not about winning or losing. Everybody has their own value. So whatever it is I’m trying to enjoy that day, and it’s going to be my first experience at the Golden Globes. And I’m looking forward to seeing a lot of great movie makers and actor friends.”\n\t\n\n\tHe also earned a Gotham Awards nomination for “Choice,” and voices Gwi-ma in Golden Globe-nominated “KPop Demon Hunters.”\n\n\n\tIn Park Chan-wook‘s “No Other Choice,” Lee plays Mansu, a dedicated manager at a paper plant who gets laid off after 25 years of climbing the corporate ladder, putting his family and all that he’s worked for — a house, a good life for his wife and kids and even cello lessons for his gifted daughter — in jeopardy. While the new owners of the paper plant say that they have “no other choice” in shedding workers, Man-su goes on a mission to eliminate potential rivals to another job that he so desperately needs and wants. But his plans go pear-shaped in the most darkly comic way.\n\n\tFun fact: Lee projects “Squid Game,” “KPop Demon Hunters” and “No Other Choice” were all nominated for Critics Choice Awards this year. “The last two, three years have been extremely fruitful and also busy for me, even just promoting these projects. So I think it’s been a surprise, but also really exciting,” he says.\n\t\n\n\tLee talked to Variety about “No Other Choice” — which is also nominated for best foreign-language film and best film, musical or comedy — via Zoom through translator and cinematographer Isue Shin a few days before the ceremony.\n\n\tWhat drew you to this character of Mansu in “No Other Choice”?\n\n\tIn director Park’s past films, you don’t really see as much comedy as you do in “No Other Choice.” Of course, it has dark themes and depressing moments, but knowing that there was so much comedy in it, I knew I would be laughing a lot in the process of making the film, so I was really excited.\n\n\tHow do you modulate the comedy and the drama?\n\n\tIn the story, there is a lot of comedy that naturally arises from tragic moments, from dark, depressing moments. And I think from a third person’s point of view, from a distance, you could be laughing at Mansu. However, if you were Mansu himself, that would be a completely different reality. And I really like this aspect, this duality of the story, that the main character, it’s not comedy to him at all. He’s extremely desperate. However, in the process of the audience following his story, they can empathize with him, and again, that takes us in a darker, more depressing route, but then also sometimes you might be laughing at him. So there are these kinds of different emotional arcs that you go through.\n\n\tI really tried to be completely in Mansu’s POV as I was acting as him and truly living in his own emotions. One thing I was completely wary of was, of course, in the process of creating these comedic moments, really forcing a laugh, or trying to intend the audience to make them laugh, because I think this could really exaggerate the performance or warp the emotional arc.\n\n\tWhat was the key to unlocking Mansu as a character?\n\n\tI think when it comes to getting closer to my character, I wanted to mention the first scene in the film. You know, life kind of feels comfortable. They’re having this barbecue party at Mansu’s father’s house [that he] originally his father had to sell, but Mansu is able to repurchase it. And he brings his family together in an embrace, and he says, “Oh, I’ve achieved it all.” And I think this is a moment where we see that Mansu is a character who really wants to protect his family. He is a patriarch. And also you kind of see that he might be — in a little bit of foreshadowing — overlooking the problems that they might have. And so you see with his mustache, parts of him that are a bit macho, and I think all these details really come together to create this character of Mansu, even in that very first scene, and allow the audience to start to get to know him.\n\t\n\n\tIt’s a golden scene, very “American Dream” even, with the dogs running around the yard, too.\n\n\tThat — the long take in particular — took the most number of takes in the entire film. So it was very physically and time-wise grueling, because we did 30 takes of this one shot! And a lot of people in the industry say that, you know, filming with animals or children can be really difficult. Well, we had both. So in order to execute this shot, and then see to director Park’s intention, there was a little bit of miscommunication happening with the dogs with the kids, so it was difficult.\n\n\tWhat were your favorite scenes in the film?\n\n\tI think a lot of the audience members would pick the music room scene as sort of the signature scene of “No Other Choice.” [Mansu’s first murder attempt, in which he disguises his gun with oven mitts and then collapses into an absurdly comic wrestling match that eventually turns deadly, but not the way you think.] I think the scene is extremely pivotal for the story, and of course, we get big laughs. However, personally speaking, I wanted to mention that first interview scene in the film. You see that Mansu is dealing with the light reflecting off the building on the other side (of him in an office as he is facing three interviewers), he has a seeping toothache he’s trying to resist. His leg is also shaking, and all while all this is happening, he has a sense of bravado about his resume that he’s trying to deliver to the interviewers. So there are a lot of complicated emotions and a mixture of emotions happening, as well as gestures. He is uncomfortable but also extremely desperate at the same time; he has to brag and have this smile on his face. So I really think this was a moment that shows Mansu’s desperation, and the scene is able to relay his point of view to the audience really well.\n\n\tWith such a wide range of movies and characters on your resume, including “Squid Game” and “KPop Demon Hunters,” how do you pick your projects?\n\n\tI think my one standard for when I am trying to decide my next project is whether that project sounds fun. And of course, this idea of fun is completely subjective. It could be a very depressing story that I still find fun reading and learning about or it could be very serious and deal with deep societal issues. And some people might say, Oh, what is the fun of that? But that might be really fun and interesting to me. So this is the most important factor. Of course, other factors go alongside that. So if you look at my own filmography, people might say, Oh, you kind of go in one direction and then the other. And I think it’s because most people, they have a very specific taste or interest in a genre. However, I’m really chasing this kind of sense of fun. So you really see that I’m in one genre and then another, and kind of unpredictable in terms of where I will go next.\n\t\n\n\tWho are some up-and-coming Korean directors that we should keep on our radar?\n\n\tYoon Ga-eun. She’s already done three to four features, and we’ve met multiple times. She directed “The Owner of the World,” and I think she really has a unique point of view and brings something fresh into the cinematic universe. \n\n\tWhich movies did you love in 2025?\n\n\tI liked “One Battle After Another” and “Train Dreams.” In “Train Dreams,” there is this deep pain in that film that sort of continues from the beginning to the end. And it’s a little bit hard to put to words, but it’s almost as if a needle is kind of pricking you throughout the film. It’s not like that there’s a huge climax or it makes you sob necessarily, but it’s really like that consistency of that feeling was really notable to me.\n\n\tWill you work with director Park again?\n\n\tOf course! I’d love to, I love to!\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘No Other Choice’ Star Lee Byung-hun on His Historic Golden Globe Actor Nom and Park Chan-wook’s Latest: ‘I Knew I Would Be Laughing a Lot’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/P1032UN5.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-10T17:05:00.000Z",
      "dateModified": "2026-01-10T17:05:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Box Office: ‘Avatar: Fire and Ash’ Stays No. 1 for Fourth Consecutive Friday; ‘Primate’ Swings to $4.5 Million Opening Day",
    "url": "https://variety.com/2026/film/box-office/primate-opening-day-avatar-fire-and-ash-1236625682/",
    "image": "https://variety.com/wp-content/uploads/2026/01/MixCollage-07-Jan-2026-04-48-PM-5099.jpg?crop=16px%2C57px%2C1170px%2C658px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-01-10T16:56:18.000Z",
    "description": "\n\t“Avatar: Fire and Ash” continued its reign of box office dominance, landing at the top of the domestic charts for a fourth Friday in a row.\n\n\tThe th",
    "body": "\n\t“Avatar: Fire and Ash” continued its reign of box office dominance, landing at the top of the domestic charts for a fourth Friday in a row.\n\n\tThe third “Avatar” installment, which recently crossed $1 billion at the worldwide box office, took home $5 million domestically on Friday. The sci-fi epic is expected to pull in another $20 million by Sunday. \n\n\tIn second place was Paramount’s creature feature “Primate,” which debuted to $4.5 million on Friday from 2,964 North American theaters. Starring Johnny Sequoyah, Jess Alexander, Troy Kotsur and Victoria Wyant, the horror film follows a group of teens whose island getaway is upended when the beloved family pet chimpanzee Ben becomes a rabid killing machine. The film, which carries a production budget of $21 million, is expected to make $11 million through Sunday.\n\t\n\n\tAlso opening this weekend is Lionsgate’s survival thriller “Greenland 2: Migration.” Starring Gerard Butler, Morena Baccarin and Roman Griffin Davis, the film pulled in $3.2 million on its opening Friday. The sequel comes roughly six years after the original, and follows a family searching for a new home in Greenland after a comet strike destroyed most of Earth. The film should reach $8.5 million by Sunday.\n\n\tAside from ‘Avatar: Fire and Ash,’ two other holdovers remained in the top five on Friday: A24’s ping pong drama “Marty Supreme” and Lionsgate’s twisty domestic thriller “The Housemaid.” “Marty Supreme” scored roughly $2.2 million domestically on Friday, a 52% drop from last week, and is projected to earn $7.9 million by Sunday. Its domestic gross should cross $70 million by the end of the weekend. “The Housemaid” collected $3.3 million on its fourth Friday. The film should add $10.6 million by Sunday, declining 30% from this time last week, for a total domestic gross of $93.5 million.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Box Office: ‘Avatar: Fire and Ash’ Stays No. 1 for Fourth Consecutive Friday; ‘Primate’ Swings to $4.5 Million Opening Day",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/MixCollage-07-Jan-2026-04-48-PM-5099.jpg?crop=16px%2C57px%2C1170px%2C658px&resize=1000%2C563"
      ],
      "datePublished": "2026-01-10T16:56:18.000Z",
      "dateModified": "2026-01-10T16:56:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Official 'KPop Demon Hunters' Monopoly Deal Game Hits Stores As First Release From Netflix and Hasbro Deal ",
    "url": "https://variety.com/2026/shopping/news/kpop-demon-hunters-monopoly-deal-game-buy-online-1236627899/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Monopoly-Deal-Kpop-Demon-Hunters-Card-Game-e1768022948277.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-10T05:37:19.000Z",
    "description": "\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.\n\n\tNetflix h",
    "body": "\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.\n\n\tNetflix has unveiled its first “KPop Demon Hunters” collaboration with toy maker Hasbro, with the release of an official Monopoly Deal card game based on the hit animated film.\n\n\tThe Monopoly Deal: Kpop Demon Hunters Card Game dropped this month on Amazon as the first official release from Netflix’s licensing deal with Hasbro. First announced last fall, the partnership will feature the “KPop Demon Hunters” characters used across Hasbro’s line of board games, plush toys and electronics, including popular IP like Nerf and Furby. Hasbro has teased a “range of engaging collaborations designed to delight fans of all ages.”\n\n\n\t\t\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\t\t\n\n\t\t\t\t\t\t\t\t\t\tNEW RELEASE\t\t\t\t\t\t\n\n\t\t\t\t\tMonopoly Deal: Kpop Demon Hunters Card Game\t\t\n\n\t\t\n\t\n\n\tThe officially-licensed Monopoly Deal game combines characters and themes from the Netflix film with the same goal of collecting a full set of cards. Only in this case, players race to collect items that Rumi, Mira and Zoey need to make the concert a success and seal the Honmoon. \n\n\tThe all-ages game was released Jan. 1 and became an instant bestseller online, with Amazon reporting more than 8,000 units of the card game sold in its first week alone.\n\n\tIn addition to Hasbro, Netflix is also developing a toy partnership with Mattel, with the brands teaming up to launch a full range of “KPop Demon Hunters”–themed dolls, action figures, accessories and playsets. The first release in the Netflix and Mattel partnership is a three-pack of HUNTR/X dolls set to drop later this year.\n\n\tCan’t wait for the official Mattel launch? Amazon currently has this three-pack of “KPop Demon Hunters”-inspired dolls available online. Each doll is fully posable and measures approximately 11.5 inches in height.\n\n\n\t\t\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\t\t\n\n\t\t\t\t\t\t\t\t\t\tALSO AVAILABLE\t\t\t\t\t\t\n\n\t\t\t\t\tKPop Demon Hunter-Style Dolls (3-Pack)\t\t\n\n\t\t\n\t\n\n\tNetflix calls the Mattel and Hasbro licensing deals a way to “help meet the massive fan demand to have these favorite characters as part of their everyday lives, and marks another major milestone for Netflix’s smash global hit.”\n\n\tThe full release slate is expected to include toys, dolls, games, role-play products and other collectibles.\n\n\t“KPop Demon Hunters unleashed a global fan frenzy,” says Marian Lee, Chief Marketing Officer for Netflix, in a press release. “HUNTR/X showed us that a truly great trio is more than the sum of its parts. Netflix, Mattel and Hasbro joining forces on this first-of-its-kind collaboration means fans can finally get their hands on the best dolls, games, and merchandise they’ve been not-so-subtly demanding on every social platform known to humanity. As Rumi, Mira and Zoey say — for the fans!”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Official 'KPop Demon Hunters' Monopoly Deal Game Hits Stores As First Release From Netflix and Hasbro Deal ",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Monopoly-Deal-Kpop-Demon-Hunters-Card-Game-e1768022948277.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-10T05:37:19.000Z",
      "dateModified": "2026-01-10T05:37:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'The Thing' Actor T.K. Carter Dead at 69",
    "url": "https://www.tmz.com/2026/01/10/tk-carter-dead-actor-the-thing/",
    "image": "https://imagez.tmz.com/image/c2/16by9/2026/01/10/c2d7d4c044a049f1aa2ba820320c1788_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-10T14:36:59.000Z",
    "description": "\n    \n                    \n                          T.K. Carter\n                          'The Thing' Actor Dead at 69\n                      \n       ",
    "body": "\n    \n                    \n                          T.K. Carter\n                          'The Thing' Actor Dead at 69\n                      \n                  \n                                                                        Published \n                              January 10, 2026\n                            6:36 AM PST\n                                                                      |\n                                                                Updated \n                                  January 10, 2026\n                                9:13 AM PST\n                                    \n      \n    \n          T.K. Carter, known for his iconic role as Nauls in the 1982 horror/sci-fi film \"The Thing,\" has died, TMZ has learned.\n      \n    \n          Carter was found deceased Friday in his Duarte, CA residence after a call for service was made. Law enforcement tells TMZ the call came in at approximately 5:42 PM, and a death report was made. No foul play is suspected.\n      \n    \n          The cause of death has not been released.\n      \n\n                  \n          \n                          \n                \n                  \n      \n    \n          Carter had a decades-spanning career dating back to the mid-1970s, with his big break being \"The Thing.\" Other notable films he acted in include 1985's \"Runaway Train,\" 1996's \"Space Jam,\" and 2005's \"Domino.\" He also landed a myriad of small-screen roles, including the character of Mike Fulton across 2 dozen episodes of \"Punky Brewster\" in the '80s and T-Bone on \"The Steve Harvey Show\" in the '90s.\n      \n    \n          He also starred in the miniseries \"The Corner\" in 2000. He reflected on the project in August 2025 ... revealing on \"Live from the Green Room\" he struggled to even get an audition for the show until his close pal hooked him up with their manager, and the stars aligned.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          He last appeared in 3 episodes of \"The Company You Keep\" and 5 episodes of Lil Dicky's show, \"Dave,\" in 2023.\n      \n    \n          T.K. was 69.\n      \n    \n          RIP\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                RIP\n              \n                          \n                TV\n              \n                          \n                Movies\n              \n                          \n                Celebrity Death\n              \n                          \n                Exclusive\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'The Thing' Actor T.K. Carter Dead at 69",
      "image": [
        "https://imagez.tmz.com/image/c2/16by9/2026/01/10/c2d7d4c044a049f1aa2ba820320c1788_xl.jpg"
      ],
      "datePublished": "2026-01-10T14:36:59.000Z",
      "dateModified": "2026-01-10T14:36:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Stars and Scars -- You Be the Judge",
    "url": "https://www.tmz.com/2026/01/10/polls-you-be-the-judge/",
    "image": "https://imagez.tmz.com/image/f6/16by9/2026/01/09/f6784dd2af61422ebbd0b62be8693a9a_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-10T08:25:08.000Z",
    "description": "\n    \n                    \n                          Stars and Scars\n                          You Be the Judge\n                      \n               ",
    "body": "\n    \n                    \n                          Stars and Scars\n                          You Be the Judge\n                      \n                  \n                                                                        Published \n                              January 10, 2026\n                            12:25 AM PST\n                                                                            \n      \n    \n          The killing of an ICE protester has divided this country in a big way, and Nick Reiner may very well end up pleading not guilty by reason of insanity in the murders of his parents. So we gotta ask ...\n      \n      \n      \n          \n            \n              \n                \n                Share on Facebook\n              \n            \n            \n              \n                \n                Share on X\n              \n            \n                          \n                \n                  \n                \n              \n                      \n        \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Celebrity News\n              \n                          \n                News\n              \n                      \n        \n          \n  ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Stars and Scars -- You Be the Judge",
      "image": [
        "https://imagez.tmz.com/image/f6/16by9/2026/01/09/f6784dd2af61422ebbd0b62be8693a9a_xl.jpg"
      ],
      "datePublished": "2026-01-10T08:25:08.000Z",
      "dateModified": "2026-01-10T08:25:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Guess Who This Proud Grandpa Is!",
    "url": "https://www.tmz.com/2026/01/10/guess-who-proud-grandpa/",
    "image": "https://imagez.tmz.com/image/fd/16by9/2026/01/05/fdc789df096c4d68bd3e8140307e1f92_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-10T15:00:46.000Z",
    "description": "\n    \n                    \n                          Guess Who This\n                          Proud Grandpa Is!\n                      \n               ",
    "body": "\n    \n                    \n                          Guess Who This\n                          Proud Grandpa Is!\n                      \n                  \n                                                                        Published \n                              January 10, 2026\n                            7:00 AM PST\n                                                                            \n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          Most singers just wanna rock and roll all night, but some end up finding happiness in their family lives ... and we want to see if you can guess who this proud grandpa is!\n      \n    \n          We caught up with this frontman back in 2023, just after his second grandchild was born ... and you already know he was super stoked about adding another kid to the family!\n      \n    \n          And sure, he took some time to put his John Hancock on some fans' merch ... but we think he just wanted to get back home and spend some time with the baby -- we're sure he's gotten real familiar with his grandkid since then!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Guess Who\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Guess Who This Proud Grandpa Is!",
      "image": [
        "https://imagez.tmz.com/image/fd/16by9/2026/01/05/fdc789df096c4d68bd3e8140307e1f92_xl.jpg"
      ],
      "datePublished": "2026-01-10T15:00:46.000Z",
      "dateModified": "2026-01-10T15:00:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Celebs Getting Fit Who'd You Rather?! Break A Sweat With Hollywood!",
    "url": "https://www.tmz.com/2026/01/10/celebs-getting-fit-whod-you-rather/",
    "image": "https://imagez.tmz.com/image/1a/16by9/2026/01/07/1a8285052f8843219060824c30a81af3_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-10T08:45:29.000Z",
    "description": "\n    \n                    \n                          Celebs Getting Fit\n                          Who'd You Rather?!\n                      \n          ",
    "body": "\n    \n                    \n                          Celebs Getting Fit\n                          Who'd You Rather?!\n                      \n                  \n                                                                        Published \n                              January 10, 2026\n                            12:45 AM PST\n                                                                            \n      \n    \n      \n        \n              \n    \n    \n          Let's be real here: Hollywood’s fitness era stays in full swing year-round, so we've paired the hottest with ... the HOTTEST, and now it's on you to pick your poison 🔥!\n      \n    \n          Alix Earle brought a HUGE flex to the ALO gym, but is Stassie Karanikolaou's tight-black workout fit givin' Earle a run for her money?!\n      \n    \n          These celebs are flexing their hard-earned bodies after putting in major gym time. So be honest — hit the gallery and vote: Who'd You Rather break a sweat with?!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Alix Earle\n              \n                          \n                Anastasia Karanikolaou\n              \n                          \n                Hotties & Bodies\n              \n                          \n                Hot Bodies\n              \n                          \n                Who'd You Rather?\n              \n                          \n                Fitness & Exercise\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Celebs Getting Fit Who'd You Rather?! Break A Sweat With Hollywood!",
      "image": [
        "https://imagez.tmz.com/image/1a/16by9/2026/01/07/1a8285052f8843219060824c30a81af3_xl.jpg"
      ],
      "datePublished": "2026-01-10T08:45:29.000Z",
      "dateModified": "2026-01-10T08:45:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Reported Ex-Husband Arrested in Connection to Ohio Dentist Double Murder",
    "url": "https://www.tmz.com/2026/01/10/ohio-dentist-murder-suspect-arrest-warrant/",
    "image": "https://imagez.tmz.com/image/9e/16by9/2026/01/10/9e5c10eb74904c18b38be58351e8c6d2_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-10T19:00:51.000Z",
    "description": "\n    \n                    \n                          Ohio Double Murder\n                          Reported Ex Arrested in Connection to Case\n         ",
    "body": "\n    \n                    \n                          Ohio Double Murder\n                          Reported Ex Arrested in Connection to Case\n                      \n                  \n                                                                        Published \n                              January 10, 2026\n                            11:00 AM PST\n                                                                      |\n                                                                Updated \n                                  January 10, 2026\n                                11:37 AM PST\n                                    \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Police have finally arrested a suspect in Dr. Spencer Tepe and Monique Tepe's murders ... with officials taking a man named Michael McKee -- reportedly Monique's ex-husband -- into custody.\n      \n    \n          The Winnebago County Jail in Illinois tells TMZ ... McKee was booked early today and is on an out-of-state hold.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          We've obtained McKee's mug shot ... and, he's staring straight into the camera with no expression -- hair a mess and a pair of thick glasses on his face.\n      \n\n          According to 10TV -- a local Ohio outlet which is citing court records -- police filed an arrest warrant for McKee after tracing his car on the night of the murders using surveillance footage.\n      \n    \n      \n        \n                    \n                  \n      \n                    Columbus Police\n          \n    \n          Cops reportedly say the vehicle arrived in the area shortly before and left shortly after the killings. Online records say he's now facing 2 murder charges.\n      \n    \n                    \n                          \n                                  \n      \n        \n    \n          As you know ... the Tepes were killed in the early morning hours of December 30 and found by concerned friends hours later -- and, we shared the harrowing 911 audio with you which captured the intensity of the scene.\n      \n    \n      \n        \n                    \n                  \n      \n                    Columbus Police\n          \n    \n          Police released video of a person of interest walking near the Tepes house around the time the two were killed ... and asked the public for any help identifying that person.\n      \n    \n          The Tepes had two young children -- a four-year-old and a one-year-old -- both of whom were unharmed and are staying with family members in the aftermath of the slayings.\n      \n    \n          Story developing ...\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                RIP\n              \n                          \n                Crime & Arrests\n              \n                          \n                Viral\n              \n                          \n                Fairly Legal\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Reported Ex-Husband Arrested in Connection to Ohio Dentist Double Murder",
      "image": [
        "https://imagez.tmz.com/image/9e/16by9/2026/01/10/9e5c10eb74904c18b38be58351e8c6d2_xl.jpg"
      ],
      "datePublished": "2026-01-10T19:00:51.000Z",
      "dateModified": "2026-01-10T19:00:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]