[
  {
    "title": "Paramount Sends ByteDance Cease-and-Desist Letter Over Seedance AI Videos, Alleging Intellectual Property Infringement",
    "url": "https://variety.com/2026/film/news/paramount-disney-bytedance-cease-and-desist-seedance-ai-infringement-ip-1236663663/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Screenshot-2026-02-12-at-4.47.27%E2%80%AFPM-e1770943771789.png?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-15T04:57:45.000Z",
    "description": "\n\tParamount Skydance accused ByteDance of engaging in “blatant infringement” of its intellectual property with its Seedance video and Seedream image g",
    "body": "\n\tParamount Skydance accused ByteDance of engaging in “blatant infringement” of its intellectual property with its Seedance video and Seedream image generative AI platforms, alleging the Chinese internet giant is illegally ripping off IP including “South Park,” “Star Trek,” “The Godfather,” “Dora the Explorer” and more.\n\n\tThe media company sent a cease-and-desist letter Saturday to ByteDance, a copy of which was obtained by Variety, demanding it discontinue the alleged infringement. The letter from Gabriel Miller, Paramount Skydance’s head of intellectual property, was addressed to ByteDance CEO Liang Rubo.\n\t\n\n\tThat came after Disney sent a cease-and-desist letter Friday to ByteDance asserting the company’s AI platforms are making available “a pirated library of Disney’s copyrighted characters from Star Wars, Marvel, and other Disney franchises, as if Disney’s coveted intellectual property were free public domain clip art.” “ByteDance’s virtual smash-and-grab of Disney’s IP is willful, pervasive, and totally unacceptable,” David Singer, a partner at Jenner & Block, wrote on behalf of Disney.\n\n\n\tSeedance is the latest AI video system to set off alarms across Hollywood. After videos generated by ByteDance’s Seedance 2.0 went viral this week — including one of Tom Cruise and Brad Pitt fighting on a rooftop (pictured above) — the Motion Picture Association condemned ByteDance on Thursday, calling on the company to immediately cease its infringing conduct. Actors union SAG-AFTRA and the Human Artistry Campaign, a coalition of artists’ rights groups affiliated with Hollywood unions, also spoke out against the ByteDance AI model.\n\t\n\n\tParamount’s Miller, in the letter to ByteDance, wrote that “much of the content that the Seed Platforms produce contains vivid depictions of Paramount’s famous and iconic franchises and characters, which are protected under copyright law, trademark law, and the law of unfair competition (among other doctrines).” The content in the AI-generated images and videos produced by ByteDance’s platforms “is often indistinguishable, both visually and audibly,” from Paramount’s copyrighted characters and stories.\n\n\tReps for ByteDance did not immediately respond to a request for comment Saturday.\n\n\tAccording to Miller’s letter, Paramount properties including “South Park,” “SpongeBob SquarePants,” “Star Trek,” “Teenage Mutant Ninja Turtles,” “The Godfather,” “Dora the Explorer” and “Avatar: The Last Airbender” have “all been repeatedly infringed by the Seed Platforms’ production and subsequent public performance and distribution of these images and videos.” Moreover, with the recent release of the Seedance 2.0 video generation tool, “ByteDance’s infringing activities appear not only to be continuing but becoming more prevalent and the unlawful outputs more widely disseminated,” Miller wrote.\n\n\tIn the letter, Paramount Skydance demanded that “ByteDance immediately take all necessary steps to (i) prevent violations of our intellectual property rights by ensuring that our content is not used or created by ByteDance or the Seed Platforms going forward, and (ii) remove all infringing instances of Paramount’s content from ByteDance’s platforms and systems.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Paramount Sends ByteDance Cease-and-Desist Letter Over Seedance AI Videos, Alleging Intellectual Property Infringement",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Screenshot-2026-02-12-at-4.47.27%E2%80%AFPM-e1770943771789.png?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-15T04:57:45.000Z",
      "dateModified": "2026-02-15T04:57:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Filipinana’ Director Rafael Manuel on ‘White Lotus’ Comparisons, Jia Zhangke’s Influence and Making Violence Relatable",
    "url": "https://variety.com/2026/film/festivals/filipinana-rafael-manuel-white-lotus-jia-zhangke-1236662010/",
    "image": "https://variety.com/wp-content/uploads/2025/10/Filipinana1.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-15T04:45:00.000Z",
    "description": "\n\tRafael Manuel spent seven or eight years developing “Filipinana,” his debut feature about a teenage girl working at an elite Manila country club — y",
    "body": "\n\tRafael Manuel spent seven or eight years developing “Filipinana,” his debut feature about a teenage girl working at an elite Manila country club — years before HBO’s “The White Lotus” turned the luxury resort satire into prestige television gold.\n\n\t“I get the comparisons, of course, because ‘White Lotus’ is one of the biggest series ever but I wouldn’t say that it’s a direct influence at all,” Manuel tells Variety ahead of the film’s European premiere at the Berlinale. “I think, formally, they’re very, very different. And also the fact that ‘White Lotus’ has to do a lot more with Western protagonists in the East.”\n\t\n\n\tThe film won the Special Jury Award for Creative Vision at Sundance and has been acquired for North American distribution by Kino Lorber. \n\n\n\tSet against a backdrop of oppressive heat and drought, the narrative follows Isabel, a 17-year-old from the rural north who takes a job at an upscale country club outside Manila. As the newcomer explores the facility’s pristine grounds, she encounters an array of elite patrons — all attended to by the club’s servile staff. When Isabel attempts to return a misplaced golf club to the club’s patriarchal director, she delves deeper into the resort’s restricted areas, uncovering dark realities about the institution, the Philippines and her own history.\n\n\tManuel’s approach to narrative structure draws on literary and philosophical theory. “[Claude] Lévi-Strauss — one of my favorite writers — talks a lot about the two kinds of thought, there’s poetic thought, and then there’s grammatical and synthetic thought. And I think a lot in the world today, we’ve prioritized grammar and syntax over poetic thought. And for me, I was very interested in developing a narrative and then a plot that kind of balances both, and actually even gives more importance to poetic thought,” he says.\n\t\n\n\tThe director distinguishes between two types of clarity in filmmaking: “There’s narrative and narrative clarity and plot clarity, but there’s also emotional clarity. And for me, I think emotional clarity is a lot more important. Because, you know, like for example, like in a Hollywood film where it’s all, like, very contingent on narrative and plot. As soon as you miss one plot point, the whole thing kind of falls apart. Whereas if you focus more on emotional clarity, then, even if people miss certain plot points or things, they’re very much anchored in the film still, because what’s clear is what the characters are feeling and what the world is making you feel.”\n\n\tManuel’s executive producer and mentor, Chinese auteur Jia Zhangke, proved instrumental in shaping the filmmaker’s approach. Manuel was the final protege in the Rolex Arts Initiative, where he spent two years working closely with Jia. “In ‘The World,’ Jia tells a story while a city is being deconstructed in the background,” Manuel says. “What I’m trying to do as well with the golf course is bring about the Philippines’ or the world’s past, the present and the future, just in the time setting and in that environmental setting.”\n\n\tBeyond the cinematic techniques, Manuel values the personal insights gained from the extended mentorship. “I got to spend a lot of time with Jia in between the shoots and the editing, and just spend a lot of personal time with him, and really just to get to be given an insight into his world and to how he lives his day-to-day life in between cinema, which is what we make cinema about. We make cinema about life and how we live life, and how we want to live life.”\n\n\tFor Manuel, the golf club setting serves a specific purpose in examining contemporary Filipino society. “I guess I just wanted to make violence more relatable,” Manuel says. “I’m sorry to say, but a lot of contemporary Philippine cinema exoticizes the poverty and the violence that exists in my country, so much so that I think it’s easy for an audience that is not at all related to these milieus that are portrayed to feel like they’re not culpable, or have no relation to the violence that they see on the screen.”\n\n\tHis approach reframes systemic violence in more universal terms. “It was really my goal to reframe this violence and to make it a bit more relatable to a more universal audience and to talk about how one does not need to be a murderer or rapist to be complicit in this kind of violence, that it’s enough to live silently and passively in an inherently violent system,” he says.\n\t\n\n\tThe film explores tensions between ambition and belonging without offering easy resolutions. “I really tried to not give the answers, because I don’t have any answers,” he says. “I think in the world today, it’s so easy to be pessimistic and to fall into this trap of inaction, that our actions won’t make a difference because of all the powers at play. Like Isabel in the film, I hope people are reminded that no matter how small, even the tiniest of actions have the power to create something new.”\n\n\tAs “Filipinana” prepares for its Berlinale screening, Manuel hopes to transport audiences from winter’s chill into the film’s oppressive tropical heat. “We made a very sensorial film, and hopefully we’re able to bring some of the heat from Manila to Berlin. I mean, it’s going to be very cold in Berlin, just like it was in Park City. And I think in a way, it’s very poetic for ‘Filipinana’ to be screened in the middle of winter in Berlin. I’m really hoping that we’re able to bring this heat and this humidity, which is so much a character of the film and so much responsible for the environment and the pacing of the film.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Filipinana’ Director Rafael Manuel on ‘White Lotus’ Comparisons, Jia Zhangke’s Influence and Making Violence Relatable",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/Filipinana1.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-15T04:45:00.000Z",
      "dateModified": "2026-02-15T04:45:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Mexico’s Cinemex Nabs ‘Abracadaver’ (EXCLUSIVE)",
    "url": "https://variety.com/2026/film/global/cinemex-abracadaver-pancho-rodriguez-filmsharks-guido-rud-1236663294/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Abracadaver-.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-15T01:55:00.000Z",
    "description": "\n\tCinemex, the Mexican film distribution-exhibition giant, has set a second-quarter release date for “Abracadaver,” the final movie from writer-actor-",
    "body": "\n\tCinemex, the Mexican film distribution-exhibition giant, has set a second-quarter release date for “Abracadaver,” the final movie from writer-actor-director Pancho Rodríguez (“Looking for an Angel”), who died Nov. 13.  \n\n\tAlready a Walt Disney Co. pickup for North America with Hulu controlling U.S. streaming rights, “Abracadaver” has also been acquired by Vic Films Corp. for Central America and the Caribbean. In other dealing, Movistar+ has taken Spanish pay TV/SVOD and Spafax inflight rights. Latin America’s pay-one window is under discussions, as are other European and Asian territories, said FilmSharks Guido Rud, who produced and is now selling the film. \n\t\n\n\t“Abracadaver” turns on three circus magician brothers who reunite to steal a twin mummy valued at millions of dollars from an impenetrable fortress. \n\n\n\tBoasting a Mexican star cast, led by Alberto Estrella (“Man on Fire”), Denisse Corona (“Centauro del norte”) and Pablo Abitia (“Pancho Villa”), “Abracadaver” was shot in Rodríguez’s home state of Jalisco with the aid of the local government tax rebate, Filma Jalisco.\n\n\t“Looking for an Angel” won an Audience Award at Guadalajara. Co-written by Rodríguez, animated feature “The Big Wish” (“Día de muertos”) scored a Mexico Academy Ariel Award nomination in 2020.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Mexico’s Cinemex Nabs ‘Abracadaver’ (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Abracadaver-.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-15T01:55:00.000Z",
      "dateModified": "2026-02-15T01:55:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Providence Equity ‘Fully Committed’ to Supporting Wasserman Agency Amid Sale Transition",
    "url": "https://variety.com/2026/biz/news/providence-equity-casey-wasserman-sale-fully-committed-1236663637/",
    "image": "https://variety.com/wp-content/uploads/2026/02/GettyImages-2206454240-e1771116325852.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-15T01:55:23.000Z",
    "description": "\n\tProvidence Equity is aiming to calm the waters within the Wasserman agency after Friday night’s surprise news that the firm will be put up for sale ",
    "body": "\n\tProvidence Equity is aiming to calm the waters within the Wasserman agency after Friday night’s surprise news that the firm will be put up for sale and founder Casey Wasserman will leave amid the furor over his appearances in the Epstein files.\n\n\tCasey Wasserman’s position as a leader in media and sports has been rocked by revelations as part of the Justice Department’s Epstein files disclosures that Wasserman had an intimate relationship with Ghislaine Maxwell in 2003, years before she was convicted of sex trafficking through her long association with convicted sex offender Jeffrey Epstein.\n\t\n\n\tWasserman’s appearance in the Epstein files document dump, despite the consensual nature of his exchanges with Maxwell, has set off a firestorm among some of the clients represented by Wasserman’s sports, marketing and entertainment units. As the leader of Los Angeles’ Olympics organizing body, LA28, Casey Wasserman has also come under pressure from Southern California political and civic leaders to step down from his Olympics post. This controversy comes about 18 months after he weathered a tabloid-driven scandal revolving around accusations that he engaged in inappropriate office relationships.\n\n\n\tRhode Island-based Providence Equity became an investor in the Wasserman agency in late 2022 and now owns a majority of the firm, which encompasses management heavyweight Brillstein Entertainment Partners. Now, as Casey Wasserman leaves, Providence is understood to be committed to keeping the company intact while it considers options for the long haul. That includes M&A possibilities to enhance and expand its operations.\n\t\n\n\tOn Friday night, Casey Wasserman named Wasserman president Mike Watts as the company’s interim leader during the transition. On Saturday, Providence pledged its support for Watts and its faith in the agency’s future.\n\n\t“We believe deeply in the strength of the company and have full confidence in Mike and the leadership team, as well as in the exceptional employees across the organization,” a Providence Equity spokesman said. “We remain fully committed to investing in its growth, expanding its capabilities across sports, music, and entertainment, and supporting the extraordinary talent, brands and properties the company is proud to represent.”\n\n\tThe Friday night surprise sent plenty of talent reps at rival firms pouring over Wasserman’s imprints to look for opportunities. There was much speculation about whether the industry’s largest firms — CAA, WME, UTA — will contend for any parts of Wasserman, or whether another monied player will jump in with Providence.\n\n\tMultiple high-ranking agents were still reeling Saturday over Wasserman’s decision to divest in his company. Others were incredulous that Wasserman used his parting memo to his staff as an attempt to solidify his Olympics gig.\n\n\t“It’s like a child deciding which toy he’ll give up as punishment,” said one veteran motion picture talent agent. Yet Wasserman’s favor to stay atop LA28 was sealed earlier this week when the board issued a statement of support. His biggest advocate on the LA28 board, multiple sources said, is former DreamWorks chief Jeffrey Katzenberg — a mogul with plenty of local political connections who seems “hellbent” on breaking the fall for Wasserman, one source observed.\n\n\t“He hasn’t violated any law that we know of,” said a top Hollywood dealmaker, speaking on the condition of anonymity. “But when you couple this with the scandal from a year ago, you see a pattern of behavior. The sleaze factor is too high, and no client wants to be near that.”\n\n\tLeadership in Wasserman’s sports, music and talent management businesses were previously reported to be negotiating directly with Casey Wasserman’s capital partner Providence, in an effort to rescue the assets as one bundle. While Wasserman’s music artists were largely responsible for pressuring him to step away, the actor-heavy Brillstein Entertainment Partners would inevitably have come under scrutiny. It’s only been a year since Emma Stone moved to Brillstein with manager Doug Wald. Much less for Sydney Sweeney, whose longtime talent agent, Jennifer Millar, made the pivot to management and relocated to Brillstein in December. There’s no doubt that female stars the stature of Stone and Sweeney would have felt the heat had Casey Wasserman not bowed out.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Providence Equity ‘Fully Committed’ to Supporting Wasserman Agency Amid Sale Transition",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/GettyImages-2206454240-e1771116325852.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-15T01:55:23.000Z",
      "dateModified": "2026-02-15T01:55:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Charli xcx Brings ‘Brat’ to Berlin With ‘The Moment’ Premiere and Says She’s Ready for a New Era: ‘But I Don’t Know What That Is’",
    "url": "https://variety.com/2026/film/festivals/charli-xcx-brat-berlin-the-moment-premiere-1236663546/",
    "image": "https://variety.com/wp-content/uploads/2026/02/GettyImages-2261663627.jpg?crop=0px%2C0px%2C6000px%2C3375px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-02-14T23:09:23.000Z",
    "description": "\n\tCharli xcx said she’s ready for a new era at the Berlin Film Festival premiere of “The Moment” – but she’s still figuring out just what that is.\n\n\tF",
    "body": "\n\tCharli xcx said she’s ready for a new era at the Berlin Film Festival premiere of “The Moment” – but she’s still figuring out just what that is.\n\n\tFollowing the screening at Zoo Palast, which was filled to the brim with her fans, the pop star appeared on stage alongside the mockumentary’s director, Aidan Zamiri. Asked what’s next for her career, Charli – who just put out a “Wuthering Heights” concept album and is set to star in a handful of films – confirmed that “Brat” is over, “full stop.”\n\t\n\n\t“It feels like a sort of long overdue full stop in the world of ‘Brat,’ and I think we knew that going into it and that was part of the interest in making it,” she said. “So for me, yes, I do feel ready to embark on a new journey. But I don’t know what that is, so yeah. I’m kind of open to ideas.”\n\n\n\t“But not really!” she quickly added.\n\n\t“The Moment” Berlinale premiere was packed and filled with energy, with fans screaming at her arrival on the red carpet. Upon taking their seats, guests were greeted with their own Howard Stirling “Brat” bank cards, an inside joke from the film.\n\n\tThere were big laughs for Alexander Skarsgard’s sinister concert film director and raucous cheers as the film ended, signaling that no matter what, “Brat” may never die.\n\n\tAfter debuting at Sundance last month, followed by a U.S. theatrical release, it’s finally time for Europe’s moment, with the Berlin bow marking the film’s international debut. “The Moment” stars Charli as an alternate-reality version of herself grappling with whether to stay true to her art or cross over to the commercial dark side. When a director, played by Skarsgard, is hired to make a concert film about her upcoming “Brat” tour, Charli faces the ultimate test.\n\t\n\n\tAlongside Charli and Skarsgard, “The Moment” also stars Rosanna Arquette, Kate Berlant, Jamie Demetriou, Hailey Benton Gates, Isaac Powell, Rish Shah, Kylie Jenner and Rachel Sennott. However, just Charli and Zamiri were on hand at the Berlin premiere.\n\n\tAt a press conference earlier on Saturday, Charli was asked about bringing the film to the Berlinale, saying she applauds the festival for “not shying away from political films, from films that have a real social angle, films by directors who really are visionary and have something to say.”\n\n\t“Those are the kinds of films that we love and want to champion ourselves,” she said, adding: “I’m only just starting out in this industry, but I feel passionate about working within those spaces.”\n\n\tBut it does seem that after this, “Brat” will be over for good. “For me, it’s over,” she said. “And you can’t dread the end when it’s over.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Charli xcx Brings ‘Brat’ to Berlin With ‘The Moment’ Premiere and Says She’s Ready for a New Era: ‘But I Don’t Know What That Is’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/GettyImages-2261663627.jpg?crop=0px%2C0px%2C6000px%2C3375px&resize=1000%2C563"
      ],
      "datePublished": "2026-02-14T23:09:23.000Z",
      "dateModified": "2026-02-14T23:09:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Barack Obama Reacts to Donald Trump’s AI Video Depicting Him as an Ape: ‘There Doesn’t Seem to Be Any Shame About This’",
    "url": "https://variety.com/2026/digital/news/barack-obama-reacts-donald-trump-ai-ape-video-1236663606/",
    "image": "https://variety.com/wp-content/uploads/2026/02/MixCollage-14-Feb-2026-01-41-PM-6310.jpg?crop=16px%2C18px%2C1168px%2C656px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-02-14T21:55:43.000Z",
    "description": "\n\tDuring a recent appearance on Brian Tyler Cohen’s podcast, Barack Obama gave his reaction after an AI video was posted to Donald Trump‘s Truth Socia",
    "body": "\n\tDuring a recent appearance on Brian Tyler Cohen’s podcast, Barack Obama gave his reaction after an AI video was posted to Donald Trump‘s Truth Social account that depicted the former president and his first lady, Michelle, as apes. Obama opened his thoughts by calmly stating that it’s “important to recognize that the majority of the American people find this behavior deeply troubling.”\n\n\t“You know, it is true that it gets attention. It’s true that it’s a distraction. But, you know, as I’m traveling around the country, as you’re traveling around the country, you meet people. They still believe in decency, courtesy, kindness. And there’s this sort of clown show that’s happening in social media and on television,” he said. “And what is true is that there doesn’t seem to be any shame about this among people who used to feel like you had to have some sort of decorum. And a sense of propriety and respect for the office, right? So that’s been lost.”\n\t\n\n\tWhite House press secretary Karoline Leavitt at first tried to defend the Feb. 6 post as an “internet meme” and urged the press to “report on something today that actually matters to the American public.” However, the backlash from both sides of the political spectrum was too great, and the video was taken down after nearly 12 hours.\n\n\tAfter the racist video was deleted, the White House attempted to shift the blame to an unnamed staff member who “erroneously” shared it on Trump’s account. The president seemed to contradict that claim hours later, telling the Associated Press that he “didn’t make a mistake” and, instead, passed along the video for an aide to post.\n\t\n\n\t“I liked the beginning. I saw it and just passed it on, and I guess probably nobody reviewed the end of it,” Trump said.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Barack Obama Reacts to Donald Trump’s AI Video Depicting Him as an Ape: ‘There Doesn’t Seem to Be Any Shame About This’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/MixCollage-14-Feb-2026-01-41-PM-6310.jpg?crop=16px%2C18px%2C1168px%2C656px&resize=1000%2C563"
      ],
      "datePublished": "2026-02-14T21:55:43.000Z",
      "dateModified": "2026-02-14T21:55:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "French Romantic Comedy ‘The Doll’ About a Life-Sized Doll Coming to Life Sells to Major Markets",
    "url": "https://variety.com/2026/film/global/french-romantic-comedy-doll-sells-major-markets-1236663340/",
    "image": "https://variety.com/wp-content/uploads/2026/02/MixCollage-30-Apr-2025-05-01-PM-1279.webp?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-15T04:40:00.000Z",
    "description": "\n\tUrban Sales has closed a raft of deals on “The Doll” (“La Poupée Vertigo”), a French romantic comedy starring Vincent Macaigne (“Maria”), Cécile de ",
    "body": "\n\tUrban Sales has closed a raft of deals on “The Doll” (“La Poupée Vertigo”), a French romantic comedy starring Vincent Macaigne (“Maria”), Cécile de France (“The New Pope”) and Zoé Marchal (“Overdose”).\n\n\tSophie Beaulieu’s debut feature, “The Doll” is one of the many romantic movies buzzing at the European Film Market this year. \n\n\tThe film has been bought by Neue Visionen (Germany and Austria), Vertigo (Benelux), HBO Central Europe, Caramel (Spain) and Capella (CIS). Julieta Bowyer’s newly launched company Global Pulse also picked it up for inflight worldwide.\n\t\n\n\tIt will be released in France on April 22 by Ad Vitam, which recently handled “The Secret Agent,” “A Private Life” and “The Little Sister.”\n\n\t“The Doll” stars Macaigne as Rémi, a synthetic turf seller who has been sharing his life with a life-sized doll named Audrey (Marchal) ever since his last breakup. When Patricia (de France), a temp worker, joins his company, Audrey mysteriously comes to life, setting off a series of surreal and transformative events that will shake up Rémi’s life for the better.\n\n\tUrban’s head of sales Florencia Gil previously said the film “playfully addresses genre clichés through a witty and unexpected love triangle.” \n\n\t“The Doll” is produced by Novoprod Cinéma, and is co-produced by Atelier de Production, 31 Juin Films, Les films du Parc, Borsalino Prods. and Paprika Films.\n\n\tUrban Sales’ EFM slate also includes Gabe Klinger’s Brazilian film “Isabel,” which stars Marina Person and is playing at the Berlinale. The film is produced by Rodrigo Teixeira via RT Features, the banner behind Walter Salles’s Oscar-winning “I’m Still Here.” \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "French Romantic Comedy ‘The Doll’ About a Life-Sized Doll Coming to Life Sells to Major Markets",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/MixCollage-30-Apr-2025-05-01-PM-1279.webp?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-15T04:40:00.000Z",
      "dateModified": "2026-02-15T04:40:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Nightborn’ Review: Rupert Grint and Seidi Haarla Headline an Effective Blend of Finnish Mythology and Cronenbergian Horror",
    "url": "https://variety.com/2026/film/news/nightborn-review-rupert-grint-1236660846/",
    "image": "https://variety.com/wp-content/uploads/2026/02/202616114_1_ORG.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-14T21:30:00.000Z",
    "description": "\n\tMotherhood can be… a lot, as both Mary Bronstein’s “If I Had Legs I’d Kick You” and Lynne Ramsay’s “Die My Love” reminded us last year. Now, here co",
    "body": "\n\tMotherhood can be… a lot, as both Mary Bronstein’s “If I Had Legs I’d Kick You” and Lynne Ramsay’s “Die My Love” reminded us last year. Now, here comes a riposte in the horror genre: Hanna Bergholm‘s Berlinale competition entry “Nightborn,” which brings a Finnish sensibility to a taut and accessible chiller in which babies really can be little monsters. \n\tSeidi Haarla and Rupert Grint play Saga and Jon, a couple moving into a sprawling fixer-upper in the Finnish forest to start the large family of their dreams. There’s economic heft to the otherwise questionable motivations behind this move: As Jon says, “Fuck London,” and it’s true that even if the isolated rural reno project hadn’t belonged to a relative, it could probably be secured for less than the price of a dingy one-bed apartment on the outskirts of the U.K.’s over-priced capital.When the couple’s baby arrives, it quickly becomes apparent that something isn’t quite right with the little one — at least in his mother’s eyes. Bergholm holds back on showing the audience the infant’s face until the very last moments of the film, a decision designed to tease fans of “Rosemary’s Baby,” and one that resolves with a very sly sense of wit. Played by more than ten babies at various ages, young Kuula is an unusual child, hairy and large for his age, with an early appetite for meat and a curiously harsh quality to his bawling. Bergholm employs some very effective sound design here, giving just a hint of animalistic growling to the kid’s lusty cries.Throughout its modest runtime, “Nightborn” enjoys skipping across the boundary between metaphor and literalism, and then back again. One sequence sees Saga attempting to breastfeed, only to pull the child away from her chest in a spasm of toe-curling agony. Uh oh: blood. In reality, pain and blood is quite a common experience for new mothers. But you’d never know that from widespread breastfeeding propaganda that seeks to maximize the benefits and minimise the difficulties — and it plays very nicely indeed here as a straightforwardly grotesque horror-movie moment, while also simply reflecting a part of the real world rarely shown onscreen.Grint is a fine choice for the role of Jon, as his screen persona works well with the character’s schlubby, well-meaning passivity: Isn’t the “Harry Potter” star exactly the right fit for the sort of man who (possibly) gets cucked by an ancient and malevolent spirit of the forest? A scene with Grint doing traditional “here comes the aeroplane” baby-feeding is a highlight, capitalizing on the actor’s ability to play the blindest of blind optimism.Not to oversell him, however: This is, by some distance, Haarla’s show. That her character is called Saga is a pretty apt bit of nominative determinism: Saga by name, saga by nature. Baby-related trials are heaped upon her with agonizing regularity, and the inadequacy of the other characters’ responses contributes to a sense of gaslighting that almost succeeds in infecting the viewer. Even though you can see it’s not all in her head, it’s disorienting to see everybody else refuse so rigidly to consider that something could really be wrong. But not even a severed finger can jolt Saga’s relatives out of their perception that she’s the problem, not little Kuula.Contributing to this air of unreality is Kari Kankaanpää’s production design, in which everything feels a little heightened and stylized. Where Rosemary in “Rosemary’s Baby” was trapped by the very normality of her bourgeois Upper West Side surroundings, making it impossible to believe in the devil, here Saga’s entire world seems slightly fantastical. How, then, can you tell the difference between fantasy and reality? When was the last time you saw a barely populated hospital, with nobody in a rush and a new mother given a whole ward to herself? And when was the last time you saw someone actually pushing a traditional Silver Cross Balmoral-style pram, outside of a movie?Truly bloodthirsty gorehounds may find the ratio of horror to drama to be skewed a little too much toward the latter: Unlike Samantha Eggar’s anger-babies in David Cronenberg’s “The Brood,” this little guy isn’t racking up much in the way of a bodycount, and he’s more cute than scary. Meanwhile, audiences who savoured the gnarly but still very much arthouse world of “Die My Love” may find the more supernatural elements here to be a bridge too far. Still, that leaves a substantial audience who will find much to enjoy in this grisly yet sensitive take on the old maxim that every baby is different.\n\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Nightborn’ Review: Rupert Grint and Seidi Haarla Headline an Effective Blend of Finnish Mythology and Cronenbergian Horror",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/202616114_1_ORG.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-14T21:30:00.000Z",
      "dateModified": "2026-02-14T21:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Margot Robbie’s Skin Was Photographed to Become Cathy’s ‘Wuthering Heights’ Wallpaper; How Filmmakers Made the Walls Sweaty and Moist",
    "url": "https://variety.com/2026/artisans/news/margot-robbie-skin-cathy-wallpaper-wuthering-heights-1236662746/",
    "image": "https://variety.com/wp-content/uploads/2026/02/WHE-T1-0034.png?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-14T20:35:00.000Z",
    "description": "\n\t“Wuthering Heights” production designer Suzie Davies was excited to get a call from Emerald Fennell, since she’d worked on period dramas from this e",
    "body": "\n\t“Wuthering Heights” production designer Suzie Davies was excited to get a call from Emerald Fennell, since she’d worked on period dramas from this era before — not to mention on Fennell’s lavish “Saltburn.”\n\n\t“I thought it’d be fun,” Davies says. But Fennell had a different vision for adapting the Emily Bronte classic. Not only did she want the world built on sound stages, this was a story told through the lens how Fennell’s experienced the story as a 14-year-old. “That opened the treasure trove for me, and we could go in all different directions,” Davies says.\n\t\n\n\tFrom building Wuthering Heights to Thrushcross Grange, and even a doll’s house, Davies was in heaven.\n\n\n\tHere she breaks down the film’s key sets and why surfaces needed to be moist, reflective and sweaty.\n\n\tWuthering Heights\n\n\n\n\t\n\n\t\t\t\t\t–\n\t\t\t\t\t\t\t\t\tJaap Buitendijk\n\t\n\n\n\n\tWuthering Heights, which is in Yorkshire, needed a stable, an upstairs and a kitchen. Even though Davies built it on a soundstage, nature still needed to be ever-present.\n\n\t“That’s why we have a courtyard of rock around the house,” Davies explains. In addition, the arch leading to the house was inspired by Gothic architecture.\n\n\tDavies raised the set by two feet so she could build a drainage system. “We wanted practical effects. So there are rain rigs punched through the ceiling and there’s a tank underneath.”\n\n\tShe kept the colors of the Wuthering Heights interiors muted and almost bruise-like.\n\n\tThe idea of Wuthering Heights was for it to feel bruised and heavy with a brutalist vibe. \n\n\tDuring her research, Davies found the Trefor granite quarry in Northern Wales, which was abandoned and near a “big brutal structure on top of a hill.” Davies says, “It’s got nothing to do with Yorkshire, but it has the essence that Emerald wanted. Once we found that, then we started sort of layering on elements of the Yorkshire vernacular, of those big tiles.” The tiles were wet and shiny. She goes on to say, “There are a lots of modern materials used in traditional ways, and traditional materials used in unconventional ways. Everything’s flipped on its side, just to make the audience feel more uncomfortable.”\n\t\n\n\tThrushcross Grange\n\n\tThis was the Linton family’s estate, and excessive in every way. It also presents itself as this grand luxurious place, but metaphorically is a prison for Cathy.\n\n\tThe Skin Room\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tJaap Buitendijk\n\t\n\n\n\n\tWhen Cathy is introduced to her bedroom, it’s boasted that the walls are like her skin.\n\n\tAgain, it’s an uncomfortable moment for the character.\n\n\tDavies had swatches and fabrics around her desk. She happened to have a piece of latex. “I think we used it on ‘Saltburn,'” she recalls. It was skin-toned and Davies felt there was something there. \n\n\tOnce she knew she was onto something, Davies asked Robbie to “send high res images of her arms and veins. We printed it. We’ve slightly accentuated her veins.” Davies adds, “We had a go at doing her belly button as well above the fireplace, but that looked a little bit too weird, believe it or not.” The images of her skin were then printed onto the fabric that’s used for the padded wall panels of the bedroom.\n\n\tDavies adds that at the end, as there’s an overhead shot of Cathy on the bed as she is dying, her veins are prominent. “We printed her veins and everything into the carpet as well, just for that top shot, which is even more weird and uncomfortable.”\n\n\tThe Hands\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tJaap Buitendijk\n\t\n\n\n\n\tTake a careful look at “Wuthering Heights” and hands are everywhere, whether it’s shots of the actors, or as part of the decor. “There’s something really sexy about what they’re up to and what’s going on,” Davies says.\n\n\tFor the hands above the fireplace, Davies says she took casts of the art department’s hands to make the ceiling roses in the fireplace and in the panels of the library. “We’ve got the shadow puppets that play another subconscious little story going along in on the top of the library. So they’re sort of placed everywhere in the hope that they’re  little subconscious things. Some people will see them. Others won’t.”\n\n\tThe Dollhouse\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tJaap Buitendijk\n\t\n\n\n\n\tThe dollhouse was created by the Mattes and Miniatures crew. They built a 1/12th scale version of the Grange. Davies had the model built first, before building and designing the lifesize Thrushcross Grange, flipping her typical design process.\n\n\tFennell also had the idea that she wanted the Grange to reflect how Edgar liked collecting things.\n\n\tIn designing the Grange, Davies had a rule that everything needed to be ordered and symmetrical. “The windows are far too big. The doorways are far too big. The ceilings are really high. The ceilings are polished plaster. The floors are polished.”\n\t\n\n\tDavies went to town on the garden. “We had real trees and real flowers,” so it smelled like a real garden.\n\n\tSweat\n\n\n\n\t\n\n\t\t\t\t\t–\n\t\t\t\t\t\t\t\t\tJaap Buitendijk\n\t\n\n\n\n\tIf the film looks moist and the surfaces looks reflective, that’s exactly the look Fennell and Davies were going for. “We always wet down those city streets on night shoots to make them look lovely, and we just wanted everything possible to look like it’s sweating.”\n\n\tIn “Wuthering Heights,” Davies and her team rigged water to drip down the rock face and into the house.\n\n\tAt Thrushcross Grange, Davies says, “The skin starts to sweat when she gets ill in the dining room.” She adds, “The baubles are contemporary, plastic spheres that we stuck on the wall in a Regency pattern, but they look like they’re dribbling and falling down the paneling and onto the floor.”\n\n\tWIne Bottle Tower\n\n\tAs Cathy’s father Mr. Earnshaw continues to drink himself to death, Wuthering Heights starts to show cracks. Two wine towers feature in the kitchen to reflect Earnshaw’s state of mind.\n\n\tDavies says, “Emerald said, ‘I want a mound of bottles to show, obviously, that Earnshaw is this wreck and ruin, and is drinking himself to death.'” With that directive, Davies built a tower of wine bottles that were five feet high. “She said, ‘No, ten feet high. I just want to see a wave of bottles.'” Davies and her team built in in a way that cinematographer Linus Sandgren could light through it. “The power of that scene when Martin Clunes is on the floor with those two massive green piles of mountains of booze – Everything with Emerald is ‘keep going and maximalist.'”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Margot Robbie’s Skin Was Photographed to Become Cathy’s ‘Wuthering Heights’ Wallpaper; How Filmmakers Made the Walls Sweaty and Moist",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/WHE-T1-0034.png?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-14T20:35:00.000Z",
      "dateModified": "2026-02-14T20:35:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Poll Surprise: Bad Bunny Comes Out Ahead of Trump When U.S. Adults Are Asked, ‘Who Better Represents America?’",
    "url": "https://variety.com/2026/music/news/poll-bad-bunny-ahead-trump-who-represents-america-halftime-1236663647/",
    "image": "https://variety.com/wp-content/uploads/2026/02/MixCollage-08-Feb-2026-09-29-PM-8720.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-15T04:29:07.000Z",
    "description": "\n\tA new Yahoo!/YouGov poll shows more Americans approving of Bad Bunny than of his recent nemesis-in-chief, Donald J. Trump, in the wake of controvers",
    "body": "\n\tA new Yahoo!/YouGov poll shows more Americans approving of Bad Bunny than of his recent nemesis-in-chief, Donald J. Trump, in the wake of controversy over last weekend’s Super Bowl halftime show, by a margin of 42% for the Puerto Rican performer versus 39% for the president.\n\n\tMore than 1,700 U.S. adults were surveyed for the poll, with a slightly higher percentage of Republicans and conservatives included in the survey than their Democratic/liberal counterparts. \n\t\n\n\tOn the question “Who better represents America?,” the split between 42% for Bad Bunny versus 39% for Trump had the performer ahead by three points — and left 20% who answered “not sure,” making it a closer call between those two than it was in the lopsided contest between the Seahawks and Patriots.\n\n\n\tAsked for their overall opinion of Bad Bunny, 43% of those polled said they had a favorable take on the artist, while 36% said it was unfavorable. \n\n\tThere was a similar result when those surveyed were asked whether they approved or disapproved of Bad Bunny as the halftime pick. The yay vote was 44%, while 35% disapproved of the NFL’s choice.\n\n\tWhen asked whether they watched the halftime performance, 47% of respondents said they did, and 53% said they did not. (51% said they watched the Super Bowl overall, suggesting that there were 4% of U.S. adults who watched the game itself but tuned out Bad Bunny.)\n\n\tWhen it came to those who did indeed watch Bad Bunny at halftime, the results skewed heavily toward the favorable.\n\n\tOn the question “Did you like or dislike Bad Bunny’s halftime performance?,” 30% of all Americans surveyed said they “liked” it, while only 8% said they “disliked” the halftime show. Another 8% who viewed it neither liked nor disliked it. (The remaining 53% of those surveyed indicated they had not tuned in.)\n\t\n\n\tBad Bunny not performing in English? Not a problem for the majority of the 47% of U.S. adults who did watch the halftime show. The poll showed that 31% of those who watched approved of him performing entirely in Spanish, while only 11% disapproved. (Another 5% weren’t sure one way or the other; again, the question was not asked of the 53% who didn’t tune in.)\n\n\tBad Bunny’s final burst of messaging got a high approval rating from viewers. Those polled were asked what they thought of the artist ending his performance by saying “God bless America” while naming all the countries in North, South and Central America, backed by a billboard that read “The only thing more powerful than hate is love.” This was asked of all respondents — halftime viewers and non-viewers alike — and a whopping 60% approved of the message, while only 16% said they disapproved. (24% were unsure.)\n\n\tAs for who was surveyed, there were more Republicans than Democrats participating in the poll. Respondents identified as 33% Republican, 31% Democrat and 28% independent. By ideology, 33% identified as conservative, 28% as liberal and 31% as moderate. Racially, whites dominated the sample at 63%, followed by Hispanics at 16% and Blacks at 13%. \n\n\tThe polarized response to the Super Bowl halftime show was heightened by the president signaling his strong distaste for Bad Bunny both before and after the game. Trump tore into the Feb. 8 halftime show as “a slap in the face to the U.S. and “an affront to the Greatness of America.” He wrote on Truth Social, “Nobody understands a word this guy is saying,” while adding that the dancing was “disgusting.”\n\n\tSome Republican strategists have suggested that Trump is making an unforced error by going after as popular a performer as Bad Bunny, and slamming the idea of performing in Spanish, particularly when some crucial House races will be happening this fall in districts with large contingents of Latino voters.\n\n\t“It’s going to do us more damage than good,” Vianca Rodriguez told Reuters this week. Rodriguez, an ex-Trump administration official who served as deputy Hispanic communications director for the RNC during the last presidential race, added, “That shouldn’t have been a battle to have been picked culturally.”\n\n\tWhen the Yahoo!/YouGov poll results were broken down by race, Bad Bunny came in behind on some of the key questions among white respondents. When white respondents were asked about their general opinion of the performer, Bad Bunny was slightly underwater, with 39% of whites generally approving of Bad Bunny, while 41% disapprove. But he has a 57% approval rating among all Blacks, versus only 11% disapproval. Among Hispanics, 51% gave Bad Bunny their approval in the poll, while 36% disapprove.\n\t\n\n\tOn the question “Who better represents America?,” Bad Bunny lagged further behind among white respondents, with 48% saying Trump, while 37% said Bad Bunny. But the musician came out far ahead with Blacks, who picked Bad Bunny as the better representative of America at 61%, over just 9% going with Trump. Among Hispanics, it was tighter, but still heavily tilted toward the artist; 46% said Bad Bunny better represents America, versus 32% saying Trump.\n\n\tBad Bunny’s Super Bowl halftime show reached an average of 128.2 million viewers, according to Nielsen. That is easily one of the top marks for any halftime performance in the history of the game, although behind the all-time record of 133.5 million achieved last year by Kendrick Lamar’s performance. The ratings smash came despite millions of potential viewers being siphoned off by a pre-taped Turning Point USA show headlined by Kid Rock that was heavily touted as a conservative alternative to the NFL’s broadcast. \n\n\tThe Yahoo!/YouGov poll was conducted among 1,704 adults on Feb. 9-12, with a three-point margin of error.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Poll Surprise: Bad Bunny Comes Out Ahead of Trump When U.S. Adults Are Asked, ‘Who Better Represents America?’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/MixCollage-08-Feb-2026-09-29-PM-8720.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-15T04:29:07.000Z",
      "dateModified": "2026-02-15T04:29:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Guess Who This Hilarious British Actor Is!",
    "url": "https://www.tmz.com/2026/02/14/guess-who-british-actor/",
    "image": "https://imagez.tmz.com/image/38/16by9/2026/02/10/38f1958b34c047b8a493b2848403675d_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-15T02:00:57.000Z",
    "description": "\n    \n                    \n                          Guess Who\n                          This Comedic Actor Is!\n                      \n               ",
    "body": "\n    \n                    \n                          Guess Who\n                          This Comedic Actor Is!\n                      \n                  \n                                                                        Published \n                              February 14, 2026\n                            6:00 PM PST\n                                                                            \n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          This actor from across the pond has starred in -- and even written -- some of the biggest hit films of the 21st century ... but, can you guess who he is without seeing his face?\n      \n    \n          It wasn't mission impossible to get this star to talk to us back in 2015 outside celebrity hot spot Craig's ... and, he talked all about grooming for the modern man -- including whether a dude would end up in some hot fuzz for getting a \"Boy-zilian\"\n      \n    \n          In fact, this British star says he's cool with absolutely anything out there fellas wanna do!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Movies\n              \n                          \n                Guess Who\n              \n                          \n                Comedy\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Guess Who This Hilarious British Actor Is!",
      "image": [
        "https://imagez.tmz.com/image/38/16by9/2026/02/10/38f1958b34c047b8a493b2848403675d_xl.jpg"
      ],
      "datePublished": "2026-02-15T02:00:57.000Z",
      "dateModified": "2026-02-15T02:00:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Justina Valentine Fire-Hot Snaps to Celebrate Her 39th Birthday",
    "url": "https://www.tmz.com/2026/02/14/justina-valentine-birthday-photos/",
    "image": "https://imagez.tmz.com/image/18/16by9/2026/02/03/189725df65da491c84780c4859ff801b_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-14T20:00:11.000Z",
    "description": "\n    \n                    \n                          Justina Valentine\n                          Fire-Hot Snaps To Celebrate Bday!!!🔥\n               ",
    "body": "\n    \n                    \n                          Justina Valentine\n                          Fire-Hot Snaps To Celebrate Bday!!!🔥\n                      \n      \n    \n      \n        \n              \n    \n    \n          Justina Valentine is 39 and looking great ... and if you need receipts, this gallery’s got 'em!\n      \n    \n          The birthday babe knows exactly how to crank up the heat -- and it’s not just the signature red hair, 'cause those barely-there bikinis are doing all the talking and showing off every curve.\n      \n    \n          Justina’s body confidence is on full blast, keeping it on-brand in fiery red ... no matter what corner of the globe she’s posing in.\n      \n    \n          So go ahead -- scroll, stare, and celebrate. Justina’s blowing out candles and serving looks. Happy Birthday!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Justina Valentine\n              \n                          \n                Hotties & Bodies\n              \n                          \n                Hot Bodies\n              \n                          \n                Birthdays\n              \n                          \n                Photo Galleries\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Justina Valentine Fire-Hot Snaps to Celebrate Her 39th Birthday",
      "image": [
        "https://imagez.tmz.com/image/18/16by9/2026/02/03/189725df65da491c84780c4859ff801b_xl.jpg"
      ],
      "datePublished": "2026-02-14T20:00:11.000Z",
      "dateModified": "2026-02-14T20:00:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "James Van Der Beek's Friends Helped Him Buy Texas Ranch Before Death",
    "url": "https://www.tmz.com/2026/02/14/james-van-der-beek-friends-help-buy-texas-ranch/",
    "image": "https://imagez.tmz.com/image/0f/16by9/2026/02/14/0f9f501db58a405e84ca0782813041f9_xl.png",
    "tag": "Entertainment",
    "date": "2026-02-14T22:52:02.000Z",
    "description": "\n    \n                    \n                          James Van Der Beek\n                          Friends Helped With Down Payment on Texas Ranch\n    ",
    "body": "\n    \n                    \n                          James Van Der Beek\n                          Friends Helped With Down Payment on Texas Ranch\n                      \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          James Van Der Beek's friends stepped up to help him secure a down payment on his family's Texas ranch before he passed away ... his rep revealed.\n      \n    \n          People spoke to the rep about the $4.7 million Texas Ranch, which, as we reported, he bought on January 9 ... and the rep told the outlet his family wanted to stop paying rent and start paying a mortgage, and some helpful friends made that dream a reality.\n      \n    \n          As we mentioned ... James and his family moved to the ranch in 2020 -- but, they were only renting the property for the first 5+ years.\n      \n\n          The 5,149-square-foot ranch house sits on 36 acres and features 5 bedrooms and 3 bathrooms. There are also cabins and a pool on the ranch, plus sweeping views of the Pedernales River.\n      \n    \n          We broke the story ... James passed away Wednesday. His cause of death hasn't come out yet, but he was fighting a very public battle with colorectal cancer over the last couple years.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Numerous famous friends have posted loving tributes to JVDB over the last few days ... with his pal, former WWE wrestler Stacy Keibler, seemingly sharing a pic of one of the star's final moments from the estate.\n      \n    \n          A GoFundMe to support James' wife Kimberly and their six kids was posted in the aftermath of his passing ... and it has raised more than $2.5 million at the time of publishing.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                James Van Der Beek\n              \n                          \n                RIP\n              \n                          \n                Money\n              \n                          \n                Celebrity Death\n              \n                          \n                Celebrity Homes\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "James Van Der Beek's Friends Helped Him Buy Texas Ranch Before Death",
      "image": [
        "https://imagez.tmz.com/image/0f/16by9/2026/02/14/0f9f501db58a405e84ca0782813041f9_xl.png"
      ],
      "datePublished": "2026-02-14T22:52:02.000Z",
      "dateModified": "2026-02-14T22:52:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rihanna Accidentally Flashes Butt While Walking into A$AP Rocky's Fashion Show",
    "url": "https://www.tmz.com/2026/02/14/rihanna-wardrobe-malfunction-at-asap-rocky-fashion-show/",
    "image": "https://imagez.tmz.com/image/e8/16by9/2026/02/14/e85f3fab6ade4a3c8d168ce733888b0b_xl.png",
    "tag": "Entertainment",
    "date": "2026-02-14T21:03:36.000Z",
    "description": "\n    \n                    \n                          Rihanna\n                          Wardrobe Malfunction ... No Butts About It!\n                   ",
    "body": "\n    \n                    \n                          Rihanna\n                          Wardrobe Malfunction ... No Butts About It!\n                      \n                  \n                                                                        Published \n                              \n                February 14, 2026\n                \n                            1:03 PM PST\n                                                                      |\n                                                                Updated \n                                  February 14, 2026\n                                1:54 PM PST\n                                    \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Rihanna went to support A$AP Rocky's fashion pursuits ... but her outfit gained the most attention when she accidentally flashed her backside.\n      \n    \n          The singer-songwriter stepped out in an all-black ensemble Friday night to attend her man's AWGE fashion show in New York City ... and her leather jacket opened a bit too wide and revealed the star's famous derrière.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Check it out ... the jacket's skirt is split in the back and the split reaches just a bit too high up her legs, revealing the bottom of her bottom.\n      \n\n          RiRi quickly readjusted the jacket ... stopping the crack from showing any of hers.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Despite the fashion faux pas, Rihanna looked chic as always ... just like she did recently at Paris Fashion Week, where she flashed her cleavage and even during a recent trip to the grocery store.\n      \n    \n          Take a bow for your fashion, Rihanna ... but maybe grab a different skirt first!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                A$AP Rocky\n              \n                          \n                Rihanna\n              \n                          \n                You Might Want to Rethink\n              \n                          \n                Fashion\n              \n                          \n                Music\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rihanna Accidentally Flashes Butt While Walking into A$AP Rocky's Fashion Show",
      "image": [
        "https://imagez.tmz.com/image/e8/16by9/2026/02/14/e85f3fab6ade4a3c8d168ce733888b0b_xl.png"
      ],
      "datePublished": "2026-02-14T21:03:36.000Z",
      "dateModified": "2026-02-14T21:03:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "SWAT Makes Its Move in the Nancy Guthrie Kidnapping -- The Latest",
    "url": "https://www.tmz.com/2026/02/14/swat-detains-in-guthrie-investigation-harvey-levin-cnn-interview/",
    "image": "https://imagez.tmz.com/image/87/16by9/2026/02/14/87cb79cc53cd440082817d5086cd5e30_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-14T14:29:06.000Z",
    "description": "\n    \n                    \n                          Nancy Guthrie\n                          SWAT Makes Its Move In Her Kidnapping, Here's The Latest\n",
    "body": "\n    \n                    \n                          Nancy Guthrie\n                          SWAT Makes Its Move In Her Kidnapping, Here's The Latest\n                      \n                  \n                                                                        Published \n                              \n                February 14, 2026\n                \n                            6:29 AM PST\n                                                                      |\n                                                                Updated \n                                  February 14, 2026\n                                1:57 PM PST\n                                    \n      \n    \n      \n        \n                    \n                  \n      \n                    CNN\n          \n    \n          The swat operation Friday night -- leading to the detention of a driver in the Tucson area and the search of a home -- appears to be something other than a direct lead from the ransom note TMZ received.\n      \n    \n          Harvey Levin appeared on CNN Saturday morning, breaking down the limited information we know at this time. A law enforcement source involved in the investigation told him this morning neither the ransom note we received nor the reward demand emails we received were the trigger for last night's action.\n      \n    \n          We have not confirmed, but it appears ... the main target last night was someone in a vehicle in the Tucson area. Again, it appears but is not confirmed ... the search of the house is connected to the traffic stop. 2 people were taken out of the house, and it was searched for several hours.\n      \n\n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          Levin said the FBI had multiple contacts with TMZ Friday about both the ransom letter and the reward demands. Those interactions went on until the early evening Friday night.\n      \n    \n          BTW, the Pima County Sheriff's Office clarified the events from Friday night ... saying Saturday, \"Last night, a federal court-ordered search warrant was executed at a residence near E. Orange Grove Rd. and N. First Ave. in connection with the Guthrie case.\" The warrant was based on a lead they received, and no arrests were made.\n      \n    \n          They also confirmed a traffic stop was conducted, and a person was questioned -- but again, no arrests.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Nancy Guthrie\n              \n                          \n                Nancy Guthrie Case\n              \n                          \n                News\n              \n                          \n                Police\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "SWAT Makes Its Move in the Nancy Guthrie Kidnapping -- The Latest",
      "image": [
        "https://imagez.tmz.com/image/87/16by9/2026/02/14/87cb79cc53cd440082817d5086cd5e30_xl.jpg"
      ],
      "datePublished": "2026-02-14T14:29:06.000Z",
      "dateModified": "2026-02-14T14:29:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]