[
  {
    "title": "Why Sylvester Stallone Isn’t Appearing in the ‘Cliffhanger’ Reboot",
    "url": "https://variety.com/2025/film/news/sylvester-stallone-cliffhanger-reboot-neal-moritz-lawsuit-1236612317/",
    "image": "https://variety.com/wp-content/uploads/2025/08/GettyImages-2186372434-1-1.jpg?crop=0px%2C14px%2C1000px%2C562px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-12-19T01:04:51.000Z",
    "description": "\n\tProducer Neal Moritz has spent the past 15 years trying to reboot “Cliffhanger,” the 1993 blockbuster starring Sylvester Stallone.\n\n\tThe project is ",
    "body": "\n\tProducer Neal Moritz has spent the past 15 years trying to reboot “Cliffhanger,” the 1993 blockbuster starring Sylvester Stallone.\n\n\tThe project is finally coming to the big screen next year — but Stallone won’t be in it. And in a new lawsuit against the film’s financiers, Moritz explains why.\n\n\tMoritz alleges that Rocket Science Industries has reneged on an agreement to pay him a $2.5 million producer fee. According to the complaint, Moritz and his partner, Toby Jaffe, spent years lining up talent for the film, and negotiated a deal for Stallone to star as the male lead.\n\t\n\n\tStallone was prepared to shoot the film in the fall of 2023, before the second season of “Tulsa King” went into production, on condition that his fee would be put in escrow — that is, guaranteed up front.\n\n\n\t“But Rocket Science failed to secure Stallone’s commitment to do the Picture because it refused to guarantee Stallone’s fee,” the lawsuit states.\n\n\tThe producers nevertheless created a sizzle reel with Stallone envisioned as the lead, which was used to market the film to sales agents. But with Stallone not confirmed, the director, Ric Roman Waugh, ultimately backed out.\n\n\tMoritz and Jaffe then worked to hire a new director, Jean-François Richet, and brought in a new writer, Melanie Toast, to rewrite the script, as they continued to try to get Stallone to commit to the project, which was pushed back to 2024. But Stallone’s scheduling conflict with “Tulsa King” and the lack of a guarantee meant that he was out, according to the lawsuit.\n\n\tRichet then dropped out, prompting producers Moritz and Jaffe to hire yet another director, Jaume Collet-Serra. They then secured Lily James to play the female lead and tried to get Russell Crowe to replace Stallone. Crowe dropped out. The job eventually went to Pierce Brosnan.\n\t\n\n\tIn May 2024, Moritz and Jaffe were asked to defer all their producer fees. Rocket Science execs explained that they were experiencing budget problems, partly because the loss of Stallone meant lower guarantees for pre-sales in Spain, Latin America and Scandinavia, according to the complaint. The fees for the director and lead cast had come in higher than expected, and the lenders wanted the producers to hold back their fees as a condition of financing the project.\n\n\tThe suit states that Moritz and Jaffe had already warned Rocket Science that they were paying too much for talent.\n\n\t“Although the deferral of producer fees occasionally takes place in connection with making independent motion pictures, it is highly unusual for requests to be made to a producer of Moritz’s stature to defer the entirety of the producer’s fee,” the lawsuit states. “The problem with the deferral of producer fees is not just that the producer gets paid later than he or she was supposed to be paid, but deferral may result in the producer never getting the full agreed-upon fee or possibly not even any portion of the fee.”\n\n\tThe suit, filed in L.A. Superior Court, alleges that the parties have not come to terms, and that Rocket Science has effectively repudiated its agreement with Moritz and Jaffe. \n\n\tRow K Entertainment acquired U.S. distribution rights to the project in September in a reported eight-figure deal.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why Sylvester Stallone Isn’t Appearing in the ‘Cliffhanger’ Reboot",
      "image": [
        "https://variety.com/wp-content/uploads/2025/08/GettyImages-2186372434-1-1.jpg?crop=0px%2C14px%2C1000px%2C562px&resize=1000%2C563"
      ],
      "datePublished": "2025-12-19T01:04:51.000Z",
      "dateModified": "2025-12-19T01:04:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sony to Acquire Control of Peanuts in $457 Million Deal",
    "url": "https://variety.com/2025/film/news/sony-acquire-peanuts-457-million-deal-1236612363/",
    "image": "https://variety.com/wp-content/uploads/2025/12/Peanuts.png?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-19T00:21:32.000Z",
    "description": "\n\tSony is paying more than a few peanuts to get majority ownership of Charles M. Schulz’s beloved Peanuts franchise featuring Snoopy, Charlie Brown an",
    "body": "\n\tSony is paying more than a few peanuts to get majority ownership of Charles M. Schulz’s beloved Peanuts franchise featuring Snoopy, Charlie Brown and more.\n\n\tSony Pictures Entertainment and Sony Music Entertainment (Japan) announced that they entered into a definitive agreement with Canadian media company WildBrain to indirectly acquire all of the 41% stake held by WildBrain in Peanuts Holdings LLC.\n\n\n\tSony will pay CAN $630 million to WildBrain for the 41% stake, or roughly $457 million. The closing of the transaction is subject to certain closing conditions, including regulatory approvals.\n\t\n\n\tAs a result of the transaction, SMEJ and Sony Pictures Entertainment, together with SMEJ’s existing approximately 39% stake, will indirectly own 80% of Peanuts Holdings LLC, while the members of the family of Charles M. Schulz will continue to own the remaining 20%. The ownership of rights to “Peanuts” and the management of its business continue to be handled by Peanuts Worldwide, a wholly owned subsidiary of Peanuts Holdings LLC. \n\n\tWith Sony taking an 80% stake, Peanuts Holdings LLC (including Peanuts Worldwide), will become a consolidated subsidiary of the Sony Group. SMEJ will take the lead in managing Peanuts Holdings LLC in partnership with SPE.\n\n\t“Since 2018, SMEJ has been proud to be part of the partnership behind ‘Peanuts,’ an iconic global entertainment brand with a 75-year legacy of delighting audiences worldwide,” Shunsuke Muramatsu, president and group CEO, Sony Music Entertainment (Japan), said in a statement. “With this additional ownership stake, we are thrilled to be able to further elevate the value of the ‘Peanuts’ brand by drawing on the Sony Group’s extensive global network and collective expertise.\n\t\n\n\tHe continued, “We are deeply committed to carrying forward the legacy of Charles Schulz and the Schulz family. Together with SPE, and backed by WildBrain’s continued partnership, we will continue to embrace new opportunities to ensure that ‘Peanuts’ remains a relevant and beloved presence across generations—reaching new audiences and sharing the timeless charm of the ‘Peanuts’ gang for years ahead.”\n\n\tSince acquiring an interest in Peanuts Holdings in 2018, SMEJ said, it has focused on expanding the “Peanuts” IP business while maintaining and further building a positive relationship with the Schulz family. The company said it aims to continue to use its expertise in the character business — and the extensive network of the Sony Group — to “drive further growth of the Peanuts IP business and enhance the brand’s value.”\n\n\tRavi Ahuja, president and CEO of Sony Pictures Entertainment, said, “‘Peanuts’ is enduring and iconic. We value the deep collaboration we have with our SMEJ colleagues and look forward to building on their meaningful partnership with WildBrain and the Schulz family. With our combined strengths, we have the unique capability and extraordinary opportunity to protect and shape the future of these beloved characters for generations to come.”\n\n\tJosh Scherba, president and CEO of WildBrain, commented, “Sony has been an excellent partner on the ‘Peanuts’ brand for many years, and we’re confident that Charlie Brown, Snoopy and the gang are in good hands with them. We’d like to thank the Peanuts Worldwide team, as well as the Schulz family, for their incredible collaboration, and we look forward to working with them and Sony going forward to continue driving global success for ‘Peanuts’”\n\n\tCharlie Brown, Snoopy and the rest of the “Peanuts” crew were first introduced to the world by Charles M. Schulz on Oct. 2, 1950, when the comic strip debuted in seven newspapers. The franchise has since become a global hit. In addition to the “Peanuts” shows and specials on Apple TV, the brand encompasses thousands of consumer products, as well as amusement park attractions, cultural events, social events, social media, and comic strips in all formats.\n\n\tFor WildBrain, the deal will eliminate 100% of its debt “and gives us financial flexibility to accelerate the growth of our iconic franchises Strawberry Shortcake and Teletubbies, while also investing in our premium digital content network across YouTube, FAST and AVOD, and in new technologies to drive innovation,” the company said.\n\t\n\n\tUnder the agreement, WildBrain also remains a multiyear partner to Peanuts for key services, including acting as distributor for WildBrain-produced Peanuts content and continued management of the Snoopy YouTube channel. In addition, the company will serve as exclusive licensing agent through its agency WildBrain CPLG for consumer products in all current territories across Europe, the Middle East, China, and Asia Pacific (excluding Japan, Australia and New Zealand).\n\n\tWildBrain also will operate an exclusive production studio for new Peanuts content — including the previously announced animated feature film — under a partnership with Apple TV, recently renewed through 2030.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sony to Acquire Control of Peanuts in $457 Million Deal",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/Peanuts.png?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-19T00:21:32.000Z",
      "dateModified": "2025-12-19T00:21:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Labubu’ Movie Enlists ‘Wonka’ and ‘Paddington’ Director Paul King",
    "url": "https://variety.com/2025/film/news/labubu-movie-wonka-paddington-director-paul-king-1236612320/",
    "image": "https://variety.com/wp-content/uploads/2025/12/GettyImages-2234550099.jpg?crop=0px%2C352px%2C6000px%2C3375px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-12-18T23:26:05.000Z",
    "description": "\n\tLabubu, that line of round, wide eyed, pointy eared plush collectibles, is coming to the screen. Sony Pictures has tapped Paul King, the director of",
    "body": "\n\tLabubu, that line of round, wide eyed, pointy eared plush collectibles, is coming to the screen. Sony Pictures has tapped Paul King, the director of “Wonka” and the “Paddington” films,” to make a live-action feature based on the beloved toys. The project is in early development, with King set to direct and produce with Department M and Wenxin She.\n\n\tKing’s most recent film, “Wonka,” starring Timothée Chalamet, was a major box office success, earning $635 million globally. The “Paddington” films were commercial hits and were embraced by critics. They earned nearly $500 million globally. King co-wrote the screenplay and executive produced the third film in the series.\n\t\n\n\t“Labubu” originated 10 years ago in a picture book series. The toys are produced and sold exclusively by China-based retailer Pop Mart. In case you came of age long before the aughts or don’t have young relatives, Labubu figures are sealed in “blind box” packaging, which means buyers aren’t always aware of the specific character inside. They were created by Kasing Lung, a Hong Kong-born artist who has strong ties to the Netherlands, where he moved as a child, developing an appreciation for folklore that inspired “The Monsters” series, which led to Labubu.\n\n\n\tAs Hollywood hunts for new forms of IP to exploit, it has increasingly turned to toys and games. Warner Bros. and Mattel had a hit with “Barbie” and Warners then turned “A Minecraft Movie” into one of 2025’s biggest blockbusters. There have also been successful movies made of “Super Mario Bros.” and “Sonic the Hedgehog.” Studios are currently working on producing features based on everything from “Masters of the Universe” to “Rock ’Em Sock ’Em Robots,” which is being written by Vin Diesel. \n\t\n\n\tThe Hollywood Reporter broke the news of King’s hire.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Labubu’ Movie Enlists ‘Wonka’ and ‘Paddington’ Director Paul King",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/GettyImages-2234550099.jpg?crop=0px%2C352px%2C6000px%2C3375px&resize=1000%2C563"
      ],
      "datePublished": "2025-12-18T23:26:05.000Z",
      "dateModified": "2025-12-18T23:26:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "CBS Orders Comedy Pilot ‘Regency,’ From ‘The Big Bang Theory’ Alum Tara Hernandez",
    "url": "https://variety.com/2025/tv/news/cbs-comedy-pilot-regency-tara-hernandez-1236612366/",
    "image": "https://variety.com/wp-content/uploads/2025/12/P115SW6D.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-19T01:00:00.000Z",
    "description": "\n\tCBS has ordered the pilot “Regency,” from “The Big Bang Theory” and “Young Sheldon” alum Tara Hernandez, to be put into consideration for the 2026-2",
    "body": "\n\tCBS has ordered the pilot “Regency,” from “The Big Bang Theory” and “Young Sheldon” alum Tara Hernandez, to be put into consideration for the 2026-2027 TV season. The multi-camera sitcom, from Warner Bros. TV, is a period piece described as a “historical spin” on the typical family comedy.\n\n\tHere’s the full logline: “A historical spin on the classic multi-cam family sitcom, centered around the upper-middle class Tillbrooks as they navigate life, love, and scandal in 19th Century England.”\n\t\n\n\t“Regency” reps the latest comedy to be added to the Eye network’s laffer development roster, which has been busy in the past few weeks adding new projects to its year-round development strategy.\n\n\n\tAlso in the mix: “Checkpoint,” from Aaron Kaplan’s Kapital Entertainment, set in the world of TSA officers — and starring comedian X Mayo, who created the project with Mike Sikowitz. The network is also developing the comedy “Auntie Supreme,” from CBS Studios and Cedric the Entertainer’s Bird & The Bear Entertainment, about a life coach who decides to co-parent her nieces with her brother-in-law. Gloria Bigelow, Christy Stratton are the writers behind that show.\n\n\tAnd then CBS also has the comedy pilot “Eternally Yours,” from “Ghosts” executive producers Joe Port and Joe Wiseman. That project, about vampires who must accept that their daughter is dating a human mortal, has cast Ed Weeks and Jaren Lewison.\n\n\tThose contenders could join a roster that includes established hits “Ghosts,” “Georgie & Mandy’s First Marriage” and freshman entry “DMV.” (Another hit, “The Neighborhood,” will end its run this spring after eight seasons.)\n\t\n\n\tBesides “Young Sheldon” and “The Big Bang Theory,” Hernandez’s credits include writing and serving as a creator on the series “Mrs. Davis” (which she created with Damon Lindelof). She’s also credited as a writer on a feature film in the works based on the animated series “Captain Planet.” In 2023, Hernandez was selected to be a part of Variety‘s “Variety500” list.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "CBS Orders Comedy Pilot ‘Regency,’ From ‘The Big Bang Theory’ Alum Tara Hernandez",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/P115SW6D.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-19T01:00:00.000Z",
      "dateModified": "2025-12-19T01:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "TikTok U.S. Joint Venture Deal Set to Close in January With Investors Including Oracle, Silver Lake",
    "url": "https://variety.com/2025/digital/news/tiktok-us-joint-venture-deal-close-date-oracle-silver-lake-1236612315/",
    "image": "https://variety.com/wp-content/uploads/2023/10/TikTok.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-18T23:08:49.000Z",
    "description": "\n\tTikTok is nearly to the finish line in the video app’s long trek to becoming legal in the U.S.\n\n\tByteDance and TikTok have signed “binding agreement",
    "body": "\n\tTikTok is nearly to the finish line in the video app’s long trek to becoming legal in the U.S.\n\n\tByteDance and TikTok have signed “binding agreements” with three managing investors: Oracle, private equity firm Silver Lake and Abu Dhabi’s state-owned investment firm MGX, to form a new TikTok U.S. joint venture named TikTok USDS Joint Venture LLC, according to a memo to TikTok staff by CEO Shou Zi Chew reviewed by Variety. The agreement forming the TikTok U.S. joint venture is set to close Jan. 22, 2026.\n\t\n\n\tThe TikTok U.S. joint venture will be 50% held by a consortium of new investors, including Oracle, Silver Lake and MGX with 15% each; 30.1% held by affiliates of certain existing investors of ByteDance; and 19.9% will be retained by ByteDance. \n\n\n\tWith the deal, ByteDance and TikTok will — after nearly a year in legal limbo — come into compliance with the U.S.’s TikTok divest-or-ban law, which prohibits distribution in the U.S. of any app that is more than 20% owned by a “foreign adversary” (in this case, China). \n\n\tThe U.S. law passed last year with overwhelming bipartisan support among lawmakers, concerned that ByteDance’s ties to China made TikTok a national security threat because of the risk of spying on Americans or manipulating content in the app. The law went into effect Jan. 19, 2025. However, President Trump has issued five executive orders this year that delayed enforcement of the ban by the Justice Department while the administration tried to broke a deal to transfer ownership to U.S.-based investors.\n\n\tThe agreements specify that the U.S. joint venture will be majority-owned by U.S. investors, governed by a new seven-member majority-American board of directors, and subject to terms “designed to protect Americans’ data and U.S. national security,” per the memo.\n\t\n\n\tOne important element of the TikTok U.S. JV agreement concerns the app’s content algorithm: The new entity will be responsible for “retraining the content-recommendation algorithm on U.S. user data to ensure the content feed is free from outside manipulation,” according to Chew’s memo.\n\n\t“I want to take this opportunity to thank you for your continued dedication and tireless work,” Chew wrote in the memo. “Your efforts keep us operating at the highest level and will ensure that TikTok continues to grow and thrive in the U.S. and around the world. With these agreements in place, our focus must stay where it’s always been — firmly on delivering for our users, creators, businesses and the global TikTok community.”\n\n\tOn Sept. 25, Trump signed an executive order that approved the formation of the joint venture and the sale of ownership stakes to non-Chinese investors. According to U.S. VP JD Vance, the agreement valued TikTok U.S. at $14 billion.\n\n\tTrump claimed that tech mogul Michael Dell and Rupert Murdoch are among the investors in the TikTok U.S. venture, but their participation has not been otherwise confirmed.\n\n\tOracle, founded by Trump supporter Larry Ellison, already provides data and computing services for TikTok’s U.S. operations. Current ByteDance investors including venture-capital firms Susquehanna International, KKR and General Atlantic are also part of the ownership group.\n\n\tAccording to Trump’s executive order, the new TikTok U.S. joint venture will encompass not only the TikTok app but also ByteDance’s Lemon8 and CapCut applications, as well as “any other application or website duly operated by the new joint venture, and their associated or affiliated websites.” The Trump administration’s non-enforcement of the law was extended until Jan. 23, 2026, more than a year after the TikTok divest-or-ban legislation went into effect.\n\n\tTrump, in the final months of his first administration, tried unsuccessfully to ban TikTok unless its ownership was transferred to U.S. companies, also over national security concerns. After he won the 2024 election, Trump said, “I have a warm spot in my heart for TikTok,” because “there are those who say” the app helped drive support for him among young voters.\n\n\tRead the full memo from Chew:\n\t\n\n\tUpdate on our U.S. businessI am pleased to share some great news. We have signed agreements with investors regarding a new TikTok U.S. joint venture, enabling over 170 million Americans to continue discovering a world of endless possibilities as part of a vital global community. I want to take this opportunity to thank you for your continued dedication and tireless work. Your efforts keep us operating at the highest level and will ensure that TikTok continues to grow and thrive in the U.S. and around the world. With these agreements in place, our focus must stay where it’s always been—firmly on delivering for our users, creators, businesses and the global TikTok community. There’s more work to be done as we move towards the closing date of January 22, 2026. Within this timeframe, we will continue to update you on the process and other details. In the meantime, I have outlined key terms of the agreements below. Shou———–ByteDance and TikTok have signed binding agreements with three managing investors, Oracle Corporation, Silver Lake, and MGX, to form a new TikTok U.S. joint venture named TikTok USDS Joint Venture LLC. Pursuant to the Executive Order signed by U.S. President Donald J. Trump on September 25, 2025, the agreements specify that the U.S. joint venture will be majority owned by American investors, governed by a new seven-member majority-American board of directors, and subject to terms that protect Americans’ data and U.S. national security. Specifically, the U.S. joint venture will be 50% held by a consortium of new investors, including Oracle, Silver Lake and MGX with 15% each; 30.1% held by affiliates of certain existing investors of ByteDance; and 19.9% will be retained by ByteDance. Through comprehensive security measures, more than 170 million Americans will continue to discover, create, and connect on the platform, enjoying the same experience as today. Advertisers will continue to connect with global audiences with no impact. The U.S. joint venture will be responsible for U.S. data protection, algorithm security, content moderation, and software assurance. It will also have the exclusive right and authority to provide assurances that content, software, and data for American users is secure. A trusted security partner will be responsible for auditing and validating compliance with the agreed upon National Security Terms, and Oracle will be the trusted security partner upon completion of the transaction. The U.S. joint venture will oversee: \n\n\nData Protection: safeguarding sensitive U.S. user data, which will be stored in a trusted and secure cloud environment in the United States run by Oracle.\nAlgorithm Security: retraining the content recommendation algorithm on U.S. user data to ensure the content feed is free from outside manipulation.\nContent Moderation: ultimate decision-making authority for reviewing and approving all content moderation and related policies within the United States.\nSoftware Assurance: deployment and integrity of the U.S. application software and platform.\n\n\n\n\tThe transaction will be completed no later than 120 days from the date of the Executive Order. Upon the closing, the U.S. joint venture, built on the foundation of the current TikTok U.S. Data Security (USDS) organization, will operate as an independent entity with authority over U.S. data protection, algorithm security, content moderation and software assurance, while TikTok global’s U.S. entities will manage global product interoperability and certain commercial activities, including e-commerce, advertising, and marketing.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "TikTok U.S. Joint Venture Deal Set to Close in January With Investors Including Oracle, Silver Lake",
      "image": [
        "https://variety.com/wp-content/uploads/2023/10/TikTok.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-18T23:08:49.000Z",
      "dateModified": "2025-12-18T23:08:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Macaulay Culkin Says ‘Die Hard’ Is Not a Christmas Movie and ‘Don’t Fight Me’: The Film ‘Would Still Work’ If ‘It Were Also St. Patrick’s Day’",
    "url": "https://variety.com/2025/film/news/macaulay-culkin-die-hard-christmas-movie-1236611785/",
    "image": "https://variety.com/wp-content/uploads/2025/12/MSDDIHA_EC007.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-18T22:36:04.000Z",
    "description": "\n\tMacaulay Culkin is Christmas movie royalty thanks to his iconic role as Kevin McCallister in 1990’s “Home Alone” and 1992’s “Home Alone 2: Lost in N",
    "body": "\n\tMacaulay Culkin is Christmas movie royalty thanks to his iconic role as Kevin McCallister in 1990’s “Home Alone” and 1992’s “Home Alone 2: Lost in New York,” so perhaps he’s as good authority as any when it comes to answering one of the internet’s most hotly-debated film questions: Is “Die Hard” a Christmas movie?\n\n\t“No, no it’s not. Don’t fight me!” Culkin recently answered during an interview with Mythical Kitchen. “It’s based around Christmas, but if it were also St. Patrick’s Day, it would still work. But you couldn’t do ‘Home Alone’ on Memorial Day. It doesn’t work that way.”\n\t\n\n\tCulkin then quipped: “I’m the godfather of Christmas nowadays. My opinion has some sway in this argument.”\n\n\n\tThe internet has been debating whether or not Bruce Willis’ 1988 action movie classic is a Christmas movie for years. “Elf” star Zooey Deschanel recently said on the “Call Her Daddy” podcast that “Die Hard” is her favorite Christmas movie. But Culkin is officially ruling the Christmas Eve-set “Die Hard” out of the running when it comes to Christmas movies. \n\n\tCulkin recently made headlines during his “A Nostalgic Night with Macaulay Culkin” tour when he said he “wouldn’t be completely allergic” to returning as Kevin McCallister in a new “Home Alone” sequel. Although he added, “It would have to be just right.” Fortunately, Culkin already has a pitch for a sequel that he would be interested in doing.\n\n\t“I kind of had this idea,” Culkin said. “I’m either a widower or a divorcee. I’m raising a kid and all that stuff. I’m working really hard and I’m not really paying enough attention and the kid is kind of getting miffed at me and then I get locked out. [Kevin’s son] won’t let me in… and he’s the one setting traps for me.”\n\t\n\n\t“Home Alone” and “Home Alone 2” director Chris Columbus told Entertainment Tonight in August that a new “Home Alone” movie should never be made.\n\n\t“I think ‘Home Alone’ really exists as, not at this timepiece, but it was this very special moment, and you can’t really recapture that,” Columbus said. “I think it’s a mistake to try to go back and recapture something we did 35 years ago. I think it should be left alone.”\n\n\tWatch Culkin’s full interview on Mythical Kitchen in the video below.\n\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Macaulay Culkin Says ‘Die Hard’ Is Not a Christmas Movie and ‘Don’t Fight Me’: The Film ‘Would Still Work’ If ‘It Were Also St. Patrick’s Day’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/MSDDIHA_EC007.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-18T22:36:04.000Z",
      "dateModified": "2025-12-18T22:36:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Oscar Predictions: Animated Feature — Is There Room for ‘Demon Slayer’ and Can ‘KPop Demon Hunters’ Defy BAFTA-Oscar History?",
    "url": "https://variety.com/lists/2026-oscars-best-animated-feature-predictions/",
    "image": "https://variety.com/wp-content/uploads/2025/09/demon-slayer-kimetsu.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-18T22:05:26.000Z",
    "description": "\n\t\t\n\n\t\n\tDec 18, 2025 2:05pm PT\t\n\t\n\n\t\n\tOscar Predictions: Animated Feature — Is There Room for ‘Demon Slayer’ and Can ‘KPop Demon Hunters’ Defy BAFTA-O",
    "body": "\n\t\t\n\n\t\n\tDec 18, 2025 2:05pm PT\t\n\t\n\n\t\n\tOscar Predictions: Animated Feature — Is There Room for ‘Demon Slayer’ and Can ‘KPop Demon Hunters’ Defy BAFTA-Oscar History?\n\t\n\n\n\n\t\t\t\n\t\t\t\n\t\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\tCrunchyroll\n\t\n\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\n\t\t\n\n\tVariety Awards Circuit section is the home for all awards news and related content throughout the year, featuring the following: the official predictions for the upcoming Oscars, Emmys, Grammys and Tony Awards ceremonies, curated by Variety chief awards editor Clayton Davis. The prediction pages reflect the current standings in the race and do not reflect personal preferences for any individual contender. As other formal (and informal) polls suggest, competitions are fluid and subject to change based on buzz and events. Predictions are updated every Thursday.\n\n\n\n\t\n\n\t\t\t\t\tKPOP DEMON HUNTERS \n\t\t\t\t\t\t\t\t\tNETFLIX\n\t\n\n\n\n\tOscars Best Animated Feature Commentary (Updated Dec. 18, 2025): Netflix’s “KPop Demon Hunters” has emerged as an Oscar frontrunner this season, but its path to the best animated feature trophy has a significant obstacle when the British Academy of Film and Television Arts ruled it ineligible for BAFTA consideration.\n\n\tThe decision hinges on BAFTA’s theatrical release requirements. While the organization’s rules allow for “exceptional circumstances” that permit films distributed through alternative models like event cinema, the Film Committee ultimately determined that “KPop Demon Hunters” didn’t qualify for such an exception.\n\n\tBAFTA snub aside, “KPop Demon Hunters” continues to dominate the cultural conversation. The film’s breakout track “Golden,” performed by K-pop sensation Huntr/x, recently secured three Grammy nominations, including the prestigious Song of the Year category. \n\n\tSince both institutions began recognizing animated features, every Oscar winner in the category has first earned at least a BAFTA nomination. This unbroken precedent raises a crucial question: Can “KPop Demon Hunters” become the first film to win the Academy Award without BAFTA validation?\n\n\tThat could present an uphill battle. BAFTA’s exclusion could provide oxygen for competing contenders, including Disney’s highly anticipated “Zootopia 2,” Neon’s critically acclaimed “Arco,” and GKids’ “Little Amélie or the Character of Rain.”\n\n\tAnd then there’s the wild card: Crunchyroll’s “Demon Slayer: Kimetsu no Yaiba Infinity Castle” secured an animation lineup spot at the Golden Globes, putting forth another test of the Academy’s longstanding reluctance to embrace anime. While the technical achievement and fanbase are undeniable, history hasn’t been kind to anime at the Oscars.\n\n\tWe’ll see where it lands in January.\n\n\tNOTE: All titles, release dates, studios and listed and credited producers and artisans are subject to change and are ultimately determined by the Academy.\n\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\n\nwindow.addEventListener(\"message\",function(a){if(void 0!==a.data[\"datawrapper-height\"]){var e=document.querySelectorAll(\"iframe\");for(var t in a.data[\"datawrapper-height\"])for(var r,i=0;r=e[i];i++)if(r.contentWindow===a.source){var d=a.data[\"datawrapper-height\"][t]+\"px\";r.style.height=d}}});\n\n\n\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Pixar\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\nwindow.addEventListener(\"message\",function(a){if(void 0!==a.data[\"datawrapper-height\"]){var e=document.querySelectorAll(\"iframe\");for(var t in a.data[\"datawrapper-height\"])for(var r,i=0;r=e[i];i++)if(r.contentWindow===a.source){var d=a.data[\"datawrapper-height\"][t]+\"px\";r.style.height=d}}});\n\n\n\t\t\n\t\t\t\n\t\t\t\n\tEligible Films (Animated Feature)\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: ©Walt Disney Co./Courtesy Evere\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\nwindow.addEventListener(\"message\",function(a){if(void 0!==a.data[\"datawrapper-height\"]){var e=document.querySelectorAll(\"iframe\");for(var t in a.data[\"datawrapper-height\"])for(var r,i=0;r=e[i];i++)if(r.contentWindow===a.source){var d=a.data[\"datawrapper-height\"][t]+\"px\";r.style.height=d}}});\n\n\n\t\t\n\t\n\t\n\n\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Oscar Predictions: Animated Feature — Is There Room for ‘Demon Slayer’ and Can ‘KPop Demon Hunters’ Defy BAFTA-Oscar History?",
      "image": [
        "https://variety.com/wp-content/uploads/2025/09/demon-slayer-kimetsu.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-18T22:05:26.000Z",
      "dateModified": "2025-12-18T22:05:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kristen Wiig on How That ‘Palm Royale’ Season 2 Twin Twist Was Inspired by ‘Bewitched’ and ‘I Dream of Jeannie’",
    "url": "https://variety.com/2025/tv/news/kristen-wiig-palm-royale-season-2-twin-1236611627/",
    "image": "https://variety.com/wp-content/uploads/2025/12/Kristen-Wiig-Palm-Royale-twin.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-18T21:30:00.000Z",
    "description": "\n\tSPOILER ALERT: This story contains spoilers from “Palm Royale,” Episode 6, “Maxine Finds Herself,” now streaming on Apple TV.\n\n\tJust when we think t",
    "body": "\n\tSPOILER ALERT: This story contains spoilers from “Palm Royale,” Episode 6, “Maxine Finds Herself,” now streaming on Apple TV.\n\n\tJust when we think that Kristen Wiig has done it all, the comedy gods at “Palm Royale” toss us a happy little surprise — they give her character of Maxine a twin sister. “Weirdly, it’s something I’ve always wanted to do,” Wiig says.\n\n\tWhen Maxine comes home to find a mirror image of herself passed out on a sofa in her foyer, she lets out a gasp and asks who she is. The bleary-eyed lookalike says, “I’m Mirabelle. Your sister.” Unaware that she had a sister, let alone a twin, Maxine rapid-fires questions to get to know her, everything from her favorite pasta shape to why she’s so drunk in the middle of the afternoon. Mirabelle says she usually doesn’t over indulge like this, “I was just a little nervous, you know, about meeting the famous Maxine.” Those are flattering words to Maxine’s ears, and she encourages her to go on. But what she learns about who raised Mirabelle hits her hard, although she tries her best to hide it.\n\t\n\n\tWhile the series of events that rolls out confuses some and results in an unfortunate case of mistaken identity, it titillates Douglas (Josh Lucas), who is clueless to the fact that the carefree woman who looks like Maxine, is not, in reality, Maxine at all.\n\n\tWiig says that when they were batting around ideas for the second season of the Apple TV series, a photo that production took during Season 1 of Wiig’s Maxine and Allison Janney’s Evelyn together, caught their eye.\n\t\n\n\n\n\t\n\n\t\t\t\t\tRicky Martin, Kristen Wiig, Amber Chardae Robinson in ‘Palm Royale’\n\t\n\n\n\n\t“We were like, ‘Oh my God, it’s Samantha from “Bewitched” and Endora!” Wiig says, referring to the classic TV sitcom of the 1960s and ‘70s that starred Elizabeth Montgomery as Samantha, a witch who marries a mortal man, Darrin, much to her haughty mother, Endora’s, chagrin. “And then we started thinking, ‘Oh my God. Well, Douglas is totally Darrin.’ It was hilarious. Then we were thinking of really embracing what the show is and like the bigness, the broadness, the farce of it all.”\n\n\tThe more they thought about it, the more they realized that other comedy series of that era — which is also the time period “Palm Royale” is set — had another thing in common, something that would be a fun turn to take in Maxine’s story. Samantha had a twin cousin named Serena (also played by Montgomery), on “I Dream of Jeannie,” Barbara Eden played dual characters of Jeannie and her twin sister who was only referred to as Jeannie II, and on “The Brady Bunch,” Peter (played by Christopher Knight) had a doppelgänger named Arthur.\n\n\t“[Creator/showrunner] Abe [Sylvia] was like, ‘What if Maxine has a twin?’ And I said, ‘Please!’” Wiig remembers. “I’ve always thought that would be so fun to do. And it just kind of fit in this weird world that is being created.”\n\n\tWiig’s two characters may look alike, but that’s where the similarities end. “Maxine figures out what she wants, and she goes and gets it. But she always wants something,” Wiig says with a laugh. “I think that is kind of relatable. These days, things being so available to us and how technology is such a big part of our life, we’re just used to getting things quickly. I think there’s something about Maxine seeing what other people have — that could go into like the whole social media of the world today — but it’s funny because she wants what other people have, but she’s also super comfortable and happy being herself. She doesn’t necessarily wanna change. She just wants stuff.”\n\n\tOn the flip side, Wiig doesn’t think Mirabelle is really motivated by money or status or things, the way Maxine is. “I think she’s got a lot of Maxine in her, obviously, but I think because she grew up where she did, and with their parents and not in an orphanage, she’s just has a totally different outlook on life,” Wiig says. “I think they share being very ambitious and doing what you need to do to get what you want. But I do think there’s like a sweetness in there that Mirabelle grew up with her parents being sort of con artists. She just had a harder upbringing than Maxine in a different way.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kristen Wiig on How That ‘Palm Royale’ Season 2 Twin Twist Was Inspired by ‘Bewitched’ and ‘I Dream of Jeannie’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/Kristen-Wiig-Palm-Royale-twin.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-18T21:30:00.000Z",
      "dateModified": "2025-12-18T21:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jelly Roll Receives Full Pardon in Tennessee for Past Crimes",
    "url": "https://variety.com/2025/music/news/jelly-roll-receives-full-pardon-tennessee-past-crimes-1236612198/",
    "image": "https://variety.com/wp-content/uploads/2025/12/IMG_5826.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-18T21:36:03.000Z",
    "description": "\n\tCountry music star Jelly Roll has been granted a full pardon from Governor Bill Lee in Tennessee for his past crimes.\n\n\tThe singer, whose real name ",
    "body": "\n\tCountry music star Jelly Roll has been granted a full pardon from Governor Bill Lee in Tennessee for his past crimes.\n\n\tThe singer, whose real name is Jason DeFord, was among 33 people who received pardons from Lee on Thursday, according to the Associated Press. The 41-year-old was convicted of robbery when he was 17 after he stole $350 from people in a home in 2002, which led to his arrest and a sentence of one year in prison plus probation. Later, in 2008, police discovered marijuana and crack cocaine in his car, leading to eight years of court-ordered supervision.\n\t\n\n\t“His story is remarkable, and it’s a redemptive, powerful story, which is what you look for and what you hope for,” Lee told reporters.\n\n\n\tJelly Roll, who began petitioning the Board of Parole last October, was hoping for a pardon to loosen the restrictions that came with his convictions. He said the pardon would allow him to travel internationally on tour and perform Christian missionary work without requiring paperwork. A pardon in Tennessee also allows for some civil rights to be restored, including the right to vote.\n\n\tThe Nashville native spent years discussing his redemption arc, speaking with prisoners and testifying to the U.S. Senate about the dangers of fentanyl and reflecting on his past drug-dealing persona as “the uneducated man in the kitchen playing chemist with drugs I knew absolutely nothing about.”\n\n\t“I was a part of the problem,” he said at the time. “I am here now standing as a man that wants to be a part of the solution.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jelly Roll Receives Full Pardon in Tennessee for Past Crimes",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/IMG_5826.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-18T21:36:03.000Z",
      "dateModified": "2025-12-18T21:36:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Oscar Predictions: Post-Shortlist Shake-Up as Studio Behemoths Rule and International Cinema Cracks the Door Wider",
    "url": "https://variety.com/lists/2026-oscars-predictions/",
    "image": "https://variety.com/wp-content/uploads/2025/12/Oscar-Predictions.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-18T22:40:00.000Z",
    "description": "\n\t\t\n\n\t\n\tDec 18, 2025 2:40pm PT\t\n\t\n\n\t\n\tOscar Predictions: Post-Shortlist Shake-Up as Studio Behemoths Rule and International Cinema Cracks the Door Wid",
    "body": "\n\t\t\n\n\t\n\tDec 18, 2025 2:40pm PT\t\n\t\n\n\t\n\tOscar Predictions: Post-Shortlist Shake-Up as Studio Behemoths Rule and International Cinema Cracks the Door Wider\n\t\n\n\n\n\t\t\t\n\t\t\t\n\t\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\tUniversal Pictures / Neon / Warner Bros.\n\t\n\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\n\t\t\n\n\tVariety Awards Circuit section is the home for all awards news and related content throughout the year, featuring the following: the official predictions for the upcoming Oscars, Emmys, Grammys and Tony Awards ceremonies, curated by Variety chief awards editor Clayton Davis. The prediction pages reflect the current standings in the race and do not reflect personal preferences for any individual contender. As other formal (and informal) polls suggest, competitions are fluid and subject to change based on buzz and events. Predictions are updated every Thursday.\n\n\n\n\t\n\n\t\t\t\t\t“Sentimental Value” (Neon)\n\t\n\n\n\n\tOscars Commentary (Updated: Dec. 18, 2025): This week’s Oscar shortlist announcements have crystallized what many suspected: Warner Bros.’ “One Battle After Another” and “Sinners,” along with Universal’s “Wicked: For Good” and Netflix’s “Frankenstein” are the technical juggernauts to beat.\n\n\tWhat’s particularly striking is the embrace of more international titles then we suspected — the inclusion of Brazil’s “The Secret Agent” and Spain’s “Sirât” in multiple technical categories signals that international cinema is competing for more spots other than “It Was Just an Accident” and “Sentimental Value.”\n\n\tThe debut of casting and cinematography shortlists has already produced its first casualty: Searchlight’s “The Testament of Ann Lee” was conspicuously shut out in both categories, in addition to music, a major blow to the campaign. However, Amanda Seyfried is still in contention with Globes and CCA under her belt, but the overall package is suddenly looking vulnerable. \n\n\tThe holidays are next week, and voters are gathering their luggages, and heading off to be with families, along with their usernames and passwords for the Academy Screening Room to catch up on the latest movies. \n\n\tAs we barrel toward the January 22 nominations announcement — and with the news YouTube is set to take over the ceremony starting in 2029 — this season feels like both an ending and a beginning of the old guard fighting to maintain relevance while a more global, technically adventurous slate pushes the Academy toward its future.\n\n\tThe first charts for animated feature have also published, in addition to the first projections of the three shorts categories below.\n\n\tTop 5 projected Oscar nomination leaders (films): “One Battle After Another” (13); “Sinners” (12); “Hamnet” (10); “Wicked: For Good” (9); “Sentimental Value” (7)\n\n\tTop 5 projected Oscar nomination leaders (studios): Warner Bros. (33); Neon (22); Netflix (13); Focus Features (11); Universal Pictures (9); A24 (7)\n\n\t*** = PREDICTED WINNER(All predicted nominees listed below are in alphabetical order)\n\n\n\t\t\t\n\t\t\t\n\tBest Picture\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: ©Warner Bros/Courtesy Everett C\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\t“F1” (Apple Original Films/Warner Bros.)“Frankenstein” (Netflix)“Hamnet” (Focus Features) “It Was Just an Accident” (Neon)“Marty Supreme” (A24)“One Battle After Another” (Warner Bros.) ***“Sentimental Value” (Neon)“Sinners” (Warner Bros.)“Train Dreams” (Netflix)“Wicked: For Good” (Universal Pictures)\n\n\tOscar category page with rankings>>>\n\n\t\t\n\t\t\t\n\t\t\t\n\tDirector\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Courtesy Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\tPaul Thomas Anderson ***“One Battle After Another” (Warner Bros.)Ryan Coogler“Sinners” (Warner Bros.)Oliver Laxe“Sirât” (Neon)Jafar Panahi“It Was Just an Accident” (Neon)Chloé Zhao“Hamnet” (Focus Features)\n\n\tOscar category page with rankings>>>\n\n\t\t\n\t\t\t\n\t\t\t\n\tActor\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: ©Sony Pictures/Courtesy Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\tTimothée Chalamet “Marty Supreme” (A24)Leonardo DiCaprio “One Battle After Another” (Warner Bros.)Ethan Hawke ***“Blue Moon” (Sony Pictures Classics)Michael B. Jordan“Sinners” (Warner Bros.)Wagner Moura “The Secret Agent” (Neon)\n\n\tOscar category page with rankings>>>\n\n\t\t\n\t\t\t\n\t\t\t\n\tActress\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Giles Keyte/Universal Pictures\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\tJessie Buckley ***“Hamnet” (Focus Features)Rose Byrne“If I Had Legs I’d Kick You” (A24)Cynthia Erivo“Wicked: For Good” (Universal Pictures)Chase Infiniti“One Battle After Another” (Warner Bros.)Renate Reinsve“Sentimental Value” (Neon)\n\n\tOscar category page with rankings>>>\n\n\t\t\n\t\t\t\n\t\t\t\n\tSupporting Actor\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Courtesy Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\tBenicio del Toro “One Battle After Another” (Warner Bros.)Paul Mescal“Hamnet” (Focus Features)Sean Penn “One Battle After Another” (Warner Bros.)Andrew Scott“Blue Moon” (Sony Pictures Classics)Stellan Skarsgård ***“Sentimental Value” (Neon)\n\n\tOscar category page with rankings>>>\n\n\t\t\n\t\t\t\n\t\t\t\n\tSupporting Actress\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Warner Bros. \t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\tElle Fanning“Sentimental Value” (Neon)Ariana Grande “Wicked: For Good” (Universal Pictures)Inga Ibsdotter Lilleaas ***“Sentimental Value” (Neon)Amy Madigan “Weapons” (Warner Bros.)Teyana Taylor“One Battle After Another” (Warner Bros.)\n\n\tOscar category page with rankings>>>\n\n\t\t\n\t\t\t\n\t\t\t\n\tOriginal Screenplay\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Courtesy Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\t“Blue Moon” (Sony Pictures Classics)Robert Kaplow“It Was Just an Accident” (Neon)Jafar Panahi“Marty Supreme” (A24)Ronald Bronstein and Josh Safdie“Sentimental Value” (Neon) Joachim Trier and Eskil Vogt“Sinners” (Warner Bros.) ***Ryan Coogler\n\n\tOscar category page with rankings>>>\n\n\t\t\n\t\t\t\n\t\t\t\n\tAdapted Screenplay\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Atsushi Nishijima/Focus Features\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\t“Bugonia” (Focus Features)Will Tracy“Frankenstein” (Netflix)Guillermo Del Toro“Hamnet” (Focus Features) Maggie O’Farrell and Chloé Zhao“One Battle After Another” (Warner Bros.)Paul Thomas Anderson“Train Dreams” (Netflix) ***Clint Bentley and Greg Kwedar\n\n\tOscar category page with rankings>>>\n\n\t\t\n\t\t\t\n\t\t\t\n\tCasting\n\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\n\n\t“Hamnet” (Focus Features)Nina Gold“The Secret Agent” (Neon) Gabriel Domingues“Sirât” (Neon) Nadia Acimi, Luis Bertolo and Erika Boulic“Sinners” (Warner Bros.) ***Francine Maisler“Weapons” (Warner Bros.)Allison Jones\n\n\tOscar category page with rankings>>>\n\n\t\t\n\t\t\t\n\t\t\t\n\tAnimated Feature\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: ©Sony Pictures/Courtesy Everett\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\t“Arco” (Neon)“Demon Slayer: Kimetsu no Yaiba Infinity Castle” (Crunchyroll)“KPop Demon Hunters” (Netflix) “Little Amélie or the Character of Rain” (GKids) “Zootopia 2” (Walt Disney Pictures) ***\n\n\tOscar category page with rankings>>>\n\n\t\t\n\t\t\t\n\t\t\t\n\tProduction Design\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Agata Grzybowska\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\t“Frankenstein” (Netflix) ***Tamara Deverell, Shane Vieau“Hamnet” (Focus Features)Fiona Crombie, Alice Felton“Marty Supreme” (A24)Jack Fisk, Adam Willis“Sinners” (Warner Bros.)Hannah Bleachler, Monique Champagne“Wicked: For Good” (Universal Pictures) Nathan Crowley, Lee Sandales\n\n\tOscar category page with rankings>>>\n\n\t\t\n\t\t\t\n\t\t\t\n\tCinematography\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Courtesy of Netflix\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\t“Hamnet” (Focus Features)Łukasz Żal“One Battle After Another” (Warner Bros.)Michael Bauman“Sinners” (Warner Bros.) ***Autumn Durald Arkapaw“Sirât” (Neon) Mauro Herce“Train Dreams” (Netflix)Adolpho Veloso\n\n\tOscar category page with rankings>>>\n\n\t\t\n\t\t\t\n\t\t\t\n\tCostume Design\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Courtesy of Netflix\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\t“Frankenstein” (Netflix)Kate Hawley“Hamnet” (Focus Features)Malgosia Turzanska“One Battle After Another” (Warner Bros.)Colleen Atwood“Sinners” (Warner Bros.)Ruth E. Carter“Wicked: For Good” (Universal Pictures) ***Paul Tazewell\n\n\tOscar category page with rankings>>>Coming Soon\n\n\t\t\n\t\t\t\n\t\t\t\n\tFilm Editing\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Neon\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\t“F1” (Apple Original Films/Warner Bros.)Stephen Mirrione“It Was Just an Accident” (Neon)Amir Etminan“Marty Supreme” (A24)Ronald Bronstein, Josh Safdie“One Battle After Another” (Warner Bros.) ***Andy Jurgensen“Sinners” (Warner Bros.)Michael P. Shawver\n\n\tOscar category page with rankings>>>Coming Soon\n\n\t\t\n\t\t\t\n\t\t\t\n\tMakeup and Hairstyling\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Marcel Zyskind\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\t“The Alto Knights” (Warner Bros.) Lori Hicks, Richard Redlefsen“Frankenstein” (Netflix) ***Cliona Furey, Mike Hill, Jordan Samuel“The Smashing Machine” (A24) Felix Fox, Kazu Hiro, Mia Neal“The Ugly Stepsister” (IFC) Thomas Foldberg, Anne Cathrine Sauerberg“Wicked: For Good” (Universal Pictures) Laura Blount, Mark Coulier, Frances Hannon\n\n\tOscar category page with rankings>>>Coming Soon\n\n\t\t\n\t\t\t\n\t\t\t\n\tSound\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Courtesy of Warner Bros. Picture\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\t“F1” (Apple Original Films/Warner Bros.)“One Battle After Another” (Warner Bros.) ***“Sinners” (Warner Bros.)“Sirât” (Neon)“Wicked: For Good” (Universal Pictures)\n\n\tOscar category page with rankings>>>\n\n\t\t\n\t\t\t\n\t\t\t\n\tVisual Effects\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: ©Walt Disney Co./Courtesy Evere\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\t“Avatar: Fire and Ash” (20th Century Studios) ***“F1” (Apple Original Films/Warner Bros.)“Superman” (Warner Bros.)“Tron: Ares” (20th Century Studios)“Wicked: For Good” (Universal Pictures)\n\n\tOscar category page with rankings>>>Coming Soon\n\n\t\t\n\t\t\t\n\t\t\t\n\tOriginal Score\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Warner Bros.\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\t“Frankenstein” (Netflix)Alexandre Desplat“Hamnet” (Focus Features)Max Richter“One Battle After Another” (Warner Bros.)Jonny Greenwood“Sinners” (Warner Bros.) ***Ludwig Göransson“Sirāt” (Neon) Kangding Ray\n\n\tOscar category page with rankings>>>\n\n\t\t\n\t\t\t\n\t\t\t\n\tOriginal Song\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: ©Apple TV/Courtesy Everett Coll\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\t“Come See Me in the Good Light” (Apple Original Films)“Salt Then Sour Then Sweet” by Sara Bareilles, Brandi Carlile and Andrea Gibson“Diane Warren: Relentless” (Greenwich Entertainment)“Dear Me” by Diane Warren“KPop Demon Hunters” (Netflix) ***“Golden” by EJAE and Mark Sonnenblick“Sinners” (Warner Bros.)“I Lied to You” by Ludwig Göransson and Raphael Saadiq“Wicked: For Good” (Universal Pictures)“The Girl in the Bubble” by Stephen Schwartz\n\n\tOscar category page with rankings>>>\n\n\t\t\n\t\t\t\n\t\t\t\n\tDocumentary Feature\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Brittany Shyne\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\t“The Alabama Solution” (HBO Documentary Films)Andrew Jarecki, Charlotte Kaufman, Page Marsella“Cutting Through Rocks” (Autlook Films)Mohammadreza Eyni, Sara Khaki“The Perfect Neighbor” (Netflix) ***Sam Bisbeem Geeta Gandbhir, Alisa Payne“Seeds” (Interior Films)Brittany Shyne, Sabrina Schmidt Gordon, Danielle Varga“2000 Meters to Andriivka” (PBS)Raney Aronson, Mstyslav Chernov, Michelle Mizner\n\n\tOscar category page with rankings>>>\n\n\t\t\n\t\t\t\n\t\t\t\n\tInternational Feature\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Courtesy Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\t“It Was Just an Accident” from France (Neon) ***dir. Jafar Panahi“The Secret Agent” from Brazil (Neon)dir. Kleber Mendonça Filho“Sentimental Value” from Norway (Neon) dir. Joachim Trier“Sirāt” from Spain (Neon)dir. Oliver Laxe“The Voice of Hind Rajab” from Tunisia (Willa)dir. Kaouther Ben Hania\n\n\tOscar category page with rankings>>>\n\n\t\t\n\t\t\t\n\t\t\t\n\tAnimated Short\n\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\n\n\t“Cardboard” (Locksmith Animation)  “Éiru” (GKids) ***“Hurikán” (AEON Production) “The Night Boots” (Am Stram Gram)“The Quinta’s Ghost” (Illusorium Films) \n\n\tOscar category page with rankings>>>Coming Soon\n\n\t\t\n\t\t\t\n\t\t\t\n\tDocumentary Short\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: ©Netflix/Courtesy Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\t“All the Empty Rooms” (Netflix) ***“All the Walls Came Down” (Interloper Films) “Armed Only with a Camera: The Life and Death of Brent Renaud” (HBO Documentary Films) “Chasing Time” (Exposure Labs)“The Devil is Busy” (HBO Documentary Films)\n\n\tOscar category page with rankings>>>Coming Soon\n\n\t\t\n\t\t\t\n\t\t\t\n\tLive Action Short\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: The New Yorker\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\t“The Boy with White Skin” (Manifest)“Extremist” (The New Yorker)“Rock, Paper, Scissors” (National Film and Television School)“The Singers” (Highway West Entertainment)“Two People Exchanging Saliva” (The New Yorker) ***\n\n\tOscar category page with rankings>>>Coming Soon\n\n\t\t\n\t\n\t\n\n\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Oscar Predictions: Post-Shortlist Shake-Up as Studio Behemoths Rule and International Cinema Cracks the Door Wider",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/Oscar-Predictions.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-18T22:40:00.000Z",
      "dateModified": "2025-12-18T22:40:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "TMZ Sports Streaming Live From Newsroom, Join The Conversation!",
    "url": "https://www.tmz.com/2025/12/18/tmz-sports-live-stream/",
    "image": "https://imagez.tmz.com/image/9c/16by9/2025/12/18/9c31aefe019a41daa7ab01fef1eb30f1_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-12-18T20:56:25.000Z",
    "description": "\n    \n                    \n                          TMZ Sports Live Stream\n                          Join The Conversation!!!\n                      \n",
    "body": "\n    \n                    \n                          TMZ Sports Live Stream\n                          Join The Conversation!!!\n                      \n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          TMZ Sports is going live from the newsroom to discuss the day's biggest stories ... but we don't just want folks to watch and enjoy the conversation, we want y'all to get involved!!\n      \n    \n          Hit the comment section as Babcock, Lucas, Mojo, Luca and the whole crew break down the most important topics of the day ... and we'll be interacting with viewers throughout the program between 1 and 2 PM PT.\n      \n    \n          YouTube, X, TikTok ... we're everywhere.\n      \n    \n          So tune in, make fun of us, share your two cents, sound off about your favorite team ... nothing is out of bounds.\n      \n    \n          Thursday's show will include the latest on Greg Biffle's tragic death, an expert's take on Jake Paul vs. Anthony Joshua, Kyrie Irving's beef with technology, and much more!!\n      \n      \n              \n          \n                          \n                Live Stream\n              \n                          \n                Streaming\n              \n                          \n                TMZ Sports\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "TMZ Sports Streaming Live From Newsroom, Join The Conversation!",
      "image": [
        "https://imagez.tmz.com/image/9c/16by9/2025/12/18/9c31aefe019a41daa7ab01fef1eb30f1_xl.jpg"
      ],
      "datePublished": "2025-12-18T20:56:25.000Z",
      "dateModified": "2025-12-18T20:56:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Influencer Ash Trevino Arrested on Felony Warrants in Texas, Released From Jail",
    "url": "https://www.tmz.com/2025/12/18/ash-trevino-arrested-texas-influencer/",
    "image": "https://imagez.tmz.com/image/1c/16by9/2025/12/18/1c6df36d06c549e39e7c467619e44e21_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-12-18T22:39:14.000Z",
    "description": "\n    \n                    \n                          Influencer Ash Trevino\n                          Busted In Texas On Felony Warrants\n             ",
    "body": "\n    \n                    \n                          Influencer Ash Trevino\n                          Busted In Texas On Felony Warrants\n                      \n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Social media star Ash Trevino got arrested in Texas on a couple felony charges.\n      \n    \n          The influencer was busted on Wednesday in Venus and booked into Ellis County Jail ... she's since been released on bond, and we've obtained her mugshot.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Ash -- government name Ashley Lopez-Trevino -- had \"active felony warrants\" out of the nearby Waxahachie Police Department ... Venus Police Department chief James Groom told PEOPLE.\n      \n\n          The content creator, who has more than 500K followers between Instagram and Snapchat, was reportedly arrested in her front yard at 7:50 PM Wednesday and taken into custody without incident.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          It's unclear what the felony warrants were for ... we're working on it.\n      \n    \n          On her way out of jail, Ash hopped on social media ... she laughed, vowed to fight the charges, and said she had legal representation, and was going to a casino.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Social Media\n              \n                          \n                Crime & Arrests\n              \n                          \n                Fairly Legal\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Influencer Ash Trevino Arrested on Felony Warrants in Texas, Released From Jail",
      "image": [
        "https://imagez.tmz.com/image/1c/16by9/2025/12/18/1c6df36d06c549e39e7c467619e44e21_xl.jpg"
      ],
      "datePublished": "2025-12-18T22:39:14.000Z",
      "dateModified": "2025-12-18T22:39:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Guess the Bday Babe Sippin' on Her Erewhon Smoothie!",
    "url": "https://www.tmz.com/2025/12/18/guess-sexy-singer-erewhon-smoothie-bday/",
    "image": "https://imagez.tmz.com/image/7f/16by9/2025/12/18/7f61ecdb053549c4acfbead7db2cfc76_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-12-18T21:31:49.000Z",
    "description": "\n    \n                    \n                          Guess The Bday Babe\n                          Sippin' On Her\n                          Erewhon Sm",
    "body": "\n    \n                    \n                          Guess The Bday Babe\n                          Sippin' On Her\n                          Erewhon Smoothie 🥤!\n                      \n      \n    \n      \n        \n              \n    \n    \n          Put down your bottles and pick up this genie posing with her Erewhon smoothie! Do you think you've got what it takes to sip up the sexy singer?!\n      \n    \n          This sultry swooner's been around since the '90s, and she's \"ain't no other!\" Catch her in Vegas for her live show ... or showin' off her stunning looks on socials!\n      \n    \n          Hit the gallery for the reveal!\n      \n      \n      \n          \n            \n              \n                \n                Share on Facebook\n              \n            \n            \n              \n                \n                Share on X\n              \n            \n                          \n                \n                  \n                \n              \n                      \n        \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Hotties & Bodies\n              \n                          \n                Hot Bodies\n              \n                          \n                Photo Galleries\n              \n                          \n                Music\n              \n                          \n                Famous Food\n              \n                      \n        \n          \n  ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Guess the Bday Babe Sippin' on Her Erewhon Smoothie!",
      "image": [
        "https://imagez.tmz.com/image/7f/16by9/2025/12/18/7f61ecdb053549c4acfbead7db2cfc76_xl.jpg"
      ],
      "datePublished": "2025-12-18T21:31:49.000Z",
      "dateModified": "2025-12-18T21:31:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "North Carolina Plane Crash Kills Multiple People on Board",
    "url": "https://www.tmz.com/2025/12/18/plane-crash-statesville-north-carolina/",
    "image": "https://imagez.tmz.com/image/8c/16by9/2025/12/18/8c532101d4574df5aed0049c632b8a28_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-12-18T17:03:08.000Z",
    "description": "\n    \n                    \n                          North Carolina\n                          Multiple Dead in Fiery Plane Crash\n                     ",
    "body": "\n    \n                    \n                          North Carolina\n                          Multiple Dead in Fiery Plane Crash\n                          ... Ex-NASCAR Driver Greg Biffle Company-Owned Jet\n                      \n                  \n                                                                        Published \n                              \n                December 18, 2025\n                \n                            9:03 AM PST\n                                                                      |\n                                                                Updated \n                                  December 18, 2025\n                                11:53 AM PST\n                                    \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          A private jet reportedly crashed in North Carolina Thursday morning, leaving multiple people dead.\n      \n    \n          According to local news station WBTV, the plane -- a Cessna C550 -- exploded in a massive fireball after crashing at Statesville Regional Airport, about 50 miles north of Charlotte.\n      \n    \n          The FAA confirmed the plane went down while attempting to land at approximately 10:20 AM ET.\n      \n    \n          Business records indicate the jet was owned by a company affiliated with retired NASCAR driver Greg Biffle, WBTV reports. Local news outlets are reporting Biffle and his wife died in the crash, citing social media posts from a colleague and from one of his brands ... TMZ is working to confirm.\n      \n    \n      \n      Breaking: Multiple deaths after a plane crash at Statesville Regional Airport in North Carolina. WSOC, a local news channel, reports that NASCAR driver Greg Biffle owns the plane, although it is unclear if he was on board. pic.twitter.com/nzZMhSg1Tm— PM Breaking News (@PMBreakingNews) December 18, 2025\n              @PMBreakingNews\n          \n  \n\n          Six people were on the plane, according to the FAA ... local law enforcement confirmed to WBTV that more than one person was killed.\n      \n    \n          FlightAware reports the plane was in the air for 26 minutes … the plane never climbed above 2,000 feet, reaching a top speed of 262 mph.\n      \n    \n          According to the city of Statesville's website, the airport provides aviation facilities to several NASCAR teams.\n      \n    \n          The FAA and the NTSB are investigating the crash.\n      \n    \n          Story developing ...\n      \n      \n              \n          \n                          \n                Plane Crash\n              \n                          \n                TMZ Sports\n              \n                          \n                News\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "North Carolina Plane Crash Kills Multiple People on Board",
      "image": [
        "https://imagez.tmz.com/image/8c/16by9/2025/12/18/8c532101d4574df5aed0049c632b8a28_xl.jpg"
      ],
      "datePublished": "2025-12-18T17:03:08.000Z",
      "dateModified": "2025-12-18T17:03:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bud Crawford Sued by Jeweler Over Allegedly Blowing Off Deal To Promote Shop",
    "url": "https://www.tmz.com/2025/12/18/terence-bud-crawford-lawsuit-mazza-new-york-jeweler/",
    "image": "https://imagez.tmz.com/image/08/16by9/2025/12/18/086b0ff2686c451281c715edbccf51ff_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-12-19T00:10:55.000Z",
    "description": "\n    \n                    \n                          Terence Crawford\n                          Sued By Jeweler ...\n                          You Lied",
    "body": "\n    \n                    \n                          Terence Crawford\n                          Sued By Jeweler ...\n                          You Lied About Promoting My Shop!\n                      \n                  \n                                                                        Published \n                              December 18, 2025\n                            4:10 PM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Terence Crawford hasn't been retired for a full week, but he's already got another fight on his hands -- albeit a legal one -- 'cause the legendary boxer has been sued by a prominent jeweler who claims Bud lied to him and screwed him over.\n      \n    \n          In the lawsuit, filed on December 18 and obtained by TMZ Sports, 38-year-old Crawford is accused of hitting up Mazza New York in February 2024 for several custom pendants for him and his team (we previously reported when Bud copped 'em).\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          According to Mazza, Crawford became interested in a $139k Patek Philippe Aquanaut watch while in the store, but rather than buying it flat out, Mazza claims Bud suggested he pay $35k, and then would cover the rest by promoting the jewelry store on his trunks during a fight.\n      \n    \n          Mazza says he agreed, however, when Crawford's August 2024 fight against Israil Madrimov rolled around, the jeweler claims the logo \"had completely fallen off\" by the 4th round.\n      \n\n          Mazza claims that Crawford and his representatives acknowledged that they did not fulfill the agreement and promised to make it up in the next fight, which was against Canelo Alvarez.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          The jeweler says he delivered a patch with his logo to Bud's rep before the September 13 mega-fight, but says he was ultimately told the \"logo would not appear on Crawford’s shorts during the Alvarez fight.\"\n      \n    \n          Mazza says he wasn't given \"any reason or explanation for this sudden and unexpected change\" regarding the patch on Terence's shorts.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          By allegedly blowing off the agreement, Mazza says his business was deprived of an opportunity to elevate his brand, claiming he missed out on an estimated $1.5 million worth of promotion.\n      \n    \n          And, that's exactly what Mazza is looking for, at a minimum, in addition to other damages.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Terence Crawford\n              \n                          \n                Canelo Alvarez\n              \n                          \n                Celebrity News\n              \n                          \n                Boxing\n              \n                          \n                TMZ Sports\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bud Crawford Sued by Jeweler Over Allegedly Blowing Off Deal To Promote Shop",
      "image": [
        "https://imagez.tmz.com/image/08/16by9/2025/12/18/086b0ff2686c451281c715edbccf51ff_xl.jpg"
      ],
      "datePublished": "2025-12-19T00:10:55.000Z",
      "dateModified": "2025-12-19T00:10:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]