[
  {
    "title": "David Letterman Says He’s ‘Never Been More Proud’ of Seth Meyers Amid Trump’s Calls to Fire Late-Night Host: The President Is ‘Our Dictator’ and It’s a ‘Wonder of Idiocy’",
    "url": "https://variety.com/2025/tv/news/david-letterman-proud-seth-meyers-trump-calls-fire-host-1236592578/",
    "image": "https://variety.com/wp-content/uploads/2025/11/seth-david.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-26T11:57:41.000Z",
    "description": "\n\tDavid Letterman is standing behind his “good friend” Seth Meyers amid President Donald Trump‘s calls to fire the late-night host. \n\n\tAfter being the",
    "body": "\n\tDavid Letterman is standing behind his “good friend” Seth Meyers amid President Donald Trump‘s calls to fire the late-night host. \n\n\tAfter being the subject of Meyers’ recent monologue roasts on “Late Night With Seth Meyers,” Trump wrote in a Truth Social post last week (which was reposted by FCC chair Brendan Carr): “NBC’s Seth Meyers is suffering from an incurable case of Trump Derangement Syndrome (TDS). He was viewed last night in an uncontrollable rage, likely due to the fact that his ‘show’ is a Ratings DISASTER. Aside from everything else, Meyers has no talent, and NBC should fire him, IMMEDIATELY!”\n\t\n\n\tIn a new episode of “The Barbara Gaines Show,” late-night veteran Letterman — who hosted NBC’s “Late Night” from 1982 to 1993 before taking over CBS’ “The Late Show” until 2015 — came to Meyers’ defense. “I’ve never been more proud of Seth Meyers,” he said. “That’s our old show, as a matter of fact. Yeah, we used to do that show, and he does a magical job.”\n\n\n\tLetterman then referenced Trump’s response to a reporter’s question last week about the 2018 killing of journalist Jamal Khashoggi in Saudi Arabia, saying: “But just remember Seth, things happen. You know what I’m saying?”\n\n\tLater in the episode, Letterman called Trump’s administration “just a wonder of idiocy” and said the president is “our dictator” and is “not going anywhere.”\n\n\t“It’s like 18 times the worst behavior one has witnessed ever anywhere,” Letterman added of Trump. “Think of the worst thing that you’ve ever seen humans accomplish. This is so much worse.”\n\n\tMeyers seems to be Trump’s latest late-night target, after repeated social media attacks on Jimmy Kimmel and Stephen Colbert. Kimmel’s show was suspended in September following pressure from the FCC after his comments about the killing of Charlie Kirk, but returned a week later. Colbert’s “The Late Show” is coming to an end in May 2026, though CBS has insisted it was a “purely financial decision” and not politically motivated. \n\t\n\n\tWatch a clip from “The Barbara Gaines Show” below.\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "David Letterman Says He’s ‘Never Been More Proud’ of Seth Meyers Amid Trump’s Calls to Fire Late-Night Host: The President Is ‘Our Dictator’ and It’s a ‘Wonder of Idiocy’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/seth-david.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-26T11:57:41.000Z",
      "dateModified": "2025-11-26T11:57:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Simu Liu Says the ‘Backslide’ of Asian Representation in Hollywood Is ‘F—ing Appalling’: ‘Studios Think We Are Risky’",
    "url": "https://variety.com/2025/film/news/simu-liu-backslide-asian-representation-hollywood-appalling-1236592508/",
    "image": "https://variety.com/wp-content/uploads/2025/11/GettyImages-2246612442.jpg?crop=0px%2C141px%2C5537px%2C3114px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-11-26T05:49:54.000Z",
    "description": "\n\tSimu Liu took to Threads on Sunday to post a fiery message about the “backslide” of Asian representation in Hollywood. In the post, he included soci",
    "body": "\n\tSimu Liu took to Threads on Sunday to post a fiery message about the “backslide” of Asian representation in Hollywood. In the post, he included social media reports about Asian actors struggling to find fulfilling roles.\n\n\t“Put some Asians in literally anything right now,” he wrote. “The amount of backslide in our representation onscreen is fucking appalling. Studios think we are risky.”\n\n\n\tDespite this perceived risk, Liu listed several films starring Asian actors that were critical successes, including “Minari,” “Farewell,” “Past Lives,” “Everything Everywhere All At Once,” “Crazy Rich Asians” and his Marvel tentpole “Shang-Chi and the Legend of the Ten Rings.”\n\t\n\n\tHe added, “Every single one a financial success. No Asian actor has ever lost a studio even close to 100 million dollars but a white dude will lose 200 million TWICE and roll right into the next tentpole lead.We’re fighting a deeply prejudiced system. And most days it SUCKS.”\n\n\tLiu has a history of being vocal on social media, especially when it comes to speaking out against right-leaning politics. He told Variety in a recent interview that he “should probably be more scared” of backlash, but his appetite to speak his mind and stand up for what he believes often overcomes his fears.\n\n\t“I just feel like there’s something about the internet that makes people just crazy,” Liu said. “There’s something about the publicness of it and where people love being the guy to put someone else down [or] put an entire group of people down. I am so not for that energy.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Simu Liu Says the ‘Backslide’ of Asian Representation in Hollywood Is ‘F—ing Appalling’: ‘Studios Think We Are Risky’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/GettyImages-2246612442.jpg?crop=0px%2C141px%2C5537px%2C3114px&resize=1000%2C563"
      ],
      "datePublished": "2025-11-26T05:49:54.000Z",
      "dateModified": "2025-11-26T05:49:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘The Mother of All Lies’ Director Asmae El Moudir Prepares Follow-Up ‘Don’t Let the Sun Go Up on Me’ With Autlook Filmsales (EXCLUSIVE)",
    "url": "https://variety.com/2025/film/global/mother-of-all-lies-asmae-el-moudir-marrakech-atlas-1236591486/",
    "image": "https://variety.com/wp-content/uploads/2025/11/MixCollage-25-Nov-2025-09-52-AM-8673.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-26T10:34:21.000Z",
    "description": "\n\tAutlook Filmsales has boarded “Don’t Let the Sun Go Up on Me,” a hybrid documentary from trailblazing Moroccan filmmaker Asmae El Moudir, whose “The",
    "body": "\n\tAutlook Filmsales has boarded “Don’t Let the Sun Go Up on Me,” a hybrid documentary from trailblazing Moroccan filmmaker Asmae El Moudir, whose “The Mother of All Lies” won Cannes’ best documentary award, as well as the Un Certain Regard directing prize. Currently in production, the project will screen as a work-in-progress at the Marrakech Film Festival’s Atlas Workshops next week.\n\n\tBlending extensive family archives with striking and surreal location work, the film retraces the life of Fatimazahra, a young woman born with a rare genetic disorder that made exposure to sunlight deadly. She lived a parallel, nocturnal existence and founded a community known as the Children of the Moon. Following her death in 2023, the group traveled to Norway’s Lofoten Islands to live beneath the polar night, seeking a world where darkness offers safety. \n\t\n\n\t“We’re talking about a rare disease with a very strong antagonist: the sun,” says El Moudir. “What normally represents joy becomes a source of danger. For this community, light can kill. In that sense, the project is like a vampire film made real. We’re exploring how this hidden community lives among us — a community most people don’t even know exists — but I don’t want to portray them as victims.” \n\n\n\t“I’m always looking to find fantasy in reality,” she continues. “What is real for some is science fiction for others. I explore romantic relationships between people who live in a world that, for you and me, looks like science fiction. They go out wearing astronaut helmets, day or night, yet for them, this is normal life. How do they see each other? How do they form love and connection within this community after the death of their leader, Fatimazahra?” \n\t\n\n\tEl Moudir also produces alongside Emma Lepers of Haut et Court Doc and Monica Hellström of Ström Pictures. Delivery is slated for 2027.\n\n\t“After our first collaboration on ‘The Mother of All Lies,’ continuing our partnership with Asmae felt completely natural,” says Autlook Filmsales CEO Stephanie Fuchs. “From our earliest conversations, it was clear she was embarking on another bold and visually striking project, bringing young adults to the forefront who have been hidden away from society for most of their lives. With producer Emma Lepers and co-producer Monica Hellström on board, it’s truly a dream setup, and we can’t wait to see Asmae’s unique vision unfold — one we’re certain buyers and festivals will be just as eager to discover.” \n\n\tEl Moudir ushered “The Mother of All Lies” through the Atlas Workshops, first participating as a development project in 2019 before winning the top post-production prize in 2021. As well as its Cannes haul, the hybrid documentary won best film at the Sydney Film Festival and more than 30 international prizes, before making history as the first Moroccan film to win Marrakech’s prestigious Étoile d’Or. The film was also shortlisted in the international features section of the Oscars in 2024.\n\n\t“Asmae began that film without a producer,” says Marrakech artistic director Rémi Bonhomme. “She has become an emblematic figure in Morocco because she truly paved the way for a new generation of filmmakers, showing them what is possible. We created the Atlas program to support very young filmmakers who are not yet at the stage where they can present their projects on the international market, but who need guidance at the earliest steps of development and a better understanding of how the industry functions. ‘The Mother of All Lies’ became a turning point, opening doors for filmmakers and producers who previously felt excluded from the possibility of creating films capable of such global reach.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘The Mother of All Lies’ Director Asmae El Moudir Prepares Follow-Up ‘Don’t Let the Sun Go Up on Me’ With Autlook Filmsales (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/MixCollage-25-Nov-2025-09-52-AM-8673.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-26T10:34:21.000Z",
      "dateModified": "2025-11-26T10:34:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "James Bond to Batman: Oscar Winner Chris Corbould Breaks Down the Art of Practical Spectacle at International Film Festival of India",
    "url": "https://variety.com/2025/film/festivals/james-bond-batman-oscar-winner-chris-corbould-sfx-iffi-1236592474/",
    "image": "https://variety.com/wp-content/uploads/2025/11/Ravi-Kottarakka-Chris-Courbould.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-26T04:15:18.000Z",
    "description": "\n\tAt the International Film Festival of India, Oscar-winning special effects supervisor Chris Corbould pulled back the curtain on four decades of big-",
    "body": "\n\tAt the International Film Festival of India, Oscar-winning special effects supervisor Chris Corbould pulled back the curtain on four decades of big-screen engineering — from tank chases and truck flips to collapsing houses and controlled explosions — insisting that the emotional power of spectacle still hinges on what can be achieved physically, not digitally. \n\n\tSpeaking at a masterclass moderated by Variety’s Naman Ramachandran, Corbould revisited his work on the James Bond and Christopher Nolan films and stressed that his guiding rule remains unchanged: do as much as possible in camera, and let technology support the story rather than overwhelm it.\n\t\n\n\tThe discussion was replete with anecdotes and movie clips that spanned some of cinema’s most ambitious practical stunts. Corbould, who won an Oscar award for best visual effects for “Inception,” explained that his philosophy has remained consistent throughout his career. Even as digital tools have evolved, he insisted that the strongest results come from collaboration, not replacement. “Digital is a fantastic tool,” he said, “but the minute you rely on it for everything, you start losing the emotional connection.”\n\n\n\tCorbould described his first step on any project as reading the script and asking how he can push originality. Sometimes this results in radical rethinking. Having worked on 15 Bond movies, he cited examples for a few including “GoldenEye”, recounting how a routine motorbike chase was transformed into the now-iconic tank sequence when Corbould proposed an out-of-the-box idea. Speaking about “No Time To Die”, he recalled scaling back an early version of the car chase because it threatened to overshadow the emotional tension between Bond and Madeleine: “What I learned over the years is, don’t get people going into a film just to see a spectacular effect. Everything should dovetail together – the actors, the storyline, the locations. That’s a complete film, not just me blowing something up.”\n\t\n\n\tChristopher Nolan’s influence loomed large over the discussion. Their long-running collaboration is anchored in a shared belief that digital effects should be used only when the physical is impossible. This mindset led to some of the most daring sequences in modern cinema, including the revolving corridor in “Inception” and the real-life truck flip in “The Dark Knight.” Corbould admitted he initially doubted whether the truck flip could be achieved safely, but Nolan refused any digital workaround. “He pushes you to your absolute limits,” Corbould said.\n\n\tMany of Corbould’s achievements border on engineering feats. The sinking house in “Casino Royale” required a huge interior set capable of tilting and descending into a massive tank, paired with a detailed miniature for exterior shots.\n\n\tHe also dispelled the myth that he enjoys blowing things up. Explosions, he noted, are the most stressful element of his job. He only relaxes once they’re finished. The record-breaking desert blast in “Spectre” – a single-take, practical effect stunt conducted in Morocco – “was never intended to be a world record” he said, but it was a shot that needed to look right.\n\n\tBeneath the spectacle, Corbould emphasised the countless hours of planning and safety checks that underpin every stunt, because the comfort and safety of actors and stuntmen is paramount. “The safety of the stunt driver and stunt people is totally non-negotiable,” he said.\n\n\tLooking toward the future, Corbould said of emerging AI tools that, just as digital effects once did, he believes they will find their place. “I hope directors keep valuing the physical craft,” he said. “Chris Nolan is the perfect example of that.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "James Bond to Batman: Oscar Winner Chris Corbould Breaks Down the Art of Practical Spectacle at International Film Festival of India",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/Ravi-Kottarakka-Chris-Courbould.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-26T04:15:18.000Z",
      "dateModified": "2025-11-26T04:15:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Turkish Auteur Nuri Bilge Ceylan Sparks Backlash for Reportedly Planning to Attend Government-Run Iranian Film Festival",
    "url": "https://variety.com/2025/film/global/nuri-bilge-ceylan-backlash-attending-iran-government-run-fest-1236591717/",
    "image": "https://variety.com/wp-content/uploads/2025/11/Nuri-Bilge-Ceylan.jpg?crop=0px%2C41px%2C1000px%2C562px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-11-26T10:42:35.000Z",
    "description": "\n\tTurkish auteur Nuri Bilge Ceylan, winner of the Cannes Palme d’Or in 2014 for “Winter Sleep” among many other accolades, has come under fire from th",
    "body": "\n\tTurkish auteur Nuri Bilge Ceylan, winner of the Cannes Palme d’Or in 2014 for “Winter Sleep” among many other accolades, has come under fire from the Iranian Independent Filmmakers Association (IIFMA) for allegedly accepting to attend Iran’s government-run Fajr Film Festival.\n\n\tThe Fajr Film Festival, which is Iran’s top film event, is set to run in the southwestern city of Shiraz from Nov. 26 to Dec. 3 and will showcase 45 films selected from 30 countries, according to the Islamic Republic News Agency.\n\t\n\n\tThe festival’s website said Bilge Ceylan will attend as a special guest, while several official Iranian and Turkish news outlets reported that the director is serving as president of the festival’s jury.\n\n\n\tBilge Ceylan — whose works besides “Winter Kills” also comprise “Three Monkeys” (2008), “Once Upon a Time in Anatolia” (2011), “The Wild Pear Tree” (2018) and, more recently, “About Dry Grasses” (2023) — did not immediately respond to Variety‘s request for comment.\n\n\tIran’s government-controlled Tehran Times newspaper reported in October that Bilge Ceylan was in Tehran to hold a series of masterclasses at a government-sponsored event called “The Glory of Cinema.”\n\n\t“The news of your collaboration with the Fajr Film Festival in Iran under the rule of the Islamic Republic has caused astonishment and distress among those who have followed your work for years with a close eye on its humanistic and intellectual world view,” IIFMA said in an open letter to Blige Ceylan issued on Tuesday.\n\n\tIIFMA — which is headed by Dubai-based dissident Iranian producer Kaveh Farnam — asked the Turkish director to reconsider his involvement with the Fajr Film Festival, claiming his participation “effectively strengthens the images the government seeks to present of the country’s cultural situation — images that do not align with the actual experiences of those facing censorship, repression and constraint.”\n\t\n\n\tThe current climate for filmmakers in Iran, amid political turmoil, involves strict state controls, censorship and the risk of imprisonment, as evidenced by the plights of prominent Iranian directors Jafar Panahi (“It Was Just an Accident”) and Mohammad Rasoulof (“The Seed of the Sacred Fig”), both of whom have spent time behind bars for making movies deemed to be against the Iranian regime.\n\n\tThe IIFMA open letter noted that recently Iranian security forces have killed hundreds of dissident protesters in various crackdowns, most notably during the nationwide “Woman, Life, Freedom” movement in 2022-2023.\n\n\t“After the widespread suppression of public protests during the ‘Woman, Life, Freedom’ movement, the Islamic Republic has tried to normalize everything by holding state-organized events and ceremonies,” IIFMA went on to point out. “Among these, the Fajr Film Festival has been one of the most important showcases for this effort, a showcase that today holds little significance for a large portion of the Iranian artistic community.”\n\n\tThe IIFMA added: “For this reason, the presence of the name of an international filmmaker with your artistic reputation and intellectual orientation in this festival amounts only to a misuse of your prestige for this propaganda display.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Turkish Auteur Nuri Bilge Ceylan Sparks Backlash for Reportedly Planning to Attend Government-Run Iranian Film Festival",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/Nuri-Bilge-Ceylan.jpg?crop=0px%2C41px%2C1000px%2C562px&resize=1000%2C563"
      ],
      "datePublished": "2025-11-26T10:42:35.000Z",
      "dateModified": "2025-11-26T10:42:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ciarán Hinds Boards Short Film ‘Three Keenings’ as Exec Producer (EXCLUSIVE)",
    "url": "https://variety.com/2025/film/global/ciaran-hinds-three-keenings-short-exec-producer-1236592554/",
    "image": "https://variety.com/wp-content/uploads/2025/11/CH-Headshot-Misan-Harriman86-1.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-26T10:01:30.000Z",
    "description": "\n\tCiarán Hinds, the Oscar and BAFTA nominated Northern Irish actor and star of films including “Belfast” and “Tinker Tailor Soldier Spy,” has joined O",
    "body": "\n\tCiarán Hinds, the Oscar and BAFTA nominated Northern Irish actor and star of films including “Belfast” and “Tinker Tailor Soldier Spy,” has joined Oscar-qualifying short film “Three Keenings” as executive producer.\n\n\tThe debut short from Oliver McGoldrick, “Three Keenings” is described as a “darkly lyrical exploration of grief, performance, and the forgotten rituals of mourning.” It premiered in the Orizzonti Short Film competition of the 2024 Venice Film Festival, and officially qualified for the 2026 Academy Awards after winning the Tiernan McBride Award for best short drama at the Galway Film Fleadh.\n\t\n\n\tHinds joins fellow exec producers Bill & Kumi Martin and IFTA-winning actor Barry Ward (“That They May Face The Rising Sun,” “Bad Sisters”). \n\n\n\tSet across the rural funeral circuit of Northern Ireland, the film follows a struggling actor who takes on the role of a professional mourner. As he moves from wake to wake offering grief as a paid performance, the emotional distance he clings to begins to unravel. The film centers on the nearly-forgotten Gaelic-Celtic tradition of “Keening,” the historic practice of hired lament, but reframed through a modern lens.\n\n\tLed by BAFTA-winning actor Seamus O’Hara (“House of Guinness,” “An Irish Goodbye”), the film also features an ensemble of Northern Irish talent, including Ciarán Hinds’ sister Caitriona Hinds, plus Sean Kearns, Carol Moore, Niall Cusack, and Olivia Nash. \n\n\t“’Three Keenings’ is a beautifully structured, succinctly told and terrifically shot short film by Oliver McGoldrick about a professional grieving service for funerals in Ireland — wry and very witty, it’s a perfectly balanced mixture of humour and pathos, with a bang-on central performance by Seamus O’Hara.”\n\t\n\n\tAdded Ward: “For me, this is a remarkable short film full of warmth, humanity, and a disarming mix of humour and pathos. It’s an impressively assured piece of work, far beyond the filmmakers’ years, and I’m genuinely excited to see what this team creates next.”\n\n\tSaid McGoldrick: “I’m thrilled to have Ciarán and Barry come on board as executive producers. Their presence in the Irish creative landscape is of great importance and having grown up with their work, it is an inspiration to me that they have forged a career working with some of the defining filmmakers of our time.”\n\n\t“Three Keenings” was developed through the NYU Tisch program in collaboration with a global creative team, including Swiss cinematographer Gianna Badiali, production designer Marianne Auvinet-Gould (UK/France), and producers Natalie Remplakowski (Canada/USA), Chloe Langton (Northern Ireland), and Cade Featherstone (UK). The film has been acquired by Canal+ and is currently featured on Aer Lingus flights.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ciarán Hinds Boards Short Film ‘Three Keenings’ as Exec Producer (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/CH-Headshot-Misan-Harriman86-1.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-26T10:01:30.000Z",
      "dateModified": "2025-11-26T10:01:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Alien: Earth’ Star Adarsh Gourav to Lead ‘Gangster on the Run’ for ‘Paatal Lok’ Director Prosit Roy (EXCLUSIVE)",
    "url": "https://variety.com/2025/film/news/alien-earth-adarsh-gourav-gangster-on-the-run-1236592282/",
    "image": "https://variety.com/wp-content/uploads/2025/11/Adarsh-Gourav1.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-26T09:00:00.000Z",
    "description": "\n\tAdarsh Gourav, the BAFTA-nominated star of “The White Tiger” and “Alien: Earth” is set to headline “Gangster on the Run,” a feature adaptation of Pu",
    "body": "\n\tAdarsh Gourav, the BAFTA-nominated star of “The White Tiger” and “Alien: Earth” is set to headline “Gangster on the Run,” a feature adaptation of Puja Changoiwala’s nonfiction book that charts the remarkable transformation of a Mumbai gangster into a marathon-running social worker.\n\n\tProsit Roy, who won the Filmfare Award for best director (series) for Prime Video’s “Paatal Lok,” will direct from a screenplay by frequent collaborator Abhishek Banerjee, whose credits include “Pari,” “Paatal Lok” Season 2 and the upcoming Indian cricketer Jhulan Goswami biopic.\n\t\n\n\tThe project, which was unveiled at the WAVES Film Bazaar, the market component of the International Film Festival of India (IFFI), Goa, is being developed as a prestige global true-crime drama, with producers actively seeking an international co-production partner. Lead producer Sidharth Jain will meet potential collaborators at Content London in early December.\n\n\n\tGourav will portray Rahul Jadhav, once one of Mumbai’s most feared sharpshooters whose journey through violence, addiction and the criminal underworld gave way to an unlikely path of self-reflection and rehabilitation. Today, Jadhav works as a marathon runner and social worker, helping at-risk youth avoid the violent trajectory he once followed.\n\n\t“Rahul is one of the most layered, demanding characters I’ve encountered — someone shaped by violence yet capable of profound transformation,” Gourav said. “It’s the kind of role that forces you to dig deep as an actor, and I’m thrilled to collaborate with Prosit on a story this raw and universal.”\n\t\n\n\tRoy added: “Rahul’s story has the emotional power, complexity and cinematic tension that translates anywhere in the world. It’s a gritty, human tale that blends redemption, identity and consequence.”\n\n\tThe film is produced by Jain, Kanchan Marathe and Rohit Vedprakash, with partial financing from Filmoney Ink, a soon-to-launch Dubai-based fund focused on theatrical Indian genre films and international projects designed for global audiences.\n\n\tJain, founder of The Story Ink, has overseen more than 250 book-to-screen deals and produced Netflix’s award-winning series “Trial by Fire.” Marathe, a former Netflix and Viacom18 creative executive, has been involved with acclaimed titles including “Andhadhun,” “Jamtara” and “Scoop.” Vedprakash, formerly director of original content at Netflix India, has credits including “Mismatched,” “Khakee,” “The Fame Game” and “Kohhra.”\n\n\t“With Prosit and Adarsh coming together, the film has both artistic muscle and international reach,” Jain said. “And with early financing from Filmoney Ink, we’re positioned strongly as we take the project to the global market.”\n\n\tMarathe emphasized the adaptation’s global crime-thriller sensibility, calling it “a powerful, character-led narrative — the kind that resonates far beyond its geography.”\n\n\tVedprakash added that the director-actor pairing and source material position the film “to travel — creatively, commercially and culturally.”\n\n\tFilmoney Ink is a U.A.E.-based fund and IP management company backed by ultra-high-net-worth non-resident Indians across the UAE and U.K. The fund invests in Indian genre and horror films alongside select international titles, leveraging subsidy-driven cost efficiencies and IP ownership as part of its investment strategy.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Alien: Earth’ Star Adarsh Gourav to Lead ‘Gangster on the Run’ for ‘Paatal Lok’ Director Prosit Roy (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/Adarsh-Gourav1.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-26T09:00:00.000Z",
      "dateModified": "2025-11-26T09:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Serielizados Attendance Surges 80% as the Barcelona TV Fest’s Pro Congress Nails the Parlous State of the International TV Industry ",
    "url": "https://variety.com/2025/tv/global/serializados-arte-france-movistar-plus-bbc-studios-filmin-1236592548/",
    "image": "https://variety.com/wp-content/uploads/2025/11/Killing-a-Bear-Eduard-Fernandez-.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-26T09:38:10.000Z",
    "description": "\n\tThe numbers are in. Serielizados, the vibrant Barcelona on site/online TV festival saw in-person attendees soar 80% to 16,000 over Nov. 3-12. Runnin",
    "body": "\n\tThe numbers are in. Serielizados, the vibrant Barcelona on site/online TV festival saw in-person attendees soar 80% to 16,000 over Nov. 3-12. Running Nov. 13-23, its online version, hosted by upscale SVOD service Filmin, hit 194,000 viewers. That makes Serielizados, after San Sebastián, the second most-watched film-TV festival in Spain, its organizers announced Tuesday.\n\n\t“In this 12th edition we’ve made the definitive leap to becoming the most important series festival in the country, growing both in number of viewers and in content, with over 35 premiere series and with an international congress for professionals, Serielizados Pro, that further positions the festival as a driving force in the Spanish series industry,” Serielizados co-director Betu Molero stated Tuesday.\n\t\n\n\tSerielizados attendance also frames a paradox, given broader TV market contraction. Launching in 2014, Serielizados, won last year by Sweden’s “Pressure Point,” has carved out a reputation for exquisite taste. The lineup of 2025’s festival also featured a masterclass by Alan Ball, 20 years after “Six Foot Under,” “The Danish Woman” and a masterclass by its creator Benedikt Erlingsson, “Reykjavik Fusion” and “Nepobaby,” plus a screening of Sally Wainwright’s BBC One series “Riot Women.”\n\n\n\tSerielizados Pro proved equally popular generating a high-quality debate blessed by a large Nordic presence, with executives from SVT, DR and YLE, plus also reps from BBC Studios, Arte France, Germany’s Beta Film and Paris-based Slot Machine.\n\n\tSpeakers also took in a cream of Barcelona producers – notably nearly all women – plus reps from TV operators Movistar Plus+, 3Cat, RTVE, Atresmedia and Filmin. \n\t\n\n\tWell, who wouldn’t want some Barcelona sun in November? There were other reasons, however, for the top-notch industry presence. If this year’s Serielizados Pro delivered a message, it was that Europe – and Canada – still turns out series of the highest-caliber but that its industry needs to connect, which it did in Barcelona. \n\n\tThat’s because of the sobering state of the international TV industry. Symbolically, Serelizados Pro, which took place Nov. 6, began not with sun but a near biblical torrential downpour.      \n\n\tFollowing, a few takeaways:  \n\n\tWhat Serelizados PRO Debate Said About the State of the International TV Industry\n\n\tThe short answer was that, yes, the industry is in a state. “Almost 18 months after we first identified the trend, we are still at ’75% Peak TV.’ In other words, the market has contracted to 75% of its Peak TV size,” Ampere Analysis’ Guy Bisson said at October’s Cannes trade fair Mipcom. Much of the downturn is driven by streamer pull back, down over 100% on early 2024 original series commissions, he added. Add to that multiple more factors, sketched at Serielizados Pro. For one, production costs have rocketed. Also, “streamers have great libraries, windows are getting much shorter, and they are not so insistent on exclusivity and open to selling their own content. MGM is selling Amazon, That makes normal distribution much more difficult,” Beta Film’s Christian Glockel said at Serielizados. The grand issue debated at Serielizados is how players can react.\n\n\tWhat Buyers Want\n\n\tOne reaction: Players are playing it safe. “Everyone is feeling the pressure and therefore are backing shows that they know will be successful for them,” said BBC Studios’ Rebecca Ransley. What buyers want is crime, whether “cosy crime” or “where you lean back in shock,” she added. “Returnable crime series with talent attached” are also plus points, said Ransley, citing “Death Valley,” starring Timothy Spall, sold to 100 markets. “There’s definitely been a resurgence in an appetite for hyper-local authentic storytelling that reaches globally,” she went on, calling it the “‘Adolescence’ effect.” \n\n\tAlso, there’s demand for uplifting entertainment, Gockel argued. “The world’s a mess, a litany of bad news. ‘Maxima’ is about how a young woman becomes a princess, then a queen. If you had come with that five years ago, there probably would have been no interest.” \n\t\n\n\tBuzz Titles\n\n\tSerielizados Pro had no formal market. That said, speakers talked up shows. Arte France’s Alexander Piel and Movistar Plus+’s Susana Herreras sneak-peeked excerpts from “Killing a Bear,” a real facts-based wild bear murder mystery exposing deep social conflict in the high Pyrenees suggesting one of the big lures of international TV:  a sense of stunning local place. Of finished series, four of Serielizados biggest titles proved its final winners: Norway’s “A Better Man” and Canada’s “Empathy” in its international competition, “The Anatomy of a Moment” and “Jakarta” in its national contest. \n\n\n\n\t\n\n\t\t\t\t\tA packed audience at Barcelona’s Serielizados for ‘The Anatomy of a Moment’\n\t\n\n\n\n\tCo-Production: the Key Get Out of Jail Card\n\n\tCo-Production is now seen, in many ways, as the most major way forward for Europe’s TV industry. For one thing, it serves an essential purpose in Europe’s so often director-driven industry: On “The Danish Woman,” produced by Paris-based Slot Machine and Iceland’s Gullslottid and Zik Zak Filmworks, the “main goal had been always to protect the very original and unique voice of Benedikt Erlingsson and for that we needed independent financing in some way,” said Marianne Slot at Slot Machine. Bedrock finance came from Slot Machine itself and Icelandic public broadcaster RÚV, then European broadcasters and funds including the E.U. Creative Media Program. \n\n\tRetaining IP\n\n\tPatchwork funding on the open market can also allow producers to attain what, until recently, was seen as the Holy Grail: Retaining IP. Sold by Beta Film, “Pubertat,” was backed by Catalan pubcaster 3Cat, HBO Max for Spain, soft money including a Catalan government €1.5 million ($1.7 million) grant and a tax credit, as well as Eurimages and Media Program funding, said Miriam Porté at Distinto Films. “We are lucky that we can keep sort of 99.5% of the IP, which is very amazing. The key question of course is if the series sell, and sales are no cake walk these days,” Serelizados Pro suggested.\n\n\tCo-Production: A Default Mode\n\n\t“At SVT, we hardly make fully-financed projects: without co-production, no show,” said Sonja Hermele at Sweden’s SVT. As Jarmo Lampela at Finland’s YLE pointed out, the Nordics five national public broadcasters have been collaborating for years, launching the Nordic 12 in 2018 to make 12 premium dramas a year, adding ZDF (Germany), NPO (Netherlands) and VRT (Belgium) to create in 2023 the New8, in order to co-produce eight series annually. ZDF also partners with France Televisions and RAI in The Alliance, Lampela noted. \n\t\n\n\tLet’s Hear It for Global Streaming Services: How They Can Help Co-Production\n\n\tDisney+ and Hulu took international on Cold War comedy thriller “Whiskey on the Rocks,” from SVT and Stockholm-based Dramacorp, which in late October won the 77th Prix Italia in the TV Drama category. The series turns on an incident in 1981, when a Soviet U-137 ‘Whiskey’-class submarine ran aground on rocks deep inside Swedish territorial waters — in the middle of a sensitive Swedish naval exercise. That context is hardly well known for modern-day Swedish audiences. “Whatever Disney felt was the global attraction for an audience to the show was actually also something that benefited the Swedish audience,” said SVT’s Hermele.   \n\n\tPartnerships \n\n\tIn such a pressured market, “it’s really about partnerships. You know, our whole business is about relationships,” said Ransley, citing BBC Studios relationship with Germany’s ZDF, which has generated “Famous Five, “Chelsea Detective” and “The Good Girl’s Guide to Murder.” \n\n\tSerielizados Pro’s inaugural session drilled down on one of the key consolidating alliances in Europe, between Spain’s Movistar Plus+ and France’s Arte France, co-producers on “Hierro,” “The New Years,” “Anatomy of a Moment” and “Killing a Bear.” It’s a like-minded title-by-title alliance. “We talk a lot at Movistar Plus+ about what’s commercial. Often, it’s not the most open of series. It’s more about driving about social conversation, about people thinking they have to watch our series. Finding someone out there in Europe who understands things like us is very important,” said Movistar Plus+’Herreras.\n\n\tFor Arte France, partnership is also about accessing talent, said Piel. “It was about talent and content. Talent with a vision, a different vision about how to do TV series and with something so deep inside them that creates singular and unique content. So we probably had two dreams. Getting to work with Rodrigo Sorogoyen and Alberto Rodríguez,” said Piel.\n\n\tAnd the Future?\n\n\tLooking to the future, “streamers will focus on big IPs which bring subscribers and increasingly co-produce with good distributors or studios which take the responsibility of packaging the productions,” said Glockel. So Beta Film is increasingly involved in upstream production. “Before we would wait until a product was finished and then choose to distribute it or not. Now with co-production, we get in much earlier, at the script stage,” he said.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Serielizados Attendance Surges 80% as the Barcelona TV Fest’s Pro Congress Nails the Parlous State of the International TV Industry ",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/Killing-a-Bear-Eduard-Fernandez-.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-26T09:38:10.000Z",
      "dateModified": "2025-11-26T09:38:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Marlow Studios, James Cameron-Backed $1 Billion Facility in U.K., Gets Government Approval",
    "url": "https://variety.com/2025/film/global/marlow-film-studios-in-uk-government-approval-1236592582/",
    "image": "https://variety.com/wp-content/uploads/2025/11/GettyImages-2195433587.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-26T11:34:59.000Z",
    "description": "\n\tMarlow Studios, a £750 million ($986 million) facility proposed for Buckinghamshire in the south of England that has received support from James Cam",
    "body": "\n\tMarlow Studios, a £750 million ($986 million) facility proposed for Buckinghamshire in the south of England that has received support from James Cameron, has been greenlit by the U.K. government following an appeal.\n\n\tThe Housing, Communities and Local Government department, led by secretary of state Steve Reed, gave its approval in a 266-page verdict after local planning issues had been raised over the site, where developers want to build 18 soundstages and a skills academy.\n\t\n\n\t“The secretary of state’s determination is a real vote of confidence in the U.K. and in its creative industries. It is very welcome news,” said Robert Laycock, CEO of Marlow Studios. “This is a meaningful decision for anyone who believes in the UK’s future, our nation’s creative genius, and our unmatched capability to inspire the world.”\n\n\n\tLaycock added: “The decision is clear in its assessment that Marlow Studios will attract global investment, help the U.K. maintain its competitive creative edge, and will strengthen the West London film cluster.”\n\n\tAccording to the Financial Times in an article in 2024, James Cameron came forward to back the studio, writing to the Buckinghamshire Council in support of the plans. He also said Marlow could be a potential U.K. and European home for his Lightstorm3D company which develops technology for filmmaking.\n\n\tThe decision by secretary of state Steve Reed to approve the development plans overturns the council’s initial move to refuse the studio’s application on grounds including inappropriate development on a greenbelt, a lack of sustainable transport provisions for commuters to the site and the impact on local highways.\n\t\n\n\t“While Steve Reed’s decision notes that the development of the film studio would cause potential harm to the Green Belt through inappropriateness and openness, the decision gave greater weight to the wider benefits to justify this development in the Green Belt, including its alignment with the growth agenda given it would attract global investment,” said Victoria Du Croz, head of planning and partner, Forsters law firm.\n\n\t“The areas around the M25 is a hotbed of film studios and it is perhaps telling of the strength of the U.K.’s creative industries that when the devastating LA fires hit in January there wasn’t a single film in production in LA’s studios, but the U.K. studios were already busy.” \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Marlow Studios, James Cameron-Backed $1 Billion Facility in U.K., Gets Government Approval",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/GettyImages-2195433587.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-26T11:34:59.000Z",
      "dateModified": "2025-11-26T11:34:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Former Try Guy Ned Fulmer Reveals MS Diagnosis: I Wondered ‘If I Was Going to Be Able to Walk Again’",
    "url": "https://variety.com/2025/tv/news/try-guys-ned-fulmer-ms-diagnosis-1236592494/",
    "image": "https://variety.com/wp-content/uploads/2022/09/Ned-Fulmer-The-Try-Guys.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-26T05:02:17.000Z",
    "description": "\n\tNed Fulmer revealed on Sunday that he’s struggled with multiple sclerosis for the past 12 years. \n\n\tThe internet personality and former member of Th",
    "body": "\n\tNed Fulmer revealed on Sunday that he’s struggled with multiple sclerosis for the past 12 years. \n\n\tThe internet personality and former member of The Try Guys broke the news in a video posted to YouTube on Nov. 23 titled “I Have MS.” Fulmer explained that in 2013, after experiencing numbness in his hands, arms and back over several days, he went to the hospital for an MRI. The results revealed lesions in his brain.\n\n\n\t“The doctor was like, ‘You probably have MS,’ and I was like, ‘What is that? Isn’t that really bad?” Fulmer recalled. “I was totally in denial, [I] didn’t want to have MS.”\n\t\n\n\tFulmer said he hoped the numbness would fade on its own and left the hospital. However, the symptoms worsened. He recalled a serious scare when he was walking to the bathroom in the middle of the night and collapsed from weakness. He was rushed to the hospital afterward for further testing and care.\n\n\tHe said of the incident, “I remember sitting in that hospital bed and it getting worse and just being so scared and wondering if I was going to be able to walk again.”\n\n\tLuckily, after he was given some medication, he was able to move his legs again. Fulmer said the recovery “felt like a miracle.” Now more than a decade ahead of his diagnosis, Fulmer shared that a recent MRI came back “clean,” but added he still struggles with “low-level sensory issues.”\n\n\t“I was keeping it a really big secret for a long time, and I don’t think that was very healthy for me,” Fulmer said. “I’m trying to be more open with it, just in conversation, and I am very grateful to be in remission, and I am very happy to be making this video.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Former Try Guy Ned Fulmer Reveals MS Diagnosis: I Wondered ‘If I Was Going to Be Able to Walk Again’",
      "image": [
        "https://variety.com/wp-content/uploads/2022/09/Ned-Fulmer-The-Try-Guys.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-26T05:02:17.000Z",
      "dateModified": "2025-11-26T05:02:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Guess the Tatted 'Manic' Singer Popping Out Her Bikini",
    "url": "https://www.tmz.com/2025/11/25/guess-the-singer-bikini-manic/",
    "image": "https://imagez.tmz.com/image/07/16by9/2025/11/25/075db886623a4e3ca968c3e24a09bee7_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-25T22:57:27.000Z",
    "description": "\n    \n                    \n                          Guess The\n                          Sexy Singer Whose Bikini Snap Screams 'Now or Never!'\n       ",
    "body": "\n    \n                    \n                          Guess The\n                          Sexy Singer Whose Bikini Snap Screams 'Now or Never!'\n                      \n                  \n                        Published November 25, 2025 2:57 PM PST\n                                                                            \n      \n    \n          This sexy tatted singer just dropped a fire bikini snap that'll make fans pick their jaw up off the floor ... and say, \"Be Kind.\"\n      \n    \n          The singer-songwriter and actress has snapped up a slew of awards over her career ... and was even once named one of Time's 100 most influential people in the world.\n      \n    \n          Still unsure? Hit up the gallery for the reveal!\n      \n      \n      \n          \n            \n              \n                \n                Share on Facebook\n              \n            \n            \n              \n                \n                Share on X\n              \n            \n                          \n                \n                  \n                \n              \n                      \n        \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Guess Who\n              \n                          \n                Music\n              \n                          \n                Fairly Legal\n              \n                      \n        \n          \n  ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Guess the Tatted 'Manic' Singer Popping Out Her Bikini",
      "image": [
        "https://imagez.tmz.com/image/07/16by9/2025/11/25/075db886623a4e3ca968c3e24a09bee7_xl.jpg"
      ],
      "datePublished": "2025-11-25T22:57:27.000Z",
      "dateModified": "2025-11-25T22:57:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rosie Mee In \"We Bought A Zoo\" 'Memba Her?!",
    "url": "https://www.tmz.com/2025/11/26/rosie-mee-we-bought-a-zoo/",
    "image": "https://imagez.tmz.com/image/6c/16by9/2025/11/19/6c203b73b0214f45ae5314be12bad02c_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-26T08:01:22.000Z",
    "description": "\n    \n      \n        \n        \n          Launch Gallery\n        \n                  Shutterstock Premier\n              \n    \n    \n          Retired chi",
    "body": "\n    \n      \n        \n        \n          Launch Gallery\n        \n                  Shutterstock Premier\n              \n    \n    \n          Retired child star Maggie Elizabeth Jones was only 8 years old when she played Rosie Mee  -- the innocent and pure hearted kiddo -- in the family/comedy film \"We Bought A Zoo\" back in 2011.\n      \n    \n          Other noteworthy stars from the film include Matt Damon, Scarlett Johansson, and Elle Fanning.\n      \n    \n          Guess what she looks like now in her 20s!\n      \n      ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rosie Mee In \"We Bought A Zoo\" 'Memba Her?!",
      "image": [
        "https://imagez.tmz.com/image/6c/16by9/2025/11/19/6c203b73b0214f45ae5314be12bad02c_xl.jpg"
      ],
      "datePublished": "2025-11-26T08:01:22.000Z",
      "dateModified": "2025-11-26T08:01:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rita Ora Hot Shots To Kick Off Her 35th Birthday!",
    "url": "https://www.tmz.com/2025/11/26/rita-ora-hot-shots-35th-birthday/",
    "image": "https://imagez.tmz.com/image/19/16by9/2025/11/13/19175c25ed8c4f08814ad4fda5c7a29c_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-26T08:10:02.000Z",
    "description": "\n    \n                    \n                          Rita Ora Hot Shots\n                          It's My\n                          35th Birthday!\n   ",
    "body": "\n    \n                    \n                          Rita Ora Hot Shots\n                          It's My\n                          35th Birthday!\n                      \n                  \n                        Published November 26, 2025 12:10 AM PST\n                                                                            \n      \n    \n      \n        \n              \n    \n    \n          Rita Ora may've been on the scene for a minute now, but her sexy social media shots will never get old! In honor of her 35th birthday, we're un\"mask\"ing her hottest shots!\n      \n    \n          Bikinis, topless shots, and fruit-filled photos ... OH MY! Look no further 'cuz Rita's rung up a plethora of sexy shots, and we're just gettin' started!\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Ab crack on fleek! \"The Masked Singer\" judge is usually the hottie of the week but today ... let shots like these burn in your memory ...\n      \n\n                  \n          \n                          \n                \n                                  \n      \n    \n          And, you already know her fashion game stays at a solid 10 ... check out this red-hot pic she snapped on-the-go ...\n      \n    \n          Hit up our gallery, cuz Rita's heatin' up for #35!\n      \n    \n          Happy Birthday, Rita!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Rita Ora\n              \n                          \n                Hotties & Bodies\n              \n                          \n                Hot Bodies\n              \n                          \n                Photo Galleries\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rita Ora Hot Shots To Kick Off Her 35th Birthday!",
      "image": [
        "https://imagez.tmz.com/image/19/16by9/2025/11/13/19175c25ed8c4f08814ad4fda5c7a29c_xl.jpg"
      ],
      "datePublished": "2025-11-26T08:10:02.000Z",
      "dateModified": "2025-11-26T08:10:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'RHOSLC' Mary Cosby's Son Robert Jr.'s Wife Files For Divorce",
    "url": "https://www.tmz.com/2025/11/25/rhoslc-mary-cosby-son-robert-jr-wife-files-divorce/",
    "image": "https://imagez.tmz.com/image/5a/16by9/2025/11/25/5ad0c7f48cb3403da475f108756d1569_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-26T01:14:21.000Z",
    "description": "\n    \n                    \n                          'RHOSLC' Mary Cosby\n                          Son Robert's Wife Files For Divorce\n               ",
    "body": "\n    \n                    \n                          'RHOSLC' Mary Cosby\n                          Son Robert's Wife Files For Divorce\n                      \n                  \n                        Published November 25, 2025 5:14 PM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Thanksgiving arrives with a side of family drama for \"Real Housewives of Salt Lake City\" star Mary Cosby ... because her son is going through a divorce.\n      \n    \n          Robert Cosby Jr.'s wife, Alexiana Smokoff, beelined it to a Utah court Monday and filed to divorce the reality star's son ... according to new legal documents obtained by TMZ.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          The docs — which were filed in Utah — are under seal ... so, at least for now, there's no way of knowing the reason for the split ... ditto for any details on what she’s looking for in terms of spousal support, division of property, etc.\n      \n\n          Robert's appeared on 'RHOSLC' a few times over the years ... and during season 4 there was a storyline about Mary learning Robert had secretly gotten married right under her nose. The wedding reportedly went down in August 2022 at a courthouse.\n      \n    \n          The estranged couple does not have any kids together and they apparently had been living in Mary's Utah mansion ... as best we can tell from the show.\n      \n    \n          'RHOSLC' also made Robert and Alexiana's alleged drug problems a big part of Mary's storyline.\n      \n    \n          We reached out Mary and her son ... so far no word back.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Mary Cosby\n              \n                          \n                Celebrity News\n              \n                          \n                Reality TV\n              \n                          \n                Real Housewives\n              \n                          \n                Celebrity Divorce\n              \n                          \n                Exclusive\n              \n                          \n                Fairly Legal\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'RHOSLC' Mary Cosby's Son Robert Jr.'s Wife Files For Divorce",
      "image": [
        "https://imagez.tmz.com/image/5a/16by9/2025/11/25/5ad0c7f48cb3403da475f108756d1569_xl.jpg"
      ],
      "datePublished": "2025-11-26T01:14:21.000Z",
      "dateModified": "2025-11-26T01:14:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Necrophiliac Convicted of Murdering Wife Then Raping Her Corpse",
    "url": "https://www.tmz.com/2025/11/25/husband-guilty-murdering-wife-rape-corpse-necrophiliac/",
    "image": "https://imagez.tmz.com/image/ca/16by9/2025/11/25/ca554b88bbec4b9ab28cfe4042e3e91e_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-25T23:14:13.000Z",
    "description": "\n    \n                    \n                          Necrophiliac\n                          I Killed My Wife, Dug Her Up, and Raped Her Corpse\n       ",
    "body": "\n    \n                    \n                          Necrophiliac\n                          I Killed My Wife, Dug Her Up, and Raped Her Corpse\n                      \n                  \n                        Published November 25, 2025 3:14 PM PST\n                                                                      |\n                Updated November 25, 2025 7:56 PM PST\n                                    \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          A California man ripped a page out of Jeffrey Dahmer's necrophilia handbook ... he was just found guilty of murdering his estranged wife, then digging up and raping her corpse.\n      \n    \n          Zarbab Ali was found guilty last Friday by a jury of fatally stabbing Rachel Castillo with a knife as the two were on the verge of finalizing their divorce in Simi Valley in November 2022. He faces a life sentence without parole and is slated to be sentenced January 12.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Before the trial, Ali told investigators he hid in Rachel’s apartment, ambushed her and butchered her body. Then he drove her corpse to a spot in a remote desert in Antelope Valley and buried her in a shallow grave. He returned the next morning and sexually assaulted her before burying her body again.\n      \n\n          In a video confession to police, Ali noted that \"if I didn’t commit to being a monster, then she would have died for no reason.\"\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Ali shares some things in common with Dahmer, who killed many of his male victims to have sex with their corpses. Dahmer also tried to dig up the corpse of a onetime love interest.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Jeffrey Dahmer\n              \n                          \n                Arrests\n              \n                          \n                Crime\n              \n                          \n                Fairly Legal\n              \n                          \n                News\n              \n                          \n                True Crime\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Necrophiliac Convicted of Murdering Wife Then Raping Her Corpse",
      "image": [
        "https://imagez.tmz.com/image/ca/16by9/2025/11/25/ca554b88bbec4b9ab28cfe4042e3e91e_xl.jpg"
      ],
      "datePublished": "2025-11-25T23:14:13.000Z",
      "dateModified": "2025-11-25T23:14:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]