[
  {
    "title": "George Clooney Says It Was a ‘Mistake’ to Have Kamala Harris Replace Joe Biden in the 2024 Presidential Election: ‘She Was Given a Very Tough Ask’",
    "url": "https://variety.com/2025/film/news/george-clooney-mistake-kamala-harris-replace-joe-biden-1236568042/",
    "image": "https://variety.com/wp-content/uploads/2025/10/GettyImages-2242942993.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-02T19:46:42.000Z",
    "description": "\n\tGeorge Clooney said during a recent sit-down on CBS’ “Sunday Morning” that he had no regrets about writing his New York Times op-ed insisting that f",
    "body": "\n\tGeorge Clooney said during a recent sit-down on CBS’ “Sunday Morning” that he had no regrets about writing his New York Times op-ed insisting that former president Joe Biden bow out of the 2024 presidential election. However, in hindsight, he feels that it was a “mistake” to have Kamala Harris step in for Biden as the democratic nominee.\n\n\tWhen asked if he would write his NYT op-ed again if given the chance, Clooney replied, “Yes. We had a chance. I wanted there to be, as I wrote in the op-ed, a primary. Let’s battle-test this quickly and get it up and going. I think the mistake with it being Kamala is she had to run against her own record. It’s very hard to do if the point of running is to say, ‘I’m not that person.’ It’s hard to do, and so she was given a very tough task. I think it was a mistake, quite honestly. But we are where we are. We were gonna lose more House seats, they say. So I don’t know. To not do it would be to say, ‘I’m not gonna tell the truth.'”\n\t\n\n\tAfter Biden’s disastrous performance during his first presidential debate with Donald Trump, many in Hollywood called for him to step aside for a more capable candidate. Clooney became the de facto face of this movement after his July 2024 essay. In it, he wrote of Biden, “We are not going to win in November with this president. On top of that, we won’t win the House, and we’re going to lose the Senate. This isn’t only my opinion; this is the opinion of every senator and congress member and governor that I’ve spoken with in private. Every single one, irrespective of what he or she is saying publicly.”\n\t\n\n\tAfter facing backlash for the piece, Clooney told CNN’s Jake Tapper that he felt it was his “civic duty” to call attention to what he believed was an imperative issue.\n\n\t“That’s the deal, you have to take your stand if you believe in it,” he said. “Take a stand, stand for it and then deal with the consequences. That’s the rules, so when people criticize me — they criticized me for my stance against the war 20 years ago, people picketed my movies and they put me on a deck of cards — I have to take that, that’s fair. I’m OK with that, I’m OK with criticism for where I stand. I defend their right to criticize me as much as I defend my right to criticize them.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "George Clooney Says It Was a ‘Mistake’ to Have Kamala Harris Replace Joe Biden in the 2024 Presidential Election: ‘She Was Given a Very Tough Ask’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/GettyImages-2242942993.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-02T19:46:42.000Z",
      "dateModified": "2025-11-02T19:46:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Albania’s Soviet-Tinged Propaganda Archives Reveal a Passion for the Cinematic, says Docmaker Roland Sejko",
    "url": "https://variety.com/2025/film/global/albania-propaganda-roland-sejko-1236568049/",
    "image": "https://variety.com/wp-content/uploads/2025/11/A-State-Film.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-02T19:59:18.000Z",
    "description": "\n\tRoland Sejko’s doc “A State Film,” culled from a vast archive of official footage made under the regime of Albanian strongman Enver Hoxha, is a fasc",
    "body": "\n\tRoland Sejko’s doc “A State Film,” culled from a vast archive of official footage made under the regime of Albanian strongman Enver Hoxha, is a fascinating study in the power of image and myth.\n\n\n\n\n\tScreened in the main competition at the Czech Republic’s primary annual nonfiction film event, the Ji.hlava Intl. Documentary Film Festival, the compilation of carefully constructed images for the masses contains much to unpack, says Sejko.\n\t\n\n\t“I’ve been working for several years with propaganda film archives — first with Istituto Luce Cinecitta, and also with the archives of the Albanian communist regime,” Sejko says. “Both contain thousands of films created to construct a political narrative, often with striking cinematic ambition.”\n\n\n\tThe genre is one Sejko explored in his previous film, “The Image Machine of Alfredo C.,” screened in 2021 at the Venice film fest. That film tells the true story of an Istituto Luce cameraman who filmed Mussolini and fascist propaganda, and, eventually, the head of communist Albania.\n\n\t“It was a hybrid film, but during its making I realized that the vast Albanian film archive — and the central figure of Enver Hoxha — had never been narrated exclusively through their own images.”\n\n\tSo Sejko, as a professional archivist and head of the editorial department for Italy’s Cinecitta Luce, set about analyzing and curating from the decades of state propaganda films.\n\n\t“The Albanian propaganda newsreels and documentaries clearly bear the mark of Eastern Bloc cinematography,” Sejko says. “The first Albanian camera operators were trained by Soviet masters — starting with Roman Karmen, the legendary chronicler of revolutions and wars.”\n\t\n\n\t“There was never a manual for the propaganda cameraman, no written rulebook for how to film a regime. Yet something invisible governed their images. A First of May parade filmed in communist Albania looks strikingly similar to one filmed in Moscow or Bucharest or Sofia in the same years.”\n\n\tIndeed, the images of cheering worker heroes and dancing girls in traditional folk garb seen in “A State Film” are hauntingly familiar.\n\n\tSpanning the post-WWII years, with Albanians urged to “obey and execute the laws of the government” while honoring heroes’ bloody sacrifices, the footage makes clear Hoxha’s devotion to Stalin and Yugoslavian dictator Josip Broz Tito.\n\n\tOutsize portraits of all three are hauled down endless streets as crowds of obligatory fans parade their wheelbarrows, shovels and carbines. Praises are sung for industry while defensive bunkers, of which Hoxha build hundreds of thousands, withstand test blasts, proving their readiness to stand up to decadent imperialist forces from the West.\n\n\tDogs and guinea pigs are sacrificed, presumably to test exposure to potential gas attacks.\n\n\tAnd all the while, there’s always another rousing patriotic song for the peasants to sing.\n\n\t“It is not just the cameraman’s technique that creates this resemblance,” Sejko says. “It is the vision of the world being shown: always the same choreography of collective joy.”\n\n\tThat said, as audiences take in “A State Film,” they begin to perceive that the images have been somehow distilled. Then they may notice the soundtrack, with the original heavy-handed narration replace by the sounds of the breeze in trees, birds chirping and feet tramping unpaved roads.\n\n\t“In official propaganda films — newsreels, documentaries, parades — the narrator’s voice was not descriptive but prescriptive: it told viewers what to think. Replacing it with another commentary, even a critical one, would have meant repeating the same mechanism.”\n\n\t“So I removed not only the voice but the whole original soundtrack, keeping only what was real — applause, songs, speeches. I built a new, realistic soundscape with footsteps, murmurs, creaks, silences, as if the scenes had been recorded live. This new texture restores the images’ physicality and opens a space where sound itself becomes a narrative tool.”\n\t\n\n\tAdd to this the intercutting of footage from Hoxha’s personal archive, showing moments away from the cheering masses, invariably featuring drives in the dictator’s favorite black Mercedes, and a striking contrast emerges.\n\n\tThese motifs take on a symbolic value, according to Sejko, and suggest the loneliness and isolation of power. “A State Film” raises the question of how forms of propaganda have changed, while also forcing uncomfortable realizations as to how many of the classic tropes are still being rolled out today.\n\n\t“A State Film” has been described as demonstrating “how the archive is not just a repository of images, but a tool for interpreting and rewriting history.”\n\n\tIndeed, the chilling parade of carefully staged scenes does seem to transcend the framework of national history, and, as the director says, explore the function of the image in the political sphere, and its ability to create collective memory.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Albania’s Soviet-Tinged Propaganda Archives Reveal a Passion for the Cinematic, says Docmaker Roland Sejko",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/A-State-Film.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-02T19:59:18.000Z",
      "dateModified": "2025-11-02T19:59:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘KPop Demon Hunters’ Singer Rei Ami Says She’s ‘Waiting For the Call’ From Netflix For a Possible Sequel",
    "url": "https://variety.com/2025/film/news/kpop-demon-hunters-sequel-rei-ami-netflix-1236568008/",
    "image": "https://variety.com/wp-content/uploads/2025/10/Kpop-2.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-02T18:22:03.000Z",
    "description": "\n\tNow that “KPop Demon Hunters” has become a cultural phenomenon, Rei Ami said she’s “waiting for the call” about a potential sequel.\n\n\t“I’m waiting f",
    "body": "\n\tNow that “KPop Demon Hunters” has become a cultural phenomenon, Rei Ami said she’s “waiting for the call” about a potential sequel.\n\n\t“I’m waiting for the call, just like you! You’re gonna find out when I do, so we’ll chat then,” she told E! News on Friday at the red carpet for Heidi Klum’s 24th Annual Halloween party. \n\n\tAmi arrived at Klum’s Halloween bash dressed as her character Zoey, wearing patchwork parachute pants, as seen in the film’s opening scene. \n\t\n\n\tWhen discussing the ubiquity of the “KPop Demon Hunters” inspired Halloween costumes this year, the musician said, “Oh my god, it’s everywhere, I can’t get a break from it.”\n\n\tShe continued, “And I’m not complaining, please! I want to see more.” \n\n\tThe film about a K-pop girl group that hunts mythical monsters when not filling stadiums became the most-streamed movie in Netflix history by garnering 236 million views. \n\n\tWhile speaking about the popularity of the film, Ami added that she still hasn’t processed it becoming a record-breaking hit for the streamer and soaring on the music charts with its soundtrack.\n\n\t“This is a cultural phenomenon,” she said. “I’m so honored, in awe and just truly humbled by the power of music and good art and how it can really, truly—it sounds so cliché—change the world. That’s exactly what this film and this soundtrack did, and it brought so much hope and light into such a dim, grim world, and I feel really privileged to be a part of it.”\n\n\tIn addition to Ami, EJAE and Audrey Nuna also provide vocals for the fictional group Huntr/x in “KPop Demon Hunters.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘KPop Demon Hunters’ Singer Rei Ami Says She’s ‘Waiting For the Call’ From Netflix For a Possible Sequel",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/Kpop-2.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-02T18:22:03.000Z",
      "dateModified": "2025-11-02T18:22:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jennifer Lawrence Jokes Working With Robert Pattinson in ‘Die My Love’ Feels Like ‘Total Revenge’ After Failed ‘Twilight’ Audition",
    "url": "https://variety.com/2025/film/news/jennifer-lawrence-robert-pattinson-twilight-die-my-love-1236567978/",
    "image": "https://variety.com/wp-content/uploads/2025/11/GettyImages-2244062843.jpg?crop=0px%2C114px%2C5294px%2C2978px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-11-02T17:58:22.000Z",
    "description": "\n\t\n\t\t\t\n\t\t\t\t\n\t\n\n\t\n\tNov 2, 2025 9:58am PT\t\n\t\n\n\t\n\t\tJennifer Lawrence Jokes Working With Robert Pattinson in ‘Die My Love’ Feels Like ‘Total Revenge’ Afte",
    "body": "\n\t\n\t\t\t\n\t\t\t\t\n\t\n\n\t\n\tNov 2, 2025 9:58am PT\t\n\t\n\n\t\n\t\tJennifer Lawrence Jokes Working With Robert Pattinson in ‘Die My Love’ Feels Like ‘Total Revenge’ After Failed ‘Twilight’ Audition\n\t\n\t\n\t\t\t\n\n\n\t\t\t\n\t\t\t\n\t\n\n\t\t\t\t\t\t\t\t\tKristina Bumphrey/Variety\n\t\n\n\t\t\n\t\n\t\t\t\t\n\tIn an alternate timeline, Jennifer Lawrence played Bella Swan opposite Robert Pattinson‘s Edward Cullen in the “Twilight” series.\n\n\tShe revealed on “The Rewatchables” podcast in 2023 that the studio turned her down “immediately” and that she “didn’t even get a callback.” 15 years and two juggernaut franchises later, she’s finally sharing the screen with Pattinson in Mubi’s new film “Die My Love.” “Yeah, it’s the total revenge that I’ve wanted,” she joked to Variety on Saturday night at the New York premiere of her new film.\n\n\n\n\t“Die My Love,” Lynne Ramsay’s first feature since 2017’s “You Were Never Really Here,” is a feverish psychodrama that stars Lawrence as a writer whose mental state unravels amid a volatile marriage and the pressures of motherhood. On screen, Lawrence and Pattinson hurl nonstop insults at each other in loud bursts of verbal warfare, a striking contrast to the duo’s quieter working relationship.\n\t\n\n\t“My favorite part of working with him was probably that we could be in the same room, but not talk for a really long time,” Lawrence explained. “I really appreciate that in a coworker.”\n\n\tPattinson recalls that the first movie he ever saw Lawrence in was “Winter’s Bone,” the 2010 drama that starred her as a poverty-stricken teenager searching for her father in the Ozarks.\n\n\t“I just remember she was like the thing on the scene,” Pattinson said. “When that movie came out, it was like everyone went to see like, ‘Okay, who is this girl?’ It kind of had like an elemental power, and you could just see that from the second her career started, she was the biggest star in the world.”\n\n\n\t“Winter’s Bone” put the 20-year-old Lawrence on the map, earning her the first of four Academy Award nominations for best actress. She auditioned for “Twilight,” and about a year later, scored the role of Katniss Everdeen in “The Hunger Games” — the other YA blockbuster franchise that defined the early 2010’s. “Die My Love” releases in theaters Nov. 7.\n\t\n\n\n\n\t\n\n\t\t\t\t\tLaKeith Stanfield, Ariana Harwicz, Andrea Calderwood, Robert Pattinson, Lynne Ramsay, Martin Scorsese, Jennifer Lawrence, Justine Ciarrocchi, Sissy Spacek and Molly Smith at the “Die My Love” New York Premiere held at AMC Lincoln Square on November 01, 2025 in New York, New York. (Kristina Bumphrey/Variety)\n\t\t\t\t\t\t\t\t\tVariety via Getty Images\n\t\n\n\n\n\n\t\n\t\tMore from Variety\n\t\n\t\n\t\t\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\n\n\t\t\n\n\t\n\t\tMore From Our Brands\n\t\n\t\n\t\t\n\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\n\tRolling Stone\n\n\t\t\t\t\tIs Adekunle Gold’s ‘Fuji’ Even Fújì? Does It Matter?\t\t\n\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\n\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\n\tRobb Report\n\n\t\t\t\t\tInside Corridor 109, the Hit Fine-Dining Pop-Up That’s Found a Permanent Home in L.A.\t\t\n\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\n\t\t\n\t\t\t\n\t\n\t\t\t\n\t\t\t\n\n\tSportico\n\n\t\t\t\t\tNYC Marathon 2025 Winners Kipruto, Obiri Earn $100K in Prize Money\t\t\n\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\n\t\t\t\n\t\n\t\t\n\t\n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jennifer Lawrence Jokes Working With Robert Pattinson in ‘Die My Love’ Feels Like ‘Total Revenge’ After Failed ‘Twilight’ Audition",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/GettyImages-2244062843.jpg?crop=0px%2C114px%2C5294px%2C2978px&resize=1000%2C563"
      ],
      "datePublished": "2025-11-02T17:58:22.000Z",
      "dateModified": "2025-11-02T17:58:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Halloween Box Office: ‘Regretting You,’ ‘Black Phone 2’ Lead Worst Weekend of 2025",
    "url": "https://variety.com/2025/film/box-office/halloween-box-office-worst-weekend-weekend-2025-1236567966/",
    "image": "https://variety.com/wp-content/uploads/2025/10/REGRETTING-YOU-050825-main-.webp?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-02T16:19:31.000Z",
    "description": "\n\tHalloween was light on the box office treats.\n\n\tTicket sales nearly ground to a halt without any new releases, as well as the misfortune of the spoo",
    "body": "\n\tHalloween was light on the box office treats.\n\n\tTicket sales nearly ground to a halt without any new releases, as well as the misfortune of the spooky holiday landing on Friday (meaning families were trick-or-treating, not visiting their local movie theater). Another distraction was Saturday night’s Major League Baseball championships, which saw the Los Angeles Dodgers score a victory over the Toronto Blue Jays in a nail-biting Game 7. As a result, revenues between Friday and Sunday amounted to just $49 million, marking the worst weekend of the entire year, according to Comscore.\n\t\n\n\t“The cavalry cannot get here soon enough,” says Comscore’s head of marketplace trends, Paul Dergarabedian. “The industry is in dire need of a boost [after] this scary-slow World Series-impacted, Halloween-festivity-laden weekend. It’s emblematic of what has been a quiet post-summer moviegoing corridor.”\n\n\n\tAnother scary stat: This closes out the lowest-grossing October in 27 years with domestic earnings stalling at an abysmal $425 million, the poorest haul since October 1997 with $385 million, not adjusted for inflation. This ignominious record doesn’t include 2020, when theaters hadn’t rebounded from the pandemic.\n\n\tAlthough Halloween is traditionally a moribund period at the box office, October is usually the time when studios start to launch their awards hopefuls. Instead of providing a box office jolt, though, Oscar contenders and big-budget tentpoles alike, such as Dwayne Johnson’s “The Smashing Machine,” Luca Guadagnino’s “After the Hunt,” Disney’s “Tron: Ares” and “Springsteen: Deliver Me From Nowhere” struggled to show signs of life.\n\t\n\n\tIn a surprise win, the Colleen Hoover adaptation “Regretting You” rose to No. 1 with $8.1 million from 3,424 theaters in its sophomore outing. However, Universal’s “Black Phone 2” was ever-so-slightly behind with $8 million from 3,305 venues — so the final order could shift when final numbers are confirmed on Monday.\n\n\t“Regretting You” declined just 41% from its debut, bringing ticket sales to $27.5 million in North America and $50 million globally against a $30 million budget. Hoover is the author of last year’s sleeper hit “It Ends With Us.” Two of her other novels, “Verity” and “Reminders of Him,” are being adapted by other studios for theatrical release in 2026. \n\n\t“Black Phone 2” has grossed $61 million domestically and $104 million globally to date. The scary sequel is this year’s only Blumhouse release to get anywhere near the $100 million mark, though “Five Nights at Freddy’s 2” in December will attempt to continue the good fortunes.\n\n\tIn another potential photo finish, Netflix’s “KPop Demon Hunters” re-release likely tied for No. 3 with Sony and Crunchyroll’s  “Chainsaw Man – The Movie: Reze Arc,” with both films estimating a $6 million weekend haul. \n\n\tNetflix isn’t reporting grosses for “KPop Demon Hunters,” which played 2,890 theaters over the weekend, so projections hail from rival studios and exhibitors. This is the second big-screen stint for the animated musical, which first screened theatrically in August (after becoming Netflix’s most popular film ever) and led in North America with roughly $18 million.\n\n\t“Chainsaw Man – The Movie: Reze Arc,” which topped the box office last weekend, has grossed $30 million in North America to date. Like many anime films, “Chainsaw Man” has been much bigger at the international box office, with earnings at $109 million overseas and $139 million globally.\n\n\tIn fifth place, “Bugonia,” the latest collaboration between director Yorgos Lanthimos and star Emma Stone, successfully expanded nationwide with $4.8 million from 2,043 theaters. The film, in which Stone portrays a high-powered tech CEO who is kidnapped by two conspiracy theorists who believe she is an extraterrestrial being sent to destroy Earth, earned a “B” grade on CinemaScore exit polls. However, that kind of middling reception isn’t unusual for a polarizing film, as Lanthimos is wont to make. Ticket buyers were mostly younger males, with men accounting for 61% of audiences and 24 to 34-year-olds representing 39% of crowds.\n\t\n\n\tElsewhere, “Back to the Future” returned to theaters in honor of the film’s 40th anniversary and collected a respectable $4.7 million from 2,105 theaters over the weekend. “The Twilight Saga” also made its way back to the big screen to celebrate the 20th anniversary of the publishing of author Stephanie Meyer’s first novel. Theaters are playing one of the five “Twilight” films each night between Oct. 29 and Nov. 2, which have collectively accounted for roughly $3 million from 1,500 locations.\n\n\tNext weekend sees the debut of Disney’s “Predator: Badlands,” followed by heist threequel “Now You See Me: Now You Don’t” and Edgar Wright and Glen Powell’s “The Running Man” remake. But business might not pick up in earnest until the Thanksgiving corridor when Disney’s “Zootopia 2” and Universal’s “Wicked: For Good” float to theaters. Then James Cameron’s “Avatar: Fire and Ash” on Dec. 19 is expected to end the year with a bang.\n\n\t“Early November releases will be most welcome,” says Dergarabedian. “But mid-November through New Year’s Eve will be vitally important [for] the industry.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Halloween Box Office: ‘Regretting You,’ ‘Black Phone 2’ Lead Worst Weekend of 2025",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/REGRETTING-YOU-050825-main-.webp?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-02T16:19:31.000Z",
      "dateModified": "2025-11-02T16:19:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "LaZona Pictures Secures Spain on ‘Chopin, Chopin!’ From Playtime (EXCLUSIVE)",
    "url": "https://variety.com/2025/film/global/lazona-pictures-spain-chopin-chopin-playtime-1236567933/",
    "image": "https://variety.com/wp-content/uploads/2025/11/Chopin_Chopin-photos-Jaroslaw_Sosinski.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-02T10:10:00.000Z",
    "description": "\n\tLaZona Pictures, the distribution label of Gonzalo Salazar-Simpson’s Madrid-based LaZona group, has acquired Spanish rights to lavish Polish biopic ",
    "body": "\n\tLaZona Pictures, the distribution label of Gonzalo Salazar-Simpson’s Madrid-based LaZona group, has acquired Spanish rights to lavish Polish biopic “Chopin, Chopin!” (“Chopin, a Sonata in Paris”), handled for international sales by Paris’ Playtime.\n\n\tMichał Kwieciński’s $17.5 million budget biopic of Frédéric Chopin, produced by Poland’s Akson Studio (“Katyń,” “Warsaw 44”), stars Eryk Kulm (“Filip”) as the prodigious pianist-composer, with Lambert Wilson (“The Matrix Resurrections”) as King Louis-Philippe.\n\t\n\n\tThe 19th-century-set drama tracks Chopin’s arrival in Paris at the age of 21 and his rapid ascent as the city’s romantic idol, before illness refocuses his obsession on composition. \n\n\n\tThe film boasts high-end craft talent including cinematographer Michał Sobociński (“The New Look”), production designer Katarzyna Sobańska (“Cold War”) and writer Bartosz Janiszewski (“Wataha”). \n\n\tShot largely in France with roughly 80% of the dialogue in French, the feature squarely targets upscale audiences and classical-music aficionados while courting broader crossover play via its sweeping, baroque aesthetic.\n\n\tHaving produced since 2003 Spanish top hits such as Enrique Urbizu’s thriller “No Rest for the Wicked” and Emilio Martínez Lázaro’s comedy “Spanish Affair,” the highest-grossing Spanish film ever in Spain, in 2023 LaZona broadened its horizons launching a new film distribution operation, LaZona Pictures, led from 2024 by former Latido Films executive Óscar Alonso.\n\n\t“For us ‘Chopin, Chopin!’ is the first true European ‘super-production’ on the slate — a statement of intent to keep growing, step by step, but also to take bolder swings at films with wider audience potential,”  Alonso said at Valladolid’s Seminci, where LaZona’s co-production “Subsuelo,” by Fernando Franco, world premiered as part of the festival’s main competition.\n\t\n\n\tPositioning “Chopin, Chopin” as a “rock-star portrait of the Romantic era,” Alonso advances that the Spanish release, scheduled for next year’s first quarter, will activate partnerships with opera houses, conservatories and music schools to extend reach beyond core arthouse circuits.\n\n\tLaZona Pictures has been ramping up since last year with a curated line of arthouse and crossover titles. With “Chopin Chopin,” the company has begun early conversations with platforms and broadcasters to complement a planned theatrical rollout. \n\n\t“Chopin, Chopin” has already scored top-tier festival exposure and is lining up further key berths, underscoring its positioning as a prestige event title. \n\n\t“It’s the kind of ambitious European cinema that doesn’t come along every year,” he said. “We’re confident it can resonate with classical-music lovers and a much wider audience drawn to grand, emotionally charged storytelling.”\n\n\tClosing Film at Seville European Film Festival\n\n\tThe film will screen out of competition as the closing night gala title at the upcoming edition of the Seville European Film Festival, which runs Nov. 7-15.\n\n\tOne of LaZona’s biggest hits to date as an indie distributor has been “The Voice of Hind Rajab,” a Venice Silver Lion and San Sebastian Audience Award winner.\n\n\tCo-distributed in Spain with Caramel Films, Tunisian Kaouther Ben Hania’s film, one of the year’s most celebrated international titles, also screened at Valladolid as part of the Constellations sidebar.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "LaZona Pictures Secures Spain on ‘Chopin, Chopin!’ From Playtime (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/Chopin_Chopin-photos-Jaroslaw_Sosinski.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-02T10:10:00.000Z",
      "dateModified": "2025-11-02T10:10:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tribeca Festival Lisboa Dazzles With Meg Ryan, Kim Cattrall, Giancarlo Esposito and On-the-Rise Portuguese Talent",
    "url": "https://variety.com/2025/film/news/tribeca-festival-lisboa-meg-ryan-kim-cattrall-edie-falco-1236568027/",
    "image": "https://variety.com/wp-content/uploads/2025/11/Meg-Ryan-with-Catarina-Furtado-Tribeca-Festival-Lisboa.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-02T18:52:33.000Z",
    "description": "\n\tTribeca Festival Lisboa wrapped its second edition on Saturday after hosting a bevy of U.S. talent, led by Meg Ryan, Kim Cattrall, Edie Falco, Gianc",
    "body": "\n\tTribeca Festival Lisboa wrapped its second edition on Saturday after hosting a bevy of U.S. talent, led by Meg Ryan, Kim Cattrall, Edie Falco, Giancarlo Esposito, Ed Westwick and Daniela Ruah and Piper Perabo and director Stephen Kay, her husband. \n\n\tThe co-organizers – Tribeca Enterprises and Portuguese media group Impresa – said they’re delighted by the way that the spirit of the New York festival is bringing fresh energy to the Portuguese film and TV sector.\n\t\n\n\t“We thought we were only going to do one festival, back in 2002 and now we’re now going to be 25 years old!” commented Jane Rosenthal, Tribeca co-founder and CEO. \n\n\n\t“Continuous learning is what makes any festival a living breathing organism. We look forward to bringing more of our expertise here, especially through our mentorship programs. \n\n\tShe added: “Like New York, Lisbon is a very international city. I feel very much at home here. I have my own Portuguese connection from my childhood in Providence, Rhode Island, where one of our most famous senators was Claiborne Pell, whose father served as U.S. ambassador to Portugal and of course I was lucky to grow up around great Portuguese bakeries!” \n\n\tFrancisco Pedro Balsemão, Impresa CEO, explained that with the success of Tribeca Lisboa  and after attending two editions of Tribeca in New York, he would now like to organize a year-round program of Tribeca-linked initiatives and incorporate the associated mentoring expertise into the wider producing strategy of the Impresa Group: “For this year’s edition we made sure that there are more screening venues, more talks focusing on a wide array of filmmaking skills, bringing it closer to the New York festival, where the Tribeca neighborhood itself is also a key element.”\n\t\n\n\tVarious fruits of the Tribeca-Lisbon connection were highlighted during the fest’s second edition, including Chazz Palmentiri who after attending last year’s edition with his documentary, “A Bronx Tale: The Original One Man Show,” now plans to return to Lisbon to stage the first live performance of his show outside the U.S. \n\n\t“We’ve upgraded this year’s event,” explained Tony Gonçalves, former AT&T-exec, who is one of the fest’s executive producers. “We’ve changed from a one-size-fits-all festival pass to individual ticketing, and most of the films are sold out.” \n\n\t“There’s a lot of resonance between New York City and Tribeca,” says Cara Cusumano, Tribeca’s Festival Director and senior vp of programming. “Our flagship event filled a need of both the city and the local industry. I think that Tribeca Festival Lisboa has that potential as well.”\n\n\tHeld in Lisbon’s Beato Innovation District over Oct. 30–Nov. 1, Tribeca Lisboa showcased five films from the flagship Tribeca festival, together with other U.S. independent films and Portuguese films. \n\n\t“The timing of this festival is perfect to raise awareness, in the buildup to the Awards season,” says Cusumano. “Last year, the Portuguese premiere of ‘Anora’ put us clearly on the radar.”\n\n\tJulian Schnabel’s ‘In the Hand of Dante’ opened this year’s fest, in a ceremony that included a tribute to Impresa Group founder, Francisco Pinto Balsemão, who died Oct. 21. \n\n\tOther titles, that didn’t previously screen in Tribeca in New York, included Yorgos Lanthimos’ “Bugonia,” and Scarlett Johansson’s directorial debut, “Eleanor the Great.” Mexican director Michel Franco attended for the Portuguese premiere of “Dreams.”\n\n\tTwo films from Tribeca’s New York line-up have a direct Portuguese connection: Lilian T. Mehrel’s dark comedy, “Honeyjoon,” shot in the Azores, and Alberto Arévelo’s Spain-to-Portugal road movie, “All We Cannot See.” \n\n\t“Honeyjoon,” which won Tribeca’s AT&T 2024 Untold Stories $1 million award, was produced by Portuguese producer, Andreia Nunes, and had its world premiere at Tribeca in June. “It feels very full circle,” explained Mehrel, “It’s so rewarding to see a film that is inspired by real life, real grief, real love, based on my original trip to the Azores, to be celebrated in New York and now here.”\n\t\n\n\tForeign talent attending the event heaped praise on Portugal. Meg Ryan said she wants to travel to Nazaré, after watching Chris Smith’s documentary series “100 Foot Wave,” featuring Garrett McNamara. “Are those waves real?” she asked. \n\n\tThe event also served to showcase rising international interest in Portuguese film and TV, with one of the highlights being discussion of Netflix’s “Turn of the Tide,” featuring director Augusto Fraga and the lead cast, including José Condessa and veteran actor Joaquim d’Almeida. Almeida recently returned to Portugal after a four decade career in Hollywood. Fluent in five languages, he confided that he gets more nervous when acting in his native tongue. \n\n\tOther Portuguese films screening during the fest included Antonio Ferreira’s colonial war pic, “The Scent of Things Remembered,” Duarte Neves’ feature debut, “Match,” and Fernando Vendrell’s aviation pioneers drama, “Além do Horizonte – A Travessia,” based on his series “Star Sailors.” \n\n\tCasting directors Cindy Tolan, Lucy Bevan and Patricia Vasconcelos provided a  masterclass and held a series of casting sessions with Portuguese actors in the build-up to Passaporte Lisboa, a casting festival that runs in November.\n\n\tVasconcelos who curated this year’s talks, said she’s delighted to program such a wide array of topics, including how to leverage Portugal’s tax incentives. Podcasts were curated by Joana Beleza, who invited various well-known podcasters to the festival, making it possible to reach beyond the immediate fest audience. \n\n\tLatvian producer Matiss Kaza discussed making “Flow,” that won the 2025 Animation Feature Academy Award, and how smaller countries such as Latvia and Portugal can put together international co-productions. \n\n\tLisbon Mayor Carlos Moedas concluded that he’s delighted by this year’s edition: “I want to create dynamism for our city and want to create a dream, and Tribeca is an integral part of that dream.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tribeca Festival Lisboa Dazzles With Meg Ryan, Kim Cattrall, Giancarlo Esposito and On-the-Rise Portuguese Talent",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/Meg-Ryan-with-Catarina-Furtado-Tribeca-Festival-Lisboa.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-02T18:52:33.000Z",
      "dateModified": "2025-11-02T18:52:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Bugonia’ Production Designer on Building the Ranch House, Creepy Basement, Emma Stone’s Office and Hiding Clues in Plain Sight",
    "url": "https://variety.com/2025/artisans/news/bugonia-ranch-house-basement-alien-ship-1236566985/",
    "image": "https://variety.com/wp-content/uploads/2025/10/bugonia-08_4243_D012_00172_R_rgb.jpg?crop=0px%2C57px%2C4500px%2C2531px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-11-02T18:33:00.000Z",
    "description": "\n\tSPOILER ALERT: This story discusses major plot points and reveals the ending for “Bugonia,” currently playing in theaters.\n\n\tIn “Bugonia,” Emma Ston",
    "body": "\n\tSPOILER ALERT: This story discusses major plot points and reveals the ending for “Bugonia,” currently playing in theaters.\n\n\tIn “Bugonia,” Emma Stone plays Michelle Fuller, the CEO of a pharmaceutical company who is kidnapped by Teddy (Jesse Plemons) and his cousin Don (Aidan Delbis). Teddy is a conspiracy theorist who believes Michelle is an alien hellbent on destroying Earth. After kidnapping her, Teddy and Don keep Michelle in a basement as they interrogate her, hoping to get her to confess. \n\t\n\n\tProduction designer James Price knew he had to create contrasting spaces: Michelle’s corporate world, her ultra-modern home, and Teddy and Don’s time-trapped house that felt old and rancid. At the same time, in creating those spaces, he knew he could hide all the clues that spoke to the characters and their respective storylines in plain sight.\n\n\t\n\t\tDon and Teddy’s House\t\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tAtsushi Nishijima/Focus Features\n\t\n\n\n\n\tThe film reunites Price with “Poor Things” director Yorgos Lanthimos. Price knew when he read the script, he knew the house would need to be remote and isolated.\n\n\tTeddy’s lives with his cousin Don. Through flashbacks, audiences learn he once lived in the house with his mother, Sandy (Alicia Silverstone) who is now hospitalized in a coma after using drugs produced by Michelle’s pharmaceutical company.\n\n\tPrice ended up building the house from the ground up, to create a world that was completely immersive. “I wanted to create a living, breathing set, so it’s no longer a set — it’s a place,” he explains.\n\n\tPrice also knew he would need to build a basement since that’s where Teddy and Don keep Michelle. “I’d spent enough time in the United States to realize that the landscape is not too different from the U.K. I said, ‘I think we can do this in the U.K. We can build it here. We can tailor the house to fit our needs, and you can make the film the way you want.’”\n\t\n\n\tPrice designed the house with cinematographer Robbie Ryan in mind. “We could wire and light it like a real house, so everything can be naturally lit,” he realized.\n\n\tPrice also gave the house a backstory. “There was a bit of money once, but it had fallen into bad repair. The family had been in it a long time.” He continued, “The last refit was maybe the late 1990s.”\n\n\tHe set the house in that time warp. In scenes that show Teddy’s mom, the idea was to depict that she hadn’t been around for some time and that Teddy has to look after his cousin. “He finds solace in this theory that there’s an alien conspiracy. We looked at a lot of realtor houses and found reference from real life and eBay. We looked at photojournalism from the early part of the noughties.”\n\n\tAnother influence came from a real-life experience. Says Price, “I’d been to a farmer’s house in New Zealand, and their parents had died when they were teenage boys. Three brothers lived at this beautiful colonial house, and it was disgusting. There was shit everywhere. I knew I’d taken photos, but I couldn’t find any. But I had this vision of what the house should be for that.”\n\n\tPrice also collaborated with the film’s costume designer Jennifer Johnson. During camera tests, the two started talking about clothes, patterns and aging. They discussed how Teddy would have a feeling of grime and unwashed textures. It was a process of finding how far to go to make it believable. “That house tells Teddy’s story.”\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tAtsushi Nishijima/Focus Features\n\t\n\n\n\n\tWhen it came to the basement, the plan was to build it on a stage, but during scouting, someone suggested building the basement underneath the house. “We were lucky that the ground we dug on was clay, so we could excavate.” \n\n\tWithin the basement, there is a secret room that Michelle finds. It reveals “the inner sanctum of where this whole conspiracy has been borne out,” Price explains. Teddy keeps his research – dismembered body parts, heads in jars and photo after photo of people he believed were aliens.\n\n\tIn the script, it was written that there was a wardrobe in front of the door, and she sees a light and pushes it. But Price admitted, “It was a shit idea.” He suggested that the secret room should be insulated and hidden behind the stairs. Price looked for more ideas and decided a chalk face had been carved out within the basement.\n\t\n\n\tWithin the secret room comes Michelle’s discovery: Teddy is a serial killer with wall-to-wall research on aliens. “Maybe there are heads vacuum-packed — the whole tinfoil conspiracy.”\n\n\tAs for Teddy’s idea of what a spaceship looks like, Price decided he would have a 3D printer to create something fantastical yet believable.\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tAtsushi Nishijima/Focus Features\n\t\n\n\n\t\n\t\tMichelle’s World\t\n\n\n\n\t\n\n\t\t\t\t\tMichelle’s office\n\t\t\t\t\t\t\t\t\tAtsushi Nishijima/Focus Features\n\t\n\n\n\n\tIs she an alien? Is she not an alien? That’s the question audiences ask when watching “Bugonia.”\n\n\tHowever, the answer is right there in Price’s production design. “It was tricky to navigate,” he admitted. “But I wanted it to be obvious, if you’re looking at it, that she’s an alien. She lives in a spaceship, her office is a spaceship, in a kind of modernist sense of spaceship.”\n\n\tIn contrast, everything the character says is the opposite. “She’s telling you, and she’s so convincing, she’s not an alien.”\n\n\tPrice leaned into Stanley Kubrick’s “2001: A Space Odyssey” for inspiration on what a spaceship looks like, applying it to the office and the house.  \n\n\tPrice says, “No one’s going to believe it.” He drew on his experience as a production designer from the TV adaptation of “The Ipcress File.” In that, he gave away all the signs in his work. “When you meet Master Dalby, he’s the baddie, but you don’t think he’s the baddie. He’s in a baddie’s lair because he’s got black floors, and everything about the set production and design tells you that guy’s the baddie. But because everything he’s saying is so patriotic and on point, you believe that he’s not the baddie.”\n\n\tPrice put the clues there. He chose a spaceship-like house for Michelle, and her office was minimalist. He said, “This dark carpet leads to this glass box office.”\n\n\tThe Spaceship\n\n\tAs it turns out, Teddy isn’t quite as crazed as he seems. He was right all along, Michelle Fuller is indeed an alien. \n\t\n\n\tAside from the clues hidden in her house and office, Price now had to design and build the spaceship itself. Interestingly, the designs Teddy had imagined were remarkably close to what is eventually revealed in the film. Michelle is an Andromeda, an ancient species that has been watching over humanity since the dawn of time. Humans are a science project dating back to the origins of mankind.\n\n\t In the script, Price knew he wasn’t going to design a traditional spaceship; this was a Yorgos Lanthimos world. The idea was that when the spaceship is revealed, audiences would see Michelle’s throne room. Price explains, “I always had this instinct that it should be organic. I had the idea that the throne room should be a sacred temple, like Stonehenge with some water.” \n\n\tVisually, Price was inspired by the idea of birth and rebirth, a concept he kept returning to throughout the design process. His backstory for the spaceship included a sacred pool at its center. “Everything about this thing comes from this water. I thought it should be a womb-shaped pool, and then everything around it is skeletal.” Price continues, “All the buildings that evolve [from it] are based on human organs like the liver or kidneys. So there’s a lot of human anatomy.” \n\n\tWhile reading the script, Price also came across the concept of a Dyson sphere, a structure that harnesses power from the sun. “I thought, what if this thing is powered by the sun?” \n\n\tBuilding the spaceship was Price’s next challenge. “We had this 50-foot-high thing, and there’s this liquid which is the same color as strawberry milkshake.” While he doesn’t disclose full details, Price says he had fun creating the set. He teases, “The throne room seats became like worn-down teeth. Everything was based on anatomy.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Bugonia’ Production Designer on Building the Ranch House, Creepy Basement, Emma Stone’s Office and Hiding Clues in Plain Sight",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/bugonia-08_4243_D012_00172_R_rgb.jpg?crop=0px%2C57px%2C4500px%2C2531px&resize=1000%2C563"
      ],
      "datePublished": "2025-11-02T18:33:00.000Z",
      "dateModified": "2025-11-02T18:33:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What Was Brandi Carlile Reciting on ‘SNL’? How Thomas Jefferson’s Proclamation About Separating ‘Church & State’ Made It Into a Blazing Rock Song",
    "url": "https://variety.com/2025/music/news/snl-brandi-carlile-church-state-performance-thomas-jefferson-1236567974/",
    "image": "https://variety.com/wp-content/uploads/2025/11/GettyImages-2244165400-e1762101098700.jpg?w=623&h=428&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-02T17:36:49.000Z",
    "description": "\n\tTwo rarities during the musical performances on “Saturday Night Live” this weekend: actual rock ‘n’ roll was performed. Even rarer than that, Thomas",
    "body": "\n\tTwo rarities during the musical performances on “Saturday Night Live” this weekend: actual rock ‘n’ roll was performed. Even rarer than that, Thomas Jefferson was quoted — prominently and at length — in the spot where a guitar solo might have gone. \n\n\tDuring Brandi Carlile‘s performance of the hard-rocking, U2-styled “Church & State,” Carlile offered a spoken recitation between choruses about the title subject. Viewers might have thought the words sounded familiar, but hard to exactly place. From the Constitution, maybe? \n\t\n\n\n\n\n\tNot quite, but close. The words Carlile chose to share with “SNL” viewers are from a riff on the Constitution, if you will — Thomas Jefferson’s famous letter to the Danbury Baptists, from 1802. In words Carlile calmly reads back on her new album, but put across as something closer to a howl on “SNL,” Jefferson write:\n\n\n\t“I contemplate with sovereign reverence that act of the whole American people which declared that their legislature should make no law respecting an establishment of religion, or prohibiting the free exercise thereof, thus building a wall of separation between Church and State.”\n\n\tCarlile rarely speaks too overtly in terms of partisan politics, but it’s clear where she stands, and never more so than in a track that manages to come off as a topical protest song just by virtue of quoting Thomas Jefferson. Add to that Carlile’s own lyrics — “While the empire was failing…” and “I saw the ivory towers before the revolution started” — and it’s clear that “Church & State” is not exactly meant to be an 1802 period piece. \n\t\n\n\tIn recent conversations with Variety about the new album “Returning to Myself,” Carlile talked about writing “Church & State” on Election Night 2024 with her co-producer, Andrew Watt, and band members Phil and Tim Hanseroth, as a protest song, or at least reflection anthem, on what they saw going down in America.\n\n\tAnd, yes, she readily acknowledged the U2 influence that “SNL” viewers were quick to pick up on.\n\n\t“On Nov. 5, we were in the studio as a band, and it wasn’t an introspective night. It was a night where I couldn’t stay off my phone because I was watching myself wake up to a realization about the country that I lived in. And I was listening to ‘Bullet the Blue Sky,’ and I was leaning into my early years and just kind of collecting rage. And we made a burning, searing song that night,” where, she says, she was led to “read a conversation on the First Amendment” into the recording “instead of a guitar solo.”\n\n\tExplained Carlile, “When the lyrics were coming together for that song, I just couldn’t stop thinking of the wisdom of Thomas Jefferson’s address to the Danbury Baptists. There’s so much wisdom in the Constitution, and even the notations on the Constitution are full of wisdom — the footnotes, if you will. What he said to the Baptists was intended to reassure them that they would be allowed to practice their faith, spirituality, religion, however you want to refer to it, freely under the Constitution. But he also makes a really important distinction that we aren’t an autocracy. We’re not a theocracy. We can’t rule over people with our interpretation of an extremely opaque scripture and religion, as it pertains particularly to the Christian religion. Now that we’ve seen over time the integration of so many beautiful cultures and faiths in the United States, it’s a connotation that’s safekeeping for all people, because it allows for the law to be secular as it should be. So I find that to be essential and a life-giving part of that text.”\n\n\tCarlile, who self-identified herself in her bestselling memoir as a person of faith, says in regard to this text and this song, “In my faith, Jesus was clear about not ruling a people based on an interpretation of religion. Even Jesus said, ‘Give unto Caesar what’s Caesar’s.’ So I can’t get behind rules and laws that I know are secretly based on an interpretation of a religion that I can’t get behind, even if I agree with the religion.”\n\t\n\n\tTalking about the pronounced U2 influence in the song, Carlile said that goes back to her youth. “One of my top five favorite albums of all time growing up was ‘The Joshua Tree.’ I even entered a contest one time as Bono when I was 15 to win a singing competition, singing ‘Running to Stand Still.’ I wore sunglasses and shit and I fell on my knees at the end of it. I already had the lesbian haircut that he has, so it wasn’t much of a stretch.”\n\n\tThe musical seed for the song was sewn a while back, before she brought it back up with Watt and the Hanseroth twins on election night. “I got a song from Tim a couple of years ago, this beautiful concept and riff and this drop-D and all of this cognitive dissonance in the song, and I sunk my teeth into it then. And I said, whatever that is, that’s a direction for where I feel like we could go musically. And then I tucked it away in the back of my mind and forgot about it until Nov. 5.” At first it was a blur until co-producer/co-writer Watt got more involved. When her band jams, “it kind of sometimes winds up being a little bit of a sonic tornado, but Andrew had this idea for this separate guitar line, this separate bass line, and I think that’s where it kind of hit the U2 button for me,” with parts that are redolent of peak Edge and peak Adam Clayton. And not to forget peak Larry Mullen Jr.: “Matt Chamberlain just endured with that crazy drum riff. That was an aerobic workout.”\n\n\n\n\t\n\n\t\t\t\t\tMusical guest Brandi Carlile performs “Church & State” on November 1, 2025 \n\t\t\t\t\t\t\t\t\tWill Heath/NBC via Getty Images\n\t\n\n\n\n\tIf you were confused about where the recitation in the song came from, you’re not the only one.\n\n\t“I love Andrew Watt so much. Every time we talk on the phone, he’s like, ‘I fucking love “Church & State,” — I love when you read the Declaration of Independence.’… I love Andrew Watt, man. It doesn’t matter where he thought it came from. He agreed with it, he believed in it and it really excited him. He loved that part of the song and he was so encouraging, and he was in the exact same place that we were.”\n\n\tWhile “Church & State” is rooted in anger, it offers a hopeful denouement. In an album steeped in an awareness of mortality, Carlile takes that as a positive thing when she looks at failing leadership and declares, “When the frailty overcomes them / And they begin to crawl / Reaching out their bloody hands / Guess who gets to make the call? / Well they don’t see, what we see / But we believe, we believe / That they’re not gonna live forever … They’re here today then they’re gone forever… We’ll find a way / Imagine if we could.”\n\t\n\n\tCarlile’s second performance of “SNL” was of a gentler song from the new album that also had a connection to the 2024 election, “Human,” which was written the night before the results came in and refers more obliquely to the mood many felt at the time.\n\n\n\n\n\tCarlile’s appearance on the Miles Teller-hosted episode was her second as a musical guest in 2025. Earlier in the year she sang alongside Elton John to promote their dual album “Who Believes in Angels?”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What Was Brandi Carlile Reciting on ‘SNL’? How Thomas Jefferson’s Proclamation About Separating ‘Church & State’ Made It Into a Blazing Rock Song",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/GettyImages-2244165400-e1762101098700.jpg?w=623&h=428&crop=1"
      ],
      "datePublished": "2025-11-02T17:36:49.000Z",
      "dateModified": "2025-11-02T17:36:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "October Box Office Plunges to Three-Decade Low as Flops Like ‘Tron: Ares,’ ‘Smashing Machine’ Pile Up",
    "url": "https://variety.com/2025/film/box-office/october-box-office-record-low-ticket-sales-smashing-machine-tron-ares-flop-1236567987/",
    "image": "https://variety.com/wp-content/uploads/2025/10/MCDSMMA_EC001.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-02T19:40:14.000Z",
    "description": "\n\tOctober was a bust at the box office as big-budget tentpoles and awards contenders like Disney’s “Tron: Ares” and Dwayne Johnson’s “The Smashing Mac",
    "body": "\n\tOctober was a bust at the box office as big-budget tentpoles and awards contenders like Disney’s “Tron: Ares” and Dwayne Johnson’s “The Smashing Machine” struggled to sell tickets.\n\n\tOverall revenues for the month were tragic with $425 million across all titles, the worst collective haul since October 1997 — when psychological thriller “Kiss the Girls,” slasher “I Know What You Did Last Summer” and supernatural mind-bender “The Devil’s Advocate” were the top-grossing titles — with $385 million, not adjusted for inflation. This ignominious record doesn’t include 2020, when theaters hadn’t rebounded from the pandemic and major studios were less than eager to unveil new films.\n\t\n\n\t“An inauspicious Halloween ended a rather challenging month of October at the box office,” says Comscore’s head of marketplace trends, Paul Dergarabedian.\n\n\n\tSure enough, this Halloween was especially dreadful with grosses between Friday and Sunday at just $49 million, marking the worst weekend of the entire year as holdover titles like Paramount’s Colleen Hoover adaptation “Regretting You” and Universal’s scary sequel “Black Phone 2” topped North American charts. Several reasons were to blame for the scary-low turnout, including a dearth of new releases as well as the misfortune of Halloween landing on a Friday, which meant families were distracted by trick-or-treating. Then there was Saturday night’s Major League Baseball championships, which saw the Los Angeles Dodgers win the World Series over the Toronto Blue Jays in a nail-biting Game 7.\n\n\tBright spots for the month — including Taylor Swift’s “The Release Party of a Showgirl” and Sony and Crunchyroll’s “Chainsaw Man” — were few and far between and weren’t enough to overcompensate for high-profile misses like Luca Guadagnino’s “After the Hunt” ($7.8 million), Disney and 20th Century’s “Springsteen: Deliver Me From Nowhere” ($20 million), and Jennifer Lopez’s musical adaptation “Kiss of the Spider Woman” ($1.6 million). \n\t\n\n\tSci-fi sequel “Tron: Ares” ($126 million globally against a $180 million budget) and A24’s “Smashing Machine” ($19 million against a $50 million budget) were particularly expensive for their respective studios to produce and resulted in tens of millions of dollars in theatrical losses. \n\n\tBut movies of all sizes and genres, including the family adventure “Gabby’s Dollhouse: The Movie” ($68 million), Channing Tatum-led dramedy “Roofman” ($27 million), Aziz Ansari’s fantastical comedy “Good Fortune” ($14 million) and Neon’s supernatural thriller “Shelby Oaks” ($3.2 million), struggled to appeal to their target audiences. \n\n\t“The major releases this month failed to deliver. Simple as that,” says box office analyst Jeff Bock of Exhibitor Relations. He also believes that Hollywood under-delivered on scary movies during the spookiest month of the year. “Apart from the moderately successful ‘Black Phone 2,’ there just weren’t enough horror films to entice moviegoers,” Bock adds. “That should be a no-brainer.”\n\n\tOverall, it’s been an up-and-down year; April was unexpectedly huge with “A Minecraft Movie” and “Sinners” while March was abysmal with “Snow White” and “The Alto Knights.” Currently, box office returns are 2.9% ahead of 2024 — a gap that’s been rapidly shrinking since summer, when ticket sales were 25% ahead of last year. Meanwhile, domestic revenues remain more than 22% behind pre-pandemic times of 2019, according to Comscore. November and December releases, including “Zootopia 2,” “Wicked: For Good” and “Avatar: Fire and Ash,” are expected to close the year on a high note.\n\n\t“Not to fear though,” Bock says. “Holiday season kicks into gear next weekend — and Hollywood will be breathing a huge sigh of relief.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "October Box Office Plunges to Three-Decade Low as Flops Like ‘Tron: Ares,’ ‘Smashing Machine’ Pile Up",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/MCDSMMA_EC001.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-02T19:40:14.000Z",
      "dateModified": "2025-11-02T19:40:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Duane Roberts, Inventor of the Frozen Burrito, Dead at 88",
    "url": "https://www.tmz.com/2025/11/02/duane-roberts-frozen-burrito-inventor-dead/",
    "image": "https://imagez.tmz.com/image/e8/16by9/2025/11/02/e87cbe394ee84d7e868f60ed0a7017b5_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-02T17:51:04.000Z",
    "description": "\n    \n                    \n                          Duane Roberts\n                          Billionaire Who Invented Frozen Burrito Dead at 88\n      ",
    "body": "\n    \n                    \n                          Duane Roberts\n                          Billionaire Who Invented Frozen Burrito Dead at 88\n                      \n                  \n                        Published November 2, 2025 9:51 AM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Duane Roberts -- the billionaire businessman credited with inventing the frozen burrito -- has died ... TMZ has learned.\n      \n    \n          In a statement, his wife, Kelly J. Roberts says he passed away peacefully in his sleep Saturday night, just days shy of his 89th birthday. He was surrounded by family and their three dogs when he died.\n      \n    \n          Kelly called her husband \"a visionary entrepreneur, devoted husband, and a man whose heart and generosity forever shaped our family and community.\"\n      \n\n          She continued, \"I feel so blessed to have shared 35 wonderful years of marriage with Duane. Together, we built a beautiful life working side by side.\" She shared Duane was an incredible husband and stepfather and a loving grandfather whose wisdom and warmth touched every generation of their family.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Fun fact -- his stepchildren, Doug and Casey Reinhardt, both appeared on MTV's \"The Hills.\"\n      \n    \n          After serving honorably in the U.S. military, he went on to revolutionize the food industry with the frozen burrito in 1956.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Beyond business, Duane was a proud philanthropist and developer ... best known for restoring the Mission Inn Hotel & Spa in Riverside, California. His generosity also extended to animal welfare, education, veterans, and the arts.\n      \n    \n          Duane was 88.\n      \n    \n          RIP.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                RIP\n              \n                          \n                Fairly Legal\n              \n                          \n                News\n              \n                          \n                Famous Food\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Duane Roberts, Inventor of the Frozen Burrito, Dead at 88",
      "image": [
        "https://imagez.tmz.com/image/e8/16by9/2025/11/02/e87cbe394ee84d7e868f60ed0a7017b5_xl.jpg"
      ],
      "datePublished": "2025-11-02T17:51:04.000Z",
      "dateModified": "2025-11-02T17:51:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nine Injured in Shooting at Ohio Airbnb Party Packed with Teens",
    "url": "https://www.tmz.com/2025/11/02/nine-injured-ohio-airbnb-party-shooting/",
    "image": "https://imagez.tmz.com/image/e9/16by9/2025/11/02/e9b1a7eae64a4d6d81cba4d81ea2631f_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-02T19:02:26.000Z",
    "description": "\n    \n                    \n                          Ohio Airbnb\n                          Nine Shot at Wild Party\n                      \n            ",
    "body": "\n    \n                    \n                          Ohio Airbnb\n                          Nine Shot at Wild Party\n                      \n                  \n                        Published November 2, 2025 11:02 AM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          A teenage birthday party promoted on social media turned into a night of chaos and gunfire in Ohio, with police confirming nine people were injured after shots rang out at a packed Airbnb rental.\n      \n    \n          Police say officers were called just after midnight following multiple 911 calls reporting shots fired inside the home. The massive party, filled mostly with juveniles, had been advertised online, drawing a crowd that quickly spiraled out of control.\n      \n    \n          By the time cops arrived, most of the partygoers had fled. Inside, first responders found victims suffering from gunshot wounds and other injuries scattered across the first floor of the house. Shell casings littered the scene as officers worked to secure the property.\n      \n    \n          Police said Airbnb rentals are banned in the town, and the homeowner is now facing questions about how the illegal party even happened.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Weapons & Guns\n              \n                          \n                Party All The Time\n              \n                          \n                Crime\n              \n                          \n                Fairly Legal\n              \n                          \n                Shootings\n              \n                          \n                News\n              \n                          \n                Halloween\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nine Injured in Shooting at Ohio Airbnb Party Packed with Teens",
      "image": [
        "https://imagez.tmz.com/image/e9/16by9/2025/11/02/e9b1a7eae64a4d6d81cba4d81ea2631f_xl.jpg"
      ],
      "datePublished": "2025-11-02T19:02:26.000Z",
      "dateModified": "2025-11-02T19:02:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Babes in Bed ... Sleep In an Extra Hour and Wake Up to These Hotties!",
    "url": "https://www.tmz.com/2025/11/02/babes-bed-sleep-in-extra-hour/",
    "image": "https://imagez.tmz.com/image/93/16by9/2025/10/28/93a61b863fb546e9b94cc90fa20adb55_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-02T20:00:44.000Z",
    "description": "\n    \n                    \n                          Hot Babes\n                          Left And Right\n                          Relaxing In Bed!\n   ",
    "body": "\n    \n                    \n                          Hot Babes\n                          Left And Right\n                          Relaxing In Bed!\n                      \n                  \n                        Published November 2, 2025 12:00 PM PST\n                                                                            \n      \n    \n      \n        \n              \n    \n    \n          It's that time of the year when we turn our clocks back an hour ... and since we all have some extra time in the sack, we've got a gallery of hot babes in bed to keep you occupied under the covers!\n      \n    \n          Hey, a little beauty sleep never hurt anyone ... especially not for hotties like Stassie Karanikolaou or Meredith Duxbury!\n      \n    \n          Just make sure you've got the AC running -- we guarantee the photos of Delilah Hamlin and PinkPantheress relaxing in bed will heat up the room!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Hot Bodies\n              \n                          \n                Photo Galleries\n              \n                          \n                Fairly Legal\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Babes in Bed ... Sleep In an Extra Hour and Wake Up to These Hotties!",
      "image": [
        "https://imagez.tmz.com/image/93/16by9/2025/10/28/93a61b863fb546e9b94cc90fa20adb55_xl.jpg"
      ],
      "datePublished": "2025-11-02T20:00:44.000Z",
      "dateModified": "2025-11-02T20:00:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ty Dolla $ign Headlines David Dobrik's Epic Halloween House Party",
    "url": "https://www.tmz.com/2025/11/02/ty-dolla-sign-david-dobrick-halloween/",
    "image": "https://imagez.tmz.com/image/80/16by9/2025/11/02/8019c848bfdd404b9ecfd07e8bf6c0dc_xl.png",
    "tag": "Entertainment",
    "date": "2025-11-02T19:58:44.000Z",
    "description": "\n    \n                    \n                          Ty Dolla $ign\n                          Priceless Halloween Performance Turns Out David Dobrik's ",
    "body": "\n    \n                    \n                          Ty Dolla $ign\n                          Priceless Halloween Performance Turns Out David Dobrik's Epic Bash\n                      \n                  \n                        Published November 2, 2025 11:58 AM PST\n                                                                            \n      \n    \n        \n                    \n                  \n      \n    \n          Ty Dolla $ign blew the roof off at David Dobrik's Halloween house party, making the streamer's favorite night of the year one to remember ... and TMZ has exclusive details.\n      \n    \n          The Grammy-nominated artist and DJ PNP West thrilled the packed-out crowd with bangers like \"Don't Kill the Party,\" \"Paranoid\" and \"Or Nah,\" while guests danced the night away.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          In between songs, partygoers snacked on a massive IT’SUGAR Halloween candy bar which also featured David’s new Wavers by The Original Doughbrik’s Snacks. They stayed energized with Celsius, and hydrated with Voss.\n      \n\n                  \n          \n                          \n                \n                  \n      \n    \n          And Ty wasn't the only source of entertainment ... guests also enjoyed a dynamic lineup of activities, including a chance to win $1,000 at the Roobet Casino wheel, paired with casino games, an interactive photo booth, and an open bar featuring Cazcanes Tequila cocktails. The Cazcanes custom menu of themed drinks included the Mystic Margarita with Cazcanes No. 7 Blanco Tequila, the Midnight Spell featuring Cazcanes No. 7 Reposado Tequila, and the Killer Kiss crafted with Cazcanes No. 7 Blanco Tequila, plus Peroni beer.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Check out the video to be a fly on the wall of the exclusive invite-only event which transformed DD's home into an orange and purple Halloween wonderland.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Ty Dolla Sign\n              \n                          \n                David Dobrik\n              \n                          \n                Hip Hop\n              \n                          \n                Music\n              \n                          \n                Influencers\n              \n                          \n                Halloween\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ty Dolla $ign Headlines David Dobrik's Epic Halloween House Party",
      "image": [
        "https://imagez.tmz.com/image/80/16by9/2025/11/02/8019c848bfdd404b9ecfd07e8bf6c0dc_xl.png"
      ],
      "datePublished": "2025-11-02T19:58:44.000Z",
      "dateModified": "2025-11-02T19:58:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Stars and Scars -- You Be the Judge",
    "url": "https://www.tmz.com/2025/11/01/polls-you-be-the-judge/",
    "image": "https://imagez.tmz.com/image/81/16by9/2025/10/31/81aba46c6a164d5f88bef5ada2c621bd_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-01T07:45:27.000Z",
    "description": "\n    \n                    \n                          Stars and Scars\n                          You Be the Judge\n                      \n               ",
    "body": "\n    \n                    \n                          Stars and Scars\n                          You Be the Judge\n                      \n                  \n                        Published November 1, 2025 12:45 AM PDT\n                                                                            \n      \n    \n          Is Trump toying with us, musing he might run again in 2028? And really Kim, that tin foil hat is a fashion miss! So we gotta ask ...\n      \n      \n      \n          \n            \n              \n                \n                Share on Facebook\n              \n            \n            \n              \n                \n                Share on X\n              \n            \n                          \n                \n                  \n                \n              \n                      \n        \n              \n          \n                          \n                Stars and Scars\n              \n                      \n        \n          \n  ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Stars and Scars -- You Be the Judge",
      "image": [
        "https://imagez.tmz.com/image/81/16by9/2025/10/31/81aba46c6a164d5f88bef5ada2c621bd_xl.jpg"
      ],
      "datePublished": "2025-11-01T07:45:27.000Z",
      "dateModified": "2025-11-01T07:45:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]