[
  {
    "title": "Alan Ritchson, Charlize Theron, Florence Pugh Lead Netflix’s 2026 Australia-New Zealand Slate",
    "url": "https://variety.com/2026/tv/news/alan-ritchson-charlize-theron-florence-pugh-netflix-2026-australia-new-zealand-slate-1236664478/",
    "image": "https://variety.com/wp-content/uploads/2026/02/War-Machine-Apex.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-17T01:00:00.000Z",
    "description": "\n\tAlan Ritchson, Charlize Theron and Florence Pugh are among the stars headlining Netflix‘s 2026 Australia-New Zealand slate.\n\n\tThe lineup includes se",
    "body": "\n\tAlan Ritchson, Charlize Theron and Florence Pugh are among the stars headlining Netflix‘s 2026 Australia-New Zealand slate.\n\n\tThe lineup includes several high-profile international productions that utilized Australian locations and crews. Victorian filmmaker Patrick Hughes returned home to helm “War Machine,” an action sci-fi feature shot in Bright, Myrtleford, Melbourne and Docklands Studios. The film, set during the final 24 hours of an elite military selection programme, stars Ritchson alongside Dennis Quaid, Stephan James, Jai Courtney, Esai Morales, Blake Richardson, Keiynan Lonsdale and Daniel Webber. Hughes co-wrote the screenplay with James Beaufort. Todd Lieberman and Alexander Young produce for Hidden Pictures, with Patrick Hughes and Greg McLean producing for HUGE FILM and Rich Cook for Range. It premieres March 6.\n\t\n\n\tTheron toplines “Apex,” an action thriller directed by Baltasar Kormákur that filmed in the Blue Mountains and Canberra. The April 24 release, which also stars Taron Egerton and Eric Bana, follows a grieving woman testing her limits in the Australian wilderness who becomes ensnared in a deadly game. Peter Chernin, Jenno Topping and David Ready produce for Chernin Entertainment, Ian Bryce for Ian Bryce Productions, Charlize Theron, A.J. Dix and Beth Kono for Secret Menu, and Kormákur for RVK Studios.\n\n\n\tPugh headlines “East of Eden,” a contemporary reimagining of John Steinbeck’s classic novel shot in New Zealand. The limited series, which explores the multigenerational saga of the Trask family with renewed focus on antihero Cathy Ames, features Christopher Abbott, Mike Faist, Hoon Lee, Tracy Letts, Martha Plimpton, Ciarán Hinds, Joseph Zada and Joe Anders. Zoe Kazan serves as co-showrunner, writer and executive producer alongside co-showrunner Jeb Stuart. Garth Davis and Laure de Clermont-Tonnerre direct and executive produce, with Fifth Season and Anonymous Content producing.\n\t\n\n\tThe third and final season of “Heartbreak High” will premiere March 25, following Hartley High’s graduating class as they navigate a revenge prank gone wrong. The Fremantle Australia and NewBe series, created by Hannah Carroll Chapman, stars Ayesha Madon, James Majoos, Chloé Hayden, Asher Yasbincek and Thomas Weatherall.\n\n\tNetflix also revealed the first look for “My Brilliant Career,” an adaptation of Miles Franklin’s iconic novel filmed in Adelaide. The series stars Philippa Northeast as Sybylla, a young woman in 1901 Australia determined to become a writer despite her family’s plans to marry her off. Liz Doran adapted and wrote the series, which is produced by Jungle Entertainment with Alyssa McClelland and Anne Renton directing.\n\n\n\n\t\n\n\t\t\t\t\t“My Brilliant Career”\n\t\t\t\t\t\t\t\t\tNetflix\n\t\n\n\n\n\tAdditional Australian productions include “Allen,” a film from Ludo Studio (the makers of “Bluey”) starring T.J. Power, created by Daley Pearson and shot in Brisbane and the Gold Coast; and “Breakers,” the first Netflix series filmed in Western Australia. The latter, from Clerkenwell Films and BBC Studios Australia Productions, stars Antony Starr, D’Pharaoh Woon-A-Tai, Oliver Edis and Annabel Wolfe in a drama about two American backpackers drawn into a mysterious surf community. Mary Nighy and Ng Choon Ping direct from a script by Pete Jackson.\n\n\tPeter Berg’s “The Mosquito Bowl,” based on Buzz Bissinger’s book about college football stars who enlisted in the Marines following Pearl Harbor, filmed in Brisbane and the Gold Coast. The World War II drama stars Nicholas Galitzine, Bill Skarsgård, Ray Nicholson, Tom Francis, Brent Comer and Dominic Bogart, with Berg and Mark L. Smith writing. Peter Berg produces for Film 44, with Brian Grazer for Imagine Entertainment and Alex Gayner.\n\n\tIn unscripted, “The Golden Ticket” filmed on the Gold Coast with Eureka Productions. The competition series challenges contestants to find golden tickets and navigate games inside a retro-futuristic dreamscape inspired by Roald Dahl’s world.\n\n\tThe animation slate includes “Stranger Things: Tales From ’85,” produced by Sydney-based Flying Bark Productions with the Duffer Brothers executive producing, and “Steps,” a Cinderella reimagining from Netflix Animation Studios produced in Sydney with animation production shared with Vancouver. The latter features voice work from Ali Wong and Stephanie Hsu, with Amy Poehler, Jane Hartwell and Kim Lessing producing.\n\t\n\n\tThis is the first slate overseen by Amanda Duthie, Netflix’s newly appointed content director for the territory.\n\n\t“Throughout my career, I’ve seen that local stories resonate most powerfully when they’re deeply specific, true to a character, a community or a moment in time,” Duthie said. “This 2026 slate brings together stories that differ widely in tone, scale and ambition, from every corner of the region.”\n\n\tSince 2021, Netflix has invested more than AU$10 million ($7 million) in building capacity across the Australian and New Zealand screen industries through paid placements, training and development initiatives, particularly for emerging and underrepresented practitioners.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Alan Ritchson, Charlize Theron, Florence Pugh Lead Netflix’s 2026 Australia-New Zealand Slate",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/War-Machine-Apex.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-17T01:00:00.000Z",
      "dateModified": "2026-02-17T01:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Francis Ford Coppola Remembers Robert Duvall: ‘Such a Great Actor and Such an Essential Part of American Zoetrope’",
    "url": "https://variety.com/2026/film/news/francis-ford-coppola-tribute-robert-duvall-the-godfather-1236665033/",
    "image": "https://variety.com/wp-content/uploads/2026/02/MixCollage-16-Feb-2026-04-36-PM-9908.jpg?crop=0px%2C0px%2C1200px%2C675px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-02-17T01:01:46.000Z",
    "description": "\n\tFrancis Ford Coppola took to Instagram on Monday afternoon to honor his longtime collaborator and friend Robert Duvall, who died on Sunday at the ag",
    "body": "\n\tFrancis Ford Coppola took to Instagram on Monday afternoon to honor his longtime collaborator and friend Robert Duvall, who died on Sunday at the age of 95.\n\n\t“What a blow to learn of the loss of Robert Duvall,” Coppola wrote. “Such a great actor and such an essential part of American Zoetrope from its beginning: ‘The Rain People,’ ‘The Conversation,’ ‘The Godfather,’ ‘The Godfather Part II,’ ‘Apocalypse Now,’ ‘THX 1138,’ ‘Assassination Tango.'”\n\t\n\n\n\tAs noted by Coppola, he collaborated with Duvall on seven films throughout his career: “The Rain People” (1969), “THX 1138” (1971), “The Godfather” (1972), “The Conversation” (1974), “The Godfather Part II” (1974), “Apocalypse Now” (1979) and “Assassination Tango” (2002).\n\n\n\tFellow “Godfather Part II” stars Robert De Niro and Al Pacino also paid tribute to Duvall on Monday. Pacino wrote in a statement shared with Variety, “It was an honor to have worked with Robert Duvall. He was a born actor as they say, his connection with it, his understanding and his phenomenal gift will always be remembered. I will miss him.”\n\n\tDe Niro wrote in his own remembrance, “God bless Bobby. I hope I can live till I’m 95. May he rest in peace.”\n\n\tTributes from Hollywood’s biggest stars flooded social media following the news of Duvall’s death. Viola Davis wrote on Instagram that it was an “honor” to act alongside Duvall in the 2018 thriller “Widows.”\n\n\t“I was in awe,” Davis added, “I’ve always been in awe of your towering portrayals of men who were both quiet and dominating in their humanness. You were a giant… an icon… ‘Apocalypse Now,’ ‘The Godfather,’ ‘To Kill a Mockingbird,’ ‘Tender Mercies,’ ‘The Apostle,’ ‘Lonesome Dove’… etc… Greatness never dies. It stays… as a gift. Rest well, sir. Your name will be spoken… May flights of angels sing thee to thy rest.”\n\t\n\n\tMichael Keaton, who starred with Duvall in Ron Howard’s 1994 workplace comedy “The Paper,” wrote in his own Instagram tribute, “Another friend goes down. Acted with and became friends. Shared a great afternoon on my front porch talking about horses. He was greatness personified as an actor. RIP RD.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Francis Ford Coppola Remembers Robert Duvall: ‘Such a Great Actor and Such an Essential Part of American Zoetrope’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/MixCollage-16-Feb-2026-04-36-PM-9908.jpg?crop=0px%2C0px%2C1200px%2C675px&resize=1000%2C563"
      ],
      "datePublished": "2026-02-17T01:01:46.000Z",
      "dateModified": "2026-02-17T01:01:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Al Pacino and Robert De Niro Remember ‘The Godfather Part II’ Co-Star Robert Duvall: ‘I Will Miss Him’",
    "url": "https://variety.com/2026/film/news/al-pacino-robert-de-niro-tribute-robert-duvall-1236664953/",
    "image": "https://variety.com/wp-content/uploads/2026/02/MixCollage-16-Feb-2026-02-44-PM-3536.jpg?crop=14px%2C19px%2C1175px%2C661px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-02-16T22:49:24.000Z",
    "description": "\n\tAl Pacino and Robert De Niro have paid tribute to Robert Duvall, who died on Sunday at the age of 95.\n\n\t“It was an honor to have worked with Robert ",
    "body": "\n\tAl Pacino and Robert De Niro have paid tribute to Robert Duvall, who died on Sunday at the age of 95.\n\n\t“It was an honor to have worked with Robert Duvall,” Pacino said. “He was a born actor as they say, his connection with it, his understanding and his phenomenal gift will always be remembered. I will miss him.”\n\n\t“God bless Bobby,” De Niro wrote. “I hope I can live till I’m 95. May he rest in peace.”\n\n\n\tPacino starred alongside Duvall in “The Godfather” and “The Godfather Part II.” Pacino played the heir to the Corleone crime family, Michael, while Duvall appeared as Tom Hagen, his lawyer and trusted advisor. While never appearing in the same scene as Duvall, De Niro also starred in “The Godfather: Part II” as a young Vito Corleone.\n\t\n\n\tPacino and De Niro are just two of many Hollywood stars who paid tribute to Duvall. Viola Davis wrote on Instagram Threads that it was an “honor” to appear alongside the “Tender Mercies” star in the 2018 thriller “Widows.”\n\n\t“I was in awe,” Davis added, “I’ve always been in awe of your towering portrayals of men who were both quiet and dominating in their humanness. You were a giant… an icon… ‘Apocalypse Now,’ ‘The Godfather,’ ‘To Kill a Mockingbird,’ ‘Tender Mercies,’ ‘The Apostle,’ ‘Lonesome Dove’… etc… Greatness never dies. It stays… as a gift. Rest well, sir. Your name will be spoken… May flights of angels sing thee to thy rest.”\n\n\tAdam Sandler, who appeared alongside Duvall in the 2022 sports drama “Hustle,” also remembered Duvall on Instagram. He wrote, “Such a great man to talk to and laugh with. Loved him so much. We all did. So many movies to choose from that were legendary. Watch them when you can. Sending his wife Luciana and all his family and friends our condolences.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Al Pacino and Robert De Niro Remember ‘The Godfather Part II’ Co-Star Robert Duvall: ‘I Will Miss Him’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/MixCollage-16-Feb-2026-02-44-PM-3536.jpg?crop=14px%2C19px%2C1175px%2C661px&resize=1000%2C563"
      ],
      "datePublished": "2026-02-16T22:49:24.000Z",
      "dateModified": "2026-02-16T22:49:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Reservation Dogs’ Star D’Pharaoh Woon-A-Tai Joins Netflix’s ‘Breakers’ With Antony Starr",
    "url": "https://variety.com/2026/tv/news/reservation-dogs-dpharaoh-woon-a-tai-netflix-breakers-1236661379/",
    "image": "https://variety.com/wp-content/uploads/2026/02/P1013PA7.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-16T23:45:00.000Z",
    "description": "\n\t“Reservation Dogs” star D’Pharaoh Woon-A-Tai, who earned an Emmy nomination for the critically acclaimed FX series, has signed on to next star in Ne",
    "body": "\n\t“Reservation Dogs” star D’Pharaoh Woon-A-Tai, who earned an Emmy nomination for the critically acclaimed FX series, has signed on to next star in Netflix’s Australian-based series “Breakers,” opposite Antony Starr. Also joining the cast as series regulars: Oliver Edis (“Gnomes”) and Annabel Wolfe (“Surviving Summer”).\n\n\tAs previously announced, Starr (“The Boys,” “Banshee”) is also executive producer of the project and will play Brando on the show. In “Breakers,” Woon-A-Tai will play Elliott, described as a working-class, shy teen from Rhode Island to comes to an Australian commune for a surf trip before “adult life.” Edis will play Flynn and Wolfe plays Harper.\n\t\n\n\tJoining the show’s supporting cast are Asher Yasbincek (“Heartbreak High”) as Maggie, David Howell (“Run”) as Iggy, Tyroe Muhafidin (“The Lord of the Rings: The Rings of Power”) as Danno, Tom Dawson (“Tenzing”) as Don, Sherry-Lee Watson (“Heartbreak High”) as Astrid, Lu Miller (“Nansie”) as Amara, Eliza Learmonth (“Baby Shower”) as Clementine and Brodie Townsend (“Heartbreak High”) as Kurt.\n\n\n\tProduction on “Breakers” is currently underway in Western Australia. Here’s the logline: “Two best friends go backpacking in Australia and are soon drawn into a seemingly perfect community of surfers led by a charismatic but mysterious figure.”\n\n\tPete Jackson (“The Death of Bunny Munro,” “Somewhere Boy”) is the writer and executive producer; besides Starr and Jackson, other EPs include Gavin O’Grady (“Somewhere Boy,” “This Way Up”), Petra Fried (“Baby Reindeer,” “End of the F-ing World”) and Wim De Greef (“Baby Reindeer,” “End of the F-ing World”).\n\t\n\n\tMary Nighy (“Say Nothing,” “Industry”) and Ng Choon Ping (“What It Feels Like For A Girl,” “Femme”) are directors and Nick Pitt (“Black Mirror – Hang The DJ”) is a producer. Clerkenwell Films (“Baby Reindeer,” “The End Of The F-ing World”), a part of BBC Studios, is the studio, along with BBC Studios Productions Australia.\n\n\t“Shooting ‘Breakers’ in Western Australia lets us tell this story in the way we imagined, partner with fantastic local crews in a truly unique location, and showcase this spectacular coastline on screen,” De Greef said in a statement.\n\n\tKnown for his breakout as Bear in “Reservation Dogs,” Woon-A-Tai also received two Critics Choice Award nominations for best actor in addition to his lead actor in a comedy Emmy nom — making him the first Indigenous actor ever nominated in a lead acting category.\n\n\tWoon-A-Tai’s other credits include Alex Garland’s “Warfare” and Darren Aronofsky’s “Caught Stealing.” Additional credits include “Beans,” named best motion picture at the Canadian Screen Awards, as well as the coming-of-age “Fitting In” with Emily Hampshire and Maddie Ziegler, the indie thriller “Only the Good Survive, “Hell of a Summer” Finn Wolfhard and Fred Hechinger, and the digital series “Normal Ain’t Normal.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Reservation Dogs’ Star D’Pharaoh Woon-A-Tai Joins Netflix’s ‘Breakers’ With Antony Starr",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/P1013PA7.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-16T23:45:00.000Z",
      "dateModified": "2026-02-16T23:45:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Remembering Robert Duvall, Whose Acting Brilliance Colored in the Light and Dark Sides of Humanity",
    "url": "https://variety.com/2026/film/columns/remembering-robert-duvall-the-godfather-apocalypse-now-1236664873/",
    "image": "https://variety.com/wp-content/uploads/2026/02/MSDAPOS_EC021.jpg?crop=0px%2C0px%2C3526px%2C1983px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-02-16T22:29:48.000Z",
    "description": "\n\tWhen you think of the great actors (Brando, Streep, De Niro, Ullmann, Day-Lewis), one of the first qualities that leaps to mind is range. Robert Duv",
    "body": "\n\tWhen you think of the great actors (Brando, Streep, De Niro, Ullmann, Day-Lewis), one of the first qualities that leaps to mind is range. Robert Duvall, who died Sunday at 95 and was most assuredly one of the great actors, had that quality to the nth degree. He was a sly-dog virtuoso whose roster of indelible characters included a broken-down country singer, a Mafia consigliere, a charismatic Pentecostal preacher, a psychotic Army commander, a corrupt TV news executive and a creepy neighbor who lives in the shadows, not to mention a whole lot of cowboys and also Dwight D. Eisenhower and Joseph Stalin. Born in California and raised in Maryland, Duvall, as much or more than any actor of his time, had a deep identification with the world of the South. In one role after another, he used a drawl and a laidback cadence to portray men from that region — both charmers and killers, each subtly different from the last, chiseling every character with a jeweler’s precision.\n\t\n\n\tYet when I think of the range that Duvall expressed in his acting, I don’t simply mean his chameleonic quality. I’m talking about something more primal and emotional — the way that he navigated the light and dark sides of experience with an alternating current of quietude and fury, tenderness and violence. His characters could be loving…or brutish. Gentle…or murderous. And — this was the spice in his gumbo — sometimes both at once. It’s no exaggeration to say that Duvall’s acting career added up to an exploration of the duality of all of us.\n\n\n\tHe first came to people’s attention as Boo Radley, the mysterious recluse in the 1962 film adaptation of “To Kill a Mockingbird.” The duality was already there, in the way that everyone around him thought Boo was a monster, but he turned out to be a protector. Duvall came from the stage and did a lot of television work in the ’60s, but after making his mark in “M*A*S*H” (as the uptight soldier beau of “Hot Lips” Houlihan), he took on a role that became defining: Tom Hagen, the dutiful, trusted Irish-German lawyer and counselor to the Corleone family in “The Godfather” and its sequel. Though part of a crime syndicate, Duvall’s Hagen had qualities that seemed both corporate and priestly: a calm sense of rectitude and loyalty, along with an eerie ability to fade into the woodwork when necessary. The performance was so convincing that it was hard, at that point, not to look at Duvall and assume that those qualities defined him as an actor.\n\t\n\n\tYet as memorable as he was playing Tom Hagen as an insider who remained, somehow, on the outside, Duvall was also biding his time, waiting to show audiences everything he could do. In “Network” (1976), as the profit-hungry executive vice president of the UBS TV network, he let loose in a new way, as in the outrageous moment when Howard Beale’s crazed TV show first tastes success, and Duvall’s Frank exclaims, with reckless glee, “It’s a big, big-titted hit!” This was the other side of Duvall: the showman boiling over with bluster, the amoral life of the party, with a grin as wide as a shark’s. So here was the grand paradox, and the real meaning of Duvall’s range. Few could portray a courtly gentleman as convincingly as he did; he could embody the soul of decency. Yet he was also driven to explore the dark side, and he did so as profoundly as any actor of the last half century.      \n\n\tIn 1979, he did it in two extraordinary ways. In “The Great Santini,” Duvall gave what felt at the time – and still does – like the defining performance as a father who cripples his children with the harshness of his demands. We’ve seen this kind of movie so often now that it’s a genre unto itself. But Duvall still owns it; his “Bull” Meechum is a hypnotically layered hard-ass who’s a destructive father yet can never be written off as a villain. Duvall’s understanding of him is too rich. And in “Apocalypse Now,” Duvall, as the surf-happy, bare-chested, U.S. Cavalry-hatted Vietnam officer Lt. Col. Kilgore, let loose with a memorable maniac of a character who was so gloriously satirical and, at the same time, so vividly real that he gave Francis Ford Coppola’s movie a huge swatch of its meaning. Duvall’s delivery of the line “I love the smell of napalm in the morning. It smells like…victory” made it the deadly funny swan song of America’s imperial reign of military might. (It’s not that we didn’t try again; it’s that Duvall’s portrayal of lock-jawed insanity showed you why it would no longer work.)\n\n\tAnd after that, Duvall was just getting started. Going forward, his performances would now make a point of drawing on both sides of the duality. That’s why he won the Oscar for best actor in “Tender Mercies” (1983): His Mac Sledge was a taciturn recovering alcoholic who spent the entire movie trying to straighten up and fly right, but what made the performance great was its haunted undercurrent — the hint, communicated by Duvall between the lines, of all the bad places that Mac had been. You could feel that same richness, that ripe moral ripple of a man teetering between being a knight and a scoundrel, in the L.A. police drama “Colors” (1988) and in “Lonesome Dove,” the 1989 TV Western miniseries that allowed Duvall to give one of his most expansive performances.\n\t\n\n\tAnd his greatest performance? To me, it’s the one Duvall gives in “The Apostle,” the 1997 drama he also directed. The movie is one of the authentic masterpieces of the independent-film era, and it contains, quite simply, one of the greatest pieces of screen acting you will ever see. Duvall plays “Sonny” Dewey, a local rock star of a Pentecostal preacher who occupies a position of extreme power in his Texas church. He’s a deeply religious man; he’s also a narcissist who lives for his own gratification. That’s why his wife (played by Farrah Fawcett) has begun an affair with a younger minister, and is trying to depose him at the church. At a Bible-camp softball game, Sonny picks a fight with the minister and ends up tapping him on the head with a baseball bat.\n\n\tIt is not the most violent of smashes. Yet in that very ambiguity, the question is raised: How violent is this man of God? Is he merely angry, or is he homicidal? Duvall is really asking: What, deep down, is in his heart? In all our hearts? And that’s the question Duvall asked throughout his career. “The Apostle” is a character study in which we watch the sacred and the profane, the worship of God and the worship of the self, battle it out in one man’s soul. Sonny escapes the law and sets up a new church, and as he begins to preach in that church, the words pouring out of him as if he were an auctioneer speaking in tongues, Duvall’s performance becomes nearly symphonic. The film is so staggering, so moving, that by the end you feel floored. What Duvall has shown you is the full range of what a human being is.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Remembering Robert Duvall, Whose Acting Brilliance Colored in the Light and Dark Sides of Humanity",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/MSDAPOS_EC021.jpg?crop=0px%2C0px%2C3526px%2C1983px&resize=1000%2C563"
      ],
      "datePublished": "2026-02-16T22:29:48.000Z",
      "dateModified": "2026-02-16T22:29:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Nina Roza’ Review: An Eerily Doubled, Intricately Mirrored and Deeply Moving Reflection on Immigrant Identity",
    "url": "https://variety.com/2026/film/reviews/nina-roza-review-1236664817/",
    "image": "https://variety.com/wp-content/uploads/2025/08/MixCollage-09-Aug-2025-01-19-PM-7078.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-16T22:20:22.000Z",
    "description": "\n\tThe immigrant experience is most often discussed, and most easily understood, as one of an entire person’s movement and relocation: a journey from A",
    "body": "\n\tThe immigrant experience is most often discussed, and most easily understood, as one of an entire person’s movement and relocation: a journey from A to B and perhaps further letters, with concomitant processes of discovery and nostalgia, alienation and adaptation. It’s less simple, however, to articulate the disembodying nature of immigration: the sense of a phantom self left behind, living the life that might have been, and uncannily confronting you when you return. A film of many subtle, tricky marvels, Geneviève Dulude-De Celles‘s slowly bewitching “Nina Roza” comes closer than many to conveying that strange, imprecise separation of the soul — through both lucidly expressed feeling, and artfully built narrative structure.\n\t\n\n\tOne of the quiet surprises of this year’s Berlin Film Festival competition, the Québécois filmmaker’s notably assured second feature arrives seven years after her debut “A Colony” won the Crystal Bear in the same fest’s youth-oriented Generation Kplus sidebar. That film, a simple but piercing portrait of a shy teen caught between opposing peer influences, was familiar in some ways but auspicious in the calm depth of its gaze — and that humane poise is present again in “Nina Roza,” this time in service of more complex characters and more finely calibrated conflicts. The pensive sophistication and opalescent style with which the film unparcels its ideas might not please arthouse crowds wanting broader emotional gestures, but Dulude-De Celles may be a festival-circuit major in the making.\n\n\n\tIt’s nearly 30 years since Mihail (a marvelous Galin Stoev) left Bulgaria following the death of his wife, taking their young daughter Roza to begin a new life in Montreal. Over time, he has established himself as a leading contemporary art consultant, often called on by collectors and curators to research and validate new talents — though he’s somewhat thrown when regular client Christophe (Christian Bégin) requests his expertise regarding Nina (played by identical twins Sofia and Ekaterina Stanina), an eight-year-old painter in rural Bulgaria whose naïvely abstract but vibrantly composed canvases have gone viral after being discovered by Italian talent scout Giulia (Chiara Caselli). Agents and gallery owners are abuzz; Christophe wants Mihail to determine if the hype is real.\n\t\n\n\tWary not just of alleged child prodigies, but also of returning to a homeland he hasn’t set foot in since his initial departure, Mihail is reluctant to take the job. He’s spurred to do so, however, by Roza (Michelle Tzontchev), a single parent who now tellingly goes by the anglicized Rose, but is troubled by her growing distance (and more so, her young son’s) from her cultural roots — and her fading memories of a mother who didn’t travel and change with them. \n\n\tOn his arrival in Bulgaria, ambiguities abound, both regarding his professional reason for being there (as Nina, beguiling but hard to read, claims she no longer wishes to paint) and his unwanted reconnection with home. On the one hand, he’s haunted by what’s familiar and constant from his past there. On the other, he’s treated as a visitor by the locals, who mock his accent and distrust his watchful presence; only he can sense in himself any trace of national belonging.\n\n\tA Bulgarian-Canadian theater director making his film acting debut, Stoev is a compelling thinker on screen: There’s a wounded gravity to his silences that can tilt the direction of a sparsely written scene, while his remarkable face, storied in its lines and hollows and textures, rewards the camera’s sustained scrutiny. But the film makes dialogue count when it wants to: An acrid reunion scene with Mihail’s estranged sister Svetlana (a superb, seething Svetlana Yancheva) is propelled by the vituperative, frankly expressed resentment of those left behind. “Who told you I wanted to see you?” she spits, making clear where her brother truly isn’t at home.\n\n\tNina, meanwhile, may or may not be a great artist, but she’s wily and evidently special, with a perspective rooted in her humble, rugged surroundings. (We’re even told the paints she uses, with their unusually earthy colors, are made from natural pigments of the region.) She’s also the exact age Roza was when Mihail uprooted her from Bulgaria, and the longer he spends with Nina, the more she becomes a proxy for Roza’s parallel, non-immigrant self — especially as she faces a similar crossroads, with Giulia and Nina’s opportunistic family eager to move her to Italy, where she’s to attend a prestigious art academy. Nina would rather remain loyal to her soil.\n\n\tIt’s a doubling that Dulude-De Celles never makes overly literal or contrived, but underlines with deft editorial sleight of hand, and the inspired twin casting of Nina, whose temperament and outlook do shift imperceptibly from scene to scene. Alexandre Nour Desjardins’s elegant, glimmering cinematography also plays with the concealing properties of bronzed magic-hour light and minty morning mist, the romantic beauty of the images encroaching on Mihail’s resolve to see things for what they are. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Nina Roza’ Review: An Eerily Doubled, Intricately Mirrored and Deeply Moving Reflection on Immigrant Identity",
      "image": [
        "https://variety.com/wp-content/uploads/2025/08/MixCollage-09-Aug-2025-01-19-PM-7078.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-16T22:20:22.000Z",
      "dateModified": "2026-02-16T22:20:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Anderson Cooper Set to Exit CBS News’ ’60 Minutes’",
    "url": "https://variety.com/2026/tv/news/anderson-cooper-exit-60-minutes-cbs-news-1236664874/",
    "image": "https://variety.com/wp-content/uploads/2021/06/Anderson-Cooper.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-16T21:50:47.000Z",
    "description": "\n\tAnderson Cooper will exit CBS News‘ “60 Minutes” after nearly 20 years of contributing to the program, according to a person familiar with his think",
    "body": "\n\tAnderson Cooper will exit CBS News‘ “60 Minutes” after nearly 20 years of contributing to the program, according to a person familiar with his thinking, the latest blow to the revered Sunday-night newsmagazine after it has been undermined repeatedly by management at Paramount Skydance and its predecessor company.\n\n\t“Being a correspondent at ’60 Minutes’ has been one of the highlights of my career. I got to tell amazing  stories, and work with some of the best producers, editors and camera crews in the business,” Cooper said in a statement. “For nearly twenty years, I’ve been able to balance my jobs at CNN and CBS, but I have little kids now and I want to spend as much time with them as possible, while they want to spend time with me.”\n\t\n\n\tCooper was said to be in negotiations with CBS about a renewal in recent weeks, but opted to put more of his focus on activities at CNN. In addition to his long-running 8 p.m. program at the Warner Bros. Discovery-backed network, Cooper also hosts a podcast centered around discussions of grief that has become increasingly popular, and hosts a Sunday longform programed called “The Whole Story.”\n\n\n\tCBS News said Monday evening that it was “grateful” to Cooper for “dedicating so much of his life to this broadcast, and understand the importance of spending more time with family. 60 Minutes will be here if he ever wants to return.”\n\n\tBreaker, a newsletter centered on the media industry, previously reported Cooper’s intention to leave. Cooper late last year signed a deal to extend his stay at CNN.\n\n\tCooper’s decision to leave may have been a difficult one. People who know the journalist say one of the true joys of his career has been the ability to cut himself free from breaking news and focus on deeper reportage for a program that is devoted to longer-form storytelling.\n\t\n\n\tHis departure would pose a new blow to CBS News under the tenure of its editor in chief, Bari Weiss. Since arriving at CBS News last year, installed at the unit’s news leader after Paramount Skydance acquired her conservative opinion site, The Free Press, for a reported $150 million, Weiss has worked to overhaul the operation — but has also made a number of gaffes. One of those was a decision to delay a “60 Minutes” report by correspondent Sharyn Alfonsi on the violent circumstances of migrants deported by the U.S.  — not because it contained errors, but because Weiss wanted a Trump administration official to comment on camera, even though Alfonsi had previously sought a response. The report surfaced on “60 Minutes” several weeks later.\n\n\tWeiss has also worked to cut the staff at “CBS Evening News,” and is mulling additional staff reductions with a set of layoffs that could comprise at least 15% of the staff of CBS News overall. Her efforts so far have given rise to a level of mistrust between her management team and the CBS News rank and file.\n\n\t“60 Minutes,” which features profiles and features along with investigative pieces, has seen its credibility subverted over the past two years as corporate managers failed to defend it from what was largely considered to be a nuisance suit from President Trump over the editing of a 2024 interview with then-Democratic presidential candidate Kamala Harris. Paramount, eager to clear a path to a sale of the company from the Redstone family, former controlling shareholders, to the Ellisons, who now operate Paramount Skydance, agreed to pay a $16 million settlement to Trump.\n\n\tAs a result, two senior CBS News executives — Bill Owens, the executive producer of “60 Minutes” and Wendy McMahon, the former CEO of CBS News, local stations and syndication — suggested in remarks that they could no longer push back against corporate mandates they felt would weaken the newsroom. Three people familiar with the show say there have been calls for “60 Minutes” to cut back on the number of hard-news or investigative segments it runs, and pay more attention to features and celebrity profiles, which corporate managers believe will generate more attention online.\n\n\tCooper appeared on “60 Minutes” Sunday night, during its “Last Minute” segment, a short end note that has been part of the telecast since 2022. Whether that cameo marked his last appearance in the program’s current season, its 58th, remains to be seen.\n\t\n\n\tWhen Cooper leaves, he will take with him a valuable means of promoting the newsmagazine’s stories. For years, CBS has allowed Cooper to run his “60 Minutes” segments during his CNN show.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Anderson Cooper Set to Exit CBS News’ ’60 Minutes’",
      "image": [
        "https://variety.com/wp-content/uploads/2021/06/Anderson-Cooper.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-16T21:50:47.000Z",
      "dateModified": "2026-02-16T21:50:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Frederick Wiseman, Legendary Documentary Filmmaker, Dies at 96",
    "url": "https://variety.com/2026/film/news/frederick-wiseman-dead-ex-libris-at-berkeley-1236664858/",
    "image": "https://variety.com/wp-content/uploads/2026/02/GettyImages-105010933.jpg?crop=0px%2C0px%2C4396px%2C2473px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-02-16T21:33:16.000Z",
    "description": "\n\tFrederick Wiseman, the prolific documentarian behind films like “Titicut Follies,” “At Berkeley,”  “National Gallery” and “Ex Libris,” died on Monda",
    "body": "\n\tFrederick Wiseman, the prolific documentarian behind films like “Titicut Follies,” “At Berkeley,”  “National Gallery” and “Ex Libris,” died on Monday. He was 96 years old. \n\n\tWiseman’s death was announced in a joint statement from the Wiseman family and Zipporah Films.\n\n\t“For nearly six decades, Frederick Wiseman created an unparalleled body of work, a sweeping cinematic record of contemporary social institutions and ordinary human experience primarily in the United States and France,” the statement read. “His films – from ‘Titicut Follies’ (1967) to his most recent work, ‘Menus-Plaisirs – Les Troisgros’ (2023) – are celebrated for their complexity, narrative power and humanist gaze. He produced and directed all of his 45 films under the banner of Zipporah Films, Inc.”\n\t\n\n\tBorn in Boston, he graduated Williams College and Yale Law School. The first film he produced was “The Cool World,” directed by Shirley Clarke, about life in a Harlem gang. He was both director and producer of his next film, “Titicut Follies,” which chronicled the harsh life of residents at the Bridgewater State Hospital for the criminally insane. \n\n\n\tHe went on to explore the life of institutions in more than 40 documentaries from 1968’s “High School” to “Law and Order” about the Kansas City Police Department, “Hospital,” “Public Housing” and the 2020 “City Hall.”\n\n\tWiseman received an honorary Oscar in 2016 as well as the Golden Lion for Lifetime Achievement at the Venice Film Fest in 2014. \n\n\tHis wife of 65 years, Zipporah Batshaw Wiseman, died in 2021.\n\n\tHe is survived by two sons, David and Eric, and three grandchildren, as well as Karen Konicek,his friend and collaborator, who worked with him for 45 years.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Frederick Wiseman, Legendary Documentary Filmmaker, Dies at 96",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/GettyImages-105010933.jpg?crop=0px%2C0px%2C4396px%2C2473px&resize=1000%2C563"
      ],
      "datePublished": "2026-02-16T21:33:16.000Z",
      "dateModified": "2026-02-16T21:33:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Why Shooting ‘Crime 101’ Was a ‘Love Letter to Los Angeles,’ From an Echo Park Mural to the Sixth Street Bridge",
    "url": "https://variety.com/2026/artisans/features/crime-101-los-angeles-locations-sixth-street-bridge-1236664767/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Director-Bart-Layton-Chris-Hemsworth-and-Halle-Berry-on-the-set-of-Crime-101.-Photo-Credit-Merrick-Morton_rgb.jpg?crop=0px%2C369px%2C3900px%2C2194px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-02-16T21:15:00.000Z",
    "description": "\n\tBart Layton’s “Crime 101” is much more than your average heist thriller.\n\n\tChris Hemsworth plays Davis, a jewel thief who specializes in meticulousl",
    "body": "\n\tBart Layton’s “Crime 101” is much more than your average heist thriller.\n\n\tChris Hemsworth plays Davis, a jewel thief who specializes in meticulously targeted robberies. He commits those heists along the 101 freeway in Los Angeles and doesn’t harm anyone. Mark Ruffalo plays the smart LAPD detective Lou Lubesnick, who is onto this pattern. And Halle Berry plays Sharon, an insurance broker who still aspires to be a partner, but it’s an old boys club, and she realizes that’s not going to happen anytime soon. Before long, she finds herself caught up with both Davis and Lou.\n\t\n\n\tWhen adapting Don Winslow’s novella “Savages,” Layton knew he wanted to make the film more than a popcorn heist movie. Speaking with Variety, he said “There’s a framework with which I can start to explore issues of class and, you know, wealth inequality and status anxiety and some of those things which you know, are to do with, not limited to L.A., but L.A. is a very particular place which does create quite a good deal of pressure to have status and wealth and all of that stuff.”\n\n\n\tLayton shot in Los Angeles, but he wanted to find parts of the city that hadn’t necessarily been seen before on film. “I wanted to reflect all of the social strata. There is a topographical divide. The wealthiest people live high on the hills or the coast and the people without anything live underneath or even under the freeway or, you know, so all of that was important to try to convey.”\n\n\tLayton shows how a diamond starts its journey in Downtown L.A. in the immigrant-run jewelry stores. “By the time it travels to the very, very high end jeweler in Calabasas, that diamond has quadrupled or has multiplied In value by tens of times,” he says.\n\t\n\n\tBerry adds, “Bart put together a movie that really is a love letter to the city. You know, he showed it for all of its beauty and, unfortunately, for all of the underbelly of it, and all of the sort of devastation that the city has seen as well. You get to see all the migrant workers, you get to see who has built the city, right, and why it has become such a great city. And you know, that just made me feel really good and proud of this place that I’ve been living in for so long.”\n\n\tHemsworth says that by showing the polarity of the glitz and glam contrasted against the homelessness is “what makes the movie have authenticity.” The city itself becomes a character imbued within these characters that have their own complexities and emotional depth. He adds, “We don’t tend to see it shot this way anymore. We don’t tend to see it on film so much.”\n\n\tRuffalo recalls when he first started out, “I lived in the hardest parts of Los Angeles, and I [later] got to live in the nice parts.” With the film shooting from Echo Park to Venice and Santa Monica, he says. “Those places all have their own feeling and look. They all have their own styles. ‘Collateral’ did that, maybe ‘To Live and Die in L.A.’ did that. But there’s not a lot of movies that do it as well as this does.”\n\n\tThe film also shot in Melrose Place, Calabasas and the Regency Beverly Wilshire, but here production designer Scott Dougan explains how some of the other key locations came to appear in the film.\n\n\tLia’s Tacos stand – Echo Park Ave. and Sunset Blvd \n\n\n\n\t\n\n\t\t\t\t\tMonica Barbaro at Lia’s Tacos in “Crime 101.”\n\t\t\t\t\t\t\t\t\tCourtesy of Amazon Content Servi\n\t\n\n\n\n\tDougan explains they were scouting the stretch of Sunset Blvd from Alvarado Street to Dodger Stadium, where there are numerous taco stands, but they ended up getting tacos from Lia’s. “How do you choose a taco stand in Los Angeles? Right? I think you choose a taco stand that you go to a lot.”\n\n\tThe ‘Sculpting Another Destiny’ mural by Ricardo Mendoza in Echo Park\n\n\tAnyone that has been to Echo Park and Dodger Stadium is likely to have seen Ricardo Mendoza’s colorful mural on the building at the corner of Echo Park Ave. and Sunset. “We ended up contacting Ricardo, and we paid them a licensing fee to showcase their work in the movie. What’s better than that? A famous Los Angeles mural at one of the best intersections in the city,” Dougan says. \n\t\n\n\tSixth Street Bridge\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tCourtesy of Amazon Content Servi\n\t\n\n\n\n\tDugan says the bridge opened in 2022 and immediately people were street racing on it. Under it, a public park was being built. “I haven’t been back since this past summer. It might be on its way, but they’re putting soccer fields there. The first time we went to scout there, there’s a biker club.”\n\n\tAs Layton and Duggan were driving around, there were looking for a place that was “iconically Los Angeles, but not necessarily someplace everybody’s been.”\n\n\t“”It’s so beautiful and evocative in Los Angeles, and you see the city in the background, like, depending on which angle you’re at. So we were able to shoot driving past the river and seeing Los Angeles in the background.”\n\n\tDougan considers it one of the best views of Los Angeles. “From the east side, looking west. I always think of it as the profile of the city…when you’re looking at it because the whole of Downtown and Figueroa just stretches. It’s just architecturally beautiful too.”\n\n\tWatch below to see location manager Robert Foulkes describe how he and co-manager Doug Dresser selected the best L.A. locations for the film.\n\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why Shooting ‘Crime 101’ Was a ‘Love Letter to Los Angeles,’ From an Echo Park Mural to the Sixth Street Bridge",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Director-Bart-Layton-Chris-Hemsworth-and-Halle-Berry-on-the-set-of-Crime-101.-Photo-Credit-Merrick-Morton_rgb.jpg?crop=0px%2C369px%2C3900px%2C2194px&resize=1000%2C563"
      ],
      "datePublished": "2026-02-16T21:15:00.000Z",
      "dateModified": "2026-02-16T21:15:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Billy Steinberg, Songwriter Who Co-Wrote Smashes Including ‘Like a Virgin,’ ‘True Colors,’ ‘Eternal Flame’ and ‘So Emotional,’ Dies at 74",
    "url": "https://variety.com/2026/music/obituaries-people-news/billy-steinberg-dead-songwriter-like-a-virgin-true-colors-1236664839/",
    "image": "https://variety.com/wp-content/uploads/2023/05/LC9_1584_SHOF-inductee-Billy-Steinberg-e1771278022544.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-16T21:36:53.000Z",
    "description": "\n\tBilly Steinberg, a longtime member of the Songwriters Hall of Fame who is regarded as one of the most successful tunesmiths of the ’80s and ’90s, di",
    "body": "\n\tBilly Steinberg, a longtime member of the Songwriters Hall of Fame who is regarded as one of the most successful tunesmiths of the ’80s and ’90s, died Monday in California at age 75. He died after a long battle with cancer, his attorney, Laurie Soriano, confirmed to Variety.\n\n\tSteinberg’s initial run of hits was in tandem with writing partner Tom Kelly, with Steinberg handling nearly all the lyrics and Kelly responsible for almost all the music. The list of songs they wrote together that would be recognized in nearly any household includes “Like a Virgin” by Madonna, “True Colors” by Cyndi Lauper, “Eternal Flame” by the Bangles, “Alone” by Heart, “So Emotional” by Whitney Houston, “I Touch Myself” by the Divinyls, “I’ll Stand by You” by the Pretenders, “How Do I Make You” by Linda Ronstadt and “I Drove All Night” by Roy Orbison and Cyndi Lauper.\n\t\n\n\tAfter Kelly retired in the mid-1990s, Steinberg continued to find success with other writing partners, achieving hits like “Falling Into You” by Celine Dion, “Give Your Heart a Break” by Demi Lovato and “Too Little Too Late” by JoJo.\n\n\n\tHis songs were also recorded by Pat Benatar, Tina Turner, Laura Branigan, Cheap Trick, REO Speedwagon, Melanie C, Susanna Hoffs, Belinda Carlisle, Bette Midler, Taylor Dayne, Nicole Scherzinger, Katharine McFee, the Veronicas, T.A.T.U., the Corrs, Ashley Tisdale and many other artists.\n\n\tSteinberg was inducted into the Songwriters Hall of Fame alongside Kelly in 2011.\n\n\tHe first achieved prominence in the new wave era as the singer-songwriter fronting the L.A. rock band Billy Thermal, which was signed to Richard Perry’s Planet label. The group’s name was a combination of his name and the town in California’s Coachella Valley where his father had a vineyard. \n\t\n\n\tOne of that band’s songs, “How Do I Make You” — which he tried to write loosely in the frenetic style of the Knack’s “My Sharona” — was covered by Ronstadt and became a top 10 hit in 1980, around the time Billy Thermal songs were also getting covered by Benatar as album tracks.\n\n\tHe became friends with Benatar’s producer at the time, Keith Olsen, and it was at a party of Olsen’s that he fatefully met Kelly in 1981. In an interview with Songfacts, he explained how the collaboration developed with very specific roles.\n\n\t“When we got together, I didn’t really have a conscious idea that I was more adept at writing lyrics than I was at writing chords or melodies,” explained Steinberg, who had been a solo writer starting out. “But when I got together with Tom, it was clear immediately that he was a far superior musician, and that his melodies were magnificent. Whereas at my best I was writing in a simple Buddy Holly sort of song structure. While Tom, he was well versed in the Brian Wilson, Lennon/McCartney songbook, and he was a much better musician than I was… But Tom didn’t write lyrics… It became clear that I would be the lyricist on the songs that we would write together, and that he would be the principal music writer.”\n\n\tBut, unlike many songwriting teams that have that strict breakdown of duties, “I never would just send him lyrics,” Steinberg added. “I would always be with him when we would write the songs, and sometimes I would have some input into the chords and the melodies. But he would do the majority of those things. Over the ’80s it just became clear to me that I was primarily a lyricist.”\n\n\tAlthough they were in the room together when the songs were written, that didn’t mean it was a back-and-forth process of joint discovery. “Every hit that Tom and I wrote, all the biggest hits, were always lyrics first,” Steinberg said. “I started out writing music to my own poetry, so that became a process for me where I would write the lyrics, and then write the music to the lyrics.” He said that Kelly “adapted really well to that process. I would come in with a lyric, whether it was ‘True Colors’ or ‘Like a Virgin’ or ‘Eternal Flame’  or whatever, and he would pick up a guitar, sit down at a piano, and start banging out melodies to the lyric that I put in front of him.”\n\t\n\n\tSteinberg took pride in having some of pop’s most memorable or vivid song titles as the starting point for giant hits. “Whether we’re talking about ‘Night In My Veins’ (by the Pretenders) or ‘Like a Virgin’ or ‘I Touch Myself,’ even ‘I Drove All Night’ — these are not ordinary song titles,” he said. “They have a certain bite to them. And I guess that would be something I would be proud of.”\n\n\tSteinberg was often called upon to recount the origins of some of these unlikely candidates for pop glory, as with “Like a Virgin,” which he wrote about coming out of a bad romantic experience of his own. “In 1983, I wrote a lyric that was based on some trials in my personal life. The title was provocative: ‘Like A Virgin,'” he said in a 2012 interview. “Knowing what I had been through and reading these words, Tom’s instinct was to approach it as a ballad. But because of the title, the sincere ballad approach didn’t work. We tried on several occasions to write a song to my ‘Like A Virgin’ lyric. One day, out of frustration, Tom started playing a Motown-inspired bass line while singing the lyrics in falsetto. Immediately, I got excited and said, ‘That’s it!'”\n\n\tBefore the world knew who Madonna was, Steinberg and Kelly were turned down by multiple A&R execs who thought “the song was catchy, but that the title was bizarre and would not fit any artist.” Then they got it to Warner Bros. A&R man Michael Ostin, who loved the song and passed it along to their fledgling artist. “Her management asked for a piece of the publishing, but we refused, feeling confident that she wouldn’t drop the song under any circumstances.” They were right, and when she recorded it with Nile Rodgers, Steinberg said, “They followed our demo exactly and Madonna imitated every nuance of Tom’s vocal and even incorporated some of my background vocal ideas on her record. When Madonna recorded it, even as our demo faded out, on the fade you could hear Tom saying, ‘When your heart beats, and you hold me, and you love me…’ Her record ends with the exact same little ad-libs that our demo did, so Madonna must have listened to it very, very carefully and liked what we’d done. It rarely happens that someone studies your demo so carefully that they even use all those little details… We were sort of flattered in some ways how carefully she followed our demo.”\n\t\n\n\t“Like A Virgin” became the pair’s first of five No. 1 Hot 100 hits over a five-year period. \n\n\tThey had the opposite experience from “Like a Virgin” when “True Colors” became one of Lauper’s first hits — of being glad she did not follow their demo. “We used ‘Bridge Over Troubled Water’ and ‘Let It Be’ as sort of models for the demo we made. We went with the big, mainstream gospel-influenced ballad approach,” he said. “We sent it around to different artists and we were lucky because Cyndi Lauper was the one who recorded it. And I say we were lucky because if other more middle-of-the-road artists would have done the song, they might’ve followed our demo, which wasn’t necessarily a great road map… I have to give her a lot of credit because, whereas Madonna copied our demo on ‘Like a Virgin,’ Cyndi did not copy our demo for ‘True Colors.’ She really invented her own very exquisitely beautiful version.”\n\n\tThe songwriting team rarely wrote to order, but one instance in which they did was “So Emotional,” which they came up with in response to a request from Clive Davis for material for Houston. Again, the final result was very different from their demo. “When we wrote ‘So Emotional’ we were sort of feeding off some of the Prince energy,” Steinberg said. “If you were to hear our demo of the song, you’d hear that it doesn’t really resemble the Michael Narada Walden-produced track that Whitney Houston recorded. Our demo was much more sparse like ‘Kiss’ or ‘Little Red Corvette,’ and Tom sang the demo falsetto. The chorus is a great pop chorus and Whitney sang the hell out of it.”\n\n\tWith “Eternal Flame,” Susanna Hoffs approached the team with the idea to do something Beatle-esque in the vein of another song they’d written, “Unconditional Love,” which was their attempt to channel songs like “For No One” and “Here, There and Everywhere.” Hoffs mentioned that she had just been in Memphis and saw the perpetual flame at Elvis Presley’s graveside, and that set the theme of the song in motion. “I immediately had the image in my head of an eternal flame that was in the synagogue where I grew up as a child in Palm Springs,” said Steinberg. “There was a little red light in the synagogue that they called the eternal flame because it would never burn out and it piqued my imagination as a child. So somehow when Susanna used the words ‘eternal flame,’ it was a rich title for me.” Hoffs, Kelly and Steinberg also wrote another popular Bangles song, “In My Room,” together.\n\t\n\n\tOf the Divinyls hit “I Touch Myself,” Steinberg told Songfacts, “It sort of falls short of even being a double entendre, but what I like about the song is that in spite of the fact that the chorus kind of boldly says that, the verse was much more sort or poetic and kind of meaningful. It says, ‘I love myself, I want you to love me, when I feel down I want you above me, I search myself I want you to find me, I forget myself I want you to remind me’ — those words, I think, are very strong… I like playing with words, and whether it’s ‘Like a Virgin’ or ‘I Touch Myself,’ I like being able to take phrases or words that are sort of untapped and find a way to write something meaningful and yet has a rebelliousness, because really that’s what rock’s all about.”\n\n\tSteinberg was glad to get two hits in with the Pretenders, because he had some hesitations about the biggest one. He said he felt “a little sheepish that we had written something a little soft for the Pretenders. Whereas ‘Night In My Veins’ really felt like a great Pretenders rocker, ‘I’ll Stand By You’ felt a little generic. I know that Chrissie (Hynde) felt that way too, to some extent. I don’t think she really entirely embraced it to begin with, but she certainly does now because when she plays it live, it’s one of the songs that gets the strongest response.”\n\n\tWith “Alone,” they did not collaborate with Heart’s Wilson sisters. Rather, it was a trunk song — something that Kelly and Steinberg had not just written but recorded together when they formed an ill-fated and short-lived duo called i-Ten. Steinberg was embarrassed by the way that the sole i-Ten album (produced by Olsen and Steve Lukather) came out, but that record was not all for naught, as it did include their original version of “Alone.” When they heard Heart was looking for a power ballad to cover, they thought about reviving that song to submit, but something was nagging at Steinberg. He hated the “stiff” first line of the chorus, which initially went, “I always fared well on my own.” After having the idea to change “fared” to “got by,” the song suddenly seemed to loosen up. Heart loved it and it became that group’s second and last No. 1 hit in 1987.\n\n\tAfter his run with Kelly ended, Steinberg frequently worked with Rick Nowels (his co-writer on the Dion smash “Falling Into You,” which helped earned them albums of the year Grammys)  and Josh Alexander (his partner on the JoJo hit and Scherzinger’s No. 1 U.K. success “Don’t Hold Your Breath”).\n\t\n\n\tAlthough he worked with songwriting partners throughout his career after the initial stint leading Billy Thermal, Steinberg was not a fan of committee songwriting. For instance, in talking about writing the Divinyls’ “I Touch Myself,” he complimented singer Christina Amphlett for picking the rough draft of the lyrics out of a sheath of potential songs he brought to their first meeting at the Cat and Fiddle in Hollywood. But when guitarist Mark McEntee joined them the next day to work in earnest on the song, Steinberg decided that four’s a crowd.\n\n\t“Four people for me is too many,” he said. “Two people can write a song together, three people can write a song together, but four is kind of awkward. But Tom and I by that time had our own method writing a song and we knew we could read each other’s minds. I could look at Tom, he could look at me and know what the other was thinking. When we got together to write ‘I Touch Myself,’ even though there were four of us, Tom and I led the way. I put the lyric in front of Tom and he started singing, ‘I love myself, I want you to love me,’ which is one of my favorite first lines in any song I’ve written. From there Chrissy and Mark contributed their bits but it was mostly Tom and I doing what we do best.”\n\n\tIt naturally follows from that that Steinberg might not have been a fan of the multiple credits piling up on most pop hits today. In a 2004 interview, Steinberg looked at the changing way pop songs were being written even then. “I think sometimes that today people are working too much on the track and not on the song,” he said. “Today songwriters almost have to be song producers, and a lot of times people are creating very effective tracks and then are writing their song to those tracks, and the art of songwriting gets lost a little in that method.” Steinberg said that with his and Kelly’s co-credits, “because Tom and I love certain music so much, it shows beneath the surface. You can see what music we loved and what inspired us.”\n\n\tIn March of last year, Steinberg and his son, fellow songwriter Ezra Steinberg, each signed global publishing deals with Sony Music Publishing. The deals serve as an expansion of the senior Steinberg’s partnership with Sony, which first began in 1992, and the father’s and son’s songs were to be housed together under the banner Steinberg Music. “I’ve had a professional songwriting career for 45 years and it’s exciting for me to see that Ezra shares my passion as we embark on this new chapter,” he said in a statement at the time.\n\t\n\n\tHe is survived by his wife, Trina; his sons, Ezra and Max; his sisters, Barbara and Mary; and his stepchildren, Raul and Carolina.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Billy Steinberg, Songwriter Who Co-Wrote Smashes Including ‘Like a Virgin,’ ‘True Colors,’ ‘Eternal Flame’ and ‘So Emotional,’ Dies at 74",
      "image": [
        "https://variety.com/wp-content/uploads/2023/05/LC9_1584_SHOF-inductee-Billy-Steinberg-e1771278022544.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-16T21:36:53.000Z",
      "dateModified": "2026-02-16T21:36:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Summer Walker -- Fun In Fendi Bikini Beach Babe Pics!",
    "url": "https://www.tmz.com/2026/02/16/summer-walker-beach-babe-pics/",
    "image": "https://imagez.tmz.com/image/c2/16by9/2026/02/16/c24f4af1715d42838eaafbe4823a6041_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-16T23:04:47.000Z",
    "description": "\n    \n                    \n                          Summer Walker\n                          Fun In Fendi ...\n                          Beach Babe Pic",
    "body": "\n    \n                    \n                          Summer Walker\n                          Fun In Fendi ...\n                          Beach Babe Pics 👙\n                      \n      \n    \n      \n        \n              \n    \n    \n          It’s always summer somewhere when Summer Walker steps out ... and these pics are living proof she brings the heat wherever she goes!\n      \n    \n          Check out these scorching shots ... Summer’s soaking up the sun in a barely-there Fendi bikini, putting her curves on full display while striking poses that are impossible to ignore.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          No surprise here -- Summer’s basically made a sport out of blessing fans with next-level bikini moments, and TBH, nobody’s complaining!\n      \n\n          We’ve got one more Summer Walker snap in the mix -- but you’ll have to piece it together yourself ...\n      \n    \n          So yeah, temperatures might be dropping where you are -- but Summer’s keeping things hot all on her own!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Hotties & Bodies\n              \n                          \n                Hot Bodies\n              \n                          \n                Photo Galleries\n              \n                          \n                Vacations\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Summer Walker -- Fun In Fendi Bikini Beach Babe Pics!",
      "image": [
        "https://imagez.tmz.com/image/c2/16by9/2026/02/16/c24f4af1715d42838eaafbe4823a6041_xl.jpg"
      ],
      "datePublished": "2026-02-16T23:04:47.000Z",
      "dateModified": "2026-02-16T23:04:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'Like A Virgin' Songwriter Billy Steinberg Dies at 74 After Cancer Battle",
    "url": "https://www.tmz.com/2026/02/16/billy-steinberg-dead/",
    "image": "https://imagez.tmz.com/image/77/16by9/2026/02/16/77139aa927aa4a2fa78701e835def87d_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-16T21:53:54.000Z",
    "description": "\n    \n                    \n                          Billy Steinberg\n                          'Like A Virgin' Songwriter Dead at 74\n                 ",
    "body": "\n    \n                    \n                          Billy Steinberg\n                          'Like A Virgin' Songwriter Dead at 74\n                      \n      \n    \n          Billy Steinberg -- the legendary songwriter behind Madonna’s smash hit \"Like a Virgin\" -- has died at age 74 after a battle with cancer, TMZ has confirmed.\n      \n    \n          His death Monday was confirmed by his attorney, Laurie Soriano.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Steinberg’s career took off early with his bands Billy Thermal and i-Ten ... the latter was formed with songwriting partner Tom Kelly. But it was their collaboration on \"Like a Virgin\" that cemented Billy's place in music history, with the song spending six straight weeks at No. 1 on the Billboard Hot 100.\n      \n\n          Steinberg went on to co-write multiple No. 1 hits, including Cyndi Lauper’s \"True Colors,\" Whitney Houston’s \"So Emotional,\" The Bangles' \"Eternal Flame,\" and Heart’s \"Alone.\"\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          He shaped pop for decades, with later credits on JoJo’s \"Too Little Too Late\" and Demi Lovato’s \"Give Your Heart a Break.\"\n      \n    \n          Steinberg earned a Grammy in 1997 for his work on Celine Dion’s \"Falling Into You,\" which took home Album of the Year ... and his legacy was officially cemented when he was inducted into the Songwriters Hall of Fame in 2011.\n      \n    \n          He’s survived by his wife, Trina, and sons Ezra and Max.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Billy Steinberg was 74.\n      \n    \n          RIP\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Madonna\n              \n                          \n                Pop Music\n              \n                          \n                RIP\n              \n                          \n                Music\n              \n                          \n                Health\n              \n                          \n                News\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Like A Virgin' Songwriter Billy Steinberg Dies at 74 After Cancer Battle",
      "image": [
        "https://imagez.tmz.com/image/77/16by9/2026/02/16/77139aa927aa4a2fa78701e835def87d_xl.jpg"
      ],
      "datePublished": "2026-02-16T21:53:54.000Z",
      "dateModified": "2026-02-16T21:53:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nicole Kidman Being Romantically Pursued by MGM Resorts Chairman",
    "url": "https://www.tmz.com/2026/02/16/paul-salem-wants-to-date-nicole-kidman/",
    "image": "https://imagez.tmz.com/image/dd/16by9/2026/02/16/dd7dea6265b04ddfb3c5caae1d95762f_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-16T21:40:39.000Z",
    "description": "\n    \n                    \n                          Nicole Kidman\n                          Business Mogul Actively Wooing Oscar-Winner\n             ",
    "body": "\n    \n                    \n                          Nicole Kidman\n                          Business Mogul Actively Wooing Oscar-Winner\n                      \n                  \n                                                                        Published \n                              \n                February 16, 2026\n                \n                            1:40 PM PST\n                                                                      |\n                                                                Updated \n                                  February 16, 2026\n                                3:02 PM PST\n                                    \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Paul Salem -- a wealthy businessman and Chairman of the Board of MGM Resorts International -- has his eye on Nicole Kidman ... TMZ has learned.\n      \n    \n          Multiple sources with direct knowledge tell us Salem is romantically pursuing the Oscar-winning actress ... though we're told they are not dating at this point. Our sources say the two share mutual friends, are acquaintances, and have met twice in group settings.\n      \n    \n          We're told so far, there have been no one-on-one hangouts ... at least not yet. Still, our sources say it's fair to say Paul is interested and making that known to people close to him.\n      \n\n          As for Nicole, we're told she's single and not currently dating anyone.\n      \n    \n          Salem and his ex-wife, Navyn Salem, divorced in 2021. He has largely kept his personal life confidential, focusing on his work in private equity and his high-profile role at MGM Resorts.\n      \n    \n          TMZ broke the news ... Nicole and Keith Urban separated in June last year, and we were told she wanted to save the marriage, although by all accounts, Keith did not. The couple married back in 2006 and share 2 kids, ages 17 and 15. Their divorce was finalized in January.\n      \n    \n          We've reached out to reps ... so far, no word back.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Nicole Kidman\n              \n                          \n                Keith Urban\n              \n                          \n                Celebrity News\n              \n                          \n                Relationships\n              \n                          \n                Couples\n              \n                          \n                Exclusive\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nicole Kidman Being Romantically Pursued by MGM Resorts Chairman",
      "image": [
        "https://imagez.tmz.com/image/dd/16by9/2026/02/16/dd7dea6265b04ddfb3c5caae1d95762f_xl.jpg"
      ],
      "datePublished": "2026-02-16T21:40:39.000Z",
      "dateModified": "2026-02-16T21:40:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Legendary Actor Robert Duvall Dead at 95",
    "url": "https://www.tmz.com/2026/02/16/robert-duvall-dead/",
    "image": "https://imagez.tmz.com/image/15/16by9/2026/02/16/1542ec9872c140adb67c0aa0a5eb23f0_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-16T17:55:08.000Z",
    "description": "\n    \n                    \n                          Robert Duvall\n                          Dead at 95\n                      \n                  \n    ",
    "body": "\n    \n                    \n                          Robert Duvall\n                          Dead at 95\n                      \n                  \n                                                                        Published \n                              \n                February 16, 2026\n                \n                            9:55 AM PST\n                                                                      |\n                                                                Updated \n                                  February 16, 2026\n                                3:24 PM PST\n                                    \n      \n    \n          Hollywood icon Robert Duvall has died ... the actor passed away at his home Sunday at the age of 95, according to his wife.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          In a Monday morning Facebook post, Robert's wife Luciana wrote ... \"Yesterday we said goodbye to my beloved husband, cherished friend, and one of the greatest actors of our time. Bob passed away peacefully at home, surrounded by love and comfort.\"\n      \n    \n          She added ... \"His passion for his craft was matched only by his deep love for characters, a great meal, and holding court. For each of his many roles, Bob gave everything to his characters and to the truth of the human spirit they represented.\"\n      \n\n          Luciana asked for privacy for the family as they celebrate his memories.\n      \n    \n        \n                    \n                  \n      \n    \n          In a career that spanned 7 decades, Robert had iconic roles in films such as \"The Godfather,\" \"Apocalypse Now,\" \"The Godfather Part II,\" \"The Conversation,\" \"Network,\" and \"The Natural\" ... among a myriad of others.\n      \n    \n          Robert won the Academy Award for Best Actor for his role as a former country music star in the 1983 classic \"Tender Mercies.\"\n      \n    \n      \n        \n                    \n                      JUNE 2015\n                  \n      \n                    TMZ.com\n          \n    \n          He was 95.\n      \n    \n          RIP\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Robert Duvall\n              \n                          \n                Celebrity News\n              \n                          \n                RIP\n              \n                          \n                Movies\n              \n                          \n                Celebrity Death\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Legendary Actor Robert Duvall Dead at 95",
      "image": [
        "https://imagez.tmz.com/image/15/16by9/2026/02/16/1542ec9872c140adb67c0aa0a5eb23f0_xl.jpg"
      ],
      "datePublished": "2026-02-16T17:55:08.000Z",
      "dateModified": "2026-02-16T17:55:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "James Van Der Beek Faced Massive Tax Debt Years Before His Death",
    "url": "https://www.tmz.com/2026/02/16/james-van-der-beek-had-massive-tax-debt/",
    "image": "https://imagez.tmz.com/image/76/16by9/2026/02/16/760aeedcf9184450a3d23dd96f19946d_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-16T20:56:26.000Z",
    "description": "\n    \n                    \n                          James Van Der Beek\n                          Faced Massive Tax Debt Years Before He Died\n        ",
    "body": "\n    \n                    \n                          James Van Der Beek\n                          Faced Massive Tax Debt Years Before He Died\n                      \n                  \n                                                                        Published \n                              \n                February 16, 2026\n                \n                            12:56 PM PST\n                                                                      |\n                                                                Updated \n                                  February 16, 2026\n                                3:58 PM PST\n                                    \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          \"Dawson’s Creek\" actor James Van Der Beek was dealing with a massive six-figure tax debt years before his death ... TMZ has learned.\n      \n    \n          The actor and his wife Kimberly Van Der Beek were hit with a lien in November 2021 for unpaid taxes for the years 2018 and 2019 -- the IRS declared the duo owed $95,438.31 for 2017 ... and $173,890.31 in 2019 ... for a total of $269,328.62.\n      \n\n      \n        \n                    \n                  \n      \n                    Shutterstock\n          \n    \n          James and Kimberly paid off the debt and the lien was released in April 2022.\n      \n    \n          The actor revealed he had stage 3 colorectal cancer in 2024. At the time, he claimed he was staying positive despite the news.\n      \n    \n          James and Kimberly purchased a $4 million home, sitting on 34 acres, in Texas just weeks before James passed ... the family had been renting the place before they bought it. James’ rep said the actor was able to purchase the home with help from his friends for the down payment.\n      \n    \n          The entertainer died last week, on February 11, after his battle with cancer. Following his death, a GoFundMe was launched to help Kimberly and her kids with expenses. That GoFundMe has gathered more than $2 million as of Monday.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                James Van Der Beek\n              \n                          \n                Celebrity News\n              \n                          \n                RIP\n              \n                          \n                TV\n              \n                          \n                Money\n              \n                          \n                Celebrity Death\n              \n                          \n                Health\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "James Van Der Beek Faced Massive Tax Debt Years Before His Death",
      "image": [
        "https://imagez.tmz.com/image/76/16by9/2026/02/16/760aeedcf9184450a3d23dd96f19946d_xl.jpg"
      ],
      "datePublished": "2026-02-16T20:56:26.000Z",
      "dateModified": "2026-02-16T20:56:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]