[
  {
    "title": "Korea Box Office: ‘Zootopia 2’ Commands Nearly 80% of Market on Debut",
    "url": "https://variety.com/2025/film/box-office/korea-box-office-zootopia-2-1236596091/",
    "image": "https://variety.com/wp-content/uploads/2025/11/zootopia-2-1.jpg?w=1000&h=562&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-01T07:16:24.000Z",
    "description": "\n\tDisney’s animated sequel “Zootopia 2” dominated the Korean box office over the Nov. 28–30 weekend, opening to a commanding $10.8 million from 1.62 m",
    "body": "\n\tDisney’s animated sequel “Zootopia 2” dominated the Korean box office over the Nov. 28–30 weekend, opening to a commanding $10.8 million from 1.62 million admissions across 2,382 screens, according to KOBIS, the tracking service operated by the Korean Film Council. \n\n\tIncluding previews, the film has already amassed $13.7 million. The strong start gives the film a massive 78.97% share of the entire market.\n\n\n\tUniversal’s “Wicked: For Good” held second place with $953,242, pushing its cumulative total to $5.4 million after two weeks on release.\n\t\n\n\tLionsgate’s “Now You See Me: Now You Don’t” ranked third with $798,161, lifting its running total to $8.07 million.\n\n\tJapanese title “Chainsaw Man The Movie: Reze Arc” placed fourth, earning $283,888 for a $23.9 million cume.\n\n\tIn fifth, Japanese drama “Kokuho” grossed $181,097, reaching $738,696 after 11 days in theaters.\n\n\tAward-winning South Korean drama “The World of Love” followed in sixth with $77,373, taking its total to $1.01 million.\n\n\tLong-running hit “Demon Slayer: Kimetsu no Yaiba – The Movie: Infinity Castle” added $80,799, moving its enormous cumulative haul to $41.5 million.\n\n\tDebuting in eighth place, South Korean action comedy “The Informant” opened with $70,985 from 8,738 admissions. The film stars Heo Sung-tae and Jo Bok-rae, and is directed by Kim Seok. The plot: Tae-bong, a smuggling-operation informant, is exposed mid-mission. Meanwhile, hapless detective Nam-hyuk blunders into the chaos while scheming his own plan. Forced into an uneasy alliance, the mismatched pair must recover their losses and take down the criminals.  \n\t\n\n\tLocal drama “Hallan,” directed by Ha Myung-mi, followed in ninth with $45,650, pushing its total to $83,429.\n\n\tRounding out the top ten, Sergei Parajanov’s restored classic “The Color of Pomegranates” grossed $36,926, bringing its cumulative figure to $69,862.\n\n\tThe top 10 films collectively generated $13.4 million over the weekend. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Korea Box Office: ‘Zootopia 2’ Commands Nearly 80% of Market on Debut",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/zootopia-2-1.jpg?w=1000&h=562&crop=1"
      ],
      "datePublished": "2025-12-01T07:16:24.000Z",
      "dateModified": "2025-12-01T07:16:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Zootopia 2’ Roars to Record-Smashing $272 Million China Opening, Sixth-Biggest in History",
    "url": "https://variety.com/2025/film/box-office/zootopia-2-272-million-china-opening-1236596066/",
    "image": "https://variety.com/wp-content/uploads/2024/12/Zootopia-2_7168b6.jpg?w=900&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-01T06:39:44.000Z",
    "description": "\n\t“Zootopia 2” stormed the China box office over the Nov. 28–30 frame, opening to RMB1.538 billion ($216.6 million) across its first two days and reac",
    "body": "\n\t“Zootopia 2” stormed the China box office over the Nov. 28–30 frame, opening to RMB1.538 billion ($216.6 million) across its first two days and reaching RMB1.922 billion ($270.7 million) through Sunday, according to Artisan Gateway. \n\n\tWith previews included, the Walt Disney sequel has amassed an estimated $272 million — one of the most explosive launches in the market’s history.\n\n\n\tThe debut ranks as the sixth-highest opening of all time in China among all films, and the second-biggest for a non-local title behind “Avengers: Endgame.” It is also the highest animated opening ever in China for a non-local release. After just five days, “Zootopia 2” has become the highest-grossing non-local animated film of all time in the market, and the highest-grossing imported film since “Avengers: Endgame” (2019). It is already the fourth-highest animated film ever released in China, local or foreign, and has overtaken the lifetime $236 million total of the original “Zootopia.” The first film was beloved in China, but the property has exploded in popularity ever since a Zootopia Land opened at the Shanghai Disneyland theme park.\n\t\n\n\tThe film also delivered China’s ninth-highest single-day gross on Day 4, which additionally became the biggest single-day gross ever for an MPA title, surpassing “Avengers: Endgame.” It now stands as the highest MPA opening of 2025.\n\n\n\tAniplex’s “Demon Slayer: Kimetsu no Yaiba – The Movie: Infinity Castle” placed second with $5.7 million, lifting its cumulative total to $88 million. Directed by Sotozaki Haruo and produced by ufotable, the film adapts the climactic final arc of Gotouge Koyoharu’s blockbuster manga. Returning voice cast members include Hanae Natsuki, Kitō Akari, Shimono Hiro, and Matsuoka Yoshitsugu. The film follows the Demon Slayer Corps’ all-out assault on Kibutsuji Muzan’s stronghold in a bid to end the war between humans and demons.\n\t\n\n\tLast weekend’s champion, Bi Gan’s “Resurrection,” from Huace Pictures, slipped to third under the weight of the Disney launch, earning $3.4 million across its second weekend. The Nov. 22 release now stands at $25.1 million. In “Resurrection,” starring Jackson Yee, Shu Qi, Mark Chao, Li Gengxi, Huang Jue and Chen Yongzhong, humanity has lost the ability to dream, with only one creature still entranced by fading illusions of the dreamworld. When a woman with the rare power to perceive these illusions appears, she chooses to enter the monster’s dreams, determined to uncover hidden truths within.\n\n\tLionsgate’s “Now You See Me: Now You Don’t” added $1.3 million for a $37 million total.\n\n\tQiangdian Media’s “My World Without Me” is a drama where a woman’s struggle and confusion ultimately lead to her transformation and rebirth, directed by Tian Hairong and executive produced by Zhang Hanyu, starring Tian alongside Tan Kai, Tian Haiyan, Shao Bing and Tong Ruixin. The film rounded out the top five with a two-day debut of $1 million after opening on Nov. 27, beginning its run with a $1.4 million cumulative total.\n\n\tChina’s weekend box office reached $229.7 million – a massive uptick from last weekend’s $44 million – lifting the 2025 year-to-date total to $6.777 billion, up 19.8% from the same point in 2024.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Zootopia 2’ Roars to Record-Smashing $272 Million China Opening, Sixth-Biggest in History",
      "image": [
        "https://variety.com/wp-content/uploads/2024/12/Zootopia-2_7168b6.jpg?w=900&h=563&crop=1"
      ],
      "datePublished": "2025-12-01T06:39:44.000Z",
      "dateModified": "2025-12-01T06:39:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Indonesia’s Film Sector Poised for Regional Breakout, JAFF Market–Cinepoint Report Finds",
    "url": "https://variety.com/2025/film/news/indonesia-film-sector-regional-breakout-report-1236596122/",
    "image": "https://variety.com/wp-content/uploads/2025/09/Sore-Wife-From-The-Future.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-01T07:37:09.000Z",
    "description": "\n\tIndonesia’s screen industry is entering what a new JAFF Market–Cinepoint study calls a “decisive new phase,” with local films driving attendance, in",
    "body": "\n\tIndonesia’s screen industry is entering what a new JAFF Market–Cinepoint study calls a “decisive new phase,” with local films driving attendance, investor confidence rising, and the market outperforming its Southeast Asian peers. \n\n\tThe Film Industry Report 2025 positions the country as both the region’s fastest-growing theatrical market and one of the most dynamic globally.\n\n\n\tAccording to the report, admissions for Indonesian films hit 82 million in 2024 and are projected to surpass 100 million within five years, while annual output is on track to reach 200 theatrical titles by 2028. Local productions commanded 65% of the national box office in 2024, with the top 10 Indonesian titles attracting 33.5 million admissions — far ahead of imported films’ 20.1 million.\n\t\n\n\tThe study notes that Indonesia’s box office rebounded faster than most international markets after the pandemic: receipts surged from below $75 million in 2020 to $392 million in 2024, overtaking Taiwan, Hong Kong and Thailand. Globally, Indonesia ranked ninth in both cinema admissions (127 million) and film production (241 features) in 2024 — despite major markets registering only modest growth or declines.\n\n\n\tYet the report highlights a paradox. Indonesia remains profoundly underscreened, with just 7.7 screens per million people — far below South Korea, Japan, China and Malaysia — even though the country had 6,600 screens during its 1980s peak, compared to only 2,354 today. Most screens are concentrated in Java, and Cinema XXI alone controls about 60% of the national total, one of the most dominant single-operator positions in the world.\n\t\n\n\tThis structural concentration has intensified another issue: the absence of a distributor layer. The report calls this Indonesia’s “missing link.” Producers must negotiate directly with exhibitors, carry all marketing and commercial risk, and rely on first-day performance to secure screen time — a system that disadvantages films that build slowly on word of mouth.\n\n\tProduction, meanwhile, is undergoing a generational shift. While long-dominant studios such as MD Pictures, Starvision Plus and Falcon continue to anchor the market, the report shows a new set of leaders emerging. The Top 10 production houses by number of releases in 2022–2025 listed in the report are: Legacy Pictures, Falcon, MVP Pictures, Starvision Plus, RAPI Films, Pichouse Films, MD Pictures, Visinema 786 Productions and IDN Media.\n\n\tMany of these companies, the report notes, are scaling rapidly through co-production and co-financing models. Hits such as “Agak Laen,” “Sore,” “Siksa Kubur” and “Pengepungan di Bukit Duri” illustrate rising creative confidence and audience appetite for hybridised genres.\n\n\tHorror now leads the Indonesian box office outright. Half of the top 10 Indonesian films by admissions since 2011 are horror titles, and recent successes blend horror with comedy or drama, mirroring global trends and widening the genre’s commercial reach.\n\n\tThe report also stresses that filmgoing remains cultural bedrock. Indonesia’s cinema culture dates back to 1900, and moviegoing habits historically rose and fell with the industry’s creative cycles. But affordability remains a major barrier: when measured against GDP per capita, Indonesia ranks as the least affordable cinema market among those compared — even though the average ticket price is only around $3.\n\n\tEconomically, the screen sector’s impact is considerable. It contributes $5.1 billion to GDP and supports nearly 400,000 jobs. Every trillion rupiah in new investment can produce almost $900 million in economic output and create close to 4,000 skilled jobs — positioning film as not just a cultural force but a powerful economic multiplier.\n\n\tTo convert momentum into long-term stability, the report outlines three priority reforms: modernising film policy (including replacing censorship with classification and enforcing data transparency), expanding market access through fairer screen allocation and regional film commissions, and attracting “smart capital” supported by tax rebates and production-based incentives.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Indonesia’s Film Sector Poised for Regional Breakout, JAFF Market–Cinepoint Report Finds",
      "image": [
        "https://variety.com/wp-content/uploads/2025/09/Sore-Wife-From-The-Future.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-01T07:37:09.000Z",
      "dateModified": "2025-12-01T07:37:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Diljit Dosanjh Takes to the Skies in ‘Border 2’ First Look as Film Expands Beyond Battlefield (EXCLUSIVE)",
    "url": "https://variety.com/2025/film/news/diljit-dosanjh-border-2-first-look-1236596051/",
    "image": "https://variety.com/wp-content/uploads/2025/11/Diljit-Dosanjh-Border-2.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-01T05:26:27.000Z",
    "description": "\n\tT-Series and JP Films have unveiled the first look of Diljit Dosanjh from “Border 2,” revealing the film will expand its scope to include the Indian",
    "body": "\n\tT-Series and JP Films have unveiled the first look of Diljit Dosanjh from “Border 2,” revealing the film will expand its scope to include the Indian Air Force alongside ground forces.\n\n\tThe poster shows Dosanjh in a fighter jet cockpit, portraying an Indian Air Force officer. The image marks a significant expansion of the franchise’s narrative scope, signaling that aerial combat will feature prominently alongside traditional battlefield sequences.\n\t\n\n\tSet in 1971, the original “Border” (1997) was headlined by Sunny Deol, and took place along the border region of Longewala, where a small battalion of Indian soldiers fought a large Pakistani strike force. It is considered a landmark Indian war film. \n\n\n\t“Border 2” is directed by Anurag Singh who previously helmed Akshay Kumar-starring “Kesari” (2019), based on the Battle of Saragarhi in which an army of 21 Sikhs fought against 10,000 Afghans in 1897.\n\n\tThe film reunites Dosanjh with Singh, with whom he has collaborated on multiple successful Punjabi-language films including “Jatt & Juliet” (2012), “Jatt & Juliet 2” (2013), “Disco Singh” (2014), “Punjab 1984” (2014), and “Super Singh” (2017). The film stars Sunny Deol, Varun Dhawan, Dosanjh, Ahan Shetty, Medha Rana, Mona Singh and Sonam Bajwa.\n\n\tThe film is produced by Bhushan Kumar, JP Dutta and Nidhi Dutta under the T-Series and JP Films banners. Presented by Gulshan Kumar and T-Series in association with J.P. Dutta’s J.P. Films, the production team includes Bhushan Kumar, Krishan Kumar, J.P. Dutta and Nidhi Dutta.\n\n\tThe release is strategically scheduled for Jan. 23, 2026, positioning the patriotic actioner for the Republic Day weekend in India, a prime slot for films celebrating national themes.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Diljit Dosanjh Takes to the Skies in ‘Border 2’ First Look as Film Expands Beyond Battlefield (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/Diljit-Dosanjh-Border-2.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-01T05:26:27.000Z",
      "dateModified": "2025-12-01T05:26:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘The New Yorker at 100’ Review: A Nimble and Infectious Portrait of the Quintessential Magazine",
    "url": "https://variety.com/2025/film/reviews/the-new-yorker-at-100-review-david-remnick-1236595595/",
    "image": "https://variety.com/wp-content/uploads/2025/11/The_New_Yorker_at_100_-V1-0169_45_20250331-H-2025.webp?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-01T07:14:05.000Z",
    "description": "\n\t“The New Yorker at 100” is a nimble and infectious documentary, one that brings off a trick more challenging than it looks. (In that way, it’s a lot",
    "body": "\n\t“The New Yorker at 100” is a nimble and infectious documentary, one that brings off a trick more challenging than it looks. (In that way, it’s a lot like the magazine.) In just 96 minutes, the film, directed by Marshall Curry and narrated by Julianne Moore, lays out the fabled history of The New Yorker. It colors in the magazine’s larger cultural significance. It gives us a close-up, between-the-lines portrait of how The New Yorker gets put together each week, presenting us with the creation of its 100th anniversary issue (which came out this past February) as a template for what happens on a more regular basis.\n\t\n\n\tAnd it folds all of this into the enticing story of the magazine’s vibe and aesthetic: the way its commitment to truth and beauty are flip sides of the same coin, and how its manner of looking at the world, while up-to-the-minute and fully alive, is slyly rooted in the analog sanity of an earlier time. The New Yorker loves and fetishizes its traditions (the monocled fop Eustace Tilley, that stately but sensual Adobe Caslon font), but the magazine’s ultimate tradition is cutting through the scrim of contemporary noise to look reality in the eye, presenting it to the reader with a no-fuss vibrance.\n\n\n\tIf you’re a fan of The New Yorker and want a backstage tour of how the supremely refined sausage gets made, “The New Yorker at 100” draws back the curtain in an enchanting way. Here’s the fateful weekly cartoon meeting, where the final 60 contenders (out of 1,000 weekly submissions) get sorted into yes, no, or maybe baskets. Here’s the writer Nick Paumgarten trying to drum up a Talk of the Town piece by wandering through the East Village and questioning random New Yorkers about what’s on their minds, a catch-as-catch-can method that, in its way, reflects the magazine’s democratic openness.\n\t\n\n\tAnd here’s David Remnick, The New Yorker’s editor since 1998, doing his daily two-step of menschy straightforwardness and Machiavellian demand — a mystique that brings out the best in his writers, because they know just how tough he is in pursuit of the Platonic ideal of quality. For Remnick, The New Yorker is a holy mission that delights and consumes him. He says that he feels like Fred Astaire when his feet hit the pavement each morning, and he’s such a compulsive scheduler that his idea of relaxation is a Sunday guitar lesson. He also describes, with cutting candor, how having a profoundly autistic daughter heightened his humanity as a journalist.\n\n\tIn the 1960s and ’70s, I was one of countless middle-class kids who grew up with The New Yorker because my parents subscribed to it. It arrived each week looking less like a magazine than a plumply beautiful objet d’art (the painted covers, the cartoons and illustrations placed just so, the pages so voluminous they threatened to burst out of their stapled binding).\n\n\tIn that era, The New Yorker occupied a weirdly contradictory place in the new American nexus of highbrow and lowbrow, tradition and counterculture. The magazine still looked the way it did when Harold Ross created it in the 1920s, yet its airy elegance had a timelessness about it. Its articles were written in rigorous prose — yet they had a lightness, an accessibility that invited you in. The writing was pure, yet every column was lined with flamboyantly tasteful advertisements; the magazine was a kind of literary cash cow. The editor starting in 1952, William Shawn, was a famously shy and soft-spoken man, yet in the photographs we see of him in the documentary he has the gaze of a killer.\n\n\tAnd, crucially, the magazine set itself apart from the tumultuous vulgarity of American pop culture, yet by the ’70s the hippies and game-changing boomers had evolved into what was called “the film generation” (this meant that they were the first generation that liked to watch rather than read), and no writer of the 20th century had her finger on the pulse of movies as electrifyingly as the New Yorker film critic Pauline Kael. Kael was, and remains, the magazine’s grandest contradiction. She was the rock-star writer who helped to keep The New Yorker relevant, even as her heady stream-of-consciousness prose undercut the magazine’s Zen stateliness.\n\t\n\n\tKael is mentioned in the documentary’s opening fanfare, and never again after that: a crucial omission. I say that not just because, as a critic who grew up with her, Kael looms large for me, but because she was the magazine’s most popular and important writer for 25 years. (What, you’re going to say it was John McPhee?)\n\n\tMysterious Kael snub aside, “The New Yorker at 100” spotlights those moments when the magazine shifted the culture and altered the essence of journalism. John Hersey’s “Hiroshima,” the revelatory 30,000-word report on the aftermath of the dropping of the nuclear bomb (it took up an entire issue in 1946), was devoured the world over. It was, in effect, the documentary that the U.S. government wouldn’t allow to be made. Rachel Carson’s “Silent Spring,” written in installments for The New Yorker as she was dying of cancer, was the book that launched the environmental movement. In 1962, Shawn recruited an unknown writer named James Baldwin to write a piece about the Black experience of racism that became the eye-opening template for “The Fire Next Time.” And Truman’s Capote’s “In Cold Blood,” serialized in The New Yorker, birthed not only the true-crime genre but the non-fiction novel. It proved highly controversial, because Capote made up certain conversations, and Shawn ultimately said that he regretted publishing it. But its influence was immeasurable.\n\n\tIt’s easy to make a case for The New Yorker’s singularity based on seismic works of journalism like these. Yet “The New Yorker at 100” gets into how The New Yorker has long been a magazine devoted not just to seriousness but delight, and how those two qualities are symbiotic. Everything in the magazine is aesthetic — the covers, the perfectly placed doodles, the way the words on the page, and even the punctuation marks, have the feel of physical objects. Jon Hamm, Molly Ringwald, Ronny Chieng, and Jesse Eisenberg (who became a contributor of humor pieces) each sit for an interview in one of the magazine’s original wooden office chairs, testifying to the effect The New Yorker had on them. Yet the documentary also references the nearly iconic joke about how issues of the magazine would pile up in people’s living rooms, like the ultimate unread homework assignment. Was — is — The New Yorker too precious for its own good? Occasionally, yes. Mostly, no.\n\t\n\n\tAnd 100 years on, what I continue to find extraordinary about The New Yorker — I think this is key to what Remnick, in the film, calls “miraculous” about it — is that the magazine was founded, in the Algonquin Roundtable ’20s, as a way of looking at the world that in its casual American insouciance would remain above the fray. And it stayed above the fray, even as it revealed the perils of the real world (nuclear disaster, the murder of the environment by chemicals, the violence that began to tear through Middle America) more than any other journalistic institution did. Now, decades later, as the proliferation of shabby kaleidoscopic media threatens to tear our very perception of reality apart, The New Yorker is still above the fray. We might need it now more than ever, even as it undergoes the ultimate stress test: Is there a place in our fractious civilization for a publication this civilized?\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘The New Yorker at 100’ Review: A Nimble and Infectious Portrait of the Quintessential Magazine",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/The_New_Yorker_at_100_-V1-0169_45_20250331-H-2025.webp?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-01T07:14:05.000Z",
      "dateModified": "2025-12-01T07:14:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Siddhant Chaturvedi’s First Look as V. Shantaram Unveiled for Indian Filmmaker Biopic (EXCLUSIVE)",
    "url": "https://variety.com/2025/film/news/siddhant-chaturvedi-first-look-v-shantaram-1236595969/",
    "image": "https://variety.com/wp-content/uploads/2025/11/Shantaram.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-01T05:30:00.000Z",
    "description": "\n\tThe makers of upcoming biographical drama “V. Shantaram” have unveiled the first look of Siddhant Chaturvedi as the legendary Indian filmmaker.\n\n\tTh",
    "body": "\n\tThe makers of upcoming biographical drama “V. Shantaram” have unveiled the first look of Siddhant Chaturvedi as the legendary Indian filmmaker.\n\n\tThe announcement poster introduces Chaturvedi in the title role of V. Shantaram, the auteur long celebrated as a visionary of Indian cinema. The film chronicles Shantaram’s remarkable journey from the silent era through the advent of sound and color, showcasing his evolution as one of India’s most influential filmmakers.\n\t\n\n\tV. Shantaram, born Shantaram Rajaram Vankudre in 1901, was a pioneering force in Indian cinema whose career spanned nearly seven decades. He founded two major film studios — Prabhat Film Company in 1929 and Rajkamal Kalamandir in 1942 — and directed the first Marathi-language talkie, “Ayodhyecha Raja,” in 1932. His films, including classics like “Duniya Na Mane” (1937), “Do Aankhen Barah Haath” (1957), “Jhanak Jhanak Payal Baaje” (1955) and “Navrang” (1959) were celebrated for their technical innovations and progressive social themes addressing issues like communal harmony, dowry, and prisoner rehabilitation. Known for his signature style of lavish sets, unique song picturizations, and visual symbolism — he used cinema as an instrument for social change throughout his career. He received India’s highest film honor, the Dadasaheb Phalke Award, in 1985. \n\n\n\tWritten and directed by Abhijeet Shirish Deshpande, the project is presented by Rajkamal Enterttainment, Camera Take Films and Roaring Rivers Productions. Rahul Kiran Shantaram, Subhash Kale and Sarita Ashwin Varde serve as producers.\n\n\t“Portraying V. Shantaram-ji is one of the greatest honors of my life,” Chaturvedi said. “The more I read about his journey, the more humbled I felt. He wasn’t just a pioneer of Indian and global cinema, he was a visionary who kept pushing forward no matter the obstacles. Stepping into his world has been my most transformative experience as an actor. His life moved me deeply and reminded me of the power of perseverance. It’s a lesson I hope to hold close, both in my work and in every moment of my life.”\n\t\n\n\tDirector Deshpande said, “V. Shantaram has been a huge source of inspiration for me as a filmmaker. His courage to experiment and his vision shaped so much of the cinema we know today. Telling his story is an honour and I hope we do justice to the man behind the legend. With this first poster, we are sharing a glimpse of that journey, with Siddhant Chaturvedi stepping into a role we always believed he was meant to play.”\n\n\tProducer Kale added, “V. Shantaram-ji’s legacy is one of the strongest pillars of Indian cinema. His vision, his struggles and his innovations continue to inspire all of us who work in this industry. With this film, we hope to honour his journey in the most sincere way possible. As we unveil the first poster today, we are proud to have Siddhant Chaturvedi step into his shoes. His sincerity and commitment make him a fitting face to carry forward Shantaram ji’s legacy.”\n\n\tProducer Varde added, “V. Shantaram isn’t just one of the greatest architects of Indian cinema, he is its heartbeat. Yet his extraordinary vision and contributions have often remained under celebrated. With this film, we hope to bring his legacy into the spotlight. Siddhant Chaturvedi was our first and only choice for the part. His passion and sincerity made him the natural choice to portray Shantaram-ji on screen.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Siddhant Chaturvedi’s First Look as V. Shantaram Unveiled for Indian Filmmaker Biopic (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/Shantaram.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-01T05:30:00.000Z",
      "dateModified": "2025-12-01T05:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Luhki Herwanayogi’s ‘Our Son’ Explores Unconventional Family at JAFF Future Project",
    "url": "https://variety.com/2025/film/markets-festivals/luhki-herwanayogi-our-son-unconventional-family-jaff-1236596037/",
    "image": "https://variety.com/wp-content/uploads/2025/10/Our-Son.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-01T04:38:36.000Z",
    "description": "\n\tLuhki Herwanayogi, whose short film “On Friday Noon” screened at Locarno Film Festival Open Doors in 2020 and who received the 2021 Locarno Open Doo",
    "body": "\n\tLuhki Herwanayogi, whose short film “On Friday Noon” screened at Locarno Film Festival Open Doors in 2020 and who received the 2021 Locarno Open Doors Award, has his feature debut “Our Son” selected for the JAFF Future Project as a work-in-progress, about two childless married couples who raise a son from an illicit affair between the households.\n\n\tThe Indonesia production, directed by Herwanayogi and produced by Iqbal Mohammad Hamdan through production company Catchlight Pictures alongside Qun Films, is among 10 Asia-Pacific titles selected for the JAFF Future Project at this year’s JAFF Market in Yogyakarta, Indonesia. The project won the Purin Award for best project from Southeast Asia at Busan Asian Film School Pitching Project in 2019.\n\t\n\n\t“Our Son” follows Lita, a 27-year-old bank employee who reunites with her ex-lover Sandi, a 29-year-old furniture entrepreneur, after years of separation. Their relationship becomes close again when Lita asks Sandi to furnish her new home. Sandi frequently visits and meets Lita’s husband Bob, who works as a mining employee. Sandi invites his wife Eli to visit Lita’s house. Both families face pressure from relatives to have children, which brings them closer, especially Lita and Eli.\n\n\n\tLita becomes pregnant and gives birth to a son named Aryo. Sandi and Eli often help take care of Aryo as Lita and Bob are busy with work. Several years later, Aryo falls ill and requires a blood transfusion. However, Lita and Bob’s blood types are not compatible with Aryo’s, but Sandi’s blood type is a match — unveiling the secret that Aryo is Sandi and Lita’s child.\n\t\n\n\t“‘Our Son’ explores the issues present in many Indonesian families — about social pressures that give rise to new problems,” Herwanayogi says. “Unfortunately, these matters are often left unspoken, buried, and eventually become a pile of generational issues. For me, it is important to unravel these layers and talk about them through the medium I know best: film.”\n\n\tThe director wants to convey a message about judgment and personal choice. “That every person carries their own problems and their own choices in life, and we have no right to judge them,” he says.\n\n\tProducer Hamdan emphasized their long collaboration and the project’s market potential. “Luhki and I have been working together for more than 15 years, and I’ve produced almost all of his short films and commercial portfolios,” he says. “I trust his strong directorial vision and his professionalism — both essential qualities as we step into the industry with this debut feature.”\n\n\tHamdan believes the film has strong commercial potential. “I also believe that ‘Our Son’ carries a universal theme while remaining highly relevant to local audiences,” he says. “This combination gives me confidence that the film has strong potential to succeed in both domestic and international markets.”\n\n\tAt JAFF Market, the team seeks post-production support and distribution partners. “We hope to find partners to support our post-production – especially grading, music, and sound,” the filmmakers say. “We’re also looking for investors who can help strengthen our marketing and have strong connections with domestic exhibitors, as well as festivals and international sales agents for global distribution.”\n\n\tJAFF Future Project functions as both a development platform and co-production hub, designed to advance independent works toward completion and distribution. The initiative runs Nov. 29-Dec. 1 at the Jogja Expo Center in Yogyakarta as part of the broader 20th-anniversary celebration of the Jogja-Netpac Asian Film Festival.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Luhki Herwanayogi’s ‘Our Son’ Explores Unconventional Family at JAFF Future Project",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/Our-Son.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-01T04:38:36.000Z",
      "dateModified": "2025-12-01T04:38:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Psychological Horror ‘The Most Mysterious Man’ Secures Malaysian Co-Financing at JAFF Market",
    "url": "https://variety.com/2025/film/markets-festivals/psychological-horror-most-mysterious-man-malaysian-financing-1236596044/",
    "image": "https://variety.com/wp-content/uploads/2025/11/Malaysia-MoU.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-01T04:56:53.000Z",
    "description": "\n\tIndonesian filmmaker Ismail Basbeth‘s psychological horror feature “The Most Mysterious Man” (local title: “Raib”) has landed co-financing from Mala",
    "body": "\n\tIndonesian filmmaker Ismail Basbeth‘s psychological horror feature “The Most Mysterious Man” (local title: “Raib”) has landed co-financing from Malaysia’s Phoenix Films Sdn Bhd, with the deal finalized during JAFF Market 2025.\n\n\tThe agreement was signed at the Indonesian Ministry of Culture Booth by Ruang Basbeth Bercerita, the media and publishing company founded by Ismail Basbeth and producer Lyza Anggraheni. The project marks the first fully original concept from Ismail Basbeth developed from inception under the duo’s producer-director partnership.\n\t\n\n\t“The Most Mysterious Man” follows a craftsman devoted to his wife and three children whose life unravels when he returns home to find another family living in his house and his loved ones missing. As he searches for answers, no one in his village recognizes him despite his lifelong residence there, sending him spiraling into paranoia and violence.\n\n\n\tAnggraheni developed the story alongside the director over seven months at Busan Asian Film School. The project previously earned the TAICCA Award at the Asian Contents & Film Market during the Busan program in 2024, and was selected for the Asian Producers Network 2024 at the Singapore International Film Festival.\n\n\tAnggraheni won the MTN Development Fund from Indonesia’s Ministry of Culture in October for her separate project “The Light of Fire.” She has been developing “The Most Mysterious Man” through the Talents Tokyo 2023 program.\n\n\tRuang Basbeth Bercerita will produce in co-production with Matta Cinema Production and Phoenix Films Sdn Bhd. The project is seeking additional co-production and international distribution partners ahead of a planned 2026 production start.\n\t\n\n\tBasbeth’s “Sara” premiered at the Busan International Film Festival and earned him the best director Award at JAFF 2023. He is currently shooting “My Own Last Supper.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Psychological Horror ‘The Most Mysterious Man’ Secures Malaysian Co-Financing at JAFF Market",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/Malaysia-MoU.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-01T04:56:53.000Z",
      "dateModified": "2025-12-01T04:56:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Observational Documentary ‘Aluk’ Traces Seven Years With Indonesian Tana Toraja Family at JAFF Future Project",
    "url": "https://variety.com/2025/film/markets-festivals/observational-doc-aluk-seven-years-indonesian-family-1236596022/",
    "image": "https://variety.com/wp-content/uploads/2025/11/Aluk.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-01T04:16:51.000Z",
    "description": "\n\tChris C.F’s observational documentary “Aluk,” which follows three generations of a family in Tana Toraja, Indonesia over seven years as they reckon ",
    "body": "\n\tChris C.F’s observational documentary “Aluk,” which follows three generations of a family in Tana Toraja, Indonesia over seven years as they reckon with the loss of their patriarch and their community’s uncertain future, is selected for the JAFF Future Project as a work-in-progress.\n\n\tThe Australia-Indonesia co-production, directed by Chris C.F and produced by Sam Hewison and Wahyu Al Mardhani through production company Cut By Dog Production, is among 10 Asia-Pacific titles selected for the JAFF Future Project at this year’s JAFF Market in Yogyakarta, Indonesia.\n\t\n\n\t“Aluk” follows four members of a Tana Toraja family: Ne’ Minda, the grandfather; Ma’ Adel, the mother; Pong Kenny, the uncle; and Marsel, the son. The film traces Marsel’s childhood over seven years, as his grandfather reveals his ancestors’ way of life — Aluk To Dolo, one grounded in the maintenance of environmental equilibrium.\n\n\n\tNe’ Minda demonstrates how these practices inform the functioning of their tight knit community — one of the last remaining villages where Aluk To Dolo is still observed in Tana Toraja. The transformations their community face are numerous: a majority of the region’s population has converted to Christianity, many young people have left to seek prosperity on neighboring islands, and climate change is already taking a toll on local agricultural production.\n\n\tThe stories of Marsel’s mother and uncle delineate two paths taken by their generation — to remain in the village or to leave, and the sacrifices each path requires. An immersive exploration of labor, love and loss, the film culminates in the death of Ne’ Minda, as the family reckons with the loss of their patriarch.\n\t\n\n\tFor Chris C.F, the project began with research into how people approach death around the world. “My interest in this arguably morbid topic wasn’t born from a desire to be confronted with, or to confront others with sensational images of dead bodies,” the director says. “My fascination with the way we process death originated at the open casket funeral of my grandfather.”\n\n\tThe director’s grandfather was liberated from German concentration camps and escaped communist Poland to start a new life in Australia. “It was the first time I’d been faced with the physical reality of death,” he says. “In Australia, it’s a realm confined almost entirely to medical professionals, industrialized and sanitized. That period of time spent with his lifeless body had a profound and lasting impact on me. Toraja is a place where people actively elongate these periods spent alongside loved ones passed, and celebrate their lives in the most festive of ways.”\n\n\tChris C.F traveled to Toraja for the first time in 2017 with producer Sam Hewison and cinematographer John Hewison, meeting Ne’ Minda at a funeral. “Unlike most people we met in Toraja who had converted to Christianity, he was an adherent of Aluk To Dolo,” the director says. Ne’ Minda invited them to his home to film a ritual for a new rice barn, and they met his daughter Ma’ Adel and her children.\n\n\tThe team returned in 2019 for two months, meeting filmmakers Wahyu Al Mardhani and Tasya Amaliah from Makassar, who became close collaborators. COVID-19 closed international borders, pausing work on the project until 2022. The crew returned for another two months in 2022, and Chris C.F returned alone in 2023 to continue work with Wahyu, staying with Ne’ Minda — which was sadly the last time they saw him.\n\n\tNe’ Minda passed away at the end of 2023. The family invited the team to attend his funeral in early 2024 and encouraged them to continue filming. “We feel incredibly privileged to have been invited into the lives of Ne’ Minda and his family, and to have had the opportunity to create such strong bonds with them over a period of eight years,” the director says.\n\n\t“‘Aluk’ will be both an ode to Ne’ Minda, who passed away unexpectedly but peacefully at the end of 2023, as well as an immersive exploration of his community’s devotion to their land and those who came before them,” Chris C.F says. “‘Aluk’ will not lean on the mystical or magical, instead focusing on the significance of everyday labor and interaction, on Toraja symbols and their deep connotations, on its sounds and rapturous harmonies, and on the human relationships which keep us afloat in the face of hardship and loss — it’s a film about love.”\n\t\n\n\tAt JAFF Market, the team hopes to meet potential collaborators. “We are incredibly excited to meet Indonesian producers that we’ve admired for so long, as well as producers and distributors internationally who might help carve new paths for the film,” the filmmakers say.\n\n\tJAFF Future Project functions as both a development platform and co-production hub, designed to advance independent works toward completion and distribution. The initiative runs Nov. 29-Dec. 1 at the Jogja Expo Center in Yogyakarta as part of the broader 20th-anniversary celebration of the Jogja-Netpac Asian Film Festival.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Observational Documentary ‘Aluk’ Traces Seven Years With Indonesian Tana Toraja Family at JAFF Future Project",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/Aluk.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-01T04:16:51.000Z",
      "dateModified": "2025-12-01T04:16:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Siti’ Director Eddie Cahyono’s ‘My Mother’ Explores Migrant Worker Crisis at JAFF Future Project",
    "url": "https://variety.com/2025/film/markets-festivals/eddie-cahyono-my-mother-migrant-worker-crisis-1236596047/",
    "image": "https://variety.com/wp-content/uploads/2025/11/My-Mother.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-12-01T05:10:13.000Z",
    "description": "\n\tEddie Cahyono, whose 2014 drama “Siti” won the Piala Citra for best film at the Indonesian Film Festival, has his latest work “My Mother” selected f",
    "body": "\n\tEddie Cahyono, whose 2014 drama “Siti” won the Piala Citra for best film at the Indonesian Film Festival, has his latest work “My Mother” selected for the JAFF Future Project as a work-in-progress, about a widow who wants to meet her daughter sentenced to death in Saudi Arabia for murdering her employer.\n\n\tThe Indonesia production, directed by Cahyono and produced by Tika Bravani, Eddie Cahyono and Isabelle Glachant through production companies ANP Talenta Media, Memorieslight Pictures, Yasa Buana Film, Knockonwood.inc and Sasha & Co Production, is among 10 Asia-Pacific titles selected for the JAFF Future Project at this year’s JAFF Market in Yogyakarta, Indonesia.\n\t\n\n\t“My Mother” follows a widow attempting to reunite with her daughter who has been sentenced to death in Saudi Arabia for murdering her employer. However, the daughter refuses to see her mother, having never forgiven her for past betrayals.\n\n\n\tThe project stems from a deeply personal memory for Cahyono. “‘My mother once told me that she left the village to go to the city for a better life. And that touched my heart,'” the director says. “That memory prompted me to research migrant workers. They dream that working abroad will be a solution to their families’ financial problems.”\n\n\tWhat surprised the director during his research were the domestic problems faced by those who worked abroad. “What surprised me was that those who worked abroad had problems with their families in Indonesia,” he says. “Domestic violence or even those who were forced into marriage by their parents to cover debts.”\n\n\tThis led Cahyono to shift his focus to the families in Indonesia. “I then became interested in the families they left behind,” he says. “Parents, mothers, and fathers, what happened to them, how did they feel after their children left? This story contains questions about separation, loss, and how to let go.”\n\t\n\n\tThe director emphasizes the broader significance of the story beyond individual characters. “This film is about a mother’s impossible choice, the strength of the human spirit, and the desperate realities faced by women migrant workers,” Cahyono says. \n\n\tAt JAFF Market, the production team seeks crucial industry partnerships. “The film market is crucial to the film industry,” the filmmakers say. “The JAFF Market aims to gain exposure and collaborate with co-funding, distribution, and festivals. And, of course, how the ‘My Mother’ film project will be recognized by the wider public.”\n\n\tJAFF Future Project functions as both a development platform and co-production hub, designed to advance independent works toward completion and distribution. The initiative runs Nov. 29-Dec. 1 at the Jogja Expo Center in Yogyakarta as part of the broader 20th-anniversary celebration of the Jogja-Netpac Asian Film Festival.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Siti’ Director Eddie Cahyono’s ‘My Mother’ Explores Migrant Worker Crisis at JAFF Future Project",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/My-Mother.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-12-01T05:10:13.000Z",
      "dateModified": "2025-12-01T05:10:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Guess Who This Mini Icon Turned Into!",
    "url": "https://www.tmz.com/2025/12/01/guess-who-this-mini-icon-turned-into/",
    "image": "https://imagez.tmz.com/image/df/16by9/2025/11/12/dff6eb2409c24467b12ae52cf608c95d_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-12-01T08:01:51.000Z",
    "description": "\n    \n                    \n                          Guess Who This\n                          Mini Icon\n                          Turned Into!\n       ",
    "body": "\n    \n                    \n                          Guess Who This\n                          Mini Icon\n                          Turned Into!\n                      \n                  \n                        Published December 1, 2025 12:01 AM PST\n                                                                            \n      \n    \n      \n        \n              \n    \n    \n          Before this lil baby from way up north turned into a superstar, he was just rockin' his blue and red 'fit, and singin' up a storm.\n      \n    \n          He became a sensation in the early 2010s under the guidance of Usher, and now he's one of the world's biggest stars. If you're sleeping under a rock, just catch him headline Coachella 2026.\n      \n    \n          Can you guess who he is?\n      \n      \n      \n          \n            \n              \n                \n                Share on Facebook\n              \n            \n            \n              \n                \n                Share on X\n              \n            \n                          \n                \n                  \n                \n              \n                      \n        \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Guess Who\n              \n                          \n                Kids\n              \n                          \n                celebrity kids\n              \n                          \n                Photo Galleries\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Guess Who This Mini Icon Turned Into!",
      "image": [
        "https://imagez.tmz.com/image/df/16by9/2025/11/12/dff6eb2409c24467b12ae52cf608c95d_xl.jpg"
      ],
      "datePublished": "2025-12-01T08:01:51.000Z",
      "dateModified": "2025-12-01T08:01:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Stars and Scars -- You Be the Judge",
    "url": "https://www.tmz.com/2025/11/29/polls-you-be-the-judge/",
    "image": "https://imagez.tmz.com/image/e2/16by9/2025/11/28/e2e2745467204d4aad19e037a27f6b48_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-29T08:45:46.000Z",
    "description": "\n      SUBSCRIBE\n      Yes! Send me email updates and offers from TMZ and its Affiliates. By subscribing, I agree to the Privacy Policy and Terms of U",
    "body": "\n      SUBSCRIBE\n      Yes! Send me email updates and offers from TMZ and its Affiliates. By subscribing, I agree to the Privacy Policy and Terms of Use\n        Subscribe to TMZ newsletter\n        \n      FOLLOW\n      \n        \n        \n        \n        \n      \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Stars and Scars -- You Be the Judge",
      "image": [
        "https://imagez.tmz.com/image/e2/16by9/2025/11/28/e2e2745467204d4aad19e037a27f6b48_xl.jpg"
      ],
      "datePublished": "2025-11-29T08:45:46.000Z",
      "dateModified": "2025-11-29T08:45:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Biker Influencer Karen Sofía Quiroz Ramírez Dead at 25",
    "url": "https://www.tmz.com/2025/11/30/influencer-karen-sofia-quiroz-ramirez-dies/",
    "image": "https://imagez.tmz.com/image/c0/16by9/2025/11/30/c0735779e03d4a458e5f7b1dad0ce080_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-12-01T01:01:31.000Z",
    "description": "\n    \n                    \n                          Karen Sofía Quiroz Ramírez\n                          Dead at 25 ...\n                          Bik",
    "body": "\n    \n                    \n                          Karen Sofía Quiroz Ramírez\n                          Dead at 25 ...\n                          Biker Influencer Killed After Running Into Truck\n                      \n                  \n                        Published November 30, 2025 5:01 PM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Karen Sofía Quiroz Ramírez -- a popular influencer known for posting motorcycle- related content -- has died ... according to South American outlets.\n      \n    \n          The star -- also known as \"Bikegirl\" online -- lost control of her motorcycle and ran into a truck in Floridablanca, Colombia on Wednesday ... according to Brazilian oulet Metropoles.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          After colliding with the truck, Ramírez was reportedly run over by another truck.\n      \n\n          Jahir Andres -- a transport official in the country -- told the Daily Mail, \"The most likely hypothesis for the accident is that the motorcyclist was traveling between two vehicles\" ... an act more commonly referred to as lane splitting. Andres also told DM an investigation into Karen's death is underway.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          According to Metropoles, Ramírez made a chilling social media posts hours before her death ... writing online, \"I'm hoping I don’t crash, because I’m riding without my glasses.\"\n      \n    \n        Waiting for your permission to load the Instagram Media.\n      \n    \n          Karen had more than 30,000 Instagram followers at the time of her death. Four days ago, she posted video of herself washing her bike.\n      \n    \n          Ramírez was 25.\n      \n    \n          RIP\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Social Media\n              \n                          \n                RIP\n              \n                          \n                Celebrity Death\n              \n                          \n                Instagram\n              \n                          \n                Viral\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Biker Influencer Karen Sofía Quiroz Ramírez Dead at 25",
      "image": [
        "https://imagez.tmz.com/image/c0/16by9/2025/11/30/c0735779e03d4a458e5f7b1dad0ce080_xl.jpg"
      ],
      "datePublished": "2025-12-01T01:01:31.000Z",
      "dateModified": "2025-12-01T01:01:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sydney Sweeney Dresses as Sexy Version of Dragon From 'Shrek' Movies",
    "url": "https://www.tmz.com/2025/11/30/sydney-sweeney-dresses-sexy-dragon-shrek-movies/",
    "image": "https://imagez.tmz.com/image/2b/16by9/2025/12/01/2b99fc6d412748c48ec8af20efcdd6c3_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-12-01T01:45:20.000Z",
    "description": "\n    \n                    \n                          Sydney Sweeney\n                          Breathes Fire With Hot Dragon Ensemble!!!\n              ",
    "body": "\n    \n                    \n                          Sydney Sweeney\n                          Breathes Fire With Hot Dragon Ensemble!!!\n                      \n                  \n                        Published November 30, 2025 5:45 PM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Sydney Sweeney's Friendsgiving costume was super hot ... and, we mean that literally because she dressed up as Dragon from \"Shrek\" -- with a sexy twist.\n      \n    \n          The actress shared a series of photos from her week of hanging out with friends around Thanksgiving ... sharing snaps from a Disney park, a bar and a lake.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          One event she and her pals took part in was a party where everyone dressed as their favorite character from \"Shrek\" ... with Sydney throwing on red horns, a low-cut matching top and bottoms which revealed a lot of her impressive backside like the huge dragon from the hit film series.\n      \n\n          She took photos with someone dressed in a giant inflatable Donkey costume ... unclear if this is her man, Scooter Braun -- but, it's fun to imagine it is.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Sydney also took a fun pic with her friend who dressed up as the Gingerbread Man from the movie .., puffing out a pair of duck lips as she posed with a Shrek cut-out -- her leg wrapped around the ogre's.\n      \n    \n          Sweeney's seemingly enjoying some time off ... jet skiing in a skimpy bikini and grabbing a low-key lunch with Braun earlier this month -- shortly after she was criticized when her boxing biopic \"Christy\" bombed at the box office.\n      \n    \n          Regardless, she still reeks of feminine beauty ... check out the clip from the OG \"Shrek\" film if ya don't get the reference!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Sydney Sweeney\n              \n                          \n                Humor\n              \n                          \n                Fashion\n              \n                          \n                Movies\n              \n                          \n                Holidaze\n              \n                          \n                Viral\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sydney Sweeney Dresses as Sexy Version of Dragon From 'Shrek' Movies",
      "image": [
        "https://imagez.tmz.com/image/2b/16by9/2025/12/01/2b99fc6d412748c48ec8af20efcdd6c3_xl.jpg"
      ],
      "datePublished": "2025-12-01T01:45:20.000Z",
      "dateModified": "2025-12-01T01:45:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nigel Lythgoe Insists Sexual Assault Allegations Aren't True, Says He's Producing Again",
    "url": "https://www.tmz.com/2025/11/30/nigel-lythgoe-defends-himself-sexual-assault-allegations/",
    "image": "https://imagez.tmz.com/image/5b/16by9/2025/11/30/5b616f85c9fa4bd5ae0900dbdcf94afb_xl.png",
    "tag": "Entertainment",
    "date": "2025-12-01T00:23:06.000Z",
    "description": "\n    \n                    \n                          Nigel Lythgoe\n                          Paula Abdul's Allegations Weren't True ...\n              ",
    "body": "\n    \n                    \n                          Nigel Lythgoe\n                          Paula Abdul's Allegations Weren't True ...\n                          Moving On By Going Back to Work\n                      \n                  \n                        Published November 30, 2025 4:23 PM PST\n                                                                            \n      \n    \n      \n        \n                    \n                  \n      \n                    BACKGRID\n          \n    \n          Nigel Lythgoe's doubling down on his denial of Paula Abdul's sexual assault allegations despite agreeing to a lawsuit settlement with her.\n      \n    \n          The TV show producer arrived at LAX this weekend ... and a paparazzo asked him what he feels he needs to do to rebuild his legacy after Adbul accused him of forcibly kissing her and grabbing her genitals.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Lythgoe says he doesn't feel he has to rebuild anything ... saying an untrue allegation was made against him -- and, try as he might to deny it, there's not much else he can do.\n      \n\n          Instead, Nigel says he's focused on upcoming projects ... revealing he's producing an upcoming show and a film as well -- though he wouldn't say what either project is about.\n      \n    \n          All this comes less than a year after Paula settled her lawsuit against Nigel ... though it's unclear if money changed hands as a result of the settlement.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          PA was clearly happy with the terms of the agreement ... telling us in a statement, \"I am grateful this chapter has successfully come to a close and is now something I can now put behind me. This has been a long and hard-fought personal battle. I hope my experience can serve to inspire other women, facing similar struggles, to overcome their own challenges with dignity and respect, so that they too can turn the page and begin a new chapter of their lives.\"\n      \n    \n          Lythgoe denied the allegations -- much like he did at the airport recently -- in the immediate aftermath of the settlement ... telling TMZ, \"We live in a troubling time where a person is now automatically assumed to be guilty until proven innocent, a process that can take years. That is why, like Paula, I am glad to be able to put this behind me. I know the truth and that gives me great comfort.”\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Paula Abdul\n              \n                          \n                Nigel Lythgoe\n              \n                          \n                TV\n              \n                          \n                Music\n              \n                          \n                Fairly Legal\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nigel Lythgoe Insists Sexual Assault Allegations Aren't True, Says He's Producing Again",
      "image": [
        "https://imagez.tmz.com/image/5b/16by9/2025/11/30/5b616f85c9fa4bd5ae0900dbdcf94afb_xl.png"
      ],
      "datePublished": "2025-12-01T00:23:06.000Z",
      "dateModified": "2025-12-01T00:23:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]