[
  {
    "title": "What Cádiz’s South Series Festival Said About the Future of TV",
    "url": "https://variety.com/2025/film/global/south-international-series-festival-2025-spanish-tv-1236525916/",
    "image": "https://variety.com/wp-content/uploads/2025/09/PACO-LEON-PREMIO-HONOR-SOUTH-2025-Foto-REYNA-3.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-09-22T12:00:22.000Z",
    "description": "Spanish TV’s future was on display in Anadalusia’s Cádiz. The South International Series Festival, which drew close to 13,000 participants, signaled key shifts: a push for global reach, the rise of...",
    "body": "<div><p>\n\tSpanish TV’s future was on display in Anadalusia’s <a target=\"_blank\" href=\"https://variety.com/t/cadiz/\">Cádiz</a>. The <a target=\"_blank\" href=\"https://variety.com/t/south-international-series-festival/\">South International Series Festival</a>, which drew close to 13,000 participants, signaled key shifts: a push for global reach, the rise of identity-driven storytelling, new awards, and Andalusia’s industrial push. Here are seven takeaways on where the business is heading, if the Festival is anything to go by.</p>\n<p>\n\t<strong>Internationalization: The Next Big Challenge</strong>\n</p>\n<p>\n\tFestival director <a target=\"_blank\" href=\"https://variety.com/t/carles-montiel/\">Carles Montiel</a> called internationalization the festival’s next “obsession.” With nearly 13,000 attendees, South already feels like a pretty weighty addition to the fest circuit. Montiel sees further growth potential by turning Cádiz into a true crossroads for the global series. The festival has steadily courted international attention – last year it welcomed “House” creator David Shore, and this edition drew <a target=\"_blank\" href=\"https://variety.com/t/diane-kruger/\">Diane Kruger</a> (“Little Disasters,” “Inglorious Bastards,” “Troy”) and “Narcos” creator <a target=\"_blank\" href=\"https://variety.com/t/chris-brancato/\">Chris Brancato</a> – underscoring South’s rising profile on the global circuit.\n\t</p>\n<p>\n\t<strong>Gender and Identity Shape the Conversation</strong></p>\n<p>\n\tRather than just a prizewinner, British series <a target=\"_blank\" href=\"https://variety.com/2025/tv/global/south-series-international-festival-2025-awards-1236523895/\">“What It Feels Like for a Girl”</a> became shorthand in Cádiz for how gender and identity are transforming scripted drama. Paris Lees’ blend of YA, genre and social realism resonated strongly with jurors and audiences, showing how deeply personal storytelling can travel globally when framed through genre lenses. South confirmed that identity-driven narratives are not a niche but a key driver of international TV.</p>\n<p>\n\t<strong>“Invisible” Highlights Production Alliances</strong>\n\t</p>\n<p>\n\tThe Disney+ original “Invisible”, produced by Seville’s <a target=\"_blank\" href=\"https://variety.com/t/aralan-films/\">Áralan Films</a> and Madrid’s <a target=\"_blank\" href=\"https://variety.com/t/morena-films/\">Morena Films</a>, screened at South as part of the Sur sidebar. The project, a top Spanish content performer at the platform since its December release, illustrates how alliances between global streamers and local producers are reshaping Spanish drama economics. Áralan and Morena first teamed on Benito Zambrano’s Goya-winning “Out In The Open” (“Intemperie,”) and their renewed partnership shows how local know-how and global platforms can create sustainable pipelines — a model already spawning new joint projects.</p>\n<p>\n\t<strong>Spain’s Own Emmy-Style Awards on the Horizon</strong></p>\n<p>\n\tThe launch of the Círculo de Profesionales de las Series Españolas (CPSE), backed by Womack Group, sets the stage for the new Premios Anillos de Oro. Marketed as the first awards devoted exclusively to Spanish series and their professionals, they aim to become a national benchmark with global projection. “These awards are born to bring prestige to all Spanish series,” said Joan Álvarez, director of South’s first two editions and former head of Spain’s Film Academy. If successful, the initiative could give Spanish series more of the dedicated recognition long enjoyed by film.</p>\n<p>\n\t<strong>Andalusia’s Bigger Bet on Production</strong></p>\n<p>\n\tAndalusia’s regional government has increased audiovisual funding threefold, from €2 million ($2.1 million) to €6 million ($6.4 million) since spring, strengthening the appeal of the regional film and TV industry for potential partnerships. The return of Andalusia’s driving force, Canal Sur Televisión, to TV drama production – teaming with Womack Studios and Different Entertainment to develop<a target=\"_blank\" href=\"https://variety.com/2025/tv/global/canal-sur-womack-studios-the-rock-gibraltar-series-1236520181/\"> “The Rock,”</a> a 1960s historical thriller set against the closure of the Gibraltar-La Línea border under Franco –  shows how Andalusian stories and industrial ambitions are being leveraged for both local resonance and international appeal.</p>\n<div>\n<figure>\n<p><img srcset=\"https://variety.com/wp-content/uploads/2025/09/INDUSTRY-TALKS_EL-VALOR-CRECIENTE-DE-LAS-SERIES_COMO-HACER-SERIES-SE-VOLVIO-PRESTIGIOSO_SISF205_GERMAN-MESA-2.jpg 6720w, https://variety.com/wp-content/uploads/2025/09/INDUSTRY-TALKS_EL-VALOR-CRECIENTE-DE-LAS-SERIES_COMO-HACER-SERIES-SE-VOLVIO-PRESTIGIOSO_SISF205_GERMAN-MESA-2.jpg?resize=150,100 150w, https://variety.com/wp-content/uploads/2025/09/INDUSTRY-TALKS_EL-VALOR-CRECIENTE-DE-LAS-SERIES_COMO-HACER-SERIES-SE-VOLVIO-PRESTIGIOSO_SISF205_GERMAN-MESA-2.jpg?resize=300,200 300w, https://variety.com/wp-content/uploads/2025/09/INDUSTRY-TALKS_EL-VALOR-CRECIENTE-DE-LAS-SERIES_COMO-HACER-SERIES-SE-VOLVIO-PRESTIGIOSO_SISF205_GERMAN-MESA-2.jpg?resize=1920,1280 1920w, https://variety.com/wp-content/uploads/2025/09/INDUSTRY-TALKS_EL-VALOR-CRECIENTE-DE-LAS-SERIES_COMO-HACER-SERIES-SE-VOLVIO-PRESTIGIOSO_SISF205_GERMAN-MESA-2.jpg?resize=1360,907 1360w, https://variety.com/wp-content/uploads/2025/09/INDUSTRY-TALKS_EL-VALOR-CRECIENTE-DE-LAS-SERIES_COMO-HACER-SERIES-SE-VOLVIO-PRESTIGIOSO_SISF205_GERMAN-MESA-2.jpg?resize=1000,667 1000w, https://variety.com/wp-content/uploads/2025/09/INDUSTRY-TALKS_EL-VALOR-CRECIENTE-DE-LAS-SERIES_COMO-HACER-SERIES-SE-VOLVIO-PRESTIGIOSO_SISF205_GERMAN-MESA-2.jpg?resize=910,607 910w, https://variety.com/wp-content/uploads/2025/09/INDUSTRY-TALKS_EL-VALOR-CRECIENTE-DE-LAS-SERIES_COMO-HACER-SERIES-SE-VOLVIO-PRESTIGIOSO_SISF205_GERMAN-MESA-2.jpg?resize=681,454 681w, https://variety.com/wp-content/uploads/2025/09/INDUSTRY-TALKS_EL-VALOR-CRECIENTE-DE-LAS-SERIES_COMO-HACER-SERIES-SE-VOLVIO-PRESTIGIOSO_SISF205_GERMAN-MESA-2.jpg?resize=450,300 450w, https://variety.com/wp-content/uploads/2025/09/INDUSTRY-TALKS_EL-VALOR-CRECIENTE-DE-LAS-SERIES_COMO-HACER-SERIES-SE-VOLVIO-PRESTIGIOSO_SISF205_GERMAN-MESA-2.jpg?resize=250,167 250w\" src=\"https://variety.com/wp-content/uploads/2025/09/INDUSTRY-TALKS_EL-VALOR-CRECIENTE-DE-LAS-SERIES_COMO-HACER-SERIES-SE-VOLVIO-PRESTIGIOSO_SISF205_GERMAN-MESA-2.jpg?w=1024\" alt=\"\" />\n\t</p>\n<figcaption>\n\t</figcaption>\n</figure>\n</div>\n<p>\n\t<strong>Industry Conversations Map the Future</strong></p>\n<p>\n\tSouth’s professional program zeroed in on the forces reshaping the audiovisual sector. In “The Future of Series,” execs from Mediaset España, 3Cat and Atresmedia pointed to consumer shifts and the hunt for sustainable models. Legal specialists debated the challenges of adapting real events, while writer-director Borja Cobeaga (“Spanish Affair”) unpacked comedy as a balance of satire and tenderness. In “The Growing Value of Series,” creators including Jorge Coira (“Hierro”) and Marina Efrón (“La chica invisible”) highlighted how the rise of the showrunner and the universal power of local storytelling are redefining prestige TV.\n\t</p>\n<p>\n\t<strong>Popular Appeal Anchored in Local Icons</strong></p>\n<p>\n\tSouth celebrated Andalusia’s own with a tribute to actor-director-producer <a target=\"_blank\" href=\"https://variety.com/t/paco-leon/\">Paco León</a>, one of Spain’s most bankable and beloved figures. His award, followed by the screening of a classic episode of “Aída” – a landmark of Spanish free-to-air TV in which he starred —– drew one of the festival’s warmest receptions. The moment revealed how South bridges prestige with mass appeal, strengthening its bond with audiences at home.</p>\n<div>\n<figure>\n<p><img srcset=\"https://variety.com/wp-content/uploads/2025/09/DIANE-KRUGER-PEQUENOS-DESASTRES-PHOTOCALL-Foto-REYNA-15-11.jpg 3872w, https://variety.com/wp-content/uploads/2025/09/DIANE-KRUGER-PEQUENOS-DESASTRES-PHOTOCALL-Foto-REYNA-15-11.jpg?resize=150,100 150w, https://variety.com/wp-content/uploads/2025/09/DIANE-KRUGER-PEQUENOS-DESASTRES-PHOTOCALL-Foto-REYNA-15-11.jpg?resize=300,200 300w, https://variety.com/wp-content/uploads/2025/09/DIANE-KRUGER-PEQUENOS-DESASTRES-PHOTOCALL-Foto-REYNA-15-11.jpg?resize=1920,1280 1920w, https://variety.com/wp-content/uploads/2025/09/DIANE-KRUGER-PEQUENOS-DESASTRES-PHOTOCALL-Foto-REYNA-15-11.jpg?resize=1360,907 1360w, https://variety.com/wp-content/uploads/2025/09/DIANE-KRUGER-PEQUENOS-DESASTRES-PHOTOCALL-Foto-REYNA-15-11.jpg?resize=1000,667 1000w, https://variety.com/wp-content/uploads/2025/09/DIANE-KRUGER-PEQUENOS-DESASTRES-PHOTOCALL-Foto-REYNA-15-11.jpg?resize=910,607 910w, https://variety.com/wp-content/uploads/2025/09/DIANE-KRUGER-PEQUENOS-DESASTRES-PHOTOCALL-Foto-REYNA-15-11.jpg?resize=681,454 681w, https://variety.com/wp-content/uploads/2025/09/DIANE-KRUGER-PEQUENOS-DESASTRES-PHOTOCALL-Foto-REYNA-15-11.jpg?resize=450,300 450w, https://variety.com/wp-content/uploads/2025/09/DIANE-KRUGER-PEQUENOS-DESASTRES-PHOTOCALL-Foto-REYNA-15-11.jpg?resize=250,167 250w\" src=\"https://variety.com/wp-content/uploads/2025/09/DIANE-KRUGER-PEQUENOS-DESASTRES-PHOTOCALL-Foto-REYNA-15-11.jpg?w=1024\" alt=\"\" />\n\t</p>\n<figcaption>\n\t\t\t\t\t<span>Diane Kruger Credit: Reyna</span>\n\t\t\t\t\t\t\t\t\tREYNAFOTOGRAFO\n\t</figcaption>\n</figure>\n</div>\n</div>"
  },
  {
    "title": "Paramount+ to Stream ‘Red Alert’ Series About Hamas Attack on Israel; David Ellison Says Show Highlights ‘Commitment to Storytelling Through Artistic Excellence and Accuracy’",
    "url": "https://variety.com/2025/tv/global/paramount-red-alert-series-hamas-attack-israel-1236525993/",
    "image": "https://variety.com/wp-content/uploads/2025/09/red-alert.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-09-22T11:52:41.000Z",
    "description": "“Red Alert,” a four-part scripted series depicting Hamas’ 2023 attack on Israel, will premiere on Paramount+ Oct. 7 to mark two years since the tragedy. All four episodes of the series will release on...",
    "body": "<div><p>\n\t“Red Alert,” a four-part scripted series depicting Hamas’ 2023 attack on Israel, will premiere on <a target=\"_blank\" href=\"https://variety.com/t/paramount-2/\">Paramount+</a> Oct. 7 to mark two years since the tragedy. </p>\n<p>\n\tAll four episodes of the series will release on Paramount+ globally and on Keshet 12 in Israel. Created, written and directed by Lior Chefetz (“The Stronghold,” “Sky Raiders”), “Red Alert” was produced by Keshet Media Group and Oscar nominee Lawrence Bender, along with Green Productions and the Israel Entertainment Fund.\n\t</p>\n<p>\n\tThe series will portray the real-life events of Oct. 7, 2023, when over 1,200 people were killed and 250 kidnapped near the Gaza border. “Drawing from the true experiences of those who survived, the series weaves their courageous personal stories into a cinematic narrative of the devastating terrorist attack that turned southern Israel into a war zone, testing humanity and forging heroism through chaos,” a press release reads.\n</p>\n<p>\n\t“Red Alert” follows several civilians whose lives intertwine on the fateful day, including “Bat Sheva (Rotem Sela), a mother forced to flee with her two daughters as her son is taken into Gaza; Ohad (Miki Leon), a father who becomes a tragic symbol of sacrifice as he fiercely protects his family; Ayoub (Hisham Suleiman), a grieving father who loses his wife and is forced to hide with his baby behind enemy lines; Nofar (Chen Amsalem), a Border Police officer caught in the massacre and injured while defending others, alongside colleague Liat (Rotem Abuhav); Kobi (Israel Atias), an anti-terrorism officer who runs directly into hell to save his wife; and Tali (Sara Vino), a devoted mother who transforms into an unlikely hero while searching for her injured son, Itamar (Nevo Katan),” the release continues. \n\t</p>\n<p>\n\tParamount CEO and chairman David Ellison said in a statement that the series “highlights Paramount’s continued commitment to storytelling through artistic excellence and accuracy. This critical series cinematically captures the horrific terrorism that stunned the world on Oct. 7 with harrowing precision and inspires with these true-life stories of heroism and heartbreak. We thank Avi, Keshet and Lawrence for trusting us with their vision.”</p>\n<p>\n\tThe announcement of the series comes after <a target=\"_blank\" href=\"https://variety.com/2025/film/news/paramount-condemns-israeli-film-boycott-1236516511/\">Paramount condemned a petition</a> in which nearly 4,000 industry figures — including Emma Stone and Joaquin Phoenix — pledged not to work with Israeli film institutions over the ongoing war in Gaza. </p>\n<p>\n\t“We do not agree with recent efforts to boycott Israeli filmmakers. Silencing individual creative artists based on their nationality does not promote better understanding or advance the cause of peace,” Paramount chief communications officer Melissa Zukerman said in a statement. “The global entertainment industry should be encouraging artists to tell their stories and share their ideas with audiences throughout the world. We need more engagement and communication — not less.”</p>\n<p>\n\t“Red Alert” was co-created with Ruth Efroni and co-written by Kineret Peled and Idan Hubel. Executive producers include Green Productions’ Maya Fischer, Shani Ettinger Sror, Roi Kurland, and Gal Greenspan; Bender Brown Productions’ Lawrence Bender and Kevin Kelly Brown; Jordana Reuben Yechiel; Mika Rode; Keshet Media Group’s Avi Nir; and Israel Entertainment Fund’s Nati Dinnar and Russel Robinson. Other funding partners include the Charles and Lynn Schusterman Family Foundation and The Film & Media Collaborative: the Gesher Multicultural Film Fund, the Avi Chai Foundation and the Maimonides Fund.</p>\n<p>\n\tKeshet International is the international distributor for “Red Alert.” Rick Rosen at WME brokered the deal.<br /></p>\n</div>"
  },
  {
    "title": "London Film Festival Unveils Industry Forum With ‘Conclave,’ ‘Sentimental Value’ Producers Among Speakers",
    "url": "https://variety.com/2025/film/global/london-film-festival-unveils-industry-forum-2025-1236525961/",
    "image": "https://variety.com/wp-content/uploads/2024/11/Conclave_74d8e8.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-09-22T11:02:28.000Z",
    "description": "The BFI London Film Festival has announced the speakers and events taking part in the industry forum at its upcoming 69th edition. Heading the lineup is a spotlight conversation with Tessa Ross, the...",
    "body": "<div><p>\n\tThe BFI <a target=\"_blank\" href=\"https://variety.com/t/london-film-festival/\">London Film Festival</a> has announced the speakers and events taking part in the industry forum at its upcoming 69th edition. </p>\n<p>\n\tHeading the lineup is a spotlight conversation with <a target=\"_blank\" href=\"https://variety.com/t/tessa-ross/\">Tessa Ross</a>, the pioneering U.K. producer who ran Film4 for over a decade and recently, as co-head of House Productions, was behind box office hit and awards favorite “Conclave.”</p>\n<p>\n\tElsewhere in the program, <em>Variety</em> is supporting a panel discussion examining the “intricate art of co-productions” set to involve producers Maria Ekerhovd (“<a target=\"_blank\" href=\"https://variety.com/t/sentimental-value/\">Sentimental Value</a>“), Emily Morgan (“Dreamers”), Klaudia Śmieja-Rostworowska (“Orphan”) and Lorna Tee (“Diamonds in the Sand”). Meanwhile, distribution strategies for documentary films will be considered at a panel with execs from Autlook Filmsales, Modern Films, Indox and Perpetua Cine, while there’ll be a spotlight on the “art and craft of visual effects” with creatives and executives from Framestore, Milk, beloFX and One of Us. \n\t</p>\n<p>\n\tOther events will include a deep dive into Sky’s upcoming limited series “The Death of Bunny Munro,” based on Nick Cave’s novel, an “Anatomy of a Debut” session with “Ish” writer-director Imran Perretta producer Dhiraj Mahey, and co-writer Enda Walsh, the inaugural LFF Expanded Industry Day platforming Immersive, XR, and video games and a talk with emerging local screenwriters. \n</p>\n<p>\n\tKeeping things even closer to home, a team of film event directors and senior programmers  — including Thomas Rosso of the Cannes Critics’ Week, Jacqueline Lyanga from the Berlinale, Pia Lundberg of Göteborg Film Festival and the London Film Festival’s own Kristy Matheson — will contemplate the “evolving role of festivals in supporting films and talent.”\n\t</p>\n<p>\n\t“Film festivals are all about connection and I’m thrilled to see this exciting line-up of U.K. and international guests joining us to share their time, knowledge and experience,” said Matheson. “As ever, our popular networking events and curated meetings will continue to foster new creative and business collaborations, and I look forward to seeing the results of these in the years to come.”</p>\n<p>\n\tThe BFI London Film Festival runs Oct 8-Oct 19, and will open with “Wake Up Dead Man: A Knives Out Mystery.”</p>\n</div>"
  },
  {
    "title": "Nick Cassavetes to Direct the U.S. Remake of Italian Smash Hit Movie ‘The Boy With the Pink Pants’ (EXCLUSIVE)",
    "url": "https://variety.com/2025/film/global/nick-cassavetes-us-remake-italian-hit-boy-with-pink-pants-1236525904/",
    "image": "https://variety.com/wp-content/uploads/2024/12/CHI03229.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-09-22T09:18:50.000Z",
    "description": "Nick Cassavetes (“John Q, “The Notebook”) is set to direct the U.S. remake of “The Boy With the Pink Pants,” which topped last year’s Italian box office and broke many hearts along the way. The film tells the...",
    "body": "<div><p>\n\t<br />Nick Cassavetes (“John Q, “The Notebook”) is set to direct the U.S. remake of “The Boy With the Pink Pants,” which topped last year’s Italian box office and broke many hearts along the way. The film tells the harrowing true story of Andrea Spezzacatena, a 15 year-old boy who committed suicide in 2012 after enduring bullying at school and online.</p>\n<p>\n\tThe original movie, directed by Margherita Ferri, became a cultural phenomenon in Italy where it grossed more than $11.8 million from nearly two million moviegoers, beating Hollywood blockbusters such as “Wicked” and strong Italian auteurs such as Paolo Sorrentino with “Parthenope. The film has also inspired a musical stage version which is set to debut next February and is now poised to continue its journey in the U.S.\n\t</p>\n<p>\n\tTarak Ben Ammar, who produced and distributed the original movie with his company <a target=\"_blank\" href=\"https://variety.com/t/eagle-pictures/\">Eagle Pictures</a>, will be producing the American remake with Mark Burg. \n</p>\n<p>\n\t“The Boy with the Pink Pants” seems to be a perfect vehicle for Cassavetes who has demonstrated his talent for creating emotionally charged movies such as “The Notebook,” “John Q” and “Alpha Dog” which marked generations and have become cult. </p>\n<p>\n\t“This movie has all the makings of a great film,” said Cassavetes. “Family, adolescence, first love, but also the terrible reminder that every child, no matter how put together they seem to be on the outside, is vulnerable, and needs to be looked after closely,” he continued, adding that the film also “features a strong and relatable female role.” “It’s a gut punch. It’s a powerhouse,” Cassavetes said. \n\t</p>\n<p>\n\t“The Boy with the Pink Pants” follows a bright adolescent, Andrea, who enrolls in a new school and struggles to cope with his parents’ divorce while trying to make friends. Longing to fit in, the young man attempts by every mean to impress a popular classmate with whom he forms an ambiguous bond. A laundry incident that causes his red pants to become pink becomes the catalyst for the school bullying to intensify, pushing Andrea over the edge. </p>\n<p>\n\t“Unfortunately, Andrea Spezzacatena’s story is not just an Italian story,” Ben Ammar said. “The tragic phenomenon of minors committing suicide due to bullying and cyberbullying has become a global scourge that cinema has a duty to address,” he continued. </p>\n<p>\n\tBen Ammar – who has now created a dedicated division at Eagle Pictures to produce films promoting social changes and aimed at teenagers — pointed out “The Boy With the Pink Pants” struck a chord in Italy, where “it made a difference for hundreds of thousands of young people.” He hopes that “with the American remake, we have the chance to achieve the same effect on millions of people worldwide.”</p>\n<p>\n\tBurg, meanwhile, said was “left speechless” when he saw the Italian film. “The way it handled such a difficult subject with both lightness and depth, making it accessible to such a wide audience, truly moved me—and that’s the main reason so many people embraced it,” Burg said. “Our intention is to preserve the same delicate yet impactful tone, and the first director I thought of for this project was Nick Cassavetes, with whom I made ‘John Q,’ another story where emotions illuminate a very current social drama,” he continued. </p>\n<p>\n\tGina Cassavetes, who is co-producing the film, said, “I’m so proud to be a part of this project. It’s an extremely important story. One that gives us a peek into the new world our youth are growing up in and how as a a family we navigate loving our children the best way we can, when the world can be so cruel”</p>\n<p>\n\tThe screenplay for the remake will be written by Roberto Proia, who was nominated at the Italian Oscars for best adapted screenplay for the original film, and Michael Gallagher.</p>\n<p>\n\tThe American remake will transpose the story to the United States, most likely in a small town; and will flesh out the character of Andrea’s mother, Teresa Manes, whose unique relationship with her son is one of the film’s emotional anchors. Since his tragic death, Manes has become an advocate for anti-bullying initiative and also wrote a book about her son’s experience.</p>\n</div>"
  },
  {
    "title": "AI Film Studio Launch Marks Animeta’s Expansion Into Scalable Content Production (EXCLUSIVE)",
    "url": "https://variety.com/2025/tv/news/ai-film-studio-animeta-1236525875/",
    "image": "https://variety.com/wp-content/uploads/2025/09/Animeta.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-09-22T09:31:00.000Z",
    "description": "Animeta is betting big on artificial intelligence with the launch of its new AI Film Studio, marking a significant expansion for the Singapore-based creator tech company into AI-powered content...",
    "body": "<div><p>\n\t<a target=\"_blank\" href=\"https://variety.com/t/animeta/\">Animeta</a> is betting big on artificial intelligence with the launch of its new <a target=\"_blank\" href=\"https://variety.com/t/ai/\">AI</a> Film Studio, marking a significant expansion for the Singapore-based creator tech company into AI-powered content production.</p>\n<p>\n\tThe new Mumbai-based studio represents a strategic pivot for Animeta, which has built its reputation creating influencer marketing campaigns for blue-chip clients. The company’s existing roster includes Amazon, Starbucks, Warner Music, L’Oréal Group, Tata Group, McDonald’s and Uber, supported by a creator network exceeding 400,000 members through its Animeta Brandstar platform.\n\t</p>\n<p>\n\tThe AI Film Studio initiative is being developed in partnership with <a target=\"_blank\" href=\"https://variety.com/t/google-cloud/\">Google Cloud</a>‘s startup program, specifically utilizing Vertex AI’s Veo3 Video generation model. Animeta brings existing technical infrastructure in computer vision, video encoding, natural language processing and large language models to the venture.\n</p>\n<p>\n\tCompany founder <a target=\"_blank\" href=\"https://variety.com/t/anish-mehta/\">Anish Mehta</a> said: “For two decades, I helped reimagine storytelling through animation. Now, our AI Film Studio is here to push those boundaries further than ever before. We’ve built a hybrid model where human creativity and AI technology work together seamlessly, empowering creators to tell their stories faster, smarter, and infinitely scalable with copyright indemnity.”</p>\n<p>\n\tThe studio aims to enable brands to create promotional content that is high-quality and on-brand while being produced and scaled rapidly to meet the demands of a fast-paced digital landscape.</p>\n<p>\n\tMehta built Singapore and India-based animation studio Cosmos-Maya into one of Asia’s premier animation outfits during his decade as CEO. Under Mehta’s stewardship, the company grew from 30 employees to over 1,200 and created India’s breakout animated hit “Motu Patlu.” In 2021, NewQuest Capital Partners acquired majority ownership of the company.</p>\n</div>"
  },
  {
    "title": "‘Day of the Jackal’ Finds New Lead Writer in ‘Lockerbie: A Search for Truth’ Scribe David Harrower as Creator Ronan Bennett Steps Back (EXCLUSIVE)",
    "url": "https://variety.com/2025/tv/global/day-of-the-jackal-season-2-lead-writer-david-harrower-1236525906/",
    "image": "https://variety.com/wp-content/uploads/2024/10/The-Day-of-the-Jackal.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-09-22T10:00:00.000Z",
    "description": "“Day of the Jackal,” the Eddie Redmayne-fronted TV spy series that became a ratings smash for both Sky and Peacock last year, has a new lead writer for its second series. Ronan Bennett, who created the...",
    "body": "<div><p>\n\t“Day of the Jackal,” the Eddie Redmayne-fronted TV spy series that became a ratings smash for both Sky and Peacock last year, has a new lead writer for its second series. </p>\n<p>\n\t<a target=\"_blank\" href=\"https://variety.com/t/ronan-bennett/\">Ronan Bennett</a>, who created the show, produced by <a target=\"_blank\" href=\"https://variety.com/t/carnival-films/\">Carnival Films</a> and a modern day interpretation of Frederick Forsyth’s novel and its hit 1973 film adaptation about a globe-trotting assassin and the intelligence officer on his tail, is stepping back from his writing duties due to other commitments but will continue to exec produce.\n\t</p>\n<p>\n\tFor Bennett’s replacement, Carnival has turned to David Harrower, who created its critically acclaimed “Lockerbie: A Search for Truth” drama starring Colin Firth and chronicling the decades-long quest to find the culprits of 1988’s Pam Am Flight 103 bombing. “Lockerbie” was also aired by both Sky and Peacock.\n</p>\n<p>\n\tSpeaking to <em>Variety</em> recently, Carnival CEO Gareth Neame acknowledged that while the first season of the “Day of the Jackal” featured a completely different plot to the original, it had the “same dynamic between the hunter and the hunted” and included numerous references to the film. For season two, due to start production in the coming months, he said there were still “lots of elements from [Forsyth’s] novel that we didn’t utilize in season one” that would appear.</p>\n<p>\n\t“Hopefully it’s going to be another very lavish, slickly directed, well acted, high-octane twist and turn thriller,” he said. </p>\n<p>\n\tAlongside “Day of the Jackal,” Bennett — who first made a name for himself on TV as the creator of “Top Boy” — has recently been behind Paramount+ series “<a target=\"_blank\" href=\"https://variety.com/t/mobland/\">MobLand</a>,” starring Tom Hardy and Pierce Brosnan that was renewed for a second season in June this year. In August, it was announced that Bennett was returning to U.K. network Channel 4 for the first time since “Top Boy” with <a target=\"_blank\" href=\"https://variety.com/2025/tv/global/ronan-bennett-series-army-of-shadows-channel-4-1236492725/\">“Army of Shadows,”</a> a six-part drama series inspired by Jean Pierre Melville’s 1969 film and Joseph Kessel’s book of the same name about the French Resistance during WWII, this time set in a near-future authoritarian Britain. \n\t</p>\n<p>\n\tStarring Redmayne as the eponymous hitman and Lashana Lynch as an MI6 agent, “<a target=\"_blank\" href=\"https://variety.com/t/the-day-of-the-jackal/\">The Day of the Jackal</a>” became Sky’s biggest Original series ever with 3 million viewers in its first week in November 2024, ahead of “House of the Dragon” and “Chernobyl.” In the U.S., it became Peacock’s most-watched new original drama series ever after 75 days of viewership, according to NBCUniversal in February of this year.</p>\n</div>"
  },
  {
    "title": "Costa Rican Kim Torres on Her Feature Debut ‘If We Don’t Burn How Do We Light Up the Night,’ Which Gets a Trailer: ‘Violence Is Something That’s Very Present in Latin America’  (EXCLUSIVE)",
    "url": "https://variety.com/2025/film/global/costa-rica-kim-torres-new-directors-san-sebastian-film-fest-1236525509/",
    "image": "https://variety.com/wp-content/uploads/2025/09/SNA_Still-5.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-09-22T10:31:37.000Z",
    "description": "While not autobiographical, Costa Rican Kim Torres’s feature debut “If We Don’t Burn How Do We Light Up The Night” (“Si no ardemos, cómo iluminar la noche”) is rooted in her childhood experiences. It draws...",
    "body": "<div><p>\n\tWhile not autobiographical, Costa Rican Kim Torres’s feature debut “If We Don’t Burn How Do We Light Up The Night” (“Si no ardemos, cómo iluminar la noche”) is rooted in her childhood experiences. It draws inspiration from her early years in rural <a target=\"_blank\" href=\"https://variety.com/t/costa-rica/\">Costa Rica</a> where she began to perceive certain dynamics in the village and grew more aware of the dangers lurking in this idyllic setting.</p>\n<p>\n\t“My film has to do with that transition into adulthood and understanding the violence we experience in Latin America and worldwide. It’s something that’s very present in Latin America, more so than in other places,” she tells <em>Variety.</em>\n\t</p>\n<p>\n\tHer coming-of-age drama, which world premieres at the <a target=\"_blank\" href=\"https://variety.com/t/san-sebastian-film-festival/\">San Sebastian Film Festival</a>’s New Directors sidebar, follows 13-year-old Laura who feels stifled in her new family. As she begins to adjust to her new environment, surrounded by verdant forests and palm plantations, she finds out that the village hides a shadowy secret that preys on the women in it.\n</p>\n<p>\n\tIts trailer, debuting exclusively in <em>Variety,</em> opens to Laura’s arrival at the village with her mother who has taken Laura to live with her and her boyfriend plus his young daughters.</p>\n<figure><p>\n<iframe width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/ljeQP37i_I0?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\"></iframe>\n</p></figure>\n<p>\n\tAccording to Torres, the title draws inspiration from a line in the poem “Kerem Gibi” by the Turkish poet Nâzım Hikmet. “In the film, we reimagine its original meaning within the poem and see the burning as a light that shines through the pain. An eternal love that never fades and endures, honoring all those who are no longer with us,” she explains.\n\t</p>\n<p>\n\tHer debut feature is in a way an extension of her previous short films, which also explore childhood and adolescence. “In them, there’s always a subtle shift in reality—it’s never completely grounded in the real world. There’s always something that feels slightly off, like in this case, it’s the mysterious, almost legendary aspect,” she notes.</p>\n<p>\n\tHer short “Night Light” (2022) became the first Costa Rican film nominated for a Palme d’Or at <a target=\"_blank\" href=\"https://variety.com/t/cannes-2/\">Cannes</a>. Her works have been presented at NYFF, <a target=\"_blank\" href=\"https://variety.com/t/locarno/\">Locarno</a>, San Sebastián, MoMA, Lincoln Center and the Eye Film Museum.</p>\n<p>\n\t“While making this film, I was drawn to the lightness of childhood — the joy of play, the tenderness of love, the quiet bonds of friendship. At the same time, I wanted to capture the weight carried by a girl standing at the threshold between childhood and adulthood, learning to navigate a world where violence lingers like a shadow. It is a specter that touches not only her own body, but also the bodies of the women she loves, those who have shaped her heart and spirit,” Torres states.</p>\n<p>\n\tThe three young girls are non-pros which Torres found with her casting director Kim Picado, who also served as an acting coach. The casting process focused not so much on the volume of applicants but on the depth of the selection, she recalls.</p>\n<p>\n\t“From the very beginning, we did a pre-selection of candidates, but once we had a group, the real work began — much more in-depth casting and rehearsal. And it was about creating connections between the actors, finding a common language that I really think is what made the whole thing flow so smoothly and created that magic while working with them. We set up this beautiful, calm, and safe atmosphere. And the girls, especially the three of them, really brought something special to the project,” says Torres.</p>\n<p>\n\tThe three young non-pros are Lara Yuja Mora, who plays Laura, Keylin Delgado Arguedas (Daniela) and Valentina Chaves Jimenez (Gaby).</p>\n<p>\n\tThe rest of the cast are Michelle Jones, Teresa Sánchez, Juan Luis Araya, Gabriel Guzmán Rodríguez and Luis Carlos Canhoto Baptista da Silva.</p>\n<p>\n\tThe screenplay is co-penned by Torres and Luisa Mora Fernández.</p>\n<p>\n\t“If We Don’t Burn…” is produced by Costa Rica’s Alejandra Vargas Carballo of Noche Negra Prods. alongside co-producers Mariana Monroy of Tropical Films, Mexico and Camille Ferrero of Les Films du Clan, France.\n\t</p>\n<p>\n\tThe 73<sup>rd</sup> San Sebastian Film Festival kicked off on Sept. 19 and wraps on Sept. 27.</p>\n<div>\n<figure>\n<p><img srcset=\"https://variety.com/wp-content/uploads/2025/09/SNA_Still-11.jpg 3339w, https://variety.com/wp-content/uploads/2025/09/SNA_Still-11.jpg?resize=150,97 150w, https://variety.com/wp-content/uploads/2025/09/SNA_Still-11.jpg?resize=300,194 300w\" src=\"https://variety.com/wp-content/uploads/2025/09/SNA_Still-11.jpg?w=1024\" alt=\"\" />\n\t</p>\n<figcaption>\n\t\t\t\t\t<span>If We Don’t Burn How Do We Light Up The Night, Courtesy of Noche Negra Prods. </span>\n\t</figcaption>\n</figure>\n</div>\n</div>"
  },
  {
    "title": "‘Emilia Pérez’ Star Adriana Paz and ‘Society of the Snow’ Lead Agustín Pardella to Star in ‘My Life With Him (Che)’ (EXCLUSIVE)",
    "url": "https://variety.com/2025/film/global/emilia-perez-adriana-paz-agustin-pardella-che-guevara-1236525744/",
    "image": "https://variety.com/wp-content/uploads/2025/09/Agustin-Pardella-and-Adriana-Paz-1.jpg?w=999&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-09-22T10:17:22.000Z",
    "description": "“Emilia Pérez” star Adriana Paz and “Society of the Snow” lead Agustín Pardella will star in the untold story of Hilda Gadea, the first wife of revolutionary Ernesto “Che” Guevara.  \tBased on Gadea’s memoirs,...",
    "body": "<div><p>\n\t“Emilia Pérez” star Adriana Paz and “<a target=\"_blank\" href=\"https://variety.com/t/society-of-the-snow/\">Society of the Snow</a>” lead Agustín Pardella will star in the untold story of Hilda Gadea, the first wife of revolutionary Ernesto “<a target=\"_blank\" href=\"https://variety.com/t/che/\">Che</a>” Guevara.</p>\n<p>\n\tBased on Gadea’s memoirs, “My Life With Him (Che)” (“Mi vida con él (Che))” turns on the woman whose influence was pivotal in shaping the political vision of one of the most significant icons of the 20th century but whose voice was largely lost in the telling of his.\n\t</p>\n<p>\n\tProduction companies Salado (Uruguay) and Arboleda (Argentina) have joined forces to adapt her memoir for the big screen. Silvina Estévez, best known for her documentaries “Años cortos, dias eternos,” “Me gusta cuando hablas” and “School-of-Life,” is attached to direct the narrative feature.  \n</p>\n<p>\n\tSet in the 1950s, the film will retrace the momentous meeting between a young Ernesto – long before he became “Che” – and Hilda, a Peruvian economist, intellectual and activist, whose sharp political vision and energy left a lasting mark on his path. At its core, the story delves into their romantic bond, Hilda’s journey through motherhood and the agonizing choice that ultimately shaped her life: remain by her daughter’s side or follow the call of the revolution.</p>\n<p>\n\t“Hilda Gadea is not just Che’s wife. She is a woman with strong ideas, a professional, an activist and mother. As a director, I am deeply moved to have Adriana Paz, an actress of immense sensitivity and strength, embody Hilda,” said Estévez.</p>\n<p>\n\tSaid Paz: “To interpret Hilda Gadea is both a privilege and a tremendous responsibility. Her story reminds us that behind every historical figure are voices that deserve to be heard –especially the voices of women who influenced and transformed their time. Being part of this film is a way to bring that memory to life and to question how history is told. Moreover, being part of a Latin American production that unites us through Spanish and our shared roots is profoundly meaningful to me.”\n\t</p>\n<p>\n\tArgentine actor Agustín Pardella, known for his role in J.A. Bayona’s acclaimed “Society of the Snow,” will play Ernesto Guevara.</p>\n<p>\n\t“I celebrate that this is a project told by women. I firmly believe that there are ways of seeing the world that only exist if we are given the opportunity to put them on screen. Just as Hilda understood that economics was a tool of power, so too is film.”</p>\n<p>\n\tNow in development, the project is looking for international production partners to help bring to life a story that weaves the personal and the political into a powerful, globally resonant narrative.</p>\n</div>"
  },
  {
    "title": "Basque Cinema Roars With Language, History and Pop as San Sebastián Premieres 38 Local Projects",
    "url": "https://variety.com/2025/film/global/basque-films-san-sebastian-karmele-maspalomas-sundays-1236525874/",
    "image": "https://variety.com/wp-content/uploads/2025/09/KARMELE_004.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-09-22T09:58:51.000Z",
    "description": "San Sebastián is where Basque cinema’s strategy plays out at scale. This year’s bumper lineup – 13 Basque world premieres and 38 total projects across features, shorts, docs and retrospectives – showcases...",
    "body": "<div><p>\n\tSan Sebastián is where Basque cinema’s strategy plays out at scale. This year’s bumper lineup – 13 Basque world premieres and 38 total projects across features, shorts, docs and retrospectives – showcases linguistic resilience and industrial range: Jose Mari Goenaga and <a target=\"_blank\" href=\"https://variety.com/t/aitor-arregi/\">Aitor Arregi</a>’s intimate Official Selection comeback “<a target=\"_blank\" href=\"https://variety.com/t/maspalomas/\">Maspalomas</a>;” <a target=\"_blank\" href=\"https://variety.com/t/asier-altuna/\">Asier Altuna</a>’s historical epic “<a target=\"_blank\" href=\"https://variety.com/t/karmele/\">Karmele</a>;” Koldo Almandoz’s noir-tinged “Mouths of Sky”; and Irati Gorostidi’s austere “Aro Berria.” \n\t</p>\n<p>\n\tDocumentaries include cultural portraits such as “Itoiz Summer Sessions,” “Ez gera alferrik pasako” and “Hombre Bala.”\n</p>\n<p>\n\tIn “Karmele,” one of the Basque films at this year’s festival, the Basque language itself comes under threat. For centuries, rulers sought to stamp out cultural difference, Franco banning Basque from being spoken, sung, or taught. An ancient tongue — believed to be Europe’s oldest still in use — Basque endures where Etruscan and Iberian have vanished.</p>\n<p>\n\tLike Gaelic, Irish, and Breton, Basque has undergone revival, and filmmakers are at the forefront of it. Once seen as a barrier to distribution, subtitles are now far more standard in global viewing, especially for younger audiences raised on streaming. That shift has altered market dynamics. Ireland’s “The Quiet Girl,” shot largely in Irish, became its nation’s first international feature Oscar nominee. Basque producers hope for a similar breakthrough, positioning their language not as a handicap but as a marker of distinction.</p>\n<p>\n\tTaken together, this year’s slate forms a wide canvas from exile and return, generational shifts, and political legacies to music, identity and memory and with it a broader industry play: Basque producers betting on language, story and place to stand out in a too crowded market.\n\t</p>\n<p>\n\tWe profile a number of projects below:</p>\n<p>\n\t<br /><strong>“<a target=\"_blank\" href=\"https://variety.com/t/sundays/\">Sundays</a>”</strong> <strong>(“Los Domingos”) dir. Alauda Ruiz de Azua </strong>(Movistar Plus+, Buenapinta Media, Colosé Producciones, Sayaka Producciones, Encanta Films)</p>\n<p>\n\tAinara, 17, startles her liberal family by announcing she is contemplating joining an enclosed religious order. From the creator of Series Mania’s 2025 Grand Prix winner “Querer,” and offering many of the same pleasures: the mix of suspense drama and psychological and social observance grounded in a knowingly depicted Basque reality; the contrast of two mindsets and a top notch cast. One of San Sebastián’s most anticipated main competition titles, now with a trailer, backed by Movistar Plus+ (“Sirât”), sold by France’s Le Pacte.</p>\n<div>\n<figure>\n<p><img srcset=\"https://variety.com/wp-content/uploads/2025/09/Sundays.jpg 800w, https://variety.com/wp-content/uploads/2025/09/Sundays.jpg?resize=150,100 150w, https://variety.com/wp-content/uploads/2025/09/Sundays.jpg?resize=300,200 300w, https://variety.com/wp-content/uploads/2025/09/Sundays.jpg?resize=681,454 681w, https://variety.com/wp-content/uploads/2025/09/Sundays.jpg?resize=450,300 450w, https://variety.com/wp-content/uploads/2025/09/Sundays.jpg?resize=250,167 250w\" src=\"https://variety.com/wp-content/uploads/2025/09/Sundays.jpg\" alt=\"\" />\n\t</p>\n<figcaption>\n\t\t\t\t\t<span>“Sundays,” courtesy of San Sebastián Film Festival</span>\n\t</figcaption>\n</figure>\n</div>\n<p>\n\t<strong>“Los Tigres” dir. <a target=\"_blank\" href=\"https://variety.com/t/alberto-rodriguez-2/\">Alberto Rodríguez</a></strong>(Mazagón Films, Kowalski Films, Feelgood Media, Movistar Plus+, Le Pacte)<br />The “Marshland” and “Prison 77” helmer’s thriller follows siblings Antonio and Estrella, children of a diver, whose lives at sea collapse after Antonio suffers an accident. Discovering hidden cocaine on an oil tanker, Antonio sees escape. With Antonio de la Torre and Bárbara Lennie toplining, the Spain–France co-production mixes survival drama with social point. </p>\n<p>\n\t<strong>“Maspalomas” dirs. <a target=\"_blank\" href=\"https://variety.com/t/jose-mari-goenaga-2/\">José Mari Goenaga</a>, Aitor Arregi</strong> (Irusoin, Moriarti, Maspalomas Pelikula)</p>\n<p>\n\tGoenaga and Arregi (“The Endless Trench”) return with a 100% Basque production about Vicente, 76, who, after an accident, leaves Gran Canaria’s gay scene for a San Sebastián retirement home. There he hides his sexuality once more. Anchored by José Ramón Soroiz (“Homeland”,) the film explores aging, repression and reconciliation. Competing for multiple awards, including the Sebastiane, “Maspalomas” combines intimate storytelling with broader reflections on LGBTQ+ visibility in late life.</p>\n<p>\n\t<strong>She Walks in Darkness (“Un Fantasma en la Batalla”) dir. Agustín Díaz Yanes</strong>(<em>Basoilarraren Filmak)</em><br />Starring Susana Abaitua, Andrés Gertrúdix and Iraia Elias,, Díaz Yanes’ feature dramatizes Spain’s largest covert Civil Guard operation against ETA in the 1990s–2000s. Following Amaia, a young officer who spends a decade undercover, the latest from the Goya winning veteran – whose debut “Nobody Will Speak Of Us When We’re Dead” won a slew of awards – fuses an edge-of-the-seat survival thriller, spotlighting the toll of infiltration. \n\t</p>\n<p>\n\t<strong>“Karmele” dir. Asier Altuna</strong> (Txintxua Films)</p>\n<p>\n\tAltuna’s Basque-language epic traces Karmele’s life from 1937 exile to return from Venezuela, weaving love, music and resistance. “Karmele” is positioned as one of the year’s most ambitious Basque productions, revisiting war, displacement and cultural resilience through a personal love story rooted in history and identity. We linger on folded arms, stay with a hymn to the end and span many decades, this is a film that understands the power of time.</p>\n<p>\n\t<strong>Mouths of Sky (“Zeru Ahoak”) dir. Koldo Almandoz</strong>(Zeru Ahoak, Garabi Films)<br />Almandoz (“Oreina”) returns with a noir-inflected thriller set in Bilbao. Former policewoman Nerea, dismissed from the force, is drawn back when ritualistic murders emerge, confronting ghosts of her past and city’s underworld. With “Querer” lead Nagore Aranburu and Josean Bengoetxea starring, “Mouths of Sky” plays in Special Screenings. Rooted in Basque atmosphere yet shaped by genre, the film offers both detective intrigue and reflections on personal trauma.</p>\n<p>\n\t“<strong>Aro Berria” dir. Irati Gorostidi Agirretxe</strong> (Apellaniz y de Sosa)</p>\n<p>\n\tDeveloped at Ikusmira Berriak in 2022, Gorostidi’s feature debut is set in San Sebastián, 1978. After a failed strike, disillusioned workers leave the factory for a mountain commune, seeking radical change in intimate spheres. Mixing political memory with collective portraiture, the Basque-language film explores post-Franco youthful idealism. Competing for the New Directors, Youth and Irizar Basque Film Awards, “Aro Berria” signals a new voice.</p>\n<p>\n\t<strong>“Lurdes Iriondo, ez gera alferrik pasako” dir. Inge Mendioroz Ibañez</strong> (Maluta films)</p>\n<p>\n\tMendioroz Ibañez’s portrait revisits the life and legacy of singer Lurdes Iriondo. We see she was more than a performer, Iriondo was pivotal in transmitting Basque culture to younger generations, understanding children as the key to the language’s survival. We learn she wrote for both adults and children, she did theatre, she even drew, clearly aware of the importance to portray her culture by any means at hand throughout her life. A compelling tale of cultural resilience and identity.</p>\n<p>\n\t<strong>“Hombre Bala” dir. Anuska Ariztimuño</strong> (Urrelili AIE, Gona Cinema S.L., Baleuko S.L.)\n\t</p>\n<p>\n\tAriztimuño’s documentary portraits veteran musician Mikel Erentxun, reflecting on four decades in Spain’s pop-rock scene and a 25-year relationship with his partner. The film captures the artist’s confrontation with age, mortality and time’s erosion. A public history with private reckoning. </p>\n<p>\n\t<strong>“Arg(h)itzen: Speaking Clearly of Torture, Enlightening Torture” (“Arg(h)itzen: Torturaz argi hitz egiten, tortura argitzen”) dir. Mikelatxo Urbi Taldea </strong>(Nafarroako Torturatuen Sarea)</p>\n<p>\n\tA collective work, “Arg(h)itzen” assembles testimony from 30 victims tortured in Navarre’s Sakana region between 1966 and 2011. We bear witness to the survivors’ accounts and expert analysis, it maps personal trauma against state structures of impunity. The project’s collaborative roots — neighbors joining to recover suppressed truths — lend urgency to its drive for recognition and eradication of torture. </p>\n<p>\n\t<strong>“Daniela, Forever” dir. Nacho Vigalondo </strong> (Sayaka Producciones, Señor y Señora, Mediacrest, Wrong Men)</p>\n<p>\n\tPlaying last year Toronto’s Platform – one of international’s most prestigious competitions – the latest from Basque sci-fi auteur, and the Basque Country’s most international of filmmakers. The English-language movie boasts one of Henry Golding’s finest performances, some critics said, though the final results split reviewers. </p>\n<p>\n\t<strong>“Eloy de la Iglesia, Film Addict” (“Eloy de la Iglesia, Adicto al Cine”) dir. Gaizka Urrest </strong>(Altube Filmiak, Allmura Films)</p>\n<p>\n\tDouble Goya winner Urresti’s (“Labordeta, un hombre sin más”) doc revisits Eloy de la Iglesia, enfant terrible of Spain’s Transition, fearless chronicler of marginal lives. Mixing testimony from collaborators José Sacristán, Fernando Guillén Cuervo and others, it maps a career marked by audacity, drug addiction, ostracism and revival. Competing for both the Irizar Basque Film and Sebastiane Awards, the film reclaims a director who made cinema itself his addiction.</p>\n<p>\n\t<strong>“Pheasant Island”</strong> <strong>(“Faisaien Irla”) dir. Asier Urbieta</strong> (Arcadia Motion Pictures SL, La Tentación Producciones, La Fidèle Production, Galatea Films)<br />Set on Europe’s smallest co-sovereign territory, the Bidasoa River’s Pheasant Island, Urbieta’s fiction debut entwines local life and cross-border politics with a mystery thriller. After a couple witness two men swimming across the river, a corpse appears during the island’s ritual transfer of sovereignty between France and Spain. With Jone Laspiur, also seen in festival with “Karmele”, and Itziar Ituño starring, it balances geopolitical backdrop with intimate drama. Latido Films handles sales.\n\t</p>\n<p>\n\t<strong>“Gregorio Ordóñez, el asesinato que despertó la rebelión contra ETA” dirs. Arantxa Aldaz, Javier Roldán, David Taberna</strong>(El Diario Vasco) </p>\n<p>\n\tMarking 30 years since the killing of San Sebastián deputy mayor and People’s Party councillor Gregorio Ordóñez, the doc reconstructs the events of January 1995 and the subsequent mobilization against ETA. Combining archive and testimony, the film places Ordóñez’s assassination in the broader Basque context, tracing how his death galvanized resistance to ETA. </p>\n<p>\n\t<strong>“Itoiz Summer Sessions” (“Itoiz Udako Sesioak”) dirs. Larraitz Zuazo, Zuri Goikoetxea, Ainhoa Andraka</strong></p>\n<p>\n\t(Doxa Producciones S.L.)<br />Prompted by the discovery of unpublished tapes, Juan Carlos Pérez, frontman of Basque cult band Itoiz, revisits the group’s arc from 1970s prog-rock to their controversial pivot toward pop. Mixing rare material with interviews, the documentary blends nostalgia with a meditation on artistic identity. For Pérez, retracing Itoiz’s trajectory becomes a reckoning with the past and with decisions that split the band at the height of their fame.</p>\n<p>\n\t<strong>“Jone, Sometimes” (“Jone, Batzuetan”) dir. Sara Fantova</strong></p>\n<p>\n\t<em>(Escándalo Films, ESCAC Studio, Amania Films, ECPV)</em></p>\n<p>\n\tDuring Bilbao’s Semana Grande, Jone lives her first love with Olga, as her father’s Parkinson’s illness worsens. A Basque-language coming of age and family tale marking the first feature from Bilbao-born Sara Fantova, an Escac alum cherry-picked to direct three episodes of “This Is Not Sweden.” Produced by the Sergi Casamitjana-led Escac Estudios (“Salve, María”) and Amania Films, headed by director David Pérez Sañudo (“The Last Romantics”). A buzzy title thanks to wins at Málaga and Barcelona’s D’A.</p>\n<p>\n\t<strong>“Breaking Walls” (“Los Aitas”) dir. Borja Cobeaga</strong> (Despadres, Inicia Films, BTeam Prods, Sayaka Producciones)<br />Cobeaga’s return to features unfolds in 1980s Bilbao, where a rhythmic gymnastics team prepares to compete in Berlin. When mothers can’t travel, reluctant fathers step in, embarking on a journey coinciding with the fall of the Wall. With Juan Diego Botto and Quim Gutiérrez among the cast, it layers comedy with social observation, charting how men averse to hands-on parenting confront their changing roles. \n\t</p>\n<p>\n\t“<strong>Ombuaren Itzala” dir. Patxi Bisquert</strong> <strong>(Eguzki Art Zinema) Bisquert’s historical drama turns on poet and <em>bertsolari</em> Pello </strong></p>\n<p>\n\tMari Otaño, who fled Spain to avoid conscription, later returning to Gipuzkoa, marrying, and staging verse performances before illness and political circumstances forced him back to Argentina. With Joseba Usabiaga and Sara Cózar starring, the film traces his struggle to balance literature, ideology and family. “Ombuaren Itzala” reflects on exile and self through the story of a cultural figure divided between continents.</p>\n<p>\n\t“<strong>Ashes” (“Popel”) dir. Oier Plaza</strong> (Fmk media. Filmak, CinePoint, Babel Doc)</p>\n<p>\n\tPlaza’s feature hybridizes documentary investigation and dramatization as two researchers probe the fates of Spaniards deported to Nazi camps. In Prague, their search intersects with the tale of František Suchý, who, with his son, risked their lives to preserve the ashes of 2,000 victims. With cross-border production backing, “Ashes” ties Spanish exile histories to Central European memory, exploring themes of loss, truth, and the persistence of human solidarity under atrocity.</p>\n<div>\n<figure>\n<p><img srcset=\"https://variety.com/wp-content/uploads/2025/09/MASPALOMAS_2-1600x900-1.jpg 1600w, https://variety.com/wp-content/uploads/2025/09/MASPALOMAS_2-1600x900-1.jpg?resize=150,84 150w, https://variety.com/wp-content/uploads/2025/09/MASPALOMAS_2-1600x900-1.jpg?resize=300,169 300w, https://variety.com/wp-content/uploads/2025/09/MASPALOMAS_2-1600x900-1.jpg?resize=125,70 125w, https://variety.com/wp-content/uploads/2025/09/MASPALOMAS_2-1600x900-1.jpg?resize=1000,563 1000w, https://variety.com/wp-content/uploads/2025/09/MASPALOMAS_2-1600x900-1.jpg?resize=910,511 910w, https://variety.com/wp-content/uploads/2025/09/MASPALOMAS_2-1600x900-1.jpg?resize=681,383 681w, https://variety.com/wp-content/uploads/2025/09/MASPALOMAS_2-1600x900-1.jpg?resize=450,253 450w, https://variety.com/wp-content/uploads/2025/09/MASPALOMAS_2-1600x900-1.jpg?resize=250,140 250w\" src=\"https://variety.com/wp-content/uploads/2025/09/MASPALOMAS_2-1600x900-1.jpg?w=1024\" alt=\"\" />\n\t</p>\n<figcaption>\n\t\t\t\t\t<span>“Maspalomas,” courtesy of San Sebastián Film Festival</span>\n\t</figcaption>\n</figure>\n</div>\n<p>\n\t<strong>“The Last Rapture” (“El Último Arrebato”) dirs. Marta Medina, Enrique López Lavigne</strong> (Apache Films, 39 Escalones Films)</p>\n<p>\n\tRevisiting Iván Zulueta’s cult art house horror classic “Rapture,”  Medina and López Lavigne probe the legacy of a film that presaged Spain’s “movida” collapse and mirrored its director’s descent. The documentary positions Arrebato as both prophecy and personal tragedy. Competing for Irizar and Sebastiane Awards, “The Last Rapture” frames Zulueta as Spain’s cursed auteur, embodying the dangers and intoxications of art, drugs and obsession.</p>\n<p>\n\t<strong>“The Truce” (“La Tregua”) dir. Miguel Ángel Vivas, Spain–Kazakhstan)</strong> <strong>(Spassk 99, Umai Film)</strong></p>\n<p>\n\tSet in Spassk-99, a Soviet-era labor camp on the Kazakh steppe during WWII, it follows Spaniards from both sides of the Civil War — Republicans trained in the USSR and Blue Division volunteers captured at Leningrad — forced to cooperate for survival. With Miguel Herrán and Arón Piper starring, Vivas’ historical drama examines ideological enmity confronted by shared hardship. A rare cross border partnering between Spain and Kazakhstan showing in the RTVE Gala.\n\t</p>\n<p>\n\t“<strong>Gipuzkoa Hegan” dirs. Javi Gutiérrez Pereda, Lorea Pérez de Albéniz</strong> (Leike Produkzioak)</p>\n<p>\n\tLaunching a multi-part docuseries, “Gipuzkoa Hegan” offers an aerial journey through the Basque province’s stunning coastline, landscapes and towns, tracing customs and history with narration by Toti Martínez de Lezea. Original music by Fernando Velázquez scores imagery shot from the air. Presented as an EITB Gala, the doc is framed as both cultural showcase and visual celebration of territory, situating Gipuzkoa within a broader project mapping the Basque Country from above.</p>\n<p>\n\t<strong>“Tetsu, Txispa, Hoshi” dir. Jon Arregui Larrazabal</strong>(Digytal Audiovisuales)<br />Following Japanese chef Tetsuro Maeda, who built Michelin-starred restaurant Txispa at the foot of Mount Anboto, it blends food documentary with cultural meditation. Narrated through Maeda’s own reflections, the film charts his journey from Tokyo childhood to culinary reinvention in the Basque Country, anchoring his dishes in local landscapes and myths. </p>\n<p>\n\t“<strong>Heidi: Rescue of the Lynx” (“Heidi, Katamotzaren Erreskatea”) dirs. Tobias Schwarz, Aizea Roca</strong> (3Doubles Producciones, Studio 100 Film, Heidi Production Film, Hotel Hungaria Animatie, Sumendi Uhartea)<br />Reinventing Johanna Spyri’s classic, the animated feature follows Heidi as she discovers an injured lynx and sets out with Peter to reunite it with its family. Facing off against an unscrupulous businessman threatening nature, Heidi’s mission blends adventure with ecological themes. Co-directed by Germany’s Tobias Schwarz and Spain’s Aizea Roca, and produced with Belgian backing, the family film screens in Movies for Kids, expanding Basque co-production into international animation.</p>\n<p>\n\t<strong>“White Roses, Fall!” (“¡Caigan las Rosas Blancas!”) dir. Albertina Carri</strong> (Gentil Cine)<br />Argentine auteur Carri (“The Blonds”) returns with a hybrid autofiction where a young filmmaker, once author of a lesbian porn experiment, is hired to direct a mainstream porn production. Rejecting convention, she embarks on a schlep with friends from Buenos Aires to São Paulo, searching for alternative ways to narrate gender and desire. Radical politics, sex and cinema!</p>\n<div>\n<figure>\n<p><img srcset=\"https://variety.com/wp-content/uploads/2025/09/The-story-of-us.jpg 800w, https://variety.com/wp-content/uploads/2025/09/The-story-of-us.jpg?resize=150,84 150w, https://variety.com/wp-content/uploads/2025/09/The-story-of-us.jpg?resize=300,169 300w, https://variety.com/wp-content/uploads/2025/09/The-story-of-us.jpg?resize=125,70 125w, https://variety.com/wp-content/uploads/2025/09/The-story-of-us.jpg?resize=681,383 681w, https://variety.com/wp-content/uploads/2025/09/The-story-of-us.jpg?resize=450,253 450w, https://variety.com/wp-content/uploads/2025/09/The-story-of-us.jpg?resize=250,140 250w\" src=\"https://variety.com/wp-content/uploads/2025/09/The-story-of-us.jpg\" alt=\"\" />\n\t</p>\n<figcaption>\n\t\t\t\t\t<span>“The Story of Us,” courtesy of San Sebastián Film Festival</span>\n\t</figcaption>\n</figure>\n</div>\n<p>\n\t“<strong>8″ dir. Julio Medem</strong> (Morena Films, Eidan Produce, Barbazul La Película)\n\t</p>\n<p>\n\tSan Sebastián-born Julio Medem (“Lovers of the Arctic Circle”) premieres “8,” an epic intertwining Octavio and Adela’s lives across 90 years, beginning with their births on the day of Spain’s Second Republic proclamation. Played by Ana Rujas, Javier Rey and Álvaro Morte, the characters’ fates loop across history in the shape of infinity. Produced out of Spain with Basque involvement, “8” marks Medem’s ambitious return, mixing love story with sweeping political backdrop.</p>\n<p>\n\t<strong>“Undercover”</strong> <strong>(“La Infiltrada”) dir. Arantxa Echevarría</strong> (Esto También Pasará, Bowfinger International Pictures, Beta Fiction Spain)</p>\n<p>\n\tA big, big breakout in Spain last year, grossing €9.7 million ($11.3 million), the second highest box office score in Spain over the last 18 months. Echevarría (“Carmen & Lola”) directs a thriller about a police officer infiltrating ETA’s circles as a sympathizer, then tasked with sheltering militants preparing attacks. With Carolina Yuste and Luis Tosar starring, the feature dramatizes the most dangerous mission of her life, as she balances reporting to her superiors with the constant risk of discovery by the group. It squeezes the Basque conflict through a taut undercover drama.</p>\n<p>\n\t<br /><strong>“Queen of Coal” (“Miss Carbón”) dir. Agustina Macri</strong> (Morena Films, The Warning of Rivard)</p>\n<p>\n\tA Netflix title in Latin America, providing the closing night gala for August’s Sanfic in Chile. Drawing from real events, Macri’s co-production follows Carlita, the first woman miner in a town where superstition barred female presence underground. Starring Lux Pascal and Paco León, “Queen of Coal” shows her fight for recognition against gendered prohibitions and community hostility. Produced between Spain and Argentina, the film plays Made in Spain, spotlighting themes of perseverance, gender boundaries and social prejudice in a narrative pitched between biopic and social drama.</p>\n<p>\n\t<br /><strong>“The Story of Us” (“Nosotros”) dir. Helena Taberna</strong><br />(Lamia Producciones, Vértigo Films)</p>\n<p>\n\tNavarre-born Helena Taberna <em>(“</em>Yoyes”) reconstructs a love story in reverse, beginning with its breakdown. Ángela and Antonio (María Vázquez, Pablo Molinero) sift through decades of shared life – children, struggles, compromises – interrogating how love fades and memory fractures. A Spain-Europe co-production developed at San Sebastián’s Co-Production Forum, “The Story of Us” plays Made in Spain, cementing Taberna’s reputation as a Basque filmmaker continuing to explore the intersection of intimacy, history and political undercurrents.\n\t</p>\n<p>\n\t<em>John Hopewell and Rafa Sales Ross contributed to this article.</em></p>\n</div>"
  },
  {
    "title": "Filmax Acquires Sales on Basque Exile Drama ‘Karmele,’ Whose Director Asier Altuna Praises ‘Art as a Form of Resistance’ (EXCLUSIVE)",
    "url": "https://variety.com/2025/film/global/filmax-sales-karmele-asier-altuna-txintxua-1236525897/",
    "image": "https://variety.com/wp-content/uploads/2025/09/KARMELE_DAVID-HERRANZ.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-09-22T09:51:53.000Z",
    "description": "Filmax has picked up international sales on “Karmele,” directed by Basque Asier Altuna and produced by Marian Fernández Pascal at San Sebastián-based Txintxua Films and Esnatzeko Ordua Films. Inspired by...",
    "body": "<div><p>\n\t<a target=\"_blank\" href=\"https://variety.com/t/filmax/\">Filmax</a> has picked up international sales on “<a target=\"_blank\" href=\"https://variety.com/t/karmele/\">Karmele</a>,” directed by Basque <a target=\"_blank\" href=\"https://variety.com/t/asier-altuna/\">Asier Altuna</a> and produced by <a target=\"_blank\" href=\"https://variety.com/t/marian-fernandez-pascal/\">Marian Fernández Pascal</a> at San Sebastián-based <a target=\"_blank\" href=\"https://variety.com/t/txintxua-films/\">Txintxua Films</a> and <a target=\"_blank\" href=\"https://variety.com/t/esnatzeko-ordua-films/\">Esnatzeko Ordua Films</a>. </p>\n<p>\n\tInspired by Kirmen Uribe’s fact based novel “La hora de despertarnos juntos,” the Basque  drama retraces the life of a real-life figure, Karmele Urresti, a nurse forced into exile during the Spanish Civil War. Played by <a target=\"_blank\" href=\"https://variety.com/t/jone-laspiur/\">Jone Laspiur</a>, she falls in love with trumpet player Txomin Letamendi (<a target=\"_blank\" href=\"https://variety.com/t/eneko-sagardoy/\">Eneko Sagardoy</a>) in France, and together they build a family across Paris, Caracas and Bilbao while navigating the fracture between love, loyalty and political conviction. \n\t</p>\n<p>\n\tAltuna was struck by the density of events packed into the couple’s biography: expulsion, clandestine work against the dictatorship, collaboration with U.S. intelligence, two exiles in as many decades. “The temptation was to chase the sweep of history,” he admits, but the film deliberately narrows its gaze. “I had to restrain myself. What mattered most was their inner life — their dignity, but also their doubts, fears and contradictions.”\n</p>\n<p>\n\tThe relationship at the center of the film reflects that tension between personal and political. Txomin throws himself into militancy, committed to the collective cause. Karmele looks toward the family, to care, to the future of her children. Neither yields, and the fracture between their paths becomes part of the film’s central conflict. Altuna insists this is what makes them relatable: strength mixed with fragility, love complicated by conviction.\n\t</p>\n<p>\n\tLanguage itself becomes a field of resistance. Karmele’s mother, Carmen, was a teacher barred from her profession for giving classes in Basque. “She was disqualified and banished for 15 years, simply for teaching children who often didn’t speak another language,” Altuna told <em>Variety</em>. </p>\n<p>\n\tThat experience shapes Karmele’s outlook, even in exile. She dedicates herself to ensuring her children recover the freedom to speak the forbidden tongue. “It’s not only a story of militancy or exile; it’s about transmission. Identity is preserved through language. In the everyday, in the small things, a battle for dignity is also fought.”</p>\n<p>\n\tThe film’s visual and sonic texture reflects that interplay between joy and loss. Early sequences hum with music, Basque folk, jazz, salsa conveying the excitement of discovery as exiles navigate new worlds. The Eresoinka choir’s rendition of Gernika embodies the defiance of a displaced community, while an improvised bertsolari verse reaches back toward something primal. Yet when the family returns to Bilbao, the soundtrack falls away. “Suddenly, there is silence. That was a conscious decision. Only then is the weight of oppression truly felt,” Altuna explained.</p>\n<p>\n\tHe and composer Aitor Etxeberria avoided dramatic scoring, leaning instead on diegetic music and the absence of sound. “We didn’t want to impose an emotion,” the director explains. “Silence itself becomes oppressive. The audience is left space to construct their own narrative.”</p>\n<p>\n\tVisually, the film favors ellipsis and detail. Instead of re-creating battles, Altuna lingers on gestures: a farmer bartering milk for squid, a father hiding valuables in a chest, a woman’s arms folded. “Nature has its own drama. I like to dwell on nuances, on what connects us to memory,” he said. “Those images come from stories I heard as a child, from the fragments of war that reached us in peacetime. They are part of my truth.”</p>\n<div>\n<figure>\n<p><img srcset=\"https://variety.com/wp-content/uploads/2025/09/KARMELE_004.jpg 3840w, https://variety.com/wp-content/uploads/2025/09/KARMELE_004.jpg?resize=150,81 150w, https://variety.com/wp-content/uploads/2025/09/KARMELE_004.jpg?resize=300,162 300w\" src=\"https://variety.com/wp-content/uploads/2025/09/KARMELE_004.jpg?w=1024\" alt=\"\" />\n\t</p>\n<figcaption>\n\t\t\t\t\t<span>Karmele</span>\n\t\t\t\t\t\t\t\t\tCourtesy of Filmax Films\n\t</figcaption>\n</figure>\n</div>\n<p>\n\tActors Jone Laspiur (“Ane Is Missing”) and Eneko Sagardoy (“Irati”) worked closely from accounts given by Karmele’s surviving children, who described her speech, gestures and way of facing life. Weeks of preparation preceded the short shoot, allowing performances to emerge naturally. “The actors knew exactly where they were in each scene,” Altuna recalled. “Rehearsals, costumes, sets — everything helped step into another era. The result feels balanced: performance, staging, narrative all supporting each other.”\n\t</p>\n<p>\n\tThough grounded in Basque experience, “Karmele” aims wider. It asks what happens when the world collapses and people are forced to decide between surrender and dignity. “This is not just another Civil War film. If the same events were happening today, anywhere rights are violated and fear imposed, it would be the same story. It speaks to how we sustain humanity in the midst of chaos.”</p>\n<p>\n\tThe director is especially drawn to the way his protagonists chose art as a form of resistance. Basque exiles formed the Eresoinka choir to tour Europe, warning of fascism’s advance through music and dance. “Against violence and authoritarianism they opted for culture. They believed art could alert democracies to barbarism,” he says.</p>\n<p>\n\tAltuna sees parallels today. “That border between freedom and oppression can blur very quickly. At a time when totalitarianism resurfaces in different parts of the world, cinema too can be a form of resistance — and of continuing to believe in the possibility of a fairer world.”</p>\n</div>"
  },
  {
    "title": "Babes Wearing Beanies to Kick Off Fall!",
    "url": "https://www.tmz.com/2025/09/21/babes-wearing-beanies-fall/",
    "image": "https://imagez.tmz.com/image/9f/16by9/2025/09/18/9f620e4589334fbeba4718c11bfed163_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-09-21T19:00:14.000Z",
    "description": "Babes                          Wearing Beanies                          To Kick Off Fall!                                                                Published September 21, 2025 12:00 PM...",
    "body": "<div>\n    <article>\n                    <h2>\n                          <span>Babes</span>\n                          <span>Wearing Beanies</span>\n                          <span>To Kick Off Fall!</span>\n                      </h2>\n                  <p>\n                        Published September 21, 2025 12:00 PM PDT\n                                                                            </p>\n      <div>\n    <div>\n      <a target=\"_blank\" href=\"https://www.tmz.com/photos/2024/12/15/beanie-babes/\">\n        <img src=\"https://imagez.tmz.com/image/9f/4by3/2025/09/18/9f620e4589334fbeba4718c11bfed163_md.jpg\" alt=\"Beanie Babes\" />\n              </a>\n    </div>\n    <section>\n          <p>Fall's just around the corner, folks, and it's finally time to start breaking out the layers ... so we were thinking maybe getting some inspiration from our gallery of beanie-wearing babes would help out a bit!</p>\n      </section>\n    <section>\n          <p>Sure, beanies keep your head warm, but they can also be essential parts of an outfit -- <a target=\"_blank\" href=\"https://www.tmz.com/people/billie-eilish/\"><strong>Billie Eilish</strong></a> and <strong>Coi Leray</strong> really used them as fashion statements.</p>\n      </section>\n    <section>\n          <p>Then again, they could also just keep you really comfy ... we're thinking <strong>Corinna Kopf</strong> and <a target=\"_blank\" href=\"https://www.tmz.com/people/candice-swanepoel/\"><strong>Candice Swanepoel</strong></a> got the memo!</p>\n      </section>\n    <section>\n          <p>Check out our gallery for even more babes in beanies to kick off fall!</p>\n      </section>\n      </div>\n              <section>\n          <ul>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/people/candice-swanepoel/\">\n                Candice Swanepoel\n              </a>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/people/billie-eilish/\">\n                Billie Eilish\n              </a>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/categories/fashion-and-apparel/\">\n                Fashion & Apparel\n              </a>\n                      </ul>\n        </section>\n          </article>\n          </div>"
  },
  {
    "title": "Guess Who This Late-Night Show Host Is!",
    "url": "https://www.tmz.com/2025/09/21/guess-who-late-night-host/",
    "image": "https://imagez.tmz.com/image/53/16by9/2025/09/19/53ee6c19430343d4b3644dd88f56f69d_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-09-21T23:00:37.000Z",
    "description": "Guess Who                          This Late-Night Talk Show Host Is!                                                                Published September 21, 2025 4:00 PM...",
    "body": "<div>\n    <article>\n                    <h2>\n                          <span>Guess Who</span>\n                          <span>This Late-Night Talk Show Host Is!</span>\n                      </h2>\n                  <p>\n                        Published September 21, 2025 4:00 PM PDT\n                                                                            </p>\n      <div>\n    <div>\n      <div>\n        <p>\n                    <img src=\"https://imagez.tmz.com/image/65/16by9/2025/09/19/6514d557d579484ea7822a66d517d74c_md.jpg\" alt=\"091925_guess_who_jimmy_kimmel_kal\" />\n                  </p>\n      </div>\n                    <p><span>TMZ.com</span>\n          </p></div>\n    <section>\n          <p>We know he might be off the air for a little while ... but we still wanna see if you can guess who this late-night TV show host is!</p>\n      </section>\n    <section>\n          <p>We ran into this guy and his wife way back in 2017, when we caught him greeting a couple of fans while leaving a restaurant in L.A., and he was pretty popular -- back then, at least. You may also recognize a prolific celeb picture-collector known on the Hollywood streets ...</p>\n      </section>\n    <section>\n          <p>The thing is, the host in question here got pulled off the air earlier this month after making some comments about the circumstances surrounding a certain right-wing commentator ... so who knows when he's coming back?!</p>\n      </section>\n      </div>\n              <section>\n          <ul>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/categories/guess-who/\">\n                Guess Who\n              </a>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/categories/tv-stars/\">\n                TV Stars\n              </a>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/categories/late-night/\">\n                Late Night\n              </a>\n                      </ul>\n        </section>\n          </article>\n          </div>"
  },
  {
    "title": "'The Wizard of Oz' Munchkin Elaine Merk Binder Dead at 94",
    "url": "https://www.tmz.com/2025/09/21/elaine-merk-binder-the-wizard-of-oz-munchkin-dead-dies/",
    "image": "https://imagez.tmz.com/image/72/16by9/2025/09/22/727b04c5b64e47b4b152b6ad006672da_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-09-22T00:35:25.000Z",
    "description": "'The Wizard of Oz' Munchkin                          Elaine Merk Binder Dead at 94                                                                Published September 21, 2025 5:35 PM...",
    "body": "<div>\n    <article>\n                    <h2>\n                          <span>'The Wizard of Oz' Munchkin</span>\n                          <span>Elaine Merk Binder Dead at 94</span>\n                      </h2>\n                  <p>\n                        Published September 21, 2025 5:35 PM PDT\n                                                                            </p>\n      <div>\n    <div>\n                  <a>\n          <div>\n                          <p><img src=\"https://imagez.tmz.com/image/72/4by3/2025/09/22/727b04c5b64e47b4b152b6ad006672da_md.jpg\" alt=\"elaine mark id\" />\n                </p></div>\n                                  </a>\n      </div>\n    <section>\n          <p><strong>Elaine Merk Binder</strong>, who famously played one of the munchkins in \"The Wizard of Oz,\" is dead.</p>\n      </section>\n    <section>\n          <p>Elaine died Sunday ... according to her daughter, <strong>Annette Phillips</strong>. The cause of death is unclear.</p>\n      </section>\n    <section>\n          <p>Most of the actors who played munchkins in the 1939 movie are dead ... Elaine had been one of the last few who were still alive.</p>\n      </section>\n    <section>\n          <p>Elaine tried out for \"The Wizard of Oz\" way back in 1938 ... and she was one of 8 munchkins who dance and sing in the movie.</p>\n      </section>\n    <section>\n          <p>Elaine's daughter says he appears in the film during the performance of \"Come Out, Come Out\" ... she's staged in the second little house up the steps. Just before they go into \"Off to See the Wizard,\" Elaine can be seen as one of the eight dancers in a pavilion at the rear, wearing a dark green dress and hat.</p>\n      </section>\n    <section>\n          <p>Elaine turned 8 years old during filming on the MGM lot.</p>\n      </section>\n    <section>\n          <p>Elaine once recalled ... \"I tried out for the 'Wizard of Oz' Munchkins. For me it was scary. It was my first big call for girls from a major studio.\"</p>\n      </section>\n    <section>\n          <p>She was 94.</p>\n      </section>\n    <section>\n          <p>RIP</p>\n      </section>\n      </div>\n          </article>\n          </div>"
  },
  {
    "title": "Camille O'Connell In 'The Originals' 'Memba Her?!",
    "url": "https://www.tmz.com/2025/09/22/camille-oconnell-in-the-originals-memba-her/",
    "image": "https://imagez.tmz.com/image/d8/16by9/2025/09/16/d8eaab17882b4b228a732627ae8a5f0c_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-09-22T07:01:12.000Z",
    "description": "Back in 2013, American actress Leah Pipes was in her mid 20s when she first started playing Camille O'Connell on the supernatural fantasy-drama spinoff series \"The Originals.\" Guess what she looks like now!",
    "body": "<div>\n    <article>\n                  <p>\n                        Published September 22, 2025 12:01 AM PDT\n                                                                            </p>\n      <div>\n    <section>\n          <p>Back in 2013, American actress <strong>Leah Pipes</strong> was in her mid 20s when she first started playing Camille O'Connell -- the former brave psychology student who's highly intelligent -- on the supernatural fantasy-drama spinoff series \"The Originals.\"</p>\n      </section>\n    <section>\n          <p>Pipes was part of an ensemble cast including <strong>Joseph Morgan </strong>as Niklaus, the OG vampire who's romantically interested in Camile, <strong>Phoebe Tonkin </strong>as Hayley, the protective alpha werewolf who shares a kid with Niklaus, and<strong> Danielle Campbell</strong> as<strong> </strong>Davina, who is extremely powerful and the dependent teen witch ...</p>\n      </section>\n    <section>\n          <p>Pipes also starred in the slasher film \"Sorority Row\" where she played Jessica Pierson.</p>\n      </section>\n    <section>\n          <p><a href=\"https://www.tmz.com/photos/2023/02/28/memba-them-part-16/\" target=\"_blank\"><strong>Guess what she looks like now!</strong></a></p>\n      </section>\n      </div>\n              <section>\n            <h3>\n              Related articles\n            </h3>\n        </section>\n              <section>\n          <ul>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/categories/memba-them/\">\n                Memba Them\n              </a>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/categories/photo-galleries/\">\n                Photo Galleries\n              </a>\n                      </ul>\n        </section>\n          </article>\n          </div>"
  },
  {
    "title": "Check Out Bill Murray's Most Iconic Moments Through the Years!",
    "url": "https://www.tmz.com/2025/09/21/bill-murray-iconic-moments-through-the-years/",
    "image": "https://imagez.tmz.com/image/db/16by9/2025/09/19/db13c5ffae08464fabb9ff2ab827bce3_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-09-21T21:00:10.000Z",
    "description": "Bill Murray                          His Most Iconic Moments Through The Years!                                                                Published September 21, 2025 2:00 PM...",
    "body": "<div>\n    <article>\n                    <h2>\n                          <span>Bill Murray</span>\n                          <span>His Most Iconic Moments Through The Years!</span>\n                      </h2>\n                  <p>\n                        Published September 21, 2025 2:00 PM PDT\n                                                                            </p>\n      <div>\n    <div>\n      <div>\n        <p>\n                    <img src=\"https://imagez.tmz.com/image/5d/16by9/2025/09/19/5d11d15cdf3a48d4913b5917ef3bc1f7_md.jpg\" alt=\"BILL-MURRAY-timeline\" />\n                  </p>\n      </div>\n                    <p><span>TMZ.com/Getty</span>\n          </p></div>\n    <section>\n          <p><a target=\"_blank\" href=\"https://www.tmz.com/people/bill-murray/\"><strong>Bill Murray</strong></a>'s made it 75 times around the sun ... and we're looking back at some of his most iconic moments through the years!</p>\n      </section>\n    <section>\n          <p>The star's gotten used to being photographed at red carpets in his acting career -- it's really gotta feel like \"Groundhog Day\" at this point -- but all the glitz and glam is really just part of the job.</p>\n      </section>\n    <section>\n          <p>Plus, Bill's a man of the people, as he hasn't had too many problems with greeting fans on the street or keeping it low-key while hanging out with friends ... check out our video to see even more of the good times!</p>\n      </section>\n    <section>\n          <p>Happy Birthday Bill!!!</p>\n      </section>\n      </div>\n              <section>\n          <ul>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/people/bill-murray/\">\n                Bill Murray\n              </a>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/categories/through-the-years/\">\n                Through The Years\n              </a>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/categories/movies/\">\n                Movies\n              </a>\n                      </ul>\n        </section>\n          </article>\n          </div>"
  }
]