[
  {
    "title": "‘Ha-chan, Shake Your Booty!’ Review: Rinko Kikuchi Dances Through Grief and Uneven Tones",
    "url": "https://variety.com/2026/film/news/ha-chan-shake-your-booty-review-1236634021/",
    "image": "https://variety.com/wp-content/uploads/2026/01/ha-chan.png?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-23T04:15:00.000Z",
    "description": "\n\tA cross-cultural tale of grief and dance, Josef Kubota Wladyka’s “Ha-chan, Shake Your Booty!” stems from an intimate place, but ends up emotionally ",
    "body": "\n\tA cross-cultural tale of grief and dance, Josef Kubota Wladyka’s “Ha-chan, Shake Your Booty!” stems from an intimate place, but ends up emotionally inert thanks to its style. Its key strength is a committed lead performance from Rinko Kikuchi, who fits effortlessly into a role inspired by the director’s mother. However, while trying to confront grief with a sense of mischief, the movie’s impish tonal approach takes the sting out of death a little too often, rendering its catharsis null. It’s hard not to respect a big swing, but Wladyka ultimately misses.\n\t\n\n\tForty-six-year-old Haru (Kikuchi) lives with her Mexican husband Luis (Alejandro Edda). As partners on the Tokyo ballroom circuit, they have an easygoing relationship, frankly critiquing each other’s form while reviewing clips on a digital tablet over dinner. They also make an added effort to understand each other, and to be understood, by speaking not only in broken English, but in bits of each other’s first languages too. The Japanese and Spanish subtitles are presented in different colors, allowing viewers to more easily nestle themselves in the couple’s comfortable dynamic.\n\n\n\tWhen Luis suddenly dies, Haru is left adrift. After his family insists on repatriating his remains, rather than having him cremated in Tokyo, she can’t find closure, and even imagines him visiting her in the inexplicable guise of a cutesy raven mascot. This makes “Ha-chan, Shake Your Booty!” the umpteenth recent American festival bow to follow this pattern — death also took avian form in last year’s Sundance premiere “The Thing With Feathers” and 2023’s “Tuesday” — though few of these films wield their symbolism with much depth or emotional nuance.\n\t\n\n\tIt certainly helps that Haru can be seen detaching herself from her friends and her hobbies over several months, but the film’s ostensible turning point is a rather strange one. Forced by her longtime dancer pals to return to salsa, samba and cha-cha classes, she’s immediately smitten with her new instructor, a Cuban man named Fedir (Alberto Guerra), though she’s wracked with guilt at the very thought of acting on her feelings. This is a tremendous starting point for any story: Grief tends to take inexplicable forms, including the sensation that moving on romantically might be akin to cheating. It’s through the language of infidelity and open marriage that Haru begins to navigate these complex feelings, but this symbolic mode of confronting death ends up superseding the underlying reality. Beyond a point, “Ha-chan” plays out with the relative simplicity of a film about white lies and infidelity, rather than one about mourning.\n\n\tWladyka, who has a mixed Japanese-Polish background and has spent considerable time directing in Latin America, gracefully navigates some of the film’s cross-cultural specifics, which also result in an earwormy soundtrack drawn from Japanese and Latin influences. His visual approach, however, flattens the ensuing emotional layers. There’s a tongue-in-cheek quality to the way he films Haru and Luis, using crash zooms to enhance moments of mischievous infatuation ultimately built on trust. But it’s with this same visual language that he first brings Fedir into Haru’s purview as well, rendering the sensations of deep, fulfilling, decades-long romance and instantaneous lust with the exact same brushstrokes. It certainly doesn’t help that we aren’t granted nearly enough of Luis’s presence to eventually feel his absence, or enough by way of intoxicating movement before his death to contrast with stifling stillness afterwards.\n\n\tColorful chapter titles — each announced with text cards and enthusiastic Japanese and English voiceover — make “Ha-chan” feel akin to a bubbly Japanese game show, rather than a tale in which a woman’s perspective is tinted by emotional agony. Kikuchi, for her part, imbues the character with dimensions by turns gentle and thorny, but Haru’s unwillingness to meaningfully confront her loss is a blind spot that ends up applied to the story as a whole. The notion of grief gradually fades into the backdrop, finally re-emerging in a manner that is, thanks to the film’s lumpy tonal mixture, more confusing than emotionally cleansing.\n\t\n\n\tOccasional song-and-dance diversions are presented with dull simplicity, as the camera observes choreography at a distance, rather than embodying or enhancing it. And anytime a popular needle drop is deployed, it ends up harkening back to famous musical moments from better films, like “Goodfellas” or “Dirty Dancing.” Even in its strongest moments, “Ha-chan, Shake Your Booty!” is cursed to set the bar much too high for itself. The result is mostly fine — but just “fine” can’t help but feel like a failing when the material has so much promise. In trying to make grief wholly digestible, Wladyka ends up making it bland.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Ha-chan, Shake Your Booty!’ Review: Rinko Kikuchi Dances Through Grief and Uneven Tones",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/ha-chan.png?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-23T04:15:00.000Z",
      "dateModified": "2026-01-23T04:15:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘The Pitt’ Star Noah Wyle and Producers on Honoring Muslim Community After Pittsburgh’s Tree of Life Attack: ‘The Most Underreported Aspect of the Story’",
    "url": "https://variety.com/2026/tv/news/the-pitt-noah-wyle-muslim-community-tree-of-life-attack-1236638423/",
    "image": "https://variety.com/wp-content/uploads/2026/01/irina-dubova-noah-wyle.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-23T03:00:00.000Z",
    "description": "\n\tSPOILER ALERT: This story contains spoilers from “9:00 a.m.,” Episode 3, Season 2 of “The Pitt,” now streaming on HBO Max.\n\n\tWhen storyline conversa",
    "body": "\n\tSPOILER ALERT: This story contains spoilers from “9:00 a.m.,” Episode 3, Season 2 of “The Pitt,” now streaming on HBO Max.\n\n\tWhen storyline conversations began for Season 2 of “The Pitt,” star and executive producer Noah Wyle and executive producers R. Scott Gemmill and John Wells knew they wanted to honor the Jewish and Muslim communities in Pittsburgh, nearly eight years after the October 2018 terrorist attack at the Tree of Life Synagogue, which killed 11, and injured six. \n\t\n\n\tDuring the third episode, “9:00 a.m.,” Wyle’s Dr. Robinavitch helps treat a Jewish patient (played by Irina Dubova) who burned herself after being startled by fireworks. She later admits she has PTSD from the gunshots she heard at the synagogue during the mass shooting.\n\n\n\t“That being such a significant event in the city of Pittsburgh, it seemed like a wonderful opportunity,” says Wyle, who also wrote the episode. “When I started researching it, the aspects of it that moved me the most were the community outcry afterward from the Muslim community and the solidarity with the Jewish community of Pittsburgh working together to grieve and mourn the loss. It was the most underreported aspect of the story, and perhaps the most hopeful moving forward.”\n\n\tThe patient, Yana, goes out of her way to bring up that it was the Muslim community who funded the funerals of those killed during the hate crime, thanking Nurse Perlah Alawi (Amielynn Abellera).\n\n\t“You can’t do a medical show, set in Pittsburgh, with a Jewish doctor without addressing that,” adds Gemmill. “It felt like a very important story to tell. There are important elements of that that hadn’t been told, or hadn’t really made the news cycle. The fact that the Muslim community came together and paid for all the funerals, that’s the kind of information that needed to be out there. We wanted to tell that part of the story, and address the story itself.”\n\t\n\n\tWyle notes that Robby’s “lack of faith and desire to perhaps, have some faith” was touched upon during Season 1 — and a thread they wanted to further explore and was something he wanted to dive further into. \n\n\t“We don’t talk about Robby’s parents at all, but we do reference that he was raised by his grandparents. And Yana is a grandmother, so she’s a very familiar energy to Robby,” Wyle says. “Their interaction allows you to see a degree of relaxation and familiarity that you rarely ever see him share with anybody else, because there’s such a cultural affinity, sense of humor, sarcasm, cynicism. All of that is shared and because his guard is down with her, when she pokes holes in his trip and questions whether or not this is a midlife crisis or a cry for help, it’s the first in a series of of earthquakes that he experiences that begin to make him question his resolve.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘The Pitt’ Star Noah Wyle and Producers on Honoring Muslim Community After Pittsburgh’s Tree of Life Attack: ‘The Most Underreported Aspect of the Story’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/irina-dubova-noah-wyle.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-23T03:00:00.000Z",
      "dateModified": "2026-01-23T03:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Oscar Predictions: From Inevitable to Unpredictable, How ‘Sinners’ Upended the Race Overnight",
    "url": "https://variety.com/lists/2026-oscars-predictions/",
    "image": "https://variety.com/wp-content/uploads/2025/03/Sinners-Oscar-Predictions-1.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-23T03:30:00.000Z",
    "description": "\n\t\t\n\n\t\n\tJan 22, 2026 7:30pm PT\t\n\t\n\n\t\n\tOscar Predictions: From Inevitable to Unpredictable, How ‘Sinners’ Upended the Race Overnight\n\t\n\n\n\n\t\t\t\n\t\t\t\n\t\n\t\t\t",
    "body": "\n\t\t\n\n\t\n\tJan 22, 2026 7:30pm PT\t\n\t\n\n\t\n\tOscar Predictions: From Inevitable to Unpredictable, How ‘Sinners’ Upended the Race Overnight\n\t\n\n\n\n\t\t\t\n\t\t\t\n\t\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\tWarner Bros.\n\t\n\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\n\t\t\n\n\tVariety Awards Circuit section is the home for all awards news and related content throughout the year, featuring the following: the official predictions for the upcoming Oscars, Emmys, Grammys and Tony Awards ceremonies, curated by Variety chief awards editor Clayton Davis. The prediction pages reflect the current standings in the race and do not reflect personal preferences for any individual contender. As other formal (and informal) polls suggest, competitions are fluid and subject to change based on buzz and events. Predictions are updated every Thursday.\n\n\n\n\t\n\n\t\t\t\t\tSINNERS, foreground from left: Michael B. Jordan, director Ryan Coolger, on set, 2025. © Warner Bros. / Courtesy Everett Collection\n\t\t\t\t\t\t\t\t\t©Warner Bros/Courtesy Everett Collection\n\t\n\n\n\n\n\tOscars Commentary (Updated: Jan. 22, 2026): In one morning, the Oscar race went from settled to chaotic, and the reason is simple: “Sinners.”\n\n\tFor months, Paul Thomas Anderson’s “One Battle After Another” looked like a juggernaut poised to coast to the finish line. Instead, the race cracked wide open thanks to Ryan Coogler’s audacious vampire epic “Sinners,” which stormed the nominations with a record-breaking 16 mentions — the most ever for a single film.\n\n\t“One Battle After Another” remains a formidable contender with 13 nods, a sign of deep industry respect for both the film and the auteur, now a 14-time nominee who has yet to take home a competitive Oscar. But a surprise omission — Chase Infiniti missed the best actress race — may expose just enough vulnerability to invite a challenger, and that challenger is Coogler’s box office smash.\n\n\tOther contenders landed respectable hauls, but none assembled the kind of nomination package that usually produces a best picture winner.\n\n\tChloé Zhao’s “Hamnet,” with eight nominations, is elegant and admired. Still, key misses — notably Paul Mescal in supporting actor and the film’s editing — make an upset difficult, even with lead actress Jessie Buckley positioned as the most likely acting winner of the season.\n\n\tGuillermo del Toro’s Gothic adaptation of “Frankenstein” received nine nominations. But the absence of a directing nod is historically tough to overcome, especially in a year dominated by two heavyweight frontrunners.\n\n\tWhat separates “Sinners” isn’t merely the volume it amassed. It’s also that it clearly resonated across all 19 branches of the Academy. Coogler enters the race having shattered records for Black representation. Ten Black artists are nominated for their work on the film, tying “Judas and the Black Messiah” (2021) for the most from a single movie. Coogler is only the third Black filmmaker nominated in the same year for producing, directing and screenwriting, joining Jordan Peele and Spike Lee, and the seventh Black man nominated for directing. His producing partner and wife, Zinzi Coogler, also made history as the first Filipina producer and the third Black woman nominated for best picture.\n\n\tThe film’s impact stretches across the crafts, with breakthroughs in cinematography — Autumn Durald Arkapaw is the first woman of color to be recognized — and costume design for two-time winner Ruth E. Carter, now the most-nominated Black woman in Oscar history.\n\n\tMore important, there’s precedent for an upset.\n\n\tThe race between “La La Land” and “Moonlight” from 2016 proved that a timely and urgent drama could overtake a seemingly unstoppable musical frontrunner. And “Moonlight” achieved that with only a Golden Globe for best picture (drama) and a WGA prize under its belt.\n\n\tWhen the World War I epic “1917” (2019) swept key precursors, only for the Academy ultimately to crown Bong Joon Ho’s “Parasite” the first non-English-language best picture winner, it showed the group could rise to the occasion of a historic moment, even though the film had just a SAG ensemble win to its name.\n\n\tOverall, the noms revealed an unusually top-heavy year. Only 50 films were recognized across all categories, matching last year’s total and marking the lowest number since 2008. Whether that reflects shrinking viewing habits or an oversaturated landscape remains up for debate.\n\n\tIn some areas, the Academy continued to expand its horizons. A landmark four non-English-language performances earned acting nominations, and international cinema placed two films in both best picture and international feature for the second consecutive year. Latino artists posted historic gains across producing (Guillermo del Toro), acting (Wagner Moura for “The Secret Agent”) and animation (Yvett Merino for “Zootopia 2”). At the same time, women reached new highs in directing, sound — with “Sirāt” fielding the first all-women sound team — and overall representation, with a record 74 women nominated.\n\n\tTaken together, this year’s nominations paint a portrait of an Academy in transition. Still imperfect and still evolving, it is increasingly responsive to films that marry craft, ambition and cultural relevance.\n\n\tWhat once felt like an inevitable model now feels thrillingly uncertain.\n\n\tProjected winner leaders (films): “Sinners” (7), “One Battle After Another” (3), “F1,” “Frankenstein” and “Sentimental Value” (2)\n\n\tProjected winner leaders (studios): Warner Bros. (10), Netflix (3), Apple (2), Neon (2)\n\n\t*** = PREDICTED WINNER(All predicted nominees listed below are in alphabetical order)\n\n\n\t\t\t\n\t\t\t\n\tBest Picture\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: ©Focus Features/Courtesy Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\t“Bugonia” (Focus Features)Ed Guiney & Andrew Lowe, Yorgos Lanthimos, Emma Stone and Lars Knudsen“F1” (Apple Original Films/Warner Bros.)Chad Oman, Brad Pitt, Dede Gardner, Jeremy Kleiner, Joseph Kosinski and Jerry Bruckheimer“Frankenstein” (Netflix)Guillermo del Toro, J. Miles Dale and Scott Stuber“Hamnet” (Focus Features) Liza Marshall, Pippa Harris, Nicolas Gonda, Steven Spielberg and Sam Mendes“Marty Supreme” (A24)Eli Bush, Ronald Bronstein, Josh Safdie, Anthony Katagas and Timothée Chalamet“One Battle After Another” (Warner Bros.) Adam Somner, Sara Murphy and Paul Thomas Anderson“The Secret Agent” (Neon)Emilie Lesclaux“Sentimental Value” (Neon)Maria Ekerhovd and Andrea Berentsen Ottmar“Sinners” (Warner Bros.) ***Zinzi Coogler, Sev Ohanian and Ryan Coogler“Train Dreams” (Netflix)Marissa McMahon, Teddy Schwarzman, Will Janowitz, Ashley Schlaifer and Michael Heimler\n\n\tOscar category page with rankings>>>\n\n\t\t\n\t\t\t\n\t\t\t\n\tDirector\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: ©Warner Bros/Courtesy Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\tPaul Thomas Anderson ***“One Battle After Another” (Warner Bros.)Ryan Coogler“Sinners” (Warner Bros.)Josh Safdie“Marty Supreme” (A24)Joachim Trier“Sentimental Value” (Neon)Chloé Zhao“Hamnet” (Focus Features)\n\n\tOscar category page with rankings>>>\n\n\t\t\n\t\t\t\n\t\t\t\n\tActor\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: ©Sony Pictures/Courtesy Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\tTimothée Chalamet “Marty Supreme” (A24)Leonardo DiCaprio “One Battle After Another” (Warner Bros.)Ethan Hawke ***“Blue Moon” (Sony Pictures Classics)Michael B. Jordan“Sinners” (Warner Bros.)Wagner Moura“The Secret Agent” (Neon)\n\n\tOscar category page with rankings>>>\n\n\t\t\n\t\t\t\n\t\t\t\n\tActress\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: ©Focus Features/Courtesy Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\tJessie Buckley ***“Hamnet” (Focus Features)Rose Byrne“If I Had Legs I’d Kick You” (A24)Kate Hudson“Song Sung Blue” (Focus Features)Renate Reinsve“Sentimental Value” (Neon)Emma Stone“Bugonia” (Focus Features)\n\n\tOscar category page with rankings>>>\n\n\t\t\n\t\t\t\n\t\t\t\n\tSupporting Actor\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: ©Warner Bros/Courtesy Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\tBenicio Del Toro “One Battle After Another” (Warner Bros.)Jacob Elordi“Frankenstein” (Netflix)Delroy Lindo“Sinners” (Warner Bros.)Sean Penn “One Battle After Another” (Warner Bros.)Stellan Skarsgård ***“Sentimental Value” (Neon)\n\n\tOscar category page with rankings>>>\n\n\t\t\n\t\t\t\n\t\t\t\n\tSupporting Actress\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Courtesy Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\tElle Fanning“Sentimental Value” (Neon)Inga Ibsdotter Lilleaas“Sentimental Value” (Neon)Amy Madigan “Weapons” (Warner Bros.)Wunmi Mosaku“Sinners” (Warner Bros.)Teyana Taylor ***“One Battle After Another” (Warner Bros.)\n\n\tOscar category page with rankings>>>\n\n\t\t\n\t\t\t\n\t\t\t\n\tOriginal Screenplay\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Courtesy Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\t“Blue Moon” (Sony Pictures Classics)Written by Robert Kaplow“It Was Just an Accident” (Neon)Written by Jafar Panahi; Script collaborators – Nader Saïvar, Shadmehr Rastin, Mehdi Mahmoudian“Marty Supreme” (A24)Written by Ronald Bronstein & Josh Safdie“Sentimental Value” (Neon) Written by Eskil Vogt, Joachim Trier“Sinners” (Warner Bros.) ***Written by Ryan Coogler\n\n\tOscar category page with rankings>>>\n\n\t\t\n\t\t\t\n\t\t\t\n\tAdapted Screenplay\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: ©Netflix/Courtesy Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\t“Bugonia” (Focus Features)Screenplay by Will Tracy“Frankenstein” (Netflix)Written for the Screen by Guillermo del Toro“Hamnet” (Focus Features) Screenplay by Chloé Zhao & Maggie O’Farrell“One Battle After Another” (Warner Bros.) ***Written by Paul Thomas Anderson“Train Dreams” (Netflix) Screenplay by Clint Bentley & Greg Kwedar\n\n\tOscar category page with rankings>>>\n\n\t\t\n\t\t\t\n\t\t\t\n\tCasting\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Courtesy Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\t“Hamnet” (Focus Features)Nina Gold“Marty Supreme” (A24)Jennifer Venditti“One Battle After Another” (Warner Bros.)Cassandra Kulukundis“The Secret Agent” (Neon)Gabriel Domingues“Sinners” (Warner Bros.) ***Francine Maisler\n\n\tOscar category page with rankings>>>\n\n\t\t\n\t\t\t\n\t\t\t\n\tAnimated Feature\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: ©Walt Disney Co./Courtesy Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\t“Arco” (Neon)Ugo Bienvenu, Félix de Givry, Sophie Mas and Natalie Portman“Elio” (Pixar)Madeline Sharafian, Domee Shi, Adrian Molina and Mary Alice Drumm“KPop Demon Hunters” (Netflix) ***Maggie Kang, Chris Appelhans and Michelle L.M. Wong“Little Amélie or the Character of Rain” (GKids) Maïlys Vallade, Liane-Cho Han, Nidia Santiago and Henri Magalon“Zootopia 2” (Walt Disney Pictures) Jared Bush, Byron Howard and Yvett Merino\n\n\tOscar category page with rankings>>>\n\n\t\t\n\t\t\t\n\t\t\t\n\tProduction Design\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Courtesy Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\t“Frankenstein” (Netflix) ***Production Design: Tamara Deverell; Set Decoration: Shane Vieau“Hamnet” (Focus Features)Production Design: Fiona Crombie; Set Decoration: Alice Felton“Marty Supreme” (A24)Production Design: Jack Fisk; Set Decoration: Adam Willis“One Battle After Another” (Warner Bros.) Production Design: Florencia Martin; Set Decoration: Anthony Carlino“Sinners” (Warner Bros.)Hannah Bleachler, Monique Champagne\n\n\tOscar category page with rankings>>>\n\n\t\t\n\t\t\t\n\t\t\t\n\tCinematography\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: ©Netflix/Courtesy Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\t“Frankenstein” (Netflix)Dan Laustsen“Marty Supreme” (A24)Darius Khondji“One Battle After Another” (Warner Bros.)Michael Bauman“Sinners” (Warner Bros.) ***Autumn Durald Arkapaw“Train Dreams” (Netflix)Adolpho Veloso\n\n\tOscar category page with rankings>>>\n\n\t\t\n\t\t\t\n\t\t\t\n\tCostume Design\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: ©20th Century Studios/Courtesy Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\t“Avatar: Fire and Ash” (20th Century Studios)Deborah L. Scott“Frankenstein” (Netflix)Kate Hawley“Hamnet” (Focus Features)Malgosia Turzanska“Marty Supreme” (A24)Miyako Bellizzi“Sinners” (Warner Bros.) ***Ruth E. Carter\n\n\tOscar category page with rankings>>>\n\n\t\t\n\t\t\t\n\t\t\t\n\tFilm Editing\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: ©Warner Bros/Courtesy Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\t“F1” (Apple Original Films/Warner Bros.) ***Stephen Mirrione“Marty Supreme” (A24)Ronald Bronstein and Josh Safdie“One Battle After Another” (Warner Bros.) Andy Jurgensen“Sentimental Value” (Neon) Olivier Bugge Coutté“Sinners” (Warner Bros.)Michael P. Shawver\n\n\tOscar category page with rankings>>>\n\n\t\t\n\t\t\t\n\t\t\t\n\tMakeup and Hairstyling\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Courtesy Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\t“Frankenstein” (Netflix) ***Mike Hill, Jordan Samuel and Cliona Furey“Kokuho” (GKids) Kyoko Toyokawa, Naomi Hibino and Tadashi Nishimatsu“Sinners” (Warner Bros.)Ken Diaz, Mike Fontaine and Shunika Terry“The Smashing Machine” (A24) Kazu Hiro, Glen Griffin and Bjoern Rehbein“The Ugly Stepsister” (Independent Film Company/Shudder)Thomas Foldberg and Anne Cathrine Sauerberg\n\n\tOscar category page with rankings>>>\n\n\t\t\n\t\t\t\n\t\t\t\n\tSound\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Courtesy Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\t“F1” (Apple Original Films/Warner Bros.) ***Gareth John, Al Nelson, Gwendolyn Yates Whittle, Gary A. Rizzo and Juan Peralta“Frankenstein” (Netflix)Greg Chapman, Nathan Robitaille, Nelson Ferreira, Christian Cooke and Brad Zoern“One Battle After Another” (Warner Bros.)José Antonio García, Christopher Scarabosio and Tony Villaflor“Sinners” (Warner Bros.)Chris Welcker, Benjamin A. Burtt, Felipe Pacheco, Brandon Proctor and Steve Boeddeker“Sirât” (Neon)Amanda Villavieja, Laia Casanovas and Yasmina Praderas\n\n\tOscar category page with rankings>>>\n\n\t\t\n\t\t\t\n\t\t\t\n\tVisual Effects\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: ©HLN/Courtesy Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\t“Avatar: Fire and Ash” (20th Century Studios) ***Joe Letteri, Richard Baneham, Eric Saindon and Daniel Barrett“F1” (Apple Original Films/Warner Bros.)Ryan Tudhope, Nicolas Chevallier, Robert Harrington and Keith Dawson“Jurassic World: Rebirth” (Universal Pictures)David Vickery, Stephen Aplin, Charmaine Chan and Neil Corbould“The Lost Bus” (Apple Original Films)Charlie Noble, David Zaretti, Russell Bowen and Brandon K. McLaughlin“Sinners” (Warner Bros.)Michael Ralla, Espen Nordahl, Guido Wolter and Donnie Dean\n\n\tOscar category page with rankings>>>Coming Soon\n\n\t\t\n\t\t\t\n\t\t\t\n\tOriginal Score\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: ©Focus Features/Courtesy Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\t“Bugonia” (Focus Features)Jerskin Fendrix“Frankenstein” (Netflix)Alexandre Desplat“Hamnet” (Focus Features)Max Richter“One Battle After Another” (Warner Bros.)Jonny Greenwood“Sinners” (Warner Bros.) ***Ludwig Göransson\n\n\tOscar category page with rankings>>>\n\n\t\t\n\t\t\t\n\t\t\t\n\tOriginal Song\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: ©Netflix/Courtesy Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\t“Dear Me” from “Diane Warren: Relentless” (Greenwich Entertainment) Music and Lyric by Diane Warren“Golden” from “KPop Demon Hunters” (Netflix) Music and Lyric by EJAE, Mark Sonnenblick, Joong Gyu Kwak, Yu Han Lee, Hee Dong Nam, Jeong Hoon Seon and Teddy Park“I Lied To You” from “Sinners” (Warner Bros.) ***Music and Lyric by Raphael Saadiq and Ludwig Goransson“Sweet Dreams Of Joy” from “Viva Verdi!” (Self-Distributed) Music and Lyric by Nicholas Pike“Train Dreams” from “Train Dreams” (Netflix) Music by Nick Cave and Bryce Dessner; Lyric by Nick Cave \n\n\tOscar category page with rankings>>>\n\n\t\t\n\t\t\t\n\t\t\t\n\tDocumentary Feature\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: ©Netflix/Courtesy Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\t“The Alabama Solution” (HBO Documentary Films)Andrew Jarecki and Charlotte Kaufman“Come See Me in the Good Light” (Apple Original Films)Ryan White, Jessica Hargrave, Tig Notaro and Stef Willen“Cutting Through Rocks” (Self-Distributed)Sara Khaki and Mohammadreza Eyni“Mr. Nobody Against Putin” (Self-Distributed)Nominees to be determined“The Perfect Neighbor” (Netflix) ***Geeta Gandbhir, Alisa Payne, Nikon Kwantu and Sam Bisbee\n\n\tOscar category page with rankings>>>\n\n\t\t\n\t\t\t\n\t\t\t\n\tInternational Feature\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: Courtesy Everett Collection\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\t“It Was Just an Accident” from France (Neon) dir. Jafar Panahi“The Secret Agent” from Brazil (Neon)dir. Kleber Mendonça Filho“Sentimental Value” from Norway (Neon) ***dir. Joachim Trier“Sirât” from Spain (Neon)dir. Oliver Laxe“The Voice of Hind Rajab” from Tunisia (Willa)dir. Kaouther Ben Hania\n\n\tOscar category page with rankings>>>\n\n\t\t\n\t\t\t\n\t\t\t\n\tAnimated Short\n\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\n\n\t“Butterfly” (Sacrebleu Productions) Florence Miailhe and Ron Dyens“Forevergreen” (Self-Distributed)Nathan Engelhardt and Jeremy Spears“The Girl Who Cried Pearls” (National Film Board of Canada) Chris Lavis and Maciek Szczerbowski“Retirement Plan” (Self-Distributed) ***John Kelly and Andrew Freedman“The Three Sisters” (Polydont Films/Rymanco Ventures) Konstantin Bronzit\n\n\tOscar category page with rankings>>>Coming Soon\n\n\t\t\n\t\t\t\n\t\t\t\n\tDocumentary Short\n\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\n\n\t“All the Empty Rooms” (Netflix) ***Joshua Seftel and Conall Jones“Armed Only with a Camera: The Life and Death of Brent Renaud” (HBO Documentary Films) Craig Renaud and Juan Arredondo“Children No More: “Were and Are Gone” (Sky) Hilla Medalia and Sheila Nevins“The Devil is Busy” (HBO Documentary Films) Christalyn Hampton and Geeta Gandbhir“Perfectly a Strangeness” (Second Sight Pictures) Alison McAlpine\n\n\tOscar category page with rankings>>>Coming Soon\n\n\t\t\n\t\t\t\n\t\t\t\n\tLive Action Short\n\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tImage Credit: The New Yorker\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\t“Butcher’s Stain” (Tel Aviv University Steve Tisch School of Film and Television) Meyer Levinson-Blount and Oron Caspi“A Friend of Dorothy” (Self-Distributed)Lee Knight and James Dean“Jane Austen’s Period Drama” (Self-Distributed)Julia Aks and Steve Pinder“The Singers” (Netflix) Sam A. Davis and Jack Piatt“Two People Exchanging Saliva” (Canal+/The New Yorker) ***Alexandre Singh and Natalie Musteata\n\n\tOscar category page with rankings>>>Coming Soon\n\n\t\t\n\t\n\t\n\n\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Oscar Predictions: From Inevitable to Unpredictable, How ‘Sinners’ Upended the Race Overnight",
      "image": [
        "https://variety.com/wp-content/uploads/2025/03/Sinners-Oscar-Predictions-1.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-23T03:30:00.000Z",
      "dateModified": "2026-01-23T03:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Harry Styles Hits the Dance Floor on New Single ‘Aperture’",
    "url": "https://variety.com/2026/music/news/harry-styles-hits-the-dance-floor-new-single-aperture-1236638572/",
    "image": "https://variety.com/wp-content/uploads/2026/01/P1162RC2-e1769121182275.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-23T00:07:28.000Z",
    "description": "\n\tA few days after announcing the first single from his new album, Harry Styles has released “Aperture,” the first taste of his upcoming fourth album ",
    "body": "\n\tA few days after announcing the first single from his new album, Harry Styles has released “Aperture,” the first taste of his upcoming fourth album “Kiss All the Time. Disco, Occasionally.”\n\n\t“Aperture,” which Styles previewed for fans at global record stores on Wednesday, is a slow-burning, five-minute tune, kicking off with a throbbing synth line before the percussion kicks in. On the chorus, Styles sings, “We belong together, it finally appears it’s only love.”\n\t\n\n\n\n\n\t“Aperture” arrives just hours after Styles announced his “Together, Together” tour that will see the singer performing 50 dates in seven cities including Amsterdam, London, Sao Paulo, Mexico City, New York City, Melbourne and Sydney. Styles will stage residencies in each location, including a staggering 30 nights at NYC’s Madison Square Garden. The 2026 tour will also feature special guests include Robyn, Shania Twain, Fcukers, Jorja Smith, Jamie xx, Fousheé and Skye Newman across select dates.\n\n\n\tAll of this is pushing towards “Kiss All the Time. Disco, Occasionally,” which Styles announced last week. His fourth album, releasing on March 6, will feature 12 tracks and is executive produced by Kid Harpoon, who previously worked with Styles on his 2022 album “Harry’s House.”\n\n\tThe album was rumored to be in the works for months, and Styles began teasing it with a series of billboards and advertisements in cities from New York to Madrid and Rome. At the end of 2025, he kicked up buzz for the record with the surprise release of a music video for his instrumental “Forever, Forever,” shot at the final “Love on Tour” date in 2023.\n\t\n\n\tStyles last released “Harry’s House” in 2022, spawning the massive hit “As It Was.” That album went on to win the Grammy Award for best album the following year.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Harry Styles Hits the Dance Floor on New Single ‘Aperture’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/P1162RC2-e1769121182275.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-23T00:07:28.000Z",
      "dateModified": "2026-01-23T00:07:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Why ‘Saccharine’ Director Natalie Erika James Made a Horror Film About Disordered Eating: ‘Weight Stigma Permeates Every Facet of Our Culture’",
    "url": "https://variety.com/2026/film/features/saccharine-horror-film-ghosts-eating-disorders-1236638623/",
    "image": "https://variety.com/wp-content/uploads/2026/01/wfvvm16xiSaccharine-Still_2.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-23T01:05:58.000Z",
    "description": "\n\tNatalie Erika James‘ new film “Saccharine” opens with a shot of a jelly donut getting devoured, and then the footage is spun in reverse, with the bl",
    "body": "\n\tNatalie Erika James‘ new film “Saccharine” opens with a shot of a jelly donut getting devoured, and then the footage is spun in reverse, with the bloody-looking goo getting sucked back into the donut. It’s an intentionally disorienting start to James’ new horror film, which is an examination of diet culture.\n\n\t“My aim with the film was to sit the audience within the subjective experience of someone going through disordered eating and a disordered relationship to food,” says writer-director James. “It really swings from that grotesqueness of feeling like it’s too much but not enough, that endless kind of hunger. I wanted to convey that through really visceral shots of food. But it also swings to a glossy, dopamine-fueled space visually as well. Conveying both sides of that was really important.”\n\t\n\n\t“Saccharine,” which is opening on Thursday as part of Sundance’s Midnight section and was acquired by Independent Film Company and Shudder right before the festival, is a horror film that is frightening and provocative in equal measure. The plot concerns a med student named Hana (Midori Francis) who finds out that eating human ash is a shortcut to weight loss. Unfortunately, it also conjures the ghost of the person whose corpse was used for this diet hack.\n\n\n\tJames, whose previous films were the acclaimed 2020 family horror movie “Relic” and the 2024 “Rosemary’s Baby” prequel “Apartment 7A,” says the idea for “Saccharine” came from a personal place.\n\n\t“I grew up with parents who sat on opposite sides of the spectrum in terms of how they relate to their bodies and their relationship to food and eating,” she says. “On one hand, my dad really struggled with food addiction. My mom, almost in response to that, was extremely strict with her diet and very health-conscious. In the midst of that, it feels like meal times are a minefield. I grew up with a lot of warped ideas about body image, as so many of us do. It’s taken a long time to unpack those, and the idea came from that recovery process.”\n\t\n\n\tWhile many artists might not have been able to conceptualize telling Hana’s story through the lens of horror, James says it allows her a malleable canvas for heavy ideas.\n\n\t“I’m drawn to the fear of something dark within ourselves, the shadow self,” she says. “That’s the common thread I’ve found through a lot of my writing. It’s a way to excavate the dark recesses of your heart, or the fears and anxieties that live there. There’s such a freedom in the way you can use horror. It’s very freeing to use surreal imagery and externalize what’s internal through horror.”\n\n\tThe lush look of “Saccharine,” which James visualized alongside cinematographer Charlie Sarroff, drew upon unexpected sources.\n\n\t“We had both ‘candy’ and ‘grime’ as thematic,” she says. “Those pops of color, that slightly neo-noir wash of neons and slightly-stylized lighting, but also keeping the real darkness and grittiness as well. We were even drawing on older Wong Kar-wai films — just for inspiration, obviously not completely imitating them — but going for palettes that paint Hana’s inner world.”\n\n\tUltimately, James hopes that, along with delivering scares, “Saccharine” sparks thought and discussion about society’s complex relationship with food and weight.\n\n\t“The most worthwhile thing in making a film is to hopefully convey an experience that makes people feel seen, see a part of themselves on screen, and make them feel less alone,” she says. “I’m sure there’ll be a lot of discussion about, particularly at the moment, the glamorization of the uber-thinness being glamorized. It’s an important discussion to have, and just how much our diet culture and weight stigma permeates every facet of our culture. That’s the real problem and needs to change.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why ‘Saccharine’ Director Natalie Erika James Made a Horror Film About Disordered Eating: ‘Weight Stigma Permeates Every Facet of Our Culture’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/wfvvm16xiSaccharine-Still_2.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-23T01:05:58.000Z",
      "dateModified": "2026-01-23T01:05:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Carousel’ Review: Chris Pine and Jenny Slate in a Painfully Languid Neorealist Drama of Lonely-Hearts Romance",
    "url": "https://variety.com/2026/film/reviews/carousel-review-chris-pine-jenny-slate-1236638740/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Carousel-Still_1.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-23T02:54:24.000Z",
    "description": "\n\tWho says they don’t make ’em like they used to? “Carousel,” starring Chris Pine and Jenny Slate in a painfully languid neorealist drama of lonely-he",
    "body": "\n\tWho says they don’t make ’em like they used to? “Carousel,” starring Chris Pine and Jenny Slate in a painfully languid neorealist drama of lonely-hearts romance (it’s about love, but more than that it’s all about the agony), is the sort of Sundance movie you might have encountered in the late ’90s — and by that, I’m not suggesting that it would have been a Sundance hit, subject to late-night bidding wars. I mean that it would have been a “sensitive” Sundance bubble movie that got a bit of buzz and then proceeded to go nowhere in the real world. And that would have been 30 years ago!\n\t\n\n\tIn the present day, “Carousel,” with its oblique-chic drama and heavy mood shadow of Cassavetes and Bergman stylings, is a movie without a marketplace. It would get lost in the theatrical world; it will get lost on streaming. The reality is that there is no longer a viable audience for a movie like this one that ambles from scene to scene, that feels like it’s been built out of “actors’ moments” that got woven together in the editing room, that’s bathed in a warm bath of art shadow that makes everything look brown, and that’s overlaid with the kind of lugubrious string-section indie score that, if this is even possible, renders the characters more morose than they already are.\n\n\n\tAnd yet…the lead actors are very good in it. Did I believe that Chris Pine, with his waxed and coiffed Beverly Hills look, is a sad-sack divorced physician who wears a stethoscope around his neck as he runs his quaint office as a general practitioner in Cleveland, Ohio? Not exactly. But as Noah, Pine gives a performance that’s rippled with anger and vulnerability, and he’s such a good actor that he holds the screen. Jenny Slate, wearing a choppy bob that makes her look like she just came from the Amanda Plummer Spa, plays Rebecca, who is some sort of high-powered Washington, D.C., politico who has returned to Cleveland (after the politician she was attached to leaves office) and is now teaching high school. Noah’s daughter is one of the students she’s coaching on the debate team, and she and Noah become involved.\n\t\n\n\tAs it turns out, though, the two grew up together and were already a couple in high school. She left to pursue her career, he got married and had a daughter, and the rest is wistful tormented history. The two pick up where they left off, only now the torment rules. Because does Noah have the faith to believe?\n\n\tThe writer-director, Rachel Lambert (“Sometimes I Think About Dying”), stages moments that look and feel like everyday life, and that requires talent, the kind that Rebecca Miller exhibited when she made “Personal Velocity” (which premiered at Sundance in 2002). But if you’re going to work on that high wire of quotidian experience, you also need to give the audience something to hold onto. “Carousel” feels “authentic,” but it’s also rudderless. And the storytelling, what little there is of it, has an elliptical quality that sometimes leaves you going, “Wait, can you explain that a little more?”\n\n\tFor a while, the drama centers on how Noah’s teenage daughter, Maya (Abby Ryder Fortson), is holding onto a hidden rage at her dad due to her parents’ divorce. She lashes out, at one point cutting her finger in a door (one of those accidents-that’s-really-not), and Rebecca, having taken the girl under her wing, warns Noah that it’s only going to get worse. Then Rebecca comes up with a plan to send Maya to a six-week program at Stanford, and as soon as the girl arrives there…she’s fine.\n\n\tNoah, meanwhile, dropped Maya off at the airport, and in the movie’s strangest sequence he then goes on a cinnamon-roll-and-alcohol bender right there in the terminal, waking up in the Nashville airport. I appreciated the audacity of this sequence, but not so much the way that it wears its audacity on its sleeve. That said, at one point Noah and Rebecca have an extended argument in the kitchen, and it’s a beautifully acted scene, staged with a stinging awareness of how a divorced father like Noah can assert his authority in a way that’s at once justified and utterly desperate. Pine plays this with exquisite understanding, and Slate, in a role shorn of comedy, makes you feel the squirmy misery of being caught in a domestic dispute where there’s no winning position. \n\n\tI should add that the film is also about the primal ambivalence one can have toward renovating and selling the family home. In short, “Carousel” is a flawed drama that can be disjointed, but by the end the movie feels worth it: mannered at times, touchingly real at others. What does the title mean? I have no idea. (Whatever it means, it’s too abstract.) And since the movie is premiering at Sundance, it’s probably destined to be praised in a way that overshadows its quality of hermetic gloom. Only now, the question that does need to be looked at squarely is: Who, exactly, is going to see this?\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Carousel’ Review: Chris Pine and Jenny Slate in a Painfully Languid Neorealist Drama of Lonely-Hearts Romance",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Carousel-Still_1.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-23T02:54:24.000Z",
      "dateModified": "2026-01-23T02:54:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kerry Washington Receives Elevate Foundation Catalyst Award, Boards Pro-Democracy Series ‘Nevertheless’ Season 2 as Executive Producer",
    "url": "https://variety.com/2026/film/news/kerry-washington-nevertheless-elevate-foundation-award-1236638564/",
    "image": "https://variety.com/wp-content/uploads/2024/08/GettyImages-2167977383-e1724375657735.jpg?crop=0px%2C165px%2C4330px%2C2436px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-01-23T02:30:00.000Z",
    "description": "\n\tKerry Washington was honored with the Elevate Prize Catalyst Award at the Democracy on the Screen – and on the Line event Thursday at the Sundance F",
    "body": "\n\tKerry Washington was honored with the Elevate Prize Catalyst Award at the Democracy on the Screen – and on the Line event Thursday at the Sundance Film Festival. The star also announced she’ll be joining the upcoming second season of Elevate Studio’s “Nevertheless” as an executive producer.\n\n\tWith the award, Washington is being recognized for her dedication to advocating for civic engagement and the protection of democratic freedoms. The Elevate Prize Catalyst Award is dedicated to acknowledging figures who use their power and influence to inspire positive global action, providing recipients with $250,000 in unrestricted funding to advance their mission and work. \n\t\n\n\tSpeaking with Variety, Washington said, “It’s so exciting because it’s about turning the spotlight toward organizers and community leaders, and that’s really how I’ve tried to use my platform. We have supported local grassroots organizations who know their communities best, and we help their message reach farther. We help them tell their story and tell it more effectively and in traditional media and social media, and so this Catalyst Award is really allowing me to continue to direct resources toward leaders and initiatives that strengthen our democracy and making sure that the people who are holding the line for all of us, that they have to see what they need to keep going.”\n\n\tA docuseries by the Elevate Prize Foundation’s storytelling and production arm, the upcoming season of “Nevertheless,” titled “Nevertheless: Democracy Defenders,” will spotlight grassroots leaders, shining a light on those going up against rising polarization, growing threats to civil liberties and democratic backsliding around the world. Among those featured on the season are: Koketso Moeti, Founding Executive Director of amandla.mobi, which mobilizes communities across South Africa to hold power to account through mobile-first civic activism; Yordanos Eyoel, Founder of Keseb in Boston, advancing inclusive democracy initiatives across the United States, South Africa, and Brazil; Hannah Fried, Executive Director of All Voting is Local in Washington, D.C., who leads efforts to protect voting rights and expand equitable access to the ballot nationwide, and Imran Ahmed, Founder and CEO of Center for Countering Digital Hate, who leads efforts to protect human rights and civil liberties online.\n\t\n\n\tSpeaking about the series, Washington said, “This series is really exciting, because we are always living in the truth that every single person is the hero of their own story, right? And that every story deserves to be told, that people from every walk of life are seen and heard and empowered to be heroes of their life and their community and their world.” \n\n\tShe went on to say te series puts a spotlight on everyday citizens who are making efforts to “protect us all.” In season 2, Washington says, these are the people who are doing this work, often without any recognition, and at very serious personal cost and risk. She added, “This storytelling is important because it shows democracy as something that is practiced, something that’s worth fighting for. And it really elevates – pun intended – the phenomenal organizers as the heroes.”\n\n\tIn a statement, Carolina Garcia Jayaram, the CEO of the Elevate Prize Foundation, said, “Kerry Washington truly embodies what it means to be a catalyst. Through her powerful storytelling on screen and her fearless activism off it, she challenges the status quo, amplifies underrepresented voices, and sparks conversations that demand change. In just a decade, she has built an award-winning company that not only produces compelling stories but also creates platforms for social impact, proving that creativity and conscience can drive culture forward. Kerry reminds us that stories shape culture, culture shapes power, and when told with intention, storytelling becomes a form of civic engagement that moves us toward a more just and inclusive world.”\n\n\tFounded in 2019 by businessman and philanthropist Joseph Deitch, the Elevate Prize Foundation is a nonprofit with the mission to Make Good Famous. Elevate Studios was launched in 2025 to finance and distribute purpose-driven content. In addition to the Elevate Foundation Catalyst Award, the foundation also operates the Get Loud Award, which provides   a monthly grant to fuel grassroots movements and build power among communities.\n\n\tPast recipients of the Elevate Foundation Catalyst Award include Dwyane Wade, Michael J. Fox, Matt Damon, George and Amal Clooney, Sesame Street Workshop and Malala Yousafzai.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kerry Washington Receives Elevate Foundation Catalyst Award, Boards Pro-Democracy Series ‘Nevertheless’ Season 2 as Executive Producer",
      "image": [
        "https://variety.com/wp-content/uploads/2024/08/GettyImages-2167977383-e1724375657735.jpg?crop=0px%2C165px%2C4330px%2C2436px&resize=1000%2C563"
      ],
      "datePublished": "2026-01-23T02:30:00.000Z",
      "dateModified": "2026-01-23T02:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chris Pratt Pitched Marvel a ‘F—ing Great’ Idea for Star Lord’s Return and Sent James Gunn a Photo Wearing a Batman Mask: ‘I Photoshopped It’ and He Laughed",
    "url": "https://variety.com/2026/film/news/chris-pratt-pitched-marvel-star-lord-return-james-gunn-batman-1236638281/",
    "image": "https://variety.com/wp-content/uploads/2026/01/MCDGUOF_EC227.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-23T00:21:08.000Z",
    "description": "\n\tChris Pratt appeared on the “Happy Sad Confused” podcast on his press tour for “Mercy” and revealed that he has a “fucking great” idea for how to br",
    "body": "\n\tChris Pratt appeared on the “Happy Sad Confused” podcast on his press tour for “Mercy” and revealed that he has a “fucking great” idea for how to bring Star Lord back to the Marvel Cinematic Universe. What that idea is remains under wraps. Pratt last played Peter Quill/Star-Lord in 2023’s “Guardians of the Galaxy Vol. 3,” which promised via credits scene text that Star Lord would return. \n\n\t“I’m happy to do anything they want me to do and will,” Pratt said about Marvel. “And also, I personally have a really strong vision of what I would want him to do. And I think it’s fucking great.” \n\t\n\n\tWhen asked if he pitched this idea already to Marvel Studios boss Kevin Feige, Pratt responded: “Yep. And I think that, you know, I’m down to contribute any way I can to them setting up the next 10 years of storytelling, you know? And also, I have a pretty strong idea of how I think I could contribute to that.”\n\n\n\tIt remains to be seen whether or not Pratt’s Star Lord pops up in “Avengers: Doomsday” or “Avengers: Secret Wars,” although he was not included in the official cast announcement for the former Marvel tentpole. James Gunn directed Pratt in all three “Guardians” movies but has since moved on to oversee DC Studios with movies such as “Superman” and its upcoming sequel “Man of Tomorrow.”\n\n\t“In a dream world, it would be somehow James,” Pratt said of who would direct a new movie with Star-Lord. “But I don’t think that’s likely to happen. So I’d have to think about who would be the right director. There are amazing directors out there.”\n\n\tPratt remains close with Gunn. The actor said he even sent the director a photo of himself with a Batman mask photoshopped onto his face as an impromptu pitch to play the Dark Knight in “The Brave and the Bold,” which will introduce Batman into Gunn’s DC Universe.\n\t\n\n\t“I did it in photoshop and [James] just said, ‘Haha,'” Pratt said. ‘It’s safe to say I am not going to be Batman.”\n\n\tWatch Pratt’s full interview on the “Happy Sad Confused” podcast in the video below.\n\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chris Pratt Pitched Marvel a ‘F—ing Great’ Idea for Star Lord’s Return and Sent James Gunn a Photo Wearing a Batman Mask: ‘I Photoshopped It’ and He Laughed",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/MCDGUOF_EC227.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-23T00:21:08.000Z",
      "dateModified": "2026-01-23T00:21:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "TikTok U.S. Joint Venture Deal Closes, Former Warner Bros. Exec Adam Presser Named CEO",
    "url": "https://variety.com/2026/digital/news/tiktok-us-joint-venture-deal-closes-adam-presser-ceo-1236638722/",
    "image": "https://variety.com/wp-content/uploads/2025/08/TikTok.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-23T01:56:29.000Z",
    "description": "\n\tByteDance has closed a deal to form TikTok U.S., a joint venture that is majority-owned by American investors — finally bringing the popular video a",
    "body": "\n\tByteDance has closed a deal to form TikTok U.S., a joint venture that is majority-owned by American investors — finally bringing the popular video app into compliance with a U.S. law that went into effect last year.\n\n\tIn the U.S., more than 200 million individuals and 7.5 million businesses use the app, according to the company. The TikTok U.S. JV will “operate under defined safeguards that protect national security through comprehensive data protections, algorithm security, content moderation, and software assurances for U.S. users,” the company announced Thursday.\n\t\n\n\tThe new American company, formally called TikTok USDS Joint Venture, has three managing investors: Silver Lake, Oracle and Abu Dhabi’s state-owned investment firm MGX MGX, each holding 15%.\n\n\n\tThe rest of the consortium of investors are: Dell Family Office, the investment firm of Michael Dell, Founder, chairman and CEO of Dell Technologies; Vastmere Strategic Investments, an affiliate of Susquehanna International Group; Alpha Wave Partners; Revolution; Merritt Way, controlled and managed by partners of Dragoneer; Via Nova, an affiliate of General Atlantic; Virgo LI, investment arm of a foundation established by Yuri and Julia Milner in support of science; and NJJ Capital, the family office of Xavier Niel, a French entrepreneur and pioneer in telecommunications. \n\n\tBeijing-based ByteDance retains 19.9% of the joint venture. With the deal, ByteDance and TikTok will come into compliance with the U.S.’s TikTok divest-or-ban law, which prohibits distribution in the U.S. of any app that is more than 20% owned by a “foreign adversary” (in this case, China). The law passed with strong bipartisan support, with American lawmakers uniting over national security concerns. The fear was that TikTok could be used by the Chinese government to spy on Americans or spread propaganda. \n\t\n\n\tTikTok U.S. will be led by Adam Presser, who was appointed as CEO by the JV’s board as one of its first actions. Presser, who is based in L.A., previously was head of operations and trust and safety for TikTok. Prior to joining TikTok in April 2022, Presser held roles at WarnerMedia, including EVP of WarnerMedia International and head of WarnerMedia China, Australia & New Zealand. Before that he worked at Warner Bros. Entertainment, most recently as SVP of international.\n\n\tThe JV’s management team also includes chief security officer Will Farrell, who before joining TikTok in 2020 held roles at consulting firm Booz Allen Hamilton.\n\n\tMembers of the board of TikTok U.S. joint venture includes Shou Chew, who is CEO of TikTok.\n\n\tThe content algorithm used by the TikTok U.S. joint venture will be managed separately from the algorithm used by the TikTok app in the rest of the world. The JV will “retrain, test and update the content recommendation algorithm on U.S. user data. The content recommendation algorithm will be secured in Oracle’s U.S. cloud environment.”\n\n\tThe American version of TikTok will maintain global “interoperability,” ensuring that “U.S. creators can be discovered and businesses can operate on a global scale,” according to the company. TikTok global’s U.S. entities will manage global product interoperability and certain commercial activities, including e-commerce, advertising and marketing.\n\n\tThe safeguards provided by the TikTok U.S. joint venture will also cover CapCut, Lemon8 and a portfolio of other apps and websites in the U.S.\n\n\tThe U.S. government’s TikTok divest-or-ban law went into effect Jan. 19, 2025. However, President Trump issued five executive orders last year that delayed enforcement of the ban by the Justice Department while the administration tried to hammer out the deal to transfer majority ownership to U.S.-based investors.\n\n\tTrump, in the final months of his first administration, tried unsuccessfully to ban TikTok unless its ownership was transferred to U.S. companies, also over national security concerns. After he won the 2024 election, Trump said, “I have a warm spot in my heart for TikTok,” because “there are those who say” the app helped drive support for him among young voters.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "TikTok U.S. Joint Venture Deal Closes, Former Warner Bros. Exec Adam Presser Named CEO",
      "image": [
        "https://variety.com/wp-content/uploads/2025/08/TikTok.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-23T01:56:29.000Z",
      "dateModified": "2026-01-23T01:56:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Eddie Izzard on Bringing ‘Hamlet’ to L.A. as a One-Person, 23-Character Show, After 200 Global Performances: ‘I Want to, as a Trans Person, Give Honor to All the Characters’",
    "url": "https://variety.com/2026/theater/news/eddie-izzard-hamlet-solo-los-angeles-theater-interview-1236638008/",
    "image": "https://variety.com/wp-content/uploads/2026/01/AS204454_F2_AMANDA-SEARLE-e1769130405641.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-23T01:08:18.000Z",
    "description": "\n\t“Comedy is my day job,” says Eddie Izzard. “Shakespeare started with his comedies, then he moved to his dramas and tragedies, and that’s what I’m do",
    "body": "\n\t“Comedy is my day job,” says Eddie Izzard. “Shakespeare started with his comedies, then he moved to his dramas and tragedies, and that’s what I’m doing.”\n\n\tEven the Bard might have to step back marvel at the malleability of Izzard on her current global tour, though, as Izzard moves not just from comedy into the realm of Elizabethan drama, but shifts through 23 different characters, in a one-person production of “Hamlet.” With a couple hundred shows already under their belt on the tour, she’s bringing the show to L.A.’s Ricardo Montalbán Theatre for seven performances, starting with a preview Thursday night and official opening Friday, running at the Hollywood venue through Jan. 31. (Tickets are available here.)\n\t\n\n\tIs it madness — doing what many consider the greatest ensemble drama of all time as a solo show — or is there method in it? No one will accuse Izzard of not having done her homework on every aspect of the historical backdrop of the show, as well as having done the difficult work of imagining the blocking and voicing that will help an audience keep all those characters straight. Izzard had some experience with a one-person production, first having done it with an adaptation of “Great Expectations” that similarly traveled around the world. Now, there’s no definite end in sight for Izzard’s “Hamlet,” with the actor having too good a time to not keep adding cities to the run. Reviews and accolades in prior engagements have been enthusiastic, including nominations from the New York Outer Critics Circle and the New York Drama League for a run back east.\n\t\n\n\tPrior to coming to L.A., the Tony-nominated, Emmy-winning performer (who is billed as just Eddie Izzard for this appearance but also privately goes by Suzy Eddie Izzard) Zoomed with Variety to talk about both the practical and theoretical underpinnings of this challenging achievement. (After L.A., the show moves on to Austin, Toronto, Philadelphia and Washington, D.C.; see dates here.) The following Q&A has been edited for length and clarity.\n\n\tDo you have a count of how many times you’ve done this “Hamlet” now?\n\n\tIt’s 205 now. It is soaring on, and it’s about 50,000 tickets sold. Some people are going, “Oh, this is most unusual.” It’s not that unusual. A lot of people are doing solo shows all around the world. I like the idea of taking Shakespeare around the world — we’re  negotiating taking it to India, and Australia is this year as well, and the third leg of the tour of America. I just think it is a wonderful thing to do. I hope that Shakespeare would approve.\n\n\tAs you say, one-person shows are not totally uncommon, but the sheer amount of characters you play seems like it might be more taxing on you than perhaps someone who’s doing a monologue-type show. Is there any weariness that sets in when you’re doing two hours a night of all those characters?\n\n\tIt is a tough show. But when you mention people doing monologues, I mean, these are full shows that other people are doing, playing multiple characters, so I am really in the same bracket as them. So it’s as taxing as for them as it is for me. You have to be totally on top of it because it’s yourself out there for two hours. But it does mean that people can concentrate more on the text rather than saying, “Who’s wearing what costume?” You can really focus in on the story and the text and the wonderful poetry of Shakespeare. So I think that’s something which is unusual and gives it an interesting focus in that way. So I’ve been looking forward to getting back out there. That’s the odd thing. Because maybe now you’d be thinking, “Do you wanna keep doing this thing?” Yeah, I do. Every night is press night — that’s how I feel. It is tiring. If you got ill and did it, then I think it’d be really tricky. But I’m loving doing it, so I just wanna continue.\n\n\tYou said you wanted to pay special attention to the female characters.\n\t\n\n\tAbsolutely. I just want to, a trans person, give honor to all characters. You know, trans is getting such a buffeting at this time. But on a positive side, when I came out 40 years ago, January ‘85, no one was talking to us at all. We were just non-people. So even though there’s buffeting, even though there’s loud voices raised, left, right, and center, trans people exist. We’re not going anywhere, so it’s good to be out there. And people get obsessed about male/female. But most people who are thinking people see everyone somewhere on a spectrum. So to get out there and play classically male characters, classically female characters, it’s an intriguing thing to do. And as a trans person, as someone who’s gender-fluid, I don’t see much difference in my own personality, between a male version of me or a female version of me. It’s just me. It’s slightly more of a presentation to people or how people see me. But, yeah, to be the best version of Ophelia that I can be, the best version of Gertrude that I can be, is a wonderful challenge. So I go for it.\n\n\tIt’s funny that there’s so much Hamlet in the air now, in popular culture. Taylor Swift, named her single “The Fate of Ophelia,” which got young people looking the character up. Of course there’s the “Hamnet” movie now, which ends with a version of “Hamlet” that has been condensed into about 10 minutes. L.A. just had a very experimental adaptation of “Hamlet” at the Mark Taper Forum where the play was condensed into one hour, and then the second hour was a sort of modern-day sequel. In all, it’s a play that comes back and resonates for people, and it’s maybe just coincidental that there’d be some of that in the air at the time you have chosen to do this.\n\n\tIt is odd. I keep noticing it. I’m thinking, does this help me or hinder me? I think it helps. If there’s more “Hamlet” out and people saying, “Let us revisit, let us look at this,” and people coming from completely different directions on it, I think that’s kind of wonderful. And it has lasted for so long. “Hamlet’s” in the ether at the moment, so I’ll just keep riding that wave.\n\n\tWhat was most attractive to you about doing this? Was actually doing all those Hamlet soliloquies kind of the main attraction, or was it more about performing the 23 roles in one fell swoop?\n\t\n\n\tWell, it’s more actually just doing Shakespeare. It didn’t have to be “Hamlet.” I was a severely, atypically dyslexic kid, so I had great difficulty just reading off the page. But I was someone who was, from the age of 7, saying, “I really want to act,” trying to get into school plays desperately. Even with standard, modern-day text, I found that tricky, getting it from the page through my brain and out of my mouth. So I was always intimidated by Elizabethan verse and by Shakespeare. As time went on, I decided to concentrate on comedy. Then I started pushing into my dramas and going through Broadway and onto the dramatic films. But I really wanted to do Shakespeare. I wanted to really challenge myself. I considered “Richard III” and considered others where I could start. It was a fact that, because my career has been so unusual, I was not on top of everyone’s list (for Shakespearian productions). And I’m trans as well, so I’m just such an unusual person, putting everything together — I don’t think people say, “We’ve gotta build (a show) around this person.” It’s a very high bar. No one was that keen on putting me forward to do it.\n\n\tSo I just thought, “Well, I’ll do this myself.” When “Great Expectations” took off and worked so well, it came from something that I was already doing, performing against myself, something I had been doing in my comedy. I realized it could work for drama as well as it could work for comedy. I just decided, “Let’s do ‘Hamlet.’” And I could do that without getting permission from other people or making sure that they were setting the budgets for that. I wanted to do Shakespeare and I wanted to go towards this thing that had scared me as a teenager.\n\n\tAs you say, going back and forth between different characters is something that you have done as part of your comedy, so that didn’t feel like a totally unfamiliar thing. You had to figure out how people will understand that you’re shifting personas here.\n\n\tIn the first five, 10 minutes, some people do go — well, maybe most people go — “What are you doing here?” I haven’t watched everyone else’s solo shows, but sometimes they’re using screens, they’re using recorded videos. They’re talking to themselves as other characters on screens or videos or however they’re doing it. I’m playing it where I’m flipping and changing physicality, changing a voice. Not overtly, not in a caricatured way, but in a subtle way. And gradually, I feel the audience will pick up on who the character I’m playing is. And there are guides to that. And maybe we mention people’s names more often. You drop in a “Yes, Horatio.” …\n\t\n\n\tBasically you’re obeying Shakespeare’s script, however you’ve adapted it. But the bottom line is to be truthful in all your performances and all the arcs of the characters that you’re driving them through, and hopefully the audience can grab it. I’m sure some people are going, “I cannot get this. How this works is unusual to me.” It’s not for them. But, you know, we’re up to 50,000 tickets now, so people are coming back a second or third time, so I know it works. And I also have had so much experience, not just on stage — I spent four years as street performer. And if you think of Shakespeare’s actors, their training must have been pretty similar to that training, because they were not going to drama school. Just one generation before “Hamlet” was written, they were performing at festivals and fairs and market days, and then the Curtain Theater was built in the late 1570s, and this is only 1600, so it’s so close. At the Globe Theater in London, keeping everyone focused and interested was a tricky thing to do. My training has been through all that, so I know I can do something on stage which is a little unusual for most actors, and I bring all those skills to bear in every performance.\n\n\tAnd, yeah, no screens, and it works, but they have to tune into what I’m doing. I’ve worked very hard with my movement director, Didi Hopkins, who’s steeped in commedia dell’arte, to make these transitions between characters so that people can feel there is a sharp difference between them, as opposed to a confusing difference between them. I’m crisp on the architecture. If I move one character to another character, when I move back to that first character, they will not be somewhere else on the stage, they will be back where you left them. And that’s something I’ve been very dogmatic on. That must happen so that if Gertrude wanders across the stage, talking about the fact that her previous husband has died and then they pass through to eternity, Hamlet will be in the same place when you flip around.\n\n\n\n\t\n\n\t\t\t\t\tEddie Izzard in “Hamlet”\n\t\t\t\t\t\t\t\t\tCarol Rosegg\n\t\n\n\n\n\tDo you have a favorite character to play apart from Hamlet?\n\n\tOphelia is wonderful to play — the twin soul of Hamlet, some people say. The women are underwritten; Gertrude is underwritten. So as a trans person, I’m very keen to land those characters, separate ’em, and land them as well as I can, because I just feel they’re underwritten by Shakespeare. Claudius is someone who has a great [sweep in his arc and eventually is confessing to the audience, or to God, that he did it. it’s just an interesting thing to track him, trying to play him as magnanimous as possible. And Rosencrantz and Guildenstern, I play as hand puppets, and that is an unusual thing to do. Hamlet, I feel, is really pleased but confused to see them at the beginning, and he’s gradually unraveling the lies behind what they’re there for.\n\t\n\n\tIt’s interesting that conscience seems to be the main thing that I feel that underpins the whole thing. He has to be happy with his conscience, Hamlet, as he drives through. I grew up thinking: How did people look at religion years ago, say, back in the 1590s, when this was written or back in the 1000s, when it takes place. They’re all saying that conscience is the thing that you should be judging things on, so if you’re good with that… He’s talking about these Catholic ideas, even though he is in a new Protestant country. In the Elizabethan country, purgatory should not be happening in the lexicon, but he’s talking about the old days, so he can get away with it. And I think he probably was a secret Catholic. But Hamlet (believes he) can get to heaven because he’s had these people killed, but they were trying to kill him, so that’s fair, and he can argue at the pearly gates, or wherever it is you had to argue in those days. But they were thinking of it just like us: At the beginning of the play, they’re saying there aren’t any ghosts. Then, oh my God, there are ghosts! That’s how we are right now. It feels quite modern, how it is. … The audience watching must have been half of them Catholic, half of them not Catholic, some of them lip-service Protestants — a complete spread. It’s almost “Game of Thrones” when they talk about the old gods and the new. This was really a time of the old gods and the new, even though it was one God. It was all the old ideas and the new ideas. The amount of bloodletting that happened between the Catholics and the Protestants over the idea of how you should interpret the scriptures tragic. But all this rolls into a play where conscience is king.\n\n\tThe way I feel it, it could well be is that Hamlet’s personality personality is quite close to Shakespeare’s. Shakespeare’s a kid who didn’t go to university, who had this chip on his shoulder trying to work his way to the upstart crowd, trying to get his way through. When he dies, there isn’t a great triumphal parade. He isn’t taken as the great person. He doesn’t get all his plays published, which is really odd, in the first folio…\n\n\tSo in the end you have to serve that story, serve that play, and make it work for the for the public. And we’re very keen on that so that kids from 9 to 90 can come in and enjoy the beauty of the poetry, and see a storyline that isn’t so confusing. Because it is quite confusing, at times — what he does with going to England and then not going to England. ..The fact that number of things in the play happen off-stage… The whole pirate fight is off stage. The sort of semi-rape of Ophelia, that is a reported story. An unusual way to do a play. But he did it, and so we interpreted it as we see it.\n\t\n\n\tThere are so many different ways to play Hamlet, but it sounds like you are very sympathetic to the character at least.\n\n\tI feel very happy playing Hamlet. I have lived a life that has been through so many different phases and challenges that I felt very happy to take on his challenge. But the procrastination of him, I found fascinating, and the self-questioning. You say, “Well, what am I doing? I’m not bloody doing anything,” and he isn’t. He just isn’t getting it done. Then he kills Polonious, and what he does to Ophelia is disgusting; it is overtly horrific. … And regime changes happen. So playing him as mad, okay. It’s a trope that had happened before many times, and we see that down the ages. But then to take it out on Ophelia, and then when she’s died, to be at the funeral saying, “I loved her 40,000 times more than you.” Well, we weren’t seeing any of that, mate, because you weren’t doing that! So to track a human being through Hamlet is really a tough thing to do. You hope you can bring the audience with you on that character. He’s the trickiest to land.\n\n\tBut Ophelia dying, she has this song to sing, as she is going, as she is coming apart at the seams, and playing that is very affecting. The way we’ve chosen to do it is, she doesn’t really get going into the song, but she does sing as beautifully as she can, as beautifully as I can sing, with a control to her voice. But it is more like a broken record that she’s playing. So each night I do delight in all the characters. … Gertrude — didn’t she sense that something was weird, that he suddenly died. Were a lot of serpents biting people in those days. I don’t know, in Denmark, it seemed rather cold. Were there lots of snakes around? There’s so many questions in it. It’s so tricky and you can take it so many different ways. So you make your choices and you dive in and go for it.\n\n\tThere is a thing that any actor could feel if, going into it multiple times — you know, 10, 50 performances, a hundred, 150, and I’m over 200 now — that you could lose the joy, lose the passion of it. But it’s not happening and I’m happy to keep bringing it around the world.\n\n\tIs there anything you think might feel different in how you bring it to L.A.?\n\n\tNot necessarily, because I tend to try and pull the audience to me, as opposed to saying, “You are a Los Angeles audience. So I better be aware of that.” I would not have been that way whether I’m playing Los Angeles or I’m playing Sydney Opera House, as we’re doing next year, or Oakland or London or Manchester or France. I will pull that audience to my performance. I feel that’s the way every actor should do that.\n\t\n\n\tBut I’m looking forward to the Montalbon. I was last there, I think, with Robin Williams, performing with him at a benefit performance. It’s nice to be back there. And Ricardo Montalban’s a very interesting guy. I was just watching an episode of “Columbo” with him, a really fine performance. Ricardo Montalban is probably been known for “The Wrath of Khan.” But I could just see he must have had big status back in Mexico and then was someone who was breaking through in Los Angeles at whatever level he could, even though, at the time, probably they weren’t gonna build an entire film around him. Anyway, there’s such a history in that building. I will try and pull Los Angeles to me, as opposed to tailoring it to anyone, and say, “Come and see where my imagination has taken this, and our work has taken this.”\n\n\tYou’ve developed a great Shakespearian scholarship, it seems.\n\n\tIf you know anything about my standup, you know I’m a history savant. I inhale history, because I do feel the repetitions of human beings. Our brain pan size has been the same for a hundred thousand years or more. So the brightest, most interesting humans on the planet have had this ability to look at the world, to study, to articulate, in many fine ways down the centuries. And so to reach back into what this guy, William Shakespeare, was doing… Was he gay? Was he Catholic? Was he lying about things in his life? He didn’t go to university. He must have been pissed off about that. And going from his comedies to his tragedies, that journey, which I’m now just following in his footsteps, I find that fascinating. And so to be going through, traveling through his mind, and out into the audience…\n\n\tAnd particularly having this thing of the four years I worked on the street, that put me in such an unusual place, which I’m very happy to get where I can do the soliloquies to the audience. If you watch online, you can see Richard Burton in his famous “Hamlet,” where he seems to be performing at his soliloquies at the audience, rather than to them. But I think it is necessary to do these where you really are talking to them. I see them as the Greek chorus of Hamlet’s mind, and that’s how I talk to the audience: they’re on my side. They’re my gang. So that’s how I will do these soliloquies to them.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Eddie Izzard on Bringing ‘Hamlet’ to L.A. as a One-Person, 23-Character Show, After 200 Global Performances: ‘I Want to, as a Trans Person, Give Honor to All the Characters’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/AS204454_F2_AMANDA-SEARLE-e1769130405641.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-23T01:08:18.000Z",
      "dateModified": "2026-01-23T01:08:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Video Allegedly Shows Comedian Corey Holcomb Punch Female Comic in the Face",
    "url": "https://www.tmz.com/2026/01/22/comedian-corey-holcomb-video-punch-face-cristina-payne/",
    "image": "https://imagez.tmz.com/image/15/16by9/2026/01/23/15bf6c10176a4c18846fbd7e0941e33c_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-23T03:47:33.000Z",
    "description": "\n    \n                    \n                          Corey Holcomb\n                          No Punchline, All Punch to Female Comic's Face\n          ",
    "body": "\n    \n                    \n                          Corey Holcomb\n                          No Punchline, All Punch to Female Comic's Face\n                      \n                  \n                                                                        Published \n                              January 22, 2026\n                            7:47 PM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          There's nothing funny about what comedian Corey Holcomb appears to do in this video ... socking a woman right in the face, igniting a Hollywood street brawl.\n      \n    \n        Waiting for your permission to load the Instagram Media.\n      \n    \n          The surveillance video allegedly shows Corey and female comic Cristina Payne jawing at each other outside the Hollywood Improv -- as a large group of people watched -- and then, suddenly, he unloads a right jab to her face.\n      \n\n          TMZ broke the story when this all went down in December 2024. Law enforcement sources told us Corey had punched her over a months-long feud between the comedians. This video -- obtained by The Bizi Room -- plays out exactly as the incident was described to us.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Immediately after Corey punches Cristina, a bunch of guys jumped him, slammed him to the ground and, apparently, beat on him until he was able to escape.\n      \n    \n          Cristina filed a battery report with LAPD, but Corey was never arrested. In fact, 2 months later he attempted, but failed, to get a temporary restraining order against her ... claiming Cristina put hands on him first, while his back was turned to her.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Corey claimed she also trash talked him, saying ... \"Your mama's a bitch,\" and \"Your d**k ain't s**t.\"\n      \n    \n          He clearly knew this video existed, because in court docs he accused Cristina of giving TMZ a clip that only showed his aggression and not hers. We never published, or even received, any such video.\n      \n    \n          We've reached out to him to see if his story's changed ... no word back yet.\n      \n      \n              \n          \n                          \n                Corey Holcomb\n              \n                          \n                Hip Hop\n              \n                          \n                CELEBRITY JUSTICE ™\n              \n                          \n                Celebrity Feuds\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Video Allegedly Shows Comedian Corey Holcomb Punch Female Comic in the Face",
      "image": [
        "https://imagez.tmz.com/image/15/16by9/2026/01/23/15bf6c10176a4c18846fbd7e0941e33c_xl.jpg"
      ],
      "datePublished": "2026-01-23T03:47:33.000Z",
      "dateModified": "2026-01-23T03:47:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bikini Babes In Cowboy Hats Guess Who ... Yeehaw!",
    "url": "https://www.tmz.com/2026/01/22/bikini-babes-cowboy-hats-guess-who/",
    "image": "https://imagez.tmz.com/image/a3/16by9/2026/01/22/a35f155d34c44078acf86676beca85a6_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-23T00:00:52.000Z",
    "description": "\n    \n                    \n                          Bikini Babes In\n                          Cowboy Hats\n                          Guess Who ... Yee",
    "body": "\n    \n                    \n                          Bikini Babes In\n                          Cowboy Hats\n                          Guess Who ... Yeehaw 🤠!\n                      \n                  \n                                                                        Published \n                              January 22, 2026\n                            4:00 PM PST\n                                                                            \n      \n    \n      \n        \n              \n    \n    \n          If this hot shot doesn't have you shakin' in your boots, it's time to pick up the pace and put those celeb skills to the test! Can you guess who this beachside babe is?!\n      \n    \n          She started modeling back in 2013 ... and scoring Sports Illustrated is definitely a career highlight for this baddie!\n      \n    \n          Hit the gallery for the reveal!\n      \n      \n      \n          \n            \n              \n                \n                Share on Facebook\n              \n            \n            \n              \n                \n                Share on X\n              \n            \n                          \n                \n                  \n                \n              \n                      \n        \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Hotties & Bodies\n              \n                          \n                Hot Bodies\n              \n                          \n                Guess Who\n              \n                          \n                Photo Galleries\n              \n                      \n        \n          \n  ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bikini Babes In Cowboy Hats Guess Who ... Yeehaw!",
      "image": [
        "https://imagez.tmz.com/image/a3/16by9/2026/01/22/a35f155d34c44078acf86676beca85a6_xl.jpg"
      ],
      "datePublished": "2026-01-23T00:00:52.000Z",
      "dateModified": "2026-01-23T00:00:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jaime King's Husband Austin Sosa Files For Divorce",
    "url": "https://www.tmz.com/2026/01/22/jaime-king-austin-sosa-files-divorce/",
    "image": "https://imagez.tmz.com/image/5f/16by9/2026/01/23/5f99b84e00b9417799e066b735f84ff6_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-23T02:13:21.000Z",
    "description": "\n    \n                    \n                          Jaime King\n                          Second Husband Files For Divorce\n                      \n    ",
    "body": "\n    \n                    \n                          Jaime King\n                          Second Husband Files For Divorce\n                      \n                  \n                                                                        Published \n                              January 22, 2026\n                            6:13 PM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Jaime King's second husband, banker Austin Sosa, is withdrawing from their marriage ... because he just filed for divorce.\n      \n    \n          Austin beelined it to court Thursday and filed to divorce Jaime ... according to online records.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          The reason for the split is unclear ... but the divorce filing comes just weeks after there were reports linking Jaime to another man, hotel owner Vikram Chatwal.\n      \n\n          For her part, Jaime reportedly denied she was seeing Vikram, insisting their hangouts in Los Angeles were all business ... but that didn't stop Austin from pulling the plug.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Seems Jaime and Austin got married in a secret wedding ... no one even knew they were hitched ... back in July, reports emerged that Jaime and Austin were engaged.\n      \n    \n          No word on a date of marriage or date of separation because the divorce docs are not available yet ... we're working on it.\n      \n    \n          Jaime and Austin did NOT have any kids together ... so no child custody or support issues to hash out here.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          It's the second divorce for Jaime ... in September 2023, she finalized a nasty divorce from her first husband, Kyle Newman.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Jaime King\n              \n                          \n                Celebrity News\n              \n                          \n                Celebrity Divorce\n              \n                          \n                Exclusive\n              \n                          \n                Models\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jaime King's Husband Austin Sosa Files For Divorce",
      "image": [
        "https://imagez.tmz.com/image/5f/16by9/2026/01/23/5f99b84e00b9417799e066b735f84ff6_xl.jpg"
      ],
      "datePublished": "2026-01-23T02:13:21.000Z",
      "dateModified": "2026-01-23T02:13:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Barron Trump Saves Woman Getting Brutally Beaten By Ex-Boyfriend",
    "url": "https://www.tmz.com/2026/01/22/barron-trump-saves-woman-from-attack/",
    "image": "https://imagez.tmz.com/image/e6/16by9/2026/01/22/e6d1769c0cf04475af7ad695f78232b9_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-22T14:01:43.000Z",
    "description": "\n    \n                    \n                          Barron Trump\n                          Swoops In To Save Female Friend From Violent Ex!!!\n       ",
    "body": "\n    \n                    \n                          Barron Trump\n                          Swoops In To Save Female Friend From Violent Ex!!!\n                      \n                  \n                                                                        Published \n                              \n                January 22, 2026\n                \n                            6:01 AM PST\n                                                                      |\n                                                                Updated \n                                  January 22, 2026\n                                3:41 PM PST\n                                    \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          It's Barron Trump to the rescue!\n      \n    \n          That's right ... President Trump's son saved a woman who was getting savagely beaten by her ex-boyfriend in London, England.\n      \n    \n          Here's the scoop ... Barron received a FaceTime call from the woman, whose ex, Matvei Rumiantsev, was using her as a punching bag during the attack last January, according to the victim, who testified in court Wednesday. The victim said Rumiantsev became jealous of her friendship with Barron -- triggering the assault.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Barron's call to emergency service was played in the courtroom and you can hear him talking to a dispatcher without identifying himself.\n      \n\n          Barron tells the dispatcher, \"I just got a call from a girl I know. She’s getting beaten up.\" Barron then provided her address and cops responded to the scene.\n      \n    \n          The victim told police she was friends with Barron, and one officer can be heard in body cam footage saying that the emergency caller is likely to be Donald Trump’s son.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          The officers then phoned Barron to confirm ... and he explained that he received a call from his friend, whom he first met on social media. He said his friend was crying and \"getting really badly beat up\" for 10 to 15 seconds.\n      \n    \n          Barron said he contacted the police because he felt it \"was the best thing I could do.\" He noted that he wasn't going to call his friend back and threaten the man assaulting her, believing it would have made the situation worse.\n      \n    \n          Big save by Barron.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Barron Trump\n              \n                          \n                Politics\n              \n                          \n                Fairly Legal\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Barron Trump Saves Woman Getting Brutally Beaten By Ex-Boyfriend",
      "image": [
        "https://imagez.tmz.com/image/e6/16by9/2026/01/22/e6d1769c0cf04475af7ad695f78232b9_xl.jpg"
      ],
      "datePublished": "2026-01-22T14:01:43.000Z",
      "dateModified": "2026-01-22T14:01:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Dr. Terry Dubrow Sued by Ex-Patient for Alleged Negligence, He Denies It",
    "url": "https://www.tmz.com/2026/01/22/dr-terry-dubrow-sued-former-patient-negligence/",
    "image": "https://imagez.tmz.com/image/8d/16by9/2026/01/22/8dc1d324378840ff98d0ace6174bd2aa_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-22T21:19:51.000Z",
    "description": "\n    \n                    \n                          Dr. Terry Dubrow\n                          Ex-Patient Sues Over 'Botched' Boob ...\n              ",
    "body": "\n    \n                    \n                          Dr. Terry Dubrow\n                          Ex-Patient Sues Over 'Botched' Boob ...\n                          He Calls It 'Complete Fantasy'\n                      \n                  \n                                                                        Published \n                              \n                January 22, 2026\n                \n                            1:19 PM PST\n                                                                      |\n                                                                Updated \n                                  January 22, 2026\n                                2:18 PM PST\n                                    \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Dr. Terry Dubrow has been sued by a former patient who claims he caused severe bleeding in her that required two additional surgeries, after using a non-FDA approved mesh material for a breast augmentation he performed on her ... all the way back in 2014.\n      \n    \n          According to the lawsuit, obtained by TMZ, the woman says the famous doc stuffed her chest with unsafe, non-FDA approved SERI Surgical Scaffold mesh ... which a subsequent doctor says resulted in a hematoma in her right breast and required 2 surgeries to fix.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          The plaintiff not only alleges she suffered physical injuries, but said she lost out on money because she could not work ... and had to shell out cash for the corrective surgeries. She is seeking reimbursement of her medial expenses and wants money for any future corrective procedures she may need ... in addition to damages for lost income.\n      \n\n          The \"Botched\" star ain't sweatin' the suit, telling TMZ ... \"This case will be dismissed very quickly. The surgery was 12 years ago and the claims are not only untrue but a complete fantasy. The malicious prosecution counterclaim will be very interesting.\"\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Terry Dubrow\n              \n                          \n                Celebrity News\n              \n                          \n                TV\n              \n                          \n                Money\n              \n                          \n                Reality TV\n              \n                          \n                Plastic Surgery\n              \n                          \n                Exclusive\n              \n                          \n                Fairly Legal\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Dr. Terry Dubrow Sued by Ex-Patient for Alleged Negligence, He Denies It",
      "image": [
        "https://imagez.tmz.com/image/8d/16by9/2026/01/22/8dc1d324378840ff98d0ace6174bd2aa_xl.jpg"
      ],
      "datePublished": "2026-01-22T21:19:51.000Z",
      "dateModified": "2026-01-22T21:19:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]