[
  {
    "title": "Jason Bateman Criticized for Asking Charli xcx About Having Kids and Telling Her ‘You Might Find Somebody’ Who Changes Your Mind; She Responds: ‘I Am Married’",
    "url": "https://variety.com/2026/film/news/jason-bateman-charli-xcx-children-1236650771/",
    "image": "https://variety.com/wp-content/uploads/2026/02/MixCollage-03-Feb-2026-09-24-AM-1575.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-03T16:36:00.000Z",
    "description": "\n\tJason Bateman is getting flak on social media for a seemingly awkward interview moment on the latest “SmartLess” podcast episode in which he asked C",
    "body": "\n\tJason Bateman is getting flak on social media for a seemingly awkward interview moment on the latest “SmartLess” podcast episode in which he asked Charli xcx about having children and then told her she might change her mind about not wanting kids. The Grammy winner stopped by the podcast to promote her new A24 movie “The Moment.” \n\n\tThe topic of children came up when Bateman, who has two children with wife Amanda Anka, asked Charli: “Would you love to have more than one kid or would you like to have a kid that has the same experience as you, the only child, and then you get to nurture and protect?”\n\t\n\n\tWhen the pop star responded by saying “I actually don’t really want to have kids,” co-host Sean Hayes replied: “You don’t? Wait, why? I know that’s none of my business…”\n\n\tHayes noted that he also does not want to have kids, explaining: “I want to want to have kids… I’ve said it a million times, but I’d rather regret not having kids then have them and regret it later. You never know what you’re going to get.”\n\n\t“That could change,” Charli said about her stance on becoming a mom. “I love the fantasy of having a child like naming it — it sounds so fun — but I’m like, that is exactly assigned to me as to why I should not have one, the fact that [naming it] feels like the coolest part about it.”\n\n\tBateman then told Charli that she might change her mind and pulled from personal experience by telling her: “I mean I guess I’m backing into giving myself a half-assed compliment here, but my wife did not want to have kids, so the story goes. She said once we started going out she thought, ‘OK, I think I can have a kid with this guy.’ So you might find somebody.”\n\t\n\n\t“Well, I am married,” Charli informed Bateman, noting her nuptials to the 1975 band member George Daniel.\n\n\t“I got to read a newspaper one of these days,” Bateman wisecracked in response before joking: “Your next husband, you’re gonna want kids.”\n\n\tThe conceit of the “SmartLess” podcast, hosted by Bateman, Hayes and Will Harnet, is that one of the hosts brings on an interview subject without telling his fellow hosts, which means at least two of the co-hosts each episode can’t prepare for the interview or research their interview subject. That might explain why Bateman has no idea Charli is married.\n\n\tVariety has reached out to Batman’s representative for comment.\n\n\tAs reported by The Independent, social media users and Charli xcx fans were quick to defend the pop star against Bateman’s comments. The interview was branded “disgusting” and an “incredibly rough listening experience” by users on X, with one Reddit user commenting: “Why the fuck does society continue to pressure women, in particular, about having kids?”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jason Bateman Criticized for Asking Charli xcx About Having Kids and Telling Her ‘You Might Find Somebody’ Who Changes Your Mind; She Responds: ‘I Am Married’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/MixCollage-03-Feb-2026-09-24-AM-1575.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-03T16:36:00.000Z",
      "dateModified": "2026-02-03T16:36:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Dropout Hires New Heads of Production and Marketing, Boosts Development Team as Slate Grows (EXCLUSIVE)",
    "url": "https://variety.com/2026/tv/news/dropout-new-heads-production-marketing-development-growth-1236650865/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Dropout.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-03T16:30:42.000Z",
    "description": "\n\tDropout, the streamer and media company formerly known as CollegeHumor, has made key hires and promotions across its growing production, development",
    "body": "\n\tDropout, the streamer and media company formerly known as CollegeHumor, has made key hires and promotions across its growing production, development and marketing teams. \n\n\tNew hires include Alexandria Black-Davis as head of marketing, Lindsay Wilkinson as head of production, and Elyse Findley and Rosie Kaller both as development managers. Additionally, Dropout staffer Ebony Elaine Hardin has been promoted from supervising producer to director of production.\n\t\n\n\tThe wave of changes come on the heels of Dropout’s paid streaming service, which is home to “Dimension 20,” “Game Changer,” “Make Some Noise” and more comedy shows, reaching 1 million subscribers last fall and the company’s addition of an elective “Superfan” subscription tier. The additions are part of Dropout’s overall strategy to grow its development slate, license and acquire new programming, expand production capabilities and prioritize marketing strategies for each project.\n\n\n\t“We couldn’t be more thrilled to welcome Lindsay, Alex, Elyse and Rosie to our team at Dropout, and to elevate Ebony to her well-deserved leadership role,” Dropout CEO Sam Reich said. “As we hit new milestones as a business, expanding our production, development and marketing teams is a natural and exciting next step. We can’t wait to see how these talented team members elevate what we bring, and how we bring it, to our audience.” \n\n\tBlack-Davis has led teams at major retail and media companies like BELLA+CANVAS, Shinola and Whip Media. She will lead all marketing efforts at Dropout and will be at the forefront of scaling the brand to its fullest potential.\n\t\n\n\tWilkinson will oversee Dropout’s end-to-end production pipeline and support the delivery of a “consistent slate of high-quality programming aligned with Dropout’s brand and creative vision.” Her credits include work for major networks such as ABC, NBC, VH1, MTV, HGTV, E!, and Food Network, with notable projects including “Below Deck,” “Cupcake Wars,” the Critics Choice Awards, and the American Music Awards.\n\n\tFindley is a Disney vet who comes to Dropout with a background in comedy and animated series development, programming, and strategy and has worked on multiple Annie and Emmy-award-winning projects, such as “Disney Mickey Mouse,” “Big City Greens” and “DuckTales.”\n\n\tKaller has an extensive background in late-night TV, most recently producing the Emmy award winning shows John Mulaney’s “Everybody’s in LA” and “The Late Late Show with James Corden.” A CollegeHumor alum, Kaller has created and developed series and films with HBO Max, iHeart Media, Aggregate Films and Mar Vista Entertainment. \n\n\tMost recently supervising producer, Hardin has been upped to director of production at Dropout after nearly nine years with the company.  In her new role, she will oversee physical production across the company’s original comedy programming, working closely with creative leadership to support creator-driven storytelling. Harden is counted by the Dropout leadership team as “instrumental in scaling Dropout’s production operations and long-term infrastructure.” \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Dropout Hires New Heads of Production and Marketing, Boosts Development Team as Slate Grows (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Dropout.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-03T16:30:42.000Z",
      "dateModified": "2026-02-03T16:30:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Tecmo Bowl’ Movie in the Works From Tongal Based on Iconic ’80s Football Video Game (EXCLUSIVE)",
    "url": "https://variety.com/2026/gaming/news/tecmo-bowl-movie-tongal-football-video-game-1236650837/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Tecmo-Bowl.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-03T16:00:00.000Z",
    "description": "\n\tTongal, a creator-driven studio and platform that worked on Pharrell Williams’ “Piece by Piece” movie, is developing a feature film based on Koei Te",
    "body": "\n\tTongal, a creator-driven studio and platform that worked on Pharrell Williams’ “Piece by Piece” movie, is developing a feature film based on Koei Tecmo’s classic ’80s football video game “Tecmo Bowl.”\n\n\tThe studio, which has developed content for Netflix, The Lego Group, Pokemon, NBCUniversal and more brands, says it will collaborate with its community of over 160,000 creatives to “reimagine the beloved classic as a movie” that will “combine live action with animated gameplay sequences inspired by the original ‘Tecmo Bowl.'”\n\t\n\n\tFirst released in arcades in 1987 and later on the Nintendo Entertainment System in 1989, “Tecmo Bowl” introduced many gamers to virtual football for the first time through gameplay with digital versions of the era’s biggest players, including Bo Jackson, Joe Montana and Lawrence Taylor.\n\n\n\tPer Tongal, the “Tecmo Bowl” movie “will be developed with Tongal’s creator community, who will contribute and execute original ideas to reimagine the legendary football game’s IP for a new era. By blending the game’s distinct original animation sequences with live production, the film will capture Tecmo Bowl’s nostalgic charm with a fresh, modern approach fueled by creators around the world.”\n\n\tTongal’s first open project tied to the film invites animators to pitch their take of how to transform the game’s original characters from their 8-bit origins into 3D, with the the first character being former Raiders star Bo Jackson. The link to submit is now open on Tongal’s website.\n\n\tThis continues Tongal’s expansion into original content, with additional titles set to roll out over the next year. Building on its recent collaboration with Focus Features, the LEGO Group, Tremolo Productions, and Pharrell Williams’ production company I Am Other on the animated biopic Piece by Piece, directed by Oscar-winner Morgan Neville, Tongal is now focused on securing rights to build a slate of premium film, series, and digital properties, teaming with top creative talent who share its vision for reinventing how films and content are made.\n\t\n\n\t“I grew up playing ‘Tecmo Bowl’ with my friends, as did so many kids of the 90s, and I know this is going to resonate with the fans and their families,” Tongal CEO and co-founder James DeJulio said. “We’re bringing together our creator community and cutting-edge creator platform to reinvent how features are developed and produced. Just as we did with Piece by Piece, this is an opportunity to innovate and build a new model for storytelling — one where beloved IP is supercharged by the talent and ideas of independent creators around the world.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Tecmo Bowl’ Movie in the Works From Tongal Based on Iconic ’80s Football Video Game (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Tecmo-Bowl.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-03T16:00:00.000Z",
      "dateModified": "2026-02-03T16:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chloé Zhao, Pamela Anderson, Ethan Hawke Among Stars Set to Grace Berlinale Red Carpet",
    "url": "https://variety.com/2026/film/global/berlinale-red-carpet-chloe-zhao-ethan-hawke-1236650787/",
    "image": "https://variety.com/wp-content/uploads/2026/02/MixCollage-03-Feb-2026-03-34-PM-5809.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-03T15:37:41.000Z",
    "description": "\n\tSome of the most hotly-tipped Oscar contenders will be among the star-studded lineup at the Berlin Film Festival this month, as they make a pit-stop",
    "body": "\n\tSome of the most hotly-tipped Oscar contenders will be among the star-studded lineup at the Berlin Film Festival this month, as they make a pit-stop at Berlinale on their way to L.A.\n\n\tAmong those confirmed to attend are “Hamnet” director Chloé Zhao, who is set to present an award at the festival, as well as best actor contender Ethan Hawke, who will be in Berlin to debut historical drama “The Weight,” in which he co-stars with Russell Crowe.\n\t\n\n\tOther names set to grace the festival are Sophie Okonedo, Bella Ramsey, Callum Turner, Sandra Hüller, Juliette Binoche, Isabelle Huppert, Amanda Seyfried, Sam Riley, Rupert Grint and James Norton.\n\n\n\tChanning Tatum and Gemma Chan will also be on hand to showcase their upcoming feature “Josephine,” while Binoche is supporting “Queen at Sea” alongside Tom Courtenay and Florence Hunt and Huppert brings “The Blood Countess.” Ramsey will join co-star Neil Patrick Harris in support of “Sunny Dancer” while the cast of “Good Luck, Have Fun, Don’t Die” – including Sam Rockwell, Juno Temple, Zazie Beetz and Haley Lu Richardson – will also be attending.\n\n\tThe opening gala will see Oscar winner Michelle Yeoh be honored with the Golden Bear award, presented by Sean Baker, while Zhao is set to award “Hamnet” composer Max Richter with the Berlinale Camera.\n\n\tWim Wenders will also attend in his capacity as head of the Berlinale jury.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chloé Zhao, Pamela Anderson, Ethan Hawke Among Stars Set to Grace Berlinale Red Carpet",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/MixCollage-03-Feb-2026-03-34-PM-5809.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-03T15:37:41.000Z",
      "dateModified": "2026-02-03T15:37:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Fred Armisen to Host CNN Series With Deep Dives Into Universal’s Vast Music Archive: Nirvana, Guns N’ Roses, Many More",
    "url": "https://variety.com/2026/music/news/fred-armisen-to-host-cnn-series-universal-music-archive-1236650881/",
    "image": "https://variety.com/wp-content/uploads/2026/02/GettyImages-2247564646.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-03T16:20:31.000Z",
    "description": "\n\tCNN and Universal Music Group have announced that comedian-actor-musician Fred Armisen will host a new series that looks into Universal Music Group’",
    "body": "\n\tCNN and Universal Music Group have announced that comedian-actor-musician Fred Armisen will host a new series that looks into Universal Music Group’s vaults — the world’s largest music archives — featuring original master recordings, rare photos and performances, alternative album art and music videos from Nirvana, Guns N’ Roses and many others. Produced by UMG’s film and television division Polygram Entertainment, Time Studios and Known Originals, the CNN Original Series will premiere later this year as part of CNN Originals’ anticipated 2026 programming slate.\n\t\n\n\tThe series was previewed at UMG’s “Music Is Universal” showcase during Grammy Weekend with a trailer that followed the hosts deep into the massive, climate-controlled vaults where much of the archive is stored, deep within the Iron Mountain facility in Boyers, Pennsylvania, located 220 feet underground in a former limestone mine. The trailer, which is expected to be released in the coming weeks, shows archivists speaking with awe at what they’re hearing on master tapes that haven’t been played in decades.\n\n\n\t“I’m honored and I can’t wait to get started with this project,” Armisen said at the event. “I want to move into that vault! I hope we get to dive in, deeper and deeper, into these recordings. And I also want to say that to Universal Music Group that whenever you put out boxed sets with the demos and everything on them, I buy all of it! For real, I buy the LPs and CDs, because I want both collections. I’m really honored, and thank you so much for having me — I can’t wait to get started.”\n\t\n\n\tThe series is a passion project for UMG EVP and chief administrative officer Will Tanous, who launched a similar project at Warner Music before he joined UMG in 2013. After noting that he’s known Armisen “for decades, starting back when he was the drummer in a punk band out of Chicago,” presumably referring to the group Trenchmouth. More seriously, he continued, “This series was born from a desire to show fans what it’s like to mine the greatest underground musical archive in the world — giving them a sense of the hunt, the challenge, the thrill of this work – as well as direct access to the dedicated experts who preserve and champion these incredible musical legacies. Fred’s singular blend of humor, fandom, and musical talent make him the ideal storyteller to reveal the intimate era-defining moments and unheard gems that form the foundation of popular culture.”\n\n\t“This series opens the doors to one of the most extraordinary music archives in the world, and Fred Armisen is the perfect guide,” said Amy Entelis, executive vice president of talent, CNN Originals and creative development for CNN Worldwide. “His deep connection to music and natural sense of wonder allow viewers a chance to experience music history up close, discovering the unexpected stories behind some of the most iconic sounds ever created.”\n\n\tExecutive producers for the series are Fred Armisen; Will Tanous and David Blackman for UMG; Amy Entelis, Lyle Gamm and Katie Hinman for CNN Original Series; Jeff Smith for Time Studios; Doug Pray. The series is produced by Nicole Avant and Brad Roth; co-producers are Bruce Resnikoff and Madeline Post for UMG. Executive Producer Ted Skillman will also serve as show runner.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Fred Armisen to Host CNN Series With Deep Dives Into Universal’s Vast Music Archive: Nirvana, Guns N’ Roses, Many More",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/GettyImages-2247564646.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-03T16:20:31.000Z",
      "dateModified": "2026-02-03T16:20:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Da’Vine Joy Randolph, Juliette Binoche, Anna Ferzetti Set for Filming Italy — Los Angeles Honors",
    "url": "https://variety.com/2026/film/global/davine-joy-randolph-juliette-binoche-filming-italy-1236650752/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Filming-Italy.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-03T15:50:26.000Z",
    "description": "\n\tOscar winner Da’Vine Joy Randolph, Juliette Binoche and Italy’s Anna Ferzetti — who stars in Paolo Sorrentino’s latest film “La Grazia” — are among ",
    "body": "\n\tOscar winner Da’Vine Joy Randolph, Juliette Binoche and Italy’s Anna Ferzetti — who stars in Paolo Sorrentino’s latest film “La Grazia” — are among the top honorees of the 11th edition of Filming Italy — Los Angeles. The event, which bridges Italy and Hollywood, will run Feb. 10-14.\n\n\tFerzetti, who besides starring in “La Grazia” recently appeared in Ferzan Ozpetek’s smash hit “Diamonds” and the generational comedy “Classmates,” is also this year’s “ambassador.” Filming Italy — Los Angeles is headed by marketing guru and longtime Italian industry promoter Tiziana Rocca, who also leads the Taormina Film Festival.\n\t\n\n\t“Ferzetti is having a great year in a panoply of different types of roles that really make her shine,” Rocca told Variety.\n\n\n\tBesides being honored, Binoche will be presenting her directorial debut “In-I In Motion” that charts her cathartic experience co-creating and performing a dance show with well-known British choreographer Akram Khan.\n\n\tOther notable names expected to attend Filming Italy in various guises include Julian Schnabel; Oscar-nominated casting director Francine Maisler (“Sinners”); “Emily in Paris” star Samuel Arnold; “Rocky” and “Creed” actor Dolph Lundgren; and Oscar-nominated costume designer Miyako Bellizzi (“Marty Supreme”).\n\n\tAs previously announced, Iconic Italian actor Franco Nero, —who gained worldwide fame in Sergio Corbucci’s 1966 classic Spaghetti Western “Django” — will also be honored during Filming Italy, which has been instrumental to his Hollywood Walk of Fame induction on Feb. 12. \n\t\n\n\tA Nero retrospective featuring Florestano Mancini’s political drama “The Matteotti Murder,” about the 1924 kidnapping and assassination of Italian Socialist leader Giacomo Matteotti by Fascist thugs after he exposed electoral fraud, will also be part of the Nero tribute.\n\n\tRocca is particularly proud that Filming Italy has now secured its third star dedicated to an Italian artist, following the awarding of stars to Gina Lollobrigida in 2018 on the occasion of her 90th birthday, and Giancarlo Giannini in 2023.\n\n\tFresh Italian movies set to screen at the fest include Italian comedy sensation Checco Zalone’s smash hit “Buen Camino,” which just became Italy’s all-time top box office draw with an $82 million haul, and Paolo Genovese’s concept comedy “Madly,” which also scored mightily in Italy.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Da’Vine Joy Randolph, Juliette Binoche, Anna Ferzetti Set for Filming Italy — Los Angeles Honors",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Filming-Italy.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-03T15:50:26.000Z",
      "dateModified": "2026-02-03T15:50:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Mahesh Babu, Priyanka Chopra Jonas and Prithviraj Sukumaran on Making S.S. Rajamouli’s ‘Varanasi’: ‘Intimidating and Exhilarating at the Same Time’",
    "url": "https://variety.com/2026/film/news/mahesh-babu-priyanka-chopra-jonas-ss-rajamouli-varanasi-1236650759/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Mahesh-Babu-Varanasi.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-03T16:00:00.000Z",
    "description": "\n\tThe cast of “RRR” director S.S. Rajamouli‘s “Varanasi” has opened up about the ambitious production’s demanding shoots, from filming with wild anima",
    "body": "\n\tThe cast of “RRR” director S.S. Rajamouli‘s “Varanasi” has opened up about the ambitious production’s demanding shoots, from filming with wild animals in Kenya’s Maasai Mara to the physical transformations required for their roles.\n\n\tThe film’s story spans thousands of years and traverses multiple continents, with locations ranging from Antarctica to Africa to the titular Indian city. Mahesh Babu plays the dual roles of the protagonist Rudhra and Hindu God Rama, Priyanka Chopra Jonas plays a character named Mandakini and the main antagonist Kumbha is played by Prithviraj Sukumaran. \n\t\n\n\tBabu, who spent a year preparing for the role, underwent three months of Kalari martial arts training solely to adjust his posture for the character’s period-appropriate bearing. “I’m playing Lord Rama’s character, it required posture… you can’t stand like modern characters,” he explains.\n\n\n\tHe also trained with a track and field team for several months to modify his running style. “When I saw the shot, I was really happy. It was worth it, because that six months of training for that one shot was really worth it,” he says. “The way I walked changed, the way I stood changed, everything changed.”\n\n\tSukumaran’s Kumbha is a character confined to a wheelchair who can only move his face. “All that you see here is practical. It’s not like a CGI image that you’re seeing. The wheelchair and me in it, and everything is practical,” he says. “The challenge was that this is only the face that is mobile, and everything that this character has to convey has to be done through just the face with no particular body language associated with it.”\n\t\n\n\tHe describes the character as “a very interesting dichotomy, because he is severely limited in his physicality, but he is also very dangerously unlimited in his mentality.”\n\n\tThe production’s Africa sequence, filmed during the wildebeest migration in Kenya’s Maasai Mara, proved particularly challenging. The filmmakers received extensive support from the Kenyan government to access the protected lands.\n\n\t“I don’t think many people have had that kind of freedom or access to the land of Maasai Mara, besides probably poachers, maybe,” Chopra Jonas says. “Being able to go in there and actually work with real animals was intimidating and exhilarating at the same time.”\n\n\tThe production timed their shoot around the migration. “Everything was animal dependent. So the crew hardly slept,” she explains. “When the family of elephants would move, that’s when we had to go and say our lines.”\n\n\tBabu describes their first day filming as surreal. “We had these vehicles, and they would take us there, drop us and Sir [Rajamouli] was somewhere in another vehicle, because he had to go around the wildebeest,” he recalls. “Then the vehicle which dropped us went away, and then we realized that we’re just standing there with the wildebeest. All of a sudden we can just hear the ground shaking, because these animals were just [running].”\n\n\tThe actor recalls Rajamouli directing from a distance via walkie-talkie. “He was very excited. He was like, ‘It’s very nice, very nice. Just keep moving.’ And we knew he was getting his take.”\n\n\tAfter the day’s shoot, the actors discussed the uniqueness of their experience. “I don’t think any other actor would have done what we did. And it was quite an achievement,” Babu says.\n\n\tRajamouli explains that visiting Africa’s wilderness had long been on his bucket list. “Once you land in Africa, you are not hit by it. But as you travel into the wilderness, you are not just hit, you are literally swept off your feet,” he says. “It’s an incredible feeling — like you really know your size in the world.”\n\n\tDespite the film’s heavy reliance on visual effects, Rajamouli emphasizes using practical elements wherever possible. “This movie is so VFX heavy, he’s very, very specific about having parts of it which are absolutely real,” Chopra Jonas says. “He’s so specific about making this movie an amalgamation of actual production design, real sets, real interaction and VFX. So we only go to VFX with things we can’t achieve practically.”\n\t\n\n\tFor Chopra Jonas, “Varanasi” marks her return to Indian productions after focusing on Hollywood projects. The actress, who doesn’t speak Telugu, initially expressed concerns about the language barrier.\n\n\tHer first meeting with Rajamouli in Hyderabad helped allay those fears. “He took me into his office, and it was just him and I, and he said that, ‘Priyanka, there’s no version of this film that goes out to the world if it’s not the best version of you in every frame, and that’s my promise to you,'” she recalls.\n\n\tShe describes her experience making the film as transformative. “If there was any way of coming back to Indian cinema, it would be with the biggest Indian movie being made, and that undertaking is this film,” she says. “I think Sir’s vision is unlike anyone in this country or abroad. His cohort, if I may say so, is the Spielbergs of the world, the Nolans of the world, the Finchers of the world.”\n\n\tAddressing the film’s title, Rajamouli acknowledges the cultural and religious significance of naming a film after one of India’s most sacred cities. “It is the name of an ancient [city], the first city, and which is so fondly revered by millions of people,” he says. “I know it carries a weight. I know it carries a religious significance. And of course, that makes me even more responsible in how I use it.”\n\n\tHe even got emotional during the final mixing session. “The moment that got me goosebumps and tears in my eyes was when the ‘Varanasi’ title was coming onto the screen,” he says. “So I thought, yes, we are right in naming the film ‘Varanasi.'”\n\n\tChopra Jonas, who was raised in Uttar Pradesh, also has a personal connection to the city. “I’m a big Shiva Bhakt [Hindu God Shiva who is Varanasi’s presiding deity]. So hearing the story and understanding why it’s called ‘Varanasi’ was amazing,” she says. “There was no part of me which felt that this story does not do justice to the history and the gravity of the city.”\n\n\tSukumaran calls the title perfect for the material. “There really isn’t a more apt title for what this film is about and what the plot of the film entails,” he says. “How this narrative arc travels has got a lot to do with Varanasi itself.”\n\n\tFor Rajamouli, the project represents a creative leap he’d long envisioned but didn’t expect to make so soon. “All my films, I take inspiration from [Indian epics] ‘Ramayana’ and ‘Mahabharata.’ But here, it’s not an inspiration. It’s actually a piece of ‘Ramayana’ that we are putting into the film,” he says. “I kept imagining at some point in my life I will be making these epics, but I did not expect it to happen so soon.”\n\t\n\n\t“Varanasi” will open in theaters worldwide on April 7, 2027.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Mahesh Babu, Priyanka Chopra Jonas and Prithviraj Sukumaran on Making S.S. Rajamouli’s ‘Varanasi’: ‘Intimidating and Exhilarating at the Same Time’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Mahesh-Babu-Varanasi.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-03T16:00:00.000Z",
      "dateModified": "2026-02-03T16:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sex, Lies and Politics: How FX’s ‘Love Story’ Brings Back the Doomed Romance of John F. Kennedy Jr. and Carolyn Bessette ",
    "url": "https://variety.com/2026/tv/features/love-story-fx-jfk-jr-carolyn-bessette-sex-politics-1236648235/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Variety-American-Love-Story-Cover-Story-3.jpg?crop=97px%2C69px%2C1103px%2C620px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-02-03T16:00:00.000Z",
    "description": "\n\tCasting John F. Kennedy Jr. was a nightmare.\n\n\tIt was April of last year, and the production of the limited series “Love Story” was three weeks away",
    "body": "\n\tCasting John F. Kennedy Jr. was a nightmare.\n\n\tIt was April of last year, and the production of the limited series “Love Story” was three weeks away from starting. Cameras were ready to go up — but for the fact that Camelot’s princess, Carolyn Bessette Kennedy, to be played by Sarah Pidgeon, didn’t yet have her prince.\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tRichie Shazam for Variety\n\t\n\n\n\n\tPidgeon, a Tony nominee for her role in the play “Stereophonic,” was cast first; she had the chops, and once her manager showed the producers a Photoshopped image of her as a blonde, they were convinced Pidgeon could resemble the late fashion icon. But JFK Jr. was proving impossible to find. “We had casting agents in Australia, in England,” recalls Brad Simpson, one of the series’ executive producers, who was helping to run point for the Ryan Murphy production. “We read male models. We read random people off the street — any sort of white guy between 25 and 40.”\n\t\n\n\tBut Kennedy wasn’t just any white guy. Since his debut on the national scene as a tot scampering through in the White House — a symbol of the Kennedy administration’s youthful energy — he’d been relentlessly documented. Then came his time at Brown University and his casual omnipresence as a New York City celebrity who dated Cindy Crawford, Madonna and Sarah Jessica Parker. He was a national fixation, up to and including his perennially taking off his shirt during highly scrutinized Central Park sojourns, and his physique was well-documented throughout the ‘90s. Bodies like his aren’t common among aspiring leading men in the post-Hemsworth age. “We live in a world,” Simpson says, “where chest hair has somehow disappeared.”\n\t\n\n\tPaul Anthony Kelly, a former model looking to break into acting, had been considered and passed over. But as time was running out, Simpson and producing partner Nina Jacobson gathered 13 potential Johns, including Kelly, for a series of readings. After they showed the final three options to Murphy, one of the hairdressers working with the actors told the group that they’d be insane not to cast Kelly, who stands well over six feet and has a Brooks Brothers-esque square jaw. The assembled parties agreed, then asked Pidgeon to tell Kelly he’d booked the part — and the pair immediately set to building chemistry. “I made him drive me home from his camera test!” Pidgeon recalls, laughing.  \n\n\tIt’s December, after filming on the show has wrapped, and I’m sitting across the table from both actors at the restaurant at the Standard Hotel in Manhattan. In conversation, Pidgeon is more analytical than the often-impulsive character she plays, frequently referring to her acting self in the third person. And Kelly is more decisive than the endlessly vacillating scion he plays. His directness is in marked contrast to a character who will say whatever’s needed to lubricate any social situation.\n\n\tBut then, Kelly started out by observing Kennedy from a remove. The actor grew up in a small town in Ontario, which cut both ways as he prepared to play a defining icon of late-20th-century Americana. “It lent to my nervousness and intimidation, playing royalty,” he says. The family hadn’t meant much to him before he got the part: “It’s not in my life — it is now, but it wasn’t growing up. It wasn’t so close to my heart.”\n\n\tMuch of the audience simply cannot relate: With its rich, familiar subject matter, “Love Story,” premiering on Feb. 12, is poised to become one of the most-discussed shows of the year. The telling of this legendary couple’s story is a Calvin Klein Obsession-scented love letter to the moment they lived through, and to the potential that was lost when their plane went down on July 16, 1999. It’s the latest iteration of Ryan Murphy’s project of excavating recent history to examine our relationship with celebrities, but unlike the offerings in the “American Crime Story,” “Feud” or “Monster” franchises, “Love Story” holds at its center no small amount of heart (and lust), with an acting duet that introduces Kelly and Pidgeon to the world. Hudson Williams and Connor Storrie of “Heated Rivalry” got the month of January to themselves as newly minted TV stars. But Kelly and Pidgeon will take Valentine’s Day.\n\t\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tRichie Shazam for Variety\n\t\n\n\n\n\tThis show shouldn’t have worked. (And it very nearly didn’t.) Since becoming a global celebrity in the mid-’90s, Carolyn Bessette Kennedy has become venerated for her restrained, aloof glamour. Any result short of nailing it will result in derision, as the production learned when images from the set were roundly mocked online.\n\n\tBut instead, “Love Story” is captivating: The music, style and culture of the era, from Carolyn’s workspace at the Calvin Klein offices to the glass-bricked loft where the couple live, burst into life on-screen. Amid the turbulence of John and Carolyn finding each other and then their marriage falling apart lie little bits of lovingly constructed detail, like Alessandro Nivola’s louche performance as Klein or the conjuring of New York club culture — back when people still smoked indoors.\n\n\tBeyond the specifics, though, the story has an elemental pull. Carolyn Bessette was an unexpected match for the nation’s most eligible bachelor; she had grown up middle-class, and worked her way up within the fashion industry. (That she was not a fit with the Kennedy family — including John’s high-achieving sister, Caroline, played by Grace Gummer — is crucial to her appeal. And it’s part of what draws the rebellious John-John to her.) “The way into the story was not through John’s perspective,” says Simpson, “but through a commoner entering the palace. That’s a classic story.”\n\n\tFor Pidgeon, the ups and downs of the pairing made for a full-course meal. “There was a serious love there,” she says. “That was always what we were searching for.”\n\n\n\tMurphy had told Simpson and Jacobson — their company Color Force has worked with him since “The People v. O.J. Simpson: American Crime Story” — that he wanted to pursue a limited series about Kennedy and Bessette.\n\n\tBut that was the barest of ideas; they needed a writer. Enter Connor Hines, an actor who’d appeared on Hulu’s “Dollface,” among other series. Hines, who hoped to start a second career as a writer, had been watching “The Crown” when it struck him that the Kennedy family’s story would make for a great TV series. (It was such a good idea, in fact, that it wasn’t unique to Hines: Netflix has announced its own take, in which Michael Fassbender will play patriarch Joseph P. Kennedy.) Hines, all of 11 years old when Kennedy’s plane crashed, was deep into researching the clan when he read that Murphy was developing a series about Kennedy and his bride, and he felt a sense of destiny. “On no other subject would I be a value-add to Ryan Murphy,” Hines says, “but on that particular subject, I can add something.”\n\n\tWhen I visit the Tribeca set in October 2025, Hines is in constant motion, wearing a preppy cream cable-knit as he oversees the taping of the finale. “It’s jubilant enough?” Pidgeon asks him after multiple takes of a scene in a bar in which Carolyn and John, at the end of their rope, ruefully debrief after marriage counseling. It’s surprising that jubilation is what she’s going for.\n\t\n\n\tThe performance in full, though, makes Pidgeon’s desire make sense. The joy behind Carolyn’s seeming hauteur had been a focus in Hines’ pitch to Murphy. “So much of what I read about her was that, when she singled in on you, she could make you feel like the only person in the room with her,” he says. “A wicked sense of humor, swore like a sailor, incredibly emotionally intelligent, a firecracker. After a while, I was like, Oh, I think I have the skeleton of this.”\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tRichie Shazam for Variety\n\t\n\n\n\n\tThose qualities aren’t the ones commonly associated with Bessette Kennedy, who has long presented a conundrum for journalists. Little has been published about her outside the phenomenon of her husband’s fame. Though “Love Story” was announced in 2021, FX Entertainment president Gina Balian says the network waited for the 2024 book “Once Upon a Time: The Captivating Life of Carolyn Bessette-Kennedy,” the credited inspiration for the series, to be completed before moving forward with production. “So many people have written about the Kennedys,” Balian says, “but this was really a book about Carolyn and trying to understand her better. All we knew her from was the downcast eyes.”\n\n\tThat shy mien was no joke: Fiercely private, she was, in life, mostly known for being stalked by paparazzi as doggedly as Princess Diana was. (Carolyn, on the series, watches coverage of Diana’s death with horror and fear.) Little wonder that she could appear stricken, and refused to speak publicly. Into this vacuum, a misogynistic sense of her as a harridan or a drug-using flake emerged.\n\n\tAs Hines puts it: “This is a woman that was rendered by a lot of these narratives in a way that felt really unfair and devoid of context, devoid of empathy.”\n\n\tPidgeon saw a positive spin on the public’s imagined version of Bessette Kennedy: What is written up in the tabloids as a mess might look, when written and played empathetically, like the life of the party. Pidgeon recalls. “Someone that I spoke to said that you’d all be out at the Odeon or in the East Village, with everybody out smoking and drinking, and someone would call Carolyn — and that’s when the party would start.” Pidgeon, whom I’d last seen on set, a couple months prior, trying to find the jubilation in a conversation about the end of a marriage, seems to come alive herself sharing this recollection. “She laughed,” she says. “She’s funny!”\n\n\tThis understanding of Bessette Kennedy as a person with humor and charm — a depth beyond her wardrobe, reputation and married name — yields a delicate, enigmatic performance. We first meet Carolyn on the last day of her life, rushing to the airport to head to a Kennedy family wedding with her estranged husband and her sister (Sydney Lemmon). She seems impossibly fragile — not in the wounded-glamour sense evoked by photos of her, but on edge, brittle, pained even by the smallest decisions. (Mid-manicure, as she prepares for the wedding, this woman with such a strong sense of personal style changes her mind, declaring that a red nail simply won’t work for the Kennedys.) Then we rewind to who she was before she met John: more self-actualized than the lost soul averting her gaze from the camera lenses.\n\t\n\n\tJohn, by contrast, was to the manner born, and Kelly plays him as a charmer and a dilletante. (Kelly studied a Kennedy-narrated audiobook of his father’s “Profiles in Courage” to pick up what he calls his “lackadaisical” cadence.) Like many people who have easy relationships with their challenging families, John simply cannot see why his wife would have reason to struggle with her in-laws. But while Carolyn is an unlikely Kennedy-by-marriage, she’s a lot likelier to have passed muster with the late Jacqueline Kennedy Onassis than, say, on-again, off-again Kennedy girlfriend Daryl Hannah would have. (The former first lady is played with stately reserve by Naomi Watts; Dree Hemingway appears as the fiery Daryl.)\n\n\tBecause Onassis died in 1994 without ever meeting her eventual daughter-in-law, Watts played her scenes opposite Kelly. “Even though he’s relatively new as an actor, I could sense immediately on set how accessible he is,” she writes via email. “He’s very much in his body — physically present, emotionally open — with so much going on behind his eyes. For me, the most important thing in a scene partner is emotional availability, and Paul has that in spades.”\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tRichie Shazam for Variety\n\t\n\n\n\n\tIt was something like kismet that Kelly landed the role when he did. “He had just moved to Portland thinking maybe acting wasn’t going to happen for him,” Simpson says. Kelly was living in Altadena during the Eaton fire; he relocated to Oregon with the intent of starting a family in an environment not touched by disaster. Visiting Portland before moving, “our cortisol levels just dropped,” Kelly says. “I love to be outdoors, walk and nap and ski and snowboard.” (Poor John had to resort to Central Park for a taste of nature; the actor playing him is surrounded by it.) And when we speak in December, Kelly is expecting his first child. “It’s a lot of change,” he says. “2026 …”\n\n\t“Big year!” Pidgeon says, grinning.\n\t\n\n\t“2025 was the buildup to all of it, doing the work,” he says. “2026 is where I get to reap the benefits.” He pauses, considering how much of himself to give to a journalist for what will be yet another signpost in the momentous year of 2026: his first magazine cover. “Um … you know,” he says, then decides where to leave the topic. “We’re very, very lucky.”\n\n\n\tKelly’s idyll in Portland was short: He booked “Love Story” three months after his move, then decamped to New York for six months. For him, and for Pidgeon, the noise around the show soon threatened to become overwhelming.\n\n\tThe production was playing out on the streets of New York, and photographers captured it all — just like the paparazzi who trailed the show’s real-life subjects. Early looks at the costuming, including test images the show made public, came in for aggressive criticism — an indication both that the real couple was so dearly loved, and that the production wasn’t quite nailing it. Bessette Kennedy used her wardrobe to “tell you who she was,” concluded fashion writer Danya Issawi in an opinion piece in New York magazine’s The Cut. “I can’t say the same for Murphy’s vision.”\n\n\t“We had a bump in the summer,” Simpson says. “I actually think it’s good that they got out there, because we listened to a lot of feedback. When you’re making something over seven months, you’re figuring it out.” Rudy Mance, a costumer who’d worked in the fashion department at Condé Nast (and had collaborated with Murphy on “Monster” and “American Horror Story”), was brought in.\n\n\t“Loving them for so many years — it was a lot of pressure,” Mance says. “I get it. I’m protective of them as well. We all just wanted to be as precise and accurate as possible.” Mance cross-referenced each new look (some 12 to 15 costume changes per episode for Pidgeon) against the body of photographs available. “We studied for months throughout filming,” he says. “A lot of these online people might not have even been alive when she was.”\n\n\tFor Pidgeon especially, the stakes felt personal — and fueled her performance. Bessette Kennedy became, throughout her marriage, a woman trapped by a public image that distorted who she really was; obsessively observed, but unable to share the substance of her performance, Pidgeon was in a similar boat. “Sarah’s nervous system was a pinch of what Carolyn was experiencing,” Pidgeon says, “in the sense that people are having conversations about what you are trying to do.”\n\n\tAnd she’s careful to emphasize that it’s just a pinch — her experience was a fraction of Bessette Kennedy’s, and she’s plainly self-conscious about the comparison. “She was trying to live her life and was being hunted by these paparazzos. She was existing. I am aware that I’m an actor trying to do my job on the streets of Tribeca.”\n\n\tDoing one’s job under such scrutiny is a challenging thing; after all, Bessette Kennedy quit Calvin Klein as the hubbub around her grew to distracting levels. Pidgeon continues: “I was in a play, and the reviews come out, and then you still have months left to do.” A difference, perhaps, is that “Stereophonic” received raves. The “Love Story” set photos did not. “It’s odd to have an awareness of people’s immediate interest.”\n\t\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tRichie Shazam for Variety\n\t\n\n\n\n\tThe attention was discomfiting, but also reminded Pidgeon of why she wanted the part in the first place: “At a certain point you can’t read what’s online. But at times, it gave me this fuel to be hyperaware and incredibly conscious. At that point, I understood how important these people and their stories were to me.”\n\n\tAnd her nervous-system distress went into the performance. “It was Sarah hanging out in between takes, talking to my friends on set, talking to Paul — then being aware that there’s paparazzi there,” Pidgeon says. “Understanding what that did to my heart, my head — I would flush. It woke up a sense memory that I didn’t have before.”\n\n\tBoth actors had worked on their characters’ physical bearing. For Kelly, it meant hitting the gym at 4:30 a.m., before call time, to match John’s look and his relentless, thrumming activity: “He was always on the go, and his processing plant was moving his body — that’s how he processed a situation. If there’s a fight, go for a run afterwards.” And for Pidgeon, the physicality lay, in part, in the wardrobe. As Carolyn moves through marriage, the trench coats Mance provided grew more oversize to emphasize that she is diminishing.\n\n\tYohji Yamamoto, a favorite designer of Bessette Kennedy’s, is said to view women’s clothing as a kind of armor. Pidgeon, after learning this, intuitively understood. “That made so much sense — this feeling that you have to put on armor to go out into this world that’s focused so intensely on her. I was so eager to see this woman go from a young woman pounding the pavement in New York — how does that big body that can take up space change and get smaller?”\n\n\tThis time, the wardrobe — picked apart relentlessly online — helped.\n\n\n\tBy the time Mance fine-tuned the costumes, a certain guiding vision for the look of the series had taken over: accuracy above all. The stakes were high: Bessette Kennedy is the standard-bearer for minimalist chic, and her street style remains the exemplar for a generation of young women raised on fashion-inspo Tumblr. Mance distressed a Birkin bag to mirror the casual way Bessette Kennedy treated her finery — “We beat the hell out of it,” he says — and sourced a specific Prada bag from an Etsy user in Ukraine to match her paparazzi-captured look on her return from her honeymoon.\n\t\n\n\t“Prada, that season, did two different versions of the bag,” Mance says, “and the top stitching was different. We did one take with the wrong bag.” The costumer was upset that even a stitch might not have the authentic Bessette Kennedy look, until he was informed that the proper purse had arrived just in time. “Thank God,” he says. “The next shot was an up-close, tight shot of the bag.” Given how carefully everything about Carolyn is studied, he’s right: Someone would have noticed.\n\n\tOther kinds of scrutiny on “Love Story” have been less forgiving. Jack Schlossberg, the nephew of Kennedy and a candidate for Congress, has been involved in an extensive and mutually harsh war of words with Murphy over the existence of a series made without the permission or input of the Kennedy family. On social media, Schlossberg has taken a disproportionate and rageful approach, saying that Murphy “looks like a thumb” and calling the producer a “pervert.” In an interview with The New York Times, Schlossberg elaborated: “In my mind, that’s a form of perversion, to be so obsessed with somebody’s sexuality and their love life, to produce a multimillion-dollar series about them.”\n\n\tThe Schlossberg campaign did not respond to a request for comment; Murphy declined to be interviewed for this story. For his part, Kelly (whom Schlossberg called “bloated” in a different Instagram rant), demurs when asked about the back-and-forth. “First of all, this is a love story,” he says. “That’s something that everyone can relate to. They were such public figures that there was no escaping that, but they went through what everyone dreams of — falling in love. But everyone’s entitled to their opinion.”\n\n\t“It is not a gotcha version of the story or scandalous,” says Jacobson, one of the show’s executive producers. “It is quite earnest in the romance and in our approach to them as people.”\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tRichie Shazam for Variety\n\t\n\n\n\n\tThe series, though, also arrives at a moment when Camelot — the nickname given to the Kennedy dynasty, back when it dominated American life — is enduring both tragedy and embarrassment. Schlossberg’s sister Tatiana Schlossberg died at 35 last December, shortly after the publication of a devastating New Yorker essay about her experience with acute myeloid leukemia. In that piece, she joined other members of her family, a perceived bastion of American liberalism, in decrying how her relative, Secretary of Health and Human Services Robert F. Kennedy Jr., is working to undermine the American health care system. Sight unseen, it might be reasonable for a Kennedy to wonder just what else this show will force the family to endure.\n\n\t“I hail from two very large Irish Catholic families on either side,” Hines says. “My grandparents had shrines to the president and Jackie. I have such tremendous respect for the family and what they’ve been through. And because I know that our writers always led with sensitivity and compassion in every part of the storytelling process — yes, I knew there might be backlash, but once people see it, they will feel a different type of way.”\n\t\n\n\n\tStill, there’s the fact of the tragedy surrounding Kennedy and Bessette Kennedy; what might have been, had they lived? “Love Story” presents a vision that’s not without hope — though their marriage is foundering at the moment of their deaths, they’re trying to find a way it can work. Later episodes in the season, says FX chairman John Landgraf, “get into these two people trying to drill down to the core of why they love each other. They’re having trouble supporting each other, when that’s really genuinely what they want to do.”\n\n\tThe eighth and penultimate episode especially stands out in Pidgeon’s memory. It takes place entirely within the loft where Carolyn, hounded by photographers, has holed up as a sort of prisoner. The onetime life of the party has gone dark, and her husband cannot cope with her isolation and anger. At one point he leaves her to go for a run. This installment, in which both partners find just the right way to hurt one another, came late in the production. Pidgeon and Kelly had already lived through being told, incessantly, that they didn’t look right for their parts; they’d been through other dramas, too, like an outdoor fight scene being reported as a real domestic disturbance on the Citizen app. They formed something of a bond.\n\n\t“It was so incredible to be in that space and have that communion between each other, having so much to draw on. The intention was for it to feel like a three-act play,” says Pidgeon, who knows a little something about theater acting. “I love that feeling in performance when you’re trying to keep this ball in the air.” The scenes have the spontaneity of a fight between longtime partners, in which the perfect idea for how to cut deep arrives suddenly; perhaps Kelly and Pidgeon could have gotten there only at the end of the shoot. “There was a 17-page scene at one point,” she goes on. “I love the pressure. And it was incredible it happened at that moment in our process.”\n\n\tIf the show has done its job, by Episode 8, viewers will be on board with this vision of Carolyn. “I think in understanding, just by being a serious people-pleaser, that I won’t be able to please everyone, the goal really solidified for me,” Pidgeon says. “If I could wake up that familiarity of essence in some way, then that would be some sort of success.”\n\n\t“Love Story” is so named — which is to say, it’s not “American Love Story” — so that it may travel. “FX is not merely a U.S. domestic basic-cable network anymore,” Landgraf says. “It’s now a streaming brand on a global platform.” That evolution has come with some complications, as evidenced by the fact that the show’s key art advises viewers to seek it out on “FX/Hulu on Disney+.” “I would be lying if I didn’t admit that I sometimes miss the days when we were a channel that was in 100 million homes and had a direct, branded pipeline into people’s living rooms,” Landgraf adds, but FX becoming part of Disney after the 2019 20th Century Fox merger has enabled the network to take grander swings. “Love Story,” with its global ambition, is a component of that.\n\n\tIt’s a part, too, of what may keep FX from becoming just another tile on an endless interface. Murphy, despite his five-year sojourn at Netflix, is elemental to the FX brand. With his horror drama “The Beauty,” he’ll have two shows airing there simultaneously (not to mention his recent legal soap “All’s Fair” for sister platform Hulu), and Landgraf credits his medical soap “Nip/Tuck” in part for inspiring him to join the network. Murphy as idea-generation machine is integral to a brand that needs both volume and thoughtfully made work to continue to keep up. “A lot of brands we used to compete with are going away,” Landgraf says, “and the sense that there are a million different streaming platforms is starting to winnow down to a limited number that have real scale and relevance.”\n\t\n\n\tAnd who, perhaps, is more relevant than perennial inspiration Carolyn Bessette Kennedy? That’s how it feels watching Pidgeon in action on the set in October. With cigarette in hand, she uses the smoke to punctuate the points she’s making in conversation with her estranged husband; all the fight’s left her, and she’s more tired and sad than angry.\n\n\t“Our marriage counselor hates us,” Carolyn declares. She exhales showily, filling the air with haze and with an outsize contempt for herself and for her spouse. She goes on to share some memories of time they’d spent together. “If only we knew then,” she intones.\n\n\t“What?” John asks her.\n\n\t“How good we had it,” Carolyn says with a gravelly flatness. Then Pidgeon seamlessly tries the line again, imbuing it with a lusty sense of drama, a recognition that even at the worst moment of her life, no one can take away the charisma that trails ­her like smoke. This Carolyn, despite all that she’s suffered in the public eye, remains aware of the aura that surrounds her. She is, for a moment, remembering a private Camelot — one that’s already vanished.\n\t\n\n\t\n\t\tLocation: The Standard, High Line; Styling (Pidgeon): Emma Jade Morrison/The Wall Group;  Styling (Kelly): Warren Alfie Baker/The Wall Group; Makeup (Pidgeon): Shayna Goldberg/The Wall Group; Grooming (Kelly): Jessica Ortiz/Kalpana; Hair (Pidgeon): David Von Cannon/A-Frame Agency; Look 1 (cover): On Pidgeon: Dress: Valentino; On Kelly: Full look: Tom Ford; Look 2 (Blue Dress and Brown suit): On Pidgeon: Dress and Shoes; Saint Laurent; On Kelly: Shirt and Suit Jacket: Amiri; Pants: Brioni; Boots: Christian Louboutin; Look 3 (Black jacket and turquoise shirt): On Pidgeon: Suit: Tom Ford; On Kelly: Shirt: Brioni; Leather pants: Amiri; Look 4 (Disco Ball): On Pidgeon: Full look: Chanel; On Kelly: Suit: Paul Smith; Shirt: Brioni; Boots: Christian Louboutin; Look 5 (Kelly Solo): Full look: John Varvatos\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sex, Lies and Politics: How FX’s ‘Love Story’ Brings Back the Doomed Romance of John F. Kennedy Jr. and Carolyn Bessette ",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Variety-American-Love-Story-Cover-Story-3.jpg?crop=97px%2C69px%2C1103px%2C620px&resize=1000%2C563"
      ],
      "datePublished": "2026-02-03T16:00:00.000Z",
      "dateModified": "2026-02-03T16:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Christy Tanner Named CEO of New York Public Radio",
    "url": "https://variety.com/2026/tv/news/christy-tanner-ceo-new-york-public-radio-1236650761/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Christy-Tanner_president-and-CEO-NYPR-e1770128195475.jpeg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-03T16:15:00.000Z",
    "description": "\n\tNew York Public Radio has named Christy Tanner president and CEO, giving her oversight of WNYC, WQXR, WNYC Studios, Gothamist, The Jerome L. Greene ",
    "body": "\n\tNew York Public Radio has named Christy Tanner president and CEO, giving her oversight of WNYC, WQXR, WNYC Studios, Gothamist, The Jerome L. Greene Performance Space, and New Jersey Public Radio. She will assume the role effective immediately.\n\n\tShe succeeds LaFontaine E. Oliver, who will serve as executive chair of the board. working to find new alliances and support following the recent elimination of funding for the Corporation for Public Broadcasting.\n\t\n\n\t“Christy is the leader NYPR needs at this moment,” said John Rose, chair of the NYPR Board of Trustees, in a statement. “She brings the leadership, experience, and vision to lead NYPR into an exciting and successful future. During an extraordinary career, she has distinguished herself as a pacesetter for media organizations that have successfully adapted, innovated, and grown while delivering award-winning public service. She recognizes our singular role in New York City, and the importance of reinforcing the trust we’ve earned with audiences over generations – while having the vision to advance our services, platforms, and formats to make the center of excellence that is NYPR sustainable for years to come.” \n\n\n\tTanner has been serving as chair of Swerve Sports, and streaming TV company, and on the board of directors of Audacy, one of the nation’s largest radio and audio companies. She led digital operations at CBS News starting in 2015, helping to launch the first live-streamed service by one of the nation’s big TV-news outlets. The streaming service, free and ad-supported, was called CBSN and sparked a broader movement by TV-news divisions to expand into broadband frontiers.\n\t\n\n\tTanner has also held executive roles at TV Guide and The Washington Post Co. \n\n\t“As a longtime fan of NYPR’s magnificent work, I’m honored to join this powerhouse organization with local heart and global impact,” Tanner said in a statement. “I’m looking forward to serving New Yorkers and audiences everywhere in partnership with the trusted, world-class team who set the standards for audio and multiplatform excellence.”Tanner started her career as a reporter and editor at The Associated Press and at The Commercial Appeal in Memphis. She earned an MBA in media and marketing from Columbia Business School, and a B.A. in Art History from Brown University.The announcement follows a national search led by the NYPR Board CEO Search Committee: John Rose, Anna Quindlen, Jenna Weiss-Berman, Gary Knell, and Marc Chamlin.Tanner succeeds LaFontaine E. Oliver, who will continue to support the organization as Executive Chair, driving efforts to build stability and strengthen collaboration across the public radio system following the recent elimination of funding for the Corporation for Public Broadcasting\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Christy Tanner Named CEO of New York Public Radio",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Christy-Tanner_president-and-CEO-NYPR-e1770128195475.jpeg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-03T16:15:00.000Z",
      "dateModified": "2026-02-03T16:15:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Don Toliver Announces ‘Octane’ 2026 Arena Tour Dates",
    "url": "https://variety.com/2026/music/news/don-toliver-2026-octane-arena-tour-dates-1236650874/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Untitled-e1770135071350.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-03T16:11:17.000Z",
    "description": "\n\tGrammy-nominated rapper Don Toliver has announced dates for his 2026 “Octane” tour, an arena run in support of his fifth studio album of the same na",
    "body": "\n\tGrammy-nominated rapper Don Toliver has announced dates for his 2026 “Octane” tour, an arena run in support of his fifth studio album of the same name, including dates at New York’s Madison Square Garden and Los Angeles’ Crypto.com Arena.\n\n\tProduced by Live Nation, the 30-city North American tour features special guests SahBabii, SoFaygo and Chase B.\n\n\tTickets will be available starting with the Citi presale beginning Wednesday, February 4. Additional presales will run throughout the week ahead of the general onsale beginning Friday, February 6 at 10am local time.\n\t\n\n\tCiti cardmembers will have access to presale tickets beginning Wednesday, February 4 at 10am local time through Thursday, February 5 at 11:59pm local time via the Citi Entertainment program. The tour will also offer a range of VIP packages and premium experiences, featuring prime seating, early entry, and access to a pre-show VIP lounge.\n\n\tUpcoming Tour Dates\n\n\t*with SahBabii\n\n\t^with SoFaygo\n\n\t+with CHASE B\n\n\t# Festival Headline\n\n\tFri May 8 – Orlando, FL @ Rolling Loud*^#\n\n\tTue May 12 – Tulsa, OK @  BOK Center*^+\n\n\tThu May 14 – Houston, TX @ Toyota Center*^+\n\n\tSun May 17 – Columbia, SC @ Colonial Life Arena*^+\n\n\tTue May 19 – Atlanta, GA @ State Farm Arena*^+\n\n\tThu May 21 – Charlotte, NC @ Spectrum Center*^+\n\n\tSat May 23 – Pittsburgh, PA @ PPG Paints Arena*^+\n\n\tSun May 24 – Philadelphia, PA @ Xfinity Mobile Arena*^+\n\n\tTue May 26 – Belmont Park, NY @ UBS Arena*^+\n\n\tWed May 27 – Newark, NJ @ Prudential Center*^+\n\n\tFri May 29 – Hartford, CT @ PeoplesBank Arena*^+\n\t\n\n\tSat May 30 – Boston, MA @ TD Garden*^+\n\n\tMon Jun 01 – New York, NY @ Madison Square Garden*^+\n\n\tTue Jun 02 – Baltimore, MD @ CFG Bank Arena*^+\n\n\tThu Jun 04 – Detroit, MI @ Little Caesars Arena*^+\n\n\tFri Jun 05 – Toronto, ON @ Scotiabank Arena*^+\n\n\tSun Jun 07 – Montreal, QC @ Bell Centre*^+\n\n\tTue Jun 09 – Columbus, OH @ Nationwide Arena*^+\n\n\tThu Jun 11 – Chicago, IL @ United Center*^+\n\n\tSat Jun 13 – Dallas, TX @ American Airlines Center*^+\n\n\tSun Jun 14 – San Antonio, TX @ Frost Bank Center*^+\n\n\tWed Jun 17 – Kansas City, MO @ T-Mobile Center*^+\n\n\tFri Jun 19 – Milwaukee, WI @ Milwaukee Summerfest*^+#\n\n\tSat Jun 20 – Minneapolis, MN @ Target Center*^+\n\n\tWed Jun 24 – Seattle, WA @ Climate Pledge Arena*^+\n\n\tThu Jun 25 – Vancouver, BC @ Rogers Arena*^+\n\n\tSat Jun 27 – Oakland, CA @ Oakland Arena*^+\n\n\tMon Jun 29 – Los Angeles, CA @ Crypto.com Arena*^+\n\n\tTue Jun 30 – San Diego, CA @ Pechanga Arena San Diego*^+\n\n\tWed Jul 01 – Phoenix, AZ @ Mortgage Matchup Center*^+\n\n\tFri Jul 03 – Las Vegas, NV @ MGM Grand Garden Arena*^+\n\n\tSun Jul 05 – Denver, CO @ Ball Arena*^+\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Don Toliver Announces ‘Octane’ 2026 Arena Tour Dates",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Untitled-e1770135071350.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-03T16:11:17.000Z",
      "dateModified": "2026-02-03T16:11:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Lindsey Vonn Still Plans To Compete In Olympics Despite Ruptured ACL",
    "url": "https://www.tmz.com/2026/02/03/lindsey-vonn-ruptures-acl-still-plans-on-competing-2026-winter-olympics/",
    "image": "https://imagez.tmz.com/image/8d/16by9/2026/02/03/8d553fd243334f9892de021ef4dd70c8_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-03T16:00:25.000Z",
    "description": "\n    \n                    \n                          Lindsey Vonn\n                          Who Needs A Good ACL Anyway???\n                          .",
    "body": "\n    \n                    \n                          Lindsey Vonn\n                          Who Needs A Good ACL Anyway???\n                          ... Bring On The Olympics!!!\n                      \n                  \n                                                                        Published \n                              February 3, 2026\n                            8:00 AM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Lindsey Vonn just confirmed she ruptured her ACL after wiping out days before the 2026 Winter Olympics ... but she has no plans to let the injury sideline her from competing in Italy.\n      \n    \n          Vonn shared the news at a press conference on Tuesday in Milan ... saying she suffered bone bruising and \"meniscal damage\" as a result of the crash.\n      \n    \n        Waiting for your permission to load the Instagram Media.\n      \n    \n          Despite that, she actually hit the slopes Tuesday with a brace on her knee -- saying \"It feels stable, it feels strong.\"\n      \n\n          She plans on giving it a go once the Games kick off later this week ... saying, \"I will do everything in my power to be in the starting gate.\"\n      \n    \n          \"I know what my chances were before the crash, and I know my chances aren't the same as it stands today, but I know there is still a chance. And as long as there's a chance, I will try.\"\n      \n    \n      \n      “I’m gonna do it.” - Lindsey Vonn pic.twitter.com/5q66NfKTsE— NBC Olympics & Paralympics (@NBCOlympics) February 3, 2026\n              @NBCOlympics\n          \n  \n    \n          The 2010 Olympic gold medalist crashed in Switzerland during a World Cup race ... and reports said she got entangled in safety nets and received first aid for five minutes.\n      \n    \n          The 41-year-old eventually got to her feet, but was clutching her left knee. She was eventually airlifted by helicopter off the mountain.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Vonn first announced she would return to ski racing in November 2024 after undergoing a partial knee replacement earlier that year, saying, \"Getting back to skiing without pain has been an incredible journey.\"\n      \n    \n          \"I am looking forward to being back with the Stifel U.S. Ski Team and to continue to share my knowledge of the sport with these incredible women.\"\n      \n    \n          The first official women's downhill training session is slated for February 5.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Lindsey Vonn\n              \n                          \n                Olympics\n              \n                          \n                TMZ Sports\n              \n                          \n                Health\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lindsey Vonn Still Plans To Compete In Olympics Despite Ruptured ACL",
      "image": [
        "https://imagez.tmz.com/image/8d/16by9/2026/02/03/8d553fd243334f9892de021ef4dd70c8_xl.jpg"
      ],
      "datePublished": "2026-02-03T16:00:25.000Z",
      "dateModified": "2026-02-03T16:00:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "White-Hot Bikini -- Guess The Sexy Star!",
    "url": "https://www.tmz.com/2026/02/03/bikini-guess-sexy-star/",
    "image": "https://imagez.tmz.com/image/24/16by9/2026/02/02/246189363d274f0aa86a4f535e1e5692_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-03T08:01:29.000Z",
    "description": "\n    \n                    \n                          White-Hot Bikini ...\n                          Guess The\n                          Sexy Star!\n   ",
    "body": "\n    \n                    \n                          White-Hot Bikini ...\n                          Guess The\n                          Sexy Star!\n                      \n                  \n                                                                        Published \n                              February 3, 2026\n                            12:01 AM PST\n                                                                            \n      \n    \n      \n        \n              \n    \n    \n          Can you guess which famous gal put her toned tummy on display in this eye-popping shot?!\n      \n    \n          This social media star lives in Miami, and is one \"Hot Mess!\"\n      \n    \n          Hit the gallery for the reveal!\n      \n      \n      \n          \n            \n              \n                \n                Share on Facebook\n              \n            \n            \n              \n                \n                Share on X\n              \n            \n                          \n                \n                  \n                \n              \n                      \n        \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Hotties & Bodies\n              \n                          \n                Hot Bodies\n              \n                          \n                Guess Who\n              \n                          \n                Photo Galleries\n              \n                      \n        \n          \n  ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "White-Hot Bikini -- Guess The Sexy Star!",
      "image": [
        "https://imagez.tmz.com/image/24/16by9/2026/02/02/246189363d274f0aa86a4f535e1e5692_xl.jpg"
      ],
      "datePublished": "2026-02-03T08:01:29.000Z",
      "dateModified": "2026-02-03T08:01:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Robert Kraft Follows Bill Belichick in Hall of Fame Snub, Report",
    "url": "https://www.tmz.com/2026/02/03/robert-kraft-follows-bill-belichick-in-hall-of-fame-snub-report/",
    "image": "https://imagez.tmz.com/image/aa/16by9/2026/02/03/aa53d67da0e04a38abb2082324a4ca9f_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-03T14:27:09.000Z",
    "description": "\n    \n                    \n                          Robert Kraft\n                          Gets Hall of Fame Cold Shoulder\n                          ",
    "body": "\n    \n                    \n                          Robert Kraft\n                          Gets Hall of Fame Cold Shoulder\n                          Same Snub as Bill Belichick\n                      \n                  \n                                                                        Published \n                              February 3, 2026\n                            6:27 AM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Canton just iced out Patriots royalty -- and Robert Kraft is the latest to feel it.\n      \n    \n          The longtime New England Patriots owner reportedly was snubbed by the Pro Football Hall of Fame, failing to make the 2026 induction class despite being one of the most powerful figures the NFL has seen in decades.\n      \n    \n          It’s the same fate that last week hit his longtime partner-in-dynasty, Bill Belichick.\n      \n\n          Kraft -- a first-time finalist in the contributor category -- didn't receive the required votes from the Hall’s selection committee … meaning no gold jacket (yet) for the man who presided over six Super Bowl championships.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          The decision immediately raised eyebrows around the league, especially since Belichick -- the architect of those titles -- was also passed over in his first year of eligibility. Together, the two built one of the most dominant runs in sports history ... and now they're both waiting on Canton.\n      \n    \n          Of course, controversy may still be hovering in the background. League insiders have speculated that scandals like Spygate and Deflategate continue to linger in the minds of some voters.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Still, neither snub is permanent. Kraft and Belichick remain eligible in future voting cycles -- and plenty around the NFL believe it's only a matter of time before both end up enshrined in the Pro Football Hall of Fame.\n      \n    \n          \"Bill Belichick's record goes without saying, same with the Patriots and Robert Kraft, who is also a candidate,\" NFL commissioner Roger Goodell said on Monday night. \"They are spectacular. They have contributed so much to this game, and I believe they will be Hall of Famers.\"\n      \n    \n          While former Patriots QB Tom Brady has yet to comment on Kraft not getting in, he did speak out against Belichick not getting into the Hall last week.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          So even in a season where the Patriots made it all the way to Super Bowl LX, neither of the two men most responsible for their previous championships will be enshrined in the Hall of Fame this year.\n      \n    \n          Six Lombardis, zero gold jackets -- and a whole lot of people arguing about it.\n      \n      \n              \n          \n                          \n                Bill Belichick\n              \n                          \n                Tom Brady\n              \n                          \n                Robert Kraft\n              \n                          \n                Roger Goodell\n              \n                          \n                TMZ Sports\n              \n                          \n                News\n              \n                          \n                Football\n              \n                          \n                NFL\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Robert Kraft Follows Bill Belichick in Hall of Fame Snub, Report",
      "image": [
        "https://imagez.tmz.com/image/aa/16by9/2026/02/03/aa53d67da0e04a38abb2082324a4ca9f_xl.jpg"
      ],
      "datePublished": "2026-02-03T14:27:09.000Z",
      "dateModified": "2026-02-03T14:27:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'RHOA' Star Kandi Burruss Talks Good & Bad Days Co-Parenting With Ex Todd Tucker",
    "url": "https://www.tmz.com/2026/02/03/kandi-burruss-talks-coparenting-with-todd-tucker/",
    "image": "https://imagez.tmz.com/image/12/16by9/2026/01/30/125c04b1b1284422a1b5b5c86650c9d8_xl.png",
    "tag": "Entertainment",
    "date": "2026-02-03T16:14:17.000Z",
    "description": "\n    \n                    \n                          Kandi Burruss On Split From Todd\n                          Mama Said There'd Be Days Like This ..",
    "body": "\n    \n                    \n                          Kandi Burruss On Split From Todd\n                          Mama Said There'd Be Days Like This ...\n                      \n                  \n                                                                        Published \n                              February 3, 2026\n                            8:14 AM PST\n                                                                            \n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          Singer and \"The Real Housewives of Atlanta\" star Kandi Burruss is trying her heart out to maintain a friendship with estranged husband Todd Tucker for the sake of their kids ... but it hasn't been easy.\n      \n    \n          We caught up with Kandi in NYC last week, where she told us -- like anyone going through a divorce -- she and Todd have their good days and their not-so-good days, but they're making the best of it.\n      \n    \n          She said, \"We're just trying to get used to our new normal.\"\n      \n    \n          Kandi previously told \"TODAY\" she and Todd still spent the holidays together ... 'cause their top priority is keeping things as smooth as possible for their 10-year-old son and 6-year-old daughter.\n      \n\n          She revealed one thing that’s really helped her get through the emotional rollercoaster of divorce is starring in the Broadway musical \"& Juliet\" ... calling it the best kind of therapy, since it keeps her fully distracted.\n      \n    \n          Bottom line ... she and Todd are putting their feelings to the side to prioritize their kids, because they come before everything else!\n      \n    \n          Watch the video to hear what Kandi had to say about NeNe Leakes' return to Bravo!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Todd Tucker\n              \n                          \n                Kandi Burruss\n              \n                          \n                NeNe Leakes\n              \n                          \n                TV\n              \n                          \n                Reality TV\n              \n                          \n                Real Housewives\n              \n                          \n                Celebrity Divorce\n              \n                          \n                Exclusive\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'RHOA' Star Kandi Burruss Talks Good & Bad Days Co-Parenting With Ex Todd Tucker",
      "image": [
        "https://imagez.tmz.com/image/12/16by9/2026/01/30/125c04b1b1284422a1b5b5c86650c9d8_xl.png"
      ],
      "datePublished": "2026-02-03T16:14:17.000Z",
      "dateModified": "2026-02-03T16:14:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jason Bateman Awkwardly Grills Charli XCX Over Choice Not to Have Kids",
    "url": "https://www.tmz.com/2026/02/03/jason-bateman-charli-xcx-having-children-married-smartless/",
    "image": "https://imagez.tmz.com/image/fc/16by9/2026/02/03/fc4caf3a3a4846ac9ebb3bc40d3f0a4a_xl.png",
    "tag": "Entertainment",
    "date": "2026-02-03T16:21:37.000Z",
    "description": "\n    \n                    \n                          Jason Bateman\n                          Don't Want Kids, Charli XCX?!?\n                          ",
    "body": "\n    \n                    \n                          Jason Bateman\n                          Don't Want Kids, Charli XCX?!?\n                          Maybe With Your Next Husband!!!\n                      \n                  \n                                                                        Published \n                              February 3, 2026\n                            8:21 AM PST\n                                                                            \n      \n    \n      \n        \n                    \n                  \n      \n                    SmartLess\n          \n    \n          Someone might wanna tell Jason Bateman to do a little homework next time ... 'cause his attempt at grilling Charli XCX over her not wanting kids had fans cringing hard!\n      \n    \n          It all went down on his \"Smartless\" podcast, when Jason started pushing the tired idea that Charli’s stance on having children could change if she met the \"right person.\" Problem is, the singer's already married ... to The 1975’s George Daniel.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Jason awkwardly joked that he \"needed to read a newspaper\" before tossing out, \"Your next husband, you’re gonna want kids!\" Yikes.\n      \n\n          Clearly it was something he felt really passionate about ... 'cause before Charli let him know she already had a Mr. Right, he explained his wife Amanda Anka didn’t want kids either ... until they met, and did ... and now they’re parents of two. Cool story -- but def not his place.\n      \n    \n          Unsurprisingly, fans weren’t having it ... blasting the exchange as inappropriate, outdated, and another example of women getting pressured over old-school norms.\n      \n    \n          Long story short, Jason might wanna fact-check, hire a researcher, or leave the interviewing to people who actually do this for a living (us😏)!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Jason Bateman\n              \n                          \n                Charli XCX\n              \n                          \n                TV\n              \n                          \n                Podcasts\n              \n                          \n                Controversial S#!T\n              \n                          \n                Music\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jason Bateman Awkwardly Grills Charli XCX Over Choice Not to Have Kids",
      "image": [
        "https://imagez.tmz.com/image/fc/16by9/2026/02/03/fc4caf3a3a4846ac9ebb3bc40d3f0a4a_xl.png"
      ],
      "datePublished": "2026-02-03T16:21:37.000Z",
      "dateModified": "2026-02-03T16:21:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]