[
  {
    "title": "Limp Bizkit Bassist and Co-Founder Sam Rivers Dies at 48",
    "url": "https://variety.com/2025/music/news/limp-bizkit-co-founder-bassist-sam-rivers-dead-1236556317/",
    "image": "https://variety.com/wp-content/uploads/2025/10/GettyImages-466388602-e1760839635423.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-19T02:08:10.000Z",
    "description": "\n\tSam Rivers, bassist and founding member of the metal band Limp Bizkit, died on Saturday, the band announced in a social media post. No cause of deat",
    "body": "\n\tSam Rivers, bassist and founding member of the metal band Limp Bizkit, died on Saturday, the band announced in a social media post. No cause of death was stated, although he had a history of alcohol-related liver disease; he was 48.\n\n\t“Today we lost our brother. Our bandmate. Our heartbeat,” the band wrote. “Sam Rivers wasn’t just our bass player — he was pure magic. The pulse beneath every song, the calm in the chaos, the soul in the sound.”\n\t\n\n\tBorn in Jacksonville, Fla. In 1977, Rivers first began playing music in middle school, beginning with tuba because his friend, future Limp Bizkit drummer John Otto, played jazz drums. While Rivers and Otto are often said to be cousins, the pair had initially thought they were related, but turned out not to be.\n\n\n\n\tRivers later switched to bass and guitar, and became friends with future Limp Bizkit singer/rapper Fred Durst. The pair formed a short-lived band called Malachi Sage, but soon regrouped with Otto to form Limp Bizkit in 1994, uniting with madcap guitarist Wes Borland (who would leave and rejoin the band several times) and later, former House of Pain member DJ Lethal.\n\n\tThe band was aligned with the fast-rising “nu-metal” movement and, after a show in Los Angeles opening for Korn, were signed by Flip Records, whose founder, Jordan Schur, later struck a distribution deal  with Interscope for the band’s debut album. That album, “Three Dollar Bill Y’all” was released in 1997, and the band toured extensively with the Deftones, Helmet, and on the Warped tour. The rapidly building buzz culminated with their 1999 follow-up, “Significant Other,” driven by the single “Nookie” and a half-serious metal cover of George Michael’s hit “Faith.”\n\t\n\n\tThe album rocketed to No. 1 on the Billboard 200 and Limp Bizkit quickly became one of the biggest rock bands in the country. However, their set at the disastrous 1999 Woodstock festival was marred by violence; many blamed Durst for the uproar, as he crowdsurfed on plywood that rioters had torn off of festival fixtures and then shouted “It wasn’t our fault” as he left the stage, although opinions vary. The violence resulted in three deaths, dozens of injuries and 44 arrests, amid multiple incidents of rape, vandalism and arson.  \n\n\tThe band followed with the 2000 set “Chocolate Starfish and the Hot Dog Flavored Water,” but Durst’s unfiltered, often homophobic and sexist lyrics and comments and ongoing conflicts between him and Borland resulted in the latter leaving the band in 2001. Rivers shifted over to guitar for the band’s 2003 album “Results May Vary,” but Borland rejoined the following year.\n\n\tLimp Bizkit went on hiatus in 2006 and Rivers worked as a producer with Jacksonville bands Burn Season and the Embraced, a role he would continue after the band reunited in 2009. Limp Bizkit continued to tour and release albums sporadically over the following years, although Rivers left in 2015 for health reasons that he later revealed were liver ailments due to alcohol abuse. \n\n\t“I got liver disease from excessive drinking … I had to leave Limp Bizkit in 2015 because I felt so horrible, and a few months after that I realized I had to change everything because I had really bad liver disease,” Rivers told writer Jon Wiederhorn. “I quit drinking and did everything the doctors told me. I got treatment for the alcohol and got a liver transplant, which was a perfect match.”\n\n\tHe rejoined in 2018 and remained until his death.\n\n\t“He was a once-in-a-lifetime kind of human. A true legend of legends,” the band concluded in its post on Saturday. “And his spirit will live forever in every groove, every stage, every memory,” the band continued. “We love you, Sam. We’ll carry you with us, always. Rest easy, brother. Your music never ends.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Limp Bizkit Bassist and Co-Founder Sam Rivers Dies at 48",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/GettyImages-466388602-e1760839635423.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-19T02:08:10.000Z",
      "dateModified": "2025-10-19T02:08:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bette Midler Says She’s Read the ‘Hocus Pocus 3’ Script and It’s ‘Brilliant’: ‘I Got Very Excited’",
    "url": "https://variety.com/2025/film/news/bette-midler-hocus-pocus-3-script-disney-1236556265/",
    "image": "https://variety.com/wp-content/uploads/2022/09/Hocus-Pocus-2-2.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-18T23:01:18.000Z",
    "description": "\n\tBette Midler is updating fans on the progress of “Hocus Pocus 3.”\n\n\tDuring a recent appearance on “Watch What Happens Live,” the “Beaches” star shar",
    "body": "\n\tBette Midler is updating fans on the progress of “Hocus Pocus 3.”\n\n\tDuring a recent appearance on “Watch What Happens Live,” the “Beaches” star shared that the “Hocus Pocus 3” producers are currently ironing out “all the those logistical things” before shooting begins. She also revealed that she recently read an early draft of the script and thought it was “brilliant.”\n\n\t“Well, you know, they sent a script, and a lot of it was brilliant,” she said. “So I got very excited, and now we’re trying to figure out what it is and where it’s going to be and how much it’s going to cost and all those logistical things.”\n\t\n\n\tThe last time Midler discussed the “Hocus Pocus 3” script was in July 2024. During an appearance on the QVC+ talk show “Busy This Week,” she urged Disney to speed up development on the long-awaited sequel.\n\n\t“I haven’t seen the script, but I’ve heard rumblings,” Midler said at the time. “I think if they’re gonna, they oughta, because time is not just marching, time is barrel-assing to the finish line. Get us while we’re still breathing, I mean, God!”\n\n\tFormer president of Walt Disney Pictures Sean Bailey revealed that “‘Hocus Pocus 3’ is happening” in a 2023 profile with the New York Times. The first film, released in 1993, starred Midler alongside Sarah Jessica Parker and Kathy Najimy as a trio of witches who return from the 17th century to cause havoc in modern-day Salem. Parker and Najimy are expected to return for the third film. \n\n\t“Hocus Pocus 2” became Disney+’s most-watched original film ever after its 2022 release, with 2.7 billion minutes watched over its opening weekend.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bette Midler Says She’s Read the ‘Hocus Pocus 3’ Script and It’s ‘Brilliant’: ‘I Got Very Excited’",
      "image": [
        "https://variety.com/wp-content/uploads/2022/09/Hocus-Pocus-2-2.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-18T23:01:18.000Z",
      "dateModified": "2025-10-18T23:01:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Javier Bardem Says Israeli Film Boycott Does Not Discriminate Against ‘Individuals’, and Instead Holds ‘Companies and Institutions All Over the World Accountable’",
    "url": "https://variety.com/2025/film/news/javier-bardem-israel-film-boycott-does-not-discriminate-1236556251/",
    "image": "https://variety.com/wp-content/uploads/2025/09/GettyImages-2234938570.jpg?crop=0px%2C80px%2C4574px%2C2573px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-10-18T19:17:43.000Z",
    "description": "\n\tJavier Bardem is speaking out in support of Film Workers for Palestine.\n\n\t“Regarding the Film Workers for Palestine pledge, I want this to be very c",
    "body": "\n\tJavier Bardem is speaking out in support of Film Workers for Palestine.\n\n\t“Regarding the Film Workers for Palestine pledge, I want this to be very clear,” he said in a statement to CNN. “We do not discriminate against any person based on their nationality, race, religion, or gender. We of course believe discrimination of any kind is wrong and do NOT support that and have continued to reiterate this. We support holding companies and institutions all over the world accountable, NOT individuals, for their complicity and participation in the genocide of the Palestinian people in Gaza, and the illegal settlement of the West Bank.”\n\t\n\n\tEarlier in September, more than 3,900 industry leaders signed a pledge against working with Israeli film institutions and companies that are “implicated in genocide and apartheid against the Palestinian people.” The list of signatures includes filmmakers and actors like Bardem, Yorgos Lanthimos, Ava DuVernay, Adam McKay, Emma Stone, Olivia Colman, Ayo Edebiri, Lily Gladstone, Mark Ruffalo, Hannah Einbinder, Peter Sarsgaard, Aimee Lou Wood, Paapa Essiedu, Gael Garcia Bernal, Riz Ahmed, Joaquin Phoenix, Nicola Coughlan, Andrew Garfield, Harris Dickinson, Bowen Yang, Rooney Mara, Guy Pearce, Jonathan Glazer, Ebon Moss-Bachrach, Fisher Stevens, Abbi Jacobson, Eric Andre and Elliot Page.\n\n\n\tIn October, U.K. Lawyers for Israel sent a letter of warning to Netflix, Disney, Amazon Studios, Apple and Warner Bros. Discovery, among others, stating that the boycott violates the U.K.’s Equality Act and may impact financing and insurance.\n\n\t“[The Equality Act 2010] is the key legislation in the U.K. protecting against racism and discriminatory treatment,” states the letter, which has been seen by Variety. “If the U.K. television and film industry colludes with acts contrary to this legislation, organizations are themselves likely to be in breach. It also creates a dangerous precedent: one that condones the exclusion of individuals and/or organizations based solely on their nationality, ethnicity, and/or religion.”\n\t\n\n\tOn Friday, Variety exclusively reported Warner Bros.’s own statement against the boycott. The studio said it is “committed to fostering an inclusive and respectful environment for its employees, collaborators, and other stakeholders,” and that participating in the movement would most likely violate internal policies. \n\n\t“Our policies prohibit discrimination of any kind, including discrimination based on race, religion, national origin or ancestry,” said the studio. “We believe a boycott of Israeli film institutions violates our policies. While we respect the rights of individuals and groups to express their views and advocate for causes, we will continue to align our business practices with the requirements of our policies and the law.” \n\n\tBardem is one of Hollywood’s most outspoken voices against the conflict between Israel and Palestine. In the weeks following the release of Film Workers for Palestine’s pledge, he further explained to Variety on the 2025 Emmys red carpet his choice to join the cause. \n\n\t“Here I am today, denouncing the genocide in Gaza,” he said. “I am talking about the IAGS, the International Association of Genocide Scholars, who study thoroughly genocide and has declared it is a genocide. That’s why we ask for a commercial and diplomatic blockade and also sanctions on Israel to stop the genocide. Free Palestine.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Javier Bardem Says Israeli Film Boycott Does Not Discriminate Against ‘Individuals’, and Instead Holds ‘Companies and Institutions All Over the World Accountable’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/09/GettyImages-2234938570.jpg?crop=0px%2C80px%2C4574px%2C2573px&resize=1000%2C563"
      ],
      "datePublished": "2025-10-18T19:17:43.000Z",
      "dateModified": "2025-10-18T19:17:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bowen Yang Reveals Absence From ‘Saturday Night Live’: ‘Missing the Show Tonight’",
    "url": "https://variety.com/2025/tv/news/bowen-yang-missing-saturday-night-live-1236556310/",
    "image": "https://variety.com/wp-content/uploads/2025/09/GettyImages-2234248860-1.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-18T23:49:38.000Z",
    "description": "\n\tBowen Yang will miss the Oct. 18 taping of “Saturday Night Live.”\n\n\tAccording to a source close to the show, Yang’s absence was preplanned so that t",
    "body": "\n\tBowen Yang will miss the Oct. 18 taping of “Saturday Night Live.”\n\n\tAccording to a source close to the show, Yang’s absence was preplanned so that the “Wicked” star could accept the Academy Museum’s Vantage Award, which honors an emerging artist who challenges and recontextualizes the dominant narratives in TV and film. He was still reportedly present to help write tonight’s episode and will appear in a pre-taped sketch.\n\n\n\tYang took to his Instagram stories on Saturday to announce his one-night departure from the show.\n\t\n\n\t“Missing the show tonight but it will be sooooo fun,” he wrote, “[Sabrina Carpenter] is amazing.”\n\n\tAs noted by Yang, Sabrina Carpenter will serve as host and musical guest for Saturday’s show. This marks the hosting debut for the two-time Emmy winner, although she previously appeared as a musical guest for the Season 49 finale hosted by Jake Gyllenhaal. She also appeared in “SNL 50: The Anniversary Special,” during which she sang with Paul Simon and appeared in a sketch alongside Marcello Hernandez.\n\n\tThe Season 51 premiere was hosted by Bad Bunny with music from Doja Cat. Amy Pohler hosted the following episode, joined by musical guest Role Model. Other upcoming hosts include Miles Teller, who will join for his second time as host on Nov. 26, as well as newcomers Nikki Glaser and Glen Powell, who will host on Nov. 8 and Nov. 15, respectively.\n\n\t“Saturday Night Live” airs every Saturday at 11:30 p.m. ET on NBC and streams on Peacock. Lorne Michaels created and executive produces the show, which is produced in association with Broadway Video.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bowen Yang Reveals Absence From ‘Saturday Night Live’: ‘Missing the Show Tonight’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/09/GettyImages-2234248860-1.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-18T23:49:38.000Z",
      "dateModified": "2025-10-18T23:49:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Lynne Ramsay on Making Robert Pattinson and Jennifer Lawrence ‘Crawl Like Animals’ and Working With ‘Totally Terrifying’ Joaquin Phoenix",
    "url": "https://variety.com/2025/film/festivals/robert-pattinson-jennifer-lawrence-lynne-ramsay-joaquin-phoenix-1236556205/",
    "image": "https://variety.com/wp-content/uploads/2025/10/Lynne-Ramsay.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-18T20:37:45.000Z",
    "description": "\n\tLynne Ramsay‘s filmmaking approach involves quick thinking and fearless actors willing to trust her instincts — even when that means crawling throug",
    "body": "\n\tLynne Ramsay‘s filmmaking approach involves quick thinking and fearless actors willing to trust her instincts — even when that means crawling through grass like animals with just 10 minutes’ notice.\n\n\tSpeaking at a BFI London Film Festival‘s Screen Talk on Saturday, the Scottish director revealed how she salvaged a crucial proposal scene in her latest film “Die My Love” when the light was dropping during the shoot. With no time to complete a conventional scene, Ramsay made an on-the-spot decision.\n\t\n\n\t“I crawl up to him, and I’m like, what we going to do?” she recalled of consulting with cinematographer Seamus McGarvey. “We both look at each other and go, this is it… He gets down to their level in this field, and that’s how he asked to marry her.”\n\n\n\tRamsay had to run up to stars Robert Pattinson and Jennifer Lawrence with the radical change. “Can you just crawl like animals in the grass and roll around?” she asked them. “They were actually really cool about it. They were like, ‘Are you sure about this?’ But they trusted me.”\n\n\tThe director also opened up about her intense working relationship with Joaquin Phoenix on 2017’s “You Were Never Really Here,” revealing that the Oscar winner had never handled firearms before the thriller.\n\n\t“He’s never played anything like this, and guns or anything,” Ramsay said of Phoenix, who she described as “totally terrifying” when they first met. Despite her nervousness — she recalled asking him inane questions like “Are you left handed?” — the pair developed a remarkable creative partnership.\n\n\tPhoenix’s commitment extended to unexpected moments of physical risk. During an upstate New York shoot in a seedy location, Ramsay recalled him spontaneously falling down stairs while cameras rolled. “He just tried,” she said.\n\t\n\n\tThe collaboration proved so strong that on the final night of shooting, Phoenix suggested they continue. “Should we just keep going and get this with the same crew and make a different film?” he asked, according to Ramsay.\n\n\tThe director also shared production challenges on “You Were Never Really Here,” including a French financier who repeatedly told her the film would never get into Cannes — until it did, requiring Ramsay to shoot remaining scenes in just one week. The film went on to win best actor and screenplay at the festival, though not before a last-minute sound mixing controversy when a projectionist declared the audio “beyond the limits.”\n\n\tLooking back at her 1999 debut “Ratcatcher,” Ramsay revealed the ambitious production involved building an actual canal because the real one was polluted. “I don’t think I’d do that” now, she admitted, though she praised the “beauty” in youthful naivety and ambition. Ramsay also revealed she’s working on a treatment for another Glasgow-set film, returning to the city that provided the setting for her acclaimed debut.\n\n\tThroughout the conversation, Ramsay emphasized the importance of finding meaningful details to convey emotion, citing a scene in “Ratcatcher” where a mother darns tights because she can’t afford new stockings as an example of showing love economically.\n\n\t“I’m a dreamer,” Ramsay said of her approach to filmmaking. “You have to be tough to be a dreamer.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lynne Ramsay on Making Robert Pattinson and Jennifer Lawrence ‘Crawl Like Animals’ and Working With ‘Totally Terrifying’ Joaquin Phoenix",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/Lynne-Ramsay.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-18T20:37:45.000Z",
      "dateModified": "2025-10-18T20:37:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jennifer Aniston and Jennette McCurdy Bonded Over ‘Very Similar Moms’ Before ‘I’m Glad My Mom Died’ Shoot: ‘We Have a Lot in Common’",
    "url": "https://variety.com/2025/tv/news/jennifer-aniston-jennette-mccurdy-im-glad-my-mom-died-1236556260/",
    "image": "https://variety.com/wp-content/uploads/2025/10/MixCollage-18-Oct-2025-01-16-PM-5765.jpg?crop=29px%2C40px%2C1153px%2C648px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-10-18T20:27:06.000Z",
    "description": "\n\tBefore stepping into the eponymous role in the upcoming series based on Jennette McCurdy‘s 2022 memoir “I’m Glad My Mom Died,” Jennifer Aniston got ",
    "body": "\n\tBefore stepping into the eponymous role in the upcoming series based on Jennette McCurdy‘s 2022 memoir “I’m Glad My Mom Died,” Jennifer Aniston got to know the child-actor-turned-author. She told People that they bonded quickly, noting they “have a lot in common” and “had very similar moms.”\n\n\tMcCurdy rose to fame at just fifteen years old, becoming the co-star of the Nickelodeon sitcom “iCarly” alongside Miranda Cosgrove, Nathan Kress and Jerry Trainor in 2007. The show ran for six seasons and then McCurdy co-led the spinoff “Sam and Cat” alongside Ariana Grande from 2013 through 2014. In “I’m Glad My Mom Died,” McCurdy recounts her turbulent experience as a child star, with an emphasis on the forceful role of her obsessive and abusive mother, Debra, who passed away in 2013.\n\t\n\n\tApple TV greenlit a series adaptation of McCurdy’s book in July, with Aniston attached to executive produce as well as star as a fictional version of the titular mom. “When it came across my desk as an option, an offer to play this character and work with Jennette and (executive producer) Sharon Horgan and (production company) LuckyChap, I was pretty much immediately intrigued and flattered and excited,” Aniston told People. “It’s going to be wonderful. It’s going to be pretty great to start shooting it.”\n\n\n\tAniston called the memoir “beautifully written” and praised McCurdy as “so special,” saying, “The fact that she’s the young woman that she is, having lived that life, is nothing short of remarkable.”\n\n\tAs for the parallels between McCurdy and Aniston’s mothers, the star did not elaborate, but she has mentioned a contentious relationship with her late mother, Nancy Dow, in previous interviews. In 2018, she told the Sunday Telegraph, “She was a model and she was all about presentation and what she looked like and what I looked like. I did not come out the model child she’d hoped for.”\n\t\n\n\t“I’m Glad My Mom Died” will span ten episodes, created, written and showrun by McCurdy and Ari Katcher. Additional executive producers include Jerrod Carmichael and Erica Kay.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jennifer Aniston and Jennette McCurdy Bonded Over ‘Very Similar Moms’ Before ‘I’m Glad My Mom Died’ Shoot: ‘We Have a Lot in Common’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/MixCollage-18-Oct-2025-01-16-PM-5765.jpg?crop=29px%2C40px%2C1153px%2C648px&resize=1000%2C563"
      ],
      "datePublished": "2025-10-18T20:27:06.000Z",
      "dateModified": "2025-10-18T20:27:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Devil in Disguise’ Star Michael Chernus on Having the ‘Unfortunate Duty of Playing John Wayne Gacy’ and Why It Was the ‘Right Decision’ to Cut His Extensive Finale Scenes",
    "url": "https://variety.com/2025/tv/news/devil-in-disguise-star-michael-chernus-john-wayne-gacy-transformation-1236553670/",
    "image": "https://variety.com/wp-content/uploads/2025/10/DevilinDisguise-MichaelChernus-MAIN.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-18T18:30:00.000Z",
    "description": "\n\tSPOILER ALERT: This post contains spoilers from “Devil in Disguise: John Wayne Gacy,” now streaming on Peacock.\n\n\tWhen Michael Chernus signed on to ",
    "body": "\n\tSPOILER ALERT: This post contains spoilers from “Devil in Disguise: John Wayne Gacy,” now streaming on Peacock.\n\n\tWhen Michael Chernus signed on to stand at the center of Peacock’s new anthology series “Devil in Disguise: John Wayne Gacy,” he wasn’t just landing another role. He was agreeing to be associated with one of the most vile, irredeemable killers in American history for the rest of his career.\n\n\n\tWhenever people Google his name now, it’s likely that his chilling, uncanny turn as Gacy — who killed more than 30 young men in the 1970s — will be among the first photos that pop up. (Though hopefully his fan-favorite turn as self-help guru Ricken Hale on “Severance” will make the cut as well). So Chernus didn’t take the job without considering all the implications, not only for himself but for the story being told. From creator Patrick Macmanus, the new series takes a decidedly different approach to a true-crime story, choosing to focus more heavily on a dozen or so victims than Gacy himself. Extended periods of time pass in the series without Gacy on screen, especially in the final episode, which has only one scene in which his face is visible.\n\t\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tCourtesy of Brooke Palmer/PEACOCK\n\t\n\n\n\n\tWhen he talks about the role now, a year after finishing filming, Chernus puts a self-imposed distance between himself and the process. “You know, I had the unfortunate duty of playing John Wayne Gacy,” he tells Variety.\n\n\tBut Gacy’s limited presence in the series had been made clear to him when he first discussed the role with Macmanus, and it’s one of the reasons he overcame his hesitation to sign on.\n\t\n\n\t“He said to me, ‘I have to warn you, you’re not going to be in every scene. This is not going to be about you, even though you are technically the lead of the show,’” Chernus says of his initial conversation with Macmanus. “I don’t know if he had met with other actors who had turned it down before me because they were upset about that or something, but that was a relief to me! With a person as despicable as Gacy, I don’t want to be in every scene and every frame of the show. And he shouldn’t be.”\n\n\tRather, he doesn’t deserve to be, Chernus adds. Also absent from the series is the signature clown makeup that may be the most well-known facet of Gacy’s story (he slathers it on once in Ep. 6, and never directly to camera). But the most important part of the story left unseen in the series is the gut-wrenching violence Gacy inflicted on his victims, both those who died and the few who survived. Flashbacks to the victims’ stories scarcely  references Gacy by name, nor the ways in which they eventually and fatefully intersect with him, instead depicting the lives they led before they were cut short. One notable exception comes in the sixth episode when Gacy lures his final victim, 15-year-old Robert Piest (Ryker Baloun), back to his home with the promise of a construction job, only to sexually terrorize him. The nearly 10-minute scene stops short of the killing, but it is nevertheless bone-chilling in how it depicts the predatory tactics Gacy deployed in finding, toying with and ultimately murdering his victims.\n\n\tBelow, Chernus talks to Variety about filming that particular scene, which he still has trouble watching; why his extensive research to prepare to play Gacy was still happening each day until he began shooting his scenes — and how he feels about Macmanus’ decision to cut nearly 25 minutes of footage he shot from the finale.\n\t\n\t\tYou have spoken about your hesitations in taking this part, in part because it’s challenging stepping into the mind of a serial killer. The series’ creative team did extensive research, but what did you do on your own to feel comfortable and educated enough to take this on?\t\n\n\tI still find that I’m doing research to remind myself of everything, and be able to answer questions about him now a year later. As you can imagine, the amount of information available is sort of endless. Once I got the job, I read every book I could find, I watched every documentary, I listened to every podcast and watched every bad and weird YouTube video there is. I really went down quite the rabbit hole. We also had an incredible amount of research available to us, because Peacock made a documentary about Gacy a couple of years ago. All this stuff that didn’t make it to the final cut of that documentary, NBC News also made available to us. Patrick also has his own researcher, so the cast members all had access to this dropbox full of stuff, including incredible academic studies of John Gacy’s speech pattern and word choice and syntax use, and a breakdown of the Chicago dialect and his Polish background. Then I took a trip to Chicago before we started shooting, and went to a bunch of places that Gacy frequented. Even though Chicago 2024 looks nothing like Chicago in the 1970s, it was still interesting just to see the distances he would travel on any given night to cruise or, for lack of a better word, hunt for his victims. \n\t\n\n\tEventually, it got to a point where Patrick was like, “You need to put down the books and start focusing on the scripts,” and he was 100% right. I think I could have stayed in the research realm forever. Our show is based on a true story, but it’s not a documentary. It’s a fictional retelling. So I kind of had to eventually just trust that the research was inside me and then let go of it. But on set every day, I would still listen to Gacy’s voice right before we would do a take. There isn’t a ton of video footage of him, but there’s this interview with Robert Ressler and some of that is in the Peacock documentary. I had the whole interview with Ressler and I would watch that a lot, just to sort of study Gacy — the way he talked and the way his face moved and his body moved. This is a long way of saying that I had this feeling there would never be enough research and I had to accept that this was sort of just going to be my own version of this guy. \n\n\n\n\t\n\n\t\t\t\t\tMichael Chernus as John Wayne Gacy\n\t\t\t\t\t\t\t\t\tCourtesy of Brooke Palmer/Peacock\n\t\n\n\n\t\n\t\tWhen you finally dug into it, how was it playing him?\t\n\n\tIn terms of the jobs within our crew, it sometimes felt like we were this theater company — a troop of storytellers coming together to shine light on some of these victims’ voices, which hadn’t been heard, and I just kept drawing the short straw of having to play the villain every night. I care deeply about this story, not about John Gacy’s personal story, but just about the larger story that we were telling. But it was hard to live with. I would come home and some nights, the Chicago dialect and the Gacy voice would kind of creep into my own speaking voice and my wife would be like, “Cut it out! He’s not allowed here.” A tricky part of it, too, was eventually having to commit to embodying him fully in order to tell the story completely. I didn’t really want to be him. That’s why I was hesitant in the beginning. I didn’t want to be in his skin or walk a mile in his shoes. I don’t have any empathy for him. But there came a point where Patrick was like, “In order for us to understand why some of those victims would get in his car or go back to his house or work at his construction company, you have to fully embody him, including the parts of him that were perceived as charming or harmless or even likable.”\n\t\n\n\tIn my first meeting with Patrick, he said to me, “I have to warn you, you’re not going to be in every scene. This is not going to be about you, even though you are technically the lead of the show.” I don’t know if you had met with other actors who had turned it down before me because they were upset about that or something, but that was a relief to me! With a person as despicable as Gacy, I don’t want to be in every scene and every frame of the show, and he shouldn’t be.\n\t\n\t\tWithout showing the violence, the show’s perspective of Gacy’s menace relies heavily on your physical performance of him. Your posture, and the way his demeanor and stare changes in an instant. Did you have to do multiple takes to get the right level of menace? Or was it all instinct?\t\n\n\tWe had to try a bunch of different stuff, and I was so grateful to have Patrick as our showrunner and the directors that we had for all the episodes because we were all on the same page that we didn’t want to do some hackneyed, mustache-twirling kind of serial killer. But at the same time, you needed to see these moments of menace. You needed to see the mask drop, and that was how we started to describe it. So we would just do a lot of takes where the director would say, “Now, let’s try one that’s a little bit more menacing. Or, now let’s do one without any of that.” We tried a bunch of stuff until we started to find a vocabulary and a shorthand, where I knew which version of him we were seeing at any given moment. I never felt like I was having to play the entirety of him all at once. It was always whatever piece he wanted you to see. But we have no footage of that version of him, when the darkness would come out, so I had no idea what that looked like. There are accounts of it from surviving victims who said it looked like his eyes were dead or that his eyes would turn black. I literally couldn’t make my eyes turn black, but I knew what that conjured in terms of an icy coldness. \n\n\n\n\t\n\n\t\t\t\t\tRyker Baloun as Rob Piest with Chernus\n\t\t\t\t\t\t\t\t\tCourtesy of Ian Watson/Peacock\n\t\n\n\n\t\n\t\tThere are very few moments in the series that show Gacy being violent with his victims. The longest and most horrifying scene is in Episode 6, when he lures his final victim, 15-year-old Robert Piest, back to his house, tricks him into handcuffs, threatens to rape him and then ultimately kills him. We don’t see the killing, but we see the terror he put that boy through in his final moments. How was it filming that scene when you had to play Gacy the predator?\t\n\n\tThat episode is really hard for me to watch. It’s the most we see John Gacy in the show, period. It’s the closest we get to seeing not only the violence that he committed, but the manipulation and grooming and gaslighting that he would inflict on these boys. The young actor — Ryker Baloun, who played Rob Piest — is so great. But that was a really difficult day. It’s a long scene, and we spent the entire day shooting it, which is a rare thing on TV. But I think everyone knew that it needed that kind of care and sensitivity. One of the hardest things for me as an actor happens in that scene, because it is the best example of John Gacy switching back and forth from these different kinds of masks and personalities. From all the accounts that I’ve read about it, he would sometimes surprise himself even. That’s not to let him off the hook in any way, but almost like he would black out to some extent for a minute. There’s this moment where the Rob Piest character turns John down for any kind of sexual activity, and I have say to something like, “Well, I’m just going to have to rape you.” Then I attack him, and pull his pants down, and when I’m sitting there on the ground looking at his underwear, I say, “Oh, God, what happened?” That kind of flipping back and forth between the realities of the different Johns, that was such a jarring thing to do as an actor. I can’t imagine what that would have been like for anyone who was alone with him in his home. It’s just such a terrifying thing to be confronted with.\n\t\n\t\n\t\tPatrick Macmanus revealed to Variety that there was about 23 minutes of material you shot for the finale that he decided to cut, some of which showed Gacy in 1994 on the day of his execution. How did you feel about losing that from the last episode?\t\n\n\tI thought it was incredibly brave. Of course, it stung at first, just as an actor and for my own ego. But I understood. By that point, we were so far down the road together, Patrick and I really saw eye to eye on this, and we’re so in lockstep with each other that it made total sense to me. I know it was difficult for him, and difficult for me to digest. Now I know that it was absolutely the right decision. \n\t\n\t\tWas there anything you shot that you were particularly proud of or wish had made the final cut?\t\n\n\tI’m proud of all of it, but I don’t think it should be in the show. Purely as an acting exercise, it was interesting, because we saw an older Gacy at the end of his life in those scenes. It’s the version of him that we all kind of know because it’s from the time he did the only on-camera interviews that exist of him when he was on death row. He’s a more feeble man then, with shock white hair. But I think witnessing anyone on death row about to be executed, there’s some part of your humanity that might want to care for them or feel bad for them. But that was not the show we were trying to make. There’s a scene at the end of the whole series in the finale where the victims’ families didn’t get to witness the execution. That is a true story. They were brought out to the prison, but they had to sit in the basement and just watch the local news and they didn’t get to see it. They weren’t allowed in the execution room or to see him that day, so why should we as an audience get to see it?\n\n\tThis interview has been edited and condensed.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Devil in Disguise’ Star Michael Chernus on Having the ‘Unfortunate Duty of Playing John Wayne Gacy’ and Why It Was the ‘Right Decision’ to Cut His Extensive Finale Scenes",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/DevilinDisguise-MichaelChernus-MAIN.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-18T18:30:00.000Z",
      "dateModified": "2025-10-18T18:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Palme d’Or Winner Jafar Panahi on How He Made the Risky ‘It Was Just an Accident’ in Iran — and Why Americans Should Heed Its Warning",
    "url": "https://variety.com/2025/film/news/jafar-panahi-cannes-it-was-just-an-accident-iran-1236555930/",
    "image": "https://variety.com/wp-content/uploads/2025/05/panahi.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-18T20:06:44.000Z",
    "description": "\n\t“What else is left for them to do that they haven’t done yet?” asks resilient Iranian director Jafar Panahi, who was sentenced to six years in priso",
    "body": "\n\t“What else is left for them to do that they haven’t done yet?” asks resilient Iranian director Jafar Panahi, who was sentenced to six years in prison for “propaganda against the system” after planning a film about protests against the 2009 election. “Are they going to ban me from leaving again? Okay, let them ban me. That way, I have more time, and instead of traveling, I can write my next film. They want to throw me in jail? Okay, let them throw me in jail. Then I will find the topic of my next film.”\n\t\n\n\tAstonishing as it may seem, I have seen Panahi three times outside Iran in the last six months, first in Cannes, where he won the Palme d’Or — the top prize at the world’s most important film festival — for “It Was Just an Accident.”\n\n\n\tNext, I spotted him on the streets of Telluride. He’d traveled all the way to an old mining town high in the mountains of Colorado to receive the prestigious festival’s Silver Medallion. Though nothing is more important to Panahi than cinema, I doubt he can go two hours without a tobacco fix, and there he was, smoking a cigarette in front of the New Sheridan Hotel.\n\n\tJust this past weekend, I was invited to moderate a Q&A with Panahi at the Ojai Playhouse, two hours north of Los Angeles — a unique opportunity to interview a personal hero, who speaks through a translator. The way things are going, I expect we’ll next cross paths at the Academy Awards.\n\n\tIn any case, it’s surreal to encounter Panahi outside of Iran, since the defiant diretor of “This Is Not a Film” and “No Bears” has been under a 20-year ban from leaving the country — or, more to the point, from making movies — since 2010, when he was charged with “propaganda against the system” and sentenced to six years in prison for planning a film about protests against the 2009 election.\n\t\n\n\tPanahi has served about 10 months of that term: the first three while awaiting trail in 2010, and seven more, starting in July 2022, when he presented himself at Tehran’s Evin Prison to question the arrest of a fellow director, Mohammad Rasoulof (whose “The Seed of the Sacred Fig” suggests just how untenable Iran’s repressive regime truly is). Panahi was detained and locked up shortly before the death of Mahsa (Jina) Amini, which sparked the Women, Life, Freedom movement.\n\n\tAfter going on hunger strike in February 2023, Panahi was eventually allowed to return home, and though the authorities have strictly forbidden him from filmmaking, he did more than simply defy them. “It Was Just an Accident” is a direct response to time served.\n\n\t“If I hadn’t gone to prison, I would not have understood these characters, and perhaps this film would never have been done,” Panahi told me. “So I’m not the one who made this film. This film was made by the people who put me in prison.”\n\n\tIn the movie, a man haunted by his time in Evin is convinced that he has found his cruel interrogator, Eqbal, in the outside world. Though he never saw his tormentor’s face in person, the survivor recognizes the sound of Eqbal’s false leg. It’s like “Death and the Maiden,” played for absurdist comedy, as he kidnaps the one-legged stranger, then enlists three fellow survivors to confirm the inspector’s identity and decide what to do.\n\n\tWhen I complimented Panahi on his courage in telling a story so openly critical of his experience, he rejected that word. “To me, it’s really not ‘courage.’ This is the work I do. My work is cinema. In order to do my work and protect the beliefs that I have about cinema, nothing is important to me. We have accepted that where we live, anything you do comes with a price,” Panahi said.\n\n\t“You call me brave, but the truth is that many people are doing things that are way more important,” he continued in full sincerity. “I’ll give you a small example. I met people in prison who would go on hunger strikes for 20 or 30 days, and no one would find out about it, whereas if I stopped eating for two days, the entire world would find out. So, compared to them, my actions are not really being brave.”\n\n\t“It Was Just an Accident” is Panahi’s tribute to those people whose lived experience is reflected in the collection of characters who determine Eqbal’s fate in the film. For seven months, Panahi had been getting to know his fellow prisoners, talking and listening to their stories.\n\t\n\n\t“We were sharing these stories not because I had it in mind to make a film about them. It was just a matter of passing the time, to make the prison days easier. They needed to share their stories, and I needed to hear them,” Panahi said.\n\n\t“The moment I stepped out of prison, I turned around and I looked at those tall walls, and it hit me that my friends were left behind. And as days go by, it just eats you from the inside,” he explained. “So I said to myself one day, ‘I have to do something. What could I do? I don’t know anything other than cinema.’ And then it hits me that this is the language I can speak in — the language of cinema — and that became a motivation for work.”\n\n\tIn the film, Panahi was intentionally sparing with how much he shares about the characters’ backstories. We see that Vahid (Vahid Mobasseri), who thinks he recognizes Eqbal (Ebrahim Azizi), is a simple worker. “Only because he had objected to the situation, they had thrown him in jail,” Panahi told me, though the detail had escaped me in the script. It’s clear that Shiva (Mariam Afshari), the pacifist wedding photographer, and the hot-headed Hamid (Mohamad Ali Elyasmehr) were in a relationship that did not last.\n\n\t“We know that Shiva was a journalist who wrote a piece about bogus drugs, fake medicine, and because of what she exposed, she went to prison,” Panahi said. “Eqbal, the interrogator, was humiliated in his childhood, and those acts of humiliation have affected him in a way that he has now come to power and is trying to prove himself.”\n\n\tThe details may be minimal, but according to Panahi, “I thought this much would be enough for us to be able to follow bigger conversations about the topic of anger, the topic of justice, the topic of forgiveness and, more important than anything, the topic of the cycle of violence and whether it’s going to continue in the future.”\n\n\tThat matters, Panahi believes, because such a system cannot continue indefinitely. The film illustrates as much: Sooner or later, the people will turn on their oppressors, at which point, the debate about what to do with Eqbal anticipates questions of how to handle those who were complicit in the old means of control.\n\n\t“This film is made for the post-Islamic Republic. So I am raising a question in the film: Have we prepared ourselves to do what we need to do for the day after the collapse of the regime?” Panahi said. “I do believe that the collapse is going to happen, but no one knows when — today, tomorrow, in a week, in a month, in a year. No one knows.”\n\t\n\n\tAfter the screening, Panahi admitted that his career had started in a very different vein, far removed from the kind of social consciousness the world first witnessed with “The White Balloon” in 1995 — ethical, ground-level stories about people Panahi lives with or observes on the streets. Before that, as a student, he’d been inspired by one of Hollywood’s greatest directors.\n\n\t“I learned the alphabet of cinema from Alfred Hitchcock. And it helped me later on, so that I wouldn’t have spelling mistakes in my films,” said Panahi, who was enterprising enough to secure a budget from the national TV to make a short film in the style of Hitchcock. “When I got to the editing process, I asked myself, ‘What nonsense have you made?’ The alphabet was correct, but the film had no soul.”\n\n\tIn his shame, Panahi went to the lab, stole the negatives and destroyed them. Afterward, he felt despondent for a time, unsure what kind of contribution he might make to cinema. And then he discovered Italian neorealism — “and especially ‘Bicycle Thieves’” by Vittorio De Sica, he beamed. “I realized that I love socially engaged cinema, but I’m wasting my time in another genre.”\n\n\tOver the course of his first few features, Panahi was content fighting for civil rights, pushing back on the oppression of women with films such as “The Circle” and “Offside,” or else exposing the cost of class differences in “Crimson Gold.”\n\n\tWhen Panahi first received his heavy sentence in 2010, he was reminded of how so many of his students had complained that they found it impossible to work within the Iranian system. Instead of adopting that same defeatist attitude, he thought: “Okay, the authorities have told me not to make a film, so I’m going to shoot something in my own apartment with a friend, and then at the end call it, ‘This Is Not a Film.’”\n\n\tIf he could not make films for a living, Panahi had to come up with another form of income. “The easiest thing for me would be to drive a taxi,” he thought. But even then, Panahi realized, “If I drive a taxi around, I’m still going to place a camera somewhere and tell the stories of my passengers.” That film, “Taxi,” won the Golden Bear at the 2015 Berlin Film Festival.\n\t\n\n\tHe’s grown even more creative since. “When I was working with Mohammad Rasoulof in my apartment, we still did not have much experience, and that’s why they raided my place and took us to prison. We had not taken security measures,” said Panahi, who gradually realized what they needed to do: Now, he keeps his team small and avoids using large equipment, to minimize the attention drawn to his productions. At times, he and Rasoulof direct by proxy, while the crew pretends to be shooting a student film or commercial.\n\n\tCasting is clearly a challenge for Panahi’s movies, which are shot without permits in direct violation of the law (bypassing the obligation to submit his scripts to the Ministry of Culture and Islamic Guidance for approval). He asks potential actors to read the script at his place, then gives them 24 hours to decide if they want to be involved. In theory, their participation could result in punishment — the reason many Iranian films list “Anonymous” where names normally appear in the credits.\n\n\t“I really believe that everyone can act. What matters is that they are chosen correctly,” Panahi said. “The first thing I pay attention to is physical appearance, the body of a potential actor. When the physical characteristics are a match, as soon as you see that person on the screen, you’re halfway there.”\n\n\tPanahi writes the roles first, then looks for the right person to embody them. In “It Was Just an Accident,” the movie opens with Eqbal, which catches audiences off-guard, since they start to sympathize with him — a family man, driving with his young daughter and pregnant wife, who’s upset when a dog runs in front of his car— before meeting Vahid or hearing why he might have reason to hate Eqbal.\n\n\t“As you go through the film and you see the other characters in doubt about who this person is, you as the audience are also in doubt because you remember how distressed he was by having killed a dog,” Panahi explained. Prior to 2022, the filmmaker wouldn’t have dared target such a character — to make Eqbal a metonym for the regime.\n\n\t“When I was in prison, something happened which divided the history of the Islamic Republic into before and after: Women, Life, Freedom,” Panahi said. “Everything changed after that, and cinema could not be separate from it, especially this kind of cinema that claims to be socially engaged. Ordinary people had started to break the red lines. And now cinema also had to go past the red lines.”\n\t\n\n\tLooking back, Panahi recalled a startling experience from the year 2000, when he gave his script for “The Circle” to someone he wanted to work on the film: “When I went to speak to them two days later, they put the script in an envelope and gave it back to me very hastily. They told me, ‘Take this and don’t ever show it to anyone. … You might get stabbed on the street, and your intestines will fall out,’” he said. “Back then, ‘The Circle’ was one step ahead of the society. But since Women, Life, Freedom, cinema was falling behind. The society is now one step ahead of cinema, and we try to catch up.”\n\n\tThat explains something as simple as showing women without the traditional head covering. Before, it was a violation to film actresses without the hijab. But since those 2022 protests, many women have rejected the hijab. “Social cinema is not supposed to lie. If it does not depict these realities, does not stay truthful to this principle, the film will not be believable.”\n\n\tThis evolution in Iranian cinema, represented by Panahi’s latest and Rasoulof’s “The Seed of the Sacred Fig” before it, marks a shift for international audiences as well. Previously, it was easy to watch Panahi’s film with pity for those in what appeared to be a more restrictive theocratic culture.\n\n\tPanahi sees it the other way around, and has warned as much when he travels to other countries. “Unfortunately,” he said, “what we are living in contemporary Iran — what seems like the past — is the future of many places in which we see these signs.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Palme d’Or Winner Jafar Panahi on How He Made the Risky ‘It Was Just an Accident’ in Iran — and Why Americans Should Heed Its Warning",
      "image": [
        "https://variety.com/wp-content/uploads/2025/05/panahi.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-18T20:06:44.000Z",
      "dateModified": "2025-10-18T20:06:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jimmy Kimmel, Robert De Niro, Glenn Close and More Speak Out in Support of No Kings Protests: ‘We’re Rising Up Again’",
    "url": "https://variety.com/2025/film/news/jimmy-kimmel-robert-de-niro-glenn-close-no-kings-protests-1236556296/",
    "image": "https://variety.com/wp-content/uploads/2025/10/GettyImages-2241866355.jpg?crop=0px%2C542px%2C5185px%2C2916px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-10-18T22:17:27.000Z",
    "description": "\n\tHollywood is speaking out in support of the No Kings protests.\n\n\tOn Saturday, hundreds of thousands of Americans across all 50 states took to the st",
    "body": "\n\tHollywood is speaking out in support of the No Kings protests.\n\n\tOn Saturday, hundreds of thousands of Americans across all 50 states took to the streets to protest against President Donald Trump and his administration. ICE’s aggressive raids remain a key issue in the demonstrations, as they were during June’s No Kings protests. Insertions of the National Guard into major metropolitan areas and sweeping cuts to federal programs are also top of mind for protestors.\n\t\n\n\tMark Ruffalo, one of Hollywood’s most vocal stars against the Trump administration, took to Threads to shout out No Kings protests in Gainesville, Fla., Minneapolis, Philadelphia and New York City.\n\n\n\t“Amazing,” he wrote. “So many people love the USA and want NOKINGs.”\n\n\tJimmy Kimmel posted an infographic on Instagram containing dozens of scathing nicknames that protesters can call the president on their signs. Examples include “Commander-in-Theif,” “Greedy McGolfy,” “Mar-a-Lardo,” “Orange Julius Caesar” and “Uncle Scam.”\n\n\tIn the caption, the late-night host wrote, “When you’re making your #NoKings posters, remember… Donald Trump LOVES a good nickname.”\n\n\tOn Oct. 9, Robert De Niro appeared in a video on the TikTok account of political activist group Indivisible to encourage people to attend the No Kings protests.\n\n\t“The original No Kings protest was 250 years ago,” De Niro said. “Americans decided they didn’t want to live under the rule of King George III. They declared their independence and fought a bloody war for democracy. We’ve had two and a half centuries of democracy since then. Often challenging, sometimes messy, always essential.”\n\t\n\n\tHe continued, “Now we have a would-be king who wants to take it away: King Donald the First. Fuck that. We’re rising up again, this time, nonviolently raising our voices to declare: No Kings.”\n\n\tJohn Cusack gave an interview to News 4 San Antonio while at a No Kings protest in Chicago. He said, “It’s all upsetting. Seeing a sort of fascist authoritarian…cosplay that the right wing has been fooling around with for so long, seeing it devolve into the real thing is predictable, but deeply saddening.”\n\n\tOn Facebook, Paul Schrader posted a photo of a No Kings protest in Times Square with the caption “I was there.”\n\n\t8-time Oscar nominee Glenn Close posted a photo to Instagram of her holding a sign that read, “No oligarchs. No dictators. No despots. No autocrats. No kings!!” In the caption, she quoted Abraham Lincoln’s Gettysburg Address, writing, “‘…that government of the people, by the people, for the people, shall not perish from this earth.”\n\n\tSee more celebrities supporting the No Kings protests below. \n\n\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jimmy Kimmel, Robert De Niro, Glenn Close and More Speak Out in Support of No Kings Protests: ‘We’re Rising Up Again’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/GettyImages-2241866355.jpg?crop=0px%2C542px%2C5185px%2C2916px&resize=1000%2C563"
      ],
      "datePublished": "2025-10-18T22:17:27.000Z",
      "dateModified": "2025-10-18T22:17:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sabrina Carpenter Jokes About Provocative Image in ‘SNL’ Monologue: ‘I’m Not Just Horny, I’m Also Turned On and Sexually Charged’",
    "url": "https://variety.com/2025/music/news/sabrina-carpenter-snl-monologue-1236556346/",
    "image": "https://variety.com/wp-content/uploads/2025/10/Screenshot-2025-10-18-at-8.54.29%E2%80%AFPM.jpeg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-19T04:14:41.000Z",
    "description": "\n\tSabrina Carpenter, the host as well as musical guest for this week’s “Saturday Night Live,” used her monologue to riff on her risque image, suggesti",
    "body": "\n\tSabrina Carpenter, the host as well as musical guest for this week’s “Saturday Night Live,” used her monologue to riff on her risque image, suggesting that she wants to be known for more than just being sexually provocative, while of course joking that she indeed has a one-track mind.\n\n\t“Now since I’m here, I want to clear up some misconceptions people have about me,” Carpenter said. “Everyone thinks of me as this, like, horndog pop star, but there’s really so much more to me. I’m not just horny. I’m also turned on and I’m sexually charged. And I love to read. My favorite book is the encyclopedia. It’s so big and it’s hard…”\n\t\n\n\tThe pop star showed the controversial cover photo of her recent “Man’s Best Friend” album. “Some people got a little freaked out by the cover. I’m not sure why,” she said. “It was just this me on all fours with an unseen figure pulling my hair,. But what people don’t realize is, that’s just how they cropped it. If you zoom out, it’s clearly a picture from the 50th anniversary special of Bowen helping me up by the hair…” The image zoomed out further. “…after Martin short shoved me out of the buffet line\n\n\n\tIn any case, Carpenter avowed, “There is a real person underneath all the sparkles and the wigs and the corsets. And another thing you might not know about me is that I love to interact with the audience during my show.” She took to the crowd, interacting with a young man who identified himself as Will from Maryland — both of which, naturally, turned her on. “Ooh, what a sexy, unusual place. See, I love talking to normal people. They’re so fascinating when they’re real like you.”\n\t\n\n\n\tBut when she asked what the audience member did for a living, and he answered “venture capital,” she quickly moved on.\n\n\t“The last one thing I like to do at my concerts is arrest someone for being hot. So who here can I arrest tonight?” Kenan Thompson came out with a pair of pink handcuffs, saying he was arresting her not for being hot but “for falsely impersonating an officer 200 times at your concerts.”\n\n\tThompson said he was actually there to get a Cameo for his daughter, only to have Carpenter tell him that would cost $200,000″ — and while he moved on, she announced that “if anyone else wants one, find me on Venmo.”\n\n\tThe monologue followed an opening Domingo sketch in which Carpenter was one of several women at a birthday party describing a bachelorette-style trip to Nashville while singing spoof versions of Taylor Swift’s “The Fate of Ophelia” and Lady Gaga’s “Abracadabra.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sabrina Carpenter Jokes About Provocative Image in ‘SNL’ Monologue: ‘I’m Not Just Horny, I’m Also Turned On and Sexually Charged’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/Screenshot-2025-10-18-at-8.54.29%E2%80%AFPM.jpeg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-19T04:14:41.000Z",
      "dateModified": "2025-10-19T04:14:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Barbara Palvin -- What's The Big Frigin' Difference?!",
    "url": "https://www.tmz.com/2025/10/18/whats-the-big-frigin-difference-barbara-palvin/",
    "image": "https://imagez.tmz.com/image/84/16by9/2025/10/15/8487e34f32f54fc79e4c687c055aa1c4_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-18T07:01:02.000Z",
    "description": "\n    \n                    \n                          Barbara Palvin\n                          What's The Big\n                          Frigin' Differe",
    "body": "\n    \n                    \n                          Barbara Palvin\n                          What's The Big\n                          Frigin' Difference?!\n                      \n                  \n                        Published October 18, 2025 12:01 AM PDT\n                                                                            \n      \n    \n          Temperatures may be dropping, fall foliage is in full effect, but that ain't stopping model Barbara Palvin from droppin' her pants! Can you pick up the sneaky switches in the two side-by-side photos?\n      \n    \n          The 32-year-old babe hit the NYC streets donning a white puffy jacket, a black leotard and some boots! See if you've got what it takes to put your hand on the changes!\n      \n    \n          HINT: There are THREE differences in the above Barbara Palvin photos!*\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Barbara Palvin\n              \n                          \n                Hotties & Bodies\n              \n                          \n                Hot Bodies\n              \n                          \n                Photo Galleries\n              \n                          \n                Models\n              \n                          \n                Halloween\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Barbara Palvin -- What's The Big Frigin' Difference?!",
      "image": [
        "https://imagez.tmz.com/image/84/16by9/2025/10/15/8487e34f32f54fc79e4c687c055aa1c4_xl.jpg"
      ],
      "datePublished": "2025-10-18T07:01:02.000Z",
      "dateModified": "2025-10-18T07:01:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kevin Federline Money Grab, Taylor Swift Greedy, Cancel Wendy Osefo? You Decide!",
    "url": "https://www.tmz.com/2025/10/18/trending-entertainment-polls/",
    "image": "https://imagez.tmz.com/image/0f/16by9/2025/10/17/0f734321d7fd4b2b9894cf44b60b2a00_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-18T07:45:07.000Z",
    "description": "\n    \n                    \n                          Stars and Scars\n                          You Be the Judge\n                      \n               ",
    "body": "\n    \n                    \n                          Stars and Scars\n                          You Be the Judge\n                      \n                  \n                        Published October 18, 2025 12:45 AM PDT\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Kevin Federline has gone scorched earth on Britney in his new memoir, and Taylor Swift is getting unusual blowback for hyper-marketing her new album. So we gotta ask ...\n      \n      \n      \n          \n            \n              \n                \n                Share on Facebook\n              \n            \n            \n              \n                \n                Share on X\n              \n            \n                          \n                \n                  \n                \n              \n                      \n        \n              \n          \n                          \n                Stars and Scars\n              \n                      \n        \n          \n  ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kevin Federline Money Grab, Taylor Swift Greedy, Cancel Wendy Osefo? You Decide!",
      "image": [
        "https://imagez.tmz.com/image/0f/16by9/2025/10/17/0f734321d7fd4b2b9894cf44b60b2a00_xl.jpg"
      ],
      "datePublished": "2025-10-18T07:45:07.000Z",
      "dateModified": "2025-10-18T07:45:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Guess Who This Forward-Thinking Singer Is!",
    "url": "https://www.tmz.com/2025/10/18/guess-who-forward-thinking-singer/",
    "image": "https://imagez.tmz.com/image/1d/16by9/2025/10/15/1da1751fb04249e1b8b6b582b01b9480_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-18T23:00:01.000Z",
    "description": "\n    \n                    \n                          Guess Who This\n                          Forward-Thinking Singer Is!\n                      \n     ",
    "body": "\n    \n                    \n                          Guess Who This\n                          Forward-Thinking Singer Is!\n                      \n                  \n                        Published October 18, 2025 4:00 PM PDT\n                                                                            \n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          We know plenty of artists are on the fence about the effects of A.I. on the music industry -- and we wanna see if you can guess who this forward-thinking singer is!\n      \n    \n          We caught up with this guy at LAX in May this year, and he was pretty open about not being too afraid of A.I. -- because he claimed no one could do it like he can!\n      \n    \n          Still, he admitted we're likely gonna need a few rules to make sure A.I. doesn't completely replace artists in the future ... and to be fair, we're not sure anyone but this guy could have written a banger like \"Closer!\"\n      \n      \n              \n          \n                          \n                Guess Who\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Guess Who This Forward-Thinking Singer Is!",
      "image": [
        "https://imagez.tmz.com/image/1d/16by9/2025/10/15/1da1751fb04249e1b8b6b582b01b9480_xl.jpg"
      ],
      "datePublished": "2025-10-18T23:00:01.000Z",
      "dateModified": "2025-10-18T23:00:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Charlie Puth and Wife Brooke Sansone Step Out After Announcing Pregnancy",
    "url": "https://www.tmz.com/2025/10/18/charlie-puth-brooke-sansone-dinner-after-pregnancy-reveal/",
    "image": "https://imagez.tmz.com/image/29/16by9/2025/10/18/29e16d7d3ea3474fabc0735dcc41147a_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-19T00:54:32.000Z",
    "description": "\n    \n                    \n                          Charlie Puth & Brooke Sansone\n                          Dinner For Three???\n                     ",
    "body": "\n    \n                    \n                          Charlie Puth & Brooke Sansone\n                          Dinner For Three???\n                          Date Night After Announcing Pregnancy\n                      \n                  \n                        Published October 18, 2025 5:54 PM PDT\n                                                                            \n      \n    \n          Charlie Puth and Brooke Sansone already decided to Marvin Gaye and get it on ... and, we got pics of them hanging out hours after they announced the result -- a baby on the way!\n      \n    \n          Charlie wore a business casual ensemble ... a button-down shirt and work jeans -- with an untied tie wrapped around his neck.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Brooke looked like a vision in a tight white shirt which barely contained her baby bump under a black leather jacket. Uncelar exactly what they're doing here, but they seem content just to be spending time together.\n      \n\n                  \n          \n                          \n                \n                  \n      \n    \n          There's no surprise these two look so happy -- 'cause they've got a little one on the way they just can't wait to meet!\n      \n    \n          As we told you, CP announced the news in the music video for \"Changes\" ... during which he puts both hands on Brooke's stomach. The two stare dreamily into one another eyes before walking out of frame.\n      \n    \n          This is the first child for the happy couple who started dating back in 2022 and tied the knot last year.\n      \n    \n          There are a ton of \"Changes\" coming for the couple ... but, they look just as happy as ever in these pics!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Charlie Puth\n              \n                          \n                Family\n              \n                          \n                Relationships\n              \n                          \n                Baby Watch\n              \n                          \n                Couples\n              \n                          \n                Music\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Charlie Puth and Wife Brooke Sansone Step Out After Announcing Pregnancy",
      "image": [
        "https://imagez.tmz.com/image/29/16by9/2025/10/18/29e16d7d3ea3474fabc0735dcc41147a_xl.jpg"
      ],
      "datePublished": "2025-10-19T00:54:32.000Z",
      "dateModified": "2025-10-19T00:54:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Limp Bizkit Bassist Sam Rivers Dead at 48",
    "url": "https://www.tmz.com/2025/10/18/limp-bizkit-bassist-sam-rivers-dies/",
    "image": "https://imagez.tmz.com/image/4a/16by9/2025/10/19/4afddadf2d6e41b6bde055b394c5ace9_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-19T00:06:21.000Z",
    "description": "\n    \n                    \n                          Limp Bizkit\n                          Bassist Sam Rivers Dead at 48\n                      \n      ",
    "body": "\n    \n                    \n                          Limp Bizkit\n                          Bassist Sam Rivers Dead at 48\n                      \n                  \n                        Published October 18, 2025 5:06 PM PDT\n                                                                      |\n                Updated October 18, 2025 6:05 PM PDT\n                                    \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Sam Rivers -- the bassist for the rock-rap group Limp Bizkit -- has died ... according to an official statement posted to the band's Instagram.\n      \n    \n          The group announced the news Saturday evening ... revealing Sam passed away earlier in the day and calling him their \"heartbeat.\"\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Sam wasn't just a bass player, the group say -- he \"was pure magic. The pulse beneath every song, the calm in the chaos, the soul in the sound.\"\n      \n\n          Outside of the music, the band writes that Sam was a once-in-a-lifetime person and a legend among legends.\n      \n    \n          The message ends, \"Rest easy, brother. Your music never ends.\" They did not reveal a cause of death.\n      \n    \n          Rivers grew up playing with Limp Bizkit drummer John Otto ... and, he met Fred Durst while working at Chick-fil-A in the early 1990s.\n      \n    \n          Rivers, Otto and Durst made up the original iteration of Limp Bizkit ... then, they added guitarist Wes Borland and DJ Lethal to complete their group in 1996.\n      \n    \n          Over the next three decades -- outside of a three-year hiatus from 2006-2009 -- Limp Bizkit rocked stages all over the world. They dropped six studio albums including the critically-acclaimed \"Significant Other\" and \"Chocolate Starfish and the Hot Dog Flavored Water\" in 1999 and 2000 respectively.\n      \n    \n          Among their best known songs ... \"Rollin' (Air Raid Vehicle),\" \"Take A Look Around,\" \"My Way,\" \"Behind Blue Eyes,\" \"Nookie,\" \"Hot Dog\" and \"Break Stuff\" -- the last of which has been streamed almost 1 billion times on Spotify.\n      \n    \n          Rivers temporarily left the group in 2015 ... later revealing it was because he developed a liver disease due to excessive drinking. He received a liver transplant and rejoined the group in 2018.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Rivers was 48.\n      \n    \n          RIP\n      \n    \n          Story developing ...\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                RIP\n              \n                          \n                Celebrity Death\n              \n                          \n                Music\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Limp Bizkit Bassist Sam Rivers Dead at 48",
      "image": [
        "https://imagez.tmz.com/image/4a/16by9/2025/10/19/4afddadf2d6e41b6bde055b394c5ace9_xl.jpg"
      ],
      "datePublished": "2025-10-19T00:06:21.000Z",
      "dateModified": "2025-10-19T00:06:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]