[
  {
    "title": "‘This Whole Thing Is Not Normal’: Inside the ‘Baywatch’ Reboot Casting Call With 2,000 Wannabe Lifeguards",
    "url": "https://variety.com/2026/tv/features/inside-baywatch-reboot-casting-call-1236671569/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Baywatch-Casting-1.jpg?crop=0px%2C0px%2C1920px%2C1080px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-02-26T16:30:00.000Z",
    "description": "\n\tYou simply cannot wear a red Speedo in the rain.\n\n\tThat much is obvious. Everyone knows that.\n\n\tThat’s why, after two days of torrential downpour in",
    "body": "\n\tYou simply cannot wear a red Speedo in the rain.\n\n\tThat much is obvious. Everyone knows that.\n\n\tThat’s why, after two days of torrential downpour in the City of Angels, God has opened the heavens, if only for a few hours, so 2,000 actors, models and wannabes can strip down to their bathing suits under a blue sky and storm the marina at an open casting call for Fox’s reboot of “Baywatch.”\n\n\n\tPeople of all ages and body mass indexes line up like spandex-wearing cattle outside the Marina del Rey Marriott on a recent Wednesday morning and are ushered to the sand for a group photo. A 20-something man cups his genitals as he jogs to the lifeguard tower in nothing but red underwear. A middle-aged woman does some last-minute scissor kicks in the parking lot. The 50-degree weather doesn’t stop some contenders from slow-motion running in the water. Yes, the dream of becoming Hollywood’s next David Hasselhoff or Pamela Anderson is palpable.\n\t\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tSami Drasin for Variety\n\t\n\n\n\n\t“How many of you actually know CPR?” asks a photographer perched on a ladder. Almost everybody raises their hands. “I could save your life,” one man tells me later, without cracking a smile. His manscaped, melanoma-spotted body glistens with oil. I wonder, Am I in danger?\n\n\tWith a straight-to-series order, the reboot will pick up where “Baywatch” left off more than 25 years ago in Los Angeles. The lifeguard drama was a global phenomenon that turned the beaches of Southern California — and the hot, bronzed bodies that patrolled them — into a symbol of American aspiration. The show reached an audience of 1 billion viewers per episode, an impossible feat in today’s skewed content climate. But with a wide-net casting call doubling as a promotional event, Fox is hoping to make an early splash and inspire even a fraction of the original’s audience to return to the sand.\n\t\n\n\tFourteen thousand people submitted reels and headshots, and only 2,000 of them were invited to audition. Hundreds flew across the country to spend 45 seconds reading a few lines of dialogue. Among the people gathered outside the hotel: A mother and daughter with zero acting experience who came in from Colorado. A math tutor in a self-diagnosed “midlife crisis.” An influencer who had never heard of “Baywatch” until she saw the casting call. A woman caked in white face paint who explains, bluntly, “I’m a clown.”\n\n\t“This whole thing is not normal,” says reboot lead Stephen Amell, mingling with his potential future co-stars.\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tSami Drasin for Variety\n\t\n\n\n\n\t“I’ve been acting for a while, and I’ve always been told, ‘You’re too blonde; your boobs are too big,’” says Athena Vas, a bodybuilder and the winner of Season 2 of the Greek version of “The Bachelor.” She turns around to show me the back of her bathing suit, which is stamped with her first name. “So this is the perfect role.”\n\n\tA 77-year-old woman named Margaret “BB” Dupré — clad in a pink cowboy hat, a studded black corset and fingerless gloves — worked as a stand-in for Anderson on the original series (“Any part where Pamela wouldn’t get her hair wet, it was me”). Her business card bears a photo of her in a swimsuit and reads: “Painter/Sculptor/Writer/Psychic.”\n\n\tHeading toward the hotel, not everyone in line is a beach-ready bodybuilder. “I figure lifeguards need moms and neighbors and fruit-stand vendors,” says Denise Koek, an improv actor wearing a sunhat, a blouse, an overshirt and leggings.\n\n\tWhile the series is set to begin shooting in March, the range of opportunities is indeed wide. The producers are looking to cast lifeguards, barflies, extras and even series regulars. “We have a season’s worth of people that need to be saved on the beach,” showrunner Matt Nix tells me. Some roles have yet to be written. “Walking through the lobby, I was like, ‘Oh, wait a second. We didn’t even think about this character, and I just saw three of them,’” Nix says. “I literally just texted the head of casting for Fox.”\n\n\tFor many, “Baywatch” 2.0 marks more than just a reboot but rather a bold bet on Los Angeles, which has yet to fully recover from COVID, strikes and fires. (For a visual, drive up the Pacific Coast Highway and watch the waves smack the bones of charred beach homes that look like ancient ruins.) Multiple previous attempts to revive “Baywatch” were to be shot in South Africa or Australia, but thanks to a $21.1 million California tax credit, the show will be filmed on Venice Beach.\n\t\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tSami Drasin for Variety\n\t\n\n\n\n\t“L.A. has been punched really hard,” says David Chokachi, who returns as Cody Madison in the reboot. “This is like putting the paddles on the city — you know, the defib?”\n\n\tAs far as the tone of the new series, Nix insists the reboot is not campy. “We never make fun of the original,” says McG, who will direct the pilot. “Anything that proves to be as zeitgeisty as ‘Baywatch’ doesn’t deserve snark.” He brings up “Top Gun: Maverick” as a guiding light for how to honor nostalgic IP with a bighearted blockbuster vision.\n\n\tIt is getting cold and windy in the late afternoon as 20 casting directors cycle through auditions with thousands of actors. Press aren’t permitted past the metal detectors that lead to the holding room, where hundreds of actors wait — just on the other side of a black curtain — for their chance at Hollywood stardom. If they impress an initial casting director, they will move on to the next round. Finally, if they’re lucky, they’ll read for the “Baywatch” producers.\n\n\tAs the event winds down, I meet a teenager named Dane Duda, who is visibly shaken as he exits an audition room. “Oh my God,” he says. “That went so well. They loved me!”\n\n\tHis friend, Elle Evan Casselman, has never acted, but her name has “SAG card” written all over it. “My parents got married in Vegas after two weeks of knowing each other, on 11/11. So I’m named Elle Evan,” she tells me. “Say it fast!”\n\n\tCasselman and Duda met for the first time today, two weeks after their mothers “yapped” to each other in the waiting room of a doctor’s office. The moms exchanged their children’s TikTok handles.\n\n\t“I left that room smiling because I know I gave my full heart,” Casselman says of her audition. “At the end of the day, that’s all I can do.”\n\n\tDuda chimes in: “And God’s got us. God’s on our side.”\n\n\tSadly, they are sent doggy paddling home.\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tSami Drasin for Variety\n\t\n\n\n\n\tScanning the crestfallen actors eating chicken wraps in the Marriott lobby, I soon feel I have seen enough heartbreak for one day. But as the sun begins to dip over the marina, I can’t help wondering what is going on behind closed doors. What if, I think, the next star of “Baywatch” was right in front of them all along? Maybe I — a writer who loathes the camera and never so much as appeared in a school play — am the sun-kissed prince that was promised.\n\t\n\n\tCompelled by a strange urge, I turn around, creep toward the private area of the hotel and consider my options. Crew members stand guard, cruising the hallway. I peer inside a trash can and find a crumpled-up sticker — contestant 00937. I stash my press pass, put on the sticker and slink in past the gates.\n\n\tHundreds of actors sit anxiously, reciting dialogue to themselves. A sheepadoodle with a ring buoy lopes into the room as a sunburned gentleman holds up his phone to take a selfie, adjusting the angle to ensure both of his nipples are in the frame.\n\n\tI take a seat next to a handsome 24-year-old Penn Badgley type from Myrtle Beach. “I’m Logan Polson,” he says. “Which part are you reading for?”\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tSami Drasin for Variety\n\t\n\n\n\n\tI do what all great actors do and improvise: “I forgot the name of the character. I lost my paper.”\n\n\tAnother actor, named Alex, turns around and hands me his sides. “I’m off book,” he smiles. “Anthony Hopkins style.”\n\n\t“Let’s read,” Logan says, nudging me on the shoulder, sensing I am out of my depth. “I’m glad you’re here, dude.”\n\n\tSuddenly, I am a lifeguard on the verge of a breakdown.\n\t\n\t\tETHANThat guy slipped right out of my hands. I saw him go under.\t\n\t\n\t\tLOGANAnd I caught him and he was fine! So you made a mistake!\t\n\n\tI’m not built for the beach, but Logan is talking me off the ledge.\n\t\n\t\tLOGANThink of the people who will get hurt if you quit. What about them?\t\n\n\tHis face lights up. He’s not looking at the page.\n\t\n\t\tEthan looks at Logan, cracking a smile. Their eyes meet.\t\n\t\n\t\tETHANSo this is about a bunch of imaginary future people you think I’m gonna save?\t\n\t\n\t\tLOGAN(takes Ethan’s hand)Well, not just about them.\t\n\n\tMy heart races as I claw myself out of the fantasy. “You did great, dude,” Logan says. And for a second, I believe him. A smile washes over my face as I feel the warm glow of an event coordinator hovering over me.\n\n\t“They’re ready for you.”\n\n\tAnd in that moment, I realize I have drifted too far out to sea.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘This Whole Thing Is Not Normal’: Inside the ‘Baywatch’ Reboot Casting Call With 2,000 Wannabe Lifeguards",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Baywatch-Casting-1.jpg?crop=0px%2C0px%2C1920px%2C1080px&resize=1000%2C563"
      ],
      "datePublished": "2026-02-26T16:30:00.000Z",
      "dateModified": "2026-02-26T16:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chinese Producers Push Microdramas and U.K. Partnerships at Mip London",
    "url": "https://variety.com/2026/tv/markets-festivals/chinese-producers-microdramas-uk-partnerships-mip-london-1236673582/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Mip-London.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-26T16:15:17.000Z",
    "description": "\n\tChinese producers are positioning microdramas as a key export vehicle while accelerating U.K. co-production partnerships, speakers said at the “Chin",
    "body": "\n\tChinese producers are positioning microdramas as a key export vehicle while accelerating U.K. co-production partnerships, speakers said at the “Chinese Drama Trends” forum at Mip London, underscoring a dual-track strategy of global expansion and format diversification.\n\n\tOpening the session, Bi Haibo, minister counsellor for press and public affairs at the Chinese Embassy in the U.K., said Chinese television has made “remarkable progress in thematic innovation, production quality and global distribution,” with more series “reaching audiences here in the U.K. and across the global serving as cultural bridges that connect people and foster mutual understanding.”\n\t\n\n\tBi also referenced agreements signed during U.K. Prime Minister Keir Starmer’s recent visit to China, including partnerships between China Media Group and British counterparts that he said had “expanded collaboration in the media and cultural sectors.”\n\n\n\tBi noted that since Feb. 17, China has implemented a unilateral visa free policy for U.K. nationals, “which will further facilitate people to people exchanges and practical cooperation between our two countries,” urging industry players to “take full advantage of this policy.”\n\n\tRupert Daniels, director of services and skills at the U.K. Department for Business and Trade, pointed to the scale of Britain’s creative economy – employing nearly 3 million people and exporting roughly £60 billion ($81 billion) globally – and cited existing collaborations such as the Chinese-language adaptation of “Inside No. 9” and co-productions involving BBC Studios, Tencent, Bilibili and Phoenix TV.\n\t\n\n\tQiu Yuanyuan, secretary-general of the Jiangsu International Communication Center at Jiangsu Broadcasting Corporation, moderated the discussion, which focused on how Chinese content can travel more effectively in international markets.\n\n\tGary Woolf, executive VP of strategic development at All3Media International, said globally viable projects require strong production partners and universal storytelling. “We’re looking at the quality of the production company… the quality of the idea… how universal some of the themes of that show might be,” he said, adding that distributors also weigh budget levels and commissioning broadcasters.\n\n\tGuo Feng, chair of Yulele Media Group, said his company’s slate blends Chinese cultural specificity with universal themes. His wartime-set project “Tile Cat,” he said, centers on “family bonding… generational love… struggles between lovers and reconciliations,” arguing that “the theme is universal.”\n\n\tWhile traditional long-form Chinese-language dramas face hurdles in Europe, Roy Lu, general manager of Linmon Media International, argued that microdramas present a more agile export pathway.\n\n\t“We Chinese [are] very good at microdramas,” Lu said, noting that “roughly every day, we have 200 to 300 titles becoming available” in China. He added that the format’s rapid turnaround allows companies to test audience response and adjust quickly for overseas markets.\n\n\tQiu Zhengyang, deputy general manager of Hangzhou Jiaping Pictures, said his company now operates separate long-form drama and microdrama divisions. “I don’t think they will fight each other. I think they can be two parts of the future,” she said, arguing the formats will coexist rather than compete.\n\n\tLiyanne Marie Manning, head of casting at Onset Octopus, described the production pace of U.K.-based vertical drama shoots, emphasizing the need for immediate audience engagement. “If you don’t get that on your screen in 30 seconds and that doesn’t hit then… I’ve not done a good job,” she said.\n\n\tQiu Qianyi, chief representative (Office of Hong Kong & Macau SAR) at Shenzhen Media Group, promoted Shenzhen as a growing hub for short-form production, highlighting the China International New Media Short Film Festival, which she said has received 60,000 short films from more than 200 countries and supported nearly 300 directors. She described the city as building “an ecosystem for the microdrama studio.”\n\t\n\n\tDespite language and market-entry barriers, the overarching message was one of expansion – with microdramas emerging as a strategic tool for global reach alongside deepening U.K.–China production ties.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chinese Producers Push Microdramas and U.K. Partnerships at Mip London",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Mip-London.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-26T16:15:17.000Z",
      "dateModified": "2026-02-26T16:15:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘The Testament of Ann Lee’ Sets Digital Release, Including Behind-the-Scenes Bonus Feature",
    "url": "https://variety.com/2026/shopping/news/how-to-watch-testament-of-ann-lee-online-streaming-1236672833/",
    "image": "https://variety.com/wp-content/uploads/2024/12/The-Testament-of-Ann-Lee-2.jpg?crop=0px%2C47px%2C900px%2C506px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-02-26T15:00:00.000Z",
    "description": "\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.\n\n\tAnn Lee i",
    "body": "\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.\n\n\tAnn Lee is officially getting resurrected for streaming.\n\n\tSearchlight Pictures’ music-infused historical drama from Mona Fastvold is set to debut on digital platforms March 10. The film will be available to rent or purchase on Amazon Prime Video, Apple TV and Fandango at Home.\n\n\tThe digital release will also include a bonus featurette, “The Testament of Ann Lee: A Special Look,” offering a behind-the-scenes glimpse at the making of the film. The extra includes commentary from Fastvold and Amanda Seyfried, as well as insight into the research, choreography, set design, cinematography, music and costume work that shaped the film’s austere, transportive aesthetic.\n\n\n\tCo-written by Fastvold and Brady Corbet (“The Brutalist”), the film is a richly cinematic retelling of the life of Ann Lee, the 18th-century founder of the Shaker movement. Seyfried stars as the sect’s revered and radical leader, portraying Lee as a visionary who preached gender and social equality while attempting to build a utopian community in early America.\n\n\tInspired by Fastvold’s discovery of Shaker hymns, the film reimagines the community’s music as an emotional backbone to Lee’s story, blending ecstatic musical sequences with the agony and isolation of her mission. “There’s something about doing things — like these very, very difficult films that nobody wants until they’re made — that really spoke to me as an artist,” she told Variety during the film’s premiere at Venice Film Festival.  “There’s an obsession there.”\n\n\tIn his review for Variety, critic Guy Lodge wrote that the film is a “robust, often stirring cradle-to-grave saga with more narrative emphasis placed on communal discord and well-being than on individual yearnings and frustrations,” adding that Seyfried is “quite dazzling as Ann the self-made icon, wielding a poised, peaceable but controlling authority on scene after scene while rarely raising her voice except in lilting song.”\n\n\n\tPurchase/rent “Testament of Ann Lee” on Prime Video starting March 10.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘The Testament of Ann Lee’ Sets Digital Release, Including Behind-the-Scenes Bonus Feature",
      "image": [
        "https://variety.com/wp-content/uploads/2024/12/The-Testament-of-Ann-Lee-2.jpg?crop=0px%2C47px%2C900px%2C506px&resize=1000%2C563"
      ],
      "datePublished": "2026-02-26T15:00:00.000Z",
      "dateModified": "2026-02-26T15:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sky Teaming With Starz on 50 Cent-Produced British Boxing Drama ‘Fightland’",
    "url": "https://variety.com/2026/tv/global/sky-starz-50-cent-british-boxing-drama-fightland-1236673481/",
    "image": "https://variety.com/wp-content/uploads/2024/11/GettyImages-2156429180.jpg?crop=0px%2C316px%2C6000px%2C3375px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-02-26T15:00:00.000Z",
    "description": "\n\tBrit broadcaster Sky has got in the ring once more with Starz, this time for the boxing drama “Fightland,” executive produced by Curtis ’50 Cent’ Ja",
    "body": "\n\tBrit broadcaster Sky has got in the ring once more with Starz, this time for the boxing drama “Fightland,” executive produced by Curtis ’50 Cent’ Jackson. \n\n\tSky has joined Starz as co-commission partner on the series, set in the cutthroat, high-stakes world of British boxing, having already teamed with the U.S. network on projects including the period drama “Amadeus” and darkly comic thriller “Sweetpea.” The co-commission deal also includes Sky future first look partnerships on select upcoming series from Starz. \n\t\n\n\tDescribed as a gripping story of redemption, betrayal, and brutal ambition in and out of the ring, “Fightland” follows Maduka “Duke” Kilroy (Howard Charles), a disgraced, formerly incarcerated boxing champion who returns to London to seek vengeance against the crime family he thinks betrayed him. \n\n\n\tThe 8-episode series — season one of which recently wrapped in London — is slated to air later this year in the U.S. on the Starz app and platform, and will broadcast on Sky and the streaming service NOW in the U.K. and Ireland. Executive-produced by Jackson through his G-Unit Film & Television, it marks Starz’s first wholly owned series.\n\n\t“We’re thrilled to be stepping back in the ring with our partners at Sky and look forward to building upon the next chapter of our long-standing creative collaboration together,” said Kathryn Busby, president of original programming, Starz. “‘Fightland’ delivers a dynamic blend of action and fearless, character-driven storytelling set against the vibrant backdrop of British boxing. We’re proud to debut this bold drama as our first-fully owned original series.”\n\t\n\n\tAdded Katie Keenan, group director of acquisitions for Sky UK and Europe: “‘Fightland’ is a bold and compelling British production with a distinctive voice and the potential for true global impact. We are proud to partner with Starz to continue offering premium, character-driven storytelling for our customers. This series is a natural fit for our growing Sky audiences who are drawn to ambitious, high-impact drama.”\n\n\tJackson is executive producer, along with Francis Hopkinson (“Wallander,” “Bancroft”) and Kate Leadbetter (“Woman in White,” “Catherine the Great”) of Expanded Media who also produce. Damione Macedon (“Power,” “BMF,” “Genius: MLK/X”) and Raphael Jackson Jr. (“Power,” “BMF,” “Genius: MLK/X”) are showrunners, executive producers and writers. Daniel Fajemisin-Duncan and Marlon Smith serve as executive producers and writers.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sky Teaming With Starz on 50 Cent-Produced British Boxing Drama ‘Fightland’",
      "image": [
        "https://variety.com/wp-content/uploads/2024/11/GettyImages-2156429180.jpg?crop=0px%2C316px%2C6000px%2C3375px&resize=1000%2C563"
      ],
      "datePublished": "2026-02-26T15:00:00.000Z",
      "dateModified": "2026-02-26T15:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Heated Rivalry’ Season 2 Eyes April 2027 Release Date and Films This Summer, Says Creator",
    "url": "https://variety.com/2026/tv/news/heated-rivalry-season-2-release-date-1236673489/",
    "image": "https://variety.com/wp-content/uploads/2026/02/connor-storrie-hudson-williams.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-26T14:53:34.000Z",
    "description": "\n\tSeason 2 of “Heated Rivalry” is coming “as soon as humanly possible,” according to series creator Jacob Tierney.\n\n\tTierney appeared alongside execut",
    "body": "\n\tSeason 2 of “Heated Rivalry” is coming “as soon as humanly possible,” according to series creator Jacob Tierney.\n\n\tTierney appeared alongside executive producer Brendan Brady on “CBS Mornings” on Thursday and gave Gayle King an update on how the next installation of their hockey romance drama is progressing. Production on Season 2 is slated to begin this August, with an expected release date in April 2027.\n\n\n\t“There will be more Heated Rivalry on your TVs truly as soon as humanly possible,” Tierney told King, leaning into the show’s secret romance and saying fans should “enjoy the yearn” until they can watch new episodes.\n\t\n\n\t“Heated Rivalry” is based on the “Game Changers” book series by Rachel Reid. The series, produced by the Crave in Canada and streaming on HBO Max in the U.S., follows star hockey players Shane Hollander (Hudson Williams) and Ilya Rozanov (Connor Storrie), “two of the biggest stars in Major League Hockey, bound by ambition, rivalry and a magnetic pull neither of them fully understands,” according to the official series description. “What begins as a secret fling between two fresh-faced rookies evolves into a years-long journey of love, denial and self-discovery. Over the next eight years, the pair chase glory on the ice while struggling to navigate their feelings off it. Torn between the sport they live for and the love they can’t ignore, Shane and Ilya must decide if there is room in their fiercely competitive world for something as fragile and as powerful as real love.”\n\n\tThe news comes after Reid announced that “Unrivaled,” the upcoming seventh book in the “Game Changers” series, has been delayed from from its planned Sept. 29 release date to June 1, 2027 as she deals with worsening symptoms of her Parkinson’s disease as well as a busier schedule due to the exploding success of “Heated Rivalry.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Heated Rivalry’ Season 2 Eyes April 2027 Release Date and Films This Summer, Says Creator",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/connor-storrie-hudson-williams.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-26T14:53:34.000Z",
      "dateModified": "2026-02-26T14:53:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Megan Thee Stallion to Make Broadway Debut in ‘Moulin Rouge!’ as Gender-Flipped Harold Zidler",
    "url": "https://variety.com/2026/legit/news/megan-thee-stallion-broadway-debut-moulin-rouge-1236673588/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Megan-Thee-Stallion-Photo-Credit-Hot-Girl-Productions.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-26T16:13:26.000Z",
    "description": "\n\tMegan Thee Stallion will make her Broadway debut in “Moulin Rouge! The Musical.” She’s stepping into the role of nightclub impresario Harold Zidler,",
    "body": "\n\tMegan Thee Stallion will make her Broadway debut in “Moulin Rouge! The Musical.” She’s stepping into the role of nightclub impresario Harold Zidler, a part originated by Tony winner Danny Burstein.\n\n\tShe will take the stage at the Al Hirshfeld Theatre on March 24 for an eight-week engagement that runs through May 17. Megan Thee Stallion’s turn will mark the first time a female-identifying performer is portraying the character in any “Moulin Rouge” production worldwide. Since Burstein departed the production, Tituss Burgess, Boy George and Wayne Brady have welcomed audiences to the legendary Parisian venue as Harold Zidler. “RuPaul’s Drag Race” winner Bob the Drag Queen is currently in the role through March 22.\n\t\n\n\t“Stepping onto the Broadway stage and joining the ‘Moulin Rouge! The Musical’ team is an absolute honor,” Megan Thee Stallion said. “I’ve always believed in pushing myself creatively and theater is definitely a new opportunity that I’m excited to embrace. Broadway demands a different level of discipline, preparation and storytelling, but I’m up for the challenge and can’t wait for the Hotties to see a new side of me.”\n\n\n\t“Moulin Rouge! The Musical” will close on July 26 after seven years on Broadway. By then, “Moulin Rouge” will have played 2,265 regular performances and 24 previews, making it the 36th longest-running show in Broadway history. Producers didn’t give a reason for closure. Although the production has been playing to nearly full houses, “Moulin Rouge! The Musical” is enormously expensive to mount because of the music rights and the elaborate, glittering set. \n\t\n\n\tAn adaptation of Baz Luhrmann’s 2001 musical “Moulin Rouge,” the show uses music including Elton John’s “Your Song,” “Lady Marmalade,” Sia’s “Chandelier,” Katy Perry’s “Firework” and Beyonce’s “Single Ladies” to score a story about bohemians in the Parisian neighborhood of Montmartre who are trying to keep their nightclub in business. Producers hinted that theatergoers will hear some of Megan Thee Stallion’s songs in the jukebox musical. The Grammy winner is best known for hits like “Bodak Yellow,” “I Like It,” “Savage (Remix)” with Beyoncé and “WAP” with Cardi B.\n\n\t“Welcoming Megan Thee Stallion into the ‘Moulin Rouge! The Musical’ community is a thrilling moment for us,” said producer Carmen Pavlovic. “Megan is a true global superstar. She is one of the most influential artists of her generation and her impact on music and culture is undeniable. This historic casting is a major part of our closing celebrations: our farewell gift to Broadway audiences and one of our biggest announcements in the history of Moulin Rouge! The Musical. We want our show to go out with a spectacular bang, and Megan is the force of nature to lead us there. And yes, there will be a hint of music from her own iconic catalogue. It’s an unmissable moment for both Megan’s fans and ours.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Megan Thee Stallion to Make Broadway Debut in ‘Moulin Rouge!’ as Gender-Flipped Harold Zidler",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Megan-Thee-Stallion-Photo-Credit-Hot-Girl-Productions.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-26T16:13:26.000Z",
      "dateModified": "2026-02-26T16:13:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Scripps CEO Adam Symson Renews Contract Through 2029 Amid Company’s Major Cost-Cutting Plan, Reacquisition of 23 ION Affiliate TV Stations",
    "url": "https://variety.com/2026/tv/news/scripps-ceo-adam-symson-renews-contract-repurchase-ion-stations-1236673479/",
    "image": "https://variety.com/wp-content/uploads/2021/03/scripps_adam_symson_-e1617207752218.jpg?w=800&h=450&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-26T14:39:53.000Z",
    "description": "\n\tE.W. Scripps Co. has renewed its contract with CEO Adam Symson through 2029. \n\n\tSymon’s new contract includes a large one-time $10 million performan",
    "body": "\n\tE.W. Scripps Co. has renewed its contract with CEO Adam Symson through 2029. \n\n\tSymon’s new contract includes a large one-time $10 million performance-based cash award tied to  Scripps’ target of boosting adjusted earnings by between $125-150 million over the next three years.\n\n\tThe longer-pact announcement came during the company’s quarterly earnings call Thursday, when Symson briefed analysts on Scripps’ plans for major cost-cutting moves, as well as its pending $54 million reacquisition of 23 ION-affiliated TV stations, which it originally divested in 2021 to INYO Broadcast Holdings. Scripps sees that deal, which is subject to regulatory approval, as being “immediately accretive” to its networks segment profit.\n\t\n\n\t“Several weeks ago, we gathered more than 200 Scripps employees together to begin executing this transformation plan. And in the weeks since, the circle has been steadily expanding,” Symson said. “Our colleagues across the country are engaged in this work and are excited by the opportunity to drive this important company farther, faster and into the future. And so am I. The next few years will be pivotal as we accelerate our momentum. So I’m grateful that the Scripps board has decided to extend my contract until the end of 2029. I have the collective creativity and talent of nearly 5,000 colleagues behind me. I believe deeply in our ability to execute yet another Scripps transformation, and I am committed to seeing it through. And now, operator, we’re ready for questions.”\n\n\n\tDuring the call Thursday, Symson and other Scripps execs declined to confirm the exact number of layoffs that are expected across the company, but noted that workforce reductions are not the only cost-saving move planned. Leadership reiterated that cost savings and revenue growth initiatives will “leverage technology including AI and automation” and increase revenue yield for its existing businesses.\n\t\n\n\t“Over the last couple of years, as fragmentation has proliferated and people have turned to more and more platforms for the news and information, we have continued to ask our employees to do more with less, and that has diminished the quality of our product,” Symson aid. “AI opens up the opportunity for us to actually ensure that our reporters, our field journalists, are spending their time doing that which they got into the business to do: actually report. To ensure that they are connecting with the communities that they serve, to ensure that they are speaking directly to our consumer, to ensure that they are actually able to attend the news events and not have to rush off in order to then post something on the web, and then immediately put something on social media, and then do four live shots. And so using AI in order to care for some of those things is already opening up opportunity for our journalists to spend more time doing journalism and less time doing what I would characterize as some of the performative aspects, or the distribution or production aspects of their job.” \n\n\tSymson added: “We want them creating the content. That’s where the value is. That’s what differentiates us from the commodity news and information that’s out there. We don’t want them spending their time rewriting broadcast scripts into an AP Style story that can go on the web. There’s technology that can care for that, and we’re already using it.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Scripps CEO Adam Symson Renews Contract Through 2029 Amid Company’s Major Cost-Cutting Plan, Reacquisition of 23 ION Affiliate TV Stations",
      "image": [
        "https://variety.com/wp-content/uploads/2021/03/scripps_adam_symson_-e1617207752218.jpg?w=800&h=450&crop=1"
      ],
      "datePublished": "2026-02-26T14:39:53.000Z",
      "dateModified": "2026-02-26T14:39:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘For All Mankind’ Spinoff ‘Star City’ Unveils First-Look Photos",
    "url": "https://variety.com/2026/tv/news/for-all-mankind-star-city-first-look-1236673072/",
    "image": "https://variety.com/wp-content/uploads/2026/02/StarCity_101_F01063223F.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-26T15:00:00.000Z",
    "description": "\n\tApple TV has unveiled first-look photos for “Star City,” the new series expanding the world of “For All Mankind.” From creators Ben Nedivi, Matt Wol",
    "body": "\n\tApple TV has unveiled first-look photos for “Star City,” the new series expanding the world of “For All Mankind.” From creators Ben Nedivi, Matt Wolpert and Ronald D. Moore, the series will debut with two episodes on Apple TV on May 29, running through July 10.  \n\n\tThe eight-episode series “is a propulsive paranoid thriller that takes us back to the key moment in the alt-history retelling of the space race — when the Soviet Union became the first nation to put a man on the moon,” reads the official logline. “But this time, we explore the story from behind the Iron Curtain, showing the lives of the cosmonauts, the engineers, and the intelligence officers embedded among them in the Soviet space program, and the risks they all took to propel humankind forward.” \n\t\n\n\tThe series will star Rhys Ifans (“House of the Dragon”), Anna Maxwell Martin (“Motherland”), Agnes O’Casey (“Black Doves”), Alice Englert (“Bad Behaviour”), Solly McLeod (“House of the Dragon”), Adam Nagaitis (“Chernobyl”), Ruby Ashbourne Serkis (“I, Jack Wright”), Josef Davies (“Andor”) and Priya Kansara (“Bridgerton”). \n\n\n\tVariety first reported that “For All Mankind” would be getting a spinoff back in 2024 when the show was renewed for its fifth season, which will premiere on March 27. The alternate history series first premiered in 2019, and stars Joel Kinnaman, Toby Kebbell, Edi Gathegi, Cynthy Wu, Coral Peña and Wrenn Schmidt, alongside other series regulars. \n\n\tWolpert and Nedivi serve as showrunners and executive produce alongside Moore and Maril Davis of Tall Ship Productions, as well as Andrew Chambliss and Steve Oster. “Star City” is produced for Apple TV by Sony Pictures Television.\n\t\n\n\tSee first-look images here. \n\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tCourtesy Of Apple\n\t\n\n\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tCourtesy Of Apple\n\t\n\n\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tCourtesy Of Apple\n\t\n\n\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tCourtesy Of Apple\n\t\n\n\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tCourtesy Of Apple\n\t\n\n\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tCourtesy Of Apple\n\t\n\n\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tCourtesy Of Apple\n\t\n\n\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tCourtesy Of Apple\n\t\n\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘For All Mankind’ Spinoff ‘Star City’ Unveils First-Look Photos",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/StarCity_101_F01063223F.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-26T15:00:00.000Z",
      "dateModified": "2026-02-26T15:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NBC Expects Savannah Guthrie’s ‘Today’ Return, but Timeline Remains Uncertain",
    "url": "https://variety.com/2026/tv/news/nbc-savannah-guthrie-today-return-timeline-uncertain-1236673401/",
    "image": "https://variety.com/wp-content/uploads/2026/02/savannah-guthrie-1.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-26T14:40:00.000Z",
    "description": "\n\tThe new normal at NBC’s “Today” is anything but.\n\n\tAnchors at the long-running A.M. franchise have grappled with many challenges over the years, ran",
    "body": "\n\tThe new normal at NBC’s “Today” is anything but.\n\n\tAnchors at the long-running A.M. franchise have grappled with many challenges over the years, ranging from personal health issues to talent transitions, but this past month has presented a set of circumstances that are believed to be without parallel: Nancy Guthrie, mother of longtime “Today” co-anchor Savannah Guthrie, has been missing since January 31, and an agonizing search is in progress around her home in Arizona, leaving producers not only to manage coverage thoughtfully, but also to ponder how to fill Savannah Guthrie’s seat for an undefined interim.\n\t\n\n\t“This situation is tragically unprecedented, and I think it’s really hard to compare anything else to what Savannah and her family are dealing with right now,” says Katie Couric, who famously worked as a co- anchor at “Today” between 1991 and 2006, during a recent interview. “I do think morning shows are living, breathing organisms, and when something happens to a member of these very close-knit teams, it is devastating, I think, to everyone. I think the ‘Today Show’ team is doing the best they possibly can, and it must be excruciating to try to carry on, but also to cover a story about a beloved colleague.”\n\n\n\tHow has “Today” handled the matter? Hoda Kotb, the veteran “Today” co-anchor who left full-time duties early last year, has rejoined the show on an interim basis, and is holding forth with Craig Melvin. Kotb will stay while Guthrie is with her family, according to a person familiar with the matter. Guthrie is expected to return to the show on her own timeline, even if she requires a significant period to feel ready to do so, this person says.\n\t\n\n\tEach morning, Melvin and Kotb inform viewers that their colleague “remains with her family,” and typically offer a segment about the search for Nancy Guthrie. In the case’s earliest days, the Guthrie story led the “Today” news report, but in more recent broadcasts, the anchors have tackled severe weather, the arrest of former Prince Andrew in the U.K. and the recent State of the Union speech before turning to the Guthrie case. Liz Kreutz, an NBC News correspondent, remains on the ground in Arizona to keep up on the latest details. “Today” has also offered an array of stories about people lending support to the Guthrie family, including a sorority at Savannah Guthrie’s alma mater in Arizona and neighbors of Nancy Guthrie who keep looking out for new clues.\n\n\tInterest in the case remains high. NBC News broke into programming with a special report earlier this week, anchored by Kotb and Melvin, detailing a $1 million reward from the Guthrie family for their mothers’ recovery. Savannah Guthrie delivered an emotional message asking for information on her mother, while nodding to the dire circumstances surrounding her absence.\n\n\tHaving Kotb on hand offers a viable solution for NBC and “Today” producers. She’s already affiliated with the show, and adding someone new to the mix during such a difficult moment could be ill advised The introduction of someone less known to viewers to fill in more regularly for Guthrie — even on an interim basis — could alienate the audience, which has a years-long relationship with her and doesn’t want to see her treated poorly, particularly under duress. The first two hours of “Today” generated nearly $203.5 million in 2025, according to Guideline, a tracker of ad spending.\n\n\t“They are fortunate that Hoda, who is a familiar and beloved face, is able to step in so seamlessly under very difficult circumstances,” says Couric. “I think they are trying to handle it as well as they possibly can.”\n\n\tAmid an emotional and chaotic era for the program come some potential reasons to take a breath: Support for Savannah Guthrie and interest in her family’s plight have buoyed “Today” even as its staff tries to master difficult terrain.\n\n\tMorning-show audiences have tuned in more to “Today” in recent weeks. Viewership for “Today” for the five days ended February 20 rose 19%, or 517,000 viewers, according to data from Nielsen, compared to the year-earlier period. That viewership hike follows one of 30% in the prior week and one of 23% in week before that.\n\t\n\n\tAudiences for main rival “Good Morning America” on ABC ticked up 6% for the five days ended February 20, while viewership for “CBS Mornings” was off 14%.\n\n\tIt’s not clear how much of a boost can be attributed to the Winter Olympics. In 2022, “Good Morning America” won more viewers overall than “Today” during NBC’s first week of coverage of the extravaganza from Beijing, the first time it was able to do so in the first week of a Winter Olympics in more than three decades. Next week’s ratings report could be a pivotal one for the program, as it will reveal how much of the surge at “Today” has been due to a halo effect tied to the Olympics and how much the Guthrie crisis has galvanized the potential audience for the show.\n\n\tThere also appears to be an internal loyalty to Savannah Guthrie, who has served as the “glue” of the program since being elevated to an anchor in “Today’s” flagship 7 a.m. to 9 a.m. hours in 2012. Guthrie has proven instrumental in helping “Today” muscle past some difficult moments.\n\n\t She replaced Ann Curry, who exited in an emotional moment that soured some viewers on the program and boosted interest in “GMA,” and played a critical role during a rebuilding period for the show. It was Guthrie and Kotb who were tasked on the morning of November 29, 2017 , with informing viewers that longtime anchor Matt Lauer had been ousted by NBC, which cited “inappropriate sexual behavior,” a claim that he denied. She has kept up with the demanding morning news role even while over the years juggling an eye injury resulting from a mishap at home, and, more recently, surgery on her vocal cords, which she has used daily for years in service to NBC.\n\n\tShe has helped NBC in some critical spots as well, and not just during Election Night or special reports. She presents NBC’s coverage of the Thanksgiving Day Parade, a spectacle that has taken on more economic importance to the network in recent years as advertisers hunt for programs that draw large, simultaneous crowds.  In 2020, she boosted NBC after it made a controversial decision to hold a town hall with President Donald Trump opposite a similar event by then-Democratic candidate Joe Biden, which was being televised by ABC. Guthrie kept a tight rein on the proceedings. “You’re the president, you’re not like somebody’s crazy uncle who can retweet whatever,”  Guthrie told President Trump after asking why he had recently retweeted a conspiracy theory.\n\t\n\n\t“These are serious times we are living in,” she told Variety in January of 2020 while speaking about her “Today” role. “You can start interviewing the Vice President of the United States, and you can end with Oprah on a beach. That can happen. That does happen all the time. That’s about really measuring what the audience expects, and I think we try to approach the news with substance and sophistication, and I don’t think we are flashy.”\n\n\tIn the earliest hours of the morning, before the “Today” anchors get to the studio and get ready to go on the air, you can sometimes find Guthrie in the hair and make-up room, talking to reporters and correspondents like Kirsten Welker about the nuances of one of the stories set to air in the first minutes of the program. Staffers at “Today”  would like to hear her voice filling that room once again.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NBC Expects Savannah Guthrie’s ‘Today’ Return, but Timeline Remains Uncertain",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/savannah-guthrie-1.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-26T14:40:00.000Z",
      "dateModified": "2026-02-26T14:40:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Media Capital Technologies Launches MCT Credit Solutions (EXCLUSIVE)",
    "url": "https://variety.com/2026/film/news/media-capital-technologies-launches-mct-credit-solutions-1236673399/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Screen-Shot-2026-02-26-at-10.45.49-AM.png?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-26T15:00:00.000Z",
    "description": "\n\tMedia Capital Technologies is launching MCT Credit Solutions, a private credit investment platform focused on asset-backed and cash flow-based finan",
    "body": "\n\tMedia Capital Technologies is launching MCT Credit Solutions, a private credit investment platform focused on asset-backed and cash flow-based financing opportunities across the lifecycle of premium content. The platform is being created in partnership with MassMutual.\n\n\tIn its first major deal, MCT Credit Solutions has provided BondIt Media Capital with a $100 million credit facility to fuel the growth of its business. BondIt, a specialty finance company focused on providing debt and mezzanine financing solutions to fund the production of independent film and TV, has deployed over $500 million across more than 500 projects since it was founded.\n\t\n\n\tMCT Credit Solutions is led by MCT Principal Raj Singh, a private equity investor and lender with a specialization in media and entertainment finance. MCT’s team has deployed over $1 billion across more than 100 major motion pictures, which have amassed over $10 billion at the global box office.\n\n\n\t“MCT Credit Solutions reflects our belief that entertainment finance has matured into an institutional-grade credit opportunity when approached with the right structure, underwriting discipline, and industry alignment,” said MCT Principals Christopher Woodrow and Singh in a joint statement. “Our first facility investment with BondIt is a great example of what this strategy is designed to do—partner with experienced operators and provide flexible capital that helps them grow their businesses while continuing to support independent storytellers. With MassMutual as our capital partner, we believe MCT Credit Solutions is positioned to be a long-term partner to the entertainment ecosystem.”\n\t\n\n\tMCT Credit Solutions marks the latest addition to MCT’s investment portfolio. MCT is a media and entertainment investment company founded in 2019 focused on structured finance, corporate transactions, and venture incubation. The company is backed by a range of institutional investors, including MassMutual, which acquired an interest in MCT in 2021. MCT was Lionsgate’s primary slate co-financing partner from 2023 to 2025.\n\n\tIn 2025, MCT partnered with Eli Roth to launch The Horror Section, a media company focused on creating genre entertainment. The Horror Section’s upcoming slate includes Roth’s “Ice Cream Man,” which is scheduled for a wide theatrical release in 2026, and “Don’t Go In That House, Bitch!,” with Snoop Dogg set to star in the film and on board as a producer as well as writer and performer on the original soundtrack.\n\n\tIn 2025, MCT also launched Row K Entertainment, a new U.S. theatrical distribution company built to meet the growing demands of the modern distribution marketplace. Its first film, Gus Van Sant’s “Dead Man’s Wire,” was released in January. Upcoming releases include Jaume Collet-Serra’s “Cliffhanger.”\n\n\tMCT is represented by CAA.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Media Capital Technologies Launches MCT Credit Solutions (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Screen-Shot-2026-02-26-at-10.45.49-AM.png?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-26T15:00:00.000Z",
      "dateModified": "2026-02-26T15:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cheek of the Week -- Paige VanZant Plows Through IG With Her Assets",
    "url": "https://www.tmz.com/2026/02/26/cheek-of-week-paige-vanzant/",
    "image": "https://imagez.tmz.com/image/67/16by9/2026/02/25/67c4ba15bd9640a2b9b70cfa246f9669_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-26T08:01:35.000Z",
    "description": "\n    \n                    \n                          Cheek of the Week 🍑\n                          Paige VanZant Serves\n                          Maj",
    "body": "\n    \n                    \n                          Cheek of the Week 🍑\n                          Paige VanZant Serves\n                          Major Assets!\n                      \n                  \n                                                                        Published \n                              February 26, 2026\n                            12:01 AM PST\n                                                                            \n      \n    \n      \n        \n              \n    \n    \n          TMZ locked in this week's \"Cheek of the Week\" at first glance -- these Paige VanZant hot bum shots will make you dance!\n      \n    \n          Paige busted onto the scene fighting in the UFC over a decade ago ... She's definitely known for her fighting style and mainstream appeal ...\n      \n    \n          Peak at the cheek and check out our gallery!\n      \n      \n      \n          \n            \n              \n                \n                Share on Facebook\n              \n            \n            \n              \n                \n                Share on X\n              \n            \n                          \n                \n                  \n                \n              \n                      \n        \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Paige VanZant\n              \n                          \n                Celebrity News\n              \n                          \n                Hotties & Bodies\n              \n                          \n                Hot Bodies\n              \n                          \n                UFC\n              \n                          \n                Cheek of the Week\n              \n                      \n        \n          \n  ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cheek of the Week -- Paige VanZant Plows Through IG With Her Assets",
      "image": [
        "https://imagez.tmz.com/image/67/16by9/2026/02/25/67c4ba15bd9640a2b9b70cfa246f9669_xl.jpg"
      ],
      "datePublished": "2026-02-26T08:01:35.000Z",
      "dateModified": "2026-02-26T08:01:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NeNe Leakes Seen Kissing Memphis Attorney at Grizzlies Game",
    "url": "https://www.tmz.com/2026/02/25/nene-leakes-new-man-attorney-memphis-grizzles-game/",
    "image": "https://imagez.tmz.com/image/0d/16by9/2026/02/26/0d5dae236e7644c99e6b314931530236_xl.png",
    "tag": "Entertainment",
    "date": "2026-02-26T03:50:29.000Z",
    "description": "\n    \n                    \n                          NeNe Leakes\n                          Locks Lips W/ New Man Courtside at Grizzles Game!!!\n       ",
    "body": "\n    \n                    \n                          NeNe Leakes\n                          Locks Lips W/ New Man Courtside at Grizzles Game!!!\n                      \n                  \n                                                                        Published \n                              February 25, 2026\n                            7:50 PM PST\n                                                                      |\n                                                                Updated \n                                  February 26, 2026\n                                6:23 AM PST\n                                    \n      \n    \n        \n                    \n                  \n      \n    \n          NeNe Leakes isn't hiding her new man … she's showing him off.\n      \n    \n          TMZ obtained video of the former \"Real Housewives of Atlanta\" star at Wednesday night's Memphis Grizzlies game with attorney Arthur Horne III and at one point, he leans in and plants a kiss on her as they walk out together.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Earlier in the night, the two were posted up courtside, cuddled close and clearly coupled up. Witnesses tell us they were \"hugged up\" and \"really touchy-feely\" throughout the game ... making it crystal clear this wasn't just a friendly outing.\n      \n\n          Horne III runs his own law firm in Memphis, practicing criminal defense and personal injury law.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Of course, NeNe's love life has been closely followed over the years. She was married to Gregg Leakes from 1997 to 2011 before they remarried in 2013. They remained together until Gregg’s death from colon cancer in September 2021.\n      \n    \n          Following Gregg's passing, NeNe began dating fashion entrepreneur Nyonisela Sioh later that year. Their relationship made headlines amid legal drama involving his estranged wife, and by 2023 NeNe confirmed they were taking a break though reconciliation rumors later swirled.\n      \n    \n          We broke the story ... NeNe is set to appear on Bravo's \"The Real Housewives Ultimate Girls Trip: Roaring 20th.\" While she won’t be full-time, we're told she’ll have a notable presence.\n      \n    \n          We've reached out to NeNe and Horne for comment … so far, no word back.\n      \n      \n              \n          \n                          \n                NeNe Leakes\n              \n                          \n                TMZ Sports\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NeNe Leakes Seen Kissing Memphis Attorney at Grizzlies Game",
      "image": [
        "https://imagez.tmz.com/image/0d/16by9/2026/02/26/0d5dae236e7644c99e6b314931530236_xl.png"
      ],
      "datePublished": "2026-02-26T03:50:29.000Z",
      "dateModified": "2026-02-26T03:50:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'RHOSLC' Star Mary Cosby's Son Robert Cosby Jr. Dead at 23",
    "url": "https://www.tmz.com/2026/02/25/robert-cosby-jr-dead/",
    "image": "https://imagez.tmz.com/image/10/16by9/2026/02/25/10f1f5e418a14ad0a7640cf26ef0c464_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-25T18:50:29.000Z",
    "description": "\n    \n                    \n                          'RHOSLC' Mary Cosby\n                          Son Robert Jr. Dead at 23\n                      \n  ",
    "body": "\n    \n                    \n                          'RHOSLC' Mary Cosby\n                          Son Robert Jr. Dead at 23\n                      \n                  \n                                                                        Published \n                              \n                February 25, 2026\n                \n                            10:50 AM PST\n                                                                      |\n                                                                Updated \n                                  February 26, 2026\n                                7:35 AM PST\n                                    \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          UPDATE\n  \n    \n          11:20 AM PT -- Mary Cosby and Robert Sr. tell TMZ … \"Our beloved son Robert Jr. has been called home to the Lord. Though our hearts ache, we take comfort in God’s promise and in knowing he is finally at peace. We are grateful for your prayers and trust in the Lord to carry us through this time of sorrow.\"\n      \n    \n          Robert Cosby Jr. -- the son of \"The Real Housewives of Salt Lake City\" star Mary Cosby -- is dead ... TMZ has learned.\n      \n    \n          Robert died Monday in Utah ... the cause of death is unclear, but police responded to a possible overdose, and it turned into a death investigation upon arrival.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Police in Salt Lake City tell us they responded Monday night to a call for a \"full arrest/medical emergency\" for a 23-year-old male. We're told fire and paramedics were dispatched.\n      \n\n          His death comes only a couple months after Robert's wife, Alexiana Smokoff, filed for divorce.\n      \n    \n          Robert appeared on 'RHOSLC' a few times over the years ... during Season 4, there was a storyline about Mary learning Robert had secretly gotten married right under her nose. The wedding reportedly went down in August 2022 at a Utah courthouse.\n      \n    \n          'RHOSLC' made Robert and Alexiana's alleged drug problems a big part of Mary's storyline, too.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Robert had numerous legal issues ... as we first reported, he was arrested in Utah back in September for a number of alleged crimes, including trespassing and assault. He was previously arrested for DUI in 2022, when cops said he didn't have a license and disobeyed traffic laws. He ended up pleading guilty to the DUI ... he got out of prison in February.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          He was only 23.\n      \n    \n          RIP\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Robert Cosby Jr.\n              \n                          \n                Mary Cosby\n              \n                          \n                RIP\n              \n                          \n                TV\n              \n                          \n                Reality TV\n              \n                          \n                Celebrity Death\n              \n                          \n                Real Housewives\n              \n                          \n                Exclusive\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'RHOSLC' Star Mary Cosby's Son Robert Cosby Jr. Dead at 23",
      "image": [
        "https://imagez.tmz.com/image/10/16by9/2026/02/25/10f1f5e418a14ad0a7640cf26ef0c464_xl.jpg"
      ],
      "datePublished": "2026-02-25T18:50:29.000Z",
      "dateModified": "2026-02-25T18:50:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "John Stamos & Jodie Sweetin Dance to Taylor Swift in Sweet 'Full House' Reunion",
    "url": "https://www.tmz.com/2026/02/26/john-stamos-jodi-sweetin-dance-in-full-house-reunion/",
    "image": "https://imagez.tmz.com/image/23/16by9/2026/02/26/236c72c1442b434e9f4019ece3b6dc74_xl.png",
    "tag": "Entertainment",
    "date": "2026-02-26T15:57:12.000Z",
    "description": "\n    \n                    \n                          John Stamos & Jodie Sweetin\n                          Everywhere You Look ...\n                   ",
    "body": "\n    \n                    \n                          John Stamos & Jodie Sweetin\n                          Everywhere You Look ...\n                          You'll See Uncle Jesse and Stephanie Dancing!!!\n                      \n                  \n                                                                        Published \n                              February 26, 2026\n                            7:57 AM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          John Stamos and Jodie Sweetin's \"Full House\" reunion was full of dancing ... with the two stars cutting a rug in a sweet vid.\n      \n    \n          The stars of the hit comedy got together recently and shot a fun clip ... twirling about to Taylor Swift's hit song \"Opalite\" in a pair of matching baby blue sweatsuits.\n      \n    \n        Waiting for your permission to load the Instagram Media.\n      \n    \n          Check out the clip ... it seems young Stephanie Tanner is the dance master now -- looking a bit more confident in the moves than her Uncle Jesse.\n      \n\n          Written across the post in big white letter is \"If Uncle Jesse and Stephanie Tanner had social media today:\" ... and Stamos captioned it, \"I'd follow them.\"\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Stamos and Sweetin each appeared in 193 episodes of \"Full House\" ... beginning in 1987 when Jodie was just 5 years old and ending shortly after her 13th birthday.\n      \n    \n          Sweetin now hosts the \"Full House\" rewatch podcast \"How Rude, Tanneritos!\" ... on which Stamos has appeared several times.\n      \n    \n                    \n                          \n                                  \n      \n        \n    \n          It might be a \"Full House\" ... but there's clearly always room for a dancefloor!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                John Stamos\n              \n                          \n                Jodie Sweetin\n              \n                          \n                Taylor Swift\n              \n                          \n                Full House\n              \n                          \n                TV\n              \n                          \n                Reunions\n              \n                          \n                TV Stars\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "John Stamos & Jodie Sweetin Dance to Taylor Swift in Sweet 'Full House' Reunion",
      "image": [
        "https://imagez.tmz.com/image/23/16by9/2026/02/26/236c72c1442b434e9f4019ece3b6dc74_xl.png"
      ],
      "datePublished": "2026-02-26T15:57:12.000Z",
      "dateModified": "2026-02-26T15:57:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Mike White Shocks Fellow Castaways With Ripped Abs on 'Survivor 50' Premiere",
    "url": "https://www.tmz.com/2026/02/26/mike-white-shows-abs-on-survivor-50-premiere/",
    "image": "https://imagez.tmz.com/image/6f/16by9/2026/02/26/6f11ce31e58e41e7b1ceeeb4853f9fbb_xl.png",
    "tag": "Entertainment",
    "date": "2026-02-26T15:11:18.000Z",
    "description": "\n    \n                    \n                          'Survivor 50'\n                          Wait ... Mike White Is Ripped!!!\n                      \n ",
    "body": "\n    \n                    \n                          'Survivor 50'\n                          Wait ... Mike White Is Ripped!!!\n                      \n                  \n                                                                        Published \n                              February 26, 2026\n                            7:11 AM PST\n                                                                            \n      \n    \n      \n        \n                    \n                  \n      \n                    CBS/Paramount+\n          \n    \n          Lookin' good, Mike White! \"Survivor 50\" boasts the largest cast of any season ... but Mike stood out right away, as competitors noticed his \"bulging 6 pack\"!\n      \n    \n          Watch the clip from last night's premiere ... Mike is beet red when his fellow castaways start thirsting over his chiseled mid-section.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          He says, \"I've been waiting for this moment for months!\"\n      \n\n          White previously competed on \"Survivor 37\" -- the \"David Vs. Goliath\" season -- and scored second place. Since then, he's created the hit HBO series \"The White Lotus,\" for which he's won 3 Primetime Emmys.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Now, White is trying to win the title of \"Sole Survivor\" ... and the $1 million grand prize.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          He's got some steep competition, though ... this season includes 24 players from all eras of the show. Contestants include some memorable faves like Cirie Fields, Christian Hubicki, Chrissy Hofbeck, Benjamin \"Coach\" Wade, Jenna Lewis-Dougherty and more!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                TV\n              \n                          \n                Hot Bodies\n              \n                          \n                Reality TV\n              \n                          \n                Survivor\n              \n                          \n                Celebrity Health\n              \n                          \n                White Lotus\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Mike White Shocks Fellow Castaways With Ripped Abs on 'Survivor 50' Premiere",
      "image": [
        "https://imagez.tmz.com/image/6f/16by9/2026/02/26/6f11ce31e58e41e7b1ceeeb4853f9fbb_xl.png"
      ],
      "datePublished": "2026-02-26T15:11:18.000Z",
      "dateModified": "2026-02-26T15:11:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]