[
  {
    "title": "Lucas Bravo on Bringing Back ‘Fun Gabriel’ for ‘Emily in Paris’ Season 5, Playing a Bad Guy in HBO’s ‘The Seduction’ and How George Clooney Became His Hollywood ‘Godfather’ ",
    "url": "https://variety.com/2025/tv/global/lucas-bravo-emily-in-paris-season-5-hbo-the-seduction-1236580409/",
    "image": "https://variety.com/wp-content/uploads/2025/11/EmilyinParis-Season5-LucasBravo.1.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-17T16:06:42.000Z",
    "description": "\n\tSince breaking out globally five years ago as Gabriel — the hunky French chef in Netflix’s hit romantic comedy “Emily in Paris” — Lucas Bravo has wo",
    "body": "\n\tSince breaking out globally five years ago as Gabriel — the hunky French chef in Netflix’s hit romantic comedy “Emily in Paris” — Lucas Bravo has worked hard to defy typecasting, seeking edgier and darker roles. \n\n\tTo wit, he stars as the morally corrupt Comte de Gercourt in “The Seduction,” HBO Max’s limited series loosely based on “Dangerous Liaisons.” But Bravo tells Variety that he’s also learned to embrace the escapism of “Emily in Paris,” adding that he “wanted to bring back a fun Gabriel” in the upcoming fifth season, after a “gloomy” phase that he famously said was turning the character into guacamole.\n\t\n\n\tThe 37-year-old native of Nice was working as a sous-chef when he auditioned for series creator Darren Star. Bravo says he isn’t in a rush to make it in Hollywood, even if he has warm memories of starring alongside George Clooney and Julia Roberts in “Ticket to Paradise.” \n\n\n\t“She smiles, and rainbows and butterflies appear around you,” reminisces Bravo of Roberts. He also calls Lily Collins, the title star of “Emily in Paris” and his on-screen lover (sometimes!), a “genius.”\n\n\t“The Seduction” premieres on HBO Max Nov. 14 and Season 5 of “Emily in Paris” drops on Netflix Dec. 18. Here, Bravo talks about both — and more.\n\t\n\t\tIn the teaser for the new season of “Emily in Paris” you look completely Californian, with big muscles and highlights. What happened to Gabriel? \t\n\n\tI think Gabriel is going back to what he was in Season 1. I think all of us wanted to bring back a fun Gabriel. I hope we addressed the demand!\n\t\n\n\n\n\t\n\n\t\t\t\t\tEmily In Paris. (L to R) William Abadie as Antoine Lambert, Lucas Bravo as Gabriel in Emily In Paris. Cr. Caroline Dubois/Netflix © 2025\n\t\t\t\t\t\t\t\t\tCAROLINE DUBOIS/NETFLIX\n\t\n\n\n\t\n\t\tIn an interview, you said that you liked Season 4 because your character was more proactive, but you started looking very depressed to me. \t\n\n\tMy character was proactive in the first half, and then the second half was a bit gloomy. When I did that [guacamole] interview, I was referring to my love for the character in the first half! I think any actor is always happy to have fun parts to play.\n\t\n\t\tYou’ve become the epitome of the French lover. How has it been to become that man while also chasing different types of roles? \t\n\n\tIt’s five years of a career that started on Season 1, and me trying to understand what it means, what being in the public eye means, what growing with the character means. Nobody likes labels, but I love the fact that people connected to this character a certain way, and I completely accept it.\n\t\n\t\tWith “The Seduction,” “The Balconettes” and “Libre,” you’ve played all the dark sides of masculinity. Are you trying to make a point about men? \t\n\n\tI think we’re complex human beings. We all have dark sides, a little frustration somewhere, a wound from the past. But we live in a society where everything has to be perfect and we have less and less room for error or second chances. It’s important to show that there are a lot of gray areas in human beings. That’s also where the industry is going — more nuance, richer storytelling.\n\n\n\n\t\n\n\t\t\t\t\t“The Seduction” (Max)\n\t\t\t\t\t\t\t\t\tcaroline dubois\n\t\n\n\n\t\n\t\tYou have said that on “Emily in Paris” there was no room for improvisation because it’s a big U.S. production. How was it to shoot “The Seduction,” which is an HBO show but is directed by a French filmmaker, Jessica Palud? \t\n\n\tYou can improvise a bit on “Emily.” If you have a conversation with Darren, he’s open to ideas and improvisation. This masterpiece “Les Liaisons Dangereuses” has been adapted so many times. By choosing to make my character more prominent than he is in the novel, I was given the opportunity to repaint a part of something that’s existed for centuries. Jessica, our director, completely opened the door for me to go as crazy as possible. I wanted him to be like a snake. Bad guys are scarier when they’re really calm and you don’t see them coming. You fear the moment they’re going to explode. Gercourt is very calm until he tries to strangle you on a marble fireplace or rape you. I wanted his eyes to spark that fear more than his physicality. The weird thing is when you have to go home and remind yourself that you’re a good person.\n\t\n\n\n\n\t\n\n\t\t\t\t\t“The Seduction” (Max) \n\t\t\t\t\t\t\t\t\tcaroline dubois\n\t\n\n\n\t\n\t\tYour character in “Emily in Paris,” Gabriel, is a bit too perfect. Don’t you think?\t\n\n\tYour words, not mine. I don’t know. There’s a lot of things he did that are questionable, I think, but it’s not for me to judge.\n\t\n\t\tSpeaking of Darren Star, did you have “Sex and the City” in mind when you auditioned for “Emily in Paris”?\t\n\n\t“Sex and the City” started my sexual education. I was so young when I watched it and I was like, “Oh, wow, those are the things you can or cannot do as a man.”\n\t\n\t\tHow was it to work with two Hollywood legends, George Clooney and Julia Roberts, on “Ticket to Paradise”?\t\n\n\tIt was honestly the most amazing experience of my life because it was the beginning. I think I had done just one season of “Emily” and one movie with Isabelle Huppert and Jason Isaacs. I arrived on that set with those icons. George and Julia have been pivotal in my career ever since because they took me under their wing — protected me, guided me, provided me with amazing advice. I still see George. We still talk on the phone.\n\t\n\t\tBecause he lives in France, right?\t\n\n\tYes, he lives in France now. I was lucky enough to visit him in Provence. He’s just a good friend. To have someone that generous, that established, that benevolent taking you under his wing is the most amazing godfather you could have in this industry.\n\t\n\t\tDid he give you any good career advice?\t\n\n\tHe gave me a bunch, but he never gives it unless you ask. The biggest advice he gave me wasn’t literal — it was by observing him. On “Ticket to Paradise,” I realized his only goal in a scene is to make his partner shine. Most actors come in thinking, “I need to take my space.” George’s attention is always on, “What can I do to make the person in front of me shine?” By doing so, he shines naturally. You can have a completely selfless performance, and that makes your performance even better. That I got from George.\n\t\n\t\tAnd how was it to play Julia Roberts’ lover?\t\n\n\tJulia — she smiles and rainbows and butterflies appear around you. She’s just the kindest. I call her woman No. 1. There was Julia, and then they created the others. She’s an angel, and she has a sense of humor that really cracks me up. She’s the funniest.\n\t\n\t\tHow has it been to star opposite Lily Collins in “Emily in Paris”?\t\n\n\tLily — I don’t think I’ve ever worked with someone that professional. She raises the bar to a level I’ve never seen before. She made me a better actor in terms of her presence on set, the way she learns lines, delivers lines, participates in everything. She sees everything. She has a radar. Even when she looks like she’s reading something, she always has something smart to contribute that moves the narrative forward. I think she’s a genius — but don’t tell her that, she won’t acknowledge it.\n\t\n\t\n\t\tAre you going to audition for “The White Lotus”?\t\n\n\tI think the entire country called their agent to be on “The White Lotus.” We’ll see how things unravel, but anybody would be lucky to be on such a brilliant show.\n\t\n\t\tWhat’s your next project?\t\n\n\tThere’s a movie [Gilles de Maistre’s “Melodie for a Bear”] I just wrapped in August in Montreal, where I play a bear wrangler. It’s a beautiful story about a father and a daughter reconnecting. I had to be there for three months and get used to bears. I had to learn how to play violin. It was a pretty intense exercise, but I left with bear friends. I know how to handle them, how to feed them, how to sleep next to them. I’m excited for this movie to come out. It’s a beautiful one set in the Canadian forest — a lot of bears, a lot of me with ripped-off shirts because of the bear claws.\n\t\n\t\tThat got you out of your comfort zone for sure!\t\n\n\tWell, nature is my comfort zone, so it got me back!\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lucas Bravo on Bringing Back ‘Fun Gabriel’ for ‘Emily in Paris’ Season 5, Playing a Bad Guy in HBO’s ‘The Seduction’ and How George Clooney Became His Hollywood ‘Godfather’ ",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/EmilyinParis-Season5-LucasBravo.1.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-17T16:06:42.000Z",
      "dateModified": "2025-11-17T16:06:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "New ‘Wicked: For Good’ Clip Unveiled on Peacock",
    "url": "https://variety.com/2025/film/news/wicked-for-good-new-clip-peacock-1236583193/",
    "image": "https://variety.com/wp-content/uploads/2025/11/2552_D046_00112_0120R_COMP.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-17T15:00:00.000Z",
    "description": "\n\tUniversal has unveiled a new clip from upcoming fantasy epic “Wicked: For Good,” exclusively on Peacock.\n\n\tThe clip features stars Cynthia Erivo (El",
    "body": "\n\tUniversal has unveiled a new clip from upcoming fantasy epic “Wicked: For Good,” exclusively on Peacock.\n\n\tThe clip features stars Cynthia Erivo (Elphaba), Ariana Grande (Glinda) and Jeff Goldblum (The Wizard). Other “For Good” cast members include Jonathan Bailey, Ethan Slater, Michelle Yeoh, Marissa Bode, Colman Domingo and Bowen Yang.\n\n\tFirst reactions to “Wicked: For Good” from the film press were glowing in late December, possibly signaling success come Oscar season. The first “Wicked” earned 10 nominations at last year’s Academy Awards and took home honors for best costume design and achievement in production design.\n\t\n\n\t“Wicked: For Good” is expected to again earn 10 nominations at this year’s Oscars, including nods for Erivo and Grande for best actress and best supporting actress, respectively. If they both repeat, they would become the seventh and eighth performers in Oscar history to be nominated twice for the same role.\n\n\n\tDuring a recent Q&A promotion for the film, both stars shared how the musical shaped them as performers and people. Erivo shared her memory of seeing the musical for the first time at 25.\n\n\t“I had not seen the musical,” Erivo said. “I saw it when I was 25 and took myself for a single date for my birthday, and that place that made me feel safe, I ended up being in.”\n\n\tAn emotional Grande discussed how the role of Glinda allowed her to reconnect with her love of acting.\n\n\t“I think that spark of connection to my craft was also pretty disconnected for a little while,” Grande said. “It really felt like safe again to fall in love with creating and like maybe I was being seen for the first time.”\n\t\n\n\tHead over to Peacock to watch the new clip now.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "New ‘Wicked: For Good’ Clip Unveiled on Peacock",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/2552_D046_00112_0120R_COMP.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-17T15:00:00.000Z",
      "dateModified": "2025-11-17T15:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Lenny Daniels Joins Professional Fighters League as COO",
    "url": "https://variety.com/2025/tv/news/lenny-daniels-professional-fighters-league-coo-1236583179/",
    "image": "https://variety.com/wp-content/uploads/2022/11/26492_001_0781_R-prsrm.jpg?w=768&h=512&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-17T14:00:00.000Z",
    "description": "\n\tLenny Daniels, the former head of Warner Bros. Discovery‘s sports operations, has joined Professional Fighters League as chief operating officer as ",
    "body": "\n\tLenny Daniels, the former head of Warner Bros. Discovery‘s sports operations, has joined Professional Fighters League as chief operating officer as the mixed-martial-arts league is working to compete more headily against UFC.\n\n\tDaniels will oversee all day-to-day operations across the league, including global business operations, brand and content strategy, and commercial expansion. He will also play a central leadership role in the PFL’s upcoming U.S. media rights negotiations.\n\t\n\n\tDaniels will report to John Martin, PFL’s CEO and a former head of Warner’s cable-networks division. \n\n\n\t“Lenny Daniels is among the most accomplished executives in sports media, having spent decadesshaping and growing elite sports organizations,” said Martin, in a statement. “He has managed some ofthe biggest sports properties on the planet and understands how to deliver premium sports content, liveexperiences, and digital engagement at massive scale. Lenny will be a game-changing leader for the PFLas we enter our next stage of growth.”\n\n\tFans, advertisers and distributors all want to do more with mixed martial arts, and PFL has been working to establish itself as an option for those who may be value-conscious about costs associated with UFC. That league, backed by TKO, recently signed a mammoth seven-year deal with Paramount Skydance valued at $7.7 billion over the course of its term. Organizers may feel pressured to back those fees with premium sponsorship pacts. \n\n\t“The opportunity to help build the next great global combat sports brand, powered by storytelling,technology, and athlete-first innovation, is rare,” said Daniels in a statement. “I am committed to delivering operational excellence across every level of the League. We’re just getting started.”\n\t\n\n\tDaniels spent nearly three decades at the Warner division once known as Turner Sports, where he played a significant role in developing programs such as “Inside the NBA” and “NBA on TNT,” as well as alliances with leagues including Major League Baseball, the NCAA and the NBA.” Under his aegis, Turner developed helped develop the digital-sports outlet Bleacher Report and played a strong hand in guiding the NBA’s digital strategy. He left the company in 2022.Daniels and his wife are based in Atlanta with their two sons.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lenny Daniels Joins Professional Fighters League as COO",
      "image": [
        "https://variety.com/wp-content/uploads/2022/11/26492_001_0781_R-prsrm.jpg?w=768&h=512&crop=1"
      ],
      "datePublished": "2025-11-17T14:00:00.000Z",
      "dateModified": "2025-11-17T14:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Now You See Me: Now You Don’t’ Stars Woody Harrelson, Dave Franco and More Show Off Their Magic Card Tricks",
    "url": "https://variety.com/2025/film/news/now-you-see-me-3-woody-harrelson-dave-franco-card-tricks-1236575073/",
    "image": "https://variety.com/wp-content/uploads/2025/11/GettyImages-2246081084.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-17T16:18:02.000Z",
    "description": "\n\tThe Horsemen are back with more mind-bending illusions in “Now You See Me: Now You Don’t,” the third installment of the magic-fueled heist series — ",
    "body": "\n\tThe Horsemen are back with more mind-bending illusions in “Now You See Me: Now You Don’t,” the third installment of the magic-fueled heist series — and this time, a new generation of illusionists joins the team.\n\n\tAt the film’s New York premiere, several cast members took a moment to slip into magician mode, impressing Variety with a flurry of expertly executed card tricks.\n\n\t“We worked with our magic coaches Ben Seidman and Handsome Jack, and I mean, I didn’t even know how to shuffle cards when I started,” Dominic Sessa, who plays newcomer Bosco, told Variety on the carpet. “But by the time I got to set, we were all doing a bunch of different card tricks and vanishes and stuff like that. It was amazing.” \n\t\n\n\tEven the regulars from “Now You See Me” franchise learned new tricks while further honing the skills they showcased in the previous two films. \n\n\n\t“I’m very good at throwing cards, and so I found new ways to throw cards, which sounds silly, but it’s much harder than you think,” Dave Franco said. “It’s me in a hotel room for a month learning a hand flourish that is maybe on screen for two seconds.” \n\n\tWoody Harrelson added, “With the other two movies, you’d think I would have gotten into magic, but it was finally this one that I did start to develop more of a passion for it — and now I’d like to say I have a few tricks.”\n\n\n\tMeanwhile, Isla Fisher — who returns as Henley Reeves in the latest installment after missing 2016’s “Now You See Me 2” — had to brush up on her magic skills, particularly for one specific sequence.\n\t\n\n\t“There was one scene that was seven minutes long that we shot chronologically, and everybody had a trick — or actually had two tricks, but some people had, like, three — and if you messed it up, then you had to reshoot it,” Fisher said. “We shot it over, I think it was a day, and that was the only time that I was like, ‘Come on, Isla, don’t mess up your magic trick, or the whole crew and cast are going to be mad.'”\n\n\t“Now You See Me: Now You Don’t” reunites the original Four Horsemen — J. Daniel Atlas (Jesse Eisenberg), Merritt McKinney (Harrelson), Henley Reeves (Fisher) and Jack Wilder (Franco) — as they work with a new group of magicians to steal the world’s largest diamond, known as the Heart Diamond. The cast also includes Sessa, Ariana Greenblatt, Justice Smith, Lizzy Caplan, Rosamund Pike and Morgan Freeman.\n\n\tTo ensure authenticity, the creative team partnered with consultants from Los Angeles’ famed Magic Castle to design illusions that would feel as real as they look. The film leans heavily on practical effects to seamlessly blend the illusions and action — but that commitment came with a few bruises: Jesse Eisenberg revealed he fractured a finger while filming a fight scene inside a rotating corridor.\n\n\t“The corridor turns 360 degrees, so you’re standing on the floor and suddenly, the floor is on the wall and then it’s the ceiling,” Eisenberg recalled, adding that he injured his finger by hitting a “very hard piece of wood.” \n\n\tHe continued, “It was the most incredible set I’ve ever gotten to work on. It was also the set that didn’t like me more than any other person or set I’ve ever worked with.”\n\n\t“I wanted to make sure to use as much practical magic as I possibly could — wanting to do everything in camera and not rely on visual effects or motion graphics or any other tricks to convey the magic,” director Ruben Fleischer explained. “I wanted it to be as real as possible, as if you had gone to a magic show yourself and just wanted to see a show. They don’t have cuts or edits in magic shows, so I felt very, very lucky to be able to bring it all to life as naturalistically and realistically as possible.”  \n\n\t“Now You See Me: Now You Don’t” is in theaters now. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Now You See Me: Now You Don’t’ Stars Woody Harrelson, Dave Franco and More Show Off Their Magic Card Tricks",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/GettyImages-2246081084.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-17T16:18:02.000Z",
      "dateModified": "2025-11-17T16:18:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "AI-Generated Images Threaten Future of Documentary as People ‘Will Stop Believing Anything’: ‘Deep Fake Is the Crime, AI Is a Tool’",
    "url": "https://variety.com/2025/film/festivals/ai-generated-images-threaten-future-of-documentary-1236583466/",
    "image": "https://variety.com/wp-content/uploads/2025/11/VARIETY-SIZING-36.png?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-17T14:55:07.000Z",
    "description": "\n\tFew issues are as widely dissected and discussed within the film business today as the possibilities and consequences of AI technology. When it come",
    "body": "\n\tFew issues are as widely dissected and discussed within the film business today as the possibilities and consequences of AI technology. When it comes to documentary filmmaking, the discussion takes on a new level of importance, as the form is often tied to journalistic notions of truth and reality. Leading documentarians gathered at this year’s International Documentary Film Festival Amsterdam (IDFA), the world’s largest festival for docs, to discuss best practices, pressing warnings and what the future may look like for documentaries as AI use becomes more and more widespread. \n\t\n\n\tOscar-nominated U.S. director and investigative reporter David France, at IDFA with Sundance-breakout doc “Free Leonard Peltier,” recalled first working with artificial intelligence for 2020’s “Welcome to Chechnya.” The film, which chronicled the persecution of members of the LGBTQIA community in the semi-independent autonomous republic of Russia, dealt with an extremely sensitive situation. To be able to speak to those being persecuted, France had to ensure their identities wouldn’t be revealed. “It was a story that needed to be told, but one that was hard to tell because the people who were able to get out were being chased around the globe.”  \n\n\n\tThe solution France and his team landed on was to obscure their characters’ faces by digitally superimposing other people onto them. “It changed nothing about their micro responses, their emotions. You could see the original person crying and laughing while using somebody else’s face. We weren’t calling it artificial intelligence at the time [2019]. We were calling it machine learning. It just seemed remarkable.” \n\t\n\n\tThe director recruited 23 queer activists from New York to lend their faces and voices to the project in a groundbreaking process that granted a technical Oscar to the team behind the innovation. Still, the filmmaker was scrutinized for his use of AI. “While we were doing this, everybody was calling it deep fake. We kept saying: It’s not deep fake. Deep fake is the crime, AI is the tool.”\n\n\tFrance would use AI again in his films, including his latest, telling the story of Peltier, an activist jailed for half a century after a disputed conviction. In this case, the director used AI to modify — and rejuvenate — Peltier’s voice. The resource was needed because the recordings heard in the film were obtained illicitly, since Peltier could not speak to journalists from prison. “In addition to that, Leonard went from being a 30-year-old to an 80-year-old, and you could hear the age in his voice.” \n\n\tBritish filmmaker Marc Isaacs is at IDFA with “Synthetic Sincerity,” which sees him make a deal with the titular lab to assist in their research on the possibility of teaching AI characters authenticity. A blend of fact and fiction, the doc is created in collaboration with Romanian actress Ilinca Manolache (“Do Not Expect Too Much From the End of the World”), with Isaacs cleverly manipulating images through filters and other techniques to emulate what AI-generated sequences would look like. \n\n\tIsaacs experimented with Synthesia, a synthetic media generation company that develops software used to create AI-generated video content. “You choose a character and can type in [things] for them to say,” he explained. It was interesting at first, but the director said the AI character “bored him to death” because her “range of emotions was really limited.” “It was funny at first, but it became tiresome very quickly.” When he met Manolache at a Bucharest festival, he proposed they work together on the film, collaborating to create the half-real-half-digital character she plays on screen. “She’s much more interesting, and what we could do with her was more varied. Most actors are terrified of having their personas turned into AI, but she loved it.”\n\n\tThe director did not want to make clear what is AI-generated and what isn’t in the film, pointing out his work is “not journalistic.” “The whole point of the film is to raise questions about images and what’s happening to representation and the death of the camera. I didn’t want to spoil that by labelling things.” \n\t\n\n\tA great portion of the conversation was dedicated to understanding the impact of AI when it comes to archival footage. “For archives, the consequences are quite profound,” said Portuguese filmmaker Susana de Sousa Dias (“Fordlândia Panacea”), this year’s Guest of Honor at IDFA and a documentarian largely working with archival images. “The documentary status of images becomes much easier to context. There is a risk here that not only can spectators believe fake archival footage, but that people will stop believing anything. In both cases, our regime of truth is completely shaken.” \n\n\t“Since the transition to digital media, the discourse of the incompleteness of reality in black and white and low definition images has grown,” she added. The director also noted how working with archive is not only about what can be seen and rescued through research, but thinking about all the gaps in material and memory. “The question that interests me is actually very simple and at the same time very complex: what happens when a technology that wants to repair everything enters the field where absence itself is meaningful?” \n\n\tThinking about this contemporary conundrum, Emmy-winning filmmaker and graphic designer Eugen Bräunig (“Trafficked”) worked alongside the Archival Producers Alliance to establish a set of guidelines on the best practices when working with generative AI within archive-led filmmaking. “In documentary, there is no organizing body that tells us how to do things,” he emphasized. “There are no laws and rules. All we can do is self-regulate and impose certain standards on ourselves to hold ourselves accountable as storytellers, news-makers and image-makers.”\n\n\tBräunig pointed out that the most basic and yet most helpful thing is for productions to create a cue sheet listing the technology used, as well as how and when it was used throughout the making of the film. “At some point, people are going to have questions,” he warned. Best to stay ahead of the curve. \n\n\tAt one point in the conversation, the designer played a SORA-generated clip of an artificial 1990s news clip to illustrate how faithful AI-generated sequences currently are. “It was, of course, possible to make fake videos before, but big production money and a great deal of time were required. Now, it’s just too cheap and too fast,” he added. \n\t\n\n\t“Trust in media is at an all-time low,” warned the filmmaker. “That means trust in archives is also threatened. If people start mistrusting news, which they already are, they are also going to potentially develop that sense of mistrust towards documentary filmmaking, and rightfully so in some instances.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "AI-Generated Images Threaten Future of Documentary as People ‘Will Stop Believing Anything’: ‘Deep Fake Is the Crime, AI Is a Tool’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/VARIETY-SIZING-36.png?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-17T14:55:07.000Z",
      "dateModified": "2025-11-17T14:55:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "AFM Earns High Praise for New L.A. Location, but Pricey Film Packages Turn Buyers Off: ‘Expectations Haven’t Fully Adjusted to the Realities of the Market’",
    "url": "https://variety.com/2025/film/global/afm-takeaways-location-pricey-packages-turn-buyers-off-1236583449/",
    "image": "https://variety.com/wp-content/uploads/2025/11/afm-wrap.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-17T15:47:20.000Z",
    "description": "\n\tRain may be good for box offices, but it can also be a bonus for film events. The storm that started pounding Los Angeles last week led to a noticea",
    "body": "\n\tRain may be good for box offices, but it can also be a bonus for film events. The storm that started pounding Los Angeles last week led to a noticeable uptick in people buzzing around the lobby of the American Film Market at the Fairmont Century Plaza — and no doubt brought more attendees to the screenings put on at the AMC Theatre in the neighboring mall.\n\n\tThere was much to celebrate about the AFM’s new venue — especially coming a year after the mostly-loathed trip to Las Vegas. For an industry that loves to complain, there was relatively little to moan about. The lifts worked and weren’t too overcrowded, the offices were easy to get to and there were plenty of amenities in the area. It was, as one film sales exec noted, the “first time I’ve been able to actually do my work rather than having to deal with everything else.”\n\t\n\n\tAs producer Sam Pressman, who is developing the reboot of “American Psycho” with Luca Guadagnino and Lionsgate, asserted: “The energy in this location is great. Even with the rain — people get cozy.”\n\n\n\tSales agents who coped with aggravated buyers at last year’s Vegas nightmare were also relieved. “AFM organizers have finally cracked the code this year,” said Fabien Westerhoff at Vuelta-owned U..K. banner Film Constellation. The exec applauded the “location and hotel setup,” as well as the “immediate access” to talent agencies. “In what is no doubt a challenging climate for indies,” he said, the market contributes to “building an environment that strengthens this community and makes for meaningful creative exchange.”\n\t\n\n\tThis year’s AFM space was sold out with 285 exhibitors from 35 countries, on par with last year. Buyers were also out in force, even if some skipped the event (likely due to some form of Vegas PTSD). After the U.S., the strongest international representation came from South Korea, Germany, the U.K., France and Italy.\n\n\tBut a functioning AFM is only worthwhile if films are getting bought and sold, and the noise from the sales rooms was of an industry juggling numerous issues in a struggling theatrical market. Indeed, few sales were announced during the week, with the only splashy acquisition reported on being Neon’s purchase of U.S., U.K. and Australian rights to Hirokazu Kore-eda’s “Sheep in the Box.”\n\n\tMany buyers complained about high prices — especially among the bigger projects — that simply don’t match today’s world. The fact that AFM took place the same week as a couple of prestige box office indie flops — “Die, My Love” and “Christy” joining the ranks of “The Smashing Machine” — only underlined what the industry is up against.\n\n\t“The honest truth is that we feel expectations from producers and sellers haven’t yet fully adjusted to the realities of the market and, importantly, to what audiences are actually responding to right now,” said one distribution exec. Another simply said that many of the projects on offer were “just too expensive for the current market.”\n\n\tAlongside box office woes, the problem with post-theatrical window deals also appears to be worsening, pushing down the prices buyers are willing to pay.\n\n\t“What’s most noticeable to me in this market is that we’re seeing the Pay-1/SVOD affliction that the U.S. has been enduring in a lot of other major territories, such as Germany, Spain and Italy,” said Stuart Ford, chairman and CEO of AGC Studios. “And that obviously has a really constraining impact on people’s buying power.”\n\n\tEven in the U.K., Rupert Preston at Vertigo Releasing said the “biggest problem” for distribution banners is the drop in ancillary revenues. “It affects the economy, it affects everything,” he said.\n\n\tBut while the days of heated bidding wars may be a thing of the past at the AFM, there were several projects that attracted widespread interest. Variety heard that Morten Tyldum’s “Ibelin” — telling the real-life story of a man with a degenerative muscular disease who enjoyed a rich life through “World of Warcraft” and starring Charlie Plummer, Stephen Graham and Toni Collette — was a buzzy launch for Black Bear. As was “Bad Bridgets,” a revenge thriller set in 19th century New York from “Kneecap” director Rich Peppiatt and starring Daisy Edgar-Jones and Emilia Jones, which was being sold by FilmNation and WME Independent. But again, the asking price — rumored (per some buyers) to be roughly $10 million for the U.S. and $20 million for international — was prohibitive for most. Other pricey projects touted at the AFM included Mel Gibson’s two-part feature “The Resurrection of the Christ.”\n\t\n\n\tFord pointed out that AGC’s “Phantom Son,” a thriller starring Renee Zellweger from director David Yates, had been a “really strong” seller. “It’s got a very strong marketing proposition and a clean concept,” he added. Away from starry offerings, there was also the return of an AFM icon in “Sharknado,” with the news that B-movie icons The Asylum were bringing back its hit franchise with “Sharknado Origins.”\n\n\tWhile market shifts may mean that no package — even one featuring low-budget flying sharks — is a guaranteed safe bet anymore, buyers are still finding things to be excited about as they hunt for what they hope will be the next gem. \n\n\t“As an independent you have to work around the challenges and that’s what we do,” said Preston. “As always, if you’ve got a special film, it will perform so that’s what you have to look for. It’s not as doomy or gloomy as some other people may suggest, but it’s challenging for sure.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "AFM Earns High Praise for New L.A. Location, but Pricey Film Packages Turn Buyers Off: ‘Expectations Haven’t Fully Adjusted to the Realities of the Market’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/afm-wrap.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-17T15:47:20.000Z",
      "dateModified": "2025-11-17T15:47:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Legend of Zelda’ Movie First Look Reveals Link and Zelda in Live Action",
    "url": "https://variety.com/2025/film/news/legend-of-zelda-movie-first-look-link-zelda-live-action-1236583595/",
    "image": "https://variety.com/wp-content/uploads/2025/11/zelda-1.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-17T14:40:48.000Z",
    "description": "\n\tThe first look at Sony and Nintendo‘s live-action “Legend of Zelda” movie is here.\n\n\tImages released on Monday on the Nintendo Today app offer a sne",
    "body": "\n\tThe first look at Sony and Nintendo‘s live-action “Legend of Zelda” movie is here.\n\n\tImages released on Monday on the Nintendo Today app offer a sneak peek at young actors Bo Bragason and Benjamin Evan Ainsworth, who play the magical Princess Zelda and green-clad swordsman Link, respectively, in the film adaptation of the beloved video game. The photos show Link and Zelda standing in a lush green field, Zelda with her signature bow and arrow and both actors sporting costumes complete with Hylian ears.\n\t\n\n\t“Kingdom of the Planet of the Apes” and “The Maze Runner” helmer Wes Ball directs the live-action “Legend of Zelda,” which hits theaters on May 7, 2027.\n\n\n\tNintendo’s Shigeru Miyamoto, who is producing the film, revealed the casting of Link and Zelda over the summer, writing in a social media post: “I am pleased to announce that for the live-action film of ‘The Legend of Zelda,’ Zelda will be played by Bo Bragason-san, and Link by Benjamin Evan Ainsworth-san. I am very much looking forward to seeing both of them on the big screen.”\n\n\tEnglish actor Bragason is known for her roles in the BBC One series “Three Girls” and “The Jetty,” as well as Disney+’s “Renegade Nell.” Last year, she starred in Euros Lyn’s vampire comedy film “The Radleys.” Ainsworth, who is also English, was the voice of Pinocchio in Robert Zemeckis’ live-action “Pinocchio” and played Miles in the Netflix series “The Haunting of Bly Manor.” He also stars in the Canadian comedy series “Son of a Critch” and appeared in an episode of Netflix’s “The Sandman.”\n\t\n\n\tSee more first-look images below.\n\n\n\n\t\n\n\t\t\t\t\tBo Bragason as Zelda\n\t\t\t\t\t\t\t\t\tNintendo\n\t\n\n\n\n\n\n\t\n\n\t\t\t\t\tBenjamin Evan Ainsworth as Link\n\t\t\t\t\t\t\t\t\tNintendo\n\t\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Legend of Zelda’ Movie First Look Reveals Link and Zelda in Live Action",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/zelda-1.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-17T14:40:48.000Z",
      "dateModified": "2025-11-17T14:40:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Wake Up Dead Man’ Trailer: Daniel Craig’s Third ‘Knives Out’ Movie Investigates a Religious Murder With Josh O’Connor, Jeremy Renner, Mila Kunis and More",
    "url": "https://variety.com/2025/film/news/wake-up-dead-man-a-knives-out-mystery-trailer-1236583163/",
    "image": "https://variety.com/wp-content/uploads/2025/11/knives.png?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-17T14:02:00.000Z",
    "description": "\n\tBenoit Blanc will return to solve his most dangerous case yet in a new trailer for Netflix’s “Wake Up Dead Man: A Knives Out Mystery.”\n\n\t“Wake Up De",
    "body": "\n\tBenoit Blanc will return to solve his most dangerous case yet in a new trailer for Netflix’s “Wake Up Dead Man: A Knives Out Mystery.”\n\n\t“Wake Up Dead Man” is the third installment in Rian Johnson’s “Knives Out” franchise. The film hits theaters on Nov. 26 as part of a two-week theatrical run before premiering on Netflix on Dec. 12.\n\n\tThe film will once again follow debonair detective Blanc (Daniel Craig) as he takes on a new puzzling case. The official synopsis reads, “After a sudden and seemingly impossible murder rocks the town, the lack of an obvious suspect prompts local police chief Geraldine Scott (Mila Kunis) to join forces with renowned detective Benoit Blanc to unravel a mystery that defies all logic.”\n\t\n\n\tJosh O’Connor stars as priest Jud Duplenticy, who is sent to assist Monsignor Jefferson Wicks (Josh Brolin). Wick’s group consists of devout churchgoer Martha Delacroix (Glenn Close), groundskeeper Samson Holt (Thomas Haden Church), lawyer Vera Draven (Kerry Washington), aspiring politician Cy Draven (Daryl McCormack), town doctor Nat Sharp (Jeremy Renner), concert cellist Simone Vivane (Cailee Spaeny) and author Lee Ross (Andrew Scott).\n\n\n\tAfter premiering at TIFF in September, Craig reflected on being a part of the trilogy, which he described as “a constant surprise,” while remembering Johnson’s first script for “Knives Out.”\n\n\t“We made it with no ambition whatsoever,” he told Variety. “Just let’s do the best movie we can. And it became something, and then here we are.”\n\n\tCraig continued, acknowledging that he’s open to revisiting his character and solving more mysteries in the future. “These movies have to work at a very, very high level, otherwise there’s no point in doing them,” he said. “So as long as they’re doing that, we’ll keep doing them.”\n\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Wake Up Dead Man’ Trailer: Daniel Craig’s Third ‘Knives Out’ Movie Investigates a Religious Murder With Josh O’Connor, Jeremy Renner, Mila Kunis and More",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/knives.png?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-17T14:02:00.000Z",
      "dateModified": "2025-11-17T14:02:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "More Women Filmmakers and Greater Diversity at Ventana Sur’s Primer Corte, Copia Final Programs (EXCLUSIVE)",
    "url": "https://variety.com/2025/film/global/primer-corte-copia-final-kenya-marquez-1236582830/",
    "image": "https://variety.com/wp-content/uploads/2025/11/pic_petardosymagnolias.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-17T14:47:41.000Z",
    "description": "\n\tFewer titles from Argentina, given the radical reduction of federal support, has made way for more diversity among the entries to Ventana Sur’s indu",
    "body": "\n\tFewer titles from Argentina, given the radical reduction of federal support, has made way for more diversity among the entries to Ventana Sur’s industry centerpieces Copia Final and Primer Corte. \n\n\tAccording to Pamela Biénzoba, who shares curating duties with Juan Crespo and Eva Morsch Kihn, new voices from the Caribbean, Ecuador, Uruguay and Peru participate this year. “For instance, there’s a film from Puerto Rico, possibly the first in years – ‘Braided’ (“Trenzadas”) that is highly anticipated,” said Biénzoba, a Chilean-French consultant, programmer and film critic who has been a member of the Locarno Film Festival film selection committee since 2021.\n\t\n\n\tThe curating team also observed several coming-of-age proposals from both first-time and experienced filmmakers. “There were also more comedy projects this year – stronger ones than usual as it’s sometimes hard to find truly well-executed comedies,” Biénzoba noted.  \n\n\n\t“We’ve found quite a few hybrid projects and films with unconventional narratives, as well as more traditional social dramas or coming-of-age social dramas,” Morsch Kihn concurred, who also noticed more women filmmakers and family-themed stories across the board. \n\n\t“It’s true that there is this diversity that really interests us and proposals from both well-known directors and new ones, with films that have been much anticipated,” she said, citing “My Uncle’s Movie” by Natalia Cabral, “Missing” by Kenya Márquez and the latest from Colombia’s Juan Andrés Arango, “Where the River Begins.”\n\t\n\n\t“Something that’s also becoming evident over the years of awards is the high quality of acting. That’s something worth highlighting as well, because there are really strong performances, especially from young actors,” said Morsch Kihn who is also the programming coordinator of Cinelatino Festival in Toulouse and member of the Venice Gap Financing Market selection committee, among other roles. \n\n\t“In my evaluation, I prioritized titles with genre appeal, narratives that foster global resonance and projects adaptable to wider exploitation markets – factors that support sales and distribution across multiple territories,” said Crespo, founder of 3C Films, whose credits include sci-fi thriller “5.5.5,” action drama “Reus, la vuelta al barrio” as well as series “The Lord of the Whales” (“El Señor de las Ballenas”).\n\n\t“The goal was to position these films within festival and buyer circuits that emphasize commercially viable profiles, enabling faster distribution agreements and access to established markets,” he added, noting that while artistic merits remained a priority, the curation aimed to engage a broader audience without compromising quality.\n\n\t“Working as a team with Pamela and Eva was a highly enriching and educational experience, as they are both outstanding professionals in their field.”\n\n\n\n\t\n\n\t\t\t\t\tEva Morsch Kihn, Pamela Biénzoba, Juan Crespo (l-r)\n\t\n\n\n\n\tA drill-down on this year’s selection:\n\n\tPrimer Corte\n\n\t“Awaiting Birds,” (“Madre pajaro,” Sofía Quiros, Argentina, Spain)\n\n\tThe producing team behind 2019 Cannes Critics Week title “Black Ash,” led by Cecilia Salim of Sputnik Films and Mariana Murillo (Murillo Cine), reunite for this coming-of-age story that follows Oliver (8), who stays with his aunt Paloma (26) while his mother receives treatment in the capital. Her illness forces Oliver to confront loss and cling to Paloma, who resists her maternal instincts. Starring Oliver Macluf, Isabella Noorifard, Julio Briceño and Wendy Chinchilla. Supported by Ibermedia, El Fauno, Torino Film Lab and Berlinale Talents.\n\n\n\n\t\n\n\t\t\t\t\t“Awaiting Birds”\n\t\t\t\t\t\t\t\t\tCourtesy of Murillo, Sputnik Films\n\t\n\n\n\n\t“Back to Back Copacabana,” (“Bate e volta Copacabana,” Juliana Antunes, Camila Matos, Brazil)\n\n\tA coming-of-age road drama produced by Ventura with co-producers Globo Filmes and Canal Brasil, follows Paulinha, Gabi and Michele on a day trip to Copacabana that turns into a transformative night along Brazil’s highways. The film continues Ventura’s mission to amplify female and queer voices in Brazilian cinema, with backing from BrLab São Paulo, Cinélatino de Toulouse, LoboLab – Mar del Plata and Brasil CineMundi.\n\t\n\n\t“The Devil’s Well,” (“Los pozos del diablo,” Jairo Boisier Olave, Chile)\n\n\tThe drama, produced by Cangrejo Films (Chile) with Caviar Films (Argentina), Paideia Filmes (Brazil) and Mat Productions (France), follows Judith, a 15-year-old who can find underground water, as she exposes a theft network linked to a powerful avocado farm—and possibly her father. Supported by Cinéfondation–Cannes, BAL-LAB Biarritz, and Proyecta Ventana Sur, it seeks final post-production partners. “It tells an urgent story of water scarcity and corruption,” says producer Diego Pino Anguita.\n\n\n\n\t\n\n\t\t\t\t\t“The Devil’s Well”\n\t\t\t\t\t\t\t\t\tCourtesy of Cangrejo Films\n\t\n\n\n\n\t“The Good Charm Society,” (“Waturapankiman,” Marina Herrera, Peru, Bolivia)\n\n\tFrom Desfase Films, China Salka Prods., Mestizo Films and Bolivian co-producer Empatía Cinema, behind Toronto hit “The Condor Daughter,” the comedy follows Alexandra, who inherits her late father’s fortune-telling shop and embarks on a tarot-guided quest. Starring Luz Marina Asin, Olinda Flores and Enrique Araóz, it marks Herrera’s feature debut (“Heroínas,” Berlinale Shorts) and seeks post-production financing. “An experiment in unlearning cinema,” says Herrera, citing natural acting, improvisation, long takes, real spaces and minimal editing to blur fiction and documentary. \n\n\t“Petardos y Magnolias,” (Sandra Reynoso, Mexico)\n\n\t“Amores Perros” executive producer Francisco González Compeán of Draco Films produces alongside Sebastián Jurado Dada and Ximena Basaguren. Drama follows Vera, a young soccer star torn between her dreams and her father’s wishes. She falls for Alan, a school hooligan, discovering love’s risks. Cast includes Ximena Lamadrid, Juan Daniel García Treviño, Andrés Almeida and Mónica del Carmen. “A fresh vision of first love in public schools, a familiar yet rarely depicted setting in Mexican cinema,” says Reynoso. \n\n\t“Where the River Begins,” (“Donde comienza el rio,” Juan Andrés Arango, Colombia, Canada, Norway)\n\n\tDrama follows Yajaira, a young Emberá mother and Jhon, a gang member, as they flee Bogotá toward the Andágueda River in search of belonging. Produced by Inercia Películas, Midi La Nuit and Satæer, with support from FDC, Sørfond, Telefilm and San Sebastian’s Dale Award. Editing first cut in Montreal and seeking partners in financing, distribution and sales. “The film reflects on the way a country seeks to reinvent its sense of belonging after decades of war,” says Arango.\n\t\n\n\n\n\t\n\n\t\t\t\t\t“Where the River Begins”\n\t\t\t\t\t\t\t\t\tCourtesy of Inercia Películas\n\t\n\n\n\n\tCopia Final\n\n\t“Braided,” (“Trenzadas,” Raisa Bonnet, Puerto Rico)\n\n\tWritten by Bonnet and Lilian T. Mehrel, the drama stars Mar Cruz Abril, Jonaibett Cruz Manso and Valentina Cruz Vásquez. Produced by La Nauta, it’s set in post-Hurricane María Puerto Rico and follows a mother and her daughters searching for home amid devastation, exploring climate disaster’s human impact. Developed with the Puerto Rico Film Commission’s ARPA Program, it participated in EAVE Puentes, MAFIZ, Ventana Sur and Nuevas Miradas. Film is “both a mirror and a memory — of what it means to survive, to belong and to stay,” Bonnet notes. \n\n\t“Low Light,” (“Lusco-Fusco,” Bel Bechara and Sandro Serpa, Brazil)\n\n\tProducer Rafaella Costa leads the Manjericão Filmes (“My Name is Baghdad”) and Macondo Filmes co-production which follows Vera and Alda, neighbors and co-workers whose connection deepens through Alda’s granddaughter, Joana. As both women confront abusive relationships, their friendship becomes a space for resilience. Funded by Brazil’s Paulo Gustavo Law, the film participated in Cinéma en Construction – São Paulo/Toulouse, Cinemundi – WIP (Mistika Award). “Overcoming violence against women is not only an individual, cathartic journey but also a collective one,” Bechara observes.\n\n\n\n\t\n\n\t\t\t\t\t“Low Light”\n\t\t\t\t\t\t\t\t\tCourtesy of Manjericão Filmes and Macondo Filmes\n\t\n\n\n\n\t“Missing,” (“Se busca,” Kenya Márquez, Mexico)\n\n\tProduced by Puerco Rosa Producciones and Rubicon Productions, led by helmer-scribe Kenya Márquez, Jacobo Nazar and Janeth Mora. Drama stars Rocío Guzmán, Camila Calónico, Eileen Yáñez, Fabián Corres, Ishbel Bautista and Tamara Vallarta. René, a rebellious teenager, flees her suffocating parents on a 1,243-mile journey to Juárez, Mexico, uncovering personal revelations. Developed with Sistema Nacional de Creadores de Arte support, funded by Eficine and Focine Postproducción, the film explores “motherhood, love, and family bonds from a feminine perspective,” says Márquez.\n\n\t“My Uncle’s Movie,” (“La pelicula de mi tio,” Natalia Cabral, Dominican Republic)\n\n\tWritten by Natalia Cabral and Oriol Estrada, dramedy stars Maia Otero, Steven Bauer (“Breaking Bad”) and Félix Germán (“The Projectionist”). It follows Julia, a young Dominican cinephile who directs her uncle’s failing action film to secure funding, navigating family conflicts and discovering her own voice. Participated in Cinelátino Toulouse, Panamá Film Match, Bal-Lab Biarritz; supported by Ibermedia and Dominican Film Law. Produced by Lantica Studios, Faula Films and Casa Latina Films, with producers Jordi Gassó, Natalia Cabral and Gregorio Rodríguez.\n\t\n\n\n\n\t\n\n\t\t\t\t\t“My Uncle’s Movie”\n\t\t\t\t\t\t\t\t\tCourtesy of Lantica Studios\n\t\n\n\n\n\t“The Passing Deaths,” (“Las muertes pasajeras,” Agustín Banchero, Uruguay, Brazil, Germany)\n\n\tProduced by Juan Alvarez’s Tarkiofilm in co-production with Arissas (Brazil) and Plotless (Germany), with producers Virginia Bogliolo, Clarissa Guarilha and Tom Schriber, drama follows Felipe, overwhelmed by fear of impending fatherhood, as he flees into a fantasy-filled journey. Written by Agustín Banchero, the film has support from ACAU, Ancine, Ibermedia, Montevideo Socio Audiovisual and Hessen Fund, and participated in Marché du Film, San Sebastián Forum and Brief, highlighting its strong international trade profile.\n\n\n\n\t\n\n\t\t\t\t\t“The Passing Deaths”\n\t\n\n\n\n\t“She Put Away Her Heart in the Fridge,” (“Ela Foi Ali Guardar o Coração na Geladeira,” Cristiane Oliveira and Gustavo Galvão, Brazil)\n\n\tDrama produced by Cristiane Oliveira’s Crisol Filmes with 400 Filmes follows Luiza, who receives videos from a stranger in Uruguay revealing a shocking family truth. Cast led by Verónica Perrotta and Maria Galant. Supported by the Paulo Gustavo Law, Cinéma en Construction Toulouse-São Paulo and Mostra WIP, it features an original score by Sonic Youth’s Lee Ranaldo. “This is the first film produced by my company, a natural process that came from a specific narrative structure,” says Oliveira.\n\n\n\n\t\n\n\t\t\t\t\t“She Put Away Her Heart in the Fridge” \n\t\t\t\t\t\t\t\t\tCourtesy of 400 Filmes\n\t\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "More Women Filmmakers and Greater Diversity at Ventana Sur’s Primer Corte, Copia Final Programs (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/pic_petardosymagnolias.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-17T14:47:41.000Z",
      "dateModified": "2025-11-17T14:47:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Producer Blue May on the Making of Lily Allen’s ‘West End Girl,’ the Year’s Buzziest Album: ‘It’s a Whole Record of Pretty Much Zero Metaphor’",
    "url": "https://variety.com/2025/music/news/producer-blue-may-lily-allen-west-end-girl-album-interview-1236583524/",
    "image": "https://variety.com/wp-content/uploads/2025/11/766964_0028-by-Leroy-Clampitt-e1763386778781.jpeg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-17T13:53:03.000Z",
    "description": "\n\tOccasionally a producer or writer who is known primarily to music insiders suddenly emerges with a calling card that puts the wider world on notice.",
    "body": "\n\tOccasionally a producer or writer who is known primarily to music insiders suddenly emerges with a calling card that puts the wider world on notice. For Blue May, that card is Lily Allen’s “West End Girl,” an astonishing album that may not just be one of the year’s best but be thought of as one of the decade’s best, when these 10 years are all said and done. Whether it registers as a commercial blockbuster or not, it is certainly as truly buzzy as a record gets. And if most of the chatter is about the revelations Allen seems to be making from one moment to the next about chagrinning events in her personal life, the delivery system for all those riveting thoughts is a full album’s worth of deliriously brilliant pop music, forged by a team led by May as executive producer.\n\t\n\n\tIs it the kind of leap that could result in a producer of the year nomination for May at the 2027 Grammys, given that “West End Girl” came out just past the close of eligibility for the current cycle? It may seem wild to project that big that far ahead, but based on the universal acclaim for Allen’s album, it’s a certainty that other big music stars will come calling even if the Grammys don’t. “West End Girl” represents a kind of perfect storm of jaw-dropping candor and equally awe-inspiring musicality that does everyone proud, whether it’s May making a name for himself in the mainstream pop arena or Allen reestablishing her own with a record that may be even stronger than the ones that established her in the 2000s.\n\n\n\tVariety visited the Brit-turned-Angeleno in the exact spot where “West End Girl” was made, in his home in the Hollywood hills, where most of the rooms have become adaptable into recording studio spaces. He offered a fuller perspective than we’ve yet heard from anyone on the making of a pop masterpiece. (The following Q&A has been edited for length and clarity.)\n\t\n\n\tIs there anything that has shocked you about the reaction to “West End Girl,” apart from how much people just love it?\n\n\tThere’s a part of the discourse on the internet that thinks that we sampled the “Strangers Things” intro on “Pussy Palace.” [Some thought they heard this as a supposed allusion to David Harbour being an alleged subject of the album’s lyrics.] And if you listen to the two things, you can’t… I’m like, whoa, man. We didn’t! There was not enough time to be that meta about things, you know?\n\n\n\n\n\tJust as far as how people actually loved it has affected you, that must be exciting for you on all levels, from the positive reaction to the work itself to, we have to imagine, the phone ringing with a lot of work prospects, now that people know what you’re capable of as a producer.\n\n\tIt has been thoroughly enjoyable and, honestly, completely overwhelming. I haven’t had to deal with this kind of noise or this kind of internet thing, and I feel grateful that it’s taken me 20 years to get here and that I’m nearly 40, because I don’t think I would’ve been able to deal with this when I started out in my early twenties. When I got to produce my first major-label artist, it was a complete failure. I didn’t know how to hold the pressure of A&R people and the manager and still represent the artist. In the last 10 years I have managed to have records out that I think stand up, and to make critically good records for important eyes, of which none of those have reached this kind of a critical mass connection. So arriving at this point now…\n\n\tIt’s a record I’ve been chasing for five years with a friend of mine, someone I really care about. If I’ve been convinced of anything for five years, it’s that Lily can still make her best record. Or whether it’s best or not doesn’t matter — it’s make great work that connects with people. I don’t want to make music for a small audience. I want to make pop music and want to reach as many people as possible. And if you overlook an artist like Lily Allen as someone who couldn’t make a splash at any given point in her career, this feels vindicating. To have been able to say it to a lot of people who didn’t agree with me, necessarily, and see it through feels amazing.\n\t\n\n\tAnd then to be right in this moment where it’s exceeded my highest expectations, I know that there’s a lot more people looking at me and willing to open the door to me. All that rings around in my head as wanting to certainly make the most of it and strike when the iron is hot, but absolutely to stick to the methods that I’ve spent 20 years developing. Which is: I can’t make music with anyone unless I can sit with them for a pretty extended period before we even make any music. I need to be able to be given the freedom to do that, like I did with Lily. And one reason we were able to do that was because this record was made in secrecy. The label did not commission this record. The label didn’t know about this album until we played it to them finished and mixed. No one got paid any advances before we started. Everyone I asked to come and join us on this record had to understand that they were coming in and taking a spin at this with us. and I don’t think there’s any other way this record could have been made than to not have anyone else involved.\n\n\tBut it’s not that I’m expecting that every opportunity I get is gonna be direct one-to-one with an artist, and we just make the record: “By the way, guys, here’s an album!” I know there’s gonna be other people involved, but if people can’t give me the opportunity to sort of build a bit of a castle around the project and go deep with someone, then I just don’t think it’s for me. And I’m very wary of taking the wrong offers and opportunities right now, for sure.\n\n\tI think as some of us were listening to the album the first time, we were thinking: This is riveting beyond relief — but will it have repeat value? Is it too tied to all the drama and emotion and narrative to just enjoy on an everyday level? And then, going back to it, it’s like, no, actually, this music hits you in all the pleasure centers, whether you’re still paying close attention to the subject matter or not.\n\n\tYeah. I’d hoped for that. I’ve seen on the internet this sense that, for the first three or four rounds, everyone’s like, “Oh my God, oh my God! What the fuck? Oh my God.” And then actually a lot of people say that it’s now sort of settled into where they can listen to it and not have to be so wrapped up in the lyric, and it can actually exist in the background as well. To me, with pop music, if you can do that, man, that’s the bullseye. It’s like, move people, scare people, shock people, put them on the edge, make them cry, make them laugh, make ’em do all that kind of stuff. And then hopefully, eventually, that piece of work can become something that can just exists as a part of people’s lives that doesn’t always have to be a heavy listen.\n\t\n\n\tBut also, any listener, if they suddenly years down the line go through something in a relationship, they might go, “My God, this experience I’m having is starting to sort of mirror that a little bit… maybe I should go back and listen to that record” — whether they’re going through it or whether they’re about to go through it and they’re like, “Whoa, no, I’ve gotta push the brakes.” Then maybe they can reconnect with it being a moving, deep, heavy piece of work again. I think hopefully it can operate in all sorts of different spaces, you know?\n\n\n\n\t\n\n\t\t\t\t\tMusic producer-writer Blue May in his home studio\n\t\t\t\t\t\t\t\t\tAnnabel Snoxall\n\t\n\n\n\n\tCan you talk about the five years you spent wanting to make a record with Lily, and trying to, and not succeeding, before this project suddenly blossomed?\n\n\tLily’s and my history before we made this record is, I worked as her creative director on the end of the last album, so I helped design the touring for promoting “No Shame” [in 2018]. Musically, I think that record is a really good record, and Lily’s always honest in her lyrics. But the reason I decided to help her out and work with her on the tour was not because I was that drawn into that album, but more because I was told that she’d had such a difficult time touring before. It had always been the root of some big spirals in her life when she’d sort of gone off on tour. So I had this first feeling towards her of “OK, well, I think I know how to put a good bunch of people around her and give her an experience that’s not hopefully as awful as that.” And so, initially the sort of trust between us I think just came from wanting her to kind of be OK. And then when we both emerged unscathed from that whole period, we started talking about writing music together.\n\n\tMy thing to her, and I don’t think she’d mind me saying this, is I just always said to her, “Lily, I really want to make a record of you, but I really wanna get back to the early DNA of your music.” I wanted to give her the confidence in the value of the thing that she concocted 20 years ago. In our four years of conversation leading up to us actually making a record, I knew I wanted to self-reference back to a place of, like, she generally writes in major keys. Generally, the songs we all gravitate towards with Lily, there’s the sort of nursery-rhymey sort of playfulness, and I couldn’t use those kind of melodies or sounds with any other artist I’ve ever worked with, but for some reason with her it works. There’s a little bit of musical theater and that kind of stuff. In juxtaposition with that is the fucking absolute knife to the heart of the subject matter of her lyrics, which are so sharp and brutal and self-deprecating. The lyrics could be very crude about the subject as well, and for a woman to do that, there’s not too many examples before her that did it quite as straight as she did.\n\t\n\n\tBut the other side to that is that I definitely didn’t want her to think that she had to pretend to be 20 years old again and talk about the same thing she cared about 20 years ago. I want to hear stories from 40-year-olds. I want to hear what Lily Allen’s saying as a 40-year-old, as a mom of two. I didn’t have any idea we’d end up making a record that was just on one subject, or a record that was chronological. But I definitely wanted that sort of sweet voice and that sweet melody and the sort of theatrical sort of fun songs that are fun to listen to that you want to go back and back and back to, but mixed with exactly what she was going through right now. And I think we did that.\n\n\tI think one of the liberating things for us on this record was that we wrote probably the saddest song on the first day.\n\n\tWhich was “Just Enough,” right? Which is a very straightforward ballad in its heartbreak. It’s just stark. Was it important to establish the truly sadcore part of the record as a foundation, before you were able to get playful or inject humor into other parts of it?\n\n\t“Just Enough” was written the first three hours. Lily came on the first day and we sat out here on the deck, where we are now, for two hours. She completely poured out her experiences, and then was like, “Here’s the song titles — let’s write a record about it, and let’s do it in chronological order.” And she talked about that classic song, “Can’t Help Falling in Love” and the line “Fools rush in.” As soon as she said “Fools rush in,” I was like, I can see the picture of the whole thing. But then, you know, she was really upset the first day. Obviously, she was upset at different times — she was fucking fragile. And it was just lucky that we were in a room of me and Chloe Angelides and Kito, and we wrote that first song. I think the only song that could have come out first was the song of complete despair. And that vocal is the original vocal. We tried to redo it several times; it’s pretty fucking rough. When we came to the end of that song, that was written in its entirety two hours.\n\n\tAnd the next song we wrote was “Tennis,” after that; we did “Just Enough” and “Tennis” in the first day. So by the end of the first day, we had the deepest heartbreak. I’m like, there’s probably only space for one ballad on a record. I’m not thinking that we’re gonna go and write 10 more. You know, I want to write a pop record with her. But we’d also written “Tennis,” which to me is probably the most out-and-out pastiche of her early work. There’s a chord change from the verse to the chorus that is a major shift. There’s a key change in the chorus that feels like a pastiche of Lily Allen. It almost feels like someone trying to make a Lily Allen record, but we did it for Lily Allen. And the “Tennis” story is heartbreaking, but it’s also funny. So we got to the end of day one and I was like, “Oh my God. We’ve got potentially a single and the saddest moment of the record in the first day. We’re free now. We can fill in every blank, between one extreme and the other.”\n\t\n\n\n\n\n\tThere are a lot of co-writers and co-producers on this album, and you were dealing with situations with a lot of people in your home studio here. You established a lot of personal trust at first and then there were a lot of other people who came on to help enact that. Is it easy to stay focused on the super-personal stuff in a group situation?\n\n\tWell, the backstory of that is that, for one thing, I’ve never made a record like that before. I’m generally someone who is just in a room with the artist and I’ve not done big writer rooms. The reason we put that together like that is because I’d tried to make an album with Lily two years ago, where I went to New York for two months at the end of 2022, and I stayed in an apartment in Manhattan and built a studio in there. I was really trying to recreate what I imagined the setup would have been of how she wrote her first two records, with just her and a couple of producers. And it was a complete failure. I was there for six weeks, and I don’t think we wrote one good song in six weeks. I remember her telling me the stories of how she wrote her first two records, and especially the second record with Greg Kurstin. At one point she was like, “Oh yeah, we got a country house somewhere in England and we wrote it all in two weeks.” We’d already been failing to make this record, and I was like, “Oh my God, I’m fucking awful. I’m so shit.” And when I eventually left New York, I said to Lily, “I’m gonna go, because I don’t think this is the right time to do this. But I hope that we get to have another go at some point when the time is right for all of us.” And obviously I could tell that Lily was feeling very blocked. I also don’t feel like I necessarily put the right things in front of her to shift that block.\n\n\tAs I was picking over that 2022 session, it really occurred to me that Lily had never written a record sober before. And I think when she wasn’t sober, there was this confidence that she could throw ideas out in the room. You know, it always amazes me how enormous artists can be insecure about how well they can sing, how well they can write. At that time she definitely lacked confidence with singing in the room, and I think not having the crutch of alcohol and drugs made that so loud. When we were in New York, she couldn’t do it, even just in front of me or a couple of people. So there was a lesson I learned.\n\t\n\n\tEventually, she was passing through L.A. in the summer of last year. We had dinner, and it was the first time she’d started to tell me a bit about what she’d been going through in her personal life. At the end of that dinner she was like, “I think I’m kind of getting to a place where I’m ready to write. If you’re still interested, I’d love to try it out with you.” Then she phoned me about a month later and was like, “OK, I want to do it. Should we put some time in? What time have you got available?” And I said to her, “OK, cool. I’d love two things. One, can you come here to L.A.? Because I think you being out of your immediate day-to-day life and the commitments you have is gonna be better.” She doesn’t have to do this, you know — put her life out in the world again. When you are already a successful person, there is the temptation to just not do it and hide and go underground. When I was in New York in 2022, I think she’d just wake up and there’d be some reason why she could get out of it, like, “Oh, my daughter’s sick off school today and I can’t get the nanny to come around.” And I totally empathize with: Why should she have to do it? But I said to her, “Can you come to L.A.?” Because in my head I was like, there’ll just be less distractions, or less ability to find excuses in herself to not turn up to the studio.\n\n\tThe second thing I said to her was, “And I’m thinking that we should do more of a fleshed-out pop room and bring in writers and other producers.” It’s something she’d expressed an interest in before. I felt she needed a bunch of people to run with the idea, and almost be the people first people in the room to just put noise in the room, so she didn’t have to be the first one to go,”What would you think if I say this lyric or sing a melody?” So she’d tell us a story, and we’d start making sound. Chloe or Violet (Skies), who were the two main sort of top-liners in the room, would then kick into gear. They’re not un-confident with singing a melody in the room, or with singing a shit lyric. They’re songwriters who are trained that it’s their job to [just be OK with singing silly things into the room until something sticks. So that would allow us to form things quickly without Lily having to implicate herself in the sort of slightly difficult “is that good, is that bad.” Then at the point where there’d be a bit of a melody and a bit of a lyric or a bit of “this is the verse, this is the chorus,” then Lily would reemerge in the room, take these sort of pop co-write lyrics that were kind of about the subject matter but not in Lily’s words or language, and do this really quick editing process where she’d change lines, add lines, put in these punchlines — you know, some of the raw things that she said in this record. Like, there’s no songwriter in this world that would turn around and be like, “What about if you said, ‘I didn’t know it was your pussy palace’? Or what about if we say ‘butt plugs’ in the song?” No songwriter is gonna tell an artist to say that. Lily is reading through these blocks of different ideas for lyrics, and then putting her own voice into that. She’ll be like, “Lemme just put it down. Lemme just scratch on the mic.” Even when she would take all the melodies that had been sung in the room, she’d also totally put her own cadence on it immediately, and do these turns of melody that only she does. And then she’ll sing these Lily-fied lyrics, and you’re just like, “Oh my God, this is a Lily Allen record.” And then we’d refine things. But Lily would get excited and then she would fucking make it hers. And that’s the root of how most of these songs came together, which I think was a good experiment.\n\t\n\n\tEspecially when you’re a professional songwriter or a professional producer in L.A., it’s like you’re in the copy room; you’re just peeling that one off and peeling that one off and seeing which one sticks. So to be brought back down to earth and handed an artist that was in this incredibly heightened emotional moment in her life, but also on the other hand just so willing to kind of expose it all, I think from the writers’ point of view it was just an “Oh, man, this is what it’s all about” kind of vibe. It was a really beautiful time — as much as it was a hard and adrenaline-fueled and confronting time as well.\n\n\tThere were these two main rooms going in the house— we’d have the sort of me/Kito/Chloe/Lily room that also had Leroy Clampitt coming in and out of it. And then I also had the Jeremy (Malvin)/Chrome Sparks/Micah Jasper/Violet Skies/Lily room. So I’d do a couple of days here and then I’d go to Jeremy’s for a day and we’d come back and it was “Check this one out.”\n\n\tWe’ve heard about how quickly this album was done… that the majority of it was written and recorded in one fruitful 10-day stint at the end of 2023, with a little bit of follow-up work in the new year. Can you explain how you got this rich an album, starting almost from scratch, coming in with no songs?\n\n\tThat first 10-day stint was at the start of December last year. How it started on the first day is: The night before she came for the first day of the sessions, she had written down 18 song titles that were telling the chronological story of what she’d just been through for the last five years. We worked from those song titles; she hadn’t written anything else. So how the process would be for every song is that at the start of the day, we’d all come in and settle down, I’d say to Lily, “Are you drawn to any of these titles or any of these subject matters today?” And she’d go, “Yeah, actually, I kind of feel like I want to tell this story today”  — some of the titles changed by the end — and then she’d tell us absolutely gory details about the story. Then we’d start making sounds based on what that might feel like, or what might be a good sort of soundtrack for that kind of thing…\n\n\tAt the end of the first 10 days, we had worked our way through 14 of those titles, but she still had four more titles. We were like, “Right, we want to hit all of these.” But it was gonna be Christmas and New Year’s, and she had planned to go into a sort of rehab center in January. So literally the nearest next available time was February. She and I went and got a coffee in Los Feliz and were looking at each other, going, “We’re really doing this right now, aren’t we?” As in: “We’re not gonna drag this out for six months. We’ve got these 14 songs in the first 10 days. The next time you come back, we are gonna find the missing songs and we’re gonna finish the whole record.” So we blocked out a month in February, and when we came back, the first two weeks were designated to be trying to get those last four songs — but actually we got them in the first two days. And so I actually canceled sessions with other writers because we had kind of closed out the record. And the last two songs we wrote were the first two songs on this record.\n\t\n\n\tSo did you end up getting rid of four songs to get it down from 18 to 14?\n\n\tWhat happened a couple of times is that we actually managed to hit two topics in one song. She might have had two separate titles, but we ended up wrapping them into one song. Then originally there were meant to be two songs before how the album starts now. There was a whole plan to start the record a different way, and we recorded that, but Lily made the brilliant judgment that the record needed to start with “West End Girl,” so we canned those two. Then outside of that, there was one other song which we mostly finished, a song that was gonna go between “4Chan Stan” and “Nonmonogamummy,” but when we listened to the whole sequence with that song in it, I started to feel a little bit like we were staying in one space too long, so we edited it back a little bit.\n\n\tIt’s interesting that the last songs written for the album are the first in the running order, when it’s a chronological story being told. Why did it turn out that way?\n\n\tYeah, it is funny how we kind of ended, at the end, with the start. I think the reason why it went in that direction was because we were trying to get a song that talked about the short-lived period of the relationship that was happy. And actually the thing she found hardest to do was talk about that period.\n\n\t“West End Girl” and “Ruminating” were both done in the same sessions with the same group of people. Other than me and Lily, the other two people in the room were new. And at this point we’d written the whole rest of the record with two kind of quite well-established groups of people. So to bring two completely new people in was in itself kind of a little bit nerve-wracking. And Lily had just come out of doing deep therapy work for a few weeks. I’d asked her if she was OK with us scheduling the first sessions back with completely new people. And she said she was, but actually when she arrived, she was in a much more difficult emotional state than even when she first arrived in December. She was a lot more fragile than she was back then. And those days writing “Ruminating” and “West End Girl” were in some ways the toughest writing days, even though we got great songs out of them.\n\n\tI think if I was worried about anything from a purely critical standpoint of how people are gonna receive this album on a sort of purely production level, “West End Girl” is probably the one I was most worried about, because… it’s like bad music. It’s meant to be kind of lift music [elevator music], effectively. All the things where it speeds up and slows down and how it goes into the phone call, I really loved it when we made it, but I did wonder whether it was too much of a mood piece and worried about it starting the record. Because I think this record makes you wait a few songs until you get into a space that feels kind of normal, in a way, or something that’s palatable. I mean, I think it’s come across well, but I was definitely worried about throwing someone into a minute-and-a-half-long phone call in the first song.\n\t\n\n\tIt feels like a brilliant call — no pun intended — to have done that. If you hear that first track, you are in for the whole album, unless you don’t have a curious bone in your body. Whose idea was that, to have one side of a phone call in the song at all?\n\n\tBy that point, we’d already done that “Madeline” song, which felt like a “Jolene” sort of idea. She told us a story about the email to this person and getting an email back and this sort of funny exchange. At some point there, it was like, well, do you just read from that email, or… I don’t think I was imagining that Lily would do it, but as soon as the idea was in the room, it was like, OK, cool. We made some space for her and she just freestyled the whole Madeline part. We were like, Whoa, this is crazy! Like, Lily’s just acted it out completely in one take. She just put on this American accent and sort of pretended to be this person. And I guess that’s kind of the chorus of this song, where we were like, “OK, do we do it again at the end? OK, cool!” So we had this kind of theater piece in “Madeline.”\n\n\n\n\n\tSo when we ended up doing “West End Girl,” we already had this confidence that in places in the record we could maybe do this kind of theatrical break where you get so real with it. And with “West End Girl,” we’d written the basis of it, and it wasn’t a very structured song. It doesn’t feel like it’s got a defined chorus, and I don’t even think the chorus repeats itself. The whole song is a long stream of consciousness. And as you do in these kinds of sessions, you think, “Oh, do we need to sort of nail down a proper chorus? Do we need to structure this better?” But we knew we needed to get this moment.\n\n\tThere was the arriving-in-New-York thing, and I was really trying to push her to kind of sit in the love and the excitement, which was really hard for her. When we were writing that song, it was almost like she was the one pushing the wheels to come off really quickly, and I was almost pushing to say, no, we can just stay in this kind of loving dream. I was picturing the cartoon birds flying around her head. But she couldn’t help but want to rush towards the first moments of the cracks appearing.\n\n\tThroughout this album, it was really important to understand why she was telling us these stories — where she was in all those moments. So with “West End Girl,” there’s two major locations in that song. It’s walking up to the new house they’ve bought. She told me the story that just as she was putting the key in the front door, the first time she walked into that house, she got a call at the same time from the person offering her a part in a play back in London. I think for her (it was symbolic), that very moment where you’ve got the key in one hand and the phone in the other. The key represents “be a housewife and almost give up on fame and just be the supporter of this other famous person,” and the phone call is like, “Hey, by the way, everyone’s still thinking about you. We’d love you to do this. It’s not quite what you’re known for, but we think you’d be great at it.” Lily’s an ambitious person. I think she’s always gonna be tempted by expressing herself. So there’s that point where then she tells the husband character, and he’s not happy for her, and that’s the first time it’s like, whoa. And then, being Lily, because she’s confident, because she has this gusto to go and throw herself into challenging situations and try new things like acting, she goes to London. So the next place was the London hotel room. She’s gone down her own road, despite the resistance. And then there was a phone call where there was a conversation about, “If you’re choosing to leave the home and be away, then I’m gonna need to express myself with other situations.”\n\t\n\n\tWhen someone’s telling you a visceral story like that, obviously, normally when you’re writing songs, you’d sort of try and find metaphors. But by that point, we already made a whole record of pretty much zero metaphor. So it was kind of like, “Well, should we just do a phone call?” And, again, Lily freestyled that in one take. It was not concocted, particularly. When I was recording it, I’d made a bunch of space for her to freestyle this phone call, but I just kept on as she was recording, doubling it and doubling it, because she kept on going. I was thinking it would be something that would be about five seconds long. But then she just kept on going, perfectly spacing herself. None of that is edited. And I think this record was a continuous experience of recording it all and writing it all in a complete stream of consciousness. Like, oh my God, should we just do a phone call? And she’s like, “Yeah, yeah!” It was like: get the mic, hit record, no preparation — just her doing it.\n\n\n\n\n\tAnd actually on nearly all the songs, after we’d play it back, we’d all be a bit like a “My God, what have we just done?” kind of thing. The first thing was always just to go for it, and the second was like, fucking hell!And she’d often become really emotional listening back to stuff, after the fact.\n\n\tWith the spoken emails you mentioned in “Madeline,” when you say that was freestyled, does that mean she was writing it on the spot? Some people have wondered if she was reading an actual email, and maybe not even making it up.\n\n\tI do think it’s important that Lily is allowed the protection of what is real and what is not real on this record. I’ve seen it written about as being an “auto-fiction” kind of thing. I think for me, as she told her stories and said the words, I was in complete belief of everything that she was saying. And I never have wanted to pry too much into what’s real and what’s not real. But I do think the protection that allows Lily to at least exist in the idea that no one quite knows what’s real and what’s not real is important. And I think it’s important, in order for this work to exist, that that sort of layer has to exist as well.\n\n\tSo with the Madeline stuff, I think she had a very good memory of a feeling and an experience that, when that idea came up, it was something that she was capable of freestyling in one take. I think I’m probably OK to say that, right towards the end of the process, we did a round of cleaning things up to just make sure that we were not sort of saying real names and not saying things that would be kind of being problematic for Lily, in letting this music out.\n\t\n\n\tOf course she has had a successful career as a stage actress in London these past few years. Something that’s fun, during “Tennis,” is just the half-dozen different ways she has of reading the line “And who’s Madeline?” — and eventually “And who the fuck is Madeline,” or “And who is Madeline, actually?” There’s wit and great timing in how she puts a slightly different spin on her reading of it each time. Obviously she’s been successful with music for 20 years, but you have to wonder if the stage acting experience has given her an extra ability to even think about those tiny bits of timing that give something an extra zing.\n\n\tYeah, a hundred percent. I mean, she’s a genius and seeing her work in real time is incredible. There are all those moments where she really does things that leave everyone just completely taken aback in the room. I just think there’s certain people in this world that are born to be culturally central people. They are people that embody or interpret what life is and put it into these concentrated delivery methods of wrapping things up into a bow that I think end up being quite universal experiences… I think Lily’s one of the most complete people when it comes to the extreme of being willing to put her own experiences out in the open in a way that is just so super courageous and very “Fuck you.”\n\n\tI even spoke to her in the studio, in moments of support, just going, “You know, I think the world needs your work.” And I understand that that’s a heavy thing to handle, because when you’ve had the life experience she’s had and the kind of feedback she’s had from the internet and any number of other people, that she’s got every reason to just never want to poke that bear again. But here she is poking it, kind of in a new way, but also in a kind of even more extreme way than maybe she’s ever done it before — but definitely similar to how she did it at the start in some way. That to me is the part of being a cultural icon, being the kind of artist actually that sort is willing to expose yourself. And I think the other part of being an artist or an entertainer is about being willing to dramatize. In order to get the message home and to tell the story, you’re not playing real life completely, are you? And there has to be some level of theater to everything. So when you’re talking about “Tennis,” the way she pronounces those words, or the little tone of phrases, I think Lily’s one of the most incredible people in understanding her viewer and understanding how to spin things in little ways that just kind of catch, catch, catch, and putting the acting slant on it.\n\t\n\n\tSome of the humor or even implied humor comes not just through her delivery but what is in the music beds, which are sometimes played for irony.\n\n\tA hundred percent. “Tennis,” to use an example, starts when she’s making dinner for everyone. He’s been away, he’s come back, and it’s like Sunday afternoon sort of background music, kind of homogenized, like if you left your Spotify on for too long on sort of soul playlist. The same with “West End Girl” and so many of the songs. And with “Madeline,” it’s a sort of shootout — that’s why there are these gun sounds: she’s riding off to go and chase down this secret lover. And yeah, it’s all theater.\n\n\t“Dallas Major” is like that. She’s talking about going out and dating again and creating a dating profile — kind of “if you can’t beat ’em, join them. If I’m gonna be forced to experience this from the other side, then I better go and live it up myself.” And to me that bit of music is like being in a New York club in the ‘90s, sort of “Sex and the City,” with that sort of generic, funky, light disco, in those sort of like martini-glass kind of clubs… I always had this idea of seeing her in the video with all these different guys and this sort of speech bubble pops up and it’s like, “And that’s how I got into Bitcoin,” but in the background there’d be a DJ…\n\n\tThen there’s other songs where it’s less about a place and more just about a feeling. With “Ruminating,” we’d done “West End Girl,” we knew the phone call was there, and then it’s like, fucking hell, now we’ve gotta explode. The husband character in this album has just told the wife character in this album that he wants to sleep with other people, and “Ruminating” is about getting the call of hearing that it has happened. And then he’s going, “If it has to happen, do you want to know? I’m gonna do it more. Do you want me to tell you every time or not?” And she’s far away in a hotel room, not even in her own house. We’ve all been there in that situation where your mind’s just kind of rolling over something again and again. I I was really enjoying using the Korg Triton a lot, because it’s like this plastic-y kind of ‘90s/2000 sound anyway, and it’s got this one drumbeat that I found a couple of days earlier that I just sped the temp up so it felt like this “ruminate and ruminate and ruminate and ruminate and ruminate.” The title wasn’t “Ruminating,” yet, but we knew that’s what it was about, so it was about making those sounds.\n\t\n\n\n\n\n\tThe same with “Pussy Palace” as well. Literally before Lily finished even talking about it, it’s just like, “Oh my God…” You’ve opened the door in this place and you’ve seen all this stuff and reality is just flooding into you. Like, who is this? What am I involved in here? So I just was thinking about every bit of blood running from your body. Most of the time there was something like that that came so quickly after her kind of recounting the story effectively. It’s all very literalmusic.\n\n\tThis is visceral, sharp and very low on metaphor — like, we’re just gonna say the exact thing there. But maybe something that is not discussed is, there’s also a lot of like, “Hey, this is sick.” [As in, just musically exciting.] “Relapse” is one of my favorite songs on the record. And it’s very British. That’s totally lyric Lily’s music. It’s also totally my music and is totally Oscar Scheller’s music, who’s another Brit that worked on the records; he kind of led that beat. And as heartbreaking as that song is — because she’s pushed to the edge where she’s like, “Fuck it, can I hold my sobriety against all this? I just want to get numbed out” — there’s another big part of that is also just like: This is a fucking banger. And it’s just that simple.\n\n\n\n\n\tHow quickly or gradually did you share that this record was being made?\n\n\tWe shared it with her manager towards the end of the process. The record was pretty much written by the time we played him everything. And he and I discussed a lot about when to play it to the label, because one of the big questions was, OK, everyone had been generous of their time, although it only took 16 days. So we needed a few more days from this or that person. But by the time we got to the end of the writing and basic production stage, then we were getting into big expenses. There came a point where it was like, well, we’re starting to need some budget now to actually to be able to do things. Then it was a conversation between myself and her manager saying like, “Hey, can we finish this record without sharing it with anyone else? Or do we need to go and play this in the current state in order to get them to back the rest of what needs to happen — getting it mixed, recording Amy Langley’s strings, mastering and all that stuff?” And the decision was made to basically finish the record in its entirety. We finished mixing it on a Sunday, and Lily’s manager went and played the record to BMG the next morning, and that was it.\n\t\n\n\tI haven’t shared it with many people in the last six months. Lily shared it with a lot of close friends, because she needed a bit of that feedback from people. But you’ve got to remember as well that Lily’s had to keep a firm lid on this album just purely from a point of view of how it impacts her life in other ways.\n\n\tAnything interesting you’re working on at the moment?\n\n\tI’m almost finished this Latin record for this artist called Yendry that is amazing. It’s completely in Spanish, other than one song that’s in Italian. I don’t understand any of the lyrics. It’s very interesting making a record where I really do not have that sort of lyrical thing to jump off, other than how she explains it to me. It sort of cuts off a sense, but in the same way, then I become so tuned into her vocal performances, understanding where the push-and-pulls are. And I have some very exciting conversations going on since this album came out that I’m sort of like, “Oh my God. Let’s go, man.” I want to hopefully do more with Lily as well.\n\n\tAny music stars you will be hoping ring you up?\n\n\tI just want to make loads of really great, great records. I want to make a Madonna record. I was such a fan of that run she was on from “Ray of Light” to “Music” to “Confessions on a Dance Floor,” and I think you can never count her out as dropping a genre-defining record. I would love to make her “Blackstar,” just looking back over her whole life and her career with that self-referencing. I think she’d be quite amazing to do that, if she was in a place to want to do that.\n\n\tIf you approve of artists being self-referential, you must have really been approving when Lily literally says the title of a previous album, “It’s Not Me, It’s You,” as key words in in the final track on this album.\n\n\tWhen she did that in the room, saying “it’s not me, it’s you” as the hook… She knows how to spin it for herself, but she also knows how to spin it for everyone else. And I just think she’s like an absolute ninja of knowing how to hit the bullseye. And I think in that moment, there was that question of: Can you self-reference your own album title from years before? Probably only in that song, in that very moment, when you’re trying to bring a close to things.\n\t\n\n\tShe’s got more stories to tell. She’s very good at interpreting life and putting it out in these boxes that can really move people. If I hope anything for Lily, I really hope she’s enjoying this right now, seeing the responses. I think she is. I’ve been around her a little bit in the last week, and I hope that now she can feels like she can stand in that as an important career artist that has influenced so many artists, and hasset the bar for a lot of these people, and let them be crude and talk in music as sort of diary entries… and (influenced) especially females to not have to be polite. I hope she can sit here after this record and go, “Wherever I decide to point my focus is OK, and I deserve to be here. I’ve always got the chance to make my best work.” I think that’s beautiful, if someone can get to that place.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Producer Blue May on the Making of Lily Allen’s ‘West End Girl,’ the Year’s Buzziest Album: ‘It’s a Whole Record of Pretty Much Zero Metaphor’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/766964_0028-by-Leroy-Clampitt-e1763386778781.jpeg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-17T13:53:03.000Z",
      "dateModified": "2025-11-17T13:53:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Guess Who This Lil' Cutie With Pig Tails Turned Into!",
    "url": "https://www.tmz.com/2025/11/17/guess-who-cutie-with-pig-tails/",
    "image": "https://imagez.tmz.com/image/81/16by9/2025/11/12/81f6d0895f064476a1751d3cd0159e11_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-17T08:01:56.000Z",
    "description": "\n    \n                    \n                          Guess Who This\n                          Lil' Cutie With Pig Tails\n                          Turn",
    "body": "\n    \n                    \n                          Guess Who This\n                          Lil' Cutie With Pig Tails\n                          Turned Into!\n                      \n                  \n                        Published November 17, 2025 12:01 AM PST\n                                                                            \n      \n    \n      \n        \n              \n    \n    \n          Before this lil' blondie hangin' onto her dad turned into a global superstar, she was just growin' up in Pittsburgh and dreaming of the big stage and flashing lights.\n      \n    \n          When she was just a kiddo, she sang alongside some of Hollywood's biggest stars like Britney Spears, Ryan Gosling, and Justin Bieber.\n      \n    \n          \"If you wanna be with me, baby, there's a price to pay ....\"\n      \n    \n          Can you guess who she is?\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Guess Who\n              \n                          \n                Kids\n              \n                          \n                celebrity kids\n              \n                          \n                Photo Galleries\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Guess Who This Lil' Cutie With Pig Tails Turned Into!",
      "image": [
        "https://imagez.tmz.com/image/81/16by9/2025/11/12/81f6d0895f064476a1751d3cd0159e11_xl.jpg"
      ],
      "datePublished": "2025-11-17T08:01:56.000Z",
      "dateModified": "2025-11-17T08:01:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jack Doherty Bails Himself Out, Sports TMZ Mugshot Shirt",
    "url": "https://www.tmz.com/2025/11/16/jack-doherty-out-on-bail-wears-tmz-mugshot-shirt/",
    "image": "https://imagez.tmz.com/image/5e/16by9/2025/11/16/5e9889c53cd148538748f9a7a98b1d51_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-16T22:56:23.000Z",
    "description": "\n    \n                    \n                          Jack Doherty\n                          Look, Ma, I'm on TMZ!!!\n                          Wears Ow",
    "body": "\n    \n                    \n                          Jack Doherty\n                          Look, Ma, I'm on TMZ!!!\n                          Wears Own Mugshot on T-shirt After Posting Bail\n                      \n                  \n                        Published November 16, 2025 2:56 PM PST\n                                                                      |\n                Updated November 16, 2025 3:32 PM PST\n                                    \n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Jack Doherty is out of jail and on TMZ ... or rather, TMZ is on him ... cause he wore a t-shirt with our logo over his mugshot in a new video.\n      \n    \n          Just after posting bail last night, the content creator took straight to TikTok to document his return home, saying, \"I'm about to take my first shower since getting out. Jail is so freaking dirty, I didn't want to take a shower in there.\"\n      \n    \n          Waiting for your permission to load TikTok Post.\n      \n    \n          In another video, the 22-year-old boasted about posting his reported $3,500 bail as soon as his bail was available ... \"I got out in under 24 hours.\"\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          As we reported, Jack was arrested in the Miami area outside a smoke shop and booked into Florida's Turner Guilford Knight Correctional Center just before 9 AM on 3 charges -- possession of a controlled substance, possession of marijuana, and resisting arrest.\n      \n\n          Specifically, cops say he was in possession of amphetamine -- a medication used to manage ADHD and narcolepsy -- and less than 20 grams of weed.\n      \n    \n          Waiting for your permission to load TikTok Post.\n      \n    \n          Jack rose to fame in 2017 after his videos showing himself flipping various objects went viral. He has more than 13 million followers between TikTok and Instagram and 15 million on YouTube.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          We appreciate the love, but also ... maybe try not to have any more mugshots in the future.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Jack Doherty\n              \n                          \n                Celebrity News\n              \n                          \n                Fairly Legal\n              \n                          \n                Influencers\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jack Doherty Bails Himself Out, Sports TMZ Mugshot Shirt",
      "image": [
        "https://imagez.tmz.com/image/5e/16by9/2025/11/16/5e9889c53cd148538748f9a7a98b1d51_xl.jpg"
      ],
      "datePublished": "2025-11-16T22:56:23.000Z",
      "dateModified": "2025-11-16T22:56:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Karen Huger Says Her 'Heart Is Full' In Post-Prison Comment",
    "url": "https://www.tmz.com/2025/11/16/karen-huger-speaks-out-after-prison-release/",
    "image": "https://imagez.tmz.com/image/e3/16by9/2025/09/02/e32dc50007584061a6829e9c44b3e09d_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-17T01:24:49.000Z",
    "description": "\n    \n                    \n                          Karen Huger\n                          Speaks Out in First Post-Prison Post\n                      ",
    "body": "\n    \n                    \n                          Karen Huger\n                          Speaks Out in First Post-Prison Post\n                          'My Heart Is Full'\n                      \n                  \n                        Published November 16, 2025 5:24 PM PST\n                                                                      |\n                Updated November 16, 2025 6:03 PM PST\n                                    \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Karen Huger is officially back on Instagram, on Bravo soil and in full \"Grand Dame\" mode ... marking her first public facing moment since walking out of prison.\n      \n    \n          \"The Real Housewives of Potomac\" star made her social media return Sunday, posting for the first time since she was released in September after serving time for her DUI conviction.\n      \n    \n        Waiting for your permission to load the Instagram Media.\n      \n    \n          Karen thanked NBCUniversal and Bravo for the \"warm and welcoming energy\" during her big BravoCon comeback in Las Vegas over the weekend.\n      \n    \n          She also shouted out designer Charles Elliott Harbison ... calling him her new favorite person for creating her white peplum look with black and white floral appliques. Karen said he \"honored my light” and helped shape a moment that \"feels fresh and aligned\" as she enters her \"new chapter.\"\n      \n    \n          Waiting for your permission to load TikTok Post.\n      \n    \n          Karen skipped the RHOP panel Friday but shocked fans later that night when she stepped onstage at \"The Bravos\" to present the first award.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Her return comes two months after she was released six months early from the Montgomery County Detention Center, where she was serving a one-year sentence tied to her 2024 DUI crash in Potomac, MD.\n      \n      \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Karen Huger Says Her 'Heart Is Full' In Post-Prison Comment",
      "image": [
        "https://imagez.tmz.com/image/e3/16by9/2025/09/02/e32dc50007584061a6829e9c44b3e09d_xl.jpg"
      ],
      "datePublished": "2025-11-17T01:24:49.000Z",
      "dateModified": "2025-11-17T01:24:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'RHOBH' Kathy Hilton and Sutton Stracke Homes Burglarized While at BravoCon",
    "url": "https://www.tmz.com/2025/11/17/kathy-hilton-sutton-stracke-homes-burglarized-during-bravocon/",
    "image": "https://imagez.tmz.com/image/df/16by9/2025/11/17/dfdff15e6ba941ee8fe9f7bbeb2533d6_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-17T14:49:27.000Z",
    "description": "\n    \n                    \n                          2 'RHOBH' Crime Victims\n                          Burglars Spotted in Kathy Hilton's Bedroom!!!\n ",
    "body": "\n    \n                    \n                          2 'RHOBH' Crime Victims\n                          Burglars Spotted in Kathy Hilton's Bedroom!!!\n                      \n                  \n                        Published November 17, 2025 6:49 AM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          The homes of \"The Real Housewives of Beverly Hills\" stars Kathy Hilton and Sutton Stracke were both burglarized Saturday while they were away at BravoCon, TMZ has learned.\n      \n    \n          Law enforcement sources tell TMZ ... at around 2 PM Saturday, Sutton's dogwalker called 911 and said the kitchen window was broken. Cops came and took a police report. We don't know if anything was taken.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          The more alarming incident was on Saturday night ... Rick Hilton called 911 and said there were 3 burglars inside the family home. Cops came, but apparently the burglars had escaped. Again, we don't know if anything was taken.\n      \n\n      \n        \n                    \n                  \n      \n                    TikTok/@katierosepope\n          \n    \n          Both Kathy and Sutton were at BravoCon in Vegas ... a heavily-publicized event. It's not hard to connect the dots -- the bad guys assumed the houses were easy targets.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Kathy and Sutton didn't let a little crime get in their way -- they were both at BravoCon Sunday.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Kathy Hilton\n              \n                          \n                Bravo\n              \n                          \n                Celebrity News\n              \n                          \n                Reality TV\n              \n                          \n                Crime\n              \n                          \n                Fairly Legal\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'RHOBH' Kathy Hilton and Sutton Stracke Homes Burglarized While at BravoCon",
      "image": [
        "https://imagez.tmz.com/image/df/16by9/2025/11/17/dfdff15e6ba941ee8fe9f7bbeb2533d6_xl.jpg"
      ],
      "datePublished": "2025-11-17T14:49:27.000Z",
      "dateModified": "2025-11-17T14:49:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tom Cruise Delivers Emotional Speech at Governors Awards, Watch the Video",
    "url": "https://www.tmz.com/2025/11/17/tom-cruise-speech-governors-awards-hollywood/",
    "image": "https://imagez.tmz.com/image/da/16by9/2025/11/17/daba0b91ce3e44378bbb47cf60c687d3_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-17T14:36:32.000Z",
    "description": "\n                    \n                          Tom Cruise\n                          No Mission Is Impossible ...\n                          Gets Emoti",
    "body": "\n                    \n                          Tom Cruise\n                          No Mission Is Impossible ...\n                          Gets Emotional in Governors Awards Speech\n                      \n                  \n                        Published November 17, 2025 6:36 AM PST\n                                                                            \n              \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Tom Cruise brought down the house at the Governors Awards Sunday night, delivering an emotional acceptance speech about the very thing he does best -- making movies!\n      \n    \n          The iconic actor was given an Honorary Oscar during the show at the Ray Dolby Ballroom in Hollywood by Alejandro G. Iñárritu ... who happens to be directing Tom in his next film, an untitled project slated to be released in October 2026.\n      \n    \n          Waiting for your permission to load TikTok Post.\n      \n    \n          When Tom stepped onstage, he gave Iñárritu a huge hug and soaked in the rousing applause from the celeb-studded crowd before launching into his speech.\n      \n\n          Tom kicked it all off by thanking some of his biggest film inspirations, including Dolly Parton and Debbie Allen. He then pivoted to his love for cinema from an early age, which opened his eyes and imagination to the possibility that life could expand beyond his own little world.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          He also touched upon how cinema takes him around the globe, helping him appreciate and respect our differences from other cultures, while showing our shared humanity and \"how alike we are in so, so many ways.\"\n      \n    \n          Tom went on ... \"And no matter where we come from, in that theater, we laugh together, we feel together, we hope together, and that is the power of this art form. And that is why it matters, that is why it matters to me. So making films is not what I do, it is who I am.”\n      \n    \n          Some of Hollywood's biggest names were there to see the big speech ... Leonardo DiCaprio, Jennifer Lopez, Kristen Stewart, Cynthia Erivo, Sydney Sweeney, Ariana Grande, Dwayne Johnson, Michael B. Jordan, Natalie Portman, Jennifer Lawrence, Austin Butler, and Jacob Elordi.\n      \n    \n          What a night for Hollywood!\n      \n      ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tom Cruise Delivers Emotional Speech at Governors Awards, Watch the Video",
      "image": [
        "https://imagez.tmz.com/image/da/16by9/2025/11/17/daba0b91ce3e44378bbb47cf60c687d3_xl.jpg"
      ],
      "datePublished": "2025-11-17T14:36:32.000Z",
      "dateModified": "2025-11-17T14:36:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]