[
  {
    "title": "NBA Tip-Off Hits 5.6 Million Viewers on NBC, Biggest Audience in More Than 10 Years and Up 87% From Last Year",
    "url": "https://variety.com/2025/tv/news/nba-tip-off-ratings-nbc-record-1236560225/",
    "image": "https://variety.com/wp-content/uploads/2025/10/GettyImages-2242139529.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-23T22:55:04.000Z",
    "description": "\n\tThe Oklahoma City Thunder and the Golden State Warriors weren’t the only winners of this year’s NBA tip-off. Airing its first NBA games since 2002, ",
    "body": "\n\tThe Oklahoma City Thunder and the Golden State Warriors weren’t the only winners of this year’s NBA tip-off. Airing its first NBA games since 2002, NBC and Peacock earned a strong audience of 5.6 million average viewers for its broadcast of both games on Tuesday night.\n\n\tThat number, based on linear measurement from Nielsen and digital data from Adobe Analytics, is not only an 87% improvement from last year’s NBA tip-off, which hit 3 million viewers on TNT, but the biggest audience the doubleheader has seen in more than 10 years. No season opener has reached those heights since 2012 — or 2010 if you exclude 2011’s unusual Christmas Day tip-off. And given that the 2010 games included LeBron James’ debut with the Miami Heat, it’s impressive that NBC’s telecast came so close to that record.\n\t\n\n\tThe 5.6 million total represents the average number of people watching at any given moment of the broadcast. When broken down into shorter segments, Tuesday’s doubleheader peaked at 7.1 million viewers between 10:45 and 11 p.m. ET, during which the Thunder beat the Houston Rockets by one point in double overtime. Averaging 5.9 million viewers overall, the Thunder-Rockets game’s viewership was certainly also boosted by the fact that it was Kevin Durant’s debut as a Houston player and marked a face-off with the team he started his career with. The Warriors-Lakers game averaged 5.1 million viewers overall.\n\n\n\tAdditionally, NBC Sports achieved its largest non-NFL and non-Olympics simulstream audience ever with an average minute audience of 1 million viewers from a combination of Peacock and NBC Sports Digital. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NBA Tip-Off Hits 5.6 Million Viewers on NBC, Biggest Audience in More Than 10 Years and Up 87% From Last Year",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/GettyImages-2242139529.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-23T22:55:04.000Z",
      "dateModified": "2025-10-23T22:55:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Hamnet’ Wins Big at the San Diego Film Festival While Eddie Vedder Doc ‘Matter of Time’ Earns Kudos",
    "url": "https://variety.com/2025/film/news/hamnet-wins-san-diego-international-film-festival-1236560281/",
    "image": "https://variety.com/wp-content/uploads/2025/10/Hamnet-4238_D045_00238_R_rgb-1.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-23T23:39:08.000Z",
    "description": "\n\tChloé Zhao’s “Hamnet” was the big winner at the San Diego International Film Festival, winning both the best Gala Film (jury award) and the Audience",
    "body": "\n\tChloé Zhao’s “Hamnet” was the big winner at the San Diego International Film Festival, winning both the best Gala Film (jury award) and the Audience Choice Gala Award. Eddie Vedder-starring documentary “Matter of Time,” which blends concert performances with an intimate look at the fight to cure a rare childhood disease, earned the Artistic Director’s Award.\n\n\t“Hamnet,” adapted by Maggie O’Farrell’s novel, stars Jessie Buckley and Paul Mescal as Agnes and William Shakespeare in a drama that captures the grief and enduring love that inspired one of literature’s greatest works.\n\t\n\n\tOther winners at the fest, which ran from Oct. 15-19, includes:\n\n\n\tBest Feature: “Aontas,” Ireland\n\n\tArtistic Director’s Award: “Matter of Time”\n\n\tBest Documentary: “Standout: The Ben Kjar Story”\n\n\tBest International Feature: “Hello Mother,” Mongolia\n\n\tBest Ensemble: “Fantasy Life”\n\n\tBest Comedy: “For Worse”\n\n\tBest Women Film Series: “The Fisherman,” Ghana\n\n\tBest Shorts Track: “Charmingly Short”\n\n\tBest Short Documentary: “The Opening Address”\n\n\tBest Short Narrative: “Sally, Get the Potatoes”\n\n\tBest International Short Film: “Kong Kong”\n\n\tBest Animation: “Forevergreen”\n\n\tBest Student Film: “Echoes of the Wild”Audience Choice Feature: “Obraz,” Montenegro. Film is also repping Montenegro in the international feature film Oscar race.\n\n\tAudience Choice Documentary: “Standout: Ben Kjar” and “A Quiet Love”\n\n\tAudience Choice Short: “Rise”\n\n\t“We’re so proud to honor such a diverse and exciting group of filmmakers,” said Tonya Mantooth, CEO & artistic director, San Diego International Film Festival, in a statement. “From powerhouse performances to emerging new voices, this year’s lineup reminded us of the power of cinema to move and unite us.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Hamnet’ Wins Big at the San Diego Film Festival While Eddie Vedder Doc ‘Matter of Time’ Earns Kudos",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/Hamnet-4238_D045_00238_R_rgb-1.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-23T23:39:08.000Z",
      "dateModified": "2025-10-23T23:39:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Frankie Muniz Shares ‘Malcom in the Middle’ Revival Photo Reuniting With ‘Brothers’ Justin Berfield, Christopher Masterson: ‘I’m Just Too Excited’",
    "url": "https://variety.com/2025/tv/news/frankie-muniz-malcolm-in-the-middle-revival-photo-brothers-1236560152/",
    "image": "https://variety.com/wp-content/uploads/2025/10/Frankie-Munez-Malcolm-In-the-Middle-Reunion.jpg?crop=0px%2C401px%2C1212px%2C682px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-10-23T22:18:35.000Z",
    "description": "\n\tFrankie Muniz shared a photo from the set of the upcoming “Malcolm in the Middle” revival that shows him reuniting with his co-stars Justin Berfield",
    "body": "\n\tFrankie Muniz shared a photo from the set of the upcoming “Malcolm in the Middle” revival that shows him reuniting with his co-stars Justin Berfield and Christopher Masterson.\n\n\t“I was told not to post this yet, but then I remembered the theme song. I’m just too excited for y’all to see the new episodes and I miss my brothers,” Muniz wrote on X. (The original “Malcolm in the Middle” theme song, performed by They Might be Giants, repeats the lyric “You’re not the boss of me now” multiple times.)\n\t\n\n\tTitled “Malcolm in the Middle: Life’s Still Unfair” as a reference to the theme song’s opening lyric, the four-episode revival is set to debut on Disney+ in 2026. Muniz returns in the title role, the third of five sons in a dysfunctional suburban family, alongside Berfield and Masterson as his older brothers Francis and Reese, respectively. \n\n\n\tOther returning cast members include Bryan Cranston as Malcolm’s father, Hal; Jane Kaczmarek as his mother, Lois; Craig Lamar Traylor as his best friend, Stevie Kenarban; Gary Anthony Williams as Stevie’s father, Abe Kenarban; Emy Coligado as Francis’ wife, Piama; and David Anthony Higgins as Craig Feldspar, Lois’ coworker.\n\n\tMalcolm’s younger brother Dewey was previously played by Erik Per Sullivan but will be played by Caleb Ellsworth-Clark in the revival. Jamie, who was the youngest brother in the original series, will be played by Anthony Timpano; the character was only three years old by the end of the original series, in which he was played by James and Lukas Rodriguez. The revival also introduces a new youngest sibling, Kelly (Vaughan Murrae), who is nonbinary. Other new characters joining the mix are Malcolm’s girlfriend, Tristan (Kiana Madeira) and his daughter, Leah (Keeley Karsten).\n\t\n\n\tSee Muniz’s post below.\n\nI was told not to post this yet, but then I remembered the theme song. I'm just too excited for y'all to see the new episodes and I miss my brothers. pic.twitter.com/LT2aXgsAOK— Frankie Muniz (@frankiemuniz) October 23, 2025\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Frankie Muniz Shares ‘Malcom in the Middle’ Revival Photo Reuniting With ‘Brothers’ Justin Berfield, Christopher Masterson: ‘I’m Just Too Excited’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/Frankie-Munez-Malcolm-In-the-Middle-Reunion.jpg?crop=0px%2C401px%2C1212px%2C682px&resize=1000%2C563"
      ],
      "datePublished": "2025-10-23T22:18:35.000Z",
      "dateModified": "2025-10-23T22:18:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "In ‘I See the Demon,’ a Sci-Fi Dinner From Hell Proves You Never Really Know Your Friends and Lovers — FilmQuest",
    "url": "https://variety.com/2025/film/features/i-see-the-demon-sci-fi-filmquest-1236559811/",
    "image": "https://variety.com/wp-content/uploads/2025/10/iseethedemon.jpg?crop=0px%2C0px%2C1008px%2C566px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-10-23T22:18:33.000Z",
    "description": "\n\tSure, aliens are creepy, but is anything scarier than uncomfortable encounters with your friends and loved ones? This idea inspired Jacob Lees Johns",
    "body": "\n\tSure, aliens are creepy, but is anything scarier than uncomfortable encounters with your friends and loved ones? This idea inspired Jacob Lees Johnson to write, alongside Davey Morrison and Martha Duzett, the film “I See the Demon,” which he also directed.\n\n\t“I was thinking about the blind spots that we have in our relationships with friends, with loved ones, with spouses,” he says. “We sometimes think that we know exactly who a person is, especially if we’ve known them for a really long time. But I saw some experiences around me of where that was definitely not the case. And it’s unsettling to think, ‘Oh, I actually didn’t know this person,’ or ‘This person thought they knew me, but they really don’t.'”\n\t\n\n\tWithout spoiling the film’s twists and turns, “Demon” is the story of Lucy (Alexis Zollicoffer), who views a celestial event before entering her surprise birthday party, and begins to have an increasingly hallucinatory time. The indie sci-fi horror film debuted at the Cinequest Film Festival in March, and has been met with warm reviews from audiences at festivals like Grimmfest and Atlanta Horror Fest. On Oct. 23, “Demon” is set to kick off this year’s FilmQuest in Provo, Utah, which always selects a film made in the state as its opening-night premiere.\n\n\n\tZollicoffer says in order to get into the uniquely-shot scenes with her friend group, she had to seek answers and go with the flow of shooting the indie.\n\n\t“I prayed a lot about ‘What is she experiencing?’ and ‘Why does she feel this way?'” Zollicoffer says. “How can I be as authentic as possible and really try to listen and receive everything that everyone is doing? It was wonderful because we did improv, and it was a little bit messy, so it made it easier to not just be waiting around for lines, but to always be active.”\n\t\n\n\tDave Martinez, who plays the mysterious partygoer Billy, agrees that the film really thrives due to the intimate chemistry of the cast.\n\n\t“There was a lot of sitting and listening on my end, and watching all of these people come together and chat in between takes,” Martinez says. “We were creating something that had the potential to have that sort of feel and chumminess that felt really natural. The personalities just worked. I think certain things film is able to do, but I think there’s something that really is electric about having a group of friends.”\n\n\tMartinez notes that the mind-bending plot has given audiences a cinematic experience to truly ponder.\n\n\t“It’s great to have people resonate and simultaneously go, ‘I’m perplexed and I feel emotional,'” he says. “It feels wonderful to have that sort of recognition and to see this beautiful independent film start to get its legs. I hope it runs further because I think it has a broader appeal — not only because of the art that Jacob and the team brought, but I think the communicative spirit it possesses by questioning relationships, and also the heartache and new discoveries, and being absolutely terrified along the way.”\n\n\tThe shifting perceptions and twisty script created a formidable acting experience for Zollicoffer, who is nominated for Best Actress at FilmQuest.\n\n\t“I did a lot of work ahead of time because I don’t like to waste time figuring things out on the day,” she says. ”I want to already come in knowing, so that if there are more realizations to make, we’re already starting at level ten, not level one.”\n\n\tJohnson, who lives in Utah, is excited to debut his vision in his home state, where he enjoys the community of artists.\n\n\t“I love shooting here,” he says. “We have really talented people, really talented actors and crew. There’s a reason why they shot all those Westerns back in the day out here. The landscapes you can get here are second to none. The vibe is everybody works hard and everybody’s really talented, but it doesn’t make you feel like someone’s going to stab you in the back.”\n\n\tWatch the “I See the Demon” trailer below.\n\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "In ‘I See the Demon,’ a Sci-Fi Dinner From Hell Proves You Never Really Know Your Friends and Lovers — FilmQuest",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/iseethedemon.jpg?crop=0px%2C0px%2C1008px%2C566px&resize=1000%2C563"
      ],
      "datePublished": "2025-10-23T22:18:33.000Z",
      "dateModified": "2025-10-23T22:18:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bruce Springsteen Is Already Talking About a ‘Deliver Me From Nowhere’ Sequel, Says Director Scott Cooper",
    "url": "https://variety.com/2025/scene/columns/bruce-springsteen-deliver-me-from-nowhere-sequel-1236560126/",
    "image": "https://variety.com/wp-content/uploads/2025/10/GettyImages-2237962557.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-23T22:15:00.000Z",
    "description": "\n\tBruce Springsteen may be ready to tell more of his story.\n\n\tScott Cooper, the writer-director of “Springsteen: Deliver Me From Nowhere,” tells me th",
    "body": "\n\tBruce Springsteen may be ready to tell more of his story.\n\n\tScott Cooper, the writer-director of “Springsteen: Deliver Me From Nowhere,” tells me that the Boss is already talking about a sequel.\n\n\t“I suppose if you can make four Beatles movies, you can make a couple of Bruce Springsteen movies,” Cooper said Wednesday at the AFI Fest opening night premiere of “Deliver Me From Nowhere.”\n\n\n\tThe four upcoming Beatles movies he’s referring to are Sam Mendes’ separate films about John Lennon (Harris Dickinson), Paul McCartney (Paul Mescal), Ringo Starr (Barry Keoghan) and George Harrison (Joseph Quinn). They are set for a theatrical release in 2028.\n\t\n\n\t“Deliver Me From Nowhere” dramatizes Springsteen’s album recording for his 1982 release “Nebraska,” as he battled depression and the haunting memories of his traumatic childhood. Jeremy Allen White stars as the singer-songwriter with Odessa Young as his girlfriend and Jeremy Strong portraying his manager Jon Landau.\n\n\t“There’s so many chapters in Bruce’s life, in all seriousness, that are quite right for cinematic treatment,” Cooper said, adding, “That’s something quite honestly that Bruce and I have discussed. I think he really loves this film. He’s loved the experience.\n\n\t“I think he feels incredibly comfortable with, someone telling a very painful chapter in his life. You’d have to ask him, but I think he’s ready for more.”\n\n\tIs Cooper already thinking of who to cast as Courteney Cox if the next movie includes Springsteen’s Brian De Palma-directed “Dancing in the Dark” music video?\n\t\n\n\t“Oh, my God. That’s a great question,” Cooper said. “I don’t know if Courteney Cox has children, but maybe if she does.” (For the record, Cox has a daughter Coco, 21, with ex-husband David Arquette.)\n\n\tI also spoke to Strong on the carpet, who weighed in on Oscar buzz for his performance. “It’s not something I’m used to,” said Strong, who earned an Academy Award nom last year for his work as disgraced attorney and Donald Trump mentor Roy Cohn in “The Apprentice.” \n\n\t“Listen, of course it’s something that is incredibly meaningful when our community acknowledges or recognizes a piece of work, but a thing I take away from Bruce is you gotta give 10,000 percent to whatever you’re doing,” Strong continued. “He plays every show like it’s his last show at Madison Square Garden and I wanna do every role like it’s the last thing I’ll ever get to do and give it everything I got. At the end of the day, that’s why I do this.”\n\n\tThe premiere at AFI Fest also included a surprise two-song performance by Springsteen at the end of the screening.\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bruce Springsteen Is Already Talking About a ‘Deliver Me From Nowhere’ Sequel, Says Director Scott Cooper",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/GettyImages-2237962557.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-23T22:15:00.000Z",
      "dateModified": "2025-10-23T22:15:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Chainsaw Man – The Movie: Reze Arc’ Review: Gory Anime Packs Whirlwind Action, but Little More for the Uninitiated",
    "url": "https://variety.com/2025/film/reviews/chainsaw-man-the-movie-reze-arc-review-1236560195/",
    "image": "https://variety.com/wp-content/uploads/2025/10/Chainsaw-Man-The-Movie-Reze-Arc-1.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-23T22:25:17.000Z",
    "description": "\n\tThere’s a motorized blade on his face and adolescent hormones coursing through his body, as he fights villainous entities bent on causing humans har",
    "body": "\n\tThere’s a motorized blade on his face and adolescent hormones coursing through his body, as he fights villainous entities bent on causing humans harm. Sixteen-year-old Denji (voiced by Kikunosuke Toya) has never attended school, but instead works as a Public Safety Devil Hunter (he is part demon, part human). Alongside the protagonists of “KPop Demon Hunters” and “Demon Slayer: Kimetsu no Yaiba Infinity Castle,” he joins the chorus of animated paladins facing off diabolical adversaries on the big screen this year.\n\t\n\n\tBut before “Chainsaw Man – The Movie: Reze Arc” ever shows him in his monstrous form, Denji’s teenage insecurities and romantic woes come to the foreground. From director Tatsuya Yoshihara, the first film spawned from the popular series, which is in turn based on the manga by Tatsuki Fujimoto, drops us into an already established universe — as movies based on anime shows tend to do. \n\n\n\tContext clues might help those with minimal knowledge of “Chainsaw Man” gather that in this reality, demons with superhuman powers are a constant threat. Otherwise, it’s all mostly recognizable as identical to our world. Designed to satisfy existing fans, not so much to gain new acolytes, “Chainsaw Man” can still entertain because at its barest, the concept and plot don’t seem too intricate.\n\n\tAn awkward boy, Denji nervously agrees to go on a date with his boss, Makima (Tomori Kusunoki). Their rendezvous feels like an homage to cinema, as they spend an entire day hopping from one movie theater to another. She has strong opinions on the quality of the films, he’s concerned that nothing seems to move him. It’s only when watching an art-house film late at night that they both fully bask in the power of the medium. Up to this point, even if one has little information about these characters and their bond, “Chainsaw Man” plays like a teenage dramedy, and it remains that way for a third of its running time.\n\t\n\n\tThat Makima disappears for most of the remaining drama and chaos reiterates the film’s episodic quality. Likely, she’ll simply return in the next chapter on TV, thus her absence is not a cause for alarm. A central love triangle emerges, at least in Denji’s eager mind, when he meets Reze, a server at a local café. Her overt interest in him is enough for him to reciprocate. But she might not be who she says she is. Evocative animation, with subdued blue hues and soft lighting, conveys the flirtatiousness of their rapid connection in a scene where the two swim together in a pool at night. It’s also here that a few glimpses into Denji’s mind show sexually suggestive images of both Makima and Reze, as he struggles to decide whom to be faithful to, making it clear that a mature audience is the target.\n\n\tWhen Reze is revealed as the extremely violent Bomb Devil, a hurt Denji realizes that she doesn’t want to gain his heart, but quite literally carve it out of his chest. The necklace she wears is the safety pin she can pull to detonate herself, just as Denji pulls the starter cord on his chest to become Chainsaw Man, both are clever character design details. “Chainsaw Man” sporadically checks in on a separate storyline with Aki (Shôgo Sakata), Denji’s coworker, and a halo-sporting Angel Devil (Maaya Uchida), offering even fewer details about the pair’s relevance, other than a shocking undercurrent of nihilism. As Reze’s violence escalates, all the “good guys” come together in a unified front against the malevolent Reze.\n\n\tThe corpses of deceased civilians litter the streets as blood pools — beheadings, dismemberments and bodies exploded into liquid flesh — while buildings and other structures collapse. This is a war zone. Fundraisers for the victims of devil attacks, apparently a common occurrence in this reality, acknowledge the death toll that these supernatural clashes leave behind. That’s more than one can say for the “Avengers” movies, where the destruction that results from the many confrontations is not dealt with.\n\n\tA whirling semi-final showdown unfolds inside a sentient devil typhon and gives way to even more frantic editing as Denji in Chainsaw Man form rides his unwanted sidekick, an anthropomorphic shark, to defeat Reze. The action here moves at lightning speed with fiery explosions and relentless chaos taking over the screen via an impressive amalgamation of fluid character animation and high-octane effects. The second half of this epic scrimmage between good and evil feels like an unending sequence of increasingly deadly battles.\n\t\n\n\t“Chainsaw Man” eventually lands on a more emotional resolution, proposing that the attraction between Denji and Reze was perhaps mutual (could a devil fall in love?), only to turn around and end on a gruesome note that delivers swift and brutal justice. For someone steeped in the characters and lore, watching anime films like this must yield the satisfaction of seeing familiar screen friends in a bigger adventure and canvas. For the uninitiated, however, it’s like catching up with a train that left the station a while ago, and that one may not be all that interested in boarding anyway.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Chainsaw Man – The Movie: Reze Arc’ Review: Gory Anime Packs Whirlwind Action, but Little More for the Uninitiated",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/Chainsaw-Man-The-Movie-Reze-Arc-1.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-23T22:25:17.000Z",
      "dateModified": "2025-10-23T22:25:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Headgum Lays Off 30% of Staff in Latest Sign of Podcast Struggles",
    "url": "https://variety.com/2025/biz/news/headgum-layoffs-podcast-struggles-1236560100/",
    "image": "https://variety.com/wp-content/uploads/2025/10/Screenshot-2025-10-23-at-4.20.35-PM.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-23T21:59:15.000Z",
    "description": "\n\tHeadgum, the comedy podcast network, laid off about 30% of its staff earlier this month amid continued headwinds in the podcast industry.\n\n\tCasey Do",
    "body": "\n\tHeadgum, the comedy podcast network, laid off about 30% of its staff earlier this month amid continued headwinds in the podcast industry.\n\n\tCasey Donahue, the head of video, was among those affected.\n\n\t“It was tough, but a reminder of how volatile the industry has become,” he said. “My focus has always been on building shows and visuals that elevate the talent and the brand, and I am proud of what I was able to accomplish with my team at Headgum.”\n\t\n\n\tMarika Brownlee, the head of marketing, was also let go after nearly a decade at the L.A.-based company. It was only the second round of layoffs during her tenure, following another round in 2022.\n\n\n\t“It was definitely a shock,” she said. “It was communicated in the grand scheme of — ‘These problems are happening industrywide’ — which I know is true.”\n\n\tHeadgum had about 22 staffers before the layoffs, which were announced on Oct. 2. The company also recently vacated its New York studio. Some were told that if the cuts were not made immediately, the company would last only a few more months. \n\n\tThe company did not respond to a request for comment. \n\n\tThe podcast business has been hit hard this year. In June, Pineapple Street Studios was shut down by its owner, Audacy, costing nearly 30 jobs. Spotify also cut 15 jobs in its podcast division, curtailing the headcount at The Ringer and Spotify Studios by about 5%. Wondery laid off nearly 100 employees as Amazon reorganized the company in August. \n\n\tHeadgum, which has remained independent, appeared to have weathered the storm to some degree. In August, the company celebrated its 10th anniversary as leaders spoke about growth.\n\t\n\n\t“We’ve built shows streamed billions of times,” CEO Marty Michael wrote on LinkedIn in August. “We’ve grown a team I love working with. But we’ve also hit major speed bumps; talent departures, ad market freezes, all the stuff they don’t include in pitch decks. Somehow, ten years later, we’re still here. Still growing. Still having fun. But now, with a real business underneath it.”\n\n\tThe “restructuring” was discussed Thursday on the “Doughboys” podcast, a Headgum food show hosted by Mike Mitchell and Nick Wiger.\n\n\t“Really they just fired a bunch of people,” Wiger said. “We don’t have any sort of comprehension of what happened. We’re just living in the aftermath. But it’s a huge fucking bummer. These are very talented people who no longer have jobs.”\n\n\tThe network hosts dozens of other shows, including “What’s Our Podcast?” with Beck Bennett and Kyle Mooney; “Not Another D&D Podcast”; “Factually! with Adam Conover”; and “Handsome” with Tig Notaro, Fortune Feimster and Mae Martin.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Headgum Lays Off 30% of Staff in Latest Sign of Podcast Struggles",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/Screenshot-2025-10-23-at-4.20.35-PM.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-23T21:59:15.000Z",
      "dateModified": "2025-10-23T21:59:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "WGA Says Warner Bros. Merger Would Be a ‘Disaster’ for Writers",
    "url": "https://variety.com/2025/film/news/wga-warner-bros-merger-would-be-disaster-1236560277/",
    "image": "https://variety.com/wp-content/uploads/2023/09/BUC_2307.jpg?crop=605px%2C1161px%2C7651px%2C4305px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-10-24T00:15:18.000Z",
    "description": "\n\tThe Writers Guild of America came out swinging on Thursday against a merger between Warner Bros. and any other studio, saying such consolidation wou",
    "body": "\n\tThe Writers Guild of America came out swinging on Thursday against a merger between Warner Bros. and any other studio, saying such consolidation would be a “disaster” for writers.\n\n\tThe statement comes two days after Warner Bros. said it is considering “multiple offers.” Paramount, freshly acquired by David Ellison’s Skydance, is the most eager suitor. Any deal involving another content producer would shrink the number of buyers in the marketplace.\n\t\n\n\t“Merger after merger in the media industry has harmed workers, diminished competition and free speech, and wasted hundreds of billions of dollars better invested in organic growth,” the WGA East and West said in a statement Thursday. “Combining Warner Bros. with Paramount or another major studio or streamer would be a disaster for writers, for consumers, and for competition. The WGAW and WGAE will work with regulators to block the merger.”\n\n\n\tThe WGA has a long track record of opposition to industry mergers. It opposed the failed Dish-DirecTV merger in 2002.\n\n\tIn 2011, the union sought to block the merger of Comcast and NBCUniversal, warning that the media landscape was already too consolidated. The union also warned that Comcast might use its control of cable distribution to favor its own content.\n\n\tThe WGA also raised “net neutrality” concerns in expressing its opposition to the AT&T merger with Time Warner, which was announced in 2016. \n\n\t“At a time when the country demands, and needs, the broadest possible set of views and stories and voices, we have handed over the keys to the media kingdom to giants whose sole motivation is to maximize their short-term investment return, not to inform or enlighten or entertain,” the WGA East said when the merger was approved in 2018.\n\t\n\n\tThe union also opposed the Disney-Fox merger in 2017 and the Amazon-MGM merger in 2021. It blasted the merger of Warner Bros. and Discovery in 2022, which undid the AT&T merger from a few years earlier, calling it a “clear disaster for the content creators who have lost jobs and a potential employer, as well as for the consumers who are faced with a poorer, less-diverse content landscape.”\n\n\tThe union has also called for more robust antitrust enforcement. In 2023, the union warned that Disney, Netflix and Amazon were poised to become the “new gatekeepers” of the industry.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "WGA Says Warner Bros. Merger Would Be a ‘Disaster’ for Writers",
      "image": [
        "https://variety.com/wp-content/uploads/2023/09/BUC_2307.jpg?crop=605px%2C1161px%2C7651px%2C4305px&resize=1000%2C563"
      ],
      "datePublished": "2025-10-24T00:15:18.000Z",
      "dateModified": "2025-10-24T00:15:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Sinners’ Cinematographer Autumn Durald Arkapaw on Shooting Jack O’Connell’s Grand Entrance During Magic Hour and Filming on Ultra Panavision 70mm Film",
    "url": "https://variety.com/2025/artisans/news/sinners-cinematographer-jack-oconnell-entrance-imax-1236558441/",
    "image": "https://variety.com/wp-content/uploads/2025/10/MCDSINN_WB032-1.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-23T22:56:48.000Z",
    "description": "\n\tRyan Coogler sent his go-to cinematographer Autumn Durald Arkapaw the script for “Sinners” the night before she started shooting Gia Coppola’s “The ",
    "body": "\n\tRyan Coogler sent his go-to cinematographer Autumn Durald Arkapaw the script for “Sinners” the night before she started shooting Gia Coppola’s “The Last Showgirl.”\n\n\t“I read it and I was just blown away, because if you don’t know anything about the storyline and you read something like that, that’s so unique,” Arkapaw says. She responded to Coogler’s script by sending him a long email. “I just unloaded all my thoughts about how it made me feel, the visual stuff that popped out, and what I liked about it.”\n\t\n\n\tSet in the Mississippi Delta during the Jim Crow era, “Sinners” stars Michael B. Jordan as identical twins Smoke and Stack, who return to town after encountering the Chicago mob. The twins rally the local community to help build a juke joint. However, when the sun sets, vampires show up and wreak havoc on the town and the juke’s opening night.\n\n\tArkapaw made history when she became the first cinematographer to shoot 65mm film in IMAX. \n\n\tBut that decision came during the testing process. Coogler had previously used the Super 16 format when filming “Fruitvale Station,” a format he had wanted to return to. Sitting down for Variety’s Inside the Frame, Arkapaw says, “It started to progress as we had more conversations with the visual effects supervisor. Because of the twinning aspect in the film, the 35mm format had a more stable gate and was more friendly for the kind of work we had to do. So, we transitioned to thinking about the movie in 35mm. And then Ryan got a call from the studio asking if we had talked about large format, and that caused him to just open his mind up.”\n\t\n\n\tThe two went out to the desert near Lancaster, Calif., and tested IMAX 35mm and 65mm, with Coogler showing a keen interest in showcasing the landscape — an idea inspired by Quentin Tarantino‘s “The Hateful Eight,” which was shot on 65mm film using Ultra Panavision 70mm. “We screened those tests at FotoKem and the headquarters of IMAX. After you see what you created, you can’t unsee that stuff.”\n\n\tOne of the vampires, Remmick, is played by Jack O’Connell. In the film, he appears almost midway through, dropping into the frame with a farmhouse in the distance as birds circle overhead. Arkapaw says it was one of her favorite scenes, revealing that Coogler’s script actually opened with the sequence. “I remember when I read it, I was blown away, because I’m like, ‘Where did he come up with this stuff?’ He’s very good at just writing things that jump off the page and get people excited. And that comes from his love of cinema and being in the theater. You’re watching ‘Jaws’ or ‘The Dark Knight,’ and you have these scenes that just wrap their arms around you, and you feel like you’re a part of the scene. And that was how he wrote that scene.”\n\n\tArkapaw says that Coogler discussed the scene with editor, Michael Shawver and ended up putting it further down in the timeline. “It was one of my favorite scenes, and it read like a Western. I was very excited to shoot it, and I could see it in my head the moment I read it. It’s about Remmick’s entrance into the film, trying to approach this desolate farmhouse where he meets these two farmers. He is trying to get into the house and take cover because he’s claiming to be chased by some Choctaw Indians.”\n\n\tThe key to the scene was getting that entrance right. Coogler wanted it to be grand. Arkapaw says, “It was important for Ryan that you give a hint at the fact that he can fly. Jack jumped off the box, and we did it a few times to get it right because Ryan wanted it to look a certain way. You’re close to the camera, and it just hints at the fact that maybe he’s flying, that he has supernatural powers. Later, obviously, in the scene, you see that he’s a vampire because you meet him again in the back room in the nursery.”\n\n\tAnother aspect of the scene was setting it against magic hour when the sun is setting. It was important to see the sun break the horizon and understand what that meant for the storytelling. Arkapaw had two days to shoot the sequence. She says, “We shot it for one day, and then we went back to complete some work, which allowed us more time to get it in camera.”\n\t\n\n\tIt wasn’t all smooth sailing. The shots with the Choctaw watching the sun drop were all in camera. “The IMAX camera jammed right before we were about to shoot that one shot of him looking at the sun on the horse. You see over his shoulder the sun dropping. But we were able to fix the jam, and we literally rolled right before it set.”\n\n\tAs for her historic shoot, Arkapaw says she wanted the format to sing, and this was a prime example where it did just that. “We had cameras on cranes, and there are a lot of moving shots like an old Western, being able to track with the horses. It’s a beautiful scene.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Sinners’ Cinematographer Autumn Durald Arkapaw on Shooting Jack O’Connell’s Grand Entrance During Magic Hour and Filming on Ultra Panavision 70mm Film",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/MCDSINN_WB032-1.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-23T22:56:48.000Z",
      "dateModified": "2025-10-23T22:56:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Star Wars’ Fans Fly Plane Over Disney Studios With ‘Save The Hunt for Ben Solo’ Banner After Adam Driver Reveals Rejected Kylo Ren Movie",
    "url": "https://variety.com/2025/film/news/star-wars-fans-disney-save-adam-driver-kylo-ren-movie-1236560068/",
    "image": "https://variety.com/wp-content/uploads/2025/10/adam.driver.png?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-23T21:25:36.000Z",
    "description": "\n\t“Star Wars” fans are not happy with Disney after Adam Driver revealed studio executives Bob Iger and Alan Bergman rejected a screenplay for a standa",
    "body": "\n\t“Star Wars” fans are not happy with Disney after Adam Driver revealed studio executives Bob Iger and Alan Bergman rejected a screenplay for a standalone movie centered on Kylo Ren/Ben Solo, the character Driver played to much adoration from critics and fans in “Star Wars: The Force Awakens,” “The Last Jedi” and “The Rise of Skywalker.” The script was titled “The Hunt for Ben Solo.”\n\n\tAs reported by Collider, a group of “Star Wars” fans paid for a plane to fly a banner reading “Save The Hunt for Ben Solo” over Walt Disney Studios in Burbank, California. A reporter for the website was on location for the viral stunt and took photos of the banner flying overhead.\n\t\n\n\tDriver revealed to the Associated Press in an interview published Oct. 20 that he spent two years developing a standalone “Star Wars” movie centered on Ben Solo alongside director Steven Soderbergh. The film would have taken place after the events of “The Rise of Skywalker.” According to Driver, Soderbergh worked on the script with his “Logan Lucky” scribe Rebecca Blunt and longtime collaborator Scott Z. Burns (“Contagion,” “The Informant!”). Driver starred in Soderbergh’s “Logan Lucky” and Burns’ “The Report.” \n\n\t“I always was interested in doing another ‘Star Wars,’” Driver told the AP. “I had been talking about doing another one since 2021. Kathleen [Kennedy] had reached out. I always said: ‘With a great director and a great story, I’d be there in a second.’ I loved that character and loved playing him.”\n\n\tDriver loved “The Hunt for Ben Solo” script, calling it the “standard” of what a “Star Wars” movie “should be” and comparing it to the “handmade and character-driven” feel of “The Empire Strikes Back.” The Oscar nominee said Lucasfilm execs Kathleen Kennedy, Dave Filoni and Cary Beck backed the project until Disney shut it down.\n\t\n\n\t“We presented the script to Lucasfilm. They loved the idea,” Driver recalled. “They totally understood our angle and why we were doing it. We took it to Bob Iger and Alan Bergman, and they said no. They didn’t see how Ben Solo was alive. And that was that.”\n\n\tDriver’s interview sent “Star Wars” fans into a tizzy, not only because Ben Solo is a fan favorite character but also because the “Star Wars” movie franchise has floundered over the years since “The Rise of Skywalker” with many features stalled, delayed or scrapped. \n\n\t“I really enjoyed making the movie in my head. I’m just sorry the fans won’t get to see it,” Soderbergh told the AP about “The Hunt for Ben Solo,” with Driver adding that it was “one of the coolest scripts I had ever been a part of.”\n\n\tThe “Star Wars” franchise finally returns to the big screen next year with the release of “The Mandalorian and Grogu,” a big screen continuation of the popular Disney+ series “The Mandalorian” that hits theaters May 22. Another “Star Wars” movie, the Shawn Levy-directed “Starfighter” with Ryan Gosling, is now in production and aiming for a May 28, 2027 release date.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Star Wars’ Fans Fly Plane Over Disney Studios With ‘Save The Hunt for Ben Solo’ Banner After Adam Driver Reveals Rejected Kylo Ren Movie",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/adam.driver.png?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-23T21:25:36.000Z",
      "dateModified": "2025-10-23T21:25:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Stars Who Rock Crocs ... Happy Croc-Tober!",
    "url": "https://www.tmz.com/2025/10/23/stars-who-rock-crocs-happy-croc-tober/",
    "image": "https://imagez.tmz.com/image/a1/16by9/2024/10/18/a184cf928a424204baed943c15b9aeee_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-23T18:30:46.000Z",
    "description": "\n    \n                    \n                          Stars Who\n                          Rock Crocs ...\n                          Happy Croc-Tober!\n  ",
    "body": "\n    \n                    \n                          Stars Who\n                          Rock Crocs ...\n                          Happy Croc-Tober!\n                      \n                  \n                        Published October 23, 2025 11:30 AM PDT\n                                                                      |\n                Updated October 23, 2025 3:06 PM PDT\n                                    \n      \n    \n          October 23rd marks a very important holiday: It's National Croc Day! Celebs love a good fashion moment -- and here they are: accessorizing their famous feet with some hot crocs ... Talk about makin' a statement!\n      \n    \n          Hot among the singers, stars like Nicki Minaj and K-Pop group Aespa are here for the cool kicks, and DJ Diplo topped off his pair of red and blue cozy Crocs with a shirtless selfie.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Paris Hilton and Maluma's Crocs will brighten your day -- both stars taking a high-top approach and 'sliving' in their pricey yellow MSCHF Crocs.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          And Teyana Taylor elevated the footwear game, sporting a pair of black platform Crocs!\n      \n    \n          Slide into our gallery and see all the stars who rock a good croc! ... Happy Croc-tober!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Nicki Minaj\n              \n                          \n                Paris Hilton\n              \n                          \n                Fashion\n              \n                          \n                Holidaze\n              \n                          \n                Photo Galleries\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Stars Who Rock Crocs ... Happy Croc-Tober!",
      "image": [
        "https://imagez.tmz.com/image/a1/16by9/2024/10/18/a184cf928a424204baed943c15b9aeee_xl.jpg"
      ],
      "datePublished": "2025-10-23T18:30:46.000Z",
      "dateModified": "2025-10-23T18:30:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'Outer Banks' Director Continues Production Duties After Grabbing P.A.",
    "url": "https://www.tmz.com/2025/10/23/outer-banks-jonas-pate-allegations-production-resumes/",
    "image": "https://imagez.tmz.com/image/38/16by9/2025/10/23/38a35f93c40d45478697c9b3d7ee90bc_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-23T22:23:20.000Z",
    "description": "\n    \n                    \n                          'Outer Banks' Jonas Pate\n                          Business as Usual After Yelling, Shaking Incid",
    "body": "\n    \n                    \n                          'Outer Banks' Jonas Pate\n                          Business as Usual After Yelling, Shaking Incident?!?\n                      \n                  \n                        Published October 23, 2025 3:23 PM PDT\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          \"Outer Banks\" co-creator and director Jonas Pate is still working on the popular Netflix series ... one day after the news dropped he put his hands on a production assistant and shook her while shouting in her face ... TMZ has learned.\n      \n    \n          Multiple sources with direct knowledge tell TMZ ... Jonas was present on the set Thursday in Dubrovnik, Croatia, for the filming of the fifth and final season of the show. We're told Netflix never hit pause on the show's production.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Our sources say Jonas remains fully involved in the series currently ... although we're told his demeanor has quieted and the incident between him and the P.A. has not been addressed to the staff or crew.\n      \n\n                  \n          \n                          \n                \n                  \n      \n    \n          TMZ broke the story ... tensions erupted on set when Jonas grabbed the unnamed female production assistant and screamed in her face, forcing the show's leading stars Chase Stokes and Madelyn Cline to jump in and de-escalate the situation.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          We're told people on set are pissed that Netflix has yet to take any known action on the alleged incident that occurred earlier this week ... and it appears production is maintaining status quo.\n      \n    \n          As we reported ... multiple production sources said the incident was not \"unusual behavior\" for Jonas ... with one source telling us, \"It's about time that it's made public.\n      \n    \n          We've reached out to Pate and Netflix multiple times for comment ... so far, no word back.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Chase Stokes\n              \n                          \n                Madelyn Cline\n              \n                          \n                Celebrity News\n              \n                          \n                TV\n              \n                          \n                TV Business\n              \n                          \n                Exclusive\n              \n                          \n                Fairly Legal\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Outer Banks' Director Continues Production Duties After Grabbing P.A.",
      "image": [
        "https://imagez.tmz.com/image/38/16by9/2025/10/23/38a35f93c40d45478697c9b3d7ee90bc_xl.jpg"
      ],
      "datePublished": "2025-10-23T22:23:20.000Z",
      "dateModified": "2025-10-23T22:23:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Paige VanZant Models Sexy Halloween Costume Options for Her Followers",
    "url": "https://www.tmz.com/2025/10/23/paige-vanzant-sexy-halloween-costume/",
    "image": "https://imagez.tmz.com/image/40/16by9/2025/10/23/40e21279956649bc8461309811ab8baa_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-23T19:29:34.000Z",
    "description": "\n    \n                    \n                          Paige VanZant ...\n                          'Help Me Choose\n                          My Hallowee",
    "body": "\n    \n                    \n                          Paige VanZant ...\n                          'Help Me Choose\n                          My Halloween Costume!'\n                      \n                  \n                        Published October 23, 2025 12:29 PM PDT\n                                                                            \n      \n    \n          American mixed martial artist Paige VanZant is leaning on her millions ... she optioned three sexy Halloween costumes, and we're taking it one step further and asking for YOUR input ...\n      \n    \n          Check it -- the 31-year-old flexed on the 'gram with the caption, \"Help me pick a Halloween costume….. comment: 1, 2, Or 3 💀👻\"\n      \n    \n          Now it's on you ... Which is your fave look?!\n      \n    \n          VOTE NOW!\n      \n    \n          Help Paige pick her 2025 costume by hitting up the gallery and casting your vote!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Paige VanZant\n              \n                          \n                Hotties & Bodies\n              \n                          \n                Hot Bodies\n              \n                          \n                TMZ Sports\n              \n                          \n                Photo Galleries\n              \n                          \n                Halloween\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Paige VanZant Models Sexy Halloween Costume Options for Her Followers",
      "image": [
        "https://imagez.tmz.com/image/40/16by9/2025/10/23/40e21279956649bc8461309811ab8baa_xl.jpg"
      ],
      "datePublished": "2025-10-23T19:29:34.000Z",
      "dateModified": "2025-10-23T19:29:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Daily Greens and Nutritional Powders on Amazon",
    "url": "https://www.tmz.com/2025/10/23/daily-greens-micro-greens-powders/",
    "image": "https://imagez.tmz.com/image/75/16by9/2025/10/20/75b49a47812842f5b291f58604016e69_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-23T07:01:06.000Z",
    "description": "\n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          TMZ may colle",
    "body": "\n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          TMZ may collect a share of sales or other compensation from links on this page.\n      \n    \n          We all know that you're probably not getting your recommended daily serving of fruits and veggies ... but now it's easier than ever to get your green on.\n      \n    \n          These superfood supplements contain all the good-for-you ingredients you could ever imagine ... from minerals to multivitamins to prebiotics and probiotics. Together, they're designed to promote a healthy body and mind, giving you more energy, enhanced immunity and glowing skin. Who wouldn't want that?\n      \n    \n              \n      AG1 Daily Health Supplement\n      \n        \n    \n                    \n                          \n                                  \n      \n        \n    \n          Get your daily serving of greens like the stars with the AG1 Daily Health Supplement, as seen inside Gwyneth Paltrow's own fridge!\n      \n\n          Celebs like Hugh Jackman, Cindy Crawford, and Lewis Hamilton have invested in this brand ... as this supplement claims to make your health routine a whole lot easier, providing you with the daily nutritional coverage and gut health support you need. With just one scoop, you're meant to get a multivitamin, probiotic, and superfood blend that contains 75 minerals, adaptogens and digestive enzymes, among other benefits.\n      \n    \n              \n      THORNE Daily Greens Plus Blend\n      \n        \n    \n                    \n                          \n                                  \n      \n        \n    \n          Beauty and wellness begins from within! The THORNE Daily Greens Plus Blend has been endorsed by celebs including Olivia Culpo and Dwyane Wade and is all about creating a healthy mind and body.\n      \n    \n          With 28 powerhouse ingredients, this nutrient dense greens blend is designed to promote physical endurance, cognitive performance, cellular energy production, and provide antioxidants. Mix it in with a smoothie or craft your own recipes, like Olivia's green goddess dressing!\n      \n    \n              \n      Bloom Greens & Superfood Powder\n      \n        \n    \n                    \n                          \n                                  \n      \n        \n    \n          Get all your daily greens in just one delicious scoop with the Bloom Greens & Superfood Powder.\n      \n    \n          It's never been easier to add more fruit and vegetables into your diet and with 30+ good-for-you ingredients, you’ll be feeling your best all day long. Each scoop includes prebiotics, probiotics, antioxidants, adaptogens, digestive enzymes, fruits, vegetables and organic superfoods like spirulina and chlorella ... and boasts influencer Alix Earle as a one-time partner.\n      \n    \n              \n      WelleCo The Super Elixir Daily Greens Powder\n      \n        \n    \n                    \n                          \n                                  \n      \n        \n    \n          Treat yourself like a supermodel with WelleCo The Super Elixir Daily Greens Powder.\n      \n    \n          Created by Elle Macpherson, this all-in-one greens powder has become a part of her daily routine for thriving through menopause. It includes 40+ ingredients, including whole foods, super greens, herbal extracts, vitamins, minerals, and probiotics, in order to support overall gut health, immunity, energy, and glowing skin.\n      \n    \n              \n      8Greens Supergreens Tablets\n      \n        \n    \n                    \n                          \n                                  \n      \n        \n    \n          Drew Barrymore has featured 8Greens Supergreens Tablets on her talk show, Zac Efron has been quoted as saying he uses them every day, while the product was also featured on Oprah's Favorite Things list.\n      \n    \n          These daily tablets instantly turn any drink into a fizzy, superfood beverage. Made with eight real greens, including spinach, kale, wheatgrass, blue green algae, spirulina, aloe vera, chlorella and barley grass, these tablets are packed with benefits, including a boosted metabolic rate and enhanced immunity.\n      \n    \n          Sign up for Amazon Prime to get the best deals!\n      \n    \n          All prices subject to change. \n      \n      ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Daily Greens and Nutritional Powders on Amazon",
      "image": [
        "https://imagez.tmz.com/image/75/16by9/2025/10/20/75b49a47812842f5b291f58604016e69_xl.jpg"
      ],
      "datePublished": "2025-10-23T07:01:06.000Z",
      "dateModified": "2025-10-23T07:01:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'9-1-1: Nashville' Rising Star Isabelle Tate Dead at 23",
    "url": "https://www.tmz.com/2025/10/23/isabelle-tate-dead/",
    "image": "https://imagez.tmz.com/image/b8/16by9/2025/10/23/b83fa1b0d2b447f8b3ed09b25ad6fff1_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-23T17:22:41.000Z",
    "description": "\n    \n                    \n                          '9-1-1: Nashville'\n                          Isabelle Tate Dead at 23\n                      \n    ",
    "body": "\n    \n                    \n                          '9-1-1: Nashville'\n                          Isabelle Tate Dead at 23\n                      \n                  \n                        Published October 23, 2025 10:22 AM PDT\n                                                                      |\n                Updated October 23, 2025 3:21 PM PDT\n                                    \n      \n    \n      \n        \n              \n    \n    \n          Update\n  \n    \n          11:32 AM PT -- We spoke to Isabelle Tate's agent, who tells us Tate passed away peacefully in her sleep.\n      \n    \n          We're told Isabelle suffered from Charcot-Marie-Tooth, a rare progressive neuromuscular disease which confined her to a wheelchair. Her agent says the disease affects the legs but can also affect internal organs such as the lungs and heart. Because of the disease, Tate had basically given up on her dream of acting ... until she got the 9-1-1 role -- her first big booking which was just perfect for her.\n      \n    \n          Tate's funeral will take place Friday.\n      \n    \n          Tragedy has rocked the \"9-1-1: Nashville\" ... one of the show's young actresses, Isabelle Tate, died shortly after filming an episode.\n      \n    \n          According to her obituary, the rising star died Sunday at age 23. Her agency, McCray Agency, confirmed the heartbreaking news ... though her cause of death has not been disclosed.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Isabelle played Julie in the pilot of ABC’s newest \"9-1-1\" spinoff, starring LeAnn Rimes, Chris O’Donnell, and more. Before breaking into acting, she graduated from Middle Tennessee State University.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Friends and family are remembering her online as \"full of fire,\" \"a fighter,\" and \"the most caring, loving person.\"\n      \n    \n          She was 23.\n      \n    \n          RIP\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Isabelle Tate\n              \n                          \n                RIP\n              \n                          \n                Celebrity Death\n              \n                          \n                Fairly Legal\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'9-1-1: Nashville' Rising Star Isabelle Tate Dead at 23",
      "image": [
        "https://imagez.tmz.com/image/b8/16by9/2025/10/23/b83fa1b0d2b447f8b3ed09b25ad6fff1_xl.jpg"
      ],
      "datePublished": "2025-10-23T17:22:41.000Z",
      "dateModified": "2025-10-23T17:22:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]