[
  {
    "title": "Indian Erotica Industry Documentary ‘Dirty Entertainers’ Set at DocuBay (EXCLUSIVE)",
    "url": "https://variety.com/2025/tv/news/indian-erotica-industry-doc-dirty-entertainers-docubay-1236544171/",
    "image": "https://variety.com/wp-content/uploads/2025/10/Dirty-Entertainers.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-10T05:30:00.000Z",
    "description": "<div><p>\n\t<a target=\"_blank\" href=\"https://variety.com/t/docubay/\">DocuBay</a> has launched a new original documentary that examines India’s erotica s",
    "body": "<div><p>\n\t<a target=\"_blank\" href=\"https://variety.com/t/docubay/\">DocuBay</a> has launched a new original documentary that examines India’s erotica sector as it faces growing regulatory challenges and content restrictions on streaming platforms.</p>\n<p>\n\t“<a target=\"_blank\" href=\"https://variety.com/t/dirty-entertainers-the-business-of-indian-erotica/\">Dirty Entertainers: The Business of Indian Erotica</a>,” helmed by director Heena Dsouza and produced by HumaraMovie, includes interviews with several well-known industry figures such as Maya Jafar and Rajsi Verma. The film explores the challenges performers and content creators face in an industry dealing with societal judgment and censorship issues.\n\t</p>\n<p>\n\t“At IN10 Media Network, the idea has always been to create thought-provoking storytelling around topics that people often discuss in whispers or secrecy, but rarely speak out loud,” said Aditya Pittie, managing director of IN10 Media Network, DocuBay’s parent company. “The glamour of the entertainment industry is often spoken about, but there’s a large, complex side to it that remains unexplored.”\n</p>\n<p>\n\tSamar Khan, chief operating officer of DocuBay, added, “The film doesn’t just explore the world of erotica; it delves into the economics behind it and how content, commerce, and censorship intersect. It’s an unfiltered look at an ecosystem that thrives despite being pushed to the margins.”</p>\n<p>\n\tThe project represents a collaboration between DocuBay’s global streaming platform and HumaraMovie, one of India’s largest independent production houses. Abhishek Gautam, associate producer at HumaraMovie, noted the documentary provides a platform for artists who have rarely shared their perspectives publicly.</p>\n<p>\n\t“Their experiences add authenticity and depth, and it was invaluable to capture these real-life perspectives for the documentary,” Gautam said. “Collaborating with DocuBay has been instrumental in bringing this vision to life with the platform’s strong global presence.”\n\t</p>\n<p>\n\tDirector Dsouza said her goal was to move beyond judgment. “My goal was to humanize this space, to showcase the people who make this industry what it is,” she said. “Bringing their voices to the forefront and piecing together the layers of this hidden ecosystem has been an eye-opening journey.”</p>\n<p>\n\t“Dirty Entertainers: The Business of Indian Erotica” streams exclusively on DocuBay, which is available in over 170 countries across multiple platforms including Apple App Store, Google Play Store, Fire TV, Roku, Apple TV and Samsung TVs.</p>\n<p>\n\tHumaraMovie’s slate includes the Disney+ Hotstar series “Mukesh Jasoos,” Netflix feature “Jaaon Kahaan Bata Ae Dil,” and Marathi-language film “Follower,” which premiered at the International Film Festival Rotterdam.</p>\n<figure><p>\n<iframe width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/Cr1M4jyFIw8?start=4&feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\"></iframe>\n</p></figure>\n</div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Indian Erotica Industry Documentary ‘Dirty Entertainers’ Set at DocuBay (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/Dirty-Entertainers.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-10T05:30:00.000Z",
      "dateModified": "2025-10-10T05:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How Fremantle Is Reaching Out to the YouTube Generation: ‘We Shouldn’t Give Up on Young People Just Because It’s Harder to Reach Them’",
    "url": "https://variety.com/2025/tv/global/fremantle-youtube-mipcom-1236544736/",
    "image": "https://variety.com/wp-content/uploads/2025/10/Knockout-Champs.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-10T07:01:00.000Z",
    "description": "<div><p>\n\tAs he prepares to travel to <a target=\"_blank\" href=\"https://variety.com/t/mipcom/\">Mipcom</a>, <a target=\"_blank\" href=\"https://variety.com",
    "body": "<div><p>\n\tAs he prepares to travel to <a target=\"_blank\" href=\"https://variety.com/t/mipcom/\">Mipcom</a>, <a target=\"_blank\" href=\"https://variety.com/t/andrew-llinares/\">Andrew Llinares</a>, <a target=\"_blank\" href=\"https://variety.com/t/fremantle/\">Fremantle</a>’s director of global entertainment, talks to Variety about his market slate and the enduring appeal of the production and distribution powerhouse’s legacy shows, such as “Got Talent,” “Idol” and “The X Factor.”</p>\n<p>\n\tLeading Fremantle’s entertainment slate at Mipcom are strategic reality show “Pandora’s Box,” comedy format “Knockout Champs” and factual entertainment series “The Secret DNA of Us.”\n\t</p>\n<p>\n\t“Pandora’s Box” was developed by RTL Creative Unit in the Netherlands, with productions already underway in the Netherlands, France and Hungary. The Dutch show is produced by Fremantle’s Blue Circle for RTL Netherlands.\n</p>\n<p>\n\t“It feels like an evolution of that strategic reality genre with a new game mechanic at the core of it,” Llinares says.</p>\n<div>\n<figure>\n<p><img srcset=\"https://variety.com/wp-content/uploads/2025/10/Pandoras-Box.jpg 1000w, https://variety.com/wp-content/uploads/2025/10/Pandoras-Box.jpg?resize=150,100 150w, https://variety.com/wp-content/uploads/2025/10/Pandoras-Box.jpg?resize=300,200 300w, https://variety.com/wp-content/uploads/2025/10/Pandoras-Box.jpg?resize=910,607 910w, https://variety.com/wp-content/uploads/2025/10/Pandoras-Box.jpg?resize=681,454 681w, https://variety.com/wp-content/uploads/2025/10/Pandoras-Box.jpg?resize=450,300 450w, https://variety.com/wp-content/uploads/2025/10/Pandoras-Box.jpg?resize=250,167 250w\" src=\"https://variety.com/wp-content/uploads/2025/10/Pandoras-Box.jpg?w=1000\" alt=\"\" />\n\t</p>\n<figcaption>\n\t\t\t\t\t<span>Strategic reality format “Pandora’s Box” will launch at Mipcom.</span>\n\t\t\t\t\t\t\t\t\tCourtesy of Fremantle\n\t</figcaption>\n</figure>\n</div>\n<p>\n\tThe show is inspired by the Greek myth – where Pandora, the first mortal woman on Earth, was given a sealed box by the gods. “We have Pandora’s Box at the center of a game with 12 contestants, who are told, ‘Do not open the box.’ If the box remains closed, there’s a big prize fund. However, there are lots of temptations to open the box,” he explains.</p>\n<p>\n\tHe adds, “Two of the players are cursed in each episode; they discover that they’ve been cursed, and that means their busts have been lowered into the box. Whichever two players are in the box at the end of the episode are going to fight in a duel to stay in the competition. So, you don’t want to be in the box.”\n\t</p>\n<p>\n\tThe show has the “look of the world of Greek mythology,” Llinares says.</p>\n<p>\n\t“Knockout Champs,” which comes from Dutch digital label De Stroom and is produced with Blue Circle, features a mix of content creators from the digital world and comedians. The show, which was originally created for YouTube and established a substantial following there, has now been produced for Dutch streamer NPO Start.</p>\n<div>\n<figure>\n<p><img srcset=\"https://variety.com/wp-content/uploads/2025/10/Andrew-Llinares.jpg 1000w, https://variety.com/wp-content/uploads/2025/10/Andrew-Llinares.jpg?resize=150,100 150w, https://variety.com/wp-content/uploads/2025/10/Andrew-Llinares.jpg?resize=300,200 300w, https://variety.com/wp-content/uploads/2025/10/Andrew-Llinares.jpg?resize=910,607 910w, https://variety.com/wp-content/uploads/2025/10/Andrew-Llinares.jpg?resize=681,454 681w, https://variety.com/wp-content/uploads/2025/10/Andrew-Llinares.jpg?resize=450,300 450w, https://variety.com/wp-content/uploads/2025/10/Andrew-Llinares.jpg?resize=250,167 250w\" src=\"https://variety.com/wp-content/uploads/2025/10/Andrew-Llinares.jpg?w=1000\" alt=\"\" />\n\t</p>\n<figcaption>\n\t\t\t\t\t<span>Andrew Llinares, Fremantle’s director of global entertainment.</span>\n\t\t\t\t\t\t\t\t\tCourtesy of Fremantle\n\t</figcaption>\n</figure>\n</div>\n<p>\n\t“It’s a comedy show in rounds where two teams are trying to make the other team laugh against their will. You score points by making your opponents laugh,” Llinares says.</p>\n<p>\n\t“Knockout Champs” was created with Supergaande, a group of genuine friends comparable to groups like Sidemen and Beta Squad. It’s boundary-pushing comedy that speaks to a young, diverse generation by staying true to the culture and comedy their in-built fan bases live for.</p>\n<p>\n\t“We all know YouTube is getting lots of young eyeballs right now, and it can be a struggle to get young eyeballs to traditional television. But what happened was that the young audience absolutely came over to watch the show. They fell in love with the content that they were watching on YouTube, and they followed it to NPO Start,” Llinares says.</p>\n<p>\n\t“The show was made very much in the same style as the YouTube content. Sometimes when something makes that transition and is made for ‘real TV’ it would potentially be made in a different style, and maybe cleaned up and polished, and jokes that are edgy might be edited out because they’re too edgy.</p>\n<p>\n\t“There was a very real desire to keep the show exactly the same, so it has the same spirit, the same kind of language, the same edginess to it. What that meant was that the young audience that watched the show felt they were watching something incredibly authentic.</p>\n<p>\n\t“It’s really fun, and there’s an edge to it, which is the core to its success. It hasn’t allowed itself to be sanitized for regular TV.”</p>\n<p>\n\tThe show’s success with younger audiences has vindicated the approach. “We shouldn’t give up on young people just because it’s harder to reach them. Young people consume content probably more than anybody else on the planet, and I still want our formats to speak to young people. I want young people to be excited by our formats,” Llinares says.\n\t</p>\n<div>\n<figure>\n<p><img srcset=\"https://variety.com/wp-content/uploads/2025/10/KSI.jpg 1000w, https://variety.com/wp-content/uploads/2025/10/KSI.jpg?resize=150,100 150w, https://variety.com/wp-content/uploads/2025/10/KSI.jpg?resize=300,200 300w, https://variety.com/wp-content/uploads/2025/10/KSI.jpg?resize=910,607 910w, https://variety.com/wp-content/uploads/2025/10/KSI.jpg?resize=681,454 681w, https://variety.com/wp-content/uploads/2025/10/KSI.jpg?resize=450,300 450w, https://variety.com/wp-content/uploads/2025/10/KSI.jpg?resize=250,167 250w\" src=\"https://variety.com/wp-content/uploads/2025/10/KSI.jpg?w=1000\" alt=\"\" />\n\t</p>\n<figcaption>\n\t\t\t\t\t<span>Music artist, YouTuber and boxer KSI has become a judge on “Britain’s Got Talent.”</span>\n\t\t\t\t\t\t\t\t\tCourtesy of Fremantle\n\t</figcaption>\n</figure>\n</div>\n<p>\n\t“Knockout Champs” held the top spot for four weeks on NPO Start. In the same timeframe, on social media it exploded with 50 million plus views in just four weeks. It ranks as NPO Start’s third most-watched title so far this year. The show’s core audience is young men (78% of the audience are 16 to 34 year old men).</p>\n<p>\n\tFremantle happily embraces both traditional television and the digital world, Llinares says. “My take is that the world of entertainment is just getting broader, and there is a space for all of it, to interact with it, with all the different pieces of it. It’s a little like how KSI coming in as a judge on ‘Britain’s Got Talent’ speaks to that kind of melding of those worlds. I don’t think they’re separate anymore. I think that it’s all mainstream, and there’s a way of bringing it together.”</p>\n<p>\n\t“The Secret DNA of Us” is a “warm hug of a show,” Llinares says. It was created by Fremantle label Naked in the U.K., and the first version of it was produced by Eureka in Australia for SBS. “Each episode, we take an entire town and test their DNA, and from that we find out what the common connections between people in the town are. We also find some really interesting individual stories from that DNA. So you get this amazing sense of community, this amazing sense of people in a community finding out that they’re linked in all sorts of ways. They might share a similar story. They might even be related. And then you’ll get those people that we really highlight in the show, who find out remarkable things about themselves.</p>\n<div>\n<figure>\n<p><img srcset=\"https://variety.com/wp-content/uploads/2025/10/The-Secret-DNA-of-Us.jpg 1000w, https://variety.com/wp-content/uploads/2025/10/The-Secret-DNA-of-Us.jpg?resize=150,100 150w, https://variety.com/wp-content/uploads/2025/10/The-Secret-DNA-of-Us.jpg?resize=300,200 300w, https://variety.com/wp-content/uploads/2025/10/The-Secret-DNA-of-Us.jpg?resize=910,607 910w, https://variety.com/wp-content/uploads/2025/10/The-Secret-DNA-of-Us.jpg?resize=681,454 681w, https://variety.com/wp-content/uploads/2025/10/The-Secret-DNA-of-Us.jpg?resize=450,300 450w, https://variety.com/wp-content/uploads/2025/10/The-Secret-DNA-of-Us.jpg?resize=250,167 250w\" src=\"https://variety.com/wp-content/uploads/2025/10/The-Secret-DNA-of-Us.jpg?w=1000\" alt=\"\" />\n\t</p>\n<figcaption>\n\t\t\t\t\t<span>“The Secret DNA of Us” is like “a warm hug,” Andrew Llinares says.</span>\n\t\t\t\t\t\t\t\t\tCourtesy of SBS\n\t</figcaption>\n</figure>\n</div>\n<p>\n\t“So it’s a warm hug is a good way of describing it, because it’s one of those shows that speaks to all of us, wanting to know who we are and where we’re from. It can be a really joyful show, it can be a funny show, but it can be a very emotional show as well.”</p>\n<p>\n\tFor a show to be a success, it needs to feel culturally relevant, Llinares observes. “For something to take off and go beyond being a TV show, that becomes something that people talk about in society, it absolutely does have to touch the moment, and speak to the culture of the moment.”\n\t</p>\n<p>\n\tReviewing his three headliners at Mipcom, Llinares says, “I think they all speak to very different needs of the market, and they also speak to different audiences. They all tick very different boxes.”</p>\n<p>\n\tSome of Fremantle’s evergreen formats have either celebrated or are about to reach major milestones. In the summer, “America’s Got Talent” started its 20th series, and next year Fremantle celebrates 70 years of “The Price Is Right,” 50 years of “Family Feud” and 25 years of “Idol.”</p>\n<p>\n\tLlinares is well-qualified to comment on the success of such globe-trotting formats. He was the original showrunner on “The X Factor” and “Got Talent” when they first launched in the U.K. in 2004 and 2007, respectively. Since 2011, while living and working in the U.S., he was an EP and showrunner for the U.S. version of “The X Factor,” before becoming EP and showrunner on “Dancing With the Stars” in 2018.</p>\n<p>\n\tWhat’s the secret to their continued success? “With great shows and keeping them on air for many years that core DNA of the show is so, so important,” Llinares says.</p>\n<p>\n\t“What’s wonderful about ‘Got Talent’ is that it’s been around for 20 years now, and it’s continued to grow in terms of the types of talents on the show and the scale of the show, but the DNA of the show has remained the same, which is taking people and celebrating their extraordinary talents and the amazing stories that go along with that.</p>\n<p>\n\t“It’s an amazing fairytale of a show. When you boil it down, it’s about taking people and absolutely celebrating the best version of them and I think that central core DNA of the show has never, ever changed.”</p>\n<p>\n\tThe introduction of the Golden Buzzer is one innovation, but it simply enhanced the emotional punch of the show.</p>\n<p>\n\t“I always think a show like ‘Got Talent’ is an emotional journey. You see that in those audition shows. You have the emotion of someone coming in and wanting to make it through, wanting to be celebrated. And if they get a ‘Yes,’ you get this huge, amazing moment, as we did with someone like Susan Boyle back in the day. The Golden Buzzer just takes that moment and makes it even bigger and makes it more of a spectacle.”</p>\n<p>\n\tHe adds, “I always say we’re in the business of feelings, and so you have to make sure the show makes you feel something. And I think the talent shows in particular make people feel in a very extreme way, like you feel extreme joy or extreme sorrow, depending on whether someone’s doing well or if they have a bad week, and they’re eliminated. As producers, you have to continue to then think, ‘How do I find a new way of creating that emotion?’\n\t</p>\n<figure><p>\n<iframe width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/43HcbcK-z4E?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\"></iframe>\n</p></figure>\n<p>\n\t“So, really, when it boils down, what’s the success of a great format? It’s the audience being engaged.”</p>\n<p>\n\tNowadays, engagement also means social media interaction. “When we’re talking about longevity, we know one of the things that keeps the conversation going around the shows is social video,” Llinares says. “The auditions are wonderful bite-sized stories. They’re perfect for that kind of viewing, they are doing extraordinary numbers.”</p>\n<p>\n\t“We got a first-window into it with Susan Boyle, and even Paul Potts on the first British series, when YouTube was in its absolute infancy. It had grown in a couple of years between the two of them to the point where it felt like there was a huge global story around Susan Boyle.</p>\n<p>\n\t“We’re marking an incredible 20 seasons of ‘America’s Got Talent’ – a series that just reached 1.7 billion social video views.</p>\n<p>\n\t“Fremantle has a long-standing legacy in creating enduring entertainment hits – across decades and platforms – and part of that success comes from constantly evolving with audiences.</p>\n<p>\n\t“You can see a bridging of the worlds of linear and digital entertainment, whether it’s the breakout success of ‘Knockout Champs’ co-created with digital-first talent; making YouTuber KSI a permanent judge on the next season of ‘Britain’s Got Talent,’ or opening up our IP to make exciting creator-led titles like ‘Sidemen Supermarket Sweep.’”</p>\n</div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How Fremantle Is Reaching Out to the YouTube Generation: ‘We Shouldn’t Give Up on Young People Just Because It’s Harder to Reach Them’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/Knockout-Champs.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-10T07:01:00.000Z",
      "dateModified": "2025-10-10T07:01:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Oscar Predictions: Adapted Screenplay — ‘Hamnet,’ ‘One Battle After Another’ and ‘Bugonia’ Lead a Season of Visionary Reinventions",
    "url": "https://variety.com/lists/2026-oscars-best-adapted-screenplay-predictions/",
    "image": "https://variety.com/wp-content/uploads/2025/10/Oscars-Adapted-Screenplay.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-09T23:55:00.000Z",
    "description": "<article>\n\t\t<div>\n<div>\n\t<p>\n\tOct 9, 2025 4:55pm PT\t\n\t</p>\n</div>\n\t<p>\n\t</p><h2>Oscar Predictions: Adapted Screenplay — ‘Hamnet,’ ‘One Battle After An",
    "body": "<article>\n\t\t<div>\n<div>\n\t<p>\n\tOct 9, 2025 4:55pm PT\t\n\t</p>\n</div>\n\t<p>\n\t</p><h2>Oscar Predictions: Adapted Screenplay — ‘Hamnet,’ ‘One Battle After Another’ and ‘Bugonia’ Lead a Season of Visionary Reinventions</h2>\n\t<p></p>\n<div>\n<figure>\n<div>\n\t\t\t<p><img src=\"https://variety.com/wp-content/uploads/2025/10/Oscars-Adapted-Screenplay.jpg?w=1000&h=666&crop=1\" alt=\"Hamnet - One Battle After Another - Song Sung Blue\" srcset=\"https://variety.com/wp-content/uploads/2025/10/Oscars-Adapted-Screenplay.jpg?w=1000&h=666&crop=1 1000w, https://variety.com/wp-content/uploads/2025/10/Oscars-Adapted-Screenplay.jpg?w=1000&h=666&crop=1&resize=150%2C100 150w, https://variety.com/wp-content/uploads/2025/10/Oscars-Adapted-Screenplay.jpg?w=1000&h=666&crop=1&resize=300%2C200 300w, https://variety.com/wp-content/uploads/2025/10/Oscars-Adapted-Screenplay.jpg?w=1000&h=666&crop=1&resize=910%2C607 910w, https://variety.com/wp-content/uploads/2025/10/Oscars-Adapted-Screenplay.jpg?w=1000&h=666&crop=1&resize=681%2C454 681w, https://variety.com/wp-content/uploads/2025/10/Oscars-Adapted-Screenplay.jpg?w=1000&h=666&crop=1&resize=450%2C300 450w, https://variety.com/wp-content/uploads/2025/10/Oscars-Adapted-Screenplay.jpg?w=1000&h=666&crop=1&resize=250%2C167 250w\" />\n\t\t\t</p>\n\t</div>\n\t\t\t\t\t\t<p>\n</p><figcaption>\n\t\t\t\t\t\t\t\t\tFocus Features / Warner Bros.\n\t</figcaption>\n\t\t\t\t\t<p></p>\n</figure>\n</div>\n\t\t\t\t\t\t\t</div>\n\t\t<div>\n<p>\n\t<em>Variety </em><a target=\"_blank\" href=\"https://variety.com/t/awards-circuit/\">Awards Circuit</a> section is the home for all awards news and related content throughout the year, featuring the following: the official predictions for the upcoming Oscars, <a target=\"_blank\" href=\"https://variety.com/t/emmys/\">Emmys</a>, Grammys and Tony Awards ceremonies, curated by <em>Variety </em>chief awards editor Clayton Davis. The prediction pages reflect the current standings in the race and do not reflect personal preferences for any individual contender. As other formal (and informal) polls suggest, competitions are fluid and subject to change based on buzz and events. Predictions are updated every Thursday.</p>\n<div>\n<figure>\n<p><img srcset=\"https://variety.com/wp-content/uploads/2025/03/MCDBUGO_UC003-e1758920242240.jpg 1920w, https://variety.com/wp-content/uploads/2025/03/MCDBUGO_UC003-e1758920242240.jpg?resize=150,100 150w, https://variety.com/wp-content/uploads/2025/03/MCDBUGO_UC003-e1758920242240.jpg?resize=300,200 300w, https://variety.com/wp-content/uploads/2025/03/MCDBUGO_UC003-e1758920242240.jpg?resize=1360,907 1360w, https://variety.com/wp-content/uploads/2025/03/MCDBUGO_UC003-e1758920242240.jpg?resize=1000,667 1000w, https://variety.com/wp-content/uploads/2025/03/MCDBUGO_UC003-e1758920242240.jpg?resize=910,607 910w, https://variety.com/wp-content/uploads/2025/03/MCDBUGO_UC003-e1758920242240.jpg?resize=681,454 681w, https://variety.com/wp-content/uploads/2025/03/MCDBUGO_UC003-e1758920242240.jpg?resize=450,300 450w, https://variety.com/wp-content/uploads/2025/03/MCDBUGO_UC003-e1758920242240.jpg?resize=250,167 250w\" src=\"https://variety.com/wp-content/uploads/2025/03/MCDBUGO_UC003-e1758920242240.jpg?w=1024\" alt=\"\" />\n\t</p>\n<figcaption>\n\t\t\t\t\t<span>BUGONIA, Jesse Plemons</span>\n\t\t\t\t\t\t\t\t\t©Focus Features/Courtesy Everett Collection\n\t</figcaption>\n</figure>\n</div>\n<p>\n\t<strong>Oscars Best Adapted Screenplay Commentary (Updated Oct. 9, 2025):</strong> Literary prestige and directorial ingenuity encapsulate this year’s adapted screenplay category.</p>\n<p>\n\t“Hamnet,” adapted by Maggie O’Farrell and Chloé Zhao from O’Farrell’s acclaimed novel, stands as a fusion of beauty, fidelity and cinematic imagination, merging Zhao’s visual poetry with O’Farrell’s emotional precision. In contrast, Paul Thomas Anderson’s “One Battle After Another,” inspired by Thomas Pynchon’s “Vineland,” channels the filmmaker’s trademark sense of chaos and longing into a layered reflection on social idealism and decay.</p>\n<p>\n\tElsewhere, “Bugonia” reimagines the 2003 South Korean dark comedy “Save the Green Planet” through the lens of Yorgos Lanthimos’ distinctive vision, with screenwriter Will Tracy twisting its absurdist horror into a darker, more satirical register.</p>\n<p>\n\tThe “little film that could” this season is “Train Dreams,” an adaptation of Denis Johnson’s novella by Clint Bentley and Greg Kwedar, which may emerge as a quiet threat as the season progresses. A lyrical portrait of isolation and loss, it has ardent defenders and admirers who could help carry it far. Meanwhile, there’s a strong gut feeling that Craig Brewer’s “Song Sung Blue,” based on a real-life story tied to the music industry, could bring a soulful, populist touch to a category defined this year by ambition and artistry — aided by standout performances from Hugh Jackman and Kate Hudson.</p>\n<p>\n\t<em>NOTE: All titles, release dates, studios, and final credits are subject to change.</em></p>\n<div>\n<ul>\n\t\t\t<li>\n\t\t\t<article>\n\t\t\t<figure>\n\t\t\t<img src=\"https://variety.com/wp-content/uploads/2025/07/TRAIN_DREAMS_u_00_19_06_13_R-e1753310330650.jpg?w=300\" alt=\"TRAIN DREAMS - (L-R) Felicity Jones as Gladys and  Joel Edgerton as Robert Grainier. Cr: Netflix © 2025\" srcset=\"https://variety.com/wp-content/uploads/2025/07/TRAIN_DREAMS_u_00_19_06_13_R-e1753310330650.jpg 2930w, https://variety.com/wp-content/uploads/2025/07/TRAIN_DREAMS_u_00_19_06_13_R-e1753310330650.jpg?resize=150,100 150w, https://variety.com/wp-content/uploads/2025/07/TRAIN_DREAMS_u_00_19_06_13_R-e1753310330650.jpg?resize=300,200 300w, https://variety.com/wp-content/uploads/2025/07/TRAIN_DREAMS_u_00_19_06_13_R-e1753310330650.jpg?resize=1920,1280 1920w, https://variety.com/wp-content/uploads/2025/07/TRAIN_DREAMS_u_00_19_06_13_R-e1753310330650.jpg?resize=1360,907 1360w, https://variety.com/wp-content/uploads/2025/07/TRAIN_DREAMS_u_00_19_06_13_R-e1753310330650.jpg?resize=1000,667 1000w, https://variety.com/wp-content/uploads/2025/07/TRAIN_DREAMS_u_00_19_06_13_R-e1753310330650.jpg?resize=910,607 910w, https://variety.com/wp-content/uploads/2025/07/TRAIN_DREAMS_u_00_19_06_13_R-e1753310330650.jpg?resize=681,454 681w, https://variety.com/wp-content/uploads/2025/07/TRAIN_DREAMS_u_00_19_06_13_R-e1753310330650.jpg?resize=450,300 450w, https://variety.com/wp-content/uploads/2025/07/TRAIN_DREAMS_u_00_19_06_13_R-e1753310330650.jpg?resize=250,167 250w\" />\t\t\t\t\t\t\t<figcaption>\n\t\t\t\t\tImage Credit: Courtesy of Netflix\t\t\t\t</figcaption>\n\t\t\t\t\t</figure>\n\t\t\t\t<div>\n<figure><p>\nwindow.addEventListener(\"message\",function(a){if(void 0!==a.data[\"datawrapper-height\"]){var e=document.querySelectorAll(\"iframe\");for(var t in a.data[\"datawrapper-height\"])for(var r,i=0;r=e[i];i++)if(r.contentWindow===a.source){var d=a.data[\"datawrapper-height\"][t]+\"px\";r.style.height=d}}});\n</p></figure>\n</div></article>\n\t\t</li>\n\t\t\t<li>\n\t\t\t<article>\n\t\t\t<figure>\n\t\t\t<img src=\"https://variety.com/wp-content/uploads/2025/08/Russell-Crowe-Nuremberg.jpg?w=300\" alt=\"Nuremberg\" srcset=\"https://variety.com/wp-content/uploads/2025/08/Russell-Crowe-Nuremberg.jpg 1200w, https://variety.com/wp-content/uploads/2025/08/Russell-Crowe-Nuremberg.jpg?resize=150,84 150w, https://variety.com/wp-content/uploads/2025/08/Russell-Crowe-Nuremberg.jpg?resize=300,169 300w, https://variety.com/wp-content/uploads/2025/08/Russell-Crowe-Nuremberg.jpg?resize=125,70 125w, https://variety.com/wp-content/uploads/2025/08/Russell-Crowe-Nuremberg.jpg?resize=1000,563 1000w, https://variety.com/wp-content/uploads/2025/08/Russell-Crowe-Nuremberg.jpg?resize=910,511 910w, https://variety.com/wp-content/uploads/2025/08/Russell-Crowe-Nuremberg.jpg?resize=681,383 681w, https://variety.com/wp-content/uploads/2025/08/Russell-Crowe-Nuremberg.jpg?resize=450,253 450w, https://variety.com/wp-content/uploads/2025/08/Russell-Crowe-Nuremberg.jpg?resize=250,140 250w\" />\t\t\t\t\t\t\t<figcaption>\n\t\t\t\t\tImage Credit: Courtesy of Sony Pictures Classics\t\t\t\t</figcaption>\n\t\t\t\t\t</figure>\n\t\t\t\t<div>\n<figure><p>\nwindow.addEventListener(\"message\",function(a){if(void 0!==a.data[\"datawrapper-height\"]){var e=document.querySelectorAll(\"iframe\");for(var t in a.data[\"datawrapper-height\"])for(var r,i=0;r=e[i];i++)if(r.contentWindow===a.source){var d=a.data[\"datawrapper-height\"][t]+\"px\";r.style.height=d}}});\n</p></figure>\n</div></article>\n\t\t</li>\n\t\t\t<li>\n\t\t\t<article>\n\t\t\t<figure>\n\t\t\t<img src=\"https://variety.com/wp-content/uploads/2025/05/Pillion-copy.jpg?w=300\" alt=\"Harry Melling, Alexander Skarsgard\" srcset=\"https://variety.com/wp-content/uploads/2025/05/Pillion-copy.jpg 1000w, https://variety.com/wp-content/uploads/2025/05/Pillion-copy.jpg?resize=150,100 150w, https://variety.com/wp-content/uploads/2025/05/Pillion-copy.jpg?resize=300,200 300w, https://variety.com/wp-content/uploads/2025/05/Pillion-copy.jpg?resize=910,607 910w, https://variety.com/wp-content/uploads/2025/05/Pillion-copy.jpg?resize=681,454 681w, https://variety.com/wp-content/uploads/2025/05/Pillion-copy.jpg?resize=450,300 450w, https://variety.com/wp-content/uploads/2025/05/Pillion-copy.jpg?resize=250,167 250w\" />\t\t\t\t\t\t\t<figcaption>\n\t\t\t\t\tImage Credit: Courtesy of Cannes\t\t\t\t</figcaption>\n\t\t\t\t\t</figure>\n\t\t\t\t<div>\n<figure><p>\nwindow.addEventListener(\"message\",function(a){if(void 0!==a.data[\"datawrapper-height\"]){var e=document.querySelectorAll(\"iframe\");for(var t in a.data[\"datawrapper-height\"])for(var r,i=0;r=e[i];i++)if(r.contentWindow===a.source){var d=a.data[\"datawrapper-height\"][t]+\"px\";r.style.height=d}}});\n</p></figure>\n</div></article>\n\t\t</li>\n\t\t\t<li>\n\t\t\t<article>\n\t\t\t<figure>\n\t\t\t<img src=\"https://variety.com/wp-content/uploads/2025/08/hoffman-jonsson-long-walk.jpg?w=300\" alt=\"The Long Walk\" srcset=\"https://variety.com/wp-content/uploads/2025/08/hoffman-jonsson-long-walk.jpg 1200w, https://variety.com/wp-content/uploads/2025/08/hoffman-jonsson-long-walk.jpg?resize=150,100 150w, https://variety.com/wp-content/uploads/2025/08/hoffman-jonsson-long-walk.jpg?resize=300,200 300w, https://variety.com/wp-content/uploads/2025/08/hoffman-jonsson-long-walk.jpg?resize=1000,667 1000w, https://variety.com/wp-content/uploads/2025/08/hoffman-jonsson-long-walk.jpg?resize=910,607 910w, https://variety.com/wp-content/uploads/2025/08/hoffman-jonsson-long-walk.jpg?resize=681,454 681w, https://variety.com/wp-content/uploads/2025/08/hoffman-jonsson-long-walk.jpg?resize=450,300 450w, https://variety.com/wp-content/uploads/2025/08/hoffman-jonsson-long-walk.jpg?resize=250,167 250w\" />\t\t\t\t\t\t\t<figcaption>\n\t\t\t\t\tImage Credit: Murray Close/Lionsgate\t\t\t\t</figcaption>\n\t\t\t\t\t</figure>\n\t\t\t\t<div>\n<figure><p>\nwindow.addEventListener(\"message\",function(a){if(void 0!==a.data[\"datawrapper-height\"]){var e=document.querySelectorAll(\"iframe\");for(var t in a.data[\"datawrapper-height\"])for(var r,i=0;r=e[i];i++)if(r.contentWindow===a.source){var d=a.data[\"datawrapper-height\"][t]+\"px\";r.style.height=d}}});\n</p></figure>\n</div></article>\n\t\t</li>\n\t\t\t<li>\n\t\t\t<article>\n\t<h2>Eligible Titles (Adapted Screenplay)</h2>\n\t\t\t<figure>\n\t\t\t<img src=\"https://variety.com/wp-content/uploads/2025/06/Hedda-Still.jpg?w=300\" alt=\"TIFF\" srcset=\"https://variety.com/wp-content/uploads/2025/06/Hedda-Still.jpg 1000w, https://variety.com/wp-content/uploads/2025/06/Hedda-Still.jpg?resize=150,84 150w, https://variety.com/wp-content/uploads/2025/06/Hedda-Still.jpg?resize=300,169 300w, https://variety.com/wp-content/uploads/2025/06/Hedda-Still.jpg?resize=125,70 125w, https://variety.com/wp-content/uploads/2025/06/Hedda-Still.jpg?resize=910,511 910w, https://variety.com/wp-content/uploads/2025/06/Hedda-Still.jpg?resize=681,383 681w, https://variety.com/wp-content/uploads/2025/06/Hedda-Still.jpg?resize=450,253 450w, https://variety.com/wp-content/uploads/2025/06/Hedda-Still.jpg?resize=250,140 250w\" />\t\t\t\t\t</figure>\n\t\t\t\t<div>\n<figure><p>\nwindow.addEventListener(\"message\",function(a){if(void 0!==a.data[\"datawrapper-height\"]){var e=document.querySelectorAll(\"iframe\");for(var t in a.data[\"datawrapper-height\"])for(var r,i=0;r=e[i];i++)if(r.contentWindow===a.source){var d=a.data[\"datawrapper-height\"][t]+\"px\";r.style.height=d}}});\n</p></figure>\n</div></article>\n\t\t</li>\n\t</ul>\n\t</div>\n</div>\n\t</article>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Oscar Predictions: Adapted Screenplay — ‘Hamnet,’ ‘One Battle After Another’ and ‘Bugonia’ Lead a Season of Visionary Reinventions",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/Oscars-Adapted-Screenplay.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-09T23:55:00.000Z",
      "dateModified": "2025-10-09T23:55:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cinema United Elects Harkins Theatres’ Mike Bowers as New Chair – Film News in Brief",
    "url": "https://variety.com/2025/film/news/film-news-in-brief-oct-6-1236540268/",
    "image": "https://variety.com/wp-content/uploads/2025/10/Mike-Bowers-Headshot.jpeg?crop=225px%2C0px%2C815px%2C458px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-10-09T23:43:16.000Z",
    "description": "<div><p>\n\tHarkins Theatres president and CEO Mike Bowers has been elected chair of the executive board of <a target=\"_blank\" href=\"https://variety.com",
    "body": "<div><p>\n\tHarkins Theatres president and CEO Mike Bowers has been elected chair of the executive board of <a target=\"_blank\" href=\"https://variety.com/t/cinema-united/\">Cinema United</a>, the international organization of movie theater owners. Bowers will take over from B&B Theatres CEO Bob Bagby, who will remain on the executive board. </p>\n<p>\n\t“Delivering an amazing cinematic experience has been my life’s work,” says Bowers. “It’s a true honor to serve the passionate people who bring the magic of moviegoing to communities across America and around the globe.”\n\t</p>\n<p>\n\tBowers has been president and CEO of Arizona-based Harkins Theatres since 2006. Also making up the executive board are Cinemark’s Executive VP and Chief Marketing and Content Officer, Wanda Gierhart Fearing, who will serve as Vice-Chair; Colleen Barstow of Nebraska-based Main Street Theatres who will become Treasurer, and Bo Chambliss of Georgia Theatre Company who will continue as Board Secretary.\n</p>\n<p>\n\t“I am extremely excited to work with Mike and the leadership team to continue to support and promote this great industry. Mike brings years of experience building a successful circuit, and he will work tirelessly to support all of exhibition. The entire leadership team will bring energy and insight as we continue to drive toward the next great era in cinema,” says Cinema United president & CEO Michael O’Leary. “I also want to acknowledge and thank Bob for successfully leading Cinema United these past<br />two years. He will remain on the board and continue to be a leader for years to come.”</p>\n<p>\n\tCinema United represents more than 33,000 movie screens across the U.S. and Canada and an additional 30,000 more in 81 countries worldwide.\n\t</p>\n\t<h2>\n\t\tThursday, October 9\t</h2>\n<p>\n\t<strong>Mischa Barton Bends Reality in ‘Glitched’ Paranormal Sci-Fi Comedy Film </strong></p>\n<p>\n\tMischa Barton (“The O.C.”) will star in the paranormal sci-fi comedy, “Glitched,” which is set to make its world premiere at the La Femme Film Festival in Los Angeles on Oct. 17.</p>\n<p>\n\tAfter turning their grandmother’s castle into a virtual reality playground, “Glitched” tells the story of a set of ambitious twins trying not to get stuck in the afterlife after accidentally opening a supernatural portal.</p>\n<p>\n\tRounding out the cast are Abigail O’Regan (“Spellbound”), Donal Brophy (“Sleep No More”), Jack McEvoy (“Vikings”) and Elijah Rowen (“Vikings”) and John Connors (“Crazy Love,” “Re-Creation with Jim Sheridan”). </p>\n<p>\n\tDirected by Alaskan filmmaker Zoe Quist, the genre-bending project is a women-led production that established mentorships across all key departments to create pathways for new voices and ensure economic diversity on set.</p>\n<p>\n\t“Glitched” is written by Steve Grabowsky with Maria O’Neill p.g.a (“The Black Guelph”), Susan Wright p.g.a. and Quist as producers.</p>\n<figure><p>\n<iframe width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/cXdyZy0d8Cc?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\"></iframe>\n</p></figure>\n<p>\n\t<strong><br />Five Participants Selected for the Annual Native American Unscripted Workshop</strong></p>\n<p>\n\tThe Native American Media Alliance has selected five storytellers to participate in its 5th Annual Native American Unscripted Workshop: a five day talent development program that aims to help Native American filmmakers, journalists and media artists launch their careers in the unscripted film and television industry. </p>\n<p>\n\tGuided by experienced unscripted producers, the program offers mentorship, creative seminars, meetings and networking opportunities for these emergent voices. At the end of the five days,  participants pitch their projects to panels of creative executives and producers. </p>\n<p>\n\tThis years’ participants are Alana Tiikpuu, Evan L. Chouteau, Jenna Monroe, Joshua Emerson and Tammy “TS” Botkin. The program is sponsored by Comcast NBCUniversal, the Los Angeles County of Arts & Culture and the City of Los Angeles Department of Cultural Affairs.</p>\n\t<h4>\n\t\tFreestyle Digital Media Acquires “Stationed At Home”\t</h4>\n<p>\n\tFreestyle Digital Media, the digital film distribution arm of Allen Media Group, has acquired the VOD distribution rights for “Stationed At Home.” The film will be available to rent and own on digital platforms and DVD in North America starting Nov. 11.\n\t</p>\n<p>\n\tDirected by Daniel V. Masciari, the film is an indie drama following a lonely taxi driver in 1998, whose night takes bizarre turns as unexpected faces and figures float through his orbit. The film stars Erik Bjarnar, Darryle Johnson, Eliza VanCort, Jamie Donnelly, Peter Foster Morris, Jeff DuMont and Alek Osinski.</p>\n\t<h2>\n\t\tWednesday, October 8\t</h2>\n<p>\n\t<strong>Art House New York Launches Regional Alliance to Support Indie Film Exhibition</strong></p>\n<p>\n\tArt House New York has officially launched with an inaugural week-long audience development campaign designed to bring audiences back to explore the vibrant and diverse independent cinema landscape in spring 2026. </p>\n<p>\n\t“Our goal is to strengthen ties between art house cinemas and with the film industry, creating new opportunities to connect audiences together,” Art House New York director Allason Leitz, said in a statement. “Alone, art house cinemas are hidden gems, but together, we are a cultural force.”</p>\n<p>\n\tWith the NYC Mayor’s Office of Media and Entertainment as a founding partner, Art House New York is a regional alliance strengthening independent film exhibitions in New York City through audience development, research and strategic initiatives. Paula Scher, who created the Art House New York logo and brand identity, will also develop the 2026 campaign.</p>\n<p>\n\tArt House New York was founded by Lesli Klainberg (former president of Film at Lincoln Center) who tapped Allason Leitz of Third Industry Strategies to design its formative vision and serve as the initiative’s director.</p>\n<p>\n\tLeaders from across the film industry on the advisory council include Kazembe Balagun, Executive Director, Maysles Documentary Center; Dori Begley, Co-CEO, Magnolia Pictures;  Matt Bolish, Deputy Director, Film at Lincoln Center; Mark Boxer, Head of Distribution, MUBI; Karen Cardarelli, Executive Director, Facets & Chicago Alliance of Film Festivals and Gary Faber, President, ERM Research. </p>\n<p>\n\tThey are joined by New York Film Commissioner Pat Swinney Kaufman; Klainberg, AHNY Founder, former President, Film at Lincoln Center; Lela Meadow-Conner, Board President, Art House Convergence; Dara Messinger, Director of Programming, DCTV’s Firehouse Cinema; Rajendra Roy, Chief Curator of Film, MoMA; Shannon Treusch, Partner, Falco Ink.; Jesse Trussell, Director, Film Program and Strategy, BAM; Barbara Twist, Executive Director, Film Festival Alliance and John Vanco, Programming, Paris Theater (Netflix).<strong> <br /></strong>\n\t</p>\n<p>\n\t<strong>Jackson Wild and Earth Alliance Awards $60,000 Grants to Documentary Filmmakers </strong></p>\n<p>\n\tJackson Wild and Earth Alliance have revealed the conservation and wildlife filmmakers selected for their inaugural Impact Pitch grant program, which aims to fund projects that shift the narrative toward solutions and actionable outcomes.  </p>\n<p>\n\tThe program awards up to $60,000 in funding to support filmmakers and impact campaigns associated with their films. </p>\n<p>\n\tJigar Ganatra’s film “Chameleon Corridors” will receive $30,000 and strategic support to help implement its impact campaign. The “Chameleon Corridors” team will work with local partners in Tanzania to screen the film for farmers, students and Tanzanian authorities to dismantle ingrained superstitions around chameleons and educate communities about reforestation programs. </p>\n<p>\n\tSally Snow’s <em>“</em>Iyo Ang Dagat (The Sea is Yours),” which explores the deep and complex relationship between people and sharks in the Philippines, will be awarded $15,000. The grant will help raise awareness about the value of sharks and rays and the ongoing efforts to protect them in Palawan and support working alongside key stakeholders to draft and pass legislation regulating marine and wildlife tourism in Palawan.</p>\n<p>\n\tMichael Salama and Gastón Zilberman’s “Qotzuñi: People of the Lake” will also receive $15,000 and is set to use the funding with the Uru Indigenous Nation and local partners in Bolivia to improve food security for communities, support sustainable livelihoods, and create fellowships for Uru youth in communities surrounding Lake Poopó.</p>\n<p>\n\tOther finalists include Danny Schmidt’s “Book of George” and the Environmental Justice Foundation documentary “Pantanal.”<strong><br /></strong></p>\n\t<h2>\n\t\tTuesday, October 7\t</h2>\n<p>\n\t<strong><a target=\"_blank\" href=\"https://variety.com/t/tribeca/\">Tribeca</a> Festival and AT&T Launch Applications for Untold Stories With $1.2 Million in Prizes</strong></p>\n<p>\n\tThe Tribeca Festival and AT&T have increased their AT&T Untold Stories program’s top production prize from $1 million to $1.2 million for the festival’s 25th anniversary in 2026. The program, which provides funding, empowerment and support for emerging filmmakers, is the largest unrestricted film production award of its kind in the world.</p>\n<p>\n\tThe program launched in 2017 and each year awards one new filmmaker full funding to produce a feature along with mentorship, support and a guaranteed premiere at the Tribeca Festival. Since its inception, the program has supported 40 projects and produced eight winning films, some of which have garnered distribution on major platforms such as Netflix and HBO Max.\n\t</p>\n<p>\n\t“Independent filmmaking has never been tougher, and too many vital stories never make it to the screen. Untold Stories changes that,” said Jane Rosenthal, CEO and Co-Founder of Tribeca Enterprises. “It doesn’t just give filmmakers the means to create — it helps ensure their work is seen. With funding, mentorship, and distribution support, the program opens doors that might otherwise stay shut. This expanded prize will give bold storytellers the chance to dream bigger, go further, and reach the audiences their stories deserve.”</p>\n<p>\n\tApplications for the 2026 Untold Stories award are now open and close on Feb. 6. The winner will receive the $1.2 million grant at next year’s festival. </p>\n<p>\n\tFilmmakers can apply now at <a target=\"_blank\" href=\"https://nam02.safelinks.protection.outlook.com/?url=http%3A%2F%2Ftribecafilm.com%2Funtoldstories&data=05%7C02%7Cjtangcay%40variety.com%7C6526110935c04d10792108de035f174d%7Ce950f25546e44144a778a6ff4f557492%7C0%7C0%7C638951904526361534%7CUnknown%7CTWFpbGZsb3d8eyJFbXB0eU1hcGkiOnRydWUsIlYiOiIwLjAuMDAwMCIsIlAiOiJXaW4zMiIsIkFOIjoiTWFpbCIsIldUIjoyfQ%3D%3D%7C0%7C%7C%7C&sdata=1ryEai7Xf%2F%2FVAMRwn2spvuiaKTDxKAsGyRdBIsfe3y4%3D&reserved=0\">tribecafilm.com/untoldstories</a>.</p>\n<p>\n\t<strong>Tello Films Network Releases Trailer For Lesbian Holiday Romcom “The Christmas Writer”</strong></p>\n<p>\n\tThe trailer for “The Christmas Writer” has been released online, courtesy of Tello Films Network..  The film will premiere on Nov. 18 on VOD.</p>\n<p>\n\tThe film follows a bestselling lesbian Christmas author loses her holiday muse and experiences writer’s block, setting her off on a journey to return to her quaint hometown in search of renewed inspiration, finding an unexpected love story.</p>\n<p>\n\t“The Christmas Writer” stars Shelby Allison Brown as Noel, Callie Bussell as Callie, Jordan Myrick as Paulette, Kendahl Landreth as Erin, Stacey Lee Powell as Jillian, Karen M. Chan as Grandma Robbins, and June Tuss as Pepper. The film was directed by Tello Films founder & CEO Christin Baker, and co-written with Katie I. Williams. “The Christmas Writer” was produced by Andrew James Myers and Trenton Julius.</p>\n<p>\n\tThe film will also be available to rent or buy on Amazon, Apple, YouTube Movies and other VOD platforms.</p>\n<p>\n\tWatch the trailer for “The Christmas Writer” below.</p>\n<figure><p>\n<iframe width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/4SyDJ4BOU3E?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\"></iframe>\n</p></figure>\n\t<h2>\n\t\tMonday, October 6\t</h2>\n<p>\n\t<strong>Academy of Motion Pictures Arts and Sciences Reveals 2025 Student Academy Awards Placements</strong></p>\n<p>\n\tThe Academy of Motion Picture Arts and Sciences have unveiled the recipients of this year’s Gold, Silver and Bronze placements and universities around the world at the 52nd Student Academy Awards ceremony. The recipients were chosen from 3,127 entries from 988 colleges and universities worldwide.\n\t</p>\n<p>\n\tThe Student Academy Award placements for 2025 include:</p>\n<p>\n\t<strong>Alternative/Experimental</strong></p>\n<p>\n\tGold: Xindi Zhang, “The Song of Drifters,” University of Southern California</p>\n<p>\n\tSilver: Vega Moltke-Leth, “Without Perfection,” University of Copenhagen, Denmark</p>\n<p>\n\tBronze: Mati Granica, “flower_gan,” London College of Communication, United Kingdom</p>\n<p>\n\t<strong>Animation</strong></p>\n<p>\n\tGold: Tobias Eckerlin, “A Sparrow’s Song,” Film Academy Baden-Württemberg, Germany</p>\n<p>\n\tSilver: Lucas Ansel, “The 12 Inch Pianist,” Rhode Island School of Design </p>\n<p>\n\tBronze: Sofiia Chuikovska, Loïck du Plessis D’Argentré & Maud Le Bras, “The Shyness of Trees,” Gobelins, France</p>\n<p>\n\t<strong>Documentary</strong></p>\n<p>\n\tGold: Tatiana McCabe, “Tides of Life,” University of the West of England Bristol, United Kingdom</p>\n<p>\n\tSilver: Rebeka Bizubová, “Confession,” Academy of Performing Arts in Bratislava, Slovakia</p>\n<p>\n\tBronze: Jane Deng, “I Remember,” New York University </p>\n<p>\n\t<strong>Narrative</strong></p>\n<p>\n\tGold: Jan Saczek, “Dad’s Not Home,” Krzysztof Kieślowski Film School, Poland</p>\n<p>\n\tSilver: Meyer Levinson-Blount, “Butcher’s Stain,” Tel Aviv University, Israel</p>\n<p>\n\tBronze: ZEFAN, “Kubrick, Like I Love You,” Columbia University</p>\n<p>\n\tThe Student Academy Award-winning films are now eligible to compete for the 98th Oscars in the Animated Short Film, Live Action Short Film or Documentary Short Film categories. </p>\n</div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cinema United Elects Harkins Theatres’ Mike Bowers as New Chair – Film News in Brief",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/Mike-Bowers-Headshot.jpeg?crop=225px%2C0px%2C815px%2C458px&resize=1000%2C563"
      ],
      "datePublished": "2025-10-09T23:43:16.000Z",
      "dateModified": "2025-10-09T23:43:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘9-1-1: Nashville’ Delivers a Thrilling Country Hunk Spinoff That’s as Absurd as Franchise Fans Will Expect: TV Review",
    "url": "https://variety.com/2025/tv/reviews/9-1-1-nashville-review-abc-1236544760/",
    "image": "https://variety.com/wp-content/uploads/2025/10/9-1-1-Nashville.1.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-10T03:01:47.000Z",
    "description": "<div><p>\n\t<strong>SPOILER ALERT:</strong> <em>This review contains spoilers for the series premiere of “<a target=\"_blank\" href=\"https://variety.com/t",
    "body": "<div><p>\n\t<strong>SPOILER ALERT:</strong> <em>This review contains spoilers for the series premiere of “<a target=\"_blank\" href=\"https://variety.com/t/9-1-1-nashville/\">9-1-1: Nashville</a>.”</em></p>\n<p>\n\tFollowing the shocking cancellation of “9-1-1: Lone Star” and the death of Robert “Bobby” Nash (Peter Krause) in the original “9-1-1,” <a target=\"_blank\" href=\"https://variety.com/t/ryan-murphy/\">Ryan Murphy</a>, Brad Falchuk and Tim Minear are now expanding their first responder series with a brand new spinoff, “9-1-1: Nashville.” Like its predecessor, the show follows a motley crew of firefighters, paramedics and police officers as they tend to emergencies and navigate the struggles and triumphs of their eclectic personal lives. Like the previous iterations, “9-1-1: Nashville” opens in a swirl of chaos and crisis, proving that, despite being set in a new location and boasting a brand-new cast, the audience can expect the same sort of delicious drama. \n\t</p>\n<p>\n\t“9-1-1: Nashville” begins at a music festival. Fans dressed in Western gear eagerly crowd around a stage as the headliner begins. A producer is uneasy about the pyrotechnics around heavy winds, but everything seems to be going well — until she notices a tornado in the background. Almost as suddenly as the whirlwind appears, the entire platform collapses in a fury of flames and chaos. \n</p>\n<p>\n\tAs intense as this opening is, the core of the series revolves around Captain Don Hart (Chris O’Donnell), a firehouse chief who shares his love of firefighting and bull riding with his son, Lt. Ryan Hart (Michael Provost). Rounding out the firehouse 113 are Taylor Thompson (Hailey Kilgore), whose true loves are singing and songwriting, and Roxie Alba (Juani Feliz), an adrenaline-obsessed physician who now works as a paramedic. All of the insane cases in Nashville come through 911 dispatcher Cammie Raleigh (Kimberly Williams-Paisley), who also has a significant interest in music.  \n\t</p>\n<p>\n\tThere are disasters aplenty in the pilot. In addition to the exploding festival stage, there’s a drunken bachelorette wreck, plus a jaw-dropping boy-with-the-red-balloon moment involving a little girl and a kite. But the core of the new show is a significant fracture in the Hart family. A long-held secret comes to light, rattling Ryan and altering his and Don’s close bond. At one point in the episode, Ryan even jokes to his father and mother, Bythe (Jessica Capshaw), saying, “It’s a miracle I’m not in therapy.” This won’t be the case for long. Along with the newfound family drama, Ryan and his ER doctor wife, Samantha (MacKenzie Porter), aren’t exactly on good terms. (In fact, she doesn’t even appear in the pilot.)</p>\n<p>\n\tOther intriguing characters include Dixie Bennings (LeAnn Rimes), a bitter former singer determined to use her son, Blue (Hunter McVey), to exact revenge on her old lover. While the show’s core narrative isn’t exactly groundbreaking, the exaggerated, intense and fast-paced emergencies, along with the engaging plot turns, will undoubtedly draw in audiences. This new Tennessee-set chapter hits the ground running and will certainly unfold and evolve in unexpected ways.</p>\n<p>\n\tMore than anything, even amid the silliness and absurdities of the medical emergencies, the show’s feel-good moments, which involve people being saved and others working together, depict a deep humanity. However fictitious, these uplifting moments are currently missing from our real-life news cycle. Despite the soapier qualities of “9-1-1: Nashville,” this particular element, along with rather thrilling cliffhangers, is the reason why “9-1-1” viewers have stood by the franchise for nearly a decade.</p>\n<p>\n\tOverall, “9-1-1: Nashville” delivers exactly what fans of the franchise are looking for, but with a bit of country flair and some new hunky characters. While they may be disappointed that Captain Owen Strand (Rob Lowe) is no longer gracing their screens weekly, given the opportunity, the “Nashville” cast seems more than capable of filling in the gap. It’s going to be interesting to see what kind of unimaginable (and frankly unbelievable) crises this new series will contend with.</p>\n<p>\n\t“<em>9-1-1: Nashville” premiered Oct. 9 on ABC with new episodes airing weekly on Thursdays.</em><br /></p>\n</div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘9-1-1: Nashville’ Delivers a Thrilling Country Hunk Spinoff That’s as Absurd as Franchise Fans Will Expect: TV Review",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/9-1-1-Nashville.1.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-10T03:01:47.000Z",
      "dateModified": "2025-10-10T03:01:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘A Simple Soldier’ Review: A Startling and Personal Ground’s-Eye-View of the War in Ukraine",
    "url": "https://variety.com/2025/film/reviews/a-simple-soldier-review-ukraine-1236544297/",
    "image": "https://variety.com/wp-content/uploads/2025/10/A_Simple_Soldier_still_hero.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-10T02:29:24.000Z",
    "description": "<div><p>\n\t<br /><em>“Should I fight or should I film?”</em> No, that’s not a Clash outtake. It’s what Artem Ryzhykov asked himself as he observed the ",
    "body": "<div><p>\n\t<br /><em>“Should I fight or should I film?”</em> No, that’s not a Clash outtake. It’s what Artem Ryzhykov asked himself as he observed the Maidan Revolution in Kyiv in 2014 — a protest that sprawled over several months, as citizens took to the streets to bring down the Russian puppet leader President Yanukovych, in an uprising that presaged the war that has now engulfed Ukraine. The protest began with a surge of hope and fervor and ended in a bloodbath; Ryzhykov himself got hit by a pair of bullets (we hear the two shots as he’s filming). “My camera was blown to pieces,” he says. The Maidan Revolution succeeded in hounding the president out of office, but Russia responded by invading Crimea.\n\t</p>\n<p>\n\tWhen the current war began, with Vladimir Putin launching his invasion on Feb. 24, 2022, Ryzhykov made a decision: He would fight <em>and </em>he would film. He became a filmmaker soldier, steeped in the trenches but relentlessly holding his camera, carving out the existential historical record of what went on.\n</p>\n<p>\n\tWatching “<a target=\"_blank\" href=\"https://variety.com/t/a-simple-soldier/\">A Simple Soldier</a>,” we can’t help but ask: Is Artem Ryzhykov, talking to us from behind his camera, a kind of semi-invisible semi-narcissist, an ardent but facile verité documentarian? Or does he use his point-of-view to haunt and lift the images? I think it’s the latter, with perhaps a hint of the former. Yet the images in “A Simple Soldier” are open-eyed, harrowing, indelible. We’re right there, in the middle of the chaos and the national breakdown. The film, co-directed by Ryzhykov and the Columbian-German documentary filmmaker Juan Camilo Cruz, colors in everything we’ve heard and read and seen about the war in Ukraine in the way that <a target=\"_blank\" href=\"https://variety.com/2023/film/reviews/20-days-in-mariupol-review-1235495820/\">“20 Days in Mariupol”</a> did, only this one captures a slice of war that’s almost more vividly ordinary.\n\t</p>\n<p>\n\tWe meet Artem’s wife, Ira, just after the two have gotten together, as he introduces her to his parents (mother whispering ecstatically toward the camera she thinks is off: <em>“Where did you find her?”</em>). Eight years later, just weeks before the Russian invasion, 150,000 Russian troops amass, and the two are driving along a road, the lights on the side of the road blinking on and off. Artem says that it’s like a movie, and Ina observes, “It’s on the verge of both horror and romance.” That’s exactly right.</p>\n<p>\n\tIt may sound naive to say that there’s a “romance” to war, but it’s certainly not wrong to say that war can draw people closer. And in “A Simple Soldier,” we see war draw the citizens of Ukraine closer. The film has its eye on Territorial Defense, which means that the soldiers in training we’re watching are civilians. (“On Saturdays we wear our uniforms and become soldiers.”) Eligibility for the draft is ages 18-60. Artem, very Slavic looking, with longish blondish hair, says that in his whole life he never touched a gun, and that he made a promise to himself: His camera would be his weapon. And it will be. (But his gun will be too.)</p>\n<p>\n\tThe film’s raw chapters have titles like “Irpin, Day 19” (Irpin is a city in northern Ukraine). There is ordinary life: a soccer game. And there is ordinary horror: a dead dog, blood dripping from its mouth. We see charred and mangled lower body parts in an area dotted with land mines. A soldier gripes that Artem is endangering other men with his camera, and tells him to get the fuck out.</p>\n<p>\n\t“Khariv, Day 72.” Artem has chosen to be a drone pilot, because he thinks they can win the air war, and also because the skill set required rhymes with his skills as a cinematographer. He’s spying from the air, he’s observing, he’s <em>filming</em>. A woman in his back seat cries, “Poor Khariv, what a beautiful city it was.” We look at the semi-ruins and try to imagine the city she’s talking about. Artem’s father dies, because he was ill and the local hospital was bombed. That’s what this war does.</p>\n<p>\n\tThe most haunting comment in “A Simple Soldier” may be from a woman named Marta, who says, “It’s absurd, this war. It’s complete nonsense. I still can’t grasp that we’re in the midst of it. I don’t know why we were torn out of ordinary life. None of us have a spare life.” And that’s the film’s wrenching upshot. We’re watching a cinematographer turned soldier turned filmmaker who is really a citizen recording a life that’s been subsumed in the totality of war. Near the end, at the wheel of his car, Artem lets out a scream. It’s like hearing the inner anguish of Ukraine, a nation that has been torn out of the very life it’s fighting for.</p>\n</div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘A Simple Soldier’ Review: A Startling and Personal Ground’s-Eye-View of the War in Ukraine",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/A_Simple_Soldier_still_hero.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-10T02:29:24.000Z",
      "dateModified": "2025-10-10T02:29:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "New ‘Invincible’ Video Game Adds Fan-Favorite Character Cecil Stedman to Fighting Lineup (Gaming News Roundup)",
    "url": "https://variety.com/2025/gaming/news/invincible-video-game-cecil-gaming-news-roundup-1236544610/",
    "image": "https://variety.com/wp-content/uploads/2025/10/Invincible-Video-Game.png?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-09T23:23:24.000Z",
    "description": "<div><p>\n\tNew updates have been revealed about Skybound Entertainment’s upcoming video game “<a target=\"_blank\" href=\"https://variety.com/t/invincible",
    "body": "<div><p>\n\tNew updates have been revealed about Skybound Entertainment’s upcoming video game “<a target=\"_blank\" href=\"https://variety.com/t/invincible/\">Invincible</a> VS,” including the addition of Cecil Stedman, a fan-favorite character from Robert Kirkman’s comics and “Invincible” TV series at Amazon, to the 3v3 tag fighting game.</p>\n<p>\n\tTo date, “<a target=\"_blank\" href=\"https://variety.com/t/invincible-vs/\">Invincible VS</a>” has now revealed eight characters that will be included in the fighter: Mark Grayson (Invincible), Atom Eve, Bulletproof, Thula, Rex Splode, Battle Beast, Omni-Man and Cecil.\n\t</p>\n<p>\n\tPer the description from Skybound Entertainment and Quarter Up, “A fan-favorite from the ‘Invincible’ TV series and comic books, Cecil has been one of the most requested playable characters. Most often heard as a voice in Mark’s earpiece, Cecil enters the fight in Invincible VS with specialized weapons, including plasma pistols, projectile launchers and grenades to keep opponents at a distance. His ranged gameplay style is paired with tactical combat, allowing him to play cat and mouse with enemies. Want more? Cecil can also summon a limitless supply of Reanimen for backup; with access to The Hammer – a massive orbital laser – he is a devastating force on the battlefield.”\n</p>\n<p>\n\tAdditionally, the “Invincible VS” devs and Kirkman revealed new details about the game’s story mode Thursday, which “plays like a special extended episode of the show, featuring every announced playable character so far – and teases the arrival of a brand-new character who hasn’t yet appeared anywhere in the Invincible Universe.”</p>\n<p>\n\t“I’m very involved in the game, but one of the great things about this team is that they are constantly impressing me with the little factoids that they’re working into the game and the details and the balance and everything makes sense,” Kirkman told <em>Variety</em> in a Sept. 30 interview tied to the Cecil news. “This game is being made by fans of the ‘Invincible’ series and fans of the ‘Invincible’ comic books to the point where they’re sometimes reminding me of things that I have forgotten, which is not something I’m proud of, but it does happen.”\n\t</p>\n<p>\n\t“Invincible VS” is set to launch in 2026 on Xbox Series X and S, PlayStation 5 and PC.</p>\n<p>\n\tWatch the new trailer for “Invincible VS” in the video below.</p>\n<p>\n\tyoutube.com/watch?v=nKYAyVmdqkM&feature=youtu.be</p>\n<p>\n\tSee more gaming news from this week in the roundup below.</p>\n\t<h2>\n\t\tNEWLY ANNOUNCED GAMES\t</h2>\n<p>\n\tNetflix has unveiled a new slate of party games to be played on TV screens — with your phone as your controller — that will be coming to the service this holiday season.</p>\n<p>\n\t“We’re creating a completely new way to play games — one that’s as easy as streaming a show on a Friday night,” per Netflix’s announcement. “All you’ll need is Netflix and your phone to experience a whole new level of fun on Netflix with instantly recognizable games like ‘LEGO Party!,’ ‘Pictionary: Game Night,’ ‘Boggle Party,’ ‘Tetris Time Warp,’ and a fresh take on the social deduction genre ‘Party Crashers: Fool Your Friends.'”</p>\n<p>\n\tSee full descriptions for the upcoming titles below.</p>\n<div>\n<ul>\n<li><strong><em>LEGO® Party!</em></strong> – Square off against your friends in the ultimate LEGO party game. Compete in hilarious minigames and hunt for gold through themed Challenge Zones.</li>\n<li><strong><em>Boggle Party</em></strong> – Race against the clock to find words (the longer, the better) in a jumbled-up letter grid. Play solo or make it a party with up to eight players.</li>\n<li><strong><em>Pictionary: Game Night</em></strong> – Draw ’til you drop — or one of your friends guesses what you’re sketching — in this hilarious and fast-paced spin on Mattel’s classic group game.</li>\n<li><strong><em>Tetris Time Warp</em></strong> – Time-travel with friends to different eras of Tetris, from the 1984 original to the classic Gameboy version. Can you warp your way to a top score?</li>\n<li><strong><em>Party Crashers: Fool Your Friends</em></strong> – One person at this party secretly has no idea what everyone else is talking about. Figure out whose clues are fishy to unmask the crasher.</li>\n</ul>\n</div>\n<p>\n\t*</p>\n<p>\n\tMaximum Entertainment has launched Chris Darril’s “Bye Sweet Carole,” in partnership with Italian studio Little Sewing Machine and Meangrip Studios.</p>\n<p>\n\tInspired by hand-drawn animation, the horror adventure game “transports players into a hauntingly beautiful realm where dark fairy tales and nightmarish realities intertwine. Players will follow the story of Lana Benton, a courageous young girl on a desperate search for her missing friend, Carole, in the ominous Bunny Hall orphanage.”</p>\n<p>\n\tThe game is now available on PlayStation 5, Nintendo Switch, Xbox Series X and PC via Steam. The physical edition releases in the Americas on Oct. 21 and will include a reversible coversheet with alternate artwork, a digital original soundtrack with 27 tracks and a digital art book with exclusive behind-the-scenes elements.\n\t</p>\n<p>\n\t*</p>\n<p>\n\tAmazon Games and Glowmade have launched “King of Meat” on PlayStation 5, Xbox Series X|S and PC via Steam.</p>\n<p>\n\tDeveloped by Glowmade, “King of Meat” is a co-op party platformer, pitting up to 4 players against dungeons filled with puzzles to solve, challenges and monsters to fight. Players will compete in official dungeons, community-built dungeons or be able to unleash their own creativity to build unique and fun dungeons for other players. </p>\n<p>\n\tGame players will get a chance to become the ultimate contender, build for battle as a dungeon creator and customize their gaming experience. Those who purchase and play “King of Meat” before Oct. 31 can receive an exclusive “MrBeast” bundle, which unlocks a set of challenging dungeons. Players who complete all five dungeons can claim an additional rare “MrBeast” costume. </p>\n<p>\n\tAspiring contenders can purchase the “King of Meat: Standard Edition” for $29.99, which includes the venerable defender costume, a samurai-style outfit with a matching sword, shield and stickers. </p>\n<p>\n\tPlayers also have the option of buying the “King of Meat: Deluxe Edition” for $49.99, which also includes the Tapeboard Betsy and Emerson Shard character sets.</p>\n<p>\n\t*</p>\n<p>\n\tGameberry Labs has released “Sorry! World,” the first-ever stand-alone mobile app for the classic board game “Sorry!”</p>\n<p>\n\tThe mobile app is currently available on the Apple App Store and Google Play Store as a free-to-play experience that reimagines the classic board game.</p>\n<p>\n\t“Sorry! World” adds animations and fast-paced matches that add an extra layer of energetic and social gameplay. Players can choose quirky characters, build towns, climb ranks, block rival and compete in league play.</p>\n<p>\n\tThe launch of “Sorry! World” marks a new milestone among Gameberry Labs and the “Sorry!” franchise as it merges the beloved game with technology, allowing people to come together through shared play.</p>\n\t<h2>\n\t\tGAME UPDATES/DLC\t</h2>\n<p>\n\tA new lineup of seasonal fashion is now available for Sims in the “The Sims 4” Autumn Apparel Kit for the EA app, Epic Games Store and Steam, PlayStation5, PlayStation4, Xbox Series XS and Xbox One.\n\t</p>\n<p>\n\tThe lineup features a selection of cardigans, sweaters, boots, beanies jackets and more. Players can dress their Sims as cozy and warm, or festively spooky for the Fall season onward.</p>\n\t<h2>\n\t\tIN-GAME EVENTS\t</h2>\n<p>\n\tEpic Games announced Thursday that for its in-game “Fortnite” event “Fortnitemares 2025,” the game will be collaborating with singer Doja Cat as its “Mother of Thorns” who will be “twisting Battle Royale into her haunted kingdom and unleashing chaos with VIPs of fright, including Jason, Ghostface, R.E.P.O. and more to come.”  </p>\n<p>\n\tThe in-game event, which will be available in “Fortnite” from now until Nov. 1, will feature nine new collaborations, including Wednesday Addams and Scooby-Doo and the Mystery Gang.</p>\n<p>\n\t*</p>\n<p>\n\t“Call of Duty: Black Ops 6” and “Call of Duty: Warzone” have introduced Season 6 of The Haunting: an in-game seasonal event that brings festive Halloween-themed maps, variations and gameplay to the franchise. </p>\n<p>\n\tThis season, “Black Ops 6” players will experience three new spooky maps, a Halloween decorated rendition of Nuketown, a Slasher Deathmatch mode featuring Chucky from “Child’s Play” and Jason from “Friday the 13th” and a version of ranked play that offers seasonal rewards.</p>\n<p>\n\t“Warzone” players will find festive variations of the Verdansk and Rebirth Island maps, the return of Zombie Royale mode where slain operatives join the army of the undead and more ranked play options.</p>\n<p>\n\tMeanwhile, The Haunting will offer New Haunted Havoc LTM Zombie gameplay, featuring pumpkin-headed zombies and jack-o-lantern-shaped specials and new leaderboard specials. Players across all games will also experience festive weapons details, events, rewards, skins, moves, and survivor modes against the Predator through the Haunting’s Battle Pass and BlackCell modes.</p>\n<p>\n\t*</p>\n<p>\n\t“World of Tanks Blitz” has partnered with “The Walking Dead” for gameplay inspired by the hit AMC zombie series from Oct. 9 – Oct. 20.</p>\n<p>\n\tThe crossover “All Out War” event will feature an apocalyptic battlefield, opportunities to team up with the show’s Daryl Dixon in the hunt for walkers and the “We Are All Negan” quest featuring the show’s brutal survivalist, Negan Smith. The crossover also offers rewards inspired by the show, including a Herdbreaker tank designed for the zombie apocalypse, Georgia Tracker camouflage for the T32 tank, Lucille’s Grin camouflage for the M48 Patton tank, special collectables from Daryl’s crossbow to his motorcycle and the grand prize of a Tier VIII Biter tank for those who survive the “Rotting Bay” event.</p>\n<p>\n\tThe undead will flood the battlefield and man tanks in a chaotic showing of action, as players must fight to survive.\n\t</p>\n<p>\n\tPlayers who logs in between Oct. 9 and Oct. 16 will also be granted 15 days of Premium Account for free. <br /></p>\n\t<h2>\n\t\tNew Platform Launches\t</h2>\n<p>\n\t“MySims” and “MySims Kingdom” will become available on Apple Arcade starting Nov. 6.</p>\n<p>\n\tApple users will now be able to revisit the 2007 and 2008 titles on their devices, meeting up with their favorite characters from Chef Gino to King Roland, looking for hidden treasure, decorating the bubbly world and embarking on wholesome adventures as their uniquely plushy Sims. </p>\n</div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "New ‘Invincible’ Video Game Adds Fan-Favorite Character Cecil Stedman to Fighting Lineup (Gaming News Roundup)",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/Invincible-Video-Game.png?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-09T23:23:24.000Z",
      "dateModified": "2025-10-09T23:23:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘The Woman in Cabin 10’ Review: Keira Knightley Sets Course for Agatha Christie-Inspired Intrigue in Netflix’s Thriller Drowning in Contrivance",
    "url": "https://variety.com/2025/film/reviews/the-woman-in-cabin-10-review-keira-knightley-1236544552/",
    "image": "https://variety.com/wp-content/uploads/2025/10/Woman-In-Cabin-10-B.jpg?crop=0px%2C44px%2C2997px%2C1687px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-10-09T23:22:21.000Z",
    "description": "<div><p>\n\tSimilar to its book-to-film predecessors “The Girl on the Train” and “The Woman in the Window,” “<a target=\"_blank\" href=\"https://variety.co",
    "body": "<div><p>\n\tSimilar to its book-to-film predecessors “The Girl on the Train” and “The Woman in the Window,” “<a target=\"_blank\" href=\"https://variety.com/t/the-woman-in-cabin-10/\">The Woman in Cabin 10</a>” also features a gaslit woman who’s forced to solve a mystery on her own after witnessing a suspicious incident. And much like the aforementioned beach-reads-turned-Hollywood-thrillers, director-co-writer <a target=\"_blank\" href=\"https://variety.com/t/simon-stone/\">Simon Stone</a>’s adaptation for <a target=\"_blank\" href=\"https://variety.com/t/netflix/\">Netflix</a> also suffers from major missteps by the mid-point, causing any tension to dissipate long before the already-brief run time is up. Still, the sleek production design, symphonic score and performances from a killer ensemble act as a life preserver, making the shenanigans at sea a little less choppy.\n\t</p>\n<p>\n\tAward-winning investigative journalist Laura “Lo” Blacklock (<a target=\"_blank\" href=\"https://variety.com/t/keira-knightley/\">Keira Knightley</a>) has recently returned to work after a young female source turned up dead. Hoping to distance herself from the grief and guilt, the workaholic petitions her editor (Gugu Mbatha-Raw) to be assigned to a lighter beat, reporting on the maiden voyage of the luxury yacht the Aurora Borealis. The charity affair sailing to Norway is hosted by terminally ill shipping heiress Anne Bullmer (Lisa Loven Kongsli) and her husband Richard (Guy Pearce), benefitting their foundation. Aboard, Laura learns not only that her photographer ex-boyfriend Ben Morgan (David Ajala) is working the event, but also that Anne personally invited her on this excursion. She’s asking for Lo’s assistance in announcing the news that she’s giving away her entire fortune at the end-of-the-line gala in a few days.\n</p>\n<p>\n\tPlans for a relaxing vacation take a turn in the wee hours of their first morning. Lo overhears a scuffle in the cabin next door and a distinct splash in the freezing ocean waters. She believes it’s the nervous woman she briefly bumped into the evening prior. However, after reporting the incident, she’s informed that cabin is vacant. Lo’s attention turns to the guests and staff on the high-tech ship as she tries to figure out the identity of that squirrelly, bedraggled blonde she saw. This includes aging rock star Danny (Paul Kaye), Dame Heidi Heatherly (Hannah Waddingham) and her husband Thomas (David Morrissey), influencer Grace Phillips (Kaya Scodelario), tech magnate Lars Jensen (Christopher Rygh), playboy Adam Sutherland (Daniel Ings) and Anne’s personal doctor Dr. Mehta (Art Malik). As Lo gets closer to the truth, the danger increases as it becomes clear someone wants her dead.\n\t</p>\n<p>\n\tStone and adapting co-writers Joe Shrapnel and Anna Waterhouse (all of whom work from Emma Frost’s adaptation of Ruth Ware’s novel) find it impossible to shake the source material’s inauspicious beginnings, reading as a publisher’s bottom tier “Gone Girl” hopeful and a waterlogged homage to Agatha Christie’s “Death on the Nile.” Even the filmmakers’ Hitchockian influences fail to garner much narrative and thematic weight. That said, production designer Alice Normington gives the aesthetics depth and dimension, from a shell-shaped spiral staircase to the yacht’s curving, reflective surfaces which symbolically mirror these characters’ hidden dualities.</p>\n<p>\n\tThe mystery is less about who’s involved in the game afoot, as alert audiences piecing together context clues will be immediately aware of those nefarious parties upon their introductions, and is more about the puzzling lengths the filmmakers go to in planting contrived red herrings. Discussion of a possible stowaway happens after we already know there is one – single mother Carrie (Gitte Witt). Suspects’ motivations change with little rationale. Heidi, Thomas, Lars and the Bullmer’s head of security Sigrid (Amanda Collin) don’t trust Lo’s sanity, until they magically do in a hacky “let’s hear her out” sequence in the finale. Despite the supporting actors’ deviously delightful depictions of the insufferable nouveau riche, Danny, Grace and Adam offer no motor at all to warrant their inclusion in the line-up, making us wonder if their storylines had been drastically truncated – and, if so, what for.</p>\n<p>\n\tBenjamin Wallfisch’s compositions are struck in the key of intrigue, cradling us in a comforting soundscape before offsetting our footing. Unfortunately, the rest of the craft work is a mixed bag of goods. The film is aggressively teal with a sallow greige (gray-beige) overcast.<strong> </strong>Ben Davis’ cinematography seems like it’s continually fighting to hang on to the light during shooting hours. Perhaps the dimming of the light is a metaphor for Lo’s search in the darkness for the truth, but chances are it’s not considering Stone and company rarely apply any visual dexterity to the proceedings.</p>\n<p>\n\tWhile our heroine is allotted a smartly executed arc and exhibits self-driven change, missing is a sense of fluidity in Stone’s artistry that could’ve cloaked the lackluster hijinks surrounding her. He surprisingly practices restraint, failing to envision Lo’s paranoia, anxiety and unraveling psychosis through energetic editing and camera movements to denote head-spinning perspective shifts or atmospheric pressure drops. Knightley’s percolating performance captures the mounting pressure, yet Stone’s straightforward direction doesn’t do his leading lady many favors. Any insightful commentary on the 1% protecting themselves is rendered rote with a wimpy, ludicrous dénouement. Maybe with a more daring hand on the helm, our voyage wouldn’t have run out of suspense before the conclusion.\n\t</p>\n<p>\n\t<em>“The Woman in Cabin 10” streams on Netflix starting Oct. 10.</em></p>\n</div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘The Woman in Cabin 10’ Review: Keira Knightley Sets Course for Agatha Christie-Inspired Intrigue in Netflix’s Thriller Drowning in Contrivance",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/Woman-In-Cabin-10-B.jpg?crop=0px%2C44px%2C2997px%2C1687px&resize=1000%2C563"
      ],
      "datePublished": "2025-10-09T23:22:21.000Z",
      "dateModified": "2025-10-09T23:22:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Grey’s Anatomy’ Boss on the Season 22 Premiere, How Often Ellen Pompeo Will Be On and Killing [SPOILER] After That OR Explosion",
    "url": "https://variety.com/2025/tv/news/greys-anatomy-killing-monica-beltran-season-22-premiere-1236544690/",
    "image": "https://variety.com/wp-content/uploads/2025/10/Greys-Anatomy-Season22premiere-MAIN.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-10T03:00:00.000Z",
    "description": "<div><p>\n\t<strong>SPOILER ALERT:</strong> <em>This interview contains major spoilers from “Only the Strong Survive,” the Season 22 premiere of “Grey’s",
    "body": "<div><p>\n\t<strong>SPOILER ALERT:</strong> <em>This interview contains major spoilers from “Only the Strong Survive,” the Season 22 premiere of “Grey’s Anatomy.”</em></p>\n<p>\n\tDeath strikes at Grey Sloan Memorial Hospital once again. </p>\n<p>\n\tIn May, after she decided to <a target=\"_blank\" href=\"https://variety.com/2025/tv/news/greys-anatomy-season-21-finale-who-will-die-explosion-1236398179/\">blow up the hospital’s OR floor <em>again</em></a> in the final moments of the Season 21 finale, “Grey’s Anatomy” showrunner <a target=\"_blank\" href=\"https://variety.com/t/meg-marinis/\">Meg Marinis</a> said that every character — other than protagonist Meredith Grey (Ellen Pompeo) and Ben Warren (Jason Winston George) — could potentially be on the chopping block.\n\t</p>\n<p>\n\tHeading into the 22nd season’s Oct. 9 premiere, which picks up in the immediate aftermath of that explosion, eagle-eyed viewers waited with bated breath as they pored over photos and teasers from the new season to see which characters they could safely rule out from the death count. There were a few doctors, however, who were suspiciously MIA: Dr. Atticus “Link” Lincoln (Chris Carmack), who had just gotten married to and was expecting twins with Dr. Jo Wilson (Camilla Luddington); Dr. Jules Millin (Adelaide Kane) and Dr. Monica Beltran (Natalie Morales), who were operating on a young patient; and Dr. Lucas Adams (Niko Terho), who was on his way to inform Dr. Richard Webber (James Pickens Jr.) about the presence of flammable gas on the OR floor.\n</p>\n<p>\n\t“When you sit down to tell a story, you think about everybody who we saw that was in danger, and you go through the chain reactions if you did kill that character off, and who that would affect, and how that would help or derail the next season for us,” Marinis tells <em>Variety</em>. “Obviously, I didn’t want to kill anybody. It’s not a fun thing to do. It’s just sometimes where the story leads. Those decisions are extremely difficult. They’re painful because not only do you love the character, but you love working with the actor. It could have been any of the people that were on that floor — we had discussions about everybody.”\n\t</p>\n<p>\n\tThe jam-packed premiere follows three main storylines. Meredith opens up the clinic next to the hospital and, with the help of Dr. Simone Griffth (Alexis Floyd) and a new class of interns, treats patients, including an intern who has been injured in the blast. After being unable to move an operating light that had fallen on her pelvis, Beltran walks Millin through the rest of the pediatric surgery. Ben, his wife Dr. Miranda Bailey (Chandra Wilson), Dr. Winston Ndugu (Anthony Hill), Dr. Owen Hunt (Kevin McKidd) and Dr. Teddy Altman (Kim Raver) work together to save Link, who has been crushed underneath a piece of the ceiling.</p>\n<div>\n<figure>\n<p><img srcset=\"https://variety.com/wp-content/uploads/2024/08/GreysAnatomy-NatalieMorales.jpg 1200w, https://variety.com/wp-content/uploads/2024/08/GreysAnatomy-NatalieMorales.jpg?resize=150,120 150w, https://variety.com/wp-content/uploads/2024/08/GreysAnatomy-NatalieMorales.jpg?resize=300,240 300w\" src=\"https://variety.com/wp-content/uploads/2024/08/GreysAnatomy-NatalieMorales.jpg?w=1024\" alt=\"\" />\n\t</p>\n<figcaption>\n\t\t\t\t\t<span>Beltran (Natalie Morales) in better days.</span>\n\t\t\t\t\t\t\t\t\tCourtesy of ABC\n\t</figcaption>\n</figure>\n</div>\n<p>\n\tIn the end, Marinis decided to kill off Beltran, who dies of internal bleeding due to her injuries. “I made the decision on Monica as I was sitting down to write those OR scenes between her and Jules,” explains Marinis, who had yet to kill off a doctor since stepping into the role of showrunner in Season 20. “I always knew that I wanted her to guide Jules through a surgery. But as the scenes started to be written, it became clearer and clearer that that was the way the story wanted to go.”</p>\n<p>\n\tIn the conversation below, Marinis elaborates on her decision to kill off Beltran and how that character’s death will have lasting effects on Millin, Dr. Amelia Shepherd (Caterina Scorsone) and even Link; how involved Meredith will be in the rebuilding of her home base after she had just committed to returning to Grey Sloan on a more regular basis; what she has in store for the rest of her very large ensemble cast — and what to expect from the show’s landmark 450th episode (which airs on Oct. 16).</p>\n\t<h5>\n\t\tHow did Natalie Morales react to the news that you were killing Beltran off, and what kinds of conversations did you have with her about crafting her character’s final scenes in the premiere?\t</h5>\n<p>\n\tI had to make a very difficult phone call to her, and she’s an absolute professional though. She’s a writer and director as well as being an actor. She understands story, and she just wanted to make sure that we made it the best story possible. We walked through every scene together. She gave me her notes, and I talked about what I was thinking, when, and where. Those two days were really hard to film, because not only was her performance heartbreaking, but we were all sad to see her go.\n\t</p>\n<p>\n\tI think we wanted to show how amazing of a character that Monica was, how selfless she was, how she died doing what she was called to do in life, which is to be a pediatric surgeon. She was always about the kids. She always put them first, and we’ve shown her and Millin having this dynamic together before in previous episodes where Jules would freeze in an OR on a case, and Monica would have to break her out of that. And this was obviously the ultimate one of those stories. Jules is someone who has historically not been a fan of children, and this, I think, obviously has changed her mind. But also, this is going to have a profound impact on Amelia.</p>\n\t<h5>\n\t\tHow will Beltran’s death affect Millin and Amelia going forward?\t</h5>\n<p>\n\tI think that Jules is going to have a bit of trauma from being in this OR that was obviously destroyed, and being in a stressful situation, but the fact that she witnessed Monica’s last moments — that will definitely be picked up in Episode 2. Also being picked up in Episode 2 is Amelia’s response to this. She feels ultimate guilt for the belief that she could have taken on that [Dylan Gatlin] surgery to begin with, and then having to go back in [for another surgery]. Obviously, she was taken hostage and that’s not her fault, but she’s going to take on a lot of that culpability.</p>\n<div>\n<figure>\n<p><img srcset=\"https://variety.com/wp-content/uploads/2025/10/Greys-Anatomy-Season22premiere-Amelia.jpg 1200w, https://variety.com/wp-content/uploads/2025/10/Greys-Anatomy-Season22premiere-Amelia.jpg?resize=150,120 150w, https://variety.com/wp-content/uploads/2025/10/Greys-Anatomy-Season22premiere-Amelia.jpg?resize=300,240 300w\" src=\"https://variety.com/wp-content/uploads/2025/10/Greys-Anatomy-Season22premiere-Amelia.jpg?w=1024\" alt=\"\" />\n\t</p>\n<figcaption>\n\t\t\t\t\t<span>Caterina Scorsone<br /></span>\n\t\t\t\t\t\t\t\t\tCourtesy of Disney/Anne Marie Fox\n\t</figcaption>\n</figure>\n</div>\n\t<h5>\n\t\tMonica’s untimely demise will likely reignite talks of the infamous “bury your gays” trope, and some viewers who had been rooting for Monica to get together with Amelia will certainly be upset about this outcome. What would you say to fans who are disappointed that you chose to kill off Monica before a potential romance between her and Amelia could have even been explored?\t</h5>\n<p>\n\tObviously, it was not my intent to go into the trope, but I’m aware of it. What I would say is that I didn’t want to lose the character. It’s where the story was going. Unfortunately, that relationship will not pan out, but it will have an effect on Amelia, and we will be honoring the character. Her death is not just over in Episode 1. We’ll also continue to honor that character and honor that community by continuing to have those kinds of relationships depicted on the show.</p>\n\t<h5>\n\t\tLink’s prognosis certainly didn’t look good for most of the episode — he had a penetrating trauma to the chest, a pneumothorax and multiple rib fractures, and he also had to be resuscitated — but he has pulled through. What does his road to recovery look like going forward? Will there be any long-term effects of coming so close to dying?\t</h5>\n<p>\n\tThere absolutely will be both emotional and physical consequences. He is obviously still going to be in the hospital in Episode 2, and we’re going to play the reality of how difficult recovery is with his physical recovery, but also what he went through and the fact that it happened when he was trying to do a knee replacement on someone. He is obviously going to be deeply distressed about the other people that were in that OR. He’s going to be distressed about Monica — why [he survived] and not Monica. That will all be addressed.\n\t</p>\n\t<h5>\n\t\tYou<a target=\"_blank\" href=\"https://variety.com/2025/tv/news/greys-anatomy-season-21-finale-who-will-die-explosion-1236398179/\"> told me at the end of last season</a> that part of the reason Meredith made a new deal with Catherine (Debbie Allen) to spend more time back at Grey Sloan is that you wanted to see her teach and operate more. Meredith ends up operating — albeit in the clinic — on an intern named Dani (Jade Pettyjohn) who suffered a blunt force trauma during the blast. What did you want to accomplish with Meredith’s arc in these first few episodes of the season?\t</h5>\n<p>\n\tThe difference between Meredith and a lot of these characters on the show is that she’s been through multiple hospital catastrophes, so it doesn’t make it less scary, but she has this ability to compartmentalize and just focus on, “Let’s save lives and let’s do what we can.” She knows how to improvise. She knows how to think on her feet. She’s not fazed about having to do a surgery in the reproductive clinic, unlike the residents, and I think she’s not fazed when an intern collapses. She just has seen and been through so much. She is the captain on the ship that you want to be with when you go down.</p>\n<p>\n\tAlso, I wanted to honor a parallel of what happens with this show. So many people have gone to med school because of Meredith Grey, and I wanted to also play that on the show a little bit. I think Dani has known who Meredith Grey is ever since she wanted to be a doctor.</p>\n\t<h5>\n\t\tWill we see more of Dani going forward, or was this really a one-off storyline?\t</h5>\n<p>\n\tYou’ll see her again.</p>\n\t<h5>\n\t\tHow much will we see of Meredith this season? Is Ellen Pompeo still contracted to appear in seven episodes while continuing to do the voiceovers for each episode?\t</h5>\n<p>\n\tYeah, it’ll look similar to what she’s done in the past. We want to have her as much as we can, and we <em>will</em> have her as much as we can. It just depends on the schedule, but we see a lot of her at the beginning of the season.</p>\n\t<h5>\n\t\tHow involved will Meredith be in the rebuilding of the hospital then?\t</h5>\n<p>\n\tShe’ll be pretty involved, I think. Obviously, with the lack of an OR floor, there’s not many working ORs, so there’s fewer surgeries. The second episode talks about how all elective surgeries are canceled, so it’s just really trauma surgeries. But no, she’ll have a big role, and I think Richard is really grateful to have her as his partner in this.\n\t</p>\n\t<h5>\n\t\tScott Speedman’s “RJ Decker” pilot was just ordered to series at ABC, but given that Meredith and Nick are still together, will we be seeing Nick around at all? Have you had discussions with Scott about how he could do both shows?\t</h5>\n<p>\n\tYes, and he will pop up. You’ll see him at the beginning of the season as well. He loves being on the show. I’m thrilled for him. I’m really excited to be able to see him on screen — and not just on “Grey’s Anatomy.” It’s the same family. We’ll try to work out what we can, but I’m just happy for people to get these opportunities. So it’ll just be a scheduling puzzle, but they’re going to send me the schedule, and we’ll do what we can because we still want to see him on the show.</p>\n\t<h5>\n\t\tAt the end of the premiere, as they stare at the debris from the explosion on the OR floor, Meredith tells Richard that they’re going to do what they always do: rebuild. Would you say “rebuilding” is the overarching theme of the season?\t</h5>\n<p>\n\tThere’s definitely a theme of rebuilding. There’s also a theme of hope — when it’s all gone, who helps you find it? And what keeps you having it?</p>\n<div>\n<figure>\n<p><img srcset=\"https://variety.com/wp-content/uploads/2025/10/Greys-Anatomy-Season22premiere-Simone.jpg 1200w, https://variety.com/wp-content/uploads/2025/10/Greys-Anatomy-Season22premiere-Simone.jpg?resize=150,120 150w, https://variety.com/wp-content/uploads/2025/10/Greys-Anatomy-Season22premiere-Simone.jpg?resize=300,240 300w\" src=\"https://variety.com/wp-content/uploads/2025/10/Greys-Anatomy-Season22premiere-Simone.jpg?w=1024\" alt=\"\" />\n\t</p>\n<figcaption>\n\t\t\t\t\t<span>Alexis Floyd </span>\n\t\t\t\t\t\t\t\t\tCourtesy of Disney/Anne Marie Fox\n\t</figcaption>\n</figure>\n</div>\n\t<h5>\n\t\tMeredith seemed to be too focused on Dani to notice, but Simone ends up working with Dr. Wes Bryant (Trevor Jackson), the surgical intern that she hooked up with at Joe’s Bar while she was technically on a break from Lucas. Simone finally tells Lucas that she slept with someone else at the end of the episode. How will Lucas handle that news, and how will their dynamic shift again this season with all of them now working at the same hospital?\t</h5>\n<p>\n\tWell, he doesn’t know who it is yet, so that information still needs to play out — and it will. I think we decided to have her blurt out and tell him in this episode because she feels like it’s the only thing that will make him listen to her saying, “We shouldn’t get back together.” She doesn’t want to be dishonest with him and get back together with this hanging in the balance. I think she’s also a little confused about the day that she’s just spent with this [new] guy. She clearly has an attraction to him, as much as she wants to deny it, and I think she’s enough of a good person that she’s like, “I can’t get back together with Lucas if this exists and I’m going to be seeing this person in the hospital.” That isn’t to say that she wants to be with Wes. She definitely doesn’t want to be with Wes. She wants to tamp those feelings down, but I think she’s trying to be fair — and it will only get messier!\n\t</p>\n\t<h5>\n\t\tTeddy is still reeling in some ways from her decision to separate from Owen at the end of last season, and she admits that she doesn’t know what the future will hold for them. What can you say about what is ahead for her either personally or professionally?\t</h5>\n<p>\n\tI think she’s going to be <em>very</em> overwhelmed as chief, and we’re going to pick that story up in Episode 2. She was a surgeon in the military — she was a trauma surgeon — so she should be used to this kind of thing, this hospital disaster. I think because she’s been a suit for so long, she’s kind of forgotten the type of doctor and person that she used to be, and she recognizes that when she sees Ben, and she has realized maybe she’s made a mistake [firing him], because he’s only doing what she used to do. I’m really interested in seeing that side of Teddy again, bringing back that trauma surgeon version of Teddy.</p>\n\t<h5>\n\t\tAfter working together to save Link, Teddy has a change of heart about Ben and allows him to complete his residency at Grey Sloan. What’s ahead for Ben this season?\t</h5>\n<p>\n\tWe are going to tell fewer stories of Ben being behind and more stories of him coming into his own, being a leader — and Bailey recognizing that, as well as [him getting] the respect that he deserves from other people.</p>\n<div>\n<figure>\n<p><img srcset=\"https://variety.com/wp-content/uploads/2025/10/Greys-Anatomy-Season22premiere-AnthonyHill.jpg 1200w, https://variety.com/wp-content/uploads/2025/10/Greys-Anatomy-Season22premiere-AnthonyHill.jpg?resize=150,100 150w, https://variety.com/wp-content/uploads/2025/10/Greys-Anatomy-Season22premiere-AnthonyHill.jpg?resize=300,200 300w, https://variety.com/wp-content/uploads/2025/10/Greys-Anatomy-Season22premiere-AnthonyHill.jpg?resize=1000,667 1000w, https://variety.com/wp-content/uploads/2025/10/Greys-Anatomy-Season22premiere-AnthonyHill.jpg?resize=910,607 910w, https://variety.com/wp-content/uploads/2025/10/Greys-Anatomy-Season22premiere-AnthonyHill.jpg?resize=681,454 681w, https://variety.com/wp-content/uploads/2025/10/Greys-Anatomy-Season22premiere-AnthonyHill.jpg?resize=450,300 450w, https://variety.com/wp-content/uploads/2025/10/Greys-Anatomy-Season22premiere-AnthonyHill.jpg?resize=250,167 250w\" src=\"https://variety.com/wp-content/uploads/2025/10/Greys-Anatomy-Season22premiere-AnthonyHill.jpg?w=1024\" alt=\"\" />\n\t</p>\n<figcaption>\n\t\t\t\t\t<span>Anthony Hill</span>\n\t\t\t\t\t\t\t\t\tCourtesy of Disney/Anne Marie Fox\n\t</figcaption>\n</figure>\n</div>\n\t<h5>\n\t\tWinston is given the difficult job of having to comfort Jules and break the news to Amelia about Beltran’s death. What’s ahead for him?\t</h5>\n<p>\n\tHis career is going to be on the rise a little bit because he just did this amazing thing with Teddy, so they’re going to get recognition for that, and we’ll see him continue to challenge himself with difficult cases and surgeries. For the Jules dynamic, he’s a standup guy at work. He’s not going to actively pursue something that could be inappropriate, but those feelings don’t just go away, obviously. I think it’s going to be interesting to see her side of it, because we really played his side of it at the end of last season, so now we’ll be looking at hers.</p>\n\t<h5>\n\t\tThe 450th is your first milestone episode as showrunner. The synopsis teases that “Meredith spends time with Amelia.” What can you preview about that hour?\t</h5>\n<p>\n\tThat sisterhood relationship is very important on the show. Sisterhood has been a very consistent theme for our show for 22 years. The 450th is a perfect blend of nostalgia, but it also has high stakes with some medicine, and you’re going to see things that we’ve seen before but done in different ways. I really believe it’s a celebration of the show. It honors the show, but it still has its place, in that it’s the second episode of this season, so it’s still related to the premiere and the aftermath of what happened at the hospital.\n\t</p>\n\t<h5>\n\t\tPhylicia Rashad was at the “Grey’s” 450th episode celebration last week, because she is directing an upcoming episode. Do we have Debbie Allen to thank for getting Phylicia in that director’s chair?\t</h5>\n<p>\n\tOh, absolutely, we have Debbie to thank for that! She and Debbie are very close. I mean, has she seen every episode? Probably not, but that’s a really tall order. But we are so honored and thrilled to have her. I mean, it’s Phylicia Rashad! When I spoke to her, I kind of had this moment of, “I just spoke to Clair Huxtable?!” But she is so lovely. And also, just to see the two of them together, you’ve got two iconic legends in the same room.</p>\n\t<h5>\n\t\tIs there anything else you can tease that we haven’t already talked about?\t</h5>\n<p>\n\tThose babies are going to be delivered!</p>\n\t<h5>\n\t\tJo and Link’s babies? Is that happening in the first half of the season?\t</h5>\n<p>\n\tYes.</p>\n\t<h5>\n\t\tAre you still dealing with the same issue as last season in terms of not being able to have all of the series regulars in each episode due to industry-wide budget cuts?\t</h5>\n<p>\n\tYes, it’s a similar setup, and that’s always hard. It takes a lot of puzzle solving, but we’ve gotten pretty good at what we do, so we’re getting through it.</p>\n<div>\n<figure>\n<p><img srcset=\"https://variety.com/wp-content/uploads/2025/10/Greys-Anatomy-Season22premiere-Teddy-Kwon.jpg 1200w, https://variety.com/wp-content/uploads/2025/10/Greys-Anatomy-Season22premiere-Teddy-Kwon.jpg?resize=150,120 150w, https://variety.com/wp-content/uploads/2025/10/Greys-Anatomy-Season22premiere-Teddy-Kwon.jpg?resize=300,240 300w\" src=\"https://variety.com/wp-content/uploads/2025/10/Greys-Anatomy-Season22premiere-Teddy-Kwon.jpg?w=1024\" alt=\"\" />\n\t</p>\n<figcaption>\n\t\t\t\t\t<span>Kim Raver, Harry Shum Jr. </span>\n\t\t\t\t\t\t\t\t\tCourtesy of Disney/Anne Marie Fox\n\t</figcaption>\n</figure>\n</div>\n\t<h5>\n\t\tDo you have any plans to address the Trump administration’s impending cuts to Medicaid or anything else in the political climate right now?\t</h5>\n<p>\n\tWe’re obviously not a political show, and we’re always going to address it from the doctor’s point of view, so we are going to tell the facts from how the doctors are experiencing it. But we are “Grey’s.” We’re a show that’s been on for 22 years, and we’ve always adapted to what’s going on in the world. We do it strictly from doctor’s points of views, not politicians.</p>\n\t<h5>\n\t\tThe reason why I’m asking is because “The Pitt” will be confronting those issues in its second season. Out of curiosity, as someone who has basically grown up and cut their teeth in this genre, have you watched that new medical drama yet?\t</h5>\n<p>\n\tI haven’t finished it, but I’ve definitely watched some of it.</p>\n\t<h5>\n\t\tWhat did you think?\t</h5>\n<p>\n\tIt feels very different just because it’s a very different show, but I love medical shows, so I celebrate all of them. It doesn’t matter that I’m [working] on one of them too. It’s not a competition. What’s good for one medical show is good for all of us. And I’m an “ER” girl, so seeing Noah Wyle in the ER, I’m happy!\n\t</p>\n<p>\n\t<em>This interview has been edited and condensed.</em></p>\n</div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Grey’s Anatomy’ Boss on the Season 22 Premiere, How Often Ellen Pompeo Will Be On and Killing [SPOILER] After That OR Explosion",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/Greys-Anatomy-Season22premiere-MAIN.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-10T03:00:00.000Z",
      "dateModified": "2025-10-10T03:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Soul on Fire’ Review: A Childhood Accident Leads to Higher Ground in Smooth If Bland Inspirational Biopic",
    "url": "https://variety.com/2025/film/reviews/soul-on-fire-review-faith-john-oleary-1236543848/",
    "image": "https://variety.com/wp-content/uploads/2025/10/soul-on-fire-review.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-10-10T01:15:00.000Z",
    "description": "<div><p>\n\tIn 2011, director <a target=\"_blank\" href=\"https://variety.com/t/sean-mcnamara/\">Sean McNamara</a>, a Disney and Nickelodeon veteran with an",
    "body": "<div><p>\n\tIn 2011, director <a target=\"_blank\" href=\"https://variety.com/t/sean-mcnamara/\">Sean McNamara</a>, a Disney and Nickelodeon veteran with an iffy feature track record (see: “Bratz”) had a sleeper success with the inspirational biopic “Soul Surfer.” Its mix of sun, surf, spirituality and teen angst, dramatizing a real-life Hawaiian competitor’s rebound after losing her arm to a shark attack, remains a favorite among audiences for faith-based entertainment. After some less well-received efforts, including last year’s biopic “Reagan,” McNamara is back on old terrain with “<a target=\"_blank\" href=\"https://variety.com/t/soul-on-fire/\">Soul on Fire</a>,” centered on a young protagonist struggling after his own near-fatal accident. \n\t</p>\n<p>\n\tBased on John O’Leary’s 2016 memoir-slash-self-help tome “On Fire,” this earnest effort will have likewise appeal to viewers seeking a family-friendly “true story” with an upbeat message about overcoming adversity. However, the sports angle isn’t so potent this time; while Bethany Hamilton really was a pro surfer, O’Leary is a lifelong baseball <em>fan</em>, which provides a rather less compelling sub-theme. Beyond that, this “Soul” is smoothly crafted, hitting the right notes of conflict and bravery. But it’s also bland to a fault at times, and feels unnecessarily drawn-out at nearly two hours. \n</p>\n<p>\n\tGregory Poirier’s screenplay does maintain a steady level of interest, in part by veering from a strictly chronological structure. We start off with the adult O’Leary (Joel Courtney) working in home construction, when he’s asked by a woman who’s heard about his past if he’d talk about it to the Girl Scout troop she den-mothers. Even addressing a few preadolescents is more public speaking than he can handle comfortably, but when he’s asked a question, he flashes back 20 years to the traumatic event that caused him to be invited. \n\t</p>\n<p>\n\tAt age nine (played by James McCracken), he was just a baseball-obsessed boy in 1987 suburban St. Louis, one of six children to parents Denny (<a target=\"_blank\" href=\"https://variety.com/t/john-corbett/\">John Corbett</a>) and Susan (Stephanie Szostak). One day, O’Leary is impressed by some bigger kids playing with gasoline and matches. No one says, “Don’t try this at home,” so our junior hero does just that — creating an explosion that ends up destroying the entire house. He’s the only person seriously hurt, albeit badly, with burns covering 100% of his body. He is not expected to survive. But he does, thanks in part to the loyal support of his family, a particularly dedicated male nurse (DeVon Franklin) and famous local sportscaster Jack Buck (William H. Macy), who takes a special interest in the starstruck lad.</p>\n<p>\n\tReleased from the hospital after five months, John has major adjustments to make — including the use of prosthetic hands, since his severely damaged fingers required amputation. He gets by, becoming a popular figure at college by being the frat bro most likely to out-drink everyone else. But his self-confidence remains shaky. He clicks with fellow student Beth (Masey McLain), yet is too shy to ask her out until they’re almost too well-established as “just friends.” Later on, John overcomes more obstacles, eventually becoming a professional public speaker. Nonetheless, he confesses to his father (who’s by then dealing with Parkinson’s disease) that, despite everything, deep down he can still feel “like a fraud…an emotional coward.” </p>\n<p>\n\tAs likable a performer as Courtney is, his wide-eyed hero doesn’t really have the depth to make that inner doubt vivid. The variable supporting players — some of whom have been much better elsewhere — make their characters seem even more rotely drawn. Both script and direction stay on a pleasant surface level, frequently goosed by a soundtrack full of rather on-the-nose golden oldies by Smash Mouth, Neil Diamond, Journey, John Fogerty, Paul Stookey and others, plus newer Christian pop cuts. At least they have more personality than Mark Isham’s original score, which is among his less inspired efforts.</p>\n<p>\n\tThe intended stirring impact is a bit stunted by the lack of complexity and nuance in telling John’s journey. Inevitable glimpses of real-life O’Leary under the final credits make “Soul on Fire” retroactively feel like an extended promotion for his books and lectures. Movies like this also frequently seem to contradict their ostensible emphasis on internal faith by having the protagonist’s triumphant moments invariably accompanied by cheering crowds — a fantasy of piety and selflessness that somehow also grants a starry spotlight. This competently crafted, if pedestrian, feel-good exercise will probably deliver the desired uplift for viewers who want their “true stories” played out via cozily familiar narrative beats. But the effect is a little too generic to be especially persuasive for anyone else. </p>\n</div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Soul on Fire’ Review: A Childhood Accident Leads to Higher Ground in Smooth If Bland Inspirational Biopic",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/soul-on-fire-review.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-10-10T01:15:00.000Z",
      "dateModified": "2025-10-10T01:15:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Dua Lipa ... Stilettos 'N Martinis For Thirsty Thursday!",
    "url": "https://www.tmz.com/2025/10/09/dua-lipa-stilletos-n-martinis/",
    "image": "https://imagez.tmz.com/image/d3/16by9/2025/10/09/d322cf42ff554d4dbd68a16b7ac8d282_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-09T21:33:36.000Z",
    "description": "<div>\n    <article>\n                    <h2>\n                          <span>Dua Lipa ...</span>\n                          <span>Stilettos 'N Martinis",
    "body": "<div>\n    <article>\n                    <h2>\n                          <span>Dua Lipa ...</span>\n                          <span>Stilettos 'N Martinis</span>\n                          <span>For Thirsty Thursday 🍸!</span>\n                      </h2>\n                  <p>\n                        Published October 9, 2025 2:33 PM PDT\n                                                                            </p>\n      <div>\n    <div>\n      <a target=\"_blank\" href=\"https://www.tmz.com/photos/2025/10/09/dua-lipa-poses-pretty-on-piano-stilletos-n/\">\n        <img src=\"https://imagez.tmz.com/image/72/4by3/2025/10/09/723d5815b443470d8f015a90ecd9309f_md.jpg\" alt=\"Dua Lipa Poses Pretty On Piano ... Stilletos 'N Martinis!\" />\n              </a>\n    </div>\n    <section>\n          <p>Just another night in the life of <a target=\"_blank\" href=\"https://www.tmz.com/people/dua-lipa/\"><strong>Dua Lipa</strong></a><strong> </strong>-- who's done it again ... the sexy singer scored a revealing 'fit which hit the 'Gram overnight ... and the photos are so hot you're 'bout to catch a fever 🥵!</p>\n      </section>\n    <div>\n                  <a>\n          <div>\n                          <p><img src=\"https://imagez.tmz.com/image/b3/4by3/2025/10/09/b3d08c43b41446aa870a907711b2af69_md.jpg\" alt=\"1009-Dua-Lipa-Stilletos-Martinis-SUB-1\" />\n                </p></div>\n                                  </a>\n      </div>\n    <section>\n          <p>Posing pretty on the piano, the 30-year-old star struck her leg up high while shimmering in a bedazzled mini dress.</p>\n      </section>\n    <div>\n                  <a>\n          <div>\n                          <p><img src=\"https://imagez.tmz.com/image/81/4by3/2025/10/09/8100946518374923aea0cf228db757c9_md.jpg\" alt=\"1009-Dua-Lipa-Stilletos-Martinis-SUB-2\" />\n                </p></div>\n                                  </a>\n      </div>\n    <section>\n          <p>Check out this shot of Dua stickin' her tongue out and winkin' at her millions ...</p>\n      </section>\n    <section>\n          <p>'Nuff said ... check out the gallery and \"Dance the Night Away!\"</p>\n      </section>\n      </div>\n              <section>\n            <h3>\n              Related articles\n            </h3>\n        </section>\n              <section>\n          <ul>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/people/dua-lipa/\">\n                Dua Lipa\n              </a>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/categories/hotties-and-bodies/\">\n                Hotties & Bodies\n              </a>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/categories/hot-bodies/\">\n                Hot Bodies\n              </a>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/categories/photo-galleries/\">\n                Photo Galleries\n              </a>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/categories/music/\">\n                Music\n              </a>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/categories/famous-food/\">\n                Famous Food\n              </a>\n                      </ul>\n        </section>\n          </article>\n          </div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Dua Lipa ... Stilettos 'N Martinis For Thirsty Thursday!",
      "image": [
        "https://imagez.tmz.com/image/d3/16by9/2025/10/09/d322cf42ff554d4dbd68a16b7ac8d282_xl.jpg"
      ],
      "datePublished": "2025-10-09T21:33:36.000Z",
      "dateModified": "2025-10-09T21:33:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Guess Who This Lil' Actress Turned Into!",
    "url": "https://www.tmz.com/2025/10/10/guess-who-this-lil-actress-turned-into/",
    "image": "https://imagez.tmz.com/image/98/16by9/2025/10/03/9850c3a2c54645f887b7620767a8f09c_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-10T07:01:12.000Z",
    "description": "<div>\n    <article>\n                    <h2>\n                          <span>Guess Who This</span>\n                          <span>Lil' Actress</span>",
    "body": "<div>\n    <article>\n                    <h2>\n                          <span>Guess Who This</span>\n                          <span>Lil' Actress</span>\n                          <span>Turned Into!</span>\n                      </h2>\n                  <p>\n                        Published October 10, 2025 12:01 AM PDT\n                                                                            </p>\n      <div>\n    <div>\n      <a target=\"_blank\" href=\"https://www.tmz.com/photos/2017/08/07/guess-who-these-cute-kids-turned-into-part-12/\">\n        <img src=\"https://imagez.tmz.com/image/98/4by3/2025/10/03/9850c3a2c54645f887b7620767a8f09c_md.jpg\" alt=\"Guess Who These Cute Kids Turned Into -- Part 12\" />\n              </a>\n    </div>\n    <section>\n          <p>Before this expressive girlie turned into a singer and actress, she was just a 90's kid livin' it up with her fam, growing up in Los Angeles, and playing piano.</p>\n      </section>\n    <section>\n          <p>She took an interest in acting along with her sister ... From sitcoms to films, she's had a successful acting journey, but you may recognize her most from her singing duo -- on a Disney Channel series!</p>\n      </section>\n    <section>\n          <p><a href=\"https://www.tmz.com/photos/2017/08/07/guess-who-these-cute-kids-turned-into-part-12/\" target=\"_blank\"><strong>Can you guess who she is?</strong></a></p>\n      </section>\n      </div>\n              <section>\n            <h3>\n              Related articles\n            </h3>\n        </section>\n              <section>\n          <ul>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/categories/guess-who/\">\n                Guess Who\n              </a>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/categories/kids/\">\n                Kids\n              </a>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/categories/celebrity-kids/\">\n                celebrity kids\n              </a>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/categories/photo-galleries/\">\n                Photo Galleries\n              </a>\n                      </ul>\n        </section>\n          </article>\n          </div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Guess Who This Lil' Actress Turned Into!",
      "image": [
        "https://imagez.tmz.com/image/98/16by9/2025/10/03/9850c3a2c54645f887b7620767a8f09c_xl.jpg"
      ],
      "datePublished": "2025-10-10T07:01:12.000Z",
      "dateModified": "2025-10-10T07:01:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'Matlock's Leah Lewis Speaks Out After Costar Booted for Alleged Sexual Assault",
    "url": "https://www.tmz.com/2025/10/09/matlock-leah-lewis-speaks-out-after-costar-allegation/",
    "image": "https://imagez.tmz.com/image/d8/16by9/2025/10/09/d86e346f90574823b3b0cd884825e5c7_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-09T22:55:51.000Z",
    "description": "<div>\n    <article>\n                    <h2>\n                          <span>'Matlock'</span>\n                          <span>Leah Lewis Speaks Out ..",
    "body": "<div>\n    <article>\n                    <h2>\n                          <span>'Matlock'</span>\n                          <span>Leah Lewis Speaks Out ...</span>\n                          <span>After Costar's Alleged Sexual Assault</span>\n                      </h2>\n                  <p>\n                        Published October 9, 2025 3:55 PM PDT\n                                                                      <span>|</span>\n                Updated October 9, 2025 5:14 PM PDT\n                                    </p>\n      <div>\n    <div>\n                  <a>\n          <div>\n                          <p><img src=\"https://imagez.tmz.com/image/d8/4by3/2025/10/09/d86e346f90574823b3b0cd884825e5c7_md.jpg\" alt=\"leah lewis main getty\" />\n                </p></div>\n                  </a>\n      </div>\n    <section>\n          <p>\"Matlock\" star <strong>Leah Lewis</strong> is speaking out after her costar <strong>David Del Rio</strong> <a target=\"_blank\" href=\"https://www.tmz.com/2025/10/09/matlock-star-david-del-rio-allegations/\"><strong>got kicked off</strong></a> the CBS show ... for allegedly sexually assaulting her.</p>\n      </section>\n    <section>\n          <p>The actress said, \"Mom is here, we're moving forward in love and strength. I'm in good hands. Thank you to everybody for any kind of support and care. Truly, we're moving forward in strength. Key word, strength. Please, let that be the take away.\"</p>\n      </section>\n    <div>\n                  <a>\n          <div>\n                          <p><img src=\"https://imagez.tmz.com/image/15/4by3/2025/10/09/1527b2a565bd403d81a6f419e82558b4_md.jpg\" alt=\"leah lewis instagram sub\" />\n                </p></div>\n                  </a>\n      </div>\n    <section>\n          <p>A source with direct knowledge told TMZ ... David was escorted off the Paramount lot last week as soon as the allegations were reported.</p>\n      </section>\n<div>\n                  <a>\n          <div>\n                          <p><img src=\"https://imagez.tmz.com/image/1e/4by3/2025/10/09/1ed7191eaa4e4f058bf475e176898d69_md.jpg\" alt=\"david del rio and leah in matlock\" />\n                </p></div>\n                  </a>\n      </div>\n    <section>\n          <p>We hear the incident allegedly occurred on Paramount property. According to <a href=\"https://deadline.com/2025/10/david-del-rio-fired-matlock-sexual-assault-billy-martinez-1236574763/\" target=\"_blank\"><strong>Deadline</strong></a>, it allegedly happened September 26.</p>\n      </section>\n    <section>\n          <p>David's character, Billy Martinez -- one of the main ensemble of the reboot starring <a target=\"_blank\" href=\"https://www.tmz.com/people/kathy-bates/\"><strong>Kathy Bates</strong></a> -- will be immediately written off, CBS Studios confirmed. He's appeared in 20 episodes.</p>\n      </section>\n    <section>\n          <p>Coincidentally, the legal drama made sexual assault a theme in its third episode of the first season, in which Matlock -- played by Kathy -- takes over a case after a young lawyer claims she was sexually assaulted by a superior.</p>\n      </section>\n    <section>\n          <p>\"Matlock\" Season 2 premieres Sunday.</p>\n      </section>\n      </div>\n              <section>\n            <h3>\n              Related articles\n            </h3>\n        </section>\n              <section>\n          <ul>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/people/kathy-bates/\">\n                Kathy Bates\n              </a>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/categories/tv/\">\n                TV\n              </a>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/categories/fairly-legal/\">\n                Fairly Legal\n              </a>\n                      </ul>\n        </section>\n          </article>\n          </div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Matlock's Leah Lewis Speaks Out After Costar Booted for Alleged Sexual Assault",
      "image": [
        "https://imagez.tmz.com/image/d8/16by9/2025/10/09/d86e346f90574823b3b0cd884825e5c7_xl.jpg"
      ],
      "datePublished": "2025-10-09T22:55:51.000Z",
      "dateModified": "2025-10-09T22:55:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "RFK Jr. Says Tylenol After Circumcision Linked To Autism",
    "url": "https://www.tmz.com/2025/10/09/rfk-jr-tylenol-circumcision-linked-autism/",
    "image": "https://imagez.tmz.com/image/25/16by9/2025/10/09/2579cda7a7c14b3294c5b57fbf32b4c9_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-09T23:55:12.000Z",
    "description": "<div>\n    <article>\n                    <h2>\n                          <span>RFK Jr.</span>\n                          <span>Here's A Snip Tip ...</spa",
    "body": "<div>\n    <article>\n                    <h2>\n                          <span>RFK Jr.</span>\n                          <span>Here's A Snip Tip ...</span>\n                          <span>Claims Circumcision May Be Linked To Autism! ✂️💊</span>\n                      </h2>\n                  <p>\n                        Published October 9, 2025 4:55 PM PDT\n                                                                            </p>\n      <div>\n    <div>\n      <div>\n        <p>\n                    <img src=\"https://imagez.tmz.com/image/45/16by9/2025/10/09/45a3acbc382b4c5285ca02368216ccb8_md.jpg\" alt=\"rfk-jr-10-09-2025\" />\n                  </p>\n      </div>\n                    <p><span>C-SPAN</span>\n          </p></div>\n    <section>\n          <p><a target=\"_blank\" href=\"https://www.tmz.com/people/robert-kennedy-jr/\"><strong>Robert F. Kennedy Jr.</strong></a> says there's another link between autism rates and Tylenol use ... and he says it involves pain treatment for circumcisions.</p>\n      </section>\n    <section>\n          <p><a target=\"_blank\" href=\"https://www.tmz.com/people/donald-trump/\"><strong>President Trump</strong></a>'s Health and Human Services Secretary made the claim Thursday during a cabinet meeting ... saying there are multiple studies that show children who are circumcised early in life have double the rate of autism.</p>\n      </section>\n    <section>\n          <p>RFK Jr. says it's \"highly likely\" the use of Tylenol in these infants is the reason for elevated autism rates. He did not cite a specific study or research.</p>\n      </section>\n<div>\n      <div>\n        <p>\n                    <img src=\"https://imagez.tmz.com/image/a0/16by9/2025/09/23/a0ea72bf907941d6b3a15fd4d7e0b379_md.jpg\" alt=\"donald-trump-autism-tylenol-kal-09-23-2025\" />\n                      <span>9/22/25</span>\n                  </p>\n      </div>\n                    <p><span>Fox 5 DC</span>\n          </p></div>\n    <section>\n          <p>As you know ... Trump, RFK Jr. and <a target=\"_blank\" href=\"https://www.tmz.com/people/dr-oz/\"><strong>Dr. Oz</strong> </a>last month warned pregnant women not to take Tylenol, claiming there was evidence linking Tylenol use in pregnancies to autism.</p>\n      </section>\n    <section>\n          <p>Dr. Oz later <a target=\"_blank\" href=\"https://www.tmz.com/2025/09/23/dr-oz-tempers-trump-tylenol-autism-pregnant-mothers/\"><strong>joined us</strong></a> on \"TMZ Live\" and clarified Trump's comments ... POTUS said bluntly \"don't take Tylenol\" bur Dr. Oz told us when it was safe to take the over-the-counter pain medication during pregnancies.</p>\n      </section>\n    <div>\n      <div>\n        <p>\n                    <img src=\"https://imagez.tmz.com/image/b9/16by9/2025/09/23/b987882379f54cc5954397d7c5ef03e3_md.jpg\" alt=\"dr-oz-kal-v2-09-23-2025\" />\n                  </p>\n      </div>\n                    <p><span>TMZ.com</span>\n          </p></div>\n    <section>\n          <p>No matter how you slice it, seems the Trump administration isn't a big fan of Tylenol. 🤷🏽‍♂️</p>\n      </section>\n      </div>\n              <section>\n            <h3>\n              Related articles\n            </h3>\n        </section>\n              <section>\n          <ul>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/people/robert-kennedy-jr/\">\n                Robert F. Kennedy Jr.\n              </a>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/people/donald-trump/\">\n                Donald Trump\n              </a>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/categories/religion-spirituality/\">\n                Religion/ Spirituality\n              </a>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/categories/politix/\">\n                Politix\n              </a>\n                          <a target=\"_blank\" href=\"https://www.tmz.com/categories/health/\">\n                Health\n              </a>\n                      </ul>\n        </section>\n          </article>\n          </div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "RFK Jr. Says Tylenol After Circumcision Linked To Autism",
      "image": [
        "https://imagez.tmz.com/image/25/16by9/2025/10/09/2579cda7a7c14b3294c5b57fbf32b4c9_xl.jpg"
      ],
      "datePublished": "2025-10-09T23:55:12.000Z",
      "dateModified": "2025-10-09T23:55:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kyle Richards' Fall Fashion Staples Under $75",
    "url": "https://www.tmz.com/2025/10/10/kyle-richards-fall-fashion-deals/",
    "image": "https://imagez.tmz.com/image/ee/16by9/2025/10/08/eecdf4f5e321496fbdf6ae67302fdaed_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-10-10T07:01:43.000Z",
    "description": "<div>\n    <section>\n                    <p><a target=\"_blank\" href=\"https://www.amazon.com/live/broadcast/49901a42-57ef-44de-9a54-e63c0cd5d61f\">\n     ",
    "body": "<div>\n    <section>\n                    <p><a target=\"_blank\" href=\"https://www.amazon.com/live/broadcast/49901a42-57ef-44de-9a54-e63c0cd5d61f\">\n                          <img src=\"https://imagez.tmz.com/image/ee/4by3/2025/10/08/eecdf4f5e321496fbdf6ae67302fdaed_md.jpg\" alt=\"Amazon-Kyle-Richards-Fall-Staples-PRIMARY\" />\n                                  </a>\n      </p>\n        </section>\n    <section>\n          <p><em>TMZ may collect a share of sales or other compensation from links on this page.</em></p>\n      </section>\n    <section>\n          <p>Everyone's favorite Beverly Hills Housewives is here with the <em>realest</em> deals on Amazon this fall.</p>\n      </section>\n    <section>\n          <p>Kyle Richards hosted a <a href=\"https://www.amazon.com/live/broadcast/49901a42-57ef-44de-9a54-e63c0cd5d61f\" target=\"_blank\" title=\"https://www.amazon.com/live/broadcast/49901a42-57ef-44de-9a54-e63c0cd5d61f\"><strong>livestream</strong></a><strong> </strong>this week with some of her favorite fashion pieces for the season -- and they're not only incredibly cute, but wallet-friendly.</p>\n      </section>\n    <section>\n          <p>Everything on this list will cost you less that $75 -- so get shopping!</p>\n      </section>\n    <section>\n              <a target=\"_blank\" href=\"https://amzn.to/4pI4g7y\">\n      <h3>Cropped Jacket With Pockets</h3>\n      </a>\n        </section>\n    <section>\n                    <p><a target=\"_blank\" href=\"https://amzn.to/4pI4g7y\">\n                          <img src=\"https://imagez.tmz.com/image/e1/4by3/2025/10/08/e1e25e92ab7c41248310393a712d4109_md.jpg\" alt=\"Cropped-Jacket-With-Pockets-Kyle-Richards-Fall-Staples-MAIN\" />\n                                  </a>\n      </p>\n        </section>\n    <section>\n          <p>This <a target=\"_blank\" href=\"https://amzn.to/4pI4g7y\"><strong>Cropped Jacket With Pockets</strong></a> serves chic as temps start to drop -- keeping you warm while also keeping it classy.</p>\n      </section>\n<section>\n          <p>It also comes in any color you like -- like including green, light blue, navy blue, black, white, brown, khaki, grey, and red! This one will be a staple of your fall wardrobe ... just like Richards' herself has been a staple of RHOBH for 15 years.</p>\n      </section>\n    <section>\n              <a target=\"_blank\" href=\"https://amzn.to/46BhwBW\">\n      <h3>Womens Cropped Jacket</h3>\n      </a>\n        </section>\n    <section>\n                    <p><a target=\"_blank\" href=\"https://amzn.to/46BhwBW\">\n                          <img src=\"https://imagez.tmz.com/image/ec/4by3/2025/10/08/ec72486719d24854a0427f331fce4921_md.jpg\" alt=\"Womens-Cropped-Jacket-Kyle-Richards-Fall-Staples-MAIN\" />\n                                  </a>\n      </p>\n        </section>\n    <section>\n          <p>Another jacket option is this <a target=\"_blank\" href=\"https://amzn.to/46BhwBW\"><strong>Women's Cropped Jacket</strong></a>, which is a lightweight bomber with a button drawstring zip-up.</p>\n      </section>\n    <section>\n          <p>It comes in green, blue, khaki, red, black, and navy. And no matter which color you pick, it'll finish off any look for a cool and casual night out with the girls. Just beware those flying wine glasses!</p>\n      </section>\n    <section>\n              <a target=\"_blank\" href=\"https://amzn.to/4gH4LKT\">\n      <h3>PRETTYGARDEN Women's Oversized Fall Sweaters</h3>\n      </a>\n        </section>\n    <section>\n                    <p><a target=\"_blank\" href=\"https://amzn.to/4gH4LKT\">\n                          <img src=\"https://imagez.tmz.com/image/24/4by3/2025/10/08/248dab4f7d6347ea808185522ce760c4_md.jpg\" alt=\"Prettygarden-Womens-Oversized-Fall-Sweaters-Kyle-Richards-Fall-Staples-MAIN\" />\n                                  </a>\n      </p>\n        </section>\n    <section>\n          <p>You may have seen this <a target=\"_blank\" href=\"https://amzn.to/4gH4LKT\"><strong>PRETTYGARDEN Women's Oversized Fall Sweaters</strong></a> a million times, especially in this time of year, but that just might mean it's time to get your own!</p>\n      </section>\n    <section>\n          <p>Bolster your autumnal wardrobe with yet another winning pick from Kyle, as the cozy and sophisticated embrace of this beautifully crafted cable knit sweater will keep you warm and comfy all season long. Red not your color? Don't worry, it also comes in a ton of other colorways!</p>\n      </section>\n    <section>\n              <a target=\"_blank\" href=\"https://amzn.to/3W8HaJm\">\n      <h3>Fisoew Womens Wide Leg Pants</h3>\n      </a>\n        </section>\n    <section>\n                    <p><a target=\"_blank\" href=\"https://amzn.to/3W8HaJm\">\n                          <img src=\"https://imagez.tmz.com/image/1a/4by3/2025/10/08/1a3e956cea744e10a38c353268f85e3e_md.jpg\" alt=\"Fisoew-Womens-Wide-Leg-Pants-Kyle-Richards-Fall-Staples-MAIN\" />\n                                  </a>\n      </p>\n        </section>\n    <section>\n          <p>Keep the comfort coming with these <a target=\"_blank\" href=\"https://amzn.to/3W8HaJm\"><strong>Fisoew Womens Wide Leg Pants</strong></a>.</p>\n      </section>\n    <section>\n          <p>These high-waisted pants come in khaki, blue, black, grey, red, and brown, ready to suit your style -- whether you're wearing them on your way to the gym, a movie night or whatever dinner party from hell life may throw your way!</p>\n      </section>\n    <section>\n              <a target=\"_blank\" href=\"https://amzn.to/4nqIUdm\">\n      <h3>Wide Brim Western Cowboy Hats</h3>\n      </a>\n        </section>\n    <section>\n                    <p><a target=\"_blank\" href=\"https://amzn.to/4nqIUdm\">\n                          <img src=\"https://imagez.tmz.com/image/b1/4by3/2025/10/08/b101798195bc4e7d829a2e3b13616f30_md.jpg\" alt=\"Wide-Brim-Western-Cowboy-Hats-Kyle-Richards-Fall-Staples-MAIN\" />\n                                  </a>\n      </p>\n        </section>\n    <section>\n          <p>We all know Kyle loves herself a cowboy hat -- and this <a target=\"_blank\" href=\"https://amzn.to/4nqIUdm\"><strong>Wide Brim Western Cowboy Hat</strong></a> from Lanzom will certainly cost you a helluva lot less than one from Kemo Sabe.</p>\n      </section>\n    <section>\n          <p>If you too are a Beverly Hills resident -- where the sun always shines -- you know that this hat could come in use all year round. It could also double as a great head-topper for your upcoming Halloween parties!</p>\n      </section>\n    <section>\n              <a target=\"_blank\" href=\"https://amzn.to/4nM405B\">\n      <h3>Suede Bags for Women</h3>\n      </a>\n        </section>\n    <section>\n                    <p><a target=\"_blank\" href=\"https://amzn.to/4nM405B\">\n                          <img src=\"https://imagez.tmz.com/image/6b/4by3/2025/10/08/6b05d304a08049ec800c1b72938f148c_md.jpg\" alt=\"Suede-Bags-For-Women-Kyle-Richards-Fall-Staples-MAIN\" />\n                                  </a>\n      </p>\n        </section>\n    <section>\n          <p>Last, but not least, throw all your diamonds into this <a target=\"_blank\" href=\"https://amzn.to/4nM405B\"><strong>Suede Bag for Women</strong></a>!</p>\n      </section>\n    <section>\n          <p>It's the perfect size to store all your personal items, plus, simple, sweet, classy and trendy -- just like Kyle herself, right?</p>\n      </section>\n    <section>\n          <p><a href=\"https://amzn.to/3RZ4jg0\" target=\"_blank\" title=\"https://amzn.to/3RZ4jg0\"><strong>Sign up for Amazon Prime</strong></a> to get the best deals.</p>\n      </section>\n      </div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kyle Richards' Fall Fashion Staples Under $75",
      "image": [
        "https://imagez.tmz.com/image/ee/16by9/2025/10/08/eecdf4f5e321496fbdf6ae67302fdaed_xl.jpg"
      ],
      "datePublished": "2025-10-10T07:01:43.000Z",
      "dateModified": "2025-10-10T07:01:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]