[
  {
    "title": "‘Stranger Things’ Shows Its Age in a Final Season That’s Outgrown Its Core Appeal: TV Review",
    "url": "https://variety.com/2025/tv/reviews/stranger-things-5-review-netflix-1236592953/",
    "image": "https://variety.com/wp-content/uploads/2025/11/StrangerThings_S5_0102_R.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-27T01:01:00.000Z",
    "description": "\n\tIt’s been three and a half years since the most recent season of “Stranger Things” kicked off in May 2022. The first episode of the hit series’ fift",
    "body": "\n\tIt’s been three and a half years since the most recent season of “Stranger Things” kicked off in May 2022. The first episode of the hit series’ fifth and final installment — delayed by dual Hollywood strikes and the mounting production value of a show that’s ballooned from surprise breakout to blockbuster franchise — opens in the fall of 1987. That’s 18 months after the events of Season 4, which concluded with archvillain Vecna (Jamie Campbell Bower) rupturing the metaphysical border between our reality and the alternate dimension known as the Upside Down, and four years from Season 1, which kicked off in November 1983. Which means that the real-life gap between two individual seasons of “Stranger Things” is dangerously close to that of the entire canonical span of “Stranger Things.” That factoid is absurd enough on its face, illustrating the escalating tax on viewers’ patience from a medium once defined by consistent, predictable output. (“Stranger Things” is far from the sole culprit: “Severance,” another streaming-native genre sensation, is a prime example.) But it also sums up the challenge facing the brainchild of twins Matt and Ross Duffer as their show steers into its home stretch, an eight-episode season broken up into three chunks, with the first dropping on Thanksgiving eve. “Stranger Things” is a story about children — and, more than that, the innocence of childhood, pitting a scrappy gang of bike-riding Dungeons & Dragons nerds against misguided adults who mess around with forces they don’t understand — that’s gone on long enough to see its cast grow up, with all the tensions that come with that glaring contrast. The list of data points is long. Millie Bobby Brown, who broke out as the telekinetic, “E.T.”-esque Eleven, is now the married mother of an adopted baby girl. Voices have dropped; IMDb pages have lengthened. For some of the series leads, the time between their casting and the finale’s premiere will encompass more than half their lives. But what matters to this reviewer is how these changes manifest in the show — or rather, don’t. The truth is that “Stranger Things” itself has not reflected its stars’ obvious maturation with an accompanying complexity. All of “Stranger Things” is an exercise in nostalgia. In Season 5, the show now seems to pine not just for the neon hues and synth-driven pop of the 1980s it conjures so evocatively, but for a simpler time in its own run that can’t be brought back, no matter how high the budget. Though if anything, “Stranger Things” has only gotten less rough-edged over time. Remember when Hopper (David Harbour) was an alcoholic who smoked? The four episodes that comprise Volume 1 unsurprisingly walk back the Season 4 cliffhanger. Hawkins, Indiana, has not turned into a hellscape of Demogorgons and slimy vines. Instead, the town has been put under military quarantine, occupied by the same foolhardy industrial complex that started this whole mess in the first place. With Matthew Modine’s Dr. Brenner now dead, the deep state’s latest ambassador is Dr. Kay (Linda Hamilton), a scientist and officer who commands an entire base constructed within the Upside Down. Uncle Sam has stapled over most of Vecna’s rifts with crude metal plates, but left just enough open to use for his own ends. This human-made bubble makes Season 5 more geographically focused than its predecessor, which put thousands of miles between groups of the protagonists. That pays off in more concise run times than the bloat of Season 4, yet the return to Hawkins underlines the familiarity of the setups. In lieu of a mall, this year’s throwback locale is a radio station staffed by lovable burnouts Robin (Maya Hawke) and Steve (Joe Keery), who use the airwaves to send coded messages to their compatriots. The team once again splits up in the name of completing a sequence of self-assigned side quests before inevitably reuniting later in the season. Steve, his ex-girlfriend Nancy (Natalia Dyer) and her current boyfriend Jonathan (Charlie Heaton) continue to litigate their series-long love triangle. The same pieces are on the board, in only slightly different configurations. Season 5 shows us more of the Upside Down, and at a greater scale, than “Stranger Things” ever has before. Hopper embarks on his regular patrol of its terrain to search for Vecna, who’s disappeared since he was injured in the Season 4 finale, and his adopted daughter Eleven joins soon after; the pair remain there for the duration of Volume 1. These scenes showcase the production’s increasing technical abilities, realizing this other world more immersively than ever. But after last season’s revelation that Vecna governs the Upside Down and controls its inhabitants via hive mind, Season 5 hasn’t yet added to our understanding of the realm, either in mechanics or as metaphor. Only the scope changes, not the approach. The “Stranger Things” version of evolution is that our heroes now use radio waves, not D&D creatures, as their analogy of choice for sussing out how the Upside Down functions where science could not. Once, these frameworks were endearing instances of middle-schoolers making sense of the nonsensical. Coming from actors mostly old enough to be college graduates, the relative haziness of the world-building starts to peek through. To the extent “Stranger Things” conveys its main characters’ expanding emotional lives as they plunge ever further into adolescence, it’s through Vecna’s original prey Will Byers (Noah Schnapp), who comes to terms with his homosexuality in tandem with his enduring connection to the Upside Down. Will bonds with Robin, the only other queer person he knows, over his fear and uncertainty. Robin’s advice mostly boils down to “be yourself” platitudes, yet Hawke — who quite literally has stardom in her blood — sells them. But in lieu of giving a similar treatment to the rest of the Hellfire Club, “Stranger Things” shows its hand by effectively swapping them for a new generation of kids who have the cuteness factor they used to. Holly Wheeler (Nell Fisher), the baby sister of Nancy and Mike (Finn Wolfhard), gains new prominence as the latest Hawkins resident caught in the clutches of the paranormal. Her classmate Derek Turnbow (Jake Connelly), derided by his peers as “Dipshit Derek,” provides some of the comic relief Dustin (Gaten Matarazzo) once did. It’s no coincidence Fisher and Connelly are basically the same age their older castmates were back in 2016, when “Stranger Things” first set the world on fire. Holly’s interpretive lens of choice is “A Wrinkle in Time,” not a fantasy role-playing game, but she’s another kid confronting the unknown using the tools at her disposal, with grown-ups more a hindrance than a help. As it hurtles toward a final showdown with Vecna, “Stranger Things” is resetting the clock rather than riding its forward momentum. The Duffers have always worn their influences with pride, and the specters of Steven Spielberg and Stephen King helped jump-start the series into a phenomenon. But in its last hours, “Stranger Things” remains primarily pastiche, so indebted to inherited archetypes (mad scientist, reformed bully) and references (The Clash, Peanut Butter Boppers) that its main cultural impact comes from extratextual elements like casting and the ascendance of Netflix. By declining to enrich its characters as they age, “Stranger Things” traps itself in arrested development. When you get bigger without going deeper, you end up stretched thin.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Stranger Things’ Shows Its Age in a Final Season That’s Outgrown Its Core Appeal: TV Review",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/StrangerThings_S5_0102_R.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-27T01:01:00.000Z",
      "dateModified": "2025-11-27T01:01:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘IT: Welcome to Derry’ Creators Andy and Barbara Muschietti Explore Real-World Disappearances in Argentinian Documentary ‘Norita’",
    "url": "https://variety.com/2025/film/news/it-creators-andy-and-barbara-muschietti-documentary-norita-1236593254/",
    "image": "https://variety.com/wp-content/uploads/2025/11/GettyImages-2244400826.jpg?crop=0px%2C82px%2C4200px%2C2363px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-11-27T00:40:37.000Z",
    "description": "\n\tAndy and Barbara Muschietti are best known as the brother-sister director-producer duo behind the “It” films and the HBO prequel series, “It: Welcom",
    "body": "\n\tAndy and Barbara Muschietti are best known as the brother-sister director-producer duo behind the “It” films and the HBO prequel series, “It: Welcome to Derry.” But this year, they executive produced an entirely new project about real-world horrors and disappearances that took place in their home country of Argentina.\n\n\t“Norita” is a documentary directed by Jayson McNamara and Andrea Carbonatto Tortonese. It tells the story of Nora “Norita” Cortinas, the mother of an Argentinian activist who disappeared during the country’s 1970s junta dictatorship. Cortinas’ efforts for the government to reveal the truth about her son’s whereabouts sparked the Madres de Plaza de Mayo movement, where the mothers of revolutionaries protested and pressured the despotic government for information about their missing children.\n\t\n\n\tThe Muschiettis joined the project after watching McNamara’s prior documentary, “Messenger on a White Horse,” which explored English-Argentinian journalist Robert Cox’s bold efforts to cover the Madres de Plaza de Mayo during the dictatorship. \n\n\n\tAndy and Barbara grew up during Argentina’s dictatorial regime, so the topic struck a personal nerve with them. “We are Argentinian. We spent our childhoods in Argentina during the dictatorship. I was five years old when the military took hold of the country, and I was 13 when democracy came back,” Barbara told Variety.\n\n\tIn addition to the Muschiettis, Jane Fonda also joined “Norita” as an executive producer. “Jane Fonda got involved at the same time I did, and my God, I thought I knew everything, but then I met this woman. I’ve never met anybody like her. She is such a powerhouse and relentless,” continued Barbara. “We did a screening at the Museum of Tolerance a month ago, and she came and presented it and her speech moved me to tears. She understands that this movie is about Norita, but it’s also about what the U.S. is living with right now. She understands that there’s a comfort in being American that allows people to think that things like what happened in the film will never happen here, but that’s not reality. The reality is that it can happen and people have to start paying attention.”\n\t\n\n\tThe documentary’s timeliness for America and for any place enduring a tumultuous political climate is self-evident. What is more nuanced, however, is how the doc fits in with the Muschiettis’ larger filmography. While the filmmakers are Argentinian, their most well-known works are Stephen King adaptations about kids fighting off a killer clown demon in Maine. On the surface, it’s a long way off from Buenos Aires.\n\n\tHowever, there are overlapping themes between the projects. “Norita,” in many ways, explores the real-world manifestations of the horrors “It” alludes to. In “It”‘s setting of Derry, Maine, people go missing at troubling rates, yet people remain complicit out of fear. While the culprit in the fictional town may be a paranormal entity embodied by Pennywise the Clown, he is but a symbol of American colonization, racism, trauma and exclusion, as brought to the surface in the many power struggles depicted in “It: Welcome to Derry.”\n\n\t“Andy and I read the book when we were, I believe, 14 and 15. It was two years after the end of the junta and the return of Democracy,” recalled Barbara. “And we fell into that book like we’d never fell into anything before. It was just crazy and a big part of it was that it was about the weaponization of fear, which is what Pennywise does so well. Of course, that felt very familiar to us.”\n\n\t“Norita” had its world premiere at the Dances With Films Film Festival in Los Angeles in June and has since played at over a dozen festivals around the world. It is currently campaigning for awards consideration. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘IT: Welcome to Derry’ Creators Andy and Barbara Muschietti Explore Real-World Disappearances in Argentinian Documentary ‘Norita’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/GettyImages-2244400826.jpg?crop=0px%2C82px%2C4200px%2C2363px&resize=1000%2C563"
      ],
      "datePublished": "2025-11-27T00:40:37.000Z",
      "dateModified": "2025-11-27T00:40:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NBA on Sling TV: How to Watch Houston Rockets vs. Golden State Warriors Live Online Without Cable",
    "url": "https://variety.com/2025/shopping/news/how-to-watch-rockets-vs-warriors-nba-game-online-sling-tv-1236586199/",
    "image": "https://variety.com/wp-content/uploads/2025/11/NBA-Houston-Rockets-vs.-Golden-State-Warriors-Getty-Featured.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-27T00:00:00.000Z",
    "description": "\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.\n\n\tWith NBA ",
    "body": "\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.\n\n\tWith NBA all-star Kevin Durant now on the Houston Rockets, there’s a new must-see matchup in the Western Conference, as the Rockets travel to the Bay Area to face-off against the Golden State Warriors — Durant’s former team with his former teammates Steph Curry and Draymond Green.\n\n\tOn Wednesday, Nov. 26 and broadcasting on ESPN, you can watch the Houston Rockets take on the Golden State Warriors at Chase Center in San Francisco, California, with tipoff at 10 p.m. ET/7 p.m. PT. ESPN is featured with Sling Orange.\n\n\n\tRight now, Sling Orange starts as low as just $1 for a Sling Day Pass, or $45.99/month. The streaming package comes with ESPN for basketball fans, while Sling Orange comes with other networks, like ESPN2, ESPN3, MotorTrend and Disney Channel, to watch even more live sports.\n\n\tThe streamer’s Sling Orange features more than 30 other channels, like Disney Channel and FreeForm, as well as A&E, AMC, BBC America, BET, CNN, Comedy Central, Food Network, Fuse, HGTV, History Channel, IFC, Lifetime, Nick Jr., QVC, TBS, TNT, Travel Channel, Vice and other networks.\n\n\tAdditionally, Sling now has Passes, so brand new subscribers can get access to Sling Orange for a short period of time. No commitments. This is best for sports, while it’s a super fast and convenient way to access live TV. Here’s how it breaks down:\n\n\tAdditionally, Sling now has Passes, so brand new subscribers can get access to Sling Orange for a short period of time. No commitments. This is best for sports, while it’s a super fast and convenient way to access live TV. Here’s how it breaks down:\n\n\n\nSling Day Pass: $1 (reg. $4.99), Sling Orange for 24 hours\nSling Weekend Pass: $9.99, Sling Orange from Friday-to-Sunday\nSling Week Pass: $14.99, Sling Orange for 7 days\n\n\n\n\tPlease note: Prices and channel availability depends on your local TV market. Learn more about Sling subscription prices here.\n\n\tMeanwhile, all Sling TV plans have live TV over the internet, on-demand movie and TV shows, 50 hours of cloud DVR storage and up to three streams across devices — such as smart TVs, smartphones, tablets, laptops, web browsers and others — at the same time.\n\n\tOn Wednesday, Nov. 26, you can livestream the Houston Rockets vs. Golden State Warriors, with a start time of 10 p.m. ET/7 p.m. PT on ESPN with Sling Orange, below:\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NBA on Sling TV: How to Watch Houston Rockets vs. Golden State Warriors Live Online Without Cable",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/NBA-Houston-Rockets-vs.-Golden-State-Warriors-Getty-Featured.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-27T00:00:00.000Z",
      "dateModified": "2025-11-27T00:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Oscars Visual Effects Top 20 Finalists: ‘Avatar,’ ‘Frankenstein,’ ‘Predator,’ ‘Sinners,’ ‘Wicked’ and More Make the Cut (EXCLUSIVE)",
    "url": "https://variety.com/2025/film/awards/oscars-visual-effects-top-20-finalists-2026-1236593423/",
    "image": "https://variety.com/wp-content/uploads/2025/11/Avatar-Fire-and-Ash-Sinners-Predator-Badlands-Frankenstein-Wicked-For-Good.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-27T00:30:57.000Z",
    "description": "\n\tThe Oscar race for visual effects is down to 20.\n\n\tWith multiple sources confirming to Variety, the list of finalists includes a mix of anticipated ",
    "body": "\n\tThe Oscar race for visual effects is down to 20.\n\n\tWith multiple sources confirming to Variety, the list of finalists includes a mix of anticipated blockbusters and franchise entries, with major studios Disney, Warner Bros., Universal, Paramount and Netflix dominating the field. The finalists were notified ahead of the Thanksgiving holiday.\n\n\tThe Disney parent company had the most films represented with seven among the 20. Among the most prominent titles are two from 20th Century Studios with Dan Trachtenberg’s “Predator: Badlands,” the seventh film in the sci-fi-horror franchise, and the highly anticipated James Cameron’s “Avatar: Fire and Ash,” the third installment in the groundbreaking franchise, which will screen for guild members and critics beginning Sunday, Nov. 30. In addition, Marvel Studios nabbed a pair of selections with the superhero blockbusters “The Fantastic Four: First Steps” and “Captain America: Brave New World,” while Walt Disney Pictures was represented with “Lilo and Stitch” and “Tron: Ares.”\n\t\n\n\tWarner Bros. Discovery was second among the studios with the most entries: Bong Joon Ho’s black comedy “Mickey 17,” Jared Hess’ video game adaptation “A Minecraft Movie,” Ryan Coogler’s gothic vampire drama “Sinners” and James Gunn’s superhero reboot “Superman” under the DC Studios banner. The studio also co-distributed Joseph Kosinski’s race car drama “F1,” starring Brad Pitt, alongside Apple Original Films, which produced the movie. Apple also managed to sneak Paul Greengrass’ survival thriller “The Lost Bus,” starring Matthew McConaughey and America Ferrera, into the top 20.\n\t\n\n\tUniversal Pictures pulled off an impressive hat trick with its three big 2025 moneymakers: Jon M. Chu’s musical sequel “Wicked: For Good,” Dean DeBlois’ live-action remake “How to Train Your Dragon” and Gareth Edwards’ dinosaur flick “Jurassic World: Rebirth.”\n\n\tNetflix steered one of its best picture frontrunners into the fold with Guillermo del Toro’s “Frankenstein,” in addition to Anthony and Joe Russo’s first-quarter release “The Electric State,” which stars Millie Bobby Brown and Chris Pratt.\n\n\tEdgar Wright’s remake of “The Running Man” with Glen Powell debuts on the list for Paramount Pictures, alongside the last film in the popular Tom Cruise action franchise, “Mission: Impossible – The Final Reckoning.”\n\n\tThe Academy does not release the top 20 externally and declined to comment or confirm if these films had advanced to the next round.\n\n\tThe preliminary voting period for the Oscars shortlist begins Monday, Dec. 8, at 9 a.m. PT and ends Friday, Dec. 12, at 5 p.m. PT. The shortlists in 12 categories will be announced on Tuesday, Dec. 16. Afterward, the VFX bake-offs will take place Jan. 10-11, when the final 10 films will present to members of the branch for final nomination consideration. Voting for all branches occurs Jan. 12-16, with the nominations being announced Thursday, Jan. 22.\n\n\tThe 98th Academy Awards are scheduled for March 15, 2026.\n\n\tThe Top 20 finalists are below:\n\n\t“Avatar: Fire and Ash” (20th Century Studios)“Captain America: Brave New World” (Marvel Studios)“The Electric State” (Netflix)“F1” (Apple Original Films/Warner Bros.)“The Fantastic Four: First Steps” (Marvel Studios)“Frankenstein” (Netflix)“How to Train Your Dragon” (Universal Pictures)“Jurassic World: Rebirth” (Universal Pictures)“Lilo and Stitch” (Walt Disney Pictures)“The Lost Bus” (Apple Original Films)“Mickey 17” (Warner Bros.)“A Minecraft Movie” (Warner Bros.)“Mission: Impossible – The Final Reckoning” (Paramount Pictures)“Predator: Badlands” (20th Century Studios)“The Running Man” (Paramount Pictures)“Sinners” (Warner Bros.)“Superman” (DC Studios)“Thunderbolts*” (Marvel Studios)“Tron: Ares” (Walt Disney Pictures)“Wicked: For Good” (Universal Pictures)\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Oscars Visual Effects Top 20 Finalists: ‘Avatar,’ ‘Frankenstein,’ ‘Predator,’ ‘Sinners,’ ‘Wicked’ and More Make the Cut (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/Avatar-Fire-and-Ash-Sinners-Predator-Badlands-Frankenstein-Wicked-For-Good.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-27T00:30:57.000Z",
      "dateModified": "2025-11-27T00:30:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Oscar Winner Guneet Monga Kapoor-Led Women in Film India Launches Mental Health Initiative ‘The Resilience Playbook’ (EXCLUSIVE)",
    "url": "https://variety.com/2025/film/news/guneet-monga-kapoor-women-in-film-india-mental-health-initiative-1236593408/",
    "image": "https://variety.com/wp-content/uploads/2025/11/Guneet-Rabia.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-26T23:45:19.000Z",
    "description": "\n\tWomen in Film India is addressing the emotional toll of working in the entertainment industry with a new mental wellness program designed specifical",
    "body": "\n\tWomen in Film India is addressing the emotional toll of working in the entertainment industry with a new mental wellness program designed specifically for women filmmakers.\n\n\tThe organization has launched “The Resilience Playbook,” a six-week workshop series focused on mental well-being and emotional sustainability for women working in Indian cinema. The immersive program aims to provide participants with tools to manage the pressures of an industry characterized by constant reinvention, rejection, and demanding work conditions.\n\t\n\n\tLed by wellness practitioner and life coach Chetna Chakravarthy, the workshops go beyond traditional self-care approaches to focus on building confidence, clarity, and self-worth as professional skills essential to creative longevity. The peer-driven format allows women filmmakers to rebuild balance and reconnect with their creative practice in a supportive environment.\n\n\n\tThe initiative comes as global conversations around burnout and mental health increasingly reshape creative industries, with WIF India positioning emotional well-being as a professional necessity rather than a personal luxury.\n\n\t“We are an industry built on freelancers, a creative ecosystem that thrives on independent talent. But with that comes a great deal of uncertainty,” said Guneet Monga Kapoor, Academy Award-winning producer (“The Elephant Whisperers”) and founder of WIF India. “For creativity to truly flow, what one needs most is resilience. It is the core skill that allows us to endure, to adapt, and to carve out our place in this ever-changing industry.”\n\t\n\n\tThe program addresses challenges particularly acute for women in film, who often face systemic inequities and heightened scrutiny alongside the long hours, erratic schedules, and relentless pace common to filmmaking. WIF India notes that while conversations around opportunity and representation have expanded, the emotional cost of sustaining careers in the industry remains largely unexamined.\n\n\t“This programme is our safe harbor, a place to drop the armor, soften, and still feel powerful,” said Rabia Chopra, head of programs and development at WIF India. “Vulnerability is our sharpest intelligence, and resilience is what we build when we hold each other up.”\n\n\tWIF India is subsidizing the workshop to make it accessible to participants. Monga Kapoor emphasized the organization’s commitment to providing these resources, noting Chakravarthy’s impact on her personally and professionally.\n\n\tThe initiative represents WIF India’s broader mission to redefine empowerment in cinema beyond visibility and access to include balance, belonging, and the emotional foundation necessary for sustained creative work.\n\n\tThe initiative was unveiled on the sidelines of the WAVES Film Bazaar, the market component of the International Film Festival of India (IFFI), Goa.  \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Oscar Winner Guneet Monga Kapoor-Led Women in Film India Launches Mental Health Initiative ‘The Resilience Playbook’ (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/Guneet-Rabia.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-26T23:45:19.000Z",
      "dateModified": "2025-11-26T23:45:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Suraj Sharma and Director Jennifer E. Montgomery on True-Story Thriller ‘This Tempting Madness’ Ahead of IFFI Premiere",
    "url": "https://variety.com/2025/film/festivals/suraj-sharma-jennifer-montgomery-this-tempting-madness-iffi-1236593375/",
    "image": "https://variety.com/wp-content/uploads/2025/11/Tempting-Madness.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-26T23:19:53.000Z",
    "description": "\n\tAhead of the premiere of “This Tempting Madness” at the International Film Festival of India (IFFI), director Jennifer E. Montgomery and actor Suraj",
    "body": "\n\tAhead of the premiere of “This Tempting Madness” at the International Film Festival of India (IFFI), director Jennifer E. Montgomery and actor Suraj Sharma spoke about shaping the psychological thriller’s real-life origins, its non-linear dive into memory and the casting process that ultimately centered on Simone Ashley’s performance. \n\n\tMontgomery described the story as “largely true,” while Sharma — returning to IFFI more than a decade after “Life of Pi” opened it — reflected on the script’s density and the collaborative spirit that drew him to the film.\n\t\n\n\tInspired by a true incident, the story follows Mia, played by Simone Ashley (“Bridgerton”), who awakens from a coma after a near-fatal fall. Gravely injured and unable to fully recall her past, she learns that her husband is missing. As her fractured memories resurface, Mia becomes confused and overwhelmed by a surge of emotions. The cast also includes Austin Stowell (“NCIS: Origins”) and Zenobia Shroff (“The Marvels”).\n\n\n\t“It’s a wild story because the strangest parts are true,” says Montgomery, who co-wrote the script with Andrew M. Davis. “I would say it is largely true, though some pieces were pushed a little further for interpretation.”\n\n\tThe three lead roles are played by actors of South Asian origin. Speaking about the casting, Montgomery says the process revolved around Simone Ashley. “We anchored the whole movie around her. Simone really took me by surprise. She was exciting and brought a fierce intensity to the role. She was fresh off ‘Bridgerton’ at the time, so we were thrilled to cast her. That gave us the opportunity to cast the rest of the family, which is how we found Suraj and Zenobia Shroff.”\n\t\n\n\tFor Sharma, the appeal of lay in “the collaborative spirit of the team and the script. It’s extremely dense and complicated,” said Sharma, who plays Mia’s brother.\n\n\tOn the themes, Montgomery says that as the title suggests, “This Tempting Madness” is “ambitious in its darkness, intensity, emotion, and structure. It’s non-linear because it deals with memory – and memory is inherently non-linear.”\n\n\tThe IFFI premiere aligns with Montgomery’s belief that great stories don’t have borders. “It was always important to us that the world see the movie,” she says, adding that she is preparing for an early 2026 release.\n\n\tBased in the U.S., Sharma said he hopes to do more work in India. His last Indian project was the 2023 Hindi film “Gulmohar.” “It has been tough straddling two industries, but a valuable learning experience. I hope I get good jobs in India too. I want to be one of those actors who gets to do both,” he says.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Suraj Sharma and Director Jennifer E. Montgomery on True-Story Thriller ‘This Tempting Madness’ Ahead of IFFI Premiere",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/Tempting-Madness.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-26T23:19:53.000Z",
      "dateModified": "2025-11-26T23:19:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Anshuman Jha, Devashish Makhija Team for Crime Noir Thriller (EXCLUSIVE)",
    "url": "https://variety.com/2025/film/markets-festivals/anshuman-jha-devashish-makhija-crime-noir-thriller-1236593391/",
    "image": "https://variety.com/wp-content/uploads/2025/11/Anshuman-Jha-Devashish-Makhija.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-26T23:31:44.000Z",
    "description": "\n\tIndian filmmaker Devashish Makhija and actor-producer Anshuman Jha are joining forces for a crime noir thriller, marking their first collaboration.\n",
    "body": "\n\tIndian filmmaker Devashish Makhija and actor-producer Anshuman Jha are joining forces for a crime noir thriller, marking their first collaboration.\n\n\tThe as-yet-untitled project represents a convergence of two distinctive voices in contemporary Indian cinema. Makhija, whose internationally recognized filmography includes “Joram,” “Bhonsle” and “Ajji,” is developing what’s being described as a high-tension genre piece.\n\n\n\tJha, coming off “Lord Curzon Ki Haveli,” has been cast in the lead role. The actor has built a career across diverse projects including “Love Sex Aur Dhokha,” “Chauranga,” “Lakadbaggha” and “No Fathers in Kashmir.” Beyond acting, Jha has established himself as a producer with an independent production and theatrical release infrastructure.\n\t\n\n\t“I hope for this film to be the one I will be remembered by when I die,” Makhija said. “I’ve been following Anshuman Jha’s journey for years. There is a stillness and an intensity in him that is rare and feels right for this film we will make together. The character demands restraint, chaos, fragility and power, and I believe Anshuman can bring all of that, sometimes all at once.”\n\n\tJha expressed enthusiasm for the project, noting it represents his most exciting script opportunity in 15 years. “Devashish is one of the most fearless and original storytellers we have. His cinema is not just watched — it is experienced. To collaborate with him is both a privilege and a challenge – one I’ve been craving for. This script shook me, and that’s always the sign to say yes.”\n\n\tThe production is structured as an Indo-German-French co-production, with India’s First Ray Films serving as the Indian production company. Makhija and Jha were recently at the WAVES Film Bazaar finalizing structural details for the film.\n\t\n\n\tWAVES Film Bazaar is the market component of the International Film Festival of India (IFFI), Goa. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Anshuman Jha, Devashish Makhija Team for Crime Noir Thriller (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/Anshuman-Jha-Devashish-Makhija.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-26T23:31:44.000Z",
      "dateModified": "2025-11-26T23:31:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jackson Browne’s Son Ethan, Who Appeared in ‘Raising Helen,’ Dies at 52",
    "url": "https://variety.com/2025/film/news/ethan-browne-dead-jackson-browne-raising-helen-1236593364/",
    "image": "https://variety.com/wp-content/uploads/2025/11/GettyImages-50902373-e1764198114772.jpg?crop=0px%2C8px%2C2000px%2C1125px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2025-11-26T23:19:25.000Z",
    "description": "\n\tEthan Browne, who appeared in films including Kate Hudson’s “Raising Helen” and “Hackers,” was found dead in his home on Tuesday, his father, singer",
    "body": "\n\tEthan Browne, who appeared in films including Kate Hudson’s “Raising Helen” and “Hackers,” was found dead in his home on Tuesday, his father, singer Jackson Browne announced on Instagram. Ethan Zane Browne was 52.\n\n\tThe Los Angeles Coroner’s Office lists the cause of death as “deferred.”\n\n\tJackson Browne wrote, “It is with deep sorrow that we share that on the morning of November 25, 2025, Ethan Browne, the son of Jackson Browne and Phyllis Major, was found unresponsive in his home and has passed away. We ask for privacy and respect for the family during this difficult time. No further details are available at this moment.”\n\t\n\n\tEthan Browne worked as a model for designers including Isaac Mizrahi and as a dj and musician. He also appeared in the TV show “Birds of Prey.”\n\n\n\tAs a baby, he appeared on the cover of Rolling Stone with his father holding him and nuzzling his face.\n\n\tIn an interview with Route magazine, Jackson Browne discussed what it was like being a parent after his wife died. \n\n\t“It was my main focus,” he said. “I only had two things that I hoped I could fit together: being a songwriter and a father. And I looked at it like this, if I have to only be a father, I hope I’ll know it, and just do that. But life’s not like that and you don’t get a notice in the mail saying you’re blowing it as a parent. You think you have the advice and the help you need, and sometimes you don’t, or you don’t heed it. The mistakes I’ve made as a parent are still with me. I think about them fairly often. It’s not that you’re not trying the whole time. It’s not that I wasn’t trying then. You’re just distracted by other things and some things don’t occur to you. Or maybe you ignore advice that you should have taken, because you’re overconfident.”\n\t\n\n\tHis mother was Jackson Browne’s first wife, Phyllis Major, an actress and model who died of an overdose just three years after Ethan was born. Major appeared in the film “The Candy Snatchers” and Jackson Browne’s songs “Ready or Not,” “Sleep’s Dark” and “Silent Gate” were said to be about her. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jackson Browne’s Son Ethan, Who Appeared in ‘Raising Helen,’ Dies at 52",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/GettyImages-50902373-e1764198114772.jpg?crop=0px%2C8px%2C2000px%2C1125px&resize=1000%2C563"
      ],
      "datePublished": "2025-11-26T23:19:25.000Z",
      "dateModified": "2025-11-26T23:19:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Everybody Loves Raymond: 30th Anniversary Reunion’ Scores High Ratings, Gets Encore Airing (TV News Roundup)",
    "url": "https://variety.com/2025/tv/news/tv-news-roundup-week-of-november-24-1236591277/",
    "image": "https://variety.com/wp-content/uploads/2025/11/3123414_0119bc3_1ee74c.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-26T23:13:09.000Z",
    "description": "\n\t“Everybody Loves Raymond: 30th Anniversary Reunion” averaged 6.32 million viewers on Nov. 24, making it the most-watched primetime entertainment spe",
    "body": "\n\t“Everybody Loves Raymond: 30th Anniversary Reunion” averaged 6.32 million viewers on Nov. 24, making it the most-watched primetime entertainment special so far this TV season. Taking advantage of strong interest in the reunion, CBS will air an encore of the special on Nov. 28.\n\n\tAccording to Nielsen ratings, “Everybody Loves Raymond: 30th Anniversary Reunion” was the most-watched special on CBS since the 77th Emmy Awards in September (7.59 million). The special’s live+same day ratings were higher than any primetime non-sports program this season except for “60 Minutes,” “Tracker,” “Dancing With the Stars” and “Matlock.”\n\t\n\n\tAlso, among other tribute specials on CBS in recent years, it was up 56% vs. “Newhart: Legacy of Laugher” (4.05 million on July 22, 2024) and up 108% vs. “Dick Van Dyke: 98 Years of Magic” (3.04 million on Dec. 21, 2023.)\n\n\n\tThe 90-minute special hosted by Ray Romano and Phil Rosenthal offered a look back into the production of “Everybody Loves Raymond.”  Brad Garrett, Patricia Heaton, Madylin Sweeten, Monica Horan and more were featured throughout the special, where they shared exclusive behind the scenes stories and fun facts in celebration of 30 years of the series. \n\n\t“Everybody Loves Raymond” premiered on CBS in 1996 and ran for nine seasons until 2005. \n\t\n\t\tFIRST LOOKS\t\n\n\tThe HBO Original documentary “Music Box: Wizkid: Long Live Lagos” will debut Dec. 11 on HBO and will be available to stream on HBO Max.  \n\n\t“Music Box: Wizkid: Long Live Lagos” follows “how art and music have the power to shift global perception and awareness through the story of Nigerian superstar Wizkid as he prepares for his groundbreaking performance at the Tottenham Hotspur Stadium in London, England. One of the most commercially successful African musicians of all time, Wizkid’s talent and authenticity transcends borders and brings African music to the world stage, challenging the stereotypes in Western media and reclaiming African identity.”\n\t\n\n\tFemi Anikulapo-Kuti, Jada Pollock, Julie Adenuga, Seni Saraki, Sunday Are, Starboy, Karen Binns and Tops star in the documentary.\n\n\tWatch the trailer for “Music Box: Wizkid: Long Live Lagos” below:\n\n\n\n\t\n\t\tDATES\t\n\n\t+Life’s “HIV Unwrapped World AIDS Day” special, hosted by journalist Karl Schmid, will premiere on Hulu on Nov. 30.\n\n\tThe special will highlight the program’s initiative to blend science, fashion and storytelling to spotlight HIV awareness at New York Fashion Week 2025. Through runway moments, behind-the-scenes access and intimate personal stories, the special highlights “how creativity can dismantle stigma, bridge generations and reimagine advocacy for the modern era.”\n\n\tModels and special guests included Javier Muñoz (activist and actor, “Hamilton”), Demetre Daskalakis (Former director of CDC’s Center for Immunization and Respiratory Diseases), Mary Gibson (singer), Art Bezrukavenko (content creator), Mila Jam (singer), John Friia (host, “Taxi TV”), Jay Valle (NBC Out), Lionel Moise (ABC News), Mark Mackillop (“Broadway Bares”) and more. \n\n\t* \n\n\t“Un Abogado en Nueva York” (A Lawyer in New York), the legal microdrama created by immigration attorney Aníbal Romero, returns for its second season on Nov. 26.\n\n\tThe six-episode anthology legal microdrama will debut free on YouTube with new episodes premiering monthly.\n\n\tAccording to the official synopsis, the series “continues Romero’s vision of transforming real-life legal dramas into gripping, character-driven storytelling that merges authenticity with cinematic craft. Season 2 deepens its cross-cultural scope by uniting international creators and top Hollywood talent.”\n\t\n\t\tPROGRAMMING\t\n\n\t“Def Comedy Jam” has officially found a new home on Revolt, with the show’s library of episodes airing weeknights at 11 p.m. ET on the network.\n\n\tWith its arrival on Revolt, “Def Comedy Jam” will bring its archive of landmark performances from Bernie Mac, Dave Chappelle, Chris Rock, Kevin Hart and other comedians who began their careers on the show.\n\n\t“’Def Comedy Jam’ opened the door for so many of us, and forever changed the landscape of the genre. It gave Black comedians the space to tell our stories and jokes exactly the way we wanted,” Cedric The Entertainer said in a statement. “Seeing the show come back to life on Revolt proves that the foundation we built is still inspiring audiences today.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Everybody Loves Raymond: 30th Anniversary Reunion’ Scores High Ratings, Gets Encore Airing (TV News Roundup)",
      "image": [
        "https://variety.com/wp-content/uploads/2025/11/3123414_0119bc3_1ee74c.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-26T23:13:09.000Z",
      "dateModified": "2025-11-26T23:13:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rachel Griffiths Revisits ‘Muriel’s Wedding,’ Hollywood Breakthroughs and Her Shift to Filmmaker at WAVES Film Bazaar",
    "url": "https://variety.com/2025/film/markets-festivals/rachel-griffiths-muriels-wedding-waves-film-bazaar-1236593363/",
    "image": "https://variety.com/wp-content/uploads/2025/06/Rachel-Griffiths.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2025-11-26T23:06:39.000Z",
    "description": "\n\tAt India’s WAVES Film Bazaar’s Knowledge Series, Rachel Griffiths unpacked the path from her breakout as Rhonda in “Muriel’s Wedding” to a career th",
    "body": "\n\tAt India’s WAVES Film Bazaar’s Knowledge Series, Rachel Griffiths unpacked the path from her breakout as Rhonda in “Muriel’s Wedding” to a career that spans Oscar-nominated turns, prestige U.S. television and now a determined push into authorship. \n\n\tIn a candid conversation with producer Mitu Bhowmick Lange, Griffiths traced how a role she “chanced upon” upended her expectations of what cinema had space for, why American TV unlocked the depth she sought, and how returning to Australia — and directing “Ride Like a Girl” — became central to reclaiming her voice as a storyteller.\n\t\n\n\tShe shared that her iconic turn came about almost by accident. “I thought I’d be a theater actress,” she said. “I grew up thinking cinema didn’t have a place for someone like me.” With a background in stage performance and documentary storytelling, she never expected that the quirky Australian comedy she “chanced upon” would rocket her into international film — and straight to working in England after the movie’s surprise success.\n\n\n\tIn 1998, Griffiths earned a best supporting actress nomination at the Academy Awards for her role in “Hilary and Jackie.” Her career reached a turning point when she embraced television. “I was frustrated with the breadth of roles. My manager suggested I look at TV, particularly in America, where actresses get deeper opportunities.” That shift led her to “Six Feet Under,” created by Alan Ball, which she calls one of the best scripts she ever read. The long-form format, she said, “Was thrilling – you know your character, you know the world, and you get to explore both in real depth.”\n\t\n\n\tThe role won her a Golden Globe and a slate of acclaimed roles followed. After more than a decade in the U.S., Griffiths chose to return home. The decision was both artistic and personal, she said. “I wanted to make sense of my own country. I wanted my kids to feel Australian.” That instinct drove her to make her direct “Ride Like a Girl,” the biopic of jockey Michelle Payne, which ended up as Australia’s highest-grossing film of 2019. \n\n\t“I didn’t want to contribute to the narrative that female-led films aren’t box office,” she said. “I wanted to make a movie that a conservative grandfather could take his granddaughters to and not realize he’s watching a feminist film and be cheering for the girl at the end. I also really wanted to make a successful box office film.”\n\n\tGriffiths is currently exploring an immersive theatrical project, inspired by large-scale experiences like the global Van Gogh installations. “Sometimes the budget, the audience and the impact make more sense in a completely different form,” she said.\n\n\tGriffiths ended with advice for emerging female creators: become producers, acquire IP, and trust actors’ instincts for audience connection. She also expressed strong enthusiasm for Australian-Indian collaborations, pointing to growing cultural links, shared storytelling potential and new distribution agreements.\n\n\tWAVES Film Bazaar is the market component of the International Film Festival of India (IFFI), Goa. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rachel Griffiths Revisits ‘Muriel’s Wedding,’ Hollywood Breakthroughs and Her Shift to Filmmaker at WAVES Film Bazaar",
      "image": [
        "https://variety.com/wp-content/uploads/2025/06/Rachel-Griffiths.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2025-11-26T23:06:39.000Z",
      "dateModified": "2025-11-26T23:06:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'Seeking Sister Wife' Star Garrick Merrifield Threatened to Call ICE on Wife",
    "url": "https://www.tmz.com/2025/11/26/garrick-merrifield-threat-call-ice-on-wife/",
    "image": "https://imagez.tmz.com/image/8a/16by9/2025/11/26/8ac1d0def96d4a3ab77923e8fe0d1382_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-26T23:09:01.000Z",
    "description": "\n    \n                    \n                          'Seeking Sister Wife' Star Garrick Merrifield\n                          Threatened Wife With Depo",
    "body": "\n    \n                    \n                          'Seeking Sister Wife' Star Garrick Merrifield\n                          Threatened Wife With Deportation Before His Arrest\n                      \n                  \n                        Published November 26, 2025 3:09 PM PST\n                                                                      |\n                Updated November 26, 2025 4:27 PM PST\n                                    \n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          \"Seeking Sister Wife\" star Garrick Merrifield was arrested Monday for domestic violence against his wife ... and now we've uncovered explosive details on the dramatic incident, including a threat to call Immigration and Customs Enforcement.\n      \n    \n          According to an affidavit for arrest warrant, obtained by TMZ, Garrick's wife, Larrana, told police her husband snatched her phone during a heated argument, refusing to allow her to contact her family in Brazil.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          The docs say Larrana informed Garrick she wanted to call police, but he wouldn't give her phone back, and he threatened to call ICE. Larrana told cops she was terrified because she isn't familiar with all the laws, even though she's in the country legally on a visa.\n      \n\n          As a result, Larrana did an internet search for how to contact law enforcement, which she believes Garrick found out about because he deactivated the Wi-Fi on her devices.\n      \n    \n          Even though she didn't want Garrick arrested, the police busted him anyway on charges of domestic violence, according to the affidavit.\n      \n    \n          Garrick and Larrana wed in October 2024 and welcomed a daughter this past July.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          He is in a plural marriage with his first wife, Dannielle. They have three older children together and they legally divorced years ago so Garrick could marry two other women ... both from Brazil.\n      \n    \n          We've reached out to Garrick for comment ... so far, no word back.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                TV\n              \n                          \n                ICE\n              \n                          \n                Reality TV\n              \n                          \n                Exclusive\n              \n                          \n                Fairly Legal\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Seeking Sister Wife' Star Garrick Merrifield Threatened to Call ICE on Wife",
      "image": [
        "https://imagez.tmz.com/image/8a/16by9/2025/11/26/8ac1d0def96d4a3ab77923e8fe0d1382_xl.jpg"
      ],
      "datePublished": "2025-11-26T23:09:01.000Z",
      "dateModified": "2025-11-26T23:09:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "TikTok Star Marquay The Goat Dead at 24",
    "url": "https://www.tmz.com/2025/11/26/tiktok-marquay-the-goat-dead/",
    "image": "https://imagez.tmz.com/image/03/16by9/2025/11/26/037261081fab4f4c859ab44731f7ad48_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-26T21:29:28.000Z",
    "description": "\n    \n                    \n                          TikTok Star Marquay The Goat\n                          Dead at 24\n                      \n        ",
    "body": "\n    \n                    \n                          TikTok Star Marquay The Goat\n                          Dead at 24\n                      \n                  \n                        Published November 26, 2025 1:29 PM PST\n                                                                      |\n                Updated November 26, 2025 3:46 PM PST\n                                    \n      \n    \n      \n        \n              \n    \n    \n          Marquay Collins, a TikTok star who posted food reviews and fast cars, is dead ... TMZ has confirmed.\n      \n    \n          Known as \"Marquay The Goat\" on social media, Marquay's mother tells us her son died recently ... though the cause of death is unclear.\n      \n    \n          Marquay's mom, Sonja, is remembering him as \"the sweetest person he didn’t have a mean bone in his body.\"\n      \n\n                  \n          \n                          \n                \n                  \n      \n    \n          He had 6.9 million followers on TikTok and another 479,000 on Instagram.\n      \n    \n          An obituary online says Marquay was not only a \"talented artist on TikTok\" but also a student at Georgia State University, and a proud graduate of Shaw High School, and Dimon Elementary.\n      \n    \n        Waiting for your permission to load the Instagram Media.\n      \n    \n          The obit says ... \"Marquay lived his life with passion and ambition. He was full of excitement about the future, always eager to share his plans and adventures. His hugs, his laughter, and his spontaneous calls -- 'What are we getting into this weekend?' -- will be remembered as cherished moments that captured his vibrant personality.\"\n      \n    \n          Marquay was only 24.\n      \n    \n          RIP\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Celebrity News\n              \n                          \n                RIP\n              \n                          \n                TikTok\n              \n                          \n                Fairly Legal\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "TikTok Star Marquay The Goat Dead at 24",
      "image": [
        "https://imagez.tmz.com/image/03/16by9/2025/11/26/037261081fab4f4c859ab44731f7ad48_xl.jpg"
      ],
      "datePublished": "2025-11-26T21:29:28.000Z",
      "dateModified": "2025-11-26T21:29:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jackson Browne's Son Ethan Browne Dead at 52",
    "url": "https://www.tmz.com/2025/11/26/jackson-browne-son-ethan-dead-dies/",
    "image": "https://imagez.tmz.com/image/f5/16by9/2025/11/26/f55be2a1f0654992b3eb8859f5126e33_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-26T22:19:07.000Z",
    "description": "\n    \n                    \n                          Jackson Browne\n                          Son Dead at 52\n                      \n                  ",
    "body": "\n    \n                    \n                          Jackson Browne\n                          Son Dead at 52\n                      \n                  \n                        Published November 26, 2025 2:19 PM PST\n                                                                      |\n                Updated November 26, 2025 3:45 PM PST\n                                    \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Jackson Browne says his son Ethan Browne, an actor, model and musician, is dead.\n      \n    \n          Jackson says ... \"It is with deep sorrow that we share that on the morning of November 25, 2025, Ethan Browne, the son of Jackson Browne and Phyllis Major, was found unresponsive in his home and has passed away. We ask for privacy and respect for the family during this difficult time. No further details are available at this moment.\"\n      \n    \n          The famous singer/songwriter announced his son's death Wednesday on social media.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Ethan's mom, Phyllis Major, died by suicide in 1976 when Ethan was just a toddler. Ethan appeared in the 2004 film, \"Raising Helen\" with Kate Hudson. He was also an accomplished model who worked with Isaac Mizrahi.\n      \n    \n          When Ethan was a baby back in 1974, he was featured on a Rolling Stone cover with his father. The two were photographed with Jackson nuzzling his son's face.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Jackson proudly said of his son back in 2022, \"Ethan is a great father. He's a great son, a great man ... I love seeing him with his kids.\" Jackson went on ... \"when I see him in his movies, modeling, with his daughter, and being such a great dad, it makes me very proud.\"\n      \n    \n          The L.A. County Medical Examiner has deferred the cause of death, pending the investigation.\n      \n    \n          Ethan was 52.\n      \n    \n          RIP\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                RIP\n              \n                          \n                Family\n              \n                          \n                Celebrity Death\n              \n                          \n                Music\n              \n                          \n                Fairly Legal\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jackson Browne's Son Ethan Browne Dead at 52",
      "image": [
        "https://imagez.tmz.com/image/f5/16by9/2025/11/26/f55be2a1f0654992b3eb8859f5126e33_xl.jpg"
      ],
      "datePublished": "2025-11-26T22:19:07.000Z",
      "dateModified": "2025-11-26T22:19:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Grand Jury Convened in Death of Celeste Rivas",
    "url": "https://www.tmz.com/2025/11/26/grand-jury-convened-in-death-of-celeste-rivas/",
    "image": "https://imagez.tmz.com/image/b0/16by9/2025/11/22/b0475b2663f8420683dd4641fd8f8d0d_xl.jpg",
    "tag": "Entertainment",
    "date": "2025-11-26T21:19:17.000Z",
    "description": "\n    \n                    \n                          Celeste Rivas\n                          Grand Jury Reportedly Investigating Apparent Homicide\n   ",
    "body": "\n    \n                    \n                          Celeste Rivas\n                          Grand Jury Reportedly Investigating Apparent Homicide\n                      \n                  \n                        Published November 26, 2025 1:19 PM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          A grand jury was reportedly convened to gather information on the death of Celeste Rivas.\n      \n    \n          The grand jury heard evidence for several days in mid-November ... this according to the Los Angeles Times. The Times reported the existence of the grand jury was disclosed in the LAPD's petition to block the L.A. County Medical Examiner's Office from release information about her death.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          The grand jury was assembled as an investigative tool, and not to specifically indict anyone for Celeste's death. It has the ability to recommend charges, and it's unclear if it did so. It's also unclear if that grand jury is still gathering evidence.\n      \n\n          The grand jury is empowered to subpoena witnesses and gather evidence.\n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          TMZ broke the story ... the LAPD is considering Celeste's death a homicide, and singer D4vd is a suspect. We're also told there is a second suspect who may have assisted in dismembering her body.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Celeste Rivas\n              \n                          \n                D4vd\n              \n                          \n                D4vd Tesla Case\n              \n                          \n                Hip Hop\n              \n                          \n                Music\n              \n                          \n                Fairly Legal\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Grand Jury Convened in Death of Celeste Rivas",
      "image": [
        "https://imagez.tmz.com/image/b0/16by9/2025/11/22/b0475b2663f8420683dd4641fd8f8d0d_xl.jpg"
      ],
      "datePublished": "2025-11-26T21:19:17.000Z",
      "dateModified": "2025-11-26T21:19:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Danny Trejo Tells Families Affected by ICE Raids to Keep Up Hope",
    "url": "https://www.tmz.com/2025/11/26/danny-trejo-encourages-families-enduring-ice-raids/",
    "image": "https://imagez.tmz.com/image/16/16by9/2025/11/26/16f09d7a0a7143f586fd772c77de11ee_xl.png",
    "tag": "Entertainment",
    "date": "2025-11-26T23:52:06.000Z",
    "description": "\n    \n                    \n                          Danny Trejo\n                          Don't Give Up Hope!!!\n                          Thanksgivin",
    "body": "\n    \n                    \n                          Danny Trejo\n                          Don't Give Up Hope!!!\n                          Thanksgiving Message for Struggling Families\n                      \n                  \n                        Published November 26, 2025 3:52 PM PST\n                                                                            \n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          Danny Trejo had some sage advice when we caught up with him Wednesday afternoon at the L.A. Mission ... no matter what, don't lose hope.\n      \n    \n          The 81-year-old movie star chatted with us while volunteering to help families struggling this Thanksgiving. He says helping people has been key to his happiness.\n      \n    \n          He told us, \"The more I can do for people, the better my life gets.\"\n      \n\n          He must have helped a boatload of people, because he's doing fantastic. A source told us he had a knee replacement, and when we saw him Wednesday, he was walking around like he was 20 years younger.\n      \n    \n          Danny's prescription for hard times even applies to people affected by recent ICE raids in the city, he told us.\n      \n    \n          \"To the families ... You know what? Keep up hope,\" he said. \"Help your neighbor and do whatever you can for people in need.\"\n      \n    \n          Watch the video to see what Danny also had to say about a possible \"Con Air\" sequel.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Danny Trejo\n              \n                          \n                Celebrity News\n              \n                          \n                ICE\n              \n                          \n                Thanksgiving\n              \n                          \n                Fairly Legal\n              \n                          \n                In The Field\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Danny Trejo Tells Families Affected by ICE Raids to Keep Up Hope",
      "image": [
        "https://imagez.tmz.com/image/16/16by9/2025/11/26/16f09d7a0a7143f586fd772c77de11ee_xl.png"
      ],
      "datePublished": "2025-11-26T23:52:06.000Z",
      "dateModified": "2025-11-26T23:52:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]