[
  {
    "title": "‘Queen of My Dreams’ Director Fawzia Mirza to Helm South Asian Paranormal Thriller ‘Bhoot’ (EXCLUSIVE)",
    "url": "https://variety.com/2026/film/news/queen-of-my-dreams-fawzia-mirza-thriller-bhoot-1236632117/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Fawzia-Mirza-Dana-Abraham.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-15T12:21:09.000Z",
    "description": "\n\tFawzia Mirza, the award-winning director of “The Queen of My Dreams,” has been tapped to helm “Bhoot,” an English-language South Asian paranormal th",
    "body": "\n\tFawzia Mirza, the award-winning director of “The Queen of My Dreams,” has been tapped to helm “Bhoot,” an English-language South Asian paranormal thriller from Toronto-based Champ & Pepper and multi-hyphenate Dana Abraham.\n\n\tThe film, written by and co-starring Abraham (“Orphan Black: Echoes”), is eyeing a fall 2026 production start, with casting announcements expected throughout the new year. Champ & Pepper, a marketing agency known for handling global campaigns for major studio releases, is making its first major push into original film production with the project.\n\t\n\n\t“Bhoot” centers on Aru Saha, a young South Asian woman grappling with grief, guilt and generational pressure who arrives with her brother Das and their parents in an ostensibly perfect town concealing a supernatural secret drawn from South Asian folklore. The psychological horror aims to blend emotional family drama with genre elements. \n\n\n\tAbraham is producing under his Red Hill Creative banner alongside Champ & Pepper’s Jeff Pestell and Glenn Karpel. Ella Wahlstedt of Quarterlife Pictures also serves as producer, having developed the screenplay with Abraham from its inception.\n\n\t“‘Bhoot’ is about what haunts us internally – the guilt we inherit, the grief we bury, and the courage it takes to confront both,” said Abraham. “Having Fawzia join us elevates this film in ways I couldn’t imagine. Her voice, vision, and authenticity in championing South Asian stories makes her the perfect filmmaking partner as Champ & Pepper and I build something bold, terrifying, and emotionally resonant. With their decades of global marketing experience and deep studio relationships, we’re preparing for a strategic rollout long before the cameras roll.”\n\t\n\n\tMirza’s feature directorial debut, “The Queen of My Dreams,” world premiered at the Toronto Film Festival and screened at SXSW among dozens of festivals before its theatrical release. The film recently earned a GLAAD Award nomination for outstanding feature and received two Canadian Screen Awards and the Directors Guild of Canada award for best feature, among other honors.\n\n\tThe director most recently wrapped production on Tubi and Webtoon Productions feature “Kissing Is the Easy Part” and will return to direct Season 2 of Hulu comedy series “Deli Boys.”\n\n\t“I’ve been searching for a genre/thriller project to direct. Horror is as visceral as comedy. As evocative as love. As real as romance. Genre is all about the feeling. Dana’s script delivers on all of those emotions. It was an easy ‘Yes!'” Mirza said.\n\n\t“Champ & Pepper is excited to continue our evolution of supporting film through content creation and marketing-first strategies,” added Pestell, president of Champ & Pepper. “Moving into development and production is a natural next step for us and we are thrilled to be partnering with Dana and Red Hill on ‘Bhoot.’ Having a director like Fawzia on board only makes this even more thrilling.”\n\n\tAbraham is currently entering production on sports-comedy series “Strikers,” set to begin filming this spring. He has previously written, produced and starred in three feature films.\n\n\t“Bhoot,” which will feature a fully South Asian principal cast, is being positioned for strategic studio and streamer partnerships across North America and international markets beginning in 2027.\n\n\tMirza is represented by IAG, Alexander Stegmaier and Granderson Des Rochers.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Queen of My Dreams’ Director Fawzia Mirza to Helm South Asian Paranormal Thriller ‘Bhoot’ (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Fawzia-Mirza-Dana-Abraham.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-15T12:21:09.000Z",
      "dateModified": "2026-01-15T12:21:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rotterdam-Bound Horror ‘Bowels of Hell’ Lands at Blue Finch Films (EXCLUSIVE)",
    "url": "https://variety.com/2026/film/news/rotterdam-horror-bowels-of-hell-blue-finch-films-1236631973/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Bowels-of-Hell.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-15T09:00:00.000Z",
    "description": "\n\tBlue Finch Films has picked up international sales rights to “Bowels of Hell,” a genre-bending horror film set to make its world premiere at the Int",
    "body": "\n\tBlue Finch Films has picked up international sales rights to “Bowels of Hell,” a genre-bending horror film set to make its world premiere at the International Film Festival Rotterdam this month. The U.K. sales and distribution company secured worldwide rights excluding Brazil and plans to begin market screenings at Berlin’s European Film Market in February. \n\n\tThe film centers on Malu, whose struggles with unresolved trauma and a difficult child take a nightmarish turn when an inexplicable curse brings toilets to life as murderous creatures, plunging her into a bizarre realm where maternal responsibilities, loss and existential dread intertwine.\n\t\n\n\tGustavo Vinagre and Gurcius Gewdner co-wrote and co-directed the project. Vinagre earned the Berlinale Teddy Award for “Three Tidy Tigers Tied a Tie Tighter,” while Gewdner helmed “Pazucus: Island of Vomit and Despair.” Brazilian powerhouse RT Features produced through Rodrigo Teixeira, Berta Marchiori and Tereza Alvarez. The company’s credits span Oscar-winning titles including “Call Me by Your Name,” “I’m Still Here” and “The Witch.”\n\n\n\tNetflix’s “Pedaço de Mim” actor Martha Nowill takes the lead. Supporting players include Otávio Müller (“Alemão: Both Sides of the Operation”), Chandelly Braz (Netflix’s “Maria e o Cangaço”), Marco Pigossi (SXSW selection “High Tide”), Regina Braga (“Deus Nos Acuda”) and Olivia Torres (Oscar winner “I’m Still Here”). Brazilian veteran Maria Gladys (“Rat Fever”) and director Bruce LaBruce round out the cast.\n\n\t“We made ‘Bowels of Hell’ out of a deep affection for horror and with the playful sensibility of childhood — a space where fear becomes tender, and imagination turns darkness into something strangely loving,” said Vinagre and Gewdner.\n\t\n\n\tMike Chapman of Blue Finch Films called the project “both a provocative and bold piece of filmmaking from Gustavo and Gurcius. Combining jaw dropping genre moments and profound themes, it will stick with viewers for a multitude of reasons.”\n\n\tOther titles on Blue Finch’s slate include Fantastic Fest premiere “Dolly,” Jessica Rothe-led sci-fi horror “Affection” and George MacKay starrer “Mission,” a BBC Film production.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rotterdam-Bound Horror ‘Bowels of Hell’ Lands at Blue Finch Films (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Bowels-of-Hell.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-15T09:00:00.000Z",
      "dateModified": "2026-01-15T09:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sámi Drama ‘Árru’ Boarded by The Yellow Affair Ahead of World Premiere at Berlinale (EXCLUSIVE)",
    "url": "https://variety.com/2026/film/global/sami-drama-arru-the-yellow-affair-berlinale-1236632012/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Arru.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-15T09:58:38.000Z",
    "description": "\n\tThe Yellow Affair has acquired lyrical Sámi drama “Árru,” which will have its world premiere in the Panorama strand of Berlinale next month.\n\n\tThe f",
    "body": "\n\tThe Yellow Affair has acquired lyrical Sámi drama “Árru,” which will have its world premiere in the Panorama strand of Berlinale next month.\n\n\tThe film, accompanied by evocative “yoik” music and unfolding in scenic Arctic landscapes, explores “the struggle to break the silence surrounding intergenerational trauma,” the company said.\n\n\t“ ‘Árru’ is a moving exploration of Sámi identity and resilience, the dual role of heritage as both a weight and a source of strength, and the tension between preserving cultural identity and doing what is right. The film is wrapped in striking visuals and haunting melodies,” Alexandra Cruz, sales executive, The Yellow Affair, said.\n\t\n\n\tAmid the breathtaking landscapes of Sápmi, reindeer herder Maia fights to protect her ancestral lands from a looming mining project. As protests rise, she turns to her charismatic uncle Lemme for help, but his presence reignites deep-buried traumas. Maia must choose: save the land at the cost of her family or surrender it to break the silence.\n\n\n\t“Árru” marks the directorial debut of filmmaker Elle Sofe Sara, who is also the co-writer of the film alongside Johan Fasting. In addition to being part of a reindeer herder family and shooting her film while caring for her eight-month-old baby, she is described as one of the most interesting choreographers of her generation in Norway, expressing the overlooked areas of Sámi culture. The film stars Sara Marielle Gaup Beaska, Simon Issát Marainen, Ayla Gáren Nutti, and Mikkel Gaup.\n\n\t“This story comes from Sápmi, but its heartbeat is universal: the longing to be recognized, the courage to speak the truth, and the possibility of healing—through song, and through the voices of the next generation,” Sofe Sara said.\n\t\n\n\tThe film is produced by STÆR, an independent production company based in Tromsø, led by main producer and founder Elisa Fernanda Pirir. STÆR has co-produced “Palestine 36” by Annemarie Jacir, which premiered at the Toronto Film Festival and is shortlisted for Best International Feature Film at the 98th Academy Awards, as well as “The Visitor” by Lithuanian director Vytautas Katkus, winner of the best director award at the main competition of the Karlovy Vary Film Festival.\n\n\tSTÆR is currently in post-production on “Wake of Umbra” by Carlos Reygadas, “Awaiting Birds” by Sofía Quirós, “Where the River Begins” by Juan Andrés Arango, and “A Sweetness from Nowhere” by Ester Martin.\n\n\t“Árru” is co-produced by Mimmi Spång from Garage Film International in Sweden, Jani Pösö from It’s Alive in Finland, and Elle Sofe Company in Norway.\n\n\tThe film is financed by the International Sámi Film Institute, the Norwegian Film Institute, the Swedish Film Institute, Finnish Film Foundation, Arctic Film Norway, Sámediggi, New Dawn, Eurimages, Nordisk Film & TV Fond, NRK, YLE, SVT, Sametinget and Cadre Bord.\n\n\tIt has the support of imagineNATIVE and INDIGENOUS Cinema Alliance.\n\n\tThe Yellow Affair slate also includes Joscha Bongard’s “Babystar,” which had its premiere at Toronto Film Festival in the Discovery Selection, and Jonas Ulrich’s black metal drama “Wolves,” which premiered at the Zurich Film Festival, along with Helen Walsh’s “On the Sea,” which had its world premiere at the Edinburgh International Film Festival, and family title “Pixie: The New Beginning,” directed by Krzysztof Komander, which had its world premiere at Locarno Kids.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sámi Drama ‘Árru’ Boarded by The Yellow Affair Ahead of World Premiere at Berlinale (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Arru.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-15T09:58:38.000Z",
      "dateModified": "2026-01-15T09:58:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Misericordia’ Distributor Janus Films Wins Unifrance Distribution Prize for Robust and Witty Release",
    "url": "https://variety.com/2026/film/global/misericordia-janus-films-unifrance-distribution-prize-1236632035/",
    "image": "https://variety.com/wp-content/uploads/2026/01/MixCollage-14-Jan-2026-11-02-PM-5088.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-15T11:43:22.000Z",
    "description": "\n\tArthouse stalwart Janus Films took home the second annual Unifrance Distribution Prize at this year’s Unifrance Rendez-Vous in Paris, collecting $11",
    "body": "\n\tArthouse stalwart Janus Films took home the second annual Unifrance Distribution Prize at this year’s Unifrance Rendez-Vous in Paris, collecting $11,646 in recognition of its handling of Alain Guiraudie’s “Misericordia.” \n\n\tPicked up out of Cannes in 2024, the darkly comic thriller enjoyed a high-profile fall festival run and an awards campaign that landed it on the four-film shortlist for France’s submission for the international feature film Oscar. While it ultimately fell short of an Oscar slot, “Misericordia” more than made up for it with critical acclaim, winning the Louis-Delluc Prize, being named best film of the year by Cahiers du Cinéma, and earning enthusiastic praise from John Waters, who called it “an impossibly perverse thriller…leaving the audience stunned by sexual plot twists and a lulu of an ending.”\n\t\n\n\tAs Janus prepared the film’s U.S. theatrical rollout last March, the distributor leaned into precisely the qualities that prompted Waters’ exclamation: “Yikes! This one’s off the rails!” \n\n\n\n\n\t\n\n\t\t\t\t\tPoster designer Maks Bereski came up with evocative key-art. \n\t\t\t\t\t\t\t\t\tJanus Films\n\t\n\n\n\n\t“It would have been easy to market it as a straight thriller or a romance, but we deliberately leaned into the film’s true tone,” Janus Films’ Benjamin Crossley-Marra said. “It’s a subtle mystery with humor, genuinely creepy undertones, and a sense that something isn’t quite right.”\n\n\tTo reflect the film’s elegance, irreverence, and odd, lyrical mood, Janus commissioned key art from poster designer Maks Bereski (aka Plakiat), using a single core image as the foundation of a multimedia push. “In today’s environment, your imagery has to work everywhere—from a theater lightbox to a 4×5 Instagram post,” Crossley-Marra explains. “That artwork really took off online, and we adapted it across platforms.”\n\t\n\n\tThe distributor also rolled out a playful social-media strategy drawing on the film’s visual textures and motifs, including an interactive map of premiere locations, each represented by a different mushroom. “Audiences could find their city, see their mushroom, and then come to a screening with Alain in attendance,” Crossley-Marra added. “It made for a fun and effective campaign.”\n\n\tJanus will next harness synergy across platforms for its upcoming releases of Hlynur Pálmason’s “The Love That Remains,” Sergei Loznitsa’s “Two Prosecutors,” and Carla Simón’s “Romería,” spotlighting the directors and their earlier films on the Criterion Channel to drive theatrical interest as well.\n\n\t“We’re always looking for ways to reach new audiences,” said Crossley-Marra, who oversees social media for both Janus and Criterion. “Interestingly, younger viewers are going to theaters more than the generation above them. They’re seeking the theatrical experience and are focused on experiences in general. And a film like ‘Misericordia’ is certainly an experience.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Misericordia’ Distributor Janus Films Wins Unifrance Distribution Prize for Robust and Witty Release",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/MixCollage-14-Jan-2026-11-02-PM-5088.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-15T11:43:22.000Z",
      "dateModified": "2026-01-15T11:43:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Berlin-Bound Indonesian Horror ‘Sleep No More,’ From Locarno Winner Edwin, Unveils First Trailer (EXCLUSIVE)",
    "url": "https://variety.com/2026/film/news/berlin-indonesian-horror-sleep-no-more-trailer-1236630819/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Sleep-No-More.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-15T10:00:00.000Z",
    "description": "\n\tThe first trailer has been unveiled for Berlinale-bound Indonesian horror feature “Sleep No More,” marking the latest international outing for filmm",
    "body": "\n\tThe first trailer has been unveiled for Berlinale-bound Indonesian horror feature “Sleep No More,” marking the latest international outing for filmmaker Edwin.\n\n\tProduced by Palari Films alongside co-production partners across Asia and Europe, the feature — titled “Monster Pabrik Rambut” in Indonesian — blends social realism with genre horror, centering on labor exploitation and physical exhaustion inside a factory pushed to inhumane extremes.\n\t\n\n\t“Sleep No More” follows Putri and Ida, factory workers whose lives begin to unravel as a shadowy figure emerges, preying on laborers deprived of rest. As exhaustion mounts, the boundary between waking life and possession collapses, forcing the women to confront both a supernatural threat and a system that thrives on sleeplessness.\n\n\n\tThe film is directed by Edwin, whose previous features include “Blind Pig Who Wants to Fly,” winner of the Fipresci prize at Rotterdam, and “Vengeance Is Mine, All Others Pay Cash,” which won the Golden Leopard at Locarno in 2021.\n\n\t“Sleep No More” is an international co-production spanning Indonesia, Singapore, Japan, Germany and France, with Palari Films and Beacon Film leading on the Indonesian side alongside Singapore’s Giraffe Pictures, Japan’s Hassaku Labs, Germany’s In Good Company and France’s Apsara Films. The film is produced by Meiske Taurisia and Muhammad Zaidy, with co-producers Anthony Chen, Teoh Yi Peng, Atsuko Ohno, Terutaro Osanai, Dian Sastrowardoyo, Roshanak Behesht Nedjad and Marine Arrighi de Casanova. \n\n\tWorldwide sales are handled by South Korea’s Showbox.\n\t\n\n\tIn his director’s statement, Edwin describes the film as an attempt to merge horror with dark comedy and surreal fantasy while confronting labor exploitation and dehumanizing working conditions. “People are expected to grow body parts in order to survive long hours of slavery,” he notes, positioning the film’s horror as an extension of lived reality rather than metaphor alone.\n\n\t“Sleep No More” will screen in the Berlinale Special Midnight section at the 76th Berlin Film Festival.\n\n\tWatch the trailer here:\n\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Berlin-Bound Indonesian Horror ‘Sleep No More,’ From Locarno Winner Edwin, Unveils First Trailer (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Sleep-No-More.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-15T10:00:00.000Z",
      "dateModified": "2026-01-15T10:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "X Implements New Grok AI Restrictions Following U.K. Investigation, Global Pressure",
    "url": "https://variety.com/2026/digital/news/x-grok-ai-restrictions-uk-investigation-1236632018/",
    "image": "https://variety.com/wp-content/uploads/2026/01/elon-musk-grok.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-15T10:09:26.000Z",
    "description": "\n\tElon Musk‘s X has implemented new technological restrictions on its Grok AI chatbot to prevent the creation of sexually explicit deepfakes, respondi",
    "body": "\n\tElon Musk‘s X has implemented new technological restrictions on its Grok AI chatbot to prevent the creation of sexually explicit deepfakes, responding to mounting international pressure as Britain’s media regulator Ofcom continues its formal investigation into whether the platform violated U.K. law.\n\n\tX announced Wednesday that it has deployed technological measures to prevent the Grok account from allowing the editing of images of real people in revealing clothing such as bikinis, applying the restriction to all users including paid subscribers. The company also confirmed it is geoblocking the ability to generate such images in jurisdictions where it’s illegal.\n\t\n\n\t“We remain committed to making X a safe platform for everyone and continue to have zero tolerance for any forms of child sexual exploitation, non-consensual nudity, and unwanted sexual content,” X Safety said in a statement posted on its account.\n\n\n\tU.K. regulator Ofcom called the changes a “welcome development” but emphasized its investigation into whether X broke U.K. laws “remains ongoing.” “We are working round the clock to progress this and get answers into what went wrong and what’s being done to fix it,” an Ofcom spokesperson said, according to BBC News.\n\n\tU.K. Prime Minister Sir Keir Starmer addressed Parliament on Wednesday, calling Grok and X’s actions “disgusting and shameful” while noting he had been informed that morning that X was acting to ensure full compliance with U.K. law.\n\n\t“If so, that is welcome, but we are not going to back down,” Starmer said. “X must act. We will take the necessary measures. We will strengthen existing laws and prepare for legislation if it needs to go further, and Ofcom will continue its independent investigation.”\n\t\n\n\tStarmer also criticized X’s earlier decision to move image editing behind a paywall as “horrific,” reaffirming that the government is “absolutely determined to take action” and that Ofcom has the government’s “full backing.”\n\n\tX’s announcement came hours after California’s top prosecutor said the state was probing the spread of sexualized AI deepfakes, including of children, generated by the AI model, according to BBC News.\n\n\tElon Musk addressed the issue in a statement, claiming he was “not aware of any naked underage images generated by Grok. Literally zero.”\n\n\t“Obviously, Grok does not spontaneously generate images, it does so only according to user requests,” Musk said. “When asked to generate images, it will refuse to produce anything illegal, as the operating principle for Grok is to obey the laws of any given country or state.”\n\n\tMusk acknowledged the possibility of “adversarial hacking of Grok prompts” doing something unexpected, adding: “If that happens, we fix the bug immediately.”\n\n\tImage creation and the ability to edit images via the Grok account on the X platform are now only available to paid subscribers, which X said “adds an extra layer of protection by helping to ensure that individuals who attempt to abuse the Grok account to violate the law or our policies can be held accountable.”\n\n\tX emphasized that all AI prompts and generated content posted to the platform must strictly adhere to its rules, with the company’s safety team working to “add additional safeguards, take swift and decisive action to remove violating and illegal content, permanently suspend accounts where appropriate, and collaborate with local governments and law enforcement as necessary.”\n\n\t“The rapid evolution of generative AI presents challenges across the entire industry,” X stated. “We are actively working with users, our partners, governing bodies and other platforms to address issues more rapidly as they arise.”\n\n\tThe developments follow Ofcom’s announcement Monday that it had launched a formal investigation into X over “deeply concerning reports” that Grok has been used to create and share non-consensual intimate images and sexualized images of children that may constitute child sexual abuse material (CSAM).\n\n\tMalaysia and Indonesia blocked access to Grok over the past weekend, becoming the first countries in the world to ban the AI tool over concerns it could be used to create pornographic and non-consensual images involving women and children, according to BBC News.\n\t\n\n\tIf Ofcom’s investigation finds X violated the law, the regulator can impose fines up to £18 million ($24.2 million) or 10% of the company’s qualifying worldwide revenue, whichever is greater. In severe cases of ongoing non-compliance, Ofcom can seek court orders for “business disruption measures,” including requiring internet service providers to block U.K. access to the platform.\n\n\tSince the Online Safety Act’s duties took effect less than a year ago, Ofcom has launched investigations into more than 90 platforms and issued six fines for non-compliance.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "X Implements New Grok AI Restrictions Following U.K. Investigation, Global Pressure",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/elon-musk-grok.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-15T10:09:26.000Z",
      "dateModified": "2026-01-15T10:09:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ken Watanabe and Lee Sang-il on ‘Kokuho,’ the Kabuki Gamble That Became Japan’s Top Live-Action Film and an Oscars Contender: ‘This Film Is About Pursuing Beauty’",
    "url": "https://variety.com/2026/film/news/ken-watanabe-lee-sang-il-kokuho-oscars-box-office-1236632099/",
    "image": "https://variety.com/wp-content/uploads/2025/05/Kokuho.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-15T11:41:07.000Z",
    "description": "\n\tA nearly three-hour film about Kabuki was never supposed to be a box office juggernaut, but “Kokuho” has defied expectations to become Japan’s top l",
    "body": "\n\tA nearly three-hour film about Kabuki was never supposed to be a box office juggernaut, but “Kokuho” has defied expectations to become Japan’s top live-action hit — and an Oscars international feature shortlister.\n\n\tDirected by Lee Sang-il and starring Ken Watanabe, the drama centers on Kabuki, a traditional art form long viewed as commercially challenging, yet has struck a deep chord with Japanese audiences while also gaining traction overseas.\n\t\n\n\tSet initially in 1964 Nagasaki, the film follows 14-year-old Kikuo (Ryō Yoshizawa) who, after his yakuza father’s death, finds himself taken under the wing of a famous Kabuki actor Hanjiro (Watanabe). Alongside the actor’s son Shunsuke (Ryusei Yokohama), Kikuo dedicates himself to the centuries-old theatrical tradition, with their relationship evolving through decades of performances – from acting school to prestigious stages – against a backdrop of scandals and glory, brotherhood and betrayals.\n\n\n\tLee says the recognition carries weight well beyond awards momentum. “This is a film that deals with traditional Japanese performing arts — Kabuki — and it’s also a work that has received enormous support from Japanese audiences,” he says. “For a film like this to reach the Oscars shortlist is something that feels deeply meaningful, not only for Japanese cinema but for Japanese audiences as well.”\n\n\tWatanabe expresses surprise at how widely the film has connected. “This is not a samurai film, and it’s not a geisha film,” he says. “Kabuki itself can be difficult even for Japanese people to fully understand. So the fact that a film centered on Kabuki has been accepted as Japanese culture by audiences around the world is something that genuinely surprised me, and it’s a great joy.”\n\t\n\n\tNeither Lee nor Watanabe anticipated the scale of the film’s local success. Kabuki, Lee notes, is no longer a mass-attendance art form in Japan. “We couldn’t have predicted this response,” he says. “But somewhere within Japanese audiences there is a latent understanding that this is an important cultural tradition. The film managed to connect with that.”\n\n\tCrucially, Lee stresses that the appeal goes beyond Kabuki itself. “It’s not only a story about kabuki,” he says. “It’s about people who devote their entire lives to an art form. That kind of life – pursuing something at great personal cost – is something audiences can connect with.”\n\n\tWatanabe echoes that sentiment, describing the film as a story of artistic commitment. “It’s about artists giving everything to their art,” he says. “Life can be harsh, but within that harshness there is beauty. I think people who feel uncertainty or anxiety about the future can recognize something in characters who commit themselves fully to one thing.”\n\n\tLee also points to the film’s visual approach as central to its reach, citing the cinematography, staging and production design. “We pursued beauty in every element – the cinematography, the art department, the makeup,” he says. “But also the way of life itself – sacrificing everything to aim higher and higher – is both cruel and beautiful. That idea seems to have resonated with younger audiences and with viewers overseas.”\n\n\tSumming up the film’s ethos, Lee adds, “This film is about pursuing beauty.”\n\n\tThe film’s success comes amid a broader global moment for Japanese culture, from anime and manga to renewed interest in live-action cinema. Watanabe notes that one longstanding barrier has eased. “Language used to be a major hurdle for live-action film,” he says. “Since COVID, audiences have become much more comfortable watching subtitled films, which has made it easier for us to share our work.”\n\n\tLee adds that “Kokuho” was never conceived as a calculated bid for international recognition. “We didn’t make this film by targeting overseas audiences,” he says. “We looked at our own society and history – Kabuki, the onnagata [female impersonation] tradition, family relationships, the life of an artist. These are uniquely Japanese elements, but they exist alongside very universal themes. When those come together, there’s a possibility for the film to travel.”\n\t\n\n\tLooking back, Lee recalls that the project began under heavy skepticism. “From the planning stage, this wasn’t a film carrying big expectations,” he says. “It was Kabuki, it was nearly three hours long, the budget was high – and even Ken was telling me, ‘You should stop.’”\n\n\t“But after its release,” Lee adds, “it’s continued to push back against every one of those obstacles.”\n\n\tHe likens the film’s trajectory to a living thing. “If the film were a child,” Lee says, “it would be one with an incredibly strong soul, growing step by step. How far this film – carrying the destiny of its title – can go is something we’re all watching with a sense of anticipation.”\n\n\tThe Oscar nominations will be revealed Jan. 22. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ken Watanabe and Lee Sang-il on ‘Kokuho,’ the Kabuki Gamble That Became Japan’s Top Live-Action Film and an Oscars Contender: ‘This Film Is About Pursuing Beauty’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/05/Kokuho.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-15T11:41:07.000Z",
      "dateModified": "2026-01-15T11:41:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Maya Jama on ‘Love Island’s’ Global Success and Finally Pursuing Acting With ‘The Gentlemen’ Role: ‘It’s Always Been in the Back of My Mind’",
    "url": "https://variety.com/2026/tv/global/maya-jama-love-island-global-success-the-gentlemen-acting-debut-1236630831/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Credit_-Hollie-Molloy.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-15T12:00:00.000Z",
    "description": "\n\tBefore she became a globally recognized presenter as the face of “Love Island” in the U.K., Maya Jama dreamed of becoming an actor.\n\n\t“I was that ki",
    "body": "\n\tBefore she became a globally recognized presenter as the face of “Love Island” in the U.K., Maya Jama dreamed of becoming an actor.\n\n\t“I was that kid who would be like, ‘Let’s have a performance in the front room and get all our family members to pay for a ticket,'” the 31-year-old tells Variety on a cold December afternoon in London. We’re tucked away in the cozy corner of a chic Chelsea restaurant, but Jama immediately proves she’s no snob — she insisted on ordering from the kids’ menu and is nibbling on battered prawn bites and a cheese quesadilla. “I wasn’t a good singer and I wasn’t an amazing dancer; I just loved showing off to anyone, whatever I could do,” she adds.\n\t\n\n\tBritish audiences are used to seeing Jama in full-glam, but today she’s dressed down and for the chilly weather, sporting a black beanie and matching puffer with minimal makeup and her impossibly shiny hair tucked back. Jama’s just off the train from Manchester, where she’s now living part-time to be closer to her boyfriend, Manchester City football star Rúben Dias. She also discloses before our interview that she’s just gotten braces, which are hidden behind her teeth — hence the strange food order. “Sorry if I speak funny!” she warns, but her smooth, made-for-radio voice never falters.\n\n\n\tGrowing up in Bristol, England, Jama got an early chance to pursue acting when at age 15 she auditioned for “Skins,” the raunchy, revolutionary British teen series that launched the careers of Daniel Kaluuya and Dev Patel. Set in the Southwestern city, “Skins” held auditions at several schools in the area in an effort to achieve authentic casting.\n\t\n\n\t“I got to the last stage with me and one other girl and I was convinced that was going to be my big break,” Jama recalls. “And then I didn’t get it and I was like, ‘Fuck acting. I’m never doing this again.’ And just completely gave up on the dream.”\n\n\tIt may have taken her more than a decade to get over that early rejection — during which Jama made a name for herself as one of the youngest BBC Radio One DJs ever and a sought-after presenter for shows like “Love Island” and “The Masked Singer” — but she’s finally trying her hand at acting again. Later this year, she’ll make her proper debut in the second season of Guy Ritchie’s critically acclaimed “The Gentlemen,” which in a full-circle moment, also happens to star “Skins” breakout Kaya Scodelario.\n\n\t“[Kaya] messaged me before I came to set to be like, ‘I know it’s going to be a bit wild, but if you need anything, just let me know,'” Jama says proudly. “She was so lovely.”\n\n\tBut before Jama dives into the acting world, she’s hosting the second installment of “Love Island” spinoff “All Stars” in South Africa, her seventh season as a presenter since joining the franchise in 2023. (The series was meant to premiere on Monday, but due to wildfires in the area its premiere date has been postponed indefinitely — though, fortunately, everyone on set is safe.) When asked how she’s preparing for the upcoming season, Jama reveals that even she doesn’t know the cast list until she arrives.\n\n\t“They don’t tell me anything until I get there. They keep it so secret,” she says. “I’m kind of glad they do as well, because I would hate to be the one that fucked it. ‘Maya reveals all’ — yeah, it could happen.”\n\n\tBelow, Jama discusses how much longer she’ll stay on as “Love Island” host, ignoring internet hate and the acting role she’d love to nab next.\n\n\n\n\t\n\n\t\t\t\t\t\t\t\t\tHollie Molloy\n\t\n\n\n\t\n\t\tTake me back to getting the call that you would be the new “Love Island” host. What was that like?\t\n\n\tI remember feeling quite scared. It was already such an established show, there’d been two previous hosts already and the internet’s mean sometimes. Going into a show where people love it so much, if you don’t make it better or at least keep it the same, they’re going to be horrible. And so I remember thinking, I’m in a nice place in my life where things are going well — I could either stay the same or take a risk, and it could either completely fuck me over and everyone thinks I’m terrible, or they’re going to really love me and it will be the best thing I ever did. So I do remember feeling a bit worried, but then also like, you do not say no to an opportunity like this. But it ended up being amazing!\n\t\n\t\n\t\tWhat’s the biggest challenge of hosting? \t\n\n\tI think not looking online, because it’s so tempting. Any normal human brain is like, “Oh, people are talking about me, let me have a look at what they’re saying. Are they being nice, are they being mean?” That’s probably the hardest, because you do take it personally. And at the end of the day, it’s a show where I don’t have that much control. Like, I’ve got to deliver my thing, I can add my opinions, but if they get cut out the edit, they get cut out the edit. And so you do your best, but I see the episode for the first time when it comes out like everybody else. That lack of control is obviously a bit nervy, but I trust the producers and they’re a good team, so I feel like they wouldn’t do me dirty.\n\t\n\t\tWhat’s a fact about “Love Island” that people wouldn’t expect? \t\n\n\tThat they all eat lunch separately off camera. So the girls will all eat lunch together, the boys will all eat lunch together. And they have to eat with producers, so they’re not allowed to talk about anything to do with the show. They can talk about TV or whatever, but they can’t discuss anything that would make a difference in the villa. They keep them separate for that, so that’s when they can talk about life and not love.\n\t\n\t\tWhat do you think about the way “Love Island” has grown in the U.S.? What does that success say about the format in general? \t\n\n\tIt’s nuts. I think it was the first season that Ariana [Madix] did where I saw it everywhere and I thought, “Fuck, OK, they’ve got the bug that the U.K. has.” Because it’s been a staple in this country for years and years, and it’s such guilty pleasure TV. But to see it get the same response in America, being such a massive place compared to the U.K., it’s just like, this is some worldwide shit now. And it’s everywhere —they’ve got Spain and France [editions], they’ve got loads across the world. It’s kind of taken over, and it’s been a long run. Usually, I feel like shows kind of die down after 10 years.\n\t\n\t\tHow long do you see yourself staying on as host?\t\n\n\tI don’t know, but I have no plans to leave yet. Before I started “Love Island,” I would say you can get what you need out of a show in two years, and then you move on. That was always kind of what I had in the back of my mind. But with a show like “Love Island,” it just feels like it keeps growing and I’d be silly to leave now. It’s not my whole life and it’s fun, so I think as long as I enjoy it, I’ll keep it up.\n\t\n\n\n\n\t\n\n\t\t\t\t\tMaya Jama and the cast of “Love Island: All Stars.”\n\t\t\t\t\t\t\t\t\tITV\n\t\n\n\n\t\n\t\tYou’re finally chasing your acting dream – how did your role in “The Gentlemen” come together? Did you audition?\t\n\n\tYeah, I did a proper audition. Scary! It’s always been something in the back of my mind, but I’ve just been so busy with presenting that I’ve never had the chance to pursue it. I never want to do something and it be shit, so I was like, if I’m going to do it, I want to train with someone and get as good as I can. So I said to my manager, “OK, I’m ready to maybe try some acting now,” and we got an agent and he just started sending out loads of things. They were like, “You got an audition for ‘The Gentlemen’!” And I didn’t have to change my accent for [the character] or anything like that, so I felt like, OK, this is a safe entrance point. \n\n\tIt happened really quickly, like a week and a half later: “Yeah, you’ve got the role!” But we didn’t know how big it was going to be or small, because nothing had been written yet, so it was just up in the air. So I knew I secretly had it, but I didn’t know what the hell to expect. I did the tiniest little cameo in a Netflix series called “The Duchess,” but it was like one day filming, whereas this was my first one where I had to properly learn lines and be on set for a few days. But I was so, so excited because I loved the series.\n\t\n\t\tWhat can you tease about your character? \t\n\n\tI don’t know what I’m allowed to say. But on the first day I came to set, it was the most overwhelming thing ever because it was all the leads in the room. And Guy Ritchie likes to change his lines as you’re going, so I’d spent two days learning every line, locked in, and then as soon as I got there he was like, “Maybe we’ll add this or change this.” I thought, “Fuck me, in front of all these icons?!” \n\n\tAll of them were actually just really welcoming and supportive. We got on, had little drinks after work sometimes and it was really cool. We stayed on Guy Ritchie’s estate for some of it, while we were filming. Waking up and being like, “Fucking hell, this is nuts, I’m in Guy Ritchie’s house!” was insane.\n\t\n\t\tWhat was it like working with Ritchie?\t\n\n\tAmazing. He’s really kind and nice — he doesn’t feel as intimidating as you’d think, being who he is. He’s very personable and he would be like, “Yeah, you’re doing well” and reassure me, which was really nice. He’s just really involved and kind of a genius to watch, because everyone’s practicing their lines and then he says something that’s way better than the original. You just feel like you’re in the presence of greatness.\n\t\n\t\n\t\tAre you hoping to act more after this? What would be your dream role? \t\n\n\tYeah, I think so. I always joke that I want to play like, a crackhead. I would like something that people wouldn’t expect, you know? Because obviously, the things that I do normally are quite glamorous and very girly. So I’m kind of putting that out into the universe.\n\t\n\t\tWhat else is on your goal list for 2026? Any resolutions?\t\n\n\tI never do resolutions because I never stick to them — every year I’ve tried, and it just fucks up every time. But, what would I like to achieve next year? I want to go to the Met Gala, but that’s a completely different thing. Career-wise, I suppose “The Gentlemen” does really well and I get a role as a villain after.\n\n\tThis interview has been edited and condensed for clarity.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Maya Jama on ‘Love Island’s’ Global Success and Finally Pursuing Acting With ‘The Gentlemen’ Role: ‘It’s Always Been in the Back of My Mind’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Credit_-Hollie-Molloy.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-15T12:00:00.000Z",
      "dateModified": "2026-01-15T12:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Alpha Violet Boards Fernanda Tovar’s ‘Sad Girlz’ Ahead of Berlin World Premiere (EXCLUSIVE)",
    "url": "https://variety.com/2026/film/global/alpha-violet-fernanda-tovar-sad-girlz-berlin-film-festival-1236630052/",
    "image": "https://variety.com/wp-content/uploads/2026/01/VARIETY-SIZING-35.png?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-15T09:23:29.000Z",
    "description": "\n\tParis-based sales agent Alpha Violet has acquired the rights to Fernanda Tovar‘s feature debut “Sad Girlz.” The sensitive coming-of-ager, which will",
    "body": "\n\tParis-based sales agent Alpha Violet has acquired the rights to Fernanda Tovar‘s feature debut “Sad Girlz.” The sensitive coming-of-ager, which will world premiere at the Berlin Film Festival as part of the Generation strand, follows two best friends in the aftermath of a traumatic event.\n\n\tIn “Sad Girlz,” it’s summer in Mexico, and sixteen-year-olds Paula (Darana Álvarez) and La Maestra (Rocio Guzmán) are training to represent their country at the Junior Pan American Swimming Championship in Rio de Janeiro, Brazil. They play with pictures of Brazil’s uber-famous soccer player Vini Jr. and teach each other words in Portuguese before heading to reggaeton dancing on cobbled streets, long afternoons melting into one another with the heat. \n\t\n\n\tOne night, Paula ends up alone with a teammate, Daniel. Soon after, La Maestra senses something has shifted in her best friend. What happened that fateful night changes the girls’  lives over the course of the summer, with the film touching upon sensitive issues of trauma and guilt as the two tensely prance around difficult conversations that forever alter their relationship.  \n\n\n\tTovar is a member of Mexico’s Colectivo Colmena and a former participant at Berlinale Talents Latin America. Her short, “My Age, Yours, and the Age of the World,” was featured at Cannes’ Critics’ Week in 2022. \n\n\tSpeaking with Variety, the director says she spent a long time thinking about approaching the “wound” that is the subject of sexual abuse and its aftermath without “reopening it.” “I spent a long time wondering how to speak about a wound like this without reopening it. I wanted to shift the gaze away from the imagery and the language of violence, because sometimes it feels as if fire only ever gives birth to more fire.”\n\t\n\n\t“Sad Girlz” forgoes an explicit depiction of the assault itself, in line with other recent films that broach the subject, such as Gemma Blasco’s SXSW-winning “Fury” and Eva Victor’s “Sorry, Baby.” “I believe we must tell the stories of what hurts us, of what keeps us awake at night, but I no longer wanted to add more violent images to a world already saturated by them,” emphasizes Tovar. “There is already so much darkness around us. What I wanted was to turn, gently, toward love, toward light, toward the fragile and necessary work of empathy.”\n\n\n\n\n\t\n\n\t\t\t\t\tSad Girlz\n\t\t\t\t\t\t\t\t\tCourtesy of Alpha Violet\n\t\n\n\n\n\n\tAsked about how she prepared her young cast to broach such a sensitive issue, Tovar says the girls are “so young, yet so remarkably intelligent.” “I realized that youth today is very different from when I was their age. With the internet, they are exposed to an amount of information that simply wasn’t available to earlier generations. We talked a great deal with the boys and girls in the cast, and at times I felt they knew more than I did. It was a process I will always treasure, for everything it taught me and for how it revealed the importance of open communication and dialogue, which was always at the heart of our work.”\n\n\t“During the acting preparation, I was accompanied by Paulina Álvarez and Michelle Betancourt – actresses, teachers, and acting coaches – and together we created a safe space for conversation and exploration,” the director continues. “These safe spaces were essential for approaching such sensitive themes and the wounds that touch us all; within them, we were able to form a sense of community, to hold one another, and to face what was difficult with care and trust.”\n\n\tWhen it comes to preparing the young cast, Tovar emphasizes the extensive swimming training the actors went through. A coach from Mexico’s youth swimming team rigorously trained the actors for three months while Tovar explored the construction of the characters and their bond through improvisation, strengthening the complicity between them. “At first, they could only manage a basic dog paddle,” the filmmaker recalls. “In just three months, their progress was extraordinary, and by the end, they were able to swim almost all of their scenes themselves. “Oscar Lever, who plays Sergio, is ranked among the top five swimmers in the country.”\n\n\tIn “Sad Girlz,” the Mexican teenagers dream not to travel to the U.S. or Europe, common stereotypes featured in Latin American coming-of-age films. When asked about why she chose to break that pattern and have Brazil as the promised land in her film, Tovar recalls growing up “thinking that going to the United States was the ultimate dream, then Europe after that.”\n\t\n\n\t“In so many of our stories, those who succeeded always ended up heading north, to the so-called ‘global north,’” she adds. “I wanted this dream to be different, to turn south instead. Latin America holds such vast diversity, so many dreams that bloom within our own lands and our own stories, and I felt it was important to give them a voice. Beyond that, I have always been captivated by Brazilian cinema and music. Brazil is a country close to my heart, and I am married to a Brazilian—so this love for its art is deeply personal. Bringing it into the film felt like a way to celebrate the richness and joy of Latin America itself, and to let the girls’ dreams resonate with warmth, music, and life that feels close to home.” \n\n\tAs for premiering in Berlin, Tovar says it feels like “a dream come true.” “What I want most is for the film to be seen. I’m so curious to see how the boys and girls in Berlin will react. More than anything, I can’t wait to celebrate and share this moment with the whole team, with my family and friends, whose support has been unwavering from the very beginning.”\n\n\tVirginie Devesa and Keiko Funato, CEOs of Alpha Violet, added that Tovar’s debut deals with “first times” and “how to deal with them for the best.” “Fernanda Tovar uses such a playful visual style, fun characters, and above all, a very honest and emotional ride that I believe will convince buyers and professionals at first sight. We are very excited to work with this new female filmmaker for her debut film, as it is a new discovery for Alpha Violet.”\n\n\tAlpha Violet will kick off sales for “Sad Girlz” at the Berlin Festival’s European Film Market, as well as that of their two other titles in João Nuno Pinto’s “18 Holes to Paradise” and Alexander Murphy’s “Goodbye Sisters.” Both films had their world premieres at the Tallinn Black Nights Film Festival.\n\n\t‘Sad Girlz’ is produced by Daniel Loustaunau and Araceli Velázquez for Colectivo Colmena (Mexico) in co-production with Carlo D’Ursi (Potenza Producciones, Spain), Samuel Chauvin (Promenades Films, France), Martini Shot Films and CTT Exp & Rentals. The film was supported by Eficine (Mexico), ICAA (Spain) and the CNC National Film Board and Sacem in France.\n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Alpha Violet Boards Fernanda Tovar’s ‘Sad Girlz’ Ahead of Berlin World Premiere (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/VARIETY-SIZING-35.png?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-15T09:23:29.000Z",
      "dateModified": "2026-01-15T09:23:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Director Alli Haapasalo Talks High-Profile Göteborg Debut ‘Tell Everyone,’ a Period Drama That’s ‘Just as Relevant’ Today as Trailer Debuts (EXCLUSIVE)",
    "url": "https://variety.com/2026/film/global/alli-haapasalo-tell-everyone-goteborg-bow-levelk-1236631263/",
    "image": "https://variety.com/wp-content/uploads/2026/01/MixCollage-13-Jan-2026-06-49-PM-8857.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-15T09:05:35.000Z",
    "description": "\n\tIn her latest drama “Tell Everyone” Finnish director Alli Haapasalo – also known for Sundance hit ‘Girl Picture’ – goes back to the year 1898. But s",
    "body": "\n\tIn her latest drama “Tell Everyone” Finnish director Alli Haapasalo – also known for Sundance hit ‘Girl Picture’ – goes back to the year 1898. But she found few differences between the past and the present. \n\n\t“That’s the saddest part of the story – it’s just as relevant. This film deals with female suffering, both mental and physical, still viewed through the same gender-biased lens,” she tells Variety. \n\t\n\n\tIn “Tell Everyone” – sold by LevelK – women who commit crimes or simply refuse to conform are sent to the remote island of Seili in the Finnish archipelago. Just like Amanda (Marketta Tikkanen), labelled as mad simply because she suffers from severe menstrual pain. The film, world-premiering at Göteborg Film Festival, debuts its trailer here: \n\n\n\n\n\n\t“My husband recommended a New York Times podcast [‘The Retrievals’] about female pain and how it’s misunderstood and ignored. Thousands of women suffer from With PMDD [Premenstrual Dysphoric Disorder] yet it’s considered ‘insignificant’ because it doesn’t affect both genders. Not to mention we’re only now starting to talk about menopause, at least in Finland,” notes Haapasalo.\n\n\t“I remember when we were shooting the scene where blood was running down Amanda’s hairy legs. There was nothing awkward or shameful about it. Maybe we’re slowly moving from the dinosaur era to a time when men and women can look at menstrual blood in a scene and it’s totally fine.”\n\n\tBased on a novel by Katja Kallio, the film references hundreds of true stories. \n\t\n\n\t“These ‘prison islands’ existed in many countries. The island of Seili started out as a hospital for people with leprosy and became a mental institution in the 19th century. Initially, it housed both men and women, but then all the men were moved – which must have been a crazy process,” notes the director. \n\n\tIt hasn’t always been run by medical professionals. \n\n\t“These people used to work on farms. They didn’t know much about psychiatry – they didn’t even believe in it. The idea was to keep mental health patients separate from society so that they wouldn’t pose a danger to others.” \n\n\tShe adds: “This woman, Amanda, actually claimed she had flown to Paris in a hot air balloon to Paris. It was in her medical records, which caught Kallio’s attention. She asked herself: ‘What if we believe her and don’t just dismiss it as the story of a crazy woman?’” \n\n\tHaapasalo was committed to depicting a “ruthless time” and a protagonist whose “only crime was being a woman with integrity”. \n\n\t“If you weren’t productive, you were just another mouth to feed. People were put away not just because of their mental health. Sick of their wives, husbands could come up with a reason, and many of these women were simply poor. Amanda didn’t have a home, and that was enough to have her committed to an institution.” \n\n\tDespite such horrific details, she ultimately portrayed a place that, despite being a prison, could also be beautiful. \n\n\t“The surroundings are gorgeous in terms of nature, but the horror is already in these women’s lives: their freedom has been taken away from them. If horrible things happen in paradise, well, then it’s not really a paradise,” she concludes. \n\n\tAnother cliché she was determined to avoid? “It was really important to me that there were no sadistic nurses. There is no Nurse Ratched,” she smiles. \n\n\t“Later on, they started to use controversial methods to calm people down and new psychiatric treatments, but at the time of our film, they just believed in hard work and spending time outside. That steady, calm life.”\n\n\tThe cast, also featuring Aamu Milonoff (“Soviet Jeans”) and local stars Krista Kosonen (“Tove”) and Alma Pöysti (Golden Globe-nominated for “Fallen Leaves”), embraced the natural look necessary for the film. \n\t\n\n\t“Not a single person asked: ‘May I please wear a bit of foundation?’ They very strictly did not have any makeup on, but they all embraced it. Perhaps it’s because of all the contemporary conversations we’re having right now about makeup, and about showing our real selves as women, that nobody had an issue with it,” recalled Haapasalo. \n\n\tIn her film, Amanda is certainly unhappy with her predicament and unable to fully experience love, but she starts to make friends with other women who are also unable to escape. \n\n\t“One of our distributors, the only man in our group of financiers, said he was jealous [of that]. He said: ‘I’ve never experienced anything like this community and I never will.’ Nevertheless, it’s not a summer camp. It’s a small society with its own invisible hierarchies and secret relationships. It can be gruesome as well.”\n\n\tWhile some industry insiders fear a slowdown in support for female-led projects, with one even describing 2025 as a ‘Great Recession’ for women directors, Haapasalo ponders: “After #MeToo, when women started getting more funding for their projects, some men immediately started to complain that, as a guy, you couldn’t get money anymore. But in 2024, when we got funding for this film, the numbers had already dropped. When I was making ‘Girl Picture,’ it was closer to 50/50.” \n\n\t“It wouldn’t surprise me if people said: ‘We’ve funded enough female work now.’ That’s classic backlash. Hopefully, though, we can recognize that a multitude of voices is better than having just one gender on top.” \n\n\tThis leads to more contemporary echoes in her film, where Amanda doesn’t simply submit to power structures. \n\n\t“She can see right through them. She’s loud and obnoxious, and she does what she wants. She’s outrageous, because she doesn’t behave the way a woman is expected to, and that hasn’t changed much. I’m a good example of that; I constantly notice self-regulation in my behavior that stems from misogyny,” she says. \n\n\t“Still, I’m not interested in seeing myself, or Amanda, as a victim.” \n\n\n\n\t\n\n\t\t\t\t\tAlli Haapasalo, director of Göteborg world premiere ‘Tell Everyone’\n\t\t\t\t\t\t\t\t\tMarica Rosengård\n\t\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Director Alli Haapasalo Talks High-Profile Göteborg Debut ‘Tell Everyone,’ a Period Drama That’s ‘Just as Relevant’ Today as Trailer Debuts (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/MixCollage-13-Jan-2026-06-49-PM-8857.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-15T09:05:35.000Z",
      "dateModified": "2026-01-15T09:05:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Soar Into Dove Cameron's Dirty 30 With Her Sexiest Pics!",
    "url": "https://www.tmz.com/2026/01/15/dove-cameron-birthday-hot-shots/",
    "image": "https://imagez.tmz.com/image/a0/16by9/2026/01/13/a012d9a4a93749ac979402a8e6792f03_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-15T08:01:03.000Z",
    "description": "\n    \n                    \n                          Soar Into Dove Cameron's\n                          Dirty 30 With Her\n                          Se",
    "body": "\n    \n                    \n                          Soar Into Dove Cameron's\n                          Dirty 30 With Her\n                          Sexiest Pics 🕊️!\n                      \n                  \n                                                                        Published \n                              January 15, 2026\n                            12:01 AM PST\n                                                                            \n      \n    \n      \n        \n              \n    \n    \n          Dove Cameron's officially ringing in the big 3-0, and we're celebrating by looking back at her seriously sexy decade!\n      \n    \n          As you can see, the former Disney Channel star left PG status behind a long time ago -- and if these sexy bikini snaps are any clue, she’s 100% sure she's revving up for her hottest years to come.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          More sizzling snaps of the always-stunning Dove await your arrival ... hit up the gallery!\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Keep flying high, Dove 🕊️\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Dove Cameron\n              \n                          \n                Hotties & Bodies\n              \n                          \n                Hot Bodies\n              \n                          \n                Birthdays\n              \n                          \n                Photo Galleries\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Soar Into Dove Cameron's Dirty 30 With Her Sexiest Pics!",
      "image": [
        "https://imagez.tmz.com/image/a0/16by9/2026/01/13/a012d9a4a93749ac979402a8e6792f03_xl.jpg"
      ],
      "datePublished": "2026-01-15T08:01:03.000Z",
      "dateModified": "2026-01-15T08:01:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ex-F1 Driver Antonio Pizzonia's Alleged Assault Victim Addresses Incident",
    "url": "https://www.tmz.com/2026/01/15/antonio-pizzonia-victim-addresses-alleged-assault/",
    "image": "https://imagez.tmz.com/image/f1/16by9/2026/01/14/f11eb55845454d2e890ea0ea6a900793_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-15T08:30:08.000Z",
    "description": "\n    \n                    \n                          Ex-F1 Driver Antonio Pizzonia\n                          Alleged Assault Victim Speaks Out\n       ",
    "body": "\n    \n                    \n                          Ex-F1 Driver Antonio Pizzonia\n                          Alleged Assault Victim Speaks Out\n                          ... His Son Rammed Into Mine!!!\n                      \n                  \n                                                                        Published \n                              January 15, 2026\n                            12:30 AM PST\n                                                                            \n      \n    \n      \n        \n                    \n                  \n      \n                    Instagram/@litraosincerao\n          \n    \n          The alleged assault victim in the Antonio Pizzonia incident is sharing his side of the story … telling TMZ Sports he did no wrong.\n      \n    \n          Michael Kotowski -- who is listed as the alleged victim in the police report -- says he was \"sucker punched\" while supporting his competitive go-kart driver son, Nico, at the Speedsportz Racing Park in Texas for the 2026 Superkarts! USA Winter Series.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Kotowski says things got heated after a race involving Nico and Pizzonia’s son, Neto.\n      \n\n          Kotowski claims the two 13-year-olds were bumping each other throughout throughout the race ... but no penalties were called. As the drivers entered pit lane following the finish, Kotowski claims Neto went \"full throttle\" and rammed into his son's kart.\n      \n    \n          Kotowski says he told them, “You better watch it,\" from the other side of a fence.\n      \n    \n          \"What are you going to do about it?\" he claims Neto replied.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Before he could respond, Kotowski says he felt Pizzonia come out of nowhere and lunge at him with a simultaneous kick-punch combination. He says Pizzonia then struck him again -- and he says he was surprised by the altercation because he's 6'3\" and weighs over 300 pounds.\n      \n    \n          They were soon separated and Kotowski reported the incident to local law enforcement, which ultimately arrested Pizzonia for assault.\n      \n    \n          \"There are different ways of dealing with this, and luckily, I was able to control my emotions,\" Kotowski said.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          As we previously reported, Pizzonia spoke out about his arrest on Instagram … saying he regrets his actions but was simply defending his son.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Celebrity News\n              \n                          \n                Cars\n              \n                          \n                TMZ Sports\n              \n                          \n                Fights & Feuds\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ex-F1 Driver Antonio Pizzonia's Alleged Assault Victim Addresses Incident",
      "image": [
        "https://imagez.tmz.com/image/f1/16by9/2026/01/14/f11eb55845454d2e890ea0ea6a900793_xl.jpg"
      ],
      "datePublished": "2026-01-15T08:30:08.000Z",
      "dateModified": "2026-01-15T08:30:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Federal Officer Shoots Undocumented Migrant In Minneapolis",
    "url": "https://www.tmz.com/2026/01/14/federal-officer-shoots-person-leg-minneapolis/",
    "image": "https://imagez.tmz.com/image/15/16by9/2026/01/09/154e15713ee149ae8b06608e1f0ad3aa_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-15T04:47:01.000Z",
    "description": "\n    \n                    \n                          Minneapolis Mayhem\n                          Federal Agent Shoots Migrant ...\n                   ",
    "body": "\n    \n                    \n                          Minneapolis Mayhem\n                          Federal Agent Shoots Migrant ...\n                          Two People In Custody\n                      \n                  \n                                                                        Published \n                              January 14, 2026\n                            8:47 PM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          One week after Renee Good was killed by an ICE agent, a federal officer has shot another person during a targeted operation in Minnesota, authorities said.\n      \n    \n          Tricia McLaughlin, Department of Homeland Security Assistant Secretary, tells TMZ ... federal law enforcement officers targeted an undocumented migrant from Venezuela, pulling the man over during a Wednesday night traffic stop in Minneapolis.\n      \n    \n      \n      At 6:50 PM CT, federal law enforcement officers were conducting a targeted traffic stop in Minneapolis of an illegal alien from Venezuela who was released into the country by Joe Biden in 2022.In an attempt to evade arrest, the subject fled the scene in his vehicle and crashed…— Homeland Security (@DHSgov) January 15, 2026\n              @DHSgov\n          \n  \n    \n          McLaughlin said the man fled in a vehicle but eventually crashed into a parked car and then ran off. One federal officer gave chase and caught up to the man, who began assaulting the fed.\n      \n    \n          During their ensuing battle, two other people allegedly stepped out of a building nearby and attacked the federal officer with a snow shovel and broom stick.McLaughlin said the officer feared for his life and pulled a gun, pumping a bullet into the leg of the man with whom he started fighting.\n      \n    \n          The officer who was attacked and the shooting victim were rushed to a hospital for treatment. Their conditions were not immediately known. McLaughlin said the two other subjects dashed back inside the building and barricaded themselves inside, but were soon taken into custody.\n      \n    \n        \n                    \n                  \n      \n    \n          The latest shooting comes on the heels of an Immigration and Customs Enforcement agent gunning down Renee Good as she sat inside her vehicle, also in Minneapolis. Good and her partner had gotten into a dispute with ICE officers over their enforcement immigration operations, leading to the fatal shooting.\n      \n    \n          President Trump and the Department of Justice have sided with the ICE officer, Jonathan Ross, describing his action as purely self-defense. Minnesota state officials have a different take, labeling what Ross allegedly did as murder.\n      \n      \n              \n            \n              Related articles\n            \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Federal Officer Shoots Undocumented Migrant In Minneapolis",
      "image": [
        "https://imagez.tmz.com/image/15/16by9/2026/01/09/154e15713ee149ae8b06608e1f0ad3aa_xl.jpg"
      ],
      "datePublished": "2026-01-15T04:47:01.000Z",
      "dateModified": "2026-01-15T04:47:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Video Shows Cam Taylor-Britt's Car Flip in November Crash",
    "url": "https://www.tmz.com/2026/01/14/bengals-cam-taylor-britt-rollover-car-crash-november-nfl/",
    "image": "https://imagez.tmz.com/image/79/16by9/2026/01/14/79585aa3436e45538cf6671f3324cc35_xl.png",
    "tag": "Entertainment",
    "date": "2026-01-14T23:51:48.000Z",
    "description": "\n    \n                    \n                          Bengals' Cam Taylor-Britt\n                          November Crash Caught On Video\n              ",
    "body": "\n    \n                    \n                          Bengals' Cam Taylor-Britt\n                          November Crash Caught On Video\n                          ... Jeep Flips In Terrifying Scene\n                      \n      \n    \n      \n        \n                    \n                  \n      \n                    Covington PD\n          \n    \n          Cincinnati Bengals cornerback Cam Taylor-Britt is lucky to be alive -- the NFL-er told police he was a passenger in a terrifying crash in November, when a vehicle flipped in the street after colliding with a parked car.\n      \n    \n          The moment was caught on surveillance footage, which showed a black Jeep -- registered to Taylor-Britt -- blowing through a red light around 3 AM on November 15.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          The car rolled over and onto its roof ... and out of frame.\n      \n\n          In bodycam footage obtained by Local 12, the scene was empty when officers arrived ... and when they spoke with Taylor-Britt and his brother, Jafabian Booker, about who was behind the wheel ... there were conflicting stories.\n      \n    \n      \n      We obtained 2 1/2 hours of body camera. Officers find no one at the crash..they track Taylor-Britt to his house, officers find him outside.“It is what it is.” Taylor-Britt then offers to go back to the scene. The officer asks, “Who was driving?”Watch @Local12 6 for more pic.twitter.com/OZXybBLfQT— meghan mongillo (@meghanmongillo) January 14, 2026\n              @meghanmongillo\n          \n  \n    \n          When speaking with cops, Taylor-Britt acknowledged his license was suspended at the time.\n      \n    \n          Ultimately, Booker stated he was the driver ... after initially blaming it on a drunk \"female\" who ran off after the crash.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          This incident happened the day before Taylor-Britt suffered a season-ending injury during the Bengals vs. Steelers game.\n      \n    \n          Earlier this month, Taylor-Britt pled guilty to reckless driving and driving with a restricted license ... and was sentenced to five days behind bars.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Cam Taylor-Britt\n              \n                          \n                Arrests\n              \n                          \n                Car Crashes\n              \n                          \n                TMZ Sports\n              \n                          \n                Cincinnati Bengals\n              \n                          \n                NFL\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Video Shows Cam Taylor-Britt's Car Flip in November Crash",
      "image": [
        "https://imagez.tmz.com/image/79/16by9/2026/01/14/79585aa3436e45538cf6671f3324cc35_xl.png"
      ],
      "datePublished": "2026-01-14T23:51:48.000Z",
      "dateModified": "2026-01-14T23:51:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Hailey Bieber Sends Cease & Desist to TikToker",
    "url": "https://www.tmz.com/2026/01/14/hailey-bieber-sends-cease-and-desist-tiktoker/",
    "image": "https://imagez.tmz.com/image/b3/16by9/2026/01/14/b3d04337da8d42d3ac34b884c4e390b3_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-15T00:36:16.000Z",
    "description": "\n    \n                    \n                          Hailey Bieber\n                          Slaps TikToker With Cease & Desist\n                      ",
    "body": "\n    \n                    \n                          Hailey Bieber\n                          Slaps TikToker With Cease & Desist\n                      \n                  \n                                                                        Published \n                              January 14, 2026\n                            4:36 PM PST\n                                                                            \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Hailey and Justin Bieber are continuing to beef with TikToker Julie Theis ... slapping her with a cease-and-desist letter that claims she fabricated her story about their celebrity marriage.\n      \n    \n          TMZ obtained a copy of the letter written by the Biebers' attorney Evan Spiegel ... who writes that Theis posted \"outrageous false, fabricated, and defamatory\" statements online about the couple's marriage.\n      \n    \n    \n              \n                \n  \n    \n          Spiegel also writes Theis uploaded TikTok and Instagram videos of herself claiming that Justin and Hailey's marriage was a great example of an abusive relationship stemming from drug addiction, and calls the allegations \"highly damaging.\"\n      \n\n          Furthermore, the cease and desist demands Theis to remove her videos making the allegedly defamatory comments about Hailey and Justin and tells her to her to permanently stop posting content implying the Biebers are in an abusive relationship.\n      \n    \n      \n        \n                    \n                  \n      \n                    TikTok/@julietheis\n          \n    \n          On Tuesday, Theis said on TikTok she received the cease and desist letter from Hailey and Justin's legal team. Theis insisted her social media videos were \"clearly opinion-based commentary about relationship dynamics and power.\"\n      \n    \n          In a statement, Theis told TMZ ... she's concerned the Biebers are trying to silence her free speech, explaining that she's allowed to express her opinions without legal intimidation.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Theis added ... \"It’s extremely elitist to try to silence opinions just because you disagree. Disagreement is not defamation.\" She also claims she's been receiving death threats since the start of this drama.\n      \n    \n          We've reached out to Hailey and Justin's team, so far no word back.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Justin Bieber\n              \n                          \n                Hailey Bieber\n              \n                          \n                Celebrity News\n              \n                          \n                TikTok\n              \n                          \n                Relationships\n              \n                          \n                Viral\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Hailey Bieber Sends Cease & Desist to TikToker",
      "image": [
        "https://imagez.tmz.com/image/b3/16by9/2026/01/14/b3d04337da8d42d3ac34b884c4e390b3_xl.jpg"
      ],
      "datePublished": "2026-01-15T00:36:16.000Z",
      "dateModified": "2026-01-15T00:36:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]