[
  {
    "title": "Rebecca Ferguson Did Not Name the ‘Idiot’ Actor Who Screamed at Her and Made Her Cry on Set Because Telling That Story ‘Wasn’t About the Person. It Was About Me’",
    "url": "https://variety.com/2026/film/news/rebecca-ferguson-name-actor-screamed-set-1236653914/",
    "image": "https://variety.com/wp-content/uploads/2026/02/P102GKF5.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-05T23:13:27.000Z",
    "description": "\n\tRebecca Ferguson is not interested in naming names. The “Dune” and “Mission: Impossible” favorite went viral in 2024 when she called out a male co-s",
    "body": "\n\tRebecca Ferguson is not interested in naming names. The “Dune” and “Mission: Impossible” favorite went viral in 2024 when she called out a male co-star for screaming at her on set. But she never named the actor, which prompted widespread social media theories on who it could be (from Hugh Jackman to Tom Cruise). But Ferguson told Harper’s Bazaar in a new interview that anyone trying to figure out who the male actor was is missing the point of her reveal.\n\t\n\n\t“It wasn’t about the person. It was about me,” Ferguson said. “It was so scary. I didn’t know then how to go, ‘Hey, can I talk to you privately?’ Now, I would want to believe that I could have taken this person aside.”\n\n\n\tFerguson’s story was to demonstrate how movie sets have evolved over the years. She is far more comfortable standing up for herself as a woman on set these days, for instance. The actor finds the industry moving toward a positive direction when it comes to how people are treated during production.\n\n\t“A lot of people say that we’ve become too woke, but I think, no, it’s great,” Ferguson said. “The pendulum needs to swing to the other side so that we can find a balance in between.”\n\n\t Ferguson revealed during her “Dune: Part Two” press tour in February 2024 on the “Reign With Josh Smith” podcast that she once had an “idiot” co-star who made her cry on set. She was screamed at by this co-star to such an unprofessional degree that she ultimately fired back and requested she only act opposite the back of the actor’s head. \n\n\t“I did a film with an absolute idiot of a co-star and this human being was being so insecure and angry because this person couldn’t get the scenes out,” she said at the time. “And I think I was so vulnerable and uncomfortable that I got screamed at and I would cry walking off set.”\n\t\n\n\t“This person would literally look at me in front of the whole crew and say, ‘You call yourself an actor? This is what I have to work with?’ I stood there just breaking,” Ferguson continued. “Because this person was number one on the call sheet, there was no safety net for me. No one had my back.”\n\n\tFerguson said the experience was the first time she ever spoke up for herself as an actor on a set. She arrived on set the next day and told the co-star, “You get off my set. You can F off. I’m gonna work towards a tennis ball. I never want to see you again.”\n\n\t“And then I remember the producers came up and said, ‘You can’t do this to number one. We have to let this person be on set,’” Ferguson remembered. “And I said, ‘The person can turn around and I can act to the back of the head.’ And I did. I was so scared. I feel it now when I’m saying it.”\n\n\tAs Ferguson’s reveal gained traction on social media, the actor got some support from Dwayne Johnson, with whom she co-starred in 2014’s “Hercules.”\n\n\t“Hate seeing this but love seeing her stand up to bullshit,” Johnson posted on X. “Rebecca was my guardian angel sent from heaven on our set. I love that woman. I’d like to find out who did this.”\n\n\tIn a follow-up interview on SiriusXM’s “The Jess Cagle Show,” Ferguson revealed that former co-stars were reaching out to her in the wake of the revelation and all the guessing games on social media regarding who she might be talking about.\n\n\t“I got phone calls from amazing co-stars who I’ve worked with going, ‘You understand what you’ve done, right?’” Ferguson said. “And I was like, ‘Oh my God. No, I didn’t think.’ I mean, it’s not my responsibility, to be honest. I don’t really care. You know, ‘You’re great, but my story is my story, and if you’re a good person, then don’t worry about it.’”\n\n\tHead over to Harper’s Bazaar’s website to read more from Ferguson’s latest profile. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rebecca Ferguson Did Not Name the ‘Idiot’ Actor Who Screamed at Her and Made Her Cry on Set Because Telling That Story ‘Wasn’t About the Person. It Was About Me’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/P102GKF5.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-05T23:13:27.000Z",
      "dateModified": "2026-02-05T23:13:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Baldur’s Gate’ HBO Series in the Works From ‘The Last of Us’ Co-Creator Craig Mazin",
    "url": "https://variety.com/2026/tv/news/baldurs-gate-hbo-craig-mazin-1236654094/",
    "image": "https://variety.com/wp-content/uploads/2026/02/baldurs-gate.jpg?crop=0px%2C6px%2C1500px%2C844px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-02-06T00:19:35.000Z",
    "description": "\n\tHBO is developing a TV adaptation of Hasbro’s fantasy role-playing video game series “Baldur’s Gate.”\n\n\tCraig Mazin, the co-creator and showrunner o",
    "body": "\n\tHBO is developing a TV adaptation of Hasbro’s fantasy role-playing video game series “Baldur’s Gate.”\n\n\tCraig Mazin, the co-creator and showrunner of HBO’s hit video game adaptation “The Last of Us,” will serve as showrunner and executive producer. Mazin is also the created of HBO’s 2019 limited series “Chernobyl.” Mazin also executive produces alongside Jacqueline Lesko, Cecil O’Connor and Hasbro Entertainment’s head of television Gabriel Marano.\n\t\n\n\tPart of the “Dungeons & Dragons” franchise, the first “Baldur’s Gate” game was released in 1998. Most recently, “Baldur’s Gate 3” debuted in 2023 and achieved significant critical and commercial success, becoming the first-ever title to win all five major Game of the Year awards and crossing 15 million players. \n\n\n\t“After putting nearly 1000 hours into the incredible world of ‘Baldur’s Gate 3,’ it is a dream come true to be able to continue the story that Larian and Wizards of The Coast created,” Mazin said in a statement. “I am a devoted fan of ‘D&D’ and the brilliant way that Swen Vincke and his gifted team adapted it.  I can’t wait to help bring ‘Baldur’s Gate’ and all of its incredible characters to life with as much respect and love as we can, and I’m deeply grateful to Gabe Marano and his team at Hasbro for entrusting me with this incredibly important property.”\n\n\t“We’re thrilled to continue our partnership with Craig Mazin on ‘Baldur’s Gate,'” said Francesca Orsi, executive vice president and head of drama programming at HBO. “His deep and long-standing passion for the source material paired with his remarkable talent for building immersive worlds filled with rich, compelling characters promises groundbreaking results.”\n\t\n\n\t“The fans have been eagerly awaiting an adaptation of ‘Baldur’s Gate,’ and we could not ask for better partners than HBO and the incomparable Craig Mazin to build this world with,” said Marano.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Baldur’s Gate’ HBO Series in the Works From ‘The Last of Us’ Co-Creator Craig Mazin",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/baldurs-gate.jpg?crop=0px%2C6px%2C1500px%2C844px&resize=1000%2C563"
      ],
      "datePublished": "2026-02-06T00:19:35.000Z",
      "dateModified": "2026-02-06T00:19:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Starfleet Academy’ Brings Back ‘Deep Space Nine’ Star as SAM Grapples With Enduring ‘Star Trek’ Mystery",
    "url": "https://variety.com/2026/tv/news/starfleet-academy-deep-space-nine-sisko-1236650198/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Starfleet-Academy.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-05T23:00:00.000Z",
    "description": "\n\tSPOILER ALERT: This article contains spoilers from “Series Acclimation Mil,” Episode 5 of “Star Trek: Starfleet Academy,” now streaming on Paramount",
    "body": "\n\tSPOILER ALERT: This article contains spoilers from “Series Acclimation Mil,” Episode 5 of “Star Trek: Starfleet Academy,” now streaming on Paramount+. \n\n\t“Starfleet Academy” paid heartfelt tribute to “Deep Space Nine” in this week’s episode, which included the return of Cirroc Lofton as Jake Sisko. \n\n\tIn the episode, SAM (Kerrice Brooks) is tasked by her Kasqian makers with explaining virtually everything about “organics.” In the course of learning everything she can, she comes across the mystery of Capt. Benjamin Sisko (Avery Brooks), who disappeared in the series finale of “Deep Space Nine” when he was taken in by the wormhole aliens, aka The Prophets of Bajor.\n\t\n\n\tSAM becomes obsessed with discovering what happened to Sisko, while also grappling with how to fulfill her own role as an emissary to the organic world on behalf of the Kasqians. She eventually receives a book written by Jake about his father, with Jake appearing in her mind to talk about Capt. Sisko and what kind of man/emissary he was. \n\n\n\tIn an interview with Variety, Lofton praised Kerrice for the funny connection she shares with his onscreen father. “Honestly, I work well with Brookses,” he said with a laugh. “So it just happened to be nice bit of synchronicity there.”\n\n\tLofton went on to call Kerrice a “phenomenal” performer who adds to the legacy of “Star Trek.” “She was a perfect scene partner,” he said. “She elevated every moment. Her ability to channel emotions and really get in depth was just mind blowing.”\n\n\tKerrice, meanwhile, was equally laudatory of Lofton, saying he reminded her of a star. “Not even like star power, like Hollywood — but you feel guided by the stars,” she said. “You feel like you know your bearings by looking at the stars. That’s what it feels like to work with him. He’s beautiful, genuinely beautiful, inside and out.”\n\t\n\n\tThe end of the episode also features a piece of dialogue from Avery Brooks, never before heard in a “Star Trek” show. According to Lofton, the speech comes from an album Avery recorded years ago.\n\n\t“It’s a way for me to hear his voice in another way, because he has such a signature voice, and because it’s so compelling, hearing it in this episode meant a lot to me,” he said. \n\n\t“Series Acclimation Mil” was co-written by “Lower Decks” alum Tawny Newsome, who also appears onscreen as Starfleet Academy’s Professor Ila, later revealed to be Ila Dax, the Trill symbiont who served with Capt. Sisko aboard Deep Space Nine. The role required Newsome to wear prosthetic makeup for the first time, and the experience definitely made an impression. \n\n\t“Never have I had more love and admiration for the Doug Joneses of the world,” Newsome said. “I knew that our Dougs and Michael Dorns, I knew these people had superhuman abilities, but doing even just one very long day in that prosthetic, I was like, ‘Oh, these people are simply built different.'”\n\n\tBut the central focus is SAM, with the episode even taking on unique format as she explains her life at the Academy that features onscreen graphics not normally seen in the show. “My favorite movie is the ‘Into the Spider-Verse’ movies,” Kerrice said. “And it felt like SAM’s version of that, which made me just even more excited.” \n\n\tOne of the charming things about “Starfleet Academy” is how well the lives of the characters reflect the lives of the actors playing them. \n\n\tKerrice is no different, saying “SAM is so technically smart and book smart, but she doesn’t know a lot about culture. And I was like, ‘Oh, that’s perfect,’ because I have a hard time with that too. So I can’t come into this episode comfortable in my own skin, because that’s not who she is.” \n\n\tThis episode also features an epic bar fight between Starfleet Academy and the War College. Kerrice says it was fun to film that sequence, but admits there was one stunt gone wrong. \n\n\t“[Cecilia Lee] plays Dzolo, the girl that I fought,” Kerrice said. “I’ve never done fight choreo before. I appreciate that everyone’s trusting me really meant a lot, but I don’t know that they should have trusted me that much without a rehearsal. So CeCe got rocked, she got punched for real, and I felt so bad. Literally during lunch, I bought her a candle, I bought her Reese’s Peanut Butter Cups — which she actually turned out to be allergic to — I just couldn’t do right that day, essentially. I bought her flowers, and she was a trooper. And I kept saying, ‘Hit me back, please, please, please!'” \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Starfleet Academy’ Brings Back ‘Deep Space Nine’ Star as SAM Grapples With Enduring ‘Star Trek’ Mystery",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Starfleet-Academy.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-05T23:00:00.000Z",
      "dateModified": "2026-02-05T23:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Solo Mio’ Review: Kevin James Is Ripe for Romance in Rome",
    "url": "https://variety.com/2026/film/reviews/solo-mio-review-kevin-james-1236653889/",
    "image": "https://variety.com/wp-content/uploads/2026/02/MCDSOMI_EC020.jpg?crop=372px%2C0px%2C2221px%2C1245px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-02-05T23:09:34.000Z",
    "description": "\n\tNo grand romantic gesture goes unpunished. It isn’t a saying but perhaps it should be if we take a cue from the start of the PG-rated romantic comed",
    "body": "\n\tNo grand romantic gesture goes unpunished. It isn’t a saying but perhaps it should be if we take a cue from the start of the PG-rated romantic comedy “Solo Mio” — starring Kevin James. James’s Matt is a fourth-grade art teacher, smitten with Heather (Julie Ann Emery), a fellow teacher. A video montage, scored to Ed Sheeran’s sentimental ballad “Perfect,” depicts their courtship. For all the celebratory footage of the happy couple, ending with a clever proposal, things aren’t, well, perfect. Heather says “yes” — to the dress, the nuptials in Rome, a future with Matt — but as the groom stands at the altar, a grin waning beneath his trim beard, the double doors of an ancient chapel swing open…to niente.\n\t\n\n\tJust in time for Valentine’s Day, “Solo Mio,” a title that teases Matt’s misunderstanding of the Italian phrase, follows this wounded soul as he is forced by non-refundable policies to make the most of the numerous honeymoon specials he booked. The first affront might be the beckoning bed strewn with red rose petals. The tandem bike tour of the Eternal City with other lovebirds — awkward — comes in a close second.\n\n\n\tThe hotel concierge Marcello is understanding of Matt’s situation but isn’t going to bend. Portrayed with warmth by Alessandro Carbonara, this sympathetic stickler recalls Hector Elizondo’s fixer role in “Pretty Woman.” He’s a kindly and rooting for Matt. So, he encourages Matt to make the most of the city. (Cinematographer Jared Fadel does, with a color palette that beckons prettier than a postcard.) He’s not the only one to nudge Matt to partake of the amazing setting. A brazenly flirtatious bar patron tells the drunken sad sack, “Look around, Roma’s beauty is here for you. Don’t let your heart close your eyes to it.”\n\t\n\n\tAlthough he’d rather be alone, Matt’s adopted by two couples following the honeymoon-package itinerary. Julian and Meghan (Kim Coates and Alyson Hannigan) and Neil and Donna (Jonathan Roumie and Julie Cerda) bicker enough in their own peculiar ways to have Matt questioning why his near-perfect relationship to Heather is the one that didn’t make it to the “I dos.” Julian and Neil take to goading and championing the understandably hangdog Matt.\n\n\tThe directing brothers Charles and Daniel Kinnane have worked with James before (“Home Team”) and know what they have in the ridiculously amiable star. They also know there’s more, if not depth, soulfulness to his talents. In the place of pratfalls, they’ve found a kind of sheepish charm and hurt.\n\n\tAnd it’s tricky for a script (this one’s by James, and two more Kinnane bros, Patrick and John) to build a budding romance upon the recent “love of one’s life” wreckage without raising reasonable qualms about the quality of Matt’s heartbreak. Enter Gia (Nicole Grimaudo), the owner of a café near Matt’s hotel who sees the hapless tourist get pickpocketed and rescues him.\n\n\tAs fine as the ensemble is — and a cameo quasar shines late in the film — Grimaudo turns out to be the special red sauce in “Solo Mio.” With her wide smile, fractured English, and grown-up grasp of the world, Gia’s a beacon for the emotionally listing Matt. While the timing seems suspect and a bit hurried, the Italian veteran actor and James make their characters’ connection feel inevitable.\n\n\tOf course, the genre dictates that a seemingly sure thing be vexed, and this rom-com is no different. In keeping with the travel tease of the film, its couples — including the presumptive one — head north to Siena and Gia’s family’s home.\n\n\tThere’s a lot of wow factor in these scenes — her family owns a racehorse for heaven’s sake — but is it much different than Dakota Johnson’s Lucy in “Materialists” wandering into Harry’s HNWI digs?\n\n\tWhich brings us to the quandaries of taste, temperament and genre. Some like their rom-coms aching or itching with desire. Others are content to celebrate the affectionate spark. This PG valentine from Angel Studios — the company has yet to make an R-rated anything — is very much the latter. And there’s nothing wrong with that and lot of easy sweetness to “Solo Mio.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Solo Mio’ Review: Kevin James Is Ripe for Romance in Rome",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/MCDSOMI_EC020.jpg?crop=372px%2C0px%2C2221px%2C1245px&resize=1000%2C563"
      ],
      "datePublished": "2026-02-05T23:09:34.000Z",
      "dateModified": "2026-02-05T23:09:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Moulin Rouge! The Musical’ to Close on Broadway After Seven Years",
    "url": "https://variety.com/2026/legit/news/moulin-rouge-musical-close-broadway-1236653932/",
    "image": "https://variety.com/wp-content/uploads/2026/02/04.-Bob-the-Drag-Queen-as-Zidler-Photo-by-Matthew-Murphy.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-05T22:30:00.000Z",
    "description": "\n\t“Moulin Rouge! The Musical” is closing after seven years on Broadway. \n\n\tThe upbeat jukebox musical will play its final performance on July 26 at th",
    "body": "\n\t“Moulin Rouge! The Musical” is closing after seven years on Broadway. \n\n\tThe upbeat jukebox musical will play its final performance on July 26 at the Al Hirschfeld Theatre. By then, “Moulin Rouge” will have played 2,265 regular performances and 24 previews, making it the 36th longest-running show in Broadway history. (That’s a feat in post-pandemic times where new musicals have been majorly struggling to stay open.)\n\n\n\tProducers didn’t give a reason behind the closure. Although the production has been playing to nearly full houses, “Moulin Rouge! The Musical” is enormously expensive to mount because of the music rights and the elaborate, glittering set. An adaptation of Baz Luhrmann’s 2001 musical “Moulin Rouge,” the show uses hits like Elton John’s “Your Song,” “Lady Marmalade,” Sia’s “Chandelier,” Katy Perry’s “Firework” and Beyonce’s “Single Ladies” to score a story about bohemians in the Parisian neighborhood of Montmartre who are trying to keep their nightclub in business.\n\t\n\n\t“Moulin Rouge!” opened on July 25, 2019, to positive reviews. After nine months of strong ticket sales, the pandemic shut down the show along with rest of the theater industry. It reopened in September 2021 and won 10 Tony Awards, including the prize for best musical. “Moulin Rouge! The Musical” also earned Tonys for director Alex Timbers, book writer John Logan and choreographer Sonya Tayeh.\n\n\t“Moulin Rouge!” recouped its investment in late 2022, the only musical production from the 2019-2020 season to do so. It also expanded across the globe with 15 worldwide productions, including a North American tour and stops in London’s West End, Germany and Korea.\n\t\n\n\t“It’s truly been the honor of a lifetime bringing this exceptional show to Broadway. We couldn’t have done it without Baz Luhrmann and Catherine Martin’s trust in allowing us to adapt their iconic film for the stage and for their creative guidance and generosity throughout,” producer Carmen Pavlovic said. “Alex Timbers’ vision and leadership, along with the passion and artistry of our entire creative team, has been unmatched.”\n\n\tProducers have teased they’ll be making “more exciting announcements” before the show closes over the summer. \n\n\t“We’ve always said that ‘Moulin Rouge! The Musical’ is a celebration of Broadway and of the artists who, against all odds, make it possible. We look forward to six more months of celebrating the remarkable people who created this show and those who perform eight times a week. And before we take our final bow, we have more exciting announcements that we can’t wait to reveal,” Pavlovic said. “See you at the Moulin Rouge, Chickens!”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Moulin Rouge! The Musical’ to Close on Broadway After Seven Years",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/04.-Bob-the-Drag-Queen-as-Zidler-Photo-by-Matthew-Murphy.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-05T22:30:00.000Z",
      "dateModified": "2026-02-05T22:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Lucy Liu Peacock Series ‘Superfakes’ Sets Jim McKay, Karena Evans, Andrij Parekh to Direct (EXCLUSIVE)",
    "url": "https://variety.com/2026/tv/news/lucy-liu-peacock-series-superfakes-directors-1236653976/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Superfakes-directors.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-05T23:00:00.000Z",
    "description": "\n\tThe upcoming Peacock crime drama series “Superfakes” has set its director lineup. \n\n\tVariety has learned exclusively that Jim McKay, Karena Evans, a",
    "body": "\n\tThe upcoming Peacock crime drama series “Superfakes” has set its director lineup. \n\n\tVariety has learned exclusively that Jim McKay, Karena Evans, and Andrij Parekh are all set to direct on the show, which was picked up at the NBCU streamer in January 2025. Evans will direct the pilot, while McKay will direct multiple episodes. Both are also executive producers. \n\n\tLucy Liu will lead the cast of “Superfakes,” with additional cast members including Ken Leung, Bohan Phoenix, Michelle Lee Jones, and Keith Leung. The logline for the show states, “A small-time Chinatown luxury counterfeit dealer (Liu) enters a dangerous black-market underworld in order to fund a life of suburban respectability for her family.” \n\t\n\n\tMcKay recently worked on Season 3 of the hit Paramount+ series “Tulsa King” as well as shows like “Smoke” and “Black Bird” for Apple TV and “American Rust” at Prime Video. His other credits include “Breaking Bad,” “Mr. Robot,” “The Americans,” and “Better Call Saul.” \n\n\tEvans has directed on shows like “P-Valley,” “Snowfall,” “Dead Ringers,” “Mr. and Mrs. Smith,” and the HBO Max reboot of “Gossip Girl.” She is also the first woman to be honored with the Prism Prize Lipsett Award in 2018, the same year she took home the Best Director at the Much Music Video Awards and Video of the Year at the BET Awards for Drake’s “God’s Plan.”\n\n\tParekh won an Emmy for outstanding directing for “Succession” in 2020, receiving a nomination in the same category for the show in 2024 for its final season. He had also directed episodes of HBO shows like “Watchmen” and “House of the Dragon.” Parekh is a celebrated cinematographer as well, working on films like “Half Nelson,” “Mississippi Grind,” “Blue Valentine,” “Roofman.” \n\t\n\n\tMcKay is repped by Verve. Evans is repped by CAA, Taj Critchlow/Karoshi Management & Granderson Des Rochers. Parekh is repped by Linden Entertainment and Murtha Skouras Agency. \n\n\tThe series hails from creator Alice Ju, who will serve as writer, executive producer, and showrunner. In addition, Josh Safdie and Benny Safdie will serve as executive producers along with Howard Klein and Olivia Gerke of 3 Arts. Ronald Bronstein and Eli Bush also executive produce, along with Liu, McKay, and Evans. A24 and UCP will produce.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lucy Liu Peacock Series ‘Superfakes’ Sets Jim McKay, Karena Evans, Andrij Parekh to Direct (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Superfakes-directors.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-05T23:00:00.000Z",
      "dateModified": "2026-02-05T23:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jeremy Strong to Star in Jonathan Franzen Series ‘Crossroads’ for Netflix, Media Res (EXCLUSIVE)",
    "url": "https://variety.com/2026/tv/news/jeremy-strong-jonathan-franzen-crossroad-netflix-media-res-1236653512/",
    "image": "https://variety.com/wp-content/uploads/2026/02/P1032UE0.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-05T23:00:00.000Z",
    "description": "\n\tJeremy Strong is attached for a lead role in a series adaptation of the Jonathan Franzen novel “Crossroads” that is currently in development at Netf",
    "body": "\n\tJeremy Strong is attached for a lead role in a series adaptation of the Jonathan Franzen novel “Crossroads” that is currently in development at Netflix, Variety has learned exclusively from sources. \n\n\tThe package hails from Media Res, with Strong executive producing in addition to starring. Amy Herzog (“Scenes From a Marriage,” “Savant”) is attached to write and executive produce the adaptation. Michael Ellenberg and Lindsey Springer of Media Res also executive produce, along with Franzen. \n\t\n\n\tReps for Netflix declined to comment. \n\n\n\tPer the series description, “A Midwestern pastor and his family see their lives unravel after a church scandal sends each of them chasing desire and freedom in different directions, in this darkly funny, epic American family drama set in the early 1970s.”\n\n\tThe novel was originally published in 2021. It is the first of an intended trilogy Franzen has dubbed “A Key to All Mythologies.” \n\n\tShould “Crossroads” go forward, it would be the latest major TV project based on a book that Strong has set at Netflix. He is currently shooting the series adaptation of “The Boys From Brazil,” based on the novel of the same name by Ira Levin. He is also going to star in the Paramount+ limited series “9/12” that follows a landmark legal case about 9/11 first responders. \n\n\tStrong is best known for playing Kendall Roy on the hit HBO series “Succession,” for which he won an Emmy for best actor in a drama series out of three total nominations. He also won the Golden Globe Award in the same category for the series in 2022. Strong received his his first Academy Award for playing Roy Cohn in the film “The Apprentice” in 2025. Strong is also known for his roles in films like “Springsteen: Deliver Me From Nowhere,” “The Big Short,” “Zero Dark Thirty,” and “Parkland.”\n\t\n\n\tHe is repped by WME, Range, Hansen Jacobson, and ID. \n\n\tMedia Res previously worked with Herzog, with the company having produced “Scenes From a Marriage” for HBO. Media Res’ current slate includes “The Morning Show” and “Pachinko” at Apple TV, as well as the upcoming shows “The Dealer” at Apple, “The Miniature Wife” at Peacock, and the Silicon Valley drama “Thumblite” at Netflix. \n\n\tIn addition to her TV writing credits, Herzog is a highly-celebrated playwright. She was nominated for two Tony Awards in 2024 — one for best play (“Mary Jane”) and the other for best revival of a play (“An Enemy of the People”). She was also nominated for best revival of a play in 2023 for “A Doll’s House.” Her 2013 play “4000 Miles” was a finalist for the Pulitzer Prize for Drama. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jeremy Strong to Star in Jonathan Franzen Series ‘Crossroads’ for Netflix, Media Res (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/P1032UE0.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-05T23:00:00.000Z",
      "dateModified": "2026-02-05T23:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jamie Lee Curtis Slams ICE as an ‘Abhorrence’ and Says It’s Being Used as a ‘Distraction So That We Don’t Pay Attention to the Epstein Files’",
    "url": "https://variety.com/2026/politics/columns/jamie-lee-curtis-ice-abhorrence-distraction-epstein-files-1236653979/",
    "image": "https://variety.com/wp-content/uploads/2026/02/GettyImages-2260099736-1.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-05T22:29:04.000Z",
    "description": "\n\tJamie Lee Curtis refuses to be silent.\n\n\tThe Oscar winner spoke out against the Trump administration Thursday morning as she helped non-profit Proje",
    "body": "\n\tJamie Lee Curtis refuses to be silent.\n\n\tThe Oscar winner spoke out against the Trump administration Thursday morning as she helped non-profit Project Angel Food unveil its new The Chuck Lorre Family Foundation Kitchen & Campus in Hollywood.\n\n\t“Every day I think I’m not going to be shocked anymore and then I’m shocked,” Curtis told me. “It’s just inhuman. It is inhuman the way this administration is treating its citizens and its constituents and people in need. It’s an abhorrence what they’re doing. The ICE situation is out of control. It’s simply a distraction so that we don’t pay attention to the Epstein files.”\n\t\n\n\tCurtis is the latest in a slew of celebrities who have condemned ICE’s enforcement tactics. Bad Bunny, Billie Eilish, Finneas and Kehlani were among those who blasted the federal agency and called for support of immigrants in the U.S. during the Grammys on Sunday.\n\n\n\t“I’m angrier probably that I’ve ever been and more turned on to the need to do what we’re doing,” Curtis said.\n\n\tJust moments before talking to the press, Curtis delivered fiery remarks at the podium, calling for unity and shouting out the community activism taking place in Minnesota. “We’re only going to get shit done if we do it together and defy these motherfuckers,” she said to applause.\n\nJamie Lee Curtis speaks at the unveiling of Project Angel Food’s new campus in Hollywood, delivering a fiery call for unity and shouting out the community in Minnesota.“We’re only going to get s*ht done if we do it together and defy these motherf*kers.” pic.twitter.com/kCGRBcJnoK— Variety (@Variety) February 5, 2026\n\n\n\tCurtis is a longtime supporter of Project Angel Food. The organization started decades ago as a meal-delivery service for people with HIV and AIDS. It now serves 1.5 million medically tailored meals annually to 7,152 clients with critical and life-threatening illness throughout Los Angeles.\n\t\n\n\tCurtis and television impresario Chuck Lorre serve as co-chairs of Project Angel Food’s Rise to the Challenge capital campaign.\n\n\t“See what sitcoms can do,” Lorre cracked. “Come on, right? I’m very grateful and honored to be a part of this.”\n\n\tLooking up at his name on the building, Lorre joked, “I’m starting to feel uncomfortably like [billionaire media businessman and philanthropist] Haim Saban. Not to cast dispersion but a smaller font would have been good.”\n\n\n\tKidding aside, Lorre recalled being introduced to Project Angel Food. “They have a policy which struck me deeply which is ‘food is medicine.’ Not food is calories, but food is medicine. Food that nourishes and brings health,” he said. “It meant a lot to me because as a much younger man I was very ill, and nutrition actually turned it around so I know something about how important it is to be fed properly.”\n\n\tThe Chuck Lorre Family Foundation donated $10 million for the construction of the new $51.5 million campus. In January 2025, the foundation also gave $250,000 toward Project Angel Food’s efforts to help people affected by the Southern California wildfires.\n\n\tProject Angel Food CEO Richard Ayoub also announced at the unveiling that Lorre has committed an additional dollar-for-dollar matching grant of $1.5 million.\n\n\tThe Chuck Lorre Family Foundation Kitchen & Campus also includes the Jamie Lee Curtis and Christopher Guest Kitchen Volunteer Center, dedicated to Richard Frank and George Lowe, two of Curtis’ friends who died during the early days of the AIDS epidemic.\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jamie Lee Curtis Slams ICE as an ‘Abhorrence’ and Says It’s Being Used as a ‘Distraction So That We Don’t Pay Attention to the Epstein Files’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/GettyImages-2260099736-1.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-05T22:29:04.000Z",
      "dateModified": "2026-02-05T22:29:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Savannah Guthrie’s Mom’s Disappearance Has Rocked ‘Today’ — and Strained Morning TV’s Image of a Joyful Family",
    "url": "https://variety.com/2026/tv/columns/today-show-nancy-guthrie-disappearance-savannah-1236654001/",
    "image": "https://variety.com/wp-content/uploads/2026/02/savannah-guthrie_42b4d1.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-05T22:02:57.000Z",
    "description": "\n\tMany workplaces sell themselves as a family, but broadcast morning shows are somewhat unique in doing so on live TV for hours each day, beamed into ",
    "body": "\n\tMany workplaces sell themselves as a family, but broadcast morning shows are somewhat unique in doing so on live TV for hours each day, beamed into people’s living rooms. Long before podcasts popularized pop sociology terms like “parasocial relationship” or ballooned into marathon video sessions to be passively consumed while going about one’s routine, morning shows like NBC’s “Today” had filled that essential role for decades. Anchors play an almost parental part, presiding over a crew of correspondents and acting as a stabilizing force amid the tonal extremes of daytime infotainment, which can veer from geopolitical crisis to lighthearted human interest within minutes. Since Sunday, the real-life family of “Today” anchor Savannah Guthrie has been enduring an unimaginable tragedy: the abduction of Guthrie’s 84-year-old mother Nancy from her home in Tucson, Arizona, who remains missing as of this writing. Guthrie has been understandably absent from the show’s Rockefeller Center studio since. Her only public statements have come via her Instagram: one a request for her fans to pray on Nancy’s behalf, the other a tearful video recorded jointly with Guthrie’s siblings asking the abductors to provide proof of life and reach out directly with next steps. But “Today” itself has continued on, with Sheinelle Jones filling in for her colleague in the show’s first hour alongside Craig Melvin. To watch the show this week has been to watch “Today” cover a news story that is also a deeply personal, upsetting event — for the “Today” personalities, and also for the audience accustomed to seeing them as a jovial team to whom projecting camaraderie is part of the job. On Monday, Jones directly addressed Guthrie through the camera after she and Melvin provided a sober update on the situation: “Sending love, my friend.” Fellow anchor Jenna Bush Hager has been more openly emotional still, recounting a vigil in Nancy’s honor on Thursday through visible tears. Guthrie has served as a steadying presence since her initial promotion to co-anchor of “Today” in 2012, a hiring that thrust her into the uncomfortable position of smoothing over the disastrous pairing of Matt Lauer and Ann Curry that ended with Curry being pushed out. Guthrie proved a more natural fit for the warm, inviting tone of morning TV than her predecessor, and successfully moved the show forward with minimal friction — until 2017, when Lauer’s firing for a pattern of sexual misconduct in the workplace once again called on Guthrie, along with her new co-anchor Hoda Kotb, to assure viewers they were still in capable hands. Over nearly 15 years, Guthrie has grown so essential to the NBC brand that she’s entrusted with co-hosting the annual Thanksgiving Day Parade telecast, one of the most high-profile events on television. Now, Guthrie has been subjected to a nightmare that demands her full attention, leaving her co-stars to serve the role she once did as steps away from duties like regular hosting or covering the imminent Winter Olympics in Italy. Jones herself has experienced a tremendous personal challenge in public, having taken time away from “Today” before and after the death of her husband from cancer last year. (Guthrie at the time used decidedly familial language around Jones’ return, saying, “We cannot wait to welcome Sheinelle home.”) Along with Melvin, Jones has opened each installment of the show with a segment dedicated to the ongoing search for Nancy, extending “thoughts and prayers” to “a beloved member of our ‘Today’ family,” accompanied by clips and images of Nancy’s appearances on “Today” over the years. Jones, Melvin and the “Today” producers have presented these heartfelt expressions of solidarity alongside objective reporting. Enlisting NBC News correspondent Liz Kreutz to deliver dispatches from the ground in Tucson as well as law enforcement and intelligence reporter Tom Winter for in-studio analysis, “Today” has been placed in the position of covering one of its marquee news presenters as a news story in her own right. On Thursday, former ATF special agent in charge Jim Cavanaugh was called on to assess Guthrie’s own video plea, pointing out its tactical intent to “humanize” Nancy, whose captors might otherwise view her as “just an object.” The interview was informative, but also juxtaposed strangely with the interviewers’ intimate connection to the case at hand. So did the transitions to other current topics throughout the week, from winter storms to the Grammy Awards to the upcoming Super Bowl. Broadcast news as a medium is currently in an embattled moment. Newly installed CBS News head Bari Weiss has been moving fast and breaking things in her short time on the job; earlier this week, “Today” network NBC announced the end of “The Kelly Clarkson Show” — not a news product, but a daytime talk series that exists along the same spectrum of lighter, personality-led digests as morning shows. But the “Today” coverage of Guthrie’s plight underscores the strength of the connections, both internal and external, that have made morning shows a firmament of culture for so many years. Even the inevitable awkwardness of “Today” as we await crucial updates is the magnified reflection of the universal, familiar process of having to press on at work while navigating the worst at home. A figurative family can still follow the contours of a literal one.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Savannah Guthrie’s Mom’s Disappearance Has Rocked ‘Today’ — and Strained Morning TV’s Image of a Joyful Family",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/savannah-guthrie_42b4d1.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-05T22:02:57.000Z",
      "dateModified": "2026-02-05T22:02:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Woody Allen and Soon-Yi Previn’s Emails to Jeffrey Epstein Unearth College Admissions Boost, #MeToo Criticism and a Timothée Chalamet Diss",
    "url": "https://variety.com/2026/film/news/epstein-files-woody-allen-soon-yi-bard-chalamet-1236653814/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Woody-Allen-and-Soon-Yi-Previn-and-Jeffrey-Epstein.jpg?crop=0px%2C23px%2C1000px%2C562px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-02-05T22:44:14.000Z",
    "description": "\n\tWoody Allen was a famous Luddite during his decades-long reign in Hollywood, sneering at modern technology at every opportunity (even refusing digit",
    "body": "\n\tWoody Allen was a famous Luddite during his decades-long reign in Hollywood, sneering at modern technology at every opportunity (even refusing digital prints for his movies). But that attitude did not extend to those in his household, as a slew of private emails from his wife Soon-Yi Previn to Jeffrey Epstein proved this week.\n\n\tNumerous unearthed communications from Previn give insight into the couple’s personal history — and suggest close ties to Epstein, the late convicted sex offender and human trafficker. Writing on both her own behalf and her husband’s from a personal email account, Previn talked to Epstein about current events and asked him for favors, documents from the U.S. Department of Justice suggest.\n\t\n\n\tOne 2017 exchange shows Previn profusely thanking Epstein for helping daughter Bechet Allen gain admission to New York’s Bard College, thanks to a personal connection the billionaire had with school president Leon Botstein. \n\n\n\t“I think it’s best that Bechet struggles and doesn’t know ahead of time that she got in so that when she gets into Bard she will have sweated it out a bit and will really want to go. Thank you for coming through for us,” Previn wrote to Epstein. “I can’t tell you how much this means to me. Woody said when Bechet sets fire to the school they’ll have you to thank.”\n\n\tRepresentatives for Bard College did not immediately return Variety’s request for comment, though a spokesperson for Botstein told the New York Times that Epstein was “a serial liar who apparently took credit for the sun rising each day.” The rep added that Bechet Allen, who graduated in 2021, was admitted “on the merits of her own qualifications,” as a reported 40% of hopeful students are to Bard each year.\n\t\n\n\tA representative for Woody Allen did not immediately respond to a request for comment. A direct request to Previn for comment went unanswered.\n\n\tThere’s also a 2016 exchange between Previn and Epstein, discussing disgraced politician Anthony Weiner following his conviction for transferring obscene material to a minor.\n\n\t“She knew exactly what she was doing and how vulnerable [Weiner] was, and she reeled him in like fish to bait,” Previn wrote of the 15-year-old girl that Weiner attempted to solicit nude photos from. “What is her excuse for being a despicable and disgusting person,” she pondered, saying the minor in the case treated Weiner as “prey.”\n\n\tOutside of hot topics and the academic aspirations of her kids, Previn freely shared thoughts with Epstein about the famous figures she and Woody Allen intersected with.\n\n\t“I’m glad that prick Chalamet’s movie did not get a good review,” she wrote in 2018, referring to Timothée Chalamet. The “Marty Supreme” actor was the lead in Allen’s “A Rainy Day in New York,” which Amazon shelved that same year. The production was plagued by scandal as #MeToo consumed the culture and the world re-litigated Allen’s own past accusations of sexual abuse against daughter Dylan Farrow.\n\n\t“No I’m not vindictive,” Previn added of Chalamet, who was starring in Amazon’s “Beautiful Boy” at the time.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Woody Allen and Soon-Yi Previn’s Emails to Jeffrey Epstein Unearth College Admissions Boost, #MeToo Criticism and a Timothée Chalamet Diss",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Woody-Allen-and-Soon-Yi-Previn-and-Jeffrey-Epstein.jpg?crop=0px%2C23px%2C1000px%2C562px&resize=1000%2C563"
      ],
      "datePublished": "2026-02-05T22:44:14.000Z",
      "dateModified": "2026-02-05T22:44:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Panthers' Tetairoa McMillan Apologizes After Saying N-Word On Twitch Stream",
    "url": "https://www.tmz.com/2026/02/05/tetaiora-mcmillan-apologizes-racial-slur-stream/",
    "image": "https://imagez.tmz.com/image/e2/16by9/2026/02/05/e22b9fbea9f744ad924b475c3acc3cd8_xl.png",
    "tag": "Entertainment",
    "date": "2026-02-05T23:54:00.000Z",
    "description": "\n    \n                    \n                          Panthers' Tetairoa McMillan\n                          Apologizes For Using N-Word\n               ",
    "body": "\n    \n                    \n                          Panthers' Tetairoa McMillan\n                          Apologizes For Using N-Word\n                          During Twitch Stream\n                      \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Carolina Panthers wide receiver Tetairoa McMillan is spending his Thursday apologizing to fans after he used the n-word during a livestream ... saying \"there's no excuse for what I said.\"\n      \n    \n          McMillan issued the remorseful message on Instagram ... saying, \"I sincerely apologize for speaking thoughtlessly and will do better.\"\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          The first-year player was playing Madden in \"The Streamer Bowl,\" a charity esports tournament that has Twitch streamers and NFL stars on teams as they take on challenges.\n      \n    \n          T-Mac was streaming with YonnaJay and Tamir when the moment occurred. After intercepting a pass, he shouted the slur in excitement.\n      \n\n          The other two streamers appeared shocked after he walked off, with YonnaJay whispering something to Tamir.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          The clip spread like wildfire on social media not long after it happened, with some posts garnering millions of views.\n      \n    \n          Whether McMillan will address it further when he attends NFL Honors tonight remains to be seen, as he is up for the NFL's Offensive Rookie of the Year award.\n      \n    \n          It was a strong season for University of Arizona product ... racking up 75 catches for 1,095 yards and seven touchdowns in his first year in the league.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                TMZ Sports\n              \n                          \n                Controversial S#!T\n              \n                          \n                Carolina Panthers\n              \n                          \n                Football\n              \n                          \n                NFL\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Panthers' Tetairoa McMillan Apologizes After Saying N-Word On Twitch Stream",
      "image": [
        "https://imagez.tmz.com/image/e2/16by9/2026/02/05/e22b9fbea9f744ad924b475c3acc3cd8_xl.png"
      ],
      "datePublished": "2026-02-05T23:54:00.000Z",
      "dateModified": "2026-02-05T23:54:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Florida Teen Sets Friend on Fire, Shocking Video Shows",
    "url": "https://www.tmz.com/2026/02/05/teen-sets-friend-on-fire-video-florida/",
    "image": "https://imagez.tmz.com/image/65/16by9/2026/02/05/650125a2395e406dbebe500de9d3c240_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-05T20:30:32.000Z",
    "description": "\n    \n                    \n                          Florida Firebug\n                          Allegedly Sets Friend Ablaze In Wild Video\n            ",
    "body": "\n    \n                    \n                          Florida Firebug\n                          Allegedly Sets Friend Ablaze In Wild Video\n                      \n                  \n                                                                        Published \n                              \n                February 5, 2026\n                \n                            12:30 PM PST\n                                                                      |\n                                                                Updated \n                                  February 5, 2026\n                                1:32 PM PST\n                                    \n      \n    \n      \n        \n                    \n                  \n      \n                    Marion County Sheriff's Office\n          \n    \n          A teenage boy in Florida is facing a felony charge over a video that law enforcement says shows him intentionally setting his friend on fire on a beach.\n      \n    \n          The Marion County Sheriff's office says a 17-year-old kid in a viral video is seen creating a trail of gasoline from a campfire on the sand ... and splashing gas on another boy sitting nearby, causing him to light up. That kid ran into the lake to extinguish the flames.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          The victim told his mom he got burned when he tried to throw a water bottle filled with gas into a fire ... but his dad found the video and called the sheriff. Cops later found the gas container in nearby shrubbery ... along with some \"empty alcoholic beverage cans.\"\n      \n\n          The flare-up went down the night of Jan. 10 on Kauffmans Island at Lake Kerr, about 80 miles north of Orlando. The sheriff's arrest affidavit says the teens rode a Jet Ski back to one of their houses before the victim decided to go to a hospital hours later ... from there, he was then flown to a children's hospital and treated in the pediatric intensive care unit for second-degree burns.\n      \n    \n          But ... cops didn't start an investigation until 15 days later, when the victim's parents called police after finding Snapchat video of the incident that didn't match up with what their kid told them.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          The affidavit describes the poor kid's \"significant burn injuries,\" including a \"deep full thickness\" burn on both legs -- and a burn on his buttock ... and his hand was covered with blisters. His legs were bloodied and had skin discoloration, cops said.\n      \n    \n          The victim told cops he lied to his parents because the suspect didn't want him to say anything about the whole thing.\n      \n    \n      \n        \n                    \n                  \n      \n                    Marion County Sheriff's Office\n          \n    \n          Check out video of the arrest of the 17-year-old with the gas container last week ... he's now facing a felony aggravated battery charge ... cops said the video was allegedly still on his phone's camera roll.\n      \n    \n          Deputies allege the suspect brought Smirnoff-brand alcoholic beverages, and the group had Michelob cans as well.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          A witness told cops no one was arguing and it didn't seem like the suspect maliciously burned the other boy ... in the video it sounds like someone asks, \"You want to be on fire?\"\n      \n    \n          Florida, man.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Crime & Arrests\n              \n                          \n                Insane Videos\n              \n                          \n                Nurse!\n              \n                          \n                Fairly Legal\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Florida Teen Sets Friend on Fire, Shocking Video Shows",
      "image": [
        "https://imagez.tmz.com/image/65/16by9/2026/02/05/650125a2395e406dbebe500de9d3c240_xl.jpg"
      ],
      "datePublished": "2026-02-05T20:30:32.000Z",
      "dateModified": "2026-02-05T20:30:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "BLACKPINK's Lisa Teams Up With 'White Lotus' EP Again for New Netflix Show",
    "url": "https://www.tmz.com/2026/02/05/blackpink-lisa-white-lotus-david-bernad-netflix/",
    "image": "https://imagez.tmz.com/image/21/16by9/2026/02/05/21b037f6fd2f4260bd0c75f4a16fa29f_xl.png",
    "tag": "Entertainment",
    "date": "2026-02-05T20:17:20.000Z",
    "description": "\n    \n                    \n                          BLACKPINK's Lisa\n                          K-Poppin' Over to Netflix for a Rom-Com!!!\n           ",
    "body": "\n    \n                    \n                          BLACKPINK's Lisa\n                          K-Poppin' Over to Netflix for a Rom-Com!!!\n                      \n                  \n                                                                        Published \n                              \n                February 5, 2026\n                \n                            12:17 PM PST\n                                                                      |\n                                                                Updated \n                                  February 5, 2026\n                                3:16 PM PST\n                                    \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          BLACKPINK’s Lisa is on an absolute roll -- fresh off turning heads in \"The White Lotus\" -- and she’s already lining up her next big move ... a Netflix rom-com!\n      \n    \n          Yep, the Thai superstar is fully in her acting era ... after bonding on the 'TWL' set with EP David Bernad over their shared love of the rom-com classic \"Notting Hill,\" the two reportedly teamed up to cook up the premise for this brand-new streaming project.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Deadline broke the news, noting the logline’s still under lock and key ... but the creative muscle is no joke. Comedy heavyweight Katie Silberman -- the writer behind \"Booksmart\" and \"Set It Up\" -- is penning the script.\n      \n\n          Not bad for someone who only made her acting debut last year ... Lisa’s already cruising into top-tier territory.\n      \n    \n      \n        \n              \n    \n    \n          Lisa’s not slowing down anytime soon either ... she’s also set to appear in \"Tygo,\" a spin-off tied to the \"Extraction\" universe. Bottom line? K-pop isn’t just crossing over -- it’s taking over!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                LISA\n              \n                          \n                TV\n              \n                          \n                Netflix\n              \n                          \n                Music\n              \n                          \n                K-Pop\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "BLACKPINK's Lisa Teams Up With 'White Lotus' EP Again for New Netflix Show",
      "image": [
        "https://imagez.tmz.com/image/21/16by9/2026/02/05/21b037f6fd2f4260bd0c75f4a16fa29f_xl.png"
      ],
      "datePublished": "2026-02-05T20:17:20.000Z",
      "dateModified": "2026-02-05T20:17:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nancy Guthrie Ransom Letter Deadline Passes Without Proof of Life",
    "url": "https://www.tmz.com/2026/02/05/nancy-guthrie-ransom-deadline-passed-no-proof-life/",
    "image": "https://imagez.tmz.com/image/ff/16by9/2026/02/06/ffee002061554f558631b07b7a5194e3_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-06T00:16:48.000Z",
    "description": "\n    \n                    \n                          Nancy Guthrie Kidnapping\n                          1st Ransom Note Deadline Passes ...\n          ",
    "body": "\n    \n                    \n                          Nancy Guthrie Kidnapping\n                          1st Ransom Note Deadline Passes ...\n                          Son Makes New Plea For Proof of Life\n                      \n                  \n                                                                        Published \n                              February 5, 2026\n                            4:16 PM PST\n                                                                            \n      \n    \n      \n        \n                    \n                  \n      \n                    Instagram / @savannahguthrie\n          \n    \n          Moment of truth in the Nancy Guthrie kidnapping case ... the first deadline from the ransom letter came and went ... but the family says they still haven't heard a peep from whoever abducted her.\n      \n    \n          The first deadline lapsed at 4 PM PT Thursday ... that's when millions of dollars in bitcoin were due in exchange for Nancy's safe return.\n      \n    \n          'TODAY' host Savannah Guthrie uploaded a video of her brother saying the family has not gotten proof of life on Nancy ... as they've been requesting since Wednesday evening.\n      \n\n          Thursday's deadline was included in the ransom letter sent to TMZ on Tuesday, which we forwarded to law enforcement, and the FBI came out Thursday and revealed to the public the first deadline date.\n      \n    \n      \n        \n                    \n                  \n      \n                    FOX 10 Phoenix\n          \n    \n          Savannah Guthrie posted a video yesterday acknowledging the ransom and saying the family was ready to talk if they got proof of life on Nancy.\n      \n    \n          The feds say it's up to the Guthries if they want to pay the ransom demand.\n      \n    \n      \n        \n                    \n                  \n      \n                    Instagram / @savannahguthrie\n          \n    \n          It's worth noting there's a second deadline set for Monday Feb. 9, as confirmed by authorities.\n      \n    \n          The FBI wouldn't say what exactly changes once the deadlines come and go ... but -- as Harvey and Charles said on \"TMZ Live\" -- we know if the first one is missed, that changes the demand ... while missing the second has a much more serious consequence.\n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          We reached out to NBC ... the network had no comment.\n      \n    \n          We reached out to the FBI ... so far, no word back.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Savannah Guthrie\n              \n                          \n                Nancy Guthrie\n              \n                          \n                Celebrity News\n              \n                          \n                Today Show\n              \n                          \n                Nancy Guthrie Case\n              \n                          \n                True Crime\n              \n                          \n                Police\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nancy Guthrie Ransom Letter Deadline Passes Without Proof of Life",
      "image": [
        "https://imagez.tmz.com/image/ff/16by9/2026/02/06/ffee002061554f558631b07b7a5194e3_xl.jpg"
      ],
      "datePublished": "2026-02-06T00:16:48.000Z",
      "dateModified": "2026-02-06T00:16:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "TMZ Sports Streaming Live From Newsroom, Join The Conversation!",
    "url": "https://www.tmz.com/2026/02/05/tmz-sports-live-stream/",
    "image": "https://imagez.tmz.com/image/bf/16by9/2026/02/05/bf188ef6f293499aa847a652a306ec34_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-05T20:57:40.000Z",
    "description": "\n    \n                    \n                          TMZ Sports Live Stream\n                          Join The Conversation!!!\n                      \n",
    "body": "\n    \n                    \n                          TMZ Sports Live Stream\n                          Join The Conversation!!!\n                      \n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          TMZ Sports is going live from the newsroom to discuss the day's biggest stories ... but we don't just want folks to watch and enjoy the conversation, we want y'all to get involved!!\n      \n    \n          Hit the comment section as Babcock, Lucas, Dylan, Luca, and the whole crew break down the most important topics of the day ... and we'll be interacting with viewers throughout the program between 1 and 2:30 PM PT.\n      \n    \n          YouTube, X, TikTok ... we're everywhere.\n      \n    \n          So tune in, make fun of us, share your two cents, sound off about your favorite team ... nothing is out of bounds.\n      \n    \n          Thursday's show is all about our exclusive chat with Travis Kelce, the latest on Bad Bunny's Super Bowl Halftime Show, Lindsey Vonn's big update and so much more!!\n      \n      \n              \n          \n                          \n                TMZ Sports\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "TMZ Sports Streaming Live From Newsroom, Join The Conversation!",
      "image": [
        "https://imagez.tmz.com/image/bf/16by9/2026/02/05/bf188ef6f293499aa847a652a306ec34_xl.jpg"
      ],
      "datePublished": "2026-02-05T20:57:40.000Z",
      "dateModified": "2026-02-05T20:57:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]