[
  {
    "title": "EJAE Releases New Heartbreak Anthem ‘Time After Time’",
    "url": "https://variety.com/2026/music/news/ejae-single-time-after-time-1236654133/",
    "image": "https://variety.com/wp-content/uploads/2026/02/EJAE-Time-After-Time-Press-Image-Photo-by-PAKBAE-3-e1770341879205.jpg?crop=0px%2C176px%2C6230px%2C3505px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-02-06T05:01:00.000Z",
    "description": "\n\tGrammy Award winning singer-songwriter EJAE  has released her latest single “Time After Time.”\n\n\tThis is her second track following last year’s “In ",
    "body": "\n\tGrammy Award winning singer-songwriter EJAE  has released her latest single “Time After Time.”\n\n\tThis is her second track following last year’s “In Another World.” This time around, EJAE delivers what’s described as an infectious heartbreak anthem with lyrics that reflect on a relationship that still lingers, capturing the all-too-familiar cycle of thinking about a former lover long after the relationship has run its course.\n\t\n\n\tEJAE said, “The melody of ‘Time After Time’ was stuck in my head for years, just like the person I wrote itabout.”\n\n\n\tEJAE soared to global success with “KPop Demon Hunters,” where she served as the singing voice of Rumi. Huntr/X, the fictional girl group from the Netflix animated film, scored four Billboard Top 10 songs.\n\n\tThis year, she scooped up a Critics Choice Award and Golden Globe Award for “Golden” which was co-written with Mark Sonnenblick, 24, IDO and TEDDY. The song is also nominated for an Academy Award.\n\n\tWith the Grammy win, she wrote, “I am still trying to process this whole past week, I still can’t believe I was even nominated for a Grammy….Growing up I always dreamed of winning one, but it felt so impossible. Thank you to the grammys and the whole recording academy for this insane honor…this means so much to me as a musician, and even more as an asian-american woman… this award is a reminder to never give up, to not be afraid to take risks, and to stay resilient.”\n\n\tShe has also been named one of Variety’s 10 Artisans to Watch in Songwriting, and will be honored at the Santa Barbara International Film Festival Variety Artisans Awards recognizing her work on “Golden.”\n\t\n\n\tBefore stepping out into the spotlight with her own music, EJAE’s credits included AESPA’s “Drama” and “Armageddon,” Red Velvet’s iconic track “Psycho,” and songs with artists such as Le Sserafim, TWICE, Taeyeon, NMIXX, and FiftyFifty.\n\n\t“Time After Time,” released by Universal Music, is now available to stream on all platforms here.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "EJAE Releases New Heartbreak Anthem ‘Time After Time’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/EJAE-Time-After-Time-Press-Image-Photo-by-PAKBAE-3-e1770341879205.jpg?crop=0px%2C176px%2C6230px%2C3505px&resize=1000%2C563"
      ],
      "datePublished": "2026-02-06T05:01:00.000Z",
      "dateModified": "2026-02-06T05:01:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Squid Game’ Creator Hwang Dong-hyuk, Zhang Ziyi, Jia Zhangke to Lead Masterclasses at Hong Kong’s Asian Film Awards",
    "url": "https://variety.com/2026/film/news/squid-game-zhang-ziyi-jia-zhangke-masterclasses-asian-film-awards-1236654228/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Dong-Hyuk-Zhang-Ziyi-Jia-Zhangke.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-06T08:06:11.000Z",
    "description": "\n\tThe Asian Film Awards Academy has unveiled a star-studded lineup for its 19th edition, announcing three major masterclass events featuring Hwang Don",
    "body": "\n\tThe Asian Film Awards Academy has unveiled a star-studded lineup for its 19th edition, announcing three major masterclass events featuring Hwang Dong-hyuk, creator of Netflix’s global phenomenon “Squid Game,” acclaimed Chinese director Jia Zhangke, and top actor Zhang Ziyi.\n\n\tPresented by AFAA and supported by the Cultural and Creative Industries Development Agency and the Film Development Fund, the March 15 program will take place at the Grand Theatre, Xiqu Centre in Hong Kong’s Tsim Sha Tsui district. The masterclasses span acting, auteur filmmaking and series creation, inviting audiences to explore contemporary cinema from multiple perspectives.\n\t\n\n\tThe Asian Film Awards Academy, a non-profit organization founded by the Busan, Hong Kong and Tokyo international film festivals, aims to celebrate excellence in Asian cinema while promoting and recognizing Asian films and talent.\n\n\n\tThe academy previously announced it would suspend all competitive award categories for this year’s ceremony, presenting only special honors in a “dignified and minimalist manner” following last year’s devastating Hong Kong fire that claimed more than 150 lives. The revised format aligns with Hong Kong government guidance for restrained public events following the tragedy.\n\n\tHwang’s masterclass will examine his creative journey from social dramas like “Silenced” to the comedy “Miss Granny,” exploring how years of persistence culminated in “Squid Game,” which transformed childhood games into themes of class and survival that resonated globally. \n\n\tJia, known for his understated realism in films including “Pickpocket,” “Platform” and “Still Life,” will discuss his creative philosophy. The director, a regular presence at Venice, Cannes and Berlin film festivals, has spent decades capturing lives in a changing China. \n\t\n\n\tZhang’s session, combined with the awards ceremony, will focus on her approach to character-building and expanding narrative space for Chinese actors on the world stage. Known for performances in “Crouching Tiger, Hidden Dragon,” “The Grandmaster” and “Jasmine Women,” Zhang has also served as a juror at major film festivals.\n\n\tAFAA also unveiled three Youth Ambassadors: Thai actor Phiravich Attachitsataporn (Mean), Hong Kong’s Natalie Hsu and Taiwan’s Kent Tsai. The emerging Asian actors from different regions will attend the awards ceremony, highlighting new energy shaping Asian cinema’s future.\n\n\tSince 2023, the Asian Film Awards’ featured programs have received enthusiastic response, with screenings and talks drawing strong interest. This year’s lineup will also include Asian Cinerama and In Conversation events, with further details to be announced.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Squid Game’ Creator Hwang Dong-hyuk, Zhang Ziyi, Jia Zhangke to Lead Masterclasses at Hong Kong’s Asian Film Awards",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Dong-Hyuk-Zhang-Ziyi-Jia-Zhangke.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-06T08:06:11.000Z",
      "dateModified": "2026-02-06T08:06:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Mark Ruffalo Tells Kevin O’Leary to ‘STFU’: ‘You Played Yourself Well in “Marty Supreme”‘",
    "url": "https://variety.com/2026/film/news/mark-ruffalo-kevin-oleary-why-dont-you-stfu-1236654203/",
    "image": "https://variety.com/wp-content/uploads/2026/02/FotoJet-77.jpg?crop=0px%2C16px%2C1800px%2C1012px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-02-06T04:42:37.000Z",
    "description": "\n\tBillie Eilish‘s anti-ICE Grammys speech has set off a firestorm of controversy over the past few days as social media users weigh in on her comments",
    "body": "\n\tBillie Eilish‘s anti-ICE Grammys speech has set off a firestorm of controversy over the past few days as social media users weigh in on her comments. The latest salvo comes from Mark Ruffalo, who told “Marty Supreme” star and “Shark Tank” host Kevin O’Leary on Threads “Why don’t you STFU.”\n\n\t“It’s hilarious,” Ruffalo’s post continued. “You will go on any show and talk shit about any number of things and smugly expect us to listen to you, but you will dig into a real artist that dwarfs anything you dream of doing for actually saying something that resonates with 100’s of millions of people the world over. It’s astounding the fantasy double standard Kevin O’Leary lives in. You played yourself well in Marty Supreme.”\n\t\n\n\tIn “Marty Supreme,” O’Leary plays a ruthless businessman who finances Marty Mauser’s ping pong career while humiliating him in grotesque ways. \n\n\n\tRuffalo was responding to O’Leary’s recent criticism of Eilish’s Grammys speech on Fox News. “It’s the first lesson 101 for celebrity: as you rise up, whether you’re a film star or music star or whatever, shut your mouth, and just entertain,” O’Leary said.\n\n\tAt Sunday’s Grammy awards, Eilish accepted her Grammy for song of the year with a speech that has riled up conservatives. “As grateful as I feel, I honestly don’t feel like I need to say anything but that no one is illegal on stolen land,” she said. “It’s just really hard to know what to say and what to do right now, and I feel really hopeful in this room, and I feel like we just need to keep fighting and speaking up and protesting, and our voices really do matter, and the people matter, and fuck ICE.”\n\t\n\n\tOn Wednesday, her brother Finneas came to her defense, saying on Threads, “Seeing a lot of very powerful old white men outraged about what my 24-year-old sister said during her acceptance speech.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Mark Ruffalo Tells Kevin O’Leary to ‘STFU’: ‘You Played Yourself Well in “Marty Supreme”‘",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/FotoJet-77.jpg?crop=0px%2C16px%2C1800px%2C1012px&resize=1000%2C563"
      ],
      "datePublished": "2026-02-06T04:42:37.000Z",
      "dateModified": "2026-02-06T04:42:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Arco’ Review: Oscar-Nominated French Animation Tells an Environmentally Conscious Sci-Fi Story With Hope for the Future",
    "url": "https://variety.com/2026/film/news/arco-review-french-animation-natalie-portman-1236654201/",
    "image": "https://variety.com/wp-content/uploads/2026/01/ARCO.jpg?crop=0px%2C261px%2C2325px%2C1308px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-02-06T03:33:23.000Z",
    "description": "\n\t40 years from now, in 2075, extreme climate events will have forced humanity to live, at least partially, inside protective domes. Most jobs will ha",
    "body": "\n\t40 years from now, in 2075, extreme climate events will have forced humanity to live, at least partially, inside protective domes. Most jobs will have been outsourced to robots, everything from road work to the police. And even professions where the human touch was once thought essential, like teaching and childcare, will then be performed by humanoid machines. At least that’s how French director Ugo Bienvenu envisions it in his debut feature “Arco,” which is currently nominated for the best animated feature Oscar.\n\t\n\n\tDespite such gloomy forecast, “Arco,” an incisive and wondrous sci-fi adventure about two children from two different periods, is ultimately hopeful about humankind’s prospects. Bienvenu’s hand-drawn characters appear halfway between the gritty realism one expects from mature graphic novels or comics and the cartoonish look of certain anime. The gorgeous, detailed backgrounds are one strong giveaway of Hayao Miyazaki’s marked influence on the French animator and illustrator. And that’s because both timelines in “Arco” unfold in environments were nature is prominent. That alone distinguishes Bienvenu’s take on a futuristic reality from most sci-fi narratives, which often occur in sleek, cold labs, desolate planets, or intricate spaceships floating in the vastness of space.\n\n\n\tThe version of Earth that 10-year-old Arco (Juliano Krue Valdi) lives in features homes on platforms raised on giant beams. Humans live above the clouds, and they have, seemingly, returned to a more minimalistic lifestyle after a catastrophe. Still, a young kid is a young kid no matter the era, and to fulfill his wish of seeing real dinosaurs, Arco disobeys his parents. He steals a rainbow-colored, flying cape that allows people to time travel and accidentally lands himself in the aforementioned, robot-driven year: 2075. Arnaud Toulon’s epic score propels “Arco” into Amblin movie territory, especially in scenes that soar across the sky.\n\t\n\n\tThere, Arco finds an inquisitive ally in Iris (Romy Fay), a girl his age, but with a different experience growing up. While Arco’s parents are physically present in his life, Iris only gets to interact with their holograms since they are away working. Caring for Iris and her infant brother Peter instead is a robot nanny named Mikki (whose voice combines Natalie Portman and Mark Ruffalo’s voices, since the actors also play Iris’ parents). From here, the film’s plot is simple. Arco must find the crystal he lost when crash landing in order for his colorful cape to work and travel back to his time. But an environmental disaster and a trio of quirky stooges (voiced by Will Ferrell, Flea, and Andy Samberg) will get in the way.\n\n\tCuriosity for each other’s worlds dominates the relationship between Arco and Iris. She is surprised to learn that in his time, her future, robots like Mikki no longer exist, and he’s jealous that her parents are not around to discipline her. The exchange between these two futures yields a major revelation for the conclusion, but it also puts into perspective the artificiality of the present we are dangerously inching closer to. 2075 feels impersonal. Most adults around Iris’ town wear visors over their eyes, implying their bodies are there but their minds are elsewhere in a virtual setting. One sequence, as Arco, Iris, and the companions they pick up along the way break into her school, shows classrooms where holograms bring to life the past, including dinosaurs, but it’s all an illusion. And yet, Mikki’s fearless disposition to protect Iris at all costs seems to surpass what the robot was programmed to do. Even if that emotional connection is learned, it feels sincere.\n\n\tBienvenu takes children seriously, not only in that he explores their expectations and objections in their relationship to their parents and the rules they must follow, but because he doesn’t absolve them from the responsibility of their choices. Both kids in “Arco” learn that there are irrevocable consequences for putting themselves in danger. The price comes down to less time with loved ones that they can’t ever get back. The thematic maturity on display here or in the other Oscar-nominated French animated film, “Little Amélie or the Character of Rain,” is what most American studio films lacks. There’s no infantilizing of the intended young audience, but a conscious effort to address life’s difficult inflection points.\n\t\n\n\t“Arco” looks at once fantastical and recognizable, removed just enough from what we know in our present, but grounded on familiar, childlike amazement. Bienvenu refuses to dwell on the mechanics of the time travel technology, the holograms, or protective domes. One gets to understand Iris’ era as events come to pass.. And though it’s clear this is a cautionary tale, Bienvenu offers the notion of a brighter tomorrow as a possibility, just as much as dark destruction is. There’s no denying that the planet is in a crisis, but what if this could be an opportunity for a rebirth? That’s a refreshing outlook one wants to believe in.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Arco’ Review: Oscar-Nominated French Animation Tells an Environmentally Conscious Sci-Fi Story With Hope for the Future",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/ARCO.jpg?crop=0px%2C261px%2C2325px%2C1308px&resize=1000%2C563"
      ],
      "datePublished": "2026-02-06T03:33:23.000Z",
      "dateModified": "2026-02-06T03:33:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Fing!’ Review: Roald Dahl Meets E.T. in Jeffrey Walker’s Classical Tale of a Problem Child and Her Lovable Creature",
    "url": "https://variety.com/2026/film/reviews/fing-review-jeffrey-walker-taika-waititi-1236652643/",
    "image": "https://variety.com/wp-content/uploads/2026/02/fing.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-06T02:36:48.000Z",
    "description": "\n\tIn “Fing!,” Jeffrey Walker’s whimsical thing of wonder, Mr. and Mrs. Christopher and Maureen Meek (Blake Harrison and Mia Wasikowska) couldn’t have ",
    "body": "\n\tIn “Fing!,” Jeffrey Walker’s whimsical thing of wonder, Mr. and Mrs. Christopher and Maureen Meek (Blake Harrison and Mia Wasikowska) couldn’t have been more aptly christened with that quirky last name. Two geeky, modest and exceedingly mild-mannered librarians, they meet under the nose of their mean employer and fall for each other promptly. What follows is the pleasant life of harmony and books that they build together throughout a Pixar’s “Up”-style montage, with little, screaming Myrtle joining their loving home soon enough. Except, Myrtle rapidly proves to be anything but, well, meek…\n\t\n\n\tCo-written by Kevin Cecil and best-selling children’s book author David Walliams (the original creator of “Fing!,” who has faced recent harassment allegations), the story follows Myrtle (the terrific Iona Bell) as she continues to grow into the most disagreeable child. In fact, she’s like Dudley Dursley of the “Harry Potter” books in some ways, always bossing her parents around for more, and throwing an ear-splitting and window-shattering tantrum when she doesn’t get what she wants. Genuinely terrified of their daughter, the Meeks usually manage to find a way to grant her wishes to keep her calm, in what should be an urgent “how not to raise a child” lesson.\n\n\n\tWhile a lot of fantastical aspects of “Fing!” make it feel like a timeless children’s classic like a Roald Dahl tale, this parental angle feels acutely and refreshingly modern. In that, the Meeks seem to nurture Myrtle in a kind of 21st century, kid-centric parenting style when misbehaving isn’t necessarily addressed and children’s demands take center stage even when they are unreasonable. For a while, “Fing!” teases that it might engage with this often-memed query critically, but then drops it prematurely when Fing, a brown, single-eyed fur ball the size of a giant stuffy, enters the picture.\n\t\n\n\tAt first, Fing is just a thing that the lonely Myrtle demands as a present (the similarly accented sounds of fing and thing is a running joke in the film). This ask sends Mr. Meek on a long, arduous journey, leaving Maureen and Myrtle to their own devices. Miraculously, Mr. Meek manages to procure the beast, grabbing the envious attention of The Viscount (Taika Waititi as an irresistibly cuckoo villain), a ruthless and wealthy animal expert looking to advance his clout amongst other nature specialists with his own wildlife park. But even his lifelong governess Nanny (Penelope Wilton) would turn against him during his hot-tempered and greedy pursuit of exploiting the innocent Fing for personal gain. And no one could really stop him other than Myrtle and her new pal Tyler (Sidhant Anand), a gentle and caring neighbor whom Myrtle starts building a friendship with, despite Myrtle’s rude dismissal of him in the beginning.\n\n\tThe escapades of Fing, Myrtle, and Tyler quickly take an adventurous Spielbergian turn, where Fing doesn’t necessary demand to phone home, but craves the life that he belongs to instead of the one Myrtle can give him. Sporting a similar hair color and volatile temperament, the two quickly develop a connection not dissimilar to that of E.T. and Elliot, becoming inseparable in a near-spiritual way. Augmenting their kinship is the grit and grain of the world around them that production designer Matthew Putland dresses up with layers of gorgeously fantastical details (a little Wes Anderson, and a little “The Secret Garden”) with one foot firmly planted in the real world of dusty book shelves and cozy suburban homes. While the film looks needlessly dark at times, the feelings it inspires remain bright and feather-light. In Amelia Gebler’s picture-book costumes, the entire cast commit to this colorful universe of lovably weird touches.\n\n\tIf there is one overarching issue in “Fing!,” it is that Myrtle’s character arc, through which she goes from a certified spoiled brat to a responsible and reasonable kid, doesn’t entirely feel convincing. If all that Myrtle ever needed was a friend and companion who accepted her for who she was, wouldn’t her behavioral transformation have happened much sooner thanks to her angelic parents who never once reprimanded her rotten personality? But even when this question lingers in the background, “Fing!” is a spirited pleasure to experience, especially when it dials up its “E.T.” references around wholesome kids with unadulterated priorities vs. unsympathetic grown-ups who don’t understand them. It’s a tale to root for at any age.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Fing!’ Review: Roald Dahl Meets E.T. in Jeffrey Walker’s Classical Tale of a Problem Child and Her Lovable Creature",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/fing.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-06T02:36:48.000Z",
      "dateModified": "2026-02-06T02:36:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘The Incomer’ Review: Quaint and Heartwarming Scottish Isle Fable Earns Its Heartwarming Finale",
    "url": "https://variety.com/2026/film/reviews/the-incomer-review-louis-paxton-1236654104/",
    "image": "https://variety.com/wp-content/uploads/2026/02/Incomer.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-06T03:07:23.000Z",
    "description": "\n\tWhen they aren’t serving as a majestic backdrop to searing accounts of personal recovery (like “The Outrun”) or horror-thrillers like a page-turning",
    "body": "\n\tWhen they aren’t serving as a majestic backdrop to searing accounts of personal recovery (like “The Outrun”) or horror-thrillers like a page-turning Alice Feeney novel, remote isles tend to play host to quirky comedies these days in the style of debuting feature director Louis Paxton’s “The Incomer,” a big-hearted tale about a pair of lonesome siblings in urgent need of de-wilding.\n\n\tWe’ve seen recent dramedies in visually similar waters before like the Oscar-nominated splendor “The Banshees of Inisherin” and the lovely “The Ballad of Wallis Island,” two outings a lot more successful in both their dramatic touches and comedic flourishes. Still, something about “The Incomer” manages to captivate souls as it unfolds, thanks in large part to Gayle Rankin and her magnificently layered portrayal of Isla as one of the siblings stuck in a breathtaking yet remote Scottish isle, co-inhabited by no one other than the area’s wildlife: some very Hitchcockian birds in particular.\n\t\n\n\tIsla and her brother and Sandy (a winsome Grant O’Rourke) have been stuck on the said island for over 30 years, after their parents passed away. Or perhaps stuck isn’t exactly the right word — rather, they have stayed by choice as they’ve been led to believe (from what we understand, their abusive father) that the mainland is a dangerous, unhappy, and unpleasant place, and they have everything they need on their own island. Truth be told, the siblings don’t quite look or act as rough as they should for a duo who hasn’t had any meaningful human contact in over three decades. In fact, their slightly-weathered wardrobe pieces consisting of some truly cozy Fair Isle sweaters and tweed garments wouldn’t be out of place at your average hipster coffee shop. But because Paxton has to telegraph their unfit-to-society nature in some way, odd rituals do what the costumes don’t. In that, we get to watch Sandy and Isla in outrageous bird costumes practicing some who-knows-what ceremonies. And since “The Incomer” is essentially a fable enlaced by local legends, we also get a little taste of an eerie man-seal who visits Isla from time to time, trying to scare her off from both the water (Isla can’t swim), and the idea of a life elsewhere.\n\t\n\n\tWhile this fable-esque story thread doesn’t make for an enticing intro to the windswept and otherwise gorgeous world of “The Incomer,” Paxton thankfully finds his sea legs soon enough, introducing us to Daniel (an ever-soulful Domhnall Gleeson). He is a government employee trapped in a dead-end job, with a mean, paper-pusher of a boss with all the wrong priorities. In reality, Daniel’s sad life makes for a convincing case that the siblings are better off where they are. Still, Daniel doesn’t have a choice but to travel to the isle to retrieve Isla and Sandy. As far as the government is concerned, they have been living there illegally and they must be brought back to the mainland. Except, this isn’t the first time that the duo have successfully gotten rid of an incomer; and why should Daniel be any more difficult to outsmart?\n\n\tIt’s rather predictable that Daniel, Isla, and Sandy would soon form deep bonds, with Daniel questioning the integrity of the work he’s taken on. But for a movie that starts off rather clumsily, what’s surprising is the wonderful rhythm that Paxton settles into gradually, making the company of the trio a true pleasure to witness. Sometimes, the humor is exceedingly twee, but we don’t mind it in the hands of such an endearing bunch. Plus, there are number of genuine laugh-out-loud moments, such as when Sandy, after tasting a banana for the first time, offers a loud review of the fruit: “My mouth is alive!” Paxton also sensitively (albeit, somewhat bashfully) approaches Isla and Sandy’s emotional needs when both siblings grow feelings towards the charming Daniel, trying to one up each other to woo him. How could they not, when he is not only charismatic, and but also appears to be an excellent storyteller? (Daniel pretending to be the writer of “The Lord of the Rings,” or some version of it, is a pretty great running joke in the film.)\n\n\tIn the end, “The Incomer” is less about whether Isla and Sandy would make a life for themselves on the mainland, and more about the importance of family, friendship, and building a sense of community. It is also a generous, even timely reminder that the bodies of government have but one purpose: to serve the citizens they have been elected to uplift. After a comedic run-in with the mainland’s bureaucracy (and a new, villain-esque incomer with hilarious survival tactics), Isla and Sandy are granted an openhandedly satisfying ending. It’s perhaps a too perfect and comfortable one when weighed from the perspective of our real world. But don’t we sometimes come to movies to escape the ugly stuff? On those terms alone, “The Incomer” is something heartwarmingly beautiful.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘The Incomer’ Review: Quaint and Heartwarming Scottish Isle Fable Earns Its Heartwarming Finale",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/Incomer.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-06T03:07:23.000Z",
      "dateModified": "2026-02-06T03:07:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "California Post Alliance Seeks Standalone Tax Incentive to Stop Post-Production Downturn",
    "url": "https://variety.com/2026/artisans/news/california-post-alliance-tax-incentive-post-production-downturn-1236653587/",
    "image": "https://variety.com/wp-content/uploads/2026/02/CAPA_Blue.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-06T01:31:06.000Z",
    "description": "\n\tCiting a disastrous downturn in jobs and income, Hollywood post-production workers have formed a coalition, the California Post Alliance (CAPA), to ",
    "body": "\n\tCiting a disastrous downturn in jobs and income, Hollywood post-production workers have formed a coalition, the California Post Alliance (CAPA), to promote greater tax incentives in the California legislature.\n\n\tAt a kickoff rally attended by more than 200 at Burbank’s Evergreen recording studios Wednesday night, CAPA officials announced that California Assemblyman Nick Schultz would soon introduce legislation in the State Assembly for a standalone post-production tax credit to help lure the work back to L.A.\n\t\n\n\tIn a statement to Variety Thursday morning, Schultz said: “Post production is an important part of our state’s creative arts economy. Proposing new legislation that focuses on post production builds on the work that we started last year expanding the film and television tax credit program.\n\n\n\t“We are competing with other states and foreign countries for post production jobs, which is causing unprecedented threats to our workforce and to future generations of entertainment industry workers. In my district, we have seen many jobs leave and post production operations significantly scale back operations in the last decade.\n\n\t“This legislation will aim to provide incentives for VFX, editing, scoring, and more to preserve its infrastructure in California and provide a level-playing field for professionals in the entertainment industry. \n\n\t“Last year, I was one of the co-authors to AB 1138, which was just the first step to keep the entertainment industry strong and thriving in California. This new legislation will ensure that California remains the global hub of film and television jobs.”\n\t\n\n\tCAPA officials cited statistics showing that more than 4,400 jobs in post have been lost over the past 15 years, costing the state more than $500 million in income and, counting the ripple effects to other businesses, a loss to the state economy of more than $1.6 billion.\n\n\t“Post production is leaving California,” economist Adam Fowler said, and “the window is narrowing” to retrieve the work. The goal, CAPA president Marielle Abaunza said, is to “reclaim and retain the work we have lost.”\n\n\tEspecially hurt during the past decades has been the music recording business, veteran music contractor Peter Rotter said, with a growing number of film and TV scores — once routinely recorded in L.A. — going abroad to London, Vienna and Eastern Europe. “This is killing our community. The whole ecosystem is bleeding out; we are on life support,” he said.\n\n\tAmerican Federation of Musicians Local 47 membership has declined by 37 percent since 2008, in “a dramatic and accelerating geographic shift away from Los Angeles,” according to one especially startling slide screened during the presentation.\n\n\tOfficials cited attractive tax credits in New York, New Jersey, Georgia, Pennsylvania and other states as key reasons for a production exodus, and surprisingly generous incentives overseas (the U.K., Ireland, Canada, Australia) for post-production services including editing, scoring, visual effects, sound mixing and other crafts.\n\n\tPost-production expenses can currently qualify if production happens in California, but there are no incentives for post-production alone, which has resulted in job erosion and a talent drain as professionals move to other states to seek work.\n\n\tFourth-quarter 2025 numbers showed that production spending in California was down 22 percent but that New York production spending was up 23 percent. An estimated 1,800 post-production jobs have been lost in California, “work that moved to other states with more competitive incentives,” Fowler reported.\n\n\t“CAPA is about keeping jobs and the need to level the playing field,” Oscar-winning sound editor Karen Baker Landers said.\n\n\t“We have forfeited hundreds of millions of dollars because California has not invested in our industry,” added post-production accountant Jennifer Freed. “Without a competitive post incentive, we are removed from contention and we risk becoming a footnote in Hollywood history.”\n\t\n\n\tThe new organization has enlisted former state Assemblyman Alberto Torrico as a lobbyist for the cause, and Wednesday night launched a fundraising campaign with a $500,000 goal to support the effort.\n\n\t“We’re not looking for charity, we’re looking for parity,” said CAPA board member Ben Urquhart.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "California Post Alliance Seeks Standalone Tax Incentive to Stop Post-Production Downturn",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/CAPA_Blue.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-02-06T01:31:06.000Z",
      "dateModified": "2026-02-06T01:31:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Charles C. Stevenson, Jr., Who Played Smitty the Bartender on ‘Will and Grace,’ Dies at 95",
    "url": "https://variety.com/2026/tv/news/charles-c-stevenson-jr-dead-will-and-grace-1236653917/",
    "image": "https://variety.com/wp-content/uploads/2026/02/NUP_179298_3976_1-1-copy-e1770342712912.jpg?crop=26px%2C42px%2C1297px%2C730px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-02-06T01:56:15.000Z",
    "description": "\n\tCharles C. Stevenson, Jr., an actor known for roles in “Will and Grace,” “Dr. House,” “Ghost World” and more, died on Jan. 19 in Camarillo, Calif. o",
    "body": "\n\tCharles C. Stevenson, Jr., an actor known for roles in “Will and Grace,” “Dr. House,” “Ghost World” and more, died on Jan. 19 in Camarillo, Calif. of natural causes. He was 95 years old.\n\n\tOver his decades-long career, Stevenson became known for his supporting appearances in a range of films and television shows. The actor was perhaps best known for his role as Smitty the barman on the 1998 sitcom “Will and Grace,” which he appeared on until the show’s final season at the age of 89.  He landed his first substantial role at the age of 76, playing a sheriff in the Disney film “Snow Buddies.” \n\t\n\n\tStevenson also specialized in playing roles as a preacher, priest or pastor; “In his own words, his job was ‘marrying or burying people,’” his son, Scott, said in a statement. “As he told it, the panic-stricken director would invariably come to him to beg him to find a way to fill in unscripted space between ‘We are gathered here together’ (where he’d probably get his close-up) and the ‘amen’ at the end of the scene (where he usually wouldn’t). Stevenson admitted that he got pretty good at that.” Over the years, he also had roles in projects including “Murder, She Wrote,” “Men in Black,” “Glee,” “Bunheads” and more. \n\n\n\tStevenson grew up in Piedmont, Calif. Before the acting bug bit at age 50, he earned an English degree from UC Berkeley after having served in the Navy during the Korean War. Following graduation, he began working in fundraising, chapter development and public awareness drives for causes such as Project Hope and the Epilepsy Foundation. He moved to Los Angeles in the 1960s, working on public service announcements and community events with Hollywood figures including James Stewart, Jack Lemmon and Henry Winkler. \n\t\n\n\tStevenson is survived by two children, Charles III and Valerie, from his marriage to Barbara Keller, and by three, Catherine, Scott and William, from his second marriage to the late Hollywood agent and manager, Joy Stevenson. He is also survived by eight grandchildren and six great-grandchildren.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Charles C. Stevenson, Jr., Who Played Smitty the Bartender on ‘Will and Grace,’ Dies at 95",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/NUP_179298_3976_1-1-copy-e1770342712912.jpg?crop=26px%2C42px%2C1297px%2C730px&resize=1000%2C563"
      ],
      "datePublished": "2026-02-06T01:56:15.000Z",
      "dateModified": "2026-02-06T01:56:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Baldur’s Gate’ HBO Series in the Works From ‘The Last of Us’ Co-Creator Craig Mazin",
    "url": "https://variety.com/2026/tv/news/baldurs-gate-hbo-craig-mazin-1236654094/",
    "image": "https://variety.com/wp-content/uploads/2026/02/baldurs-gate.jpg?crop=0px%2C6px%2C1500px%2C844px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-02-06T00:19:35.000Z",
    "description": "\n\tHBO is developing a TV adaptation of Hasbro’s fantasy role-playing video game series “Baldur’s Gate.”\n\n\tCraig Mazin, the co-creator and showrunner o",
    "body": "\n\tHBO is developing a TV adaptation of Hasbro’s fantasy role-playing video game series “Baldur’s Gate.”\n\n\tCraig Mazin, the co-creator and showrunner of HBO’s hit video game adaptation “The Last of Us,” will serve as showrunner and executive producer. Mazin is also the created of HBO’s 2019 limited series “Chernobyl.” Mazin also executive produces alongside Jacqueline Lesko, Cecil O’Connor and Hasbro Entertainment’s head of television Gabriel Marano.\n\t\n\n\tPart of the “Dungeons & Dragons” franchise, the first “Baldur’s Gate” game was released in 1998. Most recently, “Baldur’s Gate 3” debuted in 2023 and achieved significant critical and commercial success, becoming the first-ever title to win all five major Game of the Year awards and crossing 15 million players. \n\n\n\t“After putting nearly 1000 hours into the incredible world of ‘Baldur’s Gate 3,’ it is a dream come true to be able to continue the story that Larian and Wizards of The Coast created,” Mazin said in a statement. “I am a devoted fan of ‘D&D’ and the brilliant way that Swen Vincke and his gifted team adapted it.  I can’t wait to help bring ‘Baldur’s Gate’ and all of its incredible characters to life with as much respect and love as we can, and I’m deeply grateful to Gabe Marano and his team at Hasbro for entrusting me with this incredibly important property.”\n\n\t“We’re thrilled to continue our partnership with Craig Mazin on ‘Baldur’s Gate,'” said Francesca Orsi, executive vice president and head of drama programming at HBO. “His deep and long-standing passion for the source material paired with his remarkable talent for building immersive worlds filled with rich, compelling characters promises groundbreaking results.”\n\t\n\n\t“The fans have been eagerly awaiting an adaptation of ‘Baldur’s Gate,’ and we could not ask for better partners than HBO and the incomparable Craig Mazin to build this world with,” said Marano.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Baldur’s Gate’ HBO Series in the Works From ‘The Last of Us’ Co-Creator Craig Mazin",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/baldurs-gate.jpg?crop=0px%2C6px%2C1500px%2C844px&resize=1000%2C563"
      ],
      "datePublished": "2026-02-06T00:19:35.000Z",
      "dateModified": "2026-02-06T00:19:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Jewelry Brand Worn by Emma Stone and Reese Witherspoon Unveils a 'Paperclip' Diamond Bracelet for Valentine's Day",
    "url": "https://variety.com/2026/shopping/fashion/vrai-diamond-tennis-bracelet-review-price-shop-online-1236654143/",
    "image": "https://variety.com/wp-content/uploads/2026/02/vrai-paperclip-bracelet.png?w=900&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-02-06T02:13:11.000Z",
    "description": "\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.\n\n\tLuxury je",
    "body": "\n\tIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.\n\n\tLuxury jewelry brand VRAI has long been a favorite among the Hollywood set, with its covet-worthy pieces worn by everyone from Emma Stone and Reese Witherspoon, to Jennifer Lopez, Hailey Bieber and Zoe Saldana. Gwen Stefani even wore a VRAI cross necklace on her wedding day to Blake Shelton. How’s that for high praise?\n\n\tNow, just in time for Valentine’s Day, the California-based brand is introducing a “Paperclip Tennis Bracelet,” that offers a contemporary twist on the classic diamond band. \n\n\n\t\t\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\t\t\n\n\t\t\t\t\t\t\t\t\t\tNEW RELEASE\t\t\t\t\t\t\n\n\t\t\t\t\tPaperclip Tennis Bracelet\t\t\n\n\t\n\t\tThe VRAI Paperclip Bracelet features a row of VRAI-created diamonds set in fine 14k yellow gold, with a paperclip-inspired chain link bracelet and clasp. The chain is fully adjustable to fit most wrist sizes, while the open paperclip design offers a fresh (and more wearable) take on a timeless design. \t\n\t\t\n\t\n\n\tThe VRAI bracelet still technically hits the hallmarks of a formal tennis bracelet — with individual diamonds seamlessly linked one after another on a chain — but the paperclip links make this an easy bracelet to pair with jeans and a T-shirt on more casual days too.\n\n\tVRAI creates their own diamonds in the USA from a zero-emission foundry. The brand says every diamond in this bracelet is individually polished and linked by hand.\n\n\t\t\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\t\t\n\n\t\t\t\t\t\t\t\t\t\tALSO AVAILABLE\t\t\t\t\t\t\n\n\t\t\t\t\tClassic Tennis Bracelet\t\t\n\n\t\n\t\tPrefer a classic tennis bracelet? VRAI has this model below, with elegant VRAI-created diamonds set on a 14k yellow gold or 14k white gold band. \t\n\t\t\n\t\n\n\tChoose from four diamond sizes — petite, medium, large or extra large — depending on your wrist size and style. The petite diamond setting will offer a more minimalist look while the extra large setting showcases each diamond in a charm-like style. Multiple chain lengths are available too.\n\n\tIt’s not just for women either; Joe Jonas was spotted wearing a VRAI tennis bracelet while performing recently at the Hollywood Bowl in Los Angeles.\n\n\tVRAI has other options available for Valentine’s Day and beyond. We like their “Toi et Moi” necklace (“You and Me” in French), which pairs two VRAI-created diamonds together to symbolize you and a partner, loved one or friend.\n\n\n\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\t\t\n\n\t\t\t\t\t\t\t\t\t\tTOP NECKLACE PICK\t\t\t\t\t\t\n\n\t\t\t\t\tToi et Moi Necklace\t\t\n\n\t\n\t\tThe two-stone design features a combination of either a round brilliant and pear diamond, or a pear and emerald cut VRAI-created diamond. The diamonds are set on a 14k yellow gold, 14k white gold, or 14k rose gold setting with matching chain.\t\n\t\t\n\t\n\n\tAnd you can surprise them with a pair of soulful and sophisticated earrings, crafted with round brilliant VRAI-created diamonds with a 14k solid yellow gold, white gold or rose gold setting. Choose from a 12mm or 18mm diameter depending on whether you want the earrings to hug the ear or dangle from below.\n\n\t\t\n\n\t\t\t\t\t\t\n\t\t\t\n\t\n\n\t\n\t\t\t\t\t\n\t\t\n\n\t\t\t\t\t\t\t\t\t\tTOP EARRING PICK\t\t\t\t\t\t\n\n\t\t\t\t\tEternity Hoop\t\t\n\n\t\n\t\tVRAI says the clasp closure on these earrings is “designed to draw in the light.” Get the matching pair for $600 (total); you can also purchase one hoop individually for $300 online here.\t\n\t\t\n\t\n\n\tVRAI’s sustainably-made diamonds don’t require mining or harsh industrial processes. Instead, the company’s Pacific Northwest-based foundry has developed a way to crystalize  greenhouse gas into rough diamonds, using zero-emission river energy. There’s zero carbon footprint and VRAI says their process requires ten times less energy than mining. Each piece is then hand-cut and hand-polished for for “maximal brilliance,” according to the site.\n\n\t“From staple solitaire necklaces and earrings, to opulent tennis jewelry [these are] gifts to show your love for one another – and the planet – for every level of connection,” VRAI says in a release. “Commemorate an eternity of love for yourself or for another with an updated design crafted to last a lifetime.”\n\n\tYou can see more celebrity-inspired picks and new jewelry options at VRAI.com.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Jewelry Brand Worn by Emma Stone and Reese Witherspoon Unveils a 'Paperclip' Diamond Bracelet for Valentine's Day",
      "image": [
        "https://variety.com/wp-content/uploads/2026/02/vrai-paperclip-bracelet.png?w=900&h=563&crop=1"
      ],
      "datePublished": "2026-02-06T02:13:11.000Z",
      "dateModified": "2026-02-06T02:13:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "TMZ Sports Streaming Live From Newsroom, Join The Conversation!",
    "url": "https://www.tmz.com/2026/02/05/tmz-sports-live-stream/",
    "image": "https://imagez.tmz.com/image/bf/16by9/2026/02/05/bf188ef6f293499aa847a652a306ec34_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-05T20:57:40.000Z",
    "description": "\n    \n                    \n                          TMZ Sports Live Stream\n                          Join The Conversation!!!\n                      \n",
    "body": "\n    \n                    \n                          TMZ Sports Live Stream\n                          Join The Conversation!!!\n                      \n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          TMZ Sports is going live from the newsroom to discuss the day's biggest stories ... but we don't just want folks to watch and enjoy the conversation, we want y'all to get involved!!\n      \n    \n          Hit the comment section as Babcock, Lucas, Dylan, Luca, and the whole crew break down the most important topics of the day ... and we'll be interacting with viewers throughout the program between 1 and 2:30 PM PT.\n      \n    \n          YouTube, X, TikTok ... we're everywhere.\n      \n    \n          So tune in, make fun of us, share your two cents, sound off about your favorite team ... nothing is out of bounds.\n      \n    \n          Thursday's show is all about our exclusive chat with Travis Kelce, the latest on Bad Bunny's Super Bowl Halftime Show, Lindsey Vonn's big update and so much more!!\n      \n      \n              \n          \n                          \n                TMZ Sports\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "TMZ Sports Streaming Live From Newsroom, Join The Conversation!",
      "image": [
        "https://imagez.tmz.com/image/bf/16by9/2026/02/05/bf188ef6f293499aa847a652a306ec34_xl.jpg"
      ],
      "datePublished": "2026-02-05T20:57:40.000Z",
      "dateModified": "2026-02-05T20:57:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Quentin Jiles Names Politicians He Thinks Would Lose on 'The Traitors'",
    "url": "https://www.tmz.com/2026/02/05/quentin-jiles-politicians-the-traitors/",
    "image": "https://imagez.tmz.com/image/c7/16by9/2026/02/05/c70a89b177074712b859d99d42af8b49_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-05T20:35:28.000Z",
    "description": "\n    \n                    \n                          Political Analyst Quentin Jiles\n                          These Politicians Would Be Banished on ",
    "body": "\n    \n                    \n                          Political Analyst Quentin Jiles\n                          These Politicians Would Be Banished on 'The Traitors' ASAP!!!\n                      \n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          Political commentator Quentin Jiles was a runner-up on \"The Traitors\" 3 years ago, so he knows what it takes to survive the roundtable ... and he told us the politicians he thinks would be immediately banished.\n      \n    \n          Watch the video ... Quentin stopped by \"TMZ Live\" to dish on who in D.C. gives off so much overtly traitorous energy, the other Faithfuls would banish them whether they were Traitors or not.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Quentin gave us 2 very notable names ... and one them, Quentin joked, catches a flight out of his state \"every time the wind blows,\" which would be an immediate red flag to the rest of the contestants.\n      \n\n          According to Quentin, a critical skill for doing well on \"The Traitors\" is gaining your castmates' trust ... which is an ability that Quentin says is extremely lacking with these 2 Washington power players.\n      \n    \n          But there was one person in particular -- a Supreme Court Justice -- whom Quentin thinks is just duplicitous enough to win the whole thing!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                TV\n              \n                          \n                Reality TV\n              \n                          \n                TMZ Live\n              \n                          \n                Politics\n              \n                          \n                Exclusive\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Quentin Jiles Names Politicians He Thinks Would Lose on 'The Traitors'",
      "image": [
        "https://imagez.tmz.com/image/c7/16by9/2026/02/05/c70a89b177074712b859d99d42af8b49_xl.jpg"
      ],
      "datePublished": "2026-02-05T20:35:28.000Z",
      "dateModified": "2026-02-05T20:35:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "BLACKPINK's Lisa Teams Up With 'White Lotus' EP Again for New Netflix Show",
    "url": "https://www.tmz.com/2026/02/05/blackpink-lisa-white-lotus-david-bernad-netflix/",
    "image": "https://imagez.tmz.com/image/21/16by9/2026/02/05/21b037f6fd2f4260bd0c75f4a16fa29f_xl.png",
    "tag": "Entertainment",
    "date": "2026-02-05T20:17:20.000Z",
    "description": "\n    \n                    \n                          BLACKPINK's Lisa\n                          K-Poppin' Over to Netflix for a Rom-Com!!!\n           ",
    "body": "\n    \n                    \n                          BLACKPINK's Lisa\n                          K-Poppin' Over to Netflix for a Rom-Com!!!\n                      \n                  \n                                                                        Published \n                              \n                February 5, 2026\n                \n                            12:17 PM PST\n                                                                      |\n                                                                Updated \n                                  February 5, 2026\n                                3:16 PM PST\n                                    \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          BLACKPINK’s Lisa is on an absolute roll -- fresh off turning heads in \"The White Lotus\" -- and she’s already lining up her next big move ... a Netflix rom-com!\n      \n    \n          Yep, the Thai superstar is fully in her acting era ... after bonding on the 'TWL' set with EP David Bernad over their shared love of the rom-com classic \"Notting Hill,\" the two reportedly teamed up to cook up the premise for this brand-new streaming project.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Deadline broke the news, noting the logline’s still under lock and key ... but the creative muscle is no joke. Comedy heavyweight Katie Silberman -- the writer behind \"Booksmart\" and \"Set It Up\" -- is penning the script.\n      \n\n          Not bad for someone who only made her acting debut last year ... Lisa’s already cruising into top-tier territory.\n      \n    \n      \n        \n              \n    \n    \n          Lisa’s not slowing down anytime soon either ... she’s also set to appear in \"Tygo,\" a spin-off tied to the \"Extraction\" universe. Bottom line? K-pop isn’t just crossing over -- it’s taking over!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                LISA\n              \n                          \n                TV\n              \n                          \n                Netflix\n              \n                          \n                Music\n              \n                          \n                K-Pop\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "BLACKPINK's Lisa Teams Up With 'White Lotus' EP Again for New Netflix Show",
      "image": [
        "https://imagez.tmz.com/image/21/16by9/2026/02/05/21b037f6fd2f4260bd0c75f4a16fa29f_xl.png"
      ],
      "datePublished": "2026-02-05T20:17:20.000Z",
      "dateModified": "2026-02-05T20:17:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kim Zolciak, Kroy Biermann Sign Temporary Custody Agreement Amid Divorce",
    "url": "https://www.tmz.com/2026/02/05/kim-zolciak-kroy-bierman-temporary-custody-agreement/",
    "image": "https://imagez.tmz.com/image/17/16by9/2026/02/05/170eb6f4a3c2423a8f2b77ae9c803be2_xl.png",
    "tag": "Entertainment",
    "date": "2026-02-05T21:10:47.000Z",
    "description": "\n    \n                    \n                          Kim Zolciak, Kroy Bierman\n                          Hammer Out Temporary Child Custody Agreement\n",
    "body": "\n    \n                    \n                          Kim Zolciak, Kroy Bierman\n                          Hammer Out Temporary Child Custody Agreement\n                      \n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          Progress in the nasty divorce involving Kim Zolciak and Kroy Biermann ... it appears they've hammered out a child custody agreement ... but it's only temporary.\n      \n    \n          The estranged couple sat down for a mediation session Tuesday last week, according to new legal docs obtained by TMZ ... which resulted in a temporary custody agreement signed by Kim and Kroy.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          It's unclear what the custody agreement entails ... all the docs say is they signed a deal.\n      \n\n          Kim and Kroy have four minor children ... sons KJ, Kash and Kane, plus daughter Kaia.\n      \n    \n          The ugly divorce has been dragging on for over 2 years now ... but this appears to indicate some signs of progress. At one point last year, Kroy had even pushed for primary custody of all four kids.\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          We reached out to Kim's reps and Kroy's camp ... so far no word back.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Kim Zolciak\n              \n                          \n                Kroy Biermann\n              \n                          \n                Relationships\n              \n                          \n                Real Housewives\n              \n                          \n                Celebrity Divorce\n              \n                          \n                Exclusive\n              \n                          \n                Fairly Legal\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kim Zolciak, Kroy Biermann Sign Temporary Custody Agreement Amid Divorce",
      "image": [
        "https://imagez.tmz.com/image/17/16by9/2026/02/05/170eb6f4a3c2423a8f2b77ae9c803be2_xl.png"
      ],
      "datePublished": "2026-02-05T21:10:47.000Z",
      "dateModified": "2026-02-05T21:10:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cancer Survivor Dave Coulier Stresses Early Detection Is Everything",
    "url": "https://www.tmz.com/2026/02/05/dave-coulier-cancer-early-detection/",
    "image": "https://imagez.tmz.com/image/ad/16by9/2026/02/05/ad5ba3813df84f5587c45ad98cbaba69_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-02-05T22:42:16.000Z",
    "description": "\n    \n                    \n                          Dave Coulier\n                          Early Detection Saved My Life ... Get Checked!!!\n         ",
    "body": "\n    \n                    \n                          Dave Coulier\n                          Early Detection Saved My Life ... Get Checked!!!\n                      \n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          Dave Coulier -- who played Uncle Joey on \"Full House\" -- is a 2-time cancer survivor ... and he told us the key to his success in fighting the monstrous disease.\n      \n    \n          When we caught him out in NYC today, Dave told us ... \"Early detection is everything, so talk to your doctors. Get those PET scans, get those MRIs, get those CT scans, because it can save your life. I'm living proof of that.\"\n      \n    \n                  \n          \n                          \n                \n                  \n      \n    \n          So if you've been putting off a doctor's appointment ... Cut. It. Out!\n      \n\n          The 66-year-old actor is now in remission from tongue cancer ... after finishing treatment for Stage 3 non-Hodgkin lymphoma in 2025.\n      \n    \n          While the journey was rough, Dave credited his sense of humor and fellow \"Full House\" alum, John Stamos with helping him get through his toughest days while on the road to recovery.\n      \n    \n          Watch the video to find out what Dave says is next for him after becoming cancer-free.\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Dave Coulier\n              \n                          \n                John Stamos\n              \n                          \n                Full House\n              \n                          \n                TV\n              \n                          \n                Exclusive\n              \n                          \n                Health\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cancer Survivor Dave Coulier Stresses Early Detection Is Everything",
      "image": [
        "https://imagez.tmz.com/image/ad/16by9/2026/02/05/ad5ba3813df84f5587c45ad98cbaba69_xl.jpg"
      ],
      "datePublished": "2026-02-05T22:42:16.000Z",
      "dateModified": "2026-02-05T22:42:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]