[
  {
    "title": "‘A Minecraft Movie,’ ‘Bridget Jones: Mad About The Boy’ Lead U.K., Ireland Box Office to $1.45 Billion in 2025, Best Post-Pandemic Result Yet",
    "url": "https://variety.com/2026/film/box-office/a-minecraft-movie-2025-uk-ireland-box-office-1-45-billion-1236624893/",
    "image": "https://variety.com/wp-content/uploads/2025/05/MCDMIMO_WB048.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-07T07:24:08.000Z",
    "description": "\n\tThe U.K. and Ireland theatrical market generated £1.07 billion ($1.45 billion) in 2025, marking a 1% increase over 2024 and representing the stronge",
    "body": "\n\tThe U.K. and Ireland theatrical market generated £1.07 billion ($1.45 billion) in 2025, marking a 1% increase over 2024 and representing the strongest box office performance since the pandemic, according to data from Comscore Movies.\n\n\tWarner Bros.’ “A Minecraft Movie” topped the annual chart with $76.9 million, followed by Universal’s “Bridget Jones: Mad About The Boy” at $62.7 million. Universal’s “Wicked: For Good,” still in release, placed third with $62 million.\n\t\n\n\tWhile the figure remains 21% below 2019’s pre-pandemic levels, when annual box office regularly exceeded $1.76 billion, 2025 marked the third consecutive post-pandemic year to surpass $1.43 billion. The result positions the territory favorably compared to many European markets.\n\n\n\tThe year saw a record 224 saturation releases playing in 250-plus cinemas, up from 200 in 2024, as the industry fully recovered from production delays caused by COVID-19 and the Hollywood strikes. Universal’s “Downton Abbey: The Grand Finale” led with an opening in over 750 cinemas in September.\n\n\tUniversal claimed the top distributor spot for the first time since 2021, achieving a 25.1% market share and $363.5 million in total gross from 35 new releases. Disney ranked second with 23.1% market share and $333.8 million, while Warner Bros. placed third with 18.5% share and $266.2 million.\n\n\tThe territory added 11 new and refurbished cinemas comprising over 80 screens during the year, including three Vue sites and two each from Odeon and Everyman.\n\n\tEvent cinema remained robust with ten releases surpassing $1.3 million, generating the second-highest annual total of $59.4 million, behind only 2019. “Six The Musical” became the highest-grossing theater title ever at $8.3 million, behind only “Taylor Swift: The Eras Tour” in overall event cinema history.\n\t\n\n\tBritish and Irish productions contributed $272.7 million, accounting for 19% of total box office. “Bridget Jones: Mad About The Boy” led local productions, followed by Universal’s “Downton Abbey: The Grand Finale” at $24.8 million and Sony’s “28 Years Later” at $21 million.\n\n\tThe top 10 films accounted for 33% of total revenue, demonstrating improved market diversity compared to 38.6% in 2024 and marking the best diversity since 2017.\n\n\t“Although it saw only a small year-on-year increase in box office, 2025 undoubtedly marked a significant further step in the sector’s recovery following the challenges of recent years,” said Phil Clapp, chief executive of the U.K. Cinema Association.\n\n\tAndy Leyshon, chief executive of the Film Distributors’ Association, added: “It was good to see a box office increase in 2025, and having now witnessed a healthy level of theatrical stability over the last three years it is evident that the unique visual pleasure of a visit to the cinema remains the leading out-of-home entertainment choice for audiences.”\n\n\tTop 10 Films in U.K. & Ireland in 2025:\n\n\n“A Minecraft Movie” (Warner Bros.) — £56.8 million ($76.9 million)\n“Bridget Jones: Mad About The Boy” (Universal) — £46.3 million ($62.7 million)\n“Wicked: For Good” (Universal) — £45.8 million ($62 million)\n“Lilo & Stitch” (Disney) — £37.3 million ($50.4 million)\n“Jurassic World Rebirth” (Universal) — £36.1 million ($48.7 million)\n“Superman” (Warner Bros.) — £28.1 million ($37.9 million)\n“Avatar: Fire And Ash” (Disney) — £27.1 million ($36.7 million)\n“Mission: Impossible – The Final Reckoning” (Paramount) — £26.3 million ($35.6 million)\n“Zootopia 2” (Disney) — £25.4 million ($34.3 million)\n“The Fantastic Four: First Steps” (Disney) — £23.9 million ($32.3 million)\n\n\n\n\tTop 10 British/Irish Films in U.K. & Ireland in 2025:\n\n\n“Bridget Jones: Mad About The Boy” (Universal) — £46.3 million ($62.7 million)\n“Downton Abbey: The Grand Finale” (Universal) — £18.3 million ($24.8 million)\n“28 Years Later” (Sony) — £15.5 million ($21.07 million)\n“The Roses” (Disney) — £10.3 million ($13.9 million)\n“We Live In Time” (Studiocanal) — £8.7 million ($11.8 million)\n“The Salt Path” (Black Bear) — £8.1 million ($10.9 million)\n“Six The Musical” (Universal) — £6.1 million ($8.3 million)\n“I Swear” (Studiocanal) — £6.09 million ($8.2 million)\n“The Choral” (Sony) — £4.1 million ($5.5 million)\n“Better Man” (Entertainment) — £4.04 million ($5.4 million)\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘A Minecraft Movie,’ ‘Bridget Jones: Mad About The Boy’ Lead U.K., Ireland Box Office to $1.45 Billion in 2025, Best Post-Pandemic Result Yet",
      "image": [
        "https://variety.com/wp-content/uploads/2025/05/MCDMIMO_WB048.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-07T07:24:08.000Z",
      "dateModified": "2026-01-07T07:24:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sarah Jessica Parker on More ‘Sex and the City,’ ‘Hocus Pocus 3’ and Calls ‘The Family Stone’ Sequel a ‘Bittersweet Quandary’ Following Diane Keaton’s Death",
    "url": "https://variety.com/2026/scene/columns/sarah-jessica-parker-sex-and-the-city-hocus-pocus-3-family-stone-sequel-diane-keaton-1236624876/",
    "image": "https://variety.com/wp-content/uploads/2026/01/GettyImages-2254417292.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-07T05:38:18.000Z",
    "description": "\n\tSarah Jessica Parker isn’t saying no to anymore “Sex and the City,” but it doesn’t sound like she’ll be reprising Carrie Bradshaw anytime soon.\n\n\tSJ",
    "body": "\n\tSarah Jessica Parker isn’t saying no to anymore “Sex and the City,” but it doesn’t sound like she’ll be reprising Carrie Bradshaw anytime soon.\n\n\tSJP told me Tuesday at the Golden Eve gala in Beverly Hills that she’s up for reprising her beloved fashion-obsessed character, but it all depends on one person and one person only – “Sex and the City” creator Michael Patrick King.\n\n\n\t“I hear lots of very original ideas, all lovely and well intentioned and often very clever, but the only thing that really matters is what excites Michael Patrick King. And right now he’s just not thinking about that,” Parker said.\n\t\n\n\n\tParker made a rare appearance on the West Coast to be honored at the starry Golden Eve dinner and awards ceremony with the Carol Burnett Award. She hit the carpet with husband Matthew Broderick and their actor son James Wilkie Broderick before reuniting with “Sex and the City” costars Kristen Davis, Evan Handler and David Eigenberg.\n\n\n\tParker also offered an update on the much-anticipated third installment of the “Hocus Pocus” franchise. “They’re working on it,” Parker said. “Where Better [Midler] goes, I go. Bette is like a 13-year-old girl with a new bike. She’s like, ‘I have wheels, let us travel.’”\n\n\n\tAnd then there’s the ongoing efforts to make a sequel to “The Family Stone,” which co-starred the late Diane Keaton.\n\n\t“I’m so excited…but it’s a rather bittersweet quandary given the loss of Diane Keaton,” Parker said. “But it was a very special group of actors, and prior to Diane’s passing, there had been conversations with everybody, so I hope that we’ll be able to. The hardest thing is everybody’s schedules.”\n\t\n\n\n\tGolden Eve also presented the Cecil B. DeMille Award to Helen Mirren.\n\n\tThe evening was filmed for a primetime special airing Thursday, Jan. 8 at 8 p.m. ET/PT on CBS and streaming on Paramount+ in the U.S. The 83rd Golden Globes will air on Jan. 11 at 5 p.m. PT/8 p.m. PT on CBS and stream on Paramount+ in the U.S.\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sarah Jessica Parker on More ‘Sex and the City,’ ‘Hocus Pocus 3’ and Calls ‘The Family Stone’ Sequel a ‘Bittersweet Quandary’ Following Diane Keaton’s Death",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/GettyImages-2254417292.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-07T05:38:18.000Z",
      "dateModified": "2026-01-07T05:38:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Gwyneth Paltrow Says She Was ‘Fired’ From a Movie After Divorce With Chris Martin: Distributor Thought She Was ‘Too Hot to Touch’",
    "url": "https://variety.com/2026/film/news/gwyneth-paltrow-fired-film-divorce-chris-martin-1236624847/",
    "image": "https://variety.com/wp-content/uploads/2025/10/P102FN2H.jpg?crop=0px%2C33px%2C2000px%2C1125px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-01-07T02:54:17.000Z",
    "description": "\n\tGwyneth Paltrow recently told Amy Poehler on her “Good Hang” podcast that she was “fired off” a film shortly after her divorce from Coldplay lead si",
    "body": "\n\tGwyneth Paltrow recently told Amy Poehler on her “Good Hang” podcast that she was “fired off” a film shortly after her divorce from Coldplay lead singer Chris Martin. The “Marty Supreme” star speculated that the distributor thought she was “too hot to touch” at the time of the widely covered split.\n\n\t“I was supposed to do a movie at one point, and it was like right after the conscious uncoupling thing with Chris, and there was a lot of harsh stuff in the press,” Paltrow recalled. “I think the distributor was like, ‘This might be too hot to touch.’”\n\t\n\n\tShe added, “So that was great because I was getting a divorce and then I got fired off. So it was so awesome.”\n\n\n\tIn 2014, Paltrow unveiled in a lengthy blog post that she and Martin decided to “consciously uncouple.” The phrase went viral at the time, with some thinking it was a pretentious way to describe a sometimes traumatic experience. Paltrow said she now understands why there was such a fixation on her divorce announcement.\n\n\t“Say you had had a really nasty divorce, or your parents had had a really nasty divorce,” Paltrow said. “And then you hear this idea that like, it doesn’t have to be done this way. I think the implicit learning is like, ‘Oh, fuck. Like, they’re saying I did something wrong.’”\n\n\tShe continued, “That makes sense to me, like, ‘Oh no, is the inference that I mess someone up.’ Like, that’s not a nice thing to contemplate. So I do understand why it was so personal for people.”\n\n\tPaltrow was on “Good Hang” to promote her new film “Marty Supreme.” From A24, Paltrow stars in the sports drama alongside Timothée Chalamet, Odessa A’zion and Kevin O’Leary. The Oscar winner said of the film, “I don’t know if people will like it or not, but it’s a real swing and everyone’s great at their job. And so I was like, ‘Wow, I think I miss this, you know?’”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Gwyneth Paltrow Says She Was ‘Fired’ From a Movie After Divorce With Chris Martin: Distributor Thought She Was ‘Too Hot to Touch’",
      "image": [
        "https://variety.com/wp-content/uploads/2025/10/P102FN2H.jpg?crop=0px%2C33px%2C2000px%2C1125px&resize=1000%2C563"
      ],
      "datePublished": "2026-01-07T02:54:17.000Z",
      "dateModified": "2026-01-07T02:54:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nivin Pauly Signs Multi-Film Deal With India’s Panorama Studios (EXCLUSIVE)",
    "url": "https://variety.com/2026/film/news/nivin-pauly-multifilm-deal-panorama-studios-1236624493/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Nivin-Pauly-Kumar-Mangat-Pathak.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-07T05:00:00.000Z",
    "description": "\n\tIndia’s Panorama Studios has inked a landmark partnership with Malayalam cinema star Nivin Pauly to produce a slate of Malayalam-language features w",
    "body": "\n\tIndia’s Panorama Studios has inked a landmark partnership with Malayalam cinema star Nivin Pauly to produce a slate of Malayalam-language features with a cumulative budget of INR100 crore ($11.1 million), marking one of the largest deals in Malayalam cinema history.\n\n\tThe multi-film collaboration will see Kumar Mangat Pathak and Abhishek Pathak producing for Panorama Studios alongside Pauly, who will serve as both actor and producer. The slate will span multiple genres aimed at Indian and international audiences.\n\t\n\n\tPanorama Studios has built a track record producing commercially successful Hindi-language films including the “Drishyam,” “Pyaar Ka Punchnama,” and “Raid” franchises, and “Shaitaan.” The company launched with Vishal Bhardwaj’s “Omkara” and has accumulated over 50 industry awards. The studio currently has “Drishyam 3” in development.\n\n\n\tPauly ranks among Malayalam cinema’s most bankable stars, known for selecting commercially viable projects across genres. The actor rose to stardom with romantic drama “Thattathin Marayathu” in 2012, followed by breakthrough performances in “Bangalore Days” and “1983” in 2014. His 2015 coming-of-age romantic drama “Premam” became one of the highest-grossing Malayalam films of all time. Other notable credits include police drama “Action Hero Biju,” which he also produced under his banner Pauly Jr. Pictures, epic film “Kayamkulam Kochunni” and political satire “Sakhavu.”\n\n\tThe actor is currently riding high on the success of supernatural comedy “Sarvam Maya,” which released Dec. 25 and has grossed over INR100 crore worldwide, marking his first film to cross that milestone. Critics have praised the film as a commercial comeback following a series of underperforming releases.\n\t\n\n\tPauly has won two Kerala State Film Awards, three Filmfare Awards South, two Kerala Film Critics Association Awards and six SIIMA Awards.\n\n\tThe partnership represents Panorama Studios’ expansion into Malayalam-language production, positioning the company to capitalize on the growing market for South Indian cinema both nationally and internationally.\n\n\t“Malayalam cinema has consistently set benchmarks for storytelling and performance-driven films,” said Kumar Mangat Pathak, chair of Panorama Studios. “Partnering with Nivin Pauly, who represents credibility, talent, and mass connect, is a natural progression for Panorama Studios. This collaboration is our way of investing in meaningful cinema at scale and building long-term creative partnerships in the South.”\n\n\tPauly added: “This collaboration with Panorama Studios is extremely exciting for me, both as an actor and as a producer. Their vision, scale, and commitment to quality cinema align perfectly with the kind of stories I want to be part of. Together, we aim to create films that are rooted, entertaining, and impactful.”\n\n\tThe teaming arrives as Malayalam cinema continues expanding its footprint beyond Kerala, with recent films finding success in Hindi-dubbed versions and theatrical releases across India. The partnership aims to leverage Panorama’s distribution network and production expertise with Pauly’s star power and script selection abilities.\n\n\tDetails on individual projects within the slate, including directors, writers and release schedules, were not disclosed.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nivin Pauly Signs Multi-Film Deal With India’s Panorama Studios (EXCLUSIVE)",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Nivin-Pauly-Kumar-Mangat-Pathak.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-07T05:00:00.000Z",
      "dateModified": "2026-01-07T05:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "David Harbour Exits Tony Gilroy’s Searchlight Drama ‘Behemoth!’",
    "url": "https://variety.com/2026/film/news/david-harbour-exits-behemoth-tony-gilroy-searchlight-1236624860/",
    "image": "https://variety.com/wp-content/uploads/2026/01/GettyImages-2212504898.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-07T04:05:13.000Z",
    "description": "\n\tDavid Harbour has dropped out of “Behemoth!,” an upcoming drama film from “Michael Clayton” director Tony Gilroy and Searchlight Pictures. \n\n\tA repr",
    "body": "\n\tDavid Harbour has dropped out of “Behemoth!,” an upcoming drama film from “Michael Clayton” director Tony Gilroy and Searchlight Pictures. \n\n\tA representative for Searchlight Pictures confirmed to Variety that Harbour stepped back from his role.\n\n\tHarbour was set to star alongside Pedro Pascal and Olivia Wilde in the film. Multiple insiders familiar with the project said Harbour was overwhelmed by the series wrap of “Stranger Things” — a monthslong episodic rollout and global water cooler moment with intense press scrutiny — and stepped away from the project to rest. The role has been recast, two sources said, though Harbour’s replacement was not immediately known. \n\t\n\n\tReps for Harbour did not immediately return requests for comment. While plot details remain scarce, an official logline for “Behemoth!” briefly states the film follows “a musician from a family of musicians who returns to Los Angeles,” serving as “a love letter to the music of the movies and the people who make it.” Gilroy penned the script and directs. He also serves as producer with Sanne Wohlenberg.\n\n\n\tThroughout his career, Harbour has remained very open about his journey with mental health. He was diagnosed with bipolar disorder at 26 years old after an intense episode. He told Variety in a 2022 interview that, although there are more conversations today about “wanting an open dialogue about mental illness,” the focus is often solely on the “tragedy.”\n\n\t“The colors of that dialogue need to be much broader in the sense of everything,” he added. “We pathologize this idea of normal and in truth, everybody has a lot of different experiences we should try to appreciate.”\n\t\n\n\tHarbour is best known for playing Jim Hopper on Netflix’s “Stranger Things.” First premiering on the streamer in 2016, the sci-fi drama series just capped off its fifth and final season with a two-hour finale. His other recent credits include films like “Thunderbolts*,” “A Working Man” and “Gran Turismo,” and TV shows like “Marvel Zombies” and “Creature Commandos.”\n\n\tThe story was first reported by Hollywood-centric social media gossip account Deuxmoi. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "David Harbour Exits Tony Gilroy’s Searchlight Drama ‘Behemoth!’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/GettyImages-2212504898.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-07T04:05:13.000Z",
      "dateModified": "2026-01-07T04:05:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "DreamWorks Remote Team, Netflix and ‘Ted’ Show Production Workers Vote to Unionize with The Animation Guild",
    "url": "https://variety.com/2026/artisans/news/dreamworks-netflix-ted-show-unionize-animation-guild-1236624786/",
    "image": "https://variety.com/wp-content/uploads/2025/06/10E61_TP_00010.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-07T00:56:59.000Z",
    "description": "\n\tDreamWorks Animation (DWA) remote workers across the United States, feature production workers at Netflix Animation Studios and production workers o",
    "body": "\n\tDreamWorks Animation (DWA) remote workers across the United States, feature production workers at Netflix Animation Studios and production workers on the show “Ted” have officially voted to unionize with the Animation Guild (IATSE Local 839) and the Editors Guild (IATSE Local 700), in an effort to ensure fair pay and treatment for all animation workers.\n\n\tThe National Labor Relations Board (NLRB) ballot count for DWA remote workers resulted in a majority “yes” vote in favor of union representation with the Animation Guild. DreamWorks Animation studio will formally recognize the remote bargaining unit under TAG and begin the process of negotiating a contract.\n\t\n\n\tThe newly-recognized unit represents remote workers living throughout the U.S. who contribute to LA–based DWA animation projects across both feature and television. These workers perform work already covered under TAG’s Master Agreement when done onsite on campus in LA County, and include roles such as story artists, animators, character effects artists, technical directors, lighters, visual development artists, modelers and production coordinators, among others.\n\n\n\tRemote workers organized to address longstanding inequities between remote and on-campusemployees. Union recognition establishes a path forward for collective bargaining aimed at securingequal treatment and sustainable working conditions for remote employees.\n\n\tTAG’s business representative, Steve Kaplan, said, “These units overwhelmingly voted in favor ofTAG representation after facing the degrading process of being forced into an NLRB election and theunnecessary delay of the government shutdown.” He added, “We are continuing to expand our jurisdiction both inside and outside the scope of our Master Agreement as we continue to look forward toprotecting the rights of all animation workers regardless of zip code.”\n\t\n\n\tAnthony Holden, a remote story artist and organizing committee member based in Washington State, said: “I’ve valued the opportunity to help unite our voices in seeking equality with our on-campus counterparts in terms of workers’ rights, fair pay, access to healthcare and retirement benefits, among other issues. We look forward to negotiating with the company to secure a fair agreement that will foster a workplace environment which is equitable to remote employees and will contribute to DreamWorks’ commercial and artistic success.”\n\n\tFeature production workers at Netflix Animation Studios and production workers on the “Ted” show are also celebrating their own NLRB victories to unionize with TAG and the Editors Guild. The elections took place on Dec. 23rd and Dec. 30th, respectively.\n\n\t“During my five years at NAS, my amazing production colleagues have shown up each day with diligence, passion and a breadth of skills and experience, both creative and strategic,” said production coordinator Erin Sullivan. “As a part of TAG, I’m excited for the opportunity we now have to represent ourselves as a unit, and I’m encouraged by the other production management teams in our industry who have set the bar.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "DreamWorks Remote Team, Netflix and ‘Ted’ Show Production Workers Vote to Unionize with The Animation Guild",
      "image": [
        "https://variety.com/wp-content/uploads/2025/06/10E61_TP_00010.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-07T00:56:59.000Z",
      "dateModified": "2026-01-07T00:56:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chris Redd Says He Sold Pills to Fellow Cast Members While on ‘SNL’: ‘I’m Not Gonna Snitch on Y’all Motherf—–s’",
    "url": "https://variety.com/2026/tv/news/chris-redd-sold-pills-cast-members-snl-1236624871/",
    "image": "https://variety.com/wp-content/uploads/2026/01/GettyImages-2210624964.jpg?crop=0px%2C135px%2C6000px%2C3375px&resize=1000%2C563",
    "tag": "Entertainment",
    "date": "2026-01-07T05:13:13.000Z",
    "description": "\n\tFormer “Saturday Night Live” star Chris Redd posted an emotional video to his Instagram on Tuesday morning, in which he admitted to selling pills to",
    "body": "\n\tFormer “Saturday Night Live” star Chris Redd posted an emotional video to his Instagram on Tuesday morning, in which he admitted to selling pills to his fellow “SNL” cast members while on the show. He said at the top of the rougly six minute confessional that the post was made in an effort to lead with more “vulnerability and openness” in his life and work.\n\n\t“While I was at the show, I had some pill issues, you know, some pill problems,” Redd said. “Nothing too crazy, but crazy for my black ass. And I was even selling some to some of my castmates. I’m not gonna snitch on y’all motherfuckers man.”\n\t\n\n\tRedd went on to say that he was deeply hurt by the way his castmates reacted to him struggling with the drugs. Instead of trying to help him, Redd said they would “just talk shit” about him.\n\n\t“I would hear them because, you know, some of that Adderall shit got you super hearing and shit,” he added. “But [they] wouldn’t help me, you know. I would have panic attacks, [they] wouldn’t be concerned about me or nothing. Just would talk shit. It’s crazy how somebody would watch you destroy yourself.”\n\n\tRedd joined “SNL” as a featured player in 2017 and was with the show for five seasons before his exit in 2022, before the show’s 48th season. During his time on the show, he was known for his impression of then-New York Mayor Eric Adams and appeared in many pre-taped sketches. In 2018, he shared an Emmy win for writing “Come Back, Barack,” a song coercing former president Barack Obama to run for office again.\n\n\tIn the years after his “SNL” exit, Redd appeared in shows like “Power Book III: Raising Kanan” and “Happy Family USA,” as well as movies like “Merv” and “Candy Cane Lane.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chris Redd Says He Sold Pills to Fellow Cast Members While on ‘SNL’: ‘I’m Not Gonna Snitch on Y’all Motherf—–s’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/GettyImages-2210624964.jpg?crop=0px%2C135px%2C6000px%2C3375px&resize=1000%2C563"
      ],
      "datePublished": "2026-01-07T05:13:13.000Z",
      "dateModified": "2026-01-07T05:13:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Béla Fleck Withdraws From Kennedy Center Concerts After Trump Name Change: ‘Performing There Has Become Charged and Political’",
    "url": "https://variety.com/2026/music/news/bela-fleck-withdraws-kennedy-center-after-trump-name-change-1236624777/",
    "image": "https://variety.com/wp-content/uploads/2026/01/GettyImages-2197298920-e1767745877183.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-07T00:36:31.000Z",
    "description": "\n\tBéla Fleck is the latest to join the growing list of artists who have withdrawn from performing at the John F. Kennedy Center for the Performing Art",
    "body": "\n\tBéla Fleck is the latest to join the growing list of artists who have withdrawn from performing at the John F. Kennedy Center for the Performing Arts in the wake of Donald Trump adding his name to the venue.\n\n\tThe banjo player was set to perform with the National Symphony Orchestra on February 19, 21 and 22 for the world premiere of “American Mosaic,” described on the Center’s website as “a true celebration of American music.” But Fleck took to social media on Tuesday to explain that the political implications of appearing at the venue have taken precedence over the music itself.\n\t\n\n\t“I have withdrawn from my upcoming performance with the NSO at The Kennedy Center,” wrote Fleck. “Performing there has become charged and political, at an institution where the focus should be on the music. I look forward to playing with the NSO another time in the future when we can together share and celebrate art.”\n\n\n\n\tThe Center updated the listing for the concerts with a note acknowledging Fleck’s decision not to perform. “Due to personal issues Béla Fleck regrettably has to withdraw from his performances with the National Symphony Orchestra,” reads the note, which adds that “American Mosaic” will now feature NSO Principal Clarinet Ling Ma performing Aaron Copland’s Clarinet Concerto.\n\n\tFleck is one of many artists who have recently canceled their appearance at the Center, including some who withdrew after Trump’s name was added alongside John F. Kennedy’s at the venue. Last week, songwriter Stephen Schwartz said he would not take part in a program spotlighting him at the Center, stating, “It no longer represents the apolitical place for free artistic expression it was founded to be” and that “there’s no way I would set foot in it now.” At the end of 2025, two more acts — veteran jazz septet the Cookers and dance troupe Dog Varone and Dancers — canceled their performances.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Béla Fleck Withdraws From Kennedy Center Concerts After Trump Name Change: ‘Performing There Has Become Charged and Political’",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/GettyImages-2197298920-e1767745877183.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-07T00:36:31.000Z",
      "dateModified": "2026-01-07T00:36:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Under the Flags, the Sun’ Review: Chilling Archive-Driven Doc Tracks the Rise and Fall of South America’s Longest Dictatorship",
    "url": "https://variety.com/2026/film/reviews/under-the-flags-the-sun-review-1236620188/",
    "image": "https://variety.com/wp-content/uploads/2025/12/Under-the-Flags-the-Sun-FLO.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-07T03:00:00.000Z",
    "description": "\n\tNestled — or hidden — in between Brazil and Argentina, the country of Paraguay is mostly absent from the global consciousness. An enigma of a nation",
    "body": "\n\tNestled — or hidden — in between Brazil and Argentina, the country of Paraguay is mostly absent from the global consciousness. An enigma of a nation for most, it bears a turbulent history not forged in isolation but as a consequence of and in conversation with global changes.\n\n\tIn the incisively constructed, archive-footage documentary “Under the Flag, the Sun,” filmmaker Juanjo Pereira positions his small South American homeland as a part of a larger geopolitical context by dissecting the regime of Gen. Alfredo Stroessner. One of the world’s longest-running dictatorships, Stroessner’s rule, under the right-wing Colorado party, began in 1954 after a military coup and only ended in 1989. His promises of progress for the masses eventually turned into a thin veil for violence and human rights violations.\n\t\n\n\tA large percentage of all the material in “Under the Flag” comes from foreign news outlets — some of it from French reporters, a segment from Brazilian television, a few passages in English, plus others likely shot by anonymous cameramen inside the country, likely at great risk. Pereira scoured archives around the world to construct the nonfiction project, but rather than just assembling it, he and editor Manuel Embalse processed the footage for ominous effect, at times playing it in reverse, adding glitches or modifying the color palette. These stylistic flourishes add to the already effective juxtaposition of sound and image that highlight the incongruences between what Stroessner preached and what his government carried out. Solemn declarations about freedom underscore shots of brutalized students.\n\t\n\n\tSome U.S. viewers may still find it surprising to learn of their government’s involvement in perpetuating the suffering of people abroad. Like other autocrats in South America and elsewhere during the second half of the 20th century, Stroessner ruled with the White House’s support — not because his policies ensured the advent of democracy for the Paraguayan people, but because he served U.S. goals of abolishing communism from the Americas. Known as Operation Condor by intelligence agencies, the U.S. meddling in South American politics also affected Chile, Argentina, Bolivia, Brazil and Uruguay.\n\n\tAs if in a parade of horrors, the dictators in some of those neighboring countries have cameos in “Under the Flag,” either on screen or mentioned in the narration from the time, further cementing Pereira’s aim to portray the situation in Paraguay as part of a regional affliction. Over more than three decades, Stroessner visited dignitaries beyond the Americas, including those in Japan and France. The trips, whether tacitly or explicitly, legitimized his regime on the world stage even as thousands of Paraguayans were forced into exile or tortured and disappeared at home. The atrociousness went deeper, however.\n\n\tIf Stroessner doesn’t sound to you as a last name typical of a person from a former Spanish colony in Latin American, that’s because the dictator, in no ambiguous terms a Nazi sympathizer, was the son of a German immigrant father. Pereira spends a substantial portion of the doc on Stroessner’s support of Josef Mengele, the Nazi doctor behind numerous deaths at Auschwitz, as well as abhorrent experiments. Mengele found refuge in Paraguay among other exiled Nazis and a powerful ally in Stroessner, who granted him Paraguayan citizenship to prevent extradition. Questions about the disturbing connection went unanswered since Stroessner controlled local media and refused to oblige inquiries from foreign journalists when confronted.\n\n\tPropaganda songs in Guaraní, an Indigenous language still widely spoken in Paraguay, revere Stroessner as a hero. And yet, his government was accused of exploiting and segregating Indigenous communities. That Guaraní has endured as a tongue taught in schools, still present in all aspects of Paraguay, is a fascinating rarity in Latin America. Missing from Pereira’s examination is a more direct engagement with how the language played a role in shaping the country’s identity during the Stroessner years. Though the absence may reflect the limitations of archival material, near the end, a speech by a Guaraní-speaking partyman attests to the façade of false inclusivity that Stroessner procured.\n\t\n\n\tAn unsettling and informative introduction to Paraguay’s recent past, “Under the Flag, the Sun” attests to the notion of humanity’s interconnectivity even before the age of the internet. The chain reactions of international affairs reach even the places and people the Global North dismisses — often to their detriment. In preserving the history of Paraguay, Pereira is preserving a communal memory. Proof of the cyclical and mirroring nature of history is the image of a toppled statue of Stroessner that closes the film, an event that has now become synonymous with a fallen tyrant, no matter the latitude.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Under the Flags, the Sun’ Review: Chilling Archive-Driven Doc Tracks the Rise and Fall of South America’s Longest Dictatorship",
      "image": [
        "https://variety.com/wp-content/uploads/2025/12/Under-the-Flags-the-Sun-FLO.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-07T03:00:00.000Z",
      "dateModified": "2026-01-07T03:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "DGA, PGA and BAFTA Predictions: ‘Frankenstein’ Eyes Longlist Dominance, Josh Safdie on Director Bubble and ‘Sinners’ Faces Key International Test",
    "url": "https://variety.com/2026/film/awards/dga-pga-bafta-longlist-predictions-2026-1236624759/",
    "image": "https://variety.com/wp-content/uploads/2026/01/Frankenstein-Marty-Supreme-Sinners.jpg?w=1000&h=563&crop=1",
    "tag": "Entertainment",
    "date": "2026-01-07T01:01:39.000Z",
    "description": "\n\tBefore Sunday’s Golden Globes ceremony, Hollywood will officially enter the “playoff” stage — or wildcard — stage of Oscar season. By Friday afterno",
    "body": "\n\tBefore Sunday’s Golden Globes ceremony, Hollywood will officially enter the “playoff” stage — or wildcard — stage of Oscar season. By Friday afternoon, the Directors Guild of America, Producers Guild of America, American Society of Cinematographers and BAFTA will roll out nominations and longlists that will dramatically narrow the field for more than two dozen films vying for Academy Awards attention (Variety’s SAG predictions for Wednesday are here).\n\t\n\n\tHistorically, this stretch becomes one of the highest-pressure tests for campaigns. With Oscar nomination voting starting on Monday, Jan. 12, it doesn’t leave a lot of room for pivots and campaign strategy changes. Momentum hardens, vulnerabilities are exposed and the gap between contenders and pretenders is out in the open.\n\n\n\tAt the DGA, the best director race is expected to align closely with the top contenders for best picture. The likeliest nominees include Paul Thomas Anderson (“One Battle After Another“), Ryan Coogler (“Sinners“) and Chloé Zhao (“Hamnet”). Anderson and Coogler currently lead in director wins for the season.\n\n\tThe two remaining spots represent a competitive dash between beloved veteran Guillermo Del Toro (“Frankenstein“) and American mainstay Josh Safdie (“Marty Supreme”), alongside four internationally known and acclaimed figures: Joachim Trier (“Sentimental Value”), Jafar Panahi (“It Was Just an Accident”), Kleber Mendonça Filho (“The Secret Agent”) and Yorgos Lanthimos (“Bugonia”).\n\n\tThe DGA’s first-time feature category will be one to watch. The category honoring first-time narrative filmmakers puts Eva Victor (“Sorry, Baby”) and Harry Lighton (“Pillion”) at the forefront, with room for actors-turned-directors like Kristen Stewart (“The Chronology of Water”) and Embeth Davidtz (“Don’t Let’s Go to the Dogs Tonight”) in the running.\n\t\n\n\tAt the PGA nominations, which drops on Friday, the guild is coming off overlapping eight of 10 with the Oscars’ best picture category last year, and the year prior achieving a historic 10-for-10 match. That feat isn’t expected to repeat this year given the landscape.\n\n\tThe predicted PGA lineup features Anderson’s “One Battle After Another,” Coogler’s “Sinners” and Zhao’s “Hamnet” as likely locks, joined by Del Toro’s “Frankenstein,” Safdie’s “Marty Supreme” and Trier’s “Sentimental Value.” Also expected to contend are Clint Bentley’s indie drama “Train Dreams,” along with populist favorites such as Joseph Kosinski’s “F1” and Jon M. Chu’s “Wicked: For Good.” We could see James Cameron’s billion-dollar earner “Avatar: Fire and Ash” also pop up.\n\n\tThe ASC race will likely shake things up in the race for cinematography. Autumn Durald Arkapaw (“Sinners”) is likely to join a short list of four women who have been nominated by the guild: Rachel Morrison for “Mudbound” (2017), Ari Wegner for “The Power of the Dog” (2021) and the only winner, Mandy Walker, for “Elvis” (2022). Alice Brooks earned a nom for “Wicked” (2024) last year and is in the conversation again with the sequel, “Wicked: For Good,” which made the cinematography Oscar shortlist.\n\n\tAlso in contention are Adolpho Veloso (“Train Dreams”), Michael Bauman (“One Battle After Another”), Łukasz Żal (“Hamnet”) and Dan Laustsen (“Frankenstein”) along with former ASC nominees Claudio Miranda (“F1”), Darius Khondji (“Marty Supreme”) and Robbie Ryan (“Bugonia”).\n\n\n\n\t\n\n\t\t\t\t\t4238_D033_00469_R\nDirector of photography Lukasz Zal, director Chloé Zhao and actors Jessie Buckley and Paul Mescal on the set of their film HAMNET, a Focus Features release.\nCredit: Agata Grzybowska / © 2025 FOCUS FEATURES LLC\n\t\t\t\t\t\t\t\t\tAgata Grzybowska\n\t\n\n\n\n\tAnd then there’s the BAFTA longlist.\n\n\tAlso announcing on Friday, the organization from across the pond are expected to highlight both American studio films and international cinema. Unlike nominations, which will be announced after Oscar nomination voting has closed, these longlists will mostly feature 10 titles in most categories and 15 in Outstanding British Film (all categories are listed alphabetically below).\n\n\tDel Toro’s “Frankenstein” is projected to lead the longlists with 12 mentions including best film and two acting mentions for its stars Oscar Isaac and Jacob Elordi. We’re expecting that Zhao’s “Hamnet,” Anderson’s “One Battle After Another” and Coogler’s “Sinners” to follow closely with 10 each.\n\t\n\n\tThis will be a key test for the genre film “Sinners,” as it remains unclear how international voters will respond. Given BAFTA’s long and well-documented struggles to recognize Black performers — Denzel Washington has still never received an acting nomination from the group — the hope is that the longlists will at least include Michael B. Jordan and Wunmi Mosaku, both of whom are among the film’s 10 projected mentions.\n\n\tThere are a few healthy tallies for other movies such as “Marty Supreme” (nine), “Bugonia” and “Sentimental Value” (eight), “Wicked: For Good” (seven) and “F1,” “Nuremberg,” “The Secret Agent” and “Train Dreams” with six each.\n\n\tIn the best film category, these 10 films are determined by all BAFTA voters using ranked voting, with points applied based on preference order. We’re expecting some of the usual suspects already mentioned but are looking out for the film or two that gets on the list as a “red herring” in the group (i.e., “All of Us Strangers” and “The Mauritanian” in previous years which all failed to garner a single Oscar nom).\n\n\tThe director longlist could feature up to 11 filmmakers under BAFTA’s gender parity intervention, which ensures equal representation of women and men directors. The Directing chapter votes for their top 10, with the system designed to balance the longlist. With non-binary multi-hyphenate Eva Victor heavily in the discussion, we’re likely to see the full 11 executed this year. Predictions include Anderson, Kathryn Bigelow (“A House of Dynamite”), Mary Bronstein (“If I Had Legs I’d Kick You”), Coogler, Del Toro, Kaouther Ben Hania (“The Voice of Hind Rajab”), Panahi, Lynne Ramsay (“Die My Love”), Trier, Victor and Zhao.\n\n\tIn the performance categories, BAFTA’s unique longlisting process has the Acting chapter vote determine the first seven places, while a jury selects the final three from those ranked eight through 13 in the chapter vote. When published, no distinction is made between chapter-selected and jury-selected performances.\n\n\tOne important eligibility reminder as BAFTA longlists are unveiled: despite its strong visibility in the animated feature conversation, Netflix’s “KPop Demon Hunters” is ineligible for BAFTA consideration. \n\n\tBy the end of the week, the awards-season map will look far less abstract. The next few days will determine whether they are still in the race — or should pack it up.\n\t\n\n\tThe full list of predictions are below.\n\n\n\n\t\n\n\t\t\t\t\t(L to r) DELROY LINDO, MICHAEL B. JORDAN and director RYAN COOGLER\n\t\t\t\t\t\t\t\t\tEli Ade\n\t\n\n\n\t\n\t\tDirectors Guild of America (DGA)\t\n\n\tDirectorial Achievement in Theatrical Feature Film Paul Thomas Anderson, “One Battle After Another” Ryan Coogler, “Sinners” Guillermo Del Toro, “Frankenstein”  Josh Safdie, “Marty Supreme” Chloé Zhao, “Hamnet” Alternate: Joachim Trier, “Sentimental Value”  First-Time Theatrical Feature Film Hasan Hadi, “The President’s Cake” Harry Lighton, “Pillion” Kristen Stewart, “The Chronology of Water”  Charlie Polinger, “The Plague” Eva Victor, “Sorry, Baby” Alternate: Diego Céspedes, “The Mysterious Gaze of the Flamingo” \n\n\n\n\t\n\n\t\t\t\t\tF1: THE MOVIE, (aka F1), Brad Pitt, 2025. © Warner Bros. /Courtesy Everett Collection\n\t\t\t\t\t\t\t\t\t©Warner Bros/Courtesy Everett Collection\n\t\n\n\n\t\n\t\tProducers Guild of America (PGA)\t\n\n\tOutstanding Producer of Documentary Theatrical Motion Pictures“Bugonia” (Ed Guiney, Yorgos Lanthimos, Andrew Lowe, Emma Stone)“F1” (Jerry Bruckheimer, Dede Gardner, Lewis Hamilton, Joseph Kosinski, Jeremy Kleiner, Chad Oman, Brad Pitt)“Frankenstein” (J. Miles Dale, Guillermo Del Toro, Scott Stuber, Gary Ungar)“Hamnet” (Nicolas Gonda, Pippa Harris, Liza Marshall, Sam Mendes, Steven Spielberg)“Marty Supreme” (Ronald Bronstein, Eli Bush, Timothée Chalamet, Anthony Katagas, Josh Safdie) “One Battle After Another” (Paul Thomas Anderson, Sara Murphy, Adam Somner, JoAnne Sellar)“Sentimental Value” (Andrew Berenstsen Ottmar, Maria Ekerhovd)“Sinners” (Ryan Coogler, Zinzi Coogler, Sev Ohanian)“Train Dreams” (Michael Heimler, Will Janowitz, Marissa McMahon, Teddy Schwarzman, Ashley Schlaifer) “Wicked: For Good” (Marc Platt) Alternate: “It Was Just an Accident” \n\n\n\n\t\n\n\t\t\t\t\tTRAIN DREAMS – (L-R) Felicity Jones as Gladys and  Joel Edgerton as Robert Grainier. Cr: Netflix © 2025\n\t\t\t\t\t\t\t\t\tCourtesy of Netflix\n\t\n\n\n\t\n\t\tAmerican Society of Cinematographers (ASC)\t\n\n\tAchievement in Cinematography in Theatrical Releases “Frankenstein” — Dan Laustsen “Hamnet” — Łukasz Żal “One Battle After Another” — Michael Bauman “Sinners” — Autumn Durald Arkapaw “Train Dreams” — Adolpho Veloso Alternate: “F1” — Claudio Miranda \n\t\n\t\tBAFTA Longlists\t\n\n\tBest Film “Bugonia” “Frankenstein” “Hamnet” “It Was Just an Accident” “Marty Supreme” “Nuremberg” “One Battle After Another” “The Secret Agent” “Sentimental Value” “Sinners” \n\n\tDirector Paul Thomas Anderson, “One Battle After Another” Kathryn Bigelow, “A House of Dynamite” Mary Bronstein, “If I Had Legs I’d Kick You” Ryan Coogler, “Sinners” Guillermo Del Toro, “Frankenstein” Kaouther Ben Hania, “The Voice of Hind Rajab” Jafar Panahi, “It Was Just an Accident” Lynne Ramsay, “Die My Love” Joachim Trier, “Sentimental Value” Eva Victor, “Sorry, Baby” Chloé Zhao, “Hamnet” \n\t\n\n\tLeading Actress Jessie Buckley, “Hamnet” Rose Byrne, “If I Had Legs I’d Kick You” Cynthia Erivo, “Wicked: For Good” Kate Hudson, “Song Sung Blue” Chase Infiniti, “One Battle After Another” Renate Reinsve, “Sentimental Value” Amanda Seyfried, “The Testament of Ann Lee” Emma Stone, “Bugonia” Tessa Thompson, “Hedda” Eva Victor, “Sorry, Baby” \n\n\tLeading Actor Lee Byung-hun, “No Other Choice” Timothée Chalamet, “Marty Supreme” Leonardo DiCaprio, “One Battle After Another” Joel Edgerton, “Train Dreams” Ethan Hawke, “Blue Moon” Oscar Isaac, “Frankenstein” Michael B. Jordan, “Sinners” Wagner Moura, “The Secret Agent” Jesse Plemons, “Bugonia” Jeremy Allen White, “Springsteen: Deliver Me From Nowhere” \n\n\tSupporting Actress Emily Blunt, “The Smashing Machine” Zoey Deutch, “Nouvelle Vague” Elle Fanning, “Sentimental Value” Ariana Grande, “Wicked: For Good” Inga Ibsdotter Lilleaas, “Sentimental Value” Amy Madigan, “Weapons” Wunmi Mosaku, “Sinners” Gwyneth Paltrow, “Marty Supreme” Teyana Taylor, “One Battle After Another” Emily Watson, “Hamnet” \n\n\tSupporting Actor Benicio Del Toro, “One Battle After Another” Jacob Elordi, “Frankenstein” Damson Idris, “F1” Paul Mescal, “Hamnet” Sean Penn, “One Battle After Another” Adam Sandler, “Jay Kelly” Andrew Scott, “Blue Moon” Alexander Skarsgård, “Pillion” Jeremy Strong, “Springsteen: Deliver Me From Nowhere” Stellan Skarsgård, “Sentimental Value” \n\n\tOriginal Screenplay “Blue Moon” “It Was Just an Accident” “Jay Kelly” “Marty Supreme” “Nouvelle Vague” “The Secret Agent” “Sentimental Value” “Sinners” “Sorry, Baby” “Urchin”  \n\n\tAdapted Screenplay “Bugonia” “Frankenstein” “Hamnet” “The History of Sound” “No Other Choice” “Nuremberg” “One Battle After Another” “Pillion” “Train Dreams” “Wake Up Dead Man: A Knives Out Mystery” \n\t\n\n\tCasting “Bugonia” “F1” “Frankenstein” “Hamnet” “Marty Supreme” “One Battle After Another” “The Secret Agent” “Sentimental Value” “Sinners” “Sirât” \n\n\tAnimated Film “Arco” “Demon Slayer: Kimetsu no Yaiba Infinity Castle” “Elio” “In Your Dreams” “Little Amélie or the Character of Rain” “Zootopia 2” \n\n\tProduction Design “Bugonia” “F1” “Frankenstein” “Hamnet” “Hedda” “Marty Supreme” “Nuremberg” “One Battle After Another” “Sinners” “Wicked: For Good” \n\n\tCinematography “Ballad of a Small Player” “F1” “Frankenstein” “Hamnet” “Marty Supreme” “No Other Choice” “Nouvelle Vague” “One Battle After Another” “Sinners” “Train Dreams” \n\n\tCostume Design “Downton Abbey: The Grand Finale” “Frankenstein” “Hamnet” “Marty Supreme” “Nouvelle Vague” “Nuremberg” “Sinners” “The Testament of Ann Lee” “Train Dreams” “Wicked: For Good” \n\n\tEditing “Bugonia” “F1” “Frankenstein” “Hamnet” “Marty Supreme” “No Other Choice” “One Battle After Another” “Sentimental Value” “Sinners” “Springsteen: Deliver Me From Nowhere” \n\n\tMake Up and Hair “Blue Moon” “Downton Abbey: The Grand Finale” “Frankenstein” “Mr. Burton” “Nuremberg” “One Battle After Another” “Sinners” “The Smashing Machine” “The Testament of Ann Lee” “Wicked: For Good” \n\n\tSound “Avatar: Fire and Ash” “Bugonia” “F1” “Frankenstein” “A House of Dynamite” “One Battle After Another” “Sinners” “Sirât” “Springsteen: Deliver Me From Nowhere” “Wicked: For Good”\n\n\tSpecial Visual Effects “Avatar: Fire and Ash” “F1” “Frankenstein” “How to Train Your Dragon” “Mickey 17” “Mission: Impossible – The Final Reckoning” “The Running Man” “Sinners” “Superman” “Wicked: For Good” \n\t\n\n\tOriginal Score “Ballad of a Small Player” “Bugonia” “F1” “Frankenstein” “Hamnet” “One Battle After Another” “Sinners” “Sirât” “The Testament of Ann Lee” “Train Dreams” \n\n\tDocumentary “2000 Meters to Andriivka” “Below the Clouds” “Cutting Through Rocks” “The Librarians” “Love + War” “Mr. Nobody Against Putin” “Orwell 2+2=5” “The Perfect Neighbor” “Riefenstahl” “The Tale of Silyan” \n\n\tFilm Not in the English Language “It Was Just an Accident” “No Other Choice” “Nouvelle Vague” “A Private Life” “Resurrection” “The Secret Agent” “Sentimental Value” “Sirât” “Sound of Falling” “The Voice of Hind Rajab” \n\n\tOutstanding British Film “28 Years Later” “Ballad of a Small Player” “The Ballad of Wallis Island” “The Choral” “Die My Love” “Downton Abbey: The Grand Finale” “Hamnet” “My Father’s Shadow” “Ocean with David Attenborough” “Pillion” “Rabbit Trap” “The Six Billion Dollar Man” “Steve” “Urchin” “Warfare”  \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "DGA, PGA and BAFTA Predictions: ‘Frankenstein’ Eyes Longlist Dominance, Josh Safdie on Director Bubble and ‘Sinners’ Faces Key International Test",
      "image": [
        "https://variety.com/wp-content/uploads/2026/01/Frankenstein-Marty-Supreme-Sinners.jpg?w=1000&h=563&crop=1"
      ],
      "datePublished": "2026-01-07T01:01:39.000Z",
      "dateModified": "2026-01-07T01:01:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Alabama Barker Poses In Sexy Lingerie",
    "url": "https://www.tmz.com/2026/01/06/alabama-barker-poses-lingerie/",
    "image": "https://imagez.tmz.com/image/e3/16by9/2026/01/07/e3831b6de7034a10bd0b7b5ac371cc4a_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-07T01:48:31.000Z",
    "description": "\n    \n                    \n                          Alabama Barker\n                          Thirsty?!? Drink It All In!!!\n                      \n   ",
    "body": "\n    \n                    \n                          Alabama Barker\n                          Thirsty?!? Drink It All In!!!\n                      \n                  \n                                                                        Published \n                              January 6, 2026\n                            5:48 PM PST\n                                                                            \n      \n    \n      \n        \n              \n    \n    \n          Alabama Barker is starting off her year with a new thirst trap ... posing in some sexy black lingerie and flaunting her assets on the 'gram.\n      \n    \n          Check out these new photos Alabama just posted on Instagram ... she's looking super seductive in a studded cross set that shows off her boobs and her booty.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          Alabama's leaving little to the imagination here, and she's all dolled up in full hair and makeup ... strutting her stuff around in some heels and a two-bun ponytail.\n      \n\n          Travis Barker and Shanna Moakler's daughter posed next to some walls and some modern art ... but let's be honest, all eyes are on her here.\n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          AB captioned the post, hashtag \"IMSOMOVINGON.\"\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Alabama Barker\n              \n                          \n                Celebrity News\n              \n                          \n                Beauty\n              \n                          \n                Instagram\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Alabama Barker Poses In Sexy Lingerie",
      "image": [
        "https://imagez.tmz.com/image/e3/16by9/2026/01/07/e3831b6de7034a10bd0b7b5ac371cc4a_xl.jpg"
      ],
      "datePublished": "2026-01-07T01:48:31.000Z",
      "dateModified": "2026-01-07T01:48:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ronald Reagan's Son Michael Reagan Dead at 80",
    "url": "https://www.tmz.com/2026/01/06/ronald-reagan-son-michael-reagan-dead-at-80/",
    "image": "https://imagez.tmz.com/image/c3/16by9/2026/01/06/c34fd3f61d45412d849eb68c872b0b67_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-06T22:59:56.000Z",
    "description": "\n    \n                    \n                          Ronald Reagan's Son\n                          Michael Reagan Dead at 80\n                      \n  ",
    "body": "\n    \n                    \n                          Ronald Reagan's Son\n                          Michael Reagan Dead at 80\n                      \n      \n    \n          One of the sons of former actor and President of the United States Ronald Reagan, Michael Reagan, has died at the age of 80 ... the Ronald Reagan Presidential Foundation and Institute confirms to TMZ.\n      \n    \n          Michael died on Sunday, January 4, Newsmax reports … his cause of death was not released.\n      \n    \n          Michael Reagan, who was adopted, was Ronald's oldest son … his mother was actress Jane Wyman -- Ronald's first wife.\n      \n    \n          Michael was an author of multiple books -- including \"Lessons My Father Taught Me\" and \"Twice Adopted\" -- a radio host and a lecture speaker on conservative politics.\n      \n    \n          Michael is survived by his wife, two adult daughters, and two half-siblings, Patti and Ron Jr., from Ronald's second marriage to Nancy Reagan.\n      \n    \n          RIP\n      \n      \n              \n          \n                          \n                Ronald Reagan\n              \n                          \n                Nancy Reagan\n              \n                          \n                RIP\n              \n                          \n                Celebrity Death\n              \n                          \n                Politix\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ronald Reagan's Son Michael Reagan Dead at 80",
      "image": [
        "https://imagez.tmz.com/image/c3/16by9/2026/01/06/c34fd3f61d45412d849eb68c872b0b67_xl.jpg"
      ],
      "datePublished": "2026-01-06T22:59:56.000Z",
      "dateModified": "2026-01-06T22:59:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "TMZ Sports Streaming Live From Newsroom, Join The Conversation!",
    "url": "https://www.tmz.com/2026/01/06/tmz-sports-live-stream/",
    "image": "https://imagez.tmz.com/image/85/16by9/2026/01/06/85bff40cc1b74245a528c70513d7658a_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-06T20:56:53.000Z",
    "description": "\n    \n                    \n                          TMZ Sports Live Stream\n                          Join The Conversation!!!\n                      \n",
    "body": "\n    \n                    \n                          TMZ Sports Live Stream\n                          Join The Conversation!!!\n                      \n      \n    \n                  \n          \n                          \n                \n                                  \n      \n    \n          TMZ Sports is going live from the newsroom to discuss the day's biggest stories ... but we don't just want folks to watch and enjoy the conversation, we want y'all to get involved!!\n      \n    \n          Hit the comment section as Babcock, Lucas, Mojo, Luca, and the whole crew break down the most important topics of the day ... and we'll be interacting with viewers throughout the program between 1 and 2 PM PT.\n      \n    \n          YouTube, X, TikTok ... we're everywhere.\n      \n    \n          So tune in, make fun of us, share your two cents, sound off about your favorite team ... nothing is out of bounds.\n      \n    \n          Tuesday's show will talk about Snoop Dogg's NBA commentary gig, Tyson Fury's reason for returning to boxing, an NFLer's offer to Cristiano Ronaldo, and much more!!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Live Stream\n              \n                          \n                Streaming\n              \n                          \n                TMZ Sports\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "TMZ Sports Streaming Live From Newsroom, Join The Conversation!",
      "image": [
        "https://imagez.tmz.com/image/85/16by9/2026/01/06/85bff40cc1b74245a528c70513d7658a_xl.jpg"
      ],
      "datePublished": "2026-01-06T20:56:53.000Z",
      "dateModified": "2026-01-06T20:56:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Guess the Cheeky Model in an Animal-Print Bikini Catching Rays",
    "url": "https://www.tmz.com/2026/01/06/sexy-animal-print-swimwear-guess-who/",
    "image": "https://imagez.tmz.com/image/90/16by9/2026/01/06/904e98c728174ad9b416143a96ac8b5c_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-06T22:03:22.000Z",
    "description": "\n    \n                    \n                          Guess This\n                          Cheeky Ray of Sunshine in a\n                          Teeny ",
    "body": "\n    \n                    \n                          Guess This\n                          Cheeky Ray of Sunshine in a\n                          Teeny Bikini!\n                      \n      \n    \n      \n        \n              \n    \n    \n          This gorgeous model and DJ dropped a thirst trap video of her splashing around in the ocean ... barely covered by a tiny animal-print bikini.\n      \n    \n          Beyond being smokin' hot ... this Ray of sunshine is known for her social media presence and love of music -- both spinning and production.\n      \n    \n          Still unsure? Hit up the gallery for the cheeky reveal!\n      \n      \n      \n          \n            \n              \n                \n                Share on Facebook\n              \n            \n            \n              \n                \n                Share on X\n              \n            \n                          \n                \n                  \n                \n              \n                      \n        \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Hotties & Bodies\n              \n                          \n                Hot Bodies\n              \n                          \n                Guess Who\n              \n                          \n                Photo Galleries\n              \n                      \n        \n          \n  ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Guess the Cheeky Model in an Animal-Print Bikini Catching Rays",
      "image": [
        "https://imagez.tmz.com/image/90/16by9/2026/01/06/904e98c728174ad9b416143a96ac8b5c_xl.jpg"
      ],
      "datePublished": "2026-01-06T22:03:22.000Z",
      "dateModified": "2026-01-06T22:03:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Guess Who This Australian Stud Is!",
    "url": "https://www.tmz.com/2026/01/06/guess-who-australian-stud/",
    "image": "https://imagez.tmz.com/image/a4/16by9/2026/01/05/a4c3690dddfa41b4815488930b124247_xl.jpg",
    "tag": "Entertainment",
    "date": "2026-01-07T00:00:48.000Z",
    "description": "\n    \n                    \n                          Guess Who\n                          This Australian Stud Is!\n                      \n             ",
    "body": "\n    \n                    \n                          Guess Who\n                          This Australian Stud Is!\n                      \n                  \n                                                                        Published \n                              January 6, 2026\n                            4:00 PM PST\n                                                                            \n      \n    \n      \n        \n                    \n                  \n      \n                    TMZ.com\n          \n    \n          We all know the stars shine brightest in L.A. (when there isn't light pollution) ... but there's plenty of thunder down under -- can guess you who this Aussie stud is?\n      \n    \n          We caught up with this singer-swimmer-actor at LAX, and when we asked him if he'd be interested in buying a suspiciously phallus-shaped house down in Sydney -- he described the house as an architectural \"breakthrough\" -- he said he'd have to grab it ...\n      \n    \n          Guess who!!!\n      \n      \n              \n            \n              Related articles\n            \n        \n              \n          \n                          \n                Guess Who\n              \n                      \n        \n          \n          ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Guess Who This Australian Stud Is!",
      "image": [
        "https://imagez.tmz.com/image/a4/16by9/2026/01/05/a4c3690dddfa41b4815488930b124247_xl.jpg"
      ],
      "datePublished": "2026-01-07T00:00:48.000Z",
      "dateModified": "2026-01-07T00:00:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]