[
  {
    "title": "Apple takes on YouTube and Spotify with new video podcasting push",
    "url": "https://www.cnbc.com/2026/02/16/apple-takes-on-youtube-and-spotify-with-new-video-podcasting-push.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108266087-1771261356449-gettyimages-2155600665-porzycki-appsonap240605_np3cr.jpeg?v=1771280548&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-16T18:45:50.000Z",
    "description": "Apple Podcasts on App Store displayed on a phone screen is seen in this illustration photo taken in Poland on June 5, 2024. (Photo by Jakub Porzycki/N",
    "body": "Apple Podcasts on App Store displayed on a phone screen is seen in this illustration photo taken in Poland on June 5, 2024. (Photo by Jakub Porzycki/NurPhoto via Getty Images)Nurphoto | Nurphoto | Getty ImagesApple on Monday announced that it will bring a new integrated video podcast experience to Apple Podcasts this spring.The move comes as video viewership continues to reshape podcasting. About 37% of people over age 12 watch video podcasts monthly, according to Edison Research.The update brings Apple Podcasts more in-line with its competitors Spotify, YouTube and now Netflix, which have increasingly leaned into video podcasting.\"Twenty years ago, Apple helped take podcasting mainstream by adding podcasts to iTunes, and more than a decade ago, we introduced the dedicated Apple Podcasts app,\" said Eddy Cue, Apple's senior vice president of Services, in a statement. \"By bringing a category-leading video experience to Apple Podcasts, we're putting creators in full control of their content and how they build their businesses, while making it easier than ever for audiences to listen to or watch podcasts.\"Within the Apple Podcasts app, users will be able to switch seamlessly between watching and listening to shows from the same feed. They can also use picture-in-picture mode and download video episodes for offline viewing.While Apple Podcasts has supported video through RSS since 2005, those feeds were kept separate from audio versions of the same show. The new update introduces support for HLS, or HTTP Live Streaming, a streaming protocol developed by Apple that enables adaptive video playback and greater controls within the app.The new HLS format also introduces dynamic video ad insertion. Creators who distribute through participating hosting providers and ad networks will be able to insert video ads, including host-read spots, into episodes.Apple said it will not charge creators or hosting providers to distribute content. However, it will charge participating ad networks an impression-based fee for delivering dynamic video ads through HLS.These launch podcast hosting partners include Acast, Amazon-owned ART19, Triton's Omny Studio and SiriusXM who will all be supporting HLS video.The announcement comes as competitors continue investing in podcast video. YouTube said last year it has more than 1 billion monthly active viewers of podcast content on its platform. Spotify has also expanded its video podcast offerings and said it paid more than $100 million to podcasters in the first quarter of last year.Netflix has also entered the video podcast space. The streaming platform inked a deal with Spotify last year to bring video podcasts to Netflix and has begun investing in original video podcast programming, including \"The Pete Davidson Show,\" which launched in January.Apple does not break out revenue specifically for Apple Podcasts, but its Services segment, which includes digital content and subscription businesses, generated $30 billion in revenue in its most recent quarter.In January, the company acquired Israeli artificial intelligence startup Q.ai for an undisclosed amount. The company has not released details of the acquisition, though Q.ai's website indicated it was working on audio-focused AI tools.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Apple takes on YouTube and Spotify with new video podcasting push",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108266087-1771261356449-gettyimages-2155600665-porzycki-appsonap240605_np3cr.jpeg?v=1771280548&w=1920&h=1080"
      ],
      "datePublished": "2026-02-16T18:45:50.000Z",
      "dateModified": "2026-02-16T18:45:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "CFTC defends its right to prediction market enforcement as states challenge platforms",
    "url": "https://www.cnbc.com/2026/02/17/cftc-defends-prediction-market-enforcement-states-challenge.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108228693-17635888792025-11-19t214628z_803884803_rc2vzhanro2e_rtrmadp_0_usa-congress.jpeg?v=1763588917&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-17T16:05:16.000Z",
    "description": "Michael Selig, U.S. President Trump's nominee to serve as Commodity Futures Trading Commission (CFTC) chairman, testifies in a Senate Agriculture Comm",
    "body": "Michael Selig, U.S. President Trump's nominee to serve as Commodity Futures Trading Commission (CFTC) chairman, testifies in a Senate Agriculture Committee hearing on his nomination on Capitol Hill in Washington, D.C., U.S., Nov. 19, 2025. Jonathan Ernst | ReutersThe Commodity Futures Trading Commission filed an amicus brief in federal court on Tuesday to assert the agency's right to enforce prediction markets instead of individual states, according to its new chairman, Michael Selig.Selig argued in a Monday Wall Street Journal op-ed that the CFTC has always had authority over prediction markets and determining whether the event contracts constitute gambling, as critics allege. Selig noted nearly 50 active legal cases against prediction markets and said the CFTC would be stepping in prevent state encroachment.\"The CFTC will no longer sit idly by while overzealous state governments undermine the agency's exclusive jurisdiction over these markets by seeking to establish statewide prohibitions on these exciting products,\" he wrote.The move comes as prediction markets like Kalshi and Polymarket face legal challenges in multiple states over event contracts. The platforms allow users to bet on the outcomes of events in pop culture, sports, entertainment and more.Critics of prediction markets have argued that the offerings amount to little more than gambling, though Kalshi has defended its platform and argued that it abides by federal regulations. Sports betting on the prediction platforms have drawn comparisons to legalized sports betting in the U.S. In his first public comments as CFTC chairman at the end of January, Selig said he was prepared to draft new, clear rules to govern prediction markets and revisit the agency's rules on involvement in federal and circuit court cases.\"Where jurisdictional questions are at issue, the Commission has the expertise and responsibility to defend its exclusive jurisdiction over commodity derivatives,\" he said at the time.In his Monday op-ed, Selig said event contracts \"serve legitimate economic functions\" and operate under CFTC rules as \"swaps\" rather than gambling. He also posited that trading on event contracts are beneficial for the market and for Americans at large.\"These exchanges aren't the Wild West, as some critics claim, but self-regulatory organizations that are examined and supervised by experienced CFTC staff,\" Selig wrote.In a Tuesday video posted to X, Selig said his message to those who challenge the CFTC's authority is clear: \"We will see you in court.\"\"Today, the CFTC is taking an important step to ensure that these markets have a place here in America and have the integrity and resilience and vibrancy that our derivative markets deserve,\" he said.Selig said the amicus brief would be filed in the Ninth U.S. Circuit Court of Appeals in support of Crypto.com in its dispute with the Nevada Gaming Control Board. Disclosure: CNBC and Kalshi have a commercial relationship that includes a CNBC minority investment.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "CFTC defends its right to prediction market enforcement as states challenge platforms",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108228693-17635888792025-11-19t214628z_803884803_rc2vzhanro2e_rtrmadp_0_usa-congress.jpeg?v=1763588917&w=1920&h=1080"
      ],
      "datePublished": "2026-02-17T16:05:16.000Z",
      "dateModified": "2026-02-17T16:05:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Hyatt Chairman Pritzker leaves board over Epstein ties",
    "url": "https://www.cnbc.com/2026/02/16/hyatt-chairman-pritzker-leaves-board-over-epstein-ties.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108266099-1771273824035-gettyimages-953891668-MILKEN_CONFERENCE.jpeg?v=1771332905&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-16T23:22:57.000Z",
    "description": "Thomas Pritzker, executive chairman of Hyatt Hotels Corp., speaks during the Milken Institute Global Conference in Beverly Hills, California, U.S., on",
    "body": "Thomas Pritzker, executive chairman of Hyatt Hotels Corp., speaks during the Milken Institute Global Conference in Beverly Hills, California, U.S., on Wednesday, May 2, 2018. The conference brings together leaders in business, government, technology, philanthropy, academia, and the media to discuss actionable and collaborative solutions to some of the most important questions of our time. Photographer: Dania Maxwell/Bloomberg via Getty ImagesBloomberg | Bloomberg | Getty ImagesHyatt Hotels Chairman Thomas Pritzker said Monday that he would retire and renounced his relationship with sex predator Jeffrey Epstein.Pritzker will leave his post as the hotel chain's executive chairman — a role he's held for more than two decades — immediately, he said in a statement released by the Pritzker Organization. The 75-year-old billionaire Hyatt heir said he would not seek reelection to the board at the annual stockholder meeting.\"My job and responsibility is to provide good stewardship. That is important to me,\" Pritzker said in the statement. \"Good stewardship includes ensuring a proper transition at Hyatt.\"Pritzker said he has \"regret\" over his connection to Epstein and his accomplice Ghislaine Maxwell. Epstein plead guilty to state criminal charges related to soliciting prostitution, including one charge involving a minor, in Florida in 2008. He killed himself in 2019 after being arrested for federal child sex trafficking charges.Recently released files show Pritzker and Epstein exchanged friendly emails after the disgraced financier's 2008 plea deal. Being part of the release of thousands of documents and photos does not imply any wrongdoing.\"I exercised terrible judgment in maintaining contact with them, and there is no excuse for failing to distance myself sooner,\" Pritzker said in the statement. \"I condemn the actions and the harm caused by Epstein and Maxwell and I feel deep sorrow for the pain they inflicted on their victims.\"Following his retirement, Pritzker said he would focus attention on a science foundation he began.Pritzker's announcement marks the latest in a series of high-profile resignations as more details about Epstein's dealings become public. Former Goldman Sachs Legal Chief Kathryn Ruemmler and Paul Weiss Chair Brad Karp were both among the latest business leaders to step down from their positions. Both Ruemmler and Karp and have said they regret their connections to Epstein and that coverage of their ties were creating distractions for the companies they represented.Hyatt said its board appointed CEO Mark Hoplamazian to succeed Pritzker as chair starting immediately. Board member Richard Tuttle thanked Pritzker for his work and called him \"instrumental\" in determining the Chicago-based company's strategy in a press release.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Hyatt Chairman Pritzker leaves board over Epstein ties",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108266099-1771273824035-gettyimages-953891668-MILKEN_CONFERENCE.jpeg?v=1771332905&w=1920&h=1080"
      ],
      "datePublished": "2026-02-16T23:22:57.000Z",
      "dateModified": "2026-02-16T23:22:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cloud startup Render raises funding at $1.5 billion valuation as AI-built apps boom",
    "url": "https://www.cnbc.com/2026/02/17/render-raises-100-million-at-1point5-billion-valuation.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108265881-1771018129750-Render_Team_Photo.jpg?v=1771022132&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-17T15:00:02.000Z",
    "description": "Render employees, including CEO Anurag Goel, center, gather at the startup's headquarters in San Francisco on Feb. 11, 2026.RenderVenture capitalists ",
    "body": "Render employees, including CEO Anurag Goel, center, gather at the startup's headquarters in San Francisco on Feb. 11, 2026.RenderVenture capitalists are doubling down on Render, a startup offering easy-to-use cloud infrastructure. On Tuesday it said it has raised $100 million in funding at a $1.5 billion valuation.The lucrative cloud computing world, dominated by Amazon, Microsoft and Alphabet, has become more competitive since the arrival of OpenAI's ChatGPT assistant in 2022. Companies such as CoreWeave that rent out Nvidia graphics cards for training artificial intelligence models have grown into mature businesses. Meanwhile, people are asking AI models to write software for them, and seeking advice on where to run the new programs. Render is among the beneficiaries of this emerging dynamic. Its revenue growth is well above 100%, and more than 4.5 million developers use its tools, Anurag Goel, its co-founder and CEO, told CNBC in an interview. The startup was founded in 2018 and is based in San Francisco, with about 100 employees. Investors include 01A, Addition, Bessemer Venture Partners, General Catalyst and Georgian Partners. With the new capital, Render will hire additional technical staff members to build features. Render runs its software on Amazon Web Services and Google Cloud Platform. Recently, Render has also been testing the use of its own servers. Expanding the initiative might reduce Render's costs and yield lower prices.\"We get more control over the kinds of things we can do, but the cost basis is just very different,\" said Goel, who was the eighth employee at Stripe, the payment processor.But greater reliance on in-house computing power brings new risks, because the company must ensure that it always has enough servers on hand. If the strategy works out, it could boost efficiency for customers, such as Alibaba, CBS, Hodinkee, Paradigm, Shopify and AI-fueled app builder Base44.watch nowThe founder of Base44, Maor Shlomo, had used AWS at his previous startup, Explorium, and this time he wanted something different. \"I was all by myself, and so I was searching for services that can automate most of the stuff so that I don't need to deal with infrastructure, even if it will cost slightly more that,\" Shlomo said. He signed up for Render. After website builder Wix bought Base44 last June, Shlomo asked to invest in Render, given his experience. Now he's a shareholder and a customer.\"It's such a great product that we don't need someone that's focused only on Render,\" he said.Before Render, there was Heroku, a pioneer of the platform as a service category that runs on top of AWS. Salesforce acquired it for about $217 million in 2011. Earlier this month, Salesforce said it was backing away from developing new features for Heroku.\"People now know that they're not going to add new features to it, so they're looking around for the most mature alternative,\" Goel said.OpenAI — which has committed to spending more than $600 billion with the Amazon, Cerebras, CoreWeave, Microsoft and Oracle clouds in recent months — uses Render. The AI lab's Codex coding app allows people to deploy web apps they create on Render. Codex users can also choose to deploy their apps on Cloudflare, Netlify and Vercel. In September, Vercel said it raised capital at a $9.3 billion valuation. Goel said companies such as AI spreadsheet specialist Shortcut have moved to Render from Vercel.It doesn't hurt that ChatGPT recommends that people consider Render in certain scenarios, Goel said.\"Chatbots have effectively, almost singlehandedly, grown our business,\" he said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cloud startup Render raises funding at $1.5 billion valuation as AI-built apps boom",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108265881-1771018129750-Render_Team_Photo.jpg?v=1771022132&w=1920&h=1080"
      ],
      "datePublished": "2026-02-17T15:00:02.000Z",
      "dateModified": "2026-02-17T15:00:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ford to follow Tesla Cybertruck with electrical tech in new EV pickup",
    "url": "https://www.cnbc.com/2026/02/17/ford-ev-platform-pickup-truck.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108009213-1721411247934-gettyimages-1734342344-JAPAN_TOYOTA.jpeg?v=1721411290&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-17T16:00:01.000Z",
    "description": "A Ford F-150 Lightning next to a Tesla Cybertruck.Michael Wayland / CNBCDETROIT — Ford Motor's $5 billion \"bet\" on its next generation of all-electric",
    "body": "A Ford F-150 Lightning next to a Tesla Cybertruck.Michael Wayland / CNBCDETROIT — Ford Motor's $5 billion \"bet\" on its next generation of all-electric vehicles will feature a budding technology that Tesla commercialized in the U.S. on its Cybertruck, the Detroit automaker said Tuesday.The system, known as a 48-volt electrical architecture, had been discussed in the automotive industry for decades but Tesla was the first to bring it to consumers in 2023.The auto industry has historically used a 12-volt system with a lead-acid battery for all vehicles to power the car's accessories — but that's been problematic and caused recalls for many EVs. The new architecture instead uses the EV's high-voltage battery to power everything.The 48-volt system improves efficiency, allows for additional electrical bandwidth and saves weight through the reduction of wiring, officials have said. The power also can be \"stepped down\" to 12 volts, when needed, through the use of new electronic control units, or ECUs, that handle different groups of an EV's architecture.The new electrical system is one of many innovations that Ford believes will allow its next-generation EVs — starting with a $30,000 small electric pickup truck in 2027 — to compete against Tesla as well as rapidly expanding Chinese brands in global markets.\"At Ford, we took on the challenge many others have stopped doing. We're taking the fight to our competition, including the Chinese,\" Ford CEO Jim Farley said during an August event at a plant in Kentucky that will produce the unnamed electric pickup. \"For too long, legacy automakers played it safe.\"Read moreFarley has called it a \"Model T moment\" for the company, referring to the company's flagship vehicle that came out more than a century ago and led to the mass adoption of vehicles during the early 1900s. He's also called it a \"bet\" for Ford given the amount of changes it will make to the EVs as well as the company and its processes. Ford expects the new EVs, which will be based on a common \"Universal Electric Vehicle,\" or UEV, to have comparable costs to gas-powered vehicles through new technologies and efficiencies. Currently, the massive batteries that power EVs have made them far more expensive to produce and have been infamously unprofitable. The Detroit automaker has said the new EVs will reduce parts by 20% versus a typical vehicle, with 25% fewer fasteners, 40% fewer workstations dock-to-dock in the plant and 15% faster assembly time.\"It represents the most radical change on how we design and how we build vehicles at Ford since the Model T,\" Farley said at the plant. \"Now is time to change the game once again.\"Ford CEO Jim Farley speaks at the Louisville Assembly Plant as the company shares its plans to design and assemble breakthrough electric vehicles in the United States, Aug. 11, 2025.Courtesy: FordFord said those improvements, as well as price points that are more similar to gas-powered models, will lead to greater adoption of EVs. That's despite a significant slowdown in U.S. EV sales amid changes to federal support by the Trump administration as well as less-than-expected consumer adoption.U.S. EV sales peaked in September, ahead of the federal incentives ending, at 10.3% of the new vehicle market, according to Cox Automotive. That demand plummeted to preliminary estimates of 5.8% during the fourth quarter.Those market conditions recently led Ford to announce $19.5 billion in write-downs, largely related to a pullback in EV plans, but the company said it will continue to invest $5 billion for its new UEV platform through 2027.\"Our focus has been on giving them everything they would get in a nice vehicle and more, and we think that that will allow us to ultimately not just make an affordable vehicle, but make one that's extremely desirable,\" Alan Clarke, Ford's executive director of advanced EV development, said during a media briefing.48-volt systemThe 48-volt system provides significant benefits to other parts of the vehicle aside from just the battery and is expected to continue to do so as the bandwidth of 12-volt batteries gets maxed out, according Clarke, a former Tesla executive. \"It's less expensive, has smaller wires and is the future of automotive,\" he said. \"So, if you want to future-protect this platform to exist for more than a decade … it's very clear that 48 made the most sense.\"Alan Clarke, Ford’s executive director of advanced EV development, during a video presentation on Ford's Universal Electric Vehicle platform.Courtesy FordFord said the wiring harness in the new midsize truck will be more than 4,000 feet shorter and 22 pounds lighter than the wiring harness used in Ford's first-generation electric SUV.Tesla CEO Elon Musk sent competitors such as Ford and General Motors a \"how-to\" guide on developing a 48-volt system in 2023.Clarke said Ford had already decided on a 48-volt platform before getting the letter but that it \"certainly added fuel to the fire\" and was a \"helpful starting point to see how they thought about\" it. It also helped suppliers get ready to assist with 48-volt systems, he added.GigacastingsIn addition to the 48-volt system, the company on Tuesday released additional details on how it's achieving its targets with the new EV through aerodynamics, team \"bounties\" to increase vehicle efficiency and turning to Tesla-pioneered \"gigacastings.\"Gigacasting is a manufacturing process that can replace dozens of traditionally small, stamped parts with larger pieces. The process requires massive machines to pressurize large sheets of metal into parts such as a vehicle's facia or underlying structure.Ford said the new pickup will only have two structural front and rear parts compared with 146 such components on its current gas-powered Maverick small pickup.Ford also said its aluminum castings for the upcoming EV are more than 27% lighter than those features on a Tesla Model Y.\"We're still on a really steep decline of EV costs, and you can only get that by innovating, and you can only get that by system level, optimizing into what eventually becomes a product that a customer wants,\" Clarke said. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ford to follow Tesla Cybertruck with electrical tech in new EV pickup",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108009213-1721411247934-gettyimages-1734342344-JAPAN_TOYOTA.jpeg?v=1721411290&w=1920&h=1080"
      ],
      "datePublished": "2026-02-17T16:00:01.000Z",
      "dateModified": "2026-02-17T16:00:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Netflix grants Warner Bros. Discovery 7-day waiver to reopen deal talks with Paramount Skydance",
    "url": "https://www.cnbc.com/2026/02/17/netflix-wbd-waiver-deal-talks-paramount-skydance.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108238991-1765286599836-gettyimages-2250857237-dji_20251208164801_0200_d_ase9wxo7.jpeg?v=1768430109&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-17T13:30:52.000Z",
    "description": "watch nowWarner Bros. Discovery on Tuesday said it will reopen deal talks with Paramount Skydance under a seven-day waiver from Netflix to explore \"de",
    "body": "watch nowWarner Bros. Discovery on Tuesday said it will reopen deal talks with Paramount Skydance under a seven-day waiver from Netflix to explore \"deficiencies\" in Paramount's offer to buy the entirety of WBD. The legacy media company has a pending transaction with Netflix for its streaming and studio businesses. Paramount launched a hostile tender offer straight to WBD shareholders at $30 per share after losing out to Netflix in a bidding war. \"Netflix has provided WBD a limited waiver under the terms of WBD's merger agreement with Netflix, permitting WBD to engage in discussions with Paramount Skydance (\"PSKY\") (NASDAQ: PSKY) for a seven-day period ending on February 23, 2026 to seek clarity for WBD stockholders and provide PSKY the ability to make its best and final offer,\" Warner Bros. Discovery said in a release. \"During this period, WBD will engage with PSKY to discuss the deficiencies that remain unresolved and clarify certain terms of PSKY's proposed merger agreement,\" it said. Paramount leadership has repeatedly said its $30 per share, all-cash offer is not its \"best and final.\" Last week the company sweetened its offer with additional \"enhancements,\" but stopped short of raising the per-share value. Warner Bros. Discovery said Tuesday that a senior Paramount representative informed a WBD board member that it would pay $31 per share if deal talks were to reopen. Tune in at 4:30pm ET as Netflix co-CEO Ted Sarandos joins CNBC TV. Watch in real time on CNBC+ or the CNBC Pro stream.After the limited waiver period, Netflix will retain its matching rights provided by the merger agreement, WBD said. \"Throughout the entire process, our sole focus has been on maximizing value and certainty for WBD shareholders,\" said WBD CEO David Zaslav in a statement. \"Every step of the way, we have provided PSKY with clear direction on the deficiencies in their offers and opportunities to address them. We are engaging with PSKY now to determine whether they can deliver an actionable, binding proposal that provides superior value and certainty for WBD shareholders through their best and final offer.\"WBD also on Tuesday announced a special meeting of shareholders will be held on March 20 and said its board continues to unanimously recommend the Netflix deal over Paramount's offer. Netflix said in a statement the shareholder meeting date marked an \"important milestone for our transaction with WBD.\" \"While we are confident that our transaction provides superior value and certainty, we recognize the ongoing distraction for WBD stockholders and the broader entertainment industry caused by PSKY's antics,\" Netflix said. \"Accordingly, we granted WBD a narrow seven-day waiver of certain obligations under our merger agreement to allow them to engage with PSKY to fully and finally resolve this matter.\" Shares of Paramount and Warner Bros. Discovery were each up roughly 3% in premarket trading Tuesday. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Netflix grants Warner Bros. Discovery 7-day waiver to reopen deal talks with Paramount Skydance",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108238991-1765286599836-gettyimages-2250857237-dji_20251208164801_0200_d_ase9wxo7.jpeg?v=1768430109&w=1920&h=1080"
      ],
      "datePublished": "2026-02-17T13:30:52.000Z",
      "dateModified": "2026-02-17T13:30:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "From oil empire to global impact: How John D. Rockefeller Sr. reinvested his fortune in America",
    "url": "https://www.cnbc.com/2026/02/17/how-john-d-rockefeller-sr-reinvested-his-fortune-in-america.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108263881-1770738999470-rockefeller.jpg?v=1770739031&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-17T15:58:41.000Z",
    "description": "This Q&A is part of America: 250 Years Bold, a CNBC multiplatform series highlighting the leaders, institutions, and ideas that have shaped the United",
    "body": "This Q&A is part of America: 250 Years Bold, a CNBC multiplatform series highlighting the leaders, institutions, and ideas that have shaped the United States over the past 250 years.Dr. Rajiv J. Shah, president of The Rockefeller Foundation, leads one of the nation's most influential philanthropic institutions. Founded in 1913, the organization has invested more than $26 billion worldwide to advance public health, expand access to opportunity and tackle global challenges at scale. In this conversation, Shah reflects on the foundation's legacy — from pioneering breakthroughs in science and medicine to shaping modern philanthropy — and discusses how its mission continues to evolve to address inequality, strengthen resilience and expand economic opportunity in the United States and around the world.Dr. Rajiv Shah has led The Rockefeller Foundation since 2017, focusing on climate change, global health, and economic equity.CNBCQ: Who was John D. Rockefeller Sr.?Dr. Rajiv J. Shah: John D. Rockefeller Sr. was a titan. He built America during the Industrial Revolution, and helped, together with others, create the modern country we have. He was one of the pioneers who shaped that economic transformation that gave us railways and automobiles and gasoline and the power to go about improving our quality of life. In doing so he, of course, went from being someone who came from modest resources to the world's wealthiest individual, and decided he would use that wealth to give back to society and help shape a future that was hopeful and optimistic, not just for the winners of that age, but for everybody.We need to recreate a pathway to the American Dream for kids across this country that we are otherwise leaving behind. That's the mission of the Rockefeller Foundation going forward.Dr. Rajiv J. ShahRockefeller Foundation PresidentQ: How did the Rockefeller Foundation first get started?Shah: The Rockefeller Foundation was created in 1913, although long before that, John D. Rockefeller, when he was 16 years old and got his first job, started tithing to his church. He was a devout Baptist who believed in charitable giving. When he created the foundation, he did it with a partner, Frederick Gates, who was his advisor and an early trustee, and they decided the foundation would be used specifically to invest in those areas where science and innovation could transform life on this planet.Q: What was the foundation's original mission?Shah: The Rockefeller Foundation was established more than 100 years ago to take on major global projects that would transform life and the nature of opportunity for the world's most vulnerable people. We were founded to do scientific philanthropy because John D. Rockefeller believed that science applied to health, agriculture, energy and even social sciences applied to governance could really help transform society and make it an environment where everyone flourishes, not just the select few. The very first big project the foundation took on was eradicating hookworm in the American South. They built a reference lab, they created the county-based American public health system, and they successfully eradicated hookworm. Went on to tackle malaria, and that process created both huge successes in modern public health, but also seeded the American public health system county by county across this country, and presented the antecedents of the Centers for Disease Control based in Atlanta.Q: What does the Rockefeller Foundation focus on today?Shah: We focus today on bringing science, innovation and partnership to lift up vulnerable populations across the planet. We have four major areas of work and investment — health, food, energy and jobs — and we engage in large-scale public-private partnerships to deliver those outcomes. We invest all the time in core science around food, nutrition, energy, energy storage, battery technology, things that we think can make a difference, especially for those people who are vulnerable across this planet. One example of a risk we took is we issued a social impact bond, raised $500 million and put that entire amount of capital into one project to help make sure we could get more people out of energy poverty using renewable energy technologies. Today, we've mobilized more than $50 billion to reach more than 300 million people with energy access in Africa through an initiative we call \"Mission 300.\"Q: As America approaches its 250th birthday, what gives you optimism about the future?Shah: America has always been a frontier nation, and when John D. Rockefeller created the Rockefeller Foundation, it was during a time of economic transformation. Our history teaches us we can innovate and partner and collaborate and solve the challenges we face. My parents came here in the late 1960s as immigrants from India. I was raised to understand almost every day at the dinner table that America is a country where, if you worked hard and played by the rules, you and your kids would get a chance to thrive. What has changed is that today fewer than half of America's kids are predicted to do better than their parents, and so we need to recreate a pathway to the American Dream for kids across this country that we are otherwise leaving behind. That's the mission of the Rockefeller Foundation going forward.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "From oil empire to global impact: How John D. Rockefeller Sr. reinvested his fortune in America",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108263881-1770738999470-rockefeller.jpg?v=1770739031&w=1920&h=1080"
      ],
      "datePublished": "2026-02-17T15:58:41.000Z",
      "dateModified": "2026-02-17T15:58:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Altman and Pichai among tech CEOs heading to India for major AI summit in a key market",
    "url": "https://www.cnbc.com/2026/02/16/india-ai-impact-summit-tech-ceos-new-delhi.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107236338-1771334834956-107236338-1683293634568-AP23124580482542_1.jpg?v=1771334844&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-17T13:17:56.000Z",
    "description": "India's Prime Minister Narendra Modi speaks during a meeting with senior officials and CEOs of American and Indian companies, in the East Room the Whi",
    "body": "India's Prime Minister Narendra Modi speaks during a meeting with senior officials and CEOs of American and Indian companies, in the East Room the White House in Washington, DC, on June 23, 2023.Brendan Smialowski | AFP | Getty ImagesBig technology executives descend on India this week for an AI summit in New Delhi as the world's largest companies aim to expand their presence in what is seen as a critical growth market.India this week will host the AI Impact Summit, the latest in a series of government-hosted events focused on artificial intelligence that have taken place in the U.K., South Korea and France. Among the key attendees are OpenAI CEO Sam Altman and Alphabet CEO Sundar Pichai. Anthropic boss Dario Amodei and Google DeepMind CEO Demis Hassabis are also slated to be there. Nvidia CEO Jensen Huang, who was earlier expected to attend, reportedly withdrew on Saturday due to \"unforeseen circumstances.\"Indian Prime Minister Narendra Modi will roll out of the red carpet which tech CEOs will happily walk down as the country presents a lucrative market of young, tech-forward consumers and a huge pool of talent which could be key to continued development of AI. \"The summit ... is a huge validation of the potential of the market. Everyone's coming in because they realize that this is the place to be in and India just cannot be ignored,\" Lalit Ahuja, CEO of ANSR, a company that helps businesses run offshore teams in India.The AI Impact Summit also comes amid a reset in relations between India and the U.S. as the two nations push toward a trade deal. India strives to be a major tech hubModi's government has made its intentions clear in the last few years — it wants India to be one of the world's tech superpowers. India has approved $18 billion worth of semiconductor projects as it looks to build a domestic supply chain. The government has pushed major companies, including Apple, to manufacture more of its goods in India.Venture capital investors are betting on India's startups while the country's stock exchanges are seeing a surge in initial public offerings. Neil Shah, partner at Counterpoint Research said government support for tech \"is a red carpet for multinational companies to set up, expand and diversify their global operations.\"And with the door open, major firms are likely to announce big investments this week in India, while New Delhi will talk up the opportunities in the country. AI focusAI, unsurprisingly, is going to be a big focus from three angles: infrastructure, users and talent.There is likely to be big infrastructure investment deals announced around AI data centers as demand continues to rise and tech companies thirst for more computing power. In December, Amazon, Microsoft and Intel made commitments to building AI infrastructure and chips in India. India is one of OpenAI's top markets for ChatGPT and alongside rivals like Perplexity are offering their products for free in a race to gain users and potentially lucrative data for further training. There is no major domestic rival to these U.S. chatbots, providing a good opportunity to gain users with a tech-savvy user base. And access to talent is also attractive. India is an \"AI talent factory,\" Sham Arora, chief technology officer at Tech Mahindra, told CNBC's \"Inside India\" last week. watch nowThere is an increasing number of so-called Global Capability Centers (GCCs) that are being created in India. These are effectively offshore hubs which are set up on behalf of international companies. More than 60% of GCCs established in the last 2 years are focused on AI, data, digital engineering, or product development, according to ANSR, which helps companies set up GCCs. More than 80% of GCCs expected to be set up in the next six-to-eight months are projected to be AI-led, ANSR said.But not only are tech giants looking to India for engineering talent, an increasing number of firms are also banking on the country for senior leadership roles. ANSR's Ahuja said the role of \"chief AI officer\" is becoming more common.\"And the fact that there's talent available ... those positions are now being created in India,\" Ahuja said. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Altman and Pichai among tech CEOs heading to India for major AI summit in a key market",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107236338-1771334834956-107236338-1683293634568-AP23124580482542_1.jpg?v=1771334844&w=1920&h=1080"
      ],
      "datePublished": "2026-02-17T13:17:56.000Z",
      "dateModified": "2026-02-17T13:17:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Silver miners fall in premarket trading as the metal drops 2%",
    "url": "https://www.cnbc.com/2026/02/17/silver-prices-hecla-mining-endeavour-silver.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108247087-1767194490223-gettyimages-2252745232-raa-silverpr251224_npD15.jpeg?v=1771323176&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-17T15:14:55.000Z",
    "description": "Silver bars appear in a photo illustration as silver prices move amid shifting industrial demand and global market volatility in Brussels, Belgium, on",
    "body": "Silver bars appear in a photo illustration as silver prices move amid shifting industrial demand and global market volatility in Brussels, Belgium, on December 24, 2025. Jonathan Raa | Nurphoto | Getty ImagesSilver and gold fell in early premarket trading on Tuesday as investors awaited delayed economic data, with little geopolitical news during the holiday-shortened week.Spot silver was last seen down 2% to trade at around $74.85 per ounce, while silver futures fell 4% to trade at $74.7 dollars per ounce. Hecla Mining, which owns one of the biggest silver mines in the world, Green Creek Mine in Alaska, was down 3% before the market opened. Meanwhile, Endeavour Silver shed 3.5%, First Majestic Silver was down nearly 4%, Coeur Mining lost nearly 3.4%, Teck Resources and Silvercorp Metals were roughly 3% lower, and Wheaton Precious Metals was down over 2%. Despite geopolitical tensions resurfacing in the Middle East, Deutsche Bank analysts said in a note published Tuesday that silver was \"trading $7 below its real adjusted price in 1790,\" after prices fell in the morning.Meanwhile, spot gold was down over 1% to $4,931 per ounce, and gold futures lost nearly 2% to trade at $4,952 per ounce. Silver ETFs, including ProShares Ultra Silver was down 7% in premarket, while iShares Silver Trust and ABRDN physical silver fell just over 3%, according to FactSet data. Stock Chart IconStock chart iconSilver prices.Gold and silver prices tumbled in late January as investors reacted to news that President Donald Trump had nominated Kevin Warsh to lead the Federal Reserve, leading to a stronger U.S. dollar. Silver futures plunged 30% at the time, marking their worst day since March 1980. However, the sell-off in precious metals was short-lived, with gold and silver rebounding in early February. Elsewhere, Australian global mining company BHP sealed a silver deal with Wheaton Precious Metals. The mining giant said the long-term silver streaming agreement would see BHP receive an upfront payment of $4.3 billion in exchange for delivering silver produced at its Antemina mine.watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Silver miners fall in premarket trading as the metal drops 2%",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108247087-1767194490223-gettyimages-2252745232-raa-silverpr251224_npD15.jpeg?v=1771323176&w=1920&h=1080"
      ],
      "datePublished": "2026-02-17T15:14:55.000Z",
      "dateModified": "2026-02-17T15:14:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Iran partially closes Strait of Hormuz, a vital oil choke point, as Tehran holds talks with U.S.",
    "url": "https://www.cnbc.com/2026/02/17/iran-us-strait-of-hormuz-oil-nuclear-talks-geneva.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108162405-1750689685731-108162405-1750681542505-gettyimages-1241742205-nikoubazl-iranmili190430_npxNQ.jpg?v=1771333430&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-17T15:52:07.000Z",
    "description": "Iranian Navy soldiers at an armed speed boat in Persian Gulf near the strait of Hormuz about 1320km (820 miles) south of Tehran, April 30, 2019.Mortez",
    "body": "Iranian Navy soldiers at an armed speed boat in Persian Gulf near the strait of Hormuz about 1320km (820 miles) south of Tehran, April 30, 2019.Morteza Nikoubazl | Nurphoto | Getty ImagesIran partially closed the strategically vital Strait of Hormuz on Tuesday, state media reported, citing \"security precautions\" as Tehran's Revolutionary Guard conducts military drills in the waterway.It comes as the U.S. and Iran hold talks in the Swiss city of Geneva, seeking to resolve an ongoing dispute over Tehran's nuclear program.It marks the first time Iran has shut parts of the Strait of Hormuz, a major international waterway that links crude producers in the Middle East with key markets across the globe, since U.S. President Donald Trump threatened Tehran with military action in January.Located in the gulf between Oman and Iran, the strait is recognized as one of the world's most important oil choke points.About 13 million barrels per day of crude oil transited the Strait of Hormuz in 2025, accounting for roughly 31% of global seaborne crude flows, data provided by market intelligence firm Kpler showed.Tuesday's temporary closure of the waterway was aimed at ensuring shipping safety as part of the Revolutionary Guard's \"Smart Control of the Strait of Hormuz\" drill. The exercise is designed to improve Iran's operational readiness and bolster its deterrence, among other objectives.Iran and the U.S. reached an understanding of the \"guiding principles\" during the talks, Iranian Foreign Minister Abbas Araghchi told reporters after they concluded, Reuters reported. The progress does not mean an agreement will be reached soon and more work still needs to be done, he added.watch nowEnergy market participants had been closely watching the outcome of the U.S.-Iran talks, particularly as both sides have increased their military presence in the region.Oil prices were last seen trading lower, erasing earlier gains. International benchmark Brent crude futures with April delivery fell 1.8% to $67.48 a barrel, while U.S. West Texas Intermediate futures with March delivery stood 0.4% lower at $62.65 Jakob Larsen, chief safety and security officer at Bimco, which represents global shipowners, said the temporary closure of the Strait of Hormuz was likely to cause \"minor nuisance and delays\" to inbound shipping headed for the Persian Gulf — but no major disruptions.\"The exercise establishes a live firing exercise area overlapping the inbound part of Strait of Hormuz's Traffic Separation Scheme, and requests that shipping keeps clear of the area for the duration of a few hours,\" Larsen said.\"Given the level of tension in the area, it is expected that commercial shipping will comply with the Iranian request to keep clear of the exercise area,\" he added.— CNBC's Lori Ann LaRocco and Lee Ying Shan contributed to this report.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Iran partially closes Strait of Hormuz, a vital oil choke point, as Tehran holds talks with U.S.",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108162405-1750689685731-108162405-1750681542505-gettyimages-1241742205-nikoubazl-iranmili190430_npxNQ.jpg?v=1771333430&w=1920&h=1080"
      ],
      "datePublished": "2026-02-17T15:52:07.000Z",
      "dateModified": "2026-02-17T15:52:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "ByteDance says it will add safeguards to Seedance 2.0 following Hollywood backlash",
    "url": "https://www.cnbc.com/2026/02/16/bytedance-safegaurds-seedance-ai-copyright-disney-mpa-netflix-paramount-sony-universal.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108266044-1771229974981-gettyimages-2261149851-vcg111620288212.jpeg?v=1771230010&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-17T15:23:01.000Z",
    "description": "ByteDance's new AI video model Seedance 2.0 is displayed on a smartphone screen. Vcg | Visual China Group | Getty ImagesChinese tech giant ByteDance h",
    "body": "ByteDance's new AI video model Seedance 2.0 is displayed on a smartphone screen. Vcg | Visual China Group | Getty ImagesChinese tech giant ByteDance has said it will strengthen safeguards on a new artificial intelligence video-making tool, following complaints of copyright theft from entertainment giants. The tool, Seedance 2.0, enables users to create realistic videos based on text prompts. However, viral videos shared online appear to show copyrighted characters and celebrity likenesses, raising intellectual property concerns in the U.S. \"ByteDance respects intellectual property rights and we have heard the concerns regarding Seedance 2.0,\" a company spokesperson said in a statement shared with CNBC. \"We are taking steps to strengthen current safeguards as we work to prevent the unauthorized use of intellectual property and likeness by users,\" the spokesperson added. ByteDance's response comes after receiving backlash and stern warnings from Hollywood groups like the Motion Picture Association (MPA), a trade association representing major Hollywood studios including Netflix, Paramount Skydance, Sony, Universal, Warner Bros. Discovery and Disney. The group issued a forceful public statement at the end of last week demanding that ByteDance immediately cease what it called \"infringing activity.\" \"In a single day, the Chinese AI service Seedance 2.0 has engaged in unauthorized use of U.S. copyrighted works on a massive scale,\" said MPA chairman and CEO Charles Rivkin in the statement. \"By launching a service that operates without meaningful safeguards against infringement, ByteDance is disregarding well-established copyright law that protects the rights of creators and underpins millions of American jobs.\"According to a report from Axios, Disney sent a cease-and-desist letter Friday to ByteDance, accusing the company of distributing and reproducing its intellectual property through the new AI tool without permission. The legal notice alleged that ByteDance had effectively pre-packaged Seedance with a pirated library of copyrighted characters, portraying them as if they were public-domain clip art,\" the report added. Disney has also sent cease-and-desist letters to AI companies in the past. In September, the company warned the AI startup Character.AI to stop the unauthorized use of its copyrighted characters.While trying to protect its intellectual property, Disney has signed a licensing deal with and invested in OpenAI. The agreement allows the AI company to use Disney characters from the Star Wars, Pixar and Marvel franchises in its Sora video generator.Paramount Skydance has also sent a cease-and-desist letter to ByteDance, making similar accusations, Variety reported over the weekend.watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "ByteDance says it will add safeguards to Seedance 2.0 following Hollywood backlash",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108266044-1771229974981-gettyimages-2261149851-vcg111620288212.jpeg?v=1771230010&w=1920&h=1080"
      ],
      "datePublished": "2026-02-17T15:23:01.000Z",
      "dateModified": "2026-02-17T15:23:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How Social Security Fairness Act payments may affect beneficiaries this tax season",
    "url": "https://www.cnbc.com/2026/02/11/social-security-fairness-act-taxes.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108107830-1740590530058-gettyimages-1475829656-6o6a27324.jpeg?v=1770756140&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-11T16:32:08.000Z",
    "description": "Skynesher | E+ | Getty ImagesNew laws enacted in 2025 may have a big impact on how much Social Security beneficiaries pay in taxes this season.On Jan.",
    "body": "Skynesher | E+ | Getty ImagesNew laws enacted in 2025 may have a big impact on how much Social Security beneficiaries pay in taxes this season.On Jan. 5, 2025, President Joe Biden signed the Social Security Fairness Act, a law that ended provisions that reduced or eliminated Social Security benefits for more than 2.8 million individuals who have pension income from work that did not require payment of Social Security payroll taxes. Later that year, on July 4, President Donald Trump signed the \"big beautiful\" tax package, which includes a new tax deduction of up to $6,000 per eligible senior to help offset taxes on Social Security benefits. Up to 85% of Social Security benefits may still be subject to federal tax, depending on the beneficiary's income.Together, those changes will influence the tax liabilities that Fairness Act beneficiaries face this tax season. \"If you're getting higher benefits because of the Social Security Fairness Act, some percentage of those are going to be taxable,\" said Alex Durante, senior economist at the Tax Foundation.watch nowThe monthly benefit increases for affected beneficiaries range from \"very little\" to more than $1,000, according to the Social Security Administration. In addition, affected individuals received retroactive lump-sum payments representing benefit increases to monthly checks from January 2024 onward.The tax liabilities associated with that extra benefit income may be reduced with the new senior \"bonus\" deduction, if the recipient qualifies, Durante said.To qualify for the full $6,000 deduction — or $12,000 if married filing jointly — individuals need to have a modified adjusted gross income of less than $75,000, while couples may have up to $150,000. \"They're better off because their Social Security benefit went up, and they're better off because they're basically getting a bigger deduction,\" said Karen E. Smith, a senior fellow at the Urban Institute.How the Social Security Fairness Act worksPresident Joe Biden after he signed the Social Security Fairness Act at the White House on Jan. 5 in Washington, D.C. Kent Nishimura | Getty Images News | Getty ImagesThe Social Security Fairness Act eliminated two provisions: the Windfall Elimination Provision, or WEP, that reduced Social Security benefits for people with pensions from jobs not covered by Social Security, and the Government Pension Offset, or GPO, that adjusted Social Security spousal or widower benefits for individuals who also receive pension income from jobs where Social Security taxes were not withheld.Among the more than 2.8 million people affected by those provisions are some state teachers, firefighters and police officers; federal employees covered by the Civil Service Retirement System; and workers covered by a foreign social security system, according to the Social Security Administration.Read more CNBC personal finance coverageParents with student debt face deadline to secure affordable repayment, forgivenessSecure 2.0 let employers pair emergency savings and 401(k)s, but few have done soHome sellers start getting lower prices at 70, research shows — here's whyAverage IRS tax refund is up 10.9% so far this season, early filing data showsEarly estimates point to lower Social Security COLA for 2027Senators call for longer Social Security Fairness Act lump-sum payment timelineHere's the inflation breakdown for January 2026 — in one chartAverage tax refund is up 22%, Bessent says — what filers can expect this seasonK-shaped economy looks like 'jaws of a crocodile,' economist says: Here's whyHow EPA 'endangerment finding' repeal could impact your walletMedical emergencies can lead to debt and bankruptcy — even for insured AmericansBigger tax refunds may be coming — but missing key forms could risk an auditHow Social Security Fairness Act payments may affect beneficiaries' taxesCredit card debt tops $1.28 trillion, consistent with 'K-shaped' economy: NY FedHow affordability led to a chasm between stock prices, consumer optimismStudent loan complaints at record high, CFPB finds, but agency omits detailsCNBC's Financial Advisor 100: Best financial advisors, top firms rankedThis change applies only to people who receive pension income based on work that did not include the payment of Social Security payroll taxes, according to the agency. Those individuals also qualify for Social Security benefits based on payroll taxes paid into the program through other work.Around 72% of state and local public employees were not affected by the law, as they pay Social Security taxes — and therefore will not see a benefit increase, according to SSA. What beneficiaries should know this tax seasonThis is the first tax-filing season that Social Security Fairness Act beneficiaries will see those payments in their SSA-1099s, a Social Security Administration spokesperson told CNBC via email. Those tax forms show their Social Security benefit income.The Social Security Administration has said that as of July, it completed more than 3.1 million payments totaling $17 billion to eligible Fairness Act beneficiaries. The adjustments included higher monthly benefit payments and one-time lump-sum payments.The lump-sum payments sent under the Social Security Fairness Act are generally taxed as Social Security benefits received during the tax year, and are included in the SSA-1099 statement, the SSA spokesperson said. The SSA-1099 is also sent to the IRS. Recipients of those retroactive payments may want to consider selecting a box for a \"lump-sum election\" on this year's Form 1040 or 1040-SR for seniors, according to Lawrence Pon, a certified financial planner and certified public accountant at Pon & Associates in Redwood City, Calif. Pon is also an enrolled agent, which is a tax license to practice before the IRS.watch nowBeneficiaries who received benefits that were taxable in 2025, including a lump-sum benefit payment for an earlier year, can \"reduce the taxable amount\" with the lump-sum election, according to the IRS.The lump-sum election allows beneficiaries to recalculate their taxable benefits for a prior year by subtracting the taxable benefits they previously reported, according to the IRS. The remaining amount is the taxable part of the lump-sum payment to report for 2025.Using the lump-sum election does not require a taxpayer to adjust an earlier return, nor does it require filing an amended return, according to the IRS.\"If it results in a lower tax, take advantage of it,\" Pon said. \"If it doesn't, ignore it. Don't waste your time.\"Pon's said his father, who receives a state pension from California, now receives Social Security survivor benefits because the GPO was eliminated. However, the benefit change was not automatically processed. To access the benefits, Pon's father visited a Social Security office with proof of his marriage, including past joint tax returns and their wedding album.If you think you may be eligible for higher benefits under the new law, it's worthwhile to check, he said.\"There's probably people who qualify for it and don't know about it,\" Pon said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How Social Security Fairness Act payments may affect beneficiaries this tax season",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108107830-1740590530058-gettyimages-1475829656-6o6a27324.jpeg?v=1770756140&w=1920&h=1080"
      ],
      "datePublished": "2026-02-11T16:32:08.000Z",
      "dateModified": "2026-02-11T16:32:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Used car inventory is improving, but 'affordable under-$20,000 vehicles are harder to find,' expert says",
    "url": "https://www.cnbc.com/2026/02/17/used-car-affordability.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108265842-1771014561821-gettyimages-1316556038-donedsc09361retocada.jpeg?v=1771014574&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-17T14:15:01.000Z",
    "description": "Hispanolistic | E+ | Getty ImagesEven as experts anticipate more supply in the used car market this year, consumers probably won't see much relief on ",
    "body": "Hispanolistic | E+ | Getty ImagesEven as experts anticipate more supply in the used car market this year, consumers probably won't see much relief on pricing.While dealer inventories continue to slowly improve, the higher-cost mix of vehicles hitting the used car market — and wholesale prices that ticked higher in January — could limit how much that added supply translates into cheaper cars.Although the consumer price index shows that prices for used cars were down 1.8% in January from December and 2% from a year earlier, they're easing off record highs. The average price of a used car up to 8 years old was $30,202 in 2025, up 27.6% from $23,668 in 2020, according to J.D. Power.\"The affordable under-$20,000 vehicles are harder to find,\" said Jonathan Banks, a vice president with J.D. Power.Read more CNBC personal finance coverageParents with student debt face deadline to secure affordable repayment, forgivenessSecure 2.0 let employers pair emergency savings and 401(k)s, but few have done soHome sellers start getting lower prices at 70, research shows — here's whyAverage IRS tax refund is up 10.9% so far this season, early filing data showsEarly estimates point to lower Social Security COLA for 2027Senators call for longer Social Security Fairness Act lump-sum payment timelineHere's the inflation breakdown for January 2026 — in one chartAverage tax refund is up 22%, Bessent says — what filers can expect this seasonK-shaped economy looks like 'jaws of a crocodile,' economist says: Here's whyHow EPA 'endangerment finding' repeal could impact your walletMedical emergencies can lead to debt and bankruptcy — even for insured AmericansBigger tax refunds may be coming — but missing key forms could risk an auditHow Social Security Fairness Act payments may affect beneficiaries' taxesCredit card debt tops $1.28 trillion, consistent with 'K-shaped' economy: NY FedHow affordability led to a chasm between stock prices, consumer optimismStudent loan complaints at record high, CFPB finds, but agency omits detailsCNBC's Financial Advisor 100: Best financial advisors, top firms rankedThat's likely to remain the case even as inventory improves. \"You'll see a richer mix of vehicles,\" Banks said. \"That's just the reality of it.\"The share of under-$20,000 cars was 30% in 2025, down from 53% in 2019, according to J.D. Power.Because consumers have been hanging on to their cars for longer, today's higher prices may be a bit of a shock for them, Banks said.\"A lot of people will be coming into the market when they haven't been there in a long time,\" he said.Used car financing is a pain pointAlthough used car prices have eased, they remain elevated against a backdrop of a broader household affordability crunch. Many consumers are already struggling to keep up with high costs for everyday things like housing, groceries and insurance premiums.Compared with the average price paid for a new car — $49,191, according to Kelley Blue Book — the used car market may be the more desirable option.However, the cost of financing a used car is also a pain point. Interest rates generally are higher compared with those that apply to new car loans, which can be especially costly for consumers with poor credit. For credit scores ranging from 501 to 600, the average interest rate for used car loans was 19% in the third quarter of 2025, according to Experian. That's compared with an average of 7.43% for consumers with a score of 781 to 850.The average amount financed for a used vehicle in January was $29,364 and the average interest rate was 10.5%, according to Edmunds. If that amount were financed at that interest rate over 72 months — the average is 69.7 months — the monthly payment would be $551, and the interest paid over the full life of the loan would be $10,339, according to Bankrate's auto loan calculator. That would push the total amount paid for the car to $39,703.Separately, a small but growing share of consumers are taking out used car loans with a monthly payment of $1,000 or more, according to Edmunds. In the final quarter of 2025, 6.3% of buyers committed to a payment of that amount, compared with 6.1% in the third quarter and 5.4% in the fourth quarter of 2024.Growing inventory, possible discountsThe variety of available used vehicles reflects what's been purchased in the new car market over time. Consumers have preferred SUVs and trucks over sedans for years. Last year, sedans accounted for just 17% of the new car market, according to Edmunds. In 2015, that share was above 40%.A greater number of vehicles are coming off of three-year leases this year compared with last year due to higher lease volume in 2023 than in 2022, said Ivan Drury, director of insights for Edmunds. Additionally, a growing number of fleet vehicles — for example, rental cars — should hit the used car market this year as that supply also continues recovering from pandemic-era disruptions.watch nowAs carmakers boost the number of deals they're offering on new autos, used car shoppers may benefit as well, Drury said. \"When we start to see discounts on the new cars, it trickles down to used cars,\" he said.If it's been a while since you bought a vehicle, brush up on the best strategies for buying a used car. \"Do your due diligence,\" Banks said. Some strategies he recommends:Look at certified preowned vehicles. \"You may be able to get a late-model vehicle with low mileage and a warranty,\" he said.Make sure you trust the dealer and have fully vetted the car you want to buy, he said. You can check a car's history on sites like Carfax or AutoCheck for a fee ranging from about $10 to $45.Research how much your trade-in is worth and shop it around. \"As a consumer, leverage the availability of data,\" Banks said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Used car inventory is improving, but 'affordable under-$20,000 vehicles are harder to find,' expert says",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108265842-1771014561821-gettyimages-1316556038-donedsc09361retocada.jpeg?v=1771014574&w=1920&h=1080"
      ],
      "datePublished": "2026-02-17T14:15:01.000Z",
      "dateModified": "2026-02-17T14:15:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump's 'no tax on overtime' deduction could be tricky this season — how to claim it",
    "url": "https://www.cnbc.com/2026/02/17/no-tax-on-overtime-deduction.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108265047-1770911735831-gettyimages-672160909-bld232449.jpeg?v=1770911749&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-17T15:42:24.000Z",
    "description": "Jetta Productions Inc | Digitalvision | Getty ImagesIf you earned overtime pay in 2025, you could see a bigger refund during the 2026 filing season ba",
    "body": "Jetta Productions Inc | Digitalvision | Getty ImagesIf you earned overtime pay in 2025, you could see a bigger refund during the 2026 filing season based on a new tax break enacted via President Donald Trump's \"big beautiful bill.\" But missing details on tax forms, such as on your W-2 from an employer, could be confusing when filing returns this year, experts say.   The \"no tax on overtime\" deduction allows certain workers to deduct up to $12,500 for single filers or $25,000 for married couples filing jointly per year from 2025 through 2028. The tax break starts to phase out, or get smaller, when earnings exceed $150,000 for single filers or $300,000 for joint filers.Read more CNBC personal finance coverageParents with student debt face deadline to secure affordable repayment, forgivenessSecure 2.0 let employers pair emergency savings and 401(k)s, but few have done soHome sellers start getting lower prices at 70, research shows — here's whyAverage IRS tax refund is up 10.9% so far this season, early filing data showsEarly estimates point to lower Social Security COLA for 2027Senators call for longer Social Security Fairness Act lump-sum payment timelineHere's the inflation breakdown for January 2026 — in one chartAverage tax refund is up 22%, Bessent says — what filers can expect this seasonK-shaped economy looks like 'jaws of a crocodile,' economist says: Here's whyHow EPA 'endangerment finding' repeal could impact your walletMedical emergencies can lead to debt and bankruptcy — even for insured AmericansBigger tax refunds may be coming — but missing key forms could risk an auditHow Social Security Fairness Act payments may affect beneficiaries' taxesCredit card debt tops $1.28 trillion, consistent with 'K-shaped' economy: NY FedHow affordability led to a chasm between stock prices, consumer optimismStudent loan complaints at record high, CFPB finds, but agency omits detailsCNBC's Financial Advisor 100: Best financial advisors, top firms rankedFor 2025, your employer isn't required to separate overtime from regular pay on Forms W-2, 1099-NEC or 1099-MISC. That means you'll need to calculate qualified overtime on your own during the 2026 season.   \"Treasury gave employers a year off [from reporting],\" said certified financial planner Micha Siegel, founder of TaxCentric, an advisory firm in Fair Lawn, New Jersey. \"But that makes it really hard for taxpayers.\"As a result, many workers will have to use pay stubs to figure out their overtime deduction for 2025, said Siegel, who is also a certified public accountant. Who qualifies for 'no tax on overtime' deductionThe \"no tax on overtime\" deduction applies to non-exempt workers with earnings covered under the Fair Labor Standards Act, or FLSA. The law generally includes workers who must receive at least 1.5 times their normal pay rate once they exceed 40 hours per week. However, this definition excludes some workers covered by state or labor contract mandates, according to the IRS.You can only deduct the portion of overtime pay that exceeds your regular rate. For example, if your overtime rate is 1.5 times your normal rate, you can deduct the one-half portion up to the yearly limits. How to calculate the 'no tax on overtime' deduction This season, it could be tricky to figure out your 2025 overtime deduction without details separately reported on your tax forms, experts say.  Some employers will report the number in box 14 of your W-2, \"but only the nice ones,\" said Siegel from TaxCentric.If the figure isn't shown on your W-2, you'll need to find overtime totals via company payroll software or on your pay stubs. That should provide a starting point to calculate the deduction.   watch nowIn some cases, you could see the \"overtime premium\" separated from regular compensation on pay stubs or in payroll software. Other employers may only report a year-end lump sum, which requires some math, depending on your overtime rate, according to the IRS. Here's the calculation: for 1.5 times regular pay, divide the lump sum by 3for 2.0 times regular pay, divide the lump sum by 4\"Starting with that year-end pay stub will be really, really helpful,\" said Tom O'Saben, director of tax content and government relations at the National Association of Tax Professionals. Regardless of your overtime deduction, it's important to save paperwork to support the tax break on your return, just in case the IRS has questions later, O'Saben said. watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump's 'no tax on overtime' deduction could be tricky this season — how to claim it",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108265047-1770911735831-gettyimages-672160909-bld232449.jpeg?v=1770911749&w=1920&h=1080"
      ],
      "datePublished": "2026-02-17T15:42:24.000Z",
      "dateModified": "2026-02-17T15:42:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rev. Jesse Jackson, civil rights leader and former presidential candidate, dies at 84",
    "url": "https://www.cnbc.com/2026/02/17/jesse-jackson-dead.html",
    "image": "https://image.cnbcfm.com/api/v1/image/106967111-1635434393186-gettyimages-453740042-Anadolu_17082014-America-_26.jpeg?v=1771329050&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-17T15:09:36.000Z",
    "description": "watch nowThe Rev. Jesse Jackson, a civil rights icon, Baptist minister and two-time Democratic presidential candidate, died Tuesday at age 84.The Jack",
    "body": "watch nowThe Rev. Jesse Jackson, a civil rights icon, Baptist minister and two-time Democratic presidential candidate, died Tuesday at age 84.The Jackson family confirmed his passing in a statement on Tuesday morning.\"Our father was a servant leader — not only to our family, but to the oppressed, the voiceless, and the overlooked around the world,\" his family said.\"We shared him with the world, and in return, the world became part of our extended family. His unwavering belief in justice, equality, and love uplifted millions, and we ask you to honor his memory by continuing the fight for the values he lived by.\" He died peacefully surrounded by his family on Tuesday morning, the family said in their statement. Jackson is survived by his wife, Jacqueline, six children and multiple grandchildren.The civil rights leader spent decades in the public eye fighting to end racial and class divisions in America.A protege of Martin Luther King Jr., Jackson fought on the front lines of the battle against Jim Crow segregation laws as a college student. He stood out for his rousing speeches, radical ideas and passion for racial equality. Jackson would become a key figure in the civil rights movement that pressed for broader economic opportunities for Black people through the Southern Christian Leadership Conference, or SCLC, and more recently, his organization the Rainbow PUSH coalition. Mahalia Jackson, left, sings \"We Shall Overcome\" with civil rights leaders the Rev. Martin Luther King, third left, Jesse Jackson, second from right, and Albert Raby, right, on Aug. 4, 1966.Ray Foster | Tribune News Service | Getty ImagesJackson eventually transitioned into politics. In 1984 and 1988, he ran for the Democratic presidential nomination, winning multiple primaries and surpassing expectations each time. He based his campaigns on expanded equality for various racial minority groups, the working class and women.Later, Jackson served as U.S. special envoy to Africa in the 1990s. He also acted as \"shadow senator\" for Washington, D.C., a role in which he lobbied for the district's statehood.During the 1980s and 1990s, Jackson also negotiated the release of dozens of international hostages and prisoners, and became a vocal supporter of voting and LGBTQ rights. Participants carry a banner during the Gay Rights March April 25, 1993 in Washington, DC. Over 500,000 gays, lesbians and bisexual activists and their friends and families participated in the largest gathering of gay men and lesbians in history organized to end discrimination.Porter Gifford | Hulton Archive | Getty ImagesHe was no stranger to controversy. During the 1984 presidential primary, he referred to Jews with the slur \"Hymies\" and called New York \"Hymietown\" in remarks he at first denied and later apologized for. \"Saturday Night Live\" lampooned the incident in a sketch featuring Eddie Murphy playing Jackson. And, in a testament to his stature in American political and popular culture, Jackson himself hosted \"SNL\" later that year.In 2001, he admitted to having an extramarital affair that led to the birth of a daughter.Jackson had been fighting Parkinson's disease since November 2017. In August 2021, he and his wife were hospitalized with Covid-19 at Northwestern Memorial Hospital in Chicago. He was discharged in September after receiving successful treatment for the virus and Parkinson's disease. While Jackson had largely been absent from the political and civil rights main stage in recent years, he had taken every opportunity to renew pushes for equality. Cleveland Mayor Carl Stokes (L) and Reverend Jesse Jackson, national head of Operation Breadbasket, chat together before Mayor Stokes delivered an address in connection with the Black Expo in Chicago. Mayor Stokes called for a \"black political strategy for 1972\" which \"may mean the actual running of a black person for president.\"Bettmann | Getty Images\"If we played the big game, and the rules are not fair, and goals not clear and public, we would protest, but in politics we seem to make it alright, it's not alright,\" said Jackson in a 2018 podcast appearance. \"We want a system that's fair, and fairly applied. Americans want and deserve an even playing field with equal protection under the law, equal access and fairness.\"His family said Tuesday that it was his \"unwavering commitment to justice, equality and human rights\" that helped shape \"a global movement for freedom and dignity.\"\"A tireless change agent, he elevated the voices of the voiceless—from his Presidential campaigns in the 1980s to mobilizing millions to register to vote—leaving an indelible mark on history,\" the statement said.Roots of Jackson's activism Jesse Louis Jackson was born Oct. 8, 1941, in Greenville, South Carolina, to Helen Burns and Noah Louis Robinson, a married man and former professional boxer. A year after Jackson was born, his mother married Charles Henry Jackson, a post office worker who later adopted him when he was 15.Jackson grew up being taunted by other school children for his out-of-wedlock birth, which he said ultimately became his motivation to succeed. The Reverend Jesse Jackson speaking to crowd in Chicago in Sept. 1969.Bettmann | Getty Images''It is where I get the drive to think I could change the South through the civil rights movement and run for President,'' Jackson told The New York Times in 1997. As a child, Jackson would know the harsh reality of the Jim Crow era, growing up at a time when racial segregation was in full force across the U.S. He attended all-Black public schools and was taught to sit at the back of buses and use \"colored\" restrooms and drinking fountains. After graduating from Greenville's Sterling High School in 1959, Jackson spent a year at the University of Illinois at Urbana-Champaign. He then transferred to North Carolina Agricultural and Technical College, or A&T, a historically Black school in Greensboro, North Carolina. It was during his time at A&T that he first became active in the civil rights movement. Jackson joined the local Congress of Racial Equality chapter in Greensboro and participated in local protests and sit-ins against segregated public facilities. \"I came out of Greensboro,\" Jackson told the Greensboro News & Record in 2015. \"It was my launching pad. All that I subsequently became in the movement came out of the lessons I learned in Greensboro.\"After being barred from accessing books at the public library and placed in jail for trying to use the same library for class work, Jackson said he felt the \"insult of segregation\" and the \"liberating power of going to jail for dignity,\" according to the News & Record. While home from college, he became a part of the Greenville Eight, a group of Black students who in 1960 protested the South Carolina city's segregated library system. Jackson and seven Black high school students refused to leave the whites-only Hughes Main Library and were arrested for \"disorderly conduct.\"Following their staged sit-in, the library system of the city became racially integrated.It marked the beginning of what would become a lifetime career of civil rights activism. Fighting for Civil Rights in the SCLC After graduating from A&T in 1964, Jackson pursued divinity studies at the Chicago Theological Seminary and began to organize student support for Martin Luther King Jr. Crowds in Memphis, Tennessee, following the assassination of civil rights leader Martin Luther King Jr in the city, 8th April 1968. In the centre, from left to right are singer Harry Belafonte, Coretta Scott King with Jesse Jackson behind, Reverend Ralph Abernathy and Reverend Andrew Young.Santi Visalli | Archive Photos | Getty ImagesOn March 7, 1965, a day that would become known as Bloody Sunday, Jackson watched on television as club-wielding Alabama state troopers fired tear gas and charged at hundreds of nonviolent demonstrators who had just crossed the Edmund Pettus Bridge in Selma, Alabama. The demonstrators were part of the historic marches from Selma to the Alabama capital of Montgomery to fight for Black civil and voting rights. A day after witnessing the violence on television, Jackson organized a caravan of seminary students to drive down to Alabama and join King in the Selma-to-Montgomery marches.Jackson appeared at several commemorations of the marches, including an event hosted by former President Bill Clinton on the Edmund Pettus Bridge in 2000.  Reverend Jesse Jackson (2nd L), Coretta Scott King (3rd L), US President Bill Clinton (4th L) and US Rep. John Lewis (5th L) walk arm-and-arm over the Edmund Pettus Bridge 05 March 2000 in Selma, Alabama, to commemorate the 35th anniversary of the 1965 Voting Rights March.Stephen Jaffe | AFP | Getty Images\"The blood of Selma set all of us free,\" Jackson said at the event, surrounded by several prominent civil rights leaders and then-President Clinton. \"How can I forget that season? My first-born son Jesse Jr. was born when we were marching here, I almost named him Selma.\" \"In Selma, America was reborn, democracy redefined, human rights redefined. The fruits of Selma are bountiful. And so today, we say to all of America, America won. One flag, one nation,\" Jackson said, drawing roaring applause. \"Not the flag of sedition and slavery and segregation. But one America, one flag.\"Impressed by Jackson's passion and organizational abilities during the marches, King gave him a staff position at the SCLC, the civil rights organization that King led until his death. Just three courses short of finishing his studies at the seminary, Jackson dropped out to pursue a full-time career in civil rights. Though he still became an ordained Baptist minister in 1968. In 1966, he was placed in charge of the Chicago branch of Operation Breadbasket, an SCLC initiative that monitored white companies' treatment of Black people and organized boycotts calling for fair hiring practices. While Jackson was seen by some in the SCLC as a \"loose cannon\" who worked too independently of others in the organization, his leadership was integral to the Chicago branch's success. Under Jackson, the Operation Breadbasket branch won 2,000 new jobs worth $15 million a year in new income to the Black community. He was promoted to national director of Operation Breadbasket in 1968, the same year King was assassinated in Memphis, Tennessee. Jackson was a floor below King when he was shot dead at the Lorraine Motel on April 4, though he told reporters that the civil rights leader died in his arms, a claim that several King aides have disputed. Rev. Jesse Jackson visits the balcony outside room 306 at the Lorraine Motel, where he was when Dr. Martin Luther King, Jr. was assassinated, on April 3, 2018 in Memphis, Tennessee.Joe Raedle | Getty Images\"Every time I go back, it pulls a scab off and the wound is still raw. Every time, the trauma of the incident. His lying there. Blood everywhere. It hurts all the time,\" Jackson said in a 2018 interview with CNN. Jackson was embroiled in controversy after the assassination, with other SCLC leaders accusing him of using the organization and King's death for self-promotion. Ralph Abernathy, King's successor as chairman of the SCLC, told The New York Times in 1977, \"I hope God has forgiven [Jackson.]\"In 1971, Jackson formally resigned from the SCLC and founded Operation PUSH, or People United to Serve Humanity — his own Chicago-based civil rights organization that aimed to improve the economic conditions of Black communities across the U.S. Twenty-five years later, it would merge with the National Rainbow Coalition, Jackson's other civil rights organization that sought equal rights for the working class, women and racial minority groups. The Reverend Jesse Jackson Sr. delivers remarks 15 January 2008 on Dr. Martin Luther King's approaching birthday and recent comments by US democratic presidential candidates at the National Press Club in Washington, DC.Paul J. Richards | AFP | Getty ImagesSince its establishment, Jackson has served as president of the Rainbow PUSH Coalition, which aims to \"protect, defend, and gain civil rights by leveling the economic and educational playing fields,\" according to its website. Entering the political fieldJackson's fame would escalate in 1984 when he ran for the Democratic presidential nomination, becoming the second Black American to launch a nationwide campaign for president. While pundits dismissed his candidacy, Jackson had a surprisingly strong run. Politician Jesse Jackson delivers a speech during his 1984 presidential campaign in Chicago, Illinois.David Hume Kennerly | Hulton Archive | Getty ImagesHe came in third in the competitive race for the Democratic nomination as Walter Mondale became the nominee, and would exceed expectations again when he ran for president a second time. In 1988, Jackson came in second behind nominee Michael Dukakis. But his unsuccessful presidential campaigns were not the end of his political career. In 1991, Jackson won election to an unpaid office of \"statehood senator,\" popularly known as \"shadow senator,\" to lobby the U.S. Congress for statehood for the District of Columbia. ″Why D.C. statehood? Why not mayor?″ Jackson asked at a gathering of Democratic women in July 1990, The Associated Press reported. ″Because my life commitment is to expand democracy. My quest is not employment. It's empowerment.″US President Bill Clinton (R) presents the Rev. Jesse Jackson (L) with the Presidential Medal of Freedom in the East Room of the White House 09 August, 2000 in Washington, DC.Tim Sloan | AFP | Getty ImagesHe would serve as a \"shadow senator\" until getting tapped by then-President Clinton to become the U.S. special envoy to Africa in 1997. \"What joy, what privilege, what responsibility,\" Jackson said at his swearing-in ceremony. \"I called my mother; we prayed.\"\"It is quite a journey from Haynie Street in Greenville, South Carolina. A happy home, but an environment of such low expectations, where our family was denied the right to vote, even though my father was an honorably discharged veteran of the army,\" Jackson said. \"From that to an assignment by the President and Secretary of State, to in some small measure, to help shape our foreign policy by building bridges between the U.S. and Africa.\"On several occasions, Jackson also worked independently to secure the release of prisoners held by anti-American regimes. Jesse Jackson (left), Baptist minister and candidate for the Democratic presidential nomination in 1984, attends a press conference with Cuban dictator Fidel Castro during Jackson's visit to Cuba.Jacques M. Chenet | Corbis Historical | Getty ImagesHe frustrated President Ronald Reagan's administration by traveling to Syria in 1983 to seek the release of a U.S. fighter pilot who had been held hostage by the Syrian government. That same year, he negotiated the release of 48 American and Cuban prisoners held hostage by the communist Cuban government. And in 1991, Jackson worked to free several hundred citizens hiding in Iraq and Kuwait before the Persian Gulf War. Jackson also advocated for the LGBTQ community when few prominent Democrats dared to do so, becoming the first speaker at a Democratic National Convention to mention gay and lesbian Americans.He has been a long champion of voting rights as well. In August, he and others were arrested outside the U.S. Capitol during a demonstration calling for the end to the filibuster. \"Black and Brown people are the base of the party. We're not the bottom. We're the foundation,\" Jackson told the crowd, according to The Washington Post. \"If we lose, they lose. If we lose, democracy loses. If we lose, Democrats lose. If we lose, the nation loses.\"Reverend Jesse Jackson delivers a speech as Americans shout slogans and hold banners during a demonstration against the death of eighteen-year-old unarmed teen Michael Brown in Ferguson, Missouri on August 16, 2014.Bilgin Sasmaz | Anadolu Agency | Getty Images",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rev. Jesse Jackson, civil rights leader and former presidential candidate, dies at 84",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/106967111-1635434393186-gettyimages-453740042-Anadolu_17082014-America-_26.jpeg?v=1771329050&w=1920&h=1080"
      ],
      "datePublished": "2026-02-17T15:09:36.000Z",
      "dateModified": "2026-02-17T15:09:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]