[
  {
    "title": "'Forever layoffs' and disengagement for some, pay bumps for others: What's in store for the 2026 workplace, says new report",
    "url": "https://www.cnbc.com/2025/11/12/glassdoor-report-in-2026-forever-layoffs-for-some-pay-bumps-for-others.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108224548-1762901853822-gettyimages-2157249623-srp03361.jpeg?v=1762901870&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-12T19:08:57.000Z",
    "description": "For weeks now, it seems like every few days another major company announces a layoff impacting hundreds, if not thousands, of its employees.These big ",
    "body": "For weeks now, it seems like every few days another major company announces a layoff impacting hundreds, if not thousands, of its employees.These big cuts get a lot of attention, but under the surface another problem is brewing: Smaller-scale firings of less than 50 people are now the most common type of layoff throughout the year, making up 51% of WARN Act notices in 2025 compared with just 38% in 2015.Translation: The \"forever layoff\" is here, according to Glassdoor's latest report on 2026 work trends.These smaller but more regular firings could continue to stoke worker anxiety heading into the next year.Layoffs hit company culture for yearsRolling layoffs could help companies stay out of headlines, researchers note, but \"create cultures of anxiety, insecurity and resentment.\"Previous Glassdoor research found that after a layoff, negative sentiments from remaining employees took more than two years to recover, based on their company ratings. Repeated layoffs have double the impact on employee sentiment right after a second round of cuts, with the biggest drops for key talent, managers and new hires.Another sign of workers' dissatisfaction: Glassdoor ratings of senior leaders have been slipping since the second half of 2023 and are now well below their pandemic peaks.Workers in media and communication; management and consulting; and technology saw the biggest drops in confidence in their leadership. Glassdoor researchers point to AI business disruptions, media consolidations and a return to hustle culture ideals in tech as prime reasons for these declines.Meanwhile, a growing share of users mention words like misalignment, distrust, miscommunication, disconnection and hypocrisy since 2024 in Glassdoor reviews that mention their senior leadership or management.Silver lining for young job-seekersOutside of the layoff forecast, there's good news for some: Wage growth is on the upswing for young workers with up to four years' work experience, giving them more spending power in 2026.New grads have struggled over the last year to jumpstart their careers given the low hiring environment and businesses adopting AI, which has led many to open fewer entry-level roles. But for those who can secure a role, the pay will be better.Young workers in some rising cities will see the biggest difference. Provo, Utah; Boise, Idaho; Orlando, Fla.; Charleston, S.C.; and Austin, Texas are among the locations with the highest wage growth since 2020, according to Glassdoor.\"For early career workers considering where to pursue their next career step, these rising cities represent good opportunities to grow your earnings even though they may not offer the highest salaries,\" Glassdoor researchers wrote.Want to level up your AI skills? Sign up for Smarter by CNBC Make It's new online course, How To Use AI To Communicate Better At Work. Get specific prompts to optimize emails, memos and presentations for tone, context and audience.Plus, sign up for CNBC Make It's newsletter to get tips and tricks for success at work, with money and in life, and request to join our exclusive community on LinkedIn to connect with experts and peers.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Forever layoffs' and disengagement for some, pay bumps for others: What's in store for the 2026 workplace, says new report",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108224548-1762901853822-gettyimages-2157249623-srp03361.jpeg?v=1762901870&w=1920&h=1080"
      ],
      "datePublished": "2025-11-12T19:08:57.000Z",
      "dateModified": "2025-11-12T19:08:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "White House says October jobs and inflation data may never be released because of the shutdown",
    "url": "https://www.cnbc.com/2025/11/12/white-house-october-data-release.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108224730-1762975391290-108224730-1762953271298-gettyimages-2245734043-AA_12112025_2515652.jpg?v=1762975402&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-12T19:58:17.000Z",
    "description": "White House Press Secretary Karoline Leavitt speaks during the daily press briefing in the Brady Press Briefing Room at the White House on Nov. 12, 20",
    "body": "White House Press Secretary Karoline Leavitt speaks during the daily press briefing in the Brady Press Briefing Room at the White House on Nov. 12, 2025 in Washington, DC. Win McNamee | Getty ImagesKey economic reports for October may not be released at all because of the government shutdown, a senior White House official said Wednesday.With the spending impasse appearing to be near an end, White House press secretary Karoline Leavitt told reporters that part of the fallout could be lasting damage to the government's data collection ability.\"The Democrats may have permanently damaged the Federal Statistical system with October CPI and jobs reports likely never being released,\" Leavitt said. \"All of that economic data released will be permanently impaired, leaving our policymakers at the Fed, flying blind at a critical period.\"Release of important economic data has been at the forefront of Wall Street concerns as the shutdown dragged on for more than six weeks, the longest in history.Among the most important releases are the monthly nonfarm payrolls count and the consumer price index, both of which come from the Labor Department's Bureau of Labor Statistics. Other data impacted includes retail sales, import and export data as well as consumer spending and income.Most Wall Street economists have been expecting all of the data to be released, albeit delayed. However, Leavitt's comments cast doubt on whether that will happen.\"The Democrat shutdown made it extraordinarily difficult for economists, investors and policymakers at the Federal Reserve to receive critical government data,\" Leavitt said.Leavitt added that the shutdown could lower fourth-quarter economic growth by up to 2 percentage points. Earlier in the afternoon, Kevin Hassett, director of the National Economic Council, said the impasse might shave up to 1.5 percentage points from current-quarter GDP.\"For sure, it's going to have an impact on this quarter,\" Hassett said during an appearance at the Economic Club of Washington, D.C.However, most economists expect the impact to be minimal.Goldman Sachs, in fact, raised its estimates for GDP heading into the end of the year. The firm boosted its Q3 outlook slightly to 3.7% and raised its full-year forecast to 1.3%, a change of 0.3 percentage point.On the issue of data collection, Goldman's economists said they expect the shutdown to have \"a limited impact\" on the quality of jobs data.As for timing, Citigroup economists on Wednesday speculated that the September nonfarm payrolls report could be released as early as Friday but more likely in the early part of next week. They said it could take until early December to put together the October count.Jobs report data should be easy to collect belatedly because it involves asking business for hard numbers, according to Jeffrey Roach, chief economist at LPL Financial. In fact, he said the BLS could likely get multiple months' worth of data during one collection period if needed.But he said it's harder to get information from everyday people because it requires asking them about their willingness to work during a period that has already passed.\"It's just the more nuanced qualitative surveys that cannot be replicated,\" Roach said. \"The water has gone under that bridge already.\"Roach said previous shutdowns have mostly only resulted in delays of the release of data that the government had already collected. But he said this closure lasted long enough to also keep agencies closed during what would have been their collection periods for these reports.— CNBC's Alex Harring contributed.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "White House says October jobs and inflation data may never be released because of the shutdown",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108224730-1762975391290-108224730-1762953271298-gettyimages-2245734043-AA_12112025_2515652.jpg?v=1762975402&w=1920&h=1080"
      ],
      "datePublished": "2025-11-12T19:58:17.000Z",
      "dateModified": "2025-11-12T19:58:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Firefly Aerospace shares jump 15% on strong revenues, boosted guidance",
    "url": "https://www.cnbc.com/2025/11/12/firefly-aerospace-fly-q3-earnings-2025.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108183148-1754585171199-gettyimages-2228207223-FIREFLY_IPO.jpeg?v=1762984969&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-13T04:17:34.000Z",
    "description": "Jason Kim, chief executive officer of Firefly Aerospace, center, during the company's initial public offering at the Nasdaq MarketSite in New York, US",
    "body": "Jason Kim, chief executive officer of Firefly Aerospace, center, during the company's initial public offering at the Nasdaq MarketSite in New York, US, on Thursday, Aug. 7, 2025. Michael Nagle | Bloomberg | Getty ImagesFirefly Aerospace's stock surged 15% on Wednesday after the space technology company issued better-than-expected third-quarter results and lifted its guidance.Revenues in the third quarter jumped nearly 38% to $30.8 million from $22.4 million in the year-ago period and nearly doubled from the previous quarter.Firefly's net loss totaled $140.4 million, or $1.50 per share. The company said net loss included costs tied to its IPO, foreign exchange and executive severanceThe company also lifted its outlook for the year, saying it now expects revenues to range between $150 million and $158 million. That's up from previous guidance in the range of $133 million and $145 million.This is Firefly's second quarterly report as a public company. Last quarter, shares slumped after it posted a bigger loss and lower revenues than analysts were expecting. The Cedar Park, Texas, company went public on the Nasdaq in August during a period of heightened enthusiasm toward space technology. The U.S. government and NASA have leaned on more contracts with companies like Firefly and Elon Musk's SpaceX to support moon missions.But shares of Firefly have lost 70% of their value since their opening day close, and the company's market capitalization has plummeted from about $8.5 billion to about $2.7 billion on Wednesday.In September, Firefly shares sank after a rocket exploded during a ground test at the company's Texas facility, days after receiving clearance from the Federal Aviation Administration over a separate incident. Firefly has since put \"corrective measures\" in place, the company said on Wednesday. Shares dropped 35% in September and are down 24% this month.Firefly in July won a nearly $177 million contract with NASA for an upcoming moon mission, and in October, it announced its acquisition of defense tech firm SciTec to boost its national security portfolio.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Firefly Aerospace shares jump 15% on strong revenues, boosted guidance",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108183148-1754585171199-gettyimages-2228207223-FIREFLY_IPO.jpeg?v=1762984969&w=1920&h=1080"
      ],
      "datePublished": "2025-11-13T04:17:34.000Z",
      "dateModified": "2025-11-13T04:17:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Toyota opens new U.S. battery plant, confirms $10 billion in new investments",
    "url": "https://www.cnbc.com/2025/11/12/toyota-battery-plant-north-carolina.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108224954-1762974033885-gettyimages-2245822324-TOYOTA_BATTERY_MANUFACTURING.jpeg?v=1762974166&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-12T19:07:51.000Z",
    "description": "Toyota's battery manufacturing plant in Liberty, North Carolina, US, on Wednesday, Nov. 12, 2025. Allison Joyce | Bloomberg | Getty ImagesToyota Motor",
    "body": "Toyota's battery manufacturing plant in Liberty, North Carolina, US, on Wednesday, Nov. 12, 2025. Allison Joyce | Bloomberg | Getty ImagesToyota Motor on Wednesday said it has started production at a new $13.9 billion battery plant in North Carolina and confirmed plans to invest up to $10 billion more than previously expected over the next five years in the United States.The Japanese automaker did not release details about the increased investment other than Toyota Motor North America CEO Tetsuo Ogawa calling it a \"pivotal moment\" in the company's history along with the new battery plant, according to a release.The facility is Toyota's first in-house battery plant outside of Japan. It was first announced in December 2021 amid the Biden administration's push to onshore production of batteries for hybrids and all-electric vehicles.Since then, market conditions for EVs have soured, while demand for hybrids continues to grow exponentially. Those changes are positive for Toyota, which is the U.S. leader in hybrid sales with a more than 51% market share through the third quarter of this year, according to Motor Intelligence data.It's unclear how much of the investment was already planned but not made previously public, but the announcement follows President Donald Trump last month saying Toyota would invest $10 billion in the U.S.Toyota and the entire automotive industry have been attempting to navigate production plans amid regulatory changes impacting EVs and Trump's litany of tariffs on new vehicles and parts.Toyota's U.S. sales through the third quarter of this year were up 9.9% to more than 1.3 million vehicles sold.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Toyota opens new U.S. battery plant, confirms $10 billion in new investments",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108224954-1762974033885-gettyimages-2245822324-TOYOTA_BATTERY_MANUFACTURING.jpeg?v=1762974166&w=1920&h=1080"
      ],
      "datePublished": "2025-11-12T19:07:51.000Z",
      "dateModified": "2025-11-12T19:07:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Boston Fed President Collins advocates holding rates steady, sees 'high bar' for further cuts",
    "url": "https://www.cnbc.com/2025/11/12/boston-fed-president-collins-advocates-holding-rates-steady-sees-high-bar-for-further-cuts.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108225045-1762981409598-gettyimages-2230615538-FED_SYMPOSIUM.jpeg?v=1762981480&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-12T21:05:40.000Z",
    "description": "Susan Collins, president and chief executive officer of the Federal Reserve Bank of Boston, during a Bloomberg Television interview at the Kansas City",
    "body": "Susan Collins, president and chief executive officer of the Federal Reserve Bank of Boston, during a Bloomberg Television interview at the Kansas City Federal Reserve's Jackson Hole Economic Policy Symposium in Moran, Wyoming, US, on Friday, Aug. 22, 2025. David Paul Morris | Bloomberg | Getty ImagesBoston Federal Reserve President Susan Collins on Wednesday said she will be reluctant to support further interest rate cuts anytime soon with inflation still high and policymakers hampered by a lack of data due to the government shutdown.\"Given my baseline outlook, it will likely be appropriate to keep policy rates at the current level for some time to balance the inflation and employment risks in this highly uncertain environment,\" the central bank official said in remarks delivered in her home district. \"I see several reasons to have a relatively high bar for additional easing in the near term.\"Collins's comments are notable because she is a voting member of the rate-setting Federal Open Market Committee. Her remarks put her on the hawkish side of the rate debate, highlighting a fissure among committee members that led Chair Jerome Powell to say in October that a cut at the December meeting is not a foregone conclusion, despite market pricing of a high probability.Collins supported the quarter percentage point rate cut at the October meeting but indicated that further easing could thwart the Fed's efforts to get inflation lower.While Collins said softness in the labor market \"bears watching,\" she added that the risks of inflation staying above the Fed's 2% target warrant caution.\"Against this backdrop, providing additional monetary support to economic activity runs the risk of slowing – or possibly even stalling – the return of inflation to target,\" she said. \"And with resilient demand, the downside risks to employment, while present, do not seem to have increased further since the summer.\"Collins also noted the role that the government shutdown is playing in her decision making. The impasse appears to be over, but White House press secretary said Wednesday that key reports on inflation and employment may not be available at all for October.\"Absent evidence of a notable labor market deterioration, I would be hesitant to ease policy further, especially given the limited information on inflation due to the government shutdown,\" Collins said.The FOMC in October voted 10-2 for the cut. Governor Stephen Miran voted no because he wanted a bigger reduction, while Kansas City Fed President Jeffrey Schmid opposed because he favored no cut.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Boston Fed President Collins advocates holding rates steady, sees 'high bar' for further cuts",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108225045-1762981409598-gettyimages-2230615538-FED_SYMPOSIUM.jpeg?v=1762981480&w=1920&h=1080"
      ],
      "datePublished": "2025-11-12T21:05:40.000Z",
      "dateModified": "2025-11-12T21:05:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Too Good To Go launches grocery bags with Whole Foods as food costs climb",
    "url": "https://www.cnbc.com/2025/11/12/too-good-to-go-whole-foods-grocery-surprise-bags.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108203219-1758715416706-gettyimages-2236615501-McGregor250923NYCsights10.jpeg?v=1758715472&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-12T14:00:01.000Z",
    "description": "watch nowAs food prices climb, Too Good To Go is launching grocery bags with Whole Foods Market, in a major expansion of its push to lessen food waste",
    "body": "watch nowAs food prices climb, Too Good To Go is launching grocery bags with Whole Foods Market, in a major expansion of its push to lessen food waste and provide affordable meals.Too Good To Go is an app that connects users with stores and restaurants that offer surplus food in \"surprise bags\" at significantly lower prices. Its collaboration with Amazon's Whole Foods will expand to all 536 of the grocer's locations across the U.S., where the two companies said they have already saved 1.6 million meals from going to waste through their partnership.Too Good to Go announced seven new categories of surprise bags with Whole Foods on Wednesday: produce, seafood, meat, dry goods, frozen foods, refrigerated foods and floral. Chris MacAulay, vice president of operations for North America at Too Good to Go, said the collaboration is a win for both consumers and the grocer.\"We have this opportunity to bring incremental foot traffic into the store,\" said MacAulay. \"The consumers that come in are getting tremendous value when they pick up a surprise bag, they don't know what they're going to get, but they do know that they're getting incredible food somewhere between 50% to 70% discounted.\"The move is an expansion of an established partnership between the two companies, which previously included prepared foods bags and bakery bags. Shoppers using Too Good to Go will now be able to get fresh groceries at Whole Foods for the first time. MacAulay said the expansion comes as the company focuses on providing affordable meals while consumers navigate rising prices in the grocery aisles and elsewhere.According to the latest consumer price index report, prices in four of the six major grocery store food groups increased in September. Prices for staples like meats, poultry and eggs rose 5.2% over the year prior to that data release, while fruits and vegetables saw a 1.3% increase. More recent inflation data has been delayed by the government shutdown.Because of the lapse in federal funding, 42 million Americans saw their SNAP benefits paused as a battle played out in the courts about whether the government is required to pay that aid to largely lower-income households.Companies are also seeing a more divided economy, as non-wealthy consumers pull back on their spending on non-essential items and look for ways to save.\"I think we're especially starting to see a great deal of bifurcation around different consumer segments,\" MacAulay said. \"It's hard to put great food on the table, it's getting more expensive, and as a result, finding ways to get some of that food at a better value is really important. And so we're not going to be the only solution – I think we're excited about being a part of a solution to help families who are facing economic challenges.\"The new surprise bags, targeting consumer essentials like produce and poultry, are each valued between $21 and $30, but priced at $6.99 to $9.99.It's part of a larger goal from Whole Foods to deliver on sustainability promises, according to Caitlin Leibert, the grocery chain's vice president of sustainability. She said the company has already seen high demand for its existing Too Good To Go bags and is increasingly seeing customers come in to pick up their bags and make additional purchases on the side because of the overall savings.\"This is really an incredible opportunity and added tool for Americans to stretch every dollar further right now, which we know is so important,\" Leibert said. \"This is one way that you can access higher quality food at a more affordable price.\"Whole Foods isn't immune from the macroeconomic headwinds, either, Leibert said – but the collaboration with Too Good To Go allows the grocery chain to find alternate ways to make its products affordable and accessible for shoppers.Still, both Leibert and MacAulay said the new grocery bags are just one step in a longer path toward promoting sustainability and providing affordable meals.\"We do not 'achieve' sustainability – it is a constant evolution of growth and improvement,\" Leibert said. \"These programs... [are] such a profound way and accessible way to make an impact easily.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Too Good To Go launches grocery bags with Whole Foods as food costs climb",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108203219-1758715416706-gettyimages-2236615501-McGregor250923NYCsights10.jpeg?v=1758715472&w=1920&h=1080"
      ],
      "datePublished": "2025-11-12T14:00:01.000Z",
      "dateModified": "2025-11-12T14:00:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Skyrocketing electricity prices fuel political backlash against tech sector's AI data centers",
    "url": "https://www.cnbc.com/2025/11/12/electricity-prices-data-center-ai-new-jersey-virginia-midterm-election.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107412123-1715178337687-gettyimages-2113285109-AMAZON_DATA_CENTERS.jpeg?v=1749052089&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-12T18:55:22.000Z",
    "description": "A power substation near the LC1 CloudHQ data center in Ashburn, Virginia, on March 27, 2024.Nathan Howard | Bloomberg | Getty ImagesVoter anger at sur",
    "body": "A power substation near the LC1 CloudHQ data center in Ashburn, Virginia, on March 27, 2024.Nathan Howard | Bloomberg | Getty ImagesVoter anger at surging electricity prices is fueling political backlash against the artificial intelligence industry's data centers, with Democrats accusing the Trump administration of failing to address the issue as they zero in on affordability ahead of next year's mid-term elections.Abigail Spanberger won last week's governor's race in Virginia, home to the largest concentration of data centers in the world, after promising to make the industry \"pay their own way and their fair share\" of rising electricity costs.New Jersey governor-elect Mikie Sherrill has promised to declare a state of emergency over electric bills on her first day in office and freeze prices in the Garden State. Two Democrats were elected to Georgia's commission that regulates utilities, breaking total Republican control, with one of the candidates arguing that prices are rising in the Peach State in part due to data centers.On the heels of the election victories, Democratic senators in Washington led by Sen. Richard Blumenthal of Connecticut and Sen. Bernie Sanders of Vermont took aim this week at what they described as the White House's \"sweetheart deals with Big Tech companies,\" accusing the administration of failing to protect consumers from \"being forced to subsidize the cost of data centers.\"\"As a result, everyday Americans are already being forced into bidding wars with trillion-dollar companies to keep the lights on at home,\" the senators wrote Monday in a letter demanding solutions from the White House.President Donald Trump promised to cut families' electric bills by 50% in his first year in office. But residential prices in the U.S. increased about an average 6% in August nationwide compared to the same-period in 2024, according to October data from the Energy Information Administration. Prices soared about 21% in New Jersey, 13% in Virginia and about 5% in Georgia in the same period.The reasons for price hikes vary by state and region, said Abraham Silverman, who served as general counsel for New Jersey's public utility board from 2019 until 2023 under outgoing Democratic Gov. Phil Murphy.But data centers are playing the main role in rising bills on the PJM Interconnection electric grid that serves New Jersey and Virginia, Silverman said. PJM is the largest grid in the U.S., reaching more than 65 million people across 13 states in the Mid-Atlantic and parts of the Midwest and South.\"We are basically adding a Philadelphia's worth of new electricity users to the grid every year, starting in 2025 and showing no signs of slowing,\" Silverman said of the national increase in demand. \"Where is that load growth coming from? The answer is data centers.\"Surging pricesThe conditions that led to surging household electricity prices this year, particularly in the PJM region, took root before the second Trump administration entered office, when investment in AI data centers was just starting to ramp up.The amount PJM agreed to pay in late 2022 to secure capacity from power plants, which ensures they are available when electricity use rises, totaled $2.2 billion. In 2024, the bill soared more than 500% to $14.7 billion. This year, it jumped another 9% to $16.1 billion.The independent watchdog that monitors PJM found the main culprit for soaring capacity prices: data centers.\"The current conditions in the capacity market are almost entirely the result of large load additions from data centers, both actual historical and forecast,\" the watchdog Monitoring Analytics concluded in its independent market monitor report published in June.Those capacity prices are ultimately passed down to household electricity bills, Silverman said. \"It is an extremely large component of the affordability crisis we're experiencing right now.\"New Jersey utility PSE&G, owned by Public Service Enterprise Group, acknowledged the impact of exploding capacity prices in a February letter to consumers warning of a 17% increase in their bills, though it didn't call out data centers.\"Utilities do not earn a profit on the electric supply; these costs are passed through directly to customers,\" the company said.The problem could get worse as the data center build out accelerates — at least for now. Power used by data centers in advanced stages of planning in Pennsylvania, for example, jumped more than 40% to 20.5 gigawatts in the third quarter, up from 14.4 gigawatts previously, according to the utility PPL. That's equivalent to the power consumption of about 17 million U.S. homes.\"I want to be clear that these load additions are real, they are coming fast and furious,\" PPL CEO Vincent Sorgi said on its latest earnings call. \"The bottom line is that we need to start building new generation as soon as possible.\"It is unlikely that residential utility bills will come down this decade as demand is expected to remain high and supplies tight, said Rob Gramlich, president of Grid Strategies, a power sector consulting firm.Political blame gameThe Democratic senators accused the Trump administration of making the affordability problem worse with its attacks on renewable energy. Trump has tried to halt the expansion of wind power, particularly offshore wind projects, and his signature piece of domestic legislation, the One Big Beautiful Bill, phases out tax credits for renewable energy.Renewables are the most readily available source of generation to meet new demand, with solar, battery storage and wind making up more than 90% of the projects that are waiting to connect to the grid, according to August data from the consulting firm Enverus. Sherrill and Spanberger campaigned on expanding renewable energy in New Jersey and Virginia not to lower carbon emissions, but to help bring down energy costs.The White House blames the Biden administration and its renewable energy policies for driving up electricity prices. Trump \"declared an energy emergency to reverse four years of Biden's disastrous policies, accelerate large-scale grid infrastructure projects, and expedite the expansion of coal, natural gas and nuclear power generation,\" White House spokeswoman Taylor Rogers said in a statement.The AI industry should pay for the new generation and transmission that is needed to support their data centers, Silverman said. \"If we do that, then we are really going a long way to insulate mom and pop consumers from the higher costs,\" he said.The Data Center Coalition, a lobbying group, said in a statement that \"the industry is committed to paying its full cost of service for the energy it uses.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Skyrocketing electricity prices fuel political backlash against tech sector's AI data centers",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107412123-1715178337687-gettyimages-2113285109-AMAZON_DATA_CENTERS.jpeg?v=1749052089&w=1920&h=1080"
      ],
      "datePublished": "2025-11-12T18:55:22.000Z",
      "dateModified": "2025-11-12T18:55:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cisco's stock jumps on earnings beat, strong guidance and $1.3 billion in AI orders",
    "url": "https://www.cnbc.com/2025/11/12/cisco-csco-q1-2026-earnings-report.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108090587-1737562466454-1U8A1107.JPG?v=1737562641&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-12T23:26:28.000Z",
    "description": "Chuck Robbins, Cisco CEO, speaking on CNBC's Squawk Box outside the World Economic Forum in Davos, Switzerland on Jan. 22, 2025.Gerry Miller | CNBCCis",
    "body": "Chuck Robbins, Cisco CEO, speaking on CNBC's Squawk Box outside the World Economic Forum in Davos, Switzerland on Jan. 22, 2025.Gerry Miller | CNBCCisco reported better-than-expected profit and revenue for its fiscal first quarter on Wednesday. The stock rose more than 7% in extended trading.Here's how the company did in comparison with consensus estimates from LSEG:Earnings per share: $1 adjusted vs. 98 cents expectedRevenue: $14.88 billion vs. $14.77 billion expectedRevenue increased 8% from $13.84 billion in the same period a year earlier, Cisco said in a statement. Net income climbed to $2.86 billion, or 72 cents per share, from $2.71 billion, or 68 cents per share, a year ago.It's the fourth straight quarter of growth for Cisco following a stretch of four consecutive year-over-year revenue declines, as the company contended with economic uncertainty and delayed spending from government agencies.Cisco's networking business, its biggest unit, saw sales climb 15% to $7.77 billion. Analysts were expecting revenue for that segment of $7.47 billion, according to StreetAccount.Most of the growth in data center spending is focused on artificial intelligence, as companies bolster their investments in servers packed with graphics processing units, primarily from Nvidia. Cisco is trying to tie itself more closely to the AI boom, and last month introduced a new Ethernet switch based on Nvidia silicon.Cisco said that AI infrastructure orders from \"hyperscaler customers\" reached $1.3 billion, \"reflecting a significant acceleration in growth.\"\"Our relevance in AI continues to build,\" CFO Mark Patterson said in the press release. \"We have a multi-year, multi-billion-dollar campus refresh opportunity starting to ramp, with strong demand for our refreshed networking products.\" For the fiscal second quarter, Cisco said it expects revenue of $15 billion to $15.2 billion, topping the $14.6 billion average estimate, according to LSEG. Adjusted earnings will be $1.01 to $1.03 per share, exceeding the 99-cent average estimate.Revenue for the full fiscal year will be between $60.2 billion and $61 billion, with earnings per share of $4.08 to $4.14, Cisco said. Analysts expect sales of $59.7 billion and EPS of $4.04.While networking is growing and performing better than expected, Cisco's other two main segments saw revenue declines and missed Wall Street's expectations.Sales in the company's security unit fell 2% from a year earlier to $1.98 billion, missing the average estimate of $2.16 billion, according to StreetAccount. And collaboration sales slipped 3% to $1.06 billion, trailing the $1.09 billion average estimate.Cisco shares are up 25% this year as of Wednesday's close, topping the 21% gain for the Nasdaq.WATCH: Cisco's product chief on AI agentswatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cisco's stock jumps on earnings beat, strong guidance and $1.3 billion in AI orders",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108090587-1737562466454-1U8A1107.JPG?v=1737562641&w=1920&h=1080"
      ],
      "datePublished": "2025-11-12T23:26:28.000Z",
      "dateModified": "2025-11-12T23:26:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jeffrey Epstein files: House speaker announces vote next week on release of docs",
    "url": "https://www.cnbc.com/2025/11/12/jeffrey-epstein-files-house-vote-grijalva.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108225063-1762982839208-gettyimages-2245829867-AFP_83UW266.jpeg?v=1762982896&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-13T00:55:07.000Z",
    "description": "A protester holds a sign related to the release of the Jeffrey Epstein case files outside the US Capitol in Washington, DC, Nov. 12, 2025. Saul Loeb |",
    "body": "A protester holds a sign related to the release of the Jeffrey Epstein case files outside the US Capitol in Washington, DC, Nov. 12, 2025. Saul Loeb | AFP | Getty ImagesA petition in the House of Representatives to force a vote to compel the Justice Department to release the so-called Jeffrey Epstein files on Wednesday secured the last signature required to trigger that action.House Speaker Mike Johnson, R-La., within hours said that a full House vote on that effort will be held next week.Rep. Adelita Grijalva, D-Ariz., provided the 218th signature needed to approve the so-called discharge petition shortly after she was sworn in as a House member, after a seven-week delay. Griljalva won a special election to fill the seat vacated due to the death of her father, Rep. Raúl Grijalva, in March.The Trump administration has been under fire for months for reneging on promises to release investigative files related to Epstein, a convicted sex offender who killed himself in 2019 after his arrest on child sex trafficking charges.Epstein had been a friend of President Donald Trump for years before they had a falling out in the early 2000s.Even if the effort passes in the House, it is unlikely to become law. The bill would have to pass in the Republican-controlled Senate, and Trump could veto it even if it survived a vote in that chamber.The New York Times reported Wednesday that Rep. Lauren Boebert, a Colorado Republican, was summoned to the White House to meet with top Justice Department and FBI officials as Trump tries to head off the House vote, The New York Times reported.Boebert is just one of four GOP House members who signed the discharge petition on the Epstein files. files.Jennifer Freeman, an attorney for Epstein victim Maria Farmer, in a statement to MSNBC, said, \"For decades, survivors of Jeffrey Epstein and Ghislaine Maxwell have been left in the dark, the government ignored or cast aside survivor reports of Epstein and Maxwell's crimes, and the vast majority of people who were implicated have yet to be held responsible.\"\"There's no time to waste – we urge lawmakers to do their part and vote on releasing the Epstein files once and for all,\" Freeman said.House Democrats earlier Wednesday released more than 20,000 documents obtained from Epstein's estate under a subpoena.The documents include emails and text messages in which Epstein talked about Trump.\"I know how dirty donald is,\" Epsten wrote in a 2018 email thread for Kathryn Ruemmler, who served as former President Barack Obama's White House counsel, after she sent Epstein an article about Trump's ex-personal lawyer and fixer Michael Cohen's pleading guilty to campaign finance violations and agreeing to cooperate in a federal investigation of the president.In a separate April 2019 email released by Democrats, Epstein told author Michael Wolff that Trump \"knew about the girls.\" It is unclear what the phrase \"knew about the girls\" meant.In another newly released email that Epstein wrote to his now-convicted accomplice Ghislaine Maxwell in April 2011, Epstein wrote, \"I want you to realize that the dog that hasn't barked is trump.\"Epstein added in that same email that a person whom the Democrats identified as a victim of his, whose name was redacted in the email, \"spent hours at my house with\" Trump.\"He has never once been mentioned,\" Epstein added in that message.It is not clear what Epstein was referring to in the email that said \"the dog that hasn't barked.\"CNBC has not independently verified the documents released by the Democrats.Trump has denied having known about Epstein's sexual abuse of underage girls and young women when they were socializing with each other. The president has never been charged with wrongdoing in connection with Epstein.Trump blasted the Democrats in a Truth Social post that accused them of using the Epstein documents to distract Americans from the cost of the U.S. government shutdown.\"The Democrats are trying to bring up the Jeffrey Epstein Hoax again because they'll do anything at all to deflect on how badly they've done on the Shutdown, and so many other subjects,\" Trump wrote.\"Only a very bad, or stupid, Republican would fall into that trap,\" he wrote.\"The Democrats cost our Country $1.5 Trillion Dollars with their recent antics of viciously closing our Country, while at the same time putting many at risk — and they should pay a fair price,\" Trump said.\"There should be no deflections to Epstein or anything else, and any Republicans involved should be focused only on opening up our Country, and fixing the massive damage caused by the Democrats!\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jeffrey Epstein files: House speaker announces vote next week on release of docs",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108225063-1762982839208-gettyimages-2245829867-AFP_83UW266.jpeg?v=1762982896&w=1920&h=1080"
      ],
      "datePublished": "2025-11-13T00:55:07.000Z",
      "dateModified": "2025-11-13T00:55:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Atlanta Fed President Bostic says he'll leave position when his term expires in February",
    "url": "https://www.cnbc.com/2025/11/12/atlanta-fed-president-bostic-says-hell-leave-position-when-his-term-expires.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108024830-1724418847838-untitled-26-4.jpg?v=1762960349&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-12T16:08:58.000Z",
    "description": "watch nowAtlanta Federal Reserve President Raphael Bostic said Wednesday he will be leaving his position when his term expires in February.Bostic has ",
    "body": "watch nowAtlanta Federal Reserve President Raphael Bostic said Wednesday he will be leaving his position when his term expires in February.Bostic has been in his current role since June 2017 and is the first Black and openly gay regional president. His term, which also was marked by issues relating to personal investments he made, runs until Feb. 28.\"I'm proud of what we accomplished during my tenure to turn the lofty goal of an economy that works for everyone into more of a reality, and I look forward to discovering new ways to advance that bold vision in my next chapter,\" Bostic said in a statement.The announcement comes ahead of a pivotal year for the Fed and its rate-setting body, the Federal Open Market Committee.Regional presidents serve five-year terms that generally run in sync and are designed to expire on years that end in either 1 or 6, which will be the case next year. While the local boards vote on the presidents, they are subject to approval by the Fed's Board of Governors. Normally a routine process, unusual political dynamics on the board could add a new wrinkle to the procedure.In addition to the reappointments of the regional presidents, Jerome Powell's term as Fed chair expires in May, though his run as governor goes until 2028.Bostic has been seen as more of a centrist during his run, though he's been more cautious about cutting interest rates this year during a time of elevated inflation and a softening labor market. He is not an FOMC voter this year. Atlanta next will get a vote in 2027.Powell said Bostic's \"perspective has enriched the Federal Open Market Committee's understanding of our dynamic economy. And his steady voice has exemplified the best of public service — grounded in analysis, informed by experience, and guided by purpose.\"Until the board names a successor, Cheryl Venable, the first vice president and chief operating officer at the Atlanta Fed, will handle the role of president.Bostic's term has not been without controversy.In October 2022, the Fed announced it was looking at trades Bostic made during blackout periods near policy meetings. An internal report showed there were 154 trades made on his behalf during those times. However, the report also indicated there was no evidence Bostic traded on insider information or had personal conflicts.There also were other issues raised regarding financial disclosure terms and an improper level of Treasury holdings.For his part, Bostic expressed regret over the discrepancies and said the trades were executed by third-party managers over whom he did not have control.The controversy was part of a larger issue with investments from Fed officials that triggered tighter internal controls and rules over what types of securities they are permitted to hold.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Atlanta Fed President Bostic says he'll leave position when his term expires in February",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108024830-1724418847838-untitled-26-4.jpg?v=1762960349&w=1920&h=1080"
      ],
      "datePublished": "2025-11-12T16:08:58.000Z",
      "dateModified": "2025-11-12T16:08:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Google sues cybercriminal group behind E-ZPass, USPS text phishing scams",
    "url": "https://www.cnbc.com/2025/11/12/google-e-zpass-usps-text-scam-phishing-suit.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108224703-1762951406147-gettyimages-1372131378-smishing_021601.jpeg?v=1762951417&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-12T13:18:25.000Z",
    "description": "Signage at Google headquarters in Mountain View, California, US, on Thursday, Oct. 23, 2025. Benjamin Fanjoy | Bloomberg | Getty ImagesGoogle filed a ",
    "body": "Signage at Google headquarters in Mountain View, California, US, on Thursday, Oct. 23, 2025. Benjamin Fanjoy | Bloomberg | Getty ImagesGoogle filed a lawsuit Wednesday against a foreign cybercriminal group behind a massive SMS phishing, or \"smishing,\" operation.Dubbed by some cyber researchers as the \"Smishing Triad,\" the organization, which Google said is largely based out of China, uses a phishing-as-a-service kit named \"Lighthouse\" to create and deploy attacks using fraudulent texts.The crime group has amassed more than a million victims across 120 countries, Google said in a release.\"They were preying on users' trust in reputable brands such as E-ZPass, the U.S. Postal Service, and even us as Google,\" Google general counsel Halimah DeLaine Prado told CNBC. \"The 'Lighthouse' enterprise or software creates a bunch of templates in which you create fake websites to pull users' information.\"Google brought claims under the Racketeer Influenced and Corrupt Organizations, or RICO, Act, the Lanham Act, and the Computer Fraud and Abuse Act, or CFAA, and is seeking to dismantle the group and the Lighthouse platform.The texts usually contain malicious links to a fake website designed to steal victims' sensitive financial information, including Social Security numbers, banking credentials and more.The messages can often appear in the form of a fake fraud alert, delivery update, unpaid government fee notification, or other seemingly urgent texts.The crime group has stolen approximately between 12.7 million and 115 million credit cards in the U.S. alone, Google said.\"The idea is to prevent its continued proliferation, deter others from doing something similarly, as well as protect both the users and brands that were misused in these websites from future harm,\" DeLaine Prado said.Read more CNBC tech newsAI spending is not all equal. Wall Street rewards hyperscalers, punishes DoorDash and DuolingoOura expects close to $2 billion in 2026 sales, almost doubling for the second consecutive yearTesla investor support for Elon Musk's massive pay plan was lower in 2025 than in 2018Former Google, Meta executives raise $100 million for high-capacity AI servers startupThe Alphabet-owned company said it has found more than 100 website templates generated by Lighthouse using Google's branding on sign-in screens to trick victims into thinking the sites were legitimate.Internal and third-party investigations found that around 2,500 members of the syndicate were corresponding on a public Telegram channel to recruit more members, share advice, and test and maintain the Lighthouse software itself, DeLaine Prado said.She added that the organization also had a \"data broker\" group, which supplied the list of potential victims and contacts, a \"spammer\" group, responsible for the SMS messages, and a \"theft\" group that would coordinate their attacks using the procured credentials on public Telegram channels.Google said it's the first company to take legal action against SMS phishing scams and is additionally endorsing three bipartisan bills intended to protect against fraud and cyberattacks.\"While the lawsuit is one potential vector in which we can disrupt it, we also think that this type of cyber activity requires a policy-based approach,\" DeLaine Prado said.The trio of bills includes the Guarding Unprotected Aging Retirees from Deception, or GUARD, Act, the Foreign Robocall Elimination Act, which would establish a task force targeting foreign illegal robocalls, and the Scam Compound Accountability and Mobilization Act, which targets scam compounds and supports survivors of human trafficking within the centers.The litigation is part of Google's broader strategy to bring cyber protection awareness to users.The company recently rolled out more safety features, including a Key Verifier tool and artificial intelligence-powered spam detection in Google Messages.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Google sues cybercriminal group behind E-ZPass, USPS text phishing scams",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108224703-1762951406147-gettyimages-1372131378-smishing_021601.jpeg?v=1762951417&w=1920&h=1080"
      ],
      "datePublished": "2025-11-12T13:18:25.000Z",
      "dateModified": "2025-11-12T13:18:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump signs funding bill, ends government shutdown",
    "url": "https://www.cnbc.com/2025/11/12/government-shutdown-house-vote-trump.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108225204-1763004484872-108225204-1763004118894-gettyimages-2246445663-wm028868_nul8nudi.jpeg?v=1763004511&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-13T04:14:54.000Z",
    "description": "U.S. President Donald Trump signs funding legislation to reopen the federal government as he is joined by House Speaker Mike Johnson (R-LA), House Min",
    "body": "U.S. President Donald Trump signs funding legislation to reopen the federal government as he is joined by House Speaker Mike Johnson (R-LA), House Minority Leader Steve Scalise (R-LA), Republican lawmakers and business leaders, during a ceremony in the Oval Office of the White House on Nov. 12, 2025, in Washington, DC.Win McNamee | Getty ImagesPresident Donald Trump late Wednesday signed into law a funding bill to end the longest federal government shutdown in U.S. history.The measure, which will fund government operations through the end of January, was passed by the House of Representatives earlier Wednesday night in a 222-209 vote.\"The Democrats tried to extort our country,\" Trump said before signing the bill in the Oval Office at the White House to reopen the government after 43 days.Democrats had blocked passage of a funding bill until Sunday, when a bloc of the party's Senate caucus agreed to support a new funding measure in that chamber, despite it not including an extension of Affordable Care Act tax credits.\"Republicans never wanted a shutdown,\" said the president, who was flanked by Republican leaders of Congress.\"People were hurt so badly,\" Trump said, noting the more than 1 million federal workers furloughed, and the effect on government services for Americans. \"We can never let this happen again.\"He reiterated his call for the Senate to end a filibuster rule that effectively requires 60 votes to pass legislation, including short-term funding resolutions.Trump did not take questions from reporters after the signing, despite several of them trying to ask about the release by House Democrats earlier in the day of documents from the estate of his former friend, Jeffrey Epstein, the notorious sex offender. He was asked about, but ignored, a question about emails by Epstein referring to him.Trump has denied knowing about Epstein's sexual abuse of underage girls and young women when they were friends.House Speaker Mike Johnson, R-La., before Wednesday's vote, in comments backing the bill on the chamber's floor, said, \"My friends, let's get this done.\"Just two Republicans in the House voted against the bill: Thomas Massie of Kentucky and Florida's Greg Steube.All but six Democrats voted against the bill: Adam Gray of California; Maine's Jared Golden; Tom Suozzi of New York; Washington's Marie Gluesenkamp Perez; Don Davis of North Carolina; and Henry Cuellar of Texas.The Office of Management and Budget told federal employees to return to their jobs on Thursday.Earlier Wednesday night, the U.S. Department of Transportation froze the level of flight cuts it imposed in light of shortages of air traffic controllers during the shutdown.As of Tuesday, 6% of scheduled flights were cancelled at U.S. airports, and that level was set to rise to 10% by Friday.The shutdown began on Oct. 1, and government operations had remained shuttered since then because Senate Democrats overwhelmingly refused to vote for a funding measure that did not extend the boosted ACA credits, which reduce the cost of Obamacare health insurance plans for 20 million Americans.The Senate passed the funding bill on Monday night, a day after the Republican majority won support for it from seven Democrats and one independent senator to barely reach the 60-vote minimum.Under the deal, Senate Republicans agreed to allow Democrats a vote in December on a bill of their choice to extend those boosted subsidies, which are due to expire at the end of that month.Without those tax credits, millions of Americans will see sharp increases in the cost of their Obamacare insurance plans.In addition to short-term funding, the deal will also reverse all shutdown-related layoffs of federal government employees and ensure that all federal workers will be paid their normal salaries that they would have received if the government had not shut down.It is not yet known when all federal employees will be paid, but agencies are expected to roughly follow the timeline for paying House staffers, who are set to receive checks on Tuesday.The package also funds the SNAP program, which helps feed 42 million Americans through food stamps. The Trump administration tried to end those food stamp benefits in November, citing the shutdown, and then refused to tap money other than $4.6 billion in a congressionally appropriate contingency fund to fully pay SNAP benefits for the month.The Supreme Court had stayed a federal judge's order mandating that full benefits be paid until Thursday, giving Congress time to effectively moot the case by passing the shutdown bill.The deal also includes provisions for a bipartisan budget process and prevents the White House from using continuing resolutions to fund the government.CRs have been repeatedly used to avoid government shutdowns.Rep. Rosa DeLauro, D-Conn., during remarks on the House floor before the House vote, said some people will see their monthly insurance premiums \"double or even triple\" because of the lack of protection for the added ACA subsidies.In 2026, she said, \"more than 2 million Americans are expected to lose their health plans next year because it is just too expensive.\"DeLauro said that Johnson, the House speaker, \"has shown no interest\" in holding a vote on the ACA subsidies, despite Senate Republicans saying that was the plan.House Majority Leader Steve Scalise, R-La., said, \"We never should have been here.\"\"We tried as Republicans more than a month ago to prevent a government shutdown,\" Scalise said.\"We waited for 42 days where time and time again, Democrats, to appease their most radical base, voted to keep that government shut down.\"Scalise said \"millions of Americans\" have had to endure \"pain and suffering\" because Democrats refused to vote for a funding bill.He accused Democrats of hypocrisy by seeking $200 billion in health spending that would benefit \"illegals,\" while \"advocating to gut the $50 billion Rural Health Care Fund.\"It's insanity,\" Scalise said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump signs funding bill, ends government shutdown",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108225204-1763004484872-108225204-1763004118894-gettyimages-2246445663-wm028868_nul8nudi.jpeg?v=1763004511&w=1920&h=1080"
      ],
      "datePublished": "2025-11-13T04:14:54.000Z",
      "dateModified": "2025-11-13T04:14:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Waymo begins offering freeway robotaxi rides in San Francisco, LA and Phoenix",
    "url": "https://www.cnbc.com/2025/11/12/waymo-robotaxi-starts-freeway-highway-rides.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107370337-17073249282022-12-13t080547z_1219029184_rc2v4y9c46bi_rtrmadp_0_waymo-san-francisco.jpeg?v=1707324947&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-12T16:00:01.000Z",
    "description": "watch nowWaymo robotaxis will now take passengers on freeways in three major U.S. cities, marking a major milestone for the driverless, ride-hailing c",
    "body": "watch nowWaymo robotaxis will now take passengers on freeways in three major U.S. cities, marking a major milestone for the driverless, ride-hailing company.Alphabet-owned Waymo on Wednesday said it will begin offering those types of trips in the San Francisco, Phoenix and Los Angeles markets \"when a freeway route is meaningfully faster.\" The Google sister company will gradually extend freeway trips to more riders and locations over time.Although Waymo's driverless cars have previously taken passengers on smaller highways and side streets, Wednesday's expansion marks the first time the company will take payment from public riders to go on freeways with higher speed limits.\"Freeway driving is one of those things that's very easy to learn, but very hard to master when we're talking about full autonomy without a human driver as a backup, and at scale,\" Waymo co-CEO Dmitri Dolgov said at a press event ahead of the announcement. \"It took time to do it properly.\"Waymo vehicles will generally travel up to a freeway's maximum posted speed limit, which is 65 mph in many cases, the company said. However, a spokesperson confirmed, the robotaxis may sometimes go a few miles over the limit for safety purposes in extraordinary circumstances.Freeway operations required expanded operational protocols, including coordination with safety officials at the California Highway Patrol and the Arizona Department of Public Safety, Waymo said. The company also installed additional infrastructure needed to charge its fleet of electric robotaxis given the freeway expansion.Over the last year, Waymo has offered select Alphabet employees robotaxi freeway rides around San Francisco, Los Angeles and Phoenix in preparation for Wednesday's launch, said Waymo Product Manager Jacopo Sannazzaro.The company has been testing on freeways for more than a decade in total, he added. Besides testing on public roads and closed courses, Waymo also conducts testing in simulation to determine how its vehicles will respond to both typical and hard-to-replicate events, like merging onto freeways, lane-splitting motorcyclists or another car flipping over.CNBC took a freeway test ride in a Waymo in the San Francisco Bay Area, from YouTube's offices in San Bruno to San Mateo and back. The ride went on and off ramps along the California 101 seamlessly, with no incidents.Waymo's continued expansionAfter already launching its robotaxi service in Austin, Texas, San Francisco, Phoenix and Los Angeles, Waymo has also announced plans to expand to Miami, San Diego and Washington, D.C., in 2026. The company is also testing its vehicles in New York City, Tokyo and plans to begin offering rides to the public in London next year.Waymo on Wednesday also announced that it's expanding its service footprint in the San Francisco Bay Area to San Jose. That includes rides to and from San Jose Mineta International Airport, marking the company's second international airport destination. The SJC airport plans were first announced in September.In 2023, Waymo launched at Phoenix Sky Harbor International Airport, which has become its most popular destination in the Phoenix metropolitan service area.The company expanded its service in March to include an additional 27 square miles of coverage in the region, including cities like Mountain View and Palo Alto. After the Wednesday expansion, Waymo now offers service in about 260 square miles of Silicon Valley.Would-be Waymo competitor Tesla also takes passengers to and from SJC. Customers can hail a ride via Tesla's \"Robotaxi\" app, but that name is not precisely descriptive. Tesla only operates a car service with human drivers on board, not a commercial robotaxi service like Waymo's, due to a mix of technical limits and permit requirements in California.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Waymo begins offering freeway robotaxi rides in San Francisco, LA and Phoenix",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107370337-17073249282022-12-13t080547z_1219029184_rc2v4y9c46bi_rtrmadp_0_waymo-san-francisco.jpeg?v=1707324947&w=1920&h=1080"
      ],
      "datePublished": "2025-11-12T16:00:01.000Z",
      "dateModified": "2025-11-12T16:00:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "AI startup Code Metal is going beyond vibe coding with the help of $36 million in fresh capital",
    "url": "https://www.cnbc.com/2025/11/12/ai-startup-code-metal-raises-36-million-in-funding-round-led-by-accel.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108224891-1762968392253-CodeMetal_cofounders.jpeg?v=1762969890&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-12T18:24:22.000Z",
    "description": "Code Metal co-founders (L-R): SVP of technology Alex Showalter-Bucher, and CEO Peter MoralesCourtesy Code Metal Inc.Peter Morales started Code Metal t",
    "body": "Code Metal co-founders (L-R): SVP of technology Alex Showalter-Bucher, and CEO Peter MoralesCourtesy Code Metal Inc.Peter Morales started Code Metal two years ago, jumping into the market for artificial intelligence coding tools at a time when AI companies were rapidly changing the market for software development.Now he's got $36.5 million in the bank, thanks to an investment led by venture firm Accel Partners, known for early bets on Facebook, Dropbox and Atlassian.Code Metal's technology allows software engineers to write code once, then automatically translate it into any other programming language so they can ship new features faster and to a wider swath of users. Morales, who was previously technology chief at a gaming company, said Code Metal's offering is particularly appealing to developers working on software to run appliances, consumer electronics, factory robotics, autos and medical devices.Those are industries with products that contain a wide array of chips, which come with different software development kits, operating systems and code libraries. Morales gave the example of an automaker creating a feature for a new model sports car running on the latest Nvidia chip, and the challenge of porting the code behind the feature to the company's older line of minivans. Code Metal's AI would automatically handle the translation.Morales is positioning the company as distinct from so-called vibe-coding platforms like Cursor or Anthropic's Claude Code, which allow users to automate much of the process of writing software with text prompts.\"Vibe coding is all about explaining an initial idea in text, and generating code that will get you started developing your minimum viable product,\" Morales said. \"This is not where most companies spend their time. Code Metal focuses on bringing code to production. That requires strong guarantees the code we're converting is accurate, compliant and working as expected.\"Morales said large language models alone can't provide this level of certainty, so Code Metal employs what computer scientists call formal methods to check the code and make it's been translated correctly.The company, based in Boston, says it's already struck contracts worth tens of millions of dollars with commercial and public sector clients, including the U.S. Air Force, L3Harris and Raytheon as well as some automotive suppliers and consumer electronics brands.Accel's Steve Loughlin, who led the deal, said Code Metal is the fastest growing company in his firm's portfolio of early-stage startups, and that demand for its technology is surging.\"The market opportunity is practically uncapped here,\" Loughlin said, \"to help people develop on the edge much faster and modernize legacy code.\"Code Metal's earlier backers J2 ventures and Shield Capital also participated in the round, along with Bosch ventures and Raytheon's RTX Ventures.WATCH: The rise of AI 'vibe coding'watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "AI startup Code Metal is going beyond vibe coding with the help of $36 million in fresh capital",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108224891-1762968392253-CodeMetal_cofounders.jpeg?v=1762969890&w=1920&h=1080"
      ],
      "datePublished": "2025-11-12T18:24:22.000Z",
      "dateModified": "2025-11-12T18:24:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "House to vote on bill to end shutdown around 7 p.m. ET Wednesday, Rep. Scalise says ",
    "url": "https://www.cnbc.com/2025/11/12/house-to-vote-on-bill-to-end-shutdown-around-7-pm-et-wednesday-scalise.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108224755-1762955903289-gettyimages-2244362343-US_GOV_FUNDING.jpeg?v=1762955925&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-12T15:31:09.000Z",
    "description": "watch nowThe U.S. House of Representatives will vote early Wednesday evening to end the longest government shutdown in history, Rep. Steve Scalise, R-",
    "body": "watch nowThe U.S. House of Representatives will vote early Wednesday evening to end the longest government shutdown in history, Rep. Steve Scalise, R-La., said.\"We'll start the process probably around 4, 5 o'clock. The actual vote on the bill to fund the government will probably come later, around 7 o'clock,\" the House majority leader told CNBC. \"There'll be, I'm sure, a good, thorough debate, but it's so important that this gets done.\"If the spending bill gets through as planned, it will end an impasse that has lasted more than six weeks, resulting in furloughs for government workers, the closing of all federal government activities, the suspension of the Supplemental Nutrition Assistance Program and increased delays at airports heading into the holiday travel season.The Senate on Monday approved the package, which would keep the government open until Jan. 30 and provide funding for agriculture, military programs and legislative agencies, while also providing back pay for workers affected by the shutdown.Read more CNBC politics coverageDemocrats win big on Election Night in key racesZohran Mamdani wins New York City mayor's race, NBC News projectsDemocratic candidate Mikie Sherrill wins New Jersey governor's race, NBC News projectsDemocrats win Virginia governor, attorney general races, NBC News projectsSNAP update: Trump admin will pay 50% of food stamp benefits in November amid shutdownTrump says he has 'no idea who' Binance's CZ is after pardoning himTrump backtracks on attending Supreme Court tariffs case argumentsPresident Donald Trump has indicated he will sign the bill into law.Though the majority in the House is expected to be razor thin, Scalise said he expects to peel off enough Democrats to get the package through.\"Some Democrats still want to play games and inflict pain on families across America, but we've got enough,\" he said. \"We may get a few more than that in the House who want to end this madness and just let people get back to their lives.\"Both sides have traded blame over who is responsible for the shutdown. Polls have indicated voters more put the onus on Republicans, though an NBC News poll earlier this month showed Democrats faulted at the highest level in 30 years when compared with previous shutdowns.\"It's madness, but it's going to end today, hopefully, and let's move on,\" Scalise said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "House to vote on bill to end shutdown around 7 p.m. ET Wednesday, Rep. Scalise says ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108224755-1762955903289-gettyimages-2244362343-US_GOV_FUNDING.jpeg?v=1762955925&w=1920&h=1080"
      ],
      "datePublished": "2025-11-12T15:31:09.000Z",
      "dateModified": "2025-11-12T15:31:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]