[
  {
    "title": "Etsy stock pops 14% on sale of Depop to eBay for $1.2 billion",
    "url": "https://www.cnbc.com/2026/02/18/ebay-buying-depop-etsy.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108178340-1753793027349-gettyimages-2216761104-ETSY_MARKETPLACE.jpeg?v=1771449237&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-18T23:39:42.000Z",
    "description": "The Etsy Inc. headquarters in the Brooklyn borough of New York on June 25, 2024.Victor J. Blue | Bloomberg | Getty ImagesEtsy shares skyrocketed more ",
    "body": "The Etsy Inc. headquarters in the Brooklyn borough of New York on June 25, 2024.Victor J. Blue | Bloomberg | Getty ImagesEtsy shares skyrocketed more than 14% in extended trading on Wednesday after the company announced eBay would acquire its secondhand clothing reseller Depop for about $1.2 billion in cash.The deal comes almost five years after Etsy bought Depop for roughly $1.62 billion, giving the online marketplace an edge into younger consumers who flocked to the U.K.-founded app to hawk their used clothing, shoes, accessories and other goods. About 90% of Depop's users are under the age of 34, Etsy said.\"We are excited that this transaction allows us to focus exclusively on the compelling opportunity we see in front of us: to grow the Etsy marketplace in ways that matter most to our buyers and sellers,\" Etsy CEO Kruti Patel Goyal said in a statement. The transaction is expected to close in the second quarter of this year. In recent years, Etsy snapped up several niche online marketplaces as part of a \"house of brands\" strategy to compete with bigger, faster-growing rivals like Amazon. But it's since unwound many of those deals, including Brazilian e-commerce company Elo7 in 2023 and musical instrument marketplace Reverb last year.Read more CNBC tech newsSnap to launch creator subscriptions in push to diversify revenueAlibaba unveils Qwen3.5 as China's chatbot race shifts to AI agentsByteDance says it will add safeguards to Seedance 2.0 following Hollywood backlashAnthropic got an 11% user boost from its OpenAI-bashing Super Bowl ad, data showsEtsy has struggled to grow its business since the pandemic e-commerce boom, while it contends with stiff competition from Amazon, Shopify and ultracheap online marketplaces like Temu, Shein and TikTok Shop. On its core platform, Etsy saw active buyers and gross merchandise volume decline year over year in 2024, a trend that continued last year. The company has also borne the brunt of President Donald Trump's tariff policies and a tough macroeconomic environment that led to a pullback in discretionary spending among consumers. EBay CEO Jamie Iannone said Depop would allow the 30-year-old company to grow its presence in fashion.\"This acquisition presents an opportunity to advance one of our newest and fastest-growing Focus Categories with a marketplace that complements our existing presence, and enables us to reach a younger demographic across the expanding recommerce landscape,\" Iannone said in a statement.Shares of eBay surged more than 8% in extended trading following the news, which was announced alongside the company's fourth-quarter earnings results. EBay reported adjusted earnings per share of $1.41 on revenue of $2.97 billion, surpassing analyst estimates of $1.34 per share and $2.88 billion, according to LSEG. Sales increased 15% from a year ago.Gross merchandise volume, or the dollar value of items sold, grew 10% year over year to $21.2 billion, above Wall Street expectations for $20.8 billion.For the first quarter, eBay said it expects to post adjusted earnings per share between $1.53 and $1.59 on revenue in the range of $3 billion and $3.05 billion. Analysts anticipated $1.48 per share and $2.8 billion in sales. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Etsy stock pops 14% on sale of Depop to eBay for $1.2 billion",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108178340-1753793027349-gettyimages-2216761104-ETSY_MARKETPLACE.jpeg?v=1771449237&w=1920&h=1080"
      ],
      "datePublished": "2026-02-18T23:39:42.000Z",
      "dateModified": "2026-02-18T23:39:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Fed officials split on where interest rates should go, minutes say",
    "url": "https://www.cnbc.com/2026/02/18/fed-minutes-january-2026.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108258490-17696290002026-01-28t193552z_1476820447_rc2jaja3zs3e_rtrmadp_0_usa-fed.jpeg?v=1769629032&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-18T20:19:23.000Z",
    "description": "U.S. Federal Reserve Chair Jerome Powell speaks during a press conference following a two-day meeting of the Federal Open Market Committee (FOMC) on i",
    "body": "U.S. Federal Reserve Chair Jerome Powell speaks during a press conference following a two-day meeting of the Federal Open Market Committee (FOMC) on interest rate policy, in Washington, D.C., U.S., January 28, 2026. Jonathan Ernst | ReutersDivided Federal Reserve officials at their January meeting indicated that further interest rate cuts should be paused for now and could resume later in the year only if inflation cooperates.While the decision to hold the central bank's benchmark rate steady mostly was met with approval, the path ahead appeared less certain, with members conflicted between fighting inflation and supporting the labor market, according to minutes released Wednesday from the Jan. 27-28 Federal Open Market Committee meeting.\"In considering the outlook for monetary policy, several participants commented that further downward adjustments to the target range for the federal funds rate would likely be appropriate if inflation were to decline in line with their expectations,\" the meeting summary said.However, meeting participants disagreed on where policy should head, with officials debating over whether the focus should be more on fighting inflation or supporting the labor market.\"Some participants commented that it would likely be appropriate to hold the policy rate steady for some time as the Committee carefully assesses incoming data, and a number of these participants judged that additional policy easing may not be warranted until there was clear indication that the progress of disinflation was firmly back on track,\" the minutes said.Moreover, some even entertained the notion that rate hikes could be on the table and wanted the post-meeting statement to more closely reflect \"a two-sided description of the Committee's future interest rate decisions.\"Such a description would have reflected \"the possibility that upward adjustments to the target range for the federal funds rate could be appropriate if inflation remains at above-target levels.\"The Fed reduced its benchmark borrowing rate by three-quarters of a percentage point in consecutive cuts in September, October and December. Those moves put the key rate in a range between 3.5%-3.75%.The meeting was the first for a new voting cast of regional presidents, at least two of whom, Lorie Logan of Dallas and Beth Hammack of Cleveland, have publicly said they think they Fed should be on hold indefinitely. Both have said they see inflation as a continuing threat and should be the focus of policy now. All 19 governors and regional presidents participate at the meeting, but only 12 vote.With the Fed already split along ideological lines, the fissure could grow deeper if former Governor Kevin Warsh is confirmed as the next central bank chair. Warsh has spoken in favor of lower rates, a position also supported by current Governors Stephen Miran and Christopher Waller. Both Waller and Miran voted against the January decision, preferring instead another quarter-point cut. Current Chair Jerome Powell's term ends in May.The meeting minutes do not identify individual participants and featured an array of characterizations to describe positions, rotating between \"some,\" \"a few,\" \"many\" and even featured two rare references to \"a vast majority.\"Participants generally expected inflation to come down through the year, \"though the pace and timing of this decline remained uncertain.\" They noted the impact tariffs were having on prices and said they expected the impact to wane as the year goes by.\"Most participants, however, cautioned that progress toward the Committee's 2 percent objective might be slower and more uneven than generally expected and judged that the risk of inflation running persistently above the Committee's objective was meaningful,\" the document said.At the meeting, the rate-setting FOMC adjusted some of the language in its post-meeting statement. The changes noted that the risks to inflation and the labor market had come more closely into balance, softening prior worries over the employment picture.Since the meeting, labor data has been a mixed bag, with indications that private sector job creation is slowing further and that the meager growth is coming almost entirely from the health-care sector. However, the unemployment rate dipped to 4.3% in January and nonfarm payroll growth was stronger than expected.On inflation, the Fed's key personal consumption expenditures prices metric has been mired around 3%. However, a report last week showed that the consumer price index when excluding food and energy prices was at its lowest in nearly five years.Futures traders are placing the best bet for the next cut to come in June, with another in September or October, according to the CME Group's FedWatch gauge.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Fed officials split on where interest rates should go, minutes say",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108258490-17696290002026-01-28t193552z_1476820447_rc2jaja3zs3e_rtrmadp_0_usa-fed.jpeg?v=1769629032&w=1920&h=1080"
      ],
      "datePublished": "2026-02-18T20:19:23.000Z",
      "dateModified": "2026-02-18T20:19:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump signs executive order to promote the production of weedkiller that's hated by MAHA",
    "url": "https://www.cnbc.com/2026/02/18/trump-executive-order-weedkiller-hated-by-maha.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108267004-1771447561313-gettyimages-2261820535-AFP_98463DJ.jpeg?v=1771447590&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-19T00:41:26.000Z",
    "description": "US President Donald Trump speaks during a Black History Month event in the East Room of the White House in Washington, DC, on Feb. 18, 2026. Saul Loeb",
    "body": "US President Donald Trump speaks during a Black History Month event in the East Room of the White House in Washington, DC, on Feb. 18, 2026. Saul Loeb | AFP | Getty ImagesPresident Donald Trump on Wednesday issued an executive order invoking the Defense Production Act to promote the domestic production of phosphorus and the weedkiller glyphosate, which he said is critical to both defense and food security.Glyphosate is often targeted by supporters of the Make America Healthy Again movement as a harmful chemical. Trump aligned with the MAHA movement after Secretary of Health and Human Services Robert F. Kennedy Jr. dropped out of the 2024 election.\"I find that ensuring robust domestic elemental phosphorus mining and United States-based production of glyphosate-based herbicides is central to American economic and national security,\" Trump said in the order. \"Without immediate Federal action, the United States remains inadequately equipped and vulnerable.\"Read more CNBC politics coverageBillionaire Les Wexner's congressional deposition over Jeffrey Epstein ties is underwayTrump administration sued for Stonewall Pride flag removal in New YorkPotomac River sewage spill: Trump says Democrats need to ask for his helpStephen Colbert says CBS blocked James Talarico interview from airGlyphosate has long been used in U.S. agriculture and has been the subject of controversy over alleged links to cancer. Bayer, the company that makes the glyphosate-based weedkiller Roundup, recently proposed paying $7.25 billion to settle lawsuits claiming the chemical causes cancer.Roundup products are seen for sale at a store in San Rafael, California.Josh Edelson | AFP | Getty ImagesPhosphorus, which is also covered in the order, is a precursor to the production of glyphosate and is also used in the manufacturing of certain military equipment. The order will require Agriculture Secretary Brooke Rollins to issue orders and regulations to implement the increased supply of phosphorus and glyphosate.A White House Fact sheet on the executive order said Trump signed it to \"ensure domestic production of elemental phosphorus and glyphosate-based herbicides, the loss of which would cripple critical supply chains.\"A lack of either chemical, the fact sheet said, could \"leave our defense industrial base and food supply vulnerable to hostile foreign actors,\" since there is only \"one domestic producer of elemental phosphorus and glyphosate-based herbicides.\"Kennedy once won a nearly $290 million case against Roundup producer Monsanto, which has since been bought by Bayer, for a man who alleged he developed cancer from using the weedkiller. Since being nominated as Trump's HHS chief, however, he has softened his tone on the chemical. \"We cannot take any step that will put a single farmer in this country out of business,\" he said during a hearing last year. \"There's a million farmers who rely on glyphosate.\"CNBC has reached out to HHS for comment. Monsanto said in a statement to CNBC that the executive order \"reinforces the critical need for U.S. farmers to have access to essential, domestically produced crop protection tools such as glyphosate.\"  \"We will comply with this order to produce glyphosate and elemental phosphorus,\" the company said. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump signs executive order to promote the production of weedkiller that's hated by MAHA",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108267004-1771447561313-gettyimages-2261820535-AFP_98463DJ.jpeg?v=1771447590&w=1920&h=1080"
      ],
      "datePublished": "2026-02-19T00:41:26.000Z",
      "dateModified": "2026-02-19T00:41:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump family says U.S. dollar needs an upgrade, and they are the ones to do it",
    "url": "https://www.cnbc.com/2026/02/18/trump-eric-don-jr-cryptocurrency-world-liberty-financial.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108266809-1771430608345-Trump8.jpg?v=1771454211&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-18T23:04:36.000Z",
    "description": "Donald Trump Jr. (L) and Eric Trump speaking on Squawk on the Street on Feb. 18, 2026.CNBCSince the dollar was created in 1792, U.S. presidents and th",
    "body": "Donald Trump Jr. (L) and Eric Trump speaking on Squawk on the Street on Feb. 18, 2026.CNBCSince the dollar was created in 1792, U.S. presidents and their families have generally been content with the status quo of effectively giving the national government a monopoly on issuing currency and outlawing the use of foreign currency.Consider the launch of the dollar the country's Initial Coin Offering. Back when the U.S. government was hustling to surpass the dominance of the Spanish pieces of eight then in common circulation throughout the country.When presidents have said anything about the dollar itself, it was generally to reiterate the U.S. government's \"strong dollar\" policy.That continued more or less uninterrupted through 46 presidencies  — until last March, when a company partly owned by President Donald Trump and his family began to market an alternative to the dollar, a cryptocurrency dubbed \"USD1.\"Now, the president's two oldest sons are telling CNBC on the sidelines of a day-long crypto event they hosted why that should change.Marketed as a stablecoin, USD1's value would track the dollar, much as the dollar when it was created in 1792 was initially pegged to the value of the then-dominant Spanish silver dollar.The Trumps' company, World Liberty Financial, touts USD1 as an improvement on official U.S. currency. The firm's website brands its stablecoin as \"The Dollar. Upgraded.\" And it calls the coin \"still the US dollar, but for a new era.\"On Wednesday, the firm held its first World Liberty Forum at Mar-a-Lago, the club owned by President Trump and operated as his winter White House.The event, coming just before the first anniversary of the release of USD1, brought together financiers, technologists, television personalities, the president of the world soccer organization FIFA and the artist Nicki Minaj.From a Mar-a-Lago ballroom stage beneath an enormous stylized golden eagle sculpture, the message to attendees was that the old U.S. dollar needs to be modernized, that the private sector is the place to drive that innovation, and that stablecoins will help taxpayers by creating structural demand for U.S. government debt.In fact, World Liberty backers argue, the new cryptocurrency they are building is not a threat to the dollar at all, but will help ensure the dollar remains dominant in global crypto finance – because USD1's value is pegged to it.But one big question is why, if the dollar needs modernizing, should that be done by the private sector.Read more CNBC politics coverageBillionaire Les Wexner's congressional deposition over Jeffrey Epstein ties is underwayTrump administration sued for Stonewall Pride flag removal in New YorkPotomac River sewage spill: Trump says Democrats need to ask for his helpStephen Colbert says CBS blocked James Talarico interview from airAnd why should the venture be in the private hands of the president and his family, and not in the hands of the U.S. Treasury.CNBC put those questions to the president's sons, World Liberty Financial's co-founders, Donald Trump Jr. and Eric Trump, in a small event space just off Mar-a-Lago's swimming pool.\"This is actually going to preserve dollar hegemony,\" Donald Trump Jr. replied.\"There's crypto companies that are the top five buyers in the world,\" he said. \"That's going to actually stabilize the US dollar and do all the things that we need to.\"He argued the federal government — and the big Wall Street banking system — simply aren't nimble or innovative enough to drive the needed changes.\"We're going to lead the way as Americans,\" Eric Trump said. \"You're going to leave that to who, JPMorgan, to do? You're going to leave that to the federal government to do?\"Eric Trump sees Wall Street as overly complacent – and therefore ripe for technological disruption.\"Do you think big banks will actually do this?\" he asked. \"And the reason I say this is, I mean, it's been 50 years, where bankers are working six hours a day. They have a two-hour lunch break. They're typically out of the office at four o'clock in the afternoon.\"Eric and Donald Jr. make it clear the animating force behind their venture is not the inventor's glee at building a better mousetrap or the insider's frustration at legacy companies that can't or won't adapt to the future.Instead, what's driving them is a raw sense of retribution.The Trump brothers see the wider financial system as part of an establishment that unfairly ostracized them after their father left power in 2021, when, after the Jan. 6, 2021, U.S. Capitol riot, the banking system broadly declined to do business with the Trump family.\"You know, we didn't get into crypto because we were on the leading edge,\" Donald Trump Jr. said in an interview Wednesday with CNBC's Sara Eisen. \"We got into it out of necessity. They basically forced us into it.\"Eric Trump told Eisen, \"We were the most cancelled people in the world in 2020, 2021 and it's really great to almost have this retribution where all of a sudden we start pushing an agenda.\"\"Our agenda was to modernize finance, to allow that to never ever, ever happen to anybody again,\" Eric Trump said.Donald Trump Jr. said he concluded that the traditional banking system is a \"Ponzi scheme.\"\"They created this monster,\" Trump Jr. said, pointing to the moment when he claimed \"when you had every big bank in the world, for doing nothing wrong,\" \"debank\" Trump accounts and those of other conservatives, \"just based on the fact that we all wore a hat that said 'Make America Great Again.'\"Eric Trump recalled his father's time out of the White House between presidential terms as a traumatizing period for the family.\"These are commercial buildings, residential buildings, golf courses around the world. These aren't political entities, and they were pulling these accounts from us like we were absolute dogs,\" Eric Trump said.\"We couldn't pay our vendors, we couldn't pay our employees. And so we said, listen, there has to be a better way.\"To Eric Trump, the message is that the Trump family will always counterpunch: When social media companies kicked his father off their platforms, President Trump created his own Truth Social media platform. And when the banking industry declined Trump family business, the family took matters into their own hands.And that's why a president's family, for the first time since 1792, is creating an upgraded American currency.Call it Truth Dollar.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump family says U.S. dollar needs an upgrade, and they are the ones to do it",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108266809-1771430608345-Trump8.jpg?v=1771454211&w=1920&h=1080"
      ],
      "datePublished": "2026-02-18T23:04:36.000Z",
      "dateModified": "2026-02-18T23:04:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Oil jumps 4% after Vance says Iran ignored key U.S. demands, military strikes on the table",
    "url": "https://www.cnbc.com/2026/02/18/oil-prices-today-iran-trump-nuclear-talks.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108242455-17659008002025-12-16t155914z_31398013_rc2qhia1zy1a_rtrmadp_0_usa-vance-pennsylvania.jpeg?v=1765900817&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-18T20:00:36.000Z",
    "description": "watch nowOil prices rose more than 4% on Wednesday, after Vice President JD Vance said Iran did not address U.S. red lines in nuclear talks this week ",
    "body": "watch nowOil prices rose more than 4% on Wednesday, after Vice President JD Vance said Iran did not address U.S. red lines in nuclear talks this week and President Donald Trump reserves the right to use military force.U.S. crude oil rose $2.86, or 4.59%, to close at $65.19 per barrel. Global benchmark Brent was up $2.93, or 4.35%, to settle at $70.35 per barrel. U.S. envoys Steve Witkoff and Jared Kushner held nuclear talks with Iran in Geneva on Tuesday. Iran's foreign minister, Abbas Araghchi, described the discussions as \"constructive,\" according to Iranian media.  Araghchi said the talks yielded a general agreement on guiding principles.Oil prices closed lower Tuesday as traders interpreted the foreign minister's comments as a sign that the U.S. and Iran could still reach a settlement. But Vance said Tehran had failed to address core U.S. demands. \"In some ways it went well, they agreed to meet afterwards,\" the vice president told Fox News on Tuesday evening. \"But in other ways it is very clear that the president has set some red lines that the Iranians are not yet willing to actually acknowledge and work through.\"Trump reserves the right to use force if diplomacy does not succeed in stopping Iran's nuclear program, Vance said. \"We do have a very powerful military — the president has shown a willingness to use it,\" the vice president told Fox News. Sources told Axios, meanwhile, that a U.S. military campaign against Iran would likely be massive, last weeks and look more like a full-fledged war than the raid that captured Venezuelan President Nicolás Maduro in January. Iran's Revolutionary Guard conducted war games this week in the Strait of Hormuz, a vital trade choke point for global oil flows. About one-third of all waterborne crude exports pass through the narrow waterway, according to data from energy consulting firm Kpler. The market is worried those oil flows would be disrupted if the U.S. and Iran go to war. Iranian state media said traffic in part of the strait was closed Tuesday due to the military exercises. Kpler did not observe any halt in traffic in the strait on Tuesday, said Matt Smith, an oil analyst at the firm.Trump has stationed the USS Abraham Lincoln aircraft carrier in the Middle East. The USS Gerald Ford is en route to the region.Trump said Friday he deployed the second aircraft carrier in case negotiations fail. \"If we don't have a deal, we'll need it,\" the president told reporters outside the White House. The Iranian government did not immediately respond to CNBC's request for comment.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Oil jumps 4% after Vance says Iran ignored key U.S. demands, military strikes on the table",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108242455-17659008002025-12-16t155914z_31398013_rc2qhia1zy1a_rtrmadp_0_usa-vance-pennsylvania.jpeg?v=1765900817&w=1920&h=1080"
      ],
      "datePublished": "2026-02-18T20:00:36.000Z",
      "dateModified": "2026-02-18T20:00:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Hassett says authors of New York Fed tariff study should be disciplined: 'Worst paper I've ever seen'",
    "url": "https://www.cnbc.com/2026/02/18/hassett-says-authors-of-new-york-fed-tariff-study-should-be-disciplined-worst-paper-ive-ever-seen.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108251149-1771435744205-108251149-1768229009677-gettyimages-2255395090-FED_DOJ_SUBPOENAS.jpeg?v=1771435785&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-18T19:16:09.000Z",
    "description": "watch nowWhite House economic advisor Kevin Hassett said Wednesday that the authors of a recent New York Federal Reserve paper that found U.S. compani",
    "body": "watch nowWhite House economic advisor Kevin Hassett said Wednesday that the authors of a recent New York Federal Reserve paper that found U.S. companies and consumers are shouldering most of the tariff burden should be \"disciplined.\"In a CNBC interview, the National Economic Council director ripped the report, saying that central bank researchers ignored key aspects of how the duties worked and instead simply focused on prices. Hassett said the research also should have included the upward impact on wages and benefits that U.S. companies see by bringing more production onshore.\"I mean, the paper is an embarrassment,\" Hassett said during the \"Squawk Box\" interview. \"It's, I think, the worst paper I've ever seen in the history of the Federal Reserve system. The people associated with this paper should presumably be disciplined, because what they've done is they've put out a conclusion which has created a lot of news that's highly partisan based on analysis that wouldn't be accepted in a first-semester econ class.\"The paper in question was published Feb. 12 on the New York Fed's website.Essentially, the researchers looked at whether countries that export products to the U.S. were lowering their prices, or in effect eating the tariffs, or raising their prices and passing them onto consumers and companies. The paper found that some 90% of the added costs from tariffs were being passed on, though it noted that the impact waned slightly as the year progressed.However, Hassett insisted that the tariffs had little impact on prices and were responsible for a better standard of living.\"Prices have gone down. Inflation is down over time. Import prices dropped a lot in the first half of the year, that leveled off, and real wages were up $1,400 on average last year, which means that consumers were made better off by the tariffs,\" he said. \"So consumers couldn't have been made better off by the tariffs, if this New York Fed analysis was correct. It's really just an embarrassment. I can't imagine who signed off on it.\"The consumer price index in January rose 2.4% from a year ago and is up nearly 2% from April 2025, when President Donald Trump first announced the tariffs. The core CPI, which excludes food and energy, was up 2.5% in January, its lowest annual gain since March 2021. Import prices in December were flat from a year ago while export prices rose 3.1%, according to the Bureau of Labor Statistics.A New York Fed official declined comment.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Hassett says authors of New York Fed tariff study should be disciplined: 'Worst paper I've ever seen'",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108251149-1771435744205-108251149-1768229009677-gettyimages-2255395090-FED_DOJ_SUBPOENAS.jpeg?v=1771435785&w=1920&h=1080"
      ],
      "datePublished": "2026-02-18T19:16:09.000Z",
      "dateModified": "2026-02-18T19:16:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump administration releases $127 million in overdue funds for New York-New Jersey Gateway tunnel project president called a 'future boondoggle'",
    "url": "https://www.cnbc.com/2026/02/18/gateway-trump-funding-new-york-jersey-tunnel-hochul.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108266240-1771333990288-gettyimages-2259673463-US-NEWS-TRUMP-NY-NJ-TUNNEL-PROJECT-NY.jpeg?v=1771334027&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-18T21:55:14.000Z",
    "description": "The Gateway Tunnel site near W. 30th St. and 11th Ave. in Hudson Yards, Manhattan on Oct. 23, 2025. Barry Williams | New York Daily News | Getty Image",
    "body": "The Gateway Tunnel site near W. 30th St. and 11th Ave. in Hudson Yards, Manhattan on Oct. 23, 2025. Barry Williams | New York Daily News | Getty ImagesThe Trump administration on Wednesday released the rest of the funds it had been withholding for the construction of a major rail tunnel between Manhattan and New Jersey, New York Gov. Kathy Hochul said Wednesday.The federal government freed up the remaining $98 million due for the Gateway project that is increasing passenger rail capacity into Manhattan, as well as an additional $30 million in reimbursements for work that had been completed in January, Hochul said in a statement.The frozen funds were released in tranches over nearly two weeks after a federal judge blocked the Trump administration from withholding the money for the project that began construction in 2023. In compliance with that Feb. 6 order, the administration released $30 million on Feb. 13, followed by an additional $77 million earlier this week.The funding suspension, initiated on the eve of the Oct. 1 government shutdown, this month triggered a total work stoppage that threatened nearly 1,000 employees' jobs.Contractors are now being told to prepare to resume construction next week, the Democratic governor said in Wednesday's statement.\"Today's progress is significant, but we need certainty that Gateway funding will remain in place for the duration of the project,\" Hochul said. \"The federal government has a legal obligation to fully fund Gateway, and New York will accept nothing less.\"Read more CNBC politics coverageBillionaire Les Wexner's congressional deposition over Jeffrey Epstein ties is underwayTrump administration sued for Stonewall Pride flag removal in New YorkPotomac River sewage spill: Trump says Democrats need to ask for his helpStephen Colbert says CBS blocked James Talarico interview from airJust two days earlier, President Donald Trump had slammed the project as a \"future boondoggle,\" claiming in a Truth Social post that it will cost \"many BILLIONS OF DOLLARS more than projected or anticipated.\"The federal government will not be responsible for any cost overruns associated with the $16 billion project, Trump asserted. In the same post, he denied reports that he had offered to release Gateway's federal funding on the condition that New York's Penn Station be renamed after himself. The station is named for its builder and original occupant — the Pennsylvania Railroad.\"These funds should never have been withheld in the first place,\" said New York Attorney General Letitia James, who had sued the Trump administration in conjunction with New Jersey acting Attorney General Jennifer Davenport.\"I am thrilled that hardworking New Yorkers can now get back on the job and move forward with the most important infrastructure project in the country,\" James said in a press release. \"We will remain vigilant to ensure this funding continues uninterrupted, so that workers and commuters are never again left in limbo by the president's targeted and unlawful whims.\"The Hudson River tunnel project is the most important piece of the Gateway program, which aims to renovate a slew of public infrastructure in New York and New Jersey.The existing rail tunnel, known as the North River Tunnel, carries 200,000 passengers under the Hudson every day. It was constructed 116 years ago and was in need of repair even before 2012's Superstorm Sandy significantly damaged it, officials say.The Gateway project would fix the existing tunnel and create a new rail tunnel with two tracks connecting to Penn Station. The federal government and New York and New Jersey are funding the tunnel project. Amtrak has also committed over $1 billion to the project.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump administration releases $127 million in overdue funds for New York-New Jersey Gateway tunnel project president called a 'future boondoggle'",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108266240-1771333990288-gettyimages-2259673463-US-NEWS-TRUMP-NY-NJ-TUNNEL-PROJECT-NY.jpeg?v=1771334027&w=1920&h=1080"
      ],
      "datePublished": "2026-02-18T21:55:14.000Z",
      "dateModified": "2026-02-18T21:55:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Microsoft’s Brad Smith says U.S. tech should ‘worry a little’ about Chinese firms' government subsidies",
    "url": "https://www.cnbc.com/2026/02/18/microsoft-president-brad-smith-chinese-ai-subsidies.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108222141-1762391153945-gettyimages-2217904928-20090101250604-99-60977.jpeg?v=1771426451&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-18T16:31:38.000Z",
    "description": "Microsoft President Brad Smith speaks at a press conference at the Representation of the State of North Rhine-Westphalia about future visions for the ",
    "body": "Microsoft President Brad Smith speaks at a press conference at the Representation of the State of North Rhine-Westphalia about future visions for the development and application of artificial intelligence in education in NRW in Berlin on June 4, 2025.Soeren Stache | Picture Alliance | Getty ImagesAmerican tech companies should \"worry a little bit\" about the subsidies their Chinese competitors receive from their government in the AI race, Microsoft President Brad Smith told CNBC.As competition between U.S. and Chinese companies intensifies to develop the most advanced models, Smith said that the U.S. has \"an advantage in terms of access to the most powerful chips in the world\" and \"other technology innovation.\"But, speaking in an interview on the sidelines of the AI Impact Summit in New Delhi, India, he also said: \"I do think we always have to think about, maybe even worry a little bit about Chinese subsidies.\"Chinese AI companies have been supported by their government with measures such as a multi-billion-dollar national investment fund and vouchers for cheaper energy for their computing needs. Smith's warning comes after Chinese firms released a slew of models over the past two weeks, and their lower-cost AI models could be attractive in developing nations.Smith said subsidies from Beijing to Chinese companies were \"the fundamental approach that China successfully took to disrupt the telecommunications market,\" when state money and support helped companies like Huawei and ZTE expand.\"Some American companies disappeared. European companies like Ericsson and Nokia were thrown on the defensive,\" Smith added. Smith said data centers from Chinese firms Huawei and Alibaba exist around the world and \"it will not be difficult for China to subsidize those.\"\"I think for the rest of us, we have to compete with that, and we have to be good at competing with that, with the support of our governments,\" Smith said.CNBC approached Alibaba and Huawei for comment about whether they have accepted Chinese state subsidies but had not received a response as this article went live.Alibaba's cloud computing division, through which it sells its AI services, operates globally. But outside China, it doesn't always build data centers, instead partnering with other infrastructure players. How China supports its tech companiesBeijing launched a 60.06 billion yuan ($8.42 billion) national AI fund last year to invest in early-stage projects.Cities across the country, from Shanghai to the tech hub of Shenzhen, have offered \"vouchers\" to reduce the cost for companies looking to rent computing power.Cheap energy has been another advantage for Chinese companies that are trying to build out the power-hungry infrastructure needed to train and run AI models.Microsoft on Wednesday said it was on pace to invest $50 billion by the end of the decade to help bring AI to developing countries in the \"Global South,\" which includes investments in infrastructure and reskilling.Rory Green, TS Lombard's chief China economist, told CNBC this week that a \"China tech sphere\" could easily form in developing countries.\"For these economies, I think the choice is fairly simple, and you could see easily a world where maybe most of the world's population is running on a Chinese tech stack in five to 10 years' time,\" Green said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Microsoft’s Brad Smith says U.S. tech should ‘worry a little’ about Chinese firms' government subsidies",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108222141-1762391153945-gettyimages-2217904928-20090101250604-99-60977.jpeg?v=1771426451&w=1920&h=1080"
      ],
      "datePublished": "2026-02-18T16:31:38.000Z",
      "dateModified": "2026-02-18T16:31:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "FDA agrees to review Moderna’s mRNA flu vaccine application in a reversal",
    "url": "https://www.cnbc.com/2026/02/18/fda-agrees-to-review-modernas-flu-shot-application-after-refusal.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108000894-1771434677666-108000894-1719932078582-gettyimages-2151784856-MODERNA_RSV_VACCINE.jpg?v=1771437699&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-18T18:21:04.000Z",
    "description": "A researcher works in the lab at the Moderna headquarters in Cambridge, Massachusetts, March 26, 2024.Adam Glanzman | Bloomberg | Getty ImagesModerna ",
    "body": "A researcher works in the lab at the Moderna headquarters in Cambridge, Massachusetts, March 26, 2024.Adam Glanzman | Bloomberg | Getty ImagesModerna said on Wednesday that the Food and Drug Administration has agreed to review its experimental mRNA flu shot, reversing the agency's earlier decision to refuse to accept the application in a move that stunned Wall Street and the medical community. The announcement clears a path forward for the vaccine, which is key to Moderna's experimental combination Covid-flu jab and the company's goal of breaking even by 2028. The FDA is slated to make a decision on the flu shot on Aug. 5, which would enable Moderna to make the vaccine available for the upcoming influenza season. \"Pending FDA approval, we look forward to making our flu vaccine available later this year so that America's seniors have access to a new option to protect themselves against flu,\" said Moderna CEO Stéphane Bancel in a release. Shares of the biotech company rose more than 6% on Wednesday. Moderna said it had a \"constructive\" meeting with the FDA and proposed a revised regulatory approach that addresses criticisms the agency made when refusing to accept the application last week, tailoring its new proposal to an older population.Under the new approach, Moderna is seeking full approval for the shot in adults ages 50 to 64 and an accelerated approval of the shot for people 65 and up. The latter means that upon approval, Moderna will have to conduct an additional post-marketing study in older adults to confirm the vaccine's benefits. In a statement, Health and Human Services spokesperson Andrew Nixon confirmed that the FDA has accepted the modified application.The agency specifically took issue with Moderna's decision to compare its product to a standard, approved flu shot in a Phase 3 trial, arguing that it \"does not reflect the best-available standard of care\" in the U.S. The FDA's previous feedback expressed a preference for Moderna to use a higher-dose vaccine for older adults as a comparator in the trial.In an interview with CNBC on Wednesday before the announcement, FDA Commissioner Dr. Marty Makary did not indicate that the agency would reverse course. But he emphasized that the FDA reviewed the application and the initial late-stage trial on the shot when it came in, so \"it's a little bit of a misnomer to say that it was not looked at.\"Makary said the agency's guidance to Moderna on its mRNA-based flu shot \"was pretty clear.\" He said the FDA recommended that the group of participants ages 65 and up in the study who didn't take Moderna's shot receive the \"standard of care, not the substandard of care\" as a comparison product. Moderna has disputed that reasoning, noting that FDA rules and guidance do not actually require trials to use the most advanced or highest-dose vaccine as a comparator in clinical studies. The company also said it was inconsistent with the FDA's prior written communication about the trial design, even before the study began, where the agency said using the standard flu shot would be \"acceptable.\"The saga follows sweeping changes to U.S. immunization policy and regulation over the past year under Health and Human Services Secretary Robert F. Kennedy Jr., a prominent vaccine skeptic. Moderna last week said the decision specifically stemmed from the FDA's top vaccine regulator, Vinay Prasad, who returned to the agency in August after being ousted. Prasad, who heads the agency's Center for Biologics Evaluation and Research has been vocal about tightening regulations for vaccines and recently linked child deaths to Covid shots without evidence. Last week, Moderna released a so-called Refusal to File letter from the FDA that was signed by Prasad on Feb. 3. HHS does not typically share those letters, and the agency has not provided any details on who drove the decision-making on the company's application. When asked about his stance on mRNA technology, which Kennedy and some of his supporters have criticized as unsafe, Makary told CNBC on Wednesday that he's \"hopeful and optimistic\" about the platform but would also \"like to see the data.\" \"We're not going to get ahead of the game,\" he said. \"We're going to basically say, we'd like to see the data, how far mRNA technology can be applied is a question where we'd love to see it applied, as far as it can be applied, but it's got to meet our scientific standards, so we'll see what it gets with cancer, with other infectious diseases. ...\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "FDA agrees to review Moderna’s mRNA flu vaccine application in a reversal",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108000894-1771434677666-108000894-1719932078582-gettyimages-2151784856-MODERNA_RSV_VACCINE.jpg?v=1771437699&w=1920&h=1080"
      ],
      "datePublished": "2026-02-18T18:21:04.000Z",
      "dateModified": "2026-02-18T18:21:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Mortgage rates sink to the lowest level in a month, sparking more refinance demand",
    "url": "https://www.cnbc.com/2026/02/18/mortgage-rates-sink-to-the-lowest-level-in-a-month-sparking-more-refinance-demand.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108263429-1770657500855-gettyimages-2255674987-261114_to_016.jpeg?v=1770657589&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-18T13:06:14.000Z",
    "description": "In an aerial view, two-story single family homes line the streets on Jan. 14, 2026 in Thousand Oaks, California. Kevin Carter | Getty ImagesMortgage i",
    "body": "In an aerial view, two-story single family homes line the streets on Jan. 14, 2026 in Thousand Oaks, California. Kevin Carter | Getty ImagesMortgage interest rates dropped last week to the lowest level in a month, prompting more current borrowers to seek savings in a refinance. While lower rates didn't give potential buyers much incentive, the run on refinances was enough to push total mortgage demand 2.8% higher compared with the previous week, according to the Mortgage Bankers Association's seasonally adjusted index. The average contract interest rate for 30-year fixed-rate mortgages with conforming loan balances, $832,750 or less, decreased to 6.17% from 6.21%, with points remaining unchanged at 0.56, including the origination fee, for loans with a 20% down payment. \"Treasury yields ended the week lower as weaker data on retail sales and home sales outweighed better-than-expected readings on the job market for January,\" said Joel Kan, vice president and deputy chief economist at the MBA, in a release. As a result, applications to refinance a home loan rose 7% for the week and were 132% higher than the same week one year ago. Last year, rates were 76 basis points higher. While that annual jump may seem large, refinancing was at extremely low levels at this time last year. \"Refinance applications increased across all loan types, marking the strongest week for refinancing since mid-January,\" Kan added.Get Property Play directly to your inboxCNBC's Property Play with Diana Olick covers new and evolving opportunities for the real estate investor, delivered weekly to your inbox.Subscribe here to get access today.Applications for a mortgage to purchase a home dropped 3% for the week and were just 8% higher than the same week one year ago. While lower mortgage rates are making homes slightly more affordable, new supply is not coming onto the market fast enough, and concern over the broader economy has consumers sitting on the sidelines. Mortgage rates didn't move at all to start this holiday-shortened week, but economic data set for release this week could impact the current trajectory. In general, however, mortgage rates have been hovering in a pretty narrow range, between 6% and 6.25%, since the start of this year. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Mortgage rates sink to the lowest level in a month, sparking more refinance demand",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108263429-1770657500855-gettyimages-2255674987-261114_to_016.jpeg?v=1770657589&w=1920&h=1080"
      ],
      "datePublished": "2026-02-18T13:06:14.000Z",
      "dateModified": "2026-02-18T13:06:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Leavitt: Trump concerned with Potomac River sewage stench, with America 250 celebrations planned for summer",
    "url": "https://www.cnbc.com/2026/02/18/trump-potomac-river-sewage-stench-america-250.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108266410-1771349703081-gettyimages-2262012039-_s011363_ysjypw54.jpeg?v=1771349861&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-18T20:27:13.000Z",
    "description": "Earthen barriers near Lock 10 on the C&O Canal help redirect sewage back into the Potomac Interceptor after a section of the six-foot-wide sewage pipe",
    "body": "Earthen barriers near Lock 10 on the C&O Canal help redirect sewage back into the Potomac Interceptor after a section of the six-foot-wide sewage pipe collapsed last month between the Clara Barton Parkway and the canal on Feb. 16, 2026 in Cabin John, Maryland.Chip Somodevilla | Getty ImagesPresident Donald Trump is worried the stench of the Potomac River will put America 250 celebrations in a funk after a sewage pipe collapse near Washington, D.C. dumped hundreds of millions of gallons of raw sewage into the river, White House Press Secretary Karoline Leavitt said Wednesday. \"He is worried about that, which is why the federal government wants to fix it, and we hope that the local authorities will cooperate with us in doing so,\" Leavitt said during a press briefing at the White House when asked if the president was worried about Washington, D.C. smelling like waste during celebrations for the nation's 250th anniversary. The administration has a slew of events planned for the 250th anniversary of the United States, culminating in Independence Day celebrations on July 4. Many of the events will take place in Washington, D.C., which sits on the Potomac, and are likely to draw crowds of travelers. Leavitt said the White House is still waiting on local governments in Maryland, Virginia and Washington, D.C. to ask for federal help in cleaning up the mess. Trump has repeatedly blamed Democratic leadership in the two states and D.C. for the spill and has demanded they ask \"politely\" for federal assistance. Trump has singled out Gov. Wes Moore of Maryland over the spill. The president also recently snubbed Moore from a National Governors' Association event at the White House. Leavitt doubled down on the president's badgering of Moore on Wednesday.\"There has been no improvement under the leadership of Gov. Moore,\" Leavitt said. \"He's clearly shown he's incapable of fixing this problem, which is why President Trump and the federal government are standing by to step in.\"Leavitt's comments also add to a messy political fight that erupted this week over the spill, pitting Moore against Trump. Moore, who is the nation's only Black governor, a frequent Trump foil, and often floated as a potential presidential contender in 2028, has asserted the failed pipe is within the jurisdiction of federal authorities. President Donald Trump (L) and Maryland Gov. Wes MooreGetty Images | Reuters\"The sewage pipe that he is talking about is on federal land,\" Moore said Wednesday at a Maryland Board of Public Works meeting. \"And over these past four weeks, the Trump-Vance administration has failed to act.\"\"To blame Maryland in this when this is a D.C. pipe on federal land is asinine, it is disingenuous, absurd and politically motivated,\" Moore said. Read more CNBC politics coverageBillionaire Les Wexner's congressional deposition over Jeffrey Epstein ties is underwayTrump administration sued for Stonewall Pride flag removal in New YorkPotomac River sewage spill: Trump says Democrats need to ask for his helpStephen Colbert says CBS blocked James Talarico interview from airThe pipe that collapsed is owned and operated by DC Water, an independent public utility that has been handling the repairs. It is part of the Potomac Interceptor sewer line and is located alongside the Clara Barton Parkway in Maryland, just outside of the capital city. At least 200 million gallons of wastewater flooded into the Potomac after the pipe breach. Moore on Wednesday also responded to Trump's demands for him and other local Democratic leaders to ask for help. \"If the president wants me to ask nicely, my response is this: please, Mr. President, do your job,\" Moore said. Leavitt said she would relay Moore's response to Trump and that the administration is drawing up plans to help in the recovery effort. \"I'll ask the President, and we will provide you with the next steps,\" Leavitt said at the Wednesday press briefing. \"But in all seriousness, the federal government has been preparing plans.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Leavitt: Trump concerned with Potomac River sewage stench, with America 250 celebrations planned for summer",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108266410-1771349703081-gettyimages-2262012039-_s011363_ysjypw54.jpeg?v=1771349861&w=1920&h=1080"
      ],
      "datePublished": "2026-02-18T20:27:13.000Z",
      "dateModified": "2026-02-18T20:27:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump fans flames of election access as Republican support grows for national voter ID mandate",
    "url": "https://www.cnbc.com/2026/02/18/trump-elections-save-act-congress-voter-id.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108266267-1771336733926-gettyimages-2220313126-tas18780_e7lkl4df.jpeg?v=1771455412&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-18T23:18:33.000Z",
    "description": "President Donald Trump stops and talks to the media before he boards Marine One on the South Lawn at the White House in Washington, June 15, 2025.Taso",
    "body": "President Donald Trump stops and talks to the media before he boards Marine One on the South Lawn at the White House in Washington, June 15, 2025.Tasos Katopodis | Getty ImagesPresident Donald Trump is escalating his crusade for voter identification requirements after last week's promise of an executive order to implement such a mandate before November's midterm elections.White House press secretary Karoline Leavitt in a briefing Wednesday said Trump is \"discussing and exploring legal options for a potential executive order with respect to voter ID,\" days after Trump said he would find a way to require voters to present identification across the U.S., \"whether approved by Congress or not!\"Leavitt's comments followed a Tuesday night Trump Truth Social post of an article about a local elected official urging the Georgia state government to take over voting in Fulton County, the target of a recent FBI raid and a precinct that Trump lost to Joe Biden in 2020. Trump is planning to travel to a different part of Georgia on Thursday to talk about the economy.Trump's recent fixation on elections and congressional Republicans' willingness to largely fall in line are raising alarms for Democrats and voting rights groups, who see the recent moves as a potential existential threat to American elections and an extension of Trump's past election denialism. The topic has apparently been front of mind for the president. In a series of reposts on Truth Social that followed his initial post Wednesday, Trump shared unfounded claims about irregularities in the 2020 election. \"[Democrats] don't want voter ID because they want to cheat at elections,\" Trump told reporters on Air Force One on Monday. \"If you had voter ID, if you had proof of citizenship, they could never win an election. And they know that. And they're fighting them to the hilt.\"Read more CNBC politics coverageBillionaire Les Wexner's congressional deposition over Jeffrey Epstein ties is underwayTrump administration sued for Stonewall Pride flag removal in New YorkPotomac River sewage spill: Trump says Democrats need to ask for his helpStephen Colbert says CBS blocked James Talarico interview from air\"When [Republicans] win an election, they win fair and square,\" Rep. Greg Stanton, D-Ariz., said in an interview this week. \"But then when they lose elections, Donald Trump likes to say it was based on fraud.\"Stanton is the chair of the New Democrat Coalition Action Fund, a political action committee that works to get moderate Democrats elected to the U.S. House. He called Trump's threat to unilaterally impose voter ID requirements \"purely bluster.\"Rep. Joe Morelle, D-N.Y., the top Democrat on the House Administration Committee, similarly said \"the Constitution is pretty clear.\"\"Time, place and manner of elections shall be up to the states … Congress may at its discretion get involved as well. But there's no role for the president,\" Morelle said in an interview Wednesday.SAVE America Act moves to the SenateMeanwhile, support is growing among the Senate GOP for a bill that would require proof of citizenship to register to vote and the presenting of identification to cast a ballot.The SAVE America Act targets noncitizen voting, which is already illegal and exceedingly rare, and requires voter ID. It advanced out of the House last week on a 218-213 vote, with just one Democrat, Rep. Henry Cuellar of Texas, voting in favor. Both of the bill's main components are broadly popular, according to public polling. But opponents say the legislation could disenfranchise millions and create barriers to voting for minorities, college students and married women who changed their last names.While some congressional Republicans have shown a willingness to buck Trump in recent months on things like tariffs and Affordable Care Act subsidies, most have followed his lead on elections.Sen. Lisa Murkowski, R-Alaska, is the lone Senate Republican to publicly oppose the bill, while nearly all of her GOP colleagues have signed on.Still, the measure faces an uphill climb in the Senate, where rules require 60 votes to overcome a filibuster, meaning more than a handful of Democrats would have to vote with their Republican colleagues to advance the legislation.GOP proponents of the bill, including its lead sponsor Sen. Mike Lee, R-Utah, have called for changing the filibuster rule to allow a simple majority to prevail. Senate Majority Leader John Thune, R-S.D., has promised a vote on the SAVE America Act, which he supports, but has been cool to the idea of changing the filibuster. Meanwhile, a second, even broader election reform proposal has cropped up in the House. In addition to requiring voter ID and proof of citizenship, the Make Elections Great Again Act, introduced by Rep. Bryan Steil, R-Wis., in January, would disqualify mail-in ballots received after the close of polls on Election Day, require states to use auditable paper ballots, and ban ballot harvesting, ranked choice voting and universal vote-by-mail. A spokesperson for House Speaker Mike Johnson, R-La., declined to comment when asked if the speaker planned to bring the MEGA Act to the floor, instead referring to the speaker's past comments on the passage of the SAVE America Act. The House Administration Committee, which Steil chairs, held a hearing on the MEGA Act last week.During a recent appearance on Fox Business after House passage of the SAVE America Act, Steil said Republicans \"need to build on that work.\"\"I think we need to clean up our voter rolls. I think we should make sure that ballots are in by the end of Election Day. We need proper, auditable ballots. The list goes on,\" Steil said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump fans flames of election access as Republican support grows for national voter ID mandate",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108266267-1771336733926-gettyimages-2220313126-tas18780_e7lkl4df.jpeg?v=1771455412&w=1920&h=1080"
      ],
      "datePublished": "2026-02-18T23:18:33.000Z",
      "dateModified": "2026-02-18T23:18:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump lauds Japan’s pledge to invest $36 billion in U.S. oil, gas and critical mineral projects",
    "url": "https://www.cnbc.com/2026/02/18/trump-us-japan-oil-gas-mineral-projects-trade-deal.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108266616-1771401074830-gettyimages-2243738157-ah702329_8i2ufjny.jpeg?v=1771401144&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-18T13:03:53.000Z",
    "description": "U.S. President Donald Trump speaks to journalists aboard Air Force One en route to South Korea on October 29, 2025 in Japan.Andrew Harnik | Getty Imag",
    "body": "U.S. President Donald Trump speaks to journalists aboard Air Force One en route to South Korea on October 29, 2025 in Japan.Andrew Harnik | Getty Images News | Getty ImagesU.S. President Donald Trump has welcomed Japan's pledge to invest nearly $36 billion in oil, gas and critical mineral projects in Texas, Ohio and Georgia. The commitment represents the first tranche of investments by Japan following a landmark trade deal between the two countries, one in which Tokyo pledged to invest $550 billion in American-based projects and Trump cut tariffs on most Japanese imports to 15%.\"Our MASSIVE Trade Deal with Japan has just launched!\" Trump said Tuesday in a social media post.\"The scale of these projects are so large, and could not be done without one very special word, TARIFFS,\" he added. Japanese Prime Minister Sanae Takaichi said the projects strengthen the Japan-U.S. alliance and were expected to bring increased sales and business expansion for Japanese companies.\"We believe these initiatives truly embody the purpose of this Strategic Investment Initiative, namely the promotion of mutual benefit between Japan and the United States, the enhancement of economic security, and the promotion of economic growth,\" Takaichi said in a post on X, according to a Google translation.By far the largest investment is a natural gas facility in Ohio that's expected to generate 9.2 gigawatts of power.U.S. Commerce Secretary Howard Lutnick said the Portsmouth Powered Land Project, valued at $33 billion and operated by SB Energy, a subsidiary of Japan's SoftBank, would be \"the largest natural gas generation facility in history.\" Read moreThe White House said Japan would also finance a $2.1 billion deepwater crude oil export facility off the Texas coast. At full capacity, the Texas GulfLink project is expected to generate up to $30 billion in annual U.S. crude exports. Dallas-based energy infrastructure group Sentinel Midstream is developing the project. The Commerce Department said the third major project refers to plans to create a synthetic diamond grit facility in Georgia, with Japan set to invest approximately $600 million.The project is set to be operated by Element Six, part of De Beers Group, the world's leading diamond company. Diamond grit, dust and powder are critical raw materials in U.S. industrial manufacturing due to their exceptional hardness and wear resistance, the Commerce Department said, making the material to U.S. economic and national security.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump lauds Japan’s pledge to invest $36 billion in U.S. oil, gas and critical mineral projects",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108266616-1771401074830-gettyimages-2243738157-ah702329_8i2ufjny.jpeg?v=1771401144&w=1920&h=1080"
      ],
      "datePublished": "2026-02-18T13:03:53.000Z",
      "dateModified": "2026-02-18T13:03:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "FDA chief warns U.S. is losing ground to China in early drug development, calls for faster trial approvals",
    "url": "https://www.cnbc.com/2026/02/18/fda-chief-warns-us-is-losing-ground-to-china-in-early-drug-trials.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108266979-1771443944627-108266979-1771443856154-gettyimages-2258943809-sc1_0833_eavlhrrz.jpeg?v=1771452324&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-18T22:27:03.000Z",
    "description": "watch nowFood and Drug Administration Commissioner Marty Makary warned that the U.S. is falling behind China in early-stage drug development and calle",
    "body": "watch nowFood and Drug Administration Commissioner Marty Makary warned that the U.S. is falling behind China in early-stage drug development and called for reforms that could streamline the process for starting trials on new treatments. In an interview with CNBC on Wednesday, Makary specifically pointed to three bottlenecks that he said cause the U.S. to fall behind on those early drug trials. These include hospital contracting as well as ethical reviews and approvals, both of which he called \"clunky processes that take too long and are leaving us noncompetitive with the countries that are moving a lot faster.\" He also pointed to the process for submitting and receiving approvals for Investigational New Drug, or IND, applications, which companies submit to test a product in humans. \"We walked into a mess,\" Makary said, referring to how behind China the U.S. was in terms of Phase 1 clinical trials conducted in 2024. Food and Drug Administration Commissioner Marty Makary speaks in the Oval Office at the White House on Jan. 29, 2026.Samuel Corum | Getty ImagesHe said the FDA is \"looking at everything,\" such as whether it can partner with health systems and academic medical centers on the pre-IND process. That refers to when companies consult the FDA before formally filing an application. Makary said the Trump administration should \"partner with industry to help them deliver more cures and meaningful treatments for the American public because that is a common bipartisan goal that we all want. And we're going to get it done in this administration.\"China's biotech ecosystem has flourished over the last several years, driven by massive state investment, a vast talent pool and accelerated regulatory reforms. Once known for being a low-cost manufacturing base that pumps out copycats, China is rapidly evolving into a global innovation powerhouse. Data from Global Data and Morgan Stanley shows that China now conducts more clinical trials than the U.S., accounts for nearly a third of new global drug approvals and is on pace to reach 35% of FDA approvals by 2040. U.S. policymakers have been under pressure to take steps to boost innovation domestically. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "FDA chief warns U.S. is losing ground to China in early drug development, calls for faster trial approvals",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108266979-1771443944627-108266979-1771443856154-gettyimages-2258943809-sc1_0833_eavlhrrz.jpeg?v=1771452324&w=1920&h=1080"
      ],
      "datePublished": "2026-02-18T22:27:03.000Z",
      "dateModified": "2026-02-18T22:27:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cadence Design Systems shares pop on earnings beat, custom chip optimism",
    "url": "https://www.cnbc.com/2026/02/18/cadence-design-systems-stock-earnings-ai-chip.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108178515-1753805813381-gettyimages-2211630181-img_8025.jpeg?v=1771445969&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-18T20:37:09.000Z",
    "description": "watch nowCadence Design Systems stock rose by more than 6% on Wednesday after the chip design software company reported earnings that beat analysts' e",
    "body": "watch nowCadence Design Systems stock rose by more than 6% on Wednesday after the chip design software company reported earnings that beat analysts' expectations. The San Jose-based company reported financials after the bell Tuesday, posting an adjusted earnings per share of $1.99 on revenue of $1.44 billion in the fourth-quarter of 2025, about 6% higher versus the prior year on both measures.Analysts surveyed by LSEG were expecting an EPS of $1.91 and revenue of $1.42 billion.CEO Anirudh Devgan told CNBC's \"Squawk on the Street\" on Wednesday that about 45% of its business is now coming from what he called \"system companies,\" which include hyperscalers and end producers of phones and cars.\"System companies want to optimize the hardware and software stack together, and one way to do that is the critical component, is designing their own chips that are optimized to their workload,\" Devgan said. Cadence Design Systems has been riding a wave of artificial intelligence-related capital expenditures and research and development efforts by a range of tech enterprises working to create large language models and infuse them into their internal and customer-facing apps and products.Devgan pointed to Apple's efforts with their own smartphone chips, and Google's custom AI silicon as leading examples, and said the trend of system companies doing their own chips \"is only going to accelerate,\" he said.The company said it expects $5.9 billion to $6 billion in revenue for the next fiscal year, at the top end of FactSet's $5.94 billion expectation.Cadence competes with other companies that sell chip design software, including Synopsys and Siemens.Read more CNBC tech newsSnap to launch creator subscriptions in push to diversify revenueAlibaba unveils Qwen3.5 as China's chatbot race shifts to AI agentsByteDance says it will add safeguards to Seedance 2.0 following Hollywood backlashAnthropic got an 11% user boost from its OpenAI-bashing Super Bowl ad, data shows",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cadence Design Systems shares pop on earnings beat, custom chip optimism",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108178515-1753805813381-gettyimages-2211630181-img_8025.jpeg?v=1771445969&w=1920&h=1080"
      ],
      "datePublished": "2026-02-18T20:37:09.000Z",
      "dateModified": "2026-02-18T20:37:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]