[
  {
    "title": "Couple earns $28,000 a month but constantly fights about money: 'Everything for me is a fire'",
    "url": "https://www.cnbc.com/2025/10/31/couple-earns-28000-dollars-a-month-but-constantly-fights-about-money.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108015868-1722631698653-gettyimages-1746936876-20230605-imgl4293.jpeg?v=1761927110&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-31T19:32:53.000Z",
    "description": "Ellen and Edward earn $28,000 a month, or an annual income of around $336,000 a year — more than triple their home state of Hawaii's median household ",
    "body": "Ellen and Edward earn $28,000 a month, or an annual income of around $336,000 a year — more than triple their home state of Hawaii's median household income.But their high income doesn't prevent the couple from having constant financial disagreements, they told money expert, author and self-made millionaire Ramit Sethi on a recent episode of his Money for Couples podcast. Their last names were not used.Edward is terrified of ever returning to a poor financial situation similar to what he grew up in, while Ellen wants the freedom to reasonably spend their money without asking permission, they said.\"We are pretty financially well-off, and my brain does not compute that,\" Edward said on the podcast. \"Everything for me is a fire. A blown tire that's $200, $300 is a huge deal for me.\"It's not just emergencies, either. Edward oversees the all of couple's finances, and Ellen said she has to get his approval to buy virtually anything, even everyday beauty products or essentials like her prenatal vitamins.\"I feel like every time I ask for anything ... I have to over-explain why I need it for him to say yes,\" Ellen said. \"That constant, 'let me ask,' 'let's see what he says,' 'let me go in detail about why I need it,' is not a good feeling.\"Here's why their disagreements keep happening and Sethi's advice for how to manage money together better.How to manage money as a coupleEllen and Edward aren't bad partners, Sethi said. \"More likely, it's [a] bad structure\" for how they manage their money.The couple understands some basics of setting up a financial system that works for both of them, Sethi said, like the idea that they should have money dedicated to discretionary spending. However, Edward has been including items like prenatal vitamins in Ellen's discretionary spending, which Sethi strongly disagreed with.\"You don't just need a better budget. In fact, you probably don't even need a budget at all,\" Sethi said. \"You need a better system that is built together.\"For both partners to start feeling better about money and hopefully have fewer disagreements going forward, Sethi offered three pieces of advice — and anyone in a similar situation can follow them.1. Encourage your partner to engage with your finances In Edward and Ellen's situation, Edward handles all of the money, while Ellen is hands off. But as spouses and co-parents, both parties need to be treated as equals, Sethi said.Sethi suggests the partner who has more experience with managing the household budget — Edward, in this case — encourage the other to get involved. He recommends telling yourself from \"day one,\" \"I am not going to do this on my own. I want my partner to become good with money.\"2. Talk about money regularlyIn the past, Ellen has avoided money conversations because she felt like her needs were dismissed and she didn't understand where Edward was coming from when he worried about their finances. Having regular money conversations could help them clear up miscommunications going forward and allow both partners to feel empowered to make decisions on how the family spends their money, Sethi said. 3. Find a structure that works for both partnersEllen and Edward's current system, in which Edward approves all of the couple's spending, isn't working for both of them. Sethi suggested they adopt a new structure together. One idea: They could each have \"no-questions-asked money\" along with a joint account and work together to decide how much goes in each, Sethi said.Additionally, they should create some general rules for money in their relationship, such as a no-debt policy or a limit on how long to spend flipping a house, which has been a point of contention in the past.The couple needs to make a more concerted effort to work together and create a shared vision for their money or else they'll \"forever feel resentful, behind, insecure, unworthy, misaligned, sometimes even in danger around your finances,\" Sethi said. \"Money is important,\" he added. \"My wish for you is that you give it the attention and respect that it deserves.\"Want to level up your AI skills? Sign up for Smarter by CNBC Make It's new online course, How To Use AI To Communicate Better At Work. Get specific prompts to optimize emails, memos and presentations for tone, context and audience.Plus, sign up for CNBC Make It's newsletter to get tips and tricks for success at work, with money and in life, and request to join our exclusive community on LinkedIn to connect with experts and peers.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Couple earns $28,000 a month but constantly fights about money: 'Everything for me is a fire'",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108015868-1722631698653-gettyimages-1746936876-20230605-imgl4293.jpeg?v=1761927110&w=1920&h=1080"
      ],
      "datePublished": "2025-10-31T19:32:53.000Z",
      "dateModified": "2025-10-31T19:32:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Berkshire's operating earnings jump 34%, Buffett buys back no stock and raises cash hoard to $381 billion",
    "url": "https://www.cnbc.com/2025/11/01/berkshire-hathaway-brk-earnings-q3-2025.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108140408-1746278498531-untitled-218-82.jpg?v=1746557643&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-01T12:49:38.000Z",
    "description": "Warren Buffett and Greg Abel walkthrough the Berkshire Hathaway Annual Shareholders Meeting in Omaha, Nebraska on May 3, 2025.David A. Grogen | CNBCWa",
    "body": "Warren Buffett and Greg Abel walkthrough the Berkshire Hathaway Annual Shareholders Meeting in Omaha, Nebraska on May 3, 2025.David A. Grogen | CNBCWarren Buffett's Berkshire Hathaway reported a sharp rebound in operating profit on Saturday, while its cash pile swelled to a new high with no buybacks.Berkshire's operating profit generated from the conglomerate's wholly owned businesses including insurance and railroads jumped 34% year over year to $13.485 billion in the third quarter. The gains were driven by a more than 200% surge in insurance underwriting income, which rose to $2.37 billion.Buffett once again refrained from repurchasing shares despite a significant pullback in the stock. The company said there were no share buybacks during the first nine months of 2025. Class A and B shares of the conglomerate are up 5% each in 2025, while the S&P 500 is up 16.3%.Without any buybacks, Berkshire's cash hoard swelled to a record $381.6 billion, surpassing the previous high of $347.7 billion set in the first quarter of this year.Berkshire also didn't find other stocks attractive, net selling equities in the third quarter for a taxable gain of $10.4 billion.Stock Chart IconStock chart iconBerkshire Hathaway class A shares year to dateThe 95-year-old Buffett in May announced he's stepping down as CEO at the year-end after six legendary decades. Greg Abel, Berkshire's vice chairman of non-insurance operations, is set to take over as chief executive, while Buffett will remain chairman of the board. Abel will also start writing annual letters in 2026.The Omaha-based conglomerate's shares have tumbled double digits from all-time highs following the announcement. The sell-off partially reflects the so-called Buffett premium, or the extra price investors are willing to pay because of the billionaire's unmatched record and exceptional capital allocation skills.Last month, Berkshire announced a deal to buy Occidental Petroleum's petrochemical unit, OxyChem, for $9.7 billion in cash. The deal marks Berkshire's largest since 2022, when it paid $11.6 billion for insurer Alleghany.Overall earnings, which include gains from Berkshire's investments in other publicly traded companies, rose 17% to $30.8 billion year on year. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Berkshire's operating earnings jump 34%, Buffett buys back no stock and raises cash hoard to $381 billion",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108140408-1746278498531-untitled-218-82.jpg?v=1746557643&w=1920&h=1080"
      ],
      "datePublished": "2025-11-01T12:49:38.000Z",
      "dateModified": "2025-11-01T12:49:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump administration must pay SNAP benefits despite government shutdown, judge rules",
    "url": "https://www.cnbc.com/2025/10/31/snap-trump-judge-food-stamps-shutdown.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108214240-1760979039522-gettyimages-2241879066-AFP_79F79TU.jpeg?v=1760979135&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-31T22:49:01.000Z",
    "description": "US President Donald Trump (R) speaks during a meeting with Australia's Prime Minister Anthony Albanese in the Cabinet Room at the White House in Washi",
    "body": "US President Donald Trump (R) speaks during a meeting with Australia's Prime Minister Anthony Albanese in the Cabinet Room at the White House in Washington, DC, on Oct. 20, 2025. Saul Loeb | AFP | Getty ImagesA federal judge in Rhode Island on Friday blocked the Trump administration from ceasing to pay SNAP benefits that help feed 42 million Americans during the U.S. government shutdown.The oral ruling by Judge Jack McConnell, which directed that those food stamp benefits be paid out of emergency funds \"as soon as possible,\" came a day before the administration was set to cut off the aid.\"There is no doubt, and it is beyond argument, that irreparable harm will begin to occur if it hasn't already occurred in the terror it has caused some people about the availability of funding for food for their family,\" McConnell said.McConnell's ruling came minutes after another federal judge in Boston, who is overseeing a separate but similar lawsuit, said that the group of states that are plaintiffs in that case is likely to prove that the suspension of Supplemental Nutrition Assistance Program benefits was \"unlawful.\"That judge, Indira Talwani, gave the administration until Monday to tell her if it will authorize at least reduced SNAP benefits for November.President Donald Trump, in a statement on social media later Friday, said, \"Our Government lawyers do not think we have the legal authority to pay SNAP with certain monies we have available, and now two Courts have issued conflicting opinions on what we can and cannot do.\"\"I do NOT want Americans to go hungry just because the Radical Democrats refuse to do the right thing and REOPEN THE GOVERNMENT,\" Trump wrote on Truth Social. \"Therefore, I have instructed our lawyers to ask the Court to clarify how we can legally fund SNAP as soon as possible.\"\"If we are given the appropriate legal direction by the Court, it will BE MY HONOR to provide the funding, just like I did with Military and Law Enforcement Pay,\" he said.Lawyers for the plaintiffs in the case before McConnell argued at a court hearing Friday that the cutoff of SNAP benefits was an \"arbitrary and capricious act\" that had caused \"a crisis\" for the Americans who need food stamps to eat.A Justice Department lawyer argued that SNAP did not exist anymore because there were no congressionally appropriated funds for it as a result of the shutdown.The lawyer, Tyler Becker, also argued it was the administration's discretion whether to use up to $6 billion in contingency funds already set aside by Congress to continue issuing SNAP benefits.\"There is no SNAP program and, as a result, the government cannot just provide SNAP benefits,\" Becker said.\"A shutdown is not an emergency,\" said Becker, adding that if there was an emergency, it had been created by Congress in failing to appropriate money to keep the government operating.But McConnell told the administration to use the available contingency funds to maintain at least some of the SNAP benefits that are normally paid.The judge also said the administration needed to examine whether other federal funds would be available to keep the program operating in the absence of a funding bill by Congress.McConnell's ruling granted a temporary restraining order to plaintiffs who filed a lawsuit on Thursday in U.S. District Court in Providence against the Trump administration to maintain the benefits.White House National Economic Council Director Kevin Hassett, during an interview Friday afternoon with NBC News' \"Meet the Press Now,\" would not say whether the Trump administration would comply with either court ruling. Read more CNBC government shutdown coverage Government shutdown could cost U.S. economy up to $14 billion, CBO saysJudge extends ban on Trump firing federal workers during government shutdownStates sue Trump admin to keep SNAP benefits during government shutdownLargest federal worker union urges end to government shutdownTrump's $130 million mystery military donor is Timothy Mellon: NYTGovernment shutdown becomes second-longest in U.S. historyStates sue Trump administration to keep SNAP benefits Government shutdown becomes 2nd longest in U.S. historyHow to get student loan help during the government shutdownWhite House economic advisor Hassett says shutdown could end this weekArmy Corps of Engineers pausing $11 billion in projects over shutdown: VoughtGovernment shutdown: Trump distrust keeps Democrats from forming 'gang'Bill to fund military during government shutdown fails in Senate procedural vote\"Today's ruling is a lifeline for millions of families, seniors, and veterans who depend on SNAP to put food on the table,\" the coalition of plaintiffs said in a statement.\"It reaffirms a fundamental principle: no administration can use hunger as a political weapon,\" the coalition said. \"This victory is about more than one program — it's about the American values of fairness, compassion, and accountability that hold our democracy together.\"The plaintiffs include a group of cities, charitable and faith-based non-profit groups, unions and business organizations.The Boston judge, Talwani, in her separate order on Friday, said she was still considering the plaintiffs' request for a temporary restraining order to maintain the benefits.But she also ordered the administration to tell her by Monday if it would \"authorize at least reduced SNAP benefits for November, and, if so, their timeline for determining whether to authorize only reduced SNAP benefits using the Contingency Funds or to authorize full SNAP benefits using both the Contingency Funds and additional available funds.\"Senate Minority Leader Chuck Schumer, D-N.Y., praised both rulings.\"Good,\" Schumer wrote in a post on the social media site X.\"Trump's decision to cut off SNAP was vindictive and heartless,\" Schumer wrote.\"He was trying to manufacture a hunger crisis so he wouldn't have to fix healthcare. No president in American history has cut off SNAP during a shutdown, including Trump during his own first term.\"Hassett, the National Economic Council director, blasted the rulings.\"We're about to use emergency funds from the Department of Agriculture because of a liberal judge ruling that we disagree at the law on,\" Hassett said in an interview on Fox News.\"But then we don't have our emergency funds in case we have a hurricane or we have an emergency -- a food emergency,\" Hassett said. \"And so we've got to get the government open. We've got to do it as soon as possible. And the Democrats really don't have a plan.\"The Trump administration blames Senate Democrats for the shutdown, given their refusal to vote for a short-term funding bill proposed by House Republicans, which does not include an extension of enhanced Affordable Care Act subsidies that Democrats insist on.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump administration must pay SNAP benefits despite government shutdown, judge rules",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108214240-1760979039522-gettyimages-2241879066-AFP_79F79TU.jpeg?v=1760979135&w=1920&h=1080"
      ],
      "datePublished": "2025-10-31T22:49:01.000Z",
      "dateModified": "2025-10-31T22:49:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Musk teases Tesla Roadster demo by year-end. He's been hyping a new one since 2017",
    "url": "https://www.cnbc.com/2025/10/31/musk-teases-tesla-roadster-demo-this-year-been-hyping-it-since-2017.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108165343-1751051524166-2010-11-12T120000Z_766215986_GM1E6BC11ZK01_RTRMADP_3_TOYOTA-TESLA.JPG?v=1751051610&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-31T23:53:25.000Z",
    "description": "Toyota Motor Corp President Akio Toyoda gets out of a Tesla Motor's Roadster electric car with Tesla Motors Chief Exective Officer Elon Musk (behind c",
    "body": "Toyota Motor Corp President Akio Toyoda gets out of a Tesla Motor's Roadster electric car with Tesla Motors Chief Exective Officer Elon Musk (behind car) upon their arrival at a news conference in Tokyo November 12, 2010.Issei Kato | ReutersEight years ago, Tesla CEO Elon Musk promoted a next-generation Roadster, basing the name of the sports car on the company's debut electric vehicle from 2008.The updated version has yet to hit production. But Musk is again promising that a new one is on the way.In a discussion with podcaster Joe Rogan that was published on Friday, Musk was asked about the long-delayed vehicle. He provided a sense of timing but declined to share updated technical or design details.\"I can't do the unveil before the unveil,\" Musk said. As he's said before, Musk claimed the new Roadster \"has a shot at being the most memorable product unveil ever.\"Tesla is aiming to show off the updated Roadster to fans and investors \"hopefully before the end of the year,\" Musk said.Musk's comments come a day after former close friend Sam Altman, OpenAI's CEO, posted on X that he tried to cancel his Roadster reservation from 2018 and get his deposit refunded. He shared a screenshot showing that his email to the company had bounced back.\"I really was excited for the car!\" Altman wrote. \"And I understand delays. But 7.5 years has felt like a long time to wait.\"Musk, who helped start OpenAI in 2015, is in a heated legal dispute with Altman and now runs competing artificial intelligence startup xAI.Patrick George, editor-in-chief at InsideEVs and a long-time industry observer, told CNBC on Friday that the Roadster \"has been MIA for years.\"\"The only thing I can think of that would make Musk start talking about this again is that Sam Altman at OpenAI, who is sort of his arch-rival, just said recently that he was trying to cancel his Roadster reservation which he has held since 2018,\" George said.Earlier this year, the popular gadget and autos reviewer Marques Brownlee discussed the arduous process of cancelling his own Roadster reservation in an interview with Waveform Podcast.The Roadster is a high end, low-volume model, something meant to challenge vehicles like BYD's YangWang U9 Xtreme, which was recently crowned the world's fastest production car.Musk faces a major Tesla shareholder vote next week, as he and the board are asking investors to approve a massive pay package.The pay plan would net Musk nearly $1 trillion in Tesla stock and would grow his stake to around 25%, depending on the company hitting various market valuations and other growth milestones.WATCH: CNBC's interview with Tesla Chair Robyn Denholmwatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Musk teases Tesla Roadster demo by year-end. He's been hyping a new one since 2017",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108165343-1751051524166-2010-11-12T120000Z_766215986_GM1E6BC11ZK01_RTRMADP_3_TOYOTA-TESLA.JPG?v=1751051610&w=1920&h=1080"
      ],
      "datePublished": "2025-10-31T23:53:25.000Z",
      "dateModified": "2025-10-31T23:53:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Amazon's stock soars 10% on third-quarter beat, increased spending guidance",
    "url": "https://www.cnbc.com/2025/10/31/amazon-amzn-stock-earnings-revenue-ai-cloud.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108107825-17405902912025-02-26t171428z_315459334_rc2f2daohftm_rtrmadp_0_amazon-com-alexa.jpeg?v=1740590368&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-31T20:03:00.000Z",
    "description": "Amazon CEO Andy Jassy speaks during an Amazon Devices launch event in New York City, U.S., February 26, 2025. Brendan Mcdermid | ReutersAmazon shares ",
    "body": "Amazon CEO Andy Jassy speaks during an Amazon Devices launch event in New York City, U.S., February 26, 2025. Brendan Mcdermid | ReutersAmazon shares soared 10.81% on Friday after the company reported an across-the-board beat for the third quarter and boosted its forecast for spending due to demand for artificial intelligence services.Cloud was a major driver of revenue and profit growth, with sales at Amazon Web Services climbing 20% from a year earlier to $33 billion, topping expectations.The unit generated operating income of $11.4 billion, accounting for roughly two-thirds of Amazon's total operating profit.Revenue in the digital advertising business, another growth engine, jumped 24% to $17.7 billion. Total sales at Amazon climbed 13% to $180.17 billion, topping the average analyst estimate of $177.8 billion, according to LSEG. Earnings per share came in at $1.95, exceeding the $1.57 average estimate.\"Amazon has a deep moat around their core businesses driven by their unmatched scale,\" analysts at Pivotal Research wrote in a note after the report.The analysts, who recommend buying the stock, said Amazon \"appears to have numerous healthy organic growth opportunities driven by their high margin AWS cloud segment\" and areas like advertising.Coming into earnings, cloud was an area of key concern due to increased competition from Google and Microsoft, which also reported quarterly results this week. Google's cloud revenue increased 34% during the third quarter, while Microsoft Azure recorded growth of 40%.Read more CNBC tech newsNvidia CEO Jensen Huang says AI is in a 'virtuous cycle.' Here's what he meansApple isn't playing the same AI capex game as the rest of the megacapsAmazon raises spending forecast to $125 billion as third-quarter results top estimatesSpaceX and Blue Origin both submitted plans to get astronauts back to the moon faster, NASA saysAmazon's stock was up just 1.6% for the year ahead of the report, well behind its megacap peers.While the company remains the leading provider of cloud infrastructure technology, it's been battling the perception that it's missing out on a flurry of highly lucrative AI deals for cloud services.But when it comes to spending, Amazon is ahead of its rivals.Amazon raised its forecast for capital expenditures this year, saying it now expects to spend $125 billion in 2025, up from an earlier estimate of $118 billion. CFO Brian Olsavsky said that number will likely increase in 2026. Google, Meta and Microsoft also lifted their capex guidance, but were all below Amazon.For the current quarter, Amazon said it expects sales to be $206 billion to $213 billion. The midpoint of the revenue outlook, $209.5 billion, topped estimates of $208 billion, according to LSEG.While investors are cheering Amazon's results, it's been a tough week for a wide swath of the company's workforce.On Tuesday, Amazon said it will lay off 14,000 corporate employees, as part of a push to make the company leaner and less bureaucratic, so it can move faster. More cuts are expected soon, and Jassy said it's not \"financially driven\" or due to AI, \"right now, at least.\"\"It really, it's culture,\" Jassy said. \"If you grow as fast as we did for several years, you know, the size of the businesses, the number of people, the number of locations, the types of businesses you're in, you end up with a lot more people than what you had before, and you end up with a lot more layers.\"The company finished the quarter with about 1.58 million employees, which was a 2% increase from the year-ago period.Sales in Amazon's core online stores unit posted growth of 10% during the quarter, which includes the results of its Prime Day discount event in July.WATCH: Apple will outperform Amazonwatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Amazon's stock soars 10% on third-quarter beat, increased spending guidance",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108107825-17405902912025-02-26t171428z_315459334_rc2f2daohftm_rtrmadp_0_amazon-com-alexa.jpeg?v=1740590368&w=1920&h=1080"
      ],
      "datePublished": "2025-10-31T20:03:00.000Z",
      "dateModified": "2025-10-31T20:03:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Where the Nexperia auto chip crisis stands now as the U.S., China and EU race to contain fallout",
    "url": "https://www.cnbc.com/2025/11/01/where-the-nexperia-auto-chip-crisis-stands-now.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108220234-17619405512025-10-23t103823z_1905056082_rc2mhhav54c5_rtrmadp_0_volkswagen-production-chips.jpeg?v=1761940606&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-01T15:59:55.000Z",
    "description": "The logo of Chinese-owned semiconductor company Nexperia is displayed at the chipmaker's German facility, after the Dutch government seized control an",
    "body": "The logo of Chinese-owned semiconductor company Nexperia is displayed at the chipmaker's German facility, after the Dutch government seized control and auto industry bodies sounded the alarm over the possible impact on car production, in Hamburg, Germany, Oct. 23, 2025. Jonas Walzberg | ReutersNetherlands-based chipmaker Nexperia is at the heart of a standoff between the European Union, the U.S. and China that has triggered a near-crisis for global automakers.The Dutch government seized control of Nexperia, owned by the Chinese company Wingtech, in October, citing national security concerns. The move prompted Beijing to block Nexperia products from leaving China.Meetings are underway in Europe Saturday to attempt to defuse the escalating issue, and Chinese and U.S. authorities appear to be opening up a pathway for Nexperia's China-based operations to resume exporting critical automotive chips. For now, however, the auto industry's supply chain still hangs in the balance.The dispute is threatening vehicle production worldwide as automakers warn of looming shortages of the chipmaker's components, which are critical to basic electrical functions in cars and challenging to replace on short notice.The battle has unfolded amid heightened scrutiny of Chinese-linked tech firms from Western governments, including the U.S., which recently tightened export-control rules to limit technology transfers to Chinese-owned entities. Nexperia's owner, Wingtech, was put on a U.S. blacklist in December 2024 for its alleged role \"in aiding China's government's efforts to acquire entities with sensitive semiconductor manufacturing capability.\"Here's what to know about where the dispute stands, and why it matters. Why are Nexperia chips so important?Nexperia manufactures billions of so-called foundation chips — transistors, diodes and power management components — that are produced in Europe, assembled and tested in China, and then re-exported to customers in Europe and elsewhere. Around 70% of chips made in the Netherlands are sent to China to be completed and re-exported to other countries.The chips are basic and inexpensive, but are needed in almost every device that uses electricity. In cars, those chips are used to connect the battery to motors, for lights and sensors, for braking systems, airbag controllers, entertainment systems and electric windows. Nexperia had sales of $2 billion last year.In late October, automakers, such as Volkswagen, Nissan Motor and Mercedes-Benz, sounded the alarm about potential production cuts if Nexperia's chip exports are curtailed for long.While automakers typically have some stockpiles and alternative suppliers, it is difficult to switch supply sources overnight. What happened and where do things stand?In September, the Dutch government invoked a Cold War-era law to effectively take control of Nexperia, amid concerns that its Chinese owner was planning to shift intellectual property to another company it owned. A Dutch court also suspended Nexperia CEO, Wingtech founder Zhang Xuezhen, citing mismanagement.Beijing retaliated weeks later by imposing export controls on certain Nexperia products made in China, escalating tensions and fueling fears of a broader supply chain shock. That prompted the company to tell carmakers it could no longer guarantee supplies.But signs of a breakthrough have started to emerge.On Friday, reports said the U.S. plans to announce that Nexperia will resume sending chips under a framework agreement reached during talks between President Donald Trump and Chinese leader Xi Jinping, citing sources familiar with the matter. And on Saturday, China said it will exempt some Nexperia chips from its export ban. Chinese officials did not specify what those exemptions could entail.\"We will comprehensively consider the actual situation of the enterprise and exempt eligible exports,\" The Chinese Commerce Ministry said in a statement. If finalized, the exemptions could ease immediate pressure on automakers. But the broader dispute over ownership, technology control and security oversight remains unresolved.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Where the Nexperia auto chip crisis stands now as the U.S., China and EU race to contain fallout",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108220234-17619405512025-10-23t103823z_1905056082_rc2mhhav54c5_rtrmadp_0_volkswagen-production-chips.jpeg?v=1761940606&w=1920&h=1080"
      ],
      "datePublished": "2025-11-01T15:59:55.000Z",
      "dateModified": "2025-11-01T15:59:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Samsung building facility with 50,000 Nvidia GPUs to automate chip manufacturing",
    "url": "https://www.cnbc.com/2025/10/31/samsung-nvidia-ai-chips-megafactory.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108218542-1761747041057-gettyimages-2243417409-NVIDIA_AI_KEYNOTE.jpeg?v=1761747105&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-31T16:42:48.000Z",
    "description": "Jensen Huang, chief executive officer of Nvidia Corp., during the keynote address at the Nvidia GTC (GPU Technology Conference) in Washington, DC, US,",
    "body": "Jensen Huang, chief executive officer of Nvidia Corp., during the keynote address at the Nvidia GTC (GPU Technology Conference) in Washington, DC, US, on Tuesday, Oct. 28, 2025. Kent Nishimura | Bloomberg | Getty ImagesKorean semiconductor giant Samsung said Thursday that it plans to buy and deploy a cluster of 50,000 Nvidia graphics processing units to improve its chip manufacturing for mobile devices and robots.The 50,000 Nvidia GPUs will be used to create a facility Samsung is calling an \"AI Megafactory.\" Samsung didn't provide details about when the facility would be built.It's the latest splashy partnership for Nvidia, whose chips remain essential for building and deploying advanced artificial intelligence.The agreement with Samsung comes after Nvidia CEO Jensen Huang on Tuesday announced in Washington, D.C., that Nvidia was collaborating with companies including Palantir, Eli Lilly, CrowdStrike and Uber.Shortly after the speech, Huang was spotted in South Korea drinking beer with Samsung Chairman Lee Jae-yong and other business leaders, according to local media. Other Korean companies, including SK Group and Hyundai, are also deploying similar amounts of GPUs, Nvidia said.\"We're working closely with the Korean government to support its ambitious leadership plans in AI,\" Raymond Teh, Nvidia's senior vice president of Asia-Pacific, said on a call Wednesday with reporters.The partnerships support Huang's claim on Tuesday that Nvidia has a book of business that totals $500 billion from its current generation GPU, called Blackwell, in addition to its next-generation GPU, called Rubin.The forecast helped boost Nvidia's stock, making the company the first to reach a market cap of $5 trillion.On Thursday, Nvidia representatives said they will work with Samsung to adapt the Korean company's chipmaking lithography platform to work with Nvidia's GPUs. That process will results in 20 times better performance for Samsung, the Nvidia representatives said. Samsung will also use Nvidia's simulation software called Omniverse. Known for its mobile phones, Samsung also said it would use the Nvidia chips to run its own AI models for its devices.In addition to being a partner and customer, Samsung is also a key supplier for Nvidia.Samsung makes the kind of high-performance memory Nvidia uses in large quantities, alongside its AI chips, called high bandwidth memory. Samsung said it will work with Nvidia to tweak its HBM4 memory for use in AI chips.WATCH: Night out in Seoul: Nvidia, Samsung, and Hyundai bosses bond over fried chicken and sojuwatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Samsung building facility with 50,000 Nvidia GPUs to automate chip manufacturing",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108218542-1761747041057-gettyimages-2243417409-NVIDIA_AI_KEYNOTE.jpeg?v=1761747105&w=1920&h=1080"
      ],
      "datePublished": "2025-10-31T16:42:48.000Z",
      "dateModified": "2025-10-31T16:42:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Reddit stock jumps 7% after showing strong advertising and user growth",
    "url": "https://www.cnbc.com/2025/10/31/reddit-rddt-stock-earnings-outlook.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107391065-1711045231372-gettyimages-2102319874-reddit394530_clsacluf.jpeg?v=1761919182&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-31T20:03:06.000Z",
    "description": "Reddit CEO Steve Huffman stands on the floor of the New York Stock Exchange (NYSE) after ringing a bell on the floor setting the share price at $47 in",
    "body": "Reddit CEO Steve Huffman stands on the floor of the New York Stock Exchange (NYSE) after ringing a bell on the floor setting the share price at $47 in its initial public offering (IPO) on March 21, 2024 in New York City.Spencer Platt | Getty ImagesReddit's stock popped 7% Friday after the company surpassed third-quarter estimates and signaled strong advertising growth.The social media platform's revenues surged 68% from a year ago to $585 million, beating an LSEG estimate of $546 million. Earnings per share totaled 80 cents, surpassing an estimate of 51 cents.Reddit also released a better-than-expected sales outlook for the fourth quarter. The company projects between $655 million and $665 million, topping the $638 million forecast from Wall Street.These results \"speak to the company's continued progress across its ad and platform initiatives,\" wrote Morgan Stanley analyst Brian Nowak. \"We see a long runway for growth across both active advertisers (+75% y/y in 3Q) as well as greater penetration within existing advertisers.\"Reddit said that nine of its top 15 advertiser verticals grew more than 50%. Nowak highlighted Reddit's ongoing investments in automation, which are improving return on advertising spending.Read more CNBC tech newsNvidia CEO Jensen Huang says AI is in a 'virtuous cycle.' Here's what he meansApple isn't playing the same AI capex game as the rest of the megacapsAmazon raises spending forecast to $125 billion as third-quarter results top estimatesSpaceX and Blue Origin both submitted plans to get astronauts back to the moon faster, NASA saysThe number of daily active users jumped 19% from the year-ago period to 116 million, surpassing Wall Street's 114 million estimate.Reddit has attracted more people to the platform from Google, and generated advertising dollars from those who create accounts. The company makes more money off of logged-in users, and has raised concerns as of late that AI chat apps, including ChatGPT and Google's AI Overview could impact new user growth.\"I'm looking forward to continuing to work on these things with these partners, but they're not a major traffic driver today,\" CEO Steve Huffman said during the earnings call. \"But I think there's plenty of opportunity there as we continue to work together.\"The company's daily active unique users rose 7% from last year to 23.1 million, but lagged the 12% growth seen in the second quarter. Globally, logged-in users grew 14% to 50.2 million.Reddit's other revenues, which include data licensing partnerships with Google and OpenAI, grew 7% from a year ago to $36 million.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Reddit stock jumps 7% after showing strong advertising and user growth",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107391065-1711045231372-gettyimages-2102319874-reddit394530_clsacluf.jpeg?v=1761919182&w=1920&h=1080"
      ],
      "datePublished": "2025-10-31T20:03:06.000Z",
      "dateModified": "2025-10-31T20:03:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Airlines call on Congress to immediately end government shutdown, pay air traffic controllers",
    "url": "https://www.cnbc.com/2025/10/30/government-shutdown-delta-air-traffic-controllers.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108219541-1761847034375-gettyimages-2243415826-US_GOV_FUNDING.jpeg?v=1761915110&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-31T12:52:46.000Z",
    "description": "A Delta Airlines plane takes off near the air traffic control tower at Ronald Reagan Washington National Airport (DCA) in Arlington, Virginia, US, on ",
    "body": "A Delta Airlines plane takes off near the air traffic control tower at Ronald Reagan Washington National Airport (DCA) in Arlington, Virginia, US, on Tuesday, Oct. 28, 2025.Samuel Corum | Bloomberg | Getty ImagesDelta Air Lines, United Airlines and American Airlines called on Congress Thursday to reopen the U.S. government and pay air traffic controllers, with Delta urging senators to \"immediately pass a clean continuing resolution.\"U.S. air traffic controllers missed their first full paychecks on Tuesday as the government shutdown drags on through a fourth week with no end in sight while Republican and Democratic senators remain at an impasse.\"Missed paychecks only increases the stress on these essential workers, many of whom are already working mandatory overtime to keep our skies safe and secure,\" Delta said in a statement Thursday.Read more CNBC government shutdown coverage Government shutdown could cost U.S. economy up to $14 billion, CBO saysJudge extends ban on Trump firing federal workers during government shutdownStates sue Trump admin to keep SNAP benefits during government shutdownLargest federal worker union urges end to government shutdownTrump's $130 million mystery military donor is Timothy Mellon: NYTGovernment shutdown becomes second-longest in U.S. historyStates sue Trump administration to keep SNAP benefits Government shutdown becomes 2nd longest in U.S. historyHow to get student loan help during the government shutdownWhite House economic advisor Hassett says shutdown could end this weekArmy Corps of Engineers pausing $11 billion in projects over shutdown: VoughtGovernment shutdown: Trump distrust keeps Democrats from forming 'gang'Bill to fund military during government shutdown fails in Senate procedural voteDelta CEO Ed Bastian had warned earlier this month that the airline could see impacts from a prolonged shutdown.Vice President JD Vance and Transportation Secretary Sean Duffy hosted a roundtable at the White House Thursday afternoon with the lobby group Airlines for America, whose members include Delta, United, American and others.\"Airlines remain focused on preserving safety and trying to mitigate the operational impacts of this shutdown,\" Airlines for America said in a statement. \"We are expecting a record holiday travel season; however, if the shutdown continues much longer, Americans will have to pack their patience and be prepared for more delays, unfortunately.\"United CEO Scott Kirby told reporters outside the White House that Congress should pass a clean continuing resolution, adding that the shutdown is putting stress on the economy.United Airlines CEO Scott Kirby, joined by U.S. Vice President JD Vance and Transportation Secretary Sean Duffy, speaks to reporters outside the White House on Oct. 30, 2025 in Washington, D.C.Kevin Dietsch | Getty Images News | Getty ImagesAmerican Airlines said it was unacceptable that the federal employees were working without pay. \"A prolonged shutdown will lead to more delays and cancellations — and the American people, especially during the busy holiday season, deserve better,\" the company said in a statement.Air traffic controllers and Transportation Security Administration officers are essential employees who are required to work through the shutdown even though they are not receiving regular paychecks.The missed paychecks come as controllers grapple with a longstanding staffing shortage. There are 3,800 fewer fully certified controllers than the FAA's target, according to Nick Daniels, president of the National Air Traffic Controllers Association.\"These additional distractions will compound the existing risks in an already strained system,\" Daniels said in an opinion piece in The Hill on Tuesday.\"Every day the shutdown continues, the National Airspace System becomes less safe than it was the day before, as the controllers' focus shifts from their critical safety tasks to their financial uncertainty,\" he said.The shutdown began on Oct. 1 after Senate Republicans and Democrats failed to reach an agreement to keep the government open.Democratic senators are insisting that Republicans agree to extend enhanced Affordable Care Act health insurance subsidies before they will vote for funding to reopen the government.The Congressional Budget Office estimated Wednesday that a four-week shutdown would cost the economy at least $7 billion by the end of 2026. A six-week shutdown would cost the economy $11 billion, and an eight-week shutdown would cost $14 billion, according to CBO estimates.Flights have been delayed at several U.S. airports over the past month but the severe disruptions that preceded the end of the longest-ever shutdown, between late 2018 and early 2019, have not occurred.— CNBC's Leslie Josephs contributed to this report.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Airlines call on Congress to immediately end government shutdown, pay air traffic controllers",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108219541-1761847034375-gettyimages-2243415826-US_GOV_FUNDING.jpeg?v=1761915110&w=1920&h=1080"
      ],
      "datePublished": "2025-10-31T12:52:46.000Z",
      "dateModified": "2025-10-31T12:52:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "While AI spending is top of mind, online ads are driving a lot of Big Tech's growth",
    "url": "https://www.cnbc.com/2025/11/01/meta-alphabet-amazon-microsoft-earnings-ads.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108179672-1753964381009-Untitled-1.jpg?v=1753964473&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-01T12:00:01.000Z",
    "description": "META CEO Mark Zuckerberg (L) and Microsoft CEO Satya Nadella.Getty ImagesAs tech giants increase their already breathtaking spending on artificial int",
    "body": "META CEO Mark Zuckerberg (L) and Microsoft CEO Satya Nadella.Getty ImagesAs tech giants increase their already breathtaking spending on artificial intelligence, their respective digital advertising businesses have also gained momentum.Quarterly earnings reports this week from Meta, Amazon, Alphabet and Microsoft all showed healthy revenue on the ads front.The rising online advertising sales have allayed concerns earlier this year that economic turbulence, amplified by President Donald Trump's trade policies, would negatively impact ad budgets.  \"I think the digital ad market is strong,\" said Jasmine Enberg, co-founder of Scalable, a creator economy media firm. \"I think this economic instability and volatility is kind of priced in for a lot of people at this point; sort of seems to be the status quo.\"Meta topped its rivals for the quarter with the fastest ad-related sales growth.The company's total third-quarter revenue, of which 98% is derived from online ads, jumped 26% year-over-year to $51.24 billion, the company's highest sales since the first quarter of 2024.Revenue in Amazon's online ad unit soared 24% year-over-year to $17.7 billion, representing a faster growth rate than the company's AWS cloud computing unit, which saw sales rise 20%.CEO Andy Jassy highlighted on Amazon's earnings call that the company is continuing to expand its ad-specific demand-side platform to more third-party apps and sites.\"You look at some of the partnerships that we've done, the Roku partnership gives us the largest connected TV footprint in the U.S.,\" Jassy said. \"And you layer on top of that what we've recently done in providing our DSP customers the opportunity to integrate with the ad inventory in Netflix and Spotify and SiriusXM, it's powerful.\"Andy Jassy, chief executive officer of Amazon.com Inc., speaks during an unveiling event in New York, US, on Wednesday, Feb. 26, 2025. Michael Nagle | Bloomberg | Getty ImagesAlphabet's overall advertising sales for the third quarter came in at $74.18 billion, a 13% increase from $65.85 billion a year ago. Third-quarter online ad sales for YouTube rose 15% to $10.26 billion.Microsoft's search and news advertising unit brought in $3.7 billion in the company's fiscal first quarter, a 14% increase from the $3.2 billion it recorded the previous year.Even if there's been some pullback in ad budgets due to economic uncertainty, it's likely that companies shifted some of that spending from traditional businesses like newspapers to digital ad platforms, said Jeremy Goldman, senior director of content at Emarketer.  \"I think what could be happening is more of a no-brainer,\" Goldman said. \"To put your money in social, and to put your money in retail media and to put your money in search ad spending.\"It wasn't just the megacaps that showed hefty online ad growth this week. Reddit on Thursday reported a 68% jump in third-quarter sales, soaring past analyst estimates. The company said global daily active uniques grew 19% year-over-year to 116 million, surpassing estimates of 114 million.Snap and Pinterest are scheduled to report results next week. Going big on AIThe tech giants all made clear that they don't see any broader economic concerns that would warrant a reduction in their AI spending, and instead lifted their guidance for capital expenditures, despite concerns of a bubble.Alphabet, Meta, Amazon and Microsoft collectively expect capex spending above $380 billion this year, which is still a fraction of the $1 trillion worth of data center and cloud computing deals that OpenAI has recently announced with its partners like Nvidia, Oracle and Broadcom.But while investors cheered Amazon and Google, they were less thrilled with Microsoft, and especially Meta.The Facebook parent's stock tanked 11% on Thursday after the company said it would raise the low end of its capex guidance to between $70 billion and $72 billion from the prior range of $66 billion to $72 billion.Oppenheimer analysts downgraded Meta stock to the equivalent of a hold from buy, because they said it's less obvious how the social media company will benefit from its AI investments relative to its big tech rivals that also operate cloud computing services.\"Significant investment in Superintelligence despite unknown revenue opportunity mirrors 2021/2022 Metaverse spending,\" the Oppenheimer analysts wrote, contrasting the company's big AI spending related to its Superintelligence Labs to its money-losing Reality Labs division, which makes virtual reality and augmented reality technologies.watch nowSusan Li, Meta's finance chief, said Wednesday during a follow-up earnings call that it's important for the company to invest in AI-related data center and third-party cloud computing services or risk falling behind, echoing similar comments made by CEO Mark Zuckerberg. \"The highest priority for the company is investing our resources to position ourselves as a leader in AI,\" Li said. \"That means that I think for the immediate period of time ahead of us, we could see some financial pressure during which our operating profit could be lumpy.\"Meta has continued to point to how its AI investments are improving its online advertising business, but it's having a more difficult time showing how that spending will benefit the company in the future, Enberg said.\"I think part of that is that we've heard the story now quarter after quarter that it is able to integrate AI into its ad business and use that as a growth engine,\" Enberg said.  \"What comes next is harder to articulate, and far less tangible for investors and other people who follow the space.\"Still, Meta is experiencing some growth in new products like the Meta AI app that contains the Vibes AI-powered short video service, Goldman said.The company can also still expand more into subscriptions or even potentially offer enterprise AI services to sell to corporations, which is \"an area that they haven't played at all,\" he said.For now, Meta's digital advertising unit remains its core business, and just like previous quarters, it's unclear how the economy will impact ad budgets.With the holiday season approaching, all eyes will be focused on whether the lingering economic concerns or tariff-related price hikes lead to consumers curbing their spending, which could impact corporate marketing campaigns.  \"The next test will be when we get to the Black Friday numbers,\" Goldman said. \"Are those going to be below expectations?\"WATCH: Big tech earnings tell you \"these are the companies you want to own.\" watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "While AI spending is top of mind, online ads are driving a lot of Big Tech's growth",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108179672-1753964381009-Untitled-1.jpg?v=1753964473&w=1920&h=1080"
      ],
      "datePublished": "2025-11-01T12:00:01.000Z",
      "dateModified": "2025-11-01T12:00:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'Trump effect' raises hopes for cannabis rally as investors bet on federal reforms, softer marijuana stance",
    "url": "https://www.cnbc.com/2025/11/01/cannabis-stock-market-trump-marijuana.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107259488-1687282292246-gettyimages-1483659930-4-20commemorationinnewyork005.jpeg?v=1687283188&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-01T12:00:01.000Z",
    "description": "Oils containing CBD (Cannabidiol).Geoffroy Van Der Hasselt | AFP | Getty ImagesCannabis stocks could be poised for a rally after years of stagnation, ",
    "body": "Oils containing CBD (Cannabidiol).Geoffroy Van Der Hasselt | AFP | Getty ImagesCannabis stocks could be poised for a rally after years of stagnation, fueled by investor optimism over the possibility for new federal rules for hemp-derived products and signals that President Donald Trump could take a more permissive stance on marijuana.Publicly traded cannabis companies have seen their share of ups and downs. Verano Holdings reported earnings Wednesday that saw revenues of $203 million, up slightly from the previous quarter but down 6% year-over-year. However, Verano posted a net loss of $44 million, partly due to a $5 million impairment charge on a facility in Pennsylvania and $10 million in legal contingencies as a result of a settlement.Next week, two U.S. cannabis giants, Curaleaf and Trulieve, are set to follow in reporting earnings. While the sector is down roughly 10% this year, based on cannabis-focused ETFs, some executives, like the CEO of Tilray Brands, remain optimistic for a turnaround. Already, in October, Tilray Brands' stock jolted up 22% after reporting better-than-expected fiscal first-quarter results.\"We could be looking at a true inflection point for cannabis. If reforms move forward, it could attract more companies to do business in the U.S.,\" Tilray CEO Irwin Simon told CNBC.Stock Chart IconStock chart iconCannabis company stocks Tilray Brands, Curaleaf and TrulieveThree developments are driving the growth: Trump's seeming embrace of Medicare coverage for CBD, a non-intoxicating hemp-derived cannabis compound; the president's statements about reclassifying the drug status of marijuana; and movement in Congress to regulate hemp.Meanwhile, cannabis is becoming more popular than ever. As of a 2024 report, daily or near-daily marijuana use surpassed daily drinking in the U.S., based on analysis of 40 years of data from Carnegie Mellon University.The annual value of the U.S. production of cannabis grew 40% last year from the previous year, according to the Department of Agriculture, and cannabis-derived products, which include CBD and marijuana-based items, are now projected to reach a $160 billion global market by 2032, according to Grand View Research.The 'Trump effect'Optimism in the cannabis market surged in September after Trump shared a video on Truth Social that promoted Medicare coverage of CBD and made unproven anti-aging claims about the substance. The video was produced by The Commonwealth Project — which advocates for seniors using cannabis and was founded and is funded by Palm Beach billionaire Howard Kessler — and directly appealed to the president.Known for pioneering affinity credit cards, Kessler shifted to cannabis advocacy in 2019 but has been in Trump's orbit since at least 2005, attending Trump's wedding to Melania Trump and appearing at Mar-a-Lago and state dinners. Neither Kessler nor the White House responded to a request for comment on the matter.Cannabis stocks reacted immediately to the video. On the day it was posted, shares of Tilray spiked 42%, while Aurora Cannabis stock gained 25%, shares of Canopy Growth jumped 18% and Cronos Group stock added 15.5%.\"A lot of folks in the industry saw him [Trump] posting the video as a bit of a surprise but we think he's trying to gauge how the public feels about cannabis products,\" said Adam Smith, executive director of the Marijuana Policy Project, which advocates for the legalization of marijuana. \"Some people call it the 'Trump effect,' and think if he leans into CBD, it's possible that other Republicans will support.\"There is limited data on effective doses of CBD for inflammation or chronic pain, particularly in seniors, according to the National Institutes of Health. Kevin Sabet, president of Smart Approaches to Marijuana, an organization opposed to marijuana, said people are overreacting to the post.\"It's a big stretch to say a post or two is a fully throated endorsement of reform,\" Sabet told CNBC. \"A lot of times his posts don't line up with formal policy positions.\"To date, the FDA has only approved one CBD-based drug, Epidiolex, to treat rare forms of epilepsy. Other uses lack scientific evidence and have \"largely unknown\" effects, said Meg Haney, director of the Cannabis Research Laboratory at Columbia University.Emoji gummies by JustCBD are displayed at the Cannabis World Congress & Business Exposition trade show, Thursday, May 30, 2019 in New York. The treats contain non-psychoactive cannabidiol, CBD.Jeremy Rehm | APThe Farm BillTrump's post also adds to momentum around regulating hemp — which is a variant of the marijuana plant that doesn't cause a \"high, according to the Centers for Disease Control and Prevention — which was legalized under the 2018 Farm Bill. Congress is weighing updates to the bill by year's-end that could adopt long-awaited federal standards for labeling, testing and safety of hemp-derived products left unregulated under the original law.\"Regulation isn't scary, as long as it is effective, because the clearer the lines are, the better it is to be in the business [when] you don't have a looming axe over your head,\" said Pamela Epstein, the chief legal and regulatory officer of hemp producer Terpene Belt Farms. The 2018 legalization triggered a $1.6 billion hemp market by 2023, according to Grand View Research. Hemp-derived CBD products containing less than 0.3% THC — the psychoactive compound responsible for a high — were legalized under the bill and spread rapidly into gummies, beverages, creams and even pet treats, and are projected to drive more than 20% growth by 2030, the data firm said.But the vacuum of oversight left consumers exposed to mislabeled, untested and sometimes unsafe products, Smith told CNBC.\"It's possible in the hemp sector grew a little too fast without rules,\" Smith said. \"Problems came up with some stuff masquerading as CBD but having high levels of THC, products marketed to kids and some products with tainted samples.\"Proposals in Congress range from an outright ban on hemp to tightening THC limits. Others in the cannabis industry are lobbying for an \"alcohol-model\" framework — with the FDA overseeing product safety and the Alcohol and Tobacco Tax and Trade Bureau managing taxation and distribution.\"Clear rules aren't scary,\" said Tilray CEO Simon. \"They're the best way to grow sustainably and shed the uncertainty that's defined this space for years.\"People like Epstein caution that a complete ban could cripple the hemp economy, which supports about 320,000 jobs nationwide, according to the U.S. Hemp Roundtable and industry-related reports. But others like Michael Mayes, CEO of cannabis consulting firm Quantum 9, said any form of federal standards is essential to legitimize the market and draw institutional investors.\"Federal regulations would help some investors see cannabis as not a fringe investment with their money,\" Mayes told CNBC. \"By next year, it's possible. Smart, consistent rules could be the key to unlocking billions in growth while working to ensure consumer safety.\"Marijuana reschedulingTrump's apparent openness to CBD has fueled speculation he may go further.In August, he said his administration was \"looking at\" reclassifying marijuana from a Schedule I drug — alongside heroin and LSD — to a Schedule III drug.The move would not legalize recreational marijuana but it would make it easier to sell, advocates said. It would also improve access to banking and financial services because it would lift certain IRS tax restrictions, which bar cannabis businesses from deducting standard expenses. Changes could also ease barriers to conducting scientific research, which experts said has been stifled under the drug's current classification.\"To demonstrate that cannabis has medical utility, we need to do large, controlled trials, but we can't really do those if it's a Schedule I drug. As a result, that means you can't do the studies needed to reschedule it,\" Haney said. \"It's like the chicken and egg conundrum.\"A White House official described the rescheduling process as ongoing and said that \"all policy and legal requirements and implications are being considered.\"Cannabis industry sources said investor optimism partly centers on Trump's chief of staff, Susie Wiles, who previously worked at Ballard Partners, a Florida lobbying firm representing Trulieve, one of the largest U.S. cannabis companies. Though Wiles wasn't registered as Trulieve's lobbyist, she is described by multiple sources in the cannabis industry as a close friend of Trulieve CEO Kim Rivers. The people spoke anonymously to talk candidly about the matter.According to the Florida Division of Elections, Trulieve spent more than $100 million supporting a failed ballot measure to legalize recreational cannabis for adults 21 and older. The company reportedly played a key role in securing Trump's backing for the initiative. For the presidential race, according to Federal Election Commission filings, Trulieve donated $750,000 to Trump's inauguration committee and another $250,000 to his MAGA Inc. super PAC.Rivers attended two pre-inauguration events, including a dinner for Vice President JD Vance, and reportedly joined a $1 million-a-plate fundraiser at Trump's New Jersey golf club in August, where she urged him to reclassify marijuana, the Wall Street Journal reported.Two days after the fundraiser, Trump made his \"looking at\" comments about marijuana's classification.Wiles, Rivers and Truileve did not respond to requests for comment.A man prepares a  marijuana cigarette at Washington Square Park on April 20, 2023 in New York City. Leonardo Munoz | Corbis News | Getty ImagesRepublican roadblocksDespite optimism from investors and advocates, many Republican lawmakers are moving to rein in hemp-derived products, citing safety concerns.The backlash stems from hemp's post-2018 boom, which quickly turned into a glut. Licensed acreage soared 445% over the previous year by 2019, according to advocacy and research group Vote Hemp, but the market became oversaturated with products, which forced many retailers and producers to pivot or close, experts said.\"Very quickly, there became a bloat of products and for a lot of the companies, the financial results weren't there. There wasn't growth. You had some really tough balance sheets, and I think the investors were unsure of the underlying fundamentals,\" Cronos Group CEO Michael Gorenstein said.Today, the market has rebounded but remains the \"Wild West\" without regulations, Smith said. FDA research this summer linked unregulated CBD to potential liver damage, and experts warn that THC in hemp can be chemically altered or added in quantities that make it as intoxicating as marijuana.Lawmakers have responded to safety concerns.Over the summer, Rep. Andy Harris, R-Md., introduced a bill redefining hemp to exclude any product with \"quantifiable\" THC, which passed a House committee along party lines. The Senate Appropriations Committee advanced similar language unanimously in July, as Sen. Mitch McConnell, R-Ky., — who championed the 2018 legalization effort — called for restoring the law's \"original intent.\" A Congressional Research Service report in August said the proposals would \"effectively\" ban almost all hemp-derived products.Looking ahead, many in the industry said the future rests on what Trump does next, particularly in the next few months. Even the perception of regulatory change has spurred investor optimism.\"For many of us, it's not a question of when but what the regulations will be and how they'll be enforced,\" Gorenstein said. \"If the next administration delivers clarity, that alone could shake up this industry.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Trump effect' raises hopes for cannabis rally as investors bet on federal reforms, softer marijuana stance",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107259488-1687282292246-gettyimages-1483659930-4-20commemorationinnewyork005.jpeg?v=1687283188&w=1920&h=1080"
      ],
      "datePublished": "2025-11-01T12:00:01.000Z",
      "dateModified": "2025-11-01T12:00:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump touts marble Lincoln Bathroom remodel amid government shutdown",
    "url": "https://www.cnbc.com/2025/10/31/trump-bathroom-white-house-remodel-shutdown.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108220170-1761935886190-ceeef81da83c713f.jpg?v=1761937288&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-31T20:50:08.000Z",
    "description": "White House Lincoln Bathroom Renovation.Source: @realdonaldtrump | Truth SocialFirst it was the Oval Office,  then the East Wing — now it's the Lincol",
    "body": "White House Lincoln Bathroom Renovation.Source: @realdonaldtrump | Truth SocialFirst it was the Oval Office,  then the East Wing — now it's the Lincoln Bedroom's bathroom.President Donald Trump on Friday proudly showed off the latest project in his inside-and-out remodel of the White House — as critics slammed him as \"tone deaf\" for touting glitzy renovations during the costly government shutdown.Trump shared two dozen photos of the newly refurbished bathroom, which is now covered from floor to ceiling with what he described as \"black and white polished Statuary marble.\"Renovated Lincoln Bathroom in the White House.Source: @realdonaldtrump | Truth Social\"This was very appropriate for the time of Abraham Lincoln and, in fact, could be the marble that was originally there!\" Trump wrote in one of seven Truth Social posts containing photos of the renovation.The bathroom also sports gold-colored fixtures and accents — including the bath and sink faucets, wall sconces and trash bin — as well as a crystal hanging chandelier, the photos show.Trump told NBC News in July that he planned to update the bathroom of the historic Lincoln Bedroom in a style that is truer to the era of the 16th president, who held office from 1861 until his assassination in 1865.The previous decor, an art deco green tile style, was \"totally inappropriate for the Lincoln Era,\" Trump wrote in Friday's post.The Lincoln Bathroom in the White House before renovation.Source: @realdonaldtrump | Truth SocialTrump's Democratic critics pounced on the construction updates, slamming him for focusing on the bathroom remodel while a government shutdown, now in its 31st day, threatens access to crucial federal services.\"Donald Trump actually cares more about his toilet than he does about fixing your healthcare,\" Senate Minority Leader Chuck Schumer, D-N.Y., wrote in an X post.\"Millions of people are being kicked off of food assistance and millions can't afford health care anymore. But don't worry everyone! Trump got a new bathroom,\" Democratic commentator Harry Sisson wrote on X.\"So tone deaf, out of touch, and disgusting,\" Sisson added.\"We are in a serious govt shutdown, but instead of negotiating, Trump posted several pics of his WH bathroom remodel today and now this,\" wrote Ron Filipowski, editor in chief of the anti-Trump media outlet MeidasTouch.Asked for a response to those critiques, White House spokesman Davis Ingle told CNBC, \"Democrats are more concerned with President Trump's historic beautification of the White House than they are for American citizens they are hurting because of their reckless government shutdown.\"In another Truth Social post Friday, Trump announced that he had inspected construction taking place at the Kennedy Center, where, months earlier, he had fired several board members and installed himself as chair.\"It is really looking good!\" he wrote. \"The exterior columns, which were in serious danger of corrosion if something weren't done, are completed, and look magnificent in White Enamel — Like a different place!\"\"Marble is being done, stages are being renovated, new seats, new chairs, and new fabrics will soon be installed, and magnificent high end carpeting throughout the building,\" Trump wrote.The update came hours after The Washington Post reported that ticket sales at the Kennedy Center have plummeted in recent months.Read more CNBC politics coverageShutdown cost government contractors $12B so far: U.S. Chamber of CommerceThe big takeaways from the Trump-Xi meeting — what the truce coversShipping sector skeptical Trump's latest trade truce with China will reverse import declineTrump-Xi meeting nears with high stakes and hopes, but few detailsGovernment shutdown could cost U.S. economy up to $14 billion, CBO says",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump touts marble Lincoln Bathroom remodel amid government shutdown",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108220170-1761935886190-ceeef81da83c713f.jpg?v=1761937288&w=1920&h=1080"
      ],
      "datePublished": "2025-10-31T20:50:08.000Z",
      "dateModified": "2025-10-31T20:50:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Treasury Department announces new Series I bond rate of 4.03% for the next six months",
    "url": "https://www.cnbc.com/2025/10/31/treasury-i-bond-rate-through-april-2026.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107111194-1661861669261-gettyimages-1335987568-savingsbonds21ii.jpeg?v=1697217796&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-31T17:03:45.000Z",
    "description": "Jetcityimage | Istock | Getty ImagesThe U.S. Department of the Treasury has announced new rates for Series I bonds. Newly purchased I bonds will pay 4",
    "body": "Jetcityimage | Istock | Getty ImagesThe U.S. Department of the Treasury has announced new rates for Series I bonds. Newly purchased I bonds will pay 4.03% annual interest from Nov. 1 through April 30, which is up from the 3.98% yield offered through Oct. 31.The new rate includes a variable portion of 3.12%, based on inflation data, and a fixed portion of 0.90%. The combined rate is 4.03% after rounding, according to the Treasury. The fixed rate is down from 1.10% announced in May.Read more CNBC personal finance coverageLayoffs are mounting, making it a 'challenging time to be unemployed': expertWhy travel insurance may not protect you in the government shutdownStudent loan class action effort: Trump official, credit agencies hurt borrowers' scoresTreasury Department: Series I bond rate of 4.03% through April 2026Taxpayers may see 'record tax refund season' in 2026, analysts sayMillions face 'huge sticker shock' when ACA open enrollment starts Nov. 1Here's the maximum 2026 Social Security full retirement benefit, after 2.8% COLAStudent loan forgiveness for public servants to be limited under TrumpDemocrats propose increasing VA, Social Security benefits by $200 a monthAdjustable-rate mortgages are 'underappreciated,' top advisor saysHow the 2026 Social Security payroll tax cap could impact your paycheckWhat this Fed rate cut means for your credit card, mortgage and savings accountHow the Fed's decision to lower rates could widen the generational wealth gapThis investing move is the 'holy grail of retirement planning,' advisor saysWhat another Fed cut could mean for borrowers — some rates may barely budgeCNBC's Financial Advisor 100: Best financial advisors, top firms for 2025 rankedIn May 2022, the I bond rate hit a record high of 9.62%, and many investors flooded into the government-backed, nearly risk-free asset. Since then, some shorter-term investors have redeemed holdings amid falling inflation and rates. But other long-term investors have purchased I bonds over the past couple of years to lock in the higher fixed rate.How I bond rates workI bond rates have a variable and fixed portion, which the Treasury adjusts every six months, in May and November. The combined yield is known as the \"composite rate,\" which is paid to investors for a six-month period.   The variable rate is tied to inflation, and stays the same for six months after your purchase date, regardless of the Treasury's next adjustment. Meanwhile, the fixed rate stays the same for the life of your I bond after purchase. The fixed portion can be harder to predict, and the Treasury doesn't disclose how it calculates the change.watch nowHow the change impacts current I bond investorsIf you currently own I bonds, there's a six-month timeline for rate changes, which shifts depending on your original purchase date.After the first six months, the variable yield changes to the next announced rate. But the fixed rate stays the same for the entirety of your holding.For example, let's say you purchased I bonds in March. Your variable rate would be 1.90% and shifts to 2.86% in September. Your fixed rate remains at 1.2%. At that point, your new composite rate would be 4.06%.You can earn I bond interest for up to 30 years, or less if you redeem the assets before that. However, you can't cash in I bonds for at least one year after purchase. If you redeem within five years, you lose your last three months of interest.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Treasury Department announces new Series I bond rate of 4.03% for the next six months",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107111194-1661861669261-gettyimages-1335987568-savingsbonds21ii.jpeg?v=1697217796&w=1920&h=1080"
      ],
      "datePublished": "2025-10-31T17:03:45.000Z",
      "dateModified": "2025-10-31T17:03:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "VC who bet on billion-dollar AI firm shares two red flags that stop him investing in a founder ",
    "url": "https://www.cnbc.com/2025/11/01/vc-who-backed-billion-dollar-ai-firm-shares-two-red-flags-in-founders-.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108219249-1761823683473-gettyimages-1815861478-dsc05991.jpeg?v=1761823701&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-01T08:10:30.000Z",
    "description": "Man and woman having a small business meeting in smart casual clothesIppei Naoi | Moment | Getty ImagesOne successful angel investor has revealed two ",
    "body": "Man and woman having a small business meeting in smart casual clothesIppei Naoi | Moment | Getty ImagesOne successful angel investor has revealed two red flags that prevent him from investing in a founder in the first meeting.Carles Reina is an angel investor who backed voice cloning AI startup Eleven Labs when it was still in its very early stages in 2022. The firm was co-founded by Mati Staniszewski and Piotr Dąbkowski, and raised $180 million at a valuation of $3.3 billion, in its Series C funding earlier this year.In September, the company announced it was letting employees sell shares at a $6.6 billion valuation. Reina is now a vice president of revenue at the AI firm.When Reina first met Eleven Lab's co-founder Staniszewski, he told CNBC Make It that nobody wanted to invest in voice AI at the time. However, Reina decided to take a chance on Eleven Labs after just one meeting.\"We started talking, and within 30 minutes of the first conversation, I told him, 'How much money do you want?'\" Reina shared.He explained that the first meeting is critical when making a decision and Staniszewski displayed certain traits that attracted him as an investor.\"If the first signs are just not there, I usually don't want to waste anyone's time… I think you end up optimizing always for high quality interactions, [it's] like you're trying to triage if this is something that you really like and that you want to spend more time with the founders or not.\"Reina opened up about two reasons why he wouldn't want to invest in a founder after a first meeting.Two red flagsOne of the key traits that Reina looks for when meeting a founder is technicality.\"This is very personal, especially in different stages. But for me, if one of the founders is not technical, like literally cannot build products, is not a researcher or something like that, I just don't see the value in that because they're not going to be able to move as quickly,\" he said in the interview.Reina saw this quality in Eleven Lab's Staniszewski, who has a first-class honors degree in mathematics from Imperial College London.\"It was really interesting to see he was thinking about the problems of the entire ecosystem before even actually having any product, or before even actually talking to any real potential customer,\" he said.The second red flag is if the founder is trying to build a company in a \"very crowded market\" which Reina often tries to steer clear of.\"if there is a lot of venture capitalists looking at that market, because it is sexy, I'm just not interested because then valuations skyrocket and you end up going into a pricing war where everyone's trying to give them term sheets and so on,\" he said.When too many VCs want to invest in a company, it inflates the valuation of that company which then puts unnecessary pressure on the founders to show rapid growth and maintain or increase that valuation, according to Reina.Other reasons might be that the founder is in an industry he just isn't interested in and it doesn't fit his profile of investments.\"If someone sends me a pitch, or I get introduced to someone that just doesn't really bring my attention straight away, I will tell them straight away 'happy to help you on anything that you need [but] from an angel perspective or investing perspective, it's just not one of my things.'\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "VC who bet on billion-dollar AI firm shares two red flags that stop him investing in a founder ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108219249-1761823683473-gettyimages-1815861478-dsc05991.jpeg?v=1761823701&w=1920&h=1080"
      ],
      "datePublished": "2025-11-01T08:10:30.000Z",
      "dateModified": "2025-11-01T08:10:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tariffs are expected to start showing up more in consumer prices as holiday shopping season starts",
    "url": "https://www.cnbc.com/2025/10/31/tariffs-are-expected-to-start-showing-up-more-in-consumer-prices-as-holiday-shopping-season-starts.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108077022-1734452746868-gettyimages-2189857282-US_HOLIDAY_SHOPPING.jpeg?v=1739544255&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-31T18:29:52.000Z",
    "description": "Shoppers carry Macy's and Nordstrom bags at Broadway Plaza in Walnut Creek, California, US, on Monday, Dec. 16, 2024. The Bureau of Economic Analysis ",
    "body": "Shoppers carry Macy's and Nordstrom bags at Broadway Plaza in Walnut Creek, California, US, on Monday, Dec. 16, 2024. The Bureau of Economic Analysis is scheduled to release personal spending figures on December 20.David Paul Morris | Bloomberg | Getty ImagesWhile the impact so far this year has been muted, tariffs are expected to catch up with prices consumers pay just in time for the holiday shopping season.President Donald Trump's tariffs on a plethora of items and individual countries, which started in April, have coincided with common inflation measures trudging along between 2.5% and 3% this year.While economists don't see a major spike coming in common measures such as the consumer price and the personal consumption price indexes, they expect the tariffs will keep those gauges elevated at a time when they otherwise would be moving lower.\"There have been some questions in recent months as to whether tariffs have led to higher inflation for consumers,\" Bank of America economist Aditya Bhave said in a note. \"We think there's no debate — tariffs have pushed consumer prices higher.\"Tariff impacts have been muted so far as companies built up inventories ahead of the duties and absorbed some of the impact through compressed profit margins.Bank of America, though, expects that tariffs will be adding about half a percentage point to the core PCE measure the Federal Reserve uses when assessing inflation. With tariffs, BofA estimates that the inflation rate would be 2.9% in September, so without them that would mean a measure closer to 2.4%. The numbers are similar to ones Fed Chair Jerome Powell cited Wednesday. The core PCE on an annual basis was 2.9% in August.These percentage point differences matter to the Fed, which tries to keep core inflation, excluding food and energy, at 2%, a level it has been above since March 2021. Two Fed officials — regional presidents Jeffrey Schmid of Kansas City and Lorie Logan of Dallas — said Friday they did not agree with their colleagues' decision Wednesday to lower the central bank's key interest rate.For consumers, they also matter. Bhave estimates that shoppers are bearing about 50%-70% of total tariff costs, with businesses bearing the rest.Impact at the cash registerIn real-world terms, that's meant higher prices for things such as coffee, furniture and, recently, clothing prices, which jumped 0.7% in September, according to the Bureau of Labor Statistics. Even though they are minor components of the price indexes, they are items consumers buy frequently and can create perceptions about inflation, which can produce a self-reinforcing cycle that drives prices higher.\"Inflation in certain goods can have an outsized impact on consumer confidence, even if those items carry a negligible weight in the CPI basket,\" TD Cowen analysts said in a note. Price increases in items such as eggs create \"a constant, tangible feedback loop every week at the grocery store. Such items shape perception more than their statistical significance would suggest.\"The firm noted that this holiday season could see more of that sort of thing as artificial Christmas trees are almost all imported from China, which faces heavy costs under the Trump tariffs.\"While Artificial Christmas trees are not unique, they serve as a clear example of how high-tariff, seasonal goods can shape consumer perceptions of inflation,\" Cowen said.Had the duties been in place during the 2024 holiday season, shoppers would have spent an additional $40.6 billion, according to LendingTree estimates using data from multiple government and private sources.LendingTree's Budget Lab further estimates that some 70.5% of new tariffs were passed onto consumers in June 2025.\"That means that even more Americans would have had to fall back on credit cards and personal loans to help cover gift-buying expenses,\" said Matt Schultz, the firm's chief consumer finance analyst. \"That's the unfortunate reality that many people would have faced.\"Using the same estimates, LendingTree said the tariff cost comes to $132 per shopper.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tariffs are expected to start showing up more in consumer prices as holiday shopping season starts",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108077022-1734452746868-gettyimages-2189857282-US_HOLIDAY_SHOPPING.jpeg?v=1739544255&w=1920&h=1080"
      ],
      "datePublished": "2025-10-31T18:29:52.000Z",
      "dateModified": "2025-10-31T18:29:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]