[
  {
    "title": "iPhone 17 will drive record Apple shipments in 2025, IDC says",
    "url": "https://www.cnbc.com/2025/12/03/iphone-17-will-drive-record-apple-shipments-in-2025-idc.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108201115-1758268622928-20250919_0807200.jpg?v=1758269407&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-03T08:28:01.000Z",
    "description": "Apple's latest iPhone models are shown on display at its Regent Street, London store on the launch day of the iPhone 17.Arjun Kharpal | CNBCApple will",
    "body": "Apple's latest iPhone models are shown on display at its Regent Street, London store on the launch day of the iPhone 17.Arjun Kharpal | CNBCApple will hit a record level of iPhone shipments this year driven by its latest models and a resurgence in its key market of China,  research firm IDC has forecast.The company will ship 247.4 million iPhones in 2025, up just over 6% year-on-year, IDC forecast in a report on Tuesday. That's more than the 236 million it sold in 2021, when the iPhone 13 was released.Apple's predicted surge is \"thanks to the phenomenal success of its latest iPhone 17 series,\" Nabila Popal, senior research director at IDC, said in a statement, adding that in China, \"massive demand for iPhone 17 has significantly accelerated Apple's performance.\"Shipments are a term used by analysts to refer to the number of devices sent by a vendor to its sales channels like e-commerce partners or stores. They do not directly equate to sales but indicate the demand expected by a company for their products.When it launched in September, investors saw the iPhone 17 series as a key set of devices for Apple, which was facing increased competition in China and questions about its artificial intelligence strategy, as Android rivals were powering on.Apple's shipments are expected to jump 17% year-on-year in China in the fourth quarter, IDC said, leading the research firm to forecast 3% growth in the market this year versus a previous projection of a 1% decline.  In China, local players like Huawei have been taking away market share from Apple. IDC's report follows on from Counterpoint Research last week which forecast Apple to ship more smartphones than Samsung in 2025 for the first time in 14 years.Bloomberg reported last month that Apple could delay the release of the base model of its next device, the iPhone 18, until 2027, which would break its regular cycle of releasing all of its phones in fall each year. IDC said this could mean Apple's shipments may drop by 4.2% next year. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "iPhone 17 will drive record Apple shipments in 2025, IDC says",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108201115-1758268622928-20250919_0807200.jpg?v=1758269407&w=1920&h=1080"
      ],
      "datePublished": "2025-12-03T08:28:01.000Z",
      "dateModified": "2025-12-03T08:28:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Boeing stock jumps 10% as CFO says company expects higher 737, 787 deliveries next year",
    "url": "https://www.cnbc.com/2025/12/02/boeing-plane-deliveries-cfo.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108226731-1763385137370-gettyimages-2246569591-AFP_849F7LL.jpeg?v=1763385157&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-02T21:19:48.000Z",
    "description": "A Boeing 777-9 prepares to land at Al-Maktoum International Airport during the Dubai Airshow 2025 in Dubai on November 17, 2025. Giuseppe Cacace | Afp",
    "body": "A Boeing 777-9 prepares to land at Al-Maktoum International Airport during the Dubai Airshow 2025 in Dubai on November 17, 2025. Giuseppe Cacace | Afp | Getty ImagesBoeing is continuing to express optimism about its business as the company wraps up the year and looks at 2026.Chief Financial Officer Jay Malave said Tuesday at a UBS conference that the company expects deliveries of both its 737 and 787 jets to be up next year.\"When you now fast forward to 2026, we're going to be increasing our deliveries,\" Malave said. Boeing's stock rose more than 10% Tuesday after Malave's comments.He added that he expects the certification for the 737-10 aircraft, which is years behind schedule, to come later in 2026. The bolstered deliveries will be \"a big driver\" of cash flow as well, Malave said, with positive free cash flow expected to be in the billions in the \"low single digits.\" Boeing hasn't turned an annual profit since 2018.Malave also said the company expects that cash margins will get a \"pretty significant boost\" through 2030 due to the higher productivity.Boeing has been experiencing an upward trend after a period of increased scrutiny following the blowout of a door plug on a flight in January 2024. In July, CEO Kelly Ortberg said the company was beginning to see changes in its business, including slashing its quarterly losses. Boeing saw a strong delivery pace in October, putting it on track for its highest annual delivery total since 2018. The company said its jetliner deliveries drove it back into cash-positive territory for the first time in nearly two years in October. Those deliveries follow a lifting of restrictions by the Federal Aviation Administration, allowing the company to sign off on some of its 737 Max and 787 Dreamliner planes before they reach customers.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Boeing stock jumps 10% as CFO says company expects higher 737, 787 deliveries next year",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108226731-1763385137370-gettyimages-2246569591-AFP_849F7LL.jpeg?v=1763385157&w=1920&h=1080"
      ],
      "datePublished": "2025-12-02T21:19:48.000Z",
      "dateModified": "2025-12-02T21:19:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Australia's third-quarter GDP expands at fastest pace in about 2 years on investment, consumption boost ",
    "url": "https://www.cnbc.com/2025/12/03/australia-q3-gdp-september.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108173667-1752803324163-gettyimages-2195350309-4072_14_mrb_24-sydneytasmania-1799.jpeg?v=1764720520&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-03T04:44:39.000Z",
    "description": "Sydney Opera House, designed by Danish architect Mr Jorn Oberg Utzon, at first light as the sun rises over Sydney harbor and city center skyscrapers.U",
    "body": "Sydney Opera House, designed by Danish architect Mr Jorn Oberg Utzon, at first light as the sun rises over Sydney harbor and city center skyscrapers.Ucg | Universal Images Group | Getty ImagesAustralia's third-quarter economic growth missed analysts' expectations, but clocked its fastest expansion in about two years, driven by strong investment and consumer demand. The country's GDP rose 2.1% year on year, marking its strongest expansion since the third quarter of 2023 when the economy grew at the same rate, data from the Australian Bureau of Statistics showed on Wednesday. Economists were expected GDP growth of 2.2%.  On a quarter-on-quarter basis, Australia's GDP grew 0.4% compared with 0.7% forecast in a Reuters poll. \"The miss isn't a sign of a materially weaker economy,\" said Harry Murphy Cruise, head of economic research and global trade at Oxford Economics, noting that excluding inventories and trade, the domestic economy surged 1.2% compared with the previous quarter — the fastest expansion in more than two years. Echoing that view, Sunny Nguyen, head of Australia economics at Moody's Analytics, attributed the softer-than-expected headline figure partly to businesses writing down inventories \"more aggressively than expected.\"\"But they say more about timing and accounting than underlying final demand,\" Nguyen added. Domestic final demand contributed 1.1 percentage points to growth. Private investment grew at the fastest pace since March 2021, driven by business investment in machinery, equipment and major data centers across New South Wales and Victoria.  Household consumption continued to expand, led by insurance, electricity, gas, rent, healthcare and food. Meanwhile, net trade was a major drag, denting the economy by 0.1 percentage point, as imports growth outpaced rise in exports in the three months through September. Before the GDP data was released, Reserve Bank of Australia Governor Michele Bullock cautioned that the economy had likely hit its potential growth limit at a time when inflation has been staying above the bank's target. The board will act on renewed price pressures, Bullock added.  The country's inflation accelerated in October, rising 3.8% year on year, marking its fastest pace in seven months, exceeding the RBA's targeted range of 2% and 3%. At the monetary policy meeting last month, the central bank kept its interest rate unchanged at 3.6%, saying it was cautious about easing further, given a strengthening economy, tight labor market and persistent inflationary pressure. Rate bets \"The Q3 data confirms that the economy is still too hot for the RBA's liking,\" said Cruise, adding that rate cuts were \"off the table for some time\" and a hike next week to nip inflation \"can't be ruled out.\"  Australian government 10-year bond yield rose 4 basis points to 4.650 after the release. It has gained 55 basis points since mid-October.   Bullock said last month that the current interest rate cutting cycle could be close to an end, with the central bank forecasting inflation to stay above its target range of 2% to 3% until the second half of next year. The RBA's board meets next week and is widely expected to leave interest rates at 3.6%.In the second quarter this year, Australia's economy expanded 1.8% year on year, compared with 1.3% in the prior quarter, underpinned by domestic spending including household and government consumption. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Australia's third-quarter GDP expands at fastest pace in about 2 years on investment, consumption boost ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108173667-1752803324163-gettyimages-2195350309-4072_14_mrb_24-sydneytasmania-1799.jpeg?v=1764720520&w=1920&h=1080"
      ],
      "datePublished": "2025-12-03T04:44:39.000Z",
      "dateModified": "2025-12-03T04:44:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Truth Social operator Trump Media settles legal dispute with co-founders",
    "url": "https://www.cnbc.com/2025/12/02/trump-media-djt-united-atlantic-ventures-settlement.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108156452-1749471510589-gettyimages-2219137159-img_5206.jpeg?v=1749471560&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-02T23:37:59.000Z",
    "description": "Cheng Xin | Getty ImagesTrump Media said on Tuesday that it had reached an \"amicable settlement\" of a legal dispute with the co-founders of the social",
    "body": "Cheng Xin | Getty ImagesTrump Media said on Tuesday that it had reached an \"amicable settlement\" of a legal dispute with the co-founders of the social media company, which operates the Truth Social app.Trump Media did not provide details of that settlement with United Atlantic Ventures, the partnership of Trump Media's co-founders, Andy Litinsky and Wes Moss.\"All claims by Trump Media against United Atlantic Ventures have been mutually resolved,\" Trump Media said in a statement.Litinksy and Moss were contestants on President Donald Trump's television show, \"The Apprentice.\"UAV sued Trump Media in February 2024 in Delaware Chancery Court, accusing Trump of attempting to \"drastically dilute\" the value of stock shares the co-founders held in the company. That suit was dismissed in September after a judge ruled that the claims \"boil down to conspiracy theories unsupported by factual allegations.\"But there had been other, ongoing litigation between Trump Media and UAV in a Florida state court.The men initially pitched Trump the idea of creating Trump Media in February 2021, within weeks of Trump leaving the White House at the end of his first term.CNBC has requested comment from Trump Media, a lawyer for the company, and a lawyer for United Atlantic Ventures.Shares of Trump Media trade on the NASDAQ under the DJT ticker.This is breaking news. Please refresh for updates.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Truth Social operator Trump Media settles legal dispute with co-founders",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108156452-1749471510589-gettyimages-2219137159-img_5206.jpeg?v=1749471560&w=1920&h=1080"
      ],
      "datePublished": "2025-12-02T23:37:59.000Z",
      "dateModified": "2025-12-02T23:37:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "USDA secretary threatens to cut funding to blue states over alleged SNAP data noncompliance",
    "url": "https://www.cnbc.com/2025/12/02/trump-usda-snap-funding-rollins.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108235367-1764698303964-gettyimages-2243832560-johnson_rollins_136_103125.jpeg?v=1764698326&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-02T22:35:50.000Z",
    "description": "Secretary of Agriculture Brooke Rollins conducts a news conference with Speaker of the House Mike Johnson, R-La., in the U.S. Capitol on the governmen",
    "body": "Secretary of Agriculture Brooke Rollins conducts a news conference with Speaker of the House Mike Johnson, R-La., in the U.S. Capitol on the government shutdown on Friday, October 31, 2025. Tom Williams | Cq-roll Call, Inc. | Getty ImagesU.S. Agriculture Secretary Brooke Rollins on Tuesday threatened to cut off federal funding to Democratic-leaning states over what she alleged is their refusal to share SNAP program data with the Trump administration.The administration \"will begin to stop moving federal funds into those states\" starting next week \"until they comply,\" Rollins told President Donald Trump during a Cabinet meeting at the White House.New York Gov. Kathy Hochul, responding to Rollins in an X post, wrote, \"Genuine question: Why is the Trump Administration so hellbent on people going hungry?\"Rollins said her department needs the state-by-state data on the Supplemental Nutrition Assistance Program, known as food stamps, \"to root out this fraud and to protect the American taxpayer.\"The secretary said the U.S. Department of Agriculture in February had asked all 50 states \"for the first time to turn over their data to the federal government.\"She said 29 \"red states\" complied, but 21 \"blue states continue to say no.\"The noncompliant states include California, New York and Minnesota, Rollins said. The governors' offices for each of those three states did not immediately respond to CNBC's requests for comment.A USDA spokesperson later specified in a statement to CNBC, \"28 States and Guam joined us in this fight; but states like California, New York, and Minnesota, among 19 other blue States, keep fighting us.\"The department had \"established a SNAP integrity team\" to analyze state data and \"end indiscriminate welfare fraud,\" the spokesperson said.\"We have sent Democrat States yet another request for data, and if they fail to comply, they will be provided with formal warning that USDA will pull their administrative funds.\"Massachusetts has not yet received any notice from the Trump administration about withheld federal funds, Gov. Maura Healy's office told CNBC.But Healey nevertheless called Rollins' threat \"truly appalling and cruel.\"\"The Trump Administration is once again playing politics with the ability of working parents with children, seniors and people with disabilities to get food,\" the governor said in a statement. \"President Trump needs to order Secretary Rollins to release SNAP funding immediately and prevent more Americans from going hungry.\"Marissa Saldivar, a spokeswoman for California Gov. Gavin Newsom, told CNBC, \"We no longer take the Trump Administration's words at face value — we'll see what they actually do in reality.\"Saldivar added: \"Cutting programs that feed American children is morally repugnant.\"Critics have long accused the Trump administration of seeking to weaken food-stamp programs. The Republican-backed \"One Big Beautiful Bill Act,\" which Trump signed into law in July, includes cuts to SNAP. The administration later argued during the government shutdown that it could not pay full SNAP benefits in November because it lacked congressionally appropriated funding to do so. Multiple courts had rejected the administration's efforts to halt those payments.Nearly 42 million people benefited from SNAP each month in fiscal year 2024, most of whom are children, elderly or people with disabilities, according to USDA's official website.Rollins at the Cabinet meeting said SNAP suffers from \"rampant fraud.\" But a fact sheet from the USDA's Food and Nutrition Service, citing fiscal year 2023 data, says, \"The majority of SNAP benefits are used as intended.\" Out of nearly 262,000 authorized SNAP retailers, 1,980 were disqualified and 561 were fined in that time period, according to the fact sheet.— CNBC's Mary Catherine Wellons contributed to this report.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "USDA secretary threatens to cut funding to blue states over alleged SNAP data noncompliance",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108235367-1764698303964-gettyimages-2243832560-johnson_rollins_136_103125.jpeg?v=1764698326&w=1920&h=1080"
      ],
      "datePublished": "2025-12-02T22:35:50.000Z",
      "dateModified": "2025-12-02T22:35:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Macy’s posts strongest growth in more than 3 years, but strikes cautious note on holidays",
    "url": "https://www.cnbc.com/2025/12/03/macys-m-earnings-q3-2025.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108233430-1764337028507-gettyimages-2248237179-BLACK_FRIDAY_SHOPPING.jpeg?v=1764337217&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-03T12:02:00.000Z",
    "description": "Shoppers wait in line outside of Macy's flagship store in Herald Square before opening on Black Friday in New York, US, on Friday, Nov. 28, 2025. Adam",
    "body": "Shoppers wait in line outside of Macy's flagship store in Herald Square before opening on Black Friday in New York, US, on Friday, Nov. 28, 2025. Adam Gray | Bloomberg | Getty ImagesMacy's on Wednesday beat Wall Street's sales expectations for the third quarter in a row and posted its strongest growth in more than three years as the company's turnaround strategy showed signs of momentum.The department store operator raised its full-year sales and earnings outlook after its better-than-expected fiscal third quarter. The retailer now expects adjusted earnings per share of between $2 and $2.20, up from its previous expectation of $1.70 to $2.05, and net sales of $21.48 billion to $21.63 billion, compared with its prior outlook of $21.15 billion and $21.45 billion.Macy's said it expects flat to roughly 0.5% comparable sales growth from the previous year. That compares to its previous expectations for a year-over-year decline of between 0.5% and 1.5%. The industry metric takes out one-time dynamics like store openings and closures, and Macy's includes merchandise that it owns, items for brands that pay for space within its stores and its third-party online marketplace.It marked the second consecutive quarter Macy's raised its full-year sales and earnings outlook. The company had cut its full-year earnings outlook in May because of higher tariffs, more promotions and \"some moderation\" in discretionary spending. Even so, the projected annual sales would represent a drop from the year-ago net sales of $22.29 billion. Macy's said about $700 million of that annual net sales decrease is due to the 64 stores it shuttered at the end of the last fiscal year, which ended Feb. 1, and in the early part of this fiscal year. And Macy's said in its news release that its outlook anticipates two challenging dynamics – selective spending by consumers and higher tariffs – will persist in the holiday quarter.In an interview with CNBC, CEO Tony Spring said the company is taking a \"prudent view\" of the fourth quarter because it faces tough year-over-year comparisons and because it's not sure how \"aspirational customers,\" those who like to shop at its stores but are more financially pressured, may spend during the season.\"We're pleased with the fourth quarter to date, but we have a big holiday in front of us,\" he said. He said Macy's department store model is an advantage during the gift-giving season because it offers a wide variety of merchandise and a range of prices, from off-price to luxury.Here's how the department store operator did during its fiscal third quarter compared with what Wall Street expected, based on a survey of analysts by LSEG:Earnings per share: 9 cents adjusted vs. an expected loss of 14 cents Revenue: $4.71 billion vs. $4.62 billion expectedMacy's is trying to put up better and more consistent sales, particularly for its namesake brand. Macy's department stores account for the majority of the New York City-based legacy retailer's business, but their performance has lagged behind the company's higher-end department store, Bloomingdale's, and beauty chain, Bluemercury. To try to reverse that trend, the retailer has stepped up investments in staffing, sharper merchandise and eye-catching displays at Macy's stores. It first rolled out that strategy at 50 locations, which were dubbed the \"First 50,\" and has since expanded that approach to a total of 125 Macy's locations. That's more than a third of the 350 namesake stores that Macy's plans to keep open.Along with the added investment, it has shuttered lower-performing Macy's locations. It announced in early 2024 that it would permanently close about 150 of its namesake stores by early 2027, while planning to add locations for Bloomingdale's and Bluemercury. The company hasn't yet said how many additional stores it may close this fiscal year. In the three-month period that ended Nov. 1, Macy's net income fell to $11 million, or 4 cents per share, compared with $28 million, or 10 cents per share, in the year-ago period. Adjusting for some one-time items, including gains on the sale of real estate, it reported earnings per share of 9 cents.Revenue decreased from $4.74 billion in the year-ago quarter.In the fiscal third quarter, companywide comparable sales rose 3.2% including owned and licensed merchandise and its third-party marketplace. When the company excluded stores that won't be part of its go-forward business, that growth was 3.4%.Bloomingdale's posted the strongest performance of the company's brands, with comparable sales jumping 9% year over year on an owned-plus-licensed basis, including its third-party marketplace. And Bluemercury's comparable sales increased 1.1%.As of Tuesday's close, Macy's shares have risen about 34% so far this year. That outpaces the S&P 500's 16% gains during the same period. Macy's stock closed Tuesday at $22.71, bringing the company's market cap to about $6.10 billion.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Macy’s posts strongest growth in more than 3 years, but strikes cautious note on holidays",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108233430-1764337028507-gettyimages-2248237179-BLACK_FRIDAY_SHOPPING.jpeg?v=1764337217&w=1920&h=1080"
      ],
      "datePublished": "2025-12-03T12:02:00.000Z",
      "dateModified": "2025-12-03T12:02:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Michael Burry calls Tesla 'ridiculously overvalued' and knocks tech industry for a widely used practice",
    "url": "https://www.cnbc.com/2025/12/02/burry-tesla-valuation.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108231762-1764085435434-108231762-1764085364402-gettyimages-498540380-88290117.jpg?v=1764683352&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-02T17:15:06.000Z",
    "description": "Michael Burry attends the premiere of \"The Big Short\" at Ziegfeld Theatre on November 23, 2015 in New York City.Dimitrios Kambouris | Getty ImagesMich",
    "body": "Michael Burry attends the premiere of \"The Big Short\" at Ziegfeld Theatre on November 23, 2015 in New York City.Dimitrios Kambouris | Getty ImagesMichael Burry questioned Tesla's valuation as the investor of \"The Big Short\" fame took aim at the practice of technology companies issuing tons of stock-based compensation and excluding it from earnings results.The investor argues that when accounting for the true profits that include the cost of this compensation and its negative dilution of the company's value over time, companies like Tesla should have lower valuations.\"Tesla's market capitalization is ridiculously overvalued today and has been for a good long time,\" Burry, who rose to fame for his call on a housing market bubble in the 2000s, wrote to subscribers of his new paid Substack.Burry pointed out that Tesla dilutes shareholders at a rate of 3.6% each year and doesn't offer buybacks. He posted a chart with subscribers that he said \"shows the kind of present value destruction that this level of dilution can impart.\"He said the vote to accept CEO Elon Musk's $1 trillion compensation plan means investors should expect to get diluted further — meaning that that these additional shares water down their ownership of the company. The package had 75% approval among voting shares, despite proxy advisors Glass Lewis and ISS coming out against it.\"With recent news of Elon Musk's $1 trillion dollar pay package, dilution is certain to continue,\" Burry wrote.Stock Chart IconStock chart iconTesla in 2025Tesla's market cap is currently $1.43 trillion. The electric vehicle maker's shares have added more than 6% so far in 2025, while the S&P 500 has surged more than 15% in the same period.Burry noted that moving past dilution \"is not easy\" for businesses. He also pointed to Palantir and Amazon as other well-known technology companies that dilute their shares through employee-based compensation, a practice that Burry said \"penalizes shareholders.\"The newsletter post goes into an in-depth explanation of how stock-based compensation is not accurately reflected under Generally Accepted Accounting Principles (GAAP) and how companies used \"adjusted\" earnings to present a bottom line that wrongly ignores the practice as a real expense.Burry quotes Warren Buffett's view of stock-based compensation being treated as something other than a tangible expense: \"What else could it be — a gift from shareholders?\" wrote Buffett in his Berkshire Hathaway 2018 annual letter.Burry launched his Substack called \"Cassandra Unchained\" late last month after deregistering hedge fund Scion Asset Management. The blog, which has a $379 annual subscription fee, has so far focused on why he believes artificial intelligence is a bubble.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Michael Burry calls Tesla 'ridiculously overvalued' and knocks tech industry for a widely used practice",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108231762-1764085435434-108231762-1764085364402-gettyimages-498540380-88290117.jpg?v=1764683352&w=1920&h=1080"
      ],
      "datePublished": "2025-12-02T17:15:06.000Z",
      "dateModified": "2025-12-02T17:15:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Mortgage rates finally moved lower last week, but that didn't do much for demand",
    "url": "https://www.cnbc.com/2025/12/03/mortgage-rates-finally-moved-lower-last-week-but-that-didnt-do-much-for-demand.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108225444-1763044515565-gettyimages-2245906514-MORTGAGE_APPLICATION_FIGURES.jpeg?v=1763044637&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-03T12:00:01.000Z",
    "description": "Homes in Hercules, California, US, on Wednesday, Nov. 12, 2025. David Paul Morris | Bloomberg | Getty ImagesAfter rising for several weeks, mortgage r",
    "body": "Homes in Hercules, California, US, on Wednesday, Nov. 12, 2025. David Paul Morris | Bloomberg | Getty ImagesAfter rising for several weeks, mortgage rates moved decidedly lower last week, but not enough to make much of a difference in demand from current borrowers or potential homebuyers. Total mortgage application volume fell 1.4% for the week, according to the Mortgage Bankers Association's seasonally adjusted index. An additional adjustment was made for the Thanksgiving holiday. The average contract interest rate for 30-year fixed-rate mortgages with conforming loan balances, $806,500 or less, decreased to 6.32% from 6.40%, with points decreasing to 0.58 from 0.60, including the origination fee, for loans with a 20% down payment. \"Mortgage rates moved lower in line with Treasury yields, which declined on data showing a weaker labor market and declining consumer confidence,\" said Joel Kan, MBA's vice president and deputy chief economist. Even with that drop, applications to refinance a home loan dropped 4% for the week but were 109% higher than the same week one year ago, when interest rates were much higher.  Get Property Play directly to your inboxCNBC's Property Play with Diana Olick covers new and evolving opportunities for the real estate investor, delivered weekly to your inbox.Subscribe here to get access today.Applications for a mortgage to purchase a home rose 3% for the week and were 17% higher than the same week one year ago. Buyer demand has been pretty weak this fall, as still-high home prices, relatively high mortgage rates and uncertainty over the state of the economy all weigh on consumers.\"We continue to see mixed results each week as the broader economic outlook remains cloudy, even as cooling home-price growth and increasing for-sale inventory bring some buyers back into the market,\" Kan added. The adjustable-rate mortgage (ARM) share of activity increased to 8% of total applications, as consumers continue to look for more savings. ARMs offer lower rates and can be fixed for up to 10 years. They tend to be more popular in higher rate environments.Interest rates were mixed to start this week. They rose sharply on Monday but then pulled back a little bit Tuesday, according to a separate survey from Mortgage News Daily. There wasn't much economic data to impact rates.\"That could change on Wednesday with the confluence of ADP and ISM Services--both capable of influencing the bond market, even before the shutdown data dynamics temporarily magnified private data's importance,\" wrote Matthew Graham, chief operating officer at Mortgage News Daily.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Mortgage rates finally moved lower last week, but that didn't do much for demand",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108225444-1763044515565-gettyimages-2245906514-MORTGAGE_APPLICATION_FIGURES.jpeg?v=1763044637&w=1920&h=1080"
      ],
      "datePublished": "2025-12-03T12:00:01.000Z",
      "dateModified": "2025-12-03T12:00:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "OpenAI's ChatGPT suffers outage for some users",
    "url": "https://www.cnbc.com/2025/12/02/chatgpt-down-outage-open-ai-chatbot.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108209778-1759986401217-gettyimages-2236404267-radecka-illustra250920_np0Hx.jpeg?v=1764705820&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-02T23:09:59.000Z",
    "description": "OpenAI's EMEA startups head Laura Modiano spoke at the Sifted Summit on Wednesday, 8 October.Nurphoto | Nurphoto | Getty ImagesOpenAI's artificial int",
    "body": "OpenAI's EMEA startups head Laura Modiano spoke at the Sifted Summit on Wednesday, 8 October.Nurphoto | Nurphoto | Getty ImagesOpenAI's artificial intelligence ChatGPT is back online after the chatbot was briefly down for some users on Tuesday. The company said earlier that it was \"experiencing issues,\" including \"increased ChatGPT error rates,\" according to an update on OpenAI's status page. On Tuesday evening, OpenAI said those issues had been resolved.\"Some users briefly ran into issues using ChatGPT earlier today because of a routing misconfiguration,\" OpenAI said in a statement to CNBC. \"It's now fixed. Roughly 3,000 people reported issues with the chatbot on Tuesday, according to Downdetector, a website that tracks outages. The outage comes days after OpenAI disclosed a security breach at Mixpanel one of OpenAI's data analytics providers. The breach compromised user information, such as names, emails and other details tied to the OpenAI API.OpenAI did not disclose how many users were affected, saying in a blog that an attacker \"exported a dataset containing limited customer identifiable information and analytics information.\"The AI lab kickstarted the AI boom with the launch of ChatGPT three years ago. As of October, OpenAI said more than 800 million people use the chatbot each week. Read more CNBC tech newsFormer cyber spy raises $60 million to fight AI threatsYouTube's new AI deepfake tracking tool is alarming experts and creatorsApple names former Microsoft, Google exec to succeed retiring AI chiefInstagram orders employees back to the office 5 days a week",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "OpenAI's ChatGPT suffers outage for some users",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108209778-1759986401217-gettyimages-2236404267-radecka-illustra250920_np0Hx.jpeg?v=1764705820&w=1920&h=1080"
      ],
      "datePublished": "2025-12-02T23:09:59.000Z",
      "dateModified": "2025-12-02T23:09:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Anthropic reportedly preparing for one of the largest IPOs ever in race with OpenAI: FT",
    "url": "https://www.cnbc.com/2025/12/03/anthropic-claude-reportedly-preparing-ipo-race-openai-chatgpt-ft-wilson-sonsini-goodrich-rosati.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108227464-1763479721013-gettyimages-2245836911-kokovlis-notitle251112_nppPs.jpeg?v=1763479768&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-03T03:31:55.000Z",
    "description": "Nurphoto | Getty ImagesAnthropic, the AI startup behind the popular Claude chatbot, is in early talks to launch one of the largest initial public offe",
    "body": "Nurphoto | Getty ImagesAnthropic, the AI startup behind the popular Claude chatbot, is in early talks to launch one of the largest initial public offerings as early as next year, the Financial Times reported Wednesday. For the potential IPO, Anthropic has engaged law firm Wilson Sonsini Goodrich & Rosati, which has previously worked on high-profile tech IPOs such as Google, LinkedIn and Lyft, the FT said, citing two sources familiar with the matter.The start-up, led by chief executive Dario Amodei, was also pursuing a private funding round that could value it above $300 billion, including a $15 billion combined commitment from Microsoft and Nvidia, per the report. It added that Anthropic has also discussed a potential IPO with major investment banks, but that sources characterized the discussions as preliminary and informal. If true, the news could position Anthropic in a race to market with rival ChatGPT-maker OpenAI, which is also reportedly laying the groundwork for a public offering. The potential listings would also test investors' appetite for loss-making AI startups amid growing fears of a so-called AI bubble. However, an Anthropic spokesperson told the FT: \"It's fairly standard practice for companies operating at our scale and revenue level to effectively operate as if they are publicly traded companies,\" adding that no decisions have been made on timing or whether to go public.CNBC was unable to reach Anthropic and Wilson Sonsini, which has advised Anthropic for a few years, for comment. According to one of the FT's sources, Anthropic has been working through internal preparations for a potential listing, though details were not provided. The FT report follows several notable changes at the company of late, including the hiring of former Airbnb executive Krishna Rao, who played a key role in the firm's 2020 IPO.CNBC also reported last month that Anthropic was recently valued to the range of $350 billion after receiving investments of up to $5 billion from Microsoft and $10 billion from Nvidia. In its race to overtake OpenAI in the AI space, the startup has also been expanding aggressively, recently announcing a $50 billion AI infrastructure build-out with data centers in Texas and New York, and tripling its international workforce.According to the FT report, investors in the company are enthusiastic about Anthropic's potential IPO, which could see it \"seize the initiative\" from OpenAI.While OpenAI has been rumoured to be considering an IPO, its chief financial officer recently said the company is not pursuing a near-term listing, even as it closed a $6.6 billion share sale at a $500 billion valuation in October.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Anthropic reportedly preparing for one of the largest IPOs ever in race with OpenAI: FT",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108227464-1763479721013-gettyimages-2245836911-kokovlis-notitle251112_nppPs.jpeg?v=1763479768&w=1920&h=1080"
      ],
      "datePublished": "2025-12-03T03:31:55.000Z",
      "dateModified": "2025-12-03T03:31:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Musk's Starlink rival Eutelsat shares plummet 7% after report of SoftBank cutting its stake",
    "url": "https://www.cnbc.com/2025/12/03/musks-starlink-rival-eutelsat-shares-softbank.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108113207-1741601280278-gettyimages-2203401162-PORTUGAL_EUTELSAT.jpeg?v=1750775650&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-03T11:20:14.000Z",
    "description": "French satellite group Eutelsat, often seen as Europe's answer to Elon Musk's Starlink, saw its share price plummet Wednesday following a report that ",
    "body": "French satellite group Eutelsat, often seen as Europe's answer to Elon Musk's Starlink, saw its share price plummet Wednesday following a report that Japanse investor SoftBank cut its stake in the company. Shares in Eutelsat were last trading 7.8% lower as of 6:00 a.m. ET.The moves come following a Reuters report that SoftBank has sold 36 million rights, corresponding to around 26 million shares and around half their stake in the satellite operator.Eutelsat is the owner of the satellite internet provider OneWeb, which it merged with in 2023 in a bid to challenge Starlink's dominance in the market.But the French group has struggled to tap into the U.S. company's market share. Eutelsat currently has more than 600 satellites in orbit compared to Starlink's over 6,750, according to the companies' websites.After soaring more than 600% in early March this year, as Europe scrambled to bolster its tech sovereignty in the wake of the U.S. cutting military support to Ukraine, Eutelsat shares have since dropped more than 70%.The company is seen as crucial to Europe's tech sovereignty ambitions. In June the French state led a 1.35 billion euro ($1.57 billion) investment in Eutelsat, becoming its biggest shareholder with a roughly 30% stake.Tech sovereigntyIn November SoftBank said it had sold its entire stake in U.S. chipmaker Nvidia as it looked to free up funds for its investment in OpenAI and other projects.SoftBank wouldn't have made the move if it didn't need to bankroll its next artificial intelligence investments, founder Masayoshi Son said on Monday at an event.watch nowThe Japanese giant's Eutelsat move mirrors its \"aggressive monetisation\" across its portfolio, Luke Kehoe, analyst at Ookla, told CNBC.\"With governments and strategic European investors, not SoftBank, now funding the recapitalisation, Eutelsat is becoming less a growth story and more a pillar of Europe's digital sovereignty infrastructure.\"While Starlink is holding on to its scale advantage and is dominant in retail broadband, Eutelsat is carving out a niche in government, aviation, backhaul and emergency connectivity, said Kehoe.\"The open question is whether that higher-value, B2B-centric positioning can deliver attractive returns once the current wave of capex and recapitalisations is behind it, and whether Europe is willing to keep writing cheques at the scale required to narrow the gap with Starlink.\"Eutelsat and SoftBank have been approached for comment.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Musk's Starlink rival Eutelsat shares plummet 7% after report of SoftBank cutting its stake",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108113207-1741601280278-gettyimages-2203401162-PORTUGAL_EUTELSAT.jpeg?v=1750775650&w=1920&h=1080"
      ],
      "datePublished": "2025-12-03T11:20:14.000Z",
      "dateModified": "2025-12-03T11:20:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Marvell to acquire Celestial AI for as much as $5.5 billion",
    "url": "https://www.cnbc.com/2025/12/02/mrvl-earnings-q3-2026-acquires-celestial-ai.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108190251-1756132836201-gettyimages-2169879324-INTEL_MARVELL_ALTERA.jpeg?v=1764712207&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-02T23:40:15.000Z",
    "description": "Marvell Technology Group Ltd. headquarters in Santa Clara, California, on Sept. 6, 2024.David Paul Morris | Bloomberg | Getty ImagesSemiconductor comp",
    "body": "Marvell Technology Group Ltd. headquarters in Santa Clara, California, on Sept. 6, 2024.David Paul Morris | Bloomberg | Getty ImagesSemiconductor company Marvell on Tuesday announced that it will acquire Celestial AI for at least $3.25 billion in cash and stock.The purchase price could increase to $5.5 billion if Celestial hits revenue milestones, Marvell said. Marvell shares rose 13% in extended trading Tuesday as the company reported third-quarter earnings that beat expectations and said on the earnings call that it expected data center revenue to rise 25% next year. The deal is an aggressive move for Marvell to acquire complimentary technology to its semiconductor networking business. The addition of Celestial could enable Marvell to sell more chips and parts to companies that are currently committing to spend hundreds of billions of dollars on infrastructure for AI.  Marvell stock is down 18% so far in 2025 even as semiconductor rivals like Broadcom have seen big valuation increases driven by excitement around artificial intelligence.Celestial is a startup focused on developing optical interconnect hardware, which it calls a \"photonic fabric,\" to connect high-performance computers. Celestial was reportedly valued at $2.5 billion in March in a funding round, and Intel CEO Lip-Bu Tan joined the startup's board in January. Optical connections are becoming increasingly important because the most advanced AI systems need those parts tie together dozens or hundreds of chips so they can work as one to train and run the biggest large-language models.Currently, many AI chip connections are done using copper wires, but newer systems are increasingly using optical connections because they can transfer more data faster and enable physically longer cables. Optical connections also cost more. \"This builds on our technology leadership, broadens our addressable market in scale-up connectivity, and accelerates our roadmap to deliver the industry's most complete connectivity platform for AI and cloud customers,\" Marvell CEO Matt Murphy said in a statement. Marvell said that the first application of Celestial technology would be to connect a system based on \"large XPUs,\" which are custom AI chips usually made by the companies investing billions in AI infrastructure. On Tuesday, the company said that it could even integrate Celestial's optical technology into custom chips, and based on customer traction, the startup's technology would soon be integrated into custom AI chips and related parts called switches.Amazon Web Services Vice President Dave Brown said in a statement that Marvell's acquisition of Celestial will \"help further accelerate optical scale-up innovation for next-generation AI deployments.\"The maximum payout for the deal will be triggered if Celestial can record $2 billion in cumulative revenue by the end of fiscal 2029. The deal is expected to close early next year. In its third-quarter earnings on Tuesday, Marvell earnings of 76 cents per share on $2.08 billion in sales, versus LSEG expectations of 73 cents on $2.07 billion in sales. Marvell said that it expects fourth-quarter revenue to be $2.2 billion, slightly higher than LSEG's forecast of $2.18 billion. WATCH: Nvidia GPUs to Google TPUs: Breaking down all the AI chipswatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Marvell to acquire Celestial AI for as much as $5.5 billion",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108190251-1756132836201-gettyimages-2169879324-INTEL_MARVELL_ALTERA.jpeg?v=1764712207&w=1920&h=1080"
      ],
      "datePublished": "2025-12-02T23:40:15.000Z",
      "dateModified": "2025-12-02T23:40:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Malaysia to resume search for missing flight MH370, more than a decade after plane vanished",
    "url": "https://www.cnbc.com/2025/12/03/malaysia-to-resume-search-for-missing-flight-mh370-more-than-a-decade-after-plane-vanished.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108235686-1764735395043-gettyimages-2170740096-gy2_1673_e3txrpxn.jpeg?v=1764735412&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-03T08:06:54.000Z",
    "description": "SYDNEY, AUSTRALIA - SEPTEMBER 05: A Malaysia Airlines Aircraft at Sydney Airport on September 05, 2024 in Sydney, Australia. James Gourley | Getty Ima",
    "body": "SYDNEY, AUSTRALIA - SEPTEMBER 05: A Malaysia Airlines Aircraft at Sydney Airport on September 05, 2024 in Sydney, Australia. James Gourley | Getty Images News | Getty Images The search for the missing Malaysia Airlines flight MH370 will resume later this month, more than a decade after the jet disappeared in one of the world's greatest aviation mysteries. The deep-sea search for missing wreckage of the aircraft will resume on Dec. 30, with U.S-based marine robotics firm Ocean Infinity carrying out the operation intermittently for a period of 55 days, Malaysia's transport ministry said in a statement Wednesday. \"The search will be carried out in targeted area assesed to have the highest probability of locating the aircraft,\" the ministry said, without specifying the location of the search area.  Flight MH370 was carrying 12 crew members and 227 passengers en route from Kuala Lumpur to Beijing when it disappeared from air traffic radar on Mar. 8, 2014, prompting multiple rounds of search efforts that have proved fruitless.   In March, the Malaysian government approved a new search for the missing aircraft's debris, commissioning Ocean Infinity on a \"no-find, no-fee\" contract, in which the company will receive $70 million only if wreckage was discovered. However, the search was halted in April due to bad weather conditions.   Malaysia also engaged Ocean Infinity to search the southern Indian Ocean in 2018, but it failed to find any substantive wreckage. TOPSHOT - A woman writes a message during an event held by relatives of the passengers and supporters to mark the 10th year since the Malaysia Airlines flight MH370 carrying 239 people disappeared from radar screens on March 8, 2014 while en route from Kuala Lumpur to Beijing, in Subang Jaya on March 3, 2024. Arif Kartono | Afp | Getty ImagesIn January 2017, Malaysia, China and Australia ended a futile two-year underwater search. In a 440-page investigation report that year, Australian officials said they had identified \"a specific area of the Indian Ocean\" that was more likely to be where the aircraft ended the flight. The report added that some debris, believed to be from the aircraft, washed ashore on the east African coast and Indian Ocean islands in 2015 and 2016.Malaysia's former prime minister Najib Razak said in 2014 that the jetliner had its communication and tracking system deliberately disabled and flown off course for more than six hours after it disappeared from the radar.  Onboard the flight were more than 150 Chinese passengers, 50 Malaysians, and citizens of France, Australia, Indonesia, India, the U.S., Ukraine and Canada, among others.  watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Malaysia to resume search for missing flight MH370, more than a decade after plane vanished",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108235686-1764735395043-gettyimages-2170740096-gy2_1673_e3txrpxn.jpeg?v=1764735412&w=1920&h=1080"
      ],
      "datePublished": "2025-12-03T08:06:54.000Z",
      "dateModified": "2025-12-03T08:06:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sabrina Carpenter blasts Trump admin for 'evil' ICE video that uses her song 'Juno'",
    "url": "https://www.cnbc.com/2025/12/02/sabrina-carpenter-trump-ice-video-tiktok-juno.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108235330-1764695367557-gettyimages-2243842482-_m2_4152_sk0p8pdj_krqbejql.jpeg?v=1764695465&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-02T20:00:00.000Z",
    "description": "Sabrina Carpenter performs during her \"Short n' Sweet\" tour at Madison Square Garden on October 26, 2025 in New York, New York. Kevin Mazur | Getty Im",
    "body": "Sabrina Carpenter performs during her \"Short n' Sweet\" tour at Madison Square Garden on October 26, 2025 in New York, New York. Kevin Mazur | Getty ImagesPop star Sabrina Carpenter on Tuesday blasted the Trump administration for using her hit 2024 song \"Juno\" as the soundtrack for a TikTok video showing Immigration and Customs Enforcement agents detaining people during raids.\"This video is evil and disgusting,\" Carpenter wrote on X, in response to the White House posting the ICE video on TikTok.\"Do not ever involve me or my music to benefit your inhumane agenda,\" she added.The clip posted by the White House begins with footage of a protest against ICE operations before cutting to a montage of agents handcuffing and detaining people. The soundtrack features a viral lyric from \"Juno\": \"Have you ever tried this one?\" The caption on the White House's post echoes the lyric: \"Have you ever tried this one? Bye-bye.\"Carpenter typically performs the song on tour with a playful skit involving pink furry faux handcuffs.White House spokeswoman Abigail Jackson responded to Carpenter's criticism in a statement to CNBC.\"Here's a Short n' Sweet message for Sabrina Carpenter: we won't apologize for deporting  dangerous criminal illegal murderers, rapists, and pedophiles from our country,\" Jackson said.\"Anyone who would defend these sick monsters must be stupid, or is it slow?\" she said.\"Short n' Sweet\" is the 2024 album by Carpenter that launched her to global fame. \"Juno\" is on that album.CNBC has requested comment from Carpenter representatives.Carpenter is the latest in a growing line of artists who have objected to President Donald Trump or his administration using their music without permission or in political messaging. Beyoncé, Neil Young, ABBA, Celine Dion, and Olivia Rodrigo are among the performers who have previously demanded that Trump stop using their songs at rallies or in social-media videos. Several of those artists have sent cease-and-desist letters or threatened legal action.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sabrina Carpenter blasts Trump admin for 'evil' ICE video that uses her song 'Juno'",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108235330-1764695367557-gettyimages-2243842482-_m2_4152_sk0p8pdj_krqbejql.jpeg?v=1764695465&w=1920&h=1080"
      ],
      "datePublished": "2025-12-02T20:00:00.000Z",
      "dateModified": "2025-12-02T20:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "South Korea's Lee vows 'strict accountability' for martial law perpetrators a year after Yoon’s ‘self-coup' attempt",
    "url": "https://www.cnbc.com/2025/12/03/south-korea-lee-jae-myung-yoon-suk-yeol-martial-law-coup-han-duck-soo-trial-court-law.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108235691-1764736555012-gettyimages-2249651443-csj39430_vh4fvnuh.jpeg?v=1764736564&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-03T08:17:33.000Z",
    "description": "SEOUL, SOUTH KOREA - DECEMBER 03: President Lee Jae Myung speaks during a press conference to mark the first anniversary of former President Yoon Suk ",
    "body": "SEOUL, SOUTH KOREA - DECEMBER 03: President Lee Jae Myung speaks during a press conference to mark the first anniversary of former President Yoon Suk Yeol's brief imposition of martial law, at Yeongbingwan of Blue House on December 03, 2025 in Seoul, South Korea. A year has passed since then-President Yoon Suk Yeol declared a state of emergency martial law, stunning Korea and setting off a political crisis that continues to reverberate today. (Photo by Chung Sung-Jun/Getty Images)Chung Sung-jun | Getty Images News | Getty ImagesSouth Korean President Lee Jae Myung vowed \"strict accountability\" for the perpetrators behind last year's failed martial law attempt by former leader Yoon Suk Yeol, calling the upheaval a test of the country's democratic resilience.Speaking in a special address to the nation, Lee described the events of Dec. 3 as a \"revolution of light,\" according to an English translation by Ariang News, and said that this \"revolution\" was incomplete.He added that investigations and trials tied to the insurrection remain underway.The former president is currently on trial for insurrection, while prosecutors have reportedly sought a 15-year prison term for former prime minister Han Duck-soo. Other senior officials, including Yoon's defence minister and the former head of the National Intelligence Service, have also been arrested in connection with the attempt to impose military rule. The speech marked one year since Yoon abruptly declared martial law, the first such move in Asia's fourth-largest economy since 1980.A television screen shows a news broadcasting of South Korean President Yoon Suk Yeol delivering a speech on emergency martial law, in Goyang, northwest of Seoul, on December 3, 2024.Jung Yeon-je | Afp | Getty ImagesLee labeled the martial law attempt by Yoon a \"self-coup\" and said that \"those who destroyed the constitutional order for personal ambition and even sought to provoke war must face judgment, to build a country where no one can ever again dream of a coup.\"The South Korean president also commended the South Korean people in his speech, saying that they had overcome an \"unprecedented democratic crisis\" peacefully, and were \"fully deserving of the Nobel Peace Prize.\"When asked by the press if he would nominate the South Korean people for the honour, Lee clarified that this was merely his personal opinion, but hoped that his comment would be a \"trigger [for] people's discussions.\" Martial law attemptThe crisis began on Dec. 3, 2024, when Yoon suddenly declared martial law in a late-night address and accused Lee's Democratic Party of Korea of engaging in \"anti-state activities\" and colluding with \"North Korean communists.\" Yoon ordered troops to the country's National Assembly, where soldiers blocked access and clashed with protesters and lawmakers as special forces attempted to enter the chamber. But within three hours, the martial law order was overturned after 190 of the 300 National Assembly lawmakers — including Lee — managed to gather in the chamber and unanimously overturned the decree. Yoon eventually lifted martial law about six hours after his announcement. Soldiers try to enter the National Assembly building in Seoul on December 4 2024, after South Korea President Yoon Suk Yeol declared martial law. South Korea's President Yoon Suk Yeol on December 3 declared martial law, accusing the opposition of being \"anti-state forces\" and saying he was acting to protect the country from \"threats\" posed by the North.Jung Yeon-je | Afp | Getty ImagesSouth Korea then spiraled into weeks of political turmoil. Yoon was impeached on Dec. 14, making then-Prime Minister Han the acting president. Han was also impeached on Dec. 27 and replaced by then-Deputy Prime Minister Choi Sang-mok. The country's Constitutional Court then reinstated Han in March, making him acting president again until the court finally removed Yoon from office on April 4. Yoon was later arrested and charged with insurrection, an offense that carries the maximum penalty of death.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "South Korea's Lee vows 'strict accountability' for martial law perpetrators a year after Yoon’s ‘self-coup' attempt",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108235691-1764736555012-gettyimages-2249651443-csj39430_vh4fvnuh.jpeg?v=1764736564&w=1920&h=1080"
      ],
      "datePublished": "2025-12-03T08:17:33.000Z",
      "dateModified": "2025-12-03T08:17:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]