[
  {
    "title": "Amazon Pharmacy starts offering Novo Nordisk's Wegovy weight loss pill",
    "url": "https://www.cnbc.com/2026/01/09/amazon-pharmacy-starts-offering-novo-nordisks-wegovy-weight-loss-pill.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107386525-1710277103163-gettyimages-1342267772-281619final.jpeg?v=1767978225&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-09T17:11:25.000Z",
    "description": "Close-up of a hand holding a cellphone displaying the Amazon Pharmacy system, Lafayette, California, Sept. 15, 2021.Smith Collection | Gado | Getty Im",
    "body": "Close-up of a hand holding a cellphone displaying the Amazon Pharmacy system, Lafayette, California, Sept. 15, 2021.Smith Collection | Gado | Getty ImagesAmazon announced Friday it now offers Novo Nordisk's Wegovy weight loss pill through its digital pharmacy.Novo Nordisk began rolling out an oral version of its injectable obesity drug Wegovy in the U.S. on Monday, offering a starting dose for cash-paying patients at $149 per month. Patients with insurance coverage can get the pill for as low as $25 a month. The daily pill enters the market with some of the lowest cash prices in the booming obesity and diabetes drug space, which costly weekly injections from Novo Nordisk and Eli Lilly have long dominated. Its availability on Amazon underscores Novo Nordisk's strategy to expand beyond traditional channels and reach new patients.Amazon said eligible customers with insurance can pay as little as $25 for a one-month supply of the drug. Its cash-pay option will start at $149 a month. In the coming weeks, Amazon said it will also offer the Wegovy pill through its prescription vending kiosks, which are located in select One Medical clinics. The e-commerce giant launched Amazon Pharmacy in 2020 as part of its deeper push into the multitrillion-dollar U.S. health-care industry. The service was born out of its acquisition of online pharmacy PillPack for roughly $750 million in 2018. It then bought primary-care clinic One Medical in 2022 for $3.9 billion. Amazon has sought to attract users to its service by offering speedy delivery and price transparency. It offers same-day prescription delivery to nearly half of U.S. consumers, Amazon said. The company hasn't disclosed how many users Amazon Pharmacy has, but analysts have estimated it could generate about $2 billion in annual revenue. In October, Weight Watchers said it would partner with Amazon Pharmacy to deliver weight loss medications for its members. Amazon Pharmacy has also collaborated with Eli Lilly to help deliver certain prescription medications, including its obesity drug Zepbound, purchased through the drugmaker's direct-to-consumer website.After its launch this week, the Novo Nordisk pill is also available at more than 70,000 U.S. pharmacies such as CVS and Costco, as well as select telehealth providers, including Ro, LifeMD, Weight Watchers, GoodRx and Novo Nordisk's NovoCare Pharmacy.Cash-paying patients will also be able to access the starting dose of the pill for $149 per month on President Donald Trump's direct-to-consumer website, TrumpRx, under a deal Novo Nordisk struck with his administration in November. The site also launches in January, though it's unclear when.Health experts say oral options could expand obesity treatment access in the U.S., likely reaching entirely new people who were afraid of needles or believed injections were too serious or aggressive for them to start.Eli Lilly has a rival obesity pill that is slated to win Food and Drug Administration approval later this year.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Amazon Pharmacy starts offering Novo Nordisk's Wegovy weight loss pill",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107386525-1710277103163-gettyimages-1342267772-281619final.jpeg?v=1767978225&w=1920&h=1080"
      ],
      "datePublished": "2026-01-09T17:11:25.000Z",
      "dateModified": "2026-01-09T17:11:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Mortgage rates drop to lowest level in nearly 3 years as Trump orders buying of $200 billion in mortgage bonds",
    "url": "https://www.cnbc.com/2026/01/09/heres-whats-happening-now-with-mortgage-rates-.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108175885-1767978078851-108175885-1753292274175-gettyimages-2206361180-MORTGAGE_APPLICATIONS_FIGURES.jpeg?v=1767978107&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-09T23:14:27.000Z",
    "description": "watch nowMortgage rates fell sharply on Friday, a day after President Donald Trump said on social media that he is instructing mortgage giants Fannie ",
    "body": "watch nowMortgage rates fell sharply on Friday, a day after President Donald Trump said on social media that he is instructing mortgage giants Fannie Mae and Freddie Mac to buy $200 billion in mortgage bonds. \"This will drive Mortgage Rates DOWN, monthly payments DOWN, and make the cost of owning a home more affordable,\" he said in the Truth Social post.The rate on a 30-year mortgage dropped 22 basis points to 5.99%, matching the low from Feb. 2, 2023, according to Mortgage News Daily. Fannie Mae and Freddie, which are in government conservatorship, do not originate home loans. They buy loans from lenders, bundle them into mortgage-backed securities, or MBS, and sell them to investors — thereby replenishing lender funds for new loans and keeping interest rates lower and more stable for homebuyers.Purchasing more mortgage-backed bonds or securities does move mortgage rates lower. In the first two months of the Covid pandemic, as markets reeled, the Federal Reserve purchased $580 billion in agency MBS. It then continued buying more throughout the year. From March 2020 through June 2021, the Federal Reserve increased its agency MBS holdings from $1.4 trillion to $2.3 trillion, according to the Dallas Fed. The Federal Reserve also lowered its own lending rate to zero. The combination brought the average rate on the 30-year fixed mortgage to record lows, hitting just 2.75% at the start of 2021, according to Mortgage News Daily. \"How big a deal is $200 billion? This depends on a few factors, but the reaction in the MBS market is enough to tell you that it matters,\" said Matthew Graham, chief operating officer at Mortgage News Daily which tracks rates closely and is already seeing them fall just from the news of the announcement.While it is still not known how quickly this would start and how long it will take, analysts are predicting where mortgage rates could end up; most put the drop somewhere between 25 and 50 basis points, some even lower. \"We believe that $200bn of MBS purchases could drive a ~10-25bps reduction in mortgage rates, potentially reducing the current 30-year headline mortgage rate to roughly 6.0% (current 6.21%). While still elevated relative to the average outstanding mortgage rate of 4.4% and the 3.25% levels as recently as Jan 2022, this decline may provide a boost to both new construction demand and existing home turnover,\" analysts at UBS wrote.Put simply, if rates were to drop even to 5.9%, for someone buying the median-priced home — which is right around $425,000, according to the National Association of Realtors — using a 30-year fixed mortgage with a 20% down payment, the monthly payment would drop by $118. For some, that may not seem like a lot, but for first-time buyers on the edge of affordability, it could make a difference. They would still, however, need to save for the down payment, which is currently the biggest hurdle for most first-timers. Homebuilder stocks rallied on the news, but they were already buying down mortgage rates prior to this well into the 5% range. Their concerns lately have been more focused on increasing costs from tariffs and a continued labor shortage. That said, just the news of this could have an impact on buyer demand for the builders. \"I think psychologically it will help,\" said Ivy Zelman, executive vice president of research and securities at Zelman, a Walker & Dunlop company. \"I think that today, people that have been looking that didn't even know builders were offering mortgage rate buydowns might step into the market.\"But Zelman also points out that in the broader home market it's not just the mortgage rate, but overall affordability that is keeping buyers sidelined. Consumers are stretched, and home prices are close to 50% higher than they were pre-pandemic, ironically because of those record-low mortgage rates brought on by MBS purchases.\"This is not enough to really get the market going because we know people can't qualify even at 4.99%. They can say that the mortgage rates are going to go down to below 5, but we have people that still can't qualify at 4.99%, so I think there's more work to be done,\" Zelman said.Get Property Play directly to your inboxCNBC's Property Play with Diana Olick covers new and evolving opportunities for the real estate investor, delivered weekly to your inbox.Subscribe here to get access today.This could also help builder margins, which have been shrinking lately because of higher costs.\"From a demand perspective, [it is] maybe a marginal benefit from the positive psychological impact on consumers,\" said John Lovallo, analyst at UBS. \"Bigger is the potential ability for builders to begin pulling back on incentives to some extent which would be very accretive to gross margins.\"The drop, however, could also help current homeowners to save on their monthly payments through a refinance. Rates have already been dropping steadily, with the 30-year fixed down from it's recent peak of 7.16% one year ago. Applications to refinance a home loan were already 133% higher year over year before this announcement, according to the Mortgage Bankers Association. The general rule of thumb is that a refinance is only worth the cost if you can save more than 75 basis points on a mortgage rate. This would add many more potential candidates to the refinance pool, especially those who took out their loans over the last two years. The vast majority of homeowners, however, still have rates below 4%. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Mortgage rates drop to lowest level in nearly 3 years as Trump orders buying of $200 billion in mortgage bonds",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108175885-1767978078851-108175885-1753292274175-gettyimages-2206361180-MORTGAGE_APPLICATIONS_FIGURES.jpeg?v=1767978107&w=1920&h=1080"
      ],
      "datePublished": "2026-01-09T23:14:27.000Z",
      "dateModified": "2026-01-09T23:14:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Meta signs nuclear energy deals to power Prometheus AI supercluster",
    "url": "https://www.cnbc.com/2026/01/09/meta-signs-nuclear-energy-deals-to-power-prometheus-ai-supercluster.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108201478-17583103972025-09-18t012329z_339798057_rc21ugat6ure_rtrmadp_0_meta-platforms-virtual-reality.jpeg?v=1758310428&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-09T22:03:10.000Z",
    "description": "Meta CEO Mark Zuckerberg wears the Meta Ray-Ban Display glasses, as he delivers a speech presenting the new line of smart glasses, during the Meta Con",
    "body": "Meta CEO Mark Zuckerberg wears the Meta Ray-Ban Display glasses, as he delivers a speech presenting the new line of smart glasses, during the Meta Connect event at the company's headquarters in Menlo Park, California, U.S., Sept. 17, 2025. Carlos Barria | ReutersMeta on Friday announced agreements with three nuclear power providers, including one backed by OpenAI CEO Sam Altman, as part of its efforts to secure necessary resources for its AI ambitions. The arrangements with Vistra, TerraPower and Oklo, which are all working on nuclear power technologies, are for Meta's Prometheus supercluster computing system that's being built at a data center in New Albany, Ohio. No financial terms were disclosed. Shares of Vistra and Oklo climbed following the news, rising 10% and 8%, respectively. Meta shares closed 1% higher.Meta CEO Mark Zuckerberg announced Prometheus in July, describing the system as one of the keys to the development of the company's advanced artificial intelligence efforts. Meta has said it expects Prometheus to come online sometime in 2026. In working with the three companies on energy production, Meta said the projects should add 6.6 gigawatts of power by 2035, exceeding the total demand of New Hampshire.Stock Chart IconStock chart iconOklo and Vistra one-day stock chart.\"State-of-the-art data centers and AI infrastructure are essential to securing America's position as a global leader in AI,\" Meta policy chief Joel Kaplan said in a statement. The company said it will help fund Vistra's nuclear power plants in Ohio and Pennsylvania, extending the lifespan of those facilities and increasing their energy production. The other two companies' nuclear projects are still being developed. Meta expects the agreements to create \"thousands of construction jobs and hundreds of long-term operational jobs.\"The deals mark the latest efforts by Meta to secure the energy needed to power its AI infrastructure as the company marches toward Zuckerberg's goal of developing superintelligence, a term used to describe AI that can greatly exceed the capabilities of humans on numerous tasks.Meta's megacap rivals are also looking to nuclear power to help fuel their AI work. Meta, Amazon and Google signed a pledge in March supporting the tripling of global nuclear energy production by 2050.Read more CNBC tech newsMeta faces China probe over acquisition of AI agent startup ManusMicrosoft revealed as company behind controversial data center proposal in Michigan townshipAlphabet's market cap surpasses Apple's for first time since 2019Google, Character.AI to settle suits involving minor suicides and AI chatbotsIn June, Meta announced a 20-year agreement with Constellation Energy so it could purchase purchase nuclear power from the company's Clinton Clean Energy Center in Illinois beginning in 2027.Meta's deal with TerraPower will provide funding for two of the energy company's nuclear projects that are under development and could begin generating power by 2032, according to Friday's announcement. Meta said it could obtain rights for more energy from up to six of TerraPower's other nuclear energy projects that are targeted for delivery by 2035. Meanwhile, Oklo's advanced nuclear technology campus is expected to come online as soon as 2030 in Pike County, Ohio, Meta said. OpenAI's Altman is one of Oklo's biggest investors, owning a 4.3% stake worth about $650 million as of Thursday's close, according to FactSet. Oklo went public in 2024 through a special purpose acquisition company that Altman co-founded. Altman stepped down as chairman of Oklo's board in April as a way to help the company secure more customers with companies that compete with OpenAI.WATCH: AI hardware trade dominates in 2025.watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Meta signs nuclear energy deals to power Prometheus AI supercluster",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108201478-17583103972025-09-18t012329z_339798057_rc21ugat6ure_rtrmadp_0_meta-platforms-virtual-reality.jpeg?v=1758310428&w=1920&h=1080"
      ],
      "datePublished": "2026-01-09T22:03:10.000Z",
      "dateModified": "2026-01-09T22:03:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump: ‘We are going to do something on Greenland whether they like it or not’",
    "url": "https://www.cnbc.com/2026/01/09/trump-greenland-military-denmark-nato.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108250788-17679929202026-01-09t210706z_1480491720_rc2xxialacxu_rtrmadp_0_usa-trump.jpeg?v=1767992982&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-09T22:03:34.000Z",
    "description": "U.S. President Donald Trump takes questions from reporters, as he attends a meeting with oil industry executives, at the White House in Washington, D.",
    "body": "U.S. President Donald Trump takes questions from reporters, as he attends a meeting with oil industry executives, at the White House in Washington, D.C., U.S., Jan. 9, 2026. Kevin Lamarque | ReutersPresident Donald Trump said Friday his administration will take action on Greenland \"whether they like it or not,\" further escalating his rhetoric as he pushes to acquire the Danish territory for the U.S.\"I would like to make a deal, you know, the easy way. But if we don't do it the easy way, we're going to do it the hard way,\" Trump told reporters at the White House.The comments came during a meeting with oil executives to discuss the prospect of doing business in Venezuela. Less than a week earlier, the U.S. military invaded the oil-rich South American nation and captured its leader, Nicolás Maduro.Trump has long sought to take over Greenland, primarily citing the Arctic island's importance for U.S. national security. Denmark and its European allies in NATO – the military alliance co-founded by the U.S. – have pushed back, reiterating that Greenland is not for sale. But the Trump administration nevertheless says it is currently weighing a range of options on Greenland, including utilizing the U.S. military or cutting a deal to purchase it from Denmark.Government officials have also mulled sending lump sums of cash to Greenlanders in order to sway them to join the U.S., Reuters reported Thursday.Asked on Friday how much those payments could be, Trump said, \"I'm not talking about money for Greenland, yet.\"\"I might talk about that, but right now we are going to do something on Greenland, whether they like it or not,\" Trump said.\"Because if we don't do it, Russia or China will take over Greenland, and we're not going to have Russia or China as a neighbor,\" he said.Trump said that while he is a \"big fan\" of Denmark, \"the fact that they had a boat land there 500 years ago doesn't mean that they own the land. [I'm] sure we had lots of boats go there also.\"\"So we're going to be doing something with Greenland, either the nice way or the more difficult,\" he said.The U.S. military already maintains a base in Greenland, and it reportedly has the ability to expand its presence there if desired.But that isn't enough, Trump said.\"When we own it, we defend it. You don't defend leases the same way, you have to own it,\" he said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump: ‘We are going to do something on Greenland whether they like it or not’",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108250788-17679929202026-01-09t210706z_1480491720_rc2xxialacxu_rtrmadp_0_usa-trump.jpeg?v=1767992982&w=1920&h=1080"
      ],
      "datePublished": "2026-01-09T22:03:34.000Z",
      "dateModified": "2026-01-09T22:03:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Stellantis scraps Jeep, Chrysler plug-in hybrid vehicles amid EV slowdown, recall",
    "url": "https://www.cnbc.com/2026/01/09/stellantis-scraps-jeep-chrysler-phevs-amid-ev-slowdown-recall.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108134399-1745269689624-NYIAS_DeVries_04162025-199.jpg?v=1745270312&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-09T18:24:27.000Z",
    "description": "The Camp Jeep outdoor terrain at the New York International Auto Shown on April 16, 2025. Danielle DeVries | CNBCDETROIT — Stellantis is scrapping its",
    "body": "The Camp Jeep outdoor terrain at the New York International Auto Shown on April 16, 2025. Danielle DeVries | CNBCDETROIT — Stellantis is scrapping its plug-in hybrid electric Jeep SUVs and Chrysler minivan amid slowing EV sales, quality issues and weakened federal fuel economy requirements. The automaker on Friday said the decision to end production of the plug-in hybrid Jeep Wrangler, Jeep Grand Cherokee and Chrysler Pacifica was a result of waning customer demand and the need to focus on \"more competitive electrified solutions, including hybrid and range‑extended vehicles.\"\"Stellantis continually evaluates its product strategy to meet evolving customer needs and regulatory requirements. With customer demand shifting, Stellantis will phase out plug‑in hybrid (PHEV) programs in North America beginning with the 2026 model year,\" the company said in an emailed statement.The decision is an about-face for the automaker, which has touted its U.S. sales leadership of the models for years. In 2024, then-Jeep CEO Antonio Filosa — who is now CEO of Stellantis — said the SUV brand planned to sell 160,000 to 170,000 PHEVs that year, and the company said it represented 41% of U.S. PHEV sales.watch nowAside from sales, Stellantis has been using PHEVs as a way to offset its production of gas-guzzling trucks and SUVs to attempt to meet federal fuel economy standards and avoid penalties. The goal has become less urgent as the Trump administration eliminates or weakens aspects of those rules. Chrysler first introduced its PHEV minivan in 2016. Jeep debuted the Wrangler PHEV, which it called a \"4xe,\" in 2020, followed by a Grand Cherokee version in 2021.PHEVs feature traditional internal combustion engines, but also have an all-electric range when charged like an EV. They have largely been viewed as a transitional technology from traditional vehicles to EVs; however, they are quite costly because of their two different propulsion systems. The cancellation also comes amid a recall of the Jeep SUVs due to fire risk — the latest in a string of issues for the vehicles. The company is also reevaluating its product portfolio as part of its U.S. turnaround strategy.A 2022 Jeep Grand Cherokee.JeepThe company said the recall, which included a stop-sale of the vehicles, \"is in no way related\" to the cancellation of the vehicles. Jeep CEO Bob Broderdorf late last month told CNBC the brand was evaluating its electrification strategy since the end of up to $7,500 in federal incentives for EVs and PHEVs in September.He said Jeep still had vehicles on the ground that it would continue to sell, but \"all of us are waiting to see what the demand is, how it's going to continue to shake out, and what becomes steady state for 4xe and [battery] EVs in general.\"A Jeep spokeswoman said the brand will continue to offer all-electric SUVs such as the Wagoneer S and Recon, which was officially revealed late last year.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Stellantis scraps Jeep, Chrysler plug-in hybrid vehicles amid EV slowdown, recall",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108134399-1745269689624-NYIAS_DeVries_04162025-199.jpg?v=1745270312&w=1920&h=1080"
      ],
      "datePublished": "2026-01-09T18:24:27.000Z",
      "dateModified": "2026-01-09T18:24:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Gen Z just isn’t seen as ‘work-ready’ – here’s why a million young brits are unemployed",
    "url": "https://www.cnbc.com/2026/01/10/gen-z-isnt-work-ready-million-young-brits-out-of-work.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108249816-1767872619862-gettyimages-2247083886-2024-08-25-hiraman-tinyempiresingleports-277.jpeg?v=1767972739&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-10T07:35:40.000Z",
    "description": "Nearly a million young British people, between the ages of 16 and 24, were not in education, employment or training at the end of 2025, per the U.K. O",
    "body": "Nearly a million young British people, between the ages of 16 and 24, were not in education, employment or training at the end of 2025, per the U.K. Office for National Statistics.Hiraman | E+ | Getty ImagesYoung people are struggling to score their first jobs, and it might be because they're just not ready to enter the workforce, after missing out on critical social development during the Covid-19 pandemic. Joblessness in Generation Z is on the rise as nearly one million young British people, between the ages of 16 and 24, were NEETs (not in education, employment, or training), between July and September 2025, according to the U.K. Office for National Statistics. Identified as a crisis, the government launched an independent review into NEETs in December, led by former Labour Health Secretary Alan Milburn. Worryingly, the ONS report found that almost 600,000 of those young people who were unemployed were also not actively looking for a job. Young people are facing several challenges in the job market, from artificial intelligence eliminating entry-level positions to increased competition for jobs. More than 1.2 million applications were submitted for just 17,000 graduate roles in the U.K. last year, per The U.K.'s Institute for Student Employers. Meanwhile, the number of job openings have decreased nearly 10% on the year to 729,000 in the September to November period from a year ago, the ONS found. There were 2.5 unemployed people per vacancy between August and October, up from 1.8 the previous year. It's not just the economic climate, with employers and experts saying that Gen Z are not adequately prepared to join the workforce. Milburn told The Times in a recent interview that employers find that young people \"aren't work ready\" when they enter full-time jobs after school. \"Young people don't necessarily have work experience, and what they have learnt at school isn't necessarily pertinent for the world of work.\" Generation Lockdown U.K.-based charity Shaw Trust helps people find employment and is working to end the NEETs crisis. Chief Impact Officer Julie Leonard broke down how virtual learning and being at home during the 2020 lockdown created a socialization gap in Gen Z, particularly between the ages of 20 and 24, in an interview with CNBC Make It. \"You've got a lot of young people who missed out on years of in person, education, work experience, work readiness, soft skills, and who now find themselves adults and in a very difficult job market, and also in a recruitment landscape that has completely changed over the years,\" Leonard said. Soft skills like learning to lead a team, collaboration, following instructions are \"so core to being work-ready,\" and Gen Z \"missed out.\"Many young people weren't forced to get out of their comfort zone at home, which includes talking to strangers, showing up on time for school or work, she added. MP Milburn explained that young people can't be blamed for not being ready to work and said opportunities for young people are in \"sharp decline.\" \"There's been a longstanding decline in 16 and 17-year-olds getting Saturday jobs,\" Milburn said, in comments reported by The Times. \"Previous generations, including mine, were all brought up where most of us had that type of job or had a paper round or whatever. That not only provided youngsters with the opportunity to earn but it also allowed teenagers to learn about what it meant to be in a workplace.Leonard says these part time jobs such as babysitting, gardening, or being on the paper route were \"critical\" to getting young people familiar with the discipline of work. \"We've lost that kind of stepping stone approach that is so critical,\" she said. In fact, employers at Big Four firms like KPMG and PWC have identified that their youngest recruits are lacking essential work etiquette skills like communication and collaboration. PWC started offering resilience training to toughen up its new graduate recruits in 2025 and pinned the lack of \"human-skills\" on the pandemic. In 2023, KPMG started offering soft skill sessions for young recruits including on teamwork and how to give presentations. Ask for jobs in-person Leonard recommends going back to old-school tactics to secure jobs, rather than sitting behind a screen and sending off an endless number of CVs that will eventually be rejected by AI.Indeed, now that job hunting has become primarily digital, many young people are sending off CVs written by AI. \"It's become so depersonalized, and they send off the email, they often get no response whatsoever, which is extremely demotivating,\" Leonard said. Walk into your local shop and ask for a job, advises Julie Leonard, chief impact officer at Shaw Trust. Timnewman | E+ | Getty Images\"Actually, what you do is you make a CV, you go down the high street, you have somebody walk with you and give you that resilience and that confidence to go and say 'I would like a job,'\" she advised saying that this is an exercize Shaw Trust advisors often carry out with young people. The kind of shop where this tactic might be most successful includes local mom-and-pop busineses, bars, cafes, or other small and medium enterprizes. \"You go in there with your CV, you have a conversation with a manager, you start to open doors. That's the type of work that we do. It's the hand holding, the resilience, the confidence building to step out. It's not sitting behind a laptop and just sending CVs,\" Leonard added. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Gen Z just isn’t seen as ‘work-ready’ – here’s why a million young brits are unemployed",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108249816-1767872619862-gettyimages-2247083886-2024-08-25-hiraman-tinyempiresingleports-277.jpeg?v=1767972739&w=1920&h=1080"
      ],
      "datePublished": "2026-01-10T07:35:40.000Z",
      "dateModified": "2026-01-10T07:35:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jim Cramer says don’t trade Apple and Nvidia as money rotates into overlooked stocks ahead of earnings season",
    "url": "https://www.cnbc.com/2026/01/09/jim-cramer-own-apple-and-nvidia-as-broad-rally-expands-before-earnings.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108208974-1759860674930-dsc_6122.jpg?v=1759867950&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-10T00:02:33.000Z",
    "description": "watch nowCNBC's Jim Cramer said Friday that investors shouldn't read too much into uneventful unemployment data, arguing that a lack of surprises on t",
    "body": "watch nowCNBC's Jim Cramer said Friday that investors shouldn't read too much into uneventful unemployment data, arguing that a lack of surprises on the labor front is actually giving the market room to reveal the real story: a broad-based rally spreading well beyond last year's winners.\"When you get an employment report that's basically uneventful, it allows you to focus on what's really happening in the market,\" Cramer said. In his view, money is rotating aggressively into overlooked corners of the market, with data storage stocks among the biggest beneficiaries. Companies tied to that theme have delivered what he called breathtaking rallies, even as some of the market's former leaders struggle to gain traction.That includes Apple and Nvidia, two stocks that have failed to lift despite strong underlying businesses. Cramer rejected the idea that the trade is over for either name. Instead, he said both companies are still humming along, but have become sources of funds as investors sell winners to buy newer opportunities. Looking ahead, Cramer said next week will be packed with catalysts, starting with the JPMorgan Healthcare Conference, where he plans to interview a dozen pharmaceutical executives. Historically, the event has been a hotbed for dealmaking, and Cramer said investors should expect a wave of merger-and-acquisition headlines.On the economic front, Tuesday's December consumer price index will matter far more than the latest labor data. Cramer said strong signs from forwarding holiday spending suggest inflation may remain sticky, setting up tension between a president eager to contain prices and consumers who have borne the brunt of inflation.Earnings season also kicks off Tuesday with JPMorgan Chase. Cramer said he expects an excellent quarter but warned that CEO Jamie Dimon is known for emphasizing risks on conference calls — a tone that has knocked the stock down before. His strategy: wait for any cautious commentary, then buy on weakness.Later in the week, Cramer expects strong results from Delta Air Lines, and sees banks as the early stars of earnings season. He highlighted Citigroup as a potential standout, while reaffirming confidence in Wells Fargo, Bank of America, Goldman Sachs and Morgan Stanley.Cramer also said BlackRock could post strong numbers, though expectations may already be high. On the tech side, he's watching Taiwan Semiconductor Manufacturing Company, whose report could finally shake sellers out of Nvidia. In the meantime, he said money continues to flow into storage and equipment plays like Western Digital, SanDisk, Micron, Seagate and Applied Materials.Cramer also flagged transport stocks, saying a solid report from J.B. Hunt would reinforce his bullish stance on FedEx. By Friday, with PNC rounding out bank earnings, Cramer said investors should have a clearer sense of the tone for the rest of the season.watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jim Cramer says don’t trade Apple and Nvidia as money rotates into overlooked stocks ahead of earnings season",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108208974-1759860674930-dsc_6122.jpg?v=1759867950&w=1920&h=1080"
      ],
      "datePublished": "2026-01-10T00:02:33.000Z",
      "dateModified": "2026-01-10T00:02:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump suggests U.S. military will hit cartels on ‘land’ in Mexico",
    "url": "https://www.cnbc.com/2026/01/09/trump-us-military-cartels-mexico-land.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108242946-1765982390672-gettyimages-2251753640-AFP_88F79T3.jpeg?v=1767982776&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-09T23:38:03.000Z",
    "description": "(COMBO) This combination of pictures created on December 17, 2025, shows Mexico's President Claudia Sheinbaum speaking during her daily press conferen",
    "body": "(COMBO) This combination of pictures created on December 17, 2025, shows Mexico's President Claudia Sheinbaum speaking during her daily press conference at Palacio Nacional in Mexico City on November 28, 2025, and US President Donald Trump looking on during a Mexican Border Defense Medal presentation in the Oval Office of the White House in Washington, DC, on December 15, 2025.Andrew Caballero-Reynolds, Yuri Cortez | Afp | Getty ImagesPresident Donald Trump suggested in a new interview that the U.S. military could launch land strikes on drug cartels in Mexico.\"We've knocked out 97% of the drugs coming in by water. And we are going to start now hitting land, with regard to the cartels,\" Trump told Fox News host Sean Hannity in an interview aired Thursday night.\"The cartels are running Mexico, it's very sad to watch and see what's happened to that country,\" Trump said.Trump's comment comes less than a week after U.S. forces struck Venezuela and captured its authoritarian leader, Nicolás Maduro, and his wife, Cilia Flores. The Venezuelan government has said more than 100 people were killed in the military operation, which came after a monthslong pressure campaign against Maduro.The Trump administration has carried out 35 known strikes on alleged drug boats in the Caribbean, killing 115 individuals, according to The New York Times.A White House spokeswoman, when asked by CNBC about Trump's comment on Fox News, said, in an email, \"The administration is reasserting and enforcing the Monroe Doctrine to restore American preeminence in the Western Hemisphere, control migration, and stop drug trafficking.\"\"The President has many options at his disposal to continue to protect our homeland from illicit narcotics that kill tens of thousands of Americans every year,\"  the spokeswoman, Anna Kelly, said.Trump previously floated the idea of executing attacks on Mexico.\"Would I launch strikes in Mexico to stop drugs? OK with me, whatever we have to do to stop drugs,\" Trump told reporters in the Oval Office in November when asked if he would consider military action across the southern border.Mexican President Claudia Sheinbaum pushed back on Trump after that, saying there would be no U.S. military action in Mexico without her permission. This week, Sheinbaum condemned the U.S. capture of Maduro and reaffirmed her country's sovereignty.\"It is necessary to reaffirm that in Mexico the people rule, and that we are a free and sovereign country— cooperation, yes; subordination and intervention, no,\" Sheinbaum said, according to Reuters.Sheinbaum addressed Trump's latest remarks at a press conference on Friday, saying she would \"deepen coordination\" with the U.S.\" and that she asked her Secretary of Foreign Affairs Juan Ramón de la Fuente to meet with the U.S. Department of State if necessary.\"We are going to strengthen communication,\" Sheinbaum said, according to a translated version of her remarks provided by the Ministry of Foreign Affairs.\"Two or three days ago, Secretary [Marco] Rubio himself spoke about the good coordination on security matters that exists with Mexico... we will further strengthen the relationship and the exchange of information,\" Sheinbaum said.Read more CNBC politics coverageNew cellphone video of Minneapolis ICE shooting incident revealedIran's leader accuses protesters of acting for TrumpTrump suggests U.S. military will hit cartels on 'land' in MexicoPortland: Border Patrol agent shoots 2 after ICE killing in MinneapolisTrump 'instructing' his 'Representatives' to buy $200B in mortgage bondsEpstein files: Reps ask judge to appoint special master for document releaseThe Trump administration over the past week has also threatened military action in Cuba, Colombia, and Greenland, prompting backlash even from within the ranks of congressional Republicans.On Thursday, the Senate passed the first phase of a measure to block Trump from further military action in Venezuela.Five Senate Republicans voted in favor of the measure, known as a War Powers Resolution, indicating it has enough bipartisan support to clear a final vote.One of those Republicans, Sen. Susan Collins of Maine, said that she supported Trump's removal of Maduro. But she also said that further action would require congressional approval.\"When the president raises the issue, as he has with not only Venezuela, but Greenland, of military force being used, then it does implicate the War Powers Act and Congress's constitutional role,\" Collins said.Correction: Cilia Flores is Nicolás Maduro's wife. An earlier version misspelled her name.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump suggests U.S. military will hit cartels on ‘land’ in Mexico",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108242946-1765982390672-gettyimages-2251753640-AFP_88F79T3.jpeg?v=1767982776&w=1920&h=1080"
      ],
      "datePublished": "2026-01-09T23:38:03.000Z",
      "dateModified": "2026-01-09T23:38:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "AI memory is sold out, causing an unprecedented surge in prices",
    "url": "https://www.cnbc.com/2026/01/10/micron-ai-memory-shortage-hbm-nvidia-samsung.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108183409-1754634274002-gettyimages-885294104-spk_00007_01015.jpeg?v=1762812885&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-10T12:00:01.000Z",
    "description": "Eugene Mymrin | Moment | Getty ImagesAll computing devices require a part called memory, or RAM, for short-term data storage, but this year, there won",
    "body": "Eugene Mymrin | Moment | Getty ImagesAll computing devices require a part called memory, or RAM, for short-term data storage, but this year, there won't be enough of these essential components to meet worldwide demand.That's because companies like Nvidia, Advanced Micro Devices and Google need so much RAM for their artificial intelligence chips, and those companies are the first ones in line for the components. Three primary memory vendors — Micron, SK Hynix and Samsung Electronics — make up nearly the entire RAM market, and their businesses are benefitting from the surge in demand. \"We have seen a very sharp, significant surge in demand for memory, and it has far outpaced our ability to supply that memory and, in our estimation, the supply capability of the whole memory industry,\" Micron business chief Sumit Sadana told CNBC this week at the CES trade show in Las Vegas. Micron's stock is up 247% over the past year year, and the company reported that net income nearly tripled in the most recent quarter. Samsung this week said that it expects its December quarter operating profit to nearly triple as well. Meanwhile, SK Hynix is considering a U.S. listing as its stock price in South Korea surges, and in October, the company said it had secured demand for its entire 2026 RAM production capacity. Now, prices for memory are rising. TrendForce, a Taipei-based researcher that closely covers the memory market, this week said it expects average DRAM memory prices to rise between 50% and 55% this quarter versus the fourth quarter of 2025. TrendForce analyst Tom Hsu told CNBC that type of increase for memory prices was \"unprecedented.\" Three-to-one basisChipmakers like Nvidia surround the part of the chip that does the computation — the graphics processing unit, or GPU — with several blocks of a fast, specialized component called high-bandwidth memory, or HBM, Sadana said. HBM is often visible when chipmakers hold up their new chips. Micron supplies memory to both Nvidia and AMD, the two leading GPU makers. Nvidia's Rubin GPU, which recently entered production, comes with up to 288 gigabytes of next-generation HBM4 memory per chip. HBM is installed in eight visible blocks above and below the processor, and that GPU will be sold as part of single server rack called NVL72, which fittingly combines 72 of those GPUs into a single system. By comparison, smartphones typically come with 8 or 12GB of lower-powered DDR memory.Nvidia founder and CEO Jensen Huang introduces the Rubin GPU and the Vera CPU as he speaks during Nvidia Live at CES 2026 ahead of the annual Consumer Electronics Show in Las Vegas, Nevada, on Jan. 5, 2026. Patrick T. Fallon | AFP | Getty ImagesBut the HBM memory that AI chips need is much more demanding than the RAM used for consumers' laptops and smartphones. HBM is designed for high-bandwidth specifications required by AI chips, and it's produced in a complicated process where Micron stacks 12 to 16 layers of memory on a single chip, turning it into a \"cube.\"When Micron makes one bit of HBM memory, it has to forgo making three bits of more conventional memory for other devices.\"As we increase HBM supply, it leaves less memory left over for the non-HBM portion of the market, because of this three-to-one basis,\" Sadana said. Hsu, the TrendForce analyst, said that memory makers are favoring server and HBM applications over other clients because there's higher potential for growth in demand in that business and cloud service providers are less price-sensitive. In December, Micron said it would discontinue a part of its business that aimed to provide memory for consumer PC builders so the company could save supply for AI chips and servers. Some inside the tech industry are marveling at how much and how quickly the price of RAM for consumers has increased. Dean Beeler, co-founder and tech chief at Juice Labs, said that a few months ago, he loaded up his computer with 256GB of RAM, the maximum amount that current consumer motherboards support. That cost him about $300 at the time. \"Who knew that would end up being ~$3,000 of RAM just a few months later,\" he posted on Facebook on Monday.watch now'Memory wall'AI researchers started to see memory as a bottleneck just before OpenAI's ChatGPT hit the market in late 2022, said Majestic Labs co-founder Sha Rabii, an entrepreneur who previously worked on silicon at Google and Meta.Prior AI systems were designed for models like convolutional neural networks, which require less memory than large language models, or LLMs, that are popular today, Rabii said.  While AI chips themselves have been getting much faster, memory has not, he said, which leads to powerful GPUs waiting around to get the data needed to run LLMs. \"Your performance is limited by the amount of memory and the speed of the memory that you have, and if you keep adding more GPUs, it's not a win,\" Rabii said. The AI industry refers to this as the \"memory wall.\" Erik Isakson | Digitalvision | Getty Images\"The processor spends more time just twiddling its thumbs, waiting for data,\" Micron's Sadana said.More and faster memory means that AI systems can run bigger models, serve more customers simultaneously and add \"context windows\" that allow chatbots and other LLMs to remember previous conversations with users, which adds a touch of personalization to the experience. Majestic Labs is designing an AI system for inference with 128 terabytes of memory, or about 100 times more memory than some current AI systems, Rabii said, adding that the company plans to eschew HBM memory for lower-cost options. Rabii said the additional RAM and architecture support in the design will enable its computers to support significantly more users at the same time than other AI servers while using less power.Sold out for 2026 Wall Street has been asking companies in the consumer electronics business, like Apple and Dell Technologies, how they will handle the memory shortage and if they might be forced to raise prices or cut margins. These days, memory accounts for about 20% of the hardware costs of a laptop, Hsu said. That's up from between 10% and 18% in the first half of 2025. In October, Apple finance chief Kevan Parekh told analysts that his company was seeing a \"slight tailwind\" on memory prices but he downplayed it as \"nothing really to note there.\"But in November, Dell said it expected its cost basis for all of its products to go up as a result of the memory shortage. COO Jefferey Clarke told analysts that Dell planned to change its mix of configurations to minimize the price impacts, but he said the shortage will likely affect retail prices for devices. \"I don't see how this will not make its way into the customer base,\" Clarke said. \"We'll do everything we can to mitigate that.\"Even Nvidia, which has emerged as the biggest customer in the HBM market, is facing questions about its ravenous memory needs — in particular, about its consumer products.At a press conference Tuesday at CES, Nvidia CEO Jensen Huang was asked if he was concerned that the company's gaming customers might be resentful of AI technology because of rising game console and graphics cards prices that are being driven by the memory shortage. Huang said Nvidia is a very large customer of memory and has long relationships with the companies in the space but that, ultimately, there would need to be more memory factories because the needs of AI are so high.\"Because our demand is so high, every factory, every HBM supplier, is gearing up, and they're all doing great,\" Huang said. At most, Micron can only meet two-thirds of the medium-term memory requirements for some customers, Sadana said. But the company is currently building two big factories called fabs in Boise, Idaho, that will start producing memory in 2027 and 2028, he said. Micron is also going to break ground on a fab in the town of Clay, New York, that he said is expect to come online in 2030.But for now, \"we're sold out for 2026,\" Sadana said. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "AI memory is sold out, causing an unprecedented surge in prices",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108183409-1754634274002-gettyimages-885294104-spk_00007_01015.jpeg?v=1762812885&w=1920&h=1080"
      ],
      "datePublished": "2026-01-10T12:00:01.000Z",
      "dateModified": "2026-01-10T12:00:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Iran's leader accuses protesters of acting for Trump",
    "url": "https://www.cnbc.com/2026/01/09/iran-protests-supreme-leader-khamenei-trump-oil.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108250396-1767958955599-gettyimages-2254759159-AA_09012026_2594881.jpeg?v=1767959045&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-09T18:43:52.000Z",
    "description": "Iranians gather while blocking a street during a protest in Kermanshah, Iran on January 8, 2026. Kamran | Afp | Getty ImagesIran's supreme leader on F",
    "body": "Iranians gather while blocking a street during a protest in Kermanshah, Iran on January 8, 2026. Kamran | Afp | Getty ImagesIran's supreme leader on Friday lashed out at anti-government protesters, saying they were \"vandals\" acting on behalf of U.S. President Donald Trump by destroying public properties.In a broadcast on national television, reported by Reuters, Ali Khamenei warned Tehran would not tolerate \"mercenaries for foreigners.\"\"The Islamic Republic came to power through the blood of hundreds of thousands of honorable people. It will not back down in the face of vandals,\" Khamenei said.  His comments came as the country of 92 million found itself largely cut off from the world on Friday, with authorities seeking to quell the sprawling protests by blacking out the internet.The demonstrations, which began in Tehran's bazaar on Dec. 28, have been fueled by growing frustrations over a long-running economic crisis, particularly the government's handling of a sharp fall in the nation's currency and soaring prices.The scale of the unrest makes it one of the most widespread demonstrations in recent years, according to Human Rights Activists News Agency, with dozens reported killed and nearly 2,300 arrested or detained. HRANA, a U.S.-registered nonprofit, relies on an activist network inside Iran for its reporting. Iranian leader Ali Khamenei comments on the recent protests against economic conditions on Iranian State Television in the capital Tehran on January 9, 2026.Anadolu | Anadolu | Getty ImagesThe protests have also revived concerns about possible American intervention. Trump said last week that if Iran \"violently kills peaceful protesters,\" then the U.S. will \"come to their rescue.\"\"We are locked and loaded and ready to go,\" Trump wrote in a post on Truth Social on Jan 2.Iran's supreme leader adviser Ali Larijani reportedly responded at the time by saying that U.S. interference in Iran's protests was equivalent to chaos across the entire region.Iran, which is a member of OPEC, is a major player in the global oil market.Oil prices were last seen trading higher as energy market participants continued to monitor concerns over the disruption in Iran. International benchmark Brent crude futures with March expiry traded up 0.9% at $62.52 a barrel on Friday, while U.S. West Texas Intermediate futures with February expiry stood at $58.29, up 0.9% for the session.— CNBC's April Roach and Anniek Bao contributed to this report.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Iran's leader accuses protesters of acting for Trump",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108250396-1767958955599-gettyimages-2254759159-AA_09012026_2594881.jpeg?v=1767959045&w=1920&h=1080"
      ],
      "datePublished": "2026-01-09T18:43:52.000Z",
      "dateModified": "2026-01-09T18:43:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump says oil companies will spend $100 billion in Venezuela with U.S. protection",
    "url": "https://www.cnbc.com/2026/01/09/trump-venezuela-oil-executives-white-house-meeting.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108250752-1767990044483-gettyimages-2254845759-AFP_92962B4.jpeg?v=1767990084&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-09T23:19:02.000Z",
    "description": "watch nowPresident Donald Trump met Friday afternoon with more than a dozen oil companies at the White House to discuss plans for investment in Venezu",
    "body": "watch nowPresident Donald Trump met Friday afternoon with more than a dozen oil companies at the White House to discuss plans for investment in Venezuela, less than a week after the U.S. ousted President Nicolás Maduro.Exxon CEO Darren Woods, ConocoPhillips CEO Ryan Lance and Chevron Vice Chairman Mark Nelson attended. Executives from Halliburton, Valero and Marathon were also present among others. Trump said oil companies will spend at least $100 billion to rebuild Venezuela's energy sector. The U.S. will provide security and protection so \"they get their money back and make a very nice return,\" he said. The U.S. will decide which oil companies enter Venezuela, the president said. The White House will \"cut a deal with the companies\" Friday or shortly thereafter, he said.   \"One of the things the United States gets out of this will be even lower energy prices,\" Trump said.The White House called the meeting, an industry source told CNBC. It was not scheduled at the request of the oil companies, the source said.Venezuela has the largest proven crude oil reserves in the world at 303 billion barrels or about 17% of the global total, according to the U.S. Energy Information Administration. But its oil sector is in dire disrepair. Production has declined from a peak of about 3.5 million barrels per day in the 1990s to only around 800,000 bpd today, according to data from energy consulting firm Kpler. Rystad Energy estimates it will cost more than $180 billion through 2040 for Venezuelan production to reach 3 million bpd. Working with ChevronThe Trump administration has provided few details on how it will encourage oil companies to make large investments in a country with history of nationalizing industry assets. Chevron is the only U.S. oil company currently operating in Venezuela through a joint venture with state oil company Petróleos de Venezuela, or PDVSA. Energy Secretary Chris Wright told CNBC Wednesday that the U.S. is working closely with Chevron.\"Chevron is on the ground, so we're getting daily updates,\" Wright told CNBC. \"They're actually working [under] this regime. So with them, how can we provide incremental tweaks or changes to allow their model to grow even more,\" the energy secretary said.  Venezuelan production could grow by several hundred thousand barrels per day in the short to medium term with small capital deployments, Wright said. Exxon, Conoco doubtsBut Exxon and Conoco will need reassurances to return to Venezuela, Wright said. The companies exited the country after former President Hugo Chavez seized their assets in 2007. They have billions of dollars in outstanding claims against the government they won in arbitration cases.\"We've had our assets seized there twice, and so you can imagine, to re-enter a third time would require some pretty significant changes from what we've historically seen,\" Exxon's Woods said. Wright said the debts Venezuela owes Exxon and Conoco need to be repaid at some point but are not an immediate priority for the Trump administration. The White House is focused on stabilizing Venezuela's economy through oil sales, the energy secretary said. \"We're trying to engineer a transition of Venezuela to a place that Americans want to do business in, want to invest new capital in, want to grow new partnerships with,\"  Wright said.But it is unclear whether the White House can convince companies like Exxon and Conoco to return to Venezuela without a dramatic change in government in Caracas.\"The big oil companies who move slowly, who have corporate boards, are not interested,\" Treasury Secretary Scott Bessent said Thursday at the Economic Club of Minnesota. \"I can tell you that the independent oil companies and individuals, wildcatters — our phones are ringing off the hook,\" Bessent said. \"They want to get to Venezuela yesterday.\" Leveraging oil salesThe U.S. has taken control of Venezuela's oil exports to pressure the government in Caracas, Wright said. Venezuela will ship tens of millions of barrels to the U.S., which the Trump administration will then sell, holding the proceeds in U.S.-controlled accounts, the energy secretary said. \"We need to have that leverage and that control of those oil sales to drive the changes that simply must happen in Venezuela,\" Wright said. The energy secretary said the U.S. is not stealing Venezuela's oil. The proceeds from the sales will be used to benefit the nation of 30 million, he said. Trump said Wednesday that the revenue from the oil will be used to purchase U.S.-made products.\"I have just been informed that Venezuela is going to be purchasing ONLY American Made Products, with the money they receive from our new Oil Deal,\" the president wrote on social media Wednesday. Purchases will include agricultural products, medicine, medical devices and equipment to modernize Venezuela's energy sector.\"In other words, Venezuela is committing to doing business with the United States of America as their principal partner,\" Trump said.  ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump says oil companies will spend $100 billion in Venezuela with U.S. protection",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108250752-1767990044483-gettyimages-2254845759-AFP_92962B4.jpeg?v=1767990084&w=1920&h=1080"
      ],
      "datePublished": "2026-01-09T23:19:02.000Z",
      "dateModified": "2026-01-09T23:19:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Supreme Court holds off on Trump tariff ruling for now — what's at stake for economy",
    "url": "https://www.cnbc.com/2026/01/08/the-supreme-court-may-rule-friday-on-trumps-tariffs-heres-whats-at-stake-for-the-economy.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108183055-1754578612434-gettyimages-2228192226-AFP_68ZA2RX.jpeg?v=1757365607&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-09T16:59:14.000Z",
    "description": "A cargo ship sits in New York Harbor on Nov. 19, 2025 in New York City. Spencer Plat | Getty ImagesThe Supreme Court did not rule Friday on the legali",
    "body": "A cargo ship sits in New York Harbor on Nov. 19, 2025 in New York City. Spencer Plat | Getty ImagesThe Supreme Court did not rule Friday on the legality of broad tariffs imposed by President Donald Trump, leaving markets still awaiting a decision poised to have far-reaching impacts on trade policy and the U.S. fiscal situation.There had been speculation that the tariff ruling would be issued on Friday, but the Supreme Court released just one opinion for the day, and it was unrelated to tariffs.It is unclear when the tariff ruling will be released. The court will release its next rulings Wednesday.When it does come, the decision will address two issues: whether the administration can use provisions under the International Emergency Economic Powers Act to levy the tariffs, and if it isn't proper, if the U.S. will have to reimburse those importers who already have paid the duties.However, the final decision could also fall somewhere in between.The court has the option to grant limited powers under the IEEPA and require only limited repayment, along with multiple other options for how it handles a touchy matter that is being closely watched on Wall Street.Moreover, even should the White House lose the case, it has other tools in its chest to implement tariffs that don't require the emergency powers cited under the act.Treasury Secretary Scott Bessent himself said Thursday he expects a \"mishmash\" ruling.\"What is not in doubt is our ability to continue collecting tariffs at roughly the same level, in terms of overall revenues,\" Bessent said during an appearance in Minneapolis. \"What is in doubt, and it's a real shame for the American people, was the president loses flexibility to use tariffs both for national security, for negotiating leverage.\"Trump used the IEEPA in part as an emergency measure to stop the inflow of fentanyl to the U.S. The impact of losingLosing the tariffs would have multiple ramifications, said Jose Torres, senior economist at Interactive Brokers.\"If the court blocks the tariffs, the administration is going to find workarounds,\" Torres said. \"President Trump is very ambitious in getting this agenda through despite potential controversies that could surround such a decision.\"\"Blocking tariffs would be bad for onshoring ambitions. It would be bad for fiscal conditions, rates would go higher,\" he added. \"But it would be good for corporate earnings. Input prices would be lower and trade would be smoother.\"Administration officials have cited a number of options to offset the court's decision should it not go their way. Prediction markets site Kalshi is pointing to just a 28% probability that the court will rule in favor of the tariffs as implemented. Torres said his firm's clients have a similar expectation. Bessent has said that the administration has at least three other options through the 1962 Trade Act that will keep most of the tariffs in place. However, he also has worried that reimbursements could place a strain on the administration and its effort to drive down the fiscal deficit. Tariffs brought in some $195 billion in fiscal 2025 and another $62 billion in 2026, according to Treasury data.Ultimately, Morgan Stanley analysts \"see significant room for nuance\" in the Supreme Court decision. The court \"has wide latitude when it comes to issuing decisions, a range of outcomes is possible, like the Court narrowing the scope of existing tariffs but not mandating their full removal or limiting the future application of tariffs,\" Morgan Stanley analysts Ariana Salvatore and Bradley Tian said in a note.\"We do think there's scope for the administration to take a lighter-touch approach to the overall tariff regime given a recent political focus on affordability,\" they added.The tariff impact thus far has defied analyst projections: There's been a limited impact on inflation, while the trade deficit has plunged, countering expectations in some quarters that the tariffs could make the U.S. a pariah on the global trading stage. The trade imbalance for October hit its lowest level since the end of the financial crisis in 2009, at a time when imports had declined sharply due to the massive recession the crisis generated.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Supreme Court holds off on Trump tariff ruling for now — what's at stake for economy",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108183055-1754578612434-gettyimages-2228192226-AFP_68ZA2RX.jpeg?v=1757365607&w=1920&h=1080"
      ],
      "datePublished": "2026-01-09T16:59:14.000Z",
      "dateModified": "2026-01-09T16:59:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump will use other tariff authorities to get to 'same place' if Supreme Court rules against him: Hassett",
    "url": "https://www.cnbc.com/2026/01/09/trump-will-use-other-tariff-authorities-to-get-to-same-place-if-supreme-court-rules-against-him-hassett.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108242430-1765898913436-gettyimages-2252212116-imgl5298_i9u3dgcs.jpeg?v=1767969035&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-09T16:14:42.000Z",
    "description": "watch nowNational Economic Council Director Kevin Hassett said Friday that the White House could deploy alternative measures if the Supreme Court rule",
    "body": "watch nowNational Economic Council Director Kevin Hassett said Friday that the White House could deploy alternative measures if the Supreme Court rules against President Donald Trump's use of emergency powers to impose sweeping levies.\"There was a big call last night with all the principals to talk about if the Supreme Court were to rule against this IEEPA tariff, what would the next step be?\" Hassett said on CNBC's \"Squawk on the Street,\" referring to the administration's use of the International Emergency Economic Powers Act.\"There are a lot of other legal authorities that can reproduce the deals that we've made with other countries, and can do so basically immediately. And so our expectation is that we're going to win, and if we don't win, then we know that we've got other tools that we could use that get us to the same place,\" he said. watch nowHassett said U.S. Trade Representative Jamieson Greer has been closely involved in mapping out contingency plans.The Supreme Court's first decision day of 2026 came and went Friday without a ruling on the legality of Trump's tariffs.Hassett is one of the finalists for the Federal Reserve chair job as Trump moves close to picking a successor to Jerome Powell, whose term as chair is up in May.\"I'm really happy with the job I have here,\" he said. \"We'll see what the president thinks about where I should be.\"Correction: Jamieson Greer is the U.S. trade representative. An earlier version misspelled his name.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump will use other tariff authorities to get to 'same place' if Supreme Court rules against him: Hassett",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108242430-1765898913436-gettyimages-2252212116-imgl5298_i9u3dgcs.jpeg?v=1767969035&w=1920&h=1080"
      ],
      "datePublished": "2026-01-09T16:14:42.000Z",
      "dateModified": "2026-01-09T16:14:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Amazon plans first big-box retail store in Chicago suburb",
    "url": "https://www.cnbc.com/2026/01/09/amazon-plans-first-big-box-retail-store-in-chicago-suburb.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107002169-1642418101106-gettyimages-1362979130-dsc_7351_d28eab40-90f9-49c1-80d0-4517700bedc1.jpeg?v=1767991369&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-09T23:06:18.000Z",
    "description": "An Amazon warehouse in Warrington, England.Nathan Stirk | Getty ImagesAmazon has submitted plans for a large-format store near Chicago that would be l",
    "body": "An Amazon warehouse in Warrington, England.Nathan Stirk | Getty ImagesAmazon has submitted plans for a large-format store near Chicago that would be larger than a Walmart Supercenter, marking the latest experiment with physical retail for the tech company.As part of the plans, Amazon has proposed building a one-story, 229,000-square-foot building in Orland Park, Illinois, that would offer a range of products, such as groceries, household essentials and general merchandise, the city said on Saturday. By comparison, Walmart's U.S. Supercenters typically average 179,000 square feet.The Amazon facility would also include a \"limited warehouse component\" to support on-site operations and space for delivery drivers to pick up orders, according to planning documents.\"We regularly test new experiences designed to make customers' lives better and easier every day, including physical stores,\" an Amazon spokesperson said in a statement. \"The site in question is our planned location for a new concept that we think customers will be excited about.\"The e-commerce company has been determined to have a bigger presence in brick-and-mortar retail after stealing market share from incumbents. Amazon acquired upscale grocer Whole Foods Market for $13.7 billion in 2017, the largest deal in its history.Amazon also launched bookstores, shopping mall kiosks, apparel stores, convenience marts and its own supermarket chain. It's since scrapped many of those concepts or slowed the rollout of new locations. The Orland Park Plan Commission approved Amazon's proposal on Tuesday, and it will now proceed to a vote from the full village board. That meeting is scheduled for Jan. 19. The proposed facility would replace a local restaurant, Petey's II, which closed in January 2024. The site sits at the corner of two major highways running through Orland Park, and would be down the street from a Target, Costco and Trader Joe's, among other major national chains. Some residents have pushed back on Amazon's planned development, expressing concerns over how it could impact traffic in the surrounding area, NBC 5 Chicago reported.WATCH: How AI could upend shoppingwatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Amazon plans first big-box retail store in Chicago suburb",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107002169-1642418101106-gettyimages-1362979130-dsc_7351_d28eab40-90f9-49c1-80d0-4517700bedc1.jpeg?v=1767991369&w=1920&h=1080"
      ],
      "datePublished": "2026-01-09T23:06:18.000Z",
      "dateModified": "2026-01-09T23:06:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Patient advocacy groups urge U.S. court to halt overseas prescription drug operations",
    "url": "https://www.cnbc.com/2026/01/08/patient-advocates-us-court-afp-prescription-operations.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108145259-1747217764033-gettyimages-2163308489-markets460516_ygl9gaze.jpeg?v=1767909220&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-08T22:04:31.000Z",
    "description": "In a photo illustration, prescription drugs are seen next to a pill bottle on July 23, 2024 in New York.Spencer Platt | Getty Images News | Getty Imag",
    "body": "In a photo illustration, prescription drugs are seen next to a pill bottle on July 23, 2024 in New York.Spencer Platt | Getty Images News | Getty ImagesA coalition of patient advocacy groups is urging a federal court to halt the practices of third-party companies that buy drugs from countries outside the FDA-regulated U.S. supply chain, which the groups argue put U.S. patients' health at risk.The court filing comes in the wake of a CNBC investigation that documented how these third-parties — commonly referred to as alternative funding programs, or AFPs — have spread across employer-sponsored health plans nationwide. Under the growing business model, AFPs source high-cost specialty drugs from abroad at lower prices and charge employers a fee or a percentage of the savings. The AFPs then provide the medication to patients at little or no cost. AFPs are especially appealing to small employers like local school districts, county governments and others who pay their staff's health-care costs out of pocket. But there's a trade off: Federal officials at the U.S. Department of Homeland Security and the Food and Drug Administration told CNBC that these medications are illegally imported and put patients' lives at risk. A Homeland Security Investigations official last year told CNBC that criminal investigations into AFPs were ongoing.The filing in a U.S. Court of Appeals in Maryland, dated Dec. 26, was led by the HIV+Hepatitis Policy Institute, a nonprofit that advocates for safe and affordable treatment for people living with HIV and viral hepatitis. \"Forcing a person who has employer-sponsored health insurance to sign up with an unknown third-party vendor to receive their life-saving drug supplied by a foreign country not only is illegal but jeopardizes the health and safety of patients,\" wrote Carl Schmid, executive director of the HIV+Hepatitis Policy Institute, in a press release. \"While federal regulators should be shutting them down, in the meantime, the courts must step in to protect patients.\" watch nowIn the court filing, the patient groups said the arrangements can delay treatment, confuse patients and expose them to drugs that differ from those distributed through the tightly regulated U.S. system. They warned that patients with chronic and life-threatening illnesses should not be forced to trade the safety and certainty of approved U.S. supply chains for lower costs to employers.The amicus brief filing was submitted in a case brought by Gilead Sciences after the company learned that an HIV patient received Gilead medication with labeling written in Turkish. Gilead alleges the drug traveled through an unsecured supply chain that does not comply with U.S. law. Turkey is a known hotbed for counterfeit drugs, according to U.S. officials.Gilead sued several companies involved in administering employer health plans, including the alternative funding program Rx Valet.Greg Santulli, the CEO of the Georgia-based AFP, told CNBC last year that he's confident in the safety of the medications his company sources, adding that Turkey is a \"modern, sophisticated country\" capable of tracking medications through its supply chain.The lawsuit also named Meritain Health, which managed the patient's employee health plan and is owned by CVS Health.A spokesperson for CVS Health told CNBC last year that it \"has long maintained a policy that it does not support programs for non-FDA-approved medications sourced from outside the United States and does not contract with companies to facilitate the importation of non-FDA-approved medications\" from overseas.A federal judge issued a preliminary injunction blocking all parties in the case from importing Gilead medications from overseas. The defendants are appealing the ruling, with Meritain arguing the injunction is not necessary and would adversely affect its business. Rx Valet in a court filing said the injunction undermines access to safe medications, adding that Gilead's HIV drug shipped from Turkey was the same as what is sold in the U.S. at a much higher cost.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Patient advocacy groups urge U.S. court to halt overseas prescription drug operations",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108145259-1747217764033-gettyimages-2163308489-markets460516_ygl9gaze.jpeg?v=1767909220&w=1920&h=1080"
      ],
      "datePublished": "2026-01-08T22:04:31.000Z",
      "dateModified": "2026-01-08T22:04:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]