[
  {
    "title": "Gold, silver prices fall after CME raises precious metals margins — again",
    "url": "https://www.cnbc.com/2025/12/31/gold-and-silver-prices-fall-after-cme-raises-precious-metals-margins.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108235976-1764776147223-gettyimages-2212118870-SPAIN_GOLD.jpeg?v=1767184941&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-31T13:53:09.000Z",
    "description": "One kilogram and a five hundred gram gold bars next to one kilogram silver bars at The Vaults Group gold dealers arranged in Barcelona, Spain, on Mond",
    "body": "One kilogram and a five hundred gram gold bars next to one kilogram silver bars at The Vaults Group gold dealers arranged in Barcelona, Spain, on Monday, April 28, 2025. Bloomberg | Bloomberg | Getty ImagesGold and silver prices lost ground on Wednesday as investors booked profits after a historic annual rally and exchange operator CME Group hiked the margins on precious metal futures for the second time in the space of a week.Spot gold prices dipped 0.1% to $4,339.89 per ounce at 8:50 a.m. ET, extending losses in the run-up to the new year. The yellow metal notched a one-week low in the previous session.Spot silver prices, meanwhile, tumbled 5.6% to $72.15 per ounce, paring gains after climbing above $80 for the first time at the start of the week.The moves come at the end of a blockbuster year for the precious metals.Gold is up more than 64% year-to-date, on track for its best annual performance since 1979 and third straight positive year. The rally has been supported by a multitude of factors, including the impact of U.S. interest rate cuts, tariff tensions, and robust demand from exchange traded funds (ETFs) and central banks.  Silver has far outpaced gold in 2025. The metal, which has endured wild price swings in recent days, is on course for annual gains of nearly 150%. Like gold, this would be silver's best yearly performance since 1979. Silver's price boom has stemmed from a mix of low supply and high demand from India, as well as industrial needs and tariffs.watch nowCME Group, one of the world's largest trading floors for commodities, said on Tuesday that margins for gold, silver, platinum, and palladium would increase again after the close of business on Wednesday. It said in a statement that the decision was made \"as per the normal review of market volatility to ensure adequate collateral coverage.\"  The notice means traders will need to put up more cash on their bets to insure against the prospect of a default when they take delivery of the contract.CME Group raised margin requirements for precious metals earlier in the week, prompting gold and silver futures to fall sharply on Monday.— CNBC's Gaelle Legrand contributed to this report.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Gold, silver prices fall after CME raises precious metals margins — again",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108235976-1764776147223-gettyimages-2212118870-SPAIN_GOLD.jpeg?v=1767184941&w=1920&h=1080"
      ],
      "datePublished": "2025-12-31T13:53:09.000Z",
      "dateModified": "2025-12-31T13:53:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "China manufacturing activity expands for the first time since March, beating expectations",
    "url": "https://www.cnbc.com/2025/12/31/china-manufacturing-activity-pmi-december-expands-for-the-first-time-since-march.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108173496-1752773807903-gettyimages-2224732518-vcg111579011710.jpeg?v=1752773940&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-31T03:50:22.000Z",
    "description": "An employee works on the production line of power batteries and box chassis for new energy vehicles at a workshop on July 11, 2025 in Huaibei, Anhui P",
    "body": "An employee works on the production line of power batteries and box chassis for new energy vehicles at a workshop on July 11, 2025 in Huaibei, Anhui Province of China.Li Xin | Visual China Group | Getty ImagesChina's economy ended the year on a slightly less gloomy note, as factory activity expanded in December for the first time since March, beating expectations, according to official data released Wednesday.The official manufacturing purchasing managers index rose to 50.1 in December, above the 49.2 forecast by economists polled by Reuters, and higher than 49.2 in November. A reading above 50 indicates expansion.The composite PMI, a broader measure that tracks activity across manufacturing and services, climbed to 50.7 from 49.7 in November, pointing to broader improvement across the economy.China's non-manufacturing PMI, which covers services and construction, increased to 50.2 from 49.5 in November.Huo Lihui, chief statistician from China's National Bureau of Statistics, said that new orders rose in December, signaling a \"significant expansion\" in both production and demand in manufacturing.Private-sector data showed a similar trend. A separate PMI from independent research firm RatingDog showed manufacturing activity rising to 50.1 from 49.9, beating expectations of 49.8. Yao Yu, founder at RatingDog, said the reading indicated the manufacturing sector had returned to expansion. He noted that total new orders grew for a seventh consecutive month, supported by domestic new product launches and business development, leading to growth in production.However, Yao said that while firms remain confident for 2026, optimism has eased and remained below the historical average.Large enterprises drove the improvement, with their PMI rising to 50.8, up 1.5 percentage points from the previous month, data from China's National Bureau of Statistics showed.Activity among smaller firms remained weaker. The PMI for medium-sized enterprises rose to 49.8, while the index for small enterprises fell to 48.6, down 0.5 percentage points from November.Markets were mixed after the release. Hong Kong's Hang Seng index fell 0.83%, while the mainland's CSI 300 rose 0.33%. The data followed a decision by China's central bank earlier this week to keep loan prime rates unchanged, despite weak economic data and an extended slump in the property sector plaguing the world's second-largest economy.November's retail sales and industrial output missed expectations, while investment in fixed assets also contracted. Hao Zhou, chief economist at securities company Guotai Junan International, told CNBC's \"Squawk Box Asia\" Wednesday that the reading was a \"very good, positive surprise to the market.\"\"Maybe the market is concerned about China's property market, China stock market, as well as the consumption,\" Zhou said. \"The data for now suggests that the economy is on the right trend, and the momentum remains solid.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "China manufacturing activity expands for the first time since March, beating expectations",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108173496-1752773807903-gettyimages-2224732518-vcg111579011710.jpeg?v=1752773940&w=1920&h=1080"
      ],
      "datePublished": "2025-12-31T03:50:22.000Z",
      "dateModified": "2025-12-31T03:50:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nike shares move higher on big insider purchases by CEO Elliott Hill, director Tim Cook after down year",
    "url": "https://www.cnbc.com/2025/12/31/nike-shares-insider-buying-tim-cook.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108231692-1764079951368-gettyimages-2247838436-US_HOLIDAY_SHOPPING.jpeg?v=1767197802&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-31T13:58:04.000Z",
    "description": "Shoppers near a Nike store in the SoHo neighborhood of New York, Nov. 24, 2025.Michael Nagle | Bloomberg | Getty ImagesNike shares rose 3% in premarke",
    "body": "Shoppers near a Nike store in the SoHo neighborhood of New York, Nov. 24, 2025.Michael Nagle | Bloomberg | Getty ImagesNike shares rose 3% in premarket trading Wednesday after insiders picked up the stock near the end of a rough year.Apple CEO Tim Cook, who serves as a director at the athletic apparel maker, added around 50,000 Nike shares, an approximately 90% increase in his stake, according to financial data provider Verity.Fellow board member Robert Holmes Swan added roughly 8,700 shares, per Verity. That marked a 24% expansion to the former eBay and Intel executive's position.Nike CEO Elliott Hill got about 16,400 shares in a transaction valued at $1 million, Verity found. His personal stake grew by more than 7% as a result.Stock Chart IconStock chart iconNike, 1-dayThis buying comes as the Oregon-based company wraps up another tough year in the eyes of investors.Shares of Nike have tumbled around 19% in 2025, on pace for its fourth straight down year. The stock has shed nearly half of its value over the last three years.Nike has recently contended with weak sales in China and hits from tariffs, the latest in a string of challenges for the retailer. The company has pitched its turnaround story led by Hill, who took the role last year.Wall Street appears optimistic that the stock can rebound. The average analyst polled by LSEG has a buy rating and price target suggesting shares can rise about 26% over the next year.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nike shares move higher on big insider purchases by CEO Elliott Hill, director Tim Cook after down year",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108231692-1764079951368-gettyimages-2247838436-US_HOLIDAY_SHOPPING.jpeg?v=1767197802&w=1920&h=1080"
      ],
      "datePublished": "2025-12-31T13:58:04.000Z",
      "dateModified": "2025-12-31T13:58:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "China accuses Netherlands of making 'mistakes' over chipmaker Nexperia",
    "url": "https://www.cnbc.com/2025/12/31/china-accuses-netherlands-of-making-mistakes-over-chipmaker-nexperia.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108223391-1762732099400-gettyimages-2244812334-AFP_839X72A.jpeg?v=1767163835&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-31T08:24:30.000Z",
    "description": "The logo of Chinese-owned semiconductor company Nexperia is displayed at the chipmaker's German facility, after the Dutch government seized control an",
    "body": "The logo of Chinese-owned semiconductor company Nexperia is displayed at the chipmaker's German facility, after the Dutch government seized control and auto industry bodies sounded the alarm over the possible impact on car production, in Hamburg, Germany, Oct. 23, 2025. Jonas Walzberg | ReutersChina has urged the Netherlands to swiftly correct its \"mistakes\" over chipmaker Nexperia and restore stability in the global semiconductor industry, in the latest development in a dispute over technology transfer.In September, the Dutch government invoked a Cold War-era law to effectively take control of Nexperia, a Chinese-owned chipmaker based in the Netherlands. The unusual move was reportedly made after the U.S. raised security concerns.In response, China moved to block its products from leaving China, which, in turn, raised the alarm among global automakers as they faced shortages of the chipmaker's components.On Wednesday, a spokesperson for China's Commerce Ministry said that the Netherlands should \"immediately correct its mistakes and clear the obstacles to restoring the stability and security of the global semiconductor supply chain.\"\"What is perplexing is that, faced with the anxiety and unease of the global industry, the Netherlands remains indifferent and stubbornly insists on its own way, showing absolutely no responsible attitude towards the security of the global semiconductor supply chain, and taking no substantive action whatsoever,\" the spokesperson said in a statement, according to a Google translation.A spokesperson for the Dutch government was not immediately available to comment when contacted by CNBC on Wednesday morning. Dutch Economy Minister Vincent Karremans has repeatedly defended his decision to intervene in the company over recent weeks. Read moreNexperia manufactures billions of so-called foundation chips — transistors, diodes and power management components — that are produced in Europe, assembled and tested in China, and then re-exported to customers in Europe and elsewhere. The low-tech, inexpensive chips are needed in almost every device that uses electricity. In cars, they're used to connect the battery to motors, for lights and sensors, for braking systems, airbag controllers, entertainment systems and electric windows.Auto industry groups have said that disruptions in the supply chain for Nexperia parts have not yet been fundamentally resolved, meaning that component availability remains uncertain.Japan's Nissan and German auto supplier Bosch are among the firms to have warned about looming shortages. Speaking to CNBC last month, a spokesperson for the German Association of the Automotive Industry (VDA), which represents Volkswagen, Mercedes-Benz Group and BMW among hundreds of others, warned of elevated risks to supply, \"particularly for the first quarter\" of 2026. — CNBC's Annika Kim Constantino contributed to this report.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "China accuses Netherlands of making 'mistakes' over chipmaker Nexperia",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108223391-1762732099400-gettyimages-2244812334-AFP_839X72A.jpeg?v=1767163835&w=1920&h=1080"
      ],
      "datePublished": "2025-12-31T08:24:30.000Z",
      "dateModified": "2025-12-31T08:24:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'Big Short' investor Michael Burry says he's not shorting Tesla",
    "url": "https://www.cnbc.com/2025/12/31/big-short-investor-michael-burry-denies-shorting-tesla-stock.html",
    "image": "https://image.cnbcfm.com/api/v1/image/106091765-1566479308096gettyimages-498562218.jpeg?v=1767176101&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-31T15:51:52.000Z",
    "description": "Michael Burry attends the New York premiere of \"The Big Short\" at the Ziegfeld Theater in New York City on Nov. 23, 2015.Jim Spellman | WireImage | Ge",
    "body": "Michael Burry attends the New York premiere of \"The Big Short\" at the Ziegfeld Theater in New York City on Nov. 23, 2015.Jim Spellman | WireImage | Getty ImagesRenowned investor Michael Burry on Wednesday denied shorting Tesla's shares after calling the electric vehicle maker \"ridiculously overvalued.\" In a social media post on X, the Scion Asset Management founder responded to a user asking if he would bet against Tesla, saying, \"I am not short.\" Burry, who earned his reputation by successfully predicting the collapse of the U.S. housing market that led to the 2008 global financial crisis, clarified his position after describing Tesla as \"ridiculously overvalued\" in a separate post.\"The Big Short\" investor made the same assessment of Tesla's stock valuation to subscribers to his new paid Substack newsletter earlier in the month. Burry recently made headlines with a tech short bet. He said some of America's largest companies were using aggressive accounting to inflate their supposed profits from the artificial intelligence boom.Burry's latest comments on Tesla come shortly after the company took the unusual step of publishing delivery estimates that appear to indicate a lower-than-expected outlook.Deliveries are the closest approximation of vehicle sales reported by Tesla but are not precisely defined in the company's shareholder communications.Read moreTesla on Monday compiled an average estimate for 1.6 million vehicle deliveries in 2025, down roughly 8% from 2024 and putting the company on track for its second straight annual drop.Tesla has endured a roller-coaster ride this year. The company, whose stock recently notched an all-time closing high of $489.88, saw shares collapse in the first quarter amid stiff competition, particularly from Chinese EV manufacturers, and reputational fallout from Musk's incendiary political rhetoric. Shares of Tesla were down slightly in morning trading Wednesday. The company's stock has gained more than 12.5% in 2025.— CNBC's Yun Li contributed to this report.Correction: An earlier version of this story used deliveries and sales interchangeably. It has been updated to reflect the difference.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Big Short' investor Michael Burry says he's not shorting Tesla",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/106091765-1566479308096gettyimages-498562218.jpeg?v=1767176101&w=1920&h=1080"
      ],
      "datePublished": "2025-12-31T15:51:52.000Z",
      "dateModified": "2025-12-31T15:51:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "SoftBank has fully funded $40 billion investment in OpenAI, sources tell CNBC",
    "url": "https://www.cnbc.com/2025/12/30/softbank-openai-investment.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108246651-1767105043132-108246651-1767103912282-gettyimages-2248717434-JAPAN_FII.jpeg?v=1767105059&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-31T00:31:50.000Z",
    "description": "watch nowSoftBank has completed its $40 billion investment commitment to OpenAI, sources told CNBC's David Faber. The Japanese investment giant sent o",
    "body": "watch nowSoftBank has completed its $40 billion investment commitment to OpenAI, sources told CNBC's David Faber. The Japanese investment giant sent over a final $22 billion to $22.5 billion last week, according to sources familiar with the matter, who asked not to be named in order to discuss details of the transaction. SoftBank had previously invested $7.5 billion in the ChatGPT maker and syndicated another $11 billion with co-investors, the Japanese conglomerate confirmed in a press release, with the final aggregate commitment at $41 billion. The investment takes SoftBank's stake in the company to around 11%.CNBC reported in February that the company was finalizing a $40 billion investment in the Sam Altman-run startup at a $260 billion pre-money valuation. At the time, Faber reported that the funding would be paid out over a 12-to-24-month period. Some money was slated to support OpenAI's artificial intelligence infrastructure Stargate joint venture with Oracle and SoftBank.Read more CNBC tech newsElon Musk envisions humanoid robots everywhere. China may be the first to make it a realityMeta acquires intelligent agent firm Manus, capping year of aggressive AI movesSoftbank to buy data center firm DigitalBridge for $4 billion in AI pushCalifornia's Ro Khanna faces Silicon Valley backlash after embracing wealth taxCompanies have been spending big in recent months to build out infrastructure to support a frenzy for AI solutions and growing compute needs. OpenAI has made more than $1.4 trillion in infrastructure commitments over the next several years, including agreements with chipmakers Nvidia, Advanced Micro Devices and Broadcom.Over the years, SoftBank has been betting big on technology and AI companies and was an early investor in chipmaker Nvidia. On Monday, the conglomerate agreed to pay $4 billion for data center investment firm DigitalBridge to strengthen its AI push. Last month, SoftBank liquidated its entire $5.8 billion stake in major AI beneficiary Nvidia. A different source familiar with the move to sell the stake told CNBC at the time that the sale, combined with other cash sources, would support its OpenAI investment.The startup, which is reportedly preparing for an initial public offering, has received billions in funding over the years from tech juggernaut Microsoft. Earlier this month, CNBC reported that OpenAI was exploring the potential for a more than $10 billion investment from Amazon. Disney is also a recent backer, following a $1 billion equity investment deal that allows users of OpenAI's video generator Sora to generate content with licensed characters such as Mickey Mouse.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "SoftBank has fully funded $40 billion investment in OpenAI, sources tell CNBC",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108246651-1767105043132-108246651-1767103912282-gettyimages-2248717434-JAPAN_FII.jpeg?v=1767105059&w=1920&h=1080"
      ],
      "datePublished": "2025-12-31T00:31:50.000Z",
      "dateModified": "2025-12-31T00:31:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Russia and Ukraine trade barbs over alleged drone attack on Putin residence",
    "url": "https://www.cnbc.com/2025/12/30/ukraine-denies-attacking-putins-residence-with-drones.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108161887-17504364852025-06-20t151313z_978298954_rc2e6fawra9t_rtrmadp_0_russia-forum-putin.jpeg?v=1750436546&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-30T13:06:18.000Z",
    "description": "In this pool photograph distributed by the Russian state agency Sputnik, Russia's President Vladimir Putin attends a meeting of the Collective Securit",
    "body": "In this pool photograph distributed by the Russian state agency Sputnik, Russia's President Vladimir Putin attends a meeting of the Collective Security Treaty Organisation (CSTO) Heads of State Council at the Yntymak Ordo (Palace of Unity) presidential residence in Bishkek on November 27, 2025. Alexander Kazakov | Afp | Getty ImagesRussia and Ukraine continued to trade barbs Tuesday over an alleged drone attack on one of Russian President Vladimir Putin's official residences.Ukraine has denied that it carried out any such strike, describing it as a \"complete fabrication,\" but the Kremlin said that its military stands ready to retaliate. Russia's foreign minister, Sergey Lavrov, on Monday alleged that Ukraine had fired 91 drones at Putin's official residence in the Novgorod region, located between Moscow and St Petersburg.Lavrov said that the drones, allegedly launched between Sunday night and Monday morning, had been destroyed by air defenses and that no casualties had been reported. It's not clear where Putin was at the time of the alleged incident, and Lavrov provided no further details. Ukraine denied the claims and instead accused Moscow of trying to undermine peace talks.\"Russia is at it again, using dangerous statements to undermine all achievements of our shared diplomatic efforts with President Trump's team,\" Ukrainian President Volodymyr Zelenskyy said on X. \"This alleged 'residence strike' story is a complete fabrication intended to justify additional attacks against Ukraine, including Kyiv, as well as Russia's own refusal to take necessary steps to end the war. Typical Russian lies.\"Read more CNBC politics coverageEuropean Union approves over $105 billion toward Ukraine aid package for next two yearsBrown and MIT prof shooter suspect Neves Valente is found dead, authorities saysTrump Media to merge with fusion company TAE Technologies, DJT stock soarsTrump announces 'warrior dividend' of $1,776 to U.S. soldiers in prime-time speechEpstein accomplice Ghislaine Maxwell petitions to vacate sex crime convictionCongressional stock trading ban bill to get a vote in new year: House RepublicansFBI Deputy Director Dan Bongino is stepping down in JanuaryObamacare subsidies extension to get vote after 4 Republicans buck leadershipFCC chief Carr tells Senate that his agency is 'not formally ... independent'Trump vowed to block tankers carrying Venezuela's oil — nearly a dozen at sea nowKennedy Center to be renamed 'Trump-Kennedy Center,' White House saysTrump vowed to block tankers carrying Venezuela's oil — nearly a dozen at sea nowHouse passes bill to ease permits for building out AI infrastructureTrump sues BBC for $10 billion, claims defamation from Panorama documentaryPentagon takes big stake in new Korea Zinc refinery in Tenn., gets 10% of companyNew Trump tariffs collection hits $200 billion, Customs saysFormer Instacart employee says she was fired over her Democratic congressional campaignUkraine peace talks progressing, Russia open to EU membership, U.S. officials sayNew York AG sues UPS for allegedly shorting Christmas season workers' wagesTrump admin to hire 1,000 specialists for 'Tech Force'Trump doubles down on Rob Reiner criticism after killing; director's son in custodyTSA is giving airline passenger data to ICE for deportation push: NYTTrump's AI order may be 'illegal,' Democrats and consumer advocacy groups claimTrump sued by preservation group seeking to halt White House ballroom projectTrump says 'no big deal' after new Epstein photos showing him releasedPutin can fund war for years, ex-official says as Trump's resolve is testedIndiana redistricting bill that Trump demanded defeated in state SenateHouse passes INVEST Act to ease investment standards, boost capital in marketsDOJ fails again to indict New York AG James, a Trump target: ReportsTrump 'sells out' U.S. national security with Nvidia chip sales to China: WarrenTrump pushes for top prosecutor nominee Halligan after Comey, James cases tossedTrump willing to seize more oil tankers off Venezuela coast: White HouseSeized tanker will go to U.S. port, Trump admin intends 'to seize the oil'GOP lawmakers seek Trump aid for agricultural equipment after tariff pressureTrump says Fed could have 'at least doubled' latest interest rate cut'Spoof' ship: Seized oil tanker hid location, visited Iran and VenezuelaTrump admin touts pulling 9,500 truckers off road for failing English testsSwiss government says new 15% U.S. tariff ceiling retroactive to mid-NovemberHomeland Security Dept. buying Boeing 737s for ICE deportationsTrump officials move to end student loan payment pause for millions of borrowersJudge unseals Ghislaine Maxwell grand jury materials, citing Epstein files actUkraine at 'critical moment' in war as European allies ramp up pressure on RussiaDemocrats establish AI working group as industry bolsters DC presenceEx-Trump lawyer Habba resigns as NJ U.S. attorney after disqualificationRussian state media reported that Putin called U.S. President Donald Trump following the incident and told him that Russia would \"revise its stance\" in ongoing peace talks aimed at ending the war in Ukraine. Russia's allegation came a day after Zelenskyy held in-person talks with Trump at Mar-a-Lago in Florida, with both leaders saying progress had been made on a 20-point peace plan and an agreement on security guarantees for Ukraine. Zelenskyy commented Monday that Moscow was trying to undermine peace talks between the U.S. and Kyiv, saying: \"Ukraine does not take steps that can undermine diplomacy. To the contrary, Russia always takes such steps. This is one of many differences between us.\"On Tuesday, the Kremlin said it had noted Zelenskyy's denial and said the Western media was \"playing along with Ukraine.\" Asked whether Russia would produce evidence for the alleged drone attack, Putin's press secretary, Dmitry Peskov, said that was a matter for the military.Ukraine's foreign minister, Andrii Sybiha, commented Tuesday on X that \"almost a day passed and Russia still hasn't provided any plausible evidence to its accusations of Ukraine's alleged 'attack on Putin's residence.' And they won't. Because there's none. No such attack happened.\"Trump reactionRussian state media reported that Trump had expressed outrage at the alleged attack during a phone conversation with Putin on Monday. Kremlin presidential aide Yuri Ushakov told the press that Trump was \"shocked by this information, literally outraged\" at \"such reckless actions,\" state media agency Tass reported. Ushakov added that it was stated that the incident would affect the U.S. approach to working with Zelenskyy.Trump was later directly asked for his reaction to the alleged drone attack and appeared to side with Russia's version of events.\"I learned about it from ‌President Putin today. I was very angry about ‌it,\" he told reporters in Florida on Monday.\"This is not ​the right time. It's one thing to be offensive, because they're offensive. ‍It's another thing to attack his house. It's not the right time to do any of that,\" he added.U.S. President Donald Trump welcomes Russian President Vladimir Putin to Joint Base Elmendorf-Richardson on August 15, 2025 in Anchorage, Alaska. Contributor | Getty Images News | Getty ImagesSome commentators on social media said that Russia had aimed to use the alleged drone attack as a way to gauge Trump's attitude toward Ukraine, and to undermine — or stress test — potential security guarantees that Kyiv could receive as part of a peace deal.\"This is how supposedly ironclad 'security guarantees for Ukraine' would fall apart: one Russian false-flag operation — or just a lie ... and they're gone,\" Olena Halushka, co-founder of the International Centre for Ukrainian Victory, commented on X.When asked if there was any U.S. intelligence showing the attack actually took place, Trump admitted it's \"possible\" it didn't actually happen. But he added, \"President Putin told me this morning it did.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Russia and Ukraine trade barbs over alleged drone attack on Putin residence",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108161887-17504364852025-06-20t151313z_978298954_rc2e6fawra9t_rtrmadp_0_russia-forum-putin.jpeg?v=1750436546&w=1920&h=1080"
      ],
      "datePublished": "2025-12-30T13:06:18.000Z",
      "dateModified": "2025-12-30T13:06:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Apple needs to deliver an AI-charged Siri so good it gets older iPhone users to upgrade",
    "url": "https://www.cnbc.com/2025/12/30/apple-intelligence-ai-siri-iphone.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108196256-17574384612025-09-09t171736z_980751173_rc2hoga11g2b_rtrmadp_0_apple-event.jpeg?v=1767135523&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-30T23:05:48.000Z",
    "description": "Apple CEO Tim Cook speaks as Apple holds an event at the Steve Jobs Theater on its campus in Cupertino, California, Sept. 9, 2025.Manuel Orbegozo | Re",
    "body": "Apple CEO Tim Cook speaks as Apple holds an event at the Steve Jobs Theater on its campus in Cupertino, California, Sept. 9, 2025.Manuel Orbegozo | ReutersApple has one heck of a mulligan coming ahead of its 50th anniversary in 2026.After failing on its promise to launch an artificial intelligence-supercharged version of Siri in March, Apple said it's on track to make it happen in the new year.The stakes are enormous. Apple's AI failure this year put even more pressure on it to deliver a breakthrough AI experience on the iPhone. Another whiff like that will only cement the idea that Apple is woefully behind its peers in AI and risks losing control over the next major computing platform to a rival like Google or a startup like OpenAI.Not only that, Apple must prove to investors that AI can generate meaningful sales growth after years of post-pandemic stagnation.How Apple got hereWe knew it was going to be a challenging 2025 for Apple long before the calendar turned over to the new year.With President Donald Trump's inauguration looming, no major tech company was more exposed to his impending tariff scheme than Apple.And then there was the looming AI question. Apple launched limited features for its Apple Intelligence system in the fall, but the real update, an AI-powered version of Siri that Apple advertised as a key feature in the iPhone 16, was scheduled to launch early in 2025. Apple shares were reaching new highs in anticipation of a groundbreaking AI experience built into the iPhone. It was all for nothing. It took months for Apple CEO Tim Cook to play the politician and woo the president with the promise of $600 billion in U.S. investments over the next four years, culminating in a stunning moment in the Oval Office when Cook gave the president a glass trophy with a solid gold base. The ploy worked. Even though analysts pointed out most of Cook's promised spending was already baked in, the president thought it was good enough. Trump dropped his demands for Apple to build iPhones on U.S. soil and gave Cook the tariff relief he wanted. With the tariff problem out of the way, Apple shares surged. The stock is up about 35% since that show in the Oval Office.Read more CNBC tech newsElon Musk envisions humanoid robots everywhere. China may be the first to make it a realityMeta acquires intelligent agent firm Manus, capping year of aggressive AI movesSoftbank to buy data center firm DigitalBridge for $4 billion in AI pushCalifornia's Ro Khanna faces Silicon Valley backlash after embracing wealth taxLet's try that again...Now, Apple has to solve its AI problem. Following an exodus of top execs, including AI boss John Giannandrea, Apple said it has the team in place to deliver the Siri upgrade in 2026, which could come as much as 21 months after the original announcement.Apple needs that new Siri to be good. Not just good enough to match the capabilities of popular AI chatbots like ChatGPT and Gemini, but also good enough to convince folks with older iPhones to upgrade to a new device so they can use it. Users need an iPhone 15 Pro or better to use Apple Intelligence.That was the Apple bull case a year ago. That Apple Intelligence, especially the new version of Siri, was going to be so amazing that people would get a new iPhone just to use it. That elusive iPhone \"super cycle\" was on the horizon. Nope. Perhaps next year. For investors, it's their best bet to see a boom in Apple shares from AI.Unlike the $20 per month OpenAI charges to use the full version of ChatGPT, Apple doesn't charge for Apple Intelligence. Unless Apple changes its strategy and starts charging a subscription, its only hope is to leverage AI to move new iPhones, Macs and iPads. It also opens up Apple to launch different kinds of hardware products, like the rumored smart glasses that could come as soon as next fall. But don't count on an accessory like that moving the needle too much at Apple. Apple rarely misses the way it did with AI this year, especially with something as important and as transformative as AI. Luckily for Apple, it's still early in the AI game. And it proved this year with the iPhone 17 lineup that new hardware designs and features can lead to sales growth. But it can only miss once. There's not going to be another chance for a mulligan.watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Apple needs to deliver an AI-charged Siri so good it gets older iPhone users to upgrade",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108196256-17574384612025-09-09t171736z_980751173_rc2hoga11g2b_rtrmadp_0_apple-event.jpeg?v=1767135523&w=1920&h=1080"
      ],
      "datePublished": "2025-12-30T23:05:48.000Z",
      "dateModified": "2025-12-30T23:05:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Fed minutes show officials were in tight split over December rate cut",
    "url": "https://www.cnbc.com/2025/12/30/fed-minutes-december-2025.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108240153-17653975662025-12-10t200137z_1102812323_rc2vdiax3ont_rtrmadp_0_usa-fed.jpeg?v=1765397716&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-30T21:37:46.000Z",
    "description": "WASHINGTON — The Federal Reserve on Tuesday released minutes from its highly divisive meeting earlier this month, which concluded with a vote to lower",
    "body": "WASHINGTON — The Federal Reserve on Tuesday released minutes from its highly divisive meeting earlier this month, which concluded with a vote to lower interest rates again that appeared to be an even closer call than the final vote indicated.Officials expressed a variety of opinions during the Dec. 9-10 meeting, according to the summary provided a day ahead of its customary release due to the New Year's holiday.Ultimately, the Federal Open Market Committee approved a quarter-percentage point cut by a 9-3 vote, the most dissents since 2019, as officials debated the need to support the labor market against concerns about inflation. The move lowered the key funds rate to a range of 3.5%-3.75%.\"Most participants judged that further downward adjustments to the target range for the federal funds rate would likely be appropriate if inflation declined over time as expected,\" the document said.With that, though, came misgivings over how aggressive the FOMC should be in the future.\"With respect to the extent and timing of additional adjustments to the target range for the federal funds rate, some participants suggested that, under their economic outlooks, it would likely be appropriate to keep the target range unchanged for some time after a lowering of the range at this meeting,\" the minutes said.Officials expressed confidence that the economy would continue to expand around a \"moderate\" pace, while they saw downside risks to employment and upside risks to inflation. The extent of the two dynamics divided FOMC policymakers, with indications that the vote could have gone either way despite the six-vote victory for the cut.\"A few of those who supported lowering the policy rate at this meeting indicated that the decision was finely balanced or that they could have supported keeping the target range unchanged,\" the minutes said.Stocks held slightly negative following the release. Traders raised bets a bit that the Fed would cut again in April.The vote also came with a quarterly update of the committee's Summary of Economic Projections, including the closely watched \"dot plot\" grid of individual officials' rate expectations.The 19 officials at the December meeting — 12 vote on rates — indicated the likelihood of another cut in 2026 then one more in 2027. That would take the funds rate down to near 3%, a level officials consider as neutral in that it neither restricts nor pushes economic growth.The faction favoring keeping the rate steady \"expressed concern that progress toward the Committee's 2 percent inflation objective had stalled in 2025 or indicated that they needed to have more confidence that inflation was being brought down sustainably to the Committee's objective.\"Officials said President Donald Trump's tariffs were boosting inflation, but they also largely agreed that the impact would be temporary and likely abate into 2026.Since the vote, economic reports have pointed to a labor market where hiring is still slow but layoffs have not accelerated. On the prices side, inflation has been slowly easing but remains a distance away from the Fed's 2% target.At the same time, the broader economy continues to perform well. Gross domestic product soared in the third quarter, rising at a 4.3% annualized pace that was well ahead of estimates and a half-percentage point better than the strong second quarter.However, most of the data carries a significant caveat: Reports are still trailing as government agencies round up data from the dark period during the government shutdown. Even the reports coming in that are more current, at least from official sources, are being weighed with caution due the data gaps.Consequently, markets largely expect the FOMC to stay put over the next few meetings as policymakers weigh incoming data. The holiday season was a quiet one for Fed official commentary and the few comments out there show mostly caution heading into the new year.The committee's complexion also is about to change, with four new regional presidents rotating into voting roles. They will be Cleveland President Beth Hammack, who has expressed opposition not only to additional cuts but also previous ones; Philadelphia President Anna Paulson, who has joined FOMC doves in expressing concern about inflation; Dallas President Lorie Logan, who has voiced concerns about cutting; and Minneapolis President Neel Kashkari, who said he wouldn't have voted for the October cut.Also at the meeting, the committee voted to resume its bond-buying program. Under the new setup, the Fed will be acquiring short-term Treasury bills in an effort to calm pressures in short-term funding markets.The central bank initiated the program by buying $40 billion a month in bills, staying around that level for several months before downshifting. A prior effort to reduce the balance sheet saw the Fed cut its holdings by about $2.3 trillion to its current $6.6 trillion.The minutes noted that unless the buying program, known in markets as quantitative easing, was restarted, it could result in a \"significant declines in reserves\" that would fall below the Fed's \"ample\" regime for the banking system.Correction: The vote came with a quarterly update of the committee's Summary of Economic Projections. An earlier version misstated the name of the forecast.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Fed minutes show officials were in tight split over December rate cut",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108240153-17653975662025-12-10t200137z_1102812323_rc2vdiax3ont_rtrmadp_0_usa-fed.jpeg?v=1765397716&w=1920&h=1080"
      ],
      "datePublished": "2025-12-30T21:37:46.000Z",
      "dateModified": "2025-12-30T21:37:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "We asked a humanoid robot if there is an AI bubble. Here's what it said",
    "url": "https://www.cnbc.com/2025/12/30/we-asked-a-humanoid-robot-if-theres-an-ai-bubble-heres-what-it-said.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108246865-1767126117562-robo32.jpg?v=1767134982&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-30T23:40:03.000Z",
    "description": "watch nowThe big artificial intelligence bubble question has been the tech industry's buzziest debate all year, and one robot has weighed in with its ",
    "body": "watch nowThe big artificial intelligence bubble question has been the tech industry's buzziest debate all year, and one robot has weighed in with its opinion.KOID is a short, slender humanoid robot with a black metal body and a bright ring of light for a face. KOID is manufactured by Unitree, one of China's hottest tech companies, and the Nvidia-powered robot shares a name with an ETF launched in June by KraneShares that focuses on robotics companies.The walking, talking machine on Tuesday told CNBC that the AI bubble debate is certainly a \"hot topic,\" but KOID gave a neutral outlook on whether the boom is actually a looming bubble.\"We might see a lot of excitement around AI right now, but whether it's a bubble or just a transformative wave, is something only time will tell,\" KOID said.The AI-powered machine added that AI and humanoids are \"here to stay\" and will continue to evolve.Weighing in at about 77 pounds, KOID is one of Unitree's G1 models. Those humanoids have 23 degrees of freedom, or specific points where it can move independently, enabling it to achieve full-body maneuvers from dancing to boxing. KOID is available to purchase on RoboStore, the largest U.S. distributor of Unitree robots, with the models ranging from $8,990 to $128,900.A humanoid robot from RoboStore joins CNBC's \"Power Lunch\" on Dec. 30, 2025.CNBCRoboStore CEO Teddy Haggerty told CNBC's \"Power Lunch\" on Tuesday that while KOID can be programmed to do many kinds of tasks, the industry is still in a \"prototyping\" stage of figuring out where robots fit in everyday living.\"What is it that we really want robots to do?\" Haggerty said. \"Do we want robots to become our new housekeepers? Do we want them to help manufacturing? Do we want them to replace jobs?\"KOID, however, seems a little more certain of its own future. It said that robots will likely become \"even more versatile and integrated\" into daily life.\"They'll help out a variety of fields, from home assistants to industrial tasks, making life a bit easier and more efficient,\" the robot said.The humanoid robotics race has been heating up this past year, with companies including Boston Dynamics and Agility Robotics emerging in the space. Tesla's Optimus robots have taken center stage, with CEO Elon Musk saying that they are a future key contributor to the company's valuation.Yet while Optimus robots have yet to hit the market, Chinese companies have been ramping up production to beat the U.S. to the punch — with Unitree spearheading the pack.The company outperformed its peers in events like the World Robot Conference and World Humanoid Robot Games. Unitree, which is heading for an initial public offering that could value it at up to $7 billion, debuted its latest H2 model earlier this year.Read more CNBC tech newsElon Musk envisions humanoid robots everywhere. China may be the first to make it a realityMeta acquires intelligent agent firm Manus, capping year of aggressive AI movesSoftbank to buy data center firm DigitalBridge for $4 billion in AI pushCalifornia's Ro Khanna faces Silicon Valley backlash after embracing wealth tax",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "We asked a humanoid robot if there is an AI bubble. Here's what it said",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108246865-1767126117562-robo32.jpg?v=1767134982&w=1920&h=1080"
      ],
      "datePublished": "2025-12-30T23:40:03.000Z",
      "dateModified": "2025-12-30T23:40:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Champagne sales surge at New Year — but labor abuses and tariffs have clouded the industry",
    "url": "https://www.cnbc.com/2025/12/31/champagne-sales-labor-abuses-tariffs-cloud-the-sector.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108243428-1766048558661-gettyimages-2231686460-AFP_72ML9GG.jpeg?v=1766048593&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-31T09:42:55.000Z",
    "description": "Bulgarian grape harvesters work in the vineyards of Chateau de Meursault in Meursault, in the Burgundy region of central-eastern France, on August 26,",
    "body": "Bulgarian grape harvesters work in the vineyards of Chateau de Meursault in Meursault, in the Burgundy region of central-eastern France, on August 26, 2025. (Photo by ARNAUD FINISTRE / AFP) (Photo by ARNAUD FINISTRE/AFP via Getty Images)          Arnaud Finistre | Afp | Getty ImagesIt'll come as no surprise that sales of Champagne peak in the run-up to Christmas and New Year, with French fizz the drink of choice for many households in the festive season.Every year, around 120,000 seasonal workers come to work in France, harvesting grapes across 34,000 hectares of vines. The harvest only lasts a couple of weeks, making it a frenetic time for the sector.A darker side to the industry has emerged when it comes to that work, however, with recent reports shining a light on the exploitation and mistreatment of champagne grape pickers who are often foreign and undocumented migrants.During an extreme heatwave in the late summer of 2023, at least four migrant grape pickers, or \"vendangeurs\" as they're known, died in what has since been dubbed the \"harvest of shame.\"The case highlighted broader substandard working and housing conditions for pickers, including excessive working hours, low pay, a lack of safety equipment and protocols, such as adequate hydration and breaks.The scandal around working conditions and welfare comes at a difficult time for the wider industry — 2024's harvest saw lower yields than average due to spring frosts and a rainy period during the summer that only subsided toward the end of the growing season, just about \"saving\" the harvest. The 2025 harvest fared better and was lauded for its high-quality vintage, thanks to clement weather conditions.Nonetheless, this year's sales, which will be released in January, are likely to be further dented by U.S. import tariffs on goods from the EU, which caused Champagne shipments to the U.S. to slump.'Blatant mistreatment'The murkier side of the Champagne industry came to light when at least four migrant grape pickers died during the 2023 harvest, which took place during an extreme heatwave. Seasonal workers harvest grapes in vineyards in the AOC (Appellation d'origine contrôlée) Champagne region on September 14, 2023 in Châtillon-sur-Marne, France. Thierry Monasse | Getty Images News | Getty ImagesThen, in the summer of 2025, three individuals were put on trial, accused of human trafficking and exploiting over 50 West African migrant workers during the 2023 harvest.The victims reported being treated \"like slaves\" and \"animals\" and being housed in \"hellish\" and unsanitary conditions with no clean drinking water. Such conditions compromised workers' safety, health and dignity, the labor inspectorate said in the case. Unscrupulous hiring practices were also thrust into the spotlight during the trial as the defendants were affiliated with an employment agency which provided workers to the industry, highlighting Champagne houses' widespread use of subcontractors and employment agencies, or more informal channels, to recruit grape pickers. The defendants were convicted and handed fines and prison sentences, while trade unions said the use of \"middlemen\" and agencies had enabled Champagne houses to turn a blind eye to illegal working practices.In a summary of the case which was held in Châlons-en-Champagne criminal court, the prosecutor commented, \"we cannot accept that behind a bottle of Champagne lies uncontrolled subcontracting and blatant mistreatment.\"Sales challengesThe Comité Champagne — the overarching trade body for France's Champagne industry and representing over 16,000 winegrowers, 130 cooperatives and 370 Champagne houses — acknowledged that the court case had damaged the industry's reputation and said it would take a \"zero tolerance\" approach to any future abuses.\"We had to stand with the victims. You don't play games with the health and safety of seasonal workers. Nor do you play games with the image of our appellation,\" Comité co-presidents David Chatillon and Maxime Toubart told Le Monde newspaper in July after the trial. The Comité launched a \"Together for the Champagne Harvest\" action plan to ensure that worker health and safety protocols and worker accommodations were improved, as well as harvest regulations.  A French General Confederation of Labour (CGT) union member hands out pamphlets to seasonal grape pickers, often foreign workers, in a Champagne vineyard to inform them of their labour rights, in Igny-Comblizy, eastern France, on September 19, 2024. Francois Nascimbeni | Afp | Getty ImagesChampagne winegrowers and houses have been keen to show they are committed to workers' well-being. Moët & Chandon, the world's largest producer and part of LVMH, invested 1.5 million euros ($1.76 million) in new accommodation for an extra 90 grape pickers in 2024, bringing the total capacity of its accommodation provision to up to 1,900 beds. CNBC asked the Comité Champagne whether welfare measures had been fully implemented by its member organizations since they were proposed, but has not yet received a response. CNBC also contacted several unions, including the CGT labor union and SGV union of Champagne growers, about the reforms, but did not receive responses. watch nowIt's no doubt a difficult time for the wider industry — 2024's harvest saw lower yields than average due to spring frosts and a rainy period during the summer that only subsided toward the end of the growing season — just about \"saving\" the harvest. The 2025 harvest fared better and was lauded for its high-quality vintage, thanks to clement weather conditions.Synonymous with north-eastern France, Champagne accounts for 10% of the world's sparkling wine production by volume, but as much as 35% of sparkling wine's global market value.However, sales have declined in recent years amid a fall in global demand and declining alcohol consumption.In 2023, shipments of Champagne (which are typically a mix of several years' harvests) totalled 299 million bottles, down 8.2% compared to the previous year. In 2024, 271 million bottles were shipped, according to the Comité Champagne data. This year's sales face additional headwinds from U.S. import tariffs on goods from the EU.The industry has also faced challenges from within, with the CGT labor union at LVMH's Moët & Chandon and Veuve Clicquot's champagne units calling on workers to strike in December over the cancellation of year-end bonuses and demands for better pay. A spokesman for Moët & Chandon told CNBC that it would not comment on the dispute but that negotiations over pay would take place in early 2026, noting, \"we cannot comment before the negotiations.\" If sales keep falling, the treatment of seasonal pickers will be just one challenge facing the industry.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Champagne sales surge at New Year — but labor abuses and tariffs have clouded the industry",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108243428-1766048558661-gettyimages-2231686460-AFP_72ML9GG.jpeg?v=1766048593&w=1920&h=1080"
      ],
      "datePublished": "2025-12-31T09:42:55.000Z",
      "dateModified": "2025-12-31T09:42:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "China to restrict silver exports, echoing rare earths playbook",
    "url": "https://www.cnbc.com/2025/12/31/china-silver-export-controls-2026-us-economy-prices-rare-earths-critical-minerals-xag-metals.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108202789-17586402512025-01-10t134231z_250656088_rc2x6cas6qkq_rtrmadp_0_germany-gold.jpeg?v=1758640292&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-31T04:09:34.000Z",
    "description": "Silver bars are stacked in the safe deposit boxes room of the Pro Aurum gold house in Munich, Germany, January 10, 2025. Angelika Warmuth | ReutersBEI",
    "body": "Silver bars are stacked in the safe deposit boxes room of the Pro Aurum gold house in Munich, Germany, January 10, 2025. Angelika Warmuth | ReutersBEIJING — China is set to tighten controls on silver exports from Thursday, expanding restrictions on the once-ordinary metal critical to the U.S. industry and defense supply chains.Tesla CEO Elon Musk criticized the move over the weekend on his social media platform X, responding to a post about the upcoming restrictions. \"This is not good. Silver is needed in many industrial processes,\" Musk wrote.But the rules are not new. China's Commerce Ministry first announced the new measures in October to strengthen oversight of rare metals, on the same day that U.S. President Donald Trump and Chinese President Xi Jinping met in South Korea. At the time, Beijing agreed to a one-year pause on certain rare earth export controls, while the U.S. rolled back tariffs. Earlier this month, China released a list of 44 companies approved to export silver under the new measures in 2026 and 2027. The new rules in 2026 also restrict exports of tungsten and antimony, materials dominated by China's supply chain and widely used in defense and advanced technologies.Stock Chart IconStock chart iconWhile China hasn't explicitly announced a blanket ban on silver exports, the state-run Securities Times on Tuesday cited an unnamed industry insider, who said the new policy formally elevates the metal from an ordinary commodity to a strategic material, placing its export controls on the same regulatory footing as rare earths. The EU Chamber of Commerce in China found in a flash survey of members in November that a majority of respondents have been or expect to be affected by those Chinese export controls.The U.S. added silver to its nationally designated list of critical minerals in November, citing its use in electrical circuits, batteries, solar cells, and anti-bacterial medical instruments. A separate U.S. analysis said China was one of the world's largest producers of silver in 2024, and also home to one of the largest reserves.China exported more than 4,600 tons of silver in the first 11 months of the year, far more than the roughly 220 tons of imports during that time, according to Wind Information, citing official figures.watch nowThe restrictions on silver come just as interest in the metal has increased in recent weeks.Two Chinese companies contacted Canada-based Kuya Silver on Friday, offering to buy physical silver at about $8 more than the market price at the time, CEO David Stein confirmed to CNBC. He said one company was a manufacturer, and the other was a large trading firm. An Indian buyer approached Kuya on Monday with an offer $10 above the market price, he added.Conservative digital media outlet The Free Press ran a column Tuesday by George Mason University economics professor Tyler Cowen, who said the surge in silver and gold prices reflects investors shifting away from the U.S. dollar.He called the surge in prices \"a flashing warning for the [U.S.] economy.\"The U.S. dollar index has fallen by nearly 9.5% in 2025, its worst performance since 2017. In contrast, silver has more than doubled in price, on track for its best year since 1979 when the metal surged by nearly 470%. Silver prices retreated on Wednesday after touching a record peak above $80 an ounce at the start of the week, with spot prices last trading at around $73.\n\t\t\n\t\t\n\t\t\n\t\t\tWeekly analysis and insights from Asia's largest economy in your inbox\n\t\t\tSubscribe now\n\t\t\n\tGold has gained more than 60% so far this year and is also on pace for its best year since 1979.Bitcoin, sometimes promoted as an alternative to gold as a store of value, was trading near $88,000 Wednesday morning Beijing time, down by more than 5% for the year.— CNBC's Chris Hayes contributed to this report.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "China to restrict silver exports, echoing rare earths playbook",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108202789-17586402512025-01-10t134231z_250656088_rc2x6cas6qkq_rtrmadp_0_germany-gold.jpeg?v=1758640292&w=1920&h=1080"
      ],
      "datePublished": "2025-12-31T04:09:34.000Z",
      "dateModified": "2025-12-31T04:09:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "These restaurant chains closed locations in 2025",
    "url": "https://www.cnbc.com/2025/12/30/2025-restaurant-closures-starbucks-wendys.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108235405-1764701051154-gettyimages-2249589986-anotherday155734029_n1sdrhf3.jpeg?v=1767114011&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-30T17:10:22.000Z",
    "description": "As the restaurant industry endured another difficult year, many chains opted to close underperforming locations as they try to turn around their busin",
    "body": "As the restaurant industry endured another difficult year, many chains opted to close underperforming locations as they try to turn around their businesses.Inflation-weary consumers have pulled back their restaurant spending, choosing to eat at home or chasing deals when they go out for a meal. While some restaurants have won over reluctant diners, the industry has largely struggled with the sales slump. Traffic to restaurants open at least a year fell every month in 2025, excluding only July, according to Black Box Intelligence. In years past, restaurant closures have been more concentrated across casual-dining chains, which lost customers to fast-casual competitors like Chipotle. But this year, chains across the industry announced plans to shutter at least hundreds of locations.In such a tough environment, some restaurant companies even filed for bankruptcy protection. Hooters, Pinstripes and On the Border were some of the notable names that landed in bankruptcy court this year.Here are the chains that announced closures in 2025:StarbucksA Starbucks coffee cup sits on a table inside a Starbucks in New York on Dec. 2, 2025.Spencer Platt | Getty Images News | Getty ImagesIn September, the coffee giant announced a $1 billion restructuring plan that included closing roughly 500 of its North American locations. The closures even extended to shuttering its upscale Reserve Roastery cafe in Seattle, the company's hometown.Starbucks' announcement followed CEO Brian Niccol's one-year anniversary at the helm of the company. Under his leadership, Starbucks is trying to reverse a sales slump in the U.S., its biggest market. Executives plan to share more details about the turnaround at the company's upcoming investor day in late January in New York. Wendy'sA Wendy's restaurant sign in Austin, Texas, Nov. 10, 2025.Brandon Bell | Getty Images News | Getty ImagesIn November, Wendy's announced that it would undergo a strategic review of its restaurant footprint and begin closing underperforming locations that quarter. While the company did not announce a specific number of closures, interim CEO and CFO Ken Cook told analysts that the company could shutter a \"mid-single digit percentage\" of its U.S. restaurants shuttering, which would mean hundreds of the burger chain's locations.The closures are one phase of Wendy's \"Project Fresh\" turnaround plan. The company has reported same-store sales declines even as rivals McDonald's and Burger King see higher demand for their Big Macs and Whoppers.In 2024, Wendy's shuttered about 140 locations.Denny'sA view of a Denny's restaurant in Hayward, California, Feb. 14, 2025.Justin Sullivan | Getty ImagesIn February, Denny's said it planned to close between 70 and 90 restaurants in 2025. In recent months, the diner chain's sales sunk as customers opted to visit cheaper fast-food restaurants for breakfast. The shift in behavior led the company to shutter underperforming locations and attempt to improve the rest of its restaurant footprint.In November, the chain announced it had sold itself for $620 million to Yadav Enterprises, TriArtisan Capital Advisors and Treville Capital Group. The deal is expected to close in the first quarter of 2026, pending regulatory approval.Jack in the BoxGeri Lavrov | Getty ImagesIn April, Jack in the Box said it would close between 150 and 200 restaurants as part of its \"Jack on Track\" strategy to improve its financial performance. By the end of its fiscal 2025 on Sept. 28, the chain had permanently shuttered 86 restaurants. Bahama BreezeIn May, Bahama Breeze parent company Darden Restaurants closed 15 of the chain's locations, which represents roughly a third of its overall footprint. Following the closures, executives decided that the Caribbean-inspired chain was not a strategic priority for Darden, so the company is exploring strategic alternatives for the brand. Options include selling the chain outright or converting its restaurants into other Darden brands, like Olive Garden. Darden expects to make a decision on Bahama Breeze by the end of its fiscal 2026, which concludes in May.Hardee'sDozens of Hardee's locations will close by end of the year after the franchisor sued ARC Burger, one of its largest franchisees. Hardee's alleges that the operator fell behind on payments like royalties, rent and taxes. ARC, which is owned by private equity firm High Bluff Capital Partners, operated 77 Hardee's restaurants before the legal battle began. Its footprint stretched across eight states, including Alabama, Florida, Georgia, Illinois, Missouri, Montana, South Carolina and Wyoming, according to legal filings.Papa John'sThe Papa John's Pizza logo is shown in Austin, Texas, May 9, 2024.Brandon Bell | Getty ImagesIn the first three quarters of 2025, Papa John's shuttered 173 restaurants worldwide, according to company filings. Most of the closures affected international locations, although 62 of the pizza chain's U.S. locations also closed.Despite the closures, Papa John's still had nearly 6,000 restaurants in operation at the end of September.Noodles & Co.Michael Siluk | UCG | Universal Images Group | Getty ImagesAt the end of October, Noodles & Co. had closed 29 company-owned restaurants this year, and executives said that they planned to shutter another two to five underperforming locations by the end of 2025. In 2024, the fast-casual chain closed 20 locations.By the end of 2026, Noodles & Co. is planning to close another 12 to 17 stores, as it aims to improve the company's financial performance and boost sales at the chain's nearby locations.Outback SteakhouseAn Outback Steakhouse restaurant in Daly City, California, Jan. 31, 2025.Justin Sullivan | Getty ImagesIn October, restaurant company Bloomin' Brands closed 21 locations across the company. The closures hit Outback Steakhouse, the gem of its portfolio, as well as Bonefish Grill and Carrabba's Italian Grill.Bloomin' has identified nearly two dozen other restaurants that will not renew their leases when they expire over the next four years, executives said in November when sharing the company's quarterly earnings. At the same time, the company announced a $75 million turnaround plan to improve Bloomin' sales and its overall financial health.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "These restaurant chains closed locations in 2025",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108235405-1764701051154-gettyimages-2249589986-anotherday155734029_n1sdrhf3.jpeg?v=1767114011&w=1920&h=1080"
      ],
      "datePublished": "2025-12-30T17:10:22.000Z",
      "dateModified": "2025-12-30T17:10:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Space and defense boom lifted these satellite stocks by more than 200% in 2025",
    "url": "https://www.cnbc.com/2025/12/31/space-and-defense-boom-lifted-these-satellite-stocks-by-200percent-in-2025.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107270740-1689196115326-vs3renderings-006-1920x1080.png?v=1689201485&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-31T13:19:08.000Z",
    "description": "Charlie ErgenKarl Gehring | Dever Post | Getty ImagesWall Street grew increasingly obsessed with the artificial intelligence boom this year, pouring m",
    "body": "Charlie ErgenKarl Gehring | Dever Post | Getty ImagesWall Street grew increasingly obsessed with the artificial intelligence boom this year, pouring money into chips, data centers and applications. But investors looking beyond Silicon Valley found outsized returns in another location: space. Some of the year's biggest market winners were defense companies that benefited from renewed interest in space exploration and military reindustrialization. President Donald Trump's military expansion plan includes a $175 billion \"Golden Dome\" project and efforts to bolster American shipbuilding.In looking to upgrade military tech and return astronauts to the moon for the first time in more than 50 years, the government is leaning on more companies outside of traditional defense names such as Lockheed Martin and Northrop Grumman. Recently appointed NASA Administrator Jared Isaacman told CNBC last week that Trump's recommitment to exploring the moon is key to unlocking the \"orbital economy.\"The space and defense boon has opened a range of opportunities for high-profile private companies, including Palmer Luckey's Anduril and Elon Musk's SpaceX, which is aiming to go public next year. SpaceX is the parent of satellite internet provider Starlink.Among companies currently on the public market, investors have snapped up satellite names, from legacy providers such as EchoStar to newer players like Planet Labs. They're among a handful of satellite stocks that have more than tripled in value this year. Planet LabsWill Marshall is the Co-Founder and CEO of Planet Labs Inc. with a model of the Dove satellite at their headquarters in downtown San Francisco, Calif., seen on Thursday September 8, 2016, where they create the shoe box size satellites that they send into space that gather photographs of earth.Michael Macor | Getty ImagesPlanet Labs, based in San Francisco, has seen its stock surge almost 400% this year due to booming demand for satellite imagery and space analytics. The company, which went public in 2021 through a special purpose acquisition company, is now valued at $6.2 billion.In its fiscal third-quarter earnings report this month, Planet Labs topped analyst estimates and lifted its guidance. During the period, Planet Labs more than tripled its backlog from a year ago. The company said that since the end of the quarter, it launched two of its Pelican satellites and 36 Earth-imaging SuperDove satellites. In 2025, Planet Labs signed new government and defense deals, including contracts with NATO and the European Space Agency. The company also renewed a partnership to provide Earth data to the U.S. Navy and won a $13.5 million task order for commercial satellite data with NASA.Planet Labs is working closely with Google on its Suncatcher project focused on AI and machine learning in space. The company is aiming to launch two prototype satellites equipped with Google's custom AI chips called tensor processing units, or TPUs, by early 2027. EchoStarwatch nowEchoStar, founded in 1980 by Charlie Ergen, creates networking, connectivity and satellite solutions under its Dish TV, Sling TV and Boost Mobile brands. Under pressure from regulators to build out a 5G network, the company was forced to sell wireless spectrum rights. In August, EchoStar struck a $23 billion deal to sell spectrum licenses to AT&T, and the following month sold $17 billion in spectrum rights to SpaceX to boost Starlink connectivity.Gwynne Shotwell, SpaceX's operating chief, said the deal would help the company \"end mobile dead zones\" globally and improve coverage for its customers. Cell tower companies Crown Castle and American Tower sued EchoStar following the spectrum deals, alleging the company is trying to exit its long-term agreements. On a call with analysts in November, EchoStar CEO Hamid Akhavan said the transactions would give the company the \"capital runway\" to expand its portfolio and business.\"The road map is not 100% laid out at the moment,\" he said. \"We'll try to take advantage of every opportunity in the best way.\"EchoStar shares have soared 377% this year, including a 49% rally since the start of December, sending the company's market capitalization past $31 billion. Earlier this month, the company got an upgrade from Morgan Stanley to buy from hold, with the firm citing value from the recent spectrum deals.  The biggest beneficiary of the stock pop has been the 72-year-old Ergen, who owns more than 143 million shares, mostly Class B, in the company. His net worth has jumped by $12.2 billion this year to $16.6 billion, according to Bloomberg.ViaSatViasat offices are shown at the company's headquarters in Carlsbad, California, on March 9, 2022.Mike Blake | ReutersViaSat shares have jumped 315% in 2025, as the company has expanded and scooped up more contracts.One of ViaSat's most significant achievements was the successful launch in November of its second of three ViaSAT-3 satellites, which will start servicing the Americas next year. The company has also landed major government deals, including a satellite contract with the U.S. Space Force, with a first launch planned for 2028.On the commercial side, ViaSat expanded partnerships with commercial airlines, including Etihad Airways, Aeromexico and Riyadh Air. The company competes directly with SpaceX's Starlink service, which is used by United Airlines, Air France and Qatar Airways.ViaSat drew attention this year from activist investor Carronade Capital and was upgraded to buy last month by JPMorgan Chase, which highlighted the potential breakup of its commercial and government businesses.Ondaswatch nowOndas, which makes autonomous drone technology, skyrocketed 251% this year.The Boston-based company says on its website that it owns 21 patents and is addressing a potential $130 billion market. Revenue in the third quarter jumped more more than sixfold to $10.1 million, and the company upped revenue guidance for the year to $36 million from $25 million. CEO Eric Brock cited \"a powerful demand cycle for our unmanned platforms\" as a growth catalyst. Ondas inked major deals this year for its Optimus drone system, including a $14.3 million purchase order from a major defense contractor and a more than $3 million deal with the United Arab Emirates. The system allows governments, public safety entities and emergency services to autonomously collect data in tough environments. Backlog in the latest quarter rose to $22.2 million driven by demand for its Optimus and Iron Drone products. Stifel initiated coverage with a buy rating this month, calling Ondas a potential leader in the unmanned systems sector. AstronicsAerospace and defense systems maker Astronics climbed 241% this year. The company provides charging and lighting solutions used by major commercial aircraft makers and airlines such as Boeing and Delta. Its products also support the U.S. Army and NASA.At the end of the third quarter, Astronics said its backlog totaled $646.7 million, with the aerospace segment accounting for $572.5 million. That represented a slight decline from a record backlog in the first quarter.In October, Astronics announced plans to buy Germany-based Bühler Motor Aviation. The deal is projected to add $22 million to revenue next year. A month prior, Astronics announced plans to sell $210 million in convertible notes. WATCH: SpaceX could be the first $500 billion IPOwatch nowCorrection: Eric Brock is CEO of Ondas. An earlier version misspelled his name. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Space and defense boom lifted these satellite stocks by more than 200% in 2025",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107270740-1689196115326-vs3renderings-006-1920x1080.png?v=1689201485&w=1920&h=1080"
      ],
      "datePublished": "2025-12-31T13:19:08.000Z",
      "dateModified": "2025-12-31T13:19:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Khanna calls for nationwide fraud investigation after wealth tax proposal caused firestorm",
    "url": "https://www.cnbc.com/2025/12/30/ro-khanna-calls-for-fraud-probe-after-california-wealth-tax-firestorm.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108246238-1767019623567-gettyimages-2250370126-khanna_441_120925.jpeg?v=1767019669&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-31T00:47:53.000Z",
    "description": "watch nowCalifornia Democrat Rep. Ro Khanna says he has a solution for Silicon Valley elites angered by his embrace of a wealth tax: Tackling fraud. O",
    "body": "watch nowCalifornia Democrat Rep. Ro Khanna says he has a solution for Silicon Valley elites angered by his embrace of a wealth tax: Tackling fraud. Over the weekend, Khanna came under fire from some donors and allies in the tech industry after he endorsed a wealth tax. Labor groups in California are trying to add a proposal for a statewide tax on billionaires to the November ballot, prompting some wealthy Californians to warn they will leave the state if it passes and support a primary challenger to Khanna in next year's elections. In an interview with CNBC, Khanna, who represents Silicon Valley, said he's launching a bipartisan effort from his post on the House Oversight and Government Reform Committee to root out state-level fraud to ensure the new tax windfall doesn't go to waste. The effort, he said, will make sure that funds go toward health care and other essential services.\"If you want, as I do, to advocate for Medicare for all, to advocate for higher taxes, you have to have the public trust,\" Khanna said. \"People need to have a receipt for what their money is going toward. You can't have corruption in the government and waste in the government and then expect people to support the progressive ideals that I have.\"Khanna said he will find someone on the other side of the aisle to work with on the issue, similar to his recent partnership with Rep. Thomas Massie, R-Ky., that compelled the release of files relating to notorious sex offender Jeffrey Epstein. Khanna said he hopes to commission a bipartisan Government Accountability Office report on state-level fraud and hold hearings on the issue. U.S. Representative Thomas Massie (R-KY), accompanied by U.S. Representatives Marjorie Taylor Greene (R-GA) and Ro Khanna (D-CA), speaks during a press conference on the Epstein Files Transparency Act ahead of a House vote on the release of files related to the late convicted sex offender Jeffrey Epstein, on Capitol Hill in Washington, D.C., U.S., November 18, 2025. Annabelle Gordon | ReutersKhanna's pitch comes after the California State Auditor released new reports that identified potential fraud in the state. Meanwhile, alleged fraud cases in Minnesota, some leading to indictments first handed down in 2022, have also seen renewed national attention from Republican lawmakers and the Trump administration. Many who criticized Khanna's endorsement of a wealth tax cited those instances of fraud as a reason that the tax won't work.\"If, after audits and zero based budgets, there are revenue gaps, I'd support a wealth tax,\" said Chamath Palihapitiya, a prominent tech investor and Trump supporter, in a post to X. \"Until then, you and your ilk are just getting more incentives for fraud, voter manipulation and larceny.\"Khanna noted that his new oversight effort is in response to \"feedback from constituents in my district and leaders\" over his embrace of a wealth tax. He added that the investigation will cover more than just the fraud uncovered in California and Minnesota, and that finding a Republican partner will prevent the investigation from becoming a partisan affair. \"It's not going to be a blue state or a red state thing,\" Khanna said. \"Obviously, there have been the reports in Minnesota and California, but it's beyond that. We need to look at state government and making not just an issue against blue states, but to expose where this fraud is happening and what we can do about it.\" California and Minnesota are both run by Democratic governors. Minnesota Gov. Tim Walz, the former Democratic vice presidential candidate, is up for reelection in 2026. House Oversight Committee Chair James Comer, R-Ky., has called on Minnesota officials to testify before his committee.Read more CNBC politics coverageEuropean Union approves over $105 billion toward Ukraine aid package for next two yearsBrown and MIT prof shooter suspect Neves Valente is found dead, authorities saysTrump Media to merge with fusion company TAE Technologies, DJT stock soarsTrump announces 'warrior dividend' of $1,776 to U.S. soldiers in prime-time speechEpstein accomplice Ghislaine Maxwell petitions to vacate sex crime convictionCongressional stock trading ban bill to get a vote in new year: House RepublicansFBI Deputy Director Dan Bongino is stepping down in JanuaryObamacare subsidies extension to get vote after 4 Republicans buck leadershipFCC chief Carr tells Senate that his agency is 'not formally ... independent'Trump vowed to block tankers carrying Venezuela's oil — nearly a dozen at sea nowKennedy Center to be renamed 'Trump-Kennedy Center,' White House saysTrump vowed to block tankers carrying Venezuela's oil — nearly a dozen at sea nowHouse passes bill to ease permits for building out AI infrastructureTrump sues BBC for $10 billion, claims defamation from Panorama documentaryPentagon takes big stake in new Korea Zinc refinery in Tenn., gets 10% of companyNew Trump tariffs collection hits $200 billion, Customs saysFormer Instacart employee says she was fired over her Democratic congressional campaignUkraine peace talks progressing, Russia open to EU membership, U.S. officials sayNew York AG sues UPS for allegedly shorting Christmas season workers' wagesTrump admin to hire 1,000 specialists for 'Tech Force'Trump doubles down on Rob Reiner criticism after killing; director's son in custodyTSA is giving airline passenger data to ICE for deportation push: NYTTrump's AI order may be 'illegal,' Democrats and consumer advocacy groups claimTrump sued by preservation group seeking to halt White House ballroom projectTrump says 'no big deal' after new Epstein photos showing him releasedPutin can fund war for years, ex-official says as Trump's resolve is testedIndiana redistricting bill that Trump demanded defeated in state SenateHouse passes INVEST Act to ease investment standards, boost capital in marketsDOJ fails again to indict New York AG James, a Trump target: ReportsTrump 'sells out' U.S. national security with Nvidia chip sales to China: WarrenTrump pushes for top prosecutor nominee Halligan after Comey, James cases tossedTrump willing to seize more oil tankers off Venezuela coast: White HouseSeized tanker will go to U.S. port, Trump admin intends 'to seize the oil'GOP lawmakers seek Trump aid for agricultural equipment after tariff pressureTrump says Fed could have 'at least doubled' latest interest rate cut'Spoof' ship: Seized oil tanker hid location, visited Iran and VenezuelaTrump admin touts pulling 9,500 truckers off road for failing English testsSwiss government says new 15% U.S. tariff ceiling retroactive to mid-NovemberHomeland Security Dept. buying Boeing 737s for ICE deportationsTrump officials move to end student loan payment pause for millions of borrowersJudge unseals Ghislaine Maxwell grand jury materials, citing Epstein files actUkraine at 'critical moment' in war as European allies ramp up pressure on RussiaDemocrats establish AI working group as industry bolsters DC presenceEx-Trump lawyer Habba resigns as NJ U.S. attorney after disqualificationThe California wealth tax proposal, known as the 2026 Billionaire Tax Act, would levy a one-time 5% tax on the assets of the state's billionaires to shore up an expected shortfall in the state's health-care budget. The Service Employees International Union-United Healthcare Workers West labor union is pushing the measure.The measure still needs to garner enough signatures to qualify for the ballot. If it does, it would be up to California voters to decide on installing the new tax. Tech leaders opposing the proposal are concerned the tax would apply to unrealized gains, meaning startup founders with a net worth of more than $1 billion based on the paper value of their private stock would be on the hook despite their wealth being illiquid. Khanna acknowledged those concerns in the interview, saying he supports a wealth tax to pay for health care in California and federally, but with the caveat that there are \"workarounds for stock that is restricted with illiquid founders who have companies that are not profitable.\"\"You can do it in a way that doesn't hurt the startup paper billionaires with restricted stock,\" he said. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Khanna calls for nationwide fraud investigation after wealth tax proposal caused firestorm",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108246238-1767019623567-gettyimages-2250370126-khanna_441_120925.jpeg?v=1767019669&w=1920&h=1080"
      ],
      "datePublished": "2025-12-31T00:47:53.000Z",
      "dateModified": "2025-12-31T00:47:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]