[
  {
    "title": "Asia tech stocks rally as Nvidia earnings soothe AI slowdown fears",
    "url": "https://www.cnbc.com/2026/02/26/asia-tech-stocks-nvidia-earnings-jensen-huang-chips-gpu.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108261289-1770213753617-gettyimages-2259795429-img_8098.jpeg?v=1770213783&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-26T02:03:58.000Z",
    "description": "Cheng Xin | Getty Images News | Getty ImagesAsian tech stocks rallied in early trading on Thursday as stronger-than-expected results from Nvidia eased",
    "body": "Cheng Xin | Getty Images News | Getty ImagesAsian tech stocks rallied in early trading on Thursday as stronger-than-expected results from Nvidia eased concerns that momentum in artificial intelligence sector was cooling.Shares of South Korean chipmaking giants Samsung Electronics and SK Hynix jumped in early trade.SK Hynix, which is a key supplier of high-bandwidth memory used in AI applications to Nvidia, rose over 2%. Samsung Electronics, which has been a decades-old partner of Nvidia, was up about 5%.\"This is a positive read through for many of the Asia supply chain players including SK Hynix, Samsung, and many others given the explosion of data center demand,\" said Dan Ives,  senior equity research analyst at Wedbush Securities.Other South Korean tech stocks also rose, with components manufacturer LG Innotek surging almost 14%, while Seoul Semiconductor soared 13%.In Japan, the TOPIX Information & Communication index climbed 2.6%, building on previous day's 0.58% gain. Software firm Trend Micro jumped 5.95%, while Sony Group rose over 3.86%. SoftBank Group added 5%. Andrew Jackson, head of Japanese equity strategy at ORTUS Advisors, said that flows will continue to favor AI-linked names, suggesting potential upside for Japanese gallium nitride and silicon carbide plays such as Fuji Electric, as investors position for sustained data-center buildouts. The company's shares were up 1.7%.Nvidia reported that revenue for its fiscal fourth quarter climbed 73% to $68.13 billion from a year earlier, beating analysts' estimates for $66.21 billion. The company now gets over 91% of sales from its data center unit, which houses its market-leading artificial intelligence chips.Dan Niles, portfolio manager at Niles Investment Management, said the current setup still favors semiconductor infrastructure names over software, noting Nvidia remains \"really the king of the infrastructure for all of this.Japanese chip firms Advantest and Renesas, however, were 2.35% and 1.75% lower, respectively.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Asia tech stocks rally as Nvidia earnings soothe AI slowdown fears",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108261289-1770213753617-gettyimages-2259795429-img_8098.jpeg?v=1770213783&w=1920&h=1080"
      ],
      "datePublished": "2026-02-26T02:03:58.000Z",
      "dateModified": "2026-02-26T02:03:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jeep maker Stellantis posts first annual loss in company history after EV writedowns",
    "url": "https://www.cnbc.com/2026/02/26/stellantis-earnings-full-year-2025-autos-evs.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108270266-1772088618772-gettyimages-2248153735-jl1_9045_fyww0jkj.jpeg?v=1772088702&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-26T08:24:15.000Z",
    "description": "Antonio Filosa attends the presentation of the new Fiat 500 Hybrid at the Stellantis FIAT Mirafiori plant in Turin, Italy, on November 25, 2025.Nurpho",
    "body": "Antonio Filosa attends the presentation of the new Fiat 500 Hybrid at the Stellantis FIAT Mirafiori plant in Turin, Italy, on November 25, 2025.Nurphoto | Nurphoto | Getty ImagesAuto giant Stellantis on Thursday reported its first-ever annual loss after posting substantial charges amid a major strategic shift.The multinational conglomerate, which owns household names including Jeep, Dodge, Fiat, Chrysler and Peugeot, posted a full-year 2025 net loss of 22.3 billion euros ($26.3 billion), compared to full-year profit of 5.5 billion euros a year ago.The net loss was impacted by 25.4 billion euros in write-downs from last year, Stellantis said, as the firm scales back its electric vehicle strategy. The company said it had suspended its dividend for 2026, as it had previously flagged, and issued up to 5 billion euros of hybrid bonds. It also reiterated its 2026 forecasts, including a mid-single-digit percentage increase in net revenues and a low-single-digit adjusted operating margin.\"Our 2025 full year results reflect the cost of over-estimating the pace of the energy transition and of the need to reset our business around our customers' freedom to choose from the full range of electric, hybrid and internal combustion technologies,\" Stellantis CEO Antonio Filosa said in a statement. \"In 2026 our focus will be on continuing to close the execution gaps of the past, adding further momentum to our return to profitable growth,\" he added.Milan-listed shares of Stellantis rose 0.2% shortly after Thursday's opening bell. The stock is down more than 31% so far this year.Stock Chart IconStock chart iconStellantis' Milan listed shares year-to-date.Other earnings highlights:Adjusted operating loss of 842 million euros in 2025, compared to an adjusted operating income of 8.65 billion euros in 2024.Estimates net tariff expenses of 1.6 billion euros in 2026. Stellantis said it expects positive industrial free cash flow in 2027.Over the second half of 2025, Stellantis it delivered a \"solid\" performance, noting consolidated shipments came in at 2.8 million units, with North America posting the strongest contribution. Net revenues rose 10% to 79.25 billion euros through the latter half of 2025 when compared to the same period a year ago. These results reflect the initial impact of improved operational efficiencies, disciplined commercial strategies and the strength of the firm's global brand portfolio, Stellantis said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jeep maker Stellantis posts first annual loss in company history after EV writedowns",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108270266-1772088618772-gettyimages-2248153735-jl1_9045_fyww0jkj.jpeg?v=1772088702&w=1920&h=1080"
      ],
      "datePublished": "2026-02-26T08:24:15.000Z",
      "dateModified": "2026-02-26T08:24:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Register now: Applications open for the World's Top Fintech Companies 2026",
    "url": "https://www.cnbc.com/2026/02/25/cnbc-worlds-top-fintech-companies-2026-apply-now.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108264308-1770808330529-gettyimages-1328699091-single_mom_0119.jpeg?v=1770808359&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-24T23:08:25.000Z",
    "description": "A person using a laptop and mobile phone. Tom Werner | Digitalvision | Getty ImagesApplications are now open for the fourth edition of CNBC's World's ",
    "body": "A person using a laptop and mobile phone. Tom Werner | Digitalvision | Getty ImagesApplications are now open for the fourth edition of CNBC's World's Top Fintech Companies list, produced in partnership with market research firm Statista.Each year, CNBC and Statista chart the top fintech players from around the world, ranging from startups to Big Tech names, across segments including payments, wealth technology, insurance and more. Last year's iteration included heavyweights such as Mastercard, Stripe and Visa, as well as many newer scaleups. Credit rewards company Bilt, payments upstart TerraPay and insurance platform Entsia made their debuts on the list. The World's Top Fintech Companies has been expanded this year, with regulation tech — companies helping others meet their financial regulatory obligations — becoming its own segment.Over the years, fintech has progressed from a high-growth challenger segment to a core part of the global financial system, helped by a Covid-fueled race to digitize. Artificial intelligence has spurred the sector further, and has been tipped as a source of transformative change.The global fintech market attracted $44.7 billion in investment across over 2,200 deals in the first half of 2025, according to the most recent report by KPMG, although this was lower than the $54.2 billion investment seen over the six months prior.How to applyCompanies can submit their information for consideration by clicking here. Developing innovative, technology-based financial products and services should be the core business of nominees. The form, hosted by Statista, includes questions about a company's business model and certain key performance indicators, including revenue growth and employee headcount. You can read more about the research project and methodology here.The deadline for submissions is April 24, 2026.For questions about the list or assistance with the form, please email Statista: topfintechs@statista.com.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Register now: Applications open for the World's Top Fintech Companies 2026",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108264308-1770808330529-gettyimages-1328699091-single_mom_0119.jpeg?v=1770808359&w=1920&h=1080"
      ],
      "datePublished": "2026-02-24T23:08:25.000Z",
      "dateModified": "2026-02-24T23:08:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rolls-Royce jumps 6% after aerospace giant boosts profit outlook",
    "url": "https://www.cnbc.com/2026/02/26/rolls-royce-stock-sees-profits-hitting-4-billion-this-year-as-robust-growth-continues.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108138128-1745944380475-gettyimages-2206315588-FRANCE_SAFRAN.jpeg?v=1745944398&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-26T08:07:54.000Z",
    "description": "Rolls-Royce said Thursday it expects profits of over £4 billion ($5.42 billion) this year as the aero engine and power systems maker banks on another ",
    "body": "Rolls-Royce said Thursday it expects profits of over £4 billion ($5.42 billion) this year as the aero engine and power systems maker banks on another year of robust growth. The aerospace giant is targeting underlying operating profit of between £4 billion and £4.2 billion in 2026, above the midpoint of £3.65 billion as expected by analysts polled by FactSet. It expects free cash flow of between £3.6 billion and £3.8 billion this year, also above expectations. Shares rose 5.8% in morning trading Thursday.Based on the bullish outlook, the company now expects to deliver profits within the prior mid-term guidance range two years earlier than planned, CEO Tufan Erginbilgic said. \"Our transformation continues with pace and intensity,\" he said in a statement. The British company upgraded its 2028 targets to £4.9 billion to £5.2 billion in underlying operating profit, an operating margin in the range of 18% to 20%, and free cash flow of £5 billion to £5.3 billion. Rolls-Royce shares have more than doubled over the past 12 months as the company has thrived amid a transformation plan launched by Erginbilgic, which has boosted investor confidence.Stock Chart IconStock chart iconRolls-Royce shares are up more than 100% over the past year.In 2025, underlying operating profits jumped over 40% to £3.46 billion, beating FactSet estimates of £3.32 billion. Underlying revenue in the year rose 12% to £20.1 billion.It also announced that £2.5 billion of share buybacks would be completed this year as part of a multi-year buyback program of between £7 billion and £9 billion, citing a strong balance sheet.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rolls-Royce jumps 6% after aerospace giant boosts profit outlook",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108138128-1745944380475-gettyimages-2206315588-FRANCE_SAFRAN.jpeg?v=1745944398&w=1920&h=1080"
      ],
      "datePublished": "2026-02-26T08:07:54.000Z",
      "dateModified": "2026-02-26T08:07:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Epstein files: Larry Summers to resign as Harvard professor as fallout continues",
    "url": "https://www.cnbc.com/2026/02/25/epstein-larry-summers-harvard-professor.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108265773-1771010194640-gettyimages-2224348212-_d1_4487_mx0crs6e.jpeg?v=1772037678&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-25T22:20:27.000Z",
    "description": "Former Treasury Secretary and president emeritus and professor at Harvard University, Larry Summers attends the Allen & Company Sun Valley Conference ",
    "body": "Former Treasury Secretary and president emeritus and professor at Harvard University, Larry Summers attends the Allen & Company Sun Valley Conference on July 9, 2025 in Sun Valley, Idaho.Kevin Dietsch | Getty ImagesLarry Summers, the former U.S. Treasury secretary who has been dogged by his past friendship with Jeffrey Epstein, announced Wednesday that he will resign from teaching at Harvard University by the end of the current academic year.Summers previously served as president of Harvard. His resignation came as the university was conducting a review of emails and other documents detailing Summers' connection to Epstein, which were released in recent months by the Department of Justice and Congress.\"I have made the difficult decision to retire from my Harvard professorship at the end of this academic year,\" Summers said in a statement obtained by CNBC. \"I will always be grateful to the thousands of students and colleagues I have been privileged to teach and work with since coming to Harvard as a graduate student 50 years ago.\"\"Free of formal responsibility, as President Emeritus and a retired professor, I look forward in time to engaging in research, analysis, and commentary on a range of global economic issues,\" he said.Summers, who went on leave from Harvard in November because of fallout from those emails, has not been accused of wrongdoing in connection with Epstein. He will not teach or take on new advisees until his retirement is effective.\"In connection with the ongoing review by the University of documents related to Jeffrey Epstein that were recently released by the government, Harvard Kennedy School Dean Jeremy Weinstein has accepted Professor Lawrence H. Summers' resignation from his leadership position as co-director of the Mossavar-Rahmani Center for Business and Government,\" Harvard spokesman Jason Newton told CNBC in a statement Wednesday. \"Professor Summers has announced that he will retire from his academic and faculty appointments at Harvard at the end of this academic year and will remain on leave until that time,\" Newton said.Read more CNBC politics coverageState of the Union 2026 recap: Trump touted economic gainsEpstein files: Trump sexual abuse claims withheld by DOJSenators tell CFTC prediction market contracts need clear guidanceDemocrats seek to force refunds after Supreme Court blocks Trump tariffsTrump demands Netflix fire Susan Rice as DOJ probes Warner dealIn November, when he went on leave from Harvard and resigned from the board of the artificial intelligence company OpenAI, Summers said: \"I am deeply ashamed of my actions and recognize the pain they have caused. I take full responsibility for my misguided decision to continue communicating with Mr. Epstein.\"His statement then came after reports by the Harvard student newspaper, The Crimson, which detailed how Summers had sought guidance from Epstein while pursuing a romantic relationship with a woman.On Tuesday, the Nobel Prize-winning scientist Richard Axel said he would step down as co-director of Columbia University's Zuckerman Mind Brain Behavior Institute in light of his own communications with Epstein drawing attention.A third Ivy League school, Yale University, on Feb. 11 said it had barred professor David Gelernter from teaching computer science classes pending a review of his contacts with Epstein, which included mentioning a Yale student for a potential project.Other high-profile people recently have suffered professional and legal fallout from their connections to Epstein being detailed in the DOJ's documents database.Epstein killed himself in a New York City federal jail in 2019, weeks after his arrest on child sex trafficking charges.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Epstein files: Larry Summers to resign as Harvard professor as fallout continues",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108265773-1771010194640-gettyimages-2224348212-_d1_4487_mx0crs6e.jpeg?v=1772037678&w=1920&h=1080"
      ],
      "datePublished": "2026-02-25T22:20:27.000Z",
      "dateModified": "2026-02-25T22:20:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Big Tech companies to meet Trump at White House to sign pledge on data center power costs",
    "url": "https://www.cnbc.com/2026/02/25/trump-tech-ai-data-center-electricity-price-pledge.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108243763-17660841752025-12-18t185041z_661515781_rc26jialkgr4_rtrmadp_0_usa-trump.jpeg?v=1766084220&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-25T20:29:54.000Z",
    "description": "watch nowThe major technology companies will meet President Donald Trump at the White House next week to sign a pledge that they will supply their own",
    "body": "watch nowThe major technology companies will meet President Donald Trump at the White House next week to sign a pledge that they will supply their own power for artificial intelligence data centers. Amazon, Google, Meta, Microsoft, xAI, Oracle and OpenAI will sign the agreement at the March 4 meeting, a White House official confirmed to CNBC Wednesday.\"Under this bold initiative, these massive companies will build, bring, or buy their own power supply for new AI data centers, ensuring that Americans' electricity bills will not increase as demand grows,\" White House spokeswoman Taylor Rogers told CNBC. Fox News first reported the development. Trump said during his State of the Union address Tuesday that he had secured such a pledge from the tech sector, but did not provide detail on what the agreement entails. \"We're telling the major tech companies that they have the obligation to provide for their own power needs,\" the president said. \"They can build their own power plants as part of their factory so that no one's prices will go up.\"Data centers are facing opposition in communities across the U.S. as people blame rising utility bills on the facilities' huge electricity consumption.The Trump administration has closely embraced the AI industry as an engine of economic growth and a pillar of U.S. national security. It is an alliance that poses political risks for the White House ahead of the midterm elections. New Jersey Gov. Mikie Sherrill and Virginia Gov. Abigail Spanberger defeated their Republican opponents in landslide elections last November by campaigning against rising electricity prices.The Trump administration has warned the tech companies that they risk a backlash if the public believes their data centers are driving up energy costs, Energy Secretary Chris Wright said Wednesday. \"We want to see data centers developed,\" Wright told reporters on a call. \"We want to see them rapidly sited. We want to see communities welcoming them, but to do that, it's necessary to have up-front investments in the additional grid infrastructure needed.\" ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Big Tech companies to meet Trump at White House to sign pledge on data center power costs",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108243763-17660841752025-12-18t185041z_661515781_rc26jialkgr4_rtrmadp_0_usa-trump.jpeg?v=1766084220&w=1920&h=1080"
      ],
      "datePublished": "2026-02-25T20:29:54.000Z",
      "dateModified": "2026-02-25T20:29:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Netflix CEO Ted Sarandos to visit White House for talks on WBD deal, report says",
    "url": "https://www.cnbc.com/2026/02/25/netflix-sarandos-white-house-wbd-paramount-deal-trump-rice.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108208419-17597793142025-05-30t184543z_1471822754_rc2isea4fqlv_rtrmadp_0_people-ricky-gervais-star.jpeg?v=1766185428&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-25T20:38:38.000Z",
    "description": "Netflix CEO Ted Sarandos speaks during comedian Ricky Gervais's star unveiling ceremony on the Hollywood Walk of Fame in Los Angeles, U.S., May 30, 20",
    "body": "Netflix CEO Ted Sarandos speaks during comedian Ricky Gervais's star unveiling ceremony on the Hollywood Walk of Fame in Los Angeles, U.S., May 30, 2025.Mario Anzuoni | ReutersNetflix CEO Ted Sarandos will head to the White House on Thursday for meetings on his company's efforts to acquire part of Warner Bros. Discovery as Paramount ratchets up its rival bid, Politico reported Wednesday.The reported visit is set to occur five days after President Donald Trump demanded that Netflix immediately fire former Obama administration official Susan Rice from its board, or else \"pay the consequences.\"It was not immediately clear if Sarandos would be meeting with Trump during the visit, a person familiar with the discussions told Politico.Netflix declined CNBC's request for comment on the report. The White House, asked by CNBC to confirm the visit, said, \"We do not discuss private meetings that may or may not be happening.\"The acquisition fight over WBD, like numerous other business deals in over the past year, has been entangled with presidential politics.Trump had weeks earlier said he would stay out of the multibillion-dollar bidding war between Netflix, which wants to buy WBD's studio and streaming brands, and Paramount, which seeks to acquire WBD's whole business.But Trump appeared to change course when, in a Truth Social post on Saturday afternoon, he demanded that Netflix fire Rice from its board, calling her \"racist\" and a \"political hack.\"Trump on Truth Social linked to an X post from Laura Loomer, a far-right media figure in Trump's orbit, slamming Rice and urging the president to \"kill the Netflix-Warner Bros. merger now.\"Loomer's post highlighted a recent podcast appearance in which Rice, who has served in the Obama, Clinton and Biden administrations, predicted that corporations and other institutions that appeased Trump will be held \"accountable\" when his political opposition regains power.Read more CNBC politics coverageState of the Union 2026 recap: Trump touted economic gainsEpstein files: Trump sexual abuse claims withheld by DOJSenators tell CFTC prediction market contracts need clear guidanceDemocrats seek to force refunds after Supreme Court blocks Trump tariffsTrump demands Netflix fire Susan Rice as DOJ probes Warner dealThe WBD deal proposals have raised antitrust concerns. The Department of Justice is investigating whether Netflix's proposed deal could hurt competition.Other dynamics have fueled speculation that politics are part of the acquisition fight. Paramount Skydance CEO David Ellison is the son of Oracle founder Larry Ellison, one of the world's richest men and a Republican megadonor.David Ellison was a guest of Sen. Lindsey Graham, R-S.C., a Trump loyalist, at the president's State of the Union address on Tuesday night.Paramount most recently raised its bid for Warner Bros. to an all-cash $31 per share, which could \"reasonably be expected\" to top Netflix's offer, WBD said Tuesday.This is developing news. Please check back for updates.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Netflix CEO Ted Sarandos to visit White House for talks on WBD deal, report says",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108208419-17597793142025-05-30t184543z_1471822754_rc2isea4fqlv_rtrmadp_0_people-ricky-gervais-star.jpeg?v=1766185428&w=1920&h=1080"
      ],
      "datePublished": "2026-02-25T20:38:38.000Z",
      "dateModified": "2026-02-25T20:38:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Japan's Nikkei 225 crosses 59,000 first the first time as central bank board picks fuel 'Takaichi trade' ",
    "url": "https://www.cnbc.com/2026/02/26/asia-pacific-markets-nvidia-kospi-nikkei-225-hang-seng-index.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108253395-1768535693910-gettyimages-2251993457-JAPAN_BOJ.jpeg?v=1768535709&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-26T02:46:59.000Z",
    "description": "South Korea's central bank raised its key interest rate by a quarter-percentage point as expected on Thursday, in a bid to contain inflation and preve",
    "body": "South Korea's central bank raised its key interest rate by a quarter-percentage point as expected on Thursday, in a bid to contain inflation and prevent capital outflows as the U.S. Federal Reserve gears up for more hikes.Jung Yeon-je | Afp | Getty ImagesJapan's Nikkei 225 hit another record Thursday fueled by \"Takaichi trade,\" while the broader Asia-Pacific markets mostly climbed after tech stocks powered a Wall Street rally overnight.The Nikkei 225 rose 1.1%, to an all-time high of 59,199.31, extending its winning streak of record highs to a third straight session. The broader Topix added 1.45%, also scaling a new peak. On Wednesday, the Japanese government tapped Ayano Sato of Aoyama Gakuin University and Toichiro Asada of Chuo University as central bank board members, both dovish in their policy stance which aligns with Prime Minister Sanae Takaichi's approach as well. The two will succeed outgoing central bank board members Asahi Noguchi and Junko Nakagawa, whose terms expire at the end of March and in June, respectively.Japanese equities have scaled multiple record highs recently, buoyed by the so-called \"Takaichi trade,\" as investors bet that the prime minister's growth-oriented policies — viewed as an extension of Abenomics — will lift stocks while pressuring the yen through looser monetary policy and increased fiscal spending.South Korea's Kospi rose 1.65%, while the small-cap Kosdaq advanced 0.57%.Australia's S&P/ASX 200 gained 0.8%, also hitting a record high in early trade.Hong Kong Hang Seng index fell 0.62%, while the CSI 300 lost 0.2%.The Bank of Korea left its base rate unchanged at 2.5%, in line with Reuters' expectations.Asian tech stocks rallied as stronger-than-expected results from Nvidia eased concerns that momentum in artificial intelligence sector was cooling.Shares of South Korean chipmaking giants Samsung Electronics and SK Hynix jumped in early trade.SK Hynix, which is a key supplier of high-bandwidth memory used in AI applications to Nvidia, rose over 2%. Samsung Electronics, which has been a decades-old partner of Nvidia, was up about 5%.Other South Korean tech stocks also rose, with components manufacturer LG Innotek surging almost 14%, while Seoul Semiconductor soared 13%. In Japan, the TOPIX Information & Communication index climbed 2.6%, building on previous day's 0.58% gain. Overnight in the U.S., equities rose, supported by Nvidia and Oracle, as stocks built on the gains from the prior trading day.The S&P 500 added 0.81% to close at 6,946.13, and the Nasdaq Composite advanced 1.26% to 23,152.08. The Dow Jones Industrial Average rose 307.65 points, or 0.63%, to settle at 49,482.15.Nvidia posted fiscal fourth-quarter results that topped Wall Street expectations, fueled by a 75% surge in revenue from its core data center segment. Shares gained as much as 2% in extended trading following the release.The company reported adjusted earnings per share of $1.62, beating the $1.53 forecast from analysts surveyed by LSEG. Revenue totaled $68.13 billion, above estimates of $66.21 billion.—CNBC's Sean Conlon and Pia Singh contributed to this report.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Japan's Nikkei 225 crosses 59,000 first the first time as central bank board picks fuel 'Takaichi trade' ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108253395-1768535693910-gettyimages-2251993457-JAPAN_BOJ.jpeg?v=1768535709&w=1920&h=1080"
      ],
      "datePublished": "2026-02-26T02:46:59.000Z",
      "dateModified": "2026-02-26T02:46:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "China holiday spending sends a strong signal on consumer stimulus plans",
    "url": "https://www.cnbc.com/2026/02/26/china-lunar-new-year-holiday-spending-signal-consumer-stimulus-outlook.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108269508-1771980797013-gettyimages-2262398525-cfoto-chinesec260222_npei2.jpeg?v=1771983418&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-26T04:26:21.000Z",
    "description": "People watch performances to welcome the 'God of Wealth' during Lunar New Year festivities at Qianmen Street in Beijing, China, on February 21, 2026.N",
    "body": "People watch performances to welcome the 'God of Wealth' during Lunar New Year festivities at Qianmen Street in Beijing, China, on February 21, 2026.Nurphoto | Nurphoto | Getty ImagesBEIJING — China's consumer market is recovering — just enough that policymakers likely won't need to roll out the large-scale stimulus that investors have long hoped for.The nine-day Lunar New Year, which ended Monday, saw a steady rise in spending across the country, from hotel bookings to duty-free shopping. Rail travel hit a record of over 18.7 million passengers in a single day.The better-than-expected data suggest that Beijing's recent support measures are effective, while underscoring a broader consumer trend: spending on experiences such as travel and entertainment is still picking up faster than traditional goods, CCB International Securities said in a report Tuesday.China's retail sales have remained sluggish since the pandemic. Unlike the U.S., which handed out cash to consumers, Beijing has instead offered trade-in programs and vouchers. Chinese authorities have increasingly emphasized the need to boost consumers' incomes, but have yet to release details. That's not likely to change soon.watch now\"Policymakers are likely to build on the positive [holiday] momentum and introduce targeted, incremental easing around the March Two Sessions to stabilize expectations and sustain the recovery,\" the CCB analysts said, referring to the annual parliamentary meetings that kicks off next week.Chinese Premier Li Qiang is set to announce the year's economic targets and policy priorities on March 5.Still price-consciousDespite the travel rebound, consumers remained price sensitive. Nationwide, tourism trips per day grew by 5.7% on average from a year ago, in line with 2025, according to official holiday figures released late Tuesday. Even though spending climbed by 5.5%, it slowed from 7% in 2025.\"Such trends reflect better sentiment from a longer holiday, but consumers remained budget cautious in general,\" Morgan Stanley Equity Analyst Lillian Lou said in a report Wednesday.In a sign of persistent deflationary pressure, the holiday recorded a 0.2% drop in average spend per tourist trip compared with a year ago, according to CNBC's analysis of official data.To boost consumer spending, China extended the official holiday period by one day compared with last year. Many people also took personal leave around the holiday, suggesting the official figures may not capture the entire spending picture. \"The extended holiday encouraged families to travel together,\" Jihong He, chief strategy officer at H World Group, one of China's largest hotel operators, said in a statement.\"That shift is driving demand for larger rooms and family-friendly configurations designed for shared experiences,\" He said.\n\t\t\n\t\t\n\t\t\n\t\t\tWeekly analysis and insights from Asia's largest economy in your inbox\n\t\t\tSubscribe now\n\t\t\n\tH World operates more than 12,000 hotels across over 30 brands in mainland China. For the Lunar New Year, the company said the top 10 destinations, with hotel occupancy rates of 90% or higher, were all located in southern or coastal cities, including Sanya in the tropical island province of Hainan.China in December expanded a zero-tariff policy for the island to encourage duty-free luxury goods purchases within the mainland. Official figures showed Hainan's holiday-period duty-free sales rose 30.8% from a year ago to 2.72 billion yuan ($400 million).Alibaba-owned travel booking platform Fliggy said bookings for hotel and theme park packages during the holiday season more than doubled from last year. More remote, scenic destinations such as Altay in Xinjiang and Pu'er in Yunnan also saw bookings more than double, the company said.Government supportChina has sought to promote its growing services sector. This month, the National Bureau of Statistics disclosed that it was giving more weight to services in its consumer price index than in the previous base period in 2020.Even consumer goods in China are increasingly oriented towards dining and social activities, Bruce Pang, adjunct associate professor at CUHK Business School, said in Chinese remarks translated by CNBC. The key to consumption recovery is confidence in income and employment prospects, he said, rather than shopping promotions. Policymakers should place greater emphasis on those long-term issues, Pang added.In the fall, China's top leaders pledged to boost consumption over the next five years, and have subsequently said the country will prioritize domestic demand.Local governments in China issued more than 2.05 billion yuan in consumption vouchers and subsidies ahead of the holiday, CCB analysts said, \"effectively putting a floor under demand.\"However, prioritizing consumption does not necessarily signal sweeping stimulus, said Liqian Ren, director of Modern Alpha at U.S.-based fund manager WisdomTree. Instead, Beijing appears focused on preventing consumption growth from slipping below a certain level, Ren noted, indicating sector growth of roughly 2% to 3%. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "China holiday spending sends a strong signal on consumer stimulus plans",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108269508-1771980797013-gettyimages-2262398525-cfoto-chinesec260222_npei2.jpeg?v=1771983418&w=1920&h=1080"
      ],
      "datePublished": "2026-02-26T04:26:21.000Z",
      "dateModified": "2026-02-26T04:26:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Thrive Capital invested about $1 billion in OpenAI at a $285 billion valuation, source says",
    "url": "https://www.cnbc.com/2026/02/25/thrive-capital-openai-joshua-kushner.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108236133-17647882242025-11-06t201852z_653951074_rc2umcacl8qk_rtrmadp_0_openai-outlook.jpeg?v=1765924912&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-25T19:56:41.000Z",
    "description": "OpenAI CEO Sam Altman attends an event to pitch AI for businesses in Tokyo, Feb. 3, 2025.Kim Kyung-hoon | ReutersJoshua Kushner's Thrive Capital inves",
    "body": "OpenAI CEO Sam Altman attends an event to pitch AI for businesses in Tokyo, Feb. 3, 2025.Kim Kyung-hoon | ReutersJoshua Kushner's Thrive Capital invested roughly $1 billion in OpenAI at a $285 billion valuation in December, a source confirmed Wednesday.It is a preferential deal for the venture capital firm that has long been one of the artificial intelligence startup's major financial backers. OpenAI is finalizing a massive funding round that could total more than $100 billion and boost the company's valuation to $800 billion. Thrive's investment late last year was a separate deal, but the firm is likely to participate in the current round, according to the source, who is familiar with the discussions and asked not to be named because the talks are confidential.A representative for Thrive declined to comment. The Wall Street Journal was first to report Thrive's investment. Read more CNBC tech newsFirst look at Nvidia's new AI system Vera Rubin is 10 times more efficient than its predecessorSamsung's S26 gives an advance look at what the Google-powered Apple Siri could doThrive Capital invested about $1 billion in OpenAI at a $285 billion valuation, source saysHead of Amazon's AGI lab is leaving the companyThrive announced earlier this month that it closed its latest fund, which exceeds $10 billion. OpenAI CEO Sam Altman, who has a close relationship with Kushner, lauded the news in a post on X. \"Extremely grateful to work with Josh,\" Altman wrote. \"No one could ask for a more committed, more thoughtful, or harder-working investor.\"Kushner has deep connections with the White House as his father, Charles Kushner, is the U.S. ambassador to France, and his brother, Jared Kushner, is President Donald Trump's son-in-law.In December, OpenAI also took an ownership stake in Thrive Holdings, a company that buys, owns and runs companies that it believes could benefit from technologies like artificial intelligence. The startup did not disclose the financial terms of that agreement. OpenAI's latest funding round is expected to close in phases, as CNBC previously reported. Investments from strategics like Nvidia, SoftBank and Amazon, which make up roughly 90% of the round, will come first. Contributions from a broader pool of investors will follow. WATCH: Watch CNBC’s full interview with OpenAI CEO Sam Altmanwatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Thrive Capital invested about $1 billion in OpenAI at a $285 billion valuation, source says",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108236133-17647882242025-11-06t201852z_653951074_rc2umcacl8qk_rtrmadp_0_openai-outlook.jpeg?v=1765924912&w=1920&h=1080"
      ],
      "datePublished": "2026-02-25T19:56:41.000Z",
      "dateModified": "2026-02-25T19:56:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "David Tepper sends scathing letter to Whirlpool for destroying shareholder value, pushes for changes",
    "url": "https://www.cnbc.com/2026/02/25/david-tepper-sends-scathing-letter-to-whirlpool.html",
    "image": "https://image.cnbcfm.com/api/v1/image/104475768-1611843678781-104475768-EA_David_Tepper.jpg?v=1772027565&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-25T15:36:45.000Z",
    "description": "watch nowDavid Tepper, billionaire founder of hedge fund Appaloosa Management, sent a strongly worded letter to  Whirlpool's board, accusing the appli",
    "body": "watch nowDavid Tepper, billionaire founder of hedge fund Appaloosa Management, sent a strongly worded letter to  Whirlpool's board, accusing the appliance maker of destroying shareholder value and calling for sweeping changes to its strategy.Tepper said in the letter that he watched with \"a certain astonishment\" as the company issued equity in what he called a large and unnecessary dilution of shareholders. He argued the capital raise came at a cost exceeding 10%, far higher than the company's tax-adjusted debt cost of below 5% in public markets, despite management's stated goal of reducing leverage.\"Over the years this management team has destroyed hundreds of millions of dollars of shareholder value. Enough is enough. There can be no more excuses,\" Tepper said in the letter, first obtained by CNBC's Andrew Ross Sorkin.Whirlpool, the maker of Maytag and other iconic American appliance brands, was the eighth-biggest holding in Appaloosa Management's portfolio at the end of the fourth quarter, worth $282 million, according to Verity data.Stock Chart IconStock chart iconWhirlpool, 1 yearWhirlpool shares tanked 14% on Tuesday amid the secondary share sale, which will raise $454.9 million from a common stock offering and $508.1 million from a depositary share sale, according to the company. Whirlpool also sold 435,000 shares of Guangdong Whirlpool Electrical Appliances at a discounted $69 a share in a private placement.Shares of Whirlpool were down less than 1% in morning trading after Tepper's letter came out. The stock has tumbled nearly 36% from its 52-week high from July.A Whirlpool dryer is on display at a Wilson AC & Appliance store in Austin, Texas, on April 26, 2024.Brandon Bell | Getty ImagesThe hedge fund manager also faulted Whirlpool for failing to capitalize on tariffs instituted under the Trump administration, saying the company should explore partnerships or potential mergers with disadvantaged foreign competitors to strengthen its strategic position.\"We encourage the Board to (i) remember their fiduciary responsibilities and not accept management acting purely in its own self-interest, and (ii) invite domestic entities or foreign corporations who want tocreate American jobs and increase shareholder value to take an interest in Whirlpool,\" said the letter. Whirlpool didn't immediately respond to CNBC's request for comment.watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "David Tepper sends scathing letter to Whirlpool for destroying shareholder value, pushes for changes",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/104475768-1611843678781-104475768-EA_David_Tepper.jpg?v=1772027565&w=1920&h=1080"
      ],
      "datePublished": "2026-02-25T15:36:45.000Z",
      "dateModified": "2026-02-25T15:36:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Top earners are more afraid for their employment than lower income as AI threat increases",
    "url": "https://www.cnbc.com/2026/02/25/top-earners-are-more-afraid-for-their-employment-than-lower-income-as-ai-threat-increases.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108196414-1757444966672-gettyimages-2148297848-661811387cf1f3098a46a8a7.jpeg?v=1772043690&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-25T18:58:58.000Z",
    "description": "Liubomyr Vorona | Istock | Getty ImagesThe prospect of being replaced by artificial intelligence is helping to scare higher-income workers and leading",
    "body": "Liubomyr Vorona | Istock | Getty ImagesThe prospect of being replaced by artificial intelligence is helping to scare higher-income workers and leading them to stay in their jobs longer, according to several recent surveys.One closely followed gauge, the University of Michigan Survey of Consumers, show confidence in the labor market among high earners around its historic lows going back to the late-1970s. Likewise, the New York Federal Reserve's monthly consumer survey shows unemployment angst also around record highs.Finally, payrolls processing firm ADP notes that turnover among traditionally white-collar occupations is around record lows.The reason for the trend? \"Our guess is partially 'AI fear', as white collar jobs are possibly at greater risk, but we are open to other explanations,\" UBS chief economist Arend Kapteyn said in a note. The rise of AI is causing both excitement and fear among investors, employers and workers alike. Policymakers also are trying to gauge the impact of the new technology and how it will fit into the economy.\"In my lifetime, I have never seen a technological revolution like this — and I have seen the birth of space exploration, the rise of the personal computer, the explosion of the internet and then smartphones,\" Fed Governor Christopher Waller said Tuesday. \"Firms, households, and every government [agency] are all trying to incorporate it into the way they function and operate.\"watch nowFor the moment, AI appears to be contributing to angst and caution.Over the past year, the University of Michigan survey has found a general decline in sentiment over the labor market. However, it's been most pronounced among the top one-third of earners, whose sentiment score on the labor market, in this case expectations for a higher unemployment rate, to be at its lowest level since the financial crisis ended in 2009. Sentiment among lower-income workers also has declined but is actually higher than those at the top end.Likewise, the New York Fed's month Survey of Consumer Expectations is showing that expectations of finding a job in three months if one loses their job today is around the lowest for a data sent that stretches to mid-2013.And ADP's extensive data on the private jobs picture shows that professions such as finance and information and business services is showing reduced turnover rate. In January, turnover for professional and business services was the lowest the firm ever recorded.\"The normal push-and-pull of job gains and pay growth — quantity and price — that once kept the labor market dynamic has weakened, giving way to a market defined more by inactivity than vigor,\" said Nela Richardson, chief economist at ADP.To be sure, the jobs picture is still very strong for higher-income groups.While the Bureau of Labor Statistics does not break out the unemployment rate by income, it does classify it by profession. Finance, for instance, had a jobless level of just 2.1% in January, close to the same level a year ago. Professional and business services was somewhat elevated at 4.5%, but down 0.4 percentage point from January 2025.\"We immediately jump to the notion that a bunch ⁠of people are going to ‌be displaced\" by AI, Richmond Fed President Thomas Barkin ‌said at an event Wednesday. \"We should also remember ⁠people are going ⁠to be enabled.\"Similarly, Kansas City Fed President Jeffrey Schmid said in the long run, AI will be a benefit to the labor market and the economy.\"I personally think we're going to need AI to supplement the fact that we aren't having new entrants into the labor market like we did, let's say 30 years ago or 40 years ago,\" Schmid said during a separate event Wednesday. \"So AI is going to have to be an enhancement to do jobs.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Top earners are more afraid for their employment than lower income as AI threat increases",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108196414-1757444966672-gettyimages-2148297848-661811387cf1f3098a46a8a7.jpeg?v=1772043690&w=1920&h=1080"
      ],
      "datePublished": "2026-02-25T18:58:58.000Z",
      "dateModified": "2026-02-25T18:58:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "5 takeaways from Trump's State of the Union address",
    "url": "https://www.cnbc.com/2026/02/25/takeaways-trump-state-of-the-union-2026.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108269697-1771995138058-gettyimages-2262903794-AFP_98UU9M3.jpeg?v=1771996242&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-25T17:55:46.000Z",
    "description": "watch nowPresident Donald Trump delivered a nearly two-hour State of the Union address on Tuesday, focusing largely on the economy that he declared wa",
    "body": "watch nowPresident Donald Trump delivered a nearly two-hour State of the Union address on Tuesday, focusing largely on the economy that he declared was set to boom. The president delivered the signature annual address as he sees his poll numbers on the economy plummet ahead of the 2026 midterms, which loom less than nine months away. Those elections threaten to shift control of Congress from Republicans and Trump's control of Washington along with it. Here are five takeaways from Trump's State of the Union: 1. 401(k)s for everybodyTrump called for the creation of a government-backed 401(k)-like plan for U.S. workers who don't receive a retirement match from their employer. \"My administration will give these oft-forgotten American workers, great people, the people that built our country, access to the same type of retirement plan offered to every federal worker,\" Trump said. \"We will match your contribution with up to $1,000 each year.\"Trump said the plan would \"ensure that all Americans can profit from a rising stock market.\"Trump and his administration have often caught flak for touting stock market gains as evidence of a booming economy, while millions of Americans are not invested in the market.A White House official given anonymity to discuss the plan said it would grant eligible workers access to savings vehicles similar to the Thrift Savings Plan available to federal workers, which they said \"provides for an efficient savings program that includes a government match and offers diversified, index‑based, investment options and portfolio choices.\"  The plan would tap an existing program known as the \"Savers Match\" tax credit that was enacted under the 2022 Secure 2.0 law to provide an annual match of up to $1,000 to low-income workers beginning in 2027.Read more CNBC politics coverageState of the Union 2026 recap: Trump touted economic gainsEpstein files: Trump sexual abuse claims withheld by DOJSenators tell CFTC prediction market contracts need clear guidanceDemocrats seek to force refunds after Supreme Court blocks Trump tariffsTrump demands Netflix fire Susan Rice as DOJ probes Warner deal2. Trump reiterates his call to bar private equity from gobbling up homesThe president reiterated his call on Congress to pass legislation barring large institutional investors from buying up single-family homes, asking Congress to codify an executive order he signed to do so. \"I'm asking Congress to make that ban permanent, because homes for people, really that's what we want,\" Trump said. \"We want homes for people, not corporations; corporations are doing just fine.\" Trump's call to bar institutional investors from gobbling up homes echoes populist proposals from the progressive left, who are hammering the president on affordability. Democrats released another plan earlier Tuesday to limit the ability of larger investors to buy up homes, just before the State of the Union address. 3. The economy is doing great, Trump saysTrump said the economy is \"roaring like never before,\" as polls continue to show voters are souring on his performance on the economy and as Democrats slam him and Republicans on affordability. The president also took credit for what he said was the defeat of inflation, the bane of his predecessor and political nemesis, former President Joe Biden. \"Inflation is plummeting,\" Trump said. \"In 12 months, my administration has driven core inflation to the lowest level in more than five years.\"The consumer price index, a key measure of inflation, rose 2.4% in January from a year earlier, according to the latest numbers from the Bureau of Labor Statistics. That was down from 2.7% in December and lower than expected. Excluding food and energy, which are volatile, the core CPI was up 2.5%, the lowest level since April 2021.4. Democrats offer some, but not explosive, resistance in the chamberDemocrats aired their frustrations with the president at certain points in the speech, but largely avoided outright interference with Trump's remarks. Trump goaded Democrats for not standing after he asked lawmakers to \"stand up and show your support\" if they agreed that the first duty of the U.S. government is \"to protect American citizens, not illegal aliens.\"That prompted a brief back-and-forth between Trump and Reps. Ilhan Omar, D-Minn., and Rashida Tlaib, D-Mich. Omar is from Minnesota, where two U.S. citizens were shot dead by federal immigration officers this year while carrying out the president's deportation agenda. Rep. Al Green, D-Texas, was ejected from the chamber for a second year in a row during a speech by Trump after he held a sign that read \"Black People Aren't Apes.\" Trump's personal social media account recently shared a blatantly racist video that depicted the Obamas as apes. 5. Trump (mostly) keeps the speech domesticTrump mostly focused his speech on domestic policy and political issues and avoided getting bogged down in his efforts abroad. The president did, however, speak briefly about Iran, where he has directed a massive military buildup and where he's been hinting he might want to strike. \"We are in negotiations with them. They want to make a deal, but we haven't heard those secret words: 'We will never have a nuclear weapon,'\" Trump said of Iran. \"My preference is to solve this problem through diplomacy. But one thing is certain, I will never allow the world's No. 1 sponsor of terror, which they are by far, to have a nuclear weapon.\"Trump's focus on domestic issues is likely a reflection of the political reality. Democrats have taken an early lead in polling ahead of the midterms and largely swept 2025 off-year elections by focusing on affordability and kitchen-table issues. Republicans seemed to appreciate the life raft. \"What I was hoping he'd do would be to talk about the things moms and dads worry about when they lie down at night to sleep and can't. And he did,\" said Sen. John Kennedy, R-La., after the speech.watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "5 takeaways from Trump's State of the Union address",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108269697-1771995138058-gettyimages-2262903794-AFP_98UU9M3.jpeg?v=1771996242&w=1920&h=1080"
      ],
      "datePublished": "2026-02-25T17:55:46.000Z",
      "dateModified": "2026-02-25T17:55:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "David Ellison has a rocky history at the box office. Buying Warner Bros. could fix that",
    "url": "https://www.cnbc.com/2026/02/25/paramount-wbd-david-ellison-box-office-history.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108269224-1771952765268-gettyimages-2258037480-jbp08338_cw0mkdms.jpeg?v=1771952790&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-25T17:40:18.000Z",
    "description": "Chairman & CEO Paramount David Ellison attends the UFC 324 event at T-Mobile Arena on January 24, 2026 in Las Vegas, Nevada. Jeff Bottari | Ufc | Gett",
    "body": "Chairman & CEO Paramount David Ellison attends the UFC 324 event at T-Mobile Arena on January 24, 2026 in Las Vegas, Nevada. Jeff Bottari | Ufc | Getty ImagesIf there's one thing that Paramount Skydance CEO David Ellison knows well, it's an impossible mission.Ellison, producer of five of the \"Mission: Impossible\" films, has been trying to buy Warner Bros. Discovery for nearly six months. In September, he sent an initial, unsolicited offer to WBD, prompting the rival media company to explore a sale process that resulted in an agreement with Netflix to sell the famed Warner Bros. film studio and WBD's prestige streaming assets. Ellison launched a hostile tender offer and, separately, was welcomed back to the negotiating table with WBD under a seven-day waiver from Netflix. This week, Paramount upped its offer for the entirety of WBD.  The Warner Bros. movie studio is a big part of why Ellison has been so committed to winning over WBD's board and its shareholders.Last year, Warner Bros. was the second-highest grossing studio at the domestic box office. Paramount was fourth. A longtime Hollywood executive, Ellison has produced some massive hits at the box office, but his track record has been far from consistent. Where Netflix has a fraught relationship with theatrical releases — disrupting the traditional business and opting for years to prioritize streaming films for its subscribers — Ellison's production company, Skydance, has followed the tried-and-true theatrical playbook. Taking ownership of Warner Bros. would be a game changer for either company.\"If a merger were to be approved, the entity that then grabs up Warner Bros. would add tremendous horsepower both in terms of brand identity and revenue generating potential to their portfolio,\" said Paul Dergarabedian, head of marketplace trends at Comscore. \"So, it is understandable why the competition is fierce among the potential suitors vying for their chance to acquire the studio.\"A history of Skydance at the box officeSkydance released its first theatrical feature in 2006, a World War I drama featuring James Franco as a U.S. fighter pilot. Over the last two decades, the studio has launched nearly 30 films, the majority of which were in partnership with Paramount, according to data from Comscore. Paramount and Skydance completed their merger, engineered by Ellison, in August. Skydance's biggest successes have come from one source in particular — Tom Cruise. The studio's six highest-grossing films globally all star Cruise, including five \"Mission: Impossible\" films and the breakout 2022 hit \"Top Gun: Maverick.\"Highest-grossing Skydance films globally\"Top Gun: Maverick\" (2022) — $1.4 billion\"Mission: Impossible — Fallout\" (2018) — $791 million\"Mission: Impossible — Ghost Protocol\" (2011) — $694 million\"Mission: Impossible — Rogue Nation\" (2015) — $682 million\"Mission: Impossible — The Final Reckoning\" (2025) — $599 million\"Mission: Impossible — Dead Reckoning: Part One\" (2023) — $571 million\"World War Z\" (2013) — $540 million\"Star Trek Into Darkness\" (2013) — $467 million\"Transformers: Rise of the Beasts\" (2023) — $441 million\"Terminator Genisys\" (2015) — $440 millionSource: ComscoreHaving a billion-dollar film under your belt is no small feat, especially in the wake of the pandemic. The theatrical business has been in flux in recent years as consumer habits have shifted, studios grapple with how long movies should play in cinemas before hitting the home market, and streaming siphons away potential releases.For comparison, Disney has released six billion-dollar films since 2021: \"Avatar: The Way of Water,\" \"Inside Out 2,\" \"Deadpool & Wolverine,\" \"Moana 2,\" \"Zootopia 2\" and \"Avatar: Fire and Ash.\" Warner Bros. had 2023's \"Barbie,\" Universal had \"The Super Mario Bros. Movie\" that same year, and Sony had \"Spider-Man: No Way Home\" in 2021, according to Comscore data.Tom Cruise in \"Top Gun: Maverick\"Source: ParamountHowever, \"Top Gun: Maverick\" is a bit of an outlier for Skydance. In addition to being the studio's only billion-dollar film, it's also the only film in its library to exceed $230 million domestically. In fact, only five of Skydance's features to date have generated more than $200 million in the U.S. and Canada.Skydance's highest-grossing domestic films\"Top Gun: Maverick\" (2022) — $718 million\"Star Trek Into Darkness\" (2013) — $228 million\"Mission: Impossible — Fallout\" (2018) — $220 million\"Mission: Impossible — Ghost Protocol\" (2011) — $209 million\"World War Z\" (2013) — $209 millionSource: ComscoreGlobally, the production company has seen seven of its films generate more than $500 million in ticket sales, which would be a bigger feat — if budgets for many of these films weren't so high.\"The challenge for Ellison and Skydance, as it is for every studio, production company, and distributor, is to keep budgets in line particularly for latter installments of major franchises as these tend to have diminishing returns as compared the earlier releases to justify the continued investment in these movie franchises,\" said Dergarabedian.Of course, Skydance split production costs with its studio partners, so it's unclear exactly how much the company put toward each film it produced. Still, many of its franchise films saw budgets balloon with each new installment. Look at the most recent Mission: Impossible film. \"Mission Impossible: The Final Reckoning\" generated $599 million at the global box office, the fourth-best showing for a film in the franchise. However, the film had a reported budget of $400 million. That's before marketing costs, which usually run at about half of the production budget. General views of the TCL Chinese Theatre promoting the new Tom Cruise film 'Mission: Impossible The Final Reckoning' in IMAX on May 23, 2025 in Hollywood, California.Aaronp/bauer-griffin | Gc Images | Getty ImagesSo, Skydance in conjunction with Paramount would have spent an estimated $600 million ahead of the \"The Final Reckoning's\" release in theaters. And that $599 million brought in from ticket sales gets split. Studios share box-office proceeds with theater operators, typically in a 50-50 split by the end of a film's run in theaters.The result is often a movie that performed well at the box office, but ultimately was not profitable for the studios that produced it. And unlike some franchises — think Marvel, Star Wars or Harry Potter — Mission: Impossible doesn't have a robust merchandising arm or as much demand from fans for things like toys, apparel or collectibles. A mountain of contentIn merging with Paramount, Ellison's Skydance now has more properties that fall under the production company's designation. That includes the lucrative Sonic the Hedgehog franchise and upcoming films like \"Scream 7,\" \"Paw Patrol 3,\" \"Street Fighter,\" \"Scary Movie 6\" and \"Focker-in-Law,\" the latest installment in the Robert De Niro-led Meet the Parents franchise. However, Paramount's slate of franchises still aren't quite the heavy hitters that WBD carries on its roster.Still from Paramount's \"Sonic the Hedgehog 2.\"Paramount\"Warner Bros. is one of the crown jewels of the theatrical distribution,\" said Dergarabedian. \"Their slate of films, filmmaker relationships, brand recognition, and reputation as one of the premier and iconic movie studios makes them a coveted asset by any player in the entertainment space.\"WBD has in its library DC's superheroes, Harry Potter, Lord of the Rings, Game of Thrones, Looney Tunes and Scooby-Doo. It is also the distributor of Legendary's Dune and Godzilla and King Kong franchises.\"In Paramount's specific case, the studio's box office market share has often been challenged to keep pace with competitors and its own peak performance in the years leading up to 2015,\" said Shawn Robbins, director of analytics at Fandango and founder of Box Office Theory. \"While occasional hits such as the Sonic, A Quiet Place, and Scream franchises have provided bright spots, plus 'Top Gun: Maverick' catching lightning in a bottle four years ago, some of the studio's most bankable IP has seen diminishing returns among modern moviegoers.\"Paramount Skydance needs consistency at the box office and well-known and beloved franchises are one way to do that. Of course, just having a big name doesn't guarantee box-office success, but it lowers the barrier to entry.  \"Paramount is looking to mine every opportunity it can following the recent conclusion of Tom Cruise's Mission: Impossible series, the regression of Transformers from its biggest blockbuster dollar days, and the cinematic dormancy of Star Trek as that brand has been re-focused toward multiple streaming series targeted at its predominately older audience,\" Robbins said.Disclosure: Versant is the parent company of CNBC and Fandango.watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "David Ellison has a rocky history at the box office. Buying Warner Bros. could fix that",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108269224-1771952765268-gettyimages-2258037480-jbp08338_cw0mkdms.jpeg?v=1771952790&w=1920&h=1080"
      ],
      "datePublished": "2026-02-25T17:40:18.000Z",
      "dateModified": "2026-02-25T17:40:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Samsung launches S26 smartphone as sector braces for memory chip crunch",
    "url": "https://www.cnbc.com/2026/02/25/samsung-launches-s26-smartphone-memory-chip-crunch.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108269756-1772016177541-processed-4C94B91F-462A-49BB-975F-4D6C343DC2C2.jpeg?v=1772016456&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-25T18:00:01.000Z",
    "description": "Samsung Electronics unveiled its latest series of flagship smartphones on Wednesday, with two of the models costing $100 more than their predecessors ",
    "body": "Samsung Electronics unveiled its latest series of flagship smartphones on Wednesday, with two of the models costing $100 more than their predecessors as the industry tries to recover from a global shortage of memory chips.Samsung is touting improved AI and a privacy display in its new models against a backdrop of industry-wide memory chip shortages brought about by the rapid scaling of AI infrastructure.The average selling price of smartphones in 2026 was expected to rise 6.9% as a result of the memory crunch, Counterpoint Research said in a note in December.The starting price has stayed flat on the highest end model, the S26 Ultra, compared to last year's S25 series. The S26 and S26+ saw a $100 rise compared with their S25 predecessors:Galaxy S26: $899Galaxy S26+: $1,099Galaxy S26 Ultra: $1,299Ben Wood, chief analyst at CSS Insight, told CNBC the chip shortage was \"not a short-term issue.\"He added: \"We expect the global shortage of memory chips to persist well into 2027, primarily driven by the rapid expansion of AI infrastructure, which is diverting supply away from smartphones, PCs, and other consumer electronics.\"Samsung S26 Ultra.New specsThe S26 series is the third of \"AI phones\" by Samsung, following the S24 release two years ago. The company says the new models' processing chips are faster than those of previous generations. It added they use AI tools to help with things like photo editing and document scanning.Samsung's S26 series does take some \"positive steps forward\" in making AI features easier to use for consumers, said Wood. But, he added: \"I fear that consumers will still question how much value it really offers at this juncture.\"Wood added the \"stand-out feature\" on the S26 Ultra is its privacy display, which controls how pixels disperse light, limiting what those viewing from side angles can see. The company says this feature is a world first.Samsung S26 Ultra.Memory crunchMemory prices in segments such as smartphones have doubled over the past two quarters, according to CSS Insight research, said Wood.While memory manufacturers are investing in new capacity, the chip shortage is expected to last until 2027 or early 2028, he added.\"Rising memory semiconductor prices are a global issue and impacts the global broader industry,\" a Samsung spokesperson told CNBC.They added: \"Samsung expects to be relatively well-positioned on the supply side through strategic partnerships and will continue efforts to minimize the impact on its business by responding flexibly to market changes.\"Smartphone makers are looking at ways to mitigate the memory shortage risk by diversifying suppliers,  Paolo Pescatore, TMT analyst at PP Foresight, told CNBC. The memory crunch is no longer a \"niche supply-chain talking point\", he added, but a \"strategic constraint on the AI roadmap.\"\"If memory costs stay elevated, Samsung faces a familiar squeeze: protect margins or protect volumes,\" Pescatore said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Samsung launches S26 smartphone as sector braces for memory chip crunch",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108269756-1772016177541-processed-4C94B91F-462A-49BB-975F-4D6C343DC2C2.jpeg?v=1772016456&w=1920&h=1080"
      ],
      "datePublished": "2026-02-25T18:00:01.000Z",
      "dateModified": "2026-02-25T18:00:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]