[
  {
    "title": "Job interviewers are overlooking their best candidates—unless they do these 2 things, says Wharton psychologist Adam Grant",
    "url": "https://www.cnbc.com/2025/11/09/adam-grant-do-these-2-things-in-a-job-interview-to-find-the-best-talent.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107331734-1699559053920-gettyimages-1409734996-img_4525_ad82728c-37bb-4e96-89c8-998b5a555515.jpeg?v=1762453353&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-09T15:00:02.000Z",
    "description": "Traditional job interview methods that have a candidate tell, rather than show, their strengths may be responsible for employers \"missing diamonds in ",
    "body": "Traditional job interview methods that have a candidate tell, rather than show, their strengths may be responsible for employers \"missing diamonds in the rough,\" says Adam Grant. Instead, he says, interviewers should try incorporating two steps to assess a candidate's true potential and fit for the job.Grant, a bestselling author and organizational psychologist at the Wharton School of the University of Pennsylvania, shared tips for improving the interview process while speaking at WOBI's World Business Forum in New York City on Nov. 5.He cited research that \"how well somebody does a job is not indicated by how the first interview goes, it's how much growth they show from the first interview to the second.\"Of course, hiring teams don't always have the time or resources to give everyone a second chance if they flub the first interview. But Grant shared an alternative that still affords candidates a do-over without requiring the hiring team carve out time for another interview.\"Even if you could pause an interview halfway and say, 'Hey, I've got a couple of notes for you,' and then watch the motivation and ability to grow from the first attempt to the second, that is a great window into is somebody excited to get better and also do they have the capability to learn the skills that you're trying to get them to excel at.\"Besides giving feedback and a chance to improve if candidates have a rocky start, Grant includes a task in the interview that's part of the actual job to see a person's skills and potential in action.'I have been guilty of this'Grant shared a personal anecdote of how he almost missed out on hiring a top performer because of his own approach to interviewing applicants. Before becoming an organizational psychologist, he led an advertising team and was hiring salespeople. He recalled one candidate who seemed to be \"the worst fit for sales imaginable\" based on his resume.Grant was desperate to fill the role so he interviewed the applicant regardless, but remained unimpressed. He told the company's president the candidate wouldn't be good for the role because he never made eye contact during the 45-minute interview.\"I didn't know a thing about neurodivergence then,\" Grant noted.The company's president responded, \"You realize this is a phone sales job, right? There is no eye contact in this job.\"Grant suddenly realized he'd been so focused on confirming his belief that the candidate was a poor fit, and he learned a lesson.\"I realized I had to reboot our hiring process,\" he said. \"If you want to gauge somebody's potential, the best thing you can do is actually give them a challenge that's really part of the job and watch how they handle it.\"So he brought all of the candidates back and asked them to sell him a rotten apple. Grant chose that because all of the candidates would be familiar with an apple, so it would level the playing field, and because \"if you could get me excited about a rotten apple, you could definitely sell our products,\" he said.The candidate Grant had frowned upon before dove right in with his sales pitch.\"This may look like a rotten apple; it's actually an aged, antique apple,\" Grant recalled him saying. \"You know the saying 'An apple a day keeps the doctor away?' Well, because of the nutrients in the aging process, you only need to eat one of these a week. And then afterwards you can plant the seeds in your backyard.\"Though Grant joked he had \"some serious honesty and integrity questions\" about the candidate, he hired him, and the man ended up being the best salesperson on the team.\"What I learned from that story was not just that I needed to see him in action to gauge his potential,\" Grant said. \"But also, I needed to give him a do-over.\"Want to level up your AI skills? Sign up for Smarter by CNBC Make It's new online course, How To Use AI To Communicate Better At Work. Get specific prompts to optimize emails, memos and presentations for tone, context and audience.Plus, sign up for CNBC Make It's newsletter to get tips and tricks for success at work, with money and in life, and request to join our exclusive community on LinkedIn to connect with experts and peers.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Job interviewers are overlooking their best candidates—unless they do these 2 things, says Wharton psychologist Adam Grant",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107331734-1699559053920-gettyimages-1409734996-img_4525_ad82728c-37bb-4e96-89c8-998b5a555515.jpeg?v=1762453353&w=1920&h=1080"
      ],
      "datePublished": "2025-11-09T15:00:02.000Z",
      "dateModified": "2025-11-09T15:00:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "China suspends some critical mineral export curbs to the U.S. as trade truce takes hold",
    "url": "https://www.cnbc.com/2025/11/10/china-suspends-some-critical-mineral-export-curbs-to-the-us-as-trade-truce-takes-hold.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108070936-1733286828300-gettyimages-1756858630-20090101231101-99-779255.jpeg?v=1733287027&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-10T04:03:14.000Z",
    "description": "Crystals of gallium are seen in a laboratory at Freiberg University of Mining and Technology in Saxony, Germany on 13 September 2023.Picture Alliance ",
    "body": "Crystals of gallium are seen in a laboratory at Freiberg University of Mining and Technology in Saxony, Germany on 13 September 2023.Picture Alliance | Picture Alliance | Getty ImagesChina has rolled back a number of restrictions on its export of critical minerals and rare earth materials to the United States, in a sign that a trade truce between the world's two largest economies is holding.China's Ministry of Commerce said Friday that it would suspend some export controls on critical minerals used in military hardware, semiconductors and other high-tech industries for a year.The suspended restrictions, first imposed on Oct. 9, include limits on the export of certain rare earth elements, lithium battery materials, and processing technologies.The export relaxations follow talks between U.S. President Donald Trump and Chinese President Xi Jinping in Busan, South Korea, on Oct. 30. Beijing also reversed retaliatory curbs on exports of gallium, germanium, antimony and other so-called super-hard materials such as synthetic diamonds and boron nitrides. Those measures, introduced in December 2024, were widely seen as retaliation for Washington's expanded semiconductor export restrictions on China. China classifies such materials as \"dual-use items,\" meaning they can be used for both civilian and military purposes.Beyond military applications, these critical minerals are used across the semiconductor industry and other high-tech sectors — sectors at the heart of U.S.-China trade tensions.Beijing has also suspended the stricter end-user and end-use verification checks for exports of dual-use graphite to the U.S., which were imposed in December 2024 alongside the broader export ban.China dominates global production of most critical minerals and rare earth elements and has increasingly used its export policies as leverage in trade disputes. As part of the latest China-U.S. trade deal, the U.S. has agreed to several concessions, including lowering tariffs on Chinese imports by 10 percentage points, and suspending Trump's heightened \"reciprocal tariffs\" on Chinese imports until Nov. 10, 2026.The U.S. will also postpone a rule announced Sept. 29 that would have blacklisted majority-owned subsidiaries of Chinese companies on its entity list.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "China suspends some critical mineral export curbs to the U.S. as trade truce takes hold",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108070936-1733286828300-gettyimages-1756858630-20090101231101-99-779255.jpeg?v=1733287027&w=1920&h=1080"
      ],
      "datePublished": "2025-11-10T04:03:14.000Z",
      "dateModified": "2025-11-10T04:03:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Carl Icahn returns to a familiar sector — auto repair — as he builds a 15% stake in Monro",
    "url": "https://www.cnbc.com/2025/11/08/carl-icahn-returns-to-a-familiar-sector-auto-repair-as-he-builds-a-15percent-stake-in-monro.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108222568-1762454629105-Screenshot_2025-11-06_at_14324_PM.png?v=1762454717&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-08T12:46:52.000Z",
    "description": "Monro Auto Service in Derby, CT.Source: Google EarthCompany: Monro (MNRO)Business: Monro, formerly Monro Muffler Brake, is engaged in the provision of",
    "body": "Monro Auto Service in Derby, CT.Source: Google EarthCompany: Monro (MNRO)Business: Monro, formerly Monro Muffler Brake, is engaged in the provision of automotive undercar repair and tire services in the United States. The company provides a range of services on passenger cars, light trucks and vans for brakes; mufflers and exhaust systems, and steering, drive train, suspension and wheel alignment. It also offers tires and routine maintenance services, which include state inspections. It offers repair and replacement of parts. Its stores provide a range of undercar repair services for brakes, steering, mufflers and exhaust systems, suspension and wheel alignment, as well as tire replacement and service. It also offers scheduled maintenance services in its stores where services are packaged and offered to consumers based upon the year, make, model and mileage of each specific vehicle. Its maintenance services include oil change services, heating and cooling system flush and fill service, fuel system service and a transmission flush and fill service.Stock Market Value: $458.40 million ($15.27 per share)Stock Chart IconStock chart iconMonro shares year to dateActivist: Carl IcahnOwnership: 14.79%Average Cost: $19.08Activist Commentary: Carl Icahn is the grandfather of shareholder activism and a true pioneer of the strategy. He is very passionate about shareholder rights and good corporate governance and will go to extreme lengths to fight incompetent boards and over compensated managers. Icahn has invested across all sectors over his more than six-decade long career and has a long history in the automotive parts and services industry. He has been involved in several mergers and acquisitions in this space, acquiring some of his portfolio companies through Icahn Automotive, the automotive-segment business of his conglomerate, Icahn Enterprises. This includes his acquisition of Pep Boys-Manny Moe and Jack in 2016 and Federal Mogul in 2017.What's happeningOn Nov. 5, Carl Icahn filed a 13D with the U.S. Securities and Exchange Commission, disclosing a 14.79% position in Monro.Behind the scenesMonro is engaged in the provision of automotive undercar repair and tire services in the United States, operating more than 1,100 repair shops and tire dealers in 32 states under multiple regional brands. The company has faced several challenges in recent years. Macro factors like lower consumer demand, higher material and labor costs, and a trend in consumer trade-down to lower margin tire products have applied significant margin and growth pressure. As a result, following a 4.9% decrease in sales for fiscal year 2025 — the second year in a row with a meaningful decline in revenue — the company announced that they are closing approximately 145 underperforming locations. Most recently, the company's third-quarter earnings report left a lot of investors disappointed about its strategic transition, with weaker-than-expected revenue and no specific financial guidance for the upcoming fiscal year. Shares fell 16.7% the next day. Lastly, many investors have questioned the company's dividend payout ratio, which has remained relatively large despite these ongoing struggles. Putting all this together, it comes as little surprise that shares have underperformed, down 44.73%, 66.73% and 63.25% over the past 1-, 3- and 5-year periods, respectively, prior to Icahn's announcement.Perhaps this depressed valuation is what caught the eye of Carl Icahn. He disclosed a 14.79% position in the company (67% of which was acquired since the stock's Oct. 29 downturn), immediately sending the stock up over 15%. While there are plenty of cheap stocks, this isn't Icahn taking a flyer on the automotive industry. Icahn has a rich history in the automotive parts and services industry, most notably Icahn Automotive, the automotive segment of his conglomerate, Icahn Enterprises. Icahn knows this industry well and likely sees Monro as a great business that is significantly undervalued. The timing of this public engagement is also very notable. It is not just the stock's recent fall that makes this a good entry point for an investor like Icahn. Monro recently agreed to collapse its dual class share structure, which had previously granted its sole Class C shareholder, Peter Solomon, veto power over any matter brought to a shareholder vote, effectively making this a controlled company. Pursuant to its approval in 2023, this collapse will occur prior to the 2026 annual meeting, which is expected to take place next August. So, what does this mean for the company's shareholders? It effectively sets the stage for the company being converted from a privately run company to a publicly run company for the benefit of its shareholders. With one person having veto power over all material board decisions, the rest of the board becomes somewhat irrelevant. With this conversion, the company has an opportunity to have a real, collaborative, and productive board. This would require its reconstitution, and we know of nobody better or more experienced than Icahn for that endeavor.Solomon is an 87-year-old renowned investment banker and Icahn is, well, Icahn and a contemporary of Solomon. However, there is no evidence that the two have ever crossed paths. Despite this, we would imagine that they have many relationships in common and mutual respect for each other. While there are many different ways this campaign can go down, what we would like to see is the two elder statesmen meeting in a room with an air of civility and cordiality uncommon in the average activist engagement and together coming up with a board that will oversee management, hold them accountable on behalf of shareholders and usher the company through its first real phase as a truly public company. With Solomon already agreeing to give up control, and neither Solomon nor Icahn likely to be on the continuing board, there is no reason why this should get contentious.However, we also must address the elephant in the room. Icahn has built his automotive industry on acquisitions, and Monro appears to fit in very nicely in IEP's automotive business. Icahn has launched activist campaigns at some of the auto companies that he later went on to acquire, including Pep Boys-Manny Moe and Jack in 2016 and Federal Mogul in 2017. When Icahn acquired Pep Boys he also stated: \"We believe that with our abundant resources and knowledge of the industry we will be able to grow this business and take advantage of consolidation opportunities, thereby benefiting customers, manufacturing partners and employees, as well as our shareholders.\" While we sincerely believe that Icahn's main motivation for this investment is to invest in a good company that he believes is at an inflection point and is significantly undervalued, there is always the chance that he might want to own the entire company one day. This is a very small position for him and a good return would not move the needle as much as a synergistic integration into his automative business, but we see no reason why both things cannot be true.Ken Squire is the founder and president of 13D Monitor, an institutional research service on shareholder activism, and the founder and portfolio manager of the 13D Activist Fund, a mutual fund that invests in a portfolio of activist investments.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Carl Icahn returns to a familiar sector — auto repair — as he builds a 15% stake in Monro",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108222568-1762454629105-Screenshot_2025-11-06_at_14324_PM.png?v=1762454717&w=1920&h=1080"
      ],
      "datePublished": "2025-11-08T12:46:52.000Z",
      "dateModified": "2025-11-08T12:46:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Stop asking 'How was school today?' To raise successful, mentally strong kids, ask these 7 questions instead",
    "url": "https://www.cnbc.com/2025/11/09/stop-asking-how-was-school-today-to-raise-successful-kids-ask-these-questions-instead.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108222410-1762443789460-GettyImages-1352579841.jpg?v=1762443860&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-09T14:30:01.000Z",
    "description": "\"My child won't tell me anything about their day!\" It's a common concern I hear from parents in my psychotherapy office. They're hoping to gain a glim",
    "body": "\"My child won't tell me anything about their day!\" It's a common concern I hear from parents in my psychotherapy office. They're hoping to gain a glimpse into their child's world. But asking \"How was school today?\" usually leads to a one-word answer.As a therapist and the author of \"13 Things Mentally Strong Parents Don't Do,\" I encourage parents to ask questions that are thoughtful and spark meaningful conversations. When kids reflect on their experiences, they practice skills like emotional awareness, problem-solving, and empathy, and develop a growth mindset.Here are seven questions that lead to productive conversations while also helping kids grow mentally stronger:1. 'What was the best part of your day?'This question encourages kids to scan their brains for positives. For children who dislike school or tend to focus on what went wrong, answering this question helps them build optimism and gratitude — which are both protective factors for mental health.Frame the question with your own experience, saying, \"The best part of my day was going for a walk during my lunch break. What about you?\" Your child might share a highlight, like, \"I played kickball at recess.\"2. 'What's a mistake you learned from today?'This one normalizes errors and celebrates healthy risk-taking. Talking openly about mistakes reduces shame and helps kids see them as opportunities for growth.Ask with a tone of curiosity, not judgment: \"Did anything happen today that you'd do differently next time?\" This might prompt them to say, \"I forgot my library book so I'm going to pack it tonight so I don't forget.\"3. 'Who were you proud of today?'It works because it turns their attention to others and cultivates empathy. You will also gain insight into your child's relationships and what they value.Make the question more specific by asking, for example, \"Did you see anyone try really hard at something today?\" Your child may talk about a friend who was brave or might give themselves a pat on the back and say, \"My friend forgot her snack so I shared mine.\"4. 'What's one thing that would have made today better?'This question helps kids identify feelings like frustration and disappointment without dwelling on those experiences. It naturally opens the door to problem-solving and planning.You can ask in a fun way, such as, \"If you had a magic wand to change one thing about today, what would it be?\" This can lead to creative ideas, like, \"I wish there was more time for my art project so maybe I'll bring it home to finish it.\" 5. 'Who did you help today?'You can empower kids to engage in prosocial behavior with questions like this. When you ask regularly, kids begin to look for opportunities to be helpful and acts of kindness become second nature.  Ask about small acts of contribution: \"How were you a helper today?\" They might remember something simple, like, \"I helped the teacher pass out papers.\"6. 'What was the most interesting thing you learned today?'It emphasizes curiosity over academic performance. Showing interest in the learning process itself fuels lifelong learning.Encourage kids to talk about what they learned aside from just their subjects. They may share a fun fact, like, \"I learned that my teacher knows how to play the violin.\" Show interest and ask follow-up questions to keep the conversation going.7. 'What's something new you'd like to try?'This nudges kids to look outside their comfort zone and encourages them to be courageous. They don't have to be good at something in order to try something new — it's a learning experience. If your child hesitates to try new things, encourage an experiment by asking, \"Is there a club or activity you're curious about just trying once?\" They may be more likely to explore if they know they don't have to stick with it forever.Amy Morin is a psychotherapist, clinical social worker and instructor at Northeastern University. She is the author of several books including \"13 Things Strong Kids Do: Think Big, Feel Good, Act Brave\" and \"13 Things Mentally Strong Parents Don't Do.\" Her TEDx talk \"The Secret of Becoming Mentally Strong\" is one of the most viewed talks of all time. Follow her on Instagram and Facebook.Want to level up your AI skills? Sign up for Smarter by CNBC Make It's new online course, How To Use AI To Communicate Better At Work. Get specific prompts to optimize emails, memos and presentations for tone, context and audience. Sign up today with coupon code EARLYBIRD for an introductory discount of 20% off. Offer valid Oct. 21 through Oct. 28, 2025.Plus, sign up for CNBC Make It's newsletter to get tips and tricks for success at work, with money and in life, and request to join our exclusive community on LinkedIn to connect with experts and peers.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Stop asking 'How was school today?' To raise successful, mentally strong kids, ask these 7 questions instead",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108222410-1762443789460-GettyImages-1352579841.jpg?v=1762443860&w=1920&h=1080"
      ],
      "datePublished": "2025-11-09T14:30:01.000Z",
      "dateModified": "2025-11-09T14:30:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jamie Dimon shares why he never reads text messages at work: 'I don't have notifications'",
    "url": "https://www.cnbc.com/2025/11/09/jamie-dimon-shares-why-he-never-reads-text-messages-at-work.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108114999-1741804180208-gettyimages-2204125628-BLACKROCK_RETIREMENT.jpeg?v=1762449895&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-09T03:08:32.000Z",
    "description": "Jamie Dimon, chief executive officer of JPMorgan Chase & Co., speaks during the 2025 National Retirement Summit in Washington, DC, US, on Wednesday, M",
    "body": "Jamie Dimon, chief executive officer of JPMorgan Chase & Co., speaks during the 2025 National Retirement Summit in Washington, DC, US, on Wednesday, March 12, 2025.Al Drago | Bloomberg | Getty ImagesJPMorgan Chase CEO Jamie Dimon recently opened up about his phone habits at work, including never reading text messages and having his phone notifications turned off.\"I don't have notifications,\" the finance boss told CNN's Erin Burnett in an interview. \"If you sent me a text during the day, I probably do not read it.\"He added: \"The only notifications I get is from my kids. That's it. When they text me, I get that.\"The 69-year-old revealed that he doesn't carry his phone around with him all the time and prioritizes deep focus at work.\"When I'm walking around the building and going to meetings, I don't have it on me. It's in my office,\" he said. \"When I go to my meetings, I did the pre-reads and I'm 100% focused on us, what you're talking about, why you're talking about it, as opposed to I'm distracted and I'm thinking about other things.\"Dimon has previously aired his gripes about poor meeting etiquette and said at Fortune's Most Powerful Women Summit in October that using phones in meetings is \"disrespectful\" and \"wastes time.\"\"If you have an iPad in front of me and it looks like you're reading your email or getting notifications, I'll tell you to close the damn thing,\" he said at the time.He explained that meetings should have a purpose and that checking emails and getting distracted are red flags.Working from homeDimon has remained critical of some of the newest shifts in the workplake brought about by the youngest generation at work: Gen Z. Dimon has adhered to more traditional ways of working, often expecting his employees to do the same.Earlier this year, JPMorgan Chase's CEO went on a rant in a leaked audio recording, to JPMorgan employees about working from home and phone usage in meetings after workers complained about having to return to the office five days a week.Dimon told them to quit saying he was concerned about the \"damage\" that work from home was doing to younger recruits.\"Don't give me this s--- that work-from-home Friday works ... I call a lot of people on Fridays, and there's not a goddamn person you can get a hold of ... I've had it with this kind of stuff,\" he said in the recording.\"They're here, they're there, the Zooms [Gen Z], and the zoomers don't show up ... That's not how you run a great company.\"He even took a shot at managers in the call saying they were abusing the privilege of working from home to slack off. When on Zoom, managers were looking at their mail, sending texts and not paying attention, Dimon said. \"And if you don't think that slows down efficiency, creativity, creates rudeness – it does,\" he added.Work etiquetteAnastasia Dedyukhina, a digital wellbeing expert, previously told CNBC Make It that frequently checking your smartphone reduces the quality of your conversations with friends and colleagues. A 2023 survey by Reviews.org found that Americans check their phones an average of 144 times a day.She explained that even just a having a phone near you can be extremely distracting. Using a phone could also leave a bad impression on managers and colleagues and is bad working etiquette.\"I would also keep thinking about it because for our minds, a smartphone and the sound of a smartphone is a highly attractive stimuli. So when I hear my phone ringing and make a notification, for my mind, it's the same as if you were calling me by my name,\" Dedyukhina said.That's why Harvard University associate professor Alison Wood Brooks formerly shared with CNBC Make It that it's important to focus in meetings as it makes you appear smarter and more likable. This includes asking follow up questions and paraphrasing and repeating what the other person said back to them.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jamie Dimon shares why he never reads text messages at work: 'I don't have notifications'",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108114999-1741804180208-gettyimages-2204125628-BLACKROCK_RETIREMENT.jpeg?v=1762449895&w=1920&h=1080"
      ],
      "datePublished": "2025-11-09T03:08:32.000Z",
      "dateModified": "2025-11-09T03:08:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump tells Senate Republicans to send federal health insurance money 'directly to the people'",
    "url": "https://www.cnbc.com/2025/11/08/trump-republicans-health-insurance.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108222585-17624560132025-11-06t190319z_2013354139_rc25rha5iso8_rtrmadp_0_usa-trump.jpeg?v=1762456039&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-08T20:08:22.000Z",
    "description": "U.S. President Donald Trump gestures as he speaks during an event to announce a deal with Eli Lilly and Novo Nordisk to reduce the prices of GLP-1 wei",
    "body": "U.S. President Donald Trump gestures as he speaks during an event to announce a deal with Eli Lilly and Novo Nordisk to reduce the prices of GLP-1 weight‑loss drugs, in the Oval Office at the White House in Washington, D.C., U.S., November 6, 2025. Jonathan Ernst | ReutersPresident Donald Trump proposed a compromise on health insurance payments, calling on Republicans to send federal payments that would go to insurers under the Affordable Care Act directly to Americans to bring an end to the government shutdown.\"I am recommending to Senate Republicans that the Hundreds of Billions of Dollars currently being sent to money sucking Insurance Companies in order to save the bad Healthcare provided by ObamaCare, BE SENT DIRECTLY TO THE PEOPLE SO THAT THEY CAN PURCHASE THEIR OWN, MUCH BETTER, HEALTHCARE, and have money left over,\" he wrote in a Truth Social post on Saturday, without providing any details.The post comes one day after Senate Republicans rejected Democratic Minority Leader Chuck Schumer's deal that would have allowed the U.S. government to reopen after a shutdown that began Oct. 1. The shutdown is now the longest in U.S. history.The plan Democrats put forward on Friday proposed protecting federal ACA subsidies for at least one year, in exchange for dropping their demand that a longer-term extension of Obamacare tax credits be included in a stopgap government funding bill.Those subsidies, which more than 20 million Americans use, will expire at the end of December if Congress does not extend them.Read more CNBC government shutdown coverageDuffy warns air travel will be ‘reduced to a trickle’ as the shutdown drags onTrump tells Republicans to send health insurance money 'directly to the people'Food banks in ‘disaster response mode’ due to shutdown, SNAP cuts, leaders saySenate Republicans reject Democrat deal to reopen governmentDemocratic leader offers deal to reopen government but Republicans sneerTrump admin asks Supreme Court to block order it pay full SNAP benefitsSNAP benefits must be fully paid by Trump administration by Friday, judge ordersDC sandwich thrower Sean Dunn found not guilty of assaulting federal agentJudge dismisses criminal case against Boeing over Max crashes despite skepticismNancy Pelosi announces retirement from CongressTrump bashes Mamdani after Democrats sweep key electionsSupreme Court justices appear skeptical that Trump tariffs are legalCalifornia voters approve new U.S. House map to boost Democrats in 2026Democrats win big on election night in key racesSenate Majority Leader John Thune, R-S.D., on Friday called the Democrats' proposal a \"non-starter.\"The White House did not immediately respond to a CNBC request for comment or specifics on how Trump's proposed direct payment plan would work.Representatives for Sens. Schumer and Thune did not immediately respond to a request for comment. The D.C. offices for House Speaker Mike Johnson, R-La., and House Minority Leader Rep. Hakeem Jeffries, D-N.Y., did not immediately respond to a request for comment.Congressional lawmakers have been in a stalemate, unable to find a compromise to end the shutdown. Democrats want a funding bill to include health-care subsidies that are due to expire for 24 million Americans at year's end. Republicans, meanwhile, say Congress must first pass a funding bill without strings attached and allow the government to reopen before tackling other issues.In multiple posts on Saturday, Trump also reiterated his calls for terminating the filibuster, the Senate rule requiring 60 of its 100 members to pass most legislation. The GOP holds 53 seats in the Senate. There are 45 Democratic senators, and two independents who caucus with them.Senate Republicans have pushed back on changing the rule, saying earlier this week they would not support a change. Trump had called for his party to exercise what he called \"the Nuclear Option\" on the rule.On Saturday, Trump alleged that he is \"making progress\" with Republicans on changing the rule.\"The Democrats are cracking like dogs on the Shutdown because they are deathly afraid that I am making progress with the Republicans on TERMINATING THE FILIBUSTER! Whether we make a Deal or not, THE REPUBLICANS MUST 'BLOW UP' THE FILIBUSTER,\" he wrote.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump tells Senate Republicans to send federal health insurance money 'directly to the people'",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108222585-17624560132025-11-06t190319z_2013354139_rc25rha5iso8_rtrmadp_0_usa-trump.jpeg?v=1762456039&w=1920&h=1080"
      ],
      "datePublished": "2025-11-08T20:08:22.000Z",
      "dateModified": "2025-11-08T20:08:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump administration demands that states 'undo' full SNAP benefit payments",
    "url": "https://www.cnbc.com/2025/11/09/snap-trump-states-food-patrick-penn.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108220777-1762199988633-gettyimages-2244377423-US_GOV_FUNDING.jpeg?v=1762704539&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-10T04:08:57.000Z",
    "description": "A volunteer displays information on the Supplemental Nutritional Assistance Program (SNAP) at a grocery store in Dorchester, Massachusetts, US, on Mon",
    "body": "A volunteer displays information on the Supplemental Nutritional Assistance Program (SNAP) at a grocery store in Dorchester, Massachusetts, US, on Monday, Nov. 3, 2025. Mel Musto | Bloomberg | Getty ImagesThe U.S. Department of Agriculture, in a memo late Saturday evening, threatened to enact financial penalties on states that issued full monthly SNAP benefits for November if they don't \"undo\" those food stamp payments.The late-night directive from the Trump administration adds to the chaos surrounding the anti-hunger program that serves more than 42 million Americans.The memo, signed by Patrick Penn, Deputy Under Secretary of the USDA's Food, Nutrition, and Consumer Services, warned states that the administration had not cleared full SNAP benefit payments for November.\"To the extent States sent full SNAP payment files for November 2025, this was unauthorized,\" the memo said.State program administrators were directed to distribute 65% partial payments of SNAP benefits for the month instead, the memo said.States must also \"immediately undo any steps taken to issue full SNAP benefits for November 2025,\" the memo said. Failure to comply could result in the USDA cancelling the federal share of administration costs or holding states financially liable for \"any overissuances that result from the noncompliance.\"It was unclear how the USDA expects states to claw back any unauthorized SNAP payments.Sen. Amy Klobuchar, D-Minn., blasted the Trump administration's move.\"The cruelty is the point. It is their choice to do this,\" Klobuchar wrote in a post on the social media site X.The USDA and the White House did not immediately respond to CNBC's request for comment.Read more CNBC government shutdown coverageDuffy warns air travel will be ‘reduced to a trickle’ as the shutdown drags onTrump tells Republicans to send health insurance money 'directly to the people'Food banks in ‘disaster response mode’ due to shutdown, SNAP cuts, leaders saySenate Republicans reject Democrat deal to reopen governmentDemocratic leader offers deal to reopen government but Republicans sneerTrump admin asks Supreme Court to block order it pay full SNAP benefitsSNAP benefits must be fully paid by Trump administration by Friday, judge ordersDC sandwich thrower Sean Dunn found not guilty of assaulting federal agentJudge dismisses criminal case against Boeing over Max crashes despite skepticismNancy Pelosi announces retirement from CongressTrump bashes Mamdani after Democrats sweep key electionsSupreme Court justices appear skeptical that Trump tariffs are legalCalifornia voters approve new U.S. House map to boost Democrats in 2026Democrats win big on election night in key racesThe memo was first reported by The New York Times.It comes as some states scrambled to comply with a court ruling on Thursday, when a federal judge in Rhode Island ordered the Trump administration to pay full SNAP benefits for November on Friday. The judge rejected the administration's plan to partially fund the food stamp program amid the U.S. government shutdown.The USDA subsequently told states that it would begin disbursing full SNAP benefits to comply with that order, even as the ruling faced an appeal from the Trump administration.Read more CNBC government shutdown coverageDuffy warns air travel will be ‘reduced to a trickle’ as the shutdown drags onTrump tells Republicans to send health insurance money 'directly to the people'Food banks in ‘disaster response mode’ due to shutdown, SNAP cuts, leaders saySenate Republicans reject Democrat deal to reopen governmentDemocratic leader offers deal to reopen government but Republicans sneerTrump admin asks Supreme Court to block order it pay full SNAP benefitsSNAP benefits must be fully paid by Trump administration by Friday, judge ordersDC sandwich thrower Sean Dunn found not guilty of assaulting federal agentJudge dismisses criminal case against Boeing over Max crashes despite skepticismNancy Pelosi announces retirement from CongressTrump bashes Mamdani after Democrats sweep key electionsSupreme Court justices appear skeptical that Trump tariffs are legalCalifornia voters approve new U.S. House map to boost Democrats in 2026Democrats win big on election night in key racesThe Associated Press reported late Friday that more than half a dozen states had \"confirmed that some SNAP recipients already were issued full November payments on Friday.\"The administration asked the 1st Circuit U.S. Court of Appeals for an emergency injunction to block the order that it pay full food stamp benefits pending the outcome of its appeal of that order. A three-judge panel on the appeals court denied that request on Friday.But within hours, Supreme Court Justice Ketanji Brown Jackson temporarily paused the order. Jackson directed the 1st Circuit to quickly rule on the administration's motion to impose an indefinite stay on the lower court's order mandating full benefits.The Trump administration previously said that it would not use a contingency fund containing $4.65 billion to fund the Supplemental Nutrition Assistance Program in November.U.S. District Court of Rhode Island Judge Jack McConnell on Oct. 31 told the administration to use that fund to pay partial benefits, at least, and to explore other options to provide full benefits.The administration, days later, said it would pay 65% of the benefits, but ruled out using so-called Section 32 funds to make up the difference.The total cost of full SNAP benefits for the month is around $8 billion.The program, like other federal programs, has no currently appropriated money, as a result of Congress failing to pass a spending bill. That failure led to the U.S. government shutdown on Oct. 1. Hopes that the shutdown may be nearing an end were buoyed Sunday evening after Senate lawmakers took a critical step towards a potential deal to reopen the government, but there are no guarantees lawmakers will come to an agreement anytime soon.Past administrations have continued paying SNAP benefits during prior shutdowns.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump administration demands that states 'undo' full SNAP benefit payments",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108220777-1762199988633-gettyimages-2244377423-US_GOV_FUNDING.jpeg?v=1762704539&w=1920&h=1080"
      ],
      "datePublished": "2025-11-10T04:08:57.000Z",
      "dateModified": "2025-11-10T04:08:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "SNAP benefits: Appeals court again rejects Trump admin bid to halt full payment order",
    "url": "https://www.cnbc.com/2025/11/10/snap-benefits-appeals-trump-food-stamps-supreme-court.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108208145-1759759414060-gettyimages-2239554828-_s019583_gxxduqro.jpeg?v=1762756802&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-10T06:51:04.000Z",
    "description": "U.S. Supreme Court Police stand behind security barriers in front of the Court building, which is obscured in construction scaffolding, on the first d",
    "body": "U.S. Supreme Court Police stand behind security barriers in front of the Court building, which is obscured in construction scaffolding, on the first day of the Court’s new term on October 06, 2025 in Washington, DC. Chip Somodevilla | Getty ImagesA federal appeals court in Boston, for a second time, late Sunday flatly rejected a request by the Trump administration to block a lower court judge's order that it pay 42 million Americans their full SNAP benefits during the government shutdown.But the judge's order remains paused as a result of a prior Supreme Court ruling until at least Tuesday night. That gives the administration time to return to the Supreme Court and ask for a permanent stay of the order pending its appeal of the case.The ruling Sunday by a three-judge panel of the 1st Circuit Court of Appeals came a day after the U.S. Department of Agriculture threatened states that have issued full benefits since Friday with financial penalties if they do not \"undo\" those payments. And it came hours after the Senate narrowly passed the first step of a bipartisan deal that might reopen the government within days, and fully fund the Supplemental Nutrition Assistance Program through next September.\"In reviewing the district court's balancing of the equities, we also cannot ignore the particular events preceding this litigation,\" wrote Circuit Court Judge Julie Rikelman in the panel's decision Sunday. \"As the district court found, 'this is a problem that could have been avoided.'\"\"The record here shows that the government sat on its hands for nearly a month, unprepared to make partial payments, while people who rely on SNAP received no benefits a week into November and counting,\" Rikelman wrote.\"In light of these unique facts, we cannot conclude that the district court abused its discretion in requiring full payment of November SNAP benefits to effectuate the October 31 [temporary restraining order after the government had failed to comply with it.\"The Trump administration on Oct. 24 broke decades of precedent when it said it would not pay SNAP benefits in November because Congress had not appropriated money for the program, or any other government program, past the date the shutdown began, Oct. 1. Past administrations had paid SNAP benefits in full during other shutdowns.Read more CNBC government shutdown coverageDuffy warns air travel will be ‘reduced to a trickle’ as the shutdown drags onTrump tells Republicans to send health insurance money 'directly to the people'Food banks in ‘disaster response mode’ due to shutdown, SNAP cuts, leaders saySenate Republicans reject Democrat deal to reopen governmentDemocratic leader offers deal to reopen government but Republicans sneerTrump admin asks Supreme Court to block order it pay full SNAP benefitsSNAP benefits must be fully paid by Trump administration by Friday, judge ordersDC sandwich thrower Sean Dunn found not guilty of assaulting federal agentJudge dismisses criminal case against Boeing over Max crashes despite skepticismNancy Pelosi announces retirement from CongressTrump bashes Mamdani after Democrats sweep key electionsSupreme Court justices appear skeptical that Trump tariffs are legalCalifornia voters approve new U.S. House map to boost Democrats in 2026Democrats win big on election night in key racesThe administration rejected the idea of the remaining $4.6 billion in a contingency fund that Congress had specifically allocated to backstop SNAP.A group of plaintiffs, comprised of nonprofits, local governments, a union, and a food retailer, sued the administration in U.S. District Court in Rhode Island seeking a judicial order forcing the administration to use the contingency fund and other pools of money to fully fund SNAP benefits.Judge Jack McConnell, who is overseeing the case, ordered the administration to make at least partial benefits as soon as possible by tapping the contingency fund, and to investigate if other money could be used.McConnell on Thursday ordered that the administration pay full benefits, days after the administration told him it would pay only partial benefits — but that it would take some time to do so — and told him that it had ruled out using so-called Section 32 funds. McConnell ordered that the administration use Section 32 funds to make up the difference between the 65% of benefits the administration planned to pay by using the contingency fund and the full value of the benefits. SNAP benefits cost about $8 billion each month.The administration then asked the 1st Circuit for a temporary stay of McConnell's order on an emergency basis, which the appeals court rejected on Friday.But the appeals court at the same time also said it was still considering the \"government's motion for a stay pending appeal [of McConnell's order] ... and we intend to issue a decision on that motion as quickly as possible.\"On Friday night, Supreme Court Ketanji Brown Jackson, acting on a request by the administration, paused McConnell's order from taking effect and told the 1st Circuit to quickly rule on the request for the stay pending appeal.Jackson's order paused for 48 hours any ruling by the 1st Circuit from taking effect. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "SNAP benefits: Appeals court again rejects Trump admin bid to halt full payment order",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108208145-1759759414060-gettyimages-2239554828-_s019583_gxxduqro.jpeg?v=1762756802&w=1920&h=1080"
      ],
      "datePublished": "2025-11-10T06:51:04.000Z",
      "dateModified": "2025-11-10T06:51:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Worried about layoffs? Economists say the job market is cooling but 'not falling off a cliff'",
    "url": "https://www.cnbc.com/2025/11/07/-economists-say-job-market-is-cooling-but-not-falling-off-a-cliff.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108222702-1762464339041-gettyimages-2202066593-generational_business-9785.jpeg?v=1762464351&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-07T17:48:12.000Z",
    "description": "A recent string of high-profile layoffs have taken up headlines and caused anxiety in the workforce.Companies announced 153,074 layoffs in October, ad",
    "body": "A recent string of high-profile layoffs have taken up headlines and caused anxiety in the workforce.Companies announced 153,074 layoffs in October, adding up to 1.1 million cut announcements for the year, according to outplacement firm Challenger, Gray & Christmas. That makes it the worst year for layoff notices since 2009, CNBC reported.But job experts say they're not in panic mode. Layoff news doesn't paint the whole picture of the job market. Private data around job openings, payrolls and employee sentiment show that hiring is cooling but \"not falling off a cliff,\" says Glassdoor chief economist Daniel Zhao.The Challenger monthly data can be volatile, for one, and layoff announcements haven't yet shown up in state-level weekly filings for unemployment benefits, which are still being released during the shutdown.\"I'm not alarmed,\" says Laura Ullrich, Indeed's director of economic research. The latest available data \"does not seem today to indicate that we're going into a high layoff period for the overall economy.\"Government shutdown and layoffs are hitting worker confidenceWhile economists aren't predicting a recession anytime soon, news of layoffs and the government shutdown is hitting worker confidence.The share of Glassdoor reviews mentioning layoffs is up 22% year-over-year as of October, according to data from the jobs site. Workers' confidence in the job market is down from a small rise in September and is close to a recent record-low set in June, according to Glassdoor data.Senior-level employees saw the biggest drops in confidence over the last year, dropping 4.6 percentage points since October 2024.That's concerning since leadership confidence spreads to other employees through hiring and investment plans. If senior leaders aren't confident their business is doing well, they could decide to reduce hiring or lay people off, Zhao says.Meanwhile, for those on the market, fewer people say they've gotten a job offer and declined it, signaling they have less leverage and might be settling for jobs rather than holding out for better ones, according to Glassdoor data.Health-care openings are making up for losses elsewhereMany workers are additionally competing for a smaller pool of opportunities. As of Oct. 31, job postings on Indeed are at their lowest level since 2021, continuing a declining trend for the last four years.Job postings are lowest in areas hit by the government shutdown, including Washington, D.C., and recent tech layoffs, like California and Washington.Openings are concentrated in health-care sectors, security and safety, and engineering, which on the whole are keeping the job market stable.\"I see it a tale of two economies,\" Ullrich says. \"There are certain fields where jobs are continuing to be added, and there's others that are shedding jobs.\"Health care and private education jobs have propped up the labor economy for some time: They make up about 17% of the jobs nationally but have accounted for 56% of job growth between July 2023 and July 2025.\"If health-care employment started dipping that would ring alarm bells for me,\" Ullrich says.The bigger picture: 'The job market is in a funk'Economists say available datasets can provide a pretty good picture of the job market, but official data from the Labor Department around hiring and unemployment are necessary for a best look at the health of the labor economy.The unemployment rate remained steady 4.3% in August, the last month of available government data.The Bureau of Labor Statistics missed another jobs report Friday due to the government shutdown. Economists surveyed by Dow Jones expect it would have shown a drop in 60,000 jobs and a rising unemployment rate to 4.5%, CNBC reported.The numbers we do have point overall to a continuously slowing job market. Economic uncertainty is weighing on employers' willingness to hire, Zhao says, meaning job-seekers are frozen out of the market and employed workers have less leverage to progress in their careers, win raises and stay engaged in the workplace.Hiring experts say building your network and asking for referrals are the best ways to get a job right now. To stand out in a competitive market, consider sharpening your resume to be outcomes-based, building your personal brand on LinkedIn and doing mock interviews, GrowthLoop senior recruiter Kathleen Nolan previously told CNBC Make It.\"Overall, I would say that the job market is in a funk right now,\" Zhao says. \"Even if unemployment is even [and] some of the top line indicators still point to a job market that is not historically bad, that doesn't necessarily mean that people are happy with where the job market is today.\"Want to level up your AI skills? Sign up for Smarter by CNBC Make It's new online course, How To Use AI To Communicate Better At Work. Get specific prompts to optimize emails, memos and presentations for tone, context and audience.Plus, sign up for CNBC Make It's newsletter to get tips and tricks for success at work, with money and in life, and request to join our exclusive community on LinkedIn to connect with experts and peers.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Worried about layoffs? Economists say the job market is cooling but 'not falling off a cliff'",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108222702-1762464339041-gettyimages-2202066593-generational_business-9785.jpeg?v=1762464351&w=1920&h=1080"
      ],
      "datePublished": "2025-11-07T17:48:12.000Z",
      "dateModified": "2025-11-07T17:48:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "COP30 gets underway in Brazil — and a Trump-shaped hole is hanging over the climate summit",
    "url": "https://www.cnbc.com/2025/11/10/cop30-in-brazil-a-trump-shaped-hole-is-hanging-over-the-climate-talks.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108222964-1762518174218-gettyimages-2236922706-mms23218_2gbnvqdv.jpeg?v=1762518338&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-10T08:57:26.000Z",
    "description": "The COP30 logo is seen in front of the central building ahead of the COP30 Brazil Amazonia 2025 on November 3, 2025 in Belem, Brazil.Wagner Meier | Ge",
    "body": "The COP30 logo is seen in front of the central building ahead of the COP30 Brazil Amazonia 2025 on November 3, 2025 in Belem, Brazil.Wagner Meier | Getty Images News | Getty ImagesU.N. climate talks get underway in Brazil on Monday, with delegations from almost every country set to convene on the outskirts of the Amazon rainforest to discuss how to tackle the climate crisis.The administration of U.S. President Donald Trump will be one notable absentee, however. The White House has confirmed it does intend to send any high-level representatives to the summit, marking an unprecedented absence of U.S. officials at the conference.Roughly 50,000 delegates are expected to attend the 30th edition of the U.N. climate conference, known as COP30, with talks set to run through to Nov. 21.Anna Aberg, research fellow at the Environment and Society Centre at Chatham House, a London-based think tank, said it was likely a positive for the international community that the Trump administration won't send any officials to Belem.\"It's, of course, really unfortunate that the Trump administration has withdrawn the U.S. from the Paris Agreement for a second time … and that they are pursuing this very forceful anti-climate agenda both in the U.S., and increasingly also overseas,\" Aberg told CNBC by telephone.\"In light of this, I think it is just as well that they're not sending any senior officials to COP to be honest because I don't know what they would have been able to contribute given the way Trump is talking about climate change.\"watch nowTrump's views on the climate crisis are well known.The U.S. president has repeatedly described global heating as a \"hoax\" and speaking at the U.N. General Assembly in late September, said that climate change was the \"greatest con job ever perpetrated on the world.\"Trump also urged other countries to shift away from renewable energy. \"If you don't get away from the green energy scam, your country is going to fail,\" Trump said on Sept. 23.Chinese President Xi Jinping and Indian Prime Minister Narendra Modi are among some of the other heads of state expected to skip the talks, although both countries are set to send delegations in their place.What's on the table at COP30?The annual U.N. climate summit is seen as a prime opportunity for the international community to move from setting decarbonization targets to delivering on them.Some of the core issues set to be discussed include a push to deliver on national climate commitments (NDCs), a transformation of the global financial system, ramping up adaptation measures and taking steps to protect nature.The conference comes at a time when the impacts of climate change have become increasingly clear — even as the issue has slipped down the immediate geopolitical agenda.Read moreSpeaking to world leaders as they prepare to convene for COP30, U.N. Secretary General António Guterres called for urgent action to drive down global temperatures and keep the 1.5 degrees Celsius target within reach.\"Every fraction of a degree means more hunger, displacement, and loss – especially for those least responsible. It could push ecosystems past irreversible tipping points, expose billions to unlivable conditions, and amplify threats to peace and security,\" Guterres said on Thursday in Belém.Failure to limit global heating would amount to \"moral failure and deadly negligence,\" he added.One of the most important issues at stake at COP30, Chatham House's Aberg said, was for the international community to deliver a shot in the arm for global efforts to tackle the climate crisis.\"We're in this really tricky geopolitical environment, not least given the U.S. withdrawal, and there are lots of things that this COP needs to achieve,\" Aberg said.Brazil's President Luiz Inacio Lula da Silva attends the General Plenary of Leaders in the framework of the COP30 UN Climate Change Conference in Belem, Para State, Brazil, on November 6, 2025.    Pablo Porciuncula | Afp | Getty Images\"But I actually think that the most important thing it can do is to send a signal to the rest of the world that there are still governments and businesses and institutions that want to take action on climate change and are already taking action on climate change.\"Like many others, Aberg said that while the U.N. talks will be \"really important\" in shaping the discussion on how to tackle the climate crisis, the outcome was highly likely to be underwhelming.What do business leaders want to happen?Business leaders called on policymakers to provide further incentives to help accelerate climate action.Anders Danielsson, CEO of Skanska, for example, said the Swedish construction company is confident it can deliver on its own climate targets, while acknowledging that \"we cannot do it on our own.\"Speaking to CNBC's \"Europe Early Edition\" on Thursday, Danielsson said: \"We need political willingness to drive this forward.\"People watch as the sun rises over Ben Buckler Point in Bondi on November 27, 2024 in Sydney, Australia.Brook Mitchell | Getty Images News | Getty ImagesTobias Meyer, CEO of logistics giant DHL Group, said that he \"strongly\" believed a global price on carbon would be the best incentive to help curb rising greenhouse gas emissions.\"I think we need to get the job done,\" Meyer told CNBC on Thursday. \"We need a price [on] CO2 emissions that needs to be done globally. That's the best tool. Strongly believe in that, and then business needs to react to those price signals and use the technology that is available to drive down emissions.\"Meanwhile, Henrik Andersen, CEO of Danish wind turbine firm Vestas, urged renewable industry leaders to make sure they continue to make themselves heard in the shift toward low-carbon technologies.\"It's not only about COP,\" Andersen told CNBC's \"Squawk Box Europe\" on Wednesday. \"When COP becomes a theoretical exercise to calculate what it means to keep 1.5 degrees increase [alive] and it's no longer possible, then probably reinvent yourself is my best advice,\" he added.— CNBC's Emilia Hardie contributed to this report.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "COP30 gets underway in Brazil — and a Trump-shaped hole is hanging over the climate summit",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108222964-1762518174218-gettyimages-2236922706-mms23218_2gbnvqdv.jpeg?v=1762518338&w=1920&h=1080"
      ],
      "datePublished": "2025-11-10T08:57:26.000Z",
      "dateModified": "2025-11-10T08:57:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Japanese investors turn to Europe as deep tech boom lures capital abroad",
    "url": "https://www.cnbc.com/2025/11/10/japanese-investors-turn-to-europe-in-lieu-of-own-ecosystem.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107350350-1703123113518-gettyimages-1858399319-AFP_34884Y3.jpeg?v=1762518007&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-10T11:22:03.000Z",
    "description": "Huge swathes of cash are flowing from Japan to European tech startups as risk-averse investors favor a more mature entrepreneurial ecosystem, helping ",
    "body": "Huge swathes of cash are flowing from Japan to European tech startups as risk-averse investors favor a more mature entrepreneurial ecosystem, helping to scale the continent's booming deep tech cluster.While the European startup and venture capital ecosystem has long operated in the shadow of Silicon Valley, it has become fertile ground for Japanese corporates, whose domestic market is younger.  Japanese investors or venture capital funds who themselves have Japanese investors, known as limited partners, participated in European financing rounds worth more than 33 billion euros ($38 billion) since 2019 when a trade deal between the European Union and Japan came into force, according to research from venture capital fund NordicNinja and data platform Dealroom.   For the five years leading up to the EU-Japan Economic Partnership Agreement, investment totaled 5.3 billion euros.In Europe at that time, \"there was no Japanese capital other than Softbank,\" Tomosaku Sohara, co-founder and managing Partner of Japan-Europe VC NordicNinja, told CNBC. NordicNinja, which has 250 million euros of assets under management, is a joint venture between Japan's JBIC IG Partners and private equity firm BaltCap.\"Softbank was pretty active already at that moment, because they had acquired Finnish gaming company Supercell,\" Sohara said, noting that the acquisition injected life into Finland's startup ecosystem. Now, Mitsubishi, Sanden, Yamato Holdings, and Marunouchi Innovation Partners are among those directly backing European tech, per the report, while Japan-linked venture capital firms such as NordicNinja, Byfounders, and Toyota's Woven Capital cut checks to startups on the continent. There are over two times more VC-backed startups in Europe than in Japan, per capita, and 4.3 times more unicorns, per the report. The shadow of Silicon Valley  Japan's appetite for investing was always there, Sohara said. Its multinationals — like many — headed stateside to set up corporate venture capital arms in early 2000, in search of a slice of the action at the time when some of today's largest companies were just being thought up in dorm rooms.  \"Nobody wanted to look at Europe at that moment, but I think that after a couple of years they realized, 'Hey, maybe the U.S. culture is totally different from the Japanese culture,' and they began thinking, 'Hey, maybe we need to look at another region like Europe,'\" Sohara said, adding that the profile of entrepreneurs in Europe, many of whom came from large corporates at the time, was more aligned with Japan. That's in contrast to the young founders coming from Stanford or university research and development departments, he said.\"They have experience at the corporates and also they have a mindset of entrepreneurship. Japan, unfortunately, is lacking the entrepreneurship mindset,\" Sohara added, referring to Europe's founders, many of whom came from Nokia and Skype.The pull for foundersJapanese-linked investors have a penchant for one sector in particular: deep tech, which refers to companies building on top of scientific or engineering innovation. Deep tech and artificial intelligence accounted for 70% of deals made by such investors in Europe in 2024, echoing trends in the broader startup ecosystem as the AI, energy, and defense industries boom.  The top-funded companies with Japanese participation include the U.K.'s autonomous vehicle startup Wayve, which raised $1.05 billion in an investment round in May 2024, British quantum computing firm Quantinuum, which secured 273 million euros in January 2024, and Spanish quantum firm Multiverse Computing, which saw investors cut it a check of 189 million euros in June 2025. The rounds were backed by Softbank, Mitsui and Toshiba, respectively.  Such companies, however, typically need a lot of growth capital and industrial experience to scale successfully — two elements that Europe famously lacks.  \"Investment appetite is way stronger than [in] any strategics I've seen here in Germany or in Europe,\"Sarah Fleischerco-founder and CEO, Tozero\"Japanese firms — and they're old, most of them that we're talking about, right — they're just sitting on a pile of money. They've been saving money throughout the last century, and now they're starting to spend it, to try to grow as a large corporate and increase their footprint outside of Japan,\" said Sarah Fleischer, co-founder and CEO of Germany-based battery materials recycling startup Tozero. \"You see that investment appetite is way stronger than [in] any strategics I've seen here in Germany or in Europe,\" she added. Tozero has raised 14.5 million euros to date and counts NordicNinja, Honda and JJC among its investors.It's not just about the check. Japanese corporates and industrials have robust manufacturing and automotive know-how, Fleischer and Sohara noted respectively, meaning they are well positioned to plug Europe's knowledge gaps when it comes to scaling large manufacturing projects.Fleischer added that Japanese firms have long shored up their critical minerals supply chain and long-established trading firms, meaning they know how to secure essential components needed for the energy transition. For Tozero, this is an added plus, Fleischer said, given it's in the business of recovering such materials from spent batteries. In the age of political uncertainty amid choppy U.S.-China relations, Japan also acts as a good bridge to the Asian markets, Fleischer said.A slower pace and lower risk appetiteBack in Japan, the number of entrepreneurs is \"still very limited,\" Sohara said, as the older generation and \"great talents\" wanted to work for \"a Toyota and Honda or Sony,\" he added, but the younger generation's mindset is beginning to change.  Europe has also become the home to ambitious would-be founders searching for a tech ecosystem to build their companies in, Sohara said.However, as collaboration between Europe and Japan scales, language remains a barrier as fluency in English is not widespread in Japan, he added.  For Fleischer, this also poses challenges. \"There's so much miscommunication and local translation that could ruin a partnership instantly. And there's also some sort of cultural aspect as well, one needs to probably be aware of,\" she said, adding that she recently spent weeks in Japan getting to know her investors face-to-face, \"because that's still the sentiment\" there.  Decision-making can therefore be slower, the founder said, due to thorough research and preparation. \"They just do their homework,\" Fleischer said, noting that Japanese partners were hands-on in helping the company understand \"how to build our next future commercial plant, potentially starting from Japan and then going worldwide.\"watch nowIndeed, \"without the support from NN [NordicNinja] it would have been much more difficult to build the right relationships,\" said Aaike van Vugt, co-founder and CEO of Dutch nanotechnology engineering firm VSParticle.That's in contrast to perhaps the most well-known Japanese player: Softbank. Softbank is \"totally different\" from traditional Japanese investor cultures, given it is driven by founder Masayoshi Son's decisions rather than operating on a consensus basis, like most Japanese business, Sohara added.  The venture firm, known for its lofty bets on WeWork and, more recently, chip company Arm, poured huge sums of cash into tech startups amid the 2021 venture capital tech boom, which saw at least one Japanese-linked investor involved in deals worth 11.2 billion euros, per the report. Softbank stood out during this period; it was involved in 22% of deals with Japanese-linked participation in 2021.Interest ticking upLooking forward, Sohara and Fleischer expect greater collaboration between Europe and Japan. However, Japanese investors are expected to participate in rounds worth 3 billion euros in 2025, per the Dealroom and NordicNinja report, representing a dip from last year.  As many eyes turn to the Middle East for investment, Fleischer said that interest in Japan appears to be ticking up. Anecdotally, \"people reach out to me for intros, which is fun, to meet Japanese corporate LPs,\" she said, noting that this is a new development for her but that it may simply be because she has such investors now. \"I think it's also politically driven as well in Japan, by the government, to position themselves more geopolitically smartly and make sure that the corporates or the industries grow in certain ecosystems, strengthening their positioning as a country,\" she said.  ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Japanese investors turn to Europe as deep tech boom lures capital abroad",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107350350-1703123113518-gettyimages-1858399319-AFP_34884Y3.jpeg?v=1762518007&w=1920&h=1080"
      ],
      "datePublished": "2025-11-10T11:22:03.000Z",
      "dateModified": "2025-11-10T11:22:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Transportation Sec. Duffy warns air travel will be 'reduced to a trickle,' with flight cancellations worsening as the shutdown drags on",
    "url": "https://www.cnbc.com/2025/11/08/government-shutdown-flight-cancelations-faa.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108217919-17616677242025-10-28t160147z_1115101525_rc24lhaqlcw3_rtrmadp_0_usa-shutdown-travel.jpeg?v=1761667740&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-10T04:06:07.000Z",
    "description": "U.S. Transportation Secretary Sean Duffy holds a press conference on the impact of the government shutdown on air travel, at LaGuardia Airport in the ",
    "body": "U.S. Transportation Secretary Sean Duffy holds a press conference on the impact of the government shutdown on air travel, at LaGuardia Airport in the Queens borough of New York City, U.S., October 28, 2025. Shannon Stapleton | ReutersCommercial air travel in the U.S. will be reduced to \"a trickle\" ahead of Thanksgiving as a result of rising air traffic control staffing problems said Transportation Secretary Sean Duffy as hundreds of thousands of travelers' plans were upended by disruptions this weekend.The Trump administration last week ordered airlines to cut 4% of domestic flights at 40 major U.S. airports due to staffing shortages starting last Friday. That number is set to rise to 10% next Friday if the shutdown doesn't end. Government officials blamed \"increased reports of strain on the system from both pilots and air traffic controllers\" in large part due to the government shutdown — now the longest in U.S. history.Air traffic controller shortages snarled travel at major airports coast-to-coast over the weekend, in addition to the hundreds of flights airlines had already canceled under the order. So far this weekend, 16,440 U.S. flights were delayed and 3,788 were canceled, according to FlightAware. More than 2,500 were canceled on Sunday.In a sign of how the problems were growing more severe Sunday ranked the 11th worst for canceled U.S. flights since Jan. 1, 2024, while Friday's levels ranked 72nd, according to tallies from aviation data firm Cirium.Airlines for America, an industry group that represents the largest U.S. airlines, said 71% of the delay time on Saturday was due to air traffic staffing shortfalls.The country's airlines will have to cut hundreds more flights in the week ahead if Congress can't come to a swift resolution to the shutdown. Hopes that the shutdown may be nearing an end were buoyed Sunday evening after Senate lawmakers took a critical step towards a potential deal to reopen the government.Air traffic controllers, along with airport security screeners, are among those required to work during the shutdown without receiving their regular paychecks. Federal workers will miss their second full paycheck on Monday, according to their union. Some controllers have taken second jobs to make ends meet, union officials have said.The shutdown has again thrust air traffic controllers, already in short supply before lawmakers' impasse, into the spotlight. The U.S. government shutdown that lasted between late 2018 and early 2019, then the longest on record, ended hours after air traffic controller shortages snarled travel in the Northeast, compared with the much longer-lasting problems now.On Sunday, Duffy warned air travel in the run-up to Thanksgiving is \"only going to get worse\" if the shutdown drags on.\"The two weeks before Thanksgiving, you're going to see air travel be reduced to a trickle,\" he said on CNN's \"State of the Union.\"Travel around Thanksgiving Day — this year taking place on Nov. 27 — is typically among the busiest of the year as millions of people head home for the holidays.\"Many of them are not going to be able to get on an airplane, because there are not going to be that many flights that fly if this thing doesn't open back up,\" he said.Airlines cautioned travelers to expect delays and urged lawmakers to end the shutdown.\"Due to the prolonged government shutdown and nationwide air traffic control staffing shortages, we, like most airlines, are experiencing additional and widespread delays and cancellations across the country today despite the advanced cancellations that the FAA required us to make,\" American Airlines said in a notice to customers Saturday. \"We, again, urge leaders in Washington, D.C., to reach an immediate resolution to end the shutdown.\"Pre-planned cuts from the order were on par with a day of severe thunderstorms, which can be disruptive, though they're routine, and major airlines said many passengers were booked on other flights.Under the FAA's order, the flight cuts, first set at 4% of flights will increase to 6% of schedules, 8% by Thursday and 10% next Friday. Transportation Secretary Sean Duffy told Fox News on Friday that cuts could eventually reach up to 20% of schedules, although he didn't elaborate. Airlines weren't required to cut international flights.watch nowThe disruptions are occurring at a generally low travel season, but the key Thanksgiving holiday weekend is less than three weeks away. The impact for airlines could quadruple given how fares during that high-demand period spike, Seaport Research Partners airline analyst Daniel McKenzie said in a note on Friday.Airlines this week waived date-change fees for travelers on affected flights and noted they can also request a refund.Airline executives stated that many customers were being rebooked on alternative flights, while last-minute changes sent others scrambling for other arrangements. Hertz, for example, stated on Thursday that, when the FAA made its flight-cut announcement, one-way car rentals increased by 20% over the same two-day period a year earlier.Delays rose throughout the weekend as air traffic control staffing shortages prompted delays at major airports including Delta Air Lines hub Hartsfield-Jackson Atlanta International Airport, San Francisco International Airport, John F. Kennedy International Airport in New York, United Airlines hubs Newark Liberty International Airport in New Jersey and Houston's George Bush Intercontinental Airport, and at  Charlotte Douglas International Airport, a busy American hub, as well as Chicago O'Hare International Airport.Here are the airports where the FAA and DOT cuts apply:Impacted airports:ANC - Anchorage InternationalATL - Hartsfield-Jackson Atlanta InternationalBOS - Boston Logan InternationalBWI - Baltimore/Washington InternationalCLT - Charlotte Douglas InternationalCVG - Cincinnati/Northern Kentucky InternationalDAL - Dallas LoveDCA - Ronald Reagan Washington NationalDEN - Denver InternationalDFW - Dallas/Fort Worth InternationalDTW - Detroit Metropolitan Wayne CountyEWR - Newark Liberty InternationalFLL - Fort Lauderdale/Hollywood InternationalHNL - Honolulu InternationalHOU - Houston HobbyIAD - Washington Dulles InternationalIAH - George Bush Houston IntercontinentalIND - Indianapolis InternationalJFK - New York John F. Kennedy InternationalLAS - Las Vegas McCarran InternationalLAX - Los Angeles InternationalLGA - New York LaGuardiaMCO - Orlando InternationalMDW - Chicago MidwayMEM - Memphis InternationalMIA - Miami InternationalMSP - Minneapolis/St. Paul InternationalOAK - Oakland InternationalONT - Ontario InternationalORD - Chicago O'Hare InternationalPDX - Portland InternationalPHL - Philadelphia InternationalPHX - Phoenix Sky Harbor InternationalSAN - San Diego InternationalSDF - Louisville InternationalSEA - Seattle/Tacoma InternationalSFO - San Francisco InternationalSLC - Salt Lake City InternationalTEB - TeterboroTPA - Tampa InternationalRead more CNBC airline newsAmerican Airlines is arriving late to the luxury travel boom. Can it catch up?Boeing gets FAA approval to hike 737 Max outputAir traffic control shortages add to U.S. flight delays, FAA saysSpirit wins court approval for a $475 million bankruptcy lifeline",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Transportation Sec. Duffy warns air travel will be 'reduced to a trickle,' with flight cancellations worsening as the shutdown drags on",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108217919-17616677242025-10-28t160147z_1115101525_rc24lhaqlcw3_rtrmadp_0_usa-shutdown-travel.jpeg?v=1761667740&w=1920&h=1080"
      ],
      "datePublished": "2025-11-10T04:06:07.000Z",
      "dateModified": "2025-11-10T04:06:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "FAA prohibits most private jets at 12 major airports amid shutdown's air traffic staffing problems",
    "url": "https://www.cnbc.com/2025/11/10/government-shutdown-private-jets.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108020336-1723645951005-gettyimages-2157473807-20240612-202513.jpeg?v=1723810431&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-10T10:13:05.000Z",
    "description": "A Gulfstream G-IV private jet flies past clouds at sunset on approach to Washington's Reagan National Airport on June 12, 2024, in Arlington, Virginia",
    "body": "A Gulfstream G-IV private jet flies past clouds at sunset on approach to Washington's Reagan National Airport on June 12, 2024, in Arlington, Virginia.J. David Ake | Getty ImagesThe Federal Aviation Administration on Monday will \"effectively prohibit business aviation\" at a dozen major U.S. airports, adding to flight restrictions for commercial airlines as air traffic controller shortages snarl travel in the government shutdown, a trade group said.Last week, the Trump administration ordered U.S. commercial airlines to cut their schedules to ease strains on air traffic controllers who are working without their regular paychecks in the shutdown. They didn't require cuts to private flights, though the air traffic shortages have slowed travel broadly.The first commercial airline flight cuts of 4% went into affect on Friday and are set to rise to 10% of flights by Friday.More than 4,500 commercial flights were canceled over the weekend and more than 17,000 were delayed as staffing shortages worsened around the country, according to FlightAware. Aviation-industry members applauded the Senate's progress toward ending the shutdown late Sunday, though a solution for the longest-ever such impasse hasn't been finalized.\"Safety is the cornerstone of business aviation, and NBAA is fully committed to ensuring the safety of the NAS,\" said National Business Aviation Association President and CEO Ed Bolen in a statement late Sunday. \"Among the ways we will do that is to ensure business aviation operators have an understanding of these restrictions and their implications.The FAA didn't immediately comment.Here are the airports included in the new restrictions, according to the NBAA:Chicago O'Hare International Airport (ORD)Dallas Fort Worth International Airport (DFW)Denver International Airport (DEN)General Edward Lawrence Logan International Airport (BOS)George Bush Intercontinental Airport (IAH)Hartsfield-Jackson Atlanta International Airport (ATL)John F. Kennedy International Airport (JFK)Los Angeles International Airport (LAX)Newark Liberty International Airport (EWR)Phoenix Sky Harbor International Airport (PHX)Ronald Reagan Washington National Airport (DCA)Seattle-Tacoma International Airport (SEA)Read more CNBC airline newsAmerican Airlines is arriving late to the luxury travel boom. Can it catch up?Boeing gets FAA approval to hike 737 Max outputAir traffic control shortages add to U.S. flight delays, FAA saysSpirit wins court approval for a $475 million bankruptcy lifeline",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "FAA prohibits most private jets at 12 major airports amid shutdown's air traffic staffing problems",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108020336-1723645951005-gettyimages-2157473807-20240612-202513.jpeg?v=1723810431&w=1920&h=1080"
      ],
      "datePublished": "2025-11-10T10:13:05.000Z",
      "dateModified": "2025-11-10T10:13:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This neuroscientist-approved habit tracks my progress—and boosts my happiness",
    "url": "https://www.cnbc.com/2025/11/09/this-neuroscientist-approved-habit-boosts-my-happiness.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108222495-1762449130830-gettyimages-1471925663-jsmf02716.jpeg?v=1762449223&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-09T15:00:02.000Z",
    "description": "Each year, I sit down to type a heartfelt email and schedule it to send exactly a year later to an unlikely recipient: me. It's a practice I've done s",
    "body": "Each year, I sit down to type a heartfelt email and schedule it to send exactly a year later to an unlikely recipient: me. It's a practice I've done since 2022.When I receive a letter from my past self, it's a pleasant surprise and reminds me of what I'd hoped for 365 days ago — and what I've experienced since then.\"You are deserving of the best of everything. If that means being in a new living space next year, I know that will pan out,\" I wrote to myself in October of 2023. A year later, I sat in my first apartment reading the letter and beaming with joy.It wasn't the first time I'd had that experience. In that same letter from 2023 I wrote, \"I'm currently listening to Stevie Wonder.\" I'd just seen the music icon perform live a few days before the message arrived in my inbox.For the past three years, I've written letters to myself and scheduled them to send to me a year later.But it's not just the goals I set and achieved, or the synchronicities I didn't anticipate, that stand out to me. In each letter, I always encouraged myself to be more compassionate, to rest when I need to and to remember that \"simply existing is enough. Anything else is surplus.\"It turns out that without even realizing it, I developed a healthy routine that can have great benefits on my mental health, says Erin Clabough, a neuroscientist, author and professor of psychology at the University of Virginia.\"One thing that we don't do as much as we should as a culture is we don't stop and think about the direction that things are going,\" Clabough tells CNBC Make It. \"A letter to your future self can really help with that.\"Here's why Clabough recommends the practice, and what you should consider when you sit down to write your own letter.Be the captain of your shipPenning letters to your future self creates opportunities for checking in and gauging if you're in alignment with \"the life that we want to be living and the values that we say we have,\" Clabough says.Reading the letter days, months or years in the future is a helpful tool for reflection because it gives you the ability to grow and change, she notes. \"The idea that in the future, you're going to come back and read that letter, I think that's equally as important as writing it down.\"And the type of message you write can determine whether or not the practice will have positive or negative impacts on your mental health, Clabough says.\"I'm actually not a huge fan of specific goal-setting. What I think is more useful is to set your intentions and to leave it really open-ended,\" she says. \"You're supposed to be really compassionate to yourself and kind to yourself in this letter.\"Clabough suggests asking these questions when writing to your future self:What's working well in my life?What's not working? What doesn't feel in alignment with how I want my life to be?How am I spending my time, energy and resources?What are my priorities and values?Think of your life as a ship, and view your letter to yourself as the compass that is nudging you to go in the direction that you desire, she says.I think this is something that should be utilized by all sorts of people, no matter their walks of life.Erin ClaboughNeuroscientist and author\"You're more likely, when captaining the ship, to go towards that direction,\" as a result, she notes. \"You can look at the idea of a placebo, and you can see that our belief in what we're doing and what's happening to us actually makes a huge difference.\"Clabough recommends writing a letter to yourself at least once a year, but also encourages having \"little points along the way where we more intentionally check in with ourselves.\"In her own life, she finds it helpful to pick up her pen and write to herself, \"when I'm going through a hard thing,\" she says.\"I have in the past flipped ahead 40 pages [in my journal], and I've written my letter to my future self at that point, so that when I'm writing in my journal, at some point, I'm going to hit it,\" Clabough says.In her entry, she affirms that she's doing her best and writes about how she hopes to feel by the time she reaches the letter in her journal.\"Setting intentions makes a difference,\" she says. \"I think this is something that should be utilized by all sorts of people, no matter their walks of life.\"Want to level up your AI skills? Sign up for Smarter by CNBC Make It's new online course, How To Use AI To Communicate Better At Work. Get specific prompts to optimize emails, memos and presentations for tone, context and audience.Plus, sign up for CNBC Make It's newsletter to get tips and tricks for success at work, with money and in life, and request to join our exclusive community on LinkedIn to connect with experts and peers.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This neuroscientist-approved habit tracks my progress—and boosts my happiness",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108222495-1762449130830-gettyimages-1471925663-jsmf02716.jpeg?v=1762449223&w=1920&h=1080"
      ],
      "datePublished": "2025-11-09T15:00:02.000Z",
      "dateModified": "2025-11-09T15:00:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "SoftBank-backed Lenskart wobbles after volatile debut despite oversubscribed IPO",
    "url": "https://www.cnbc.com/2025/11/10/softbank-backed-lenskart-volatile-debut-oversubscribed-ipo-peyush-bansal-bse-nse-eyewear-india-shark-tank.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108223443-1762764247191-gettyimages-2245409802-INDIA_LENSKART.jpeg?v=1762764261&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-10T08:46:52.000Z",
    "description": "A Lenskart Solutions Ltd. store in Mumbai, India, on Sunday, Nov. 9, 2025.Bloomberg | Bloomberg | Getty ImagesShares of SoftBank-backed eyewear retail",
    "body": "A Lenskart Solutions Ltd. store in Mumbai, India, on Sunday, Nov. 9, 2025.Bloomberg | Bloomberg | Getty ImagesShares of SoftBank-backed eyewear retailer Lenskart Solutions had a weak debut Monday, slipping as much as 11% below their issue price before recovering in early trade.Lenskart shares were last trading 0.05% higher at 402.2 Indian rupees ($4.53), compared with its IPO issue price of 402 rupees.The tepid start contrasts with home service startup Urban Company's blockbuster listing in September, which rose over 60% on its debut.Lenskart's $828 million IPO was among India's most anticipated this year, drawing bids more than 28 times the shares on offer. Institutional investors and high-net-worth individuals led the demand, while retail interest was relatively muted.Stock Chart IconStock chart iconSoftbank-backed Lenskart IPO gets a tepid response from investorsMany smaller investors have been chasing short-term gains by \"jumping from one IPO to another,\" Bhavesh Shah, head of investment banking at Equirus Capital, told CNBC. This churn from one IPO to another is creating selling pressure on the listing day, he added.A study by India's market regulator, the Securities and Exchange Board of India, found that 54% of IPO Shares allotted to investors — excluding anchor investors — are sold within a week. Between April 2021 and December 2024, retail investors sold 50% of the shares allotted to them by value within a week of listing, and 70% of shares by value within a year, the study revealed.Valuing vision?Lenskart's IPO was a hotly debated topic on social media in India last week, with some analysts arguing that the issue \"overvalued\" the company.\"The IPO price valued Lenkart at a [price–earnings ratio] of over 200 times and even then, most of the company's earnings for [the financial year] 25 were derived from non-core business operations,\" said Devina Mehra, Founder of investment firm First Global.Others defended the growth prospects of one of India's most storied startups. Sarthak Ahuja, an investment banker, highlighted in a social media post that several marquee institutional investors participated early in Lenskart's offering.Some of the top institutional investors in the Lenskart IPO include the Government of Singapore (2.97%) and global investors like BlackRock and Fidelity, which bought shares through multiple funds.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "SoftBank-backed Lenskart wobbles after volatile debut despite oversubscribed IPO",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108223443-1762764247191-gettyimages-2245409802-INDIA_LENSKART.jpeg?v=1762764261&w=1920&h=1080"
      ],
      "datePublished": "2025-11-10T08:46:52.000Z",
      "dateModified": "2025-11-10T08:46:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]