[
  {
    "title": "8 timeless money lessons from my 79-year-old dad: 'Being cheap and being frugal aren’t the same thing'",
    "url": "https://www.cnbc.com/2025/12/26/8-money-lessons-from-a-79-year-old-that-stand-the-test-of-time.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108245345-1766517963074-GettyImages-157193506.jpg?v=1766518004&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-26T14:01:29.000Z",
    "description": "When I think back on my childhood, my happiest memories aren't tied to things I owned. They're about the freedom of growing up in a small Ohio town wh",
    "body": "When I think back on my childhood, my happiest memories aren't tied to things I owned. They're about the freedom of growing up in a small Ohio town where everyone knew your name and kids ran in packs.The neighborhood park was our meeting place. A few bikes tossed in a friend's front yard signaled the game was on. There were no texts or group chats. But childhood today often looks different. Connection revolves around gaming consoles, phones, sneakers, and the next must-have gadget. If you can't afford it, you risk being left out.That contrast led me to talk to my 79-year-old dad, a man who wears thriftiness the way others wear luxury. He genuinely enjoys finding new ways to save money. He never tried to keep up with anyone. While others rushed to buy the newest car or gadget, he was content with what he had. That mindset made him the quintessential millionaire next door.He helped shaped my relationship with money. I don't feel compelled to chase status or possessions. Here are eight lessons from my frugal dad that have stood the test of time — and how they still apply today.1. Let your values guide your financial decisionsEvery dollar you spend is a vote for the life you want to build. When your spending aligns with what matters most, money feels less like sacrifice and more like purpose. For couples especially, shared values turn financial decisions into a source of clarity instead of conflict.2. You can always earn more money, but not timeImagine you could swap places with legendary investor Warren Buffett, now 95. Would you? Time is scarce and unrecoverable, unlike money. Remember this when deciding whether to take a promotion just for a bigger paycheck, even if it means less time with family; or working longer hours for a fancier car when your current one works fine; or buying a bigger house when your kids already attend a great school in a safe neighborhood.3. The best investment you can make is in yourselfThe returns on personal growth compound for decades. Education, learning a new skill, reading widely, or even investing in therapy can strengthen both your earning potential and your resilience. In a partnership, personal growth benefits everyone — stronger individuals make stronger teams.4. Debt steals tomorrow’s optionsEvery borrowed dollar limits future freedom. A loan may feel manageable today, but it quietly shapes your choices tomorrow, from the jobs you can take to where you can live. Prioritizing flexibility over financing buys peace of mind and the ability to pivot when life changes.5. Turn off the lights when you leave the roomTurning the lights off is a metaphor for the small things we do. It’s more than about saving a few cents on electricity; it’s a mindfulness practice. Every small act of frugality adds up, and it builds awareness of how we use our resources. 6. Celebrate simplicityA quiet life is often an intentional one. Choosing simplicity means choosing time over things, presence over pressure, and meaning over noise. Less clutter often leads to less stress — and more room for what actually matters.7. New cars destroy wealthThe average new car now sells for over $50,000, and when you factor in financing, fuel, and insurance, monthly costs can exceed $1,200. Vehicles that are about three years old often hit the sweet spot between price and reliability. Investing the difference between new and used can significantly boost long-term net worth.8. Being cheap and being frugal aren’t the same thingCheapness cuts corners at all costs. Frugality focuses on getting value for your money. A frugal person maintains what they own, spends intentionally, and is generous where it counts. Understanding that difference can prevent endless money conflicts because frugality builds a meaningful life, while cheapness slowly erodes joy.Brian Page is the founder of Modern Husbands, a company dedicated to helping couples manage both financial and home responsibilities as a team. He holds a master's degree in education and is certified as both an Accredited Financial Counselor® and a Fair Play Certified® domestic labor specialist.Want to give your kids the ultimate advantage? Sign up for CNBC's new online course, How to Raise Financially Smart Kids. Learn how to build healthy financial habits today to set your children up for greater success in the future.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "8 timeless money lessons from my 79-year-old dad: 'Being cheap and being frugal aren’t the same thing'",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108245345-1766517963074-GettyImages-157193506.jpg?v=1766518004&w=1920&h=1080"
      ],
      "datePublished": "2025-12-26T14:01:29.000Z",
      "dateModified": "2025-12-26T14:01:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Waymo pauses robotaxis in SF again due to flash flood warnings on Christmas Day",
    "url": "https://www.cnbc.com/2025/12/25/waymo-pauses-robotaxis-in-sf-again-due-to-flash-flood-warnings-on-christmas-day.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108243326-1766012944148-gettyimages-2251802458-WAYMO_VALUATION.jpeg?v=1766012995&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-25T21:34:07.000Z",
    "description": "Waymo autonomous taxis turns onto Post Street in San Francisco, California, US, on Wednesday, Dec. 17, 2025. David Paul Morris | Bloomberg | Getty Ima",
    "body": "Waymo autonomous taxis turns onto Post Street in San Francisco, California, US, on Wednesday, Dec. 17, 2025. David Paul Morris | Bloomberg | Getty ImagesWaymo temporarily paused its robotaxi service in the San Francisco Bay Area on Thursday, ahead of expected storms in the area, according to a customer notification in the company's driverless ride-hailing app.\"Service temporarily paused due to National Weather Service flash flood warning,\" the notification read.Earlier this week the Alphabet-owned company said it will update its fleet so its robotaxi service is better able to perform during power outages.On Dec. 20, Waymo paused service during a blackout in San Francisco that left tens of thousands of people in the area without power and caused some of its autonomous vehicles to halt in mid-traffic, contributing to or causing gridlock.The National Weather Service extended a flood watch for the entire San Francisco Bay Area through Friday 10 p.m. local time.Waymo didn't immediately respond to a request for comment, or say whether regulators required its service pause on Thursday given the flash flood warnings.The California Public Utilities Commission — which regulates driverless ride-hailing services in the state — did not immediately respond to requests for information during the Christmas holiday on Thursday.Waymo currently operates a commercial, driverless service in five U.S. markets, up from three at the end of 2024. Waymo's robotaxi service has been operating in Austin, the San Francisco Bay Area, Phoenix, Atlanta and Los Angeles this year. The company intends to significantly expand its service area across and beyond the U.S. in 2026, CNBC previously reported.Waymo is facing increased public scrutiny and safety concerns as it attempts to expand its robotaxi service.The former CEO of San Francisco's Municipal Transit Authority, Jeffrey Tumlin, told CNBC that regulators and robotaxi companies can take valuable lessons away from the chaos that arose with Waymo vehicles during the PG&E power outages last week.\"I think we need to be asking 'what is a reasonable number of [autonomous vehicles] to have on city streets, by time of day, by geography and weather?'\" Tumlin said. He also suggested regulators may want to set up a staged system that will allow autonomous vehicle companies to rapidly scale their operations, provided they meet specific tests.One of those tests, he said, would be how quickly a company can get their autonomous vehicles safely out of the way of traffic if they encounter something that is confusing like a four-way intersection with no functioning traffic lights.Cities and regulators should also seek more data from robotaxi companies about the planned or actual performance of their vehicles during expected emergencies such as blackouts, floods or earthquakes, Tumlin said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Waymo pauses robotaxis in SF again due to flash flood warnings on Christmas Day",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108243326-1766012944148-gettyimages-2251802458-WAYMO_VALUATION.jpeg?v=1766012995&w=1920&h=1080"
      ],
      "datePublished": "2025-12-25T21:34:07.000Z",
      "dateModified": "2025-12-25T21:34:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Winter storm puts airlines to the test. Here's what travelers need to know",
    "url": "https://www.cnbc.com/2025/12/26/winter-storm-flight-cancellations.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108231341-1764025501328-gettyimages-2247755014-THANKSGIVING_TRAVEL.jpeg?v=1764025657&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-26T14:55:17.000Z",
    "description": "A traveler near a departures board at Newark Liberty International Airport (EWR) in Newark, New Jersey, US, on Monday, Nov. 24, 2025. Victor J. Blue |",
    "body": "A traveler near a departures board at Newark Liberty International Airport (EWR) in Newark, New Jersey, US, on Monday, Nov. 24, 2025. Victor J. Blue | Bloomberg | Getty ImagesAirlines are letting flyers change their trips ahead of a major winter storm that will put carriers to the test during one of the busiest travel periods of the year.A winter storm warning is in effect starting Friday afternoon in New York City, New Jersey and Long Island, with snowfall totals potentially reaching 9 inches, most of it falling overnight, the National Weather Service said.American Airlines, Delta Air Lines, United Airlines, Southwest Airlines, JetBlue Airways and other carriers waived change fees for restrictive basic economy tickets and said they won't charge a difference in fare for customers flying in and out of several airports in the area, including at Philadelphia International Airport, New York's John F. Kennedy International Airport and Newark Liberty International Airport in New Jersey.Customers must travel by the end of the year if they change their flights, the airlines said. Flying as early as possible is likely the best bet with few seats available during the busy Christmas week.Airlines for America, the industry lobbying group, expects carriers to fly a record 52.6 million people between Dec. 19 and Jan. 5, with this Friday and Sunday among the busiest days.Read more CNBC airline newsAmerican Airlines no longer lets basic economy flyers earn milesArchitect of Delta's premium strategy to retire in FebruaryFrontier Airlines replaces longtime CEO Barry Biffle with carrier's presidentSouthwest CEO says airline 'actively pursuing' network of airport lounges",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Winter storm puts airlines to the test. Here's what travelers need to know",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108231341-1764025501328-gettyimages-2247755014-THANKSGIVING_TRAVEL.jpeg?v=1764025657&w=1920&h=1080"
      ],
      "datePublished": "2025-12-26T14:55:17.000Z",
      "dateModified": "2025-12-26T14:55:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Motive, an Alphabet-backed fleet management software company, files for IPO",
    "url": "https://www.cnbc.com/2025/12/23/alphabet-backed-motive-files-for-ipo.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108245436-1766529485102-gettyimages-2252547671-US_STOCKS.jpeg?v=1766529646&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-23T22:58:57.000Z",
    "description": "Direxion signage at the New York Stock Exchange (NYSE) in New York, US, on Monday, Dec. 22, 2025. The holiday-shortened week started with gains in sto",
    "body": "Direxion signage at the New York Stock Exchange (NYSE) in New York, US, on Monday, Dec. 22, 2025. The holiday-shortened week started with gains in stocks amid a broad advance that saw a continuation of the bullish momentum on Wall Street.Michael Nagle | Bloomberg | Getty ImagesMotive, a company with software for managing corporate trucks and drivers, on Tuesday filed for an initial public offering on the New York Stock Exchange under the symbol \"MTVE.\" The paperwork puts Motive among a fast-growing group of tech companies looking to go public in 2026. Anthropic, OpenAI and SpaceX have all reportedly considered making their shares widely available for trading next year.Motive is smaller, reporting a $62.7 million net loss on $115.8 million in revenue in the third quarter. The loss widened from $41.3 million in the same quarter of 2024, while revenue grew about 23% year over year. The company had almost 100,000 clients at the end of September.Ryan Johns, Obaid Khan and Shoaib Makani started Motive in 2013, originally under the name Keep Truckin. Makani, the CEO, is Khan's brother-in-law.Investors include Alphabet's GV, Base10 Partners, Greenoaks, Index Ventures, Kleiner Perkins and Scale Venture Partners.Motive's AI Dashcam device for detecting unsafe driving \"has prevented 170,000 collisions and saved 1,500 lives on our roads,\" Makani wrote in a letter to investors. Most revenue comes from subscriptions, although Motive does sell replacement hardware and professional services.The San Francisco company changed its name to Motive in 2022, and as of Sept. 30, it employed 4,508 people. Motive employs 400 full-time data annotators who apply labels that are meant to enhance artificial intelligence models.Motive has ongoing patent-infringement litigation with competitor Samsara, which went public in 2021 and today has a $22 billion market capitalization.WATCH: AI IPO boom next year? The changing 2026 IPO landscapewatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Motive, an Alphabet-backed fleet management software company, files for IPO",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108245436-1766529485102-gettyimages-2252547671-US_STOCKS.jpeg?v=1766529646&w=1920&h=1080"
      ],
      "datePublished": "2025-12-23T22:58:57.000Z",
      "dateModified": "2025-12-23T22:58:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "DOJ says more than 1 million potential Epstein files newly uncovered",
    "url": "https://www.cnbc.com/2025/12/24/epstein-files-senators-call-for-audit-into-dojs-release.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108208980-17598610502025-10-07t171336z_1689344854_rc257hae3jy4_rtrmadp_0_usa-trump-justice-bondi.jpeg?v=1759861076&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-24T21:28:47.000Z",
    "description": "Then Chairman Jeff Merkley, D-Ore., and ranking member Sen. Lisa Murkowski, R-Alaska, confer during the Senate Appropriations Subcommittee on Interior",
    "body": "Then Chairman Jeff Merkley, D-Ore., and ranking member Sen. Lisa Murkowski, R-Alaska, confer during the Senate Appropriations Subcommittee on Interior, Environment, and Related Agencies hearing titled Fiscal Year 2022 Budget Request for The Environmental Protection Agency, in Dirksen Building on Wednesday, June 9, 2021. Tom Williams | Cq-roll Call, Inc. | Getty ImagesThe Department of Justice on Wednesday said more than one million additional documents potentially related to the disgraced sex offender Jeffrey Epstein have been discovered, slowing the release of the files that supposed to be made public by last Friday.\"The US Attorney for the Southern District of New York and the FBI have informed the Department of Justice that they have uncovered over a million more documents potentially related to the Jeffrey Epstein case,\" the DOJ said in a post on X.\"We have lawyers working around the clock to review and make the legally required redactions to protect victims, and we will release the documents as soon as possible. Due to the mass volume of material, this process may take a few more weeks,\" the post continued.The Christmas Eve announcement drew pushback from lawmakers who had already been critical of the DOJ's handling of the Epstein files.Rep. Robert Garcia, the top Democrat on the House Oversight and Government Reform Committee, which is conducting its own investigation into Epstein, in a statement accused the White House of engaging \"in a cover-up protecting Epstein's co-conspirators and the powerful men who abused women and girls.\"\"It's outrageous that the DOJ has illegally withheld over 1 million documents from the public,\" said Garcia, who also called on Attorney General Pam Bondi to testify before Congress.The announcement came the same day a bipartisan group of Senators called for an audit of the DOJ's handling of the Epstein files.In a letter to DOJ Acting Inspector General Don Berthiaume, a group of 12 senators said the DOJ had violated a law -- dubbed the Epstein Files Transparency Act -- that passed Congress and was signed by President Donald Trump in November. The law mandated a full release of the Epstein files with minimal redactions by Dec. 19.The lawmakers -- led by Sens. Richard Blumenthal, D-Conn., Lisa Murkowski, R-Alaska, and Jeff Merkley, D-Ore. -- said the DOJ has withheld files, released documents already publicly available and redacted certain releases to the extent that \"there are serious questions as to whether the Department is properly applying the limited exceptions for redaction that are permitted under the Act.\"Read more CNBC politics coverageEuropean Union approves over $105 billion toward Ukraine aid package for next two yearsBrown and MIT prof shooter suspect Neves Valente is found dead, authorities saysTrump Media to merge with fusion company TAE Technologies, DJT stock soarsTrump announces 'warrior dividend' of $1,776 to U.S. soldiers in prime-time speechEpstein accomplice Ghislaine Maxwell petitions to vacate sex crime convictionCongressional stock trading ban bill to get a vote in new year: House RepublicansFBI Deputy Director Dan Bongino is stepping down in JanuaryObamacare subsidies extension to get vote after 4 Republicans buck leadershipFCC chief Carr tells Senate that his agency is 'not formally ... independent'Trump vowed to block tankers carrying Venezuela's oil — nearly a dozen at sea nowKennedy Center to be renamed 'Trump-Kennedy Center,' White House saysTrump vowed to block tankers carrying Venezuela's oil — nearly a dozen at sea nowHouse passes bill to ease permits for building out AI infrastructureTrump sues BBC for $10 billion, claims defamation from Panorama documentaryPentagon takes big stake in new Korea Zinc refinery in Tenn., gets 10% of companyNew Trump tariffs collection hits $200 billion, Customs saysFormer Instacart employee says she was fired over her Democratic congressional campaignUkraine peace talks progressing, Russia open to EU membership, U.S. officials sayNew York AG sues UPS for allegedly shorting Christmas season workers' wagesTrump admin to hire 1,000 specialists for 'Tech Force'Trump doubles down on Rob Reiner criticism after killing; director's son in custodyTSA is giving airline passenger data to ICE for deportation push: NYTTrump's AI order may be 'illegal,' Democrats and consumer advocacy groups claimTrump sued by preservation group seeking to halt White House ballroom projectTrump says 'no big deal' after new Epstein photos showing him releasedPutin can fund war for years, ex-official says as Trump's resolve is testedIndiana redistricting bill that Trump demanded defeated in state SenateHouse passes INVEST Act to ease investment standards, boost capital in marketsDOJ fails again to indict New York AG James, a Trump target: ReportsTrump 'sells out' U.S. national security with Nvidia chip sales to China: WarrenTrump pushes for top prosecutor nominee Halligan after Comey, James cases tossedTrump willing to seize more oil tankers off Venezuela coast: White HouseSeized tanker will go to U.S. port, Trump admin intends 'to seize the oil'GOP lawmakers seek Trump aid for agricultural equipment after tariff pressureTrump says Fed could have 'at least doubled' latest interest rate cut'Spoof' ship: Seized oil tanker hid location, visited Iran and VenezuelaTrump admin touts pulling 9,500 truckers off road for failing English testsSwiss government says new 15% U.S. tariff ceiling retroactive to mid-NovemberHomeland Security Dept. buying Boeing 737s for ICE deportationsTrump officials move to end student loan payment pause for millions of borrowersJudge unseals Ghislaine Maxwell grand jury materials, citing Epstein files actUkraine at 'critical moment' in war as European allies ramp up pressure on RussiaDemocrats establish AI working group as industry bolsters DC presenceEx-Trump lawyer Habba resigns as NJ U.S. attorney after disqualification\"Given the Administration's historic hostility to releasing the files, politicization of the Epstein case more broadly, and failure to comply with the Epstein Files Transparency Act, a neutral assessment of its compliance with the statutory disclosure requirements is essential,\" the group wrote.Inspectors general are independent watchdogs that conduct audits and investigations of federal agencies. The DOJ inspector general is \"ideally placed\" to conduct an audit because he has full access to the files, the lawmakers wrote.At the beginning of his second term, Trump fired more than a dozen inspectors general across the federal government but spared longtime DOJ watchdog Michael Horowitz, who had been in the role since 2012. Horowitz left the post in June to take on the same role at the Federal Reserve.Trump tapped Berthiaume to become the DOJ's internal watchdog in October.The DOJ has released two major batches of Epstein files since Dec. 19, but the slow trickle of documents has angered lawmakers on both sides of the aisle. In a letter to Congress on Friday, Deputy Attorney General Todd Blanche told lawmakers the DOJ would release the files on a \"rolling basis\" through the end of the year, defying the law's requirement. Now it appears the release will continue into the new year.\"A Christmas Eve news dump of 'a million more files' only proves what we already know: Trump is engaged in a massive coverup. The question Americans deserve answered is simple: WHAT are they hiding—and WHY?\" Senate Minority Leader Chuck Schumer, D-N.Y., said in a post to X on Wednesday.Schumer vowed earlier this week to force the Senate to vote on suing the DOJ for the full release of files. And Reps. Thomas Massie, R-Ky., and Ro Khanna, D-Calif., have threatened to hold Bondi and Blanche in inherent contempt.\"The survivors deserve justice. The DOJ release does not comply with the Epstein Files Transparency Act and does not provide what the survivors are guaranteed under the new law,\" Massie said in a post to X on Monday.Trump, a former friend of Epstein's, was largely absent from the DOJ's initial release of documents last Friday. The latest batch of files, released Tuesday, include many references to Trump, including an email that suggests Trump traveled often on Epstein's private plane in the 1990s.Trump has denied any wrongdoing associated with the disgraced New York financier. On Tuesday, the DOJ said in a post on X that \"some of these documents contain untrue and sensationalist claims made against President Trump that were submitted to the FBI right before the 2020 election.\"During his 2024 presidential campaign, Trump suggested he was open to declassifying some Epstein files, but has fought for much of this year to keep them under wraps. He has referred to the uproar over the Epstein files as a \"hoax\" and pressured some House Republican to drop their support for the legislation that would eventually compel their release. As the Epstein Files Transparency Act seemed poised to advance out of Congress, Trump belatedly gave his blessing to the effort. \"Full transparency—as called for bravely and repeatedly by survivors—is essential in identifying members of our society who enabled and participated in Epstein's crimes. Survivors deserve full disclosure,\" the lawmakers wrote. Murkowski was the lone Republican to sign the letter, though the Epstein Files Transparency Act passed both chambers with broad bipartisan support.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "DOJ says more than 1 million potential Epstein files newly uncovered",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108208980-17598610502025-10-07t171336z_1689344854_rc257hae3jy4_rtrmadp_0_usa-trump-justice-bondi.jpeg?v=1759861076&w=1920&h=1080"
      ],
      "datePublished": "2025-12-24T21:28:47.000Z",
      "dateModified": "2025-12-24T21:28:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nvidia buying AI chip startup Groq's assets for about $20 billion in its largest deal on record",
    "url": "https://www.cnbc.com/2025/12/24/nvidia-buying-ai-chip-startup-groq-for-about-20-billion-biggest-deal.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108167952-1751619868648-gettyimages-2154742340-GENAI_SUMMIT.jpeg?v=1766607067&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-26T14:14:39.000Z",
    "description": "Jonathan Ross, chief executive officer of Groq Inc., during the GenAI Summit in San Francisco, California, US, on Thursday, May 30, 2024. David Paul |",
    "body": "Jonathan Ross, chief executive officer of Groq Inc., during the GenAI Summit in San Francisco, California, US, on Thursday, May 30, 2024. David Paul | Bloomberg | Getty ImagesNvidia has agreed to buy assets from Groq, a designer of high-performance artificial intelligence accelerator chips, for $20 billion in cash, according to Alex Davis, CEO of Disruptive, which led the startup's latest financing round in September. Davis, whose firm has invested more than half a billion dollars in Groq since the company was founded in 2016, said the deal came together quickly. Groq raised $750 million at a valuation of about $6.9 billion three months ago. Investors in the round included Blackrock and Neuberger Berman, as well as Samsung, Cisco, Altimeter and 1789 Capital, where Donald Trump Jr. is a partner. Groq said in a blog post Wednesday that it's \"entered into a non-exclusive licensing agreement with Nvidia for Groq's inference technology,\" without disclosing a price. With the deal, Groq founder and CEO Jonathan Ross along with Sunny Madra, the company's president, and other senior leaders \"will join Nvidia to help advance and scale the licensed technology,\" the post said. Groq added that it will continue as an \"independent company,\" led by finance chief Simon Edwards as CEO. Colette Kress, Nvidia's CFO, declined comment on the transaction. Davis told CNBC that Nvidia is getting all of Groq's assets, though its nascent Groq cloud business is not part of the transaction. Groq said, \"GroqCloud will continue to operate without interruption.\"The deal represents by far Nvidia's largest purchase ever. The chipmaker's biggest acquisition to date came in 2019, when it bought Israeli chip designer Mellanox for close to $7 billion. At the end of October, Nvidia had $60.6 billion in cash and short-term investments, up from $13.3 billion in early 2023. In an email to employees that was obtained by CNBC, Nvidia CEO Jensen Huang said the agreement will expand Nvidia's capabilities.\"We plan to integrate Groq's low-latency processors into the NVIDIA AI factory architecture, extending the platform to serve an even broader range of AI inference and real-time workloads,\" Huang wrote. Huang added that, \"While we are adding talented employees to our ranks and licensing Groq's IP, we are not acquiring Groq as a company.\"Nvidia orchestrated a similar but smaller deal in September, when it shelled out more than $900 million to hire Enfabrica CEO Rochan Sankar and other employees at the AI hardware startup, and to license the company's technology, CNBC reported at the time. Other tech giants, including Meta, Google and Microsoft, have spent heavily over the last couple years to hire top AI talent through various types of licensing deals. watch nowNvidia has ramped up its investments in chip startups and the broader ecosystem as its cash pile has mounted. The company has backed AI and energy infrastructure company Crusoe, artificial intelligence model developer Cohere, and boosted its investment in CoreWeave as the AI-centric cloud provider was getting ready to go public this year.In September, Nvidia said it intended to invest up to $100 billion in OpenAI, with the startup committed to deploying at least 10 gigawatts of Nvidia products. The companies have yet to announce a formal deal. That same month, Nvidia said it would invest $5 billion in Intel as part of a partnership.Groq has been targeting revenue of $500 million this year amid booming demand for AI accelerator chips used in speeding up the process for large language models to complete inference-related tasks. The company was not pursuing a sale when it was approached by Nvidia, Davis said.Groq was founded in 2016 by a group of former engineers, including Ross. He was one of the creators of Google's tensor processing unit, or TPU, the search giant's custom chip that's being used by some companies as an alternative to Nvidia's graphics processing units. In its initial filing with the SEC, announcing a $10.3 million fundraising in late 2016, Groq listed as principals Ross and Douglas Wightman, an entrepreneur and former engineer at the Google X \"moonshot factory.\" Wightman left Groq in 2019, according to his LinkedIn profile. Groq isn't the only chip startup that's gained traction during the AI boom.AI chipmaker Cerebras Systems had planned to go public this year but withdrew its IPO filing in October  after announcing that it raised more than $1 billion in a fundraising round.In a filing with the SEC, Cerebras said it does not intend to conduct a proposed offering \"at this time,\" but didn't provide a reason. A spokesperson told CNBC at the time that the company still hopes to go public as soon as possible.Cerebras filed for an initial public offering in late 2024, as it was ramping up to take on Nvidia in an effort to create processors for running generative AI models. — CNBC's Jordan Novet contributed to this report. WATCH: How the massive power draw of generative AI is overtaxing our gridwatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nvidia buying AI chip startup Groq's assets for about $20 billion in its largest deal on record",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108167952-1751619868648-gettyimages-2154742340-GENAI_SUMMIT.jpeg?v=1766607067&w=1920&h=1080"
      ],
      "datePublished": "2025-12-26T14:14:39.000Z",
      "dateModified": "2025-12-26T14:14:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Oracle shares on pace for worst quarter since 2001 as new CEOs face concerns about AI build-out",
    "url": "https://www.cnbc.com/2025/12/26/oracle-stock-on-pace-for-worst-quarter-since-2001-ai-concerns.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108203054-17586652402025-09-23t214856z_924257634_rc2vxgap561e_rtrmadp_0_tech-openai-texas.jpeg?v=1766510815&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-26T16:09:23.000Z",
    "description": "Oracle CEO Clay Magouyrk speaks at a Q&A session following a tour of the OpenAI data center in Abilene, Texas, on Sept. 23, 2025. Shelby Tauber | Pool",
    "body": "Oracle CEO Clay Magouyrk speaks at a Q&A session following a tour of the OpenAI data center in Abilene, Texas, on Sept. 23, 2025. Shelby Tauber | Pool | ReutersThree months ago Oracle named Clay Magouyrk and Mike Sicilia as its new CEOs. They're off to a rough start.Oracle shares have plummeted 30% so far this quarter. With four trading days remaining in the period, the stock is on pace for its sharpest decline since 2001 and the dot-com bust. Investors have grown skeptical about the database software vendor's ability to open more server farms for ChatGPT operator OpenAI, which agreed in September to spend more than $300 billion with Oracle.Earlier this month, Oracle reported weaker-than-expected quarterly revenue and free cash flow. On the earnings call, newly appointed finance leader Doug Kehring called for $50 billion in fiscal 2026 capital expenditures, 43% higher than the plan in September and double the total from a year earlier. Additionally, Oracle is plotting $248 billion in leases to boost cloud capacity, on top of building data centers.Such growth will require boatloads of debt. In September, Oracle raised $18 billion in a jumbo bond sale, one of the largest debt issuances on record in the tech industry. Kehring committed on the earnings call to keeping Oracle's investment-grade debt rating. But some skeptical investors are betting otherwise, pushing up the prices of Oracle's credit default swaps.\"Considering Oracle is already barely hanging on to an investment grade rating, we would be concerned about Oracle's ability to live up to these obligations without restructuring its OpenAI contract,\" analysts at D.A. Davidson wrote in a note to clients on Dec. 12. They have the equivalent of a hold rating on the stock. Oracle declined to comment.watch nowMagouyrk and Sicilia's tenure began at a time of historic optimism. About two weeks before they took the reins from Safra Catz, Oracle reported a 359% revenue backlog tied heavily to OpenAI's commitment. That deal represented a major endorsement for Oracle, which was left off Gartner's list of top five cloud infrastructure providers by revenue for 2024.Following reports about the OpenAI agreement on Sept. 10, Oracle's stock shot up almost 36%, the third-sharpest rally since the company's 1986 IPO. The shares reached an intraday record of $345.72.\"We think $340 was terrifying,\" said Zachary Lountzis, vice president at Lountzis Asset Management, in an interview. Lountzis held $25 million in Oracle shares as of Sept. 30, according to a filing.The stock has since lost 43% of its value, closing on Wednesday at $197.49, though it got a bump last Friday after TikTok said it had agreed to sell part of its U.S. business to Oracle and other investors. Oracle has for years delivered cloud services to TikTok.Not 'betting against Larry'Lountzis said his team first bought Oracle shares in 2020, when the stock was below $60. It's held onto it stake through the recent highs and lows, picking up another roughly 30,000 shares in the first quarter of this year.\"Our philosophy is that we're OK with short-term overvaluation if the economics of the business have not changed, and that was the case with Oracle,\" Lountzis said. \"We didn't feel the economics of the business changed with all the largely positive news that came out. And I think what we've seen from $340 down to $180 is actually a very healthy correction.\" For Lountzis, much of his trust in the company comes down to Larry Ellison, who founded Oracle in 1977 and is now the world's second-richest person, according to Bloomberg.\"You would have gone bankrupt 40 times betting against Larry over the last 50 years,\" Lountzis said. \"He sees the future.\"watch nowIn October, Sicilia, Magouyrk and Kehring laid out a vision for a much faster-growing Oracle, with revenue set to step up to $225 billion in the 2030 fiscal year from $57 billion in fiscal 2025. Most of that growth will come from artificial intelligence infrastructure, with Nvidia's graphics processing units at the center of it. But while Magouryk was telling analysts to prepare for \"hypergrowth,\" such expansion would come at the expense of profitability, because Oracle's core software business commands much higher margins.  In fiscal 2021, Oracle's gross margin was 77%. Analysts polled by FactSet see it falling to about 49% in 2030, with about $34 billion in total negative free cash flow over the next five years before that figure turns positive in 2029.Eric Lynch, managing director at Florida's Suncoast Equity Management, said it's hard as an investor to get comfortable with Oracle's plans. \"Four or five years is a long time,\" Lynch said. \"That's just not within our investment discipline.\"Lynch also said he's worried about such heavy dependance on OpenAI, which is burning cash at a rapid rate and has committed to more than $1.4 trillion in total AI build-outs and investments. \"Will the demand be there from OpenAI?\" Lynch said.Wells Fargo analyst Michael Turrin launched coverage of Oracle earlier this month with the equivalent of a buy rating and a $280 price target. He said the industry's perception will likely improve if Oracle follows through with OpenAI, which could account for more than one-third of the company's revenue by 2029, according to Turrin's estimate. \"They're kind of shifting away from more of a value-oriented business to a more growth-oriented business,\" Turrin said.A big challenge for Oracle remains picking up market share in cloud infrastructure, where the company badly trails Amazon, Microsoft and Google even though its customer roster includes names like Meta, Uber and Elon Musk's xAI.Databricks, which was just valued at $134 billion in a funding round, doesn't make its popular data processing software available on Oracle's cloud. That will happen \"when customers start banging on my door, saying, 'You need to run on Oracle,'\" Databricks CEO Ali Ghodsi said in an interview. \"Maybe it's getting there, but we just haven't heard that.\"Databricks rival Snowflake hasn't brought its services to Oracle either.Turrin said that Oracle's credibility in the market will hinge on the success of its AI build-out. \"Then customers start to look at this and say, wow, this company was trusted to build some of the largest training clusters in the world, and they're delivering on them,\" Turrin said. \"We should take a look at that too and figure out what's happening here.\" WATCH: How the massive power draw of generative AI is overtaxing our gridwatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Oracle shares on pace for worst quarter since 2001 as new CEOs face concerns about AI build-out",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108203054-17586652402025-09-23t214856z_924257634_rc2vxgap561e_rtrmadp_0_tech-openai-texas.jpeg?v=1766510815&w=1920&h=1080"
      ],
      "datePublished": "2025-12-26T16:09:23.000Z",
      "dateModified": "2025-12-26T16:09:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Google is rolling out a new feature allowing users to change their Gmail address ",
    "url": "https://www.cnbc.com/2025/12/26/google-gmail-change-email-address-without-new-account-india-hindi-support.html",
    "image": "https://image.cnbcfm.com/api/v1/image/106199081-1571858526194gettyimages-887454120.jpeg?v=1766758890&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-26T15:38:06.000Z",
    "description": "NurPhoto | NurPhoto | Getty ImagesGoogle just unveiled a Christmas gift for Gmail users who are still stuck with their embarrassing email addresses fr",
    "body": "NurPhoto | NurPhoto | Getty ImagesGoogle just unveiled a Christmas gift for Gmail users who are still stuck with their embarrassing email addresses from high school.In a long-requested change, account holders can now replace their existing @gmail.com address with a new one while retaining all data and services, according to an update to Google's account help page. However, the updated guidance on email address changes appears only in the Hindi version of Google's support page, suggesting the rollout may begin in India or Hindi-speaking markets.The support page said the feature is gradually rolling out to all users, suggesting full global adoption is coming, but could take some time.The English-language page retains prior guidance stating that @gmail.com addresses \"usually cannot be changed.\" Google did not immediately respond to CNBC's inquiry about which regions would be the first to receive the feature. Under the new policy, users who change their address will automatically keep their original address as an alias. Emails sent to the old address will continue to arrive in the inbox, and the original address will still work for signing in to Google services like Drive, Maps and YouTube. Previously, users seeking a new Gmail address had to create a new account and transfer their data manually through a complicated and fraught process that could disrupt integrations with third-party apps.Google said existing data, including photos, messages and emails would remain unchanged after an address update. Users can also reuse the old Google account email address at any time, according to a Google translation of the support page in Hindi.However, accounts that change their Gmail address won't be able to create another new Gmail address for the next 12 months and cannot delete the new chosen address. Google has not issued a formal press release or announcement about the change, which was reportedly first discovered within user forums and tech communities.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Google is rolling out a new feature allowing users to change their Gmail address ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/106199081-1571858526194gettyimages-887454120.jpeg?v=1766758890&w=1920&h=1080"
      ],
      "datePublished": "2025-12-26T15:38:06.000Z",
      "dateModified": "2025-12-26T15:38:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Monetizers vs manufacturers: How the AI market could splinter in 2026",
    "url": "https://www.cnbc.com/2025/12/25/how-the-ai-market-could-splinter-in-2026-.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107362181-1705898756653-gettyimages-949382754-AFP_1474J6.jpeg?v=1765453108&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-26T07:33:42.000Z",
    "description": "The AI market is tipped to splinter in 2026. The last three months of 2025 were a rollercoaster of tech sell-offs and rallies, as circular deals, debt",
    "body": "The AI market is tipped to splinter in 2026. The last three months of 2025 were a rollercoaster of tech sell-offs and rallies, as circular deals, debt issuances, and high valuations fueled concerns over an AI bubble.Such volatility may be an early sign of how AI investment is set to evolve as investors pay closer attention to who is spending money and who is making it, according to Stephen Yiu, chief investment officer at Blue Whale Growth Fund.Investors, especially retail investors who are exposed to AI through ETFs, typically have not differentiated between companies with a product but no business model, those burning cash to fund AI infrastructure, or those on the receiving end of AI spending, Yiu told CNBC.So far, \"every company seems to be winning,\" but AI is in its early innings, he said. \"It's very important to differentiate\" between different types of companies, which is \"what the market might start to do,\" Yiu added.This illustration taken on April 20, 2018, in Paris shows apps for Google, Amazon, Facebook and Apple, plus the reflection of a binary code displayed on a tablet screen.Lionel Bonaventure | Afp | Getty ImagesHe sees three camps: private companies or startups, listed AI spenders and AI infrastructure firms. The first group, which includes OpenAI and Anthropic, lured $176.5 billion in venture capital in the first three quarters of 2025, per PitchBook data. Meanwhile, Big Tech names such as Amazon, Microsoft and Meta are the ones cutting checks to AI infrastructure providers such as Nvidia and Broadcom.  Blue Whale Growth Fund measures a company's free cash flow yield, which is the amount of money a company generates after capital expenditure, against its stock price, to figure out whether valuations are justified.  Most companies within the Magnificent 7 are \"trading a significant premium\" since they started heavily investing in AI, Yiu said.\"When I'm looking at valuations in AI, I would not want to position — even though I believe in how AI is going to change the world — into the AI spenders,\" he added, adding that his firm would rather be \"on the receiving end\" as AI spending is set to further impact company finances.  The AI \"froth\" is \"concentrated in specific segments rather than across the broader market,\" Julien Lafargue, chief market strategist at Barclays Private Bank and Wealth Management, told CNBC. The bigger risk lies with companies that are securing investment from the AI bull run but are yet to generate earnings — \"for example, some quantum computing-related companies,\" Lafargue said. \"In these cases, investor positioning seems driven more by optimism than by tangible results,\" he added, saying that \"differentiation is key.\"Read moreThe need for differentiation also reflects an evolution of Big Tech business models. Once asset-light firms are increasingly asset-heavy as they gobble up technology, power and land needed for their bullish AI strategies. Companies like Meta and Google have morphed into hyperscalers that invest heavily in GPUs, data centers, and AI-driven products, which changes their risk profile and business model.Dorian Carrell, Schroders' head of multi-asset income, said valuing these companies like software and capex-light plays may no longer make sense — especially as companies are still figuring out how to fund their AI plans.\"We're not saying it's not going to work, we're not saying it's not going to come through in the next few years, but we are saying, should you pay such a high multiple with such high growth expectations baked in,\" Carrell told CNBC's \"Squawk Box Europe\" on Dec. 1.Tech turned to the debt markets to fund AI infrastructure this year, though investors were cautious about a reliance on debt. While Meta and Amazon have raised funds this way, \"they're still net cash positioned,\" Quilter Cheviot's global head of technology research and investment strategist Ben Barringer told CNBC's \"Europe Early Edition\" on Nov. 20 — an important distinction from companies whose balance sheets may be tighter.The private debt markets \"will be very interesting next year,\" Carrell added. If incremental AI revenues don't outpace those expenses, margins will compress and investors will question their return on investment, Yiu said. In addition, the performance gaps between companies could widen further as hardware and infrastructure depreciate. AI spenders will need to factor into their investments, Yiu added. \"It's not part of the P&L yet. Next year onwards, gradually, it will confound the numbers.\" \"So, there's going to be more and more differentiation.\" ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Monetizers vs manufacturers: How the AI market could splinter in 2026",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107362181-1705898756653-gettyimages-949382754-AFP_1474J6.jpeg?v=1765453108&w=1920&h=1080"
      ],
      "datePublished": "2025-12-26T07:33:42.000Z",
      "dateModified": "2025-12-26T07:33:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Unmarried couples aren't viewed as 'a default unit' at end of life, advisor says. Why that matters",
    "url": "https://www.cnbc.com/2025/12/26/unmarried-couples-arent-default-unit-if-one-dies-why-that-matters.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108241924-1765820775249-gettyimages-2207840721-file33copy.jpeg?v=1765820795&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-26T13:30:01.000Z",
    "description": "Brothers91 | E+ | Getty ImagesFor unmarried couples in long-term relationships, being non-spouses from a legal standpoint may be an unremarkable part ",
    "body": "Brothers91 | E+ | Getty ImagesFor unmarried couples in long-term relationships, being non-spouses from a legal standpoint may be an unremarkable part of everyday life.In the event of death, however, that unwed status can make a huge difference. While the person who passed away might have wanted their partner to receive all or some assets, they \"don't get the automatic safety net that comes with marriage,\" said certified financial planner Jared Gagne, an associate wealth advisor with Claro Advisors in Boston.\"The most important thing to understand is that the law does not see you as a default unit,\" Gagne said. \"If one partner dies without planning, state law typically sends assets to blood relatives … not the partner who's been sharing a home and a life with them.\"Living together is more accepted as marriage rate dropsLiving together without formally marrying has become a more common arrangement and largely accepted: According to a 2019 Pew Research Center study, 69% of U.S. adults say cohabitation is fine even if a couple doesn't plan to get married. That viewpoint has occurred alongside shifts in when people get married — or if they do at all.Fewer than half, 47%, of U.S. households — of which there are roughly 135 million — are married couples, according to the U.S. Census Bureau. That's down from about 66% in 1975, when there were just over 71 million U.S. households. The estimated median age at first marriage is now 30.8 for men and 28.4 for women, up from ages 23.5 and 21.1, respectively, in 1975.Additionally, roughly 9.5 million households in 2024 were headed by unmarried partners, according to the latest Census data. That compares with 61.4 million households led by married couples. Among older adults — those age 50 or older — 4.6 million were living unmarried with their partner in 2022, according to Bowling Green State University's National Center for Family & Marriage Research. That's up from fewer than 1 million in 2000.Extend durable powers of attorneyThe first key document to put in place long before you need it involves pre-death considerations — giving financial and medical authority to each other in case one of you becomes incapacitated, CFP John Hixson, a senior advisor at FMP Wealth Advisers in Lake Charles, Louisiana. The firm ranked No. 16 on CNBC's Financial Advisor 100 list this year.\"The big mistake is people don't do anything at all or they [try to] do it too late,\" Hixson said.\"Their intention is to own everything together, take care of each other, but then one will have a [major] stroke,\" he said. \"You can't execute a legal document at that point.\"Durable powers of attorney for health care would allow your partner to make medical decisions on your behalf if you cannot on your own. This is separate from a living will, which states your wishes if you are put on life support or suffer from a terminal condition.You also can extend powers of attorney for your finances, which would allow your partner to manage your money and access your accounts in that same situation. However, it may be worth checking if your financial institutions require you to fill out a specific legal form, Hixson said. Some investment custodians may not recognize powers of attorney unless a specific document is officially attached to your account, he said.Passing on IRAs, HSAs and life insuranceThe next standard document you should have is a will, where you state your wishes about who gets what. If you die without one — called dying intestate — the courts in your state will pass everything on according to state law, which could mean assets will go to the closest living family member.However, a will alone won't necessarily cover all your bases. For example, whoever is listed as a beneficiary on each of your tax-advantaged retirement accounts — individual retirement accounts, 401(k) plans and the like — will generally get the money, regardless of what your will says. The same goes for life insurance policies and annuities. Health savings accounts also should have a beneficiary listed.\"Unmarried couples should review those forms … to confirm a partner is intentionally named wherever appropriate and that old beneficiaries — like an ex-spouse — have been removed,\" said Gagne, of Claro Advisors.If no beneficiary is listed on these accounts, the money generally ends up being included in your assets that are subject to probate, which is the often-lengthy process of the court validating your will (if there is one) after your death. Some states allow small estates to go through a simplified probate process or excuse them from the process altogether.Sometimes a trust is appropriateFor bank and brokerage accounts owned individually, you can contact your financial institution to find out how to make sure the money goes where you want it to after death. In some cases, this may be a \"payable on death\" or \"transfer on death\" designation. Certificates of deposit, or CDs, can also get the designation.If you want your partner to inherit your home and you are the only person on the deed, be sure to make your wishes known in your will.Alternatively, Hixson said, you can create a revocable living trust and put the house — as well as other assets that may otherwise be subject to probate — in the trust. This would allow you to manage your assets while alive, and then pass them directly to the intended beneficiary without going through probate.You also could create a trust \"that lets a surviving partner live in the house or receive income for life, while legally locking in that the remaining assets ultimately pass to your children, siblings\" or other beneficiaries, Gagne said.Disclosure: CNBC receives no compensation from placing financial advisory firms on our Financial Advisor 100 list. Additionally, a firm or an advisor's appearance on our ranking does not constitute an individual endorsement by CNBC of any firm or advisor.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Unmarried couples aren't viewed as 'a default unit' at end of life, advisor says. Why that matters",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108241924-1765820775249-gettyimages-2207840721-file33copy.jpeg?v=1765820795&w=1920&h=1080"
      ],
      "datePublished": "2025-12-26T13:30:01.000Z",
      "dateModified": "2025-12-26T13:30:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Waymo will update driverless fleet after San Francisco blackout to improve navigation during outages",
    "url": "https://www.cnbc.com/2025/12/23/waymo-updating-fleet-after-san-francisco-blackout-to-improve-navigation.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108244516-1766343171905-2025-12-21T082336Z_1950896696_RC2WKIAY5PVP_RTRMADP_3_USA-SANFRANCISCO-OUTAGE_1.jpg?v=1766343251&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-24T03:13:31.000Z",
    "description": "A Waymo car is halted on the road amid a power outage in San Francisco, California, U.S., December 20, 2025, in this screengrab obtained from a social",
    "body": "A Waymo car is halted on the road amid a power outage in San Francisco, California, U.S., December 20, 2025, in this screengrab obtained from a social media video.dReutersThree days after a blackout in San Francisco caused Waymo to pause its driverless car service, the Alphabet-owned company said it's updating its fleet so its vehicles are better prepared to respond during future outages. \"We've always focused on developing the Waymo Driver for the world as it is, including when infrastructure fails,\" the company said in a blog post late Tuesday. Power outages began early afternoon on Saturday in San Francisco and peaked roughly two hours later, affecting about 130,000 customers, according to Pacific Gas and Electric. As of Sunday morning, about 21,000 customers remained without power. PG&E said a fire at a substation resulted in \"significant and   extensive\" damage.With stoplights and traffic signals not functioning, the city was hit with widespread gridlock. Videos shared on social media appeared to show multiple Waymo vehicles stalled in traffic in various neighborhoods. \"We directed our fleet to pull over and park appropriately so we could return vehicles to our depots in waves,\" Waymo said in Tuesday's blog post. \"This ensured we did not further add to the congestion or obstruct emergency vehicles during the peak of the recovery effort.\"San Francisco Mayor Daniel Lurie said in an update on X Saturday evening that police officers, fire crews, parking control officers and city ambassadors were deployed across affected neighborhoods.Waymo said that it's analyzing the event, and is taking three \"immediate steps.\" The first involves \"fleet-wide updates\" to give vehicles \"more context about regional outages,\" so cars can take more decisive actions at intersections. The company said it's also improving its \"emergency response protocols,\" and is coordinating with Mayor Lurie's team in San Francisco to better collaborate in emergency preparedness. Finally, Waymo said it's updating its first responder training \"as we discover learnings from this and other widespread events.\" In addition to the Bay Area, Waymo currently serves paid rides to the public in and around Austin, Texas, Phoenix, Atlanta and Los Angeles. The company recently crossed an estimated 450,000 weekly paid rides, and said in December it had served 14 million trips in 2025, putting it on pace to end the year at more than 20 million trips total since launching in 2020.\"Backed by 100M+ miles of fully autonomous driving experience and a record of improving road safety, we are undaunted by the opportunity to challenge the status quo of our roads, and we're proud to continue serving San Franciscan residents and visitors,\" the company said in Tuesday's blog.— CNBC's Lora Kolodny and Jennifer Elias contributed to this report. WATCH: Waymo service resumes after errors cause issues in San Franciscowatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Waymo will update driverless fleet after San Francisco blackout to improve navigation during outages",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108244516-1766343171905-2025-12-21T082336Z_1950896696_RC2WKIAY5PVP_RTRMADP_3_USA-SANFRANCISCO-OUTAGE_1.jpg?v=1766343251&w=1920&h=1080"
      ],
      "datePublished": "2025-12-24T03:13:31.000Z",
      "dateModified": "2025-12-24T03:13:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "China’s mineral dominance gives Western magnet makers a moment in the sun",
    "url": "https://www.cnbc.com/2025/12/24/critical-minerals-rare-earth-magnet-makers-relish-a-moment-in-the-sun.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108151040-1748400672461-gettyimages-104550897-CHINA_RARE_EARTHS_WEAPONS.jpeg?v=1761024193&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-23T23:14:06.000Z",
    "description": "Annealed neodymium iron boron magnets sit in a barrel at a Neo Material Technologies Inc. factory in Tianjin, China on June 11, 2010.Bloomberg | Bloom",
    "body": "Annealed neodymium iron boron magnets sit in a barrel at a Neo Material Technologies Inc. factory in Tianjin, China on June 11, 2010.Bloomberg | Bloomberg | Getty ImagesRare earth magnet makers are having a moment as Western nations scramble to build domestic \"mine-to-magnet\" supply chains and reduce their dependence on China.A turbulent year of supply restrictions and tariff threats has thrust the strategic importance of magnet manufacturers firmly into the spotlight, with rare earths surging toward the top of the agenda amid the U.S. and China's ongoing geopolitical rivalry. Magnets made from rare earths are vital components for everything from electric vehicles, wind turbines, and smartphones to medical equipment, artificial intelligence applications, and precision weaponry.It's in this context that the U.S., European Union and Australia, among others, have sought to break China's mineral dominance by taking a series of strategic measures to support magnet makers, including heavily investing in factories, supporting the buildout of new plants, and boosting processing capacity.The U.S. and Europe, in particular, are expected to emerge as key growth markets for rare earth magnet production over the next decade. Analysts, however, remain skeptical that Western nations will be able to escape China's mineral orbit anytime soon.\"Frankly, we were the solution to the problem that the world didn't know it had,\" Rahim Suleman, CEO of Canadian group Neo Performance Materials, told CNBC by video call. Photo taken on Sept. 19, 2025 shows rare-earth magnetic bars at NEO magnetic plant in Narva, a city in northeastern Estonia. Xinhua News Agency | Xinhua News Agency | Getty Images\"The end-market is growing from the point of physics, not software, so therefore it has to grow in this way,\" he continued. \"And it's not dependent on any single end market, so it's not dependent on automotive or battery electric vehicles or drones or wind farms. It's any energy-efficient motor across the spectrum,\" Suleman said, referring to the demand for magnets from fast-growing industries such as robotics. His comments came around three months after Neo launched the grand opening of its rare earth magnet factory in Narva, Estonia. Situated directly on Russia's doorstep, the facility is widely expected to play an integral role in Europe's plan to reduce its dependence on China. European Union industry chief Stéphane Séjourné, for example, lauded the plant's strategic importance, saying at an event in early December that the project marked \"a high point of Europe's sovereignty.\" watch nowNeo's Suleman said the Estonian facility is on track to produce 2,000 metric tons of rare earth magnets this year, before scaling up to 5,000 tons and beyond.\"Globally, the market is 250,000 tons and going to 600,000 tons, so more than doubling in ten years,\" Suleman said. \"And more importantly, our concentration is 93% in a single jurisdiction, so when you put those two factors together, I think you'll find an enormously quick growing market.\"'Skyrocketing demand'To be sure, the global supply of rare earths has long been dominated by Beijing. China is responsible for nearly 60% of the world's rare earths mining and more than 90% of magnet manufacturing, according to the International Energy Agency.A recent report from consultancy IDTechEx estimated that rare earth magnet capacity in the U.S. is on track to grow nearly six times by 2036, with the expansion driven by strategic support and funding from the Department of Defense, as well as increasing midstream activity. Magnet production in Europe, meanwhile, was forecast to grow 3.1 times over the same time period, bolstered by the EU's Critical Raw Materials Act, which aims for domestic production to satisfy 40% of the region's demand by 2030.  Regional composition of rare earths and permanent magnet production in 2024, according to data compiled by the International Energy Agency.IEAJohn Maslin, CEO of Vulcan Elements, a North Carolina-based rare earth magnet producer, told CNBC that the company is seeking to scale up as fast as possible \"so that this fundamental supply chain doesn't hold America back.\" Vulcan Elements is one of the companies to have received direct funding from the Trump administration. The magnet maker received a $620 million direct federal loan last month from the Department of Defense to support domestic magnet production.\"Rare earth magnets convert electricity into motion, which means that virtually all advanced machines and technologies—the innovations that shape our daily lives and keep us safe—require them in order to be operational,\" Maslin told CNBC by email. \"The need for high-performance magnets is accelerating exponentially amid a surge in demand and production of advanced technologies, including hard disk drives, semiconductor fabrication equipment, hybrid/electric motors, satellites, aircraft, drones, and almost every military capability,\" he added. Read moreSeparately, Wade Senti, president of Florida-based magnet maker Advanced Magnet Lab, said the only way to deliver on alternative supply chains is to be innovative.\"The demand for non-China sourced rare earth permanent magnets is skyrocketing,\" Senti told CNBC by email. \"The challenge is can United States magnet producers create a fully domestic (non-China) supply chain for these magnets. This requires the magnet manufacturer to take the lead and bring the supply chain together – from mine to magnet to customers,\" he added.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "China’s mineral dominance gives Western magnet makers a moment in the sun",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108151040-1748400672461-gettyimages-104550897-CHINA_RARE_EARTHS_WEAPONS.jpeg?v=1761024193&w=1920&h=1080"
      ],
      "datePublished": "2025-12-23T23:14:06.000Z",
      "dateModified": "2025-12-23T23:14:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Supreme Court rejects Trump's bid to send National Guard to Chicago",
    "url": "https://www.cnbc.com/2025/12/23/supreme-court-trump-national-guard-chicago.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108238322-17652069582025-12-05t080054z_1719154925_rc25l8avf4e1_rtrmadp_0_usa-court-ftc-firing.jpeg?v=1765207160&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-23T21:57:17.000Z",
    "description": "People gather outside the U.S. Supreme Court in Washington, U.S., June 29, 2024. Kevin Mohatt | ReutersThe Supreme Court on Tuesday dealt a rare blow ",
    "body": "People gather outside the U.S. Supreme Court in Washington, U.S., June 29, 2024. Kevin Mohatt | ReutersThe Supreme Court on Tuesday dealt a rare blow to President Donald Trump by rejecting his bid to overrule a lower court order and allow the deployment of National Guard troops to the Chicago area over the objections of local and state leaders.The Trump administration asked the Supreme Court to intervene in the case in October after a District Court judge blocked the president's plans to send troops to aid in an immigration crackdown. The court on Tuesday declined Trump's request.\"Today is a big win for Illinois and American democracy,\" Illinois Gov. JB Pritzker said in a post on X.\"This is an important step in curbing the Trump Administration's consistent abuse of power and slowing Trump's march toward authoritarianism,\" Pritzker continued.U.S. presidents can deploy the National Guard under certain authorities, but guardsmen are typically not permitted to engage in civilian law enforcement. Trump's attempts to send troops to mostly blue cities to fight crime have tested the bounds of presidential authority and led to a series of lawsuits. Citing the Posse Comitatus Act, which prohibits the military from engaging in domestic law enforcement unless explicitly authorized by the Constitution or Congress, the court found Trump lacked the authority to deploy troops to Illinois in this case.\"At this preliminary stage, the Government has failed to identify a source of authority that would allow the military to execute the laws in Illinois,\" the unsigned order states.The order is not final, but for now bars the Trump administration from sending National Guard troops to Chicago.Justices Samuel Alito, Clarence Thomas and Neil Gorsuch offered dissenting opinions. Justice Brett Kavanaugh authored a concurring opinion.Trump has sent National Guard troops to Washington, D.C., Los Angeles and Portland in recent months, despite objections from local leaders. Those deployments have resulted in several lawsuits, including a legal challenge from California Gov. Gavin Newsom, a Democrat and Trump foil, and local officials in D.C.\"The President promised the American people he would work tirelessly to enforce our immigration laws and protect federal personnel from violent rioters,\" White House spokesperson Abigail Jackson said in a statement on Tuesday.\"He activated the National Guard to protect federal law enforcement officers, and to ensure rioters did not destroy federal buildings and property,\" Jackson continued. \"Nothing in today's ruling detracts from that core agenda. The Administration will continue working day in and day out to safeguard the American public.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Supreme Court rejects Trump's bid to send National Guard to Chicago",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108238322-17652069582025-12-05t080054z_1719154925_rc25l8avf4e1_rtrmadp_0_usa-court-ftc-firing.jpeg?v=1765207160&w=1920&h=1080"
      ],
      "datePublished": "2025-12-23T21:57:17.000Z",
      "dateModified": "2025-12-23T21:57:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Want to be happier and less stressed during the holidays? Give 'yourself breaks,' says psychologist",
    "url": "https://www.cnbc.com/2025/12/24/how-to-be-happier-and-less-stressed-during-the-holidays-says-psychologist.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108245240-1766507319369-gettyimages-1436920501-dsc03902.jpeg?v=1766507514&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-24T13:30:01.000Z",
    "description": "Americans are more anxious about the holidays this year, according to the American Psychiatric Association's Healthy Minds Poll.Forty-one percent of U",
    "body": "Americans are more anxious about the holidays this year, according to the American Psychiatric Association's Healthy Minds Poll.Forty-one percent of U.S. adults say they anticipate more stress related to the holidays this year than last year, compared to 28% in 2024 and 29% in 2023. They list numerous reasons including missing someone in their life, dealing with the cost of holiday gifts, navigating challenging family dynamics and being lonely.If you're stressed out this time of year, there are tactics you can try to make the holidays more pleasant. Here's what Sabrina Romanoff, New York–based psychologist and a relationship expert for dating app Hily, recommends.Try 'muting accounts on social media that are really making you feel awful'Americans spend a lot of time on social media. Thirty-seven percent of U.S. adults visit Facebook several times a day, according to the Pew Research Center.  With so much time spent looking at other people's lives, it's easy to compare what your holidays look like to what theirs do.Making this season more pleasant \"can mean muting accounts on social media that are really making you feel awful, making you feel not good enough,\" says Romanoff. You can block them or unfollow them altogether.In December, as in any time of the year, \"it's really important to be intentional about what you are seeing and consuming,\" she says, \"because that's going to change the lens through which you see your own life.\"Choose to participate in whatever way 'makes your life more comfortable'If you're nervous about some of the people you'll be spending time with this season, you can also tailor your experience accordingly.That could mean, \"I'm not going to make myself uncomfortable to make Aunt Karen comfortable when she asks her intrusive questions,\" says Romanoff. \"I'm going to let there be silence.\" It could also mean giving yourself breaks during gatherings that feel overwhelming and going to another room for a few minutes. It could even mean deciding that there are certain celebrations you're going to skip altogether — and replace with get-togethers with your chosen family.Ultimately, making this time of year happier and less stressful \"means really showing up in a way that makes your life more comfortable for you,\" she says. Want to give your kids the ultimate advantage? Sign up for CNBC's new online course, How to Raise Financially Smart Kids. Learn how to build healthy financial habits today to set your children up for greater success in the future. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Want to be happier and less stressed during the holidays? Give 'yourself breaks,' says psychologist",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108245240-1766507319369-gettyimages-1436920501-dsc03902.jpeg?v=1766507514&w=1920&h=1080"
      ],
      "datePublished": "2025-12-24T13:30:01.000Z",
      "dateModified": "2025-12-24T13:30:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Amazon faces 'leader's dilemma' — fight AI shopping bots or join them",
    "url": "https://www.cnbc.com/2025/12/24/amazon-faces-a-dilemma-fight-ai-shopping-agents-or-join-them.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107232345-1682626363604-gettyimages-1445867611-_ar_5440_20221130121804902.jpeg?v=1749142534&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-24T15:30:34.000Z",
    "description": "Thos Robinson | Getty ImagesAmazon CEO Andy Jassy could see how dramatically artificial intelligence was altering e-commerce.In June, he told employee",
    "body": "Thos Robinson | Getty ImagesAmazon CEO Andy Jassy could see how dramatically artificial intelligence was altering e-commerce.In June, he told employees that AI agents will start to infiltrate aspects of everyday life, \"from shopping to travel to daily chores and tasks.\"Four months later, Jassy said on an earnings call that Amazon expects to partner with third-party agents, and has engaged in conversations with some providers, though he didn't offer names.Now, Amazon is looking to hire a leader in corporate development to help forge strategic partnerships in areas including \"agentic commerce,\" according to a recent job posting.Amazon's rapid evolution in its view of AI-powered commerce underscores how quickly online retail is changing, and the risks the company faces if it doesn't act aggressively to maintain control over its future.The company has watched as OpenAI, Google, Perplexity and Microsoft have released a flurry of e-commerce agents in recent months that aim to change how people shop. Instead of visiting Amazon, Walmart or Nike directly, consumers could rely on AI agents to do the hard work of scanning the web for the best deal or perfect product, then buy the item without exiting a chatbot window. The first shopping agents from AI leaders were released about a year ago. Consulting firm McKinsey projected that agentic commerce could generate $1 trillion in U.S. retail revenue by 2030. It's a trend that poses a threat to Amazon's margins and relationships with customers. When a consumer uses ChatGPT to initiate a purchase, for example, OpenAI collects \"a small fee\" from each transaction. \"With an agent on ChatGPT, retailers risk relinquishing transactions on their site to pay a toll on someone else's highway for the same transaction,\" Sucharita Kodali, a retail analyst at Forrester, said in an interview. Some companies are trying to find a middle ground between working with agent providers and competing against them. Walmart, Shopify and others have adopted a frenemy strategy, announcing partnerships with AI companies while continuing to develop their own tools and setting guardrails around how agents can access their sites.Shopify CEO Tobi Lutke wrote in a post on X on Tuesday that his company is \"building all the layers of infrastructure to power a new cambrian explosion of creativity in shopping.\"\"I'm really really excited about Agentic Commerce,\" Lutke wrote. \"There is so much amazing stuff being built. Everything I test just feels delightful and right.\"watch nowAmazon has so far been playing defense. The company recently updated the code underpinning its website to block external AI agents from crawling it, part of an effort to wall off its valuable training data from rivals. As of Tuesday, Amazon had blocked 47 bots, including those from all the major AI companies, according to its website. Amazon has even taken the matter to court. In November, Amazon sued Perplexity over an agent in the startup's Comet browser that allows it to make purchases on a user's behalf. The company alleged Perplexity took steps to \"conceal\" its agents so they could continue to scrape Amazon's website without its approval. Perplexity called the lawsuit a \"bully tactic.\" Meanwhile, Amazon is investing heavily in its own AI products. The company released a shopping chatbot called Rufus last February, and has been testing an agent called Buy For Me, which can purchase products from other sites directly in Amazon's e-commerce app.Personalized shoppersMorgan Stanley expects that by 2030, nearly half of American shoppers will use AI agents and the technology could add up to $115 billion in U.S. e-commerce spending. \"We believe agentic commerce — in effect the ability to have a personal digital interactive shopper — is set to be the best next substantial GenAI-enabled unlock,\" Morgan Stanley analysts wrote in a report in November. They noted that a mid-single-digit percentage of consumers currently start their \"purchase journey\" through AI, but that could increase over time as roughly 40% to 50% of Americans currently use AI for product research. Traffic from AI chatbots to U.S. retail sites has surged in recent months, especially during the holiday season, but research suggests Google search still performs better in terms of conversion rate and revenue per session.AI-powered shopping remains a nascent market. OpenAI's Instant Checkout tool, launched in ChatGPT in September, is only available for some products sold by Walmart, Shopify, Target and Etsy. Users can only purchase one item at a time, and they can't connect loyalty memberships like Walmart+. Agents are also prone to glitches. Scot Wingo, founder of e-commerce software startup ReFiBuy, recently tested Perplexity's Instant Buy tool that lets users purchase items directly in its search engine. Wingo tried to purchase a cable-knit sweater from Abercrombie & Fitch, but Perplexity's agent repeatedly spit out error messages, even though both products were in stock on the retailer's website. He eventually gave up.Earlier this month, Wingo was searching for a coffee machine on ChatGPT when it suggested a Breville espresso maker. When he clicked on the product, he was surprised to see an image of a garden rake.  \"These crawlers go out, they pull in this data and you never know exactly what they're going to get,\" Wingo said. 'Leader's dilemma'As Amazon contemplates its next move with shopping agents, it's quietly allowing them to access some of its properties.   Subsidiaries like shoe seller Zappos, fashion site Shopbop and deals site Woot don't appear to have any language blocking agents in their robots.txt files, which dictate how crawlers can access specific webpages.\"A lot of times they'll use the subsidiaries to experiment,\" Wingo said. \"Zappos has its own experience and database, so it's not like they're letting all the horses out of the barn.\" The company could ultimately take a page from its rivals if it decides to let agents access its primary e-commerce platform. Shopify and Walmart have set boundaries around what external shopping agents can and can't do on their sites. watch nowAmazon may be willing to let agents access its catalog, but it likely wants to protect more valuable data from its competitors, Wingo said, such as its vast trove of customer reviews and sales rankings, both of which indicate a product's quality and can help improve an AI chatbot's answers. \"Those are probably the two most proprietary data points that if I'm Amazon, I want to protect,\" Wingo said.Amazon isn't giving up on its homegrown tools. Rufus' capabilities have improved since Amazon first launched it last year, and the company has been surfacing the chatbot across more areas of its site to drive user adoption. Amazon recently added a feature where Rufus can auto-buy items on a Prime shopper's behalf once they hit a certain price. The chatbot now also suggests products from sites across the web, not just on Amazon.Amazon also began testing a feature in recent weeks that allows Rufus to create custom shopping guides, similar to OpenAI's \"shopping research\" tool launched last month.\"Instead of the innovator's dilemma, I would say Amazon is in what I would call the leader's dilemma,\" said Jordan Berke, founder and CEO of retail consulting firm Tomorrow. \"Their market share is so significant that they have the most to lose.\"WATCH: How Amazon came to dominate the U.S. apparel marketwatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Amazon faces 'leader's dilemma' — fight AI shopping bots or join them",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107232345-1682626363604-gettyimages-1445867611-_ar_5440_20221130121804902.jpeg?v=1749142534&w=1920&h=1080"
      ],
      "datePublished": "2025-12-24T15:30:34.000Z",
      "dateModified": "2025-12-24T15:30:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]