[
  {
    "title": "Trump says he's 'strongly' considering reclassifying pot via executive order",
    "url": "https://www.cnbc.com/2025/12/15/trump-pot-executive-order-reclassification.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107139728-1666633690095-gettyimages-1436168513-wm_10048_819406c6-d2aa-4b1e-974f-aa593691ad7f.jpeg?v=1666633724&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-15T21:46:30.000Z",
    "description": "Bill Schmitt Jr. (C) joins cannabis reform protesters outside the White House to call on U.S. President Joe Biden \"to take action on cannabis clemency",
    "body": "Bill Schmitt Jr. (C) joins cannabis reform protesters outside the White House to call on U.S. President Joe Biden \"to take action on cannabis clemency before the November general election” October 24, 2022 in Washington, DC.Win Mcnamee | Getty ImagesPot stocks failed to light up for a second day on Monday even after President Donald Trump confirmed he's considering an executive order loosening regulations on marijuana.The Amplify Seymour Cannabis ETF (CNBS) took a leg up in afternoon trading after Trump said he was weighing reclassifying the drug. Still, the fund was down nearly 7% with investors taking profits following a surge of more than 50% on Friday.When asked Monday if he was looking at an executive order on rescheduling weed, Trump responded \"We are considering that.\"\"A lot of people want to see it the reclassification, because it leads to tremendous amounts of research that can't be done unless you reclassify,\" he said. \"So we are looking at that very strongly.\"Trump's comment comes after reports on Friday said the president was thinking about instructing federal agencies to reclassify marijuana as a less-regulated Schedule III drug from a Schedule I substance. A person familiar with the matter told CNBC an order from the White House could come as soon as Monday.The reports ignited a rally in the sector on Friday that drove the Amplify Seymour fund to its best day on record. The ETF swung into positive territory for the year, putting it on track to snap a four-year losing streak.Industry insiders have long expected this change in classification, which would move cannabis out of a group of drugs that includes heroin to a cohort alongside steroids and Tylenol with codeine. Trump floated a change in marijuana's classification in August.But they said there's more optimism that enough momentum exists to get such a move — which could help warm up banks and big investors to the sector — across the finish line.\"I'm a lot more optimistic than I ever have been,\" Tilray CEO Irwin Simon told CNBC on Friday.Weed producers Tilray and Canopy Growth slid 10% and 4.6%, respectively, in Monday's session. Retailer SNDL tumbled more than 13%.— CNBC's Kevin Breuninger and Brandon Gomez contributed reporting.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump says he's 'strongly' considering reclassifying pot via executive order",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107139728-1666633690095-gettyimages-1436168513-wm_10048_819406c6-d2aa-4b1e-974f-aa593691ad7f.jpeg?v=1666633724&w=1920&h=1080"
      ],
      "datePublished": "2025-12-15T21:46:30.000Z",
      "dateModified": "2025-12-15T21:46:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Merriam-Webster declares 'slop' its word of the year in nod to growth of AI",
    "url": "https://www.cnbc.com/2025/12/15/merriam-webster-declares-slop-word-of-the-year-nod-to-growth-of-ai.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108066595-1732225390680-gettyimages-2185274854-avils-notitle241121_npPeq.jpeg?v=1765837211&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-15T22:44:01.000Z",
    "description": "The logos of Google Gemini, ChatGPT, Microsoft Copilot, Claude by Anthropic, Perplexity, and Bing apps are displayed on the screen of a smartphone in ",
    "body": "The logos of Google Gemini, ChatGPT, Microsoft Copilot, Claude by Anthropic, Perplexity, and Bing apps are displayed on the screen of a smartphone in Reno, United States, on November 21, 2024.Jaque Silva | Nurphoto | Getty ImagesMerriam-Webster declared \"slop\" its 2025 word of the year on Monday, a sign of growing wariness around artificial intelligence.Slop is now defined as \"digital content of low quality that is produced usually in quantity by means of artificial intelligence,\" according to Merriam-Webster's dictionary. The word has previously been used primarily to connote a \"product of little value\" or \"food waste fed to animals\" Mainstream social networks saw a flood of AI-generated content, including what 404 Media described as a \"video of a bizarre creature turning into a spider, turning into a nightmare giraffe inside of a busy mall,\" that the publication reported had been viewed more than 362 million times on Meta apps. In September, Meta launched Vibes, a separate feed for AI-generated videos. Days later, OpenAI released its Sora app. Those services, along with TikTok, YouTube and others, are increasingly rife with AI slop, which can often generate revenue with enough engagement. Spotify said in September that it had to remove over 75 million AI-generated, \"spammy tracks\" from its service, and roll out formal policies to protect artists from AI impersonation and deception. The streaming company faced widespread criticism after The Velvet Sundown racked up 1 million monthly listeners on without initially making it clear they produced their songs with generative AI. The artist later clarified on its bio page that it's a \"synthetic music project.\"According to CNBC's latest All-America Economic Survey, published Dec. 15, fewer respondents have been using AI platforms, such as ChatGPT, Microsoft Copilot and Google Gemini, in the last two to three months compared to the summer months. Just 48% of those surveyed said they had used AI platforms recently, down from 53% in August. WATCH: OpenAI's Sora 2 sparks AI 'slop' backlashwatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Merriam-Webster declares 'slop' its word of the year in nod to growth of AI",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108066595-1732225390680-gettyimages-2185274854-avils-notitle241121_npPeq.jpeg?v=1765837211&w=1920&h=1080"
      ],
      "datePublished": "2025-12-15T22:44:01.000Z",
      "dateModified": "2025-12-15T22:44:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Zillow shares are getting crushed. Here's why",
    "url": "https://www.cnbc.com/2025/12/15/zillow-shares-are-getting-crushed-heres-why.html",
    "image": "https://image.cnbcfm.com/api/v1/image/106943512-1631888926139-gettyimages-1232667332-ZILLOW_EARNS.jpeg?v=1765828785&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-15T22:49:41.000Z",
    "description": "The stock market graphic of Zillow Group is displayed on a smartphone with the logo of Zillow in the background on Feb. 21, 2021.Sopa Images | Lightro",
    "body": "The stock market graphic of Zillow Group is displayed on a smartphone with the logo of Zillow in the background on Feb. 21, 2021.Sopa Images | Lightrocket | Getty ImagesZillow shares plunged more than 9% on Monday on worries that the online real estate platform could have a big new competitor: Google Search. Google appears to be running tests on putting real estate sale listings into its search results. Over the weekend, real estate tech strategist Mike DelPrete published mobile phone screenshots of Google Search results showing real estate listings, which appeared to be powered by real estate data company HouseCanary. The listings enabled users to view the full details of a property's page, request a tour and contact an agent — similar to the functions offered on Zillow.com's online marketplace portal. Google's home searches appear to work only in select markets and on mobile devices as testing is underway.The decline in Zillow signals investors are bracing for the eventual impact of Google's foray into the real estate market. The company, which saw shares drop more than 11% at one point during Monday's session, lost about $1.6 billion in market cap. Zillow's market cap now sits at about $16.26 billion.However, Wall Street analysts were quick to point out that Zillow's exposure to organic search is fairly small, limiting potential downside at least in the near term as more details around Google's product come to light. Wells Fargo analyst Alec Brondolo, who has an equal weight rating on Zillow, said he would not \"expect a meaningful financial impact from listings on Google shifting from organic to paid\" — given that Zillow is not overly dependent on organic search results for traffic.\"The listings product appears similar to Google Hotel Metasearch results; introduction could increase traffic cost to Zillow, but disintermediation unlikely,\" Brondolo said in a Monday note to clients. \"In the hotel category, Google merchandises hotel rooms in search results as a metasearch ad product for OTAs. We would expect a similar approach in real estate, with Zillow, Homes.com, Realtor.com, etc. bidding for home listing ad units rather than Google attempting to monetize directly with an ad product sold to agents.\"Stock Chart IconStock chart iconZillow stock over the past year.But some analysts see Google's testing as a longer-term headwind to Zillow and other online real estate portals.Goldman Sachs' Michael Ng wrote in a note to clients that he believes the search engine's real estate listings, which he said are an advertising format for buy-side agents, directly compete with Zillow's Premier Agent program by \"facilitating lead generation\" for agents from prospective buyers.\"While we don't expect a direct near-term impact on Zillow's business, given that most of Zillow's traffic is direct (e.g., Zillow.com, StreetEasy.com, mobile apps) and Google's new product is currently limited to select markets and mobile browsers, we view this development as a long-term risk for real estate portals like Zillow,\" Ng, who remains neutral on Zillow, wrote in a note to clients. Jason Helfstein of Oppenheimer said that Google's expansion into real estate could impact the number of consumers going to Zillow.com — which was 228 million in the third quarter — and therefore could take a hit on the company's ability to monetize its platform. \"The impact would likely take years to play out and would need to be rolled out across the US to meaningfully impact real estate portal traffic,\" Helfstein said in a recent note.Zillow shares are down more than 8% year to date. Neither Google nor Zillow responded immediately to CNBC's request for comment. watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Zillow shares are getting crushed. Here's why",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/106943512-1631888926139-gettyimages-1232667332-ZILLOW_EARNS.jpeg?v=1765828785&w=1920&h=1080"
      ],
      "datePublished": "2025-12-15T22:49:41.000Z",
      "dateModified": "2025-12-15T22:49:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ukraine peace talks progressing, Russia open to EU membership, U.S. officials say",
    "url": "https://www.cnbc.com/2025/12/15/ukraine-peace-talks-russia-eu-us-trump.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108241917-1765820182904-gettyimages-2251498991-AFP_888E44G.jpeg?v=1765836836&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-15T22:29:46.000Z",
    "description": "Key PointsU.S. officials said they are nearing an agreement with Ukraine to end the war with Russia.Any deal would need final approval from Russian Pr",
    "body": "Key PointsU.S. officials said they are nearing an agreement with Ukraine to end the war with Russia.Any deal would need final approval from Russian President Vladimir Putin, who has taken a hard line and demanded territory in return for peace.President Donald Trump was expected to call into a dinner with Ukrainian President Volodymyr Zelenskyy and other European leaders.Ukraine's President Volodymyr Zelensky delivers a press conference at the Chancellery in Berlin, Dec. 15, 2025.John Macdougall | Afp | Getty ImagesAmerican officials said Monday that a deal with Ukrainian leaders to end its war with Russia was nearly complete, even as territorial disputes remain unresolved and a strong security guarantee from the United States and European countries remains a sticking point.President Donald Trump's special envoy Steve Witkoff and his son-in-law Jared Kushner on Monday joined  negotiations with Ukrainian President Volodymyr Zelenskyy in Berlin, which began Sunday.U.S. officials in a call with reporters said that Zelenskyy, who on Sunday agreed to drop his goal of joining NATO, insists on so-called Article Five-like security protections as part of a peace deal.Article Five of the NATO treaty states that an attack on one member nation is interpreted as an attack against all. American officials said any such assurance from the U.S. would require congressional approval.\"We believe the Russians, in a final deal, will accept all these things, which will allow for a … strong and free Ukraine,\" one official said. The official added that the Russians were open to Ukraine joining the European Union.Officials said that about 90% of the issues between Ukraine and Russia have been resolved.\"But there's some more things that have to be worked out,\" an official said.Read more CNBC politics coverageTrump sues BBC for $5 billion, claims defamation from Panorama documentaryPentagon takes big stake in new Korea Zinc refinery in Tenn., gets 10% of companyNew Trump tariffs collection hits $200 billion, Customs saysFormer Instacart employee says she was fired over her Democratic congressional campaignUkraine peace talks progressing, Russia open to EU membership, U.S. officials sayNew York AG sues UPS for allegedly shorting Christmas season workers' wagesTrump admin to hire 1,000 specialists for 'Tech Force'Trump doubles down on Rob Reiner criticism after killing; director's son in custodyTSA is giving airline passenger data to ICE for deportation push: NYTTrump's AI order may be 'illegal,' Democrats and consumer advocacy groups claimTrump sued by preservation group seeking to halt White House ballroom projectTrump says 'no big deal' after new Epstein photos showing him releasedPutin can fund war for years, ex-official says as Trump's resolve is testedIndiana redistricting bill that Trump demanded defeated in state SenateHouse passes INVEST Act to ease investment standards, boost capital in marketsDOJ fails again to indict New York AG James, a Trump target: ReportsTrump 'sells out' U.S. national security with Nvidia chip sales to China: WarrenTrump pushes for top prosecutor nominee Halligan after Comey, James cases tossedTrump willing to seize more oil tankers off Venezuela coast: White HouseSeized tanker will go to U.S. port, Trump admin intends 'to seize the oil'GOP lawmakers seek Trump aid for agricultural equipment after tariff pressureTrump says Fed could have 'at least doubled' latest interest rate cut'Spoof' ship: Seized oil tanker hid location, visited Iran and VenezuelaTrump admin touts pulling 9,500 truckers off road for failing English testsSwiss government says new 15% U.S. tariff ceiling retroactive to mid-NovemberHomeland Security Dept. buying Boeing 737s for ICE deportationsTrump officials move to end student loan payment pause for millions of borrowersJudge unseals Ghislaine Maxwell grand jury materials, citing Epstein files actUkraine at 'critical moment' in war as European allies ramp up pressure on RussiaDemocrats establish AI working group as industry bolsters DC presenceEx-Trump lawyer Habba resigns as NJ U.S. attorney after disqualificationTrump, in recent weeks, has renewed pressure to end the conflict that began when Russia invaded Ukraine in February 2022. In a recent interview with Politico, Trump said that Zelenskyy should accept the U.S.-backed agreement \"because he's losing.\"For the deal to be final, Zelenskyy and Russian President Vladimir Putin will have to come to terms over territory, an issue the Americans and Ukrainians continue to negotiate, officials said. Putin has demanded that Ukraine must surrender territory for the war to end. Zelenskyy to date has refused to cede any land. Negotiations are expected to continue through this coming weekend, potentially in Miami.Trump is expected to call into a dinner that U.S. officials are having with Zelenskyy and other European leaders on Monday night.\"Hopefully we are on the path to peace,\" a U.S. official said on the call.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ukraine peace talks progressing, Russia open to EU membership, U.S. officials say",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108241917-1765820182904-gettyimages-2251498991-AFP_888E44G.jpeg?v=1765836836&w=1920&h=1080"
      ],
      "datePublished": "2025-12-15T22:29:46.000Z",
      "dateModified": "2025-12-15T22:29:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "OpenAI poaches Google executive to lead corporate development",
    "url": "https://www.cnbc.com/2025/12/15/openai-poaches-google-executive-to-lead-corporate-development.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108236127-1764788053311-gettyimages-2243573116-boivin-notitle251029_npvxc.jpeg?v=1764788123&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-15T19:03:16.000Z",
    "description": "Samuel Boivin | Nurphoto | Getty ImagesOpenAI has hired Google's Albert Lee to lead corporate development, a spokesperson for the artificial intellige",
    "body": "Samuel Boivin | Nurphoto | Getty ImagesOpenAI has hired Google's Albert Lee to lead corporate development, a spokesperson for the artificial intelligence startup confirmed to CNBC. Lee previously led corporate development for Google Cloud and Google DeepMind. He worked on several of Google's high-profile acquisitions, including its $32 billion purchase of the cloud security startup Wiz, which the company announced in March. In his new role, Lee will have broad visibility across OpenAI as the company focuses on strategic investments and M&A in its next phase of growth, the spokesperson said. His hiring signals that OpenAI will continue to hunt for targets that can help it gain an edge over rivals like Google and Anthropic.OpenAI was founded as a nonprofit research lab in 2015, but its valuation has ballooned to $500 billion since the launch of ChatGPT in 2022. The AI lab has made multiple acquisitions this year. Most recently, OpenAI earlier this month announced a definitive agreement to acquire Neptune, a startup that helps with AI model training. The companies did not disclose the terms.OpenAI also bought a small company called Software Applications Incorporated for an undisclosed sum in October, the product development startup Statsig for $1.1 billion in September and former Apple designer Jony Ive's AI devices startup io for more than $6 billion in May.Lee is the latest of several executives to join OpenAI as the company looks to fill out its leadership bench. Earlier this month, OpenAI announced Slack CEO Denise Dresser will serve as its chief revenue officer. In May, the company announced it hired Fidji Simo, who was then CEO of Instacart, as the head of the AI lab's applications business.The Information was first to report Lee's departure from Google.WATCH: OpenAI unveils GPT-5.2, its strongest AI model for professional usewatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "OpenAI poaches Google executive to lead corporate development",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108236127-1764788053311-gettyimages-2243573116-boivin-notitle251029_npvxc.jpeg?v=1764788123&w=1920&h=1080"
      ],
      "datePublished": "2025-12-15T19:03:16.000Z",
      "dateModified": "2025-12-15T19:03:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump doubles down on Rob Reiner criticism after killing; director's son in custody",
    "url": "https://www.cnbc.com/2025/12/15/rob-reiner-death-trump.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108241815-1765811816631-gettyimages-2235654496-_jjj8998_e43ehbcm.jpeg?v=1765811864&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-16T00:10:14.000Z",
    "description": "Rob Reiner discusses the story of \"Spinal Tap\" at 92NY on September 15, 2025 in New York City. John Lamparski | Getty Images Entertainment | Getty Ima",
    "body": "Rob Reiner discusses the story of \"Spinal Tap\" at 92NY on September 15, 2025 in New York City. John Lamparski | Getty Images Entertainment | Getty ImagesPresident Donald Trump slammed Rob Reiner on Monday morning, a day after the famed Hollywood director and his wife, Michele Singer Reiner, were found brutally slain in their Los Angeles home.Trump's social-media screed against Reiner, who was a staunch critic of the president, came as the Reiners' 32-year-old son Nick was arrested and held on $4 million bond, according to LA County Sheriff's Department jail records. Nick Reiner was booked on suspicion of murder.Trump suggested that the couple was killed because of \"the anger\" Rob Reiner caused in other people due to his opposition to the Republican president. However, there is no evidence to suggest that this is the case, and the police have not provided any motive.Trump, during comments to reporters later, doubled down and expanded on criticism of Reiner, even after a number of Republicans said that he was wrong to do so.\"He was a deranged person as far as Trump is concerned,\" Trump said.The president accused Reiner of promoting \"the Russian hoax,\" saying \"that I was a friend of Russia, controlled by Russia.\"\"He was one of the people behind it,\" Trump said. \"So I was not a fan of Rob Reiner at all in any way, shape, or form. I thought he was very bad for our country.\"Read more CNBC politics coverageTrump sues BBC for $5 billion, claims defamation from Panorama documentaryPentagon takes big stake in new Korea Zinc refinery in Tenn., gets 10% of companyNew Trump tariffs collection hits $200 billion, Customs saysFormer Instacart employee says she was fired over her Democratic congressional campaignUkraine peace talks progressing, Russia open to EU membership, U.S. officials sayNew York AG sues UPS for allegedly shorting Christmas season workers' wagesTrump admin to hire 1,000 specialists for 'Tech Force'Trump doubles down on Rob Reiner criticism after killing; director's son in custodyTSA is giving airline passenger data to ICE for deportation push: NYTTrump's AI order may be 'illegal,' Democrats and consumer advocacy groups claimTrump sued by preservation group seeking to halt White House ballroom projectTrump says 'no big deal' after new Epstein photos showing him releasedPutin can fund war for years, ex-official says as Trump's resolve is testedIndiana redistricting bill that Trump demanded defeated in state SenateHouse passes INVEST Act to ease investment standards, boost capital in marketsDOJ fails again to indict New York AG James, a Trump target: ReportsTrump 'sells out' U.S. national security with Nvidia chip sales to China: WarrenTrump pushes for top prosecutor nominee Halligan after Comey, James cases tossedTrump willing to seize more oil tankers off Venezuela coast: White HouseSeized tanker will go to U.S. port, Trump admin intends 'to seize the oil'GOP lawmakers seek Trump aid for agricultural equipment after tariff pressureTrump says Fed could have 'at least doubled' latest interest rate cut'Spoof' ship: Seized oil tanker hid location, visited Iran and VenezuelaTrump admin touts pulling 9,500 truckers off road for failing English testsSwiss government says new 15% U.S. tariff ceiling retroactive to mid-NovemberHomeland Security Dept. buying Boeing 737s for ICE deportationsTrump officials move to end student loan payment pause for millions of borrowersJudge unseals Ghislaine Maxwell grand jury materials, citing Epstein files actUkraine at 'critical moment' in war as European allies ramp up pressure on RussiaDemocrats establish AI working group as industry bolsters DC presenceEx-Trump lawyer Habba resigns as NJ U.S. attorney after disqualificationEarlier Monday, Trump wrote on Truth Social, \"A very sad thing happened last night in Hollywood.\"\"Rob Reiner, a tortured and struggling, but once very talented movie director and comedy star, has passed away, together with his wife, Michele, reportedly due to the anger he caused others through his massive, unyielding, and incurable affliction with a mind crippling disease known as TRUMP DERANGEMENT SYNDROME, sometimes referred to as TDS,\" Trump wrote.\"He was known to have driven people CRAZY by his raging obsession of President Donald J. Trump, with his obvious paranoia reaching new heights as the Trump Administration surpassed all goals and expectations of greatness, and with the Golden Age of America upon us, perhaps like never before,\" the president wrote. \"May Rob and Michele rest in peace!\"(L-R) Director Rob Reiner and his son Nick Reiner attend AOL Build Presents: \"Being Charlie\"  at AOL Studios In New York on May 4, 2016 in New York City.  Rommel Demano | Getty ImagesSenate Minority Leader Chuck Schumer, in a social media post, said of Trump's comments: \"He knows no shame. A total jackass.\"Trump's former lawyer, Jenna Ellis, in a social media post wrote of Trump: \"A man and his wife were murdered last night. This is NOT the appropriate response.\"\"The Right uniformly condemned political and celebratory responses to Charlie Kirk's death,\" Ellis wrote. \"This is a horrible example from Trump (and surprising considering the two attempts on his own life) and should be condemned by everyone with any decency.\"Rep. Don Bacon, a Nebraska Republican, told CNN, \"I'd expect to hear something like this from a drunk guy at a bar, not the president of the United States. Can the president be presidential?\"Rep. Thomas Massie, a Kentucky Republican, also called out Trump for his post.\"Regardless of how you felt about Rob Reiner, this is inappropriate and disrespectful discourse about a man who was just brutally murdered,\" Massie wrote on X.\"I guess my elected GOP colleagues, the VP, and White House staff will just ignore it because they're afraid? I challenge anyone to defend it,\" he added.Massie has been targeted by Trump for months after co-sponsoring a petition in the House that led to passage of a law directing the Justice Department to release its investigative files about notorious sex predator Jeffrey Epstein and his accomplice Ghislaine Maxwell. Trump, who was previously friends with Epstein, had opposed that law until the last minute.U.S. President Donald Trump looks on before departing for the Army/Navy football game in Baltimore, at the White House in Washington, D.C., U.S., December 13, 2025. Aaron Schwartz | ReutersAnother House Republican who has fallen out with Trump, Rep. Marjorie Taylor Greene of Georgia, in a post replying to the president on X, said, \"This is a family tragedy, not about politics or political enemies.\"\"Many families deal with a family member with drug addiction and mental health issues,\" Greene wrote. \"It's incredibly difficult and should be met with empathy especially when it ends in murder.\" Greene last month said she will resign her seat effective Jan. 5 because of her falling out with Trump.Reiner blasted Trump in an MS Now interview in October.\"Make no mistake; we have a year before this country becomes a full-on autocracy, and democracy completely leaves us,\" Reiner said in that interview.\"And we're  looking at the election in 2026, and Donald Trump knows that in a free  and fair election, he will lose,\" Reiner said. \"He will lose the House, the House will  flip and will become in Democratic hands. There will be committee chairs  who will be able to hold meetings, and this is the last thing he  wants.\"Reiner's movies included \"This is Spinal Tap,\" \"The Princess Bride,\" \"When Harry Met Sally,\" and \"A Few Good Men.\"He first gained fame as playing the son-in-law of Archie Bunker on the classic television show \"All in the Family.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump doubles down on Rob Reiner criticism after killing; director's son in custody",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108241815-1765811816631-gettyimages-2235654496-_jjj8998_e43ehbcm.jpeg?v=1765811864&w=1920&h=1080"
      ],
      "datePublished": "2025-12-16T00:10:14.000Z",
      "dateModified": "2025-12-16T00:10:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Pentagon takes big stake in new Korea Zinc smelter in Tennessee, will get 10% of company",
    "url": "https://www.cnbc.com/2025/12/15/pentagon-korea-zinc-refinery-tennessee.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108241946-1765821811549-gettyimages-2179354511-SKOREA_KOREA_ZINC.jpeg?v=1765834402&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-15T21:50:16.000Z",
    "description": "Water vapor and smoke rise from a Korea Zinc Co. smelting factory in Ulsan, South Korea, Oct. 21, 2024.SeongJoon Cho | Bloomberg | Getty ImagesThe Def",
    "body": "Water vapor and smoke rise from a Korea Zinc Co. smelting factory in Ulsan, South Korea, Oct. 21, 2024.SeongJoon Cho | Bloomberg | Getty ImagesThe Defense Department is getting a 40% stake in a $7.4 billion mineral smelter to be built in Tennessee in partnership with Korea Zinc, Reuters reported Monday.The critical minerals smelting and processing facility could produce 540,000 tons of materials in the U.S. per year, according to the U.S. Commerce Department. The deal comes as the U.S. seeks to form critical mineral partnerships that are not dependent on China.Reuters said that Korea Zinc will sell new shares worth $1.9 billion to a joint venture controlled by the U.S. government and unnamed U.S.-based strategic investors. The government and investors would then control 10% of Korea Zinc, according to the news outlet.\"The United States hasn't built a large-scale zinc smelter like this since the 1970s — a fact that reflects how decades of poor leadership imperiled our national and economic security,\" White House spokesman Kush Desai said in a statement to CNBC on Monday.\"Thanks to President Trump, that's now changing with Korea Zinc's ... investment in Tennessee,\" Desai said. \"The Trump administration will continue to leverage every tool at our disposal to end America's foreign dependence for critical minerals and restore working-class prosperity.\"The Pentagon did not immediately respond to a request for comment.\"These minerals power the technologies that matter most for our future: defense systems, semiconductors, AI, quantum computing, autos, data centers, and advanced manufacturing,\" the Commerce Department said in a post on X Monday.Read more CNBC politics coverageTrump sues BBC for $5 billion, claims defamation from Panorama documentaryPentagon takes big stake in new Korea Zinc refinery in Tenn., gets 10% of companyNew Trump tariffs collection hits $200 billion, Customs saysFormer Instacart employee says she was fired over her Democratic congressional campaignUkraine peace talks progressing, Russia open to EU membership, U.S. officials sayNew York AG sues UPS for allegedly shorting Christmas season workers' wagesTrump admin to hire 1,000 specialists for 'Tech Force'Trump doubles down on Rob Reiner criticism after killing; director's son in custodyTSA is giving airline passenger data to ICE for deportation push: NYTTrump's AI order may be 'illegal,' Democrats and consumer advocacy groups claimTrump sued by preservation group seeking to halt White House ballroom projectTrump says 'no big deal' after new Epstein photos showing him releasedPutin can fund war for years, ex-official says as Trump's resolve is testedIndiana redistricting bill that Trump demanded defeated in state SenateHouse passes INVEST Act to ease investment standards, boost capital in marketsDOJ fails again to indict New York AG James, a Trump target: ReportsTrump 'sells out' U.S. national security with Nvidia chip sales to China: WarrenTrump pushes for top prosecutor nominee Halligan after Comey, James cases tossedTrump willing to seize more oil tankers off Venezuela coast: White HouseSeized tanker will go to U.S. port, Trump admin intends 'to seize the oil'GOP lawmakers seek Trump aid for agricultural equipment after tariff pressureTrump says Fed could have 'at least doubled' latest interest rate cut'Spoof' ship: Seized oil tanker hid location, visited Iran and VenezuelaTrump admin touts pulling 9,500 truckers off road for failing English testsSwiss government says new 15% U.S. tariff ceiling retroactive to mid-NovemberHomeland Security Dept. buying Boeing 737s for ICE deportationsTrump officials move to end student loan payment pause for millions of borrowersJudge unseals Ghislaine Maxwell grand jury materials, citing Epstein files actUkraine at 'critical moment' in war as European allies ramp up pressure on RussiaDemocrats establish AI working group as industry bolsters DC presenceEx-Trump lawyer Habba resigns as NJ U.S. attorney after disqualificationThe Commerce Department said that in addition to the smelter, the U.S. would have priority access to Korea Zinc's global production. The deal \"strengthens our national security, rebuilds our industrial base, and ends our dependence on foreign supply chains,\" the post states.The Korea Zinc deal follows an $8.5 billion \"framework\" agreement between the U.S. and Australia in October to increase rare earth and critical mineral investment between the two countries.Rare earths are a type of critical minerals that can be used in the development of weapons, semiconductor manufacturing, robotics and electric vehicles. China currently dominates the rare earths supply chain.As part of the agreement with Australia, the Pentagon agreed to invest in building a gallium refinery in western Australia, the White House said at the time.  The Pentagon in July became the largest shareholder in the rare earth miner MP Materials after agreeing to buy $400 million of its preferred stock. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Pentagon takes big stake in new Korea Zinc smelter in Tennessee, will get 10% of company",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108241946-1765821811549-gettyimages-2179354511-SKOREA_KOREA_ZINC.jpeg?v=1765834402&w=1920&h=1080"
      ],
      "datePublished": "2025-12-15T21:50:16.000Z",
      "dateModified": "2025-12-15T21:50:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Former Instacart employee says she was fired over her Democratic congressional campaign",
    "url": "https://www.cnbc.com/2025/12/15/instacart-lawsuit-congress-campaign-trump.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108241923-1765820670037-gettyimages-2212073860-img_8643.jpeg?v=1765820713&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-15T19:57:28.000Z",
    "description": "Cheng Xin | Getty ImagesA former Instacart employee running for Congress alleges in a lawsuit that the company fired her out of concern that her Democ",
    "body": "Cheng Xin | Getty ImagesA former Instacart employee running for Congress alleges in a lawsuit that the company fired her out of concern that her Democratic political views could lead to backlash from the Trump administration. Elizabeth Vedernikova Khanna, a candidate for Virginia's 1st Congressional District, worked as chief of staff to Instacart's chief corporate affairs officer since early 2023 and was terminated in June, according to the suit filed Sunday in San Francisco Superior Court.Khanna, who goes by Lisa, accuses the grocery delivery giant of reversing its initial approval for her congressional bid after reviewing a copy of her campaign website's policy positions, \"specifically support for abortion rights and gun control.\"Instacart suddenly determined \"that the potential risk of Republican backlash to the company outweighed Ms. Khanna's right to run for public office,\" alleges the lawsuit, which was first reported by The Washington Post earlier Monday.Hours after that review took place, the San Francisco-based company \"prohibited Ms. Khanna from running for Congress while keeping her job, ostensibly enforcing company rules and policies,\" according to the suit.\"Less than two weeks later it terminated her because of her stated policy positions,\" Khanna's attorneys allege.An Instacart spokesperson, in an emailed statement to CNBC, said, \"Khanna's claim that her separation from Instacart was somehow politically motivated is flat out false.\"Read more CNBC politics coverageTrump sues BBC for $5 billion, claims defamation from Panorama documentaryPentagon takes big stake in new Korea Zinc refinery in Tenn., gets 10% of companyNew Trump tariffs collection hits $200 billion, Customs saysFormer Instacart employee says she was fired over her Democratic congressional campaignUkraine peace talks progressing, Russia open to EU membership, U.S. officials sayNew York AG sues UPS for allegedly shorting Christmas season workers' wagesTrump admin to hire 1,000 specialists for 'Tech Force'Trump doubles down on Rob Reiner criticism after killing; director's son in custodyTSA is giving airline passenger data to ICE for deportation push: NYTTrump's AI order may be 'illegal,' Democrats and consumer advocacy groups claimTrump sued by preservation group seeking to halt White House ballroom projectTrump says 'no big deal' after new Epstein photos showing him releasedPutin can fund war for years, ex-official says as Trump's resolve is testedIndiana redistricting bill that Trump demanded defeated in state SenateHouse passes INVEST Act to ease investment standards, boost capital in marketsDOJ fails again to indict New York AG James, a Trump target: ReportsTrump 'sells out' U.S. national security with Nvidia chip sales to China: WarrenTrump pushes for top prosecutor nominee Halligan after Comey, James cases tossedTrump willing to seize more oil tankers off Venezuela coast: White HouseSeized tanker will go to U.S. port, Trump admin intends 'to seize the oil'GOP lawmakers seek Trump aid for agricultural equipment after tariff pressureTrump says Fed could have 'at least doubled' latest interest rate cut'Spoof' ship: Seized oil tanker hid location, visited Iran and VenezuelaTrump admin touts pulling 9,500 truckers off road for failing English testsSwiss government says new 15% U.S. tariff ceiling retroactive to mid-NovemberHomeland Security Dept. buying Boeing 737s for ICE deportationsTrump officials move to end student loan payment pause for millions of borrowersJudge unseals Ghislaine Maxwell grand jury materials, citing Epstein files actUkraine at 'critical moment' in war as European allies ramp up pressure on RussiaDemocrats establish AI working group as industry bolsters DC presenceEx-Trump lawyer Habba resigns as NJ U.S. attorney after disqualification\"As part of our Conflicts of Interest policy assessment, we determined it would be impossible for Lisa to fulfill the demands of her role as the Chief of Staff to our Chief Corporate Affairs Officer – who runs our policy & government affairs and communication teams – while simultaneously running a 17-month federal campaign for Congress,\" the spokesperson said.\"Her political beliefs had absolutely nothing to do with this decision,\" the spokesperson said, adding that the company \"repeatedly supported her civic involvement\" by \"approving a number of prior requests for public-facing political leadership roles that were far less time intensive.\"Instacart offered Khanna \"a leave of absence or a paid, hourly consulting arrangement during her campaign,\" but she \"rejected both offers, and instead demanded that we pay her $5 million — more than 20x her annual salary,\" the spokesperson alleged.Khanna's lawyers, meanwhile, say Instacart's actions are of a piece with how corporate America has sought to stay in the federal government's good graces since President Donald Trump returned to office. \"There has been a well-documented trend of powerful corporations bending over backwards to curry favor with the Trump Administration,\" her lawyers said in a statement on the lawsuit.The suit itself says that then-CEO Fidji Simo took \"several actions to strengthen Instacart's and her relationship with the Trump Administration\" after the 2024 election. Those actions included sending a congratulatory gift to Ivanka Trump and having the company donate $100,000 to Trump's inaugural fund, while seeking meetings with high-level administration associates, according to the lawsuit.Khanna accuses Instacart of violating rules against blocking employee's political activities, and of wrongfully firing her \"in violation of the fundamental public policy of the State of California.\"She is asking for a jury trial and seeks both punitive and compensatory damages, \"including emotional distress damages and economic damages.\"She is also asking a judge to order Instacart to \"provide mandatory and meaningful training to all executives, managers, and employees regarding the laws prohibiting interference with and retaliation against employees for their political actions and political activities.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Former Instacart employee says she was fired over her Democratic congressional campaign",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108241923-1765820670037-gettyimages-2212073860-img_8643.jpeg?v=1765820713&w=1920&h=1080"
      ],
      "datePublished": "2025-12-15T19:57:28.000Z",
      "dateModified": "2025-12-15T19:57:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "PayPal applies to form bank that can offer small business loans and savings accounts",
    "url": "https://www.cnbc.com/2025/12/15/paypal-seeks-us-approval-to-form-bank-offer-small-business-loans.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108242128-1765835737899-gettyimages-2239332788-aditya-notitle251007_npT89.jpeg?v=1765835816&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-15T22:11:08.000Z",
    "description": "PayPal CEO Alex Chriss speaks at the Global Fintech Fest in Mumbai, India, on Oct. 7, 2025.Indranil Aditya | Nurphoto | Getty ImagesPayPal said Monday",
    "body": "PayPal CEO Alex Chriss speaks at the Global Fintech Fest in Mumbai, India, on Oct. 7, 2025.Indranil Aditya | Nurphoto | Getty ImagesPayPal said Monday that it has applied for approval to form PayPal Bank, which would be able to offer loans to small businesses.\"Establishing PayPal Bank will strengthen our business and improve our efficiency, enabling us to better support small business growth and economic opportunities across the U.S.,\" PayPal CEO Alex Chriss said in a statement.The U.S. Federal Deposit Insurance Corporation will review an application proposing the establishment of PayPal Bank, along with Utah's Department of Financial Institutions, PayPal said. The company, which owns popular payment app Venmo, hopes to also offer interest-bearing savings accounts to its customers, the statement said. PayPal already makes credit lines available to consumers and has been trying to expand its roster of banking-like services as it competes with a growing number of fintech companies that are aiming to take business from traditional brick-and-mortar banks.Shares of PayPal rose 1.5% in extended trading following the announcement. In October, PayPal said quarterly revenue increased 7% year over year to $8.42 billion, more than analysts had expected. But in 2025 the stock has slumped about 29%, while the S&P 500 index has gained almost 16% in the same period.WATCH: E-commerce consumption could bump 20% because of agentic AI, says Mizuho's Dan Dolevwatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "PayPal applies to form bank that can offer small business loans and savings accounts",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108242128-1765835737899-gettyimages-2239332788-aditya-notitle251007_npT89.jpeg?v=1765835816&w=1920&h=1080"
      ],
      "datePublished": "2025-12-15T22:11:08.000Z",
      "dateModified": "2025-12-15T22:11:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tesla stock closes at 2025 high after Musk confirms driverless Robotaxi tests underway in Austin",
    "url": "https://www.cnbc.com/2025/12/15/tesla-tests-driverless-cars-in-austin-without-humans-on-board.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108170263-1752161555242-gettyimages-2220743970-AUSTIN_ROBOTAXI.jpeg?v=1752161618&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-15T23:53:57.000Z",
    "description": "A vehicle Tesla is using for robotaxi testing purposes on Oltorf Street in Austin, Texas, US, on Sunday, June 22, 2025. The launch of Tesla Inc.'s dri",
    "body": "A vehicle Tesla is using for robotaxi testing purposes on Oltorf Street in Austin, Texas, US, on Sunday, June 22, 2025. The launch of Tesla Inc.'s driverless taxi service Sunday is set to begin modestly, with a handful of vehicles in limited areas of the city. Photographer: Tim Goessman/Bloomberg via Getty ImagesTim Goessman | Bloomberg | Getty ImagesNearly six months after launching a limited Robotaxi service in Austin, Texas with safety drivers in the car, the company says it's testing driverless vehicles in the city without humans on board.\"Testing is underway with no occupants in the car,\" CEO Elon Musk wrote in a post on his social network X over the weekend.  Shares of Tesla rose 3.6% to $475.31 at the close of trading on Monday. The stock is now up 18% for the year, and is about 1% off its record reached in December 2024. For more than a decade, Musk has been promising Tesla investors and customers that the company's electric vehicles will soon be upgradable to self-driving cars, capable of serving as unmanned robotaxis, or of completing a cross-country trip without any human intervention.While that still hasn't happened, the company unveiled a Robotaxi-branded ridehail app and service in Austin in June, and a separate car service in the San Francisco Bay Area soon after. On Sunday, Tesla's official account wrote in a pair of posts on X, \"The fleet will wake up via over-the-air software update,\" and \"Slowly then all at once.\" \"And so it begins!\" wrote Ashok Elluswamy, Tesla's vice president of AI software, in a post on X, in response to a video that had been posted by someone else of what appeared to be driverless vehicle in Austin.Tesla hasn't said when it will be able to operate a ride-hailing service without human safety supervisors or drivers on board. But it may have still have a long way to go.Elon Musk interviews on CNBC from the Tesla Headquarters in Texas. CNBCTesla reported that, as of mid-October, seven collisions had occurred in the vehicles in its Austin fleet. The cars include ADS, or automated driving systems, which are not yet widely available, and human safety supervisors in the passenger seat or behind the steering wheel. The self-reported data Tesla filed with the National Highway Traffic Safety Administration indicate that the collisions were not severe.Philip Koopman, emeritus professor at Carnegie Mellon University and an autonomous systems safety researcher, said in an email that with such a small fleet, there should have been fewer than seven reportable accidents, \"especially considering that there is a safety supervisor in each one whose job is to prevent crashes.\" Tesla's Robotaxi fleet in Austin was comprised of 30 or fewer vehicles as of October. Musk has said the company intends to double that to 60 by the end of 2025.Koopman noted that Tesla has chosen to hide the \"narrative description\" of all their crashes in the reports to NHTSA, so there's no way for the public to know what transpired with each collision. Tesla didn't respond to a request for further information. In Texas, autonomous vehicle makers are currently permitted to test or use their cars on public roads as long as they comply with traffic laws under the state's transportation code. The Texas Department of Motor Vehicles told CNBC in an email that it \"does not have direct authority related to autonomous vehicle regulation and therefore cannot speak to current activities\" regarding Tesla. Regulatory requirements in Texas will change in 2026 with the implementation of its Senate Bill 2807, which the Texas legislature passed earlier this year. As of May 28, 2026, autonomous vehicle operators in Texas will require an authorization from the DMV for commercial use of their self-driving vehicles on Texas roads. California's DMV and Public Utilities Commissions confirmed that Tesla has not yet applied for permits needed to conduct driverless testing in the state without a human at the wheel, or to operate a commercial robotaxi service.In the autonomous vehicles market, Tesla lags behind Alphabet's Waymo in the U.S., and Baidu-owned Apollo Go and WeRide in Asia. Those companies are all operating commercial ridehailing robotaxi services in major markets.Correction: A prior version of this story had an incorrect closing price for Tesla's stock. WATCH: We went to Texas for Tesla's Robotaxi launchwatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tesla stock closes at 2025 high after Musk confirms driverless Robotaxi tests underway in Austin",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108170263-1752161555242-gettyimages-2220743970-AUSTIN_ROBOTAXI.jpeg?v=1752161618&w=1920&h=1080"
      ],
      "datePublished": "2025-12-15T23:53:57.000Z",
      "dateModified": "2025-12-15T23:53:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump sues BBC for $10 billion, claims defamation from Panorama documentary",
    "url": "https://www.cnbc.com/2025/12/16/trump-bbc-panorama-election-defamation-lawsuit.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108224302-17628789742025-11-11t081914z_739548775_rc27uhapu612_rtrmadp_0_britain-bbc.jpeg?v=1762878987&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-16T04:32:46.000Z",
    "description": "A security guard stands guard outside BBC Broadcasting House after Director General of BBC Tim Davie and Chief Executive of BBC News Deborah Turness r",
    "body": "A security guard stands guard outside BBC Broadcasting House after Director General of BBC Tim Davie and Chief Executive of BBC News Deborah Turness resigned following accusations of bias at the British broadcaster, including in the way it edited a speech by U.S. President Donald Trump, in London, Britain, November 11, 2025. Hannah Mckay | ReutersPresident Donald Trump filed a defamation lawsuit against the BBC in Miami federal court on Monday night, seeking $10 billion in damages.The civil complaint accuses the British Broadcasting Corporation of producing a \"false, defamatory, deceptive, disparaging, inflammatory, and malicious depiction of President Trump\" in a Panorama documentary aired one week before the 2024 election.Trump's suit alleges the documentary was produced as part of \"a brazen attempt to interfere in and influence the Election's outcome to President Trump's detriment.\"The suit notes that the documentary, titled \"Trump: A Second Chance,\" was edited to make it appear that during his Jan. 6, 2021, speech outside the White House, Trump had explicitly urged his supporters to attack the U.S. Capitol.\"The Panorama Documentary falsely depicted President Trump telling supporters: 'We're going to walk down to the Capitol and I'll be there with you. And we fight. We fight like hell and if you don't fight like hell, you're not going to have a country anymore,' \" the suit says. \"President Trump never uttered this sequence of words.\"In fact, the suit says, the sentence containing the words \"And we fight\" was uttered by Trump nearly 55 minutes after he said the words \"I'll be there with you.\"BBC Chair Samir Shah recently apologized for an \"error of judgment\"  over the edit, and the broadcaster's director general and head of news both resigned.CNBC has requested comment from the BBC on Trump's suit, which seeks $5 billion in damages for each of its two counts: defamation, and violation of Florida's Deceptive and Unfair Trade Practices Act.The BBC apologized to Trump on Nov. 13 and promised not to air the documentary again or show it on any of its platforms.\"While the BBC sincerely regrets the manner in which the video clip  was edited, we strongly disagree there is a basis for a defamation  claim,\" the broadcaster said in a statement on Nov. 13.A spokesman for Trump's legal team, in a statement, said, \"The formerly respected and now disgraced BBC defamed President Trump by intentionally, maliciously, and deceptively doctoring his speech in a brazen attempt to interfere in the 2024 Presidential Election.\"\"The BBC has a long pattern of deceiving its audience in coverage of President Trump, all in service of its own leftist political agenda,\" the spokesman said. \"President Trump's powerhouse lawsuit is holding the BBC accountable for its defamation and reckless election interference just as he has held other fake news mainstream media responsible for their wrongdoing.\"Read more CNBC politics coverageTrump sues BBC for $5 billion, claims defamation from Panorama documentaryPentagon takes big stake in new Korea Zinc refinery in Tenn., gets 10% of companyNew Trump tariffs collection hits $200 billion, Customs saysFormer Instacart employee says she was fired over her Democratic congressional campaignUkraine peace talks progressing, Russia open to EU membership, U.S. officials sayNew York AG sues UPS for allegedly shorting Christmas season workers' wagesTrump admin to hire 1,000 specialists for 'Tech Force'Trump doubles down on Rob Reiner criticism after killing; director's son in custodyTSA is giving airline passenger data to ICE for deportation push: NYTTrump's AI order may be 'illegal,' Democrats and consumer advocacy groups claimTrump sued by preservation group seeking to halt White House ballroom projectTrump says 'no big deal' after new Epstein photos showing him releasedPutin can fund war for years, ex-official says as Trump's resolve is testedIndiana redistricting bill that Trump demanded defeated in state SenateHouse passes INVEST Act to ease investment standards, boost capital in marketsDOJ fails again to indict New York AG James, a Trump target: ReportsTrump 'sells out' U.S. national security with Nvidia chip sales to China: WarrenTrump pushes for top prosecutor nominee Halligan after Comey, James cases tossedTrump willing to seize more oil tankers off Venezuela coast: White HouseSeized tanker will go to U.S. port, Trump admin intends 'to seize the oil'GOP lawmakers seek Trump aid for agricultural equipment after tariff pressureTrump says Fed could have 'at least doubled' latest interest rate cut'Spoof' ship: Seized oil tanker hid location, visited Iran and VenezuelaTrump admin touts pulling 9,500 truckers off road for failing English testsSwiss government says new 15% U.S. tariff ceiling retroactive to mid-NovemberHomeland Security Dept. buying Boeing 737s for ICE deportationsTrump officials move to end student loan payment pause for millions of borrowersJudge unseals Ghislaine Maxwell grand jury materials, citing Epstein files actUkraine at 'critical moment' in war as European allies ramp up pressure on RussiaDemocrats establish AI working group as industry bolsters DC presenceEx-Trump lawyer Habba resigns as NJ U.S. attorney after disqualificationTrump earlier Monday told reporters at the White House that the lawsuit would soon be filed.\"In a little while, you'll be seeing I'm suing the BBC for putting words in my mouth,\" Trump said. \"Literally, they put words in my mouth. They had me saying things that I never said coming out.\"The suit alleges that \"concerns about the Panorama Documentary were raised internally before its dissemination, but the BBC ignored those concerns and did not take corrective action.\"The complaint also said the documentary \"is part of the BBC's longstanding pattern of manipulating President Trump's speeches and presenting content in a misleading manner in order to defame him, including fabricating calls for violence that he never made.\"The suit is the latest in a series of defamation complaints that the notoriously litigious president has filed against media outlets.Trump filed a $15 billion lawsuit against The New York Times in September, accusing the newspaper of being a \"mouthpiece\" for the Democratic Party.In July, Trump filed a lawsuit seeking $10 billion in damages from media baron Rupert Murdoch and the publisher of The Wall Street Journal over that newspaper's report that Trump sent his then-friend Jeffrey Epstein a \"bawdy\" letter for Epstein's 50th birthday.Trump denies sending or authoring that letter, which was among the documents that the notorious sex offender Epstein's estate has since turned over to a congressional committee.Trump sued CBS for $20 billion in October 2024 over what he alleged was deceptive editing of an interview that his then-election opponent Kamala Harris gave to \"60 Minutes.\"CBS' parent, Paramount Skydance, in July agreed to pay $16 million to settle the lawsuit, with the money allocated to Trump's future presidential library. The payment came weeks before the Federal Communications Commission, which is led by a Trump appointee, approved Paramount's plan for an $8 billion merger with Skydance Media.ABC in December 2024 agreed to pay $15 million toward Trump's library to settle a defamation lawsuit related to anchor George Stephanopoulos inaccurately describing the civil jury verdict in a lawsuit against Trump by the writer E. Jean Carroll.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump sues BBC for $10 billion, claims defamation from Panorama documentary",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108224302-17628789742025-11-11t081914z_739548775_rc27uhapu612_rtrmadp_0_britain-bbc.jpeg?v=1762878987&w=1920&h=1080"
      ],
      "datePublished": "2025-12-16T04:32:46.000Z",
      "dateModified": "2025-12-16T04:32:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "FDA approved a $250,000 Singapore work trip during government shutdown, records show",
    "url": "https://www.cnbc.com/2025/12/15/fda-staff-trip-singapore-government-shutdown.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108240737-1765474812295-Hotel_Pool.jpg?v=1765559746&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-15T13:00:01.000Z",
    "description": "SINGAPORE — Sentosa Island boasts the luxury, five-star Ora and Michael hotels, with palm-tree-lined pools, lobbies flanked with luxury stores, and a ",
    "body": "SINGAPORE — Sentosa Island boasts the luxury, five-star Ora and Michael hotels, with palm-tree-lined pools, lobbies flanked with luxury stores, and a casino that adjoins both hotels and buzzes with gamblers. The Singapore resort is also where a group of federal employees from the U.S. Food and Drug Administration were sent for a work trip in the final hours of the government shutdown. The palm-tree-lined pool of the Hotel Ora on Singapore's Sentosa Island.CNBCInternal FDA records obtained by CNBC show 31 agency staffers traveled to Singapore in mid-November for a conference of the International Council for Harmonisation of Technical Requirements for Pharmaceuticals for Human Use, or ICH — a trip that cost more than a quarter of a million dollars, or upward of $8,000 per person, according to the documents. The travel was approved when the agency was operating with reduced staffing and limited resources in part due to the shutdown. The FDA is under significant pressure. The Trump administration proposed an 11.5% cut to the FDA's budget this year. Nearly 1,900 staffers were laid off, and around 1,200 others took early retirement packages, according to May testimony from FDA Commissioner Marty Makary. In addition, senior leadership has been in upheaval, and former FDA chiefs have publicly questioned the agency's handling of key issues such as vaccine policy. Marty Makary, President Donald Trump's nominee to be U.S. Food and Drug Administration commissioner, attends a Senate Health, Education, Labor, and Pensions Committee confirmation hearing on Capitol Hill in Washington, March 6, 2025.Kent Nishimura | ReutersThe FDA attendees at the Singapore conference ranged from deputy directors to a program coordinator, records show. Their travel was approved about one week before the end of the government shutdown — the longest in U.S. history, at 43 days. Most staffers departed on Nov. 12, the same day the U.S. House of Representatives voted to end the shutdown, and the remaining travelers left Nov. 13 and 14, according to the documents. The ICH, registered as a nonprofit under Swiss law, says it aims to unify the global standards for drug development and approval. The conference, held Nov. 18-19, took place in a series of meeting rooms on the island resort grounds.ICH told CNBC in an email that \"approximately 500 people attended in person,\" including regulators and pharmaceutical industry experts from around the world. It also wrote that the \"FDA is one of the founding members of ICH\" and helps develop the requirements for \"safe, effective, and high-quality pharmaceuticals.\"As part of the November assembly, three guidelines were adopted that aim to streamline global drug development and safety monitoring, according to the ICH. In a follow-up email, the organization said the first guideline provides a template to eliminate \"inconsistent formats\" in clinical trial protocols and ease electronic data sharing. The second seeks to ensure post-approval safety reports are \"complete, accurate and timely\" by aligning definitions and reporting practices, it said. The third adopted guideline sets international standards for noninterventional, real-world data studies to ensure they are \"scientifically sound\" and comparable across regulators. FDA staffers contributed to all three of these guidelines, according to conference documents.The FDA said in a statement to CNBC that sending staffers to the meeting was \"mission critical\" and that the purpose of the conference was to \"support global alignment on drug development, approval standards, and regulatory science.\" A spokesperson for the agency said the conference required approval from leadership, including the FDA's chief operating officer, Barclay Butler. Attendance by FDA delegates in the prior two years ranged from 47 to 49, the spokesperson said, noting this year the agency sent 31.Dylan Hedtler-Gaudette, acting vice president of policy and government affairs at the Project On Government Oversight, a nonpartisan watchdog group that champions government accountability, said the optics of sending dozens of FDA staffers to an overseas conference during a government shutdown are not good. Dylan Hedtler-Gaudette, the acting vice president of policy and government affairs at the Project on Government Oversight.CNBC\"FDA is a critical organization that does really important work as far as our health-care system, our food system, our medical device system,\" Hedtler-Gaudette said. \"I would hope that FDA leadership and the administration would place a higher degree of priority on making sure the organization, the agency is resourced completely rather than needing to attend specific conferences or events.\"Hedtler-Gaudette said that even if the conference is important, that does little to quiet questions about the agency's priorities. \"At a minimum, it's a kind of bad look and it's poor optics,\" Hedtler-Gaudette said. \"At the worst, it could be a kind of a dereliction of duty and a misuse of public resources.\"The tropical island of Sentosa in Singapore at sunset.Tobiasjo | E+ | Getty ImagesThe FDA told CNBC the trip did not rely on taxpayer dollars, saying it was funded through the agency's carryover user fees — money collected from companies that make drugs, devices and other medical products to pay for regulatory work such as product reviews and inspections. \"Those dollars are still public dollars,\" Hedtler-Gaudette said. \"They still need to be treated and guarded with as much respect as direct tax dollars do.\"An internal email from Butler, dated Oct. 1, said user fees should be applied only to work that is permitted to be funded by user fee carryover and \"activities that are necessary to address imminent threats to the safety of human life or protect property.\" The FDA itself seemed to be aware that any travel during the shutdown could be poorly received.\"Due to the optics of business travel conducted during a shutdown, conference approval will be handled by FDA's senior leadership on a case-by-case basis,\" the FDA said in a document that was posted on its website as recently as mid-November. On Dec. 3, the day after CNBC asked the agency for comment on the document, it was no longer available on the website.\"The agency routinely updates its webpages to ensure information remains accurate and consistent with current policy,\" an FDA spokesperson told CNBC.In an internal email chain between FDA directors and Chief Financial Officer Benjamin Moncarz, obtained by CNBC, Director Michelle Tarver sought to \"come to an agreement for legal and optics consistency on how we are handling travel during the lapse in appropriations.\" Tarver proposed to \"cancel conference attendance and the associated local, domestic, and international travel.\" She went on to say that the FDA would \"allow virtual speaking on exempt (i.e., user fee) topics only.\"In a Nov. 6 email exchange about the ICH conference, the discussion of whether to send staffers to Singapore rose to the highest ranks of the FDA. In the email, FDA Deputy Chief Financial Officer Sahra Torres-Rivera wrote that the agency had \"agreed to limit in-person participation at conferences\" but noted that \"the final decision ultimately rests with ... leadership.\" Next year, the biannual conference will be held in Rio de Janeiro and Prague.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "FDA approved a $250,000 Singapore work trip during government shutdown, records show",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108240737-1765474812295-Hotel_Pool.jpg?v=1765559746&w=1920&h=1080"
      ],
      "datePublished": "2025-12-15T13:00:01.000Z",
      "dateModified": "2025-12-15T13:00:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "New Trump tariffs collection hits $200 billion, Customs says",
    "url": "https://www.cnbc.com/2025/12/15/trump-tariffs-trade-customs-imports.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108241889-1765817394994-gettyimages-2251771532-ps1_2948_kudhsh8l.jpeg?v=1765834031&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-15T21:31:59.000Z",
    "description": "President Donald Trump smiles from the field before the 126th America's Game between the Army Black Knights and the Navy Midshipmen at M&T Bank Stadiu",
    "body": "President Donald Trump smiles from the field before the 126th America's Game between the Army Black Knights and the Navy Midshipmen at M&T Bank Stadium in Baltimore, Dec. 13, 2025.Patrick Smith | Getty ImagesThe United States has collected more than $200 billion in tariffs this year as a result of new duties imposed by President Donald Trump since the beginning of 2025, the Customs and Border Protection agency said Monday.The tally comes as the Supreme Court considers arguments that the new tariffs are illegal. The $200 billion tally is only for the new tariffs, not for tariffs imposed during Trump's first term in the White House. Those earlier tariffs do not face legal challenges, as the new tariffs do.Trump earlier this year unilaterally imposed, without congressional authorization, what he calls reciprocal tariffs on imports from most of the world's nations. He also imposed \"fentanyl tariffs\" on products from Canada, China and Mexico, in retaliation for what he said was those countries' failure to stem the flow of that deadly narcotic into the United States.A container ship at the Port of Long Beach in California, Sept. 9, 2025.Apu Gomes | Getty Images News | Getty Images\"Between Jan. 20 and Dec. 15, 2025, U.S. Customs and Border Protection collected more than $200 billion in tariffs thanks to more than 40 executive orders put in place by President Donald Trump's Administration,\" CBP said, in a statement. \"This figure underscores CBP's effectiveness in promoting secure, fair, and compliant trade, strengthening America's national and economic security.\"In November, tariff collections declined for the first time since Trump announced his broad new tariffs in April. The government collected $30.75 billion in tariffs last month, a slight drop from the $31.15 billion collected in October.Read more CNBC politics coverageTrump sues BBC for $5 billion, claims defamation from Panorama documentaryPentagon takes big stake in new Korea Zinc refinery in Tenn., gets 10% of companyNew Trump tariffs collection hits $200 billion, Customs saysFormer Instacart employee says she was fired over her Democratic congressional campaignUkraine peace talks progressing, Russia open to EU membership, U.S. officials sayNew York AG sues UPS for allegedly shorting Christmas season workers' wagesTrump admin to hire 1,000 specialists for 'Tech Force'Trump doubles down on Rob Reiner criticism after killing; director's son in custodyTSA is giving airline passenger data to ICE for deportation push: NYTTrump's AI order may be 'illegal,' Democrats and consumer advocacy groups claimTrump sued by preservation group seeking to halt White House ballroom projectTrump says 'no big deal' after new Epstein photos showing him releasedPutin can fund war for years, ex-official says as Trump's resolve is testedIndiana redistricting bill that Trump demanded defeated in state SenateHouse passes INVEST Act to ease investment standards, boost capital in marketsDOJ fails again to indict New York AG James, a Trump target: ReportsTrump 'sells out' U.S. national security with Nvidia chip sales to China: WarrenTrump pushes for top prosecutor nominee Halligan after Comey, James cases tossedTrump willing to seize more oil tankers off Venezuela coast: White HouseSeized tanker will go to U.S. port, Trump admin intends 'to seize the oil'GOP lawmakers seek Trump aid for agricultural equipment after tariff pressureTrump says Fed could have 'at least doubled' latest interest rate cut'Spoof' ship: Seized oil tanker hid location, visited Iran and VenezuelaTrump admin touts pulling 9,500 truckers off road for failing English testsSwiss government says new 15% U.S. tariff ceiling retroactive to mid-NovemberHomeland Security Dept. buying Boeing 737s for ICE deportationsTrump officials move to end student loan payment pause for millions of borrowersJudge unseals Ghislaine Maxwell grand jury materials, citing Epstein files actUkraine at 'critical moment' in war as European allies ramp up pressure on RussiaDemocrats establish AI working group as industry bolsters DC presenceEx-Trump lawyer Habba resigns as NJ U.S. attorney after disqualificationThe drop comes as freight shipments to the United States have slowed in the face of the tariffs and as Trump has lowered some of the duties.\"CBP's enforcement delivers results,\" said CBP Commissioner Rodney Scott, in a statement.\"By combining intelligence-led targeting, rigorous oversight and swift action, we are safeguarding the U.S. economy, protecting American industries and holding accountable those who seek to break our trade laws,\" Scott said.If the Supreme Court rules that Trump's new tariffs are illegal, it is possible the court could say that companies that have paid the duties so far are entitled to refunds.The U.S. Court of Appeals for the Federal Circuit, in a 7-4 ruling in August, upheld a decision by the Court of International Trade that found Trump did not have the power to impose the tariffs without the consent of Congress.\"The core congressional power to impose taxes such as tariffs is vested  exclusively in the legislative branch by the Constitution,\" the Federal  Circuit said in its ruling. \"Tariffs are a core congressional power.\"In late November, the warehouse club retail giant Costco joined a group of other companies suing the Trump administration to obtain a full refund of the tariffs they have paid so far this year, and asked a court to block the duties from continuing to be collected as the Supreme Court case plays out.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "New Trump tariffs collection hits $200 billion, Customs says",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108241889-1765817394994-gettyimages-2251771532-ps1_2948_kudhsh8l.jpeg?v=1765834031&w=1920&h=1080"
      ],
      "datePublished": "2025-12-15T21:31:59.000Z",
      "dateModified": "2025-12-15T21:31:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ford to record $19.5 billion in special charges related to EV pullback",
    "url": "https://www.cnbc.com/2025/12/15/ford-ev-pullback.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108214455-17609973122025-10-20t215148z_1001305606_rc2wfhayx4gr_rtrmadp_0_ford-results.jpeg?v=1760997355&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-16T00:28:37.000Z",
    "description": "watch nowDETROIT — Ford Motor expects to record about $19.5 billion in special items related to a restructuring of its business priorities and a pullb",
    "body": "watch nowDETROIT — Ford Motor expects to record about $19.5 billion in special items related to a restructuring of its business priorities and a pullback in its all-electric vehicle investments, the company announced Monday.The Detroit automaker said most of those charges will occur during the fourth quarter. That will be followed by $5.5 billion in cash to be charged through 2027, and the majority of that chunk will be paid next year, Ford said.The charges will impact the automaker's net results but not its adjusted earnings. The automaker said Monday it was increasing its guidance of adjusted earnings before interest and taxes to about $7 billion in 2025. That's in line with a target from earlier this year, before the company lowered expectations to between $6 billion and $6.5 billion in adjusted EBIT in October.The charges announced Monday, including $8.5 billion in write-downs of EV assets, are connected to major changes to Ford's business plans. The new plans include refocusing investments on hybrid vehicles, including plug-in models rather than pure EVs; canceling a next generation of large all-electric trucks in exchange for smaller, more affordable EVs; and a rebalancing of its investments in core products such as trucks and SUVs.The changes are the latest under Ford CEO Jim Farley and his \"Ford+\" restructuring plan that has taken on many different forms since he initially announced it as an EV growth plan in 2021. \"We evaluated the market, and we made the call,\" Farley told CNBC's \"Closing Bell Overtime\" on Monday. \"We're following customers to where the market is, not where people thought it was going to be, but where it is today.\"Stock Chart IconStock chart iconFord, GM and Stellantis stocks.The EV segment has experienced a sales slump domestically after the Trump administration put an early end in September to a $7,500 federal tax credit previously available for EV buyers in the U.S. Farley said on CNBC that policy \"wasn't the only reason why we made this choice,\" but he acknowledged it did play a role. Ford also said Monday that its all-electric F-150 Lightning pickup will transition to an extended-range EV, or EREV, that includes an electric powertrain as well as a gas-powered generator, and it announced plans to use battery plants in Kentucky and Michigan for a new stationary energy storage business.\"The last couple of months have been really clear to us,\" Farley told CNBC's Phil LeBeau. \"The very high-end EVs — the $50,000, $70,000, $80,000 vehicles — they just weren't selling.\"Ford said the changes are expected to provide \"a path to profitability\" for its Model e electric vehicle business by 2029, targeting annual improvements beginning in 2026. The automaker also said it expects the changes to improve profits in its traditional Ford Blue unit and Ford Pro commercial and fleet business \"over time with early signs of benefits in 2026.\"The automaker said it expects approximately 50% of its global volume by 2030 will be hybrids, EREVs and fully electric vehicles, up from 17% in 2025.\"These are big decisions that we believe will pay off for years to come for our customers, our employees, American jobs and manufacturing,\" Andrew Frick, president of the Model e and Blue businesses, said Monday during a media call. \"Ford is following the customer. We are looking at the market as it is today, not just as everyone predicted it to be five years ago.\"Ford said it will concentrate its North American electric vehicle development on its new, low-cost, flexible Universal EV Platform that's expected to underpin a \"high-volume family of smaller, highly efficient and affordable electric vehicles.\"The first vehicle from the new platform will be a \"fully connected midsize pickup truck\" assembled at the company's Louisville Assembly Plant starting in 2027.The company also expects its new storage business to be producing and shipping units by 2027 for things such as \"data centers, the electric gird and much more,\" Frick said.\"This is a compelling opportunity. It's a market with huge potential and strong demand,\" he said. \"We will have 20 gigawatt hours of annual capacity for this market.\"Ford stock rose about 2% in after-hours trading Monday.Shares of Ford closed Monday at $13.65, down less than 1%. Ford stock as of Monday's close was up nearly 40% this year.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ford to record $19.5 billion in special charges related to EV pullback",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108214455-17609973122025-10-20t215148z_1001305606_rc2wfhayx4gr_rtrmadp_0_ford-results.jpeg?v=1760997355&w=1920&h=1080"
      ],
      "datePublished": "2025-12-16T00:28:37.000Z",
      "dateModified": "2025-12-16T00:28:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "One of our chipmakers has become a tech battleground stock — plus, an update on Linde",
    "url": "https://www.cnbc.com/2025/12/15/one-of-our-chipmakers-has-become-a-tech-battleground-stock-plus-an-update-on-linde.html",
    "image": "https://image.cnbcfm.com/api/v1/image/106956311-1633692334197-gettyimages-1227666240-GERMANY_HYDROGEN.jpeg?v=1765826811&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-15T19:42:30.000Z",
    "description": "Subscribe to CNBC PROSubscribe to Investing ClubLicensing & ReprintsCNBC CouncilsSelect Personal FinanceJoin the CNBC PanelClosed CaptioningDigital Pr",
    "body": "Subscribe to CNBC PROSubscribe to Investing ClubLicensing & ReprintsCNBC CouncilsSelect Personal FinanceJoin the CNBC PanelClosed CaptioningDigital ProductsNews ReleasesInternshipsCorrectionsAbout CNBCSite MapPodcastsCareersHelpContactNews TipsGot a confidential news tip? We want to hear from you.Get In TouchCNBC NewslettersSign up for free newsletters and get more CNBC delivered to your inboxSign Up NowGet this delivered to your inbox, and more info about our products and services.Advertise With UsPlease Contact UsAd ChoicesPrivacy PolicyYour Privacy ChoicesCA NoticeTerms of Service© 2025 Versant Media, LLC. All Rights Reserved. A Versant Media Company.\n      Data is a real-time snapshot *Data is delayed at least 15 minutes.\n      Global Business and Financial News, Stock Quotes, and Market Data\n      and Analysis.\n    Market Data Terms of Use and DisclaimersData also provided by",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "One of our chipmakers has become a tech battleground stock — plus, an update on Linde",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/106956311-1633692334197-gettyimages-1227666240-GERMANY_HYDROGEN.jpeg?v=1765826811&w=1920&h=1080"
      ],
      "datePublished": "2025-12-15T19:42:30.000Z",
      "dateModified": "2025-12-15T19:42:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]