[
  {
    "title": "Startup founders share how they bounced back from failure: ‘I lost a lot of my identity’",
    "url": "https://www.cnbc.com/2025/09/27/startup-founders-share-how-they-bounced-back-from-failure.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108203393-1758731669825-gettyimages-1725679453-3z6a69504.jpeg?v=1758810058&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-09-27T06:11:41.000Z",
    "description": "Over two-thirds of startup founders have a fear of failure, per the Founder Resilience Research Report, 2024.Skynesher | E+ | Getty ImagesStartup founders face immense pressure to succeed, but it can be even...",
    "body": "<div><div><p>Over two-thirds of startup founders have a fear of failure, per the Founder Resilience Research Report, 2024.</p><p>Skynesher | E+ | Getty Images</p></div><div><p>Startup founders face immense pressure to succeed, but it can be even more challenging to let go of a failed business and find success after.</p><p>Building a startup has always been risky. Since 1994, the five-year survival rate of small businesses in the U.S. has hovered around just over 50%, per the <a href=\"https://www.bls.gov/spotlight/2024/business-employment-dynamics-twentieth-anniversary/?utm_source=chatgpt.com\" target=\"_blank\">Bureau of Labor Statistics</a>. By 2018, the five-year survival rate was 57.3%.</p></div><div><p>By 2018, the five-year survival rate of small busineses was 57.3%.</p><p>Bureau of Labor Statistics</p></div><div><p>Serial entrepreneur Ismael Dainehine knows how it feels to fail, having been in the game for over a decade.</p><p>He's founded multiple businesses — two that failed, then three that were successful — and recently co-founded his newest company, EverGive, a non-profit that invests in Bitcoin to compound donations.</p><p>Dainehine described his early failures, which saw his first two companies shut down within a few years, as painful.</p><p>\"I definitely had that pressure that I put on myself because of the financial constraints I had in my personal life … There's nobody that could have put more pressure on me at that point than I put on myself,\" he said.</p><p>Dainehine said he was able to learn from these failures, and his next businesses brought in millions in revenue before he exited them. But even working on these companies began to feel \"soulless and hollow after a while,\" he added.</p><p>Entrepreneurship is often sold as something of a utopia — unshackled from the bureaucracy and politics of corporate life. But over the past few decades, founder life has also become synonymous with <a target=\"_blank\" href=\"https://www.cnbc.com/2024/09/24/this-29-year-old-millionaire-says-having-work-life-balance-is-a-myth.html\">hustle culture</a>.</p><p>Silicon Valley's startup scene mythologizes seven-day work weeks, while China's tech companies are infamous for the <a target=\"_blank\" href=\"https://www.cnbc.com/2025/06/08/europe-startups-resists-pressure-to-adopt-chinas-996-work-culture.html\">996 culture</a> – working 9 a.m. to 9 p.m., six days a week.</p></div><div><p><a target=\"_blank\" href=\"https://www.cnbc.com/2025/07/08/vc-behind-996-work-culture-debate-defends-7-day-work-weeks-.html\"><img src=\"https://image.cnbcfm.com/api/v1/image/108166954-1751461509661-2024_10_02HARRYSTEBBINGS7781_4.png?v=1751899126&w=160&h=90\" alt=\"Harry Stebbings, founder of 20VC, says billion-dollar firms aren't built on five-day work weeks.\" /></a></p></div><p>So how do founders — who are used to this all-encompassing and high-pressure life — bounce back from failure?</p><h2><a></a>'I lost a lot of my identity'</h2><div><p>Moving on from a failed business can require owning up to mistakes and disappointing people, including employees and investors.</p><p>Klaas Ardinois founded CommVision in 2024, a U.K.-based software development company that shut down a year later. He said the biggest emotional challenge of failing was disappointing investors who put money in the company, and laying off employees whose lives were upended.</p><p>Ardinois, who pins the failure on a market mismatch and being misled by a venture capital firm, said he had persuaded employees from a previous company to join CommVision.</p><p>\"Emotionally, it was really hard to get to that point of A: admitting that your business is failing. Then B: having to deal with the fallout of 'I'm about to upset people's lives quite dramatically,\" he said.</p><p>\"It's not like: 'Hey we could work something out.' It's: 'You've got four weeks, and I know you're financially stretched because you bought a house and you're about to have a baby,' so that was really hard.'\"</p><p>Meanwhile, Latvia-based Ainars Klavin founded augmented reality agency Overly in 2013, which nearly went bankrupt twice. But despite turning it around and making 1.5 million euro ($1.75 million) turnover in 2022, Klavins quit as a result of burnout.</p><p>He then gave startup life another chance and poured 500,000 euros into his next startup, which he left in 2024 as it was struggling.</p></div><blockquote><div><p>\"The biggest risk isn't failure, the biggest risk is success without clarity.\"</p><div><p>Ismael Dainehine</p><p>Co-founder of EverGive</p></div></div></blockquote><div><p>Now a lead product manager at proptech startup Giraffe360, Klavins told CNBC Make It that he experienced an identity crisis when transitioning from being a founder to a corporate employee.</p><p>\"When you exit through an unsuccessful business, you really start to question: what are you good at? Because at that point it seemed like I'm not good at anything,\" he said.</p><p>\"I have sacrificed so much to make this successful that I have lost a lot of my identity … It's very scary to lose your identity, because you have sacrificed a lot of other things that were part of your identity to make this one work, and if you lose it, you have nothing.\"</p></div><h2><a></a>Founders are the best employees</h2><div><p>Founders who return to corporate life as an employee may feel some shame or stigma attached to the transition, and employers could even discriminate against them.</p><p>A <a href=\"https://www.business.rutgers.edu/news/study-reveals-hiring-bias-against-former-business-owners\" target=\"_blank\">2024 study</a>, led by Rutgers Business School, sent fake resumes to 219 people with corporate recruiting experience. The fictional applications had identical qualifications, but some were former business owners.</p><p>It found that recruiters were less likely to recommend former business owners for a role, in what's described as an \"entrepreneurship penalty\" in the study. Recruiters appeared to be more hesitant to hire someone who is used to being their own boss and working autonomously.</p><p>However, public relations specialist Alain Rapallo said that founders can actually make the best employees.</p><p>Rapallo left his corporate role as a PR director to start his own agency in 2021, but returned to employee life just three years later.</p><p>Entrepreneurship is an advantage, he said, \"because when you are a founder and you work by yourself, if you make it past that first year, you pretty much did every role that any company does on a smaller scale, but you pretty much did it.\"</p><p>Rapallo said running a business also sharpens skills like multitasking and time management.</p><p>\"Startups are scrappy, but you [as an employee] don't necessarily do every single job. You don't have the mentality of growing the business. You usually just have the mentality of taking care of the client or the account,\" he added.</p><p>Product manager Klavins agreed that his understanding of numerous business functions was what got him his current role.</p><p>Being an employee has also been an important lesson in humility, he said, as it eliminated his ego and allowed him to start fresh.</p></div><h2><a></a>Reframing success and failure</h2><div><p>Serial entrepreneur Dainehine said it was important to redefine what success and failure meant to him in order to move forward.</p><p>\"The biggest risk isn't failure, the biggest risk is success without clarity,\" he explained, saying that without a clear set of principles, success will always be elusive.</p><p>\"The biggest advice I've had for entrepreneurs in that stage is to develop or commit to something that has a very deep sense of purpose and mission to you. A weak or opportunistic mission can't carry you through the hardest days,\" he said.</p><p>\"Once I focused on a mission I actually believed in, the same setbacks became survivable. So, if they can either pivot into something that adheres to that or find that within their current companies, I think that will build up their resilience to power through and reframe failure.\"</p></div></div>"
  },
  {
    "title": "11 phrases to help you gain influence and navigate awkwardness at work, from communication experts",
    "url": "https://www.cnbc.com/2025/09/27/11-phrases-to-help-you-gain-influence-and-navigate-awkwardness-at-work-from-communication-experts.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108203292-1758722623614-gettyimages-2220349934-6o6a41434.jpeg?v=1758722646&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-09-27T13:30:01.000Z",
    "description": "Work conflicts can be uncomfortable, but managing them effectively is essential to your success, says workplace expert Henna Pryor.Whether you're asking your boss for a raise or receiving difficult feedback...",
    "body": "<div><div><p>Work conflicts can be uncomfortable, but managing them effectively is essential to your success, says workplace expert Henna Pryor.</p><p>Whether you're asking your boss for a raise or receiving difficult feedback from a colleague, try memorizing a handful of go-to phrases, so you feel more prepared and at ease — no matter what awkward situation or conflict is thrown at you, says Pryor, the founder and CEO of Philadelphia-based leadership coaching firm Pryority Group.</p><p>If you can navigate conflict well, your colleagues will see you as someone who stays calm under pressure, holds themselves accountable and can help solve problems, Pryor adds. The more people want to work with you and seek out your opinion, the more influential you become.</p><p>CNBC Make It surveyed a group of five communication experts, including Pryor, who shared their favorite phrases to use in three types of workplace conflicts:</p><h3>When you need to initiate a difficult conversation</h3><p>Approaching a peer or manager about a problem can feel daunting, Pryor says. If you have to initiate a potentially tricky conversation with a coworker, try using phrases that let the other person know you're on the same problem-solving team.</p><ul><li><strong>\"I'm head-to-toe uncomfortable, but I feel it's important I bring up...\" </strong>Acknowledging awkwardness with levity at the start of a conversation emphasizes to the other person that there's an issue you need to solve together, and it's \"more important than our collective comfort,\" Pryor says.</li></ul><ul><li><strong>\"I'm seeking clarity.\" </strong>A lot of conflict can arise from miscommunication. Asking for clarity when something feels ambiguous can help you both feel less defensive, and set you on a calmer path to align your goals, Pryor says.</li></ul><ul><li><strong>\"I'm feeling anxious.\"</strong> If you know there's a difficult conversation heading your way, you can ask to practice with someone you trust, says <a target=\"_blank\" href=\"https://www.cnbc.com/phoebe-gavin/\">Phoebe Gavin</a>, a Washington D.C.-based career and leadership coach. Then, ask if they're open to providing feedback. \"Anxiety is a [totally] normal emotion and a sign of investment,\" she explains. \"Saying it out loud can humanize you and get you helpful support.\"</li></ul><h3>When someone approaches you with a problem</h3><p>If a peer or boss approaches you about an issue, first try asking some questions to understand the main obstacle, before trying to solve the large problem, suggests <a target=\"_blank\" href=\"https://www.cnbc.com/matt-abrahams/\">Matt Abrahams</a>, a Stanford University organizational behavior lecturer.</p><ul><li><strong>\"What does success look like?\" </strong>Abrahams says that he asks this question so he can better understand the other person's goals. That way, he can offer guidance that aligns with their objectives.</li></ul><ul><li><strong>\"In the past, how have you handled situations like this?\" </strong>Once Abrahams has a firm understanding of the problem, he tries to encourage the other person to relate it back to their own experience. \"[These questions] get people away from personality challenges … and focuses on the collaboration around a common goal,\" he says.</li></ul><ul><li><strong>\"I'd love to talk about this later. Is that OK?\"</strong> Use this phrase if the other person is emotional, or if you're too busy in the moment to devote your full attention, says <a target=\"_blank\" href=\"https://www.cnbc.com/2025/07/26/harvard-expert-easy-way-to-be-more-influential-in-everyday-conversations.html\">Alison Wood Brooks</a>, an associate professor at Harvard University who studies negotiation and conversational skills. Once you've had some time to prepare, find a neutral, private place to discuss further. \"It's extremely difficult to make conversational progress when tempers are flaring,\" Wood Brooks says. It never hurts to take a few minutes or even a few days to cool down and circle back.</li></ul><h3>When you need to keep your cool during a disagreement</h3><p>If you notice emotions are high in the middle of a workplace argument, you can redirect the conversation by deploying phrases to make the other person laugh or feel heard.</p><ul><li><strong>\"I want to make sure I understand.\" </strong>The most important thing to remember in the face of conflict is to initially, and then repeatedly, validate the other person's feelings and perspectives, multiple experts say.</li></ul><ul><li><strong>\"It sounds like what's most important to you in this situation is...\"</strong> Gavin likes to paraphrase the most central point in the other person's argument, so she can demonstrate that she's listening, she says.</li></ul><ul><li><strong>\"It makes sense that you feel that way.\" </strong>Use this phrase if the person you're speaking with seems especially vulnerable or upset. Lead with empathy, Wood Brooks says.</li></ul><ul><li><strong>\"How dare you!\"</strong> If the tone of the conversation is generally light-hearted, you can also respond with playfulness, Wood Brooks adds. \"I like to say this when someone raises a spicy or controversial point — but you have to deliver it dripping with obvious, over-the-top sarcasm,\" she says. \"If done well, it will always get a laugh, which immediately helps cut [tension]. It's a jovial way of saying, 'I love what you've said. It took courage. Let's address this together.'\"</li></ul><ul><li><strong>'\"From my perspective...\"</strong> Encouraging your conversation partner to see your perspective can lower the temperature of the conversation — but you should keep the tone curious and open to collaboration, says <a target=\"_blank\" href=\"https://www.cnbc.com/lorraine-k-lee/\">Lorraine K. Lee</a>, author of \"<a href=\"https://lorraineklee.com/unforgettable-presence/\" target=\"_blank\">Unforgettable Presence: Get Seen, Gain Influence, and Catapult Your Career</a>.\" Regardless of the conflict, she adds, you should still be respectful and honest with the other person about how you're feeling.</li></ul><p>Most workplace conflicts, Gavin says, \"stem from mismatched expectations, priorities or incentives.\" When you are able to effectively talk about them, and bring those misalignments to the surface, \"you can resolve them and unblock progress.\"</p><p><em><strong>Want to stand out, grow your network, and get more job opportunities?</strong> Sign up for Smarter by CNBC Make It's new online course, </em><a href=\"https://smarter.cnbcmakeit.com/p/how-to-build-a-personal-brand?utm_source=cnbc&utm_medium=makeitarticle&utm_campaign=bottom\" target=\"_blank\"><em>How to Build a Standout Personal Brand: Online, In Person, and At Work</em></a><em>. Learn how to showcase your skills, build a stellar reputation, and create a digital presence that AI can't replicate.</em></p><p><em>Plus, </em><a target=\"_blank\" href=\"https://www.cnbc.com/make-it-newsletters/\"><em>sign up for CNBC Make It's newsletter</em></a><em> to get tips and tricks for success at work, with money and in life, and </em><a href=\"https://www.linkedin.com/groups/13194471/\" target=\"_blank\"><em>request to join our exclusive community on LinkedIn</em></a><em> to connect with experts and peers.</em></p></div><div><p><img src=\"https://image.cnbcfm.com/api/v1/image/108186789-250708-mi-10-himi-shankweilers-drivein-thumbnail-6.jpg?v=1755286397&w=750&h=422&vtcrop=y\" alt=\"We took out a $1 million loan to buy a movie theater — now it brings in $550K a year\" /><span></span><span><span></span></span></p></div></div>"
  },
  {
    "title": "FAA to let Boeing sign off on 737 Maxes, 787s after years of restrictions",
    "url": "https://www.cnbc.com/2025/09/26/faa-boeing-737-max-787.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108035912-1726674136837-IMG_1673.jpg?v=1726674360&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-09-26T18:07:58.000Z",
    "description": "Boeing 737 Max planes sit at the airport in Renton, Washington.Leslie Josephs | CNBCBoeing can sign off on some of its 737 Max and 787 Dreamliner planes before they're handed over to customers, the Federal...",
    "body": "<div><div><p>Boeing 737 Max planes sit at the airport in Renton, Washington.</p><p>Leslie Josephs | CNBC</p></div><div><p><span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/BA/\">Boeing</a><span><span></span></span></span> can sign off on some of its 737 Max and 787 Dreamliner planes before they're handed over to customers, the Federal Aviation Administration said Friday, the latest sign the manufacturer is regaining confidence from its regulator after years of safety crises.</p><p>The FAA stopped allowing Boeing to issue its own airworthiness certificates for 737 Max airplanes in 2019 after two fatal crashes. It made a similar decision for Boeing 787s in 2022 because of production defects. </p><p>Since the second Max crash, in March 2019, the FAA solely issued airworthiness certificates, which certify planes as safe to fly, for the Maxes. The FAA said that it and Boeing will issue the certificates on alternating weeks.</p><p>\"Safety drives everything we do, and the FAA will only allow this step forward because we are confident it can be done safely,\" the FAA said in a statement. \"This decision follows a thorough review of Boeing's ongoing production quality and will allow our inspectors to focus additional surveillance in the production process.\"</p><p>Boeing didn't immediately comment.</p><p>The company has been working for years to move past a series of safety and manufacturing issues. A <a target=\"_blank\" href=\"https://www.cnbc.com/2025/01/05/boeing-one-year-since-doorplug-blowout.html\">midair blowout</a> of a door panel from one of its new <a target=\"_blank\" href=\"https://www.cnbc.com/2024/01/06/boeing-737-max-9-grounding-after-alaska-airlines-door-blows-midflight.html\">737 Max 9s</a> in January 2024 set those plans back further, with the FAA capping production of the Maxes and increasing scrutiny of Boeing, a top U.S. exporter.</p><p>\"If Boeing requests a production rate increase, onsite FAA safety inspectors will conduct extensive planning and reviews with Boeing to determine if they can safely produce more airplanes,\" the FAA said Friday.</p><p>Boeing CEO <a target=\"_blank\" href=\"https://www.cnbc.com/2025/07/27/boeing-ceo-ortberg-airplane-deliveries-defense.html\">Kelly Ortberg</a>, who took the helm just over a year ago, has said the company is focused on stabilizing its <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/26/faa-boeing-737-max-787.html\">production rate</a> of its Maxes at 38 month, and he has expressed optimism about evaluating an increase beyond that with the FAA.</p><p>\"I feel pretty confident that we'll be in a position here pretty soon to sit down with the FAA and go through what we call a capstone review, which is the process we go through to not just go through these [key performance indicators], but to look at our entire supply chain readiness, our continued production readiness and move forward with that,\" he said at a Morgan Stanley investor conference earlier this month.</p><p>Boeing shares were up about 4% Friday.</p></div></div>"
  },
  {
    "title": "Anson Funds calls for Clear Channel Outdoor's sale. Here's why the timing may finally be right",
    "url": "https://www.cnbc.com/2025/09/27/anson-funds-calls-for-clear-channel-outdoors-sale-why-the-timing-may-be-right.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108204497-1758897757786-AP23194004975426.jpg?v=1758897832&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-09-27T13:53:03.000Z",
    "description": "A Clear Channel Outdoor digital billboard displays a temperature of 102 degrees at 5:18 p.m. on northbound I-35 in Dallas, Texas, on Wednesday, July 12, 2023.Irwin Thompson | The Dallas Morning News via...",
    "body": "<div><p>A Clear Channel Outdoor digital billboard displays a temperature of 102 degrees at 5:18 p.m. on northbound I-35 in Dallas, Texas, on Wednesday, July 12, 2023.</p><p>Irwin Thompson | The Dallas Morning News via AP</p></div><div><h3>Company: Clear Channel Outdoor Holdings (CCO)</h3><p><strong>Business: </strong>Clear Channel Outdoor Holdings is an outdoor advertising company that provides clients with advertising through billboards, street furniture displays, transit displays and other out-of-home advertising displays. The company operates entirely within the United States, with assets including printed and digital billboards, transit displays, including airports, street furniture and wallscapes and other spectaculars. </p><p><strong>Stock Market Value</strong>: $755.45 million ($1.52 per share) </p></div><div><h3>Activist: Anson Funds</h3><p><strong>Ownership: </strong>3.65% </p><p><strong>Average Cost: </strong>n/a<strong> </strong></p><p><strong>Activist Commentary: </strong>Anson Funds is a multistrategy fund founded in 2007 by Moez Kassam and has over $2 billion in assets. While not historically activists, on Oct. 3, 2023, Anson hired Sagar Gupta, former senior analyst and head of TMT investing at Legion Partners, to build out their activism strategy. </p><h3>What's happening</h3><p>On Sept. 22, Anson Funds announced that they are calling for a sale of Clear Channel Outdoor Holdings. </p><h3>Behind the scenes</h3><p>Clear Channel Outdoor is one of the largest out-of-home advertising companies that offers a variety of advertising services, including through billboards, street furniture displays, transit displays, and airport displays. In the U.S., they are one of the three big companies in this sector, with <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/LAMR/\">Lamar Advertising</a><span><span></span></span></span> and <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/OUT/\">Outfront Media</a><span><span></span></span></span> numbers one and two, respectively.</p><p>Historically, the challenges for CCO have centered around the company's two business lines – Americas and Europe, each with very different business models and valuations. The European business worked on fixed limited-term contracts with municipalities, which were re-bided at maturity. Because of this, the European business traded around 8x EBITDA multiple, while the U.S., largely comprised of owned billboards, traded closer 13 – 15x EBITDA.</p><p>These problems prompted Legion Partners to launch an activist campaign at CCO in May 2023, urging the company to consider a broad strategic review process, including divesting non-U.S. assets or a sale of the entire company. Legion also highlighted CCO's potential value proposition through its transition to digital billboards, which would allow each billboard to generate about four times more revenue and six to 10 times more EBITDA. Ultimately, they settled for a board seat for Legion co-founder Ted White, who still serves as a director today. Since then, CCO has executed a series of divestures, including selling its European business to Bauer Media Group, its Latin America business to Global Vía Públic, and, just two weeks ago, its Spain business to Atresmedia. These moves have transformed CCO into a U.S. pureplay and allowed it to start paying down its debt. However, despite this successful activist catalyst, CCO is yet to achieve the rerating some expected - currently, CCO trades at approximately 13-14 times EBITDA, versus peers Lamar and Outfront at 16-18 times. As a result, the stock is down 26.56% since Legion filed its 13D and over 90% from its IPO price.</p><p>On Sept. 22, Anson Funds joined the party, announcing that they are calling for a sale of the company. While this is a new campaign for Anson, this is not the beginning of their investment story. Sagar Gupta, who runs Anson's activism strategy, was at Legion Partners when they launched their campaign, and, perhaps not coincidentally, CCO has appeared in Anson's 13F holdings every quarter since Gupta joined the fund, now with a 3.65% position as of their most recent filing. So, Anson's call for a sale of the company is not a short-term, opportunistic campaign, but a decision made after years of analysis and working amicably with the company and at a time when it has become most feasible.</p><p>The company is now a U.S. pureplay, making it more focused and more valuable from a multiple perspective and easier to acquire from a regulatory perspective. Possible acquirers include <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/DEC-FR/\">JCDecaux</a><span><span></span></span></span> and Lamar.</p><p>In fact, JCDecaux terminated an agreement to buy CCO's Spain assets after facing restrictive demands from Spanish regulators. More specifically, JCDecaux maintains major exposure in virtually every OOH market outside the U.S. and has been rumored to be interested in the company.</p><p>As for Lamar, it has a history of acquiring CCO's assets, including a $458.5 million transaction in 2016, and has publicly expressed potential interest in additional transactions. In addition, <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/BX/\">Blackstone</a><span><span></span></span></span>'s recent acquisition of New Tradition at 18x EBITDA, <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/BRK.B/\">Berkshire Hathaway</a><span><span></span></span></span>'s new position in Lamar, and Ares Management's 8% position in CCO, all underscore the private equity appetite for the OOH industry. </p><p>Before coming to a decision like this, it is important to see what the standalone alternative looks like and why a sale may be more compelling for shareholders. To really properly restructure this business in the public market it would certainly require the time and risk of reconstituting the board and likely many management changes. Even with that, the company would still carry approximately $5 billion of long-term debt making it difficult to attract capital.</p><p>Additionally, CCO's promising digital transformation has been very slow. Since Legion's campaign, digital billboards have only grown to 5% of the portfolio, though they already count for over a third of CCO's revenue. While this underscores the huge value opportunity with digital conversion, it requires approvals of individual municipalities, significantly slowing the speed at which CCO can roll out digital ads, and not ideal for a public company that reports quarterly progress. As a result, after years of analysis and support, Anson has concluded that a sale offers the best risk adjusted path forward, a position we imagine Legion and other shareholders likely share.</p><p><em>Ken Squire is the founder and president of 13D Monitor, an institutional research service on shareholder activism, and the founder and portfolio manager of the 13D Activist Fund, a mutual fund that invests in a portfolio of activist 13D investments.</em></p></div>"
  },
  {
    "title": "Trump calls for the firing of Lisa Monaco, Microsoft president of global affairs",
    "url": "https://www.cnbc.com/2025/09/26/trump-calls-for-the-firing-of-lisa-monaco-microsoft-president-of-global-affairs.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107419358-17164832022024-05-23t164339z_1118394000_rc2gw7atnj44_rtrmadp_0_live-nation-antitrust.jpeg?v=1716483268&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-09-26T23:21:16.000Z",
    "description": "U.S. Deputy Attorney General Lisa O. Monaco speaks as Attorney General Merrick Garland looks on after announcing an antitrust lawsuit against Live Nation Entertainment during a press conference at the...",
    "body": "<div><div><p>U.S. Deputy Attorney General Lisa O. Monaco speaks as Attorney General Merrick Garland looks on after announcing an antitrust lawsuit against Live Nation Entertainment during a press conference at the Department of Justice in Washington, U.S., May 23, 2024. </p><p>Ken Cedeno | Reuters</p></div><div><p>President Donald Trump on Friday demanded that <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/MSFT/\">Microsoft</a><span><span></span></span></span> fire Lisa Monaco, an executive who served as deputy attorney general during the Biden administration.</p><p>The request appeared on Trump's Truth Social account, which has 10 million followers. It comes one day after former FBI Director James Comey <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/25/james-comey-indicted-fbi-trump.html\">was indicted</a>, days after Trump pushed to prosecute him.</p><p>\"She is a menace to U.S. National Security, especially given the major contracts that Microsoft has with the United States Government,\" Trump wrote in <a href=\"https://truthsocial.com/@realDonaldTrump/posts/115272665190921190\" target=\"_blank\">the post</a>. \"Because of Monaco's many wrongful acts, the U.S. Government recently stripped her of all Security Clearances, took away all of her access to National Security Intelligence, and banned her from all Federal Properties.\"</p><p>Microsoft declined to comment.</p><p>Parts of the U.S. government use Microsoft's cloud infrastructure and productivity software. Earlier this month, Microsoft agreed to <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/02/microsoft-offers-us-government-6-billion-in-savings-on-cloud-services.html\">offer $3.1 billion</a> in savings in one year on cloud services for agencies to use.</p><p>Earlier on Friday, Fox Business anchor Maria Bartiromo published an <a href=\"https://x.com/MariaBartiromo/status/1971526791375233078\" target=\"_blank\">X post</a> about Monaco joining Microsoft. The appointment happened in July, according to Monaco's LinkedIn profile. The post contained a link to a July article on the University of Chicago law school's website.</p><p>On Thursday, Microsoft said it would <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/25/microsoft-cuts-cloud-services-to-israeli-military-after-investigation.html\">cut off</a> cloud-based storage and <a target=\"_blank\" href=\"https://www.cnbc.com/ai-effect/\">artificial intelligence</a> subscriptions to a unit of the Israeli military, after investigating a claim that the division had built a system to track Palestinians' phone calls.</p><p>On Monday, Trump is set to meet with Benjamin Netanyahu, Israel's prime minister, <a href=\"https://www.nbcnews.com/politics/trump-administration/live-blog/trump-comey-ryder-cup-netanyahu-gaza-russia-shutdown-live-updates-rcna232822\" target=\"_blank\">NBC News reported</a>.</p><p>Microsoft CEO Satya Nadella attended a dinner alongside other technology executives at the White House earlier this month.</p></div><div><h2>Read more CNBC tech news</h2><div><ul><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/26/anthropic-global-ai-hiring-spree.html\">Anthropic to triple international workforce in global AI push</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/26/openai-big-week-ai-arms-race.html\">OpenAI's historic week has redefined the AI arms race for investors: 'I don't see this as crazy'</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/26/how-google-abandoned-facts-for-free-expression.html\">How Google shifted from a bastion of accurate information to a steward of free expression</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/26/china-stays-conspicuously-quiet-after-trumps-tiktok-deal-declaration-.html\">China stays conspicuously quiet after Trump's TikTok deal declaration</a></li></ul></div></div></div>"
  },
  {
    "title": "Electronic Arts stock closes up 15% on report company near $50 billion deal to go private",
    "url": "https://www.cnbc.com/2025/09/26/electronic-arts-buyout.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108095080-17382622882025-01-22t213024z_238727348_rc28fcalj4u3_rtrmadp_0_electronic-arts-results.jpeg?v=1738262344&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-09-26T20:17:31.000Z",
    "description": "Dado Ruvic | ReutersShares of Electronic Arts closed up 15% on Friday following a report in the Wall Street Journal that the video game company is nearing a roughly $50 billion deal to go private.Investors...",
    "body": "<div><div><p>Dado Ruvic | Reuters</p></div><div><p>Shares of <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/EA/\">Electronic Arts</a><span><span></span></span></span> closed up 15% on Friday following a report in the <a href=\"https://www.wsj.com/business/deals/ea-private-deal-buyout-video-game-maker-808aefec\" target=\"_blank\">Wall Street Journal</a> that the video game company is nearing a roughly $50 billion deal to go private.</p><p>Investors including Saudi Arabia's Public Investment Fund (PIF) and Silver Lake could announce the deal as soon as next week, the report said. PIF has been pouring billions of dollars into gaming, purchasing the makers of Pokemon Go and the parent company behind Monopoly Go, for example. </p><p>Jared Kushner's Affinity Partners is another participating investor, according to a source familiar with the matter, who asked not to be named because the discussions are private. </p><p>The deal would be the <a target=\"_blank\" href=\"https://www.cnbc.com/2018/08/07/here-are-the-top-10-largest-leveraged-buyouts-in-history.html\">largest leveraged buyout</a> in Wall Street history, surpassing the agreement to take TXU Energy private for about $45 billion in 2007. A leveraged buyout (LBO) is when debt is predominately used for an acquisition, a tactic traditionally used by private equity firms or activists.</p><p>EA makes popular video games including The Sims, Madden NFL, the soccer game FC, formerly known as FIFA. With Friday's gains, the stock is up about 32% for the year.</p><p>EA did not immediately respond to CNBC's request for comment.</p><p><strong>WATCH: </strong><a target=\"_blank\" href=\"https://www.cnbc.com/video/2024/09/18/pro-watch-cnbcs-full-interview-with-electronic-arts-ceo-andrew-wilson.html\">CNBC's interview with EA CEO Andrew Wilson</a></p></div></div>"
  },
  {
    "title": "Miracle under threat: South Korea’s birth rate collapse could undo decades of growth",
    "url": "https://www.cnbc.com/2025/09/27/south-koreas-birth-rate-collapse-threatens-growth.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108204778-1758954374692-gettyimages-2221543329-AFP_63YW82Q.jpeg?v=1758954407&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-09-27T06:27:11.000Z",
    "description": "In a photo taken on May 26, 2016 a mobility scooter sits parked before rice fields in Gunwi, some 200 kilometres south of Seoul. By 2030, a quarter of all South Koreans will be over 65 years old, and the...",
    "body": "<div><div><p>In a photo taken on May 26, 2016 a mobility scooter sits parked before rice fields in Gunwi, some 200 kilometres south of Seoul.\nBy 2030, a quarter of all South Koreans will be over 65 years old, and the overall population is expected to peak at around 52 million the same year before entering a period of steady decline. This so-called \"silver tsunami\" poses a major challenge for Asia's fourth-largest economy as the young, working-age population declines and the cost of caring for the elderly escalates. And in remote, rural communities like Gunwi, which lies some 200 kilometers southeast of Seoul, the trend is exacerbated by a youth exodus to the cities for work.</p><p>Ed Jones | Afp | Getty Images</p></div><div><p>South Korea is staring down a demographic freight train. The country, known as one of the \"Four Asian Tigers\" for its meteoric economic rise from postwar poverty, is confronting a demographic cliff that could stall growth within two decades, studies warn.</p><p>The Bank of Korea in 2024 <a href=\"https://www.bok.or.kr/eng/bbs/B0000354/view.do?menuNo=400409&nttId=10090724\" target=\"_blank\">projected</a> that the nation's rock-bottom birth rate will be one of the factors that will push it into a prolonged downturn by the 2040s.</p><p>A <a href=\"https://www.kdi.re.kr/eng/research/analysisView?art_no=3671\" target=\"_blank\">separate study</a> by the Korea Development Institute in May said demographic shifts will keep dragging on potential growth, which could fall to near zero by the 2040s. In its projections, South Korea's economy could contract by 2047 in a neutral scenario — or as early as 2041 in a pessimistic one.</p><p>South Korea's <a href=\"https://kosis.kr/statHtml/statHtml.do?sso=ok&returnurl=https%3A%2F%2Fkosis.kr%3A443%2FstatHtml%2FstatHtml.do%3Fconn_path%3DI3%26tblId%3DDT_1B81A21%26language%3Den%26orgId%3D101%26\" target=\"_blank\">birth rate currently stands at 0.748 in 2024</a>, a slight rise from the record low of 0.721 in 2023. That compares with an Organization for Economic Cooperation and Development average of <a href=\"https://www.oecd.org/en/publications/korea-s-unborn-future_75aa749c-en.html\" target=\"_blank\">1.43 in 2023</a>. The commonly cited \"replacement rate\" for countries to prevent a declining population is 2.1.</p><p>What a 0.72 fertility rate means for South Korea is that for every 100 Koreans, they would have about 36 children at current levels, shrinking the workforce across generations. That would cut into productivity and slow growth, experts say.</p></div><h2><a></a>Miracle for 'miracle on the Han River'?</h2><div><p>If technological innovation fails to offset this decline, Korea will see a \"sustained economic slowdown,\" Lee In-sil, Director of the Korea Peninsula Population Institute for Future, told CNBC.</p><p>And it's not for lack of trying. The country has rolled out package after package of support measures for newlyweds to have children, including baby bonuses and cash rewards. Seoul expended over $270 billion over the past 16 years on incentives to promote childbirth, according to a <a href=\"https://jme.bmj.com/content/51/6/371\" target=\"_blank\">2024 paper in the Journal of Medical Ethics</a>.</p><p>In 2023, Seoul even mooted an idea to <a href=\"https://time.com/6265842/south-korea-birth-rate-military-service-exemption/\" target=\"_blank\">exempt men from its mandatory military service</a> if they had three or more children before the age of 30.</p><p>But such efforts have made little impact in a country hailed as the \"Miracle on the Han River\" for its rapid postwar rise. \"I don't think there's any way that population policy can effectively raise fertility levels in South Korea in any appreciable way,\" Nicholas Eberstadt, a political economist at the American Enterprise Institute, told CNBC.</p></div><div><p>People cycle along a track backdropped with the city skyline in Singapore on June 27, 2025.         </p><p>Roslan Rahman | Afp | Getty Images</p></div><p>While South Korea's total fertility rate had marginally increased in 2024, \"we should not be popping the champagne corks,\" Eberstadt said, as it is still far below the 2.1 replacement rate. He noted that the desired family size in South Korea is still below the 2.1 replacement rate, which means that while the TFR might climb higher, it will not reach the 2.1 figure.</p><h2><a></a>Pension impact</h2><div><p>A shrinking workforce will also squeeze the pension system. In March, South Korea passed its first <a href=\"https://www.reuters.com/world/asia-pacific/south-korea-approves-reforms-shore-up-830-bln-state-pension-fund-2025-03-20/\" target=\"_blank\">pension fund reform</a> in 18 years, extending the depletion of the state pension fund by 15 years to 2071.</p><p>Among South Korea's four major pension systems — military, private school employees, civil servants, and national pensions — the military pension and civil servants' pension have already been depleted, Lee said.</p><p>Current reforms will see a structure where younger generations pay higher premiums while receiving lower benefits, which will inevitably lead to criticism for transferring the burden to future generations, she added.</p><p>A smaller draft pool also has defense implications. South Korea's active troops <a href=\"https://www.reuters.com/world/asia-pacific/south-koreas-military-has-shrunk-by-20-six-years-male-population-drops-2025-08-10/#:~:text=SEOUL%2C%20Aug%2010%20(Reuters),a%20report%20said%20on%20Sunday.\" target=\"_blank\">have fallen 20%</a> to about 450,000, down from 690,000 in 2019. South Korean armed forces are augmented by 28,500 U.S. troops, and Seoul has a mutual defense treaty with Washington.</p><p>South Korea is still formally at war with North Korea, as the Korean War in 1953 ended with a ceasefire, not a peace treaty. North Korea boasts one of the largest standing military forces in the world, with around 1.23 million personnel.</p></div><h2><a></a>No reason to be pessimistic</h2><div><p>Despite the bleak outlook for Asia's fourth-largest economy, some analysts caution against despair.</p><p>Lee, who was also the former director general of the national statistics agency, said economies can find ways to adapt.</p><p>\"When an economy faces recession, it typically responds with various efforts to enhance productivity through technological innovation, immigration policies, and other measures to prevent further decline,\" she said.</p><p>AEI's Eberstadt also noted that South Korea can maintain and even increase its prosperity despite aging and shrinking. He pointed to the 1970s, when fears of resource scarcity grew as the world's population surged and doubts arose about how to feed it.</p><p>In 1968, the book The Population Bomb, co-authored by former Stanford University professor Paul Ehrlich and researcher Anne Ehrlich, predicted global famine and a rising death rate as the population grew.</p><p>However, 50 years later, the world is \"richer, better educated, better fed, better housed, more prosperous, much less absolute poverty, than when the world was smaller,\" Eberstadt said.</p><p>KPPIF's Lee said that, considering the Korean government's rapid policy changes and evolving public awareness in recent years, she is confident that breakthrough solutions will emerge.</p><p>Very few people would have bet that South Korea could accomplish what it has today when the Korean War halted in 1953, Eberstadt said<strong>.</strong></p><p>\"Human beings are a uniquely adaptable,\" he added. \"This is a very different sort of challenge, but I don't think that the record of the immediate past suggests that it's smart money to bet against South Korean population.\"</p></div></div>"
  },
  {
    "title": "Spirit Airlines is halting 40 routes, hires ex-Amazon network planning exec",
    "url": "https://www.cnbc.com/2025/09/26/spirit-airlines-routes-network-planning.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107409734-1714681228947-gettyimages-2006559720-01-b0005020-_hya9z9q0.jpeg?v=1747149844&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-09-26T20:12:51.000Z",
    "description": "A Spirit Airlines aircraft undergoes operations in preparation for departure at the Austin-Bergstrom International Airport in Austin, Texas, on Feb. 12, 2024.Brandon Bell | Getty ImagesSpirit Airlines told...",
    "body": "<div><div><p>A Spirit Airlines aircraft undergoes operations in preparation for departure at the Austin-Bergstrom International Airport in Austin, Texas, on Feb. 12, 2024.</p><p>Brandon Bell | Getty Images</p></div><div><p>Spirit Airlines told staff Friday that it's suspending about 40 routes, finalizing a <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/17/spirit-ceo-flight-cuts.html\">25% cut</a> to its November schedule as it scrambles to slash costs in <a target=\"_blank\" href=\"https://www.cnbc.com/2025/08/29/spirit-airlines-chapter-11-bankruptcy.html\">bankruptcy</a> and focus on profitable flights.</p><p>\"While the news has been tough, we believe the clarity will help us move forward as a team,\" Rana Ghosh, Spirit's chief commercial officer, said in a note to employees, which was seen by CNBC.</p><p>Earlier this week Spirit said it plans to <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/22/spirit-airlines-furlough-flight-attendants-bankruptcy.html\">furlough</a> about 1,800 flight attendants, around a third of its cabin crew members.</p></div><div><h2>Read more CNBC airline news</h2><div><ul><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/16/trump-administration-orders-delta-aeromexico-to-unwind-joint-venture-by-jan-1.html\">Trump administration orders Delta, Aeromexico to unwind joint venture by Jan. 1</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/08/29/spirit-airlines-chapter-11-bankruptcy.html\">Spirit Airlines files for Chapter 11 bankruptcy protection for the second time in a year</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/08/21/spirit-airlines-lessors-bankruptcy.html\">Spirit Airlines is on shakier ground after avoiding hard decisions in bankruptcy</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/08/01/southwest-airlines-assigned-seat-price.html\">How much are Southwest's new assigned seats? It depends</a></li></ul></div></div><div><p>Spirit filed for Chapter 11 bankruptcy protection last month for the second time in less than a year as it <a target=\"_blank\" href=\"https://www.cnbc.com/2025/08/21/spirit-airlines-lessors-bankruptcy.html\">struggled</a> with higher-than-expected costs and weaker travel demand than it projected.</p><p>Spirit didn't immediately comment on the routes it is cutting, but Ghosh said in his note that Spirit will be halting service in Hartford, Connecticut, and Minneapolis.</p><p>He also said Spirit has hired Andrea Lusso, who previously was the principal for supply chain and network design at <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/AMZN/\">Amazon Air</a><span><span></span></span></span>, the online retailer's air shipment arm. Lusso will serve as vice president of network planning. His predecessor, John Kirby, retired last month after more than 40 years in the industry.</p></div></div>"
  },
  {
    "title": "Student loan borrower backlog for forgiveness swells to 74,510 under Trump",
    "url": "https://www.cnbc.com/2025/09/26/student-loan-borrower-pslf-buyback-backlog.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108034865-1726518574467-gettyimages-1411250690-r5__r5_2027.jpeg?v=1726518587&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-09-26T17:29:53.000Z",
    "description": "Alex Potemkin | E+ | Getty ImagesMore than 74,000 federal student loan borrowers are stuck in a backlog of applications for a popular student loan forgiveness program.That program, called Public Service Loan...",
    "body": "<div><div><p>Alex Potemkin | E+ | Getty Images</p></div><div><p>More than 74,000 <a target=\"_blank\" href=\"https://www.cnbc.com/student-loans/?msockid=2eef7e9809066c2415d868c3081f6df4\">federal student loan borrowers</a> are stuck in a backlog of applications for a popular student loan forgiveness program.</p><p>That program, called <a href=\"https://studentaid.gov/manage-loans/forgiveness-cancellation/public-service/public-service-loan-forgiveness-buyback?os=f&ref=app\" target=\"_blank\">Public Service Loan Forgiveness Buyback</a>, allows borrowers pursuing <a href=\"https://studentaid.gov/manage-loans/forgiveness-cancellation/public-service\" target=\"_blank\">PSLF</a> to get their debt wiped away sooner than they might have expected. Signed into law in 2007 by President George W. Bush, PSLF offers debt cancellation to those who've spent a decade working for certain not-for-profits or the government.</p><p>As of Aug. 31, there's a <a href=\"https://www.courtlistener.com/docket/69753739/42/american-federation-of-teachers-v-us-department-of-education/\" target=\"_blank\">74,510-person backlog</a> of borrowers waiting to have the U.S. Department of Education process their buyback applications, according to a <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.dcd.278527/gov.uscourts.dcd.278527.39.0.pdf\" target=\"_blank\">new court filing</a>. That's up from 72,730 in July and 65,448 borrowers as of the end of June. During the month of August, just 5,600 buyback applications were processed, the filing shows.</p><p>The U.S. Department of Education did not respond to a request for comment.</p><p><strong>More from Personal Finance:</strong><br /><a target=\"_blank\" href=\"https://www.cnbc.com/2025/08/17/tuition-free-colleges-in-2025.html\">As some colleges near $100,000, these schools are free</a><br /><a target=\"_blank\" href=\"https://www.cnbc.com/2025/07/12/college-majors-employment-prospects.html\">These college majors have the best job prospects</a><br /><a target=\"_blank\" href=\"https://www.cnbc.com/2025/07/25/student-loan-forgiveness-tax-trump-big-beautiful-bill.html\">Student loan forgiveness may soon be taxed again</a></p><p>The Education Department has regularly shared data on pending buyback requests as part of a lawsuit filed by the American Federation of Teachers. The teacher's union alleges the agency is blocking borrowers from their rights.</p><p>Some of the borrowers <a target=\"_blank\" href=\"https://www.cnbc.com/2025/08/15/student-loan-forgiveness-trump-pslf-backlog.html\">CNBC has spoken with</a> describe waiting for half a year or more for a determination on their buyback request.</p><p>Here's what student loan borrowers need to know about the program and its current challenges.</p></div><h2><a></a>PSLF Buyback applications pile up under Trump</h2><div><p>The Biden administration first offered <a href=\"https://studentaid.gov/manage-loans/forgiveness-cancellation/public-service/public-service-loan-forgiveness-buyback\" target=\"_blank\">PSLF Buyback</a> in the summer of 2023.</p><p>The opportunity allows borrowers who've hit 120 months of qualifying public service employment to submit a request to the Education Department to retroactively pay for — or \"buy back\" — any months they missed because of a forbearance or deferment. During those payment pauses, borrowers typically don't get credit toward PSLF.</p><p>The Buyback program became especially popular after courts blocked the Biden-era Saving on a Valuable Education, or SAVE, plan in <a target=\"_blank\" href=\"https://www.cnbc.com/2024/07/19/education-department-to-pause-save-student-loan-payments-amid-legal-battle.html\">the summer of 2024</a>. Millions of student loan borrowers who signed up for SAVE were automatically enrolled in a forbearance during that legal battle. Those borrowers found their progress towards PSLF frozen throughout the payment pause, even as they continued to work in eligible public service.</p><p>Now applications have piled up under the Trump administration. In March, Trump officials <a href=\"https://www.ed.gov/about/news/press-release/us-department-of-education-initiates-reduction-force\" target=\"_blank\">terminated</a> nearly half of the staff at the Education Department, including many of the people who assisted borrowers.</p></div><h2><a></a>Student loan borrowers should still apply</h2><div><p>Despite the PSLF buyback delays, \"if you are eligible, there's no harm in submitting the application,\" said Nancy Nierman, assistant director of the Education Debt Consumer Assistance Program in New York.</p><p>\"But if you can afford payments in other repayment plans, don't rely solely on the Buyback to get you to 120 qualifying payments, particularly if you only need a few months of credit to reach forgiveness,\" she said.</p></div><div><p>You can apply for Buyback and also submit paperwork to switch into another repayment plan at the same time. But there's a backlog of repayment plan applications, too. More than one million requests for a new plan are pending with the department, court records also show.</p><p>While you can remain in the SAVE forbearance for now, borrowers' debts began accruing interest again in <a target=\"_blank\" href=\"https://www.cnbc.com/2025/08/01/student-loan-interest-free-save-forbearance-ends.html\">August</a>.</p><p>If you continue making payments on your loans after you've applied for a buyback offer, or if the Education Department finds you've made more than the required 120 qualifying payments for PSLF, you're entitled to a refund from the government, said higher education expert Mark Kantrowitz. He has heard from people who've gotten one in this scenario.</p></div><h2><a></a>How to apply for PSLF Buyback</h2><div><p>You can apply for the Buyback program through the <a href=\"https://urldefense.com/v3/__https:/studentaid.gov/fsa-id/sign-in/landing?redirectTo=*2Fpslf*2Freconsideration*2Fborrower-information__;JSUl!!PIZeeW5wscynRQ!sAp5wOCu0sF64yGKXMfYR3h3eLzgg75x8b2uEfKDQXpVHJRfNk0YqT6ZfnLCprUpZlB941UdJJ_8RglWcWw$\" target=\"_blank\">PSLF Reconsideration portal</a> on your Federal Student Aid account, Nierman said</p><p>Consumer advocates recommend keeping track of when you submitted your buyback request (you should receive a confirmation email) and the number of your qualifying PSLF payments. That figure should be accessible on your student loan account.</p></div><h2><a></a>How your buyback offer is calculated</h2><div><p>After you've submitted your buyback request, the Education Dept. is supposed to send you an offer letter. That should include the number of monthly payments you missed during your public service history, and a chance to pay that bill now in exchange for student loan forgiveness.</p><p>How the government calculates your missed monthly payments is complicated, said Kantrowitz. But it's usually based on what your bills were before and after the period during which you weren't making qualifying payments, Kantrowitz said.</p><p>Some people who have low incomes are eligible for zero-dollar payments, and they might not have to pay anything to get their debt cleared.</p><p>Once you get the offer letter, Kantrowitz said, \"You must pay the amount to your loan servicer within 90 days.\"</p></div></div>"
  },
  {
    "title": "Musk, Thiel, Bannon named in partially redacted Epstein documents released by Democrats",
    "url": "https://www.cnbc.com/2025/09/26/musk-thiel-bannon-partially-redacted-epstein-files-democrats-release.html",
    "image": "https://image.cnbcfm.com/api/v1/image/106038659-1564022892470gettyimages-1154618940.jpeg?v=1758921453&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-09-26T22:17:17.000Z",
    "description": "Charges against Jeffrey Epstein were announced on July 8, 2019 in New York City. Epstein will be charged with one count of sex trafficking of minors and one count of conspiracy to engage in sex trafficking of...",
    "body": "<div><div><p>Charges against Jeffrey Epstein were announced on July 8, 2019 in New York City. Epstein will be charged with one count of sex trafficking of minors and one count of conspiracy to engage in sex trafficking of minors.</p><p>Stephanie Keith | Getty Images News | Getty Images</p></div><div><p><a target=\"_blank\" href=\"https://www.cnbc.com/elon-musk/\">Elon Musk</a>, Peter Thiel and former Trump White House advisor Steve Bannon are among those who appeared in <a href=\"https://oversightdemocrats.house.gov/sites/evo-subsites/democrats-oversight.house.gov/files/evo-media-document/epstein-production-3rd-tranch_456.pdf\" target=\"_blank\">partially redacted</a> files related to the late convicted sex offender Jeffrey Epstein that were released on Friday by Democrats in the House Oversight Committee.</p><p>The committee earlier embarked on a probe to evaluate whether the federal government mishandled its case against Epstein and co-conspirator Ghislaine Maxwell, who is serving a 20-year prison sentence following a 2022 conviction for <a href=\"https://www.nbcnews.com/news/us-news/ghislaine-maxwell-trial-verdict-reached-ghislaine-maxwell-sex-traffick-rcna9479\" target=\"_blank\">recruiting teenage girls</a> to be sexually abused by Epstein.</p><p><a target=\"_blank\" href=\"https://www.cnbc.com/donald-trump/\">President Donald Trump</a> had promised voters on the campaign trail that he would release government documents related to Epstein, who was arrested in the summer of 2019 on sex trafficking charges and died in a New York federal prison, reportedly by suicide, before trial.</p><p>However, Trump has <a target=\"_blank\" href=\"https://www.cnbc.com/2025/07/19/trump-jeffrey-epstein-files-pam-bondi.html\">refused</a> to endorse the release of any Epstein files since returning to the White House in January, and Republicans in Congress have followed his lead, keeping the documents out of the public's view.</p><p>Democrats in the committee on Friday released redacted pages from a new batch of files they obtained through their probe without giving their Republican peers advanced notice. They were rebuked for the move.</p><p>In a statement on Friday, the committee said that the batch included 8,544 documents in response to a subpoena in August, and that, \"Further review of the documents, which were redacted to protect the identity of victims, is ongoing.\" </p><p>The latest batch of documents received by the committee from the Justice Department contained itineraries and notes by Epstein memorializing invitations he'd sent, trips he'd planned and meetings he'd booked with tech and business leaders.</p></div><div><p>Demonstrators gather for a press conference calling for the release of the Jeffrey Epstein files outside the United States Captiol on Wednesday September 03, 2025 in Washington, DC. </p><p>The Washington Post | The Washington Post | Getty Images</p></div><div><p>One of the itineraries indicated that Epstein expected Musk to make a trip to his private island in the U.S. Virgin Islands on Dec. 6, 2014, but then asked \"is this still happening?\"</p><p>Musk told Vanity Fair in 2019 that he had visited Epstein's New York City mansion and that Epstein \"tried repeatedly to get me to visit his island,\" but the <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/TSLA/\">Tesla</a><span><span></span></span></span> CEO had declined.</p><p>In June, Musk wrote in a post on X, that he thought Trump and his administration were withholding Epstein-related files from the public view in order to protect the president's reputation.</p><p>\"Time to drop the really big bomb: @realDonaldTrump is in the Epstein files,\" Musk, who was in the midst of a public spat with the president, wrote at the time. \"That is the real reason they have not been made public. Have a nice day, DJT!\"</p><p>Trump was mentioned in previously released court documents from the Epstein case, but has not been formally accused of wrongdoing.</p><p>Musk started the year leading the Trump administration's Department of Government Efficiency (DOGE), an effort to slash the size of the federal government and reduce the power of various regulatory agencies. He left DOGE in May, and he and the president proceeded to hurl insults at each other in public over a number of disagreements.</p><p>However, Trump and Musk remain close enough that they <a href=\"https://www.youtube.com/watch?v=xjWBqycptv0\" target=\"_blank\">sat together</a> at a memorial service for Charlie Kirk earlier this month after the right-wing activist was assassinated while speaking at a university in Utah.</p><p>The partially redacted files also indicated Epstein had breakfast with Bannon on Feb. 16, 2019, and lunch with investor Peter Thiel on Nov. 27, 2017. Bannon is a long-time Trump ally, and Thiel was a major backer of Trump ahead of the 2016 election who spoke at the Republican National Convention.</p><p>The files also mentioned that Epstein booked a \"tentative breakfast party\" with Microsoft founder <a target=\"_blank\" href=\"https://www.cnbc.com/bill-gates/\">Bill Gates</a>, historically a supporter of Democrats, in December 2014.</p><p>Musk, Thiel, Bannon and Gates weren't immediately available for comment.</p><p><strong>WATCH:</strong> <a target=\"_blank\" href=\"https://www.cnbc.com/video/2025/07/18/house-speaker-mike-johnson-on-epstein-files-we-want-the-american-people-to-see-it.html\">House Speaker Mike Johnson on Epstein files</a></p></div><div><p><img src=\"https://image.cnbcfm.com/api/v1/image/108173875-17528436701752843667-40777535838-1080pnbcnews.jpg?v=1752843669&w=750&h=422&vtcrop=y\" alt=\"House Speaker Mike Johnson on Epstein files: We want the American people to see it\" /><span></span><span><div><p><span>watch now</span><span></span></p></div></span></p></div></div>"
  },
  {
    "title": "From PepsiCo to Taco Bell, dirty soda is taking over",
    "url": "https://www.cnbc.com/2025/09/27/dirty-soda-swig-taco-bell-pepsico.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108204580-1758905848952-PepsiCo_Dirty_Soda.png?v=1758905926&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-09-27T12:00:01.000Z",
    "description": "Utah-based drink chain Swig coined \"dirty soda\" back in 2010. Fifteen years later, the trend is fueling innovation everywhere from PepsiCo to McDonald's, infusing the sluggish beverage category with new...",
    "body": "<div><div><p>Utah-based drink chain Swig coined \"dirty soda\" back in 2010. Fifteen years later, the trend is fueling innovation everywhere from <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/PEP/\">PepsiCo</a><span><span></span></span></span> to <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/MCD/\">McDonald's</a><span><span></span></span></span>, infusing the sluggish beverage category with new life.</p><p>\"Dirty soda\" drinks use pop as a base, followed by flavored syrups, cream or other ingredients. While Swig claims credit — and the trademark — for dirty soda, TikTok videos and the reality TV show \"The Secret Lives of Mormon Wives\" have helped the trend spread far and wide, outpacing even the soda chain's speedy expansion.</p><p>Now, consumers can find it nearly everywhere, from grocery store aisles to fast-food chains.</p><p>In a few weeks, Pepsi plans to unveil two ready-to-drink dirty soda-inspired beverages at the National Association of Convenience Stores trade show in Chicago. The new drinks, the Dirty Dew and the Mug Floats Vanilla Howler, follow on the heels of the Pepsi Wild Cherry & Cream flavor, which hit shelves earlier this year.</p><p>\"I think it's a great opportunity for people like us, like PepsiCo, and for consumers to experience soda in a new way — and in some ways, an old way,\" Pepsi Beverages North America Chief Marketing Officer Mark Kirkham told CNBC, comparing the rise of dirty soda to root beer floats and the soda shops of yore.</p></div><div><p>PepsiCo's lineup of dirty soda-inspired drinks includes Pepsi Wild Cherry & Cream, Dirty Mountain Dew and Mug Floats Vanilla Howler.</p><p>Source: PepsiCo</p></div><div><p>Dirty soda has also drawn new interest beyond beverage players. According to Datassential, 2.7% of U.S. eateries offer a carbonated soft drink that includes cream or milk, up from 1.5% a decade ago.</p><p>Newcomers to the trend include TGI Fridays, which launched dirty soda as a limited-time menu item this summer that could be spiked with alcohol. McDonald's is <a target=\"_blank\" href=\"https://www.cnbc.com/2025/07/24/mcdonalds-tests-cosmcs-drinks.html\">testing flavored sodas</a>, like a \"Sprite Lunar Splash,\" at more than 500 locations after winding down its drinks-focused spinoff CosMc's in June. <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/YUM/\">Yum Brands'</a><span><span></span></span></span> Taco Bell has also been offering limited-time menu items, like a dirty Mountain Dew Baja Blast.</p></div><h2><a></a>Swig sets a trend</h2><div><p>These days, Swig has grown to more than 140 locations across 16 states. So far this year, its same-store sales have risen 8.2%, according to the privately held company. The Larry H. Miller Company, an investment firm founded by the former Utah Jazz owner, bought a majority stake in Swig in 2022 for an undisclosed sum.</p><p>\"I think we're doing for soda what Starbucks did for coffee,\" Swig CEO Alex Dunn said.</p><p>As Swig has grown, so have the number of chains looking to emulate its success. Rival soda shops like Sodalicious, Fiiz and Cool Sips are also benefiting from the trend. Coffee shops, like <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/BROS/\">Dutch Bros.</a><span><span></span></span></span>, have also added it to their menus. And now fast-food chains are hopping on the bandwagon.</p><p>\"It validates that this is a category, and McDonald's and Taco Bell wouldn't be getting into it if it wasn't something that had broad appeal that they could sell everywhere, in thousands of locations,\" Dunn said. \"It's kind of flattering that we created a category that now everybody is copying.\"</p><p>For restaurants, adding dirty soda to the menu is easier than it might sound.</p><p>\"It's a custom drink offering that, one, allows the brands to leverage something that they already have right there: their soda machine,\" said Erica Holland-Toll, culinary director at The Culinary Edge, which advises restaurants on food and beverage innovation. \"Two, it incorporates either a one-touch ingredient, or if they're already open for breakfast, it's quite likely that they've got a creamer in house.\"</p><p>On the other hand, offering customizable coffee drinks is usually much more difficult — which has contributed to the struggles at Starbucks.</p><p>\"The espresso world — that's so much more complicated,\" Holland-Toll said.</p><p>Dirty soda also has wide appeal. With less caffeine than coffee, consumers can drink it all day long. Plus, it's \"much more accessible\" than some coffee house trends, like an espresso tonic, according to Holland-Toll. The bright colors of many dirty sodas also make them more attractive to consumers, who were likely introduced to the trend via a TikTok video.</p><p>But perhaps above all, dirty soda can help restaurants draw in customers who are otherwise feeling thrifty.</p><p>\"It's an affordable fun treat. You're not going out and spending $30 or $50, right?\" said Sally Lyons Watt, chief advisor of consumer goods and foodservice insights for Circana. \"It's something that people can walk away saying, 'Wow, that was yummy' or 'I feel better because I just had that.'\"</p></div><h2><a></a>A pop for beverage companies</h2><div><p>Swig drinks.</p><p>Courtesy: Swig</p></div><div><p>A \"fun treat\" for consumers is adding up for beverage companies, helping reverse the decades-long trend of declining soda consumption in the U.S.</p><p>As health concerns mount and the array of beverage options expands, Americans have been drinking less soda for roughly two decades. In 2004, soda consumption peaked at 15.3 billion gallons, according to Beverage Marketing; by 2024, that figure had slid to 11.87 billion gallons. But consumption of carbonated soft drinks has been ticking up in the last two years, with 2025 estimated to reach 11.88 billion gallons. The rise of dirty soda, plus the growing popularity of prebiotic sodas, has likely helped the segment halt its downward trajectory.</p></div><div><p>Over the years, iced coffee has been stealing what the beverage industry calls \"share of throat\" from soda. With dirty soda, consumers can marry their love of customizing a cold drink with the lower caffeine content and taste of soda.</p><p>\"The carbonation makes it feel lighter in your mouth than coffee, for example,\" Holland-Toll said.</p><p>Dirty soda has also been attracting younger consumers who previously didn't drink much Pepsi or Dr Pepper. Swig's core customer base is young women between the ages of 18 and 35, according to Dunn.</p><p>That's true for Holly Galvin, a 31-year-old human resources professional based in Davenport, Iowa. She told CNBC that she rarely drank soda — until she saw dirty soda take the spotlight in the \"The Secret Lives of Mormon Wives\" last year. Now she makes her own dirty soda once or twice a week at home. With the onset of autumn, her go-to recipe these days uses Diet Dr Pepper as a base, with pumpkin spice creamer and a sprinkle of pumpkin pie spice on top.</p><p>Broadly, younger consumers are more inclined to seek out new drinks compared with older cohorts. Nearly three-quarters of Generation Z try a new beverage every month on average, according to Keurig Dr Pepper's 2025 trend report.</p><p>Beverage companies say that they are seeing a broader halo effect for soda as a result of the trend.</p><p>\"For us, it serves as a recruitment tool, bringing new users into the trademark,\" said Katie Webb, vice president of innovation and transformation for <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/KDP/\">Keurig Dr Pepper</a><span><span></span></span></span>. \"It really draws them all the way back to the base brand, which ends up being extremely impact for us long after.\"</p><p>And just as craft cocktail culture led to the rise of canned cocktails, the popularity of dirty soda is leading beverage giants to cash in with ready-to-drink versions that capitalize on the trend. Dr Pepper Creamy Coconut was the company's most successful limited-time carbonated soft drink to date, based on retail dollar sales, according to Webb. And Kirkham said Pepsi Wild Cherry & Cream has been one of the fastest-growing flavor segments for the company.</p><p>\"Some trends start retail and move over to foodservice,\" Circana's Lyons Wyatt said. \"This one was a foodservice trend moving into retail.\"</p><p>With Pepsi Wild Cherry & Cream and next year's launch of Dirty Dew and the Mug Floats Vanilla Howler, Kirkham expects that consumers will become even more creative with their concoctions.</p><p>\"I think it's actually giving [consumers] the chance to experiment even more and customize more,\" he said. \"Now you have a brand new base.\"</p></div></div>"
  },
  {
    "title": "Top Democrat slams Trump for attending Ryder Cup golf event as government shutdown looms",
    "url": "https://www.cnbc.com/2025/09/26/trump-government-shutdown-golf-jeffries-ryder-cup.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108204573-1758904972552-gettyimages-2237558547-090a6321_iain4fmh.jpeg?v=1758905017&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-09-26T20:01:40.000Z",
    "description": "U.S. President Donald Trump attends the 2025 Ryder Cup at Black Course at Bethpage State Park Golf Course on Sept. 26, 2025 in Farmingdale, New York.Anna Moneymaker | Getty ImagesHouse Minority Leader Hakeem...",
    "body": "<div><div><p>U.S. President Donald Trump attends the 2025 Ryder Cup at Black Course at Bethpage State Park Golf Course on Sept. 26, 2025 in Farmingdale, New York.</p><p>Anna Moneymaker | Getty Images</p></div><div><p>House Minority Leader <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/25/jeffries-democrats-government-shutdown-republicans.html\">Hakeem Jeffries</a> ripped President <a target=\"_blank\" href=\"https://www.cnbc.com/donald-trump/\">Donald Trump</a> on Friday for leaving town to watch <a target=\"_blank\" href=\"https://www.cnbc.com/video/2025/08/12/usga-ceo-mike-whan-a-lot-of-sports-are-viewed-by-fans-golf-is-one-played-by-fans.html\">golf</a> matches in New York with just four days left to avoid a possible federal <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/26/government-shutdown-jobs-economy-trump.html\">government shutdown</a>.</p><p>\"He doesn't have the time to meet with Democratic leaders to fund the government and address the Republican health care crisis, but Donald Trump, right now, as we speak, is at a golf event,\" Jeffries, D-N.Y., said at a <a href=\"https://www.c-span.org/program/news-conference/house-minority-leader-jeffries-speaks-to-reporters-amid-government-funding-impasse/666323\" target=\"_blank\">news conference</a> on Capitol Hill.</p><p>Trump left Washington, D.C., on Friday morning for Bethpage, Long Island, to watch matches at the Ryder Cup, a biennial men's golf competition. Trump flew back to Washington on Air Force One on Friday afternoon.</p><p>Asked what he sees as an \"off-ramp\" to an impasse between Republicans and Democrats, Jeffries pointed at the president.</p><p>\"Here's the off-ramp: Donald Trump, get back to Washington, D.C.,\" said Jeffries.</p><p>\"Why are you at a golf event right now, and the government is four days away from closing? That's outrageous.\"</p><p>Jeffries and other Democrats argue that Republicans and Trump will be to blame if the federal government shuts down on Wednesday for lack of a <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/25/trump-healthcare-government-shutdown-congress.html\">stopgap funding package</a>.</p></div><div><h2>Read more CNBC politics coverage</h2><div><ul><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/24/curtis-sliwa-new-york-mayor-trump-mamdani-cuomo.html\">New York City mayor candidate Curtis Sliwa says he was offered money to quit race</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/24/elizabeth-warren-trump-rolex-tennis-invite-apple-nvidia.html\">Trump's tennis invite from Rolex echoes Apple, Nvidia playbook for currying favor, Warren says</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/24/ice-shooting-dallas-noem.html\">2 dead in Dallas ICE shooting, including suspect; FBI eyes ideological motive</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/23/trump-un-ga-speech.html\">Trump UN escalator snafu: White House wants investigation of sudden stop</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/23/trump-democrats-shutdown-schumer-jeffries.html\">Trump cancels meeting with top Democrats as government shutdown looms</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/23/europes-work-life-balance-could-be-key-in-trumps-h-1b-visa-shake-up.html\">Europe's work-life balance a key talent draw as Trump revamps H-1B visa</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/23/trump-xi-meeting-likely-to-happen-early-next-year-says-ambassador.html\">Trump-Xi meeting likely to happen next year, says U.S. ambassador to China</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/22/trump-schumer-jeffries-government-funding-.html\">Trump to meet top Dems as their health care demands fuel government shutdown risk</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/22/trump-ftc-supreme-court-slaughter.html\">Supreme Court lets Trump fire FTC's Slaughter for now</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/22/jimmy-kimmel-abc-sacramento-shooting-epstein-kirk.html\">Jimmy Kimmel suspension, Trump book, Epstein note eyed in ABC affiliate shooting</a></li></ul></div></div><div><p>White House spokeswoman Abigail Jackson, in a statement to CNBC, said, \"The only person Hakeem Jeffries and the Democrats can blame for a government shutdown is themselves.\"</p><p>\"The Trump Administration wants a straightforward and clean CR [continuing resolution] to continue funding the government – the exact same proposal that Democrats supported just six months ago, and 13 times under the Biden Administration,\" Jackson said. </p><p>\"But radical Democrats are threatening to shut the government down if they don't get their nearly $1.5 trillion wish list of demands, including free health care for illegal aliens,\" she said. \"The [Democrats'] radical agenda was rejected by the American people less than a year ago at the ballot box; now they're trying to shut down the government and hold the American people hostage over it.\" </p><p>Republicans, who hold narrow majorities in the House and Senate, want to pass what they call a \"clean\" bill to temporarily extend funding.</p><p>But Democratic leaders insist that the bill include an extension of enhanced Affordable Care Act premium tax credits, which are set to expire at the end of the year. Those credits reduce the cost of health insurance plans purchased on Obamacare marketplaces.</p><p>Republicans call those demands unreasonable, arguing that Democrats are the ones standing in the way of the government staying open.</p><p>Democrats say Republicans are refusing to negotiate with them because they want to shut the government down.</p><p>A funding bill needs 60 votes to be adopted in the Senate, which means it cannot pass on a party-line vote.</p><p>There are 53 Republican senators and 45 Democratic senators. The two independent senators caucus with the Democrats.</p></div></div>"
  },
  {
    "title": "Sinclair, Nexstar will bring 'Jimmy Kimmel Live' back to owned ABC stations on Friday",
    "url": "https://www.cnbc.com/2025/09/26/sinclair-abc-jimmy-kimmel.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108177213-1753461500023-gettyimages-2214501535-177377_MLII4477.jpeg?v=1758659442&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-09-26T21:07:19.000Z",
    "description": "On Tuesday, May 13, 2025 at North Javits in New York City, an incredible roster of all-star talent will tout their connections to storytelling, Disney, and each other while showcasing their latest projects...",
    "body": "<div><p>On Tuesday, May 13, 2025 at North Javits in New York City, an incredible roster of all-star talent will tout their connections to storytelling, Disney, and each other while showcasing their latest projects for the upcoming year.</p><p>Michael Le Brecht | Disney General Entertainment Content | Getty Images</p></div><div><p><span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/SBGI/\">Sinclair</a><span><span></span></span></span> and <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/NXST/\">Nexstar</a><span><span></span></span></span> are returning \"Jimmy Kimmel Live!\" to ABC affiliate broadcast stations beginning Friday, the companies said in separate statements.</p><p>The announcements come three days after <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/DIS/\">Disney's</a><span><span></span></span></span> ABC broadcast network <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/22/disney-abc-jimmy-kimmel-return.html\">returned</a> the late night program to its air after a nearly week-long suspension. Disney had temporarily <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/17/charlie-kirk-jimmy-kimmel-abc-disney.html\">suspended</a> the late night show following comments Kimmel made about the alleged murder of conservative activist Charlie Kirk and President Donald Trump's MAGA movement.</p><p>\"Our objective throughout this process has been to ensure that programming remains accurate and engaging for the widest possible audience. We take seriously our responsibility as local broadcasters to provide programming that serves the interests of our communities, while also honoring our obligations to air national network programming,\" Sinclair said in a statement on Friday.</p><p>\"Over the last week, we have received thoughtful feedback from viewers, advertisers, and community leaders representing a wide range of perspectives,\" Sinclair said. \"We have also witnessed troubling acts of violence, including the despicable incident of a shooting at an ABC affiliate station in Sacramento. These events underscore why responsible broadcasting matters and why respectful dialogue between differing voices remains so important.\"</p><p>The broadcast station owners said earlier this week they would continue to <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/23/kimmel-abc-nexstar-sinclair-fcc.html\">preempt</a> Kimmel's late night show, meaning it would be unavailable on local stations for roughly 20% of the country, while they <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/24/jimmy-kimmel-live-nexstar-show-status-abc-stations.html\">evaluated</a> the situation and continued discussions with Disney.</p><p>Sinclair owns roughly 40 ABC affiliate stations in the U.S., including one in in Washington, D.C. Nexstar owns about 30 in markets including Salt Lake City and New Orleans.</p><p>Kimmel <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/23/jimmy-kimmel-returns-abc-disney-kirk.html\">addressed</a> the situation — and the ongoing preemptions — during his returning show this week.</p><p>\"We are still on the air in most of the country, except, ironically, from Washington, D.C., where we have been preempted,\" Kimmel said during Tuesday's monologue. \"After almost 23 years on the air, we're suddenly not being broadcast in 20% of the country, which is not a situation we relish.\"</p><p>Sinclair said Friday it had proposed measures to \"strengthen accountability, viewer feedback, and community dialogue\" at ABC and its affiliates.</p><p>\"While ABC and Disney have not yet adopted these measures, and Sinclair respects their right to make those decisions under our network affiliate agreements, we believe such measures could strengthen trust and accountability,\" it said.</p><p>Nexstar said in a statement: \"We have had discussions with executives at The Walt Disney Company and appreciate their constructive approach to addressing our concerns.\"</p><p>Disney declined to comment Friday.</p><p>Kimmel's suspension last week came shortly after Nexstar announced it would not air the program in light of the host's comments. Sinclair soon after said it would likewise preempt the program.</p><p>Those announcements followed comments from Federal Communications Commission Chairman Brendan Carr that <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/18/jimmy-kimmel-charlie-kirk-fcc-carr.html\">suggested</a> ABC affiliate stations could be at <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/19/trump-threatening-broadcast-station-licenses-explained.html\">risk of losing</a> broadcast station licenses over Kimmel's remarks, which came during a show monologue.</p><p>The series of events raised questions about influence by the Trump administration on the media and First Amendment protections.</p><p>\"Our decision to preempt this program was independent of any government interaction or influence,\" Sinclair said Friday. \"Free speech provides broadcasters with the right to exercise judgment as to the content on their local stations. While we understand that not everyone will agree with our decisions about programming, it is simply inconsistent to champion free speech while demanding that broadcasters air specific content.\"</p><p>Earlier this week, Sen. Maria Cantwell, D-Wash., <a href=\"https://www.cantwell.senate.gov/news/press-releases/cantwell-calls-on-sinclair-broadcasting-to-quit-blocking-publics-ability-to-watch-jimmy-kimmel-live\" target=\"_blank\">sent a letter</a> to Sinclair pushing to bring \"Jimmy Kimmel Live!\" back on air. Sinclair owns the Seattle ABC affiliate station.</p><p>Nexstar similarly denied any government influence. </p><p>\"As a local broadcaster, Nexstar remains committed to protecting the First Amendment while producing and airing local and national news that is fact-based and unbiased and, above all, broadcasting content that is in the best interest of the communities we serve,\" Nexstar said in a statement. </p><p>\"We stand apart from cable television, monolithic streaming services, and national networks in our commitment – and obligation – to be stewards of the public airwaves and to protect and reflect the specific sensibilities of our communities,\" the statement continued. \"To be clear, our commitment to those principles has guided our decisions throughout this process, independent of any external influence from government agencies or individuals.\"</p></div>"
  },
  {
    "title": "Accenture plans on 'exiting' staff who can't be reskilled on AI amid restructuring strategy ",
    "url": "https://www.cnbc.com/2025/09/26/accenture-plans-on-exiting-staff-who-cant-be-reskilled-on-ai.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108204375-1758883523401-gettyimages-2203135450-_r5_4282_tqwtjej1.jpeg?v=1758883560&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-09-27T12:33:48.000Z",
    "description": "A logo sits illuminated at the Accenture booth in Mobile World Congress 2025 on March 03, 2025 in Barcelona, Spain.Xavi Torrent | Getty Images News | Getty ImagesTech consultancy Accenture has set out plans...",
    "body": "<div><div><p>A logo sits illuminated at the Accenture booth in Mobile World Congress 2025 on March 03, 2025 in Barcelona, Spain.</p><p>Xavi Torrent | Getty Images News | Getty Images</p></div><div><p>Tech consultancy <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/CSA-FF/\">Accenture</a><span><span></span></span></span> has set out plans to lay off staff who aren't able to reskill on artificial intelligence amid a broader restructuring strategy which will see the company prioritize AI efforts.</p><p>Accenture CEO Julie Sweet said in a call Thursday that as advanced AI becomes \"a part of everything we do\" and the global professional services company continues to invest significantly in the area, it expects employees to \"retrain and retool\" at scale.</p><p>\"We are investing in upskilling our reinventors, which is our primary strategy,\" Sweet said. She explained that the company is \"exiting on a compression timeline\" people for whom reskilling isn't a \"viable path.\"</p><p>Sweet said Accenture had already reskilled 550,000 workers on the fundamentals of generative AI and outlined a six-month $865 million business optimization program, which detailed costs associated with severance and headcount reductions.</p><p>\"We expect savings of over $1 billion from our business optimization program, which we expect that we will reinvest in our business and in our people because it's so important for our future growth and so we expect to reinvest that while still delivering modest margin expansion,\" Accenture Chief Financial Officer Angie Park said.</p><p>Alongside cuts, the company is continuing to hire and has beefed up its AI talent with 77,000 employed AI and data professionals in 2025, up from 40,000 in 2023. Sweet said its also expecting to increase the company's headcount in the next financial year across markets including the U.S. and Europe.</p><p>\"Our No. 1 strategy is upskilling, given the skills we need, and we've had a lot of experience in upskilling, we're trying to, in a very compressed timeline, where we don't have a viable path for skilling, sort of exiting people so we can get more of the skills in we need,\" Sweet added.</p><p>The company reported revenue of $69.7 billion this year, growth of 7% from the prior year. In an interview with CNBC's \"<a target=\"_blank\" href=\"https://www.cnbc.com/squawk-on-the-street/\">Squawk on the Street,</a>\" Sweet pinned this growth on massive client demand to deploy artificial intelligence across organizations.</p></div><div><p><img src=\"https://image.cnbcfm.com/api/v1/image/108203880-17588124371758812433-41811576818-1080pnbcnews.jpg?v=1758812435&w=750&h=422&vtcrop=y\" alt=\"Accenture CEO Julie Sweet on earnings beat: Our early investment in AI is paying off\" /><span></span><span><div><p><span>watch now</span><span></span></p></div></span></p></div><div><p>\"Our early investment in AI is really paying off,\" Sweet told CNBC. \"We feel very good as we go into FY26 with the momentum we're seeing in our business which is driven by Accenture being the company that you really partner to make sure you can use advanced AI.\"</p><p>\"Every CEO, board and the C-suite recognize that advanced AI is critical to the future. The challenge right now they're facing is that they're really excited about the technology and they're not yet AI ready for most companies,\" she added.</p></div></div>"
  },
  {
    "title": "CDC takes down more than a dozen webpages on sexual and gender identity, health equity",
    "url": "https://www.cnbc.com/2025/09/26/cdc-webpages-on-sexual-gender-identity-health-equity-removed.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108152877-17486427102025-05-30t220123z_1101140013_rc2isea9w3jt_rtrmadp_0_health-usa-protest.jpeg?v=1748642784&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-09-26T17:05:10.000Z",
    "description": "A sign for the CDC sits outside of their facility at the Centers for Disease Control and Prevention Roybal campus in Atlanta, Georgia, U.S., May 30, 2025. Megan Varner | ReutersMore than a dozen pages on the...",
    "body": "<div><div><p>A sign for the CDC sits outside of their facility at the Centers for Disease Control and Prevention Roybal campus in Atlanta, Georgia, U.S., May 30, 2025. </p><p>Megan Varner | Reuters</p></div><div><p>More than a dozen pages on the Centers for Disease Control and Prevention website related to sexual and gender identity, health equity, and other topics have been taken down, CNBC has learned. </p><p>The CDC received a directive from the Health and Human Services Department, which oversees the agency, to remove certain webpages by the end of the day Sept. 19, according to an internal CDC email viewed by CNBC, which was sent that day to some employees whose work is related to the pages.</p><p>The pages include one about sexually transmitted infections and gay men, another about healthy equity for people with disabilities, and additional fact sheets on asexuality and bisexuality. Some health equity advocates say removing such resources could create gaps in access to critical health information, especially for marginalized groups, and undermine efforts to promote equitable care.</p><p>The removal of \"critical materials from trusted government resources endangers the health of patients and the public,\" a spokesperson for the <a href=\"https://lbgtpa.wildapricot.org/\" target=\"_blank\">LBGT PA Caucus</a>, a nonprofit promoting LGBTQ+ health-care equity, said in a statement.</p><p>\"Stripping away resources on gender identity does not erase the need, it only erodes trust, creates confusion, and places patients at greater risk,\" the spokesperson said. \"Clinicians and the communities they serve rely on accessible, accurate, and inclusive guidance to deliver safe and effective care.\"</p><p>The email did not provide details on why HHS directed the CDC to remove the pages or why it targeted certain topics. But the topics of some of the resources taken down are longtime targets of the Trump administration, which has <a href=\"https://www.pbs.org/newshour/politics/6-ways-trumps-executive-orders-are-targeting-transgender-people\" target=\"_blank\">issued a series of executive actions</a> that limit transgender and nonbinary people's rights and rolled back efforts to increase diversity, equity and inclusion. </p><p>In a statement, an HHS spokesperson said the \"CDC continues to align their website with Administration priorities and Executive Orders.\" The CDC directed CNBC to HHS for comment.</p></div><div><p>CDC web page on health equity for people with disabilities was online on Aug. 27, according to the Wayback Machine, but is offline as of Sept. 26. </p><p>CDC website, Wayback Machine</p></div><div><p>It's not the first time that the administration has targeted health resources on federal agency websites.</p><p>Thousands of pages across websites for the CDC and Food and Drug Administration, among other agencies, were <a href=\"https://www.nytimes.com/2025/02/02/upshot/trump-government-websites-missing-pages.html\" target=\"_blank\">abruptly pulled down</a> beginning in late January under President <a target=\"_blank\" href=\"https://www.cnbc.com/donald-trump/\">Donald Trump</a>'s executive order barring references to gender identity in federal policies and documents. In February, a federal judge <a href=\"https://www.nytimes.com/2025/02/11/us/politics/cdc-website-restore-pages-trump.html\" target=\"_blank\">ordered</a> HHS, the CDC and FDA to temporarily restore public access to the pages while litigation moves forward. </p><p>That same judge <a href=\"https://www.courtlistener.com/docket/69608613/doctors-for-america-v-office-of-personnel-management/\" target=\"_blank\">ruled </a>in July that the government unlawfully ordered the mass removal of health resources from federal sites and required agencies to review and restore the affected pages. Following that <a href=\"https://doctorsforamerica.org/pr-lawsuit-win-hhs/\" target=\"_blank\">ruling</a>, the Trump administration reported to the court on Sept. 19 that most agencies have finished restoring the pages, with 185 back in compliance and only 11 CDC pages still under review<strong>, </strong>according to court documents. It is unclear how many of the pages taken down this month were at issue in the lawsuit.</p></div><div><h2>More CNBC health coverage</h2><div><ul><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/24/how-to-get-covid-mmrv-hepatitisb-vaccines.html\">The Trump administration is changing Covid, childhood vaccine recommendations – here's what it means for you</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/26/us-to-impose-100percent-tariff-on-branded-patented-drugs-unless-firms-build-plants-locally-trump-says.html\">U.S. to impose 100% tariff on branded, patented drugs unless firms build plants locally, Trump says</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/23/eli-lilly-plans-6point5-billion-texas-manufacturing-plant-for-obesity-pill.html\">Eli Lilly to build $6.5 billion Texas manufacturing facility for obesity pill, other drugs</a></li></ul></div></div><div><p>It is unclear which pages were still under review as of Sept. 19, and why the CDC took down more pages on that same day following the ruling.</p><p>Attached to the internal CDC email was a spreadsheet of more than a dozen pages that the agency said had been taken down as of Sept. 19. A separate spreadsheet compiled by agency employees and viewed by CNBC included an additional site that appears to be offline.</p><p>CNBC verified that the following pages are now offline. The digital archive site Wayback Machine also shows when they were last active. Several pages were online as recently as early September, according to Wayback Machine, but it is unclear when the CDC officially removed all of them. </p><ul><li><a href=\"https://www.cdc.gov/sti/about/about-stis-and-gay-men.html\" target=\"_blank\">About STIs and Gay Men </a>– last <a href=\"https://web.archive.org/web/20250905055902/https://www.cdc.gov/sti/about/about-stis-and-gay-men.html\" target=\"_blank\">recorded </a>online on Sept. 5.</li><li><a href=\"https://www.cdc.gov/std/treatment-guidelines/trans.htm\" target=\"_blank\">STI information for Transgender and Gender Diverse Persons</a> – last <a href=\"https://web.archive.org/web/20250902115753/https://www.cdc.gov/std/treatment-guidelines/trans.htm\" target=\"_blank\">recorded </a>online on Sept. 2. </li><li><a href=\"https://www.cdc.gov/shigella/about/about-shigella-infection-among-gay-bisexual-and-other-men-who-have-sex-with-men.html\" target=\"_blank\">About Shigella Infection Among Gay, Bisexual, and Other Men Who Have Sex with Men </a>– last <a href=\"https://web.archive.org/web/20250901061011/https://www.cdc.gov/shigella/about/about-shigella-infection-among-gay-bisexual-and-other-men-who-have-sex-with-men.html\" target=\"_blank\">recorded </a>online on Sept. 1. </li><li><a href=\"https://www.cdc.gov/hepatitis/risk-factors-msm/index.html\" target=\"_blank\">Prevention Approaches for Viral Hepatitis in Gay and Bisexual Men</a> – last <a href=\"https://web.archive.org/web/20250830144724/https://www.cdc.gov/hepatitis/risk-factors-msm/index.html\" target=\"_blank\">recorded </a>online on Aug. 30. </li><li><a href=\"https://www.cdc.gov/hepatitis/hcp/populations-settings/msm.html\" target=\"_blank\">Viral Hepatitis Among Men Who Have Sex with Men</a> – last <a href=\"https://web.archive.org/web/20250902192556/https://www.cdc.gov/hepatitis/hcp/populations-settings/msm.html\" target=\"_blank\">recorded </a>Sept. 2. </li><li><a href=\"https://www.cdc.gov/tb/health-equity/asian-persons.html\" target=\"_blank\">Tuberculosis and Asian Persons</a> – last <a href=\"https://web.archive.org/web/20250828033707/https://www.cdc.gov/tb/health-equity/asian-persons.html\" target=\"_blank\">recorded </a>Aug. 28. </li><li><a href=\"https://www.cdc.gov/cfa-modeling-and-forecasting/mpox-gbmsm-technical-brief/mpox-gbmsm-tech-brief2024/index.html\" target=\"_blank\">Risk of Clade 1 Mpox among Gay, Bisexual, and Other Men who Have Sex With Men</a> – last <a href=\"https://www.cdc.gov/cfa-modeling-and-forecasting/mpox-gbmsm-technical-brief/mpox-gbmsm-tech-brief2024/index.html\" target=\"_blank\">recorded </a>July 20.</li><li><a href=\"http://www.cdc.gov/health-equity/core/index.html\" target=\"_blank\">CDC's CORE Commitment to Health Equity</a> – last recorded <a href=\"https://web.archive.org/web/20250130222839/https://www.cdc.gov/health-equity/core/index.html\" target=\"_blank\">online </a>Jan. 30. </li><li><a href=\"https://www.cdc.gov/cancer/health-equity/equity.html\" target=\"_blank\">Health Equity in Cancer Prevention and Control </a>– last <a href=\"https://web.archive.org/web/20250901110752/https://www.cdc.gov/cancer/health-equity/equity.html\" target=\"_blank\">recorded </a>online on Sept. 1.</li><li><a href=\"https://www.cdc.gov/overdose-prevention/health-equity/index.html\" target=\"_blank\">Health Equity and Drug Overdose</a> – last <a href=\"https://web.archive.org/web/20250901144204/https://www.cdc.gov/overdose-prevention/health-equity/index.html\" target=\"_blank\">recorded </a>online on Sept. 1.</li><li><a href=\"https://www.cdc.gov/disability-inclusion/strategies/health-equity.html\" target=\"_blank\">Health Equity for People with Disabilities</a> – last <a href=\"https://web.archive.org/web/20250827234916/https://www.cdc.gov/disability-inclusion/strategies/health-equity.html\" target=\"_blank\">recorded </a>online on Aug. 27. </li><li><a href=\"https://www.cdc.gov/injury-violence-prevention/health-equity/index.html\" target=\"_blank\">Health Equity in Injury and Violence Prevention</a> – last <a href=\"https://web.archive.org/web/20250827235428/https://www.cdc.gov/injury-violence-prevention/health-equity/index.html\" target=\"_blank\">recorded </a>online on Aug. 27. </li><li><a href=\"https://npin.cdc.gov/publication/understanding-bisexuality\" target=\"_blank\">National Prevention Information Network: Understanding Bisexuality</a> – last <a href=\"https://web.archive.org/web/20241123183132/https://npin.cdc.gov/publication/understanding-bisexuality\" target=\"_blank\">recorded </a>online on Nov. 23, 2024. As of Feb. 22, the page <a href=\"https://web.archive.org/web/20250222104619/https://npin.cdc.gov/publication/understanding-bisexuality\" target=\"_blank\">said </a>it \"is being modified to comply with President Trump's Executive Orders.\"</li><li><a href=\"https://npin.cdc.gov/publication/understanding-asexuality\" target=\"_blank\">National Prevention Information Network: Understanding Asexuality</a> – last <a href=\"https://web.archive.org/web/20241123183132/https://npin.cdc.gov/publication/understanding-asexuality\" target=\"_blank\">recorded </a>online Nov. 23, 2024. As of Feb. 21, the page <a href=\"https://web.archive.org/web/20250221191858/https://npin.cdc.gov/publication/understanding-asexuality\" target=\"_blank\">said </a>it \"is being modified to comply with President Trump's Executive Orders.\"</li><li><a href=\"https://npin.cdc.gov/target-population/lesbianbisexual-women\" target=\"_blank\">National Prevention Information Network: Lesbian/Bisexual Women</a> – The page currently loads but only shows the title. It has not been recorded on the Wayback Machine archive. </li><li><a href=\"https://npin.cdc.gov/publication/guidelines-comprehensive-sexuality-education-3rd-edition\" target=\"_blank\">National Prevention Information Network: Guidelines for Comprehensive Sex Education 3rd Edition</a> – last <a href=\"https://web.archive.org/web/20250708050953/https://npin.cdc.gov/publication/guidelines-comprehensive-sexuality-education-3rd-edition\" target=\"_blank\">recorded </a>online on July 8. </li><li><a href=\"https://www.cdc.gov/healthy-aging/media/pdfs/2024/06/Alzheimers-Comms-Guide-Oct-2023-508.pdf\" target=\"_blank\">Alzheimer's Communication Guide </a>– last <a href=\"https://web.archive.org/web/20250921131703/https://www.cdc.gov/healthy-aging/media/pdfs/2024/06/Alzheimers-Comms-Guide-Oct-2023-508.pdf\" target=\"_blank\">recorded </a>online on June 10.</li></ul><p>Some pages listed on the spreadsheet attached to the internal CDC email are still online. That includes a <a href=\"https://www.cdc.gov/rsv/php/surveillance/rsv-net.html?CDC_AA_refVal=https%3A%2F%2Fwww.cdc.gov%2Frsv%2Fphp%2Fsurveillance%2Findex.html\" target=\"_blank\">page </a>that monitors laboratory-confirmed hospitalizations among children and adults associated with respiratory syncytial virus. </p></div></div>"
  }
]