[
  {
    "title": "Trump to meet Ukraine leader Zelenskyy at White House on Friday",
    "url": "https://www.cnbc.com/2025/10/13/trump-ukraine-zelenskyy-russia.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108202884-17586489492025-09-23t173055z_673270572_rc2txgaekh8q_rtrmadp_0_un-assembly-trump.jpeg?v=1758648992&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-13T18:08:26.000Z",
    "description": "U.S. President Donald Trump meets with Ukrainian President Volodymyr Zelenskyy during the 80th United Nations General Assembly, in New York City, New ",
    "body": "U.S. President Donald Trump meets with Ukrainian President Volodymyr Zelenskyy during the 80th United Nations General Assembly, in New York City, New York, U.S., Sept. 23, 2025. Alexander Drago | ReutersPresident Donald Trump is expected to meet Ukrainian President Volodymyr Zelenskyy at the White House this week, NBC News reported Monday.The meeting was scheduled after the two leaders spoke twice on the phone over the weekend and discussed the possibility of the U.S. approving the transfer of Tomahawk missiles to Ukraine, according to NBC.Trump said Monday that he is considering sending Tomahawk missiles to Ukraine as \"a new step of aggression\" in an effort to pressure Russia to end the war against its neighbor.Zelenskyy last met with Trump at the White House in August, shortly after the American president met with Russian leader Vladimir Putin in Alaska.Ukraine's use of Tomahawks — subsonic cruise missiles that can strike targets from 1,000 miles away —would give the country the ability to ramp up its counterattacks on Russia.The war between Ukraine and Russia has raged since Russia invaded in 2022.Reuters reported last week that a Kremlin spokesperson said Russian leadership was waiting to see the specifics of a Tomahawk supply deal. The missiles reportedly cost an average of $1.3 million each.Trump was traveling in the Middle East on Monday.He first visited Israel and then flew to Egypt as talks on a peace deal for Gaza are being finalized.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump to meet Ukraine leader Zelenskyy at White House on Friday",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108202884-17586489492025-09-23t173055z_673270572_rc2txgaekh8q_rtrmadp_0_un-assembly-trump.jpeg?v=1758648992&w=1920&h=1080"
      ],
      "datePublished": "2025-10-13T18:08:26.000Z",
      "dateModified": "2025-10-13T18:08:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NASA unit JPL to lay off about 550 workers, citing restructure",
    "url": "https://www.cnbc.com/2025/10/13/nasa-jpl-layoffs.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108211447-1760382166893-gettyimages-1986209037-AFP_34HT3KB.jpeg?v=1760382260&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-13T20:02:01.000Z",
    "description": "The entrance to NASA's Jet Propulsion Laboratory in Pasadena, California, is seen on February 7, 2024. Robyn Beck | AFP | Getty ImagesThe Jet Propulsi",
    "body": "The entrance to NASA's Jet Propulsion Laboratory in Pasadena, California, is seen on February 7, 2024. Robyn Beck | AFP | Getty ImagesThe Jet Propulsion Laboratory unit of NASA said Monday that it will lay off about 550 employees — 11% of JPL's workforce — as part of a restructuring.The job cuts \"are not related to the current government shutdown,\" JPL Director Dave Gallagher said in a message to the unit that was posted on the lab's website.JPL is a research and development lab funded by NASA — the federal space agency — and managed by the California Institute of Technology.\"While not easy, I believe that taking these actions now will help the Lab transform at the scale and pace necessary to help achieve humanity's boldest ambitions in space,\" Gallagher wrote in a separate mekor to JPL employees and contractors.Gallagher, in the public announcement, noted that the reorganization of JPL began in July, and \"over the past few months, we have communicated openly with employees about the challenges and hard choices ahead.\"\"This week's action, while not easy, is essential to securing JPL's future by creating a leaner infrastructure, focusing on our core technical capabilities, maintaining fiscal discipline, and positioning us to compete in the evolving space ecosystem — all while continuing to deliver on our vital work for NASA and the nation,\" Gallagher wrote.Gallagher said that JPL employees will be notified of their status on Tuesday, and the \"new Lab structure ... will become effective Wednesday.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NASA unit JPL to lay off about 550 workers, citing restructure",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108211447-1760382166893-gettyimages-1986209037-AFP_34HT3KB.jpeg?v=1760382260&w=1920&h=1080"
      ],
      "datePublished": "2025-10-13T20:02:01.000Z",
      "dateModified": "2025-10-13T20:02:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The U.S. has stepped in with an extraordinary bailout of Argentina. Here's what it means",
    "url": "https://www.cnbc.com/2025/10/13/the-us-has-stepped-in-with-an-extraordinary-bailout-of-argentina-heres-what-it-means.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108202863-17586458482025-09-23t164306z_339157486_rc2sxgaetpbl_rtrmadp_0_un-assembly-trump.jpeg?v=1760366353&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-13T17:27:16.000Z",
    "description": "U.S. President Donald Trump shakes hands with Argentina's President Javier Milei during the 80th United Nations General Assembly, in New York City, Ne",
    "body": "U.S. President Donald Trump shakes hands with Argentina's President Javier Milei during the 80th United Nations General Assembly, in New York City, New York, U.S., Sept. 23, 2025.Alexander Drago | ReutersThe Treasury Department has extended a financial lifeline to Argentina in apparent hopes of heading off an emerging market financial crisis that could spread to U.S. shores.In a move that Treasury Secretary Scott Bessent announced Thursday on social media site X, the U.S. is providing a $20 billion currency swap line with Argentina's central bank — essentially exchanging stable U.S. dollars with volatile pesos.The move comes amid liquidity concerns in Argentina that threatened stability for the country as it faces key midterm elections.Providing the swap line \"marks a pivotal moment for Argentina's financial stability,\" Diego Celedon, head of equity strategy for the region at JPMorgan Chase, said in a client note. \"The U.S. support acts as a circuit breaker, halting the negative feedback loop that had threatened to deepen Argentina's economic strain.\"Economics, markets and politicsThere are equal parts economic and political stakes with the venture, which marks the first U.S. intervention of this nature since rescuing Mexico in 1995.While Argentina poses little systemic risk, it can still matter in terms of possible capital flight along with volatility in debt and commodity markets. That chance was deemed worth the risk of potential Argentinian default.\"Overall, the American intervention has transformed Argentina's short-term outlook, but the administration must now leverage its political capital to fully capitalize on this window of opportunity,\" Celedon wrote.The immediate market reaction was for the peso to appreciate sharply against the dollar Friday.However, an exchange-traded fund pegged to the country's industrial leaders, the Global X MSCI Argentina ETF, slumped Friday, indicating concerns that the American backstop may not be enough.\"It's unclear why the Trump administration is providing a de facto bailout of the Argentinian peso when there is no significant financial or economic relationship between the two economies,\" said Joseph Brusuelas, chief economist at RSM.\"It's entirely unclear to me that Argentina will not choose to devalue its peso after its election later this month,\" he added. \"Therein lies one of the greater risks of providing $20 billion Treasury supported swap line to Buenos Aires.\"In addition to economic and market matters, the U.S. has a significant political stake in what's happening in Argentina.Oct. 26 elections will determine the fate of President Javier Milei's government, which has become an important ally for the U.S. in the region. With investors jittery over global growth and election-year uncertainty, the bailout shows Washington is committed to keeping credit markets calm at home.Defending the dealIn his announcement of the deal, Bessent said it was in response to \"a moment of acute illiquidity\" and said the U.S. was in a unique position to help.He further mentioned the country's efforts at fiscal reform that \"will generate significant dollar-denominated exports and foreign exchange reserves.\"Still, the country's shaky fiscal history generated caution that the U.S. essentially could be throwing good money after bad as Argentina has a long history of defaulting on its debts.\"Milei has succeeded in sharply reducing inflation but has struggled to stabilize the peso's exchange rate against the dollar,\" said Lourdes Casanova, director of the Emerging Markets Institute at Cornell University. \"Given that currency trading is the largest financial market in the world ... no amount of reserves can single-handedly offset that pressure.\"The move also was met with criticism elsewhere, ranging from the soundness of the Argentinian political and economic system to the White House's use of the Exchange Stabilization Fund for the liquidity measure.\"While the government is 'shut down,' the Treasury Department officially started its bailout of Argentina,\" Rohit Chopra, director of the Consumer Financial Protection Bureau, said in a statement. \"We are now actively pumping dollars into Argentina in exchange for the country's plummeting peso, rather than helping people here at home.\"Bessent, though, said Milei's fiscal policies are \"sound\" and the success of the country is systemically important.Correction: This story has been updated to correct the name of the Exchange Stabilization Fund.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The U.S. has stepped in with an extraordinary bailout of Argentina. Here's what it means",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108202863-17586458482025-09-23t164306z_339157486_rc2sxgaetpbl_rtrmadp_0_un-assembly-trump.jpeg?v=1760366353&w=1920&h=1080"
      ],
      "datePublished": "2025-10-13T17:27:16.000Z",
      "dateModified": "2025-10-13T17:27:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Goldman Sachs agrees to acquire $7 billion VC firm Industry Ventures ",
    "url": "https://www.cnbc.com/2025/10/13/goldman-sachs-agrees-to-acquire-7-billion-vc-firm-industry-ventures-.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108016846-1729004196183-108016846-1722955743918-gettyimages-2165053438-DAVID_SOLOMON_INTERVIEW.jpg?v=1760386317&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-13T20:48:17.000Z",
    "description": "David Solomon, chief executive officer of Goldman Sachs Group Inc., during an interview for an episode of \"The David Rubenstein Show: Peer-to-Peer Con",
    "body": "David Solomon, chief executive officer of Goldman Sachs Group Inc., during an interview for an episode of \"The David Rubenstein Show: Peer-to-Peer Conversations\" in New York, US, on Tuesday, Aug. 6, 2024.Jeenah Moon | Bloomberg | Getty ImagesGoldman Sachs has agreed to acquire Industry Ventures, a venture capital firm with $7 billion in assets under supervision, according to a release from the investment bank.Goldman is paying $665 million in cash and equity, and up to $300 million more based on the firm's future performance through 2030, the bank said. The deal is expected to close in the first quarter of 2026.Goldman Sachs is making the acquisition to bolster its $540 billion alternatives investment platform, part of the self-identified \"growth engine\" of the investment bank. By identifying and making bets on startups, the venture capital firm can help Goldman create a pipeline of investments for its wealthy clients, as well as provide solutions to tech entrepreneurs.San Francisco-based Industry Ventures has helped pioneer aspects of the American VC market since its founding 25 years ago, according to Goldman CEO David Solomon.\"Industry Ventures' trusted relationships and venture capital expertise complement our existing investing franchises and expand opportunities for clients to access the fastest growing companies and sectors in the world,\" Solomon said in the release.\"By combining the global resources of Goldman Sachs with the venture capital expertise of Industry Ventures, we are uniquely positioned to serve the increasingly complex needs of entrepreneurs, private technology companies, limited partners, and venture fund managers,\" said Hans Swildens, founder and CEO of Industry Ventures.Industry Ventures has made more than 1,000 investments and said its annual performance was an internal rate of return of 18%.The bank said it expects that all 45 employees of the venture firm will join Goldman.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Goldman Sachs agrees to acquire $7 billion VC firm Industry Ventures ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108016846-1729004196183-108016846-1722955743918-gettyimages-2165053438-DAVID_SOLOMON_INTERVIEW.jpg?v=1760386317&w=1920&h=1080"
      ],
      "datePublished": "2025-10-13T20:48:17.000Z",
      "dateModified": "2025-10-13T20:48:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How Lego MRI scanner sets are reducing anxiety in children undergoing medical treatment",
    "url": "https://www.cnbc.com/2025/10/13/lego-mri-scanner-anxiety-sedation-children.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108210111-1760028697653-the_lego_mri_scanner_set__3_.png?v=1760028743&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-13T13:45:23.000Z",
    "description": "People depart a Lego store in Manhattan on August 29, 2024 in New York City. Spencer Platt | Getty ImagesIn July 2023, just two months after his mothe",
    "body": "People depart a Lego store in Manhattan on August 29, 2024 in New York City. Spencer Platt | Getty ImagesIn July 2023, just two months after his mother fought and won a battle against breast cancer, Sam Lane began to get sick.Sam underwent several rounds of testing, and the now 14-year-old finally received a diagnosis: a rare brain and spine cancer.\"They said 'cancer,' and before I started crying, I said, 'Dang it, I was going to guess that, but I didn't want it to be that bad,'\" Sam said.But at his lowest point, on a feeding tube and unable to walk, a nurse offered Sam a bright spot: She said she needed his help to build a Lego MRI scanner set for fellow patients at Boston Children's Hospital to play with and learn from.Sam's mom said she was \"blown away\" by the level of detail in the play set, made of specialized Lego bricks.\"I remember sitting there saying to him, 'Sammy, why don't you take a break? You've been working at that straight for some time,'\" Christina Lane said. \"And he just didn't even look at me and was like, 'Nope, this is important... I need to help other kids.'\"Lego's MRI scanner sets, which feature a scanner, patient bed, waiting room, staff figures and medical instruments, were designed specifically to help children learn about the procedure through hands-on play. The miniature MRI machine table moves back and forth, mimicking a real procedure.On Monday, the toy company announced that more than 1 million children globally have used the sets to help them prepare for their medical procedures. New Lego research found that 96% of healthcare professionals said the model helps to reduce children's anxiety, and 46% reported a lesser need to use sedation after the children played with the set.Lego MRI Scanner play setCourtesy: LegoMRIs, which don't involve radiation, are often used in pediatric care – but with the bright light, loud noises and requirement to stay still, the machines often frighten children and introduce the need for sedation, according to Sam's child life specialists, Laura Boegler and Alyssa Sachs.They focus on ways to support psychosocial and emotional wellbeing of patients and families at Boston Children's Hospital and said opportunities to play are key.\"We often say that play is a universal language, and so the play-based approach of being able to touch and ask questions really helps ease anxieties and misconceptions that any kids have,\" Sachs said.Boegler said having children play with the Lego set before their own MRI scans has significantly helped decrease anxiety and increase familiarity with the procedure.The set that Sam built is being used to ease other patients' worries in a way that feels authentic to them.\"An MRI machine, that's not something that kids are seeing in school, that's not what they're talking about at home, so it's kind of like this new scary thing,\" Boegler said. \"Using the MRI Lego set, we're able to show kids in a way that's comfortable for them.\"Lego doesn't sell the sets and instead has donated more than 10,000 of the kits to hospitals around the world.Over the past few years, Lego has worked on expanding its customer base and deepened its strategy to achieve a streak of positive annual growth. The company has begun to cater more to adults as well as kids with more sophisticated and bespoke kits, including a wide range of sets aligned with pop culture like \"Harry Potter\" to \"Wicked.\"The company's botanical and F1 racing sets, in particular, have brought new customers into the fold.Icons Tiny Plants by Lego.James Manning - Pa Images | Pa Images | Getty ImagesChristina Lane said the MRI play set her son built helped him feel connected to other children battling cancer.\"To have a little Lego buddy that they can identify with that is going through the same things that they are is really incredible,\" she said. \"As a mom, as a nurse, as a human being, to be able to support our kids during such a challenging and difficult time through play – truly, it's essential.\"And the set has even helped Sam in his own journey. Now celebrating over a year cancer-free, he reflected on how his relationship with the machines has changed.In his first MRI, Sam said he felt claustrophobic and scared, and the noises felt too loud for him to comprehend.But now, he has a simple and reliable strategy for all of his MRI sessions: \"I fall asleep.\"Correction: This story has been updated to correct details of Sam Lane's cancer diagnosis and treatment. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How Lego MRI scanner sets are reducing anxiety in children undergoing medical treatment",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108210111-1760028697653-the_lego_mri_scanner_set__3_.png?v=1760028743&w=1920&h=1080"
      ],
      "datePublished": "2025-10-13T13:45:23.000Z",
      "dateModified": "2025-10-13T13:45:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Retaliation or escalation? Trust between the U.S. and China is fading fast, analysts say",
    "url": "https://www.cnbc.com/2025/10/13/retaliation-or-escalation-trust-between-us-and-china-is-fading-fast.html",
    "image": "https://image.cnbcfm.com/api/v1/image/106677114-15983545702020-08-25t100023z_1719720997_rc2yki97n9wc_rtrmadp_0_usa-china-tech.jpeg?v=1692261559&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-13T10:11:08.000Z",
    "description": "Chinese and U.S. flags flutter near The Bund, before U.S. trade delegation meet their Chinese counterparts for talks in Shanghai, China July 30, 2019.",
    "body": "Chinese and U.S. flags flutter near The Bund, before U.S. trade delegation meet their Chinese counterparts for talks in Shanghai, China July 30, 2019.Aly Song | ReutersBEIJING — The flare-up in tensions between the U.S. and China over the weekend highlights the deepening mistrust dividing the world's two biggest economies.In the two days after Beijing ended its Golden Week holiday on Wednesday, the country announced a new framework for restricting rare earths exports, placed more U.S. companies on a blacklist and charged U.S.-linked ships with fees for docking at Chinese ports.U.S. President Donald Trump then threatened 100% more tariffs on Chinese goods, a move which was followed by Beijing asserting its rare earths restrictions are a \"legitimate\" measure.\"The root cause of the tension is due to a lack of mutual trust,\" Larry Hu, chief China economist at Macquarie, said in a note Monday.\"During the London talks in June, both countries agreed to a deal involving 'rare earth for tech,'\" he said. \"Unsurprisingly, both feel betrayed when they perceive the other as acting in bad faith.\"The escalation in trade tensions is a result of a \"misperception\" on both sides, Hu said. Here's how he and other analysts say both sides are seeing things differently.Beijing may feel it needs to respond to a new U.S. rule released on Sept. 29 which expands the scope of export controls to majority owned subsidiaries of companies on a U.S. list — while Washington likely saw the change as a technical adjustment.On the flip side, Beijing may see its rare earths restrictions as mimicking Washington's wide-reaching effort to restrict China's access to high-end tech, while the U.S. perception is that the restrictions are a negotiation strategy that aims to create leverage before a potential meeting between the two countries' presidents.watch nowU.S. chipmakers at riskThere's a clear impact for businesses, reflected in part by Friday's stock market sell-off.\"One rule in the new package requires that companies obtain a license from China's Commerce Ministry to export products manufactured anywhere in the world if that product contains Chinese rare earths worth at least 0.1% of the product's value,\" Gabriel Wildau, managing director at Teneo, said in a note Saturday. \"In theory, this rule could force companies like Nvidia, TSMC and Intel to obtain permission from Chinese regulators to sell their products inside the U.S.\"Wildau pointed out that \"this Chinese rule is modeled after the U.S. Commerce Department's own 'foreign direct product rule,' which imposes a license requirement on any product made with U.S. origin technology, no matter where the product is produced.\"Chinese stocks fell Monday following the U.S. stock market decline, although U.S. stock futures rebounded on hopes the tensions weren't as bad as initially feared.\"On the specific episode the market is focused on, the two sides may still return to the table to find a short-term fix. However, it won't be a lasting solution,\" said Jianwei Xu, senior economist for Greater China at Natixis. \"The trust between them is already gone.\"Trump has signaled he would meet with Chinese President Xi Jinping at the APEC meeting in South Korea at the end of October. China has yet to confirm or deny such plans.The view from within the Asian country is that the U.S. will maintain its pressure on China, even as the two countries' leaders are expected to meet, said Liu Weidong, research fellow at a state-affiliated think tank, the Chinese Academy of Social Sciences' Institute of American Studies.\"History has shown that U.S. pressure is ineffective, and will only lead to a more confrontational relationship between China and the U.S.,\" Liu said in comments translated by CNBC.He cast the latest rare earths restrictions as a demonstration of China's efforts to warn \"unfriendly\" foreign companies while welcoming others, and as an attempt to maintain bilateral stability through \"moderate and controlled countermeasures.\"Trump and Xi spoke over the phone last month, but have yet to meet in person since the U.S. leader began his term in January. Trump previously indicated that he might visit China next year, followed by Xi traveling to the U.S.The two countries are still negotiating since the effective dates for some of the announced measures are set for after the APEC summit in South Korea, said Nomura's Chief China Economist Ting Lu.\"Despite mounting tensions, there remain opportunities for diplomatic resolution, as the timeline creates a strategic buffer: Trump's tariff implementation, which is scheduled for 1 November, precedes Beijing's 1 December deadline for rare-earth export restrictions by a full month.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Retaliation or escalation? Trust between the U.S. and China is fading fast, analysts say",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/106677114-15983545702020-08-25t100023z_1719720997_rc2yki97n9wc_rtrmadp_0_usa-china-tech.jpeg?v=1692261559&w=1920&h=1080"
      ],
      "datePublished": "2025-10-13T10:11:08.000Z",
      "dateModified": "2025-10-13T10:11:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bloom Energy soars more than 20% on deal with Brookfield to put fuel cells in AI data centers",
    "url": "https://www.cnbc.com/2025/10/13/bloom-energy-shares-soar-after-striking-deal-with-brookfield-to-provide-fuel-cells-to-ai-data-centers.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107425286-1717694504966-gettyimages-1280224315-273078final.jpeg?v=1760356359&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-13T15:00:45.000Z",
    "description": "watch nowShares of Bloom Energy soared Monday after striking a deal with Brookfield Asset Management to install fuel cells in artificial intelligence ",
    "body": "watch nowShares of Bloom Energy soared Monday after striking a deal with Brookfield Asset Management to install fuel cells in artificial intelligence data centers.Brookfield will spend up to $5 billion to deploy Bloom Energy's technology, the first investment in its strategy to support big AI data centers with power and computing infrastructure. Bloom's fuel cells are \"fuel-flexible\" and can run on natural gas, biogas or hydrogen, the company says.Brookfield and Bloom are collaborating to design and build what they are calling \"AI factories\" around the the world, including a site in Europe that will be unveiled before the end of the year.Shares of Bloom Energy jumped more than 20%. Bloom's fuel cells provide on-site power that can be quickly installed because they don't rely on a connection to the electric grid.Bloom has already positioned hundreds of megawatts of fuel cells through deals with utilities including American Electric Power and data center developers such as Equinix and Oracle, according to the company.The AI industry's data center plans are growing in scale. Nvidia and OpenAI, for example, recently announced a partnership that aims to build 10 gigawatts of data centers, equivalent to the power consumed by New York City at the height of summer.But AI companies' plans are butting up against an aging U.S. electric grid that is often slow to provide additional power capacity. Data centers also threaten to raise electricity prices for residential customers.Deploying power solutions \"behind-the-meter,\" or off the grid, \"are essential to closing the grid gap for AI factories,\" said Brookfield's global head of AI infrastructure, Sikander Rashid, in a release announcing the deal.\"AI infrastructure must be built like a factory—with purpose, speed, and scale,\" Bloom Energy CEO KR Sridhar said in the release.Nvidia CEO Jensen Huang told CNBC last week that the artificial intelligence industry will need to build power off the electric grid to quickly meet demand and protect consumers from rising electricity prices.\"Data center self-generated power could move a lot faster than putting it on the grid and we have to do that,\" Huang said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bloom Energy soars more than 20% on deal with Brookfield to put fuel cells in AI data centers",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107425286-1717694504966-gettyimages-1280224315-273078final.jpeg?v=1760356359&w=1920&h=1080"
      ],
      "datePublished": "2025-10-13T15:00:45.000Z",
      "dateModified": "2025-10-13T15:00:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Wharton's Jeremy Siegel says it's 'scandalous' the U.S. doesn't have a rare earths reserve",
    "url": "https://www.cnbc.com/2025/10/13/siegel-says-its-scandalous-the-us-doesnt-have-a-rare-earths-reserve.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108078025-1734577115386-gettyimages-96217377-pdir0483Hi_j0247JPG.jpeg?v=1760364731&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-13T14:40:18.000Z",
    "description": "UNITED STATES - NOVEMBER 10: Jeremy Siegel, the Russell E. Palmer Professor of Finance at the Wharton School, addresses the Securities Industry Associ",
    "body": "UNITED STATES - NOVEMBER 10: Jeremy Siegel, the Russell E. Palmer Professor of Finance at the Wharton School, addresses the Securities Industry Association during their annual meeting in Boca Raton, Florida, Thursday, November 10, 2005. Matt Stroshane | Bloomberg | Getty ImagesChina's control over crucial rare earth materials has been a \"threat for a long time\" to Western supply chains and the U.S. should create a strategic reserve of the metals, University of Pennsylvania professor emeritus of finance Jeremy Siegel told CNBC's \"Squawk Box\" Monday.\"It's scandalous that we don't have a rare earth strategic reserve [and] that we let China monopolize 90% of refining rare earth materials,\" Siegel said. \"Where were we, realizing the importance of these?\"Siegel's strategic reserve proposal comes as the U.S.-China trade war intensified Friday, with President Donald Trump vowing to impose \"massive tariffs\" on Beijing in response to its limits on rare earth mineral exports to the U.S., and threatening to cancel a planned meeting with Chinese President Xi Jinping. Trump's announcement erased $2 trillion in value from the stock market.The U.S. created the Strategic Petroleum Reserve in 1975 in response to the 1973 Arab Oil Embargo. Today, almost three quarters of the world's rare earth minerals, used in everything from smartphones to fighter jets, are mined in China, which processes 90% of the metals, according to Bank of America analysts.\"Export controls could create a choke point in global supply chains,\" BofA global economist Claudio Irigoyen wrote Sunday in a note to clients.But Siegel said he's confident the U.S. and China will resolve their latest trade conflict before Trump's Nov. 1 deadline for more tariffs.   \"It'll be worked out, and it won't be too negative for either country,\" Siegel said. Trump's remarks were \"just a prelude to saying, 'All right there are our chips, we've got cards [and] you've got cards...and let's negotiate.'\"Siegel, author of 1994's Stocks for the Long Run, said the November 1 deadline is actually a sign that Trump hopes to negotiate with his Chinese counterpart. \"Trump said 100% [tariffs] but he said, 'Listen, I said the November 1 date, which for me is like forever,'\" Siegel said. \"It's actually the farthest date he's ever set for the start of a tariff, which means he wants to have that solved.\" Siegel added that the market will likely snap back following trade talks between Washington D.C. and Beijing. The S&P 500 is about 1.2% higher in early trading Monday after crumbling 2.7% on Friday.\"Once it's resolved, given all the other good things that are happening, I see no reason why we can't continue on to new highs,\" Siegel said.The S&P 500 is regaining some 40% of its Friday losses early Monday, while the Nasdaq Composite has climbed about 2% as technology stocks rebound from last week's retreat. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Wharton's Jeremy Siegel says it's 'scandalous' the U.S. doesn't have a rare earths reserve",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108078025-1734577115386-gettyimages-96217377-pdir0483Hi_j0247JPG.jpeg?v=1760364731&w=1920&h=1080"
      ],
      "datePublished": "2025-10-13T14:40:18.000Z",
      "dateModified": "2025-10-13T14:40:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Quantum stocks surge after JPMorgan investing push into strategic tech",
    "url": "https://www.cnbc.com/2025/10/13/quantum-stocks-jpmorgan-investing-push.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107300946-1694709033004-gettyimages-1347310377-79.jpeg?v=1760368287&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-13T20:35:02.000Z",
    "description": "Quantum computing background concept.Blackdovfx | E+ | Getty ImagesThe rally in quantum computing names continued on Monday after JPMorgan Chase annou",
    "body": "Quantum computing background concept.Blackdovfx | E+ | Getty ImagesThe rally in quantum computing names continued on Monday after JPMorgan Chase announced it as one of the areas it would invest in as part of a new initiative.The bank said in a release that it would invest up to $10 billion in companies across four areas: supply chain and advanced manufacturing, defense and aerospace, energy technology, and frontier and strategic technologies — which includes quantum computing.Arqit Quantum shares closed up 20%, while D-Wave Quantum ended 23% higher and Rigetti Computing gained 25%. IONQ climbed 16%, and Quantum Computing stock gained 12%.\"It has become painfully clear that the United States has allowed itself to become too reliant on unreliable sources of critical minerals, products and manufacturing – all of which are essential for our national security,\" said CEO Jamie Dimon in a statement.Read more CNBC tech newsDutch government takes control of Chinese-owned chipmaker Nexperia in 'highly exceptional' moveXiaomi shares see biggest drop since April after fatal EV crash sparks safety concernsNavan sets price range for IPO, expects market cap of up to $6.5 billionWe tested OpenAI's Sora 2 video generator to find out why Hollywood is freaking outThe initiative is part of a larger $1.5 trillion, decade-long plan, dubbed the \"Security and Resiliency Initiative,\" to finance and invest in industries JP Morgan deems critical to U.S. national and economic security.As one of the 27 specified sub-areas the bank will be focusing on, quantum computing has seen gains as much as triple digits over the past month. Rigetti and D-Wave were up 175% and 130%, respectively.Tech companies like Google, Microsoft, and Amazon have shown significant interest in gate-model quantum computing, which can potentially solve problems too complex for standard computers.Rigetti and IONQ quantum computers are accessible through Amazon Braket, a quantum computing service managed by Amazon Web Services.In February, Microsoft unveiled its first quantum computing chip called Majorana 1, and Google announced its new breakthrough quantum chip named Willow late last year.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Quantum stocks surge after JPMorgan investing push into strategic tech",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107300946-1694709033004-gettyimages-1347310377-79.jpeg?v=1760368287&w=1920&h=1080"
      ],
      "datePublished": "2025-10-13T20:35:02.000Z",
      "dateModified": "2025-10-13T20:35:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Big Oil forced to confront some tough choices as 'monster profits' fade into memory",
    "url": "https://www.cnbc.com/2025/10/13/big-oil-to-confront-tough-choices-as-mega-profits-fade-into-memory.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108209247-1759924968878-gettyimages-2185490902-vcg111531345988.jpeg?v=1759925062&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-13T07:47:40.000Z",
    "description": "Oil pumpjacks operate at Daqing Oilfield at sunset on November 18, 2024 in Daqing, Heilongjiang Province of China.Vcg | Visual China Group | Getty Ima",
    "body": "Oil pumpjacks operate at Daqing Oilfield at sunset on November 18, 2024 in Daqing, Heilongjiang Province of China.Vcg | Visual China Group | Getty ImagesEnergy supermajors are being forced to confront some tough choices in a weaker crude price environment, with generous shareholder payouts expected to come under serious pressure over the coming months.U.S. and European oil majors, including Exxon Mobil, Chevron, Shell and BP, have moved to cut jobs and reduce costs of late, as they look to tighten their belts amid an industry downturn.It reflects a stark change in mood from just a few years ago.In 2022, the West's five biggest oil companies raked in combined profits of nearly $200 billion when fossil fuel prices soared following Russia's full-scale invasion of Ukraine.Flush with cash, the likes of Exxon Mobil, Chevron, Shell, BP and TotalEnergies sought to use what U.N. Secretary-General António Guterres described as their \"monster profits\" to reward shareholders with higher dividends and share buybacks.Indeed, the amount of cash returns as a percentage of cash flow from operations (CFFO) has climbed to as much as 50% for several energy companies in recent quarters, according to Maurizio Carulli, global energy analyst at Quilter Cheviot.It's better to cut buybacks than dividends: For investors, buybacks are gravy, but dividends are the meat.Clark Williams-DerryEnergy finance analyst at IEEFAIn today's environment of weaker crude prices, however, Carulli said this policy risks taking on new levels of debt beyond what could be considered a \"healthy\" balance sheet.BP and, more recently, TotalEnergies have announced plans to take steps to reduce shareholder returns.BP in April lowered its share buyback to $750 million, down from $1.75 billion in the prior quarter, after reporting first-quarter profit which fell short of market expectations. TotalEnergies, for its part, said late last month that it had decided to adjust the pace of its share buybacks \"in order to face economic and geopolitical uncertainties and to retain room to maneuver.\"Quilter Cheviot's Carulli described these moves as a \"sensible change in direction,\" noting that other oil majors will likely follow suit.Thomas Watters, managing director and sector lead for oil and gas at S&P Global Ratings, echoed this sentiment.Oil refinery at sunrise: an aerial view of industrial power and energy production.Chunyip Wong | E+ | Getty Images\"Oil companies are under pressure as crude prices soften, with the potential for prices to fall into the $50 range next year as OPEC continues to release surplus capacity and global inventories build,\" Watters told CNBC by email.\"Faced with the challenge of sustaining these returns in a lower-price environment, many will look to reduce costs and capital spending where they can,\" he added.Dividend cuts 'would send shivers through Wall Street'Clark Williams-Derry, energy finance analyst at the Institute for Energy Economics and Financial Analysis (IEEFA), a non-profit organization, said trimming the share buybacks is likely Big Oil's easiest option.\"Over the past few years, oil companies have used buybacks to return cash to investors and prop up share prices. And it's better to cut buybacks than dividends: For investors, buybacks are gravy, but dividends are the meat,\" Williams-Derry told CNBC by email.\"A cut in a dividend would send shivers through Wall Street,\" Williams-Derry said.Saudi Arabia's state oil producer Saudi Aramco did just that earlier in the year, slashing the world's biggest dividend amid an uncertain outlook for oil prices.Stock Chart IconStock chart iconBrent crude futures year-to-date.IEEFA's Williams-Derry linked the move to a steady weakening of the Saudi Aramco's share price through most of this year, noting that other private oil majors will want to avoid the same fate.Ultimately, Williams-Derry said oil majors likely have three questions to consider now that the Ukraine boom in oil prices has faded.\"Do they keep taking on new debt to fund their shareholder payouts? Do they slash buybacks, eliminating one of the major factors propping up share prices? Or do they cut back on drilling, signaling weaker production in the future?\" Williams-Derry said.\"There are risks to each choice, and no matter what they choose they're bound to make some investors unhappy,\" he added.Big Oil outlookFor some, Big Oil's current state of play is not nearly as bad as it might have been.\"It perhaps hasn't been as gloomy as people expected earlier in the year, because you've had this narrative, really since the announcement of Trump's tariffs back in April, that the oil market was meant to go into a glut and a period of oversupply later in the year,\" Peter Low, co-head of energy research at Rothschild & Co Redburn, told CNBC by video call.\"What's actually surprised people is how resilient oil prices have been because they have stayed in that $65 to $70 a barrel range, more or less,\" he added.Read moreOil prices have since slipped below this range.International benchmark Brent crude futures with December expiry traded 1.4% higher at $63.61 per barrel on Monday, while U.S. West Texas Intermediate futures with November expiry rose 1.4% to trade at $59.77.\"The question, probably less for 3Q and perhaps more for 4Q, is really to what extent distributions and buybacks in particular might need to be to cut to reflect a weaker commodity price environment,\" Low said.\"I think given that 3Q was OK, they will probably wait to see what happens in the coming weeks and months and 4Q would be a more natural point for them to revisit shareholder distributions,\" he added.TotalEnergies and Britain's Shell are both scheduled to report third-quarter earnings on Oct. 30, with Exxon Mobil and Chevron set to follow suit on Oct. 31. BP is poised to report its quarterly results on Nov. 4.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Big Oil forced to confront some tough choices as 'monster profits' fade into memory",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108209247-1759924968878-gettyimages-2185490902-vcg111531345988.jpeg?v=1759925062&w=1920&h=1080"
      ],
      "datePublished": "2025-10-13T07:47:40.000Z",
      "dateModified": "2025-10-13T07:47:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "China chipmaker WingTech plunges 10% after Dutch government takes control of subsidiary Nexperia",
    "url": "https://www.cnbc.com/2025/10/14/asia-pacific-markets-set-to-open-lower-as-new-china-port-fees-on-us-ships-kick-in-.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107171168-1672097408734-gettyimages-1401627252-vcg111386428608.jpeg?v=1677629081&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-14T02:33:17.000Z",
    "description": "Shanghai-listed shares of Chinese chipmaker Wingtech plunged 10% at the open on Tuesday, hitting the daily limit for a second straight session after t",
    "body": "Shanghai-listed shares of Chinese chipmaker Wingtech plunged 10% at the open on Tuesday, hitting the daily limit for a second straight session after the Dutch government took control of its Netherlands-based subsidiary firm Nexperia.The Netherlands' Minister of Economic Affairs revealed on Oct. 12 that the decision, made under the \"Goods Availability Act\" on the company in September, was intended \"to prevent a situation in which the goods produced by Nexperia (finished and semi-finished products) would become unavailable in an emergency.\"Nexperia specializes in the high-volume production of chips used in automotive, consumer electronics and industrial products, making it vital for maintaining Europe's technological supply chains.In South Korea, the benchmark Kospi index added 1.01% to hit an all-time high of 3,646.67. The construction and mining sectors led gains on the index, with Korea Zinc up 17.95%, and Tongyang Inc soaring 17.49%.Shares of LG Energy Solution soared over 7%, rallying for a second straight session after the battery maker estimated its third-quarter operating profit will rise 34%, boosted by U.S. demand for electric vehicles ahead of a Sept. 30 phaseout of government incentives.Samsung Electronics advanced 2.47% after the company projected a 32% rise in third-quarter profit year on year, at about 12.1 trillion Korean won ($8.48 billion), beating LSEG SmartEstimates of 10.1 trillion won.Meanwhile, the small-cap Kosdaq rose 0.84%.Japan's benchmark Nikkei 225 index declined 1.34%, while the Topix lost 1.31%.SoftBank's shares fell over 5% after its subsidiary, British chip designer Arm, was working with OpenAI on its deal with Broadcom, according to tech publication The Information. On Monday stateside, OpenAI and Broadcom made their partnership official to build and deploy 10 gigawatts of artificial intelligence accelerators starting late next year.Australia's ASX/S&P 200 was flat.Hong Kong's Hang Seng Index opened 0.75% higher, while the Hang Seng Tech Index added 0.9%. Mainland China's CSI 300 advanced 0.87%.Singapore's economy grew 2.9% in the third quarter, preliminary government data showed Tuesday, faster than the 1.9% expected by economists polled by Reuters. The economy expanded by 4.4% in the second quarter.U.S. equity futures were little changed in early Asian hours. On Monday stateside, the key benchmarks recovered a significant chunk of their losses suffered last week after U.S. President Donald Trump softened his stance on China.Following a slew of tit-for-tat trade restrictions and heated exchanges, Trump said \"Don't worry about China, it will all be fine!\" in a Truth Social post Monday.China has slapped fees on U.S. ships for docking at its ports, in retaliation for similar charges imposed by Washington on Chinese ships. Both fees are scheduled to kick in Tuesday.Overnight, the Dow Jones Industrial Average closed higher by 587.98 points, or 1.29%, to 46,067.58, which equates to 67% of its Friday loss. The S&P 500 rose 1.56% to finish at 6,654.72, retracing 56% of its prior decline. The Nasdaq Composite popped 2.21% to settle at 22,694.61 as beaten-down technology stocks led the bounce.— CNBC's Dylan Butts, Alex Harring, Sarah Min and Fred Imbert contributed to this report.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "China chipmaker WingTech plunges 10% after Dutch government takes control of subsidiary Nexperia",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107171168-1672097408734-gettyimages-1401627252-vcg111386428608.jpeg?v=1677629081&w=1920&h=1080"
      ],
      "datePublished": "2025-10-14T02:33:17.000Z",
      "dateModified": "2025-10-14T02:33:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Oracle CEO Magouyrk: 'Of course' OpenAI can pay $60 billion per year for cloud infrastructure",
    "url": "https://www.cnbc.com/2025/10/13/oracle-ceo-magouyrk-of-course-openai-can-pay-60-billion-per-year.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108211335-1760372227610-ClayMagouryrk-1.jpg?v=1760372374&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-13T20:00:52.000Z",
    "description": "Oracle CEO, Clay Magouyrk, sits down with CNBC’s David Faber on Oct. 13, 2025. CNBCOracle CEO Clay Magouyrk, one of the two people tapped last month t",
    "body": "Oracle CEO, Clay Magouyrk, sits down with CNBC’s David Faber on Oct. 13, 2025. CNBCOracle CEO Clay Magouyrk, one of the two people tapped last month to lead the software company, is confident that OpenAI will be able to cover the costs of the massive amount of cloud infrastructure services it consumes.In an interview with CNBC's David Faber at Oracle's AI World conference on Monday, Magouyrk said \"of course\" OpenAI can pay $60 billion for a year's worth of cloud resources. In July, OpenAI agreed to a five-year deal with Oracle that's worth more than $300 billion.\"Just look at the rate at which they've grown to, you know, almost a billion users. That's just unheard of,\" said Magouyrk, who sat alongside fellow Oracle CEO Mike Sicilia for the interview in Las Vegas.OpenAI said last week that its flagship ChatGPT chatbot, which was publicly launched less than three years ago, now has 800 million weekly active users. In 2024, OpenAI recorded a $5 billion net loss.Sicilia said Oracle has started integrating OpenAI artificial intelligence models into a patient portal for viewing electronic health records. Oracle acquired EHR vendor Cerner for about $28 billion in 2022.\"I've seen the results, and I really do think that they're going to have a dramatic impact on industries, on enterprises of all types,\" Sicilia said of OpenAI.OpenAI rents out Nvidia graphics chips to run models through Oracle, as well as CoreWeave, Google and Microsoft. At the same time, the company is designing a custom AI processor that Broadcom will build. Earlier on Monday, Broadcom and OpenAI said they will jointly deploy 10 gigawatts worth of the new OpenAI chips.Building out that much infrastructure requires a hefty amount of new energy.\"I think it's a factor of time, not a factor of if we'll have enough power,\" Sicilia said.Oracle shares rose 5% on Monday. The stock has gained 84% this year, lifting Oracle's market cap close to $900 billion.WATCH: Oracle CEO Magouyrk: ‘Of course’ OpenAI can pay $60 billion per yearwatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Oracle CEO Magouyrk: 'Of course' OpenAI can pay $60 billion per year for cloud infrastructure",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108211335-1760372227610-ClayMagouryrk-1.jpg?v=1760372374&w=1920&h=1080"
      ],
      "datePublished": "2025-10-13T20:00:52.000Z",
      "dateModified": "2025-10-13T20:00:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Broadcom's chip president says mystery $10 billion customer isn't OpenAI",
    "url": "https://www.cnbc.com/2025/10/13/broadcom-mystery-customer-openai.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108080298-1735318902300-gettyimages-2190940916-avils-notitle241227_npkKT.jpeg?v=1760315307&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-13T17:39:45.000Z",
    "description": "Jaque Silva | Nurphoto | Getty ImagesCharlie Kawwas, president of the semiconductor solutions group at Broadcom, on Monday said that OpenAI is not the",
    "body": "Jaque Silva | Nurphoto | Getty ImagesCharlie Kawwas, president of the semiconductor solutions group at Broadcom, on Monday said that OpenAI is not the mystery $10 billion customer that it announced during its earnings call in September.Kawwas appeared on CNBC's \"Squawk on the Street\" with OpenAI's president, Greg Brockman, to discuss their plans to jointly build and deploy 10 gigawatts of custom artificial intelligence accelerators.The deal was largely expected after analysts were quick to point to OpenAI as Broadcom's potential new $10 billion partner. But after the companies officially unveiled their plans on Monday, Kawwas said OpenAI does not fit that description.\"I would love to take a $10 billion [purchase order] from my good friend Greg,\" Kawwas said. \"He has not given me that PO yet.\"Broadcom did not immediately respond to CNBC's request for additional comment.Read more CNBC tech newsDutch government takes control of Chinese-owned chipmaker Nexperia in 'highly exceptional' moveXiaomi shares see biggest drop since April after fatal EV crash sparks safety concernsNavan sets price range for IPO, expects market cap of up to $6.5 billionWe tested OpenAI's Sora 2 video generator to find out why Hollywood is freaking outOpenAI has been on an AI infrastructure deal-making blitz as the company looks to scale up its compute capacity to meet anticipated demand. The startup, which is valued at $500 billion, has inked multibillion-dollar agreements with Advanced Micro Devices, Nvidia and CoreWeave in recent weeks.Broadcom does not disclose its large web-scale customers, but analysts have pointed to Google, Meta and TikTok parent ByteDance as three of its large clients. During its quarterly call with analysts in September, Broadcom CEO Hock Tan said a fourth large customer had put in orders for $10 billion in custom AI chips.The order increased Broadcom's forecast for artificial intelligence revenue next year, which is when shipments will begin, Tan said during the call.OpenAI and Broadcom have been working together for the last 18 months, and they will begin deploying racks of custom-designed chips starting late next year, the companies said Monday. The project will be completed by 2029.\"By building our own chip, we can embed what we've learned from creating frontier models and products directly into the hardware, unlocking new levels of capability and intelligence,\" Brockman said in a release.WATCH: Broadcom president Charlie Kawwas: Mystery $10 billion customer isn’t OpenAIwatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Broadcom's chip president says mystery $10 billion customer isn't OpenAI",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108080298-1735318902300-gettyimages-2190940916-avils-notitle241227_npkKT.jpeg?v=1760315307&w=1920&h=1080"
      ],
      "datePublished": "2025-10-13T17:39:45.000Z",
      "dateModified": "2025-10-13T17:39:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'Long and painful nightmare' is over, Trump says, on historic day for the Middle East",
    "url": "https://www.cnbc.com/2025/10/13/the-war-is-over-trump-says-on-a-historic-day-for-the-middle-east.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108211150-1760355954920-gettyimages-2240416767-ISRAEL-PALESTINIANSTRUMP.jpeg?v=1760355980&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-13T14:34:32.000Z",
    "description": "U.S. President Donald Trump gestures as he disembarks from Air Force One upon arrival at Ben Gurion Airport on the outskirts of Lod near Tel Aviv on O",
    "body": "U.S. President Donald Trump gestures as he disembarks from Air Force One upon arrival at Ben Gurion Airport on the outskirts of Lod near Tel Aviv on October 13, 2025, as he travels to Israel and Egypt.         Saul Loeb | Afp | Getty ImagesU.S. President Donald Trump on Monday declared the war in the Middle East is over, as he embarked on a trip to the region to finalize a peace deal for Gaza.Trump arrived in Tel Aviv earlier Monday to mark the release of Israeli hostages by Hamas after more than two years in captivity.Arriving at the Israeli parliament where he was set to address lawmakers, Trump told reporters that Hamas will disarm, according to comments reported by Reuters. When asked whether the war was over, he told reporters \"yes.\"Greeted with a trumpet fanfare, standing ovation and cheers in the Knesset, Trump delivered a speech in which he said that the \"long and painful nightmare\" was finally over for both the Israelis and Palestinians. Trump said America joined its ally in two \"everlasting vows\": \"Never forget, and never again.\"Signaling a conciliatory mood, the president said the ceasefire was \"a very exciting time for Israel and the Middle East\" and noted Israel had won all it could \"by force of arms.\" It was time, he insisted, to turn those efforts into peace and prosperity.watch nowThe president called for a peace deal with Iran and said the hand of friendship and cooperation was always open, \"even to Iran, whose regime has inflicted so much death on the Middle East.\"\"I'm telling you, they want to make a deal,\" Trump said, adding: \"We are ready when you are.\"Iran is the main foreign backer of Hamas, whose attack on Israel on Oct. 7 2023 saw 1,200 people killed and hundreds taken hostage.Israel's response and the ensuing war has left more than 67,000 Palestinians dead, including thousands of civilians, according to Gaza's Health Ministry. Gaza itself has been largely destroyed with most buildings in ruins.\"You've won and now you can build and you can do something you never even thought possible,\" Trump said, encouraging Israel to focus on and commit to long-lasting peace efforts.U.S. President Donald Trump addresses the Knesset, Israel's parliament, on October 13, 2025 in Jerusalem. Pool | Getty Images News | Getty ImagesHe also repeatedly returned to the theme of rebuilding and reconstruction, telling the Knesset that the \"total focus of Gazans must be on restoring the fundamentals of stability, safety, dignity and economic development.\" Trump said the U.S. intended to help them in this cause.The U.S. president praised Israeli Prime Minister Benjamin Netanyahu and military chiefs, as well as Arab countries who have helped to broker a ceasefire. He also praised the efforts of his senior officials and advisors, including Middle East envoy Steve Witkoff, Secretary of State Marco Rubio, son-in-law Jared Kushner and Pete Hegseth.Twenty Israeli hostages are expected to be released in total on Monday, as well as 28 additional captives — including 26 confirmed dead and two whose status remains uncertain. In exchange for the hostages, Israel is due to release almost 2,000 Palestinian prisoners and detainees.Released Israeli hostage Eitan Abraham Mor gestures to well wishers upon arriving at Beilinson Hospital in the Rabin Medical Centre in Petah Tikva in central Israel on October 13, 2025. Menahem Kahana | Afp | Getty ImagesTrump will address the Israeli parliament after meeting with hostage families. He is then due to travel to Sharm El-Sheikh in Egypt for a major international summit with around 20 other world leaders to finalize an agreement to end the war in Gaza.Read moreThe first phase of Trump's peace deal for Gaza and the release of Israeli hostages is being hailed as a great humanitarian and geopolitical development, but one with a limited economic impact.\"It shows that the U.S. can get results if it wields its still unsurpassed global clout the right way,\" Holger Schmieding, chief economist at Berenberg Bank noted Monday.\"The impact on the global economy and markets should remain very limited, though. If the Houthis stop disrupting shipping through the Red Sea, global transport costs may fall slightly. If tensions in the Middle East subside much further, the global impact could be more pronounced in the long run – but that remains a very big if,\" Schmieding noted.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Long and painful nightmare' is over, Trump says, on historic day for the Middle East",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108211150-1760355954920-gettyimages-2240416767-ISRAEL-PALESTINIANSTRUMP.jpeg?v=1760355980&w=1920&h=1080"
      ],
      "datePublished": "2025-10-13T14:34:32.000Z",
      "dateModified": "2025-10-13T14:34:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Government shutdown: Vance says 'fraud' is rife in ACA tax credits use",
    "url": "https://www.cnbc.com/2025/10/12/government-shutdown-vance-aca-democrats.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108210956-17602936132025-09-30t180203z_664279610_rc2f2havsy2d_rtrmadp_0_usa-trump.jpeg?v=1760293657&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-12T18:28:05.000Z",
    "description": "U.S. Vice President JD Vance looks on, on the day U.S. President Donald Trump announces a deal with Pfizer to sell drugs at lower prices, in the Oval ",
    "body": "U.S. Vice President JD Vance looks on, on the day U.S. President Donald Trump announces a deal with Pfizer to sell drugs at lower prices, in the Oval office of the White House in Washington, D.C., on Sept. 30, 2025.Ken Cedeno | ReutersVice President JD Vance on Sunday said there is \"a lot of waste and fraud\" in Affordable Care Act tax credits that are at the center of Congress' funding stalemate that has shut down the government.\"The tax credits go to some people deservedly and we think the tax credits actually go to a lot of waste and fraud within the insurance industry,\" Vance said on CBS News' \"Face the Nation.\"\"We want to make sure that the tax credits go to the people who need them,\" he said.Congressional Democrats are demanding that any legislation to fund the government include an extension for enhanced Obamacare subsidies, which are set to expire at the end of this year. Republicans, meanwhile, want to pass a stopgap measure that would resume federal funding at current levels through Nov. 21.Both bills failed to pass in the Senate for a seventh time on Thursday, prolonging the federal shutdown that began on Oct. 1.With neither party budging on their respective demands, Republicans and Democrats both say the other party is to blame for the shutdown.About 22 million of the 24 million people enrolled in Obamacare health insurance plans sold on government marketplaces received enhanced ACA credits, which lower the cost of that insurance.The enhanced credits were introduced during the Covid pandemic in 2021. They raised the amount of financial aid to enrollees. and also made more middle-income enrollees eligible for the subsidies.The KFF health policy research group recently said that the average premium paid for an ACA plan would more than double in 2026 if the enhanced tax credits expire.Vance on Sunday accused Democrats of \"hostage taking,\" telling CBS News that there's \"a lot of willingness\" among moderate Democrats and the White House to negotiate and compromise.\"But if the far-left Democrats, led by Chuck Schumer, are going to shut down the government and refuse to open up the government unless they get everything they want, that's not a negotiation. That's a hostage taking, and we're not going to reward that kind of behavior from Washington, D.C.,\" Vance said.Earlier on Sunday, House Minority Leader Hakeem Jeffries, D-N.Y., said that Democrats \"have repeatedly made clear that we will sit down with anyone, anytime, anyplace.\"\"This is not about party. This is about the American people,\" Jeffries told \"Fox News Sunday.\"\"If Republicans continue to refuse to extend the Affordable Care Act tax credits, then tens of millions of people are about to experience dramatically increased premiums, copays and deductibles that will result in health insurance costs doubling or tripling or quadrupling,\" Jeffries said.He also called the Republican proposal a \"partisan, Republican spending bill\" and said that the current spending levels the Republican bill would resume are \"unacceptable.\"Fallout from the shutdown escalated in recent days after the Trump administration began mass layoffs of federal workers on Friday.President Donald Trump — who has repeatedly threatened to use the shutdown to cut programs popular among Democrats — said on Friday that the layoffs would be \"Democrat-oriented.\"Notices of permanent job cuts, formally known as \"Reductions in Force,\" were received by employees at the departments of Treasury, Health and Human Services, Commerce, Education, Energy, EPA, Homeland Security, Housing and Urban Development, and Interior.The Trump administration on Saturday reversed layoffs for workers at the Centers for Disease Control and Prevention, where hundreds of scientists received \"incorrect notifications\" that they were included in the mass layoffs, an official familiar with the matter told NBC News.The firings were caused by a \"glitch in the system,\" the official said. Affected CDC employees included those working on measles and Ebola outbreaks in the Democratic Republic of the Congo, and so-called disease detectives who work at the Epidemic Intelligence Service, a source with knowledge of the situation told NBC News.Asked about the reversed layoffs at the CDC, Vance told CBS News on Sunday that \"the government shutdown inevitably leads to some chaos\" and directed blame back to Senate Minority Leader Chuck Schumer, D-N.Y., and the Democrats.\"If Chuck Schumer and the far-left Senate Democrats are going to shut down the government, that is going to lead to some chaos,\" Vance said.— CNBC's Dan Mangan contributed to this story.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Government shutdown: Vance says 'fraud' is rife in ACA tax credits use",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108210956-17602936132025-09-30t180203z_664279610_rc2f2havsy2d_rtrmadp_0_usa-trump.jpeg?v=1760293657&w=1920&h=1080"
      ],
      "datePublished": "2025-10-12T18:28:05.000Z",
      "dateModified": "2025-10-12T18:28:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]