[
  {
    "title": "Travelers say these are the best U.S. airlines for on-time flights, customer satisfaction and more ",
    "url": "https://www.cnbc.com/2025/12/17/new-survey-travelers-say-these-are-the-best-us-airlines.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108015738-1722617710833-gettyimages-1534504690-funsobagonplane.jpeg?v=1729022914&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-17T17:50:49.000Z",
    "description": "In November, AirHelp, a service that helps airline passengers claim compensation for flight disruptions, released its annual ranking of the best U.S. ",
    "body": "In November, AirHelp, a service that helps airline passengers claim compensation for flight disruptions, released its annual ranking of the best U.S. airlines. To determine the ranking, the organization looked at on-time performance, claim processing and customer experience — analyzing data from October 1, 2024 to September 30, 2025. Each airline was given a score out of 10.According to the report, AirHelp considered an on-time flight to be \"any flight that arrived within 15 minutes of its published arrival time.\" For claim processing, the organization assessed each airline based on how they treat their customers when things go wrong. And for the customer experience category, passengers were asked to give their opinion on five factors: cabin crew, aircraft comfort, aircraft cleanliness, food and entertainment.To ensure AirHelp's database ranks among the most accurate available, the company says they cross-reference their statistics with a variety of sources, including airport databanks, flight-tracking vendors, and government agencies. 2025 was a challenging year for U.S. airlines, Eric Napoli, Chief Legal Officer at AirHelp, tells CNBC Make It. The government shutdown that lasted a little over a month, had a significant impact on air traffic and travel, he says.For example, on-time performance really took a hit, he says: \"We saw that operational challenge this year.\"According to Napoli, American, United, and Delta work fairly well with AirHelp to make sure that customers who file claims — flight cancellations, lost baggage — get paid. But it's still an area they can improve in, he adds. \"Different airlines have their own operational modes but with claims processing, they should make it less difficult for customers to actually claim what's due to them under law,\" he says.American Airlines is the best U.S. airline for on-time performance, customer satisfaction and moreWith a score of 7.64, American Airlines is the best U.S. airline, AirHelp says. On the company's global ranking, American Airlines came in at No. 11. The airline had a score of 7.1 for on-time performance, 8 for customer opinion and 7.8 for claim processing. Napoli says that American Airlines beat out both United Airlines and Delta Air Lines because it was better in one key category. \"They weren't as efficient and quick in claims processing as they were before, but they did outdo United Airlines,\" he says. \"They were able to get passengers their compensation quicker.\" American AirlinesGrant Baldwin | Getty ImagesAmerican is one of the world's largest airlines. It serves more than 300 destinations and operates a fleet of over 900 aircraft. The airline was a pioneer in loyalty programs, launching its frequent flyer program in 1979. American Airlines is also a founding member of the Oneworld alliance, which includes other partner airlines worldwide like British Airways, and Qatar Airways.The best U.S. airlines for on-time performance and moreAmerican Airlines – 7.64United Airlines – 7.54Delta Airlines – 7.46Frontier Airlines – 7.07Hawaiian Airlines –  6.73Southwest – 6.68Alaska Airlines – 5.95JetBlue – 5.31United Airlines is the No. 2 U.S. airline, according to AirHelp. It received a score of 7.54 and took 13th place in the global ranking. It got a score of 7.4 for on-time performance, 8.1 for customer opinion and 7.2 for claim processing. Napoli says United performed better than the rest in on-time performance and customer opinion, but ultimately fell short in the claim processing category.  United AirlinesBloomberg | Bloomberg | Getty ImagesUnited Airlines serves more than 350 destinations and is part of the Star Alliance. The global partnership includes other carriers like Lufthansa and Air Canada. In 2025, United added routes from Newark, New Jersey, and Tokyo, Japan, to new destinations like Nuuk, Greenland; Palermo, Italy and Ulaanbaatar, Mongolia, bringing its total international destinations served to 147, according to Britannica. Want to give your kids the ultimate advantage? Sign up for CNBC's new online course, How to Raise Financially Smart Kids. Learn how to build healthy financial habits today to set your children up for greater success in the future. Use coupon code EARLYBIRD for 30% off. Offer valid from Dec. 8 to Dec. 22, 2025. Terms apply.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Travelers say these are the best U.S. airlines for on-time flights, customer satisfaction and more ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108015738-1722617710833-gettyimages-1534504690-funsobagonplane.jpeg?v=1729022914&w=1920&h=1080"
      ],
      "datePublished": "2025-12-17T17:50:49.000Z",
      "dateModified": "2025-12-17T17:50:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "These are Americans' 3 biggest financial regrets in 2025: 'People are feeling trapped'",
    "url": "https://www.cnbc.com/2025/12/17/americans-biggest-financial-regrets.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108242043-1765828267587-gettyimages-1076802112-_smc9366gi.jpeg?v=1765828277&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-17T17:38:37.000Z",
    "description": "Many Americans are looking back on 2025 with regrets about money. Nearly 40% of adults say their biggest financial regret from this year is not saving",
    "body": "Many Americans are looking back on 2025 with regrets about money. Nearly 40% of adults say their biggest financial regret from this year is not saving enough money, according to a new survey of over 1,000 U.S. adults by Intuit Credit Karma. These are the three most common financial regrets from 2025:Not saving enough: 38%Emotional or impulse spending: 28% Too much credit card debt: 21%It's been a year of major economic events, including President Donald Trump's tariff agenda, Federal Reserve rate cuts, a record-long government shutdown and rising unemployment. And 2 in 3 survey respondents say macroeconomic conditions like inflation and tariffs impacted their spending habits.\"People are feeling [the stress] very deeply in 2025 and there are not signs of that letting up as we look forward into the new year,\" Courtney Alev, consumer financial advocate at Intuit Credit Karma, tells CNBC Make It.Around 73% of Americans say they are saving less for emergencies due to factors like rising prices and elevated interest rates, a recent Bankrate survey found. Additionally, around 24% of households report living paycheck to paycheck in 2025, up slightly from 2024, according to Bank of America Institute research. \"People are feeling trapped,\" says Joey Khoury, senior wealth advisor and partner at Mission Wealth. At the same time, the No. 1 habit Americans say they want to break in the new year is impulse buying, Credit Karma found, with 38% of respondents saying they want to curb the practice.Here's how experts say Americans can recover from their financial regrets and build better habits in 2026.Don't 'bury your head in the sand'One of the first steps to saving more is knowing your numbers — exactly how much money you bring in each month and how much you need to spend on essentials, Alev says. As a place to start, she suggests listing out your specific monthly bills and expenses, as well as your optional costs.\"Just seeing everything in one place brings clarity and calm, even if your situation isn't where you want it to be, at least then, you know,\" she says.Khoury agrees. \"I can always tell who's on top of their finances by asking them, what's their monthly spend rate and what's their savings rate,\" he says. \"It doesn't matter what the savings rate is. If it's low, if it's high, it doesn't matter. But the folks that know that are the folks that are paying attention.\"And paying attention is key, he adds. \"A lot of people would rather bury their head in the sand,\" because dealing with your finances can be stressful and accomplishing your goals will likely take time. Plus, the broader economic conditions out of your control may make saving more or paying off your debt increasingly difficult. \"But not paying attention to it only exacerbates the problem,\" Khoury says.'Automation is key'Another reason individuals may wind up ignoring their finances is if they figured out their spend rate once, but never updated it to factor in ongoing changes, like inflation, Khoury says.He recommends using a budgeting app or similar tool to automatically track your spending and make it easier to see where your money is going and how much you're spending in various categories. Over time, you'll be able to see if price increases or impulse buys are impacting your overall spending.\"Automation is key,\" Khoury says. \"You must automate as much of your budgeting as possible, because you're never going to sit down and comb through it on a regular frequency.\"From there, you'll be much better positioned to find areas where you can cut back, he says.Turn 'goals into systems'Alev recommends setting specific saving or spending goals and starting with \"one key priority.\" That could be maintaining your current credit card balance for a time period if paying it off entirely is too big of a goal or setting up automatic transfers to your savings account, even if it's a small amount, she says. \"It is so easy to just get paralyzed with overwhelm when you start thinking about all of the different ways that you could go to improve your financial situation, and that can really lead to you not making progress,\" she says. \"Turn those goals into systems and specific habits because that's what's gonna actually make that change stick.\" Want to give your kids the ultimate advantage? Sign up for CNBC's new online course, How to Raise Financially Smart Kids. Learn how to build healthy financial habits today to set your children up for greater success in the future. Use coupon code EARLYBIRD for 30% off. Offer valid from Dec. 8 to Dec. 22, 2025. Terms apply.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "These are Americans' 3 biggest financial regrets in 2025: 'People are feeling trapped'",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108242043-1765828267587-gettyimages-1076802112-_smc9366gi.jpeg?v=1765828277&w=1920&h=1080"
      ],
      "datePublished": "2025-12-17T17:38:37.000Z",
      "dateModified": "2025-12-17T17:38:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "November's inflation report is the first to be released after the shutdown. Here's what to expect",
    "url": "https://www.cnbc.com/2025/12/17/novembers-inflation-report-is-the-first-to-be-released-after-the-shutdown.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108241518-1766025278703-108241518-1765581890023-gettyimages-2251633512-anotherday162739108_ptc6y0zv.jpg?v=1766025302&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-17T23:52:25.000Z",
    "description": "People shop at a grocery store in Brooklyn on Dec. 12, 2025 in New York City.Spencer Platt | Getty ImagesWall Street is awaiting Thursday's release of",
    "body": "People shop at a grocery store in Brooklyn on Dec. 12, 2025 in New York City.Spencer Platt | Getty ImagesWall Street is awaiting Thursday's release of the November consumer price index report, as it will mark the first inflation reading investors will get since the end of the record-setting U.S. government shutdown last month.According to economists surveyed by Dow Jones, the report – which tracks the average change in prices people pay for a range of goods and services – is expected to show a 12-month inflation rate of 3.1%. When excluding food and energy, core CPI is forecast to post an annual rate of 3.0%.The Bureau of Labor Statistics has said the release \"will not include 1-month percent changes for November 2025 where the October 2025 data are missing,\" as the agency canceled the October inflation report in late November, weeks before the Federal Reserve's final meeting of the year. September's CPI data – the most recent CPI report to be published and only piece of economic data released during the shutdown – showed an annual reading of 3.0% for the headline and core measures.\"The psychological distinction between a two handle and a three handle is going to be paramount,\" José Torres, senior economist at Interactive Brokers, said in an interview with CNBC.While the consensus estimate shows the annual rate hitting the 3% threshold for the month, the senior economist is anticipating the headline and core readings to be lower than expected at 2.9% each, though he thinks that the range of possible outcomes for headline could be between that figure and 3.1%.If the report were to show a 2.9% reading, it could offer some positive momentum in stocks heading into 2026. In fact, Torres believes that such a number would clear the path for a so-called Santa Claus rally. He also thinks it would have an impact on the interest rate outlook for next year – a period during which the Fed projects one rate cut.\"It really would strengthen monetary policy easing expectations in the last inflation report – CPI report – of 2025 if we could keep inflation in the twos rather than it increasing up to the threes, because that'll allow more interest rate cuts next year,\" Torres added.Not a 'clean' reportWhile the release could help pave the way for a year-end rally, there would need to be other catalysts in store for that to happen, because others like Victoria Fernandez of Crossmark Global Investments don't see a 0.1 percentage point move in either direction as leading to some \"huge\" market reaction. She also thinks that Fed policymakers would still be in wait-and-see mode even with a 2.9% reading.\"I think it's going to be varied. This is not going to be a clean CPI number,\" the firm's chief market strategist said, citing the absence of month-over-month data as one factor and when exactly the BLS was able to begin collecting the November data as another.U.S. President Donald Trump signs the funding bill to end the U.S. government shutdown, at the White House in Washington, D.C., U.S., Nov. 12, 2025. Kevin Lamarque | ReutersPresident Donald Trump officially signed a funding bill into law on Nov. 12, reopening the government after 43 days of stoppage – the longest duration in U.S. history. That prompted the BLS to push back November's CPI report from its previously scheduled release date of Dec. 10.\"By the time the government actually opened and they started collecting data, we were almost halfway through the month of November, so you're only getting the last half of the month,\" Fernandez said. \"You have to start wondering, 'Is there some kind of a bias in terms of what prices do and how things work in the latter half of the month versus the beginning of a month?'\"Ultimately, the strategist thinks the overall theme will be that inflation is \"remaining high\" and that it's not making its way back towards 2% like some anticipate.\"We have a tremendous amount of uncertainty as to where we're going from here, because we have conflicting stories,\" Fernandez said. \"We can have weak trends in unemployment, weak household income, consumer spending weak, and then we can have the expectation of 14% earnings growth next year and strong revenues. All the puzzle pieces don't quite fit together.\"\"We just need more information before we can make a true statement as to what the long term is going to look like,\" she continued.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "November's inflation report is the first to be released after the shutdown. Here's what to expect",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108241518-1766025278703-108241518-1765581890023-gettyimages-2251633512-anotherday162739108_ptc6y0zv.jpg?v=1766025302&w=1920&h=1080"
      ],
      "datePublished": "2025-12-17T23:52:25.000Z",
      "dateModified": "2025-12-17T23:52:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Giving kids investments this holiday season? 3 accounts that can help you maximize your money",
    "url": "https://www.cnbc.com/2025/12/17/how-to-gift-investments-to-children.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108240757-1765476109344-gettyimages-1450616686-dsc08212.jpeg?v=1765476116&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-17T17:39:44.000Z",
    "description": "When buying holiday gifts for the children in your life this year, some experts say you may want to consider an additional gift, one that may last far",
    "body": "When buying holiday gifts for the children in your life this year, some experts say you may want to consider an additional gift, one that may last far longer than a new toy: an investment in the stock market.Giving investments can not only be a great way to start building savings for the child in your life, but it's a gift that can also help foster financial literacy, says Flavio Landivar, a certified financial planner and senior financial advisor at Evensky and Katz/Foldes Wealth Management in Coral Gables, Florida.\"Kids, even starting at age 4 to 7 years old, start understanding and can have some sort of conversations about money,\" Landivar says. Gifting a yearly investment \"can build a huge foundation for minors at any age.\"While most brokers require you to be 18 to buy and sell stock, parents, friends and other family members can open certain accounts on behalf of a minor. Before gifting, experts say to consider how much you can comfortably give, the tax rules involved and which account best fits your needs.How much to giftThe amount you choose to give should depend on your comfort level, Landivar says. In 2025 and 2026, the IRS allows you to gift up to $19,000 per recipient annually tax-free without using any of your allotted lifetime gift and estate tax exemption.You don't necessarily need to spend additional money either — you can gift an investment you already own, says Ashton Lawrence, a CFP and director and senior wealth advisor at Mariner Wealth Advisors in Greenville, South Carolina.\"You might want to start looking at what positions in your portfolio have large unrealized gains that you then can give off to someone else who might be at a lower tax bracket,\" Lawrence says. \"If they do happen to sell it, at least less is going to Uncle Sam than if you were to sell it.\"What types of investments to giftLandivar recommends giving broad-based index funds that track the S&P 500 or total stock market because of their low costs and long-term growth potential.\"We don't need to know which will be the best [performing] company in the future, because it's impossible to do that,\" Landivar says. \"Rather, we want to be able to participate in that growth in a general sense.\"Giving individual shares of a company may be valuable as well, Lawrence says — especially if it's a company they recognize like Walmart or Disney. Familiar brands make the concept of ownership more tangible for younger kids, and Lawrence says that can make a gift more exciting and help connect abstract financial ideas to businesses they already understand.However, if you decide to do this, use it as a teaching moment on the basics of stock ownership instead of tying the asset to performance, Lawrence says. 3 accounts you can use to gift an investment to a minor There are various types of investment accounts you can open on behalf of a child. To determine which one makes the most sense for you, experts say you can consult a trusted financial professional who can make personalized recommendations for your individual situation.Here are three available options and an overview of each's advantages.Custodial accountLandivar says the easiest way to get started is with a custodial account under the Uniform Gifts to Minors Act or Uniform Transfers to Minors Act. UGMAs and UTMAs are financial accounts adults can open and manage for a minor. When the child turns 18 or 21, depending on the state, full control of the account transfers to the beneficiary. The custodian manages the investments like a normal brokerage account, and the funds can be invested in stocks, bonds or other assets. UTMA accounts can hold a wider variety of assets including property, while UGMA accounts mainly hold cash and marketable securities.Although you may seed these accounts with gifts, once they start earning interest, capital gains and dividends, that unearned income is subject to kiddie tax rules. The first $1,350 of unearned income is tax-free. From there, it's taxed at the child's tax rate until it exceeds $2,700. At that point, the excess is typically taxed at the parent's tax rate, according to the IRS.529 planIf you want your gift to go specifically toward higher education, investing money in a 529 college savings account may be more advantageous from a tax perspective than a custodial account, Lawrence says.\"College isn't cheap; expenses are constantly going up,\" Lawrence says. \"529s are a great way to make those donations and save.\"A 529 account is a state-sponsored, tax-advantaged savings plan designed to help families pay for education. Anyone can open one and name a beneficiary — typically a child, grandchild or even yourself — with no income limits on contributors.Contributions are made with after-tax income, and the money grows tax deferred. Money can be withdrawn tax-free for qualified education expenses, including tuition, fees, books, supplies, required technology and room and board for eligible programs. These funds can be used for certain K-12 education expenses as well, such as tuition at eligible elementary or secondary schools.Remaining funds can be rolled into a Roth individual retirement account, transferred to another family member, used for student loan repayment or withdrawn outright. Some of these options are subject to specific rules and lifetime or annual limits, and taxes and penalties may apply if the money isn't used for qualified education expenses.Roth IRAIf your child has earned income — such as wages from an after school or summer job — Lawrence says contributing your gift toward a Roth IRA for them may be the most advantageous for the tax-free growth and future flexibility. A Roth IRA is a retirement account where you contribute money that has already been taxed. Once in the account, contributions grow tax-free and withdrawals made after age 59½ are generally tax-free. If opening an account for a minor, the account must be in the child's name, and typically a parent or guardian helps open and manage it until they are of age.Contributions, but not earnings, can be withdrawn at any time without taxes or penalties, making the account somewhat flexible. However, there are limits to how much you can contribute to a Roth IRA. The contribution limit is the lesser of the child's earned income or $7,000 in 2025 and $7,500 in 2026. \"When they do start pulling out from [a Roth IRA] later in life, in their retirement years, that's going to be huge for them,\" Lawrence says. \"You're not getting that same tax-free growth inside those custodial accounts.\"Want to give your kids the ultimate advantage? Sign up for CNBC's new online course, How to Raise Financially Smart Kids. Learn how to build healthy financial habits today to set your children up for greater success in the future. Use coupon code EARLYBIRD for 30% off. Offer valid from Dec. 8 to Dec. 22, 2025. Terms apply.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Giving kids investments this holiday season? 3 accounts that can help you maximize your money",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108240757-1765476109344-gettyimages-1450616686-dsc08212.jpeg?v=1765476116&w=1920&h=1080"
      ],
      "datePublished": "2025-12-17T17:39:44.000Z",
      "dateModified": "2025-12-17T17:39:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Instacart shares drop on report that FTC is probing company over AI pricing tool",
    "url": "https://www.cnbc.com/2025/12/17/instacart-sec-probe-pricing-tool.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108243337-1766014864766-gettyimages-2212100090-img_8801.jpeg?v=1766014932&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-18T01:23:59.000Z",
    "description": "Cheng Xin | Getty ImagesShares of grocery delivery service Instacart dropped about 7% in extended trading on Wednesday, following a report that said t",
    "body": "Cheng Xin | Getty ImagesShares of grocery delivery service Instacart dropped about 7% in extended trading on Wednesday, following a report that said the U.S. Federal Trade Commission has begun an investigation into the company's pricing practices.The FTC sent a civil investigative demand to Instacart, Reuters reported, citing unnamed people.\"The Federal Trade Commission has a longstanding policy of not commenting on any potential or ongoing investigations,\" the FTC told CNBC in a statement. \"But, like so many Americans, we are disturbed by what we have read in the press about Instacart's alleged pricing practice.\"A study released last week showed that prices for the same products in the same supermarkets that work with Instacart can vary by around 7%, which can result in over $1,000 in extra annual costs for customers. Instacart responded by saying that retailers determine prices listed in the app.In 2022, Instacart spent $59 million to acquire Eversight, a company specializing in artificial intelligence-driven pricing and promotions for retailers and consumer packaged goods. Instacart sought to \"create compelling savings opportunities for customers in real-time\" with Eversight, according to a regulatory filing.Instacart declined to comment on the investigation but said reporting has mischaracterized its pricing system.\"Much of what's been reported has mischaracterized how pricing works on Instacart,\" a company spokesperson said in an email. \"First, our retail partners control their pricing strategies, and we work with them to align their online and in-store pricing wherever possible. Second, these tests are not dynamic pricing nor surveillance pricing – prices on Instacart do not change in real time nor are they based on supply or demand, and we never use personal, demographic, or user-level behavioral data to set item prices. \"These tests are a form of randomized A/B testing, similar to the way retailers have long run pricing tests between different stores.\"Earlier on Wednesday, Robert Garcia, a U.S. House Democrat from California, sent a letter to Instacart CEO Chris Rogers asking for a report on how the company sets prices.\"It is unconscionable that corporations are adding to Americans' financial strain with algorithmic — and potentially surveillance — pricing,\" wrote Garcia, who is ranking member of the House Committee on Oversight and Government Reform.— CNBC's Annie Palmer contributed to this reportRead Reuters' full report here.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Instacart shares drop on report that FTC is probing company over AI pricing tool",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108243337-1766014864766-gettyimages-2212100090-img_8801.jpeg?v=1766014932&w=1920&h=1080"
      ],
      "datePublished": "2025-12-18T01:23:59.000Z",
      "dateModified": "2025-12-18T01:23:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Epstein accomplice Ghislaine Maxwell petitions to vacate sex crime conviction",
    "url": "https://www.cnbc.com/2025/12/17/ghislaine-maxwell-habeas-petition-jeffrey-epstein.html",
    "image": "https://image.cnbcfm.com/api/v1/image/106658693-1597158499056-abmax.jpg?v=1766007672&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-18T00:30:46.000Z",
    "description": "Ghislaine Maxwell on Sept. 20, 2013 in New York City.Laura Cavanaugh | Getty ImagesGhislaine Maxwell, who was found guilty of crimes related to procur",
    "body": "Ghislaine Maxwell on Sept. 20, 2013 in New York City.Laura Cavanaugh | Getty ImagesGhislaine Maxwell, who was found guilty of crimes related to procuring underage girls to be sexually abused by Jeffrey Epstein, filed a petition on Wednesday seeking to vacate her conviction, claiming \"substantial new evidence has emerged\" that undermines the case against her.Maxwell's long-shot habeas petition in U.S. District Court in Manhattan could, if approved, see the former British socialite released from the federal prison in Texas where she is serving a 20-year sentence.However, such petitions are routinely denied.The Supreme Court earlier this year declined to hear Maxwell's appeal of her conviction.Habeas petitions are, as a rule, the last option for an imprisoned person to void their convictions. Maxwell filed her petition \"pro se,\" or on her own, without a lawyer representing her in that effort.The petition comes two days before a congressionally mandated deadline for the Department of Justice to release its investigative files about Epstein and Maxwell.Maxwell says in her court filing that the new evidence she bases her application on \"emerged from related civil actions, Government disclosures, investigative reports, and documents demonstrating constitutional violations that undermined the fairness of her proceedings.\"The filing says her conviction must be vacated because a juror at her trial in 2021 \"gave false answers during voir dire\" — the jury selection process — \"concealing a history of sexual abuse directly relevant to \"issues at trial.\"\"Subsequent interviews, new evidence and sworn statements confirm intentional concealment and actual bias\" by that juror, the filing says.In her second stated point, Maxwell said prosecutors concealed a police detective's  grand-jury testimony, \"which conflicted with his trial testimony ... and undermined the Government's only evidence, a massage table,\" which had established an element required for jurors to convict her of two of the counts in the case.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Epstein accomplice Ghislaine Maxwell petitions to vacate sex crime conviction",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/106658693-1597158499056-abmax.jpg?v=1766007672&w=1920&h=1080"
      ],
      "datePublished": "2025-12-18T00:30:46.000Z",
      "dateModified": "2025-12-18T00:30:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tricolor CEO received a $6.25 million bonus weeks before company’s bankruptcy, prosecutors say",
    "url": "https://www.cnbc.com/2025/12/17/tricolor-ceo-bonus-bankruptcy-indictment.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108242891-1765977615868-gettyimages-2234195958-TRICOLOR_LENDER.jpeg?v=1765996700&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-17T18:49:59.000Z",
    "description": "Mexican and American flags attached to vehicles at a Tricolor dealership in Houston, Texas, Sept. 11, 2025.Mark Felix | Bloomberg | Getty ImagesThe CE",
    "body": "Mexican and American flags attached to vehicles at a Tricolor dealership in Houston, Texas, Sept. 11, 2025.Mark Felix | Bloomberg | Getty ImagesThe CEO of subprime auto firm Tricolor directed a deputy to send him $6.25 million in bonuses in August as fraudulent schemes propping up the company unraveled, U.S. prosecutors alleged.Daniel Chu, the CEO and founder of Tricolor, told Chief Financial Officer Jerome Kollar to send the final two payments of his $15 million annual bonus on Aug. 19 and 20, according to a federal indictment unsealed on Wednesday.Chu, who is accused of engaging in \"systemic fraud\" over roughly seven years through 2025, used some of the money to buy a \"multimillion-dollar property\" in Beverly Hills, California, later that month, according to the filing.Within days of Chu's bonus payments, Tricolor put more than 1,000 employees on unpaid leaves of absence. By Sept. 10, the company filed for bankruptcy protection.Lawyers representing Chu didn't immediately respond to emails requesting comment on the allegations.Prosecutors say Tricolor created about $800 million in \"bogus collateral\" — at Chu's direction — by double-pledging the same assets for multiple loans and by having employees manually alter records to make delinquent loans appear eligible as collateral, according to the indictment. The abrupt collapse of Tricolor was one of a string of defaults that churned the U.S. banking industry this fall, sparking concerns over underappreciated risks in the American financial system.Around the time of the bonus payments, Chu allegedly knew his company was, in his own words, \"basically history,\" according to the filing.Prosecutors cited \"secretly recorded\" calls in August that included Chu, his CFO and chief operating officer where the founder cast about for ways to keep the company's lenders at bay.While the indictment didn't name the banks that Tricolor allegedly defrauded, JPMorgan Chase, Barclays and Fifth Third Bank have disclosed charges tied to the borrower.After Tricolor's lenders confronted Chu over questions about collateral pledged for loans, the CEO proposed a lie that some of the manipulated data was tied to a Trump administration loan deferment program, according to the indictment. He then considered another tactic: blaming the banks for ignoring red flags as a way to extract a settlement and keep his company alive, prosecutors said.In doing so, Chu allegedly compared Tricolor with Enron, the energy company that collapsed in 2001 after the discovery of accounting fraud.\"Enron obviously has a nice ring to it, right?\" Chu said, according to the documents. \"I mean, Enron, Enron raises the blood pressure of the lender when they see that.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tricolor CEO received a $6.25 million bonus weeks before company’s bankruptcy, prosecutors say",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108242891-1765977615868-gettyimages-2234195958-TRICOLOR_LENDER.jpeg?v=1765996700&w=1920&h=1080"
      ],
      "datePublished": "2025-12-17T18:49:59.000Z",
      "dateModified": "2025-12-17T18:49:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Oscars are heading to YouTube in 2029",
    "url": "https://www.cnbc.com/2025/12/17/youtube-stream-oscars-2029.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108109487-1740836575551-gettyimages-2201868046-AFP_36YU4CD.jpeg?v=1740836610&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-17T19:18:00.000Z",
    "description": "An Oscar statue is pictured at the red carpet of the 97th Annual Academy Awards at the Dolby Theatre in Hollywood, California on February 28, 2025. An",
    "body": "An Oscar statue is pictured at the red carpet of the 97th Annual Academy Awards at the Dolby Theatre in Hollywood, California on February 28, 2025. Angela Weiss | Afp | Getty ImagesThe 101st Academy Awards will be hosted on YouTube.The Academy of Motion Picture Arts and Sciences announced Wednesday it's signed a multiyear deal with the Google-owned service to stream the Oscars starting in 2029 and running through 2033. The exclusive rights deal includes red carpet coverage, behind-the-scenes content and access to the Governors Ball in addition to the telecast. The coverage of the Academy Awards will be available to YouTube TV subscribers in the U.S. and available for free on YouTube for viewers around the world, according to the announcement Wednesday.\"The Oscars are one of our essential cultural institutions, honoring excellence in storytelling and artistry,\" said Neal Mohan, CEO of YouTube, in a statement. \"Partnering with the Academy to bring this celebration of art and entertainment to viewers all over the world will inspire a new generation of creativity and film lovers while staying true to the Oscars' storied legacy.\" The Academy has a domestic partnership with Disney and ABC through 2028, which includes the 100th Oscars, set for 2028. It has an international partnership with Disney's Buena Vista International.Academy CEO Bill Kramer and Academy President Lynette Howell Taylor wrote in a joint statement the YouTube partnership will \"allow us to expand access to the work of the Academy to the largest worldwide audience possible — which will be beneficial for our Academy members and the film community.\" ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Oscars are heading to YouTube in 2029",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108109487-1740836575551-gettyimages-2201868046-AFP_36YU4CD.jpeg?v=1740836610&w=1920&h=1080"
      ],
      "datePublished": "2025-12-17T19:18:00.000Z",
      "dateModified": "2025-12-17T19:18:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "SoftBank leads decline in Japanese tech stocks as worries over AI spending spill over to Asia ",
    "url": "https://www.cnbc.com/2025/12/18/japan-tech-stocks-plunge-ai-infrastrutcure-softbank-samsung-sk-hynix.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108243357-1766021737886-gettyimages-2197342650-dsc07433_qrvvahai.jpeg?v=1766021768&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-18T02:32:16.000Z",
    "description": "TOKYO, JAPAN - FEBRUARY 03: SoftBank Group CEO Masayoshi Son delivers a speech during an event titled \"Transforming Business through AI\" in Tokyo, Jap",
    "body": "TOKYO, JAPAN - FEBRUARY 03: SoftBank Group CEO Masayoshi Son delivers a speech during an event titled \"Transforming Business through AI\" in Tokyo, Japan, on February 03, 2025. SoftBank and OpenAI announced that they have agreed a partnership to set up a joint venture for artificial intelligence services in Japan.Tomohiro Ohsumi | Getty Images News | Getty ImagesJapanese tech stocks took a tumble on Thursday as AI infrastructure spending worries on Wall Street crossed the ocean into the Asian markets, with AI-related stocks declining.Softbank Group Corp was among the top losers in the benchmark Nikkei 225, falling as much as 7.25%, with the index leading losses in Asia, down 1.23%. The group pared some losses and was last trading 3% lower.This decline comes as the tech-heavy Nasdaq Composite fell 1.81% overnight, dragged by losses in Oracle, Broadcom, Nvidia and other AI plays. The losses in Oracle came after the Financial Times reported on Wednesday that Blue Owl Capital's plans to finance the cloud infrastructure company's $10 billion Michigan data center had stalled. The company last week had refuted a report that said it had delayed some projects for AI major OpenAI to 2028.Tech-focused SoftBank has seen sharp volatility in its stock over the past month as fears over AI-related spending have gripped the market. At the start of the year, the group had revealed plans to invest $500 billion in AI infrastructure in the U.S. along with OpenAI, Oracle and other partners, and in September it announced five new U.S. AI data center sites under Stargate, OpenAI's overarching AI infrastructure platform.Stock Chart IconStock chart iconOther Japanese tech stocks also fell. Semiconductor equipment supplier Advantest, dropped as much as 5%. Counterparts Lasertec, Renesas Electronics and Tokyo Electron declined between 3% and 4%. Jesper Koll, expert director at Tokyo-based financial services firm Monex Group, said much of what goes into data centers, power centers, and AI hardware enablers is \"Made in Japan, and can only be made in Japan.\" That makes Japanese tech, especially AI-related stocks more vulnerable to any worries around U.S. tech spending.  On Wednesday, Japan's trade numbers showed that exports of electrical machinery jumped 7.4%, and semiconductor-related exports surged 13% year on year. Koll said the U.S.-led boom in tech spending was translating into growing exports of specialized machinery and equipment.Losses were less pronounced in South Korean chip heavyweight Samsung Electronics at 0.93%, while SK Hynix reversed course to gain 0.73%. Taiwan's TSMC, the world's largest contract chip manufacturer, was marginally down. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "SoftBank leads decline in Japanese tech stocks as worries over AI spending spill over to Asia ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108243357-1766021737886-gettyimages-2197342650-dsc07433_qrvvahai.jpeg?v=1766021768&w=1920&h=1080"
      ],
      "datePublished": "2025-12-18T02:32:16.000Z",
      "dateModified": "2025-12-18T02:32:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump vowed to block tankers carrying Venezuela's oil — nearly a dozen are at sea right now",
    "url": "https://www.cnbc.com/2025/12/17/trump-venezuela-tankers-oil.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108240057-1765392638190-gettyimages-2248656870-VENEZUELA_AIRSPACE.jpeg?v=1765991656&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-17T18:23:15.000Z",
    "description": "A U.S. military helicopter flies near an oil tanker during a raid described by U.S. Attorney General Pam Bondi as its seizure by the United States off",
    "body": "A U.S. military helicopter flies near an oil tanker during a raid described by U.S. Attorney General Pam Bondi as its seizure by the United States off the coast of Venezuela, Dec. 10, 2025, in a still image from video. U.S. Attorney General | Via ReutersAt least 34 U.S.-sanctioned oil tankers with a history of carrying Venezuelan oil are currently at sea in the Caribbean, according to a new analysis obtained by CNBC on Wednesday.And at least 12 of those tankers appear to be filled with crude oil from Venezuela, according to vessel location data from Kpler, a global trade intelligence company. One of the tankers, Skipper, was seized by the U.S. forces in the Caribbean last week and was being taken to the United States.Kpler provided the analysis a day after President Donald Trump vowed to impose a \"complete and total blockade\" on sanctioned oil tankers moving in and out of Venezuela. Trump also deemed the nation's ruling Maduro regime a foreign terrorist organization.The U.S. is expected to block only sanctioned tankers carrying oil from Venezuela, not similar vessels that have other nations' crude, including oil from Iran and Russia, according to Kpler.\"In light of President Trump's recent announcement, these tankers may be exposed to heightened scrutiny and potential enforcement actions by U.S. authorities,\" Dimitris Ampatzidis, senior risk and compliance Analyst at Kpler, told CNBC.In a separate report to clients on Wednesday, Kpler said that a blockade of Venezuelan oil should not lead to higher crude prices.Location of U.S. sanctioned Venezuelan Tankers. Green colored are tankers filled with Venezuelan oil, Orange colored are the empty tankers.Kpler\"The move has so far failed to provide a meaningful boost to oil prices or to overturn underlying fundamentals, largely because the market is two-tiered and even the sanctioned segment remains crowded,\" Kpler's report said.Oil prices rallied by nearly 2% on Wednesday.Chevron is the only company authorized by the United States to carry Venezuelan crude to the U.S.\"Oil bound for the US under Chevron's license could continue to flow,\" Kpler's report said.\"This suggests that Venezuelan supply to sanctioned markets would be disrupted, while volumes destined for the US would remain intact, with China- and Cuba-bound cargoes bearing the brunt of the impact.\"Besides Skipper, the 11 sanctioned tankers that appear to be carrying Venezuelan crude are Star Twinkle 6, Hyperion, Boceanica, Lydya N, Bandra, Soldier, Avril, Phenix VI, Manuela Saenz, Dianchi and Baisha.\"In recent years, some of these vessels engaged in so-called AIS spoofing to obscure their locations,\" said Matt Smith, head U.S. analyst for Kpler. \"With their AIS switched off, the real location of certain vessels was hidden, and while dark, there were multiple ship-to-ship transfers of cargo.\"Track of the 12 U.S.-sanctioned Venezuelan tankers in 2025MarineTrafficVenezuela has produced around 900,000 barrels of crude oil and condensate so far in 2025, accounting for roughly 1% of the total global supply. Kpler data indicates China buys about 76% of Venezuela's output.The U.S. has imported around 17% of Venezuela's output in 2025. That is about half of the percentage of output imported in 2024. Cuba, Spain and Italy are the other significant customers of Venezuela's oil.\"Cargoes bound for the US are expected to remain intact, while China and Cuba are likely to seek substitutes from Russia and Iran,\" Kpler's report noted.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump vowed to block tankers carrying Venezuela's oil — nearly a dozen are at sea right now",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108240057-1765392638190-gettyimages-2248656870-VENEZUELA_AIRSPACE.jpeg?v=1765991656&w=1920&h=1080"
      ],
      "datePublished": "2025-12-17T18:23:15.000Z",
      "dateModified": "2025-12-17T18:23:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "U.S. admits liability in Army helicopter collision with American Airlines jet that killed 67 people",
    "url": "https://www.cnbc.com/2025/12/17/us-army-helicopter-collision-american-airlines-jet.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108095304-1738276675978-gettyimages-2196182568-250130-G-LB502-1015.jpeg?v=1738276943&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-18T02:56:04.000Z",
    "description": "(EDITORS NOTE: Image contains graphic content)  In this U.S. Coast Guard handout, the Coast Guard investigates aircraft wreckage on the Potomac River ",
    "body": "(EDITORS NOTE: Image contains graphic content)  In this U.S. Coast Guard handout, the Coast Guard investigates aircraft wreckage on the Potomac River on Jan. 30, 2025 in Washington, DC. Handout | Getty Images News | Getty ImagesThe United States government admitted liability in the deadly midair collision in January between an Army Black Hawk helicopter and an arriving American Airlines regional jet over the Potomac River that killed all 67 people aboard the two aircraft.\"The United States admits that it owed a duty of care to Plaintiffs, which it breached, thereby proximately causing the tragic accident on January 29, 2025,\" the Justice Department said in a court filing on Wednesday.American Eagle Flight 5342 from Wichita, Kansas was approaching Ronald Reagan Washington National Airport at an altitude of about 300 feet when a U.S. Army Black Hawk helicopter carrying three people collided with the commercial jetliner.The Jan. 29 crash was the worst air disaster in the U.S. since 2001 and prompted restrictions on helicopter flights around Ronald Reagan Washington National Airport, where the airspace is one of the most congested in the country,The National Transportation Safety Board, which is leading the crash investigation, criticized the FAA during a hearing over the summer about the crash for failing to address safety risks in the area as well as chronic staffing shortages.The crew of the U.S. army helicopter failed to avoid the American plane, which was operated by the carrier's subsidiary PSA Airlines, the Justice Department said in the filingThe crew also didn't abide by altitude restrictions in the area, the Justice Department said in its filing. It admitted that the Federal Aviation Administration's air traffic controllers failed to keep aircraft apart and issue alerts when planes were in proximity to one another.The FAA and the Army didn't immediately comment.American Airlines didn't immediately respond to a request for comment. The airline is also named a defendant in the lawsuit brought by the family of one of the crash victims, which was filed in U.S. District Court in Washington.Read more CNBC airline newsFrontier Airlines replaces longtime CEO Barry Biffle with carrier's presidentSouthwest CEO says airline 'actively pursuing' network of airport loungesDelta says government shutdown cost it $200 million, but forecasts strong travel demand into 2026",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "U.S. admits liability in Army helicopter collision with American Airlines jet that killed 67 people",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108095304-1738276675978-gettyimages-2196182568-250130-G-LB502-1015.jpeg?v=1738276943&w=1920&h=1080"
      ],
      "datePublished": "2025-12-18T02:56:04.000Z",
      "dateModified": "2025-12-18T02:56:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Micron forecasts surging revenue as computer memory demand for AI remains high",
    "url": "https://www.cnbc.com/2025/12/17/micron-q1-earnings-forecast-memory-demand-ai.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108242674-1765922857470-gettyimages-2251668534-MICRON_EARNS.jpeg?v=1765923049&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-17T22:24:56.000Z",
    "description": "The Micron Technology offices in San Jose, California, US, on Tuesday, Dec. 16, 2025. David Paul Morris | Bloomberg | Getty ImagesMicron Technology re",
    "body": "The Micron Technology offices in San Jose, California, US, on Tuesday, Dec. 16, 2025. David Paul Morris | Bloomberg | Getty ImagesMicron Technology reported fiscal first-quarter results on Wednesday that beat Wall Street expectations for sales and earnings per share, and provided a strong forecast for the current quarter.Micron shares rose over 7% in extended trading.Here's how the memory maker did versus LSEG consensus estimates:Earnings per share: $4.78, adjusted, versus $3.95 estimatedRevenue: $13.64 billion vs. $12.84 billion estimatedIn the second quarter, Micron said it expected about $18.70 billion of revenue in the current quarter, versus $14.20 billion expected by LSEG. It said adjusted earnings per share would be about $8.42, blowing away expectations of $4.78 per share.\"This growth in AI data center capacity is driving a significant increase in demand for high-performance and high-capacity memory and storage. Server unit demand has strengthened significantly,\" Micron CEO Sanjay Mehrotra said on an earnings call with analysts, adding that the company sees that server units grew in the \"high teens\" in 2025.Micron had $5.24 billion of net income during the first quarter, or $4.60 per share, versus $1.87 billion in the year-ago period, or $1.67 per share. Overall revenue surged 57% on a year-over-year basis. Micron makes memory and solid-state storage for computers. Those semiconductors have been in short supply in recent months as the artificial intelligence infrastructure boom requires massive amounts of both kinds of chips. Stock Chart IconStock chart iconMicron year-to-date stock chart.The high demand for memory has driven Micron shares higher, up 168% in 2025.Micron is one of three companies that make the high-bandwidth memory needed for AI applications. For example, Micron's memory is used in large quantities in AMD's latest AI chips. Micron said it did $5.28 billion in cloud memory sales, which doubled on an annual basis. The chipmaker reported $2.38 billion in core data center sales, up only 4% year-over-year. The company said both business units were driven by higher pricing. Earlier this month, Micron said it would stop selling memory and other parts directly to consumers, to preserve supply for AI chips and data centers. Read more CNBC tech newsApple punted on AI this year. Next year will be criticalOpenAI in talks with Amazon about investment that could exceed $10 billionShares of Chinese chipmaker MetaX soar nearly 700% in blockbuster Shanghai debutAlphabet-owned Waymo in talks to raise $15 billion in funding",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Micron forecasts surging revenue as computer memory demand for AI remains high",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108242674-1765922857470-gettyimages-2251668534-MICRON_EARNS.jpeg?v=1765923049&w=1920&h=1080"
      ],
      "datePublished": "2025-12-17T22:24:56.000Z",
      "dateModified": "2025-12-17T22:24:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump announces 'warrior dividend' of $1,776 to every U.S. soldier in primetime speech",
    "url": "https://www.cnbc.com/2025/12/17/watch-trump-white-house-address.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108243368-1766024406249-gettyimages-2251825190-AFP_88GV9XD.jpeg?v=1766024438&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-18T03:21:39.000Z",
    "description": "President Donald Trump, in a rare televised primetime address to the nation on Wednesday night, announced a plan to send more than a million members o",
    "body": "President Donald Trump, in a rare televised primetime address to the nation on Wednesday night, announced a plan to send more than a million members of the U.S. military $1,776 as a \"warrior dividend.\"\"Because of tariffs, along with the just-passed 'One Big Beautiful Bill,' tonight I am also proud to announce that more than …1,450,000 military service members will receive a special warrior dividend before Christmas,\" Trump said in his address from the White House Diplomatic Reception Room.\"And the checks are already in the mail,\" he said.Trump began his speech by blasting his predecessor, former President Joe Biden, saying that \"I inherited a mess\" when he returned to the White House last January. \"And I am fixing it,\" he said.Trump highlighted his administration's efforts to seal the Southern border, bring down costs, and strengthen U.S. foreign policy. \"Our country was ready to fail, totally fail. Now we're the hottest country anywhere in the world,\" Trump said.US President Donald Trump addresses the nation from the Diplomatic Reception Room of the White House in Washington, DC, on December 17, 2025. Doug Mills | Afp | Getty ImagesThe address came as Trump's approval ratings are sagging across the board, on issues ranging from immigration to inflation, and as Republicans seek to hold on to majorities in the House and Senate in the 2026 midterm elections.\"We're bringing our economy back from the brink of ruin,\" Trump said during the address.But the economy, once a selling point for the president, has become a vulnerability as his sweeping tariffs have caused uncertainty and led to increased costs for some consumers and businesses.Trump recently called growing concerns about affordability a \"Democratic hoax\" and, in a Politico podcast this month, gave the economy a grade of \"A plus plus plus plus plus.\"Meanwhile, according to CNBC's All-America Economic Survey, 66% of Americans polled this month disapproved of Trump's handling of inflation, which is ticking up. In April, his disapproval rate on inflation was at 60%. Trump's economic approval rating is 36% and his overall approval rating is just 38%, according to a Marist poll released on Wednesday.Democrats have sought to hammer Trump on the economy.A group of Senate Democrats on Wednesday held a press conference on affordability.\"Costs are skyrocketing, and Democrats in 2026, you'll be hearing from us about costs over and over and over again,\" Senate Minority Leader Chuck Schumer, D-N.Y., said. \"On the contrary, Donald Trump tonight is going to try to talk about his accomplishments, but it's going to be a very short speech.\"Read more CNBC politics coverageTrump sues BBC for $10 billion, claims defamation from Panorama documentaryPentagon takes big stake in new Korea Zinc refinery in Tenn., gets 10% of companyNew Trump tariffs collection hits $200 billion, Customs saysFormer Instacart employee says she was fired over her Democratic congressional campaignUkraine peace talks progressing, Russia open to EU membership, U.S. officials sayNew York AG sues UPS for allegedly shorting Christmas season workers' wagesTrump admin to hire 1,000 specialists for 'Tech Force'Trump doubles down on Rob Reiner criticism after killing; director's son in custodyTSA is giving airline passenger data to ICE for deportation push: NYTTrump's AI order may be 'illegal,' Democrats and consumer advocacy groups claimTrump sued by preservation group seeking to halt White House ballroom projectTrump says 'no big deal' after new Epstein photos showing him releasedPutin can fund war for years, ex-official says as Trump's resolve is testedIndiana redistricting bill that Trump demanded defeated in state SenateHouse passes INVEST Act to ease investment standards, boost capital in marketsDOJ fails again to indict New York AG James, a Trump target: ReportsTrump 'sells out' U.S. national security with Nvidia chip sales to China: WarrenTrump pushes for top prosecutor nominee Halligan after Comey, James cases tossedTrump willing to seize more oil tankers off Venezuela coast: White HouseSeized tanker will go to U.S. port, Trump admin intends 'to seize the oil'GOP lawmakers seek Trump aid for agricultural equipment after tariff pressureTrump says Fed could have 'at least doubled' latest interest rate cut'Spoof' ship: Seized oil tanker hid location, visited Iran and VenezuelaTrump admin touts pulling 9,500 truckers off road for failing English testsSwiss government says new 15% U.S. tariff ceiling retroactive to mid-NovemberHomeland Security Dept. buying Boeing 737s for ICE deportationsTrump officials move to end student loan payment pause for millions of borrowersJudge unseals Ghislaine Maxwell grand jury materials, citing Epstein files actUkraine at 'critical moment' in war as European allies ramp up pressure on RussiaDemocrats establish AI working group as industry bolsters DC presenceEx-Trump lawyer Habba resigns as NJ U.S. attorney after disqualificationDuring the address, Trump projected \"the largest tax refund season of all time\" thanks to the tax and spending package he signed into law over the summer.The president also highlighted his foreign policy successes, making the questionable claim that he has ended eight wars since taking office and pointing to his aggressive posture toward Venezuela.\"Drugs brought in by ocean and by sea are now down 94%,\" Trump said.Beginning in September, the Trump administration began striking alleged drug boats in the Eastern Pacific and the Caribbean. Trump claimed in October without evidence that each of the boats is \"responsible for the death of 25,000 American people, and the destruction of families.\" As Trump's speech was about to begin, the U.S. Southern Command announced on X that it had conducted a strike on a vessel in the Eastern Pacific that was \"engaged in narco-trafficking operations.\" Four men aboard the boat were killed, U.S. Southern Command said.According to the Government Accountability Office, fentanyl is the primary cause of overdose deaths in the U.S. and mostly comes from China and Mexico through the Southern border. On Tuesday, Trump designated the Venezuelan government a \"terrorist\" organization and ordered a \"complete and total\" blockade of sanctioned oil tankers moving in and out of the country. He told Politico last week that he would not rule out a ground invasion of Venezuela.\"We have the most powerful military anywhere in the world and it's not even close. I've restored American strength,\" Trump said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump announces 'warrior dividend' of $1,776 to every U.S. soldier in primetime speech",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108243368-1766024406249-gettyimages-2251825190-AFP_88GV9XD.jpeg?v=1766024438&w=1920&h=1080"
      ],
      "datePublished": "2025-12-18T03:21:39.000Z",
      "dateModified": "2025-12-18T03:21:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Delta president Glen Hauenstein, who helped turn airline into industry profit leader, to retire in February",
    "url": "https://www.cnbc.com/2025/12/17/delta-air-lines-president-glen-hauenstein.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108243221-1766003032115-gettyimages-2245813826-DELTA_CENTENNIAL_NYSE.jpeg?v=1766003103&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-17T21:39:17.000Z",
    "description": "Glen Hauenstein, president of Delta Air Lines Inc., left, and Ed Bastian, chief executive officer of Delta Air Lines Inc., right, ring the opening bel",
    "body": "Glen Hauenstein, president of Delta Air Lines Inc., left, and Ed Bastian, chief executive officer of Delta Air Lines Inc., right, ring the opening bell on the floor of the New York Stock Exchange (NYSE) in New York, US, on Wednesday, Nov. 12, 2025. Michael Nagle | Bloomberg | Getty ImagesDelta Air Lines President Glen Hauenstein, who propelled the carrier to become the industry's profit leader and championed the airline's lucrative embrace of travelers willing to spend a little extra for a more luxurious travel experience, is retiring in February.\"Glen and his team have been central to Delta's premium strategy, as we evolved over two decades to become the airline of choice for travelers who want to invest in great experiences in the air and on the ground,\" CEO Ed Bastian said in a note to employees. \"I could not have asked for a better co-pilot to help lead Delta in becoming the best performing airline in the world.\"Delta is promoting Joe Esposito, who has been at Delta for 35 years — most recently as senior vice president of network planning, pricing and revenue management — to executive vice president and chief commercial officer.Hauenstein, 64, has been with Delta since 2005 and was named to his current role in 2016. He was previously executive vice president and chief revenue officer at the airline. He will become a strategic advisor until the end of 2026. Read more CNBC airline newsFrontier Airlines replaces longtime CEO Barry Biffle with carrier's presidentSouthwest CEO says airline 'actively pursuing' network of airport loungesDelta says government shutdown cost it $200 million, but forecasts strong travel demand into 2026During his tenure, Hauenstein grew Delta's international network and helped the airline identify new ways to earn more per seat, in part by successfully getting customers to pay for first-class seats it used to give away for free. In October, Delta said that premium-travel revenue would overtake sales from main cabin next year.At times, Delta's strategies proved successful with too many customers. Overcrowding in its Sky Club airport lounges prompted the airline to raise the entry bar to get rid of unsightly lines.\"Glen has played a significant role in Delta's transformation since its [2005] bankruptcy filing,\" said Henry Harteveldt, founder of Atmosphere Research Group, a travel-industry consulting firm. Hauenstein pushed for the now-industry standard to move the loyalty program to reward spending and not just miles flown and encouraged Delta to invest in better pricing and revenue software, he said.Harteveldt added that Delta must also figure out when it will upgrade its cabin interiors and make sure it's not alienating customers, some of whom have complained about high redemption rates for frequent flyer miles.While Delta continues to generate more profit than other carriers, competitors like United Airlines have been investing heavily in revamped cabins, complimentary fast Wi-Fi and new planes. American Airlines, which had been late to the luxury travel boom, is also investing in better products on board and at the airport.Along with leaning into affluent consumers, Hauenstein had also noted a trend of wealthy baby boomers who were willing to travel.\"Being a baby boomer, I can say this without fear of retribution. There's only so much time to go to Europe or almost so much time to go see Australia or Japan,\" he said on an earnings call in April. \"And so you've got this wealth effect where this cohort of retirees is wealthier than any other cohort even with the most recent rundown, and they want to go do things.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Delta president Glen Hauenstein, who helped turn airline into industry profit leader, to retire in February",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108243221-1766003032115-gettyimages-2245813826-DELTA_CENTENNIAL_NYSE.jpeg?v=1766003103&w=1920&h=1080"
      ],
      "datePublished": "2025-12-17T21:39:17.000Z",
      "dateModified": "2025-12-17T21:39:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "FCC chief Brendan Carr tells Senate that his agency is 'not formally ... independent' ",
    "url": "https://www.cnbc.com/2025/12/17/fcc-carr-senate-jimmy-kimmel-kirk.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108243027-1765988806615-gettyimages-2251772330-fcc_BC_160_121725JPG.jpeg?v=1765997696&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-17T19:55:29.000Z",
    "description": "Chairman of the Federal Communications Commission Brendan Carr testifies during the Senate Commerce, Science, and Transportation Committee hearing on ",
    "body": "Chairman of the Federal Communications Commission Brendan Carr testifies during the Senate Commerce, Science, and Transportation Committee hearing on oversight of the FCC in the Dirksen Senate Office Building, Dec. 17, 2025.Bill Clark | Cq-roll Call, Inc. | Getty ImagesFederal Communications Commission Chairman Brendan Carr told a Senate committee on Wednesday that his agency is \"not formally ... independent.\"Shortly after Carr made that statement, the FCC apparently removed the word \"independent\" in a description of the agency's work on its website.Carr's appearance before the Senate Commerce, Science and Transportation Committee was his first since making controversial remarks in September that led ABC to briefly suspend Jimmy Kimmel's late-night talk show. Carr, a Trump appointee, made headlines in September over his response to comments Kimmel made following the killing of conservative commentator Charlie Kirk. Carr responded with a threat aimed at Disney, which owns ABC.\"We can do this the easy way or the hard way,\" Carr told right-wing commentator Benny Johnson at the time. \"These companies can find ways to take action on Kimmel, or there is going to be additional work for the FCC ahead.\"Democrats on the panel pressed him on Wednesday over his criticism of Kimmel and his threats to companies over speech by their TV hosts. Those Democrats painted Carr, who was appointed by President Donald Trump, as a threat to free speech and questioned whether the FCC was an independent arbiter, not beholden to the politics of a given presidential administration.And FCC Commissioner Anna Gomez, who was appointed by former President Joe Biden, told the panel that under Carr, the agency is working to \"intimidate government critics, pressure media companies and challenge the boundaries of the First Amendment.\"Sen. Ben Ray Lujan, D-N.M., asked Carr: \"Yes or no ... is the FCC an independent agency?\" \"On your website, it just simply says, man, the FCC is independent. This isn't a trick question,\" Lujan added.\"The FCC is not formally an independent agency,\" Carr responded. Asked about the deletion of the word \"independent\" after Carr's comments, an FCC spokesperson said via email on Wednesday:  \"With the change in Administration earlier this year, the FCC's website and materials required updating. That work continues to ensure that they reflect the positions of the agency's new leadership.\"During the hearing, Sen. Amy Klobuchar, D-Minn., asked Carr, \"Do you think it is appropriate to use your position to threaten companies that broadcast political satire?\"Carr replied, \"I think any licensee that operates on the public airwaves has a responsibility to comply with the public interest standard, and that's been the case for decades.\"Federal law defining the public interest standard states that broadcast licensees must act in the \"public interest, convenience or necessity.\"\"You are not reinvigorating the public interest standard. You are weaponizing the public interest standard,\" Sen. Ed Markey, D-Mass., told Carr.\"That is what the Carr FCC is doing every single day,\" said Markey, who urged Carr to resign.Sen. Ted Cruz, the Texas Republican who chairs the Commerce Committee, compared Carr to a \"mob boss\" after Kimmel was suspended Read more CNBC politics coverageTrump sues BBC for $10 billion, claims defamation from Panorama documentaryPentagon takes big stake in new Korea Zinc refinery in Tenn., gets 10% of companyNew Trump tariffs collection hits $200 billion, Customs saysFormer Instacart employee says she was fired over her Democratic congressional campaignUkraine peace talks progressing, Russia open to EU membership, U.S. officials sayNew York AG sues UPS for allegedly shorting Christmas season workers' wagesTrump admin to hire 1,000 specialists for 'Tech Force'Trump doubles down on Rob Reiner criticism after killing; director's son in custodyTSA is giving airline passenger data to ICE for deportation push: NYTTrump's AI order may be 'illegal,' Democrats and consumer advocacy groups claimTrump sued by preservation group seeking to halt White House ballroom projectTrump says 'no big deal' after new Epstein photos showing him releasedPutin can fund war for years, ex-official says as Trump's resolve is testedIndiana redistricting bill that Trump demanded defeated in state SenateHouse passes INVEST Act to ease investment standards, boost capital in marketsDOJ fails again to indict New York AG James, a Trump target: ReportsTrump 'sells out' U.S. national security with Nvidia chip sales to China: WarrenTrump pushes for top prosecutor nominee Halligan after Comey, James cases tossedTrump willing to seize more oil tankers off Venezuela coast: White HouseSeized tanker will go to U.S. port, Trump admin intends 'to seize the oil'GOP lawmakers seek Trump aid for agricultural equipment after tariff pressureTrump says Fed could have 'at least doubled' latest interest rate cut'Spoof' ship: Seized oil tanker hid location, visited Iran and VenezuelaTrump admin touts pulling 9,500 truckers off road for failing English testsSwiss government says new 15% U.S. tariff ceiling retroactive to mid-NovemberHomeland Security Dept. buying Boeing 737s for ICE deportationsTrump officials move to end student loan payment pause for millions of borrowersJudge unseals Ghislaine Maxwell grand jury materials, citing Epstein files actUkraine at 'critical moment' in war as European allies ramp up pressure on RussiaDemocrats establish AI working group as industry bolsters DC presenceEx-Trump lawyer Habba resigns as NJ U.S. attorney after disqualification\"That's right out of a mafioso coming into a bar going, 'Nice bar you have here, it'd be a shame if something happened to it,'\" Cruz said on his podcast in September.\"I like Brendan Carr. He's a good guy, he's the chairman of the FCC. I work closely with him, but what he said there is dangerous as hell,\" Cruz said at the time.On Wednesday, Cruz called Kimmel \"angry, overtly partisan and profoundly unfunny.\" But the senator also said that the government should not be \"arbitrating truth or opinion.\" Cruz said Democrats ignored First Amendment violations under the Biden administration, saying it tried to remove conservative figures from social media over what were deemed false statements related to Covid-19. \"Government officials threatening adverse consequences for disfavored content is an unconstitutional coercion that chills protected speech,\" Cruz said.Asked if he bore any responsibility for Kimmel's suspension, Carr said: \"They made these business decisions on their own. The record is clear on this.\"ABC's suspension of Kimmel lasted less than a week after a public backlash over the move.Shortly before the network suspended the host, Nexstar Media Group said it would preempt his show on all of its ABC affiliates. Nexstar is seeking FCC approval for its planned $6.2 billion merger with Tegna.A group of House and Senate Democrats — including Sen. Jacky Rosen, a Nevada Democrat on the Commerce panel — sent a letter to Carr this week urging the FCC to closely scrutinize the proposed merger and warning it would create \"a media giant that would far outstrip its competitors.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "FCC chief Brendan Carr tells Senate that his agency is 'not formally ... independent' ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108243027-1765988806615-gettyimages-2251772330-fcc_BC_160_121725JPG.jpeg?v=1765997696&w=1920&h=1080"
      ],
      "datePublished": "2025-12-17T19:55:29.000Z",
      "dateModified": "2025-12-17T19:55:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]